[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Dembele finally extends stay at Barcelona till 2024",
    "summarized_story": "French international winger Ousmane Dembele, whose contract with Barcelona expired last month, ended six months of speculation about his future by agreeing to ‘rejoin’ the Catalan side until 2024, the club announced on Thursday.\n“FC Barcelona and the player Ousmane Dembele have reached an agreement for a contract until 30 June 2024,” said a statement on the club website.\nIn January, Xavi warned Dembele that he had to “extend” his contract or “leave” the club but the French player warned he would not “give in to blackmail”.\nAccording to the press, Dembele, who joined Barcelona in 2017 from Borussia Dortmund, agreed to lower his salary expectations to fit in with a club that remains in economic difficulties.\nWith the arrivals of Franck Kessie, Andreas Christensen and Raphinha, the resolution of the Dembele affair marks the fourth good catch for the Catalans this summer."
  },
  {
    "headline": "Groups seek release of Nigerian political detainees",
    "summarized_story": "A Coalition Of Civil Society, Workers And Human Rights Defenders has called on the Federal Government to release all political detainees across the country including the leader of the Indigenous People of Biafra, Nnamdi Kanu.\nThe coalition which stated this on Thursday, during the unveiling of its South-East headquarters in Enugu, urged the Federal Government to instead engage those detainees in constructive discourse instead of force of arm.\nAddressing journalists shortly after conducting them around the offices, the Convener of the Coalition and President, International Solidarity for Peace and Human Rights Initiative, Comrade Osmond Ugwu, lamented the impunity with which the government and security agencies abused human rights in Nigeria, with a lens on the South-East region.\nFlanked by Secretary of the Coalition, Comrade Chukwudi Aniachuna, and other leaders, Ugwu said that human rights violations have increased exponentially in Nigeria after the national protest against police brutality codenamed #EndSARS rather than decreasing.\n“They should also make sure that they vote according to their conscience and stay behind to endure that their votes are counted and results announced."
  },
  {
    "headline": "ASUU Strike: FG has completely abandoned education — Ebo",
    "summarized_story": "According to Ebo, “When a government sets committee after committee and disowns their recommendations, you know that the government lacks coordination.\n“What is certain is that there is no coordination between the Ministry of Labour and the Ministry of Education over the ongoing ASUU strike.\nThe committee has reached some agreements with ASUU and presented the proposals to the government.\nThe government on the other hand deploys the hunger strategy on the assumption that the brute force of hunger would force the striking lecturers back to the classroom.\n“Let me tell you how worthless a lecturer’s salary is today."
  },
  {
    "headline": "Tinubu/Shettima ticket: Let’s put religion aside, but Nigeria’s development — APC Chieftain",
    "summarized_story": "By James Ogunnaike, AbeokutaA Chieftain of the ruling All Progressives Congress (APC) in Ogun State, Mr. Dennis Ogunnaike has called on Nigerians to put aside religion sentiment, but support the Asiwaju Bola Tinubu and Senator Kashim Shettima joint presidential ticket.\nWhile describing the joint ticket of Asiwaju Bola Tinubu and Senator Kashim Shettimaas formidable force for post 2023 developmental achievement, he said all progressive minded Nigerians should support them.\nWhile congratulating Shettima on his emergence as the APC Vice Presidential candidate, Ogunnaike described Shettima as a detribalised and visionary leader that has what it takes to take the country to the next level.\nAsiwaju Bola Tinubu made a right choice”.\nHe said that the Vice Presidential candidate was a forthright, vocal and outspoken politician who speaks truth to power."
  },
  {
    "headline": "Miners cry out over unaccessible N5bn fund with BoI",
    "summarized_story": "Moves to establish solid minerals buying centresBy Gabriel Ewepu – AbujaMiners under the auspices of Miners Association of Nigeria, MAN, Wednesday, cried out over unaccessible N5 billion fund with the Bank of Industry, BoI, after five years.\nSpeaking with Vanguard about the plight of miners in the country, the acting National President, MAN, Musa Muhammad, said some of their members who even applied have died without receiving the money.\nHowever, he (Muhammad) disclosed that the association is strategizing by creating solid minerals buying centers in the six geopolitical zones of the country.\n“We know the government is speaking on solid minerals buying centres but we want to take the bull by the horn”, he said.\nSo this PPP model has to be used, introduced to solid minerals sector, if you really want to diversify the economy.”Vanguard News Nigeria"
  },
  {
    "headline": "Breaking: ECOWAS Court declares Buhari’s Twitter ban unlawful",
    "summarized_story": "It would be recalled that following the deletion of President Muhammadu Buhari’s tweet, the Minister of Information and Culture, Lai Mohammed announced the suspension of Twitter in Nigeria.\nThe government also threatened to arrest and prosecute anyone using Twitter in the country, while the National Broadcasting Commission (NBC) asked all broadcast stations to suspend the patronage of Twitter.\nBut in the judgment delivered today, the ECOWAS court declared that it has the jurisdiction to hear the case, and that the case was therefore admissible.\nThe Court also ordered the Buhari administration to bear the costs of the proceedings and directed the Deputy Chief Registrar to assess the costs accordingly.\nThis implies a free press and other media able to comment on public issues without censor or restraints, and to inform public opinion."
  },
  {
    "headline": "FG to pick substantive AGF from 14 shortlisted 14 directors",
    "summarized_story": "File: President Muhammadu BuhariBy Dirisu YakubuABUJA- The process for the appointment of a new Accountant General of the Federation, AGF has begun as the federal government, Wednesday, shortlisted 14 directors on Grade Level 17 in the federal civil service.\nThe exalted seat became vacant following the suspension of the immediate past AGF, Ahmed Idris over allegations of financial fraud to the tune of N80 billion.\nOn the list for consideration are Chizea Onochie Peter, Jafiya Shehu Muhammad Murtala Saleh, and Lydia all from the Office of the AGF.\nAlso shortlisted are Mohammed Aminu YarAbba (Federal Fire Service), Samuel Waziri (Ministry of Agric and Rural Development), Mahmud Adam Kambari (North East Development Commission), Mohammed Magaji Doho (Federal Ministry of Education), Mufutahu Bukolah (Federal Ministry of Transportation), and Yusuf Abdullahi Musa (Ministry of Information and Culture).\nMany traced Anamekwe’s fate to his disclosure that the federal government was borrowing to pay salaries."
  },
  {
    "headline": "Police set up taskforce to recover spy vehicle number plates in Anambra",
    "summarized_story": "Police in Anambra State have vowed to recover all spy vehicle number plates in the state.\nThe state police command said this is coming sequel to a directive by the Inspector-General of Police, Baba Alkali to ban the use of the number plates.\nA press release by the state police command’s spokesperson, DSP Toochukwu Ikenga stated that the Commissioner of Police, CP Echeng Echeng has set up a task force to recover every spy vehicle number plate in the state.\nRecall that the IGP recently banned the use of police spy vehicle number plates across the country.\nIkenga said the Commissioner of Police, during a meeting with area commanders and heads of various units in the state on Thursday, established an enforcement team to ensure full recovery of all police spy plate numbers in Anambra State."
  },
  {
    "headline": "Biafra: Suspend South-East visit – IPOB tells British envoy",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has advised the British High Commissioner to Nigeria, Catriona Laing, to suspend her planned visit to the South-Eastern part of the country.\nIPOB made the call after it raised the alarm over an alleged plot to assassinate Laing during her visit to the South-East.\nAccording to the proscribed group, which claimed it got the information through its intelligence arm, the M-Branch, the idea is to assassinate the envoy in the South-East and blame it on its members.\nThis was revealed in a statement by IPOB’s spokesman, Emma Powerful, on Thursday.\n“The leadership of IPOB do hereby advise that Ms Catriona Liang, must as a matter of life and death suspend all her planned activities involving travels within Biafran Territories.”"
  },
  {
    "headline": "BREAKING: Court dismisses Oyo Dep Gov, Olaniyan’s suit to stop impeachment",
    "summarized_story": "An Oyo State High Court has dismissed a suit filed by Mr. Rauf Olaniyan, the state Deputy Governor.\nThe Oyo State House of Assembly had a few weeks ago initiated an impeachment process against the deputy governor.\nThe court has, however, dismissed the suit filed by the deputy governor.\nAccording to Akintola, the lawmakers substantially complied with the provisions of Section 188 of the Constitution on the removal process.\nThe court said the lawmakers should continue with the removal process."
  },
  {
    "headline": "2023: Coalition demands more PVC registration centres in Southeast, says crowd overwhelming",
    "summarized_story": "The Coalition of South East Youth Leaders, COSEYL, has called on the National Chairman of the Independent National Electoral Commission, INEC, Professor Mahmood Yakubu, to provide more centres for the Permanent Voters Card, PVC, registration.\nPresident-General of the coalition, Goodluck Ibem who said he visited some centres on Wednesday, pointed out that there need to be at least 100 computers in each registration centre.\nIn a statement, Ibem called on the electoral body to extend the exercise to the various voting units in the South-East to alleviate some difficulties being faced by those eager to register.\n“Some people have to pay a high cost of transport fare to get to the INEC office for over a month without being able to register for the PVC.\n“As at the time we visited some of the centers, the INEC office has only 2 computers for the registration, meanwhile one computer can register only 60 persons per day when we have over 700 persons on ground for the registration."
  },
  {
    "headline": "Kashim Shettima: Devil must have pushed you to pick Muslim-Muslim ticket – Pastor Giwa to Tinubu",
    "summarized_story": "Senior Pastor of Awaiting The Second Coming Of Christ Ministry, Adewale Giwa, has said that it was the devil that pushed Bola Ahmed Tinubu into picking a Muslim running mate.\nAccording to Giwa, it takes a self-centered politician to go for a Muslim-Muslim ticket considering the political and religious atmosphere in Nigeria.\nGiwa said that Timubu and the APC must have concluded in their minds to manipulate Nigerians with a view to achieving their goals.\n“I listened to one of them a few days ago who said, ‘It’s a matter of time, Nigerians will put the noise over Muslim-Muslim ticket behind them’.\n“What do you want to achieve with your Muslim-Muslim ticket?"
  },
  {
    "headline": "JUST IN: Oyo Deputy Gov appeals judgement on impeachment proceedings The Nation Newspaper",
    "summarized_story": "JUST IN: Oyo Deputy Gov appeals judgement on impeachment proceedingsOyo Deputy Governor Rauf Olaniyan has appealed the judgement dismissing his suit against plans by Oyo Assembly to begin an impeachment process against him.\nHis Counsel, Chief Afolabi Fashanu, confirmed the development on Thursday.\nThe Nation reports Justice Ladiran Akintola on Thursday dismissed the suit, saying the defendants have not breached any constitutional provisions on the matter.\nDetails Shortly…"
  },
  {
    "headline": "Shettima ticket, by Oshiomhole The Nation Newspaper",
    "summarized_story": "What Nigerians should expect from Tinubu/Shettima ticket, by OshiomholeFormer Edo Governor Adams Oshiomhole has congratulated the All Progressives Congress (APC) presidential candidate, Asiwaju Bola Ahmed Tinubu for picking Sen. Kashim Shettima as his running mate.\nHe described the Tinubu/Shettima ticket as a balanced ticket for the party, noting that Tinubu’s track record and Shettima’s sterling qualities will spur the party to victory.\nOshiomhole spoke during an interview with TVC Breakfast Morning Show monitored by The Nation.\nWe have struggled to balance this religious issues in recent years.\n“It is a balanced ticket; balanced ticket in terms of competence, and their antecedents."
  },
  {
    "headline": "BREAKING: Court dismisses Oyo Deputy Gov's case The Nation Newspaper",
    "summarized_story": "Justice Ladiran Akintola of Oyo State High Court has dismissed a case filed by Deputy Governor Rauf Olaniyan over procedure to remove him from office by Oyo Assembly.\nThe court held that the lawmakers and all the defendants have not erred on the procedures taken.\nAccording to the Court, the originating summons filed by the claimant was purely legislative procedure and not judicial in line with the Constitution of the Federal Republic of Nigeria.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Court declines sacking Oyetola as Osun APC’s candidate The Nation Newspaper",
    "summarized_story": "A Federal High Court in Abuja has dismissed a suit filed by former Secretary to the Osun State Government, Moshood Adeoti, seeking to void the nomination of Governor Gboyega Oyetola as the governorship candidate of the All Progressives Congress (APC) Saturday’s governorship election.\nIn a judgment on Thursday, Justice Inyang Ekwo held among others, that the suit was an abuse of court process because it disclosed no cause of action.\nJustice Ekwo held that the suit falls within the internal affairs of the party on which the court could not intervene.\nThe judge also held that the suit was premature, because Adeoti failed to exhaust the internal dispute resolution mechanisms of the APC before approaching the court.\nThe judge added that Oyetola’s membership of the CECPC did qualify him as holding any office in the party, which is recognised by the APC’s constitution."
  },
  {
    "headline": "Akeredolu signs first amendment to Amotekun law The Nation Newspaper",
    "summarized_story": "The governor assured that the amended Law would enhance the security architecture of the state and help the Amotekun Corps to perform better.\nSimilarly, the Ondo State Executive Council has taken some far-reaching decisions to further shapen the course of governance for the well-being of people of the state.\nAkeredolu for assenting to the amendment to the law which established the Ondo State Security Network Agency, codenamed Amotekun.\nHe assured that the development would scale up the operational capacities of the state security outfit.\nAkeredolu, at the brief signing ceremony, which took place at the State Executive Council (SEC) Chambers warned against any political colouration of the outfit."
  },
  {
    "headline": "Nigeria’s Twitter ban unlawful, ECOWAS court rules",
    "summarized_story": "By Chinelo Obogo, LagosThe Community Court of Justice of the Economic Community of West African States (ECOWAS) has in a strong judgment, ruled that Nigeria’s ban on Twitter, a microblogging platform, was unlawful and inconsistent with the African Charter and the International Covenant on Civil and Political Rights.\n“ECOWAS Court in a strong judgment finds that the Nigerian Twitter ban was unlawful and inconsistent with the African Charter and the International Covenant on Civil and Political Rights.\nThe Court further ordered President Muhammadu Buhari’s administration to guarantee the non-repetition of the unlawful ban of Twitter and undertake legislative or other measures on the use of Twitter to enable the enjoy the freedom of expression.\nThe Court finally ordered the Federal Government to pay the cost incurred by the applicants in the proceedings.\nHowever, the Court made an order consolidating all the four cases marked as ECW/CCJ/APP/23/21, ECW/CCJ/APP/29/21, ECW/CCJ/APP/24/21, and ECW/CCJ/APP/26/21."
  },
  {
    "headline": "Judge’s absence stalls ruling on application to amend charges in OAU student murder trial",
    "summarized_story": "From Lateef Dada, OsogboThe ruling on an application by the prosecutor to amend the charges against the owner of Hilton Hotel, Ile-Ife, Rahmon Adedoyin, and six staff of the hotel involved in the alleged killing of Timothy Adegoke, a Master’s student of Obafemi Awolowo University (OAU), was stalled by the absence of Justice Adepele Ojo, who is handling the matter.\nThe parties on June 27 argued the amendment application brought before the court by Femi Falana, SAN, chamber, who is prosecuting the case.\nJustice Ojo adjourned to July 14 for ruling on the argument canvassed on whether to allow the prosecution to amend the charges or refused the amendment as prayed by the defence counsels.\nThe judge was said to have travelled out of the country when the matter came up and the case was further adjourned to July 20 when the judge is expected to have returned to the country."
  },
  {
    "headline": "Gunmen kill 1, abduct 3 in Boto village in Bauchi State – Police",
    "summarized_story": "Gunmen on Wednesday attacked Boto village in Tafawa Balewa Local Government Area of Bauchi State, killing one person and abducting three others.\n“We got a distress call that gunmen believed to be kidnappers invaded Boto village.\n“The Police Commissioner, Umar Sanda immediately directed the Divisional Police officer, Tafawa Balewa Division to swing into action.\nWakil said the command had in the past acted swiftly to rescue kidnapped victims and is ready to do same in this situation.\nThe spokesman also assured the family members that the kidnapped victims would be rescued and reunited with their families."
  },
  {
    "headline": "Court dismisses suit seeking Oyetola’s disqualification",
    "summarized_story": "A Federal High Court in Abuja on Thursday, dismissed a suit seeking the disqualification of Gov.\nDelivering judgment, Justice Inyang Ekwo, declared that the suit filed by a chieftain of the APC, Alhaji Moshood Olalekan Adeoti, against Oyetola was an abuse of court process.\nJustice Ekwo held that there was no iota of law supporting the plaintiff (Adeoti)’s process filed before the court.\nThe News Agency of Nigeria (NAN) reports that Adeoti, the plaintiff in the suit, filed the matter through his legal team led by Chiesonu Okpoko, SAN.\nIn the suit, the plaintiff listed the APC, Oyetola and Independent National Electoral Commission (INEC) as 1st, 2nd and 3rd defendants respectively."
  },
  {
    "headline": "UPDATED Impeachment: Oyo deputy gov heads for Appeal Court after losing at High Court",
    "summarized_story": "From Oluseye Ojo, IbadanThe deputy governor of Oyo State, Rauf Olaniyan, has headed for the Court of Appeal, after Justice Ladiran Akintola of an Oyo State High Court, sitting in Ibadan, dismissed the suit he filed to stop the state House of Assembly from removing him from office.\nCounsel to Olaniyan, Chief Afolabi Fashanu (SAN), said he has filed applications for notice of appeal and stay of execution of the judgment delivered by the lower court.\nGiving the judgment today, the High Court held that the House of Assembly has not breached the provisions of the constitution on the removal of governor or deputy governor.\nAccording to the court, the lawmakers substantially complied with the provisions of Section 188 of the Constitution on the removal process.\nThe court said the lawmakers should continue with the removal process."
  },
  {
    "headline": "Suspected Herders Kill Five in Benue Community – THISDAYLIVE",
    "summarized_story": "George Okoh in MakurdiNo fewer than five persons have been reportedly killed at Anter Mbalagh council ward of Makurdi Local Government Area of Benue State.\nThe incident, according to resident of the community who did not want to be mentioned, occurred on Monday when the attackers suspected to be herdsmen invaded the community.\nThe Special Adviser to the Governor on Security, Lt Col. Paul Hemba, (retd) confirmed two people killed.\n“Am not aware if the people killed were five but I have pictures of two dead people from the community,” Hemba said on the phone.\nWhen contacted, the State Command Public Relations Officer, Ms. Catherine Anene, said that she is yet to receive the report."
  },
  {
    "headline": "Alleged Sexual Assault: Baba Ijesha Knows Fate Today – THISDAYLIVE",
    "summarized_story": "Baba Ijesha was arraigned before the court on a six-count charge of indecent treatment of a child, defilement of a child, sexual assault by penetration, attempted sexual assault by penetration and sexual assault.\nJustice Oluwatoyin Taiwo had adjourned the case for judgment after the prosecution and defence counsel adopted their final written addresses.\nMartins said: “During cross-examination of the CCTV expert, Lawrence Ayeni, he confirmed that CCTV footage cannot be manipulated or tampered with.\nHe urged the court to accept the testimonies of the experts who gave their best to help resolve the case.\n“The defendant admitted to having been with the girl in both the incident that happened seven years ago and the one that happened in 2021."
  },
  {
    "headline": "Court Dismisses Suit Seeking Oyetola’s Disqualification – THISDAYLIVE",
    "summarized_story": "A Federal High Court in Abuja on Thursday, dismissed a suit seeking the disqualification of Gov.\nDelivering judgment, Justice Inyang Ekwo, declared that the suit filed by a chieftain of the APC, Alhaji Moshood Olalekan Adeoti, against Oyetola was an abuse of court process.\nJustice Ekwo held that there was no iota of law supporting the plaintiff (Adeoti)’s process filed before the court.\nThe News Agency of Nigeria (NAN) reports that Adeoti, the plaintiff in the suit, filed the matter through his legal team led by Chiesonu Okpoko, SAN.\nIn the suit, the plaintiff listed the APC, Oyetola and Independent National Electoral Commission (INEC) as 1st, 2nd and 3rd defendants respectively."
  },
  {
    "headline": "Innovator Launches Rainforest Protection Campaign in Bayelsa – THISDAYLIVE",
    "summarized_story": "Olusegun SamuelAward-winning electric car innovator and businessman, Azibaola Robert, has launched a campaign to protect the rainforest of the Niger Delta region, saying acts of deforestation and environmental degradation are pushing many wildlife species into extinction.\nThe Niger Delta is called the rainforest because when it rains in the communities here, it also rains in the Niger Delta region forests.\n“The Niger Delta has one of the largest rainforests in the world.\nThe largest rainforest is called the Amazon rainforest somewhere between Brazil and other South American nations.\nSurprisingly, you can’t find any furniture industry in this area, but can find them in areas that don’t have the rainforest like us here."
  },
  {
    "headline": "Osun PDP Alleges Plot to Kidnap Party Leaders – THISDAYLIVE",
    "summarized_story": "The ruling party’s plan, according to a statement made available THISDAY yesterday by Osun PDP Caretaker Committee Chairman, Dr Akindele Adekunle, was hatched ostensibly to confer undue advantage on the APC in the Saturday’s governorship election.\nHe posited that notable leaders of the PDP were already penciled down for arrest by security operatives with many others also tabled for wanton kidnap by political thugs purposely imported into Osun by the jittery APC.\nThis advice became imperative as many of the names submitted to them for harassment are respected community leaders, who are historical leaders and are emotionally attached to their various communities.\nWe are, however, convinced that such security heresy would not be possible without illicit involvement of formal security outfits like the police.\nWe wish to assure members and supporters of Osun PDP of our party’s capacity and readiness to protect their right as law abiding citizens."
  },
  {
    "headline": "BREAKING: Court Discharges, Acquits Two #BuhariMustGo Protesters Brutalised, Detained In Kogi For Pasting Anti-President Posters",
    "summarized_story": "A Magistrate Court sitting in Lokoja, Kogi State has struck out the suit against two anti-President Muhammadu Buhari.\nThe court, on Thursday, discharged and acquitted Larry Emmanuel and Anene Victor Udoka.\nThe court struck out the matter after a series of adjournments by the state without any iota of evidence presented against them.\nThus the suit: State v Anine Victor Udoka & Emmanuel Larry: Case No: CMCL/123m/2021 was thrown out of the window.\nIn April 2021, violent youths descended on the two middle-aged protesters who were pasting Buhari-Must-Go posters in Lokoja, the Kogi State capital."
  },
  {
    "headline": "BREAKING: Court Discharges, Acquits Two #BuhariMustGo Protesters Brutalised, Detained In Kogi For Pasting Anti-President Posters",
    "summarized_story": "A Magistrate Court sitting in Lokoja, Kogi State has struck out the suit against two anti-President Muhammadu Buhari.\nThe court, on Thursday, discharged and acquitted Larry Emmanuel and Anene Victor Udoka.\nThe court struck out the matter after a series of adjournments by the state without any iota of evidence presented against them.\nThus the suit: State v Anine Victor Udoka & Emmanuel Larry: Case No: CMCL/123m/2021 was thrown out of the window.\nIn April 2021, violent youths descended on the two middle-aged protesters who were pasting Buhari-Must-Go posters in Lokoja, the Kogi State capital."
  },
  {
    "headline": "BREAKING: ECOWAS Court Declares #TwitterBan in Nigeria Unlawful; Orders Buhari Government Never to Repeat Such Again",
    "summarized_story": "The Economic Community of West African States (ECOWAS) Court on Thursday declared the suspension of Twitter operations in June 2021 as unlawful and ordered the Nigerian Government not to give a similar order again.\nThis judgment was given in a suit filed by Chief Malcolm Emokiniovo Omirhobo, challenging the ban as a violation of his fundamental rights to freedom of expression, speech and association and other Nigerian nationals.\nSaharaReporters gathered the case filed by Malcolm was consolidated with other suits with a similar cause of action.\nFrom 5 June 2021 to 13 January 2022, the government of Nigeria officially banned Twitter, which restricted it from operating in the country.\nThe ban occurred after Twitter deleted tweets made by Buhari, warning the southeastern people of Nigeria, predominantly Igbo people, of a potential repeat of the 1967 Biafran Civil War due to the ongoing insurgency in Southeastern Nigeria."
  },
  {
    "headline": "BREAKING: ECOWAS Court Declares #TwitterBan in Nigeria Unlawful; Orders Buhari Government Never to Repeat Such Again",
    "summarized_story": "The Economic Community of West African States (ECOWAS) Court on Thursday declared the suspension of Twitter operations in June 2021 as unlawful and ordered the Nigerian Government not to give a similar order again.\nThis judgment was given in a suit filed by Chief Malcolm Emokiniovo Omirhobo, challenging the ban as a violation of his fundamental rights to freedom of expression, speech and association and other Nigerian nationals.\nSaharaReporters gathered the case filed by Malcolm was consolidated with other suits with a similar cause of action.\nFrom 5 June 2021 to 13 January 2022, the government of Nigeria officially banned Twitter, which restricted it from operating in the country.\nThe ban occurred after Twitter deleted tweets made by Buhari, warning the southeastern people of Nigeria, predominantly Igbo people, of a potential repeat of the 1967 Biafran Civil War due to the ongoing insurgency in Southeastern Nigeria."
  },
  {
    "headline": "Osun Election: Court Dismisses Suit Seeking APC, Governor Oyetola’s Disqualification Ahead Of Saturday Poll",
    "summarized_story": "A Federal High Court sitting in Abuja has dismissed a suit seeking the disqualification of the All Progressives Congress, APC, and Governor Gboyega Oyetola from the Osun State governorship election slated for Saturday.\nAdeoti had sought disqualification of the incumbent governor, Gboyega Oyetola from the governorship poll.\nIn the originating summons, he prayed the court to nullify Oyetola’s candidacy on the grounds that the governor contested in the February 19 primary election as a member of the APC’s National Caretaker Extraordinary and Convention Planning Committee (CECPC).\nGovernor Oyetola is seeking to extend his tenure in office by another four years, having won the last election held in 2018.\nSaharaReporters earlier reported that ahead of the poll, the APC held a mega rally in Osogbo to canvas support for its governorship candidate before the deadline for campaigns."
  },
  {
    "headline": "Russia-Ukraine war: FAO asks countries to stop trade measures fuelling food price volatility",
    "summarized_story": "The Food and Agriculture Organisation of the United Nations (FAO) has advised countries to discontinue trade measures fuelling food price volatility.\nIt deliberates key issues, examines the effects on food security, and makes policy recommendations.\nAdvertisementDongyu said global food security is threatened in many and often overlapping ways, including the COVID-19 pandemic, multiple conflicts around the world and persistent extreme climate conditions.\n“It is essential that countries stop using trade measures that add to price increases and extreme price volatility and harm those that depend on global markets for their food security,” he said.\nHe also underlined the important role trade can play for global food security and sustainability as it promotes food security and nutrition by linking food surplus regions with those in deficit."
  },
  {
    "headline": "Russia-Ukraine war: FAO asks countries to stop trade measures fuelling food price volatility",
    "summarized_story": "The Food and Agriculture Organisation of the United Nations (FAO) has advised countries to discontinue trade measures fuelling food price volatility.\nIt deliberates key issues, examines the effects on food security, and makes policy recommendations.\nAdvertisementDongyu said global food security is threatened in many and often overlapping ways, including the COVID-19 pandemic, multiple conflicts around the world and persistent extreme climate conditions.\n“It is essential that countries stop using trade measures that add to price increases and extreme price volatility and harm those that depend on global markets for their food security,” he said.\nHe also underlined the important role trade can play for global food security and sustainability as it promotes food security and nutrition by linking food surplus regions with those in deficit."
  },
  {
    "headline": "Ngige misinforming Buhari about our strike, says ASUU president",
    "summarized_story": "Emmanuel Osodeke, president of the Academic Staff Union of Universities (ASUU), says Chris Ngige, minister of labour, has been misinforming President Muhammadu Buhari on the union’s strike.\nOn July 11, Buhari appealed to the union to reconsider its ongoing strike because the action is taking a toll on parents and students.\nSpeaking on Sunrise Daily, a Channels Television programme on Thursday, Osodeke said if the president had been properly briefed he would not have made such a statement.\nConcerning the negotiation, the ASUU president said the union is not aware of the figure being circulated by federal government as the amount needed to resolve the strike.\nIn all our agreement and discussion, we didn’t talk about 1.2 trillion or 2.4 trillion, or whatever."
  },
  {
    "headline": "Ngige misinforming Buhari about our strike, says ASUU president",
    "summarized_story": "Emmanuel Osodeke, president of the Academic Staff Union of Universities (ASUU), says Chris Ngige, minister of labour, has been misinforming President Muhammadu Buhari on the union’s strike.\nOn July 11, Buhari appealed to the union to reconsider its ongoing strike because the action is taking a toll on parents and students.\nSpeaking on Sunrise Daily, a Channels Television programme on Thursday, Osodeke said if the president had been properly briefed he would not have made such a statement.\nConcerning the negotiation, the ASUU president said the union is not aware of the figure being circulated by federal government as the amount needed to resolve the strike.\nIn all our agreement and discussion, we didn’t talk about 1.2 trillion or 2.4 trillion, or whatever."
  },
  {
    "headline": "Passengers stranded at Abuja airport as aviation fuel scarcity bites harder",
    "summarized_story": "Some passengers were stranded at the domestic wing of the Nnamdi Azikiwe Airport in Abuja on Friday as airlines battle fuel scarcity, TheCable understands.\nLast month, airlines, under the aegis of Airline Operators of Nigeria (AON), warned about the disruption of scheduled flight operations over the growing scarcity of aviation fuel, popularly known as Jet-A1.\nAirline operators had also complained about the rising cost of aviation fuel and threatened to shut down operations.\nAdvertisementAnother passenger, who was supposed to board Owerri through United Nigeria Airlines by 10 am, told TheCable his flight was also delayed for two hours.\nA source at the airport who preferred anonymity told TheCable that the postponement was caused by the unavailability of aviation fuel."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "What to look for in a startup lawyer",
    "summarized_story": "Being a relatively new development, it is not far-fetched to assume that startups might not know what to look for in a startup lawyer.\nTo identify the unique qualities a startup lawyer should have, I asked 4 lawyers what qualities startups should look for in an in-house counsel.\nThe role of a startup lawyer is essential to support the startup from a legal perspective such that it can function at optimum capacity.\nWhether the startup is pre-seed, bootstrapped or VC-funded, a good startup lawyer is crucial for its day-to-day running.\nA startup lawyer should also be able to work in a startup environment, which is not as rigid as a law firm."
  },
  {
    "headline": "South African charged in largest fraud scheme involving bitcoin",
    "summarized_story": "The U.S Commodities Futures Trading Commission (CFTC) has charged South African resident Cornelius Johannes Steynberg in a bitcoin fraud scheme case totalling $1.7 billion.\nIn a press statement published on its website, the CFTC alleges that Steynberg, through a South Africa-registered company, Mirror Trading International Proprietary Limited (MTI), created and operated a global foreign currency commodity pool.\nThe pool, which had a value of $1.7 billion, only accepted bitcoin from users who wanted to purchase participation in it.\nJohnson said Steynberg in general operated the pool as a Ponzi scheme.\nSternberg is a fugitive from South African law enforcement but was recently detained in Brazil on an Interpol arrest warrant."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Prodigeezy created the iconic “This is Nigeria” video; now he’s taking music to the metaverse",
    "summarized_story": "So I said, ‘You know what, I’m going to shoot music videos for a while.”Prodigeezy is responsible for music video hits such as Falz’s This is Nigeria and Burna Boy’s Boshe Nlo.\nHaving worked in the music industry, Prodigeezy knew this but what he had planned was bigger than the big three’s rivalry.\nLet’s do this as part of an NFT project, as part of a bigger community,’ and the conversation just kept getting broader.\nThe NFT project will have 10,001 unique NFTs of Bnxn’s face — the kind used as the art cover for his hit song Italy.\nBenson also supports this, and he’s giving us a lot, from music to many other resources.”Combining NFTs with music is still new worldwide, and Prodigeezy is easily a pioneer in the space."
  },
  {
    "headline": "AAC, NNPP yet to nominate candidates for 2023 state elections- INEC – Nigerian Observer",
    "summarized_story": "“The nominations are expected to be done via the INEC Candidate Nomination Portal (ICNP) from July 1 to July 15.\n“However, two political parties, the AAC and NNPP, are yet to upload a single nomination to the portal,” it stated.\nINEC reminded all political parties that they have three days left to upload their list of candidates to the ICNP.\n“The number of requests processed has now risen to 1,662,987 pages of documents.\n“Sadly, in spite of the Commission’s effort, 147 out of 476 requests processed as at today involving 5,646 pages are yet to be collected by applicants.” (NAN)Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Educate Yourself to Overcome Poverty, Buhari tells Youths – Nigerian Observer",
    "summarized_story": "At that point, I realised and I told my children that your net worth is what is in your head, not what you have acquired in life.\nI told my children, particularly the girls, that they can only get married after getting a first degree.\n“No government in the history of this country has done more to reduce poverty like President Buhari’s administration.\nMasari said security in the country had improved considerably, compared to when the President came into power.\nThe Emir of Daura thanked the president for the infrastructural and institutional developments in the state, saying generations would remember and remain grateful to President Buhari."
  },
  {
    "headline": "WHO warns against use of 2 drugs for non-severe COVID-19 – Nigerian Observer",
    "summarized_story": "“Fluvoxamine and colchicine are commonly used, inexpensive drugs that have received considerable interest as potential COVID-19 treatments during the pandemic.\n“There is also a lack of reliable data on covid-19 related serious harms associated with these drugs,’’ it said.\nIt, however, said the panel did not see reason why children with COVID-19 would respond any differently to treatment with fluvoxamine or colchicine.\nAccording to the report, previously, WHO has made a strong recommendation for use of nirmatrelvir and ritonavir, and conditional recommendations for sotrovimab, remdesivir and molnupiravir for high-risk patients with non-severe COVID-19.\nWHO also warned against the use of convalescent plasma, ivermectin, and hydroxychloroquine in patients with COVID-19 regardless of disease severity."
  },
  {
    "headline": "2023: INEC Gives Ultimatum to Political Parties to Upload Candidates – Nigerian Observer",
    "summarized_story": "According to the release, the Commission has processed 6,995 nomination forms (EC9) uploaded by 16 out of 18 political parties for the constituencies where they intend to sponsor candidates.\nHowever, two political parties, the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP), are yet to upload a single nomination to the portal.\nThe Commission hereby reminds all political parties that they have three days left to upload their list of candidates to the ICNP.\nThe number of requests processed has now risen to one million, six hundred and sixty-two thousand, nine hundred and eighty seven (1,662,987) pages of documents.\nSadly, in spite of the Commission’s effort, 147 out of 476 requests processed as at today involving 5,646 pages are yet to be collected by applicants."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Osun 2022: Group condemns non approval of stadium, freedom park for PDP rally by Oyetola’s govt",
    "summarized_story": "A socio political group within Osun state chapter of People’s Democratic Party, PDP, The Pathfinder Team, has condemned in totality act Governor Oyetola led administration for refusal to approve Osogbo city stadium and freedom park for final rally of the party, describing it as act of dictatorship which is inimical to democratic tenets.\nThe group also frowned at the directive given to the mini bus driver (Korope) not to work in Osogbo today, Thursday, saying it shows the level at which the ruling APC government is been jiltery about the popularity of the PDP and its candidate, Senator Nurudeen Jackson Ademola Adeleke.\nThe group in a statement issued and signed by its state coordinator, Secretary and chairman Board of Trustee, Hon.Oladiti Aluko, Akinleye Sola and Alhaji Lukman Afolabi respectively bemoaned the Oyetola led APC government as been autocratic in nature.\nThey said, “Osun love for change of government is unresistable, no amount of intimidation or harassment could save APC from the looming defeat beholds them”“With or without approval of any of these facilities built by our common wealth, the love for PDP is unwaving, we are winning this election, it’s all about sovereignty of our state”The group pledged their unalloyed support for Senator Ademola Adeleke, the PDP candidate, saying they would work assiduously to ensure the party coast to victory come July 16th governorship election in the state, urging the people of the state to vote enmass for PDP"
  },
  {
    "headline": "Osun 2022: 12 political parties signs peace accord with INEC",
    "summarized_story": "By Sunday Oguntuyi, OsogboTwelve political parties on Wednesday signed a peace accord toward peaceful conduct of the July 16 Osun governorship election.\nSpeaking at the ceremony organised by the National Peace Committee in Osogbo, Bishop Mattew Kukah, urged all political parties featuring at the election to work toward peace.\nKukah said Nigeria was in need of a peaceful environment and hence the need to encourage political actors to think toward peace.\nKukah urged the Independent National Electoral Commission (INEC), political actors and other stakeholders to ensure that the election was free, fair and peaceful.\nINEC Chairman, Prof. Mahmood Yakubu, said that the success of the peace accord depended on all stakeholders."
  },
  {
    "headline": "Osun Election: Court dismisses suit seeking Oyetola’s disqualification",
    "summarized_story": "A federal high court in Abuja on Thursday dismissed a suit seeking the disqualification of Gov.\nAdegboyega Oyetola of Osun as the All Progressives Congress (APC) candidate for Saturday’s Governorship Election holding in the state.\nDelivering judgment, Justice Inyang Ekwo, declared that the suit filed by a chieftain of the APC, Alhaji Moshood Olalekan Adeoti, against Oyetola was an abuse of the court process.\nAdeoti, the plaintiff in the suit, filed the matter through his legal team led by Chiesonu Okpoko, SAN.\nIn the suit, the plaintiff listed the APC, Oyetola and Independent National Electoral Commission as 1st, 2nd and 3rd defendants respectively, NAN reported."
  },
  {
    "headline": "Khloe Kardashian expecting second baby with NBA player Tristan Thompson",
    "summarized_story": "Khloe Kardashian, an American reality Tv personality, is set to welcome a second child with her ex-boyfriend Tristan Thompson.\nAccording to TMZ, the baby will be born via surrogate and the timeline of the surrogate’s pregnancy shows Khloe and Tristan decided to have the baby before their most recent split over cheating.\nKhloe and the 31-year-old NBA player, who have had a rocky on/off romance since 2016, are already parents to four-year-old daughter True Thompson.\nThis news comes just seven months after Thompson admitted to fathering a son with fitness model Maralee Nichols while still in a relationship with Khloe."
  },
  {
    "headline": "FG to name substantive accountant general from 14 shortlisted directors",
    "summarized_story": "The federal government on Wednesday, shortlisted 14 directors directors on Grade Level 17 in the federal civil service for consideration as the process for the appointment of a new Accountant General of the Federation begins.\nThis was contained in a circular issued by Mariya Rufai, Director of Administration, Office of the Accountant General of the Federation, which was received by the Head of the Civil Service of the Federation, Dr. Folasade Yemi-Esan.\nOn the list for consideration are Chizea Onochie Peter, Jafiya Shehu Muhammad Murtala Saleh, and Lydia all from the Office of the AGF.\nAlso shortlisted are Mohammed Aminu YarAbba (Federal Fire Service), Samuel Waziri (Ministry of Agric and Rural Development), Mahmud Adam Kambari (North East Development Commission), Mohammed Magaji Doho (Federal Ministry of Education), Mufutahu Bukolah (Federal Ministry of Transportation), and Yusuf Abdullahi Musa (Ministry of Information and Culture).\nChukwuyere Anamekwe who had been in acting capacity was recently removed from office and replaced with a former Director of Treasury Single Account, TSA, Okolieaboh Ezeoke Sylvis."
  },
  {
    "headline": "The New Kids On The Block",
    "summarized_story": "Hakeem Oladimeji LawalGovernorship candidate in Kwara StateMr. Hakeem Oladimeji Lawal is the son of the late Admiral Mohammed Alabi Lawal.\nTonto Dikeh is also a leadership figure, a brand ambassador and a philanthropist (she set up the Tonto Dikeh Foundation).\nShe is a woman who wears many hats but is best known for her work in the legal field and philanthropic work.\nMr. Tajudeen Adeyemi AdefisoyeMember of House of Representatives for Idanre/IfedoreMr. Tajudeen Adefisoye is a businessman and philanthropist.\nMarilyn Okowa-DaramolaIka North East candidate for House of RepresentativesMrs. Marilyn Okowa-Daramola is the daughter of Delta State Governor Ifeanyi Okowa."
  },
  {
    "headline": "Women Elevating Women: Myth or Reality?",
    "summarized_story": "When it comes to women, there are certain things that inherently leave people, even women themselves, befuddled.\nBrace yourselves: it is women elevating women, fact or fiction?\nNow, here is the thing; women generally respect women in some aspects of life, while women fear women when it comes to social circles and work (who’s the boss type scenario, just more high heels and boobs).\nThis irks me because it sets women back to the dark ages, making women supporting women a thing of fiction.\nWomen supporting women is a thing of beauty."
  },
  {
    "headline": "Sail The Arabian Gulf This Christmas",
    "summarized_story": "The MSC Europa will be sailing the Arabian Gulf come December 2022.\nMSC World Europa ItineraryThe MSC World Europa will start its inaugural season with a special four-night sailing from Doha, Qatar, to the new homeport in Dubai, United Arab Emirates.\nMSC World Europa Design and FeaturesThe 333m-long MSC World Europa features 22 decks and offers 40,000m² of public space.\nThe cruise ship features seven new and innovative cabin types, which will include balcony suites and cabins overlooking the promenade.\nThere is no better way to celebrate Christmas 2022 than to experience MSC Europa."
  },
  {
    "headline": "How 16 Family Members Traveling For Sallah Perished On Lagos Water",
    "summarized_story": "The 16 passengers that perished on the eve of Eid-el-Kabir festival while sailing from Mile 2 to Ibeshe, Ojo in Lagos State, were same family members from Ibeshe, Mile 2 of the State, LEADERSHIP has learnt.\nSpeaking, when the officials of the National Inland Waterways Authority (NIWA), Lagos Area Office, led by the area manager, Engr.\nHe said, “The boat tragedy that resulted in the death of 17 boat passengers last Friday was down to human error.\n“Now, we will be increasing patrol and taking training of boat drivers to riverine communities,” she concluded.\nThe NIWA delegation also visited the Sumola Aniajogun family house of the 17 deceased boat passengers, who lost their lives alongside the ill-fated boat drivers."
  },
  {
    "headline": "How 16 Family Members Traveling For Sallah Perished On Lagos Water",
    "summarized_story": "The 16 passengers that perished on the eve of Eid-el-Kabir festival while sailing from Mile 2 to Ibeshe, Ojo in Lagos State, were same family members from Ibeshe, Mile 2 of the State, LEADERSHIP has learnt.\nSpeaking, when the officials of the National Inland Waterways Authority (NIWA), Lagos Area Office, led by the area manager, Engr.\nHe said, “The boat tragedy that resulted in the death of 17 boat passengers last Friday was down to human error.\n“Now, we will be increasing patrol and taking training of boat drivers to riverine communities,” she concluded.\nThe NIWA delegation also visited the Sumola Aniajogun family house of the 17 deceased boat passengers, who lost their lives alongside the ill-fated boat drivers."
  },
  {
    "headline": "BREAKING: Kwankwaso Names Popular Lagos Clergy, Bishop Idahosa As Running Mate",
    "summarized_story": "The New Nigeria Peoples Party (NNPP) has announced that its presidential candidate and former governor of Kano State, Rabiu Kwankwaso, has chosen Bishop Isaac Idahosa as his running mate for the 2023 general elections.\nThe party made the announcement on the official Twitter page of its campaign organization on Thursday where it wrote, “Our VP Pastor Bishop Isaac Idahosa from Edo State.”Bishop Isaac Idahosa from Edo State is the Senior Pastor of God First Ministry, popularly known as Illumination Assembly, with its headquarters at Lekki Light Centre (LLC), Ajah, Lagos.\nThe cleric who is also a gospel singer, writer, and motivational speaker is popularly known as ‘Prophet Talk Na Do’ by his followers.\nKwankwaso’s choice comes after he failed to get the presidential candidate of the Labour Party and former Governor of Anambra State, Peter Obi to be his running mate.\nObi’s refusal to be Kwankwaso’s running mate also ended the two political parties’ alliance talks as they had announced earlier that they were in talks on reaching an alliance ahead of the 2023 elections."
  },
  {
    "headline": "BREAKING: Ecowas Court rules Buhari’s Twitter ban illegal, violated Nigerians’ fundamental rights",
    "summarized_story": "The Ecowas Court on Thursday ruled that President Muhammadu Buhari violated the rights of Nigerians when he illegally ordered the restriction of Twitter in June 2021.\nThe regional court said Mr Buhari’s action was unlawful and in defiance of Article 9 of the African Charter and Article 19 of the International Covenant on Civil and Political Rights.\nMr Buhari issued the ordered to block Twitter in Nigeria after the platform removed his tweets threatening genocide against the Igbo ethnic nationalities of the country’s South-East.\nDuring arguments, the government raised people’s eyebrows when it admitted that it “legally” violated the fundamental rights of Nigerians.\nAttorney-General Abubakar Malami in his submission to the Abuja-headquartered court also said Twitter had apologised and promised to respect the administration’s suggestions on social media use in Nigeria."
  },
  {
    "headline": "BREAKING: Court dismisses Oyo Deputy Gov’s case",
    "summarized_story": "Justice Ladiran Akintola of Oyo State High Court has dismissed a case filed by Deputy Governor Rauf Olaniyan over procedure to remove him from office by Oyo Assembly.\nThe court held that the lawmakers and all the defendants have not erred on the procedures taken.\nAccording to the Court, the originating summons filed by the claimant was purely legislative procedure and not judicial in line with the Constitution of the Federal Republic of Nigeria.\nDetails Shortly…"
  },
  {
    "headline": "There’s dignity in labour, Peter Obi replies Tinubu",
    "summarized_story": "The presidential candidate of the Labour Party, Peter Obi, on Wednesday, has reacted to the presidential candidate of the All Progressives Congress, APC, Bola Tinubu’s comment he made about their party, which the Labour party and its members considered derogatory.\nObi made the remark in Osogbo, the Osun State capital, at a mega rally to support the governorship candidate of the party, Lasun Yusuff.\nHe said: “I listened to our chairman when he said that somebody said ‘they can labour till death’.\n“When they show you hatred, Labour Party will show them love.\nSimilarly, the LP’s candidate, Lasun lambasted Tinubu, saying his comment about the Labour Party by the APC leader was inconsistent with the attributes of a virtuous Yoruba man."
  },
  {
    "headline": "2023: Kwankwaso picks popular Pastor as running mate",
    "summarized_story": "The presidential candidate of the New Nigeria Peoples Party (NNPP), Senator Rabiu Kwankwaso, has chosen Bishop Isaac Idahosa as his running mate for the 2023 general elections.\nThe party made the announcement on the official Twitter page Thursday.\n“Our VP Pastor Bishop Isaac Idahosa from Edo State,” the party tweeted.\nIdahosa is the Senior Pastor of God First Ministry, also known as Illumination Assembly, with its headquarters at Lekki Light Centre (LLC), Ajah, Lagos.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: APC, Oyetola escape disqualification ahead Osun governorship election",
    "summarized_story": "A Federal High Court sitting in Abuja has dismissed a suit seeking disqualification of the All Progressive Congress (APC) and Governor Gboyega Oyetola from the Osun state governorship election slated for Saturday July 16, 2022.\nDelivering his verdict on the matter, Thursday, Justice Inyang Eden Ekwo dismissed the suit on six grounds.\nThe court held that the Chieftain of APC, Moshood Olalekan Adeoti, failed woefully and that the Plaintiff did not explore internal mechanism.\nThe Judge held further that the suit instituted by the former governorship aspirant constituted a gross abuse of court process and that the plaintiff did not exhaust internal mechanism before rushing to court.\nThe plaintiff said the act contravened the provisions of Section 222 of the Constitution of the Federal Republic of Nigeria 1999 (as amended) and Article 31(iii) of the APC, October 2014 (as amended)."
  },
  {
    "headline": "[Breaking] Impeachment: Court dismisses Oyo deputy governor ’s case",
    "summarized_story": "Justice Ladiran Akintola of Oyo state High Court has dismissed a case filed by deputy governor Rauf Olaniyan over procedure to remove him from office by Oyo Assembly.\nThe court held that the lawmakers and all the defendants have not erred on the procedures taken.\nAccording to the Court, the originating summons filed by the claimant was purely legislative procedure and not judicial in line with the constitution of the federal republic of Nigeria.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "GPMI Congratulates Air Peace over flight operations to China",
    "summarized_story": "The Global Peace Movement International, UK has congratulated the Chairman and CEO of Nigeria’s largest carrier, Air Peace, Allen Onyema on the inaugural flight ceremony from Lagos to Guangzhou, China at the Murtala Muhammed International Airport, Ikeja, Lagos on Wednesday.\nPresident General, Dr. Mike Uyi in a statement on Thursday commended the airline and its CEO for the bold move to reposition the nation’s aviation industry.\nUyi said this step by Air Peace, Nigeria can now compete in the international, regional and domestic air travel market to regain what the country has lost over the years to foreign airlines.\nHe also noted that with the increase in capacity, it is expected that Air Peace would open new frontiers, new destinations both in Africa and beyond and in doing so, create more job opportunities for Nigerians.\n“This is a significant step for an accomplished man whose visionary airline is already employing over 3000 Nigerians and turning their economic fortunes around,” Uyi said."
  },
  {
    "headline": "Air Peace begins official flight operations to China",
    "summarized_story": "Air Peace has officially commenced operations into Guangzhou-China, becoming the first Nigerian airline to fly into the Asian country once every week.\nOlajide said, ”When we set out for the Air Peace trajectory in 2014, we envisaged an airline that would predominantly do two things.\n“Now, we can confidently assert that Air Peace has kept to this vision of providing seamless connections and expanding existing network to accommodate the evolving air travel needs of the flying public.\n“If you’ve been following the growth of Air Peace, you’ll be familiar with the fact that the Chinese airspace is not new to us.\nOlajide said Air Peace currently boasted of a network of 20 domestic routes, seven regional routes and two international destinations, including Dubai and Johannesburg."
  },
  {
    "headline": "BON hotel set to empower Nigerian Youths through branch expansion in Lagos, Abuja, Port Harcourt",
    "summarized_story": "By Ere-ebi AgedahLeading hospitality brand, BON Hotels International West Africa has expressed readiness to take more youths in the country out or labour market and meaningfully engage them with economic activities.\nThe hotel listed Lagos, Abuja, Port Harcourt, Ibadan, Kano, Warri, Ekiti, Akure, Ogbomosho, Owerri, Asaba, Awka, Enugu and others as some of the cities it plans to establish 60 new branches.\nThe hospitality industry has been identified as one of the sectors with humongous capacity to reduce Nigerian unemployment figure which has for decades increasing surged.\nThe World Travel & Tourism Council estimates that the hospitality industry accounts for 10 percent of global GDP and provides 1 in 10 jobs worldwide.\nThis suggests that one in 10 workers in Nigeria is directly or indirectly employed in the hospitality industry."
  },
  {
    "headline": "Jack-Rich Harps on Economic Liberalisation Strategy For Private capital Boom in 2023",
    "summarized_story": "Jack-Rich said to achieve this, policy makers must award deep tax cuts, promote sectoral economic stimulus through soft credit lines to help indegenous companies produced the country’s needs.\n”It is a phenomenal tool to activate private capital growth, and to join the trillion-dollar economic league,” he said.\nAccording to the philanthropist, global economic trend has its impact on Africa, which accounts for only three per cent of global trade with seven per cent of trade deficit.\n”Ignoring economic stimulus and pursuing interest rate hike, with the taxman on the neck of businesses, will further stifle earnings and worsen access to credit for large ticket investments,” he said.\nAccording to the oil tycoon, this will increase unemployment rates, and further exacerbate the wind of economic recession, and possibly social issues."
  },
  {
    "headline": "How women play leading roles in COMEG – Prof Opafunso",
    "summarized_story": "The Registrar/CEO of COMEG, Prof Zacheus Opafunso made the call during the inauguration of COMEG Cooperative and Building Committee in Abuja on 6th July, 2022, officiated by the President of the Nigerian Mining and Geosciences Society, NMGS, Alabo Charlesye David Charles.\nOpafunso said COMEG will continue to give relevant support to women individuals and women groups who wish to participate in the development of the sector, provided that it is in line with the mandate of the Council.\nHe said the economic diversification goal cannot be pursued by men alone, adding that COMEG was committed to gender balance in line with the National Gender Policy.\nDiscussing other important roles that women have played in COMEG over the years, Prof Opafunso recalled that the first Acting Registrar of COMEG was a woman – Dr. (Mrs) A.\nB. Durotoye, adding that women continued to serve on the COMEG Council till date."
  },
  {
    "headline": "Court Dismisses Suit Seeking Disqualification Of Oyetola As Osun APC Governorship Candidate",
    "summarized_story": "The Federal High Court in Abuja has dismissed a suit seeking the disqualification of Osun State Governor, Adegboyega Oyetola, as the All Progressives Congress (APC) candidate for the July 16 governorship election scheduled to hold in the state.\nREAD ALSO: Osun Election: Oyetola To Know Fate In Disqualification Suit On ThursdayJustice Inyang added that the suit instituted falls outside the scope of section 87(9) of the Electoral Act and Section 22 of the 1999 Constitution as amended.\nAdeoti a chieftain of the APC was one of the aspirants in the February 19 APC governorship primary for the state but he lost the ticket to Governor Oyetola.\nHe then filed the case seeking the governor’s disqualification through his legal team led by a Senior Advocate of Nigeria (SAN), Chiesonu Okpoko.\nGovernor Oyetola is seeking to extend his tenure in office by another four years, having won the last election held in 2018."
  },
  {
    "headline": "Strike: Instead of Resolving The Problem, Ngige Is Busy Abusing His Colleagues – ASUU President",
    "summarized_story": "President of the Academic Staff Union of Universities (ASUU), Professor Emmanuel Osodeke, on Thursday, blasted the Minister of Labour and Employment, Dr Chris Ngige, over his attitude toward the strike embarked by university lecturers.\nOn Wednesday, Dr Ngige put out a statement saying that there is no collective bargaining agreement between the Federal Government and ASUU.\nREAD ALSO: There Is No Collective Bargaining Agreement Between FG, ASUU – NgigeProfessor Osodoke, however, fired back on Sunrise Daily.\nHe challenged Dr Ngige to show Nigerians proof of a claim that his delegation was walked out of a meeting with ASUU members.\nThe ASUU President said Ngige resorted to fake news having failed to force the striking members to call off the strike by withholding their salary for five months."
  },
  {
    "headline": "ASUU: It’s Unacceptable To Still Have Schools Closed After Many Months – Bishop Kukah",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Mathew Kukah, has said it is unacceptable that Nigerian Universities are still closed after so many months.\nBishop Kukah who stated this on Wednesday at the signing of a peace accord ahead of the Osun State gubernatorial election, asserted that the prolonged strike does not speak well of the democracy we profess to be practicing.\n“This is unacceptable especially as these things are happening in a democracy,” Kukah insisted.\nBishop Kukah said it is sad that increasingly the country is witnessing a transition from democratic rule to plutocracy.\nBishop Kukah called on Nigerians to come out and vote when the elections get underway, stressing that the urgency of fixing the nation is tied to the process of governance adopted in the constitution."
  },
  {
    "headline": "2023: Tinubu’s Muslim-Muslim Ticket Is ‘A Disastrous Error, Dead On Arrival’ – Babachir Lawal",
    "summarized_story": "Former Secretary to the Government of the Federation, Babachir Lawal, has faulted the announcement of a Muslim-Muslim ticket by the presidential candidate of the All Progressives Congress, Bola Ahmed Tinubu.\n“But if he thinks a Moslem-Moslem ticket will win him the northern Muslim votes, he should have a rethink.\nI have also on several occasions passed on to him counsels and messages from some well meaning Nigerians intended to alert him on the possible outcomes of the Presidential ticket permutations.\nThe northern governors and some northern moslem elites must have persuaded him that they will never vote for a ticket that has a northern Christian on it.\nBut, were he to win and become President of Nigeria, it will be as a sectional President; an Islamic President."
  },
  {
    "headline": "UK Police Open Investigation Into Mo Farah Trafficking Revelations",
    "summarized_story": "London’s Metropolitan Police have opened an investigation into British Olympic great Mo Farah’s stunning revelations he was illegally trafficked into Britain as a child.\nHe added he was forced to work in domestic servitude after entering the country aged eight or nine.\n“We are aware of reports in the media concerning Sir Mo Farah,” said the Metropolitan Police in a statement on Thursday.\nHe was encouraged to speak out now by his wife and children, after burying the truth for decades.\n“I honestly don’t want to be talking about it because I told myself I would never talk about it."
  },
  {
    "headline": "Oyo deputy gov appeals judgment dismissing his suit -",
    "summarized_story": "Oyo State Deputy Governor, Rauf Olaniyan has appealed the judgement dismissing his suit against the plan of the Oyo State House of Assembly to impeach him.\nCounsel to Olaniyan, Chief Afolabi Fashanu confirmed the development shortly after the sitting regarding the case.\nAdvertisementJustice Ladiran Akintola had earlier dismissed the suit saying the defendants have not breached any constitutional provisions on the matter.\nThe presiding judge, Justice Ladiran Akintola ruled that the originating summon filed by the claimant was purely legislative and not judicial.\nAdvertisementAdvertisementCounsel to the defendant Kunle Kalejaiye while addressing newsmen stated that the defence counsel maintained that though the status quo stills remains, but the house had just taken a step out the eight processes involved in the process as stated by the 1999 constitution as amended."
  },
  {
    "headline": "YIAGA Africa holds briefing on Osun Governorship Election",
    "summarized_story": "YIAGA Africa has called on the Independent National Electoral Commission, INEC, to address the issue of Inadequate information about change of polling unit of some electorates.\nThe group made this call on Wednesday at a press briefing in Osogbo, Osun state capital ahead of the Saturday governorship election in the state.\nAdvertisementYIAGA Africa which gave reports of physical attacks, said measures must be taken to prevent violence in Osun Election while seeking clarification on the roles Amotekun is expted to play in the Saturday election.\nThe civil society organisation however called on the INEC to publish data of permanent voters card collected, adding that it will play a huge role in the conclusiveness of the election.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Osun 2022: Court dismisses suit seeking to disqualify Governor Oyetola -",
    "summarized_story": "The Federal High Court sitting in Abuja has dismissed the suit seeking the disqualification of governor of Osun State Adegboyega Oyetola as the All Progressives Congress (APC) candidate, in the 16th July governorship election scheduled to hold in the state.\nDelivering Judgement, Justice Inyang Ekwo stated that the plaintiff ( Moshood Adeoti), failed to support the process with relevant laws, and as such, showed no cause of action in the suit which makes the suit a gross abuse of court process.\nAdvertisementJustice Inyang adds that said suit instituted, falls outside the scope of section 87(9) of the Electoral act and section 22 of the 1999 constitution as amended.\nMoshood Adeoti, a former Secretary to the Government of Osun state during the Aregbesola Administration, had challenged the emergence of Adegboyega Oyetola as the candidate of the APC in the July 16 governorship election in the state.\nAdvertisement"
  },
  {
    "headline": "Akeredolu urges Nigerians to ignore religion and Vote Competence -",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu,SAN, on Wednesday, called on Nigerians to vote for competence in the 2023 Presidential election, adding that the faith of the Vice President doesn’t affect performance in any government.\nGovernor Akeredolu, who expressed confidence that the Presidential Candidate of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu will rescue the nation, noted that the work stops on the President’s table.\nThe Governor spoke at the swearing-in of two new commissioners, held at the at the Cocoa Conference Hall of the Governor’s Office, Alagbaka, Akure, the State capital.\nAdvertisementAdvertisementThe new Commissioners are Mr. Sowore Akinwumi Samson and Mr. Ologbese Adeboboye Joseph.\nAdvertisementGovernor Akeredolu said he was excited to have personalities imbued with the requisite capacity for the advancement of the cause of good governance."
  },
  {
    "headline": "APC Government Brought Gunmen to My House – Yusuf Lasun",
    "summarized_story": ""
  },
  {
    "headline": "UN: With 100m Still Living Below Poverty Line, Nigeria Not on Track to Attaining Sustainable Development Goals",
    "summarized_story": "The United Nations Resident and Humanitarian Coordinator, Mr. Mathias Schmale on Wednesday said Nigeria currently lags behind in terms of reaching many of the Sustainable Development Goals (SDGs) 2030 targets.\nHe added, “Before the COVID-19 pandemic and the war in Ukraine, Nigeria was already lagging behind in achieving the Sustainable Development Goals (SDGs).\nThere will always be people who lose out and currently, almost 100 million people in Nigeria live below the poverty line.\nSo we cannot talk about economic growth and think that those 100 million will quickly be lifted out of poverty.\nThere is a place to bring government, NGOs, private sector, businesses together to solve the same problem.”James Emejo in Abuja"
  },
  {
    "headline": "Christians Have Nothing to Fear, Muslim-Muslim Ticket Reflects Nigeria’s Reality, Says APC Chairman Adamu",
    "summarized_story": "National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, on Wednesday, allayed the fears of Christians over the All Progressives Congress (APC) Muslim-Muslim presidential ticket, saying it was a reflection of the current political reality in the country.\nSpeaking at the swearing-in of two new commissioners, held in Akure, the State capital, he said: “Muslim-Muslim Ticket has nothing to do with performance.\nAPC’s Muslim-Muslim Ticket Stands Rejected, Says PFNKaduna State chapter of the Pentecostal Fellowship of Nigeria (PFN), has rejected the Muslim-Muslim Presidential ticket of the APC, saying it would further polarise the country along religious line.\nTherefore, I declare the Muslim-Muslim ticket unacceptable.\nHe allayed the fears being expressed by Christians in the country over the Muslim-Muslim ticket of the APC, stressing that there was no cause for alarm."
  },
  {
    "headline": "Nigeria: Oil Marketers Say Subsidy Not Sustainable, Want Gradual Removal to Minimise Shock",
    "summarized_story": "With the federal government and Nigerians grappling with ballooning subsidy spending, unabating petrol scarcity and queues in the country, petroleum products marketers under the aegis of Major Oil Marketers Association of Nigeria (MOMAN) have advised the government to end the subsidy regime by adopting a gradual removal approach.\nInsisting that petrol subsidy payment was no longer sustainable and was killing marketers’ business, MOMAN explained that adopting a phased removal approach, which would require adjusting upward, the price of petrol little by little, would ensure that consumers were protected against the attendant shocks.\nHowever, presenting MOMAN’s position, Adeosun said gradual removal was the only way to address the subsidy challenge which has compounded the bleeding of the already ailing economy.\nWe are saying that we need government to work assiduously to gradually phasing out the subsidy by allowing the prices to increase gradually.\nAdeosun added, “Now, we have the subsidy bill that keeps increasing: N1 trillion, N3 trillion, N4 trillion, N8 trillion."
  },
  {
    "headline": "ECOWAS: 14,500 Killed in 4 Years in West Africa By Terrorists, 5.5 million People in Dire Humanitarian Need",
    "summarized_story": "The Economic Community of West African States (ECOWAS) Commission on Wednesday lamented that no fewer than 14,500 people have been killed by terrorists in the West African region in under 5 years.\nHe also revealed that the number of refugees within the region seeking humanitarian assistance stood at 5.5 million.\nBrou however said the plan would require sustained commitment including financial support from member states for it to be successful.\nBut we are confident that with the full cooperation of staff and support of Member States, we will be able to take the process to its logical conclusion.\nAt the same time, I call upon you to continue to support ECOWAS by ensuring the full payment of the Community Levy and the full implementation of ECOWAS protocols."
  }
]