[
  {
    "headline": "Ending insurgencies: When solidarity matches resilience",
    "summarized_story": "The problem of complicity regarding Boko Haram and banditry has been abundantly established.\nAt the time, then President Goodluck Jonathan’s administration was battling against Boko Haram.\nBut then, much like Boko Haram, the bandits are proving resilient.\nIt has long been speculated that the bandits are actually Boko Haram fighters or that they merely infiltrated the bandits.\nBoko Haram, like other Islamist insurgencies, has proven to be resilient."
  },
  {
    "headline": "Soldiers’ invasion of Imo community, indefensible",
    "summarized_story": "According to Human Rights Watch, the soldiers, during their revenge attack for the alleged killing of 19 troops, massacred hundreds of civilians in the Benue incident in October 2001.\nThe report said that the altercation between the soldiers and some youths over the “sharing formula of the proceeds” led to the soldiers killing one of the boys Chukwunonso Iherue, from Umuokwu-Izombe, also known as Obera.\nThe attack led to the alleged killing of two soldiers, the burning of their vehicle, and the loss of three service rifles.\nAs condemnable as the alleged killing of the soldiers by the angry youths is, the impunity of the soldiers is similarly reprehensible and unacceptable.\nThe involvement of soldiers in internal security in the country should also be reviewed."
  },
  {
    "headline": "Foods, herbs to manage male infertility",
    "summarized_story": "He gave me lists of some herbs that are effective in treating male infertility.\nHaving certain medical conditions like tumours and chronic illnesses such as sickle cell diseaseTaking certain medications or undergoing medical treatments such as surgery or radiation used for treating cancer.\nAfter the article on prostate enlargement was published, the only text messages I got were what are the local names of the non-indigenous herbs listed?\nIf I am not able to provide local names of certain herbs, then it is either the local names are controversial and I would not want you to ingest wrong herbs or they may be non-indigenous herbs.\nHow do I give local names to herbs that are not native to Africa?"
  },
  {
    "headline": "Adjogbe foundation donates education materials to schools in Delta",
    "summarized_story": "By Festus Ahon, ASABAAS part of its humanitarian services, the Samuel Adjogbe Foundation, SAF has donated academic materials to the nursery, primary and secondary schools in Delta State.\nChairman of SAF and former Executive Director Projects of the Niger Delta Development Commission, NDDC, Dr Samuel Adjogbe, who was represented by both the Foundation Coordinator, Mr Fidelis Adjogbe and Foundation Assistant Coordinator, Mr Marcus Uba, said the gesture was part of activities of the foundation to reach out to the less privileged people in the society.\nAdjogbe said: “Human capital development is a pillar for future economic growth therefore, assisting the young ones through formal education is in line with that aspiration.”He promised to expand the programme to include students of tertiary institutions as the Foundation increases in its financial base,The benefitting schools were the Ovwodokpokpor-Ogor Nursery and Primary Schools, Ovwodokpokpor-Ogor; Otogor Nursery and Primary Schools, Otogor; Mariere Nursery and Primary Schools, Evwreni; Mukoro Mowoe Nursery and Primary Schools, Evwreni; Unenurhie Nursery and Primary Schools, Unenurhie.\nOthers include; Anglican Girls Grammar School, Ughelli; Government College, Ughelli; and Otovwodo Nursery and Primary Schools, Otovwodo, all in Ughelli North Local Government Area of Delta State.\nHeadmasters and Principals of the school, of the benefitting schools, expressed appreciations to the foundation for the gesture, adding that the items donated would promote learning and improve the quality of education of both pupils and students."
  },
  {
    "headline": "My man can cheat but with respect – Treasure Daniel",
    "summarized_story": "Treasure DanielGone are the days women are expected to stay back in the background, rather to be seen than heard.\nIn love or war, women are not just pushing the boundaries but crossing the lines to share the lanes with their male counterparts.\nIn a chat with Potpourri, Treasure concurred that she loves her man to take the wheel and steer her according to his whims.\n“I would end my relationship, If the man I’m dating cheats without having respect for me.\nI’m not saying you shouldn’t cheat but please Daddy, cheat with a person not close to me."
  },
  {
    "headline": "Attack on Oyo Prison: FG launches manhunt for 575 fleeing inmates, recaptures 262",
    "summarized_story": "By Omeiza Ajayi, AbujaThe Federal Government said it has begun a manhunt for the 575 inmates of the Oyo Medium Security Custodial Centre in Oyo State who are currently at large following Friday morning attack on the prison by armed criminals.\nIt said, so far, 262 inmates have been recaptured, promising to recapture the 575 who are still at large.\nREAD ALSO:Goronyo attack: Zulum, Yahaya visit Sokoto as NEGF’s Reps; donate N20mThe Oyo Custodial Centre was established in 2007 with a capacity of 160 inmates but as of the time of attack, had a total population of 907.\n“Security agencies are on the trail of the escaped inmates, while a joint security services manhunt has been launched immediately for the apprehension of the assailants.\n“Meanwhile, a total of 262 of the escapees have been recaptured leaving 575 still at large."
  },
  {
    "headline": "Omo-Agege tasks Igbos on dialogue",
    "summarized_story": "Omo-AgegeThe Deputy Senate President, Sen. Ovie Omo-Agege, has urged the Igbos to imbibe dialogue rather than confrontation in the pursuit of their grievances.\nOmo-Agege, Senator representing Delta Central at the National Assembly, gave the charge on Saturday in Asaba at the Inauguration ceremony of the Anambra State Association of Town Unions (ASATU) in Delta.\nHe also urged the newly-inaugurated association to continue to promote and ensure peace and development in Delta.\nOn his part, Mr Titus Akpudo, National President of ASATU, said the inauguration marked the birth of a new association in Delta.\nAlso, Mr Victor Mbanefo, Newly-inaugurated President General, ASATU in Delta, said the inauguration was a great achievement for the people of Anambra."
  },
  {
    "headline": "2023: Tinubu Support Groups calls on Nigerians to support Tinubu presidency",
    "summarized_story": "Bola TinubuAlhaji Umar Mohammed, Director-General, Tinubu Support Group (TSG), has called on Nigerians to support the group to ensure the actualisation of a Bola Tinubu presidency in 2023 for a new and better Nigeria.\nHe made the call on Saturday in Abuja, while inaugurating the Tinubu Support Group and its State Steering Committee.\n“May I call on Nigerians to join us, as we work hand in hand in the journey to build the country of our dream.\nHe said the TSG had reflected deeply on the outstanding leadership qualities, personal attributes and antecedents of Bola Tinubu, adding that he is a man with the attributes of hard work.\nMohammed charged members of the State Steering Committee to constitute Local Government and Ward structures that must be men and women of proven integrity and capacity to deliver."
  },
  {
    "headline": "President Buhari to launch e-Naira Monday",
    "summarized_story": "The Central Bank of Nigeria, CBN on Saturday, revealed that President Muhammadu Buhari has been scheduled to formally unveil the e-Naira on Monday.\nA statement issued on Saturday by CBN’s Director of Corporate Communications, Osita Nwanisobi, stated that the e-Naira is now expected to be activated on Monday by the president.\n“Sequel to a series of engagements with most relevant stakeholders including the banking community, merchants, fintech operators and indeed, a cross section of Nigerians, the Central Bank designed the digital currency, which shall be activated on Monday, October 25, 2021.\n“The e-Naira therefore marks a major step forward in the evolution of money and the CBN is committed to ensuring that the e-Naira, like the physical Naira, is accessible by everyone”.\nAccording to the statement the launching of the e-Naira would mark the beginning of more research for the enhancement of the platform."
  },
  {
    "headline": "Enugu Water: Comprehensive rehabilitation of 9th Mile Crash Programme over 90 percent completed – Contractor",
    "summarized_story": "Clifford Nnaji, who is handling the complete rehabilitation of the 9th Mile Crash Programme being executed by the administration of Governor Ifeanyi Ugwuanyi of Enugu State, after over 35 years since the water project was abandoned, has assured residents of Enugu that the issue of water supply will soon be a thing of the past.\nEach of the rehabilitated boreholes is solar powered, to address the peculiar challenges of power failure.\nUgwuanyi’s administration to boost the volume of water being reticulated from the aged water scheme.\nNnaji assured that “water will be available at an affordable rate and also sustainable because the rehabilitated boreholes are powered by solar as we will not wait for the grid electricity or diesel powered generator to pump water”.\nUgwuanyi for his unrelenting commitment to the massive water project aimed at addressing the challenges of water supply in Enugu, pointing out that the governor “is the man of the people who listens to the voice of the people”."
  },
  {
    "headline": "Insecurity: Accept Buratai’s call for synergy against insurgency – Nigerians told",
    "summarized_story": "The former army chief, who is now Nigeria’s ambassador to Benin Republic, had also in the lecture recommended appreciable investment in human capital development to tackle widespread poverty among Nigerians and weaken the tendency for insurgency to thrive.\nReacting to Buratai’s lecture, the Country Director of the Mahatma Gandhi Peace Foundation Nepal, Richard Oduma praised the ambassador for continuing to demonstrate commitment to issues facing the country.\nRichard said, “For a man who served all his life in the military and who in fact pioneered the most successful military feats against insurgency to avail himself for yet another national service deserves some commendation.”“For us at the Ghandi Peace Foundation, peace and development remains our concern.\nAmb Buratai’s desire to put forward his military and diplomatic experience for use is highly commendable,” Richard said.\nAdding that nations are built through tapping from the best of patriots, Richard said his foundation wished that all stakeholders will yield to good counsel as offered by Buratai and contribute their quota to achieve the desired development."
  },
  {
    "headline": "Nigeria a failed state – Moghalu reacts as terrorists ‘bomb’ Abuja-Kaduna train",
    "summarized_story": "A former presidential candidate in the 2019 general election, Kingsley Moghalu, has described Nigeria as a failed state.\nMoghalu said Nigeria is a failed state pretending to be normal.\nThe former Deputy Governor of the Central Bank of Nigeria, CBN, was reacting to the terrorist attack on an Abuja-Kaduna train.\nHe lamented that the inactivity of security agents who were aware of the attack ahead of time, indicated that Nigeria is a failed state.\n“Afghanistan is not our destiny, but we must change our political direction in 2023 to make that outcome a false prophecy.”"
  },
  {
    "headline": "Buhari covering up Boko Haram sponsors while setting up Igboho, Nnamdi Kanu – Omokri",
    "summarized_story": "Reno Omokri, a socio-political activist, has accused President Muhammadu Buhari of covering up Boko Haram sponsors.\nOmokri alleged that Buhari was covering up Boko Haram sponsors while setting up agitators like Sunday Igboho and Nnamdi Kanu.\nThe former aide to ex-President Goodluck Jonathan, made the claim while reacting to the attack on the Abuja-Kaduna train.\nHe pointed out that those who attempted to bomb the Abuja-Kaduna train can’t be referred to as ordinary bandits.\nRecall that ex-Kaduna Central Senator, Shehu Sani had disclosed how terrorists attacked the Abuja-Kaduna train."
  },
  {
    "headline": "Woman who sold her baby for N150,000 caught for selling her mistress’ newborn",
    "summarized_story": "Woman who sold her baby for N150,000 caught for selling her mistress’ newbornThe Police Command in Cross River State has paraded a suspect named, Blessing Okon-Etim, arrested for stealing a child.\nOkon-Etim, who confessed to having sold her three-month-old baby for N150, 000, also confessed to have sold a newborn belonging to her mistress, the crime for which she is arrested.\nThe Nation gathered that the mother of the newborn stolen and sold by the suspect died after delivery.\nThe same middleman reportedly helped in selling Okon-Etim’s three-month-old child.\n- Advertisement -The Police Commissioner in Cross River State, Alhassan Aminu, paraded Okon-Etim along with 33 other suspects for sundry crimes."
  },
  {
    "headline": "How to keep personal banking details safe from new virus, Flubot",
    "summarized_story": "Flubot is able to spy on consumers and access contact details once it infiltrates a user’s phone system.\nFlubot, according to NCC, “impersonates Android mobile banking applications to draw fake web view on targeted applications”- Advertisement -Read Also; A haven for scammersThe goal of the virus transcends stealing personal data and essentially targets stealing of credit card details or online banking credentials.\nCriminals will then try to gain access to personal bank accounts, email addresses and any other valuable accounts via this spyware.\nThis will delete any data on your phone, including personal data.\nYou will also need to change the passwords to all of your online accounts, with urgency, around your online bank accounts."
  },
  {
    "headline": "Otedola acquires major stake in FBN Holdings",
    "summarized_story": "Business magnate and investor, Mr. Femi Otedola, has acquired a material shareholding in Nigeria’s oldest banking group, FBN Holdings (FBNH) Plc.\n- Advertisement -In one of the transactions, Otedola was believed to be the proxy buyer in a N7.57 billion cross deal at the Nigerian Exchange (NGX) Limited on October 07, 2021.\nOtedola had in June 2019 sold its majority shareholding in the then Forte Oil Plc in a deal valued at about N64 billion.\nIgnite Investments and Commodities Limited led by Prudent Energy Services Limited had in June 2019 completed the acquisition of 74.02 per cent majority equity stake in Forte Oil from the company’s erstwhile chairman, Otedola.\nOtedola had in December 2018 in a dramatic twist announced plan to sell his 75 per cent majority equity stake in Forte Oil to Prudent Energy, which was investing through Ignite Investments and Commodities Limited."
  },
  {
    "headline": "Foundations targets 1,000 in Ibadan ‘Operation feed the widows’",
    "summarized_story": "Over 1,000 persons are expected to benefit from the ‘operation feed the widows’ outreach of a non-governmental organisation, AbidingTV Initiatives, in Ibadan, capital of Oyo State.\nThe initiative, which is in its third edition, will hold at the UMC Primary School, Obafemi Awolowo Road, Oke-Ado, Ibadan on December 19.\nCEO of Abiding Television Limited, who is the initaitor of the outreach, Mr. Arinola Yinka, said the initiative was to help the less privileged.\n- Advertisement -“The Initiative also aims at demonstrating the love of God by spreading love to indigents.\nAll our campaigns are centered on people’s needs which further improve the quality of their lives,” he said."
  },
  {
    "headline": "Buhari unveils eNaira October 25-CBN",
    "summarized_story": "From Uche Usim, AbujaAfter over three weeks postponement, President Muhammadu Buhari will now unveil the Nigerian Central Bank Digital Currency (CBDC), known as the eNaira, on Monday 25 October 2021, at the State House, Abuja.\nThe CBN Spokesman, Osita Nwanisobi, who disclosed this in a statement, added that the theme of the eNaira is: “Same Naira, more possibilities”.\n“The eNaira, therefore, marks a major step forward in the evolution of money and the CBN is committed to ensuring that the eNaira, like the physical Naira, is accessible by everyone”, he said.\n“Since the eNaira is a new product, and amongst the first CBDCs in the world, we have put a structure to promptly address any issue that might arise from the pilot implementation of the eNaira.\nAccordingly, following Monday’s formal launch by the President, the Bank will further engage various stakeholders as we enter a new age consistent with global financial advancement”, he added."
  },
  {
    "headline": "Oyo jail break: Over 300 inmates recaptured",
    "summarized_story": "… Unconfirmed report says gunmen kill 2 Amotekun personnelFrom Oluseye Ojo, IbadanController of Correctional, Oyo State Command, Mr. Noel Ailewon, has said more than 300 inmates of the Medium Security Custodial Centre, Abolongo, Oyo, in Oyo State, that escaped during yesterday’s attacks have been recaptured.\nHe made the disclosure in an interview with journalists at the facility in Abolongo, on Saturday, saying profiling of the recaptured inmates and those that did not escape was ongoing.\nAilewon stated that he was informed about the incident around 10:05p.m., by the head of the custodial centre.\nBut journalists that went to Abolongo were not allowed to enter the main Custodial Centre.\nShortly after the interview with Ailewon, recaptured inmates were brought into the facility in one mini black maria and a big black maria as well."
  },
  {
    "headline": "BREAKING! Kanu: IPOB threatens one week lockdown in S’East from Nov, 5",
    "summarized_story": "From Stanley Uzoaru, OwerriIn determination for an unconditional release of its leader, Nnamdi Kanu, the Indigenous People of Biafra(IPOB) has threatened to lockdown the entire South East States from November,5 if their leader is not released from the Department of State Service custody.\nAlthough in between the date for the sit-at-home, the group has exempted Sunday, November, 7 for people to worship.\n“Failure to release our leader onyendu Mazi Nnamdi Kanu on or before November 4, 2021, our one week Sit-At-Home begins on November 5, 2021 till November 10.\nWe can never allow our leader onyendu Mazi Nnamdi Kanu to be tried secretely and we can never also allow him to be tried under Sharia law under any guise.\nNnamdi Kanu must be freed because he committed no crime."
  },
  {
    "headline": "Igboho working with Boko Haram sponsors -FG",
    "summarized_story": "“We call on these countries to desist from aiding subversive acts by Kanu and IPOB against the state of Nigeria and its people.\nThe AGF also the Federal Government has received the report on the financers of Adeniyi Sunday Adeyemo (a.k.a Sunday Igboho).\nThe report revealed that Sunday Igboho is a Director and signatory to Adesun International Concept Limited registered on 23rd April, 2010.\nInvestigation reveals that Adesun International Concept Ltd (belonging to Igboho) transferred the sum of N12, 750,000 to Abbal Bako & Sons.\nChief Sunday Adeyemo a.k.a Igboho Oosa was not into Oodua Nation until last year."
  },
  {
    "headline": "Night of glitz and glamour as The Sun celebrates distinguished Nigerians",
    "summarized_story": "The ceremony, which has unarguably become the biggest media event in Africa, honoured 24 outstanding Nigerians, for remarkably distinguishing themselves in their various fields of endeavours.\nThe paraphernalia of some state governments were literally moved to the award venue, underscoring the importance of Africa’s biggest media event.\nIt was indeed a night of glitz, glamour and honour.\nThe award went to two individuals, who were singled out for their philanthropy and large-heartedness in reaching out to the needy and downtrodden.\nThe Sun Lifetime Achievement Award went to four distinguished and respected Nigerians."
  },
  {
    "headline": "FG: Nnamdi Kanu Liable for Murder of Akunyili’s Husband, Gulak, 175 Others",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami (SAN), made these allegations yesterday while unveiling the findings of a Presidential Committee set up to investigate Kanu and Ighoho.\nThe government further accused Kanu of being responsible for the murder of a former Presidential Aide, Ahmad Gulak, and over 177 others in the South-East.\n“That 175 security personnel were killed by IPOB/ESN, comprising 128 policemen, 37 military personnel and 10 other security operatives.\nGovernment further alleged that between 2013 and 2020, Igboho received N127 million from several financiers, including a federal lawmaker.\n“The major financier of the fugitive and separatists was found to be a federal lawmaker in the National Assembly."
  },
  {
    "headline": "NCC Alerts Nigerians to Deadly FluBot Malware Targeting Bank Accounts",
    "summarized_story": "*Software uses Android devices to steal banking information*9-point advisory issued for protectionEmma OkonjiThe Nigerian Communications Commission (NCC) yesterday raised the alarm about what it described as an extremely damaging malware called “FluBot” which attacks Android mobile banking applications.\n“According to the information received today (Thursday), October 21, 2021, from the Nigeria Computer Emergency Response Team (ngCERT), Flubot targets Androids with fake security updates and App installations,” NCC’s Director of Public Affairs, Ikechukwu Adinde, said in a statement issued yesterday.\n“Consequently, it secures admittance into the device through SMS and proceeds to transmit similar messages to other contacts that may be on the device it has attacked enticing them into downloading the fake app.\n“It suffices to say that, when Flubot infects a device, it can result in incalculable financial losses.\n“Additionally, the malware creates a backdoor which grants access to the user’s device, thus enabling the invader or attacker to perform other criminal actions, including launching other variants of malware.”The NCC subsequently issued an advisory to protect telecoms consumers from falling victim."
  },
  {
    "headline": "PDP’s National Convention Threatened, Secondus Wants Convention Stopped",
    "summarized_story": "In a letter by Oyetibo dated October 21, 2021, addressed to the following officers of the party: The PDP Acting National Chairman, the Chairman, PDP National Convention Committee, the PDP National Organising Secretary, the PDP National Legal Adviser and the PDP National Secretary C/O Chief E.O Oddey, Odey and Odey Solicitors of above address Suite 120-122 Pan Bank Building No.\nOyetibo said that CA/PH/341/2021: Prince Uche Secondus V Ibeawuchi E. Alex & ORS and the pendency of the application for injunction to restrain the holding of the national convention.\n“An appeal has been filed and entered against the judgment at the Court of Appeal, Port Harcourt Judicial Division.\nIn addition, an Application on Notice has been filed in which Prince Uche Secondus is seeking, inter alia, the following orders,” the letter stated.\nYours faithfully, Tayo Oyetibo, SAN, FCIArb, FNIALS.”It was learnt that the suit is billed for judgement on Tuesday next week."
  },
  {
    "headline": "For the Record: Full Text of AGF’s Statement on Outcome of Kanu, Igboho Investigation",
    "summarized_story": "As you are aware Nnamdi Kanu, the self-acclaimed leader of Indigenous People of Biafra (IPOB), has been at the center of a subversive campaign against the Nigerian State.\nConsequently, Nnamdi Kanu was arrested on 14th October, 2015.\nThe destructive activities of IPOB/ESN pose serious threat to Nigeria’s National Security and its corporate existence, which resulted into re-arrest of Nnamdi Kanu and members of his group.\nThe eventual re-arrest of Nnamdi Kanu in June 2021, and some members of his group led to the inauguration of a Presidential Ad-hoc Committee, comprising twenty-four (24) members drawn from:1.\nWe call on these countries to desist from aiding subversive acts by KANU and IPOB against the state of Nigeria and its people."
  },
  {
    "headline": "FG’s Report Unmasks Igboho’s Sponsors, Accuses Kanu of Instigating Killings",
    "summarized_story": "Malami noted that in the process, 396 firearms and 17,738 ammunition were carted away by Nnamdi Kanu led IPOB and ESN.\n“Some of the state actors aided Kanu, even as a fugitive, in his destructive mission, ignoring the terrorist nature of his activities.\n“We call on these countries to desist from aiding subversive acts by Kanu and IPOB against the state of Nigeria and its people.\nHe added that N273,198,200.00 transaction outflows was recorded from Sunday Igboho’s account between March 15, 2013 and March 11, 2021.\n“The report found connections of financial transaction between Adesun International Concept Ltd (belonging to Igboho) and some construction companies and businesses among others."
  },
  {
    "headline": "BREAKING: Senator Dino Melaye Did Not Graduate With A First-Class Degree From Baze University - Sources",
    "summarized_story": "Former Kogi West Senator in the eighth National Assembly, Dino Melaye, graduated with Second Class Lower Division and grappled with several “carry-overs” while studying Law at the Baze University in the Federal Capital Territory, Abuja, SaharaReporters has learnt.\nSaharaReporters obtained the Baze University convocation booklet which showed, contrary to trending reports that Melaye finished top of his class, that the senator finished with a second class division degree.\nSome online reports had claimed that Melaye emerged as the best graduating student of Baze University, Abuja, despite currently staying in Dubai, the United Arab Emirates.\nSaharaReporters has confirmed from documents that the former senator did not finish with a first class degree in Law from the university.\nSee Also Exclusive ABU Whistleblowers Contradict VC, Insist Dino Melaye Did Not Graduate“Dino and I are supposed to be ‘friends’ but differences never permitted while we were in school."
  },
  {
    "headline": "BREAKING: Senator Dino Melaye Did Not Graduate With A First-Class Degree From Baze University - Sources",
    "summarized_story": "Former Kogi West Senator in the eighth National Assembly, Dino Melaye, graduated with Second Class Lower Division and grappled with several “carry-overs” while studying Law at the Baze University in the Federal Capital Territory, Abuja, SaharaReporters has learnt.\nSaharaReporters obtained the Baze University convocation booklet which showed, contrary to trending reports that Melaye finished top of his class, that the senator finished with a second class division degree.\nSome online reports had claimed that Melaye emerged as the best graduating student of Baze University, Abuja, despite currently staying in Dubai, the United Arab Emirates.\nSaharaReporters has confirmed from documents that the former senator did not finish with a first class degree in Law from the university.\nSee Also Exclusive ABU Whistleblowers Contradict VC, Insist Dino Melaye Did Not Graduate“Dino and I are supposed to be ‘friends’ but differences never permitted while we were in school."
  },
  {
    "headline": "EXCLUSIVE: Buhari To Visit Saudi Arabia, Europe On Tuesday To Attend Lesser Hajj, Undergo Medical Checkup",
    "summarized_story": "President Muhammadu Buhari will on Tuesday leave the country for Saudi Arabia and later proceed to France and Scotland where he is expected to begin a fresh round of medical checkup, SaharaReporters has learnt.\nSaharaReporters gathered that Buhari will spend up to two weeks on his medical tour but his first point of call is Saudi Arabia for Umrah, otherwise known as the Lesser Hajj.\nFile Photo: Buhari medical tourismSaharaReporters learnt that the President after performing the Umrah will then go to Europe for his medical examinations.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia."
  },
  {
    "headline": "EXCLUSIVE: Buhari To Visit Saudi Arabia, Europe On Tuesday To Attend Lesser Hajj, Undergo Medical Checkup",
    "summarized_story": "President Muhammadu Buhari will on Tuesday leave the country for Saudi Arabia and later proceed to France and Scotland where he is expected to begin a fresh round of medical checkup, SaharaReporters has learnt.\nSaharaReporters gathered that Buhari will spend up to two weeks on his medical tour but his first point of call is Saudi Arabia for Umrah, otherwise known as the Lesser Hajj.\nFile Photo: Buhari medical tourismSaharaReporters learnt that the President after performing the Umrah will then go to Europe for his medical examinations.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia."
  },
  {
    "headline": "Benue Businessman Drags Two Judges To Judicial Council For Misconduct, Abuse Of Position In Case Involving Governor Ortom",
    "summarized_story": "“He also held that I did not have the locus standi (the right to sue) to bring up the matter to court when I approached it.\n“Judges are to follow the law as it is written and what the superior courts say it is.\nJudges are duty-bound to answer questions brought to them and not refuse to answer them at all ostensibly because a person lacks the locus standi.\n“These 2 judges (along with another) seem to have the unenviable reputation in the Benue judiciary of being pro-government, others insist.\nOn that 17 March 2021, also both judges gave contradictory judgements on the issue of locus standi in the same day."
  },
  {
    "headline": "Masari backtracks, asks FG to declare state of emergency on insecurity",
    "summarized_story": "Aminu Masari, governor of Katsina, has asked the federal government to declare a state of emergency on insecurity.\nAdvertisementHis position comes months after he faulted the call by the house of representatives in April, asking the federal government to declare a state of emergency on insecurity.\nAre we not overstretching them?”But while declaring open the 2021 third quarter general meeting of the conference of state legislators of Nigeria on Saturday, Masari urged the federal government to declare a state of emergency on insecurity.\n“In Katsina state, our major problem is the security challenge we are facing in some parts of the state.\nAdvertisement“I wish to call on the federal government to declare emergency on the nation’s security in order to bring an end to loss of lives and properties across the state."
  },
  {
    "headline": "Masari backtracks, asks FG to declare state of emergency on insecurity",
    "summarized_story": "Aminu Masari, governor of Katsina, has asked the federal government to declare a state of emergency on insecurity.\nAdvertisementHis position comes months after he faulted the call by the house of representatives in April, asking the federal government to declare a state of emergency on insecurity.\nAre we not overstretching them?”But while declaring open the 2021 third quarter general meeting of the conference of state legislators of Nigeria on Saturday, Masari urged the federal government to declare a state of emergency on insecurity.\n“In Katsina state, our major problem is the security challenge we are facing in some parts of the state.\nAdvertisement“I wish to call on the federal government to declare emergency on the nation’s security in order to bring an end to loss of lives and properties across the state."
  },
  {
    "headline": "NRC gives customers 2 weeks for unused tickets as Abuja-Kaduna train services resume",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has resumed services on the Abuja-Kaduna route.\nAdvertisementTrain operations on the Abuja-Kaduna route were cancelled on Thursday, after an attack which damaged the rail track.\nIn one of the attacks, the window of the driver compartment of the train that was plying the Abuja-Kaduna route at the time was shattered.\nIn a statement on Saturday, the NRC also asked customers to ensure that they give 48-hour notice before their scheduled trips with the unused tickets.\nAdvertisement“Customers with unused tickets for the 21st and 22nd of October should kindly contact the customer care unit ([email protected] and 01 888 7741) for rescheduling."
  },
  {
    "headline": "NRC gives customers 2 weeks for unused tickets as Abuja-Kaduna train services resume",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has resumed services on the Abuja-Kaduna route.\nAdvertisementTrain operations on the Abuja-Kaduna route were cancelled on Thursday, after an attack which damaged the rail track.\nIn one of the attacks, the window of the driver compartment of the train that was plying the Abuja-Kaduna route at the time was shattered.\nIn a statement on Saturday, the NRC also asked customers to ensure that they give 48-hour notice before their scheduled trips with the unused tickets.\nAdvertisement“Customers with unused tickets for the 21st and 22nd of October should kindly contact the customer care unit ([email protected] and 01 888 7741) for rescheduling."
  },
  {
    "headline": "‘Toxic concoctions’ -- army tackles The Economist over article describing soldiers as ‘ghosts’",
    "summarized_story": "The Nigerian Army has countered an article by The Economist, which criticises the federal government on the security challenges in the country and describes “many” soldiers as “ghosts”.\nAdvertisementThe article, published earlier on Saturday, had made references to security agencies such as the army and the police, noting that the government needs to do more improve security.\nBut many of its soldiers are “ghosts” who exist only on the payroll, and much of its equipment is stolen and sold to insurgents,” the article reads.\nBut in a statement issued hours after the article was published, the army criticised the position of The Economist on the efforts of the military, describing it as a report done “without due diligence”.\nHow can the Nigerian Army that has restored democracies, brought peace to troubled lands and stabilised the sub-region through the dint of hard work, commitment to duty, discipline and professionalism be so denigrated?"
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technology is awesome, but it’s yet to conquer stuttering",
    "summarized_story": "Stuttering in a tech-enabled worldOne can be forgiven for thinking that there is a tech solution somewhere that does away with stuttering.\nStuttering has no known cure, and the best technology can currently do is what therapy does — treat or manage the condition like other speech defects.\nPeople can get the most out of treatment if they address stuttering early enough — preferably as children.\nNumbers don’t lieAccording to The Stuttering Foundation, stuttering affects 1% of the world’s population; depending on what global population you accept, that’s 78 or 79 million people.\n“Stuttering has shaped my personality; I’m reserved, and I don’t say anything around strangers unless it’s necessary because I don’t like being asked to repeat myself."
  },
  {
    "headline": "Techpoint Awards, AltSchool by TalentQL, Privacy Roundtable PT2, Brass’ $1.7m funding",
    "summarized_story": "This lack of degree options and the scarcity of developers is what TalentQL is looking to solve with AltSchool.\nThere’s more: TalentQL launches AltSchool Africa to train entry level tech talent for freeSo you care about your privacy?\nOn Thursday, October 21, 2021, Brass, a Nigerian digital bank, announced $1.7 million in funding to aid their growth across Africa.\nCurrently, the platform provides SMEs with various services, including payroll and expense management, credit and payment services, and API support.\nThey claim to have disbursed $2 million in credit via their crediting platform, Brass Capital, which is still in the Beta phase."
  },
  {
    "headline": "What does the African fintech need?",
    "summarized_story": "The virtual event focused on fintech’s allure to investors, the benefits Africans derive from fintech start-ups, partnerships between banks and fintech startups, and the role of regulators in the industry.\nHowever, Agboola disagreed with that view, arguing that he sees a situation where fintech complement the works that banks do and vice versa, advocating for partnerships between banks and fintech.\nDeepening financial inclusion is high on the agenda of Nigeria’s Central Bank and Y’ello Digital Financial Services has been playing its part in helping the apex realize this goal.\nWith its wide network of over 150,000 MoMo agents, the organization offers financial services to customers.\nWith 54 countries in Africa, providing financial services to users comes with lots of regulatory hurdles in each country."
  },
  {
    "headline": "Buhari to unveil eNaira on Monday says CBN",
    "summarized_story": "President Muhammadu Buhari is scheduled to formally unveil the Nigerian Central Bank Digital Currency (CBDC), known as the eNaira, on Monday 25 October 2021, at the State House, Abuja, Nigeria’s Central Bank said on Saturday.\nRead also: CBN suspends eNaira launchFollowing a series of engagements with relevant stakeholders including the banking community, fintech operators, merchants and indeed, a cross-section of Nigerians, the CBN designed the digital currency, which shall be activated on Monday, October 25, 2021.\nThe eNaira, therefore, marks a major step forward in the evolution of money and the CBN is committed to ensuring that the eNaira, like the physical Naira, is accessible by everyone.\nThe CBN will continue to work with relevant partners to ensure a seamless process that will benefit every user, particularly those in the rural areas and the unbanked population.\nThe theme of the eNaira is: “Same Naira, more possibilities”, the statement reads."
  },
  {
    "headline": "Meet Nigeria’s 3 unicorns in 2021",
    "summarized_story": "In business, a unicorn is a privately held startup company valued at over $1 billion.\nIn September 2014, 16 investors participated in the $3 million raised in the seed and angel rounds.\nThe company completed a $40 million funding in series C round in October 2017 led by CRE Venture Capital.\nFive out of these investors led the startup to be a Unicorn in September after a series E round funding.\nIn March 2021, Flutterwave raised a $170 million Series C funding round."
  },
  {
    "headline": "NCC alerts telecom users of Flubot malware targeting bank accounts",
    "summarized_story": "The Nigerian Communications Commission (NCC) has warned Nigerian telecom users of Flubot, a new, high-risk and extremely-damaging, malware that targets bank accountsNCC in a press statement signed by its spokesperson, Ikechukwu Adinde, said the Nigeria Computer Emergency Response Team, ngCERT affirmed that Flubot “impersonates Android mobile banking applications to draw fake web view on targeted applications” and its goal transcends stealing personal data and essentially targets stealing of credit card details or online banking credentials.\nMalware is a generic word used to describe a virus or software, designed specially to “disrupt, damage, or gain unauthorized access to a computer system.\nAdditionally, the malware creates a backdoor which grants access to the user’s device, thus enabling the invader or attacker to perform other criminal actions, including launching other variants of malware.\nThis will delete any data on your phone, including personal data,Other measures given by the commission are: ” Do not restore from backups created after installing the app.\nYou may contact ngCERT on incident@cert.gov.ng for technical assistance, You will also need to change the passwords to all of your online accounts, with urgency, around your online bank accounts, If you have concerns that your accounts may have been accessed by unauthorised people, contact your bank immediately.”"
  },
  {
    "headline": "#EndSARS: Obaseki meets Edo youths, to pay N190m compensation to victims of police brutality – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance during a meeting with the youths at the Government House in Benin City.\nHe said, “I set up a panel to investigate cases of police brutality against the people.\nThe panel recommended compensation to be paid to victims totaling N190 million, while the amount of judgment sum recommended being enforced was N98 million.\nReassuring that his administration will do all within its power to implement the 15 recommendations of the panel, Obaseki said Edo youths are the greatest resources of the state.\nA representative of the youths, Solomon Idiogbe, commended Obaseki for improved security across the state, urging him to engage more youths as a means of checking cultism in Edo State."
  },
  {
    "headline": "Obaseki charges judiciary on speedy conviction of sexual, gender-based violence offenders – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge at a one-day sensitization and capacity building workshop on Gender-Based Violence (GBV) for High Court Judges and judicial officers in Edo State, held in Benin City.\nIt is our collective responsibility to drive the desired changes that are required to ensure that we have a society that is free of violence, particularly gender-based violence.\n“We have launched a sexual offenders’ register which serves as a tool to shame all those persons who have been convicted in gender-based violence.\n“The governor has assured us of providing requisites; we need to build new courthouses and a special courthouse for gender-based violence, with special judges assigned to these courts.”In her welcome remarks, Ms.\nLamptey further applauded the state government’s commitment to ensuring access to justice for all, especially for women and girls in Edo."
  },
  {
    "headline": "LASG Reconstitutes Interim Caretaker Committe For ASPMDA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Lagos State Government has reconstituted the interim Caretaker Committee for the Auto Spare Parts & Machinery Dealers Association (ASPMDA) in compliance with the judgments of the High Court of Lagos State in Suit No.\nA statement issued by the Lagos State Attorney-General and Commissioner for Justice, Mr. Moyosore Onigbanjo, said that the decision is in compliance with the Court judgements.\nOnigbanjo noted that 15 months after constituting the Interim Caretaker Committee, chaired by Sir.\nSunday Igbanuzue, it has failed to conduct elections for new Executive Officers of ASPMDA.\nGovernor has directed the immediate dissolution of the Interim Caretaker Committee constituted by the State Government in June 2020 and chaired by Sir."
  },
  {
    "headline": "Flying officers cup:Edo Queens pip Confluence Queens ,face Robo in finals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Queens Football Club of Benin yesterday defeated the Confluence Queens of Lokoja by a lone goal in the semifinals stage of the Flying Officers Preseason Tournament and will engage FC Robo of Lagos in the last game of the tournament on Sunday.\nThe final match is scheduled for 3 PM on Sunday at the same FCT Sports Complex.\nEmem Essien’s late strike earned the Benin girls the important victory to once again vie for honour in the tournament they won two years ago in Abuja.\nEdo Queens on the road to the finals of the women football preseason tournament did not concede any goal and won all their games.\nThe two premier league clubs are not new to themselves as they met in the Betsy Obaseki Women Football Tournament held in Benin recently."
  },
  {
    "headline": "Nigerian army reacts to the Economist’s publication on deepening insecurity",
    "summarized_story": "The Nigerian Army has accused a London-based magazine, ”The Economist” of trying to denigrate, demonise and destabilise the Nigerian government in its recent article entitled “Insurgency, secessionism and banditry threaten Nigeria”.\nHe said the “Nigerian army remained a professional, hard-fighting and globally respected institution”.\nHe said the Nigerian army had distinguished itself as a worthy contributor to global peace and security through regional, continental and international peace keeping and peace support operations.\n“The Nigerian army is certainly not what the so-called report by the Economist tried to characterize it.\nAccording to him, “the gallant officers and soldiers of Nigerian army were undeterred, undistracted and totally unfazed by the hare-brained assertions contained in that silly report.” (NAN)"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "262 Oyo prison escapees recaptured, 575 still at large",
    "summarized_story": "The Nigeria Correctional Service (NCS) has said 262 inmates from the 837 that escaped from the Abolongo Correctional Centre in Oyo town have been recaptured.\nSpokesperson of the NCS Oyo command, Olanrewaju Anjorin who stated this in a statement on Saturday, said while 262 escaped inmates had been recaptured, 575 were still at large.\nRecall that gunmen invaded the facility on Friday at about 9.30 p.m., blowing up the facility with dynamite and freeing all 837 awaiting trial inmates.\nMr Anjorin said, “All the awaiting trial detainees were forced out of custody, the cells housing the convicts and the female inmates were not vandalised.\n“Of this number, awaiting trial persons were 837 representing 92 per cent with just 64 convicts,” Mr Anjorin said"
  },
  {
    "headline": "IPOB threatens one week lockdown in Southeast from November 5",
    "summarized_story": "Separatist group, the Indigenous People of Biafra (IPOB) threaten to lockdown the entire South East States from November 5 if their leader, Nnamdi Kanu, is not released from the Department of State Service (DSS) custody.\n“Failure to release our leader onyendu Mazi Nnamdi Kanu on or before November 4, 2021, our one week Sit-At-Home begins on November 5, 2021 till November 10,” Powerful said.\nWe can never allow our leader onyendu Mazi Nnamdi Kanu to be tried secretely and we can never also allow him to be tried under Sharia law under any guise.\n“Unless the federal government releases him unconditionally before November 4, we shall sacrifice one week for him as a warning protest to convey to our oppressors that Nnamdi Kanu represents over 70 million Biafrans.\nNnamdi Kanu must be freed because he committed no crime."
  },
  {
    "headline": "Buhari’s govt inept, dictatorial, incompetent -The Economist",
    "summarized_story": "UK based magazine, The Economist, has described the government of President Muhammadu as inept, dictatorial and incompetent, that the Nigerian leader also failed to tackle corruption, which was his main campaign message in 2015.\n“Before COVID-19, 40 per cent of them were below Nigeria’s extremely low poverty line of about $1 a day.\nNigeria’s Army is mighty on paper.\nThe news magazine said in order to stop the slide towards lawlessness, Nigeria’s government should make its own forces obey the law.\nIt argued that despite the great potential of the country, youths were beginning to emigrate in droves because of the sorry state of Nigeria"
  },
  {
    "headline": "FBN Holdings denies knowledge of Otedola’s majority shares acquisition",
    "summarized_story": "FBN Holdings Plc, the holding company for First Bank of Nigeria Limited, has denied knowledge of acquisition of majority of its shares by billionaire businessman, Mr Femi Otedola.\nThis followed media reports that Otedola has acquired majority of its shareholding.\nThe statement said, “The attention of FBN Holdings Plc has been drawn to media reports today (Friday) that a certain individual has acquired significant shareholding interest in FBN Holdings Plc.\n“As a listed company, the shares of FBN Holdings are publicly traded, and sale and acquisition of shares is expected in the normal course of business.\n“The company is yet to receive any notification from the individual mentioned in the media report, of such acquisitions.”"
  },
  {
    "headline": "Rundunan ‘Yan Sanda Ta Kama Wadanda Ake Zargi Da Garkuwa Da Mutane A Kogi",
    "summarized_story": ""
  },
  {
    "headline": "Sin Za Ta Samar Da Alluran Rigakafin Cutar COVID-19 Biliyan 2 Ga Kasashen Waje A Bana",
    "summarized_story": ""
  },
  {
    "headline": "Kara Azama Kan Kiyaye Rawayan Kogi Ya Nuna Aniyar Kasar Sin Ta Raya Kanta Ba Tare Da Gurbata Muhalli Ba",
    "summarized_story": ""
  },
  {
    "headline": "Yunkurin Amurka Na Tada Rikici Ta Hanyar Amfani Da Natun Kare Hakkin Dan Adam Ba Zai Cimma Nasara Ba",
    "summarized_story": ""
  },
  {
    "headline": "Xi’an: An Kaddamar Da Wasannin Nakasassu Na Kasar Sin Karo Na 11 Da Wasannin Olympics Na Musamman Karo Na 8",
    "summarized_story": ""
  },
  {
    "headline": "N22b Ponzi scheme: How Daystar, Elevation Church got involved",
    "summarized_story": "Some of the investors are said to be members of different churches in Nigeria, including Daystar Christian Centre and The Elevation Church.\nDifferent people have taken to social media to reveal their ordeals.\nMajor investors include Elevation church which gave them N500M.\nThe Ajetunmobis are said to be members of The Elevation Church and have attended a course at Daystar Christian Centre, popularly known as Daystar Leadership Academy.\n“The Elevation Church has no such investment, whatever."
  },
  {
    "headline": "N22b Ponzi scheme: How Daystar, Elevation Church got involved",
    "summarized_story": "Some of the investors are said to be members of different churches in Nigeria, including Daystar Christian Centre and The Elevation Church.\nDifferent people have taken to social media to reveal their ordeals.\nMajor investors include Elevation church which gave them N500M.\nThe Ajetunmobis are said to be members of The Elevation Church and have attended a course at Daystar Christian Centre, popularly known as Daystar Leadership Academy.\n“The Elevation Church has no such investment, whatever."
  },
  {
    "headline": "Nnamdi Kanu’s lawyer to Malami: Spreading false narrative won’t work’",
    "summarized_story": "In a Facebook post, the lawyer noted that spreading false narratives against the IPOB leader “will fail”.\nThis is according to a committee set up by the President, Major General Muhammadu Buhari (retd.\nIt said the attacks, carried out between October 2020 and June 2021, led to the killing of 175 security agents.\nNote that the media has been awashed with this false narrative right from the very first day our client was extraordinarily renditioned to Nigeria, even before the amended seven charges were filed twice.\n“Ignore their media propaganda, please, because Onyendu Mazi Nnamdi Kanu has not committed any offence known to law."
  },
  {
    "headline": "Nnamdi Kanu’s lawyer to Malami: Spreading false narrative won’t work’",
    "summarized_story": "In a Facebook post, the lawyer noted that spreading false narratives against the IPOB leader “will fail”.\nThis is according to a committee set up by the President, Major General Muhammadu Buhari (retd.\nIt said the attacks, carried out between October 2020 and June 2021, led to the killing of 175 security agents.\nNote that the media has been awashed with this false narrative right from the very first day our client was extraordinarily renditioned to Nigeria, even before the amended seven charges were filed twice.\n“Ignore their media propaganda, please, because Onyendu Mazi Nnamdi Kanu has not committed any offence known to law."
  },
  {
    "headline": "Anambra election in jeopardy: IPOB declares sit-at-home from 5 November",
    "summarized_story": "The governorship election in Anambra state on 6 November looks uncertain after the Indigenous People of of Biafra (IPOB), declared one week sit-at-home protest from 5 Nov. till 10 November.\nIf past experience is anything to go by, the streets of Anambra will be desolate on election day, unless Kanu is released before on on 4 November.\n“Failure to release our leader on or before Nov. 4, 2021, our one week Sit-At-Home begins on Nov. 5, 2021 till Nov. 10.\nThe National Security Adviser Maj. General Babagana Monguno said Buhari has ordered that Anambra be overwhelmed by security men to ensure the election successfully holds.\nHowever, since the IPOB has been declaring sit-at-home protests, compliance level has been very high as IPOB appears to be the real political power in the south east region."
  },
  {
    "headline": "Kenya athletes bid Agnes Tirop final farewell",
    "summarized_story": "Slain long-distance Olympic runner Agnes Tirop, a rising star in Kenya’s highly competitive athletics scene, was buried on Saturday at a funeral attended by over 1,000 mourners.\nMourners including fellow athletes lined up to scatter flowers on a white coffin.\nA picture of Tirop, grinning and holding up a bronze medal, was placed on top of the coffin.\n“For us Kenyans, we have lost a hero,” said Hellen Obiri, the women’s 5,000m world champion and a mentor to Tirop.\nShe won bronze medals at the 2017 and 2019 World Championships in the 10,000m."
  },
  {
    "headline": "CBN Holds Crucial Meeting Ahead Of e-Naira Launch Monday",
    "summarized_story": "The Central Bank of Nigeria (CBN) held a crucial meeting on Saturday, according to top officials, ahead of the official launch of the e-Naira on Monday.\nNEWS DIRECT learnt that those present at the meeting were the CBN Governor Godwin Emefiele and executives from the apex bank’s monetary policy, operations compliance, corporate communications and other departments.\nSources said the meeting was to put final touches on the e-Naira ahead of the launch on Monday, after criticisms that trailed the suspension of the initial launch on October 1.\nNigerians had expressed optimism the digital currency would be launched on October 1, before CBN announced its suspension hours before Independence Day celebration.\nSpokesperson for the CBN, Osita Nwanisobi, had at the time said the suspension of the digital currency launch was to allow other events slated for the day to take place."
  },
  {
    "headline": "JUST IN: Olympic Sprinter Alex Quiñónez Shot Dead In Ecuador",
    "summarized_story": "Ecuador’s 200 metres world bronze medallist Alex Quinonez was shot dead in the port city of Guayaquil, authorities announced on Saturday.\nQuinonez, 32, and another person were found dead close to midnight local time on Friday, according to local police.\n“With great sadness, we confirm the murder of our sportsman Alex Quinonez,” the country’s Sports Ministry announced on Twitter.\n“We will act with force.”Ecuador’s Olympic Committee said the death of Quinonez “leaves us with profound pain” and that his “legacy will forever stay in our hearts”.\nBetween January and October this year, the country registered almost 1,900 homicides, compared to about 1,400 in all of 2020, according to the government."
  },
  {
    "headline": "Meet The Brave Abuja-Kaduna Train Driver, Ziya’u Yusuf, Who Survived Gun And Bomb Attacks",
    "summarized_story": "Under rains of bullets, shocks of bomb blasts and shattered windshields, Ziya’u Yusuf, maneuvered the ill-fated Abuja-Kaduna train to terminus.\nBorn in 1988, Mr Yusuf is one of the bravest, efficient and punctual train drivers of the Nigerian Railway Corporation, NRC.\nMr Yusuf holds a National Diploma in Electrical and Electronic Engineering at Abubakar Tatari Ali Polytechnic, Bachi, and joined NRC in 2013.\nWhen their train came under gun and bomb attack by terrorists at Rijana bridge on Wednesday at exactly 7:56pm, Mr Yusuf reportedly directed his colleagues to lie down in the crew compartment to avoid bullets.\nAs the main driver during the attack, the 33-year-old later completed the journey in a relief locomotive past midnight."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Attack Yobe Community",
    "summarized_story": "In the early hours of Saturday, suspected Boko Haram militants in ten gun trucks stormed Katarko village in Yobe State’s Gujba Local Government Area.\nThe assailants drove into the community in a convoy of gun trucks at 8 a.m., according to a source who spoke to DAILY POST from a safe location.\nAccording to him, the attackers were engaged by military stationed in the community.\nAs at the time of reporting this story, the details of the attack were still hazy.\nBoko Haram had previously attacked Katarko village, which is around 20 kilometers from Damaturu, the Yobe State capital."
  },
  {
    "headline": "Nnamdi Kanu: IPOB dares FG, threatens to shutdown South East ahead Anambra guber poll if…",
    "summarized_story": "The proscribed Indigenous People of Biafra (IPOB), has threatened to shutdown the entire South East part of the country as from November 4 should federal government fails to release its leader Nnamdi Kanu.\nThe threat by IPOB if it goes through will disrupt governorship election in Anambra state scheduled for November 6, 2021.\n“Failure to release our leader onyendu Mazi Nnamdi KANU on or before November 4, 2021, our one week Sit-At-Home begins on November 5, 2021 till November 10.\nWe can never allow our leader onyendu Mazi Nnamdi KANU to be tried SECRETLY and we can never also allow him to be tried under SHARIA law under any guise.\nNnamdi Kanu must be freed because he committed no crime."
  },
  {
    "headline": "Breaking: Mason Mount mounts hatrick as Chelsea compound Norwich City Premier League woes",
    "summarized_story": "There were no Romelu Lukaku and Timo Werner, yet Chelsea triggered a sensational performance to outclass Norwich City 7-0 in Saturday’s early Premier League kickoff at Stamford bridge.\nMidfielder Mason Mount fired hatrick with Callum Hodson-Odoi, James, Ben Chilwell and an own-goal completing a deserved victory for the table topping Chelsea.\nDetails loading…"
  },
  {
    "headline": "Breaking: Gunmen attack another correctional centre, free all inmates",
    "summarized_story": "Gunmen on Friday night attacked the federal correctional facility in Abolongo in Oyo state and set free all the prisoners at the centre.\nBlueprint gathered that the gunmen stormed the centre at about 10.30pm and launched heavy attack.\nThey were reported to have blown the entrance to the centre with grenades to gain access and set prisoners free.\nIt was gathered that the attack left the facility in disarray with warders scampering for safety.\nAs at Saturday morning, other sister security agencies were deployed at the centre to support men and women of the Nigerian Correctional Service to track down the bandits as well as rearrest prisoners."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "FG to tackle maternal mortality occasioned by loss of blood -NigPilot",
    "summarized_story": "Worried by rising cases of pregnancy-related deaths, the National Blood Service Commission has vowed to drastically reduce the level of maternal mortality occasioned by blood loss during childbirth.\nSpeaking during a media briefing alongside sponsor of the Bill, now an Act of the Parliament, Hon.\nAbas Tajudeen, the Director-General of the agency, Dr. Omale Joseph explained that not less than 15 percent of every 1,000 women die due to blood loss during childbirth and urged Nigerians to imbibe the practice of donating blood.\n“As you donate blood, you’re saving a life, and not only that, research has shown that people who donate blood regularly live more healthy”, he submitted.\nIt would be recalled the Commission’s establishment Bill, which was introduced by Hon."
  },
  {
    "headline": "Birthday Felicitations: NCFront hails exemplary leadership of Kwankwaso, Dokpesi @ 65, 70 -NigPilot",
    "summarized_story": "The leadership of the National Consultative Front, NCFront, has felicitated with Dr. Mallam Rabiu Musa Kwakwanso and Dr. Raymond Dokpesi on the occasion of their 65th and 70th Birthdays anniversaries respectively.\nIn a congratulatory statement issued Friday and signed by the Head, Public Affairs Bureau, Dr Tanko Yunusa, NCFRONT recognized their contributions to nation building and for egalitarian society.\nThe group described the two prominent Nigerians as leaders of conscience who have identified with, supported and contributed to the efforts of the National Consultative Front since its inception.\nIt will be recalled that on the 21st of October, 2021, Dr Raymond Dokpesi, the Chairman of the African Independent Television turned 70, while Mallam Rabiu Musa Kwakwanso clocked 65.\nHe added that Kwankwaso is without doubt a leader , an administrator and philosopher whose thoughts and actions symbolise an embodiment of a political cum leadership ideals that this country should be proud of."
  },
  {
    "headline": "NIA honours Aviation Minister for infrastructural development -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has received the Honorary Fellowship and Distinguished Service Award of the Nigerian Institute of Architects, NIA, for his infrastructural developments within the aviation sector.\nThe Award was given to the minister at the Institute’s Architecture Annual Award 2021 in Abuja on Thursday.\nPresenting the award, the Institute noted that under his supervision, the Ministry of Aviation embarked upon 157 projects and delivered 134 to 100 percent completion for the first time in the history of Nigerian Aviation.\nThe NIA also cited the rehabilitation of the runways of the Abuja Airport and the Enugu Airport according to ICAO specifications which were not only delivered ahead of schedule, but within budget.\nDisclosing that he has rejected 390 awards in the past, Sirika said he had to make an exception for the NIA award because of the integrity of the institution."
  },
  {
    "headline": "Rubber stamp 9th assembly would approve Buhari’s third term if… – Wabara -NigPilot",
    "summarized_story": "Former president of the Senate, Adolphus Wabara Thursday hinted that the present 9th National Assembly would have approved an unconstitutional third term for President Muhammadu Buhari if he had insisted on going for it.\nWabara spoke Thursday in Abuja as a special guest at the public presentation of the book: “Standing Strong”, authored by former president of the Senate, Ken Nnamani.\nThe former Senate president who stepped down under intense pressure in the 5th assembly thanked President Muhammadu Buhari for standing strong against the pressure from certain quarters for him to seek a third term.\nHe eulogized the author, Sen. Ken Nnamani who he described as uncommon patriot and nationalist who stood strong in the face of pressure from the political lackeys of former president Olusegun Obasanjo who were bent on smuggling the third term agenda into the constitution through a backdoor.\nAlso speaking at the event, former Minister of defence, Theophilus Danjuma while commending the author, described the book as a text book for young Nigerians who are aspiring to lead a “difficult nation like Nigeria.”"
  },
  {
    "headline": "President Buhari To Unveil e-Naira On Monday",
    "summarized_story": "President Muhammadu Buhari is scheduled to unveil the e-Naira on Monday, the Central Bank of Nigeria said on Saturday.\nThe digital currency had been earmarked for public presentation on October 1 but the CBN shelved the plans citing key activities lined up for Independence Day.\n“President Muhammadu Buhari is scheduled to formally unveil the Nigerian Central Bank Digital Currency (CBDC), known as the eNaira, on Monday 25 October 2021, at the State House, Abuja,” the statement said.\n“The eNaira therefore marks a major step forward in the evolution of money and the CBN is committed to ensuring that the eNaira, like the physical Naira, is accessible by everyone.\n“Visit the website to explore the benefits of our eNaira: www.enaira.gov.ng.”"
  },
  {
    "headline": "Low Passenger Turnout As Train Services Resume On Kaduna-Abuja Route",
    "summarized_story": "﻿The Nigerian Railway Corporation (NRC) on Saturday resumed services on the Abuja-Kaduna route two days after it suspended operations following an explosion that rocked a section of the rail track on Wednesday night.\nThe corporation announced suspension of all operations along the route on Thursday after a train almost suffered a derailment at the Rijanna area of Kaduna due to an explosion on the rail line.\nBut normal operations resumed at the Rigasa train station in Kaduna on Saturday after the repair of the damaged portion of the track.\nREAD ALSO: Gunmen Attack Custodial Centre, Free Inmates In OyoHowever, Channels Television observed that there was a low turnout of passengers on the route despite the heavy deployment of more security forces on the train.\nPassengers called for more security officials to be deployed along the route to reassure commuters."
  },
  {
    "headline": "837 Inmates Fled Oyo Custodial Centre, 575 Still On The Run – NCoS",
    "summarized_story": "A total of 837 inmates awaiting trial escaped from the Medium Security Custodial Centre in Abolongo, Oyo State.\nHe explained that yet to be identified gunmen attacked the custodial centre at about 9:30pm on Friday, adding that some of them have returned.\nOf this figure, 837 people are awaiting trial, representing 92 per cent of the total population of inmates there while 64 are convicts.\nThe invaders were said to have arrived at the custodial centre heavily armed with sophisticated weapons.\n“Those who are on the run are advised to turn themselves in, as an escape from lawful custody is a serious offence."
  },
  {
    "headline": "Development Is The Only Path To End Insecurity – Buratai",
    "summarized_story": "Retired Army Chief, Tukur Buratai, says all-round development is essential in putting an end to insecurity in the country.\nTherefore, the issue of development in all sectors must be addressed before insecurity can be resolved.\nThis is why issues of development in all sectors must be addressed before security can be resolved.\n“You cannot successfully fight insecurity during a period of persistent insecurity.\nWe must search for security during peacetime, through all-round development,” he said."
  },
  {
    "headline": "Otedola Acquires ‘Substantial’ Stake In FBN Holdings",
    "summarized_story": "First Bank of Nigeria’s parent company, FBN Holdings Plc, say billionaire businessman, Femi Otedola, has acquired a substantial stake in its business.\nAccording to a notice signed by company secretary, Seye Kosoko, Otedola’s stake in FBN Holdings now stands at 5.07 percent.\n“We refer to our communication to the market dated October 22, 2021 on the above subject wherein we stated that we would inform the public of any substantial acquisition, upon receipt of notification from the Shareholder,” the notice said.\nREAD ALSO: President Buhari To Unveil e-Naira On Monday“This morning, October 23, 2021, FBN Holdings Plc received a notification from APT Securities and Funds Limited, that their Client, Mr. Otedola Olufemi Peter and his nominee, Calvados Global Services Limited have acquired a total of 1,818,551,625 units of shares from the Company’s issued share capital of 35,895,292,791.\n“Based on the foregoing, the equity stake of Mr. Otedola Olufemi Peter and his nominee in the Company is now 5.07%.”"
  },
  {
    "headline": "Sokoto Govt urges FG to suspend internet blockade",
    "summarized_story": "Sokoto state government has formally written to the Federal Government to suspend the blockade of telecommunications services earlier imposed on 14 local government areas of the state.\nThe request follows an enlarged security council meeting on the fallout of bandits attack on Goronyo market which claimed the lives of 43 people last week.\nGovernor Tambuwal disclosed this Saturday when he received the North-East Governors Forum (NEGF) represented by Governors of Borno and Gombe state, Prof. Babagana Aymara Zulum and Alhaji Muhammad Inuwa Yahaya respectively, who paid a condolence visit to the state over the bandits attack of last week.\nAccording to Governor Tambuwal, the call for the rescinding of the blockade became necessary in view of concerns expressed by security outfits in the state that the outage was affecting the smooth conduct of their works.\nHe said the state government has already forwarded a letter to the Minister of Communications and Digital Economy to review the internet blockade."
  },
  {
    "headline": "Goronyo Killings: North-East Govs donate N20m to SOSG",
    "summarized_story": "A week after the dastardly killings of 43 people in Goronyo local government area of Sokoto state, the six governors of the North-East geopolitical zone have donated the sum of N20 million to Sokoto state government.\nThis is as Governor Aminu Tambuwal of Sokoto state appealed to the Federal Government to provide more boots on the ground in the entire North-West region to roll back the menace of banditry, kidnapping and sundry criminalities.\nIn his response, Gov Aminu Waziri Tambuwal of Sokoto state while applauding the NEGF for its kind gesture, assured that his administration will avail itself with the wealth of experience of his counterparts.\nHe also appealed to the apex government to provide more equipment to the security operatives to enable them confront and curtail the bandits and other criminals.\nGovernor Tambuwal later led his visitors to Ummarun Kwabo Jarma Academy in Sokoto which hosts several orphans whose parents were killed by Boko Haram adherents."
  },
  {
    "headline": "[UPDATED] Jail break: Over 300 inmates rearrested",
    "summarized_story": "At over 300 hundred inmates have been rearrested in the jail break that happened after unknown gun men attacked the Abolongo correctional centre in Oyo state.\nThe Controller of correctioners oyo state command AILEWON NOEL disclosed this while speaking with newsmen at the scene of the incident.\nThe controller also noted that one inmate was killed while trying to jump the fence of the prison.\nHe noted that security operatives are still on the look out for the rearrested of the escaped inmates"
  },
  {
    "headline": "Updated: Pictures from Oyo jailbreak where 1000 inmates freed",
    "summarized_story": "Not less than a thousand prisoners have reportedly escaped from the Abolongo prison in Oyo town after some gunmen attacked the correctional centre and freed all inmates.\nTVC News learnt that the gunmen arrived in their numbers around 11pm last night and started shooting sporadically, and released the inmates who fled to their various destinations.\nThe residence of the resident officer in charge was also riddled with explosives.\nA source told TVC News that there was a little bit of panic around the prison vicinity during the time of the escape, as residents around thought it was a robbery attempt.\nThe Oyo state police command are yet to release an official statement to ascertain the actual number of the escapees."
  },
  {
    "headline": "Tunisia Imposes Covid Vaccine Pass on Tunisians and All Foreign Visitors",
    "summarized_story": "Tunisia is imposing COVID-19 vaccine passes on Tunisians and all foreign visitors, a presidential decree showed on Friday.\nThe decree showed that the jobs of employees who did not receive vaccination in the public and private sectors will be suspended until the vaccine pass is presented.\nThe vaccine pass will also be a necessary document for travelling abroad.\nIt will also be given to foreign visitors who present a certificate of vaccination upon arrival.\nTunisia last month entirely lifted its nightly curfew after about a year in force, as outbreaks of the virus diminished."
  },
  {
    "headline": "US Supreme Court Takes Up Texas Abortion Case, Lets Ban Remain",
    "summarized_story": "The US Supreme Court on Friday agreed to hear on Nov. 1 a challenge to a Texas law that imposes a near-total ban on the procedure and lets private citizens enforce it – a case that could dramatically curtail abortion access in the United States if the justices endorse the measure’s unique design.\nThe justices took up requests by President Joe Biden’s administration and abortion providers to immediately review their challenges to the law.\nThe measure bans abortion after about six weeks of pregnancy, a point when many women do not yet realize they are pregnant.\nLiberal Justice Sotomayor dissented from the court’s deferral of a decision on whether to block enforcement of the law while the litigation continues.\nSotomayor said the law’s novel design has suspended nearly all abortions in Texas, the second most populous U.S. state, with about 29 million people."
  },
  {
    "headline": "Watch Nigeria VP Osinbajo’s Speech at the 6th Year Anniversary of Future Assured Initiative – Arise News",
    "summarized_story": "More than 700 students and 45 teachers have benefited from the Education Empowerment Project, Future Assured.\nThe initiative is the brainchild of Aisha Buhari, Nigeria’s First Lady.\nIt focuses on health advocacy, women and youth empowerment.\nAs the Initiative marks its 6th anniversary, it says more women and children have received tangible healthcare among other benefits."
  },
  {
    "headline": "Baldwin Was Told Gun Was ‘Cold’ Before Movie Set Shooting",
    "summarized_story": "He walked back in and handed it to the film’s star, Alec Baldwin, assuring him it was safe to use because it didn’t have live ammo.\n“Cold gun,” Halls yelled.\nInstead, when Baldwin pulled the trigger Thursday, he killed cinematographer Halyna Hutchins and wounded director Joel Souza, who was standing behind her.\nThe gun was one of three that the film’s armorer, Hannah Gutierrez, had set on a cart outside the building where a scene was being acted, according to the records.\nHalls grabbed the gun from the cart and brought it inside to Baldwin, unaware that it was loaded with live rounds, a detective wrote in the search warrant application."
  },
  {
    "headline": "Watch Nigeria First Lady Aisha Buhari’s Speech at the 6th Year Anniversary of Future Assured Initiative",
    "summarized_story": "More than 700 students and 45 teachers have benefited from the Education Empowerment Project, Future Assured.\nThe initiative is the brainchild of Aisha Buhari, Nigeria’s First Lady.\nIt focuses on health advocacy, women and youth empowerment.\nAs the Initiative marks its 6th anniversary, it says more women and children have received tangible healthcare among other benefits."
  }
]