[
  {
    "headline": "Edo community begs Obaseki to allow completion of donated healthcare project",
    "summarized_story": "Elders of Ugbokun in Ovia North East Local Government area of Edo State, on Thursday appealed to Governor Godwin Obaseki and the Oba of Benin, Ewuare II, to allow for the completion of a health centre project sited in their community.\nThe elders of the community, in conjunction with Talakawa Parliament, a civil society group, led members of the community to the Oba’s palace and also to the Government House to register their demand.\nAnother community leader, Mrs. Osaretin Aigbidodo, said that the siting of the health centre in the community had helped to solve the problem that pregnant women go through before getting medical attention.\nAigbidodo appealed to the duo of the governor and the Oba of Benin to allow the completion of the facility for the benefit of the people of the community.\nOn his part, president of the Talakawa Parliament, Kola Edokpayi, appealed to Obaseki to allow Dr. Woghiren to complete the Ugbokun medical centre project, adding that the gesture would encourage others to invest in their communities."
  },
  {
    "headline": "Edo police arrest three suspected cultists for dehumanising Tik Tok user",
    "summarized_story": "The Edo State Police Command has arrested three suspected cultists who were involved in the assault and déshumanisation of à Tik Tok user simply identified as Olivia.\nIn a press statement on Friday, the Command’s spokesman, SP Kontongs Bello, said the suspects were arrested after a viral video of the assault went viral.\n“During the cause of information and intelligence gathering, the following suspects were arrested at different locations in Benin City.\n“They are Omozejele John ‘M’ (29years) arrested on 26/09/2021 at about 2000hrs at Uteh Community area of Upper Mission Extension Benin City, Smart Ogbeide ‘M’ (29years) was arrested on the 27/09/2021 at about 2130hrs along Paulingo Brothel Uteh Community Upper Mission Extension Benin City while Tajudeen Afesume ‘M’ (30years) arrested in his hideout at Owina Quarters Uteh Community Upper Mission Extension Benin City.\n“The three suspects arrested have all confessed to the crime and further confessed to being members of Aye Secret Cult."
  },
  {
    "headline": "PHOTOS: Some locations in Onitsha deserted by motorists, pedestrians",
    "summarized_story": "PHOTOS: Some locations in Onitsha deserted by motorists, pedestrians"
  },
  {
    "headline": "UNILAG coordinates global COVID-19 surgery study with Guinness World Record",
    "summarized_story": "The study which is the world’s largest scientific collaboration involved over 140,000 patients in 116 countries.\nThere was already a major global inequity in access to safe and affordable surgery across low and middle-income countries, with an urgent need to expand capacity.\nLaunched in March 2020, the COVIDSurgCollaborative has provided data needed to support changes to surgical delivery in the fastest time frame ever seen by a surgical research group.\nEvery day we hear in the news that waiting lists are growing, and patients are unable to access the surgery that they need.\nWhilst surgery volumes have started to recover in many countries, ongoing disruption is likely to continue throughout 2021, particularly in the event of countries experiencing further waves of COVID-19."
  },
  {
    "headline": "Lifting 100m Nigerians out of poverty feasible — Buhari",
    "summarized_story": "By Arogbonlo IsraelPresident Muhammadu Buhari has said his commitment to lift 100 million Nigerians out of poverty in 10 years is still achievable.\nThe president who made this assertion during his Independence Day Broadcast on Friday, assured Nigerians of his readiness to achieve this feat in the nearest years.\n“We remain confident that our goal of lifting 100 million Nigerians out of poverty in 10 years is achievable.\n“Considering the positive impact of our Social Investment Programmes, I recently approved an increase in the number of N-Power programme beneficiaries from 500,000 to 1,000,000.\n“Out of this, 510,000 have started the programme while the competitive selection process for onboarding the outstanding 490,000 beneficiaries is in progress,” Buhari disclosed."
  },
  {
    "headline": "Federal lawmaker identified as separatists’ financier — Buhari",
    "summarized_story": "By Arogbonlo IsraelPresident Muhammadu Buhari has said his government is currently trailing sponsors of separatist leaders, Nnamdi Kanu and Sunday Igboho, and that a serving member of the National Assembly had been identified.\nBuhari made this assertion during his 37-minute Presidential speech delivered on Friday to mark the Nigeria’s 61st independence anniversary.\nThe Present said: “The recent arrests of Nnamdi Kanu and Sunday Igboho Adeyemo, and the ongoing investigations being conducted have revealed certain high-profile financiers behind these individuals.\n“We are vigorously pursuing these financiers including one identified as a serving member of the national assembly.”Nnamdi Kanu is currently in custody of the Department of State Service (DSS) awaiting trial while his Yoruba counterpart, Sunday Igboho is in Beninese prison following delay orchestratred by the vacation embarked upon by judges in Benin Republic.\nVanguard News"
  },
  {
    "headline": "Be proud of Nigeria, Okowa’s Aide Ossai urges",
    "summarized_story": "OssaiThe Special Assitant to Delta State Governor on Special Duties Media Mr. Ossai Ovie Success has called on Nigeria youths to be proud of her country.\nOssai who was appointed by the Delta State Governor at age of 23 noted that Nigeria as a country is facing a lot of challenges but despite that, we need to be proud of our Country.\nREAD ALSO:Federal lawmaker identified as separatists’ financier — Buhari”Today I am proud to celebrate Nigeria at 61.\nI am not unaware of the difficulties we are facing in our country but the fact remains that as citizens, It’s our collective responsibility to be proud of our country.\nThis country belongs to us all and we need to be proud that we are Nigerians because being a Nigerian is a great blessing” he said."
  },
  {
    "headline": "Reveal sponsors of terrorism in Nigeria – Ajulo charges Buhari",
    "summarized_story": "Kayode Ajulo, a constitutional lawyer, has lauded President Muhammadu Buhari’s Independence Day broadcast to the nation, describing it as “inspiring”.\nHe, however, suggested that sponsors of terrorism be revealed so as to tame the menace.\nHe added that the government was “vigorously pursuing these financiers, including one identified as a serving member of the national assembly”.\nReacting to this, Ajulo, a former National Secretary of the Labour Party (LP), said that it had become imperative that sponsors of insecurity be specifically identified.\n“We need to be reassured, hence the need to name and deal with terrorism sponsors accordingly,” he told the News Agency of Nigeria (NAN) in Lagos."
  },
  {
    "headline": "Nigerians express mixed views as Nigeria celebrates 61st Independence Day",
    "summarized_story": "As the country celebrates its 61st independence anniversary, some Nigerians have expressed mixed reactions over the current state of the nation since its freedom from colonial rule in 1960.\nOthers believe that the country has done nothing compared to countries that got independence after Nigeria.\nHe stated, “Our leaders over the years have shown maturity in handling challenges confronting the country.\nHe noted, “Today in this country we have leaders that care less about the challenges Nigerians are going through.\nThe President should be the father of all Nigerians while the governors also be the father of their respective states."
  },
  {
    "headline": "Nigeria@61: What I'll do if war breaks out in Nigeria - Bishop David Oyedepo",
    "summarized_story": "Founder and President of Living Faith Church Worldwide, Bishop David Oyedepo has said he would be the last person to leave the country if war should break out in Nigeria.\nThe African richest pastor, who said until the last person is killed he would not leave Nigeria, however, prayed to God to flush out lovers of war.\n“I have said before that God forbids war breaks out in Nigeria, I will be the last one to leave here.\n“There shall not be war in Nigeria.\nThose who love war God will flush them out."
  },
  {
    "headline": "Abia: Justify our investments in education – Ikpeazu charges overseas scholarship recipients",
    "summarized_story": "The Governor of Abia State, Dr. Okezie Ikpeazu, has charged beneficiaries of scholarships to India from the state to be focused in their studies and uphold good manners in their academic pursuit to justify the state’s investment in their education.\nThis was disclosed in a release by Onyebuchi Ememanka, the Chief Press Secretary to the Abia Governor, and made available to journalists on Friday.\nIkpeazu emphasized that the decision to secure overseas scholarship for youths is driven by his administration’s understanding that capacity building is key and a great vision that is transgenerational.\nGovernor Ikpeazu said that India was chosen because of their world academic outlook and record, being technology and health experts, so he expects a healthy competitive academic environment for the students.\nSpeaking on behalf of the beneficiaries, Miss Okezie Esther, thanked Ikpeazu for the opportunity given to them and promised to make Abia and Nigeria proud."
  },
  {
    "headline": "Treating Nigerians resident in other states as strangers improper – Gov Masari",
    "summarized_story": "The Katsina State Governor, Aminu Bello Masari, has condemned the description of Nigerians residing outside their states of origin as strangers and indigenous Nigerians.\nWhy can’t we move from a situation where we don’t have any indigenous Nigerians in the country but Nigerians?\n“Some of you have been here since and even before the state (Katsina) was created.\nI wonder why you still refer to yourself as indigenous Nigerians.\nWhy Nigeria policemen seem ineffective – Governor Masari"
  },
  {
    "headline": "Hoodlums raze monarch’s palace, PDP chieftain’s residence in Imo",
    "summarized_story": "By Chris Njoku, Owerri- Advertisement -Hoodlums have set ablaze the palace of HRH Eze Obi Ralph Ekezie, the traditional ruler of Obor Autonomous Community in Orlu Local Government Area of Imo State.\nThe monarch, who spoke to newsmen on phone, confirmed the incident but blamed those he called enemies of progress in his community for the act.\nThe monarch further said he was monitoring the development from his abode in Owerri, capital of Imo State.\nOn Friday arsonists also attacked the house of a Peoples Democratic Party (PDP) chieftain and former leader of Orlu Legislative Council, Hon.\nThe entire Obor-Umutanze community has been deserted.”Contacted, the Police spokesman, CSP Michael Abattam confirmed the burning of the traditional ruler’s palace, saying “it is true.”"
  },
  {
    "headline": "Independence Day: 18 inmates pardoned in Ondo",
    "summarized_story": "By Osagie Otabor, Akure- Advertisement -As part of activities to mark the 61st independence, Ondo Governor, Oluwarotimi Akeredolu, on Thursday granted state pardon to 18 convicted inmates serving term in various Correctional centres across the State.\nThe statement charged the freed inmates to be of good conduct and live a crime-free life.\nIn a statewide Independence Day broadcast, Governor Akeredolu called for urgent restructuring of the country to reflect the diversity and address the various misunderstandings as well as high rate of criminality in the country.\nGovernor Akeredolu noted that the current system adopted in the county does not encourage ingenuity.\n“The security challenges bedeviling the country will become a thing of the past if proper devolution of powers is undertaken."
  },
  {
    "headline": "PHOTOS: Police disperse #BuhariMustGo protesters in Abuja",
    "summarized_story": ""
  },
  {
    "headline": "President Muhammadu Buhari lifts ban on Twitter",
    "summarized_story": "President Muhammadu Buhari has approved a conditional lifting of ban on the microblogging giant, Twitter.\nThe president made this position known during a broadcast to mark Nigeria’s 61st Independence Anniversary on Friday in Abuja.\n“Following the suspension of Twitter operations, Twitter Inc. reached out to the Federal Government of Nigeria to resolve the impasse.\n“The Committee, along with its Technical Team, has engaged with Twitter and have addressed a number of key issues.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NASS member, others financing Kanu, Igboho –Buhari",
    "summarized_story": "By Louis IbahPresident Muhammadu Buhari has restated his commitment to the unity of the country.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\n“The recent arrests of Nnamdi Kanu and Sunday Adeyemo, and the ongoing investigations being conducted have revealed certain high-profile financiers behind these individuals.\nWe are vigorously pursuing these financiers, including one identified as a serving member of the National Assembly.\nFellow Nigerians, the past eighteen months have been some of the most difficult periods in the history of Nigeria."
  },
  {
    "headline": "NIGERIA @ 61: PDP, CAN, govs, Lawan, Kalu, Tinubu, others set agenda for FG",
    "summarized_story": "“There shall be showers of blessings because God shall judge the evil doers in the nation.\n“Violence shall become a thing of the past in Nigeria and all Nigerians shall dwell in safety in the name of Jesus.\nChairman, Committee on Primary and Secondary Education, Sanni Okanlawon, also urged Nigerians to unite in the efforts to end insecurity.\n•Lawan, Tinubu urge unity, faithSenate President, Ahmad Lawan, urged Nigerians to unite for the progress of the country and continue to keep faith with their fatherland.\nWhile charging politicians not to heat the polity with provocative utterances, he urged Nigerians to be law-abiding, optimistic and peaceful."
  },
  {
    "headline": "Insecurity: Stop these senseless killings, Pope Francis tells Buhari",
    "summarized_story": "Catholic pontiff, Pope Francis, has asked President Muhammadu Buhari to find ways to stop the killings of Nigerians across the country.\nLamenting what he described as senseless killings of innocent Nigerians by suspected jihadists, the Pope called on the Federal Government to guarantee the safety of all citizens.\nHe said it was not only in Southern Kaduna that people were being massacred, stressing that everywhere in the country, Nigerians were being killed.\n“It is sad that Nigerians are still literally dying every day through very barbaric and senseless killings.\nTo all victims of the violence and killings in the land, we send prayers and condolences."
  },
  {
    "headline": "CIPMN confers award on Sen. Kalu",
    "summarized_story": "Chief Whip of the Senate and former Abia governor, Dr. Orji Uzor Kalu, has been honoured with the prestigious ‘Honorary Fellowship Award’ by the Chartered Institute of Project managers of Nigeria (CIPMN).\nPresident, Governing Council of the institute, Dr. Victoria Okoronkwo, said it found Senator Kalu deserving of the award given the transformation he has brought to his constituency.\nShe said Kalu had done a lot in less than two years as a first time senator.\nFollowing the award, Kalu now becomes an Honorary Fellow of Chartered Institute of Project Managers of Nigeria (FCIPMN).\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Breaking: Protests in Abuja as Nigeria Marks Independence Anniversary",
    "summarized_story": "By Olawale AjimotokanMinutes after President Muhammadu Buhari addressed the nation in commemoration of Nigeria’s 61st Independence anniversary, massive anti- government protest embroiled as protesters took over the roads in Abuja.\nThe police are, however, using teargas to disperse the protesters.\nThe postesters, mainly youth activists, blocked the International Airport Road and were seen carrying the “Buhari Must Go” placards.\nA detachment of police which arrived the scene, removed the roadblock and hauled teargas canisters to disperse the protesters.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Blames Middlemen for Rising Food Prices",
    "summarized_story": "President Muhammadu Buhari has blamed middlemen for the rising prices of foodstuffs in the country .\nIn his national broadcast on Nigeria’s 61st independence anniversary Friday, Buhari said, “Unfortunately, as our food production capacity has increased, food prices have been going up due to artificial shortages created by middlemen who have been buying and hoarding these essential commodities for profiteering.”To address this, the President directed the ministry of Agriculture to rehabilitate the national food reserve agency and work with some agencies to address the problem.\n“I am hereby directing the Ministry of Agriculture and Rural Development to rehabilitate the National Food Reserve Agency and also work with security agencies, the Nigerian Commodity Exchange, and the National Assembly to find a lasting solution to these disruptive and unpatriotic hoarding activities”, Buhari said.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Buhari Expresses Displeasure over COVID-19 Vaccines Distribution",
    "summarized_story": "President Muhammadu Buhari has called on the global community for the equitable distribution of COVID-19 vaccines, describing the current rate of distribution as unacceptable.\nThe president, in a speech to mark Nigeria’s Independence anniversary Friday, said: “I will take this opportunity to remind the global community that the current state of access to COVID-19 vaccines is unacceptable.\nWe cannot afford a situation where a handful of countries keep the global vaccine supply to themselves at the expense of other nations.\n“We must act now to accelerate equitable distribution of COVID-19 vaccines.\nThis is the message I conveyed to the international community in New York last week.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "For the Record: Buhari’s Independence Day Broadcast (Full Text)",
    "summarized_story": "It is with full gratitude to God that today, we celebrate Nigeria’s sixty first Independence Anniversary.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b.\n*Being the full text of the of the 61st Independence Day Address by President Muhammadu Buhari on Friday 1st October, 2021."
  },
  {
    "headline": "Buhari in Independence Message: Let’s Settle Grievances Without Bloodshed",
    "summarized_story": "His words: “As a Government, we are ready to arrest and prosecute all persons inciting violence through words or action.\nWe can always settle our grievances peacefully without spilling any blood.\nOn the controversial ban of Twitter, the President disclosed that he has directed that the ban be conditionally lifted.\nHe said following the suspension of Twitter operations, Twitter Inc. had reached out to the Federal Government of Nigeria to resolve the impasse.\nHis said, “It is with full gratitude to God that today, we celebrate Nigeria’s sixty first Independence Anniversary."
  },
  {
    "headline": "EXCLUSIVE: Buhari Bows To Chief Of Staff, Gambari, Attorney-General Malami, Re-approves Payment Of $418million Suspicious Paris Club Debts",
    "summarized_story": "President Muhammadu Buhari has re-approved the payment of a controversial $418million in Paris Club refund-related judgment debts to six creditors after being manipulated by his Chief of Staff, Prof Ibrahim Gambari, and the Attorney-General of the Federation, Abubakar Malami.\nThe governors claimed that President Buhari approved the payment of the $418million Paris Club judgment debt despite pending court cases.\n“In spite of the clear evidence of fraud being perpetrated against the Nigerian nation, President Buhari has released a $418million promissory note for jobs not done.\n“Yet, Malami who knows this is recommending that Ted Edward be paid $159,000,000 as fees from ALGON instead of the actual lawyer.\nNigeria will become bankrupt before President Buhari leaves office."
  },
  {
    "headline": "EXCLUSIVE: Buhari Bows To Chief Of Staff, Gambari, Attorney-General Malami, Re-approves Payment Of $418million Suspicious Paris Club Debts",
    "summarized_story": "President Muhammadu Buhari has re-approved the payment of a controversial $418million in Paris Club refund-related judgment debts to six creditors after being manipulated by his Chief of Staff, Prof Ibrahim Gambari, and the Attorney-General of the Federation, Abubakar Malami.\nThe governors claimed that President Buhari approved the payment of the $418million Paris Club judgment debt despite pending court cases.\n“In spite of the clear evidence of fraud being perpetrated against the Nigerian nation, President Buhari has released a $418million promissory note for jobs not done.\n“Yet, Malami who knows this is recommending that Ted Edward be paid $159,000,000 as fees from ALGON instead of the actual lawyer.\nNigeria will become bankrupt before President Buhari leaves office."
  },
  {
    "headline": "BREAKING: Former French President Sarkozy Gets One-Year Jail Term Over Campaign Financing",
    "summarized_story": "A French court Thursday imposed a one-year sentence on former president Nicolas Sarkozy after finding him guilty of illegal campaign financing for massive overspending on his 2012 re-election campaign.\nFormer French President, SarkozySarkozy, who spent nearly twice the legal limit on his failed bid for a second term in office, wasn't present at the Paris court for the announcement of the verdict.\nProsecutors had sought a one-year prison sentence, half of it suspended, for the former president.\nThe verdict is not the same as a suspended sentence, as it goes down in his record as a full prison term.\nProsecutors have requested mostly suspended prison sentences, and up to one year in prison for Bygmalion's co-founder."
  },
  {
    "headline": "BREAKING: Former French President Sarkozy Gets One-Year Jail Term Over Campaign Financing",
    "summarized_story": "A French court Thursday imposed a one-year sentence on former president Nicolas Sarkozy after finding him guilty of illegal campaign financing for massive overspending on his 2012 re-election campaign.\nFormer French President, SarkozySarkozy, who spent nearly twice the legal limit on his failed bid for a second term in office, wasn't present at the Paris court for the announcement of the verdict.\nProsecutors had sought a one-year prison sentence, half of it suspended, for the former president.\nThe verdict is not the same as a suspended sentence, as it goes down in his record as a full prison term.\nProsecutors have requested mostly suspended prison sentences, and up to one year in prison for Bygmalion's co-founder."
  },
  {
    "headline": "Many Feared Killed In Auto Crash On Major Nigerian Highway",
    "summarized_story": "No fewer than a dozen people have been feared killed in an auto crash along Yola-Gombe Road.\nThe accident reportedly happened Friday morning in Kaltungo, in the Kaltungo Local Government Area of Gombe State.\nThe vehicle, a 14-seater bus, identified as belonging to the Plateau Riders fleet, was said to have crashed and overturned while negotiating a bend.\nStation Manager of Plateau Riders in Yola, Yakubu Mishelia Bukar, confirmed the accident to SaharaReporters.\n\"I cannot confirm whether there was any fatality as of now,\" he said."
  },
  {
    "headline": "Social media used for crime, taking the fight to bandits -- highlights of Buhari's Independence Day speech",
    "summarized_story": "Buhari advised Nigerians to adhere to public health measures and get vaccinated to contain the spread of the deadly virus.\nBuhari said over 8,000 Boko Haram members have surrendered, adding that his administration is taking the fight to the country’s enemies from all angles.\nThe president asked Nigerians to speak against “unsubstantiated lies and hate speeches” peddled by “evil people”, saying the country’s unity is non-negotiable.\n‘MISUSE OF SOCIAL MEDIA FOR EXECUTING CRIMINAL ACTIVITIES’On social media, the president said social networking platforms are useful for social connection, but that recent events have shown that the social media is not immune from disinformation.\nBuhari said some social media users have used the platforms to organise criminal activities and propagate fake news."
  },
  {
    "headline": "Social media used for crime, taking the fight to bandits -- highlights of Buhari's Independence Day speech",
    "summarized_story": "Buhari advised Nigerians to adhere to public health measures and get vaccinated to contain the spread of the deadly virus.\nBuhari said over 8,000 Boko Haram members have surrendered, adding that his administration is taking the fight to the country’s enemies from all angles.\nThe president asked Nigerians to speak against “unsubstantiated lies and hate speeches” peddled by “evil people”, saying the country’s unity is non-negotiable.\n‘MISUSE OF SOCIAL MEDIA FOR EXECUTING CRIMINAL ACTIVITIES’On social media, the president said social networking platforms are useful for social connection, but that recent events have shown that the social media is not immune from disinformation.\nBuhari said some social media users have used the platforms to organise criminal activities and propagate fake news."
  },
  {
    "headline": "Matawalle directs telcos to restore service ONLY in Gusau, Zamfara's capital",
    "summarized_story": "Bello Matawalle, Zamfara governor, has directed telecommunication companies to restore network service only in Gusau, the state capital city.\nAdvertisementThe Nigerian Communications Commission (NCC) had instructed all telecommunication companies to shut down their services in Zamfara over lingering insecurity in the state.\nIn a statement on Friday, Zailani Bappa, media aide to the governor, quoted Matawalle as saying the restoration of the service in the state’s capital is imperative following the “tremendous success” recorded in the fight against banditry.\nAdvertisement“Governor Bello Mohammed (Matawallen Maradun, Shattiman Sakkwato, Barden Hausa) has directed for the restoration of telecommunications services within the state Capital of Gusau only with effect from today, Friday, 1st October, 2021,” the statement read.\n“Governor Matawalle promises that his administration will continue to closely monitor the unfolding developments and will announce further decisions of the Government on measures being taken appropriately.”"
  },
  {
    "headline": "Matawalle directs telcos to restore service ONLY in Gusau, Zamfara's capital",
    "summarized_story": "Bello Matawalle, Zamfara governor, has directed telecommunication companies to restore network service only in Gusau, the state capital city.\nAdvertisementThe Nigerian Communications Commission (NCC) had instructed all telecommunication companies to shut down their services in Zamfara over lingering insecurity in the state.\nIn a statement on Friday, Zailani Bappa, media aide to the governor, quoted Matawalle as saying the restoration of the service in the state’s capital is imperative following the “tremendous success” recorded in the fight against banditry.\nAdvertisement“Governor Bello Mohammed (Matawallen Maradun, Shattiman Sakkwato, Barden Hausa) has directed for the restoration of telecommunications services within the state Capital of Gusau only with effect from today, Friday, 1st October, 2021,” the statement read.\n“Governor Matawalle promises that his administration will continue to closely monitor the unfolding developments and will announce further decisions of the Government on measures being taken appropriately.”"
  },
  {
    "headline": "Buhari blames middlemen for hike in food prices, says scarcity of commodities artificial",
    "summarized_story": "President Muhammadu Buhari has again blamed middlemen for the hike in the prices of food items.\nAdvertisementBuhari said middlemen are responsible for food shortages on Friday during his nationwide address to mark Nigeria’s 61st independence anniversary.\nThe president said middlemen have created “artificial shortages” through the hoarding of essential commodities for profiteering.\nBuhari said the agricultural sector remains the key to the country’s economic diversification, adding that agriculture is a consistent driver of the non-oil sector.\n“Unfortunately, as our food production capacity has increased, food prices have been going up due to artificial shortages created by middlemen who have been buying and hoarding these essential commodities for profiteering."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "What can Nigerians do on the new eNaira website?",
    "summarized_story": "The website of Nigeria’s official digital currency, eNaira, went live on Monday, four days before its planned launch on October 1, as disclosed by Central Bank governor, Godwin Emefiele.\nA welcome note on the website describes the eNaira as a “Central Bank of Nigeria-issued digital currency that provides a unique form of money denominated in Naira.”The website is a central repository where users can find comprehensive information about the official digital currency, but it offers much more than just details of the eNaira.\nDownload the eNaira applicationThe eNaira app (termed “Speed”) can be downloaded from either the Google PlayStore, Apple App Store, or by scanning a QR code on the website.\nJoin the eNaira communityThe community is a social hub where, according to a note on the website, eNaira users across the globe can connect with one another, share their experiences using the digital currency, offer as well as request help.\nThe eNaira website is loaded with very important information and instructions as well as answers to potential questions in the FAQ section."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "More on NFTs, MIT’s prosthetic limbs project, Facebook’s Internet connectivity plan",
    "summarized_story": "Today I’m discussing:More on NFTsMIT’s 3D-printed prosthetic limbs in Sierra Leone2Africa Cable and Internet connectivityMore on NFTsNon-fungible tokens (NFTs) are digital assets that represent physical objects such as art, music, in-game items, and videos.\nAdvertisementAlthough they have been around since 2014, NFTs are gaining popularity as a popular way to buy and sell digital artwork.\nAccording to Facebook, when they are completed, the extension will make 2Africa the world’s longest subsea cable system.\nIn May 2020, Facebook announced plans to build a $1 billion undersea Internet cable for faster Internet access in Africa.\nFor context on Subsea Internet Cables in Africa, please, read: Subsea Internet cables and the race to connect Africa to the InternetWhat I’m reading and watchingGoogle Maps is making it easier to see wildfires and tree coverage."
  },
  {
    "headline": "Amid lawsuit, eNaira website down as CBN postpones launch",
    "summarized_story": "WAT] The eNaira website is now upThe Central Bank of Nigeria (CBN) has postponed the launch of the eNaira — its digital currency — slated to launch on October 1, 2021.\nAccording to The Punch, the launch was postponed to prevent it from clashing with the lineup of events planned for the Independence Day celebration.\nThe website which went live on Monday, September 27, 2021, ahead of the eNaira launch date is also down.\nMeanwhile, the CBN is facing a lawsuit from a company — ENAIRA PAYMENT SOLUTIONS LIMITED — which claims to have incorporated the name, eNaira since April 2004.\nIn a cease and desist letter sent to the CBN, the company stated its intentions to stop the launch of the eNaira."
  },
  {
    "headline": "3 crucial questions about NFTs answered",
    "summarized_story": "AdvertisementFrom a digital stance, someone might as well download the same copy of the art, but most NFTs run on the Ethereum Blockchain.\nFor artists, once you can prove that you’re the creator/original owner of that token, then you can sell on an NFT platform.\nAs a buyer or collector, you can buy on a reputable NFT platform for keepsake, and later on, mint them for their money’s worth.\nAnd because the blockchain records transactions in an unchangeable way, NFTs serve as trustable proof of ownership and originality.\nWhile the future is not set in stone, it looks like NFTs are here to stay and change the narrative of the art business."
  },
  {
    "headline": "Competence, not region, should determine Nigeria’s next president – Sanusi",
    "summarized_story": "Muhammadu Sanusi, the former emir of Kano and one-time Central Bank of Nigeria (CBN) governor, said in an interview on Arise TV on Friday that Nigeria must worry more about the competence of the next President rather than his region.\nNational Assemblies are not doing their jobs as required; that is the problem,” Sanusi stated.\nSanusi said that progressive countries like the United States of America do not worry about where the president comes from.\nRead Also: 2023: Who wants to be Nigeria’s next president?\nSanusi urged Nigerians to insist on character and competence and not the region the next president comes from."
  },
  {
    "headline": "How flawed elections cripple democracy in Nigeria since independence",
    "summarized_story": "Martin Onovo laments the failure of the nation’s electoral process to positively affect its democracy.\n“Nigeria’s electoral process is still at the infancy stage because of the abnormalities displayed by the electoral actors.\n“As it is, the electoral process in this system still lacks transparency, fairness, and credibility.\nOnce an electoral process lacks these three ingredients, it remains a charade in its totality,” Okunade states further.\nThe earlier it is permanently addressed, the better for Nigeria,” Onovo adds."
  },
  {
    "headline": "Nigeria stagnant as world races towards knowledge-based economy",
    "summarized_story": "A broken educational system and dearth of opportunities abound in a global race for the skills that would make them competitive in a knowledge-based economy.\nExperts say a knowledge-based economy relies more on intellectual capabilities than natural resources to enhance economic growth and development.\nTo achieve the UAE vision of developing a diverse and flexible knowledge-based economy, it developed its Vision 2021 plan in 2010.\nHowever, Nigeria has made very little progress in innovation towards its transition to a knowledge-based economy.\n“The Nigerian government has not really seen the importance of having a knowledge-based economy."
  },
  {
    "headline": "President Buhari’s Independence Day Address – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestINDEPENDENCE DAY ADDRESS BY HIS EXCELLENCY, MUHAMMADU BUHARI, PRESIDENT OF THE FEDERAL REPUBLIC OF NIGERIA ON THE OCCASION OF NIGERIA’S SIXTY FIRST INDEPENDENCE ANNIVERSARY, FRIDAY 1ST OCTOBER, 2021.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nEarlier this year, I launched the Integrated National Security and Waterways Protection Infrastructure, the Deep Blue Project, which is designed to secure Nigerian waters up to the Gulf of Guinea.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "PDP will return to power in 2023 – Wike …Receives Nwuke, Deeyah, others APC, AAC decampees – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHarcourt Port – Rivers State governor, Nyeson Ezenwo Wike says Peoples Democratic Party (PDP) elected governors are working in unison to ensure that the party wins the presidential election in 2023.\nThe governor stated that PDP in the State has never been owned by an individual as is the case with the APC.\nAnd he challenged the remnants of the APC to mention what Federal government has done for Rivers state in the last six years.\nLet nobody bother himself, PDP will take over Rivers State again because it is very obvious.\nFormer Rivers State APC spokesperson, Ogbonna Nwuke, said in the last six years they have been in the wilderness."
  },
  {
    "headline": "BOWFT Update: Naija Ratels, others get consolation prizes, as overall prize money increases* – Nigerian Observer",
    "summarized_story": "The teams that got their consolation prizes were; Heartland Queens of Owerri, Naija Ratels of Abuja, Rolly Angels of Benin City, Fortress Ladies of Benin City, Royal Queens of Warri, Sunshine Queens of Akure, Confluence Queens of Lokoja, and Kaduna Queens.\nShe saw it all by herself in company of the Sports-loving Deputy Governor of Edo State, Rt.\nThe prize money for the fourth place winners is newly created.\nThe semi finals will be played on Saturday, October 2, at the Samuel Ogbemudia Stadium, with Bayelsa Queens slugging it out against FC Robo in the first semi finals at 3pm and Edo Queens battle against Rivers Angels in the second semi finals at 5pm.\nThe grand finale and closing ceremony hold on Sunday, October 3, at the Samuel Ogbemudia Stadium at 5pm."
  },
  {
    "headline": "BOWFT: Edo Queens thrash Heartland, set up semifinals clash with Rivers Angels …Mrs Shaibu Impressed with Tourney – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Queens put an impressive performance today as they thrashed Heartland Queens 5-0 in the last match of Group A to set up a semi finals clash with NWFL champions Rivers Angels.\nThe coach Matthew Wmimo led Edo Queens could not have settled for anything less than such a 5-star performance as they played as they played in the presence of the Deputy Governor of Edo state and the first lady Betsy Obaseki.\nEdo Queens took the Owerri girls to the cleaners with five unreplied goals,courtesy Emmem Essien’s brace, Elizabeth Zirike’s second half long range stike and two ealy goals from Rebecca Ajumudaand Adaobi Okah respectively.\nEdo Queens won all their three group games with 10 goals scored .\nShe highlighted the huge benefits of the tournament to include continuous fight against girl child trafficking and abuse and promotion of women football in the country."
  },
  {
    "headline": "EXCLUSIVE: How Aliyu Gusau’s man was arrested in London over $1.4Million Malabu largesse",
    "summarized_story": "Mr Tesler also doubles as a friend and ally of Mr Gusau.\nMr Bature was a member of the House of Representatives, where he represented Sokoto North/South Federal Constituency.\nHe is said to have become a “protegee” of Mr Gusau during his days in the Armed Forces.\nIn one of the exhibits submitted by Eni, Mr Tesler explained the role of Mr Bature in the scandal.\nIn one of his disclosures in 2019, Mr Agaev claimed that he was introduced to Mr Etete by Mr Gusau in 2008."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Why The Buhari Bribery Train Crashed At the United Nations",
    "summarized_story": "This shameless approach by the emissaries of Nigerian government only goes to show that President Muhammadu Buhari is an irredeemable zombie.\nToday, these Nigerian Josephs have come to dictate the content and character of the nation’s foreign exchange, foreign trade, foreign investment, the media, as well as other socio-economic relationships.\nNothing highlights the impact of these Nigerian Josephs more than their role in the current wave of Nigerian secessionist movements on the international scene.\nBut the Nigerian Josephs know better.\nHe needs to embody what he has always preaches at the United Nations in case of the people of Palestine."
  },
  {
    "headline": "Buhari: I have performed better than Obasanjo, Ya’Adua, Jonathan combined",
    "summarized_story": "Muhammadu Buhari, president of Nigeria, has said his government has, in the last six years, performed better than all previous governments since the return of democracy in 1999.\nThis comprises the period of periods during which Chief Olusegun Obasanjo, Umaru Musa Ya’Adua and Goodluck Jonathan served as president of the country.\n“No government since 1999 has done what we have done in six years to put Nigeria back on track,” he said.\nBuhari said he has done well in infrastructure, social care, governance, Nigeria’s image and influence in Africa and the international community.\nNo government since 1999 has done what we have done in six years to put Nigeria back on track."
  },
  {
    "headline": "Buhari vows to deal with National Assembly member, others sponsoring IPOB, Yoruba nation agitators",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has said his government has uncovered those sponsoring separatist agitations around the country, including a National Assembly member, threatening to deal with them.\nThe President who specifically mentioned leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu and Yoruba nation agitator, Sunday Adeyemo, alias Sunday Igboho, said separatist leaders run abroad, leaving young people in the country to fight self-destructive wars.\n“The recent arrests of Nnamdi Kanu and Sunday Adeyemo and the ongoing investigations being conducted have revealed certain high profile financiers behind these individuals.\nWe are vigorously pursuing these financiers, including one identified as a serving member of the National Assembly,” he said.\n“This is a clear example of how people abandon their national leadership positions for their selfish gains."
  },
  {
    "headline": "Buhari threatens to deal with Kanu, Igboho, sponsors, insists Nigeria’s unity not negotiable",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has his government will deal decisively with separatists and their sponsors who threaten the nation’s security.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\n“I will take this opportunity to remind the global community that the current state of access to COVID-19 vaccines is unacceptable.\nThese are National Security and Cohesion; Registration, Physical presence and Representation; Fair Taxation; Dispute Resolution; and Local Content."
  },
  {
    "headline": "Yayin Da Nijeriya Ta Cika Shekara 61 Da ‘Yancin Kai…",
    "summarized_story": ""
  },
  {
    "headline": "Yaki Da ‘Yan Bindiga: Halin Da Ake Ciki A Zamfara",
    "summarized_story": ""
  },
  {
    "headline": "Iyaye Sun Kadu Da Yankan Ragon Da Aka Yi Wa Dansu Karo Na Biyu A Jos",
    "summarized_story": ""
  },
  {
    "headline": "Yadda ‘Yan Bindiga Suke Kwasar Kashinsu A Hannunmu – Shalkwatar Tsaro",
    "summarized_story": ""
  },
  {
    "headline": "Cikakken Bayani A Kan Sababbin Matakan Fatattakar ‘Yan Bindiga A Kaduna",
    "summarized_story": "Share on TelegramShare on TwitterShare on FacebookDaga Yusuf Shuaibu,Gwamnatin Jihar Kaduna ta sanar da sababbin matakan fatattakar ‘yan bindiga kamar sauran makotanta na Jihohin Katsina da Zamfara.\nWadanda suka hada da: Dakatar da sare itatuwa a dazuka da ke yankunan Birnin Gwari, Giwa Igabi, Chikun, Kachiya, Kagarko da kuma Kajuru.\nDa hana hana safarar itatuwa da kuma gawayi.\nDa batun Dakatar da safarar dabbobi wanda ya hada da shigowa ko fitar da su daga cikin jihar.\nGwamnatin Jihar Kaduna tana kira ga daukacin mazauna jihar da su bi wadannan matakai sau da kafa."
  },
  {
    "headline": "Dear Nigerian youth, if you are planning to ‘japa’ you must read this",
    "summarized_story": "News reports from a week or so ago informed us that 353 Nigerian doctors moved over to the NHS this year, enriching Britain’s health care industry.\nBut as you, Dear Young Nigerian, begin to plan your escape, thorns and hurdles are sprouting in your path.\nSome of the reasons he adduces should be cause for concern for every young Nigerian with aspirations to seek the Golden Fleece abroad.\nBut there is another poser: Does the CBN’s reason for withholding forex from ISTL have any historical angle?\nDear young Nigerian, they say when two elephants duel it is the grass that suffers."
  },
  {
    "headline": "Dear Nigerian youth, if you are planning to ‘japa’ you must read this",
    "summarized_story": "News reports from a week or so ago informed us that 353 Nigerian doctors moved over to the NHS this year, enriching Britain’s health care industry.\nBut as you, Dear Young Nigerian, begin to plan your escape, thorns and hurdles are sprouting in your path.\nSome of the reasons he adduces should be cause for concern for every young Nigerian with aspirations to seek the Golden Fleece abroad.\nBut there is another poser: Does the CBN’s reason for withholding forex from ISTL have any historical angle?\nDear young Nigerian, they say when two elephants duel it is the grass that suffers."
  },
  {
    "headline": "IPOB warns: We’ll send ESN after those behind killings in S-East",
    "summarized_story": "They want to go on killing spree in Biafra land and blame it on IPOB.\nAccording to the intelligence, these blood suckers want to also attack children in Biafra land to create the impression that IPOB is now attacking school children.\n“Contrary to campaign of calumny sponsored by our enemies to demonize us, IPOB has no hands in the orgy of attacks in Biafra land.\nThey are responsible for the senseless killings going on in Biafra land particularly in Anambra and Imo States.\n“We are calling on everybody in Biafra land to join hands and support IPOB and ESN to flush these murderous killers ravaging our land particularly Imo and Anambra States."
  },
  {
    "headline": "IPOB warns: We’ll send ESN after those behind killings in S-East",
    "summarized_story": "They want to go on killing spree in Biafra land and blame it on IPOB.\nAccording to the intelligence, these blood suckers want to also attack children in Biafra land to create the impression that IPOB is now attacking school children.\n“Contrary to campaign of calumny sponsored by our enemies to demonize us, IPOB has no hands in the orgy of attacks in Biafra land.\nThey are responsible for the senseless killings going on in Biafra land particularly in Anambra and Imo States.\n“We are calling on everybody in Biafra land to join hands and support IPOB and ESN to flush these murderous killers ravaging our land particularly Imo and Anambra States."
  },
  {
    "headline": "BREAKING: Police Fire Teargas As #BuhariMustGo Protesters Hit Abuja Streets On Independence Day",
    "summarized_story": "#BuhariMustGo protesters on Friday commenced an Independence Day protest in Abuja.\nThe youths came out in their numbers on Friday morning all carrying placards which had the inscriptions #BuhariMustGo.\nIn an attempt to disperse the protesters, the police arrived at the scene of the protest and fired teargas at them.\nPowerful said the proscribed group is taking these actions in solidarity with Ambazonia, a secessionist group in Cameroon, whose purported independence anniversary is on October 1.\nHe said the October 1 date was important to Nigeria and equally important to Ebonyi, which was created on October 1, 1996."
  },
  {
    "headline": "National Assembly Member, Other High-Profile Financers Of Igboho, Nnamdi Kanu Identified – Buhari",
    "summarized_story": "President Muhammadu Buhari has said that some financiers of the leader of the Indigenous People of Biafra, Nnamdi Kanu and the Yoruba nation agitator, Sunday Adeyemo, popularly called Sunday Igboho have been identified.\nIn his speech on Friday to mark the 2021 Independence Day, the President revealed that a serving member of the National Assembly had been identified as one of the sponsors of secession in the country.\nAccording to him, his government was vigorously pursuing the financiers, saying the alleged sponsors have abandoned their leadership responsibilities for what he termed as selfish gain.\nThe President said, “The recent arrests of Nnamdi Kanu and Sunday Adeyemo, and the ongoing investigations being conducted have revealed certain high-profile financiers behind these individuals.\n“We are vigorously pursuing these financiers, including one identified as a serving member of the National Assembly."
  },
  {
    "headline": "National Assembly Member, Other High-profile Financers Of Igboho, Nnamdi Kanu Identified – Buhari",
    "summarized_story": "President Muhammadu Buhari has revealed that some of the funders of Nnamdi Kanu, the leader of the Indigenous People of Biafra, and Sunday Adeyemo, also known as Sunday Igboho, the Yoruba nation agitator, have been identified.\nThe President announced in his speech on Friday to commemorate the country’s 2021 Independence Day that a serving member of the National Assembly had been recognized as one of the country’s secessionists.\nThe President said, “The recent arrests of Nnamdi Kanu and Sunday Adeyemo, and the ongoing investigations being conducted have revealed certain high-profile financiers behind these individuals.\n“We are vigorously pursuing these financiers, including one identified as a serving member of the National Assembly.\nThis is a clear example of how people abandon their national leadership positions for their selfish gains."
  },
  {
    "headline": "BREAKING: Buhari Orders Conditional Lifting Of Twitter Ban",
    "summarized_story": "), said on Friday that the ban on Twitter’s operations in Nigeria, which was imposed in June, had been lifted conditionally.\nBuhari made the announcement during a countrywide broadcast to Nigerians to commemorate the country’s 61st anniversary of independence.\n“Following the suspension of Twitter operations, Twitter Inc. reached out to the Federal Government of Nigeria to resolve the impasse.\nSubsequently, I constituted a Presidential Committee to engage Twitter to explore the possibility of resolving the issue.\n“The Committee, along with its Technical Team, has engaged with Twitter and have addressed a number of key issues."
  },
  {
    "headline": "Breaking: Buhari orders Twitter back if…speaks on COVID-19, agriculture, insecurity, others *Read President’s full speech on Nigeria’s 61st independence anniversary",
    "summarized_story": "Buhari who disclosed this during his broadcast on Nigeria’s 61st Independence anniversary on Friday.\nBut the COVID-19 pandemic and its devastating impact on all nations meant we needed to shift gears and re-strategise.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "2023 presidency: PDP shuts out Atiku, Tambuwal, zones chairmanship to North",
    "summarized_story": "The Peoples Democratic Party (PDP) Zoning Committee has zoned the party’s national chairmanship position to the North, ahead of its October 30 elective national convention.\nChairman of PDP zoning committee, Governor Ifeanyi Ugwuanyi of Enugu state disclosed while this reading the communiqué of the committee meeting held on Thursday in Abuja.\n“And the decision of the committee to zone the party offices does not in any way affect the executive and legislative offices in Nigeria.\n“That zoning of offices on PDP has traditionally been between the North and South of Nigeria.\n“Consequently, the current offices being held by officers in the Southern Zones of the country, namely, South West, South East and South-South zones, should swap places with the offices currently in the northern zones of Nigeria, namely, North West, North East and North Central zones.”"
  },
  {
    "headline": "Troops kill 378 terrorists, bandits in one month, 2,783 terrorists, families surrender, arms, ammunition recovered",
    "summarized_story": "The Defence Headquarters (DHQ) Thursday said troops of Operation HADIN KAI in the North-east and Operation HADARIN DAJI in the North-west killed 378 terrorists and bandits in separate military offensives in the last one month.\nThe military also said over 90 terrorists and bandits, including their collaborators and logistics suppliers, were arrested in the course of the various operations.\nAccording to him, a total of 2,783 terrorists and their families surrendered to troops within the period under review.\n“In the same vein, the Air Component conducted air bombardments on criminal enclaves in different locations including Magami and Dansadau forests in Zamfara State.\n“The air operations yielded attendant successes at Danmusa, Safana and Dutsinma LGAs as well as Gonar, Sani, Jikan and Malam villages at the Yantumaki forest, Lelet village forest and Yantumaki – Maidabino road in Katsina State."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "NCAA refutes ban on travelers without proof of vaccination -NigPilot",
    "summarized_story": "Nigerian Civil Aviation Authority , NCAA has refuted trending reports that the Federal Government through the NCAA has given a directive that from December 1 this year, travelers without proof of vaccination would not be permitted to board both local and international flights.\nThe NCAA in a statement issued on Thursday by its General Manager, Public Relations, Sam Adurogboye, Authority stated that it did not give any such directive.\n“On the other hand, we want to enjoin purveyor of such unfounded news to cross-check facts before publishing.\n“Meanwhile, the Authority will continue to support all Federal Government initiatives to curb the spread of the Delta variant.\n“However, we expect strict adherence to safety protocols in and out of the airports by wearing our facemask, washing our hands periodically, using alcohol-based hand sanitizer, maintaining social distance and avoiding crowded space,” the statement read."
  },
  {
    "headline": "Troops kill 479 terrorists, bandits in September -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ), on Thursday, said that troops in all theatres of operation killed no fewer than four hundred and seventy-nine (479) Boko Haram/Islamic State of West African Province ISWAP terrorists and bandits in the month of September.\nThis is in addition to the one hundred and five (105) terrorist fighters and bandits that were arrested in September.\n“Troops of Operation HADIN KAI sustained the operational tempo in land and air offensives against terrorists and other criminal elements in the North East theatre.\nCumulatively, a total of 85 BHT/ISWAP terrorists were neutralized and 43 terrorists including their collaborators and logistics suppliers were arrested in the course of the various operations.\nAlso, 47 armed bandits, informants and bandits’ collaborators were arrested within the period,” he also revealed."
  },
  {
    "headline": "LIVE: The Platform… Nigeria What Seest Thou?",
    "summarized_story": "﻿The Platform’s Independence Anniversary event, which is taking place in the Nigerian capital Abuja, features professionals from different fields.\nConvener of the Platform Pastor Poju Oyemade, who is also the Senior Pastor and Founder of The Covenant Nation is the keynote speaker at the event.\nOthers are Professor Fred Oyewale, Chief Economist with the New York City Economic Development Corporation; Yvonne Johnson, the Co-founder/CEO of Indicina – a FinTech infrastructure start-up focused on Africa; Feyi Fawehinmi, a writer and accountant.\nThe Platform is a non-political and non-partisan national development fair which holds as a global media event on Workers’ Day (May 1) and Nigeria’s Independence Day (October 1).\nIt hosts speakers from the highest levels of the nation’s leadership and leaders in global policy practice."
  },
  {
    "headline": "The Past 18 Months Among Most Difficult Periods In Nigeria’s History, Says Buhari",
    "summarized_story": "President Muhammadu Buhari on Friday recounted how the nation has fared so far, explaining that the last 18 months have been some of the “most difficult periods in the history of Nigeria”.\nHe said, “Fellow Nigerians, the past eighteen months have been some of the most difficult periods in the history of Nigeria.\nFellow Nigerians, the past eighteen months have been some of the most difficult periods in the history of Nigeria.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "President Buhari’s Full 61st Independence Anniversary Speech",
    "summarized_story": "INDEPENDENCE DAY ADDRESS BY HIS EXCELLENCY, MUHAMMADU BUHARI, PRESIDENT OF THE FEDERAL REPUBLIC OF NIGERIA ON THE OCCASION OF NIGERIA’S SIXTY-FIRST INDEPENDENCE ANNIVERSARY, FRIDAY 1ST OCTOBER, 2021.\nIt is with full gratitude to God that today, we celebrate Nigeria’s sixty-first Independence Anniversary.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "Nigeria@61: Let’s Unite For Peaceful Coexistence, Gbajabiamila Tells Nigerians",
    "summarized_story": "The Speaker of the House of Representatives, Honourable Femi Gbajabiamila, has called on Nigerians to be more united for the common purpose of building a country that meets the best expectations of all Nigerians.\nCiting the well-known aphorism, United We Stand and Divided We Fall, Gbajabiamila in a statement on Thursday said unity is priceless, urging every Nigerian to drop their sentiments and work together for a better nation.\nHe said in the past 61 years, Nigeria has grown and developed beyond imagination, though he recognised the fact that, “we still have significant challenges we must overcome together.”Speaker Gbajabiamila said Nigerian leaders were doing their best to see an end to the challenges facing Nigeria, especially the insecurity across the country.\nHe noted that such efforts required the support of all citizens, irrespective of political affiliations.\nThe Speaker reassured Nigerians that the 9th Assembly would always give the necessary legislative interventions to other arms of government to smoothen the task of governance."
  },
  {
    "headline": "Buhari: I Have Directed That The Suspension Of Twitter Be Lifted If Conditions Are Met",
    "summarized_story": "President Muhammadu Buhari on Friday said he had given his approval for the suspension of microblogging site Twitter to be lifted once the conditions set by the Federal Government are met.\nThe President spoke about the suspension of Twitter during his Independence Day anniversary broadcast to the nation.\n“Following the extensive engagements, the issues are being addressed and I have directed that the suspension be lifted but only if the conditions are met to allow our citizens continue the use of the platform for business and positive engagements,” he said.\n“However, recent events have shown that the platform is not just an innocuous platform for information dissemination.\n“Rather some users have misused the platform to organise, coordinate, and execute criminal activities, propagate fake news, and promote ethnic and religious sentiments."
  },
  {
    "headline": "Breaking: AIB denies plane crash near Abuja Airport",
    "summarized_story": "The Accident Investigation Bureau, AIB, has denied media reports that a plane crashed as it attempted to land at the Nnamdi azikiwe airport in Abuja.\nThe bureau described the report as untrue and misleading.\nSome online platforms had earlier reported a plane crashed near the Nnamdi Azikwe International Airport while attempting to land."
  },
  {
    "headline": "Full text of Buhari's speech at the closing edition of Nigeria @60 Activities",
    "summarized_story": "Nigeria is undoubtedly a blessed nation with abundant human and natural resources underpinned by a very rich socio – cultural diversity which needs to be positively harnessed to forge a greater Nigeria.\nFor me, this is the key message of today’s activities.\nToday’s event is anchored on the importance of our discovering our great Nation TOGETHER and not discovering it in our individual spaces as we are wont to do.\nI will like to also congratulate the Inter-Ministerial Committee of Nigeria at 60 that have put all these wonderful displays together.\nBeing different from the Nigerian National Merit Award, it has given us another opportunity to encourage Nigerians that individual achievements would always be rewarded."
  },
  {
    "headline": "U.S. celebrates 20 Nigerian fashion designers",
    "summarized_story": "The United States Consulate General in Lagos recently recognized 20 emerging and mid-career Nigerian fashion designers who took part in the International Visitors Leadership Program (IVLP), a hallmark US government exchange program.\n“In the last few years, Nigeria and the United States have witnessed growing cultural ties,” Pierangelo said.\n“This fashion IVLP project is a fantastic example of our strategic economic outreach to Nigeria’s creative industries to further strengthen economic ties through culture and fashion.”The 20 participants displayed some of their high-quality designs and fashion accessories during the event.\nConsul General Pierangelo viewed each of their exhibitions and learnt about their IVLP experiences.\nConsul General Pierangelo highlighted the U.S. government’s commitment to promoting economic growth and trade in the fashion industry by empowering local fashion designers to not only thrive in Nigeria’s fashion industry, but also to prepare for the global fashion marketplace."
  },
  {
    "headline": "Taskforce recovers 274 rustled cattle, camels, others in Zamfara -",
    "summarized_story": "Joint security taskforce in Zamfara have again recovered two hundred and seventy four rustled cattle.\nThe rustled animals were recovered in different locations across the stateThe joint security taskforce says it will not relent in it’s effort until peace returns to every communityThey vow to continue to go after bandits and their collaborators across the state.\nThe recovered livestock which comprises of two hundred and six cattle, sixty six ships and two camels were handed over to the state taskforce on security for onward delivery to the rightful owners.\nThe chairman of the state taskforce Abubakar Dauran says the animals will be handed over to the owners after thorough screening by the committee."
  },
  {
    "headline": "Australian Border to Reopen for First Time in Pandemic",
    "summarized_story": "Australia will reopen its international border from November, giving long-awaited freedoms to vaccinated citizens and their relatives.\nSince March 2020, Australia has had some of the world’s strictest border rules – even banning its own people from leaving the country.\nPeople would be eligible to travel when their state’s vaccination rate hit 80%, he told a press briefing on Friday.\nThese states have managed to maintain Covid rates at or near zero, after shutting their borders to states with infections.\nAustralia’s strict border policy has been credited for its success especially early in the pandemic, but the Delta variant has changed everything."
  },
  {
    "headline": "Trains Packed with Commuters as Japan Fully Ends Emergency",
    "summarized_story": "At Tokyo’s busy Shinagawa train station, a sea of mask-wearing commuters rushed to their work despite an approaching typhoon, with some returning to their offices after months of remote work.\nOffice worker Akifumi Sugihara, 46, said he is back to the train station for the first time in about a year.\n“I had been working from home for more than a year, and I came to the office in Tokyo as (the emergency) was lifted today,” he said.\nI feel it’s a new start.”Another office worker, Kaori Hayashi, 37, said it was an ordinary Friday.\nThe emergency measures have mainly involved requests for eateries to curb alcohol and hours."
  },
  {
    "headline": "Dubai’s Expo 2020 Opens, Bringing First World Fair to the Mideast",
    "summarized_story": "The first World Fair held in the United States in 1876 debuted Alexander Graham Bell’s telephone, the typewriter, a mechanical calculator and Heinz Ketchup.\nTo enter the expo site, visitors will need to show a negative PCR test or proof of COVID-19 vaccination.\nThe expo site will attempt to dazzle visitors with a centerpiece dome, marketed as the world’s largest 360-degree projection screen.\nSome World Fair structures remain iconic markers of the human journey and our industrial evolution.\nThe Space Needle in Seattle, Washington, built for the 1962 World Fair, is another structure with continued prominence and allure."
  },
  {
    "headline": "Tribute to Nigeria as the Country Mark’s Its 61st Anniversary – Trending with Ojy Okpe",
    "summarized_story": "As Nigeria mark’s it’s 61st anniversary, we would like to reflect on history, with a video recorded on Nigeria’s Independence Day, on October 1st 1960.\nThe pastor was said to have been targeted after one of his church members named Sabo killed his own brother and reported himself to the police.\nAccording to CAN, the killers of the late pastor, accused him of ensuring that Sabo reported and surrendered himself to the police and insinuated that the step was an attempt to protect Sabo from jungle justice.\nThe pastor was ambushed by the mob when he attended the funeral of Sabo’s brother.\nBack to Independence Day, Nigeria’s first anthem, recited on October 1st 1960, by the MRS Studio Orchestra, under the direction of Brazilian composer Remo Usai."
  },
  {
    "headline": "Scarlett Johansson and Disney Settle Lawsuit Over ‘Black Widow’",
    "summarized_story": "Scarlett Johansson and the Walt Disney Co. on Thursday settled her lawsuit over the streaming release of “Black Widow,” bringing a swift end to what had begun as the first major fight between a studio and star over recent changes in rollout plans for films.\nJohansson filed the lawsuit in Los Angeles Superior Court two months ago, saying the streaming release of the Marvel movie breached her contract and deprived her of potential earnings.\nThe lawsuit said Johansson’s contract guaranteed an exclusive theatrical release, with her potential earnings tied to the box office performance of the film.\nBut as it has with other recent releases since the coronavirus pandemic began, Disney released the film simultaneously in theaters and through its streaming service Disney+ for a $30 rental.\n“In the months leading up to this lawsuit, Ms. Johansson gave Disney and Marvel every opportunity to right their wrong and make good on Marvel’s promise,” the lawsuit said."
  }
]