[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "IPMAN to partner with EFCC in fight against distribution of illegally refined products",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) says it would partner with the Economic and Financial Crimes Commission (EFCC) in the fight against the distribution and sales of adulterated products.\nMr Chinedu Anyaso, Chairman of IPMAN, Enugu Depot Community in charge of Anambra, Ebonyi and Enugu state said this in Awka on Saturday.\nAnyaso said the leadership of IPMAN in Southeast had met with the Enugu Zonal Office of EFCC with a view to exploring areas of collaboration.\nHe said the leadership of IPMAN had zero tolerance for the distribution of illegally refined products because of its sabotage effect on the economy and would work with all relevant agencies including the anti graft agency to combat the crime.\nAccording to him, the distribution and sales of illegally refined products in the country is increasing, maybe due to the artificial scarcity and price hike but as a zone, IPMAN Enugu would guard against that."
  },
  {
    "headline": "Suspected cultists allegedly kill 43-year-old man in Osun",
    "summarized_story": "Osun Police Command said suspected cultists in the early hours of Saturday, invaded a residence in Ofatedo, Egbedore Local Government, and allegedly shot and killed a 43-year-old man, Yinusa Okunloye.\nSP Yemisi Opalola, Osun Police Spokesperson, made this known in a statement, adding that the police were, however, on the trail of the culprits.\nShe said, “Today, at about 1.30 a.m. one Ismail Azeez of No.5 Olofa Street, Ofatedo came to the Ido Osun Police Division Headquarters to report a case of attack and killing at his residence.\n“He reported that about 12.00 a.m. of the same day, a group of suspected cultists, numbering three, invaded his residence and called out the victim, Yinusa Okunloye, from his room and thereafter shot him in the chest.”Opalola said the victim died on the spot and his corpse was removed by the police and deposited at UniOsun Teaching Hospital in Osogbo, for autopsy.\nShe said non of the culprits had been arrested but added that the command was making frantic efforts to get them arrested (NAN)"
  },
  {
    "headline": "UNICEF to establish menstrual banks in Nigerian schools – Official",
    "summarized_story": "The United Nations Children Fund (UNICEF), Bauchi Field Office, says all is set to establish menstrual banks in some schools in Northern Nigeria.\nMrs Mairama Dikwa, the UNICEF Education Specialist, told the New Agency of Nigerian (NAN) in Bauchi on Saturday, that the establishment would begin in November across all the schools with Girls Enrollment Project 3 (GEP3).\nShe said that the project would be carried out under the Menstrual Hygiene Management of the agency’s Girl Education Project which was introduced to support girls and ensure that they remained in school.\nAccording to her, the gesture was an ideal one toward encouraging and improving Girls Enrollment in schools as well as ensuring that the girls didn’t break the circle of learning.\n“We were able to extend it to additional four states where we have a high level of women advocate establishments."
  },
  {
    "headline": "2023 census will be credible —NPC",
    "summarized_story": "The National Population Commission (NPC) on Friday assured that it would not leave stone unturned in its bid to conduct a credible national census in 2023.\nAlhaji Nasir Kwarra, Executive Chairman, NPC, said this in Abuja while inaugurating census dashboard and mobile device management location.\n“It is in furtherance of this that we are today witnessing the official launch of the Census Dashboard and Mobile Device Management System,” he said.\nThe executive chairman commended United Nations Population Fund (UNFPA), and United Nations Economic Commission for Africa (UNECA), for their tremendous support to the commission.\nSimilarly, Dr Inuwa Jalingo, Census Manager, NPC, affirmed the success of the commission in demarcation of over 80 per cent of Nigeria’s demography."
  },
  {
    "headline": "De-accreditation of Abia poly: APGA, Abia league of professionals knock PDP-led govt",
    "summarized_story": "By Steve OkoThe All Progressive Grand Alliance, APGA, has lambasted the Peoples Democratic Party, PDP-led administation in Abia State over the de-accreditation of Abia State Polytechnic, Aba, by the National Board for Technical Education (NBTE).\nOkezie Ikpeazu, Abia State University Uturu, ABSU, has lost accreditation to admit medical students.\n“At the last count the Abia State Polytechnic staffs are being owed up to 29 months which is more than two years in salaries and allowances.\nWe are poised to restore Abia State to the path of hope and glory.\nIt called for forensic audit of the account of Abia polytechnic and the probe of the management."
  },
  {
    "headline": "Ekiti records 74 new cases of COVID-19 – Health Commissioner",
    "summarized_story": "Ekiti State has recorded seventy-four new cases of COVID-19 in the state.\nIn a statement in Ado Ekiti, the State Commissioner for Health and Human Services, Dr Oyebanji Filani explained that the new cases were recorded after the Eld- EL- Kabir celebration.\nThe health commissioner noted that there was a significant decline in the number of positive COVID-19 cases and low occupancy in the isolation centres before the Eid El Kabir celebrations which occurred early this month.\nHe appealed to all residents of the state to adhere strictly to the government’s public health and social measures to prevent the spread of the virus.\nHe explained that the state government had trained and deployed over 80 mobile vaccination teams and 177 health facility-based teams across all LGAs in the state."
  },
  {
    "headline": "Don’t neglect our cultural heritage, make money with it – Gani Adams to Akeredolu, monarchs",
    "summarized_story": "The Aare Ona Kakanfo of Yoruba land, Iba Gani Adams has advised Governor Rotimi Akeredolu and traditional rulers in Ondo State not to neglect the Yoruba cultural heritage.\nAdams tasked both the government and traditional rulers to use the state’s cultural heritage to generate more revenue instead of relegating it to the background.\nOthers are Osunla of Erusu Akoko, Oba Sunday Mogaji, Alase of Ase Akoko, Oba Ogidan Aderemi, Chief Toyin Olusile, Chief Titilope Hassan and Mr. Bob Agbede among others.\nAdams said, “It is very important for the Ondo State government to use cultural promotion template to improve the tourism and economic development in Ondo and its environs.\nIt is our responsibilities as traditional rulers to ensure that we sustain our culture and tradition”."
  },
  {
    "headline": "Sex for roles should be punishable under law – Mr Macaroni",
    "summarized_story": "Popular media personality and comedian, Mr Macaroji has called for an investigation into alleged sex for role allegations in the Nigerian entertainment industry.\nMacaroni in an interview with the News Agency of Nigeria (NAN) also said appropriate sanctions should be meted on culprits involved in the act.\n“People should get roles and jobs based on competence, based on the fact that they are able to deliver.\n“For such up and coming artiste, take a look at Mr Macaroni, I will advise you to look at my life and my journey, success doesn’t come once.\n“Time and chance happen to all man, continue with your journey, success will not come to you on a platter of gold, you have to work for it."
  },
  {
    "headline": "Peter Obi visits Ikpeazu in Abia",
    "summarized_story": "Labour Party (LP) presidential candidate, Peter Obi visited Abia Governor, Okezie Ikpeazu on Saturday.\nObi made a trip to Ikpeazu’s country home at Umuobiakwa, Obingwa local government area.\nObi informed Ikpeazu that he was in Abia to attend an event at the Mater Dei Catholic Cathedral Umuahia.\nIkpeazu presented Obi with the first ever Abia State Long Term Development Plan and the Abia State Industrial Policy.\nThe documents were presented to him on Friday by ECOWAS Representative at the United Nations Industrial Development Organization (UNIDO)."
  },
  {
    "headline": "Bayelsa: PDP chieftain killed by gunmen dressed in Military camouflage",
    "summarized_story": "Unknown gunmen dressed in Military Camouflage on Friday shot dead a youth leader and chieftain of the People’s Democratic Party in Bayelsa State, Odeinyefa Ogbolosingha.\nThe 53 yrs old deceased, was an administrative officer in the State Civil Service, a member of the Peoples Democratic Party (PDP) and Secretary, Okordia/Zarama Cluster Development Board.\nHe was reportedly killed a few hours after taking his sick wife home from the hospital.\nSome of the residents, who spoke with DAILY POST, expressed concern over the increasing cases of violent killings and kidnapping perpetrated by gunmen dressed in military uniforms and tinted cars.\nThe victim was rushed to the Federal Medical Centre Yenagoa for treatment but was confirmed dead."
  },
  {
    "headline": "Asking Christians to vote only Christians unlawful- Ogunye The Nation Newspaper",
    "summarized_story": "Constitutional lawyer Jiti Ogunye has warned religious leaders it is unlawful to engage in political campaign based on religion or tribe.\nAbioye is the Senior Pastor of the Abuja church, Living Faith Church, Goshen City with over 30,000 worshippers.\nIn the video, Abioye advised Christians to only vote in favour of the church or risk eternal damnation.\n“This statement, when appropriately situated and contextualised, is a violation of the provisions of the Electoral Act, 2022.\n“For the avoidance of any doubt, Section 97 of the Electoral Act, 2022 prohibits political campaign based on religion or tribe."
  },
  {
    "headline": "NPC to recruit 1m staff for 2023 census The Nation Newspaper",
    "summarized_story": "The National Population Commission (NPC) has announced plans to recruit 1m staff for the 2023 National Population Censusand Housing exerciseThe Federal Commissioner, NPC, Alhaji Almu Banye, announced this in Daura, Katsina State.\nAlmu-Banye said he was in Daura to monitor the ongoing five-day exercise to see the success and challenges so that they can be resolved immediately.\nThe Nation recalls out of the six Enumeration Areas (EAs) visited by the Federal Commissioner, only one was having a challenge.\nThe Commissioner further assured staff with complaints the will pass them to the NPC headquarters for further actions.\nAnother enumerator at Daura Veterinary area, Hajiya Hafsat Idris said the respondents have so far been cooperating with them."
  },
  {
    "headline": "JUST IN: Gunmen kill Song Deputy Legislative leader The Nation Newspaper",
    "summarized_story": "The Deputy leader of Song Local Government Legislative Council of Adamawa State, Hon Ishaya Bakano, has been killed.\nA gang of men of the underworld got at the local council lawmaker in the early hours of Saturday and gunned him down, The Nation learnt.\nIshaya, who was representing Gudu Mboi Ward, was whisked from his residence at Bannga, in Song LGA and shot dead by the suspected gunmen, sources said.\nA source disclosed the gunmen also shot the son of the deceased who is receiving treatment at a hospital in the council headquarters Song.\nThe Police Public Relations Officer (PPRO) for Adamawa State, SP Suleiman Nguroje, confirmed the incident."
  },
  {
    "headline": "Marriage registry: Court okays committal process against Aregbesola The Nation Newspaper",
    "summarized_story": "The Federal High Court in Lagos has granted leave to four local government councils to commence committal proceedings against the Minister of Interior, Rauf Aregbesola.\nIn court procedure, Form 48 is a notice of consequence of disobedience of court order while Form 49 is a notice to show cause why an order of committal should not be made against the recipient.\nExcept marriage conducted in the marriage registries in Ikoyi Lagos and federal capital territory Abuja.\nExcept marriage conducted in the marriage registries in Ikoyi Lagos and federal capital territory Abuja.\nExcept marriage conducted in the marriage registries in Ikoyi Lagos and federal capital territory Abuja."
  },
  {
    "headline": "Abubakar Aliyu and the never-ending power grid collapse The Nation Newspaper",
    "summarized_story": "During the week, the country’s epileptic electricity grid, collapsed, causing a blackout and leaving businesses and homes with losses.\nSome even made a mockery of the situation saying “National grid ti lu le.” Major cities including the Federal Capital Territory were cast in darkness.\nAvailable data indicate that there are 23 power generating plants with 11,165 megawatts capacity connected to the national grid.\nThe power grid collapsed twice in March and twice again in April this year.\nSale Mamman was appointed to take over the power ministry but along the line, he got sacked and was replaced with Aliyu."
  },
  {
    "headline": "Hunters, Local Vigilantes Rescue 29 Kidnapped Victims Unhurt in Niger",
    "summarized_story": "From John Adams MinnaNo fewer than 29 villagers that were abducted from Kuchi in Munya local government area of Niger state on Thursday night have been rescued unhurt by men of the special force code named special hunters assisted by the local vigilantes.\nHowever, men of the special hunters that were stationed at Galkogo in Shiroro local government area, assisted by the local vigilantes from Sarkin Pawa, all 100 in number swung into action and went after the bandits.\nAccording to a source close to Kuchi community, the special hunters divided themselves into two groups with one group attacking the bandits from Galkogo end while another group comprising mainly the local vigilantes invaded the bush from Sarkin Pawa end.\nIt was gathered that luck however ran out of them when they ran towards the direction of one of the group of special hunters from Galkogo end and were engaged in a fierce gun battle which last about two hours.\nScores of the gunmen were neutralized while no casualty was recorded on the part of the special hunters."
  },
  {
    "headline": "Atiku opens up on Tinubu, Obi",
    "summarized_story": "He also assured that the PDP National Chairman, Dr Iyorchia Ayu will step down if he (Atiku) wins the presidential election next year.\n“It is very difficult to expect a miracle to happen, simply because Peter Obi is in the Labour Party.\nIn the north, 90 per cent of our people are not tuned to social media,” Atiku said.\nAtiku said he picked the governor of Delta State, Ifeanyi Okowa over the governor of Rivers State, Nyesom Wike because he believes the former can ‘deliver’.\nWhen asked if he needs Obasanjo’s support, Atiku said: “Why will I not need his support?"
  },
  {
    "headline": "Aviation fuel scarcity: Expect flight cancellations, delays – Airline operators",
    "summarized_story": "By Chinelo ObogoAirline Operators of Nigeria (AON) has said passengers should expect more flight delays and cancellations as a result of the scarcity of aviation fuel.\nIn a statement by the association’s spokesperson, Prof. Obiora Okonkwo, he said the situation is foreseen but an unintended consequence of the aviation fuel scarcity in the country.\nHe pleaded for the understanding of the travelling public to bear saying efforts are currently being made to address the development and restore normal flight operations.\n“For this reason, there will be major disruptions in scheduled flight operations including cancellations and unnecessary delays across all airports in the country.\nThis is a foreseen but unintended consequence of the aviation fuel scarcity in the country."
  },
  {
    "headline": "Mike Awoyinfa at 70: Journalism, Ghana, music, sports and me",
    "summarized_story": "On this day, in 1952, Mike Awoyinfa, Nigeria’s ace writer, human angle journalism exponent and pioneer Managing Director/ Editor-in-Chief, The Sun Publishing Limited, was born into the world.\nI was going to ask you that question, whether at 70 you still jog…At 70, I cannot jog anymore.\nMy father migrated to Ghana because he was having children at home, and they were dying.\nWhen you said your father relocated to Ghana because his children were dying, did it also affect the other wife?\nI read and read and read."
  },
  {
    "headline": "Why we lost Osun guber – APC",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC), has given reasons for its poor performance in last weekend’s governorship election in Osun.\nAPC Deputy National Organising Secretary, Hon Nze Chidi Duru, made the declaration while taking a post-mortem review of the party’s loss in last weekend’s Osun governorship election.\nHis words: “We lost the election in Osun State as was proclaimed by INEC and our party has accepted the result.\n“We understand and know as a fact that the governor cleared most of the outstanding liabilities in Osun State, but then, ultimately the electorate chose otherwise.\nThe scenario again repeated itself in Osun state but we had a different result."
  },
  {
    "headline": "Buhari, APC Urged to Inaugurate NDDC – THISDAYLIVE",
    "summarized_story": "They warned that the “illegal act” of running the affairs of NDDC with “a contraption of sole administratorship” was already generating adverse political implications for the ruling APC, which appears to be insensitive to the yearnings of the Niger Delta people.\nThe concerned APC members lamented that the sole administratorship contraption has been in place for three years now thereby denying the nine constituent states of NDDC the opportunity of fair and equitable representation on the commission’s Board.\nThe group reminded President Buhari and the APC leadership that they should be concerned about the mood of the Niger Delta people and should not continue to disdainfully overlook their demands for the right things to be done in the running of NDDC.\n“President Buhari needs to end the ongoing illegality in NDDC if APC desires to win the upcoming general elections, across board in the entire region, and be remembered for good in the Niger Delta.\n“We restate that this is the minimum the federal government and the APC can do to win back the trust of the Niger Delta people and stand a chance to do well in the region, in the forthcoming 2023 general election,” the concerned APC members said."
  },
  {
    "headline": "Soludo Assents to 2022 Revised Budget – THISDAYLIVE",
    "summarized_story": "David-Chyddy Eleke in AwkaAnambra State Governor, Prof. Chukwuma Soludo, has assented to the 2022 revised appropriation budget of N170 billion.\nAnambra State House of Assembly had on Tuesday passed the budget tagged ‘Building Off From The Blocks’ during a sitting of the House.\nSigning the budget into law, Soludo commended members of the House of Assembly for being diligent, responsible and responsive to their job as lawmakers and representatives of the people of Anambra State.\nSoludo said, “The patriotic and responsive manner the budget was passed by the State House of Assembly is not only commendable but signalled the birth of a new partnership for a greater Anambra.\nHe stated categorically that the borrowed money will be re-fenced and will be used for critical infrastructural development particularly in building roads, bridges and others."
  },
  {
    "headline": "Power Sector Regulators Approve Dangana as New KEDCO MD",
    "summarized_story": "Power sector regulators, Nigerian Electricity Regulatory Commission (NERC) and Bureau of Public Enterprises (BPE) have approved the appointment of the Board of Kano Electricity Distribution Company Plc (KEDCO).\nThe approval followed the federal government’s restructuring of five DisCos, as a result of takeover of three DisCos by Fidelity Bank of which KEDCO is among.\nIn this regard, NERC and BPE approved Ahmed Dangana, a seasoned management consultant and a business turnaround specialist as the new MD/CEO of the company.\nIn this role, he led various projects with governments, development finance institutions and corporate entities on key developmental initiatives.\nAlso, the regulators approved Ambassador Hassan Tukur as the Chairman Board of Directors."
  },
  {
    "headline": "Data Protection: 200 Stakeholders for Policy Dialogue in Abuja – THISDAYLIVE",
    "summarized_story": "No fewer than 200 stakeholders from across the country are to meet in Abuja next week to discuss the need for a principal Data Protection Law in Nigeria.\nThe Policy Dialogue is put together by the Nigeria Data Protection Bureau, with support from the Nigeria Digital Identification for Development (ID4D) project.\nNational Commissioner and Chief Executive Officer, Nigeria Data Protection Bureau, Dr. Vincent Olatunji, confirmed this during a meeting with the Nigeria ID4D team in his office in Abuja.\nThe Focus Group Discussion was also convened by the Nigeria Data Protection Bureau, with support from the Nigeria Digital Identification for Development project.\nHighlights of the Focus Group Discussion were contributions from various stakeholders on pertinent questions relevant to data protection legislation, experience sharing, peer review, among others."
  },
  {
    "headline": "Safe Termination of Pregnancy: 150 Women Groups Ask Sanwo-Olu to Lift Guidelines’ Suspension – THISDAYLIVE",
    "summarized_story": "Wale IgbintadeOver 150 Women Rights and Civil Society Organisations have called on the Lagos State Governor, Mr. Babajide Sanwo-Olu, to immediately lift suspension on the guidelines on Safe Termination of Pregnancy for Legal Indicators.\nThe groups maintained that women have rights to their bodily integrity and to life, stressing that the ‘Safe Termination of Pregnancy for Legal Indicators’ is meant to save women from preventable death.\n“A person cannot be arrested for a medical abortion validated by Section 201 of Criminal Law of Lagos State.\n“The denial of safe abortion care to survivors of rape violates the right to health and privacy and may violate the prohibition of ill-treatment.\nThe ban on the Guidelines on Safe Termination of Pregnancy for Legal Indications should immediately be lifted.”"
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "EFCC: Ahmed Idris, suspended accountant-general, received N15bn bribe from oil-producing states",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says Ahmed Idris, suspended accountant-general of the federation, received a N15 billion bribe to accelerate 13% derivation funds to nine oil-producing states.\nThe 13 percent derivation fund comes from the federation revenue to oil-producing communities through the state governments as enshrined in section 162, sub-section 2 of the Nigerian constitution.\nTwo days later, he was suspended indefinitely “without pay” by Zainab Ahmed, minister of finance, budget and national planning.\nIdris was subsequently arraigned alongside Godfrey Olusegun Akindele and Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nAccording to one of the charges, the EFCC alleged that Idris received gratification from one Olusegun Akindele, worth N15.1 billion, in exchange for “accelerating the payment of 13% derivation to the nine oil-producing states in the federation”."
  },
  {
    "headline": "EFCC: Ahmed Idris, suspended accountant-general, received N15bn bribe from oil-producing states",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says Ahmed Idris, suspended accountant-general of the federation, received a N15 billion bribe to accelerate 13% derivation funds to nine oil-producing states.\nThe 13 percent derivation fund comes from the federation revenue to oil-producing communities through the state governments as enshrined in section 162, sub-section 2 of the Nigerian constitution.\nTwo days later, he was suspended indefinitely “without pay” by Zainab Ahmed, minister of finance, budget and national planning.\nIdris was subsequently arraigned alongside Godfrey Olusegun Akindele and Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nAccording to one of the charges, the EFCC alleged that Idris received gratification from one Olusegun Akindele, worth N15.1 billion, in exchange for “accelerating the payment of 13% derivation to the nine oil-producing states in the federation”."
  },
  {
    "headline": "Five Boko Haram fighters surrender to troops in Borno",
    "summarized_story": "Five suspected Boko Haram members including Mallam Isa, a commander, have surrendered to troops of the Nigerian Army in Borno.\nAccording to Zagazola Makama, a counter-insurgency expert, they surrendered on July 22 to the troops of 73 Battalion, Operation Hadin Kai.\n“At about 200812A, the troops of Cashew plantation deployed at Valley Shuwa had received five surrendered Boko Haram terrorists,” Makama quoted a source as saying.\nChristopher Musa, theatre commander of north-east joint taskforce of Operation Hadin Kai, said more than 67,000 insurgents have surrendered to troops so far.\nIn April 2022, 10 suspected Boko Haram members surrendered to troops of the Nigerian Army in Borno."
  },
  {
    "headline": "Five Boko Haram fighters surrender to troops in Borno",
    "summarized_story": "Five suspected Boko Haram members including Mallam Isa, a commander, have surrendered to troops of the Nigerian Army in Borno.\nAccording to Zagazola Makama, a counter-insurgency expert, they surrendered on July 22 to the troops of 73 Battalion, Operation Hadin Kai.\n“At about 200812A, the troops of Cashew plantation deployed at Valley Shuwa had received five surrendered Boko Haram terrorists,” Makama quoted a source as saying.\nChristopher Musa, theatre commander of north-east joint taskforce of Operation Hadin Kai, said more than 67,000 insurgents have surrendered to troops so far.\nIn April 2022, 10 suspected Boko Haram members surrendered to troops of the Nigerian Army in Borno."
  },
  {
    "headline": "Can Tinubu, Atiku, Peter Obi unite Nigeria?",
    "summarized_story": "It is a sheer pursuit of a will-o-the-wisp to assume or suggest that any single leader can unite Nigeria without commensurate efforts of citizens to the cause.\nTo unite Nigeria, there is a place for leadership, and there is a place for followership.\nThe place of leadership in achieving unity in Nigeria is the place of personal example.\nWe need to build a Nigerian identity.\nCan the presidential hopefuls – Bola Tinubu of APC; Atiku Abubakar of PDP, and Peter Obi of Labour Party – unite Nigeria?"
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "From Nigeria to the UK with the Global Talent Visa",
    "summarized_story": "When writers Ope Adedeji and Chika Jones decided to apply for the UK Global Talent Visa, both thought the process would be like all other visa applications—grueling and 3 months long, filled with insurmountable documentation, and lingering interviews.\nMany more are looking to take advantage of this opportunity, and if you’re one of them, here’s how 2 exceptionally talented individuals japa-ed with the UK Global Talent Visa.\nExceptional Talent v Exceptional PromiseThe first stage of applying for the UK Global Talent Visa is getting endorsed by any of 6 relevant endorsing bodies.\nUnlike other visa applications where you have to book interviews at consulates, the Global Talent Visa has 6 governing bodies that review applications from applicants who can bid for the visa under 2 circumstances: Exceptional Talent or Exceptional Promise.\nThe best part about the Global Talent Visa, according to Koroye, is that awardees don’t have to be in the UK all year round."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How to navigate delivery apps and traditional logistics companies in Lagos and Kaduna",
    "summarized_story": "This time, we’ll be talking to three business owners about their experiences with delivery and logistics in the bustling city of Lagos and the ancient Kaduna town.\nKachiThey eventually did the delivery, but that was it for me; I just went back to my individual rider companies.\nBut…I think logistics companies that focus on other forms of logistics have no business with the food business because, first off, the margins are very low.\nAt first, I was using all these normal bike logistics companies for deliveries within Kaduna.\nDelivery within Kaduna used to cost ₦500 ($1), but the people using cars were charging ₦1,000 ($2) or ₦1,500 ($3)."
  },
  {
    "headline": "2023 elections: Technology, religion, ‘third forces’, eager youths raise stakes",
    "summarized_story": "Adoption of technology, religious sentiments, the rise of third forces, increased polictical awarenes and participation among Nigerian youths drive other factors that tense up the political space ahead of general elections in 2023.\nThe election observers held that the 2023 elections will depart from some of the political dynamics that defined previous elections in the country.\nThe observers implored INEC to implement assistive voting cubicles for people living with disabilities, women, youth and Internally Displaced Persons.\nAccording to the results of the assessment of Nigeria’s electoral environment, if the 2023 elections failed to improve on previous elections, Nigerians may lose faith in the potential and dividends of democracy.\nSince the transition from military to civilian democratic rule in 1999, both the NDI and the IRI have sent international election observers to all general elections in Nigeria."
  },
  {
    "headline": "Here are five alternatives to virtual dollar cards",
    "summarized_story": "Over time many individuals, businesses, and organisations have relied on Barter by Flutterwave for their virtual dollar card services in Nigeria, with shut down of the virtual card they have are left with no choice but to seek for alternatives.\nRead also: Why fintechs are shutting down virtual dollar cards in NigeriaCashbuddy virtual dollar cardFounded by Mike Rosanje, CashBuddy virtual dollar cards in Nigeria works on global platforms like Skrill, Amazon, Apple Music, Stripe, Binance, Facebook, Instagram, PayPal, Netteller, etc.\nThe platform offers the first virtual dollar card free, with a minimum of $5 and no single transaction limit.\nHowever, the dollar card comes with a limited offer that makes you earn 5 percent cashback on all qualifying purchases.\nIn addition, you can’t withdraw more than $1k daily; nor deposit more than $1000 into your virtual card daily."
  },
  {
    "headline": "Debiri-Erewa applauds Asisat Oshoala as she bags CAF Women Player of the Year award – Nigerian Observer",
    "summarized_story": "Debiri-Erewa applauds Asisat Oshoala as she bags CAF Women Player of the Year awardShare FacebookTwitterStumbleuponLinkedInPinterestHon.\n(Dr) Abike Dabiri-Erewa, Chairman/CEO, Nigerians in Diaspora Commission (NIDCOM) has congratulated Asisat Oshoala, the Super Falcons striker for wining the CAF Women “PLAYER OF THE YEAR” 2022.\nShe encouraged her to continue to be resilient as the whole world is watching, while wishing her greater success in her future endeavours.\nShe equally urged other youths to emulate the impactful life of Asisat on humanity as well as on the continent.\n“A hearty congratulations to you Asisat and keep bringing more glory to the Nation and the continent.”Asisat Oshoala’s victory as the CAF WOMEN PLAYER OF THE YEAR was announced in a gala held at Rabat, Morocco."
  },
  {
    "headline": "Edo Queens gets new head coach",
    "summarized_story": "The management of Edo Queens Football Club has unveiled Moses Aduku as the new Head Coach of the team.\nEdo State Deputy Governor, Rt.\nWe also worked on Edo Queens and rebranded it in line with the same standard of Bendel Insurance.”He said, “Our target is to get Bendel Insurance and Edo Queens into the capital market.\nThat is the only way the clubs will be sustainable.”Shaibu assured the new coach of the government’s support in making Edo Queens champion in Nigeria.\nHe called on Edo people to support the club, adding, “We need Edo people’s support."
  },
  {
    "headline": "Edo readies for 2nd edition of Betsy Obaseki pre-season championship – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…tourney gets FIFA accolade for focus on women footballThe Edo State Deputy Governor, Rt.\nComrade Philip Shaibu, has said plans are in top gear to host the second edition of the Betsy Obaseki Women Pre-Season Football Championship in Edo State.\nSpeaking at the inauguration of the organizing committee for the tournament, in Benin City, Shaibu said the annual tournament has improved women football in Nigeria.\nCommending the Edo State First Lady for initiating the tournament, he said, “I thank the First Lady for this initiative.\nWe want to return Edo State to the number one sporting destination in Nigeria."
  },
  {
    "headline": "Auchi Poly Matriculation: Rector Warns Against Cultism – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestRector, Auchi Polytechnic, Auchi, Dr. Shehu Umar yesterday warmed the newly admitted students of the polytechnic against cultism, examination malpractice and other vices that would be inimical to their academic progress of their lives.\nDr. Umar gave the warning during the institution’s 40th matriculation ceremony, said that the polytechnic had zero tolerance for cultism, examination malpractice and other vices.\nCultism is of no benefit to you as the school management would not hesitate to expel any student found wanting in this regard”, he emphasized.\nAccording to the rector, the polytechnic had concluded plans to enrich the academic programmes in the School of Information and Communication Technology, Engineering Technology and Business Administration.\nHe assured that the staff and management of the institution would provide the enabling environment for students to excel."
  },
  {
    "headline": "‘Organ harvesting:’ Nigerian doctor charged in UK with plotting with Ekweremadus",
    "summarized_story": "Obinna Obeta, a Nigerian doctor residing in the UK has been accused of plotting with former Deputy Senate President, Ike Ekweremadu and his wife, Beatrice, to traffic a homeless man into the UK to harvest a kidney for their daughter.\nA second charge alleges Obeta conspired with the former Senate President to arrange or facilitate the travel of the man with a view to him being exploited, namely organ harvesting, Daily Mail reported.\nRecall the Ekweremadus are being tried in the UK on charges of organ harvesting after a 21-year-old man, David Ukpo, they brought to the UK approached the police with claims of being treated as a slave and also claiming that he was ”15” years old.\nThe Nigerian politician and his wife were arrested in the UK on June 21 after flying into Heathrow from Turkey.\nObeta was on Thursday charged with arranging or facilitating the travel of another person with a view to exploitation and conspiring together with Ike Ekweremadu."
  },
  {
    "headline": "European Union to replace Russia gas with Nigeria’s",
    "summarized_story": "The European Union (EU) has disclosed plans to replace gas from Russia with Nigeria’s gas following the invasion in Ukraine.\nDeputy Director-General Department for (Energy), European Commission in Brussels, Mr Matthew Baldwin, said this at a news conference on Friday in Abuja.\n“So, we have launched the energy platform task force and the primary goal is to reach out to our reliable partners such as Nigeria to replace the gas from Russia with gas from reliable partners,” he said.\nAccording to him, you would have seen perhaps early this week, we launched a gas demand reduction plan and we are looking to reduce demand of gas by 15 per cent to manage the demand aspect of the equation.\n“Our gas percentage was 60 per cent but now we want to go,’’ he said."
  },
  {
    "headline": "2023: Umahi backtracks, says he’s not opposed to Peter Obi’s presidential ambition",
    "summarized_story": "David Umahi, governor of Ebonyi State, has said he is not opposed to Peter Obi’s presidential ambition, and “deeply appreciates Obi’s courage in his campaign.”The Ebonyi governor said contrary to reports, he is not against the ambition of the Labour Party presidential candidate.\nThe talk, deemed a jab at Mr Obi, a former governor of Anambra, had generated backlash on social media.\nAustin Umahi, brother to the governor, was declared winner of the APC senatorial ticket for Ebonyi south.\nAccording to NAN, another primary was held on June 9, during which Austin withdrew, and the Ebonyi governor reportedly contested unopposed and won.\nThe Ebonyi governor was a presidential candidate on the APC platform at the time his brother won the senatorial primary — he, however, lost the presidential ticket."
  },
  {
    "headline": "2023: Peter Obi, Kwankwaso likely to force a rerun",
    "summarized_story": "The institutes, which described Obi and Kwankwaso as a viable “third forces”, said their emergence as presidential candidates for the 2023 elections has excited many young Nigerians.\nThe statement read in part, “The 2023 elections are a departure from some of the political dynamics that defined previous polls.\nFor the first time since 2007, the presidential election will be an open contest with no incumbent.\nExtremist and sectarian violence continues to spread, banditry and criminality are endemic, separatist elements are gaining traction, and informal security forces are proliferating.\n“INEC and security forces should anticipate and plan for areas where violence may be used to suppress votes/change outcomes."
  },
  {
    "headline": "Osun: Gov Oyetola meets APC leaders after electoral defeat, calls for calm",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Adegboyega Oyetola, on Friday, met with members and supporters of the ruling All Progressives Congress (APC), the first meeting he would be hosting after losing Saturday’s governorship election to Ademola Adeleke, candidate of the People’s Democratic Party (PDP).\nGovernor Oyetola charged the APC members and supporters not to allow the outcome of the election cause dissatisfaction and division within the party, adding that the APC remains the ruling party in the state.\nHe preached peace and unity among party leaders and members across all levels, from ward to local government to state.\nThe governor also advised party members who have grievances to channel them to the appropriate quarters and stop expressing them in the social media, in the interest of the party.\nHe noted that, as the governor of Osun, he will continue to govern with fear of God and love of the people, just as he reiterated his commitment to the well-being of the people and development of the State."
  },
  {
    "headline": "Police Arrest 200 Criminals In Kano Within 24 Days",
    "summarized_story": "Kano state police commissioner, Samaila Shuaibu Dikko, Thursday said his men arrested 200 criminal suspects within 24 days.\nParading the suspects at the command’s headquarters in Bompai, the commissioner described the arrest as a milestone in the drive against crime.\nHe revealed that 42 suspected armed robbers, nine kidnappers, 16 fraudsters, two human traffickers, 27 vehicle and tricycle thieves, 12 drug dealers and 92 thugs were barrested.\n“In our effort to effectively police Kano State, we intensified community policing engagements, constant raids of criminal hideouts and black spots, intelligence-led and visibility policing, rapid response to distress calls, full adherence to the ethics of the force and synergy with sister security agencies and community policing stakeholders,” Dikko said."
  },
  {
    "headline": "Police Arrest 200 Criminals In Kano Within 24 Days",
    "summarized_story": "Kano state police commissioner, Samaila Shuaibu Dikko, Thursday said his men arrested 200 criminal suspects within 24 days.\nParading the suspects at the command’s headquarters in Bompai, the commissioner described the arrest as a milestone in the drive against crime.\nHe revealed that 42 suspected armed robbers, nine kidnappers, 16 fraudsters, two human traffickers, 27 vehicle and tricycle thieves, 12 drug dealers and 92 thugs were barrested.\n“In our effort to effectively police Kano State, we intensified community policing engagements, constant raids of criminal hideouts and black spots, intelligence-led and visibility policing, rapid response to distress calls, full adherence to the ethics of the force and synergy with sister security agencies and community policing stakeholders,” Dikko said."
  },
  {
    "headline": "Ganduje Rewards Student For Academic Excellence",
    "summarized_story": "Kano State Governor Abdullahi Ganduje has given N3m to a student, Suwidi Sani, for his brilliant performance at the just concluded young Nigerian scientists Presidential Award.\nSuwidi, an native of Nasarawa local government area of the state, emerged 7th and was the only northerner among the first 10 participants.\nPresenting the cash prize, the commissioner for higher education, Dr. Mariya Mahmud Bunkure, said the student had gained admission to study at the Bayero University Kano after scoring 303 in the joint marticulation examination.\nAlso speaking, the commissioner for science, technology and innovation, Alhaji Idris Garba Anguwar Rimi, commended the state government for fulfilling it’s promise to support the student.\nRecieving the donation, Suwidi Sani said he would not relent in his efforts and would do everything possible to be among the best students in Bayero University Kano."
  },
  {
    "headline": "Ganduje Rewards Student For Academic Excellence",
    "summarized_story": "Kano State Governor Abdullahi Ganduje has given N3m to a student, Suwidi Sani, for his brilliant performance at the just concluded young Nigerian scientists Presidential Award.\nSuwidi, an native of Nasarawa local government area of the state, emerged 7th and was the only northerner among the first 10 participants.\nPresenting the cash prize, the commissioner for higher education, Dr. Mariya Mahmud Bunkure, said the student had gained admission to study at the Bayero University Kano after scoring 303 in the joint marticulation examination.\nAlso speaking, the commissioner for science, technology and innovation, Alhaji Idris Garba Anguwar Rimi, commended the state government for fulfilling it’s promise to support the student.\nRecieving the donation, Suwidi Sani said he would not relent in his efforts and would do everything possible to be among the best students in Bayero University Kano."
  },
  {
    "headline": "USAID Trains Gombe CSOs On Budget Analysis",
    "summarized_story": "The United States Agency for International Development (USAID) through its state Accountability, Transparency and Effectiveness (State2State) project has begun a three-day training for Civil Society Organisations (CSOs) in Gombe State on budget analysis.\nAccording to him, effective budget analysis skills helps citizens and CSOs to ask the right questions to hold government accountable to the people.\n“This training will deepen capacity of CSOs in budget analysis, check for progress in the key sectors of basic education, Primary Healthcare and water, sanitation and hygiene”, he said.\nIkita stated that at the end of the training, the capacity of CSOs in budget analysis skills of CSOs would have been built as a way of improving the CSOs capacity towards effective advocacy and quality service delivery to the people.\nHe assured that the training would help facilitate good understanding of future budget needs while strengthening the budget analysis capacity of women and promoting their civic participation."
  },
  {
    "headline": "Obasanjo: Everything I have done in my life is by accident",
    "summarized_story": "Olusegun Obasanjo said except for farming, everything he has done and achieved in life was by accident.\nObasanjo said he was always proud to be addressed as a farmer.\nOdegbami had asked Obasanjo to speak about what he termed his “romance with farming.”In response, the ex-president said, “I don’t like the word you used, ‘romance with farming’.\nEverything I have done in my life is by accident.\nHe said, “My advice for Nigerian youths is that, never let anybody tell you that you are the leaders of tomorrow."
  },
  {
    "headline": "Asake, Victony to perform at BBNaija S7 premiere",
    "summarized_story": "Fast-rising Afrobeats artistes like Asake and Victony have been billed to perform at the opening ceremony for the seventh edition of the Big Brother Naija that will premiere on Saturday, July 23, 2022.\nThe season 7 double launch will air on July 23 and 24, 2022 across all Africa Magic stations on GOtv and DStv.\nThe program premiere will be aired on DStv channels 151, 153, 154, 198, and GOtv channels 2, 6, and 29 by 7:00 pm on both days.\nSubsequently, the show will air on the 24-hour channels 198 on DStv and 29 on GOtv.\nFor this season, media personality, Ebuka Obi-Uchendu, returns as the host of the show."
  },
  {
    "headline": "BREAKING: UN tells Nigeria to unconditionally release, compensate Nnamdi Kanu",
    "summarized_story": "UN therefore, asked Nigerian Government to, “immediate release Kanu unconditionally” and pay him adequate compensations for the arbitrary violation of his fundamental human rights.\nIn these circumstances, the Working Group concludes that Mr. Kanu’s detention is thus arbitrary under category II”, UN Working Group said.\nSuch determination was not carried out in the present case, in violation of Mr. Kanu’s rights under article 9 (3) of the Covenant.\n“Further, according to the source and uncontested by the Government, following hisrendition to Nigeria, Mr. Kanu was detained in solitary confinement within the headquartersof the Department in Abuja, Nigeria.\n“The Working Group requests the Governments to disseminate the present opinion through all available means and as widely as possible."
  },
  {
    "headline": "Osun Poll: I Will Bounce Back – Oyetola",
    "summarized_story": "At a meeting attended by his appointees as well as several party leaders, Oyetola made this statement at the Osun Government House in Oke Fia, Osogbo.\n“Rumors have been flying about that I’ve fled since the election results were released,” he claims.\n“I summoned all of you here to assure you that the present situation is just a temporary setback.\n“Go back to your various units and wards across the state and continue with regular party activities, hold your meetings regularly.\nWe must continue to remain a peaceful state, nobody is allowed to misbehave,” he said."
  },
  {
    "headline": "Umahi Loses APC Ticket For Ebonyi South Senatorial District Election",
    "summarized_story": "A Federal High Court sitting in Abakaliki has disqualified Governor David Umahi of Ebonyi State from contesting the election for Ebonyi South senatorial district seat on the platform of his party, the All Progressives Congress (APC).\nThe younger Umahi had clinched the party’s ticket to contest the election in the senatorial district after he emerged the winner of the APC primary in the zone.\nHe later resigned to pave the way for the older Umahi to contest the Ebonyi South senatorial district election after the governor lost out in the APC Presidential Primary to former Lagos State Governor, Bola Tinubu.\nIn a swift reaction to the court’s decision, the Special Assistant to Governor Umahi on Strategy, Chris Oko, said the judge was misled by Agom-Eze.\nDispleased with the development, Governor Umahi approached the Federal High Court seeking an order for INEC to publish his name as the candidate of the ruling party for the election in the senatorial district."
  },
  {
    "headline": "(UPDATED): Woman who set husband ablaze for having child out of wedlock commits suicide",
    "summarized_story": "Wife of Bolu Bamidele, Ifeoluwa, who set her husband ablaze last Tuesday in Osogbo, the Osun State capital, for having a child out of wedlock, has committed suicide by poisoning herself.\nIfeoluwa, whose remains were brought to the mortuary of the Our Lady of Fatima Catholic Hospital, Jaleyemi, Osogbo, by policemen, was said to have decided to end it all in order not to face death sentence.\nOne of the workers at the hospital, who spoke with Tribune Online over the incident on condition of anonymity, said that she was brought dead to the hospital by the policemen and had been deposited at the morgue.\nConfirming the incident, the Public Relations Officer of the state police command, Yemisi Opatola, confirmed the development, saying she was the one that facilitated bringing the corpse of the woman to the hospital mortuary."
  },
  {
    "headline": "All you need to know as BBNaija Season 7 kicks off",
    "summarized_story": "Big Brother Naija season seven will have a double launch this weekend on Saturday and Sunday July 23 and 24, 2022 at 7:00 p.m. on Africa Magic Showcase, Urban and Family channels.\nThe show will also air on the 24/7 Big Brother Naija channel on DStv 198 and GOtv channel 29, as well as on Showmax.\nThe headline sponsor of Big Brother Naija season 7 is Pocket by PiggyVest (formerly Abeg), and the associate sponsor is Flutterwave.\nBig Brother Naija season 7 will also be available on the African streaming platform, Showmax across Sub-Saharan Africa, the United Kingdom and the Republic of Ireland.\nAdditionally, customers can activate the parental control option on their DStv and GOtv decoders for viewers younger than 18 years old."
  },
  {
    "headline": "Breaking: Super Falcons succumb to bronze-winning Zambia defeat, crumble in worst-ever AWCON outing",
    "summarized_story": "Nigeria’s Super Falcons a while ago on Friday night succumbed to Zambia 0-1 defeat in the third place match at the ongoing African Women Cup of Nations (AWCON) in Morocco.\nThis was after the Nigerian team lost in the semi-final clash against hosts Morocco few days ago.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Zamfara PDP guber candidate congratulates Osun governor-elect",
    "summarized_story": "The Zamfara Peoples Democratic Party’s (PDP) gubernatorial candidate, Dr. Dauda Lawal, has congratulated the governor-elect of Osun State, Adeleke Nurudeen Ademola, on his victory in the just concluded election.\nBlueprint reported that Independent Electoral Commission (INEC), returning officer for the Osun governorship election, Prof, Oluwatoyin Ogundipe, on Sunday morning, declared Ademola Adeleke winner of the exercise.\nLawal in a congratulatory message issued by his media office, in Gusau, Zamfara state capital said he was confident in Adeleke’s abilities to perform to the expectations of the people of Osun state.\n“The people of Osun have made a clear choice by voting for Sen. Adeleke of the PDP.\nThe Zamfara PDP guber candidate also applauded INEC, Civil Society Organisations, and the security operatives for ensuring that the choice of the people prevailed in Osun state."
  },
  {
    "headline": "Obodofei, GPS collaborate to build, operate gas processing plant in Bayelsa State",
    "summarized_story": "By Ere-ebi AgedahWith the desire to complement government effort in the power and energy sector, indigenous oil and gas firm, Obodofei has collaborated with international Construction engineering company, Global Process Systems, GPS to build a gas processing plant in Bayelsa state.\nThis, Obodofei insisted that this project will bring power into the local community and equally provide job opportunities to the teaming youths in the state.\nSpeaking in Abuja, on Thursday during the signing of a Non-Disclosure Agreement between Obodofei and GPS, Executive Director Obodofei, Dr. Steven Bassey remarked that it has become eminent for indigenous firms to contribute to the national crude oil basket and this can only be achieved through collaborations between indigenous oil and gas producers and their international counterparts in the service sector.\nA delegation from Global Process Systems, GPS led by Managing Director Mr Martin Brownhill and Vice President Business Development Rajesh Shah noted that they were impressed by efforts made by the Obodofei to begin such massive project to the state.\nMartin noted that GPS was keen about doing its due diligence to ensure that the project meets international best standard adding that it will provide all necessary support, training and advice needed to build and operate the proposed gas processing plant and distribution gas turbine in Bayelsa State."
  },
  {
    "headline": "Nigachem builds capacity of over 50 mining companies on use, management of explosives",
    "summarized_story": "By Palma IleyeManufacturing giant of mining explosives, Nigachem Nigeria Limited, yesterday, organized a capacity building training of over 50 mining companies on use of explosives at their sites this is following issues on safe- mining in the solid minerals sector.\nAlso Executive Director, Sales, Nigachem Nigeria Limited, Engr Bayo Yusuf, described the capacity building workshop as reawakening training for customers.\n“These trucks carrying mining explosives are not monitored while moving on the roads.\n“I need to improve more on safe-mining because we basically focus on blasting because blasting is the most technical aspect of mining.\nAdebayo stated this when he played host to the leadership of National Association of Nigerian Students, NANS in Abuja."
  },
  {
    "headline": "Debt servicing surpasses revenue by N310bn as FG releases 4-month fiscal report",
    "summarized_story": "Cost of servicing debt surpassed the federal government’s retained revenue by N310 billion in the first four months of 2022.\nThe federal government said this in its 2022 fiscal performance report for four months released on Thursday.\nAccording to the report, the federal government’s total revenue for the period was N1.63 trillion, while debt service gulped N1.94 trillion.\n“The aggregate expenditure for 2022 is estimated at N17.32 trillion, with a prorata spending target of N5.77 at end of April,” the report reads.\nOf this amount, N1.94 trillion was for debt service, and N1.26 trillion was for personnel costs, including pensions."
  },
  {
    "headline": "CBN governor commissions N600m UNILORIN poultry farm",
    "summarized_story": "By Kayode AbdulazeezGovernor of the Central Bank of Nigeria, CBN, Godwin Emefiele on Thursday commissioned a 600 million naira poultry farm project at the University of Ilorin, Kwara State.\nTo close this gap, the Central Bank of Nigeria has introduced various Intervention Schemes focused on boosting poultry production, creating decent jobs, and fostering innovation in the poultry sub-sector.\nOne of such schemes is the Tertiary Institutions Poultry Revival Scheme that was conceptualised specifically for Tertiary Institutions to design and implement viable poultry projects.\n“Today we witness the commissioning of the first project to be funded and completed through the Scheme.\nThe SPV is Unilorin Bizface synergy Limited, a limited liability company registered with the Corporate Affairs Commission."
  },
  {
    "headline": "Bayelsa Govt Clears Air On State Of Its Airport",
    "summarized_story": "… Says Bayelsa Airport Is Not DowngradedBy Eunice Nnachi, YenagoaThe Bayelsa State Government has made a clarification that the state-owned international airport had not been downgraded, as being insinuated in some quarters.\nThe Deputy Governor, Senator Lawrence Ewhrudjakpo, gave the clarification on Wednesday when the Federated Correspondents Chapel of the Nigeria Union of Journalists, Bayelsa State Council, paid him a courtesy call in Government House, Yenagoa.\nAccording to the Deputy Governor, the D-Check is a major maintenance check to determine the air-worthiness of an aircraft after it had made commercial flights for a period of 10 years.\nI know that you are going to ask us what is happening to the Bayelsa International Airport.\nThe Bayelsa Airport has not been downgraded."
  },
  {
    "headline": "African Union Hails Landmark Russia-Ukraine Grain Deal",
    "summarized_story": "The African Union on Saturday hailed a landmark deal between Ukraine and Russia that will allow Kyiv to resume exports of grain through the Black Sea and relieve a global food crisis.\nUkraine’s farms are a major source of grain for the world market, in particular in the Middle East and Africa, where food supplies are critically tight.\nREAD ALSO: Russia, Ukraine Seal Landmark Grain Deal To Ease ShortagesUkraine and Russia and two of the world’s largest grain producers.\nThe International Rescue Committee, which helps people affected by humanitarian crises, also welcomed the accord, saying countries in East Africa relied “on Russia and Ukraine for over 90 percent of their wheat imports”.\n“The lifting of these blockades will go some way in easing the extreme hunger that over 18 million people in East Africa are facing, with three million already facing catastrophic hunger conditions,” Shashwat Saraf, IRC’s East Africa emergency director, said."
  },
  {
    "headline": "Pastor Tunde Bakare Denies Endorsing Tinubu, Criticising CAN",
    "summarized_story": "The General Overseer of Citadel Global Community Church, formerly known as Latter Rain Assembly, Pastor Tunde Bakare, has denied claims that he has endorsed the presidential candidate of the All Progressives Congress, Bola Tinubu.\nPastor Bakare’s reaction to the claims was contained in a statement dated Friday, and titled ‘Reffutal: The statements credited to me are outright lies’.\n“Isn’t this the same Tinubu that I announced to all and sundry at the APC Presidential Convention that I was not stepping down for?\nThe pastor called on the public to disregard the alleged statements as there were not his and do not represent his position.\nAlso, he challenged anyone with evidence that he actually made the statements credited to him to make the evidence public."
  },
  {
    "headline": "University Strikes: More Trouble As NASU, SSANU Reject Briggs Committee Report",
    "summarized_story": "The Babalakin Committee took off and was meeting with the various university to be very unfortunate and a betrayal of confidence by the Committee.\nLet it be stated clearly, that SSANU and NASU reject any salary recommendation that would cause further disparity in the University system.\nFollowing the disbandment of the Babalakin-led Committee, the Federal Government reconstituted the Committee this time around, led by Professor Munzaili Jibril.\nAfter the disbandment of the Munzali Committee, another Committee under the leadership of Professor Nimi Briggs was constituted in March 2022.\nFollowing the inauguration of the Committee, so far, the two Unions of NASU and SSANU had only two meetings with the Committee."
  },
  {
    "headline": "Umahi Loses APC Ticket For Ebonyi South Senatorial District Election",
    "summarized_story": "A Federal High Court sitting in Abakaliki has disqualified Governor David Umahi of Ebonyi State from contesting the election for Ebonyi South senatorial district seat on the platform of his party, the All Progressives Congress (APC).\nThe younger Umahi had clinched the party’s ticket to contest the election in the senatorial district after he emerged the winner of the APC primary in the zone.\nHe later resigned to pave the way for the older Umahi to contest the Ebonyi South senatorial district election after the governor lost out in the APC Presidential Primary to former Lagos State Governor, Bola Tinubu.\nIn a swift reaction to the court’s decision, the Special Assistant to Governor Umahi on Strategy, Chris Oko, said the judge was misled by Agom-Eze.\nDispleased with the development, Governor Umahi approached the Federal High Court seeking an order for INEC to publish his name as the candidate of the ruling party for the election in the senatorial district."
  },
  {
    "headline": "Peter Obi In Abia: Meets With Ikpeazu, Attends Catholic Church Event",
    "summarized_story": "The Presidential Candidate of the Labour Party, Mr Peter Obi, has visited Abia State and met with Governor Okezie Ikpeazu.\nMr Obi met with Governor Ikpeazu on Saturday at the governor’s country home in Umuobiakwa, Obingwa Local Government Area.\nChief Press Secretary to the governor, Onyebuchi Ememanka, said in a statement that both men met in the morning.\nMr Obi is in the state to attend an event at the Mater Dei Catholic Cathedral in Umuahia and he informed Governor Ikpeazu that he had to meet with him in line with official courtesies and protocols before proceeding to the event, according to Ememanka.\nThe Labour Party presidential candidate, who sat with members of the congregation, during the event took time out to also interact with them."
  },
  {
    "headline": "Shettima: Tinubu adamant as reactions trail fake clergies' presence -",
    "summarized_story": "The Presidential candidate of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has remained indifferent to the reactions trailing the alleged presence of fake clergies at the unveiling of his runnung mate, Senator Kashim Shettima.\nAdvertisementThe APC and the presidential candidate had jointly denied the allegation of hiring fake bishops to the venue of the unveiling, saying they did not engage in such act.\nIn this video, Nigerians react to this development and many other stories making the headlines in national dailies.\nAdvertisement"
  },
  {
    "headline": "Uzodimma dissolves 27-man Interim Management Committee Chairmen -",
    "summarized_story": "Imo State Governor, Hope Uzodimma has dissolved the 27-man Interim Management Committee Chairmen.\nIn a Statement by the Chief Press Secretary and Media Adviser to the Governor Oguwike Nwachuku, the Governor dissolved the IMC Chairmen Thursday after a closed door meeting with them at the Sam Mbakwe Executive Chambers, Government House Owerri.\nAdvertisementAt the meeting, Governor Uzodimma thanked them for the services they rendered in their different local government areas since their appointment about two and half years ago.\nAdvertisementAdvertisementImo State Governor also told the dissolved IMC Chairmen that his government will not hesitate to engage their services in other areas they are found capable as APC members.\nResponding, Chairman of ALGON in Imo State, Willie Okoliogo, who is also the Chairman of Oru West Council, on behalf of other IMC Chairmen promised to remain loyal to the Governor and the APC."
  },
  {
    "headline": "NLC shuns FG, says no going back on national protest over ASUU strike -",
    "summarized_story": "The Federal Government has appealed to the Nigeria Labour Congress to cancel its planned protest over the prolonged strike by University workers.\nMinister of Labour and Employment, Chris Ngige, made the appeal on Thursday at a meeting with the leadership of NLC in Abuja.\nChris Ngige said the NLC, being aware of efforts by the Government to end the strike, was not expected to embark on any rally or protest.\nAdvertisementAdvertisementHe said he was mandated by the Federal Executive Council to notify them of the serious security implications of the planned protest.\nAdvertisementThe NLC assured the Government of a peaceful protest adding that infiltrators would not be allowed to participate in it."
  },
  {
    "headline": "Plateau APC guber candidate speaks on alleged post primary crisis -",
    "summarized_story": "The governorship candidate of the All Progressives Congress in Plateau State, Nentawe Yilwatda Goshwe, has described the alleged crisis within the APC family in the state as a mere conjecture.\nMr Goshwe disclosed this on Thursday while featuring on TVC News’ This Morning show.\nAdvertisementThere are reports that some APC members in the state are not happy about the conduct of the party’s governorship primary which he won.\nAdvertisementAdvertisementAlthough he urged those who may have any issue with the outcome of the primary to channel their grievances through the right quarter, the APC candidate But assured that the party in the state is more united than ever."
  },
  {
    "headline": "Buhari Says APC VP Candidate Shettima Will Live up to Expectations",
    "summarized_story": "Nigeria President Muhammadu Buhari on Friday hosted leaders of the ruling All Progressives Congress (APC) and expressly vouched for the vice-presidential candidate of the party, Senator Kashim Shettima, saying he will live up to the expectations of the party and Nigerians at large.\nHowever, the Presidential Candidate of the APC, Bola Tinubu, its five South-west governors, and the Speaker of the House of Representatives, Femi Gbajabiamila were absent at the meeting with Buhari.\n‘‘You were all of one mind, wanting the best for the party, with the candidate emerging in a free and fair manner.\nAdamu said: ‘‘our main goal is to see the success of the APC in the forthcoming general elections.\nAPC governors in attendance included those of Kebbi (Atiku Bagudu); Borno (Babagana Zulum); Nasarawa (Abdullahi Sule); Yobe (Mana Buni) and Gombe (Inuwa Yahaya)."
  },
  {
    "headline": "Benin Coalition Opposes Housing Returned Artifacts in ‘Obaseki’s Museum’",
    "summarized_story": "Leaders and stakeholders of Coalition of Benin Socio-cultural Organisations have opposed moves by Edo State Governor, Godwin Obaseki to house the returned stolen Benin artifacts in his proposed Edo Museum of West African Arts (EMOWAA) which they say is alien to the Benin race.\nWe also learnt that the proposed site of the proposed EMOWAA is Ogbe-Ezoti.\n“His Excellency Sir, are you not aware that Ogbe-Ezoti (Aro-Ezoti) is one of the Cultural and Historical Sites in Benin Kingdom?\n“We want to state unequivocally that these Benin Artifacts belong to his Royal Majesty, Oba of Benin Kingdom and the entire Benin Kingdom.\nFor clarity, our revered Oba of Benin Kingdom is the owner of these Benin artifacts."
  },
  {
    "headline": "Atiku: Tinubu Wanted to Run Muslim-Muslim Ticket with Me in 2007, I Refused",
    "summarized_story": "Atiku also said he refused the proposition of Bola Tinubu, the presidential candidate of the All Progressives Congress (APC), to be his running mate in 2007 because of his aversion to a Muslim-Muslim ticket.\nMind you, in the north, 90 per cent of our people (who will be voting) are not on social media.”On the APC’s Muslim-Muslim ticket, Atiku said he fundamentally disagrees with Tinubu on the issue of Muslim-Muslim ticket in the presidential race.\nAtiku said his disagreement with Tinubu on the same religion ticket dated back to 2007 in their days in the Action Congress of Nigeria (ACN) when Tinubu insisted on being his running mate.\n“My fundamental disagreement and political departure with Asiwaju since 2007 was due to the Muslim-Muslim ticket.\n“Tinubu wanted to be my running mate when I was given the ACN presidential ticket in 2007, but I disagreed."
  },
  {
    "headline": "Nigeria: EFCC Arraigns Suspended Accountant General Idris Over N109bn Fraud, Court Remands Him in Kuje",
    "summarized_story": "Justice Adeyemi-Ajayi, made the order shortly after the defendants were arraigned before his court, on charges of stealing and criminal breach of trust.\nThe Economic and Financial Crimes Commission (EFCC), had filed a 14-count charge against Idris, Godfrey Akindele, Mohammed Usman and a firm, Gezawa Commodity Market and Exchange Limited.\nThey, however, pleaded not guilty to the charge and the prosecution, led by Rotimi Jacobs, asked that the defendants be remanded in custody pending the commencement of their trial.\nHowever, counsel to the defendants informed the court of the bail application he filed on behalf of the defendants, arguing that the bail would enable the defendants to prepare adequately for their trial.\nIn a short ruling, Justice Adeyemi-Ajayi, adjourned till July 27 for the hearing of the bail applications."
  },
  {
    "headline": "Russia and Ukraine Sign UN-Backed Deal to Resume Grain Exports as War Rages",
    "summarized_story": "Russia and Ukraine signed a landmark deal on Friday to reopen Ukrainian Black Sea ports for grain exports, raising hopes that an international food crisis aggravated by the Russian invasion can be eased.\nSpeaking at the signing ceremony in Istanbul, U.N. Secretary General Antonio Guterres said the deal opens the way to significant volumes of commercial food exports from three key Ukrainian ports – Odesa, Chernomorsk and Yuzhny.\n“Today, there is a beacon on the Black Sea.\nMoscow has denied responsibility for the worsening food crisis, blaming instead sanctions for slowing its own food and fertilizer exports and Ukraine for mining the approaches to its Black Sea ports.\nMoscow has denied responsibility for the worsening food crisis, blaming instead sanctions for slowing its own food and fertilizer exports and Ukraine for mining the approaches to its Black Sea ports."
  }
]