[
  {
    "headline": "Sitting too long could increase risk of heart disease, early death, study says",
    "summarized_story": "Oluwatobiloba JaiyeolaA new study has indicated that sitting down for more than eight hours in a day could increase the risk of cardiovascular diseases.\nIt also noted that people who sit for too long are equally more prone to heart disease complications leading to death.\nThe researchers made use of data from the Prospective Urban Rural Epidemiology study and discovered that longer sitting time during the day was linked to an increased risk of premature death and major cardiovascular disease events, such as cardiovascular death, myocardial infarction, stroke, or heart failure.\n“High amounts of sitting time were associated with increased risk of all-cause mortality and CVD in economically diverse settings, especially in low-income and lower-middle-income countries.\n“Reducing sedentary time along with increasing physical activity might be an important strategy for easing the global burden of premature deaths and CVD.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Sitting too long could increase risk of heart disease, early death, study says",
    "summarized_story": "Oluwatobiloba JaiyeolaA new study has indicated that sitting down for more than eight hours in a day could increase the risk of cardiovascular diseases.\nIt also noted that people who sit for too long are equally more prone to heart disease complications leading to death.\nThe researchers made use of data from the Prospective Urban Rural Epidemiology study and discovered that longer sitting time during the day was linked to an increased risk of premature death and major cardiovascular disease events, such as cardiovascular death, myocardial infarction, stroke, or heart failure.\n“High amounts of sitting time were associated with increased risk of all-cause mortality and CVD in economically diverse settings, especially in low-income and lower-middle-income countries.\n“Reducing sedentary time along with increasing physical activity might be an important strategy for easing the global burden of premature deaths and CVD.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "WHO launches new app to curb skin cancer",
    "summarized_story": "Oluwatobiloba JaiyeolaThe World Health Organisation has announced the launch of a new mobile application that would help curb skin cancer.\nThe application, according to the WHO, is to help protect individuals’ from excessive ultraviolet exposure, a key cause of skin cancer and other ultraviolet-related diseases.\nThe global health agency said the launch of the SunSmart Global UV app was done in collaboration with, the World Meteorological Organisation, the United Nations Environment Programme, and the International Labour Organisation.\nAccording to the WHO, in 2020, more than 1.5 million skin cancer cases were diagnosed globally.\nThe UN health agency added, “The SunSmart Global UV app is available free of charge at both the Apple App and Google Play stores."
  },
  {
    "headline": "WHO launches new app to curb skin cancer",
    "summarized_story": "Oluwatobiloba JaiyeolaThe World Health Organisation has announced the launch of a new mobile application that would help curb skin cancer.\nThe application, according to the WHO, is to help protect individuals’ from excessive ultraviolet exposure, a key cause of skin cancer and other ultraviolet-related diseases.\nThe global health agency said the launch of the SunSmart Global UV app was done in collaboration with, the World Meteorological Organisation, the United Nations Environment Programme, and the International Labour Organisation.\nAccording to the WHO, in 2020, more than 1.5 million skin cancer cases were diagnosed globally.\nThe UN health agency added, “The SunSmart Global UV app is available free of charge at both the Apple App and Google Play stores."
  },
  {
    "headline": "Eneukwu commends APC for organising most peaceful Presidential primaries",
    "summarized_story": "By Chinedu AdonuThe Deputy National Chairman South of the ruling All Progressives Congress APC, Chief Emma Eneukwu, has commended the party for organised one of the most peaceful presidential elections in Nigeria since the history of democracy.\nChief Eneukwu, who was one of the first chieftains of the party to congratulate their presidential candidate, Senator Ahmed Bolaji Tinubu, shortly after his Emergence, made this known to newsmen in Enugu on Tuesday .\nHe said that some persons intentionally quoted him out of context as he was only referring to the high cost of running elections in Nigeria.\nChief Eneukwu also stated that, APC has a capable presidential Candidate in Senator Tinubu, who has the whirl withal to win election as his emergence has sent panic into the camp of the opposition.\n“I also wish to state that, APC has the best candidate for the presidential election in the country."
  },
  {
    "headline": "Arochukwu state constituency: Delegate drags PDP to court",
    "summarized_story": "Kalu is seeking the court to mandate the Independent National Electoral Commission, INEC, not to recognise anybody as PDP’s flag bearer for the constituency, claiming that the party did not conduct any primaries in the constituency.\nDefendants in the suit marked FHC/UM/CS/89/2022, include the National Chairman of PDP, Iyorchia Ayu; INEC; the Chairman of the Electoral Committee, Hon.\nHe prayed the court to “order the defendants to conduct a primary election for Arochukwu state consituency because there was no primary election conducted therein on the 22nd day of May, 2022”.\nThe plaintiff further averred that a written report by the Electoral Committee confirmed that there was no primary election in the constituency.\nA copy of the report sighted by our Correspondent read in part:” We report that there was no primary election in Arochukwu state consituency."
  },
  {
    "headline": "Buhari seeks Senate’s confirmation of Mohammed Bello as RMAFC Chairman",
    "summarized_story": "By Henry Umoru, ABUJAPRESIDENT Muhammadu Buhari has written to the Senate, seeking for the screening and subsequent confirmation of Mohammed Bello Shehu as Chairman of the Revenue Mobilisation Allocation and Fiscal Commission.\nPresident Buhari’s request was contained in a letter read by the President of the Senate, Senator Ahmad Lawan, at plenary on Wednesday.\nAlso forwarded was the President’s request for the confirmation of Umar Yahaya as Co-Chairman of the Governing Council of Unclaimed Funds to the Committee on Banking, Insurance and Other Financial Institutions.\nBoth nominees are expected to appear before the relevant Committees for screening.\nThe respective Committees were given two weeks to report back to the Senate in plenary."
  },
  {
    "headline": "Shipping firms are making more money from Container Deposit Fees — Jime",
    "summarized_story": "By Godwin OritseThe leadership of the Nigerian Shippers’ Council, NSC, has said that shipping companies operating in Nigeria are making more money from the collection of Container Deposit Fees than their core business of shipping services they offer.\nSpeaking to newsmen in Lagos last week, the Executive Secretary of the Council, Mr. Emmanuel Jime, said the agency has also commenced moves to stop the payment of the container deposit fee by Nigerian importers and their agents.\nJime who described the payment and collection of container deposit fee as oppressive and short of being a fraud stated: “The Shippers’ Council takes this container deposit regime as presently operated as oppressive.\nI do not want to use the word fraudulent but that appears to me what it seems to be.\n“Think about and you work the math and you see the figures that have been reeled out in regards to this matter, you will find that people are making a lot more money from this container deposit regime than they probably would have been making if they were actually in the business of shipping."
  },
  {
    "headline": "250 people killed in Afghanistan earthquake",
    "summarized_story": "A 6.1-magnitude earthquake has killed at least 250 people in Afghanistan’s eastern Paktika Province, the state-run news agency and officials reported on June 22.\nThe U.S. Geological Survey (USGS) said the earthquake with a magnitude of 6.1 shook parts of Afghanistan and Pakistan in the early hours of June 22.\nThe USGS said the quake struck about 46 kilometers southwest of the city of Khost in southeastern Afghanistan and was at a depth of 51 kilometers.\nTremors were felt over an area inhabited by about 119 million people in Pakistan, Afghanistan, and India, the European Mediterranean Seismological Center (EMSC) said on Twitter.\nThe EMSC also said an earthquake with a magnitude of 6.5 struck in southern Iran around the same time."
  },
  {
    "headline": "Impeachment: Oyo Deputy Gov, Olaniyan shuns lawmakers, refuses to respond to allegations",
    "summarized_story": "The lawmakers in the petition said that failure of the deputy governor to respond to the allegations within seven days will lead to impeachment.\nThe lawmakers unanimously said that they would give the Deputy Governor a seven-day grace period to respond to the allegations.\nOur correspondent learnt from sources close to the deputy governor and some of the lawmakers that the deputy governor did not respond to the allegations within the seven-day period.\nA credible source close to the lawmakers explained that the deputy governor was unable to respond to the allegations within the period given to him to respond.\n“Like I said earlier, the deputy governor is the one that is in the best position to answer your question.”"
  },
  {
    "headline": "Court orders forfeiture of Sambo Dasuki son’s Abuja property to FG",
    "summarized_story": "A Federal High Court, Abuja, on Wednesday, ordered a temporary forfeiture of a N90 million worth of property linked to Abubakar Dasuki, son of former National Security Adviser (NSA), Sambo Dasuki, to the Federal Government.\nJustice Emeka Nwite, in a ruling, gave the order after counsel for the Economic and Financial Crimes Commission (EFCC), Olanrewaju Adeola, moved an ex-parte motion to the effect.\nThe News Agency of Nigeria (NAN) reports that the property, a seven-bedroom detached duplex with a basement and two servant rooms, is located at House No.\nEarlier, while moving the motion, Adeola informed that the ex-parte marked: FHC/ABJ/CS/589/2022 and dated April 26 was filed on April 29.\nThe commission said the letters of investigation activities were written to the suspect, Fidelity Bank, Corporate Affairs Commission (CAC) and Brains and Hammers Ltd (Real Estate Developer) and responses were received."
  },
  {
    "headline": "Senate receives request from Buhari to confirm Mohammed Bello as RMAFC Chairman",
    "summarized_story": "Nigerian Senate on Wednesday received a formal request from President Muhammadu Buhari to confirm Mohammed Bello Shehu as Chairman of the Revenue Mobilisation Allocation and Fiscal Commission.\nThe request was contained in a letter read by the Senate President, Ahmad Lawan, at plenary on Wednesday.\n“It is my hope that the Senate will consider and confirm the nominee in the usual expeditious manner.”In a related development, the Senate President, Ahmad Lawan, on Wednesday, forwarded President Buhari’s request to confirm the nomination of Joe Aniku Michael Ohiani for appointment as Substantive Director-General/CEO for the Infrastructure Concession Regulatory Commission (ICRC) to the Committee on Works.\nAlso forwarded was the President’s request for the confirmation of Umar Yahaya as Co-Chairman of the Governing Council of Unclaimed Funds to the Committee on Banking, Insurance, and Other Financial Institutions.\nThe respective Committees were given two weeks to report back to the Senate in plenary."
  },
  {
    "headline": "Two Senators announce defection",
    "summarized_story": "Two Senators on Wednesday announced their defection from their former political parties to another party ahead of the 2023 general election.\nThe Senators are: Francis Ezenwa Onyewusi representing Imo East Senatorial district and Haliru Dauda Jika representing Bauchi Central Senatorial district.\nTheir defection was made known by the Senate President, Dr. Ahmad Ibrahim Lawan during a plenary on Wednesday.\nWhile Senator Francis Onyewusi who is a first-timer to the Senate was a member of the Peoples Democratic Party (PDP) and defected to Labour Party (LP), his counterpart in Bauchi was a member of the ruling All Progressives Congress (APC) before he defected to the New Nigeria Peoples Party (NNPP).\nThe defected Senators cited injustice and inequity in their former political parties that made them fail the primary elections."
  },
  {
    "headline": "‘You’re a disgrace, uninformed liar’ – IPOB attacks Buhari over pipeline vandalism comment",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has berated President Muhammadu Buhari for linking its members to pipeline vandalism.\nIPOB described Buhari’s remark linking IPOB to pipeline vandalism as laughable, disgraceful, and false.\nThe spokesman of IPOB, Emma Powerful, said Buhari’s comment has exposed how shallow-minded and uninformed he is about Nigeria’s affairs.\n“Muhammadu Buhari should tell America and other Western countries the locations of pipelines IPOB vandalised in their evil country.\nThe allegation against IPOB by Buhari is childish because everybody knows that IPOB does not engage in pipeline vandalism in Nigeria."
  },
  {
    "headline": "BREAKING: Buhari nominates Mohammed Shehu as RMAFC chairman The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari on Wednesday urged the Senate to screen and confirm Alhaji Mohammed Shehu for appointment as the Chairman, Revenue Mobilisation Allocation and Fiscal Commission (RMAFC).\nBuhari’s request for the confirmation of Shehu was contained in a letter read at plenary by Senate President, Ahmad Lawan.\nThe letter reads in part: “In accordance with the provision of Section 154 (1) of the 1999 Constitution of the Federal Republic of Nigeria as amended, I am pleased to forward for confirmation by the Senate, the appointment of Mohammed Bello Shehu, as the Chairman of the Revenue Mobilisation Allocation and Fiscal Commission.\n“It is my hope that the Senate will consider and confirm the nominee in the usual expeditious manner.”"
  },
  {
    "headline": "Power, five other Ministries make presentations as Buhari presides over FEC The Nation Newspaper",
    "summarized_story": "Power, five other Ministries make presentations as Buhari presides over FECPresident Muhammadu Buhari is currently presiding over virtual weekly meeting of the Federal Executive Council (FEC)at the Council Chambers of the Presidential Villa, Abuja.\nThe News Agency of Nigeria (NAN) reports that the Ministries of Power; Works and Housing; Trade, Industry and Investment; Health as well as Finance are expected to make presentations at the meeting.\nAlso present are, the Minister of Information and Culture, Alhaji Lai Mohammed, Attorney General and Minister of Justice, Abubakar Malami, Finance, Zainab Ahmed and Works and Housing, Babatunde Fashola.\nThe Ministers of Labour and Employment, Dr Chris Ngige, Power, Abubakar Aliyu, Trade Industry and Investment, Niyi Adebayo, Federal Capital Territory, Mohammed Bello and Minister of State-Health, Mamora Olorunnimbe are also attending the meeting.\nOther cabinet members are participating virtually from their respective offices in Abuja."
  },
  {
    "headline": "TIMELINE: Abduction of clerics, attack on Churches in Nigeria The Nation Newspaper",
    "summarized_story": "Between June 2021 and June 2022 in Nigeria, a handful of clerics have been abducted and killed while some regained freedom.\nOn March 24, 2022, Rev Fr Felix Zakari Fidson, of the Diocese of Zaria, Kaduna State, was also abducted.\nIn April last year, gunmen kidnapped Rev Fr Izu Marcel Onyeocha of Mother Theresa of Kolkata Catholic Church.\nIn May 2021, St Vincent Ferrer Malumfasi Catholic Parish in Sokoto was attacked and two priests were abducted; one was killed and the other was released later.\nIn January 2021, Fr Joseph Danjuma Shekari of Kafanchan diocese was kidnapped from his parish house, and later released."
  },
  {
    "headline": "Adegoroye, Umana, five others tipped as ministers The Nation Newspaper",
    "summarized_story": "Adegoroye, Umana, five others tipped as ministersPresident Muhammadu Buhari yesterday forwarded the names of seven ministerial nominees to the Senate for screening and confirmation.\nThe nominees for confirmation include: Henry Ikechukwu Ikoh (Abia State), Umana Okon Umana (Akwa Ibom), Ekumankama Joseph Nkama (Ebonyi); and Goodluck Nnana Opiah (Imo).\nSome All Progressives Congress (APC) ministers had resigned their positions to contest primary elections in the party.\nThey include the Minister of State for Education, Emeka Nwajiuba; Minister of Niger Delta Affairs, Godswill Akpabio; Minister of Science, Technology and Innovation, Ogbonnaya Onu, and Minister for State for Niger Delta Affairs, Senator Tayo Alasoadura.\nWhile Nwajiuba, Akpabio, Onu and Amaechi lost their bids for the Presidency, Alasoadura failed to clinch a senatorial ticket in Ondo State."
  },
  {
    "headline": "Why we dropped subsidy removal plan, by Buhari The Nation Newspaper",
    "summarized_story": "Petrol subsidy removal was suspended because it was not in the country’s best interest, President Muhammadu Buhari said yesterday.\nAlthough his administration was on the verge of removing petrol subsidy last year, President Buhari said it became inadvisable after input from industry experts and other economic factors.\nAccording to him, issues around petrol subsidy would be resolved through ongoing efforts at boosting local refining, especially through private sector involvement.\nOn why taxes cannot be increased, President Buhari said 80 per cent of those to be taxed are in the informal sector.\nOn Nigeria’s rising debt profile, President Buhari, said a narrow focus on debt misses the point."
  },
  {
    "headline": "Buhari to attend 26th CHOGM in Kigali, Rwanda",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari will participate in the 26th Commonwealth Heads of Government Meeting (CHOGM), being held in Kigali, Rwanda, from June 20 to 26.\nPresident Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday 24 and Saturday 25 June.\nThe leaders are expected to consider a range of topical issues including post-COVID-19 economic recovery, debt sustainability, climate change, poverty reduction, youth entrepreneurship and employment, trade and food security.\nOn the margins of the meeting, President Buhari is scheduled to deliver remarks at the High-Level Session of Malaria and Neglected Tropical Diseases Summit and participate in an Intergenerational Dialogue for Youth.\nPresident Buhari is also expected to hold bilateral talks with some leaders from the Commonwealth countries."
  },
  {
    "headline": "Buhari presides over FEC meeting",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is presiding over a virtual weekly meeting of the Federal Executive Council (FEC) at the Council Chambers of the Presidential Villa, Abuja.\nAlso present are some Ministers.\nThey include the Minister of Information and Culture Lai Mohammed, the Attorney General and Minister of Justice Abubakar Malami, Minister of Finance Zainab Ahmed and Minister of Works and Housing Babtunde Fashola.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Presidential ambition: Buhari breaks silence on CBN gov, Emefiele",
    "summarized_story": "The suit was seeking to restrain the Independent National Electoral Commission (INEC) and the country’s attorney general from disqualifying him from pursuing his presidential ambition.\nIn an interview with Bloomberg, asked if he he was concerned about the debate around the central bank’s independence following Emefiele’s interest in running for president, Buhari replied: “The CBN governor is appointed by the president.\nWhat our western allies are learning the hard way is what looks good on paper and the human consequences are two different things.\nChristianity and Islam, our two great faiths and their great books have far more in common than they have apart.\nNigeria has a long tradition of tolerance that we must draw on, and we must strive to find common ground."
  },
  {
    "headline": "INEC shuns court order on voter registration",
    "summarized_story": "From Romanus Ugwu, AbujaIndependent National Electoral Commission (INEC) has said there was no going back on its June 30 deadline for registration of voters.\nThis is as it has tasked Nigerian youths to translate their social media revolution into active participation in politics, especially going out to vote during elections.\nINEC Resident Electoral commissioner (REC) for Abuja, Yahaya Bello, spoke during Continuous Voter Registration (CVR) campaign organised by INEC in conjunction with the European Union (EU) in Abuja, yesterday.\n“Ending the registration exercise on June 30 will help us commence the process of printing the PVCs which the owners will continue to collect till early next year,” he said.\nEU representative at the event, Omowuni Laolu, regretted that the high number of youths in the country does not translate to effective participation in elections."
  },
  {
    "headline": "Fuel Scarcity: Ex-depot price hits N161",
    "summarized_story": "By Adewale SanyaoluCurrent economic variables, including the Russian-Ukraine crisis and hyper inflation among other distortions have pushed the ex-depot price of Premium Motor Spirit to N161 per liter, Daily Sun findings have revealed.\nThis implies that when other ancillary costs like diesel cost and union dues are added to the ex-depot price of N161 per litre, the landing cost at the filling stations would be in the range of N180-N185 per litre.\nCuriously, the NNPC filling station on College Road in Ogba as at 4.10pm yesterday, sold a litre of petrol at N180 as against the official price of N165.\nCuriously, since the fuel scarcity started on Sunday, the Nigerian National Petroleum Company Limited(NNPC) which is the importer of last resort has kept mum on what has led to the disruption in supply.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Petrol Price to Remain at N165 Per Litre, NMDPRA Insists",
    "summarized_story": "The statement by the NMDPRA that insisted on N165 per litre for pump price, came on the heels of the recent agitation by the Independent Petroleum Marketers Association of Nigeria (IPMAN) that PMS sold at N165 was no longer sustainable.\nThe Executive Director, Distribution Systems, Storage and Retailing Infrastructure, NMDPRA, Mr. Ogbugo Kalu, who spoke at a media briefing said the Authority was ever ready to enforce the price on independent marketers who are planning to increase pump price to N180 per litre.\nThe pump price remains at N165.\nNigerians will continue to enjoy the free flow of petroleum products,” he added.\nThe IPMAN chairman said based on current economic realities, the sustainable pump price for petrol in in the country should be at N180 per litre."
  },
  {
    "headline": "Buhari Defends Emefiele, Says CBN Governor’s Unorthodox Policies Best for Economy",
    "summarized_story": "“Instead, the governor is following an alternative economic model that puts people at the heart of policy.\nHe said, “The CBN governor is appointed by the president.\nAccording to him, while the removal of subsidy may look good on paper, the impact on Nigerians would be largely negative and unbearable.\nBuhari said that his successor would inherit a far more resilient economy, thanks to investments in infrastructure and policies that he said had bolstered local production.\nBuhari said, “In 2015, Boko Haram held territory the size of Belgium within the borders of Nigeria."
  },
  {
    "headline": "President Seeks Senate’s Nod for Seven Ministerial Nominees",
    "summarized_story": "Others were Umar Ibrahim El-Yakub – Kano State; Ademola Adewole Adegoroye – Ondo State; and Odum Odi – Rivers State.\nSenate President Ahmad Lawan read Buhari’s letter requesting confirmation of the nominees on the floor of the Senate during plenary.\nLawan read the letter from PDP on the choice of new Minority Leader and Minority Whip at the start of plenary.\nAPC Loses Three More Senators to Opposition PartiesThree APC senators resigned their membership of the ruling party.\nThe defection of the three lawmakers reduced the total number of APC senators from 64 to 62 in the upper chamber, while PDP has risen from 39 to 41."
  },
  {
    "headline": "Insecurity: Buhari Says Trust Has Been Rebuilt with Traditional Western Allies",
    "summarized_story": "Today they are close to extinct as a military force.\nThe leader of ISWAP was eliminated by a Nigerian Airforce airstrike in March.\nThis must stop”, he said.”My administration is the only in Nigeria’s history to implement a solution to decades-long herder-farmer conflicts, exacerbated by desertification and demographic growth.\nThe National Livestock Transformation Plan, putting ranching at its core, is the only way to deplete the competition for resources at the core of the clashes.\n“Governors from some individual states have sought to play politics where ranches have been established; but where they have been disputes have dramatically reduced”, he said."
  },
  {
    "headline": "Buhari: My Govt Recovered N152bn Looted Funds in 2021",
    "summarized_story": "*Other recoveries include $386m, £1.1m, €157,000Kingsley Nwezeh in AbujaPresident Muhammadu Buhari has said that his administration’s anti-corruption drive led to the recovery of N152 billion between January and December, 2021.Other recoveries include $386 million, 1.1 million pounds and 1.7 million Saudi Riyals.\nIn an interview with Bloomberg, President Buhari said such recoveries was not possible with previous administration because there was palpable fear that the looted funds may be relooted.”Starting with our whistleblowing policy enacted in my first year in office, hundreds of millions in stolen funds have been returned.\nDollar recoveries for the year amount to over USD 386 million; GBP, more than 1.1 million; Euro, about 157,000; Saudi Riyals about 1.7 million, some more in digital and other currencies”, he said.”Those partners refused to return these monies held for decades to previous Nigerian administrations in the certainty they would simply be re-stolen.\nThey changed their approach with us because they knew my administration could be trusted”, he said.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Junketing Nigerian President, Buhari Embarks On Another Trip To Rwanda",
    "summarized_story": "President Muhammadu Buhari, infamous for frivolous foreign trips, will be travelling to Kigali, Rwanda on Wednesday for the 26th Commonwealth Heads of Government Meeting (CHOGM).\nThis was stated by Femi Adesina, presidential spokesman, adding that the meeting is slated for June 20 to 26.\nHe further said Buhari is scheduled to deliver remarks at the high-level session of Malaria and neglected tropical diseases summit and participate in an intergenerational dialogue for youth.\n“President Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday 24 and Saturday 25 June.\nBuhari will return to Nigeria on June 26."
  },
  {
    "headline": "Junketing Nigerian President, Buhari Embarks On Another Trip To Rwanda",
    "summarized_story": "President Muhammadu Buhari, infamous for frivolous foreign trips, will be travelling to Kigali, Rwanda on Wednesday for the 26th Commonwealth Heads of Government Meeting (CHOGM).\nThis was stated by Femi Adesina, presidential spokesman, adding that the meeting is slated for June 20 to 26.\nHe further said Buhari is scheduled to deliver remarks at the high-level session of Malaria and neglected tropical diseases summit and participate in an intergenerational dialogue for youth.\n“President Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday 24 and Saturday 25 June.\nBuhari will return to Nigeria on June 26."
  },
  {
    "headline": "Workers In Nigerian Agency, NAFDAC Embark On Strike Over Non-payment Of Allowances",
    "summarized_story": "Medical and health workers union of the National Agency for Food and Drug Administration and Control (NAFDAC), on Wednesday, embarked on a strike.\nThe striking workers under the aegis of Medical and Health Workers Union of Nigeria said they would not call off the strike until their welfare packages were paid.\n“According to the director of administration, the workers declared a strike action but the union is divided,” the source said.\nIf management does not give in to their request, then they can join the Lagos workers to embark on the strike.\nThey are trying to fix another meeting but the Lagos people refused; saying they want to go on strike.”"
  },
  {
    "headline": "Workers In Nigerian Agency, NAFDAC Embark On Strike Over Non-payment Of Allowances",
    "summarized_story": "Medical and health workers union of the National Agency for Food and Drug Administration and Control (NAFDAC), on Wednesday, embarked on a strike.\nThe striking workers under the aegis of Medical and Health Workers Union of Nigeria said they would not call off the strike until their welfare packages were paid.\n“According to the director of administration, the workers declared a strike action but the union is divided,” the source said.\nIf management does not give in to their request, then they can join the Lagos workers to embark on the strike.\nThey are trying to fix another meeting but the Lagos people refused; saying they want to go on strike.”"
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Tribunal, CCT Chairman, Umar Allegedly Inflates Contracts, Uses Attorney-General Malami To Escape Probe By Anti-graft Agency, EFCC",
    "summarized_story": "Some workers in the Code of Conduct Tribunal, Abuja, have accused its chairman, Danladi Umar, of fraud, corruption, nepotism and marginalisation.\nThe chairman was also accused of awarding fraudulent contracts to friends without recourse to procedure and due process.\nThe source also accused Umar of turning the Jabi headquarters of the agency in Abuja to a hotel by allegedly bringing different women to sleep with him in the office overnight.\nIn a five-minute viral video clip, he was seen slapping and kicking the security guard after an altercation ensued between them over a parking space on the premises of the plaza.\nHe subsequently went to court to challenge the powers of the Senate to investigate him in an alleged assault against the security guard."
  },
  {
    "headline": "Peter Obi's party gains one, NNPP another as senators defect from PDP, APC",
    "summarized_story": "Francis Ezenwa, senator representing Imo east (pictured), has defected from the Peoples Democratic Party (PDP) to the Labour Party (LP).\nHaliru Jika, senator representing Bauchi central, has also defected to the New Nigeria Peoples Party (NNPP) from the All Progressives Congress (APC).\nAdvertisementOn Tuesday, three All Progressives Congress (APC) senators defected to other political parties.\nAhmad Babba Kaita, senator representing Katsina north; Lawal Yahaya Gumau, senator representing Bauchi north, and Francis Alimikhena, senator representing Edo north, all defected to other parties.\nAdvertisementGumau defected to the New Nigeria Peoples Party (NNPP), a party led by Rabiu Kwankwaso, former governor of Kano state."
  },
  {
    "headline": "Peter Obi's party gains one, NNPP another as senators defect from PDP, APC",
    "summarized_story": "Francis Ezenwa, senator representing Imo east (pictured), has defected from the Peoples Democratic Party (PDP) to the Labour Party (LP).\nHaliru Jika, senator representing Bauchi central, has also defected to the New Nigeria Peoples Party (NNPP) from the All Progressives Congress (APC).\nAdvertisementOn Tuesday, three All Progressives Congress (APC) senators defected to other political parties.\nAhmad Babba Kaita, senator representing Katsina north; Lawal Yahaya Gumau, senator representing Bauchi north, and Francis Alimikhena, senator representing Edo north, all defected to other parties.\nAdvertisementGumau defected to the New Nigeria Peoples Party (NNPP), a party led by Rabiu Kwankwaso, former governor of Kano state."
  },
  {
    "headline": "'I walked through deadly forest’ — Chibok girl recounts how she escaped from captivity",
    "summarized_story": "Hauwa Joseph and Mary Dauda, two missing Chibok girls found on Thursday, have recounted how they escaped from captivity.\nThe rescued girl said she walked through the Sambisa forest for many days before she found help.\n“I finally arrived at Gava village in Gwoza, after walking for many hours through the deadly forest under harsh condition.\nI then left her and proceeded towards Ngoshe town.\nAt about 8 p.m., he took me to Ngoshe town and told me to pass the night on the outskirt of the town and proceed the next morning."
  },
  {
    "headline": "'I walked through deadly forest’ — Chibok girl recounts how she escaped from captivity",
    "summarized_story": "Hauwa Joseph and Mary Dauda, two missing Chibok girls found on Thursday, have recounted how they escaped from captivity.\nThe rescued girl said she walked through the Sambisa forest for many days before she found help.\n“I finally arrived at Gava village in Gwoza, after walking for many hours through the deadly forest under harsh condition.\nI then left her and proceeded towards Ngoshe town.\nAt about 8 p.m., he took me to Ngoshe town and told me to pass the night on the outskirt of the town and proceed the next morning."
  },
  {
    "headline": "IPOB tackles Buhari, says allegation of pipeline vandalism laughable",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says the allegation of pipeline vandalism levelled against the group by President Muhammadu Buhari is “childish and shallow-minded” .\nTheCable had reported that Buhari, in an interview with Bloomberg, asked western allies to designate IPOB as a terrorist group “over involvement” in pipeline and infrastructure vandalism in the country.\nReacting to the president’s comment, Emma Powerful, IPOB spokesperson, in a statement released on Wednesday, said everyone, including the international community, knows that IPOB is not involved in pipeline vandalism.\n“The allegation against IPOB by Buhari is childish because everybody knows that IPOB does not engage in pipeline vandalism in Nigeria.\n“Buhari should be reminded that his western audience already knows the actual culprits behind pipeline vandalism in Nigeria and who the beneficiaries are."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Healthtracka raises money to expand at-home lab testing",
    "summarized_story": "Healthtracka, a Nigerian startup that offers convenient at-home lab tests, has raised $1.5 million in pre-seed funding, according to a statement shared with TechCabal today.\nThis is because doctor consultations, even virtual ones, end with patients being required to take a lab test at a hospital.\nNow they can now order lab tests for the patient using Healthtracka’s API.\nUsers can go on Healthtracka’s website and book lab tests ranging from fertility and STD tests to full blood count and COVID tests.\nIt also wants to expand its offering by launching an API that will allow both telemedicine services and traditional healthcare providers to offer at-home lab testing."
  },
  {
    "headline": "Inside Amazon Prime Video's first Nollywood film production deal",
    "summarized_story": "On Tuesday, Nollywood production house, Nemsia Films, announced that it closed an exclusive slate deal for 3 commissioned feature films with American streaming giant, Amazon Prime Video, which made its foray into Nollywood in December last year.\nIn practice, Amazon is reserving the IP rights of the 3 films on the slate deal, and will cover their production costs.\nLoup Garou is a small production company focused mostly on music video production.\nMore skin in the gameIt’s no more news that Amazon Prime Video is not only keen on entering the second biggest film industry in the world, Nollywood, but wants to build a formidable local content bank.\nWould Amazon Prime Video’s entry into Nigeria intensify the competition, and would it dominate the market?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Attack on Journalists in Lagos and Ekiti: IPC Demands Strong Action – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The International Press Centre (IPC) Lagos-Nigeria has stated that it is expressed extremely concerned about the attack on journalists in the convoy of Governor Babajide Sanwo-Olu on Sunday June 19, 2022 in Lagos.\nThe affected journalists, Adeola Ogunrinde and Omatseye Atsenuwa of Smooth 98’1fm, were severely injured, while Adedoja Salam of TVC was left in a state of shock.\nAlso, IPC decried the arrest and detention of Jeremiah Omoniyi, a campus journalist who was deployed by the Centre for Journalism Innovation and Development (CJID) to cover the Ekiti governorship poll.\nMr. Arogundade said the conduct of the DSS operatives amounted to undue harassment and obstruction of a professional journalist on legitimate election duty.\nIPC said further that the Lagos and Ekiti incidents have again made it imperative for media owners, the political parties and the government to put in place mechanisms for the protection of journalists during campaigns and elections."
  },
  {
    "headline": "20 missing Chibok Girls still in Sambisa Forest, Rescued girls – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMary Dauda and Hauwa Joseph, the two rescued girls abducted from the GGSS Chibok in Borno in 2014, have revealed that more than 20 missing others are still in Gazuwa camp in Sambisa Forest, eight years after being kidnapped by Boko Haram insurgents.\nMaj.-Gen. Christopher Musa, The Theartre Commander, Operation Hadin Kai (OPHK) North East Joint Operation, said that both girls were among the list of the missing Chibok girls.\nMusa said that the girls were rescued due to a massive military operation in Sambisa Forest, Mandara Mountain, and the Lake Chad area.\nBoko Haram kidnapped 276 female students, aged between 16 and 18 from the Government Girls Secondary School, Chibok, Borno State in April 2014.\nOver 100 of the girls were still missing as at April 14, 2021, seven years after the initial kidnapping."
  },
  {
    "headline": "Buhari urges UK, EU countries to invest in 4,000 km Nigeria-Morocco gas pipeline – Nigerian Observer",
    "summarized_story": "The president, who made the call in an interview session with Bloomberg News, said the UK and EU countries should invest in the planned 4000 km pipeline meant to bring Nigerian gas – the largest reserves in Africa – via Morocco, then onto Europe.\nHe expressed the hope that the gas pipeline project, when completed would help to address gas supply crisis in Europe.\n”It does not help their energy security, it does not help Nigeria’s economy, and it does not help the environment.\n”To change, the UK and EU countries should invest in our planned 4000 km pipeline to bring Nigerian gas – the largest reserves in Africa – via Morocco, then onto Europe.”He further explained that the gas pipeline project, connecting Nigeria to Europe which was conceived four years ago, had since been unveiled.\n‘ ‘The CBN governor is appointed by the President."
  },
  {
    "headline": "Edo PDP: Kassim Afegbua not our member – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State chapter of the Peoples Democratic Party (PDP), on Tuesday, said Prince Kassim Afegbua, a former Presidential Campaign spokesman of the party, has long been expelled from the party and no longer a bonafide member of the PDP in the state.\nIn a statement, the State Publicity Secretary of the PDP, Ogie Aigbe Vasco, said Kassim Afegbua was expelled from the party for anti-party activities.\nHe said, “The Edo State Chapter of the PDP wishes to notify its members, supporters and critical stakeholders that Prince Kassim Afegbua, a former Presidential Campaign spokesman of our dear party, has long ceased to be a bonafide member of the PDP in Edo State.\n“Our attention has been drawn to the numerous media showmanship being put up by a former member of the PDP family in Edo State, Prince Kassim Afegbua in the past few days.\nHe is not a member of the PDP Edo State family and should stop deceiving himself to be one,” he added."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Fuel scarcity: Regulatory authority says petrol must remain at N165 per litre",
    "summarized_story": "Nigeria’s Midstream and Downstream Petroleum Regulatory Authority (MDPRA) has insisted that fuel price must remain at N165 because it is a regulated product and the prices are fixed.\nThe agency noted that the ex-depot price is known and that the pump price remains N165 which the authority is ever ready to enforce the rule.\nUkoha disclosed that the war between Russia and Ukraine had led to an increment in the cost of Automotive Gas Oil (diesel), which is used in transporting petroleum products from the depots to the retail outlets.\nThe pump price remains N165 and the authority is ever ready to enforce those rules.\n“We want Nigerians to continue to enjoy the free flow of petroleum products,” he said."
  },
  {
    "headline": "EU pledges 600m Euro to help vulnerable nations affected by Ukraine war",
    "summarized_story": "Adebayo ObajemuThe European Union, EU, has said it would roll out 600 million Euro to help the vulnerable nations in Africa and the Caribbean whose economies have been badly affected by the Russian military campaign in Ukraine sparkled by the Vladimir Putin administration’s opposition to the Ukraine bid to join the European Union.\nAccording to EU president, Ursula von Leyen ,the pledged money will help Africa and other poor nations especially in solving food crisis.\nThe funds include 150 million euros in humanitarian assistance for African, Caribbean and Pacific nations and 350 million euros to boost sustainable food production in the longer term.\nAccording to EU, the funds will help reduce the devastating impact of the war on vulnerable nations, especially in global South.\nThe war has led to blockades of wheat by the Russians which has affected many nations across the globe."
  },
  {
    "headline": "Buhari appoints Abdullahi Bala as executive secretary of Nigeria Police Trust Fund",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has approved the appointment of Mr. Abdullahi Bala as the new Executive Secretary for the Nigeria Police Trust Fund (NPTF).\nHis career trajectory got to its apex in May, 2009, when he was appointed as Permanent Secretary in Sokoto State Civil Service.\nThe highly cerebral and resourceful Administrator, worked as Permanent Secretary in several states Ministries, Departments and Agencies, including Ministries of Finance, Health, and Education.\nHe also held several other appointments such as, Secretary Sokoto State Government Committee on Audit Inspection Report, Chairman Health Financing Technical Group, Secretary Sokoto State Government Policy Council on the state of Emergency on Education amongst others.\nThe appointment takes immediate effect."
  },
  {
    "headline": "Stock Market ends losing streak, gains N181bn",
    "summarized_story": "The All-Share Index rose by 335.01 absolute points, an increase of 0.66 per cent to close at 51,091.75 points.\nOn market outlook, GTI Securities Limited said: “Equity market resumes a bullish trend, as investors bargain hunting on oversold stocks.\nTransactions in the shares of Transnational Corporation of Nigeria (Transcorp) topped the activity chart with 19.338 million shares valued at N24.392 million.\nUnited Bank for Africa (UBA) followed with 17.590 million shares worth N131.213 million, while Guaranty Trust Holding Company (GTCO) traded 17.287 million shares valued at N365.183 million.\nZenith Bank traded 12.807 million shares valued at N281.888 million, while FBN Holdings (FBNH) transacted 11.335 million shares worth N95.428 million"
  },
  {
    "headline": "Rescued Chibok school girls say 20 of their colleagues still in Sambisa Forest",
    "summarized_story": "Two rescued Chibok school girls, Mary Dauda and Hauwa Joseph, have revealed that more than 20 missing others are still in Gazuwa camp in Sambisa Forest, eight years after being kidnapped by Boko Haram insurgents.\nThe duo were part of the over 250 students of Government Girls Secondary School, Chibok in Borno State abducted by Boko Haram in 2014.\nMajor General Christopher Musa, The Theatre Commander, Operation Hadin Kai North East Joint Operation, said both girls were among the list of the missing Chibok girls.\nMusa said that the girls were rescued due to a massive military operation in Sambisa Forest, Mandara Mountain and Lake Chad area.\nBoko Haram kidnapped 276 female students, aged between 16 and 18, from the Government Girls Secondary School in Chibok, Borno State in April 2014."
  },
  {
    "headline": "BREAKING: INEC Agrees To Extend Voter Registration By 60 Days",
    "summarized_story": "The Independent National Electoral Commission (INEC) has agreed to extend the ongoing continuous voter registration (CVR) exercise initially slated to end at the end of June, 2022.\nChairman of the House of Representatives Committee on Electoral Matters, Hon.\nThe House of Representatives had last Wednesday urged INEC to extend the deadline for the continuous voter registration by an extra 60 days from June 30, 2022, to enable more Nigerians to register.\nADVERTISEMENTThe House also called on the Commission to deploy additional staff and voter registration machines across the country to meet the objective.\nThe chairman, House Committee on media and publicity, Hon."
  },
  {
    "headline": "BREAKING: INEC Agrees To Extend Voter Registration By 60 Days",
    "summarized_story": "The Independent National Electoral Commission (INEC) has agreed to extend the ongoing continuous voter registration (CVR) exercise initially slated to end at the end of June, 2022.\nChairman of the House of Representatives Committee on Electoral Matters, Hon.\nThe House of Representatives had last Wednesday urged INEC to extend the deadline for the continuous voter registration by an extra 60 days from June 30, 2022, to enable more Nigerians to register.\nADVERTISEMENTThe House also called on the Commission to deploy additional staff and voter registration machines across the country to meet the objective.\nThe chairman, House Committee on media and publicity, Hon."
  },
  {
    "headline": "President Buhari Off To Rwanda For Commonwealth Meeting",
    "summarized_story": "President Muhammadu Buhari will depart Abuja Wednesday, June 22, for Kigali, Rwanda, to attend the 26th Commonwealth Heads of Government Meeting (CHOGM), being held from June 20 to 26, 2022.\nAccording to a statement by presidential spokesman, Femi Adesina, President Buhari will join other leaders to participate in discussions focused on the progress and prosperity of the more than two billion people living in the 54 independent countries in Africa, Asia, the Americas, Europe and the Pacific that make up the Commonwealth.\nPresident Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday, June 24 and Saturday, June 25.\nPresident Buhari is also expected to hold bilateral talks with some leaders from the Commonwealth countries.\nThe President will return to the country on Sunday, June 26, 2022."
  },
  {
    "headline": "President Buhari Off To Rwanda For Commonwealth Meeting",
    "summarized_story": "President Muhammadu Buhari will depart Abuja Wednesday, June 22, for Kigali, Rwanda, to attend the 26th Commonwealth Heads of Government Meeting (CHOGM), being held from June 20 to 26, 2022.\nAccording to a statement by presidential spokesman, Femi Adesina, President Buhari will join other leaders to participate in discussions focused on the progress and prosperity of the more than two billion people living in the 54 independent countries in Africa, Asia, the Americas, Europe and the Pacific that make up the Commonwealth.\nPresident Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday, June 24 and Saturday, June 25.\nPresident Buhari is also expected to hold bilateral talks with some leaders from the Commonwealth countries.\nThe President will return to the country on Sunday, June 26, 2022."
  },
  {
    "headline": "How To Achieve Tobacco Harm Reduction – Baker",
    "summarized_story": "Speaking at Open Science, a PMI event that focuses on the concept of tobacco harm reduction and the role scientifically substantiated smoke-free products can play by complementing existing tobacco control measures, Baker said the next available challenge is to make people switch to the products.\nThe world currently has about 1.1 billion smokers, most of whom are at the risk of contracting cardiovascular diseases, lung cancer and other smoking related diseases, fueling the call for aggressive efforts towards tobacco harm reduction.\nADVERTISEMENT“The acceptability of the product is very important”, Dr Baker, an epidemiologist and an expert in tobacco harm reduction, has said while noting that people who quit smoking completely have reduced risk of contracting cardiovascular diseases.\n“To achieve harm reduction, we need products that will reduce the risk to individuals that use these products.\nThe way to maximise harm reduction potential is to eliminate tobacco completely but using alternatives like the heated tobacco products or e-cigarettes where cessation is not possible, can help to reduce harm."
  },
  {
    "headline": "Buhari with 5 ministers leaves Abuja for Commonwealth summit in Rwanda",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari will depart Abuja on Wednesday for Kigali, Rwanda, to attend the 26th Commonwealth Heads of Government Meeting (CHOGM), being held from June 20 to 26.\nThis was disclosed by the President’s spokesman, Mr. Femi Adesina, in a statement on Wednesday in Abuja.\nThe summit has the theme “Delivering a Common Future: Connecting, Innovating, Transforming”.\n“President Buhari is also expected to hold bilateral talks with some leaders from the Commonwealth countries,” he further stated.\nThe biennial meeting was due to take place in June 2020, but was postponed twice due to the COVID-19 pandemic."
  },
  {
    "headline": "Delta PDP announces Onyeme as Oborevwori's running mate",
    "summarized_story": "By Ifeanyi OlannyeThe Peoples Democratic Party (PDP) has announced Mr. Monday Onyeme as the running mate of Sheriff Oborevwori, the Delta governorship candidate of the party for the 2023 general elections.\n“Delta PDP, hereby announces Mr. Monday Onyeme, as the deputy governorship candidate and running mate of our party.\n“Above all, he is a loyal, dedicated and true party man, totally committed, well respected, and truly beloved in the PDP family.\nHe is also a devout Christian and a complete family man and happily married with lovely children,” he said.\nWhile congratulating Onyeme, the party expressed confidence that the PDP would win the 2023 governorship election in the state."
  },
  {
    "headline": "‘You’re A Disgrace, Uninformed Liar’ — IPOB Attacks Buhari Over Pipeline Vandalism Comment",
    "summarized_story": "President Muhammadu Buhari has come under fire from the Indigenous People of Biafra (IPOB) for associating its members with pipeline sabotage.\nIPOB called Buhari’s assertion that IPOB was responsible for pipeline sabotage “laughable,” “disgraceful,” and “wrong.”Buhari’s comment, according to IPOB spokesman Emma Powerful, has shown how naive and ignorant of Nigerian affairs he is.\n“For the impostor in Aso Rock to tell the US and other Western countries that IPOB is responsible for pipeline vandalism in the Niger Delta shows how shallow-minded and uninformed he is.\n“Muhammadu Buhari should tell America and other Western countries the locations of pipelines IPOB vandalised in their evil country.\nThe allegation against IPOB by Buhari is childish because everybody knows that IPOB does not engage in pipeline vandalism in Nigeria."
  },
  {
    "headline": "Buhari jets out of Nigeria Wednesday",
    "summarized_story": "President Muhammadu Buhari will on Wednesday depart Nigeria for Kigali, Rwanda, to attend the 26th Commonwealth Heads of Government Meeting (CHOGM), being held from June 20 to 26, 2022.\nThis was disclosed by Femi Adesina, Special Adviser to the President on Media and Publicity, on Wednesday.\nBuhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday, 24 and Saturday, June 25.\nPresident Buhari is also expected to hold bilateral talks with some leaders from the Commonwealth countries.\nThe President will return to the country on Sunday, June 26, 2022."
  },
  {
    "headline": "Buhari Embarks On Another Trip To Rwanda",
    "summarized_story": "On Wednesday, President Muhammadu Buhari, who is notorious for taking extravagant vacations abroad, is going to Kigali, Rwanda, for the 26th Commonwealth Heads of Government Meeting (CHOGM).\nFemi Adesina, the presidential spokesperson, made this claim and added that the meeting is scheduled for June 20–26.\nHe added that Buhari would speak at the summit on malaria and neglected tropical diseases’ high level session and take part in a young intergenerational debate.\n“President Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday 24 and Saturday 25 June.\nBuhari will return to Nigeria on June 26."
  },
  {
    "headline": "NITDA’s Code Of Practice Will Tackle Fake News, Hate Speech — NADIR",
    "summarized_story": "The Network of Advocates for Digital Reporting (NADIR) has lauded the National Information Technology Development Agency (NITDA) for drafting a ‘Code of Practice for Interactive Computer Service Platforms/Internet Internet Intermediaries’.\nAt a press conference in Kano, the group said the code will not only strengthen press freedom and maintain the dignity of information but will also curtail fake news and hate speech before and during the 2023 elections.\nThe Coordinator, Dahiru Mohammed Lawal noted that the online space needed to be made comfortable for everyone to address issues that cause panic in society and infringe on laws.\n“An unregulated online space remains a recipe for civil unrest.\nNADIR recalled that on June 16, Meta (Facebook), Google, Twitter and Microsoft agreed to take a tougher line against disinformation, deep fakes and fake accounts, under an updated European Union (EU) Code of Practice or face hefty fines."
  },
  {
    "headline": "CJN to angry Supreme Court Justices: Your protest akin to dancing in market square",
    "summarized_story": "Chief Justice of Nigeria Ibrahim Tanko Muhammad has disputed the allegations of poor welfare levelled against him by his brother Justices at the Supreme Court.\n“The Supreme Court definitely does not exist outside its environment, it is also affected by the economic and socio-political climate prevailing in the country.\n“Besides, two Supreme Court Justices died within the period under consideration.\n“Two weeks ago, eight Supreme Court Justices were nominated for a workshop in London as the court cannot take all of them there at once otherwise the job would suffer.\nThere is none of the Apex Court Justices without SUV and back up cars."
  },
  {
    "headline": "Breaking [2022 Electoral Act]: Reps step down motion to override Buhari on statutory delegates",
    "summarized_story": "The House of Representatives on Tuesday, stepped down a motion seeking a resolution to override President Muhammadu Buhari on his failure to assent to amendment of the 2022 Electoral Act, to allow statutory delegates participate in congresses and conventions of their respective political parties.\nFailure of the assent had denied elected public office holders the chances of participating in the recently concluded primary elections of political parties in the country, as build up to the 2023 elections thickens.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Buhari names new ministers-designate, to replace Amaechi, others *See full list",
    "summarized_story": "The Senate has received the names of seven Ministerial nominees from President Muhammadu Buhari for confirmation as Ministers of the Federal Republic of Nigeria.\nThe confirmation request was contained in a letter addressed to the Senate President, Ahmad Lawan, and read on the floor at the start of plenary onnTuesday.\nPresident Buhari, in the letter, explained that the confirmation request was in accordance with the provisions of Section 147 subsection 2 of the 1999 Constitution of the Federal Republic of Nigeria as amended.\nThe nominees for confirmation include: Henry Ikechukwu Ikoh – Abia State; Umana Okon Umana – Akwa Ibom State; Ekumankama Joseph Nkama- Ebonyi State; and Goodluck Nana Opiah – Imo State.\nOthers are Umar Ibrahim El-Yakub – Kano State; Ademola Adewole Adegoroye – Ondo State; and Odum Odi – Rivers State."
  },
  {
    "headline": "9mobile empowers entrepreneurs, SMEs with The Hack",
    "summarized_story": "Kehinde Ibrahim, LagosINNOVATIVE and youth-centric telecommunications company 9mobile, has further demonstrated its commitment to the growth and development of Nigerian Small and Medium Enterprises (SMEs) with the first edition of The Hack for entrepreneurs.\nIt featured two main speakers, Director of Strategy, 9mobile, Karn Gulati, and business and sales expert Tricia Olufemi- Olumide (TriciaBiz).\nWelcoming the participants, Acting Head, Enterprise Business, 9mobile, Olalekan Fatusa, explained that the forum was designed to provide information that would help upcoming entrepreneurs succeed in their businesses.\n9mobile’s Enterprise Business wants to empower you with the requisite skills and knowledge as you walk on this challenging and sometimes very lonely entrepreneurship journey.\nManager, Fixed Solutions, 9mobile, Adedolapo Ilelaboye, and Manager, Enterprise Marketing, 9mobile, Oluwasegun Daodu, also discussed ‘Enterprise Cloud Solution’ and ‘Enterprise ComboPak’ with the participants."
  },
  {
    "headline": "Concession: Sirika, Labour Leaders Visit Istanbul, Brasilia Airports",
    "summarized_story": "Naomi DouglasAs part of efforts to ensure transparency and inclusiveness in the airport concession programme and choose the right model, the Aviation Minister, Senator Hadi Sirika led a team comprising officials of the ministry, agencies and organized labour on inspection tour of two successfully concessioned airports.\nHe added that the choice of the two airports was based on their popularity, size and their success stories in concession which he said will serve as a guide on the concession model and contribute to the successful delivery of the programme.\nHe reiterated government’s commitment to ensure that the principles of transparency and accountability which have been the hallmark of the process from inception will remain till the final delivery of the project.\nAt the two airports, the ream was presented with visual stories of their transition and positive impact of their concessions.\nOthers are the Senior Technical Assistant to the Minister, Yusuf Anas, Special Assistant to the Minister on Administration, Ahmed Sanusi, Secretary General of the Association of Nigerian Aviation Professionals, Saidu Abdulrazak, Secretary General of NUATE, Ocheme Abah, and Adenike Adesola CSS."
  },
  {
    "headline": "Top 81 students emerge in InterswitchSPAK 4.0 competition",
    "summarized_story": "Kehinde Ibrahim, LagosTHE top eighty-one (81) students have emerged from the over 12,000 students vying for a spot in the finals of the fourth edition of the InterswitchSPAK National Science Competition.\nThese students were shortlisted following the nationwide computer-based tests (CBT) that served as a basis for preogression into the competition.\nThese 81 students who scaled the screening process are representatives of 13 schools.\nOthers include Greater Tomorrow International College, Arigidi, Ondo State; Bofoat Model College, Ondo State; FUTA Staff Secondary School Akure, Ondo; Seolad International College, Ogun; Great Cornerstone International Science College, Ondo State; Apt Scholars Universal College, Ogun State; and Oritamefa Baptist Model School, Ibadan.\nThe InterswitchSPAK competition bestows on students rewards for their interest in STEM, with the first-place winner going home with N7.5 million in scholarships over a five-year period, a laptop, and monthly stipends."
  },
  {
    "headline": "Quality Petroleum Education to solve challenges of energy transition, boom in gas sector- Wabote",
    "summarized_story": "According to him, the ongoing debate and the deadlines being set in respect of energy transition underscored the need to develop home-grown skill sets to develop and manage the nation’s natural resources.\nThe institutions should put require greater focus on development of top-notch graduates to enable the development of Nigerian hydrocarbon resources – especially gas, he canvassed.\nHe agreed on the need to add renewables to the global energy mix to ensure energy security, but criticised attempts by the western world to demonize or de-marketing other energy sources as well as extracting commitments and setting unrealistic deadlines for countries to abandon fossil fuels.\nHe advised all nations to jealously guard their locally available sources of energy and ensure they remain in their energy mix for the benefit of their people.\n“This stifles the nation’s economy of the much-needed foreign exchange with funds used as loans to acquire oil and gas assets instead of being used to develop new production assets,” he rued."
  },
  {
    "headline": "Guinness Nigeria continues women, youths’ empowerment in Edo",
    "summarized_story": "At the trade assets presentation to the beneficiaries in Benin, Guinness Nigeria Plc.\n“Women empowerment is a significant contributor to economic development and progress because women are essential to any society’s survival.\nI want to express my gratitude to Guinness Nigeria for this heartfelt effort, and we look forward to working with the team again soon,” Osobajo added.\n“We are pleased that Guinness Nigeria is making this deliberate effort to give back to women in Edo State who have limited financial options.\nGuinness Nigeria continues to deliver on its sustainability and responsibility commitments which are focused on three areas; Promoting Positive Drinking, Diversity & Inclusion and Grain to Glass sustainability."
  },
  {
    "headline": "Execute Comprehensive Onslaught Against Bandits In Kanji National Park, Senate Urges Military",
    "summarized_story": "The Senate has asked the military to carry out a comprehensive onslaught on bandits and criminal elements within Kainji Lake National Park and other identified terrorists’ enclaves in communities within three local government areas of Kwara and Niger States.\nThis call was part of the Upper Chamber’s resolve reached during plenary on Tuesday, June 21, when a motion on the worsening insecurity in Kainji Lake National Park and threat to communities in Kaima, Baruten and Borgu Local Governments, was considered.\nThe sponsor of the motion Senator Sadiq Umar said kidnapping and other forms of criminality have now become prevalent in communities close to Kainji Lake National Park and this has led to palpable fear in the communities.\nThe Red Chamber also urged the military authorities to execute an exhaustive attack on bandits and other criminal elements within Kainji Lake National Park, especially Kaiama, Karonzi –Yashikira in Baruten local government, and Wawa and Babanna areas in Niger State.\nLawmakers also called on the National Emergency Management Agency (NEMA) to send relief materials to victims within the affected communities."
  },
  {
    "headline": "Buhari To Attend CHOGM 2022 In Rwanda",
    "summarized_story": "President Muhammadu Buhari will depart Abuja later today for Kigali, Rwanda, to attend the 26th Commonwealth Heads of Government Meeting (CHOGM), being held from June 20 to 26, 2022.\nREAD ALSO: Buhari Asks US, UK, Others To Ban IPOBPresident Buhari will attend the official opening ceremony on June 24, followed by high-level meetings of Heads of State and Government on Friday 24 and Saturday 25 June.\nThe leaders are expected to consider a range of topical issues including post COVID-19 economic recovery, debt sustainability, climate change, poverty reduction, youth entrepreneurship and employment, trade and food security.\nPresident Buhari is also expected to hold bilateral talks with some leaders from the Commonwealth countries.\nAccording to Adesina, the president will return to the country on Sunday, June 26, 2022."
  },
  {
    "headline": "Why There’s Fuel Scarcity – PENGASSAN",
    "summarized_story": "President of the Petroleum and Natural Gas Senior Staff Association of Nigeria (PENGASSAN), Festus Osifo, has shed light on the reasons behind the fuel scarcity experienced across the country, particularly in Lagos and Abuja.\nRead Also: Selling Petrol At N165 Unrealistic, Says IPMAN As Scarcity Hits Lagos“The NMDPRA are the ones administering a bridging fund.\nContrary to the belief that PMS is scarce, the PENGASSAN boss said that there’s at least 2 billion litres in stock.\nSo, if it’s the NNPC depots and you are loading from the NNPC depots, you are going to pay abut N148 as the ex-depot price.\n“Most western countries are today implementing fuel subsidies."
  },
  {
    "headline": "Banditry: IGP Deploys Additional Policemen To Kaduna-Abuja Highway",
    "summarized_story": "The Inspector-General of Police, Usman Alkali Baba, has deployed additional policemen to boost security along the Abuja-Kaduna Highway and tackle banditry and kidnapping.\nAddressing the personnel on Wednesday at the Force Headquarters shortly before their deployment, the Commissioner of Police in charge of Police Mobile Force, CP Matthew Akinyoshola urged the mobile policemen to be vigilant and alert at all times in their areas of responsibility.\nHe warned the Policemen to be civil and firm in the performance of their duties while dealing decisively with all persons threatening the peace and security of the nation.\nOn Sunday, no fewer than 36 people were kidnapped by bandits who attacked four communities in the Kajuru Local Government Area of Kaduna State.\nThey appealed to the Federal Government to establish a military base in Kajuru as the only way the security situation could be addressed."
  },
  {
    "headline": "Sadio Mane Signs Three-Year Contract With Bayern Munich",
    "summarized_story": "FC Bayern have confirmed the signing of Sadio Mané from Liverpool.\nThe 30-year-old attacker has agreed on a contract with the German record champions until 30 June 2025.\nHerbert Hainer, FC Bayern president disclosed this on Wednesday “Sadio Mané is a global star, who underlines the appeal of FC Bayern and will increase the attractiveness of the Bundesliga as a whole.”“Fans come to the stadiums to see such players.\nWe spoke a lot and I felt a big interest from this great club right from the beginning, so for me, there were no doubts” Mnae said.\nLast season Mané collected the EFL Cup and FA Cup, as well as being a runner-up in the Champions League and Premier League."
  },
  {
    "headline": "Kwara Governor, Abdulrahman, nominates new commissioners -",
    "summarized_story": "Kwara State Governor AbdulRahman AbdulRazaq has forwarded the names of five new commissioner-nominees to the State House of Assembly for approval.\nThe nominees are former House of Representatives aspirant Dr. Afeez Abolore Alabi (Ilorin East); Adenike Afolabi-Oshatimehin (Ifelodun; and Wahab Femi Agbaje (Offa).\nThe two other nominees are Gidado Lateef Alakawa (Asa) and Ibrahim Akaje (Ilorin West).\nThe nominees’ names and profiles have been sent to the House of Assembly for legislative screening and ap\\proval."
  },
  {
    "headline": "House of Reps member, Shina Peller, joins Accord Party -",
    "summarized_story": "A member of the House of Representatives from Iseyin/Itesiwaju/Kajola/Iwajowa federal constituency, Oyo State, Honourable Shina Peller, has named Accord as his new political https://www.tvcnews.tv/purplegold/post-new.php#party.\nThe statement read in full:“Earlier today on the floor of the house of representatives, I announced my defection from the All Progressives Congress to Accord Party.\n“Accord party happens to be the first party in Oyo state to zone Oyo North Senatorial ticket to Oke Ogun considering that Ogbomosho Zone had done two terms.\n“In Oyo State, the Accord party is a force to reckon with, it’s internal democracy mechanism is intact, a component lacking in other parties.\n“Today, I would like to inform the general public that I am now with Accord party."
  },
  {
    "headline": "Oyo Deputy Governor resumes new office at Ministry of Environment -",
    "summarized_story": "The embattled Deputy Governor of Oyo state, Rauf Olaniyan has resumed at his new office which was recently relocated to the state’s ministry of Environment.\nThe Deputy Governor while speaking with newsmen at the new work space said his resumption was in compliance with the directive of the constituted authority.\nThe Oyo state governor Seyi Makinde had some weeks ago ordered the relocation of the number two citizen to the Ministry of Environment thereby serving him letter to that regard.\nA sitting governor served me a letter of relocation, why should this be an exception?\nThere had been several controversies linked to the deputy Governor since his defection to the All progressives Congress from the Peoples’Democratic Party."
  },
  {
    "headline": "APC loses three Senators to opposition parties",
    "summarized_story": "Three Senators elected on the platform of the All Progressives Congress have resigned their membership of the ruling party.\nThe lawmakers are Senators Ahmad Babba Kaita (Katsina North), Lawal Yahaya Gumau (Bauchi South), and Francis Alimikhena (Edo North).\nWhilst Babba Kaita and Alimikhena defected to the opposition People’s Democratic Party (PDP), Gumau, on the other hand, defected to the New Nigeria Peoples Party (NNPP).\nThe notice of their resignation and defection was contained in three separate letters read during plenary by the Senate President, Ahmad Lawan, on Tuesday.\nThe defection by the three lawmakers reduces the total number of APC Senators from 70 to 67 in the upper chamber."
  },
  {
    "headline": "UN: 4.1 Million in North-East Nigeria at Risk of Starvation",
    "summarized_story": "The United Nations (UN) has raised an alarm that 4.1 million people in the north-eastern Nigeria are at severe risk of severe food insecurity and starvation.\nAccording to the UN Resident and Humanitarian Coordinator for Nigeria, Mr. Matthias Schmale to avert this $351 million was required, which he said was part of the overall request of $1.1 billion for the 2022 Humanitarian Response Plan, that is severely under-funded at 19.6 per cent.\nHe added that in 2022, 8.4 million people would need humanitarian assistance across Borno, Adamawa and Yobe states, while describing the deteriorating food security and nutrition situation as an issue that requires immediate support.\nHe said: “This food insecurity is felt painfully across the region, especially as operations are so desperately in need of funding.\nIn Yobe State, families have not received food assistance for up to eight months."
  },
  {
    "headline": "Buhari Defends Nigeria’s Central Bank Chief Emefiele, Says Unorthodox Policies Best for Economy",
    "summarized_story": "Because the governor follows a model outside of the economic orthodoxy, he is labelled political.\n“Instead, the governor is following an alternative economic model that puts people at the heart of policy.\nHe said, “The CBN governor is appointed by the president.\nBuhari said that his successor would inherit a far more resilient economy, thanks to investments in infrastructure and policies that he said had bolstered local production.\nHe added, “My administration is the only in Nigeria’s history to implement a solution to decades-long herder-farmer conflicts, exacerbated by desertification and demographic growth."
  },
  {
    "headline": "Saudi Crown Prince Visits Turkey for First Time Since Khashoggi Murder",
    "summarized_story": "Saudi Arabia’s crown prince is to visit Turkey for the first time since the 2018 murder of the journalist Jamal Khashoggi in its Istanbul consulate.\nMr Erdogan once indirectly accused the prince of ordering Saudi agents to kill Khashoggi.\nPrince Mohammed meanwhile wants to end his international isolation.\nWhile Mr Erdogan did not directly accuse Prince Mohammed, he claimed he knew the order to kill Khashoggi “came from the highest levels of the Saudi government”.\nUS intelligence agencies concluded that the crown prince had approved an operation to capture or kill Khashoggi."
  },
  {
    "headline": "Sri Lanka PM Says Economy Has Collapsed, Unable to Buy Oil",
    "summarized_story": "Wickremesinghe said Sri Lanka is unable to purchase imported fuel, even for cash, due to heavy debts owed by its petroleum corporation.\n“Currently, the Ceylon Petroleum Corporation is $700 million in debt,” he told lawmakers.\nSri Lanka has been muddling through mainly supported by $4 billion in credit lines from neighboring India.\nBut Wickremesinghe said India would not be able to keep Sri Lanka afloat for too long.\nOfficials from International Monetary Fund are now visiting Sri Lanka to discuss a rescue package."
  },
  {
    "headline": "Site of Texas School Shooting to Be Demolished",
    "summarized_story": "Robb Elementary School in Uvalde, Texas – where a gunman killed 19 students and two teachers – will be demolished, the city’s mayor has said.\n“My understanding – and I had this discussion with the superintendent – is that school will be demolished.\nUS President Joe Biden had suggested knocking down the school, State Senator Roland Gutierrez told local media last month.\nRobb Elementary will not be the first school to be demolished after a mass shooting.\nSandy Hook Elementary School in Newtown, Connecticut, was razed after 20 students aged six and seven years old and six staff members were shot in 2012."
  }
]