[
  {
    "headline": "26% N’East schools attacked by suicide bombers, says UNICEF",
    "summarized_story": "At least 26 per cent of schools in Nigeria’s North-East have been targeted by suicide bombers, according to the United Nations Children’s Fund.\nNguyen explained, “In Adamawa, Borno and Yobe states, 1.9 million conflict-affected boys, girls and adolescents are without access to basic quality education.\nSince 2012, 31 per cent of all schools in North-East Nigeria have been hit, at least once by bullets, shells, or shrapnel.\n“Ten per cent have been deliberately set on fire and 26 per cent targeted by suicide bombers.\nThis initiative will help improve access to quality education for marginalised children, especially girls and others living with disabilities.”Copyright PUNCH."
  },
  {
    "headline": "We can overcome Nigeria’s challenges with perseverance – Fayemi",
    "summarized_story": "Ekiti State Governor, Dr Kayode Fayemi, on Tuesday, said Nigeria could overcome the problems of insecurity, poor economy and bad politics if the citizens could persevere and look inwards.\nHe also expressed the belief that “the ravaging coronavirus pandemic across the world surely will fade away and become a thing of the past.”Fayemi, who is the visitor to the Ekiti State University, spoke in Ado Ekiti during the 25th and 26th combined convocation and 40th anniversary of the institution.\n“We will not renege in doing what is considered best for the university in all circumstances.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Senator Wamakko pays tribute to APC National Leader Bola Ahmed Tinubu",
    "summarized_story": "By Musa Na Annabi SokotoChairman of Senate Committee on Defence and Deputy Chairman Committee on Anti-Corruption, Senator Aliyu Magatakarda Wamakko has paid glowing tributes to the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, on his 70th birthday.\nWamakko said the Jagaban of Borgu kingdom has demonstrated an uncommon and unyielding commitment to a progressive and prosperous Nigeria.\nWamakko , noted with delight Tinubu’s invaluable contributions to Nigeria’s democracy in the past decades, saying that he has unmatched credentials.\nHe believed that the APC national leader would go down in history as one of the best and most impactful democrats Nigeria has had considering his track records of political activities in the past and present.\nWamakko however wished the Asiwaju more fruitful years in good health as well as increased wisdom from the Almighty God."
  },
  {
    "headline": "UBEC: 50% of schools in Nigeria lack furniture",
    "summarized_story": "By Joseph ErunkeABUJA–THE Universal Basic Education Commission, UBEC, has said 50 percent of schools in Nigeria lack basic furniture.\nExecutive Secretary of the commission,Hamid Bobboyi,who said this, Tuesday,in Abuja, regretted that basic education “pupils sit on the floor to take lessons.”Açcording to him, emerging constraints in basic education delivery in the country may necessitate an increase in the consolidated revenue funds from the current two percent to four percent.\nThe UBEC Boss equally tasked relevant civil society organisations, the media and other critical stakeholders not to shy away from rendering assistance to the government in bridging observed gaps in learning and teaching processes, especially at the basic school level.\nAlso speaking, the Chairman, Senate Committee on Basic Education, represented by Senator Frank Ibiziem, decried the failure of States’ Universal Basic Education, SUBEBs, to sustain some UBEC- initiated projects such as Classroom Libraries earlier introduced by the commission in all constituencies in the country.\nWhile commending UBEC over the construction of classrooms in schools across the country, he lamented the poor maintenance culture, noting that there is no school in the country that does not have a dilapidated block."
  },
  {
    "headline": "Anyim condemns Kaduna train attack, cancels all campaign activities for the week",
    "summarized_story": "Sen. Anyim Pius Anyim has strongly condemned the attack on a Kaduna bound train on Monday 28th March, 2022, describing it as barbaric and inhumane .\nSen. Anyim opines that whatever has pushed Nigerians into killing their fellow citizens in these large numbers and at such frequency is a serious matter that must command the urgent attention of both the government and every leader in the country.\nHe urged the Security Agencies to spare no effort in rescuing any of the passengers of the ill-fated train that are still being held by the criminals.\nAccording to the statement, “Sen Anyim has cancelled all his political activities and consultation tours for the rest of the week in honour of those who lost their lives and those still being held by the bandits, while praying for the quick recovery of those wounded and comfort for the families that lost loved ones.”“Sen.\nAnyim enjoins the Security Agencies not to relent in their efforts to rid our country of these criminals and restore the security and peace of our dear country” the statementconcluded."
  },
  {
    "headline": "Kaduna train attack: Death of TUC Secretary General shocking — Railway workers",
    "summarized_story": "The Nigeria Union of Railway Workers (NURW) on Tuesday expressed shock over the death of General Secretary of the Trade Union Congress of Nigeria (TUC), Musa-Lawal Ozigi, in the Kaduna train attack on Monday night.\nThe union’s Secretary General, Mr Segun Esan, in an interview with the News Agency of Nigeria (NAN) in Lagos, described the incident as shocking and devastating.\nNAN reports that TUC had earlier confirmed the death of its General Secretary, Ozigi, who was among passengers on board the Abuja-kaduna train attacked by terrorists on Monday night.\n‘’It is most unfortunate and painful that such a resourceful and ebullient fellow as the General Secretary of TUC would be lost to this attack.\nEsan also described as unfortunate the increasing psychological trauma that survivors had to face following the attacks on trains."
  },
  {
    "headline": "Police neutralise 3 suspected kidnappers in Kwara",
    "summarized_story": "The Police Command in Kwara have neutralised three suspected kidnappers with the help of Kwara vigilantes group and local hunters.\nThe incident happened at Obbo Ile/Osi forest in Ekiti Local Government Area of the state, the police said.\nThe statement said the operatives of the Tactical Team of the Kwara Police Command in conjunction with the vigilance team and local hunters, were on the trail of the kidnappers who were abducting and in few cases killing their victims in Kwara South Senatorial District.\n“During exchange of fire between the kidnappers and the joint teams of local hunters, vigilance and police, three of the kidnappers were neutralised, while others escaped with gunshot injuries.\n“One of the neutralised kidnappers was identified as Dogo, who had been in the wanted list of the police for the killing of one Femi Afolayan for failure to pay ransom sometime in February 2022."
  },
  {
    "headline": "Abuja-Kaduna train attack: Bank of Agriculture MD, Kabir Adamu reportedly kidnapped",
    "summarized_story": "A top Federal Government official, Kabir Muhammed Adamu is reportedly among those kidnapped during the Abuja-Kaduna train attack.\nThe train was bombed by bandits that have been terrorizing Nigeria at a location between Katari and Rijana.\nThe BoA provides credit facilities to support value chain activities, non-agricultural micro credit, savings mobilization and capacity development.\nAdamu was among the passengers that were seated at the First Class wing of the train.\nThey then used buses a number of Sharan vehicles to whisk away passengers to unknown destinations."
  },
  {
    "headline": "FG gives update on victims of Kaduna-Abuja train attack",
    "summarized_story": "The Federal Government has confirmed the number of persons killed during the bandits attack on a Kaduna bound train.\nRotimi Amaechi, the Minister of Transportation, disclosed that no fewer than eight persons were killed during the terrorist attack on Monday night.\nBandits had bombed a rail line between Katari and Rijani train station along the Kaduna-Abuja route.\nAccording to Amaechi: “We don’t have all the figures of missing persons, kidnapped and those injured at the moment.\nThere are 25 persons in the hospital and the total number of passengers are 398."
  },
  {
    "headline": "Bauchi police warn against Ramadan moon sighting procession",
    "summarized_story": "The Bauchi State Police Command on Tuesday warned against procession in the state under the disguise of Ramadan moon sighting procession.\nAccording to Wakil, a Superintendent of Police (SP), the attention of the command was drawn to a purported plan by some miscreants who disguise themselves in celebration of the sighting of the new Ramadan moon to disrupt the peace of the state.\nHe further stated that the state’s Commissioner of Police, Umar Mamman Sanda, therefore, warned those hatching the purported plan to desist from it as they would be met with stiff resistance from the police.\n“The attention of the Bauchi state Command has been drawn to a purported plan by some miscreants who disguise themselves in the celebration of the sighting of the new Ramadan moon to disrupt the peace of the state.\n“Furthermore, the Commissioner of Police implore the good people of Bauchi state to continue supporting police in the fight against criminality, pledging that the Command under his watch shall continue to puncture activities of all criminal ambassadors in the state."
  },
  {
    "headline": "NBTE director, Kofarmata dies in Abuja-Kaduna train attack",
    "summarized_story": "A director with the National Board for Technical Education, (NBTE), Abdu Isa Kofarmata, was among the passengers that lost their lives in the Monday night’s attack on Abuja-Kaduna train by terrorists.\nRecall that terrorists bombed the Abuja-Kaduna train between Katari and Rigina axis, leaving many passengers dead and others abducted.\nAccording to a family source, Kofarmata was shot by terrorists during the attack.\nThe source added that his corpse is on its way to Kano, while arrangements had been concluded for his burial according to Islamic rites.\nThe source also added that the late 55-year-old director was survived by four children and a wife."
  },
  {
    "headline": "2023: Don’t vote for party again in Nigeria – Ibiyeomie",
    "summarized_story": "Ahead of the forthcoming 2023 general elections, Pastor David Ibiyeomie has advised Nigerians to vote only those with vision to move the county forward.\nHe said, “Don’t vote for a party again in Nigeria, vote people with vision.\nAll the parties have disappointed us, now vote somebody who is visionary.\nNigeria needs somebody who has a vision not somebody who is in a party.\nA statesman thinks about the next generation while a politician thinks of 2023."
  },
  {
    "headline": "VIDEO: Fans rampage after Super Eagles lose world cup ticket",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Nigeria crash out of 2022 World Cup play-offs",
    "summarized_story": "A crucial goal in Abuja was enough to seal Otto Addo’s men qualification for the global showpiece in QatarGhana have qualified for the 2022 Fifa World Cup after holding Nigeria to a 1-1 draw in the second leg of their final qualifying tie.\nThe Black Stars held the three-time African champions to a goalless draw in Kumasi on Friday, and they scored an away goal in Abuja to advance to Qatar.\nNigeria coach Augustine Eguavoen made five changes to the team that played in Kumasi last Friday while his Ghana counterpart Otto Addo stuck to an unchanged XI."
  },
  {
    "headline": "Survivors relieve horrors of Kaduna train terror attack",
    "summarized_story": "Survivors of Monday’s terror attack on a passengers’ train in Kaduna have relieved their traumatic ordeals.\nThe survivors said they heard a deafening sound and the train started warbling before it finally came to a halt.\nI didn’t know that we were to lie down.\nAnother survivor, Muhammadu Ishaq, said: “We heard a loud voice of something, then the train started shaking then suddenly it stopped.\nThey just threw something like bomb and the train started shaking."
  },
  {
    "headline": "Eight confirmed killed, 26 injured in Kaduna train attack",
    "summarized_story": "Eight passengers have been confirmed killed and 26 injured with several others unaccounted for in Monday’s terrorist attack on a passengers’ train in Kaduna.\nKaduna State Government, which confirmed receipt of the manifest, said 362 were validated as having boarded the train through the recognized turnstile.\n“According to the documents received, 398 passengers bought tickets for the trip, but 362 were validated as having boarded the train through the recognized turnstile.\n“The passenger manifest does not include NRC staff and security officials who were on board.\n“Furthermore, security agencies have reported that eight bodies were recovered and 26 persons were injured during the attack."
  },
  {
    "headline": "Hunt down Kaduna train terrorists, Buhari orders troops",
    "summarized_story": "President Muhammadu Buhari has described the attack by terrorists on a train in Kaduna State as a matter of grave concern, instructing the military and other security agencies to immediately swing to action.\nBuhari specifically told the service chiefs and other heads of security outfits to immediately hunt them down the terrorists.\nThe President issued the instructions after being briefed by the service chiefs and other heads of security agencies, on the findings from the site of the attack.\nPresident Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\nOthers at the briefing were the Inspector General of Police, Usman Baba, and the Director General of the Department of State Services (DSS), Yusuf Magaji Bichi."
  },
  {
    "headline": "Kaduna train attack: 8 dead, 41 injured",
    "summarized_story": "While tears are still flowing following Monday’s attack on an Abuja-Kaduna bound, terrorists again hit another train station in a fresh attack, yesterday.\nThe attack occurred at the Gidan train station along the Abuja-Kaduna rail track.\nThe gunmen had opened fire on the train after they detonated improvised explosives (IED) on the rail track.\nA survivor narrated his experience: “We were like 30 minutes to Rigasa train terminal when we heard a loud explosion.\nBut when the train stopped before their calculated spot, we started hearing gunfire from all around.”"
  },
  {
    "headline": "Buhari gives marching orders to service chiefs",
    "summarized_story": "President Muhammadu Buhari has ordered service chiefs to deal ruthlessly with terrorists, adding that they should be more decisive and not spare anyone unlawfully wielding AK47 weapon.\nHe gave the directives after he received briefing from service chiefs, led by the Chief of Defence Staff, Gen. Lucky Irabor.\nThe president charged the law enforcement chiefs to bring back all passengers kidnapped and ensure each of the terrorists was hunted down and made to face justice.\nSmall Manhood & P.E 7days Solution... Click Here For Details .\nThis is unfortunate and we believe that the lessons out of this are what we need to build upon going forward."
  },
  {
    "headline": "Nigeria’s current tax system fragmented, inefficient –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari on Tuesday in Abuja, described Nigeria’s current tax system as fragmented and inefficient, urging a harmonised platform within a single system to boost revenue generation.\nPresident Buhari, expressed concern at Nigeria’s current tax system which is characterised by fragmented administration, multiple and sometimes, overlapping taxes, stressing that “In most tax-efficient nations, tax administrative processes and practices are harmonised within a single system.\n“One key deliverable of this year’s tax dialogue is the urge to promote synergy in tax administration among the different tiers of government.\nHe, therefore, proposed improved tax revenue for the country which will not necessarily impose new tax rates on Nigerians.\nTherefore, I pledge government’s support for any viable initiative for improving tax revenue that should emanate from this dialogue,” he said."
  },
  {
    "headline": "Tinubu cancels Colloquium to honour victims",
    "summarized_story": "Former governor of Lagos State, Bola Ahmed Tinubu, yesterday, cancelled his 13th colloquium to honour those killed.\nHe told the already seated crowd of dignitaries and members of the clergy to go home and pray for the deceased and the nation.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nIt is a very sad incident of insecurity in our country,” he said.\nHe said he took the decision after extensive consultations with dignitaries and other Nigerians and called for a one minute silence for the victims of the train incident."
  },
  {
    "headline": "Kalu rejoices with Tinubu at 70",
    "summarized_story": "Former governor of Abia State and Chief Whip of the Senate, Dr. Orji Uzor Kalu, has congratulated former Lagos State governor, Asiwaju Bola Tinubu on his 70th birthday anniversary.\nAcknowledging the contributions of the former governor to nation building in various capacities, Kalu stressed that Tinubu has over the years demonstrated political dexterity and administrative acumen in his endeavours.\nIn a goodwill message, Kalu said: “I join family, friends and associates in celebrating former governor of Lagos state, Asiwaju Bola Tinubu as he clocks 70.\n“Asiwaju Tinubu laid a solid foundation in Lagos State for his successors.\nHe played a remarkable role in putting Lagos State on the global stage."
  },
  {
    "headline": "Breaking: 8 Corpses Recovered, 26 Injured in Kaduna Train Attack",
    "summarized_story": "* Passenger manifest shows 362 onboard* Search and rescue operations ongoingBy John Shiklam in KadunaThe Kaduna state government has confirmed that eight corpses have so far been recovered while 26 people were injured in Monday’s terrorists attack on the Abuja- Kaduna train.\nSamuel Aruwan, the Kaduna state Commissioner for Internal Security and Home Affairs, disclosed this in a statement on Tuesday.\nThe statement added that passenger manifest did not include staff of the Nigerian Railway Corporation (NRC£ and security officials who were on board the train.\n“The passenger manifest does not include NRC staff and security officials who were on board.\n“Furthermore, security agencies have reported that eight bodies were recovered and 26 persons were injured during the attack."
  },
  {
    "headline": "News in Photograghs: Osinbajo Visits Victims of Kaduna-bound Train Attacked by Terrorists",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Breaking: Buhari Meets Security Chiefs over Kaduna Train Attack",
    "summarized_story": "*Orders rescue of abducted passengers, immediate arrest of perpetrators*Orders integrated security surveillance for Abuja-Kaduna, Lagos-Ibadan rail linesDeji Elumoye in AbujaPresident Muhammadu Buhari has directed the nation’s security agencies to ensure, without further delay, the release of all kidnapped passengers on the Abuja-Kaduna train that was attacked on Monday by terrorists.\nHe also ordered the immediate arrest of the terrorists that carried out the dastardly act of attacking the train to face justice, and the implementation of integrated security surveillance for Abuja-Kaduna and Lagos-Ibadan rail lines.\nPresident Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\nAccording to him: “The challenge of insecurity is a constant one and so the defence and security agencies need to be on their toes 24/7.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Survivors of Kaduna-bound Train Attacked by Terrorists Recount Ordeal",
    "summarized_story": "*El-Rufai visits victims in hospitalsBy John ShiklamSurvivors of Monday’s attack on a Kaduna-bound train have recounted their ordeals on their hospital beds.\nShe said, “The terrorists came, were moving about in the train, but they did not come to where I was seated.\n“The security personnel on the train announced that everybody should lie down on the floor of the train.\nMeanwhile the Kaduna state governor, Mallam Nasir, El-Rufai has visited victims of the attacks in the hospitals.\nThe statement said the Kaduna State Emergency Management Agency (SEMA) had issued a contact number 09088923398 for inquiries and information from family members of the passengers."
  },
  {
    "headline": "Breaking: Osinbajo Cancels Trip to Lagos, Heads for Kaduna over Tragic Train Attack",
    "summarized_story": "Vice President Yemi Osinbajo Tuesday afternoon cancelled his trip to Lagos and made a detour to Kaduna to visit the scene of the terrorists’ attack on a train Monday night.\nVice President Osinbajo was on his way to Lagos to attend the 13th Colloquium making Asiwaju Bola Tinubu’s 70th birthday Tuesday afternoon, before making a detour to Kaduna“On his way to Lagos for the 13th Tinubu Colloquium marking former Lagos State Gov’s 70th birthday, VP had to detour to Kaduna this afternoon on receiving news of the extent of human & material losses occasioned by yesterday’s dastardly attack on the Abuja-Kaduna railway route…”, Osinbajo’s media aide, Laolu Akande, tweeted.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Terrorists Launch Attack On Kaduna Road Hours After Train Tragedy",
    "summarized_story": "Terrorists on Tuesday, launched an attack on the Abuja-Kaduna, Yankara-Tsafe roads, SaharaReporters learnt.\nThis comes hours after the bandits launched an attack on the Kaduna-Abuja train with eight persons confirmed dead and several persons injured or kidnapped.\nThere were at least 970 passengers on board the train, according to sources familiar with the train service.\nA military source in Kaduna noted, “Yes, the bandits are currently on a rampage along the Yankara-Tsafe road and passengers are advised to avoid that route.\nSome passengers are currently stranded.”SaharaReporters had reported Monday attack on Abuja-Kaduna train by terrorists."
  },
  {
    "headline": "BREAKING: Terrorists Launch Attack On Kaduna Road Hours After Train Tragedy",
    "summarized_story": "Terrorists on Tuesday, launched an attack on the Abuja-Kaduna, Yankara-Tsafe roads, SaharaReporters learnt.\nThis comes hours after the bandits launched an attack on the Kaduna-Abuja train with eight persons confirmed dead and several persons injured or kidnapped.\nThere were at least 970 passengers on board the train, according to sources familiar with the train service.\nA military source in Kaduna noted, “Yes, the bandits are currently on a rampage along the Yankara-Tsafe road and passengers are advised to avoid that route.\nSome passengers are currently stranded.”SaharaReporters had reported Monday attack on Abuja-Kaduna train by terrorists."
  },
  {
    "headline": "BREAKING: Bandits Bomb Kaduna Train Station With Explosive Devices Hours After Train Bombing",
    "summarized_story": "Gunmen suspected to be bandits have attacked Gidan train station along the Abuja-Kaduna rail track.\nIt was gathered that the terrorists planted IEDs on the tracks, forcing a train heading to Abuja from Kaduna to stop.\nSaharaReporters had reported how terrorists on Monday night bombed the Abuja-Kaduna rail tracks and attacked a train filled with passengers.\nOne of the survivors of the train attack told SaharaReporters on Tuesday that the terrorists told them that the Nigerian government should expect more attacks as they had just started.\nThis comes a few hours after another set of terrorists killed six soldiers from Zuma barracks, Suleja, Niger State."
  },
  {
    "headline": "BREAKING: Bandits Bomb Kaduna Train Station With Explosive Devices Hours After Train Bombing",
    "summarized_story": "Gunmen suspected to be bandits have attacked Gidan train station along the Abuja-Kaduna rail track.\nIt was gathered that the terrorists planted IEDs on the tracks, forcing a train heading to Abuja from Kaduna to stop.\nSaharaReporters had reported how terrorists on Monday night bombed the Abuja-Kaduna rail tracks and attacked a train filled with passengers.\nOne of the survivors of the train attack told SaharaReporters on Tuesday that the terrorists told them that the Nigerian government should expect more attacks as they had just started.\nThis comes a few hours after another set of terrorists killed six soldiers from Zuma barracks, Suleja, Niger State."
  },
  {
    "headline": "Nigerians Must Rise, Stop President Buhari From Handing Over Power To Terrorists –AAC",
    "summarized_story": "The African Action Congress (AAC) has called on Nigerians to resist any attempt by President Muhammadu Buhari to hand over the leadership of the country to terrorists when his tenure ends in May 2023.\nIt wouldn’t be out of place to ask the Muhammadu Buhari regime, what is the worth of human life in today's Nigeria?\nIn fact, President Buhari keeps one of these known terrorist allies like Isa Pantami in his government as Communications Minister.\n\"For us at the African Action Congress, we call on Nigerians to stop lamenting, organise and take action.\nWe call on Nigerians to rise and conduct another mass actions that will be multiple of the #EndSARS protests."
  },
  {
    "headline": "VIDEO: Angry fans vandalise stadium as Nigeria lose World Cup slot",
    "summarized_story": "Some angry fans of the Super Eagles of Nigeria invaded the newly refurbished Moshood Abiola Stadium in Abuja and vandalised facilities in protest of the team’s failure to qualify for the Qatar 2022 World Cup.\n“The renovated Abuja National Stadium shouldn’t be vandalized by angry fans.\nVandalism of the National Stadium will never ever be justified.\n— theonly1acre (@theonly1acre) March 29, 2022That show of shame at the National Stadium was never about the Match Outcome.\nThe Coming days won't be as easy… — Kes IZODUWA ⚡ (@Kestim_) March 29, 2022The renovated Abuja National Stadium shouldn’t be vandalized by angry fans."
  },
  {
    "headline": "VIDEO: Angry fans vandalise stadium as Nigeria lose World Cup slot",
    "summarized_story": "Some angry fans of the Super Eagles of Nigeria invaded the newly refurbished Moshood Abiola Stadium in Abuja and vandalised facilities in protest of the team’s failure to qualify for the Qatar 2022 World Cup.\n“The renovated Abuja National Stadium shouldn’t be vandalized by angry fans.\nVandalism of the National Stadium will never ever be justified.\n— theonly1acre (@theonly1acre) March 29, 2022That show of shame at the National Stadium was never about the Match Outcome.\nThe Coming days won't be as easy… — Kes IZODUWA ⚡ (@Kestim_) March 29, 2022The renovated Abuja National Stadium shouldn’t be vandalized by angry fans."
  },
  {
    "headline": "Kaduna update: 362 passengers on board train, eight bodies recovered",
    "summarized_story": "The Kaduna state government says eight bodies have so far been recovered from the scene of the Abuja-Kaduna train attack.\nThe train was ambushed by gunmen on Monday night while it was a few minutes away from the Kaduna station.\nBut in another statement, Samuel Aruwan, Kaduna commissioner for internal security and home affairs, said 362 passengers boarded the train according to the manifest.\n“The Kaduna state government has received from the Nigerian Railway Corporation (NRC), the detailed passenger manifest for the Abuja-Kaduna train service AK9 which was attacked by terrorists on Monday,” he said.\n“Citizens are requested to contact the Kaduna State Emergency Management Agency on the phone line 09088923398, to make enquiries or provide information regarding passengers who were on board the Abuja-Kaduna train AK9."
  },
  {
    "headline": "Kaduna update: 362 passengers on board train, eight bodies recovered",
    "summarized_story": "The Kaduna state government says eight bodies have so far been recovered from the scene of the Abuja-Kaduna train attack.\nThe train was ambushed by gunmen on Monday night while it was a few minutes away from the Kaduna station.\nBut in another statement, Samuel Aruwan, Kaduna commissioner for internal security and home affairs, said 362 passengers boarded the train according to the manifest.\n“The Kaduna state government has received from the Nigerian Railway Corporation (NRC), the detailed passenger manifest for the Abuja-Kaduna train service AK9 which was attacked by terrorists on Monday,” he said.\n“Citizens are requested to contact the Kaduna State Emergency Management Agency on the phone line 09088923398, to make enquiries or provide information regarding passengers who were on board the Abuja-Kaduna train AK9."
  },
  {
    "headline": "Ghana end Nigeria's World Cup dream",
    "summarized_story": "The Black Stars of Ghana have qualified for the 2022 FIFA World Cup after playing a 1-1 draw with Nigeria at the Moshood Abiola Stadium in Abuja on Tuesday night.\nThe Black Stars booked their ticket based on the away goal rule.\nAdvertisementA few minutes later, the Black Stars silenced the Super Eagles with the opener through Thomas Partey.\nA few minutes later, Victor Osimhen thought he had put his team in the lead but the goal was ruled out as offside.\nGhana have now earned one of the five tickets for African representatives at the World Cup billed for Qatar later this year."
  },
  {
    "headline": "Nigeria-based CredPal gets $15m to expand its buy now pay later business",
    "summarized_story": "Buy now pay later (BNPL)—a short-term consumer financing that allows shoppers to purchase products online and pay in installments with nominal or no fees—is sweeping the global e-commerce sector.\nThis will be used to expand its consumer credit offerings in its home country, Nigeria, and scale across Africa.\nThe more you use your credit card, the more your reward – from 1% to 15% across our partnered merchants!\npic.twitter.com/PCekh7M5oZ — CredPal (@CredPal) November 26, 2020“What we’ve done is encapsulate the lifestyle of the average working-class Nigerian and ensure that every person can find something specifically for them on CredPal,” Olaogun said in a recent interview.\nWhile competition appears to be heating up, there is a significantly large market of consumers and merchants to be tapped."
  },
  {
    "headline": "Digital Nomads: The pastor turned tech bro",
    "summarized_story": "The reason, Jay says, was that the lecturers in charge, at the time, knew nothing about the applications of tech.\nThis was 2018, mind you, but they said that tech wasn’t that important in the country, and that I should research something else.\nFor Jay, this event pushed him towards putting his degree to good use and becoming an all-round tech bro.\nHe doesn’t think his lecturers meant any harm, but he believes their lack of knowledge on the impact of tech will have damning consequences on the students they teach.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Okubanjo to step back from people decisions at Bento Africa",
    "summarized_story": "Bento’s board’s decision comes a few days after TechCabal exposed the harrowing experiences of ex-employees of payroll startup Bento Africa and how Okubanjo had allegedly been the orchestrator of that through direct and indirect bullying, verbal abuse, and threats to employees.\nOur responsibility and charter is to the Company, not the founders we invest in,” the board said in an email sent to all Bento employees, past and present.\nFurthermore, the board said that while Okubanjo is taking a back seat with immediate effect, an internal investigation into Bento’s workplace culture has begun.\nThe board claimed to have “…ensured that the current team is safe and free to speak freely.\nWith Love, Okubanjo admits to encouraging a work culture of “long workdays and weeks” and apologised for his abusive outbursts."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Investors on high alert as Y Combinator shows interest in East and North Africa",
    "summarized_story": "Share this article:In 2005, while walking home after dinner, Paul Graham and Jessica Livingston decided to start Y Combinator (YC).\nEvery year since then has seen at least one African startup get into the famous accelerator programme.\nBeyond the usual suspects, Y Combinator has invested in startups founded or operating in Namibia, Uganda, Zambia, and Sudan in the last three years.\nDue to the conflict in the North African country, there have been several sanctions from the United Nations, the United States, and the European Union since 1997.\n“We believe that African startup founders will be a massive part of the continued development of the continent."
  },
  {
    "headline": "Meta in Kenya’s elections",
    "summarized_story": "However, following a recent investigation by Technext, the proptech startup has repeatedly reneged on these promises leaving its customers with sour stories.\nWhy solving Nigeria’s housing problem is beyond proptech startups for nowMeta’s role in Kenya’s electionsIt’s election time again, and Facebook parent company, Meta, has found itself in the thick of things again.\nKenya’s elections are coming up in August 2022, and we’re gearing up for presidential, legislative, and county-level elections.\nShould big, primarily profit-driven, corporations be the custodians and watchdogs of marquee moments in a society like elections?\nFunding for fantasy footballOn the news: Egyptian fantasy football startup, Eksab, has raised $3m to expand its fantasy football platform across MENA and Africa."
  },
  {
    "headline": "How to hitchhike safely",
    "summarized_story": "The law aims to allow smaller messaging platforms to access the “gatekeepers” of the messaging world.\nBorne out of unpleasant experiences with ride-hailing companies, he got three other friends to join in his desire to build a ride-sharing platform that connects drivers and riders going in the same direction.\nOn Friday, March 25, 2022, Hytch — Onifade’s ride-sharing platform — was publicly launched and currently operates in Lagos State.\nAn age-long problem: Before now, the federal government has made some inroads into challenges surrounding RoW charges.\nRoW charges affect the overall amount telcos spend in laying optic fibre and eventually affect the cost of calls and Internet data."
  },
  {
    "headline": "How excess taxes on telecom operators hurt consumers",
    "summarized_story": "The site ranks 164 countries and territories on the quality of their broadband and mobile infrastructure to find the world’s most connected countries.\nThe quality of the internet is mostly dependent on the level of investment in broadband infrastructure.\nFor example, to improve connectivity, the GSMA estimates in its latest mobile economy report that global telecom operators will invest $620 billion in their networks between 2022 and 2025.\nIt is the consumers that bear much of the brunt of the lag in broadband investment.\nFractured digital economyWithout sufficient telecom infrastructure providing the digital backbone, Nigeria’s digital economy drive will face huge challenges."
  },
  {
    "headline": "Kaduna train attack: 60 feared killed, Ex- Deputy Gov injured, hundreds missing",
    "summarized_story": "While the former deputy governor is receiving treatment in a Kaduna State- owned hospital, others are yet to be found.\nFamily sources said they have been unable to reach their relatives that boarded the Monday 6.00pm Abuja to Kaduna train as their phones were switched off.\nRead also: What we know about Chinelo, dentist killed in Kaduna train attackHe said: “Today is supposed to be a very joyful 70th birthday of my living on earth.\nRead also: Abuja-Kaduna train attack: Bandits tried several times before now – Shehu SaniA passenger on the train, Anas Iro Danmusa, took to his Facebook handle to cry for help.\nAbuja to Kaduna train."
  },
  {
    "headline": "What we know about Chinelo, dentist killed in Kaduna train attack",
    "summarized_story": "What we know about Chinelo, dentist killed in Kaduna train attackNigeria was going to lose promising dentist, Chinelo Nwando Megafu to the attrition crisis that has robbed the healthcare sector of skilled manpower in the last few years.\nChinelo Megafu’s life was cut short on Monday in a fatal attack by raging bandits on a Kaduna-bound train from Abuja.\nRead also: Blood shortage hits Kaduna after train attackUntil the ill-fated incident on Monday, Megafu had purportedly concluded plans to move to the United Kingdom to continue her medical career.\nHer last tweet via her handle @nelo_x was “I’m on the train.\n— Chinelo (@nelo_x) March 28, 2022But many were quick to dismiss her predicament, calling it a fluke until further evidence surfaced about the attack."
  },
  {
    "headline": "Shaibu Hosts Football Scouts From Sweden – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Says Edo Poised For Sporting ExcellenceBENIN CITY – Edo State Deputy Governor, Rt.\nComrade Philip Shaibu, has played host to a delegation of international football scouts,Nexer Aiding Group Dreams Football from Sweden.\nSpeaking while receiving the Swedish delegation at the Government House, Benin City, the Deputy Governor reiterated the commitment of the present administration towards transforming the sports sector.\nAccording to Shaibu: ” this administration is focused in restoring the golden era of sports in Edo State”.\nThe scouts delegation arrived Nigeria to hunt for young football talents between the ages of 15 – 19 years."
  },
  {
    "headline": "Constitution Review: IPC stands with women to protest rejection of bills – Nigerian Observer",
    "summarized_story": "In a statement by the Executive Director, Lanre Arogundade, IPC which was signed by Stella Nwofia Program Manager,IPC said.\n“It is unfortunate that the 9th National Assembly (NASS) would contravene the country’s international legal obligations by denying Nigeria women the opportunity of better inclusion and greater representation in governance by voting against the pro-gender bills.\nArogundade stated that the rejection puts the country in bad light as it negates this years’ campaign theme #BreakTheBias of the United Nations (UN) International Women’s Day to be celebrated globally on March 8, 2022 (IWD 2022) under the broad theme “Gender equality today for a sustainable tomorrow”.\n“Furthermore, the proposed bills that were rejected would have addressed the current gender imbalance across the legislative arms of governments in the country, whilst reducing the under-representation of women in political office,” he stressed.\nIPC therefore calls on the National Assembly to reconsider its decision and take proactive and affirmative action in providing more opportunities for women to participate in politics, governance, and all spheres of human endeavour."
  },
  {
    "headline": "NWFL Wk 13: Edo Queens Se To Wrap-up Super 6 Ticket in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Queens Football Club of Benin will this Wednesday the 30th of March 2022, at the Samuel Ogbemudia Stadium Benin-City host Pelican Stars FC of Calabar in the last home match of the 2021/2022 NWFL Wk13: premiership game.\nAt this point in time, it is a well- known fact that Edo Queens are resilient as they have their eyes fixed on the NWFL title having lost only one game since the beginning of the season.\nIn the first leg game played in Calabar, Edo Queens defeated Pelican Stars 1-0 right in front of their aggressive teeming home fans.\nSo in this return leg in Benin, we don’t need a prophet to tell us that Edo Queens will also show their supremacy by making sure they replicate what they did in Calabar few months ago.\nDespite losing to Nasarawa Amazons 2-0 last week, Edo Queens still top the table in Gruop A with 23 points, from 10 matches, Nasarawa Amazons seat second with 21 points, Confluence Queens have 16 points, Naija Ratels 15 points, Osun Babes 14 points, Adamawa Queens 9 points while Pelican Stars have 4 points."
  },
  {
    "headline": "Obaseki: Edo building sustainable infrastructure, expanding private sector space, others to attract new investments – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is building sustainable infrastructure, strengthening reforms and enhancing security to ensure the influx of investors into the state.\nThe governor, who spoke to journalists in Benin City, said his administration is also expanding the private sector space to make the state an investment hub and ensure sustainable development and economic prosperity for the state.\nWhen we came into office, there were only two airlines flying into the state, today, there are five of them.\n“The state has generally become more attractive to investments with the influx of investors in real estate, hospitality, oil and gas, industries, technology, agriculture, and manufacturing, among others.”“The security situation in the state has improved significantly with the linkage of the Edo State Security Network with the federal security structure.\nThis has ensured synergy that has helped in curbing urban crime, banditry and other forms of criminality,” he added."
  },
  {
    "headline": "Abuja Disco appoints Adeoye Fadeyibi new MD, Abdulahi Burkullu named CTO",
    "summarized_story": "The Abuja Electricity Distribution Plc (AEDC) has announced the appointment of Mr Adeoye Fadeyibi as its new Managing Director/Chief Executive OfficerThe distribution company also appointed Engineer Kassim Abdulahi Burkullu as its new Chief Technical Officer in a major reorganisation.\nFadeyibi, the new CEO, a turn-around manager with over 20 years executive management experience, succeeds Engr.\nAkinwumi Bada, who served as the company’s Interim Managing Director since last year and is now leaving to pursue other personal business aspirations.\nKassim Abdulahi Burkullu as its new Chief Technical Officer (CTO), replacing Mr. Oluwafemi Zacchaeus who had served as the Interim Chief Technical Officer.\nHe joined AEDC from Kano Electricity Distribution Company (KEDCO) where he was Head, Corporate Technical Operations Services."
  },
  {
    "headline": "Fidelity Bank to help entrepreneurs explore US market",
    "summarized_story": "Fidelity Bank Plc, is set to host a workshop for businesses looking to scale and expand their reach into new international markets.\nHe added that assisting businesses to export would have an enormous ripple effect across the economy by increasing the volume of export earnings.\nAfter the training, Export & Sell would help businesses to revamp their products packaging, and sales literature, making sure they meet the specifications to sell on Amazon and other US outlets.\nThe workshop comes to join a long list of dedicated initiatives put in place by the bank to help local businesses play on the global scale and attract foreign exchange earnings.\nFidelity Bank is a full-fledged commercial bank operating in Nigeria with about six million customers who are serviced across its 250 business offices and digital banking channels."
  },
  {
    "headline": "Ghana stops Nigeria to qualify for Qatar 2022 World Cup",
    "summarized_story": "Nigeria’s Super Eagles played out 1-1 draw against the Ghana Black Stars at the Moshood Abiola Stadium, Abuja on Tuesday to miss the chance to play at the Qatar 2022 World Cup.\nGhana took an early lead through Arsenal midfielder, Thomas Partey, but the Eagles equalized moments later through the penalty spot, as captain, Troost Ekong slotted home after Ademola Lookman was brought down in the box.\nBut that was as good as it got for the Nigerian team which failed to register another goal in the encounter, meaning that Ghana qualifies on away goal rule.\nThe first leg in Accra, Ghana on Friday had ended in goalless draw, meaning that the Eagles couldn’t muster an away goal."
  },
  {
    "headline": "Soludo sends names of 20 commissioner-nominees to Anambra assembly",
    "summarized_story": "Professor Charles Soludo, governor of Anambra State, has sent the name of 20 commissioner-nominees to the state House of Assembly for confirmation.\nGovernor Soludo sent the names to the lawmakers on Tuesday.\nSpeaker of the House, Mr. Uche Okafor, announced the nominations and names at Tuesday’s plenary; from a letter Governor Soludo sent, dated March 28.\nOthers are: Mr Paul Nwosu, Dr Foster Ihejiofor, Mrs Patricia Igwebuike, Mr Felix Odimegwu, Mr Chikodi Anara, Professor Chika Ifemeje, Mr Collins Nwabunwanne, Mr Donatus Onyeji, Mr Anthony Ifeanya and Mr Paulinus Onyeaka.\nAt plenary, the House also read a resolution for Soludo to make the Commissioner of Police return checkpoints and patrol teams to Anambra roads"
  },
  {
    "headline": "Bar Week: Akwa Ibom Committed To Effective Administration Of Justice – Gov Emmanuel",
    "summarized_story": "The Akwa Ibom State governor, Mr. Udom Emmanuel, has pledged to continue to uphold the rule of law and effective administration of justice for the benefit of all citizenry and stakeholders.\nGovernor Udom Emmanuel reechoed his stance Monday, March 28, 2022, during the opening ceremony of the 2022 Bar Week of the Nigerian Bar Association (NBA), Uyo Branch.\nRepresented by his Attorney-General and Commissioner for Justice, Uko Udom, SAN, Governor Emmanuel expressed his desire for continued partnership and collaboration between the bar and his administration for the promotion of peace, security and progress of the state.\n“There’s an emerging part of maritime law, which is critical to our people, state and as a country.\nADVERTISEMENTThe highpoint of the event was the official unveiling and launching of the 2022 Bar Journal by Governor Emmanuel."
  },
  {
    "headline": "Kaduna Train Attack: Bank Of Agric MD Still Missing",
    "summarized_story": "The managing director of the Bank of the Agriculture (BoA), Alwan Ali Hassan’s whereabout was still unknown on Tuesday following bandit attack on an Abuja-Kaduna train on Monday night.\nIt was gathered that Hassan alongside his nice were aboard when terrorists attacked the ill-fated train.\nAccording to a source close to his family, Mr Hassan’s phone number could not be reached since the the attack.\nHe said, “We can not tell if he has been kidnapped or not but we are worried because we have been unable to reach him since yesterday (Monday).\nADVERTISEMENTADVERTISEMENT“His phone lines have been switched off and no one has contacted the Bank or any of his family members.”"
  },
  {
    "headline": "Kaduna Train Attack: Bank Of Agric MD Still Missing",
    "summarized_story": "The managing director of the Bank of the Agriculture (BoA), Alwan Ali Hassan’s whereabout was still unknown on Tuesday following bandit attack on an Abuja-Kaduna train on Monday night.\nIt was gathered that Hassan alongside his nice were aboard when terrorists attacked the ill-fated train.\nAccording to a source close to his family, Mr Hassan’s phone number could not be reached since the the attack.\nHe said, “We can not tell if he has been kidnapped or not but we are worried because we have been unable to reach him since yesterday (Monday).\nADVERTISEMENTADVERTISEMENT“His phone lines have been switched off and no one has contacted the Bank or any of his family members.”"
  },
  {
    "headline": "Train Attack: Buhari Orders Service Chiefs To Hunt Down Terrorists",
    "summarized_story": "He also directed the Nigerian Railway Corporation (NRC) management to speedily repair the damaged lines and resume normal service without delay.\nPresident Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\n“No one should be allowed to hold the country to ransom,” said the President.\nADVERTISEMENT“The attack on the train, a safe means of transport to many, is callous; and our thoughts are with the families of the deceased and prayers for the injured,” he added.\nThe President commended the law enforcement agencies for their prompt response and emergency personnel who were responsible for the evacuation and treatment of the injured persons."
  },
  {
    "headline": "Train Attack: Buhari Orders Service Chiefs To Hunt Down Terrorists",
    "summarized_story": "He also directed the Nigerian Railway Corporation (NRC) management to speedily repair the damaged lines and resume normal service without delay.\nPresident Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\n“No one should be allowed to hold the country to ransom,” said the President.\nADVERTISEMENT“The attack on the train, a safe means of transport to many, is callous; and our thoughts are with the families of the deceased and prayers for the injured,” he added.\nThe President commended the law enforcement agencies for their prompt response and emergency personnel who were responsible for the evacuation and treatment of the injured persons."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: Terror, banditry must be defeated",
    "summarized_story": "National leader of All Progressives Congress (APC), Asiwaju Bola Tinubu on Tuesday said terror and banditry must be defeated in the country in the aftermath of terrorists attack on Abuja-Kaduna train.\n“Today marked my 70th birthday, a moment intended for celebration.\nI have been informed that many people continued to celebrate my birthday at various events in different locations throughout the day.\n‘’We must eradicate them such that these twin evils have no hold on even a centimetre of our national soil.\nTo the perpetrators, I have nothing to say except that may the justice you face be swift and uncompromising.”"
  },
  {
    "headline": "Trump begs Putin to release dossier on the Bidens",
    "summarized_story": "Former U.S. President Donald Trump has called on Russian President Vladimir Putin to release any damaging information he has about the Biden family.\nAccording to CNN, Trump made the brazen and reckless request to America’s top adversary in an interview published Tuesday.\nIn an interview with JustTheNews, Trump pushed an unproven claim about Hunter Biden’s business dealings in Russia, and asked Putin to release any information that he might have about the situation.\n“I would think Putin would know the answer to that,” Trump said, referring to Hunter Biden’s potential dealings in Russia.\nThe Trump campaign in 2016 also embraced and capitalized on Russia’s election-meddling operation against Clinton."
  },
  {
    "headline": "JUST IN: Terrorists Attack Train Station In Kaduna",
    "summarized_story": "JUST IN: Terrorists Attack Train Station In KadunaTerrorists have attacked Gidan train Station along the Abuja-Kaduna rail track.\nSources quoted by Channels TV said the terrorists may have planted IEDs on the tracks forcing the train heading to Abuja from Kaduna to a stop.\nThis is the second attack within 24 hours along the same axis.\nAt least seven persons were killed when terrorists attacked a train at Dutse village on Monday."
  },
  {
    "headline": "List of injured passengers in Abuja-Kaduna train attack",
    "summarized_story": "A list of passengers injured when terrorists attacked a Kaduna-Abuja train on Monday night has been obtained.\nIn the list, the injured passengers were Haruna Muhammed; Mohammed Modibo; Ibrahim Wakili; Yakubu Nuhu; Abdulahi Yahaya; Ismail Saidu; Abdumalik Rasheedat; Umar Mohammed.\nOthers are, Hadiza Umar; Musa Ishawan; Aisha Yusuf; Mohammed Ameen; Abubakar Hauwau; Aliyu Sulaiman; Olaosebikan Bilikisu and Mrs Leola Abdulbasit.\nI have to get there to monitor developments myself.”Meanwhile, the NRC had earlier in the day announced the suspension of the Abuja-Kaduna passenger train services over the Monday night attack by terrorists.\nIt would be recalled that terrorists on Monday night bombed and successfully immobilised the Abuja-Kaduna train."
  },
  {
    "headline": "BREAKING: Tinubu Cancels 70th Birthday Colloquium To Honour Kaduna Train Victims",
    "summarized_story": "Bola Tinubu, the National Leader of the All Progressives Congress, cancelled his 13th Birthday Colloquium on Tuesday to pay tribute to the victims of the Kaduna train assault.\nHe made the revelation at the Eko Hotels in Lagos, which is hosting the 13th Bola Ahmed Tinubu Colloquium on the topic of “Pivoting Nigeria Into The New Order.”According to him, the attack was a “national catastrophe” in which more than 60 people died as a result of the atrocity.\nDetails will be provided later…"
  },
  {
    "headline": "JUST IN: Buhari Set To Watch Eagles/Ghana Clash Live",
    "summarized_story": "JUST IN: Buhari Set To Watch Eagles/Ghana Clash LivePresident Buhari will be seeing the second leg of the World Cup Qualifier game between Nigeria and Ghana live.\nThe Super Eagles will host the black stars of Ghana at the Moshood Abiola Stadium, Abuja, today – Tuesday.\nThe two teams who earlier battled at the Baba Yara Stadium, Kumasi last week Friday, ended at a 0-0 draw in the first leg.\nEagles, therefore, need to defeat the black stars of Ghana to qualify for the World Cup."
  },
  {
    "headline": "Breaking: Super Eagles fail to pick 2022 World Cup ticket",
    "summarized_story": "After a disappointing 1-1 draw in the return leg of 2022 FIFA World Cup playoffs against the Black stars of Ghana, Super Eagles failed to pick the expected ticket to Qatar.\nDetails loading…"
  },
  {
    "headline": "#LIVE: Iheanacho, Simon out as Eguavoen names Super Eagles starting lineup vs Ghana in World Cup playoff",
    "summarized_story": "Super Eagles interim technical adviser Austin Eguavoen has dropped Kelechi Iheanacho, Innocent Bonke and Moses Simon from the starting lineup in the crucial World Cup playoffs vs Black stars of Ghana.\nThe return leg match is scheduled for Moshood Abiola National stadium Abuja.\nNigeria starting XI vs Ghana:Francis Uzoho, Ola Aina, Troost Ekong, Leon Balogun, Calvin Bassey, Frank Onyeka, Oghenekaro Etebo, Joe Aribo, Emmanuel Dennis, Ademola Lookman, Victor Osimhen"
  },
  {
    "headline": "Chelsea owner, Roman Abramovich, ‘poisoned, goes blind’",
    "summarized_story": "The Russian oligarch Roman Abramovich was poisoned along with Ukrainian negotiators, it has been claimed.\nThe Wall Street Journal is reporting that the Vladimir Putin ally and Chelsea FC owner was hit by symptoms after a suspected poisoning at a meeting in Kyiv earlier this month.\nQuoting ‘people familiar with the matter’, it added that Ukrainian President Volodymyr Zelensky, who has met with Abramovich, was not been affected.\nAbramovich has previously passed a handwritten note from Zelensky to Putin and is widely believed to be acting as a go-between for the two leaders.\n‘Abramovich, along with another Russian entrepreneur, had taken part in the negotiations alongside Ukraine’s MP Rustem Umerov’, Bellingcat tweeted."
  },
  {
    "headline": "Victims Of Abuja-Kaduna Train Attack Receive Treatment In Hospitals, El-Rufai Visits",
    "summarized_story": "Some victims of Monday’s attack on a Abuja-Kaduna train have been admitted to the 44 military hospital and St. Gerald hospital in Kaduna State.\nIt is not yet clear how many persons were injured but the attacked train had the capacity to convey more than 1,000 passengers.\nKaduna State Governor, Nasir El-Rufai on Tuesday visited some of the victims receiving treatment at the hospitals.\nAmongst those injured is the former Deputy Governor of Zamfara State, Ibrahim Wakkala who is also receiving treatment in one of the hospitals the governor visited.\nAlso, the Chief of Army Staff (COAS) Lieutenant General Faruk Yahaya visited the scene of the Abuja-Kaduna train attack."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: Doctor Confirmed Dead, Hours After Calling For Prayers",
    "summarized_story": "A doctor identified as Megafu Chinelo, has been confirmed dead, hours after she made a post on Twitter, announcing that she had been shot on the Kaduna-bound train.\nPlease pray for me,” Dr Chinelo had tweeted, shortly after the train from Abuja to Kaduna was attacked by terrorists.\nThe bandits were said to have opened fire, shot sporadically on the train, and later gained access into the train.\nDr Chinelo will never be forgotten and the responses she got from Abolore, Woye, Iyabo and their cohorts will also not be forgotten.\npic.twitter.com/Ll5NVyQYpg — 🔌Mr AGBO 👑 (@RoadsAgbo) March 29, 2022Yesterday’s train in Kaduna that got attacked by bandits had a female medical doctor on it."
  },
  {
    "headline": "Kaduna Train Attack: Buhari Directs Immediate Implementation Of Surveillance System",
    "summarized_story": "President Muhammadu Buhari on Tuesday met with Service Chiefs in Abuja over the Kaduna train incident which occurred on Monday and directed the immediate conclusion of all the processes for the implementation of the integrated security surveillance and monitoring solution for the Abuja to Kaduna railway line.\nThe President also said the solution should be extended to cover the Lagos-Ibadan railway line.\nThis is according to a statement signed by presidential spokesperson Garba Shehu.\n“President Buhari reiterated his earlier directive that the military should deal ruthlessly with terrorists.\n“The attack on the train, a safe means of transport to many, is callous; and our thoughts are with the families of the deceased and prayers for the injured,” he said."
  },
  {
    "headline": "Terrorists Hit Kaduna Train Station In Fresh Attack",
    "summarized_story": "Terrorists have attacked Gidan train Station along the Abuja-Kaduna rail track.\nSources say the terrorists may have planted IEDs on the tracks forcing the train heading to Abuja from Kaduna to a stop.\nAt least seven persons were killed when terrorists attacked a train at Dutse village on Monday.\nAlthough both the police and the Kaduna state government are yet to confirm the number of casualties in the attack.\nThe bandits were said to have opened fire, shooting sporadically on the train, and later gained access to the train."
  },
  {
    "headline": "VIDEO: Survivors Of Abuja-Kaduna Train Attack Narrate How They Were Shot At",
    "summarized_story": "﻿Survivors of the Abuja-Kaduna train attack on Monday have narrated how terrorists shot at them.\nAt least eight persons have been confirmed dead and many feared abducted.\nAbout 26 persons were injured and are receiving treatment at two hospitals in Kaduna, the state government said on Tuesday.\n“We have a lot of insecurity in Nigeria,” Fatima Shaibu, one of the survivors who spoke to Channels Television, said.\n“By road we are not safe, by train we are not safe.”"
  },
  {
    "headline": "Gbajabiamila pays tribute to Tinubu at 70, says he's pillar of modern developmental strides in Lagos",
    "summarized_story": "The Speaker of the House of Representatives Rep. Femi Gbajabiamila has paid glowing tributes to the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, on his 70th birthday.\nThe speaker noted with delight Tinubu’s invaluable contributions to Nigeria’s democracy in the past decades, saying he has unmatched credentials.\nSpeaker Gbajabiamila recalled how Tinubu used his acumen to turn things around in Lagos State when he served as governor for eight years.\nReferring to Tinubu as the pillar of modern developmental strides in Lagos State, Gbajabiamila said he believes the APC national leader will go down in history as one of the best and most impactful democrats Nigeria has had.\nThe speaker wished the Asiwaju more fruitful years in good health as well as increased wisdom from the Almighty God."
  },
  {
    "headline": "Niger Governor greets Tinubu at 70, describes him as a \"transformative leader\"",
    "summarized_story": "Niger State Governor and Chairman North Central Governors Forum (NCGF) Abubakar Sani Bello has paid glowing tributes to National Leader of All Progressives Congress APC and former Governor of Lagos State, Senator Asiwaju Bola Tinubu as he celebrate his 70th birthday.\nGovernor Sani Bello, in a congratulatory massage to the septuagenarian described him as a visionary and transformative leaderThe Governor said the celebrant who is also the Jagaban of Borgu Kingdom, has remained a Colossus and a phenomenon in the annals of the ruling party and the nation’s political history.\nThe Governor noted that the exceptional political career and service of Tinubu, has inspired so many people and has produced many successful leaders in the country.\nHe added that the APC National Leader is an icon, bridge builder and a patriotic elder statesman who believes in the development, unity and corporate existence of Nigeria.\nThe Governor prayed for more years in good health and wisdom for the celebrant, to continue to serve humanity."
  },
  {
    "headline": "Femi Adekanmbi eulogises Asiwaju Bola Tinubu @ 70",
    "summarized_story": "A former commissioner for culture, tourism and special duties in Ondo State, Chief Femi Adekanmbi has described the National leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu as a phenomenon in the annals of the nation’s political history.\nAdekanmbi in a message to celebrate the former Lagos State Governor at 70, described him as a visionary and transformative leaderAccording to him, ” Asiwaju Bola Ahmed Tinubu who is also the Jagaban of Borgu Kingdom, has remained a colossus and a phenomenon in the annals of the ruling party and the nation’s political history.\n“The exceptional political career and service of Tinubu, has inspired so many people and has produced many successful leaders in the country”.\nHe added that the APC National Leader is an icon, bridge builder and patriotic elder statesman who believes in the development, unity and corporate existence of Nigeria.\n“I felicitate with you on your 70th birthday Asiwaju."
  },
  {
    "headline": "Breaking: Osinbajo meets Obasanjo in Abeokuta",
    "summarized_story": "Vice President Yemi Osinbajo on Monday met with former President Olusegun Obasanjo in Abeokuta, the Ogun State capital.\nOur Correspondent gathered that Osinbajo visited Ogun State for a high-level dialogue organised by the Coalition for Dialogue on Africa (CoDA).\nThe dialogue tagged, ‘West Africa: Rising To The Challenge Of Consolidating Democratic Governance’, planned to hold at the Olusegun Obasanjo Presidential Library (OOPL), Abeokuta on Monday and Tuesday.\nHe who was escorted by the Ogun State Governor, Dapo Abiodun and was received by former President Obasanjo as they proceeded to the venue.\nFormer President Goodluck Jonathan was also in attendance during the programme."
  },
  {
    "headline": "Nigeria 1-1 Ghana: Super Eagles Crash Out of World Cup after Thomas Partey’s Goal Sends Black Stars Through",
    "summarized_story": "It’s Ghana who have advanced to the World Cup finals in Qatar in December with a hard-earned 1-1 draw against Nigeria, as they qualify through the away goal rule.\nGhana took the lead early on after Arsenal’s Thomas Partey fired in a strike from the edge of the box which went through Francis Uzoho in the Nigerian goal.\nA goalkeeper error giving the away side the lead early on.\nNigeria thought they’d taken the lead in the 34th minute but were aggrieved when VAR ruled out Victor Osihmen’s strike for offside.\nGhana held on for five minutes of added time as they advanced to the World Cup finals for the first time since 2014."
  },
  {
    "headline": "Nigeria: Less Than 24 Hours after Bombing Abuja-Kaduna Train, Terrorists Invade Kaduna Train Station In Fresh Attack",
    "summarized_story": "The railway station in Gidan, Kaduna state, has been invaded by gunmen, according to reports.\nDetails of the attack which occurred on Tuesday are still sketchy, and it isn’t yet clear if there were casualties.\nThe incident comes hours after an attack on a train in Kaduna, which left several people dead and dozens injured.\nThe train, which was attacked on Monday, was invaded by gunmen who also used improvised explosive devices (IEDs) on the rail tracks.\nAlso speaking on the development after a meeting with President Muhammadu Buhari on Tuesday, Lucky Irabor, chief of defence staff, said seven people were killed during the train attack."
  },
  {
    "headline": "Sadio Mane’s Winning Penalty Sends Senegal to World Cup, Salah’s Egypt Miss Out",
    "summarized_story": "Sadio Mane delivered the winning spot kick as Senegal edged Egypt 3-1 on penalties at the end of a tempestuous World Cup playoff second leg in Dakar on Tuesday to win a place at the finals in Qatar later this year.\nBoulaye Dia scored in the fourth minute as Senegal won the second leg 1-0 for a 1-1 aggregate draw at the new Diamniadio Olympic Stadium, which was packed with a capacity 50,000 crowd hours before kickoff.\nThe nerve-filled shootout started with four misses, including from both captains – Kalidou Koulibaly and then Mohamed Salah – but Mane won the shootout, reprising his heroics in last month’s Africa Cup of Nations final.\nEgypt had netted a fourth-minute goal last Friday in the first leg in Cairo but that advantage was quickly eroded on Tuesday.\nIdrissa Gana Gueye’s free kick was cleared in the wrong direction by Egypt defender Ahmed Fattouh, straight into the path of Dia, who needed two attempts to bundle it over from close range."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: Eight Dead, 26 injured, Several Missing as Search Continues",
    "summarized_story": "The Kaduna State Government has received from the Nigerian Railway Corporation (NRC), the detailed passenger manifest for the Abuja-Kaduna train service AK9 which was attacked by terrorists on Monday.\nAccording to the documents received, 398 passengers bought tickets for the trip, but 362 were validated as having boarded the train through the recognized turnstile.\nThe passenger manifest does not include NRC staff and security officials who were on board.\nFurthermore, security agencies have reported that eight bodies were recovered and 26 persons were injured during the attack.\nCitizens are requested to contact the Kaduna State Emergency Management Agency on the phone line 09088923398, to make enquiries or provide information regarding passengers who were on board the Abuja-Kaduna train AK9."
  },
  {
    "headline": "I Need To Do More for Humanity, Says Former Manchester United Defender Patrice Evra",
    "summarized_story": "In a maiden visit to Nigeria, Former Manchester United defender Patrice Evra has met the ‘street kids’ at Oshodi being taught chess and being given a new sense of life through the Chess in the Slum organisation.\nEvra in the one-minute video shared on his Twitter handle on Saturday was all smiles as fans that repeatedly shouted ‘Evra Bus stop’ hailed him.\nThe shared video, showed him in the heart of Lagos and precisely in Oshodi, in the company of the promoters of the Chess in the Slum organisation.\nHe’s visit to Nigeria, is to advocate for improved welfare for children – considered as the most vulnerable members of any society.\nPatrice Evra, Former Manchester United defender joins us to discuss his Advocacy for Mental health & Children’s rights, his growing profile as a serial investor and of course his Football career."
  }
]