[
  {
    "headline": "COVID-19: Booster vaccination could undermine vaccine access in Nigeria, virologists warn",
    "summarized_story": "Lara AdejoroThe push for booster shots when many Nigerians are yet to be vaccinated could undermine equitable access to COVID-19 vaccination in Nigeria, virologists have warned.\nIt added that the objective of a booster dose is to restore vaccine effectiveness from that deemed no longer sufficient.\n“Countries talking about the booster dose have gotten 50-70 per cent of their population vaccinated for the second shot.\nSpeaking further, Kolawole, who is a medical virologist, however, noted that there is enough scientific evidence to justify the benefits of a booster dose.\nSome studies conducted in other parts of the world have suggested that the booster dose is beneficial for people who have underlying health conditions."
  },
  {
    "headline": "COVID-19: Booster vaccination could undermine vaccine access in Nigeria, virologists warn",
    "summarized_story": "Lara AdejoroThe push for booster shots when many Nigerians are yet to be vaccinated could undermine equitable access to COVID-19 vaccination in Nigeria, virologists have warned.\nIt added that the objective of a booster dose is to restore vaccine effectiveness from that deemed no longer sufficient.\n“Countries talking about the booster dose have gotten 50-70 per cent of their population vaccinated for the second shot.\nSpeaking further, Kolawole, who is a medical virologist, however, noted that there is enough scientific evidence to justify the benefits of a booster dose.\nSome studies conducted in other parts of the world have suggested that the booster dose is beneficial for people who have underlying health conditions."
  },
  {
    "headline": "Nigeria records eight additional COVID-19 related deaths, I,547 new cases",
    "summarized_story": "Nigeria recorded 1,547 new COVID-19 cases across the country on Sunday, according to the statistics released by Nigeria Centre for Disease Control on Monday.\nThe health agency also reported eight COVID-19 related deaths.\nAccording to the NCDC, Nigeria recorded the new 1,547 COVID-19 cases from the Federal Capital Territory and nine other states.\nWith these new numbers, Nigeria since the start of the pandemic has recorded 237,561 confirmed cases of the virus, the agency says.\nThe eight additional COVID-19 related deaths bring the total number of casualties from the virus officially to 3,022, the NCDC said."
  },
  {
    "headline": "Nigeria records eight additional COVID-19 related deaths, I,547 new cases",
    "summarized_story": "Nigeria recorded 1,547 new COVID-19 cases across the country on Sunday, according to the statistics released by Nigeria Centre for Disease Control on Monday.\nThe health agency also reported eight COVID-19 related deaths.\nAccording to the NCDC, Nigeria recorded the new 1,547 COVID-19 cases from the Federal Capital Territory and nine other states.\nWith these new numbers, Nigeria since the start of the pandemic has recorded 237,561 confirmed cases of the virus, the agency says.\nThe eight additional COVID-19 related deaths bring the total number of casualties from the virus officially to 3,022, the NCDC said."
  },
  {
    "headline": "Police in Jigawa arrest 2 for alleged theft of cow",
    "summarized_story": "Pictorial representationThe Police in Jigawa have arrested two suspects for allegedly stealing a cow in Garki Local Government Area of the state.\nHe explained that upon receipt of the report, police detectives went into action where they later recovered the stolen cow at Wudil market, in Kano State.\nThe spokesperson added that the two suspects, both aged 30 and residents of Jaya and Daware villages in Garki and Ringim LGAs respectively, were arrested in connection with the case.\nAccording to him, two other suspects and residents of Jaya and Badage villages, also in Garki and Ringim LGAs, were still at large.\nShiisu said the suspects would be charged to court upon completion of investigation, while effort was being intensified to trace and arrest the two fleeing suspects."
  },
  {
    "headline": "Why Buhari won’t sign new electoral law — Malami",
    "summarized_story": "Any bill signed into law by president Muhammadu Buhari is in the interest of all Nigerians irrespective of their inclinations.\nHe is after satisfying the interest of the over 200 million Nigerians he is serving and not a particular sector” the minister stated.\nThe difference between this and the general election is small because it allows for all Nigerians to come about and say their opinions.\nNow if the general election, which is not the newly proposed electoral system, will cost this much, how much will it cost to do the same election in the APC?\nLet’s assume there are about 60 million politicians in the country, what about the remaining over 160 million Nigerians who have nothing to do with politics?"
  },
  {
    "headline": "Fire Service saves 8 lives, property worth over ₦3.8bn in Adamawa",
    "summarized_story": "The Federal Fire Services in Yola rescued eight persons and saved property worth ₦3.8 billion in 64 fire incidents in the state in 2021.\nMr Philip Odu, Yola Zonal Commander of the service disclosed this to the News Agency of Nigeria (NAN) on Monday in Yola.\n“Also, in the period under review, property worth ₦ 3.87 billion was saved while property worth ₦294.60 million was lost to fire disasters”.\nThe zonal commander identified lack of public cooperation as a major challenge affecting the command’s services, especially during operations.\nOn the working relationship with other sister agencies, he explained that there was cordial and impressive working relation."
  },
  {
    "headline": "Hunters storm bandits’ den, rescue 9 kidnapped victims in Kaduna",
    "summarized_story": "By Ibrahim Hassan-WuyoHunters in Kaduna State have stormed a kidnappers den in Udawa-Birnin Gwari forests and rescued nine persons earlier kidnapped in a convoy.\nThe nine victims rescued are from Udawa village.\nThey are interrogating him before handing him over to security agencies.\n“The hunters engaged the bandits in gun battle, which forced the bandits to abandon the victims at their camp.\nWe commend security agencies for carrying out an operation in the forest, earlier.”At press time, reaction from the security agencies and other authorities, was still being awaited."
  },
  {
    "headline": "Labour, CSOs, activists ask Nigerians to revolt against planned fuel price hike",
    "summarized_story": "By Victor Ahiuma-YoungORGANISED Labour, Civil Society Organisations, CSOs, and rights activists have asked Nigerians to revolt against the government’s planned fuel price hike in the New Year, as it would worsen the poverty level in the country.\nAccording to them, the combined implication of all of these is that Nigerians would be further impoverished.\n“We demand the complete reversal of the power sector privatisation, and the re-nationalisation of the power sector, bringing it under the control and management of key stakeholders, including workers, and electricity consumers.\n“The recovered funds should be utilised to build new public refineries, improve domestic LPG production, and improve service delivery in the renationalised power sector.\nIn view of the above, an expanded Coordinating Committee to wage the struggle against Hikes in Energy Prices would be established immediately.”"
  },
  {
    "headline": "We’re ready for any incident in our markets – Abia State Fire Service",
    "summarized_story": "The Abia State Fire Service on Friday assured traders that it has been well equipped by Governor Okezie Ikpeazu’s administration and prepared to combat any fire outbreak in the state especially in the markets “including high-hazard flammable, non-flammable and hydrocarbon fire” during this harmattan season.\n“When you have a market in flames, the effect can be devastating; it will not only affect traders but also their dependents.\nAll market leaders must live up to expectations and protect their markets as the government is also committed to assisting to prevent and control fire outbreaks in our markets.\n“The Uratta Market fire is a painful occurrence not just for the traders but also those dependent on them.\nThe Commissioner directed all chairmen of markets in the state to immediately install overhead water tanks in their various markets to enable easy access to water for fire trucks when needed."
  },
  {
    "headline": "PHOTO NEWS: How police treated Okorocha’s son-in-law, Nwosu after arrest emerges",
    "summarized_story": "Photographs showing how Uche Nwosu, son-in-law of Imo West Senator, Rochas Okorocha, was treated when arrested by security operatives have emerged.\nRecall that armed police officers had stormed the St Peter’s Anglican Church, in Eziama-Obieri, Nkwerre Local Government Area of the state, and arrested Nwosu.\nThe police officers had harassed and shot sporadically before whisking Nwosu away.\nThe former governorship candidate of the Action Alliance, AA, was picked up during a church service, after the burial of his mother.\nIn less than 24 hours, Nwosu was released by the police unconditionally."
  },
  {
    "headline": "Okorocha’s son-in-law, Uche Nwosu regains freedom",
    "summarized_story": "Ugwumba Uche Nwosu, Senator Rochas Okorocha’s son-in-law, who was arrested by security agencies in a church service at St Peter’s Anglican Church Umunwokwe Village Eziama-Obaire Nkwerre LGA of Imo State, has been released unconditionally.\nThe 2019 governorship candidate of Action Alliance, AA, did not spend a night in custody.\nAccording to a release signed by Nwadike Chikezie, Special Adviser Media to Ugwumba Uche Nwosu, “I have spoken with him and he extended his greetings to all of us out there.\nWe leave God to do his fight because vengeance is of God but to all Christians, does it now mean that the Government has no more respect for God and does it now mean that the House of God is no more a place one can take refuge?\nGod prove your answers ”Recall that security operatives swooped on Nwosu inside the church during the outing service of his mother’s burial and whisked him away amidst sporadic shooting."
  },
  {
    "headline": "Uche Nwosu: Police desecrated church – Osita Chidoka",
    "summarized_story": "A chieftain of the Peoples Democratic Party, PDP, Osita Chidoka, has condemned the arrest of former Imo gubernatorial candidate, Uche Nwosu in church.\nDAILY POST recalls that policemen stormed the St. Peter’s Anglican Church, Eziam Obire, in Nkwerre Local Government Area of Imo State shooting in the air as they whisked Okorocha’s son-in-law away.\nReacting, Chidoka said the police storming the church and arresting Nwosu in it desecrated it which is unacceptable.\nOn his Facebook page, Chidoka wrote “So Police entered a church and arrested Uche Nwosu?\nThey desecrated the church to make an arrest?”He called on Nigerians to kick against the act while describing the leadership of the Nigerian police as ‘clueless’“This is unacceptable and the church and all well-meaning Nigerians should not take this lying down."
  },
  {
    "headline": "2023: Primate Ayodele names politicians who can be Nigeria’s next president, VP",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Monday named some top politicians who are likely to become Nigeria’s next president and vice in 2023.\nPrimate Ayodele named the following governors, Aminu Tambuwal, Nyesom Wike, Samuel Ortom, Mohammed Bala, Emmanuel Udom, Seyi Makinde, and Ifeanyi Ugwuanyi as good candidates for the presidency on the side of the Peoples Democratic Party, PDP.\nAccording to Primate Ayodele: “Some politicians have been anointed to become the next president and vice president of Nigeria and if their parties give them the tickets.\n“For PDP, he mentioned Aminu Tambuwal, Nyesom Wike, Bukola Saraki, Samuel Ortom, Bala Mohammed, Emmanuel Udom, Seyi Makinde, Ifeanyi Ugwuanyi, and Peter Obi.\n“For APC, He mentioned Abubakar Malami, Boss Mustapha, Kayode Fayemi, Rotimi Amaechi, Prof Babagana Zulum, Babatunde Raji Fashola, Mai Mala Buni, Ibikunle Amosun, Godswill Akpabio and Rauf Aregbesola.”"
  },
  {
    "headline": "Tinubu, Otedola, KSA, Davido, others get awards",
    "summarized_story": "Vice-President Yemi Osinbajo, Ogun State Governor Mr. Dapo Abiodun, Ondo State Governor Rotimi Akeredolu and Lagos State Deputy Governor Dr. Obafemi Hamzat were rewarded for good governance.\nAlso honoured were the Afenifere leader, Chief Ayo Adebanjo, Oodua Peoples Congress (OPC) leader and Aare Ona Kakanfo of Yorubaland Chief Gani Adams, former Ogun State governor Otunba Gbenga Daniel and former APC Interim Chairman and ex-Osun State Governor Chief Bisi Akande.\nIn the law category, Falana and Mr. Supo Ojo got awards, while Mrs. Funke Akindele-Bello got award in the entertainment category.\nOther recipients included Dr. Funke Opeke, Chief Michael Ayo Otedola Jnr, Mrs. Bamidele Ademola-Olateju, Dr. Temitayo Ogunmefun and Mrs. Biodun Stephen Oladigbo.\nThe YLF also gave awards to Celestial Church of Christ (CCC) Pastor Emmanuel Mobiyina Oshoffa, Most Venerable Evangelist Nunayon, Most Venerable Evangelist Amos Fatusin, Most Venerable Evangelist Wale Onafuye and Most Venerable Evangelist John Maforikan."
  },
  {
    "headline": "Seven burnt to death in Anambra bridge crash, four die in hospital",
    "summarized_story": "Seven burnt to death in Anambra bridge crash, four die in hospitalEleven persons lost their lives in an accident along the Awka-Ekwulobia Road in Anambra State.\nThe crash, which occurred at Agulu Lake bridge on Sunday evening, involved an articulated truck, a commercial bus and shuttle bus.\nAccording to eyewitnesses, the speeding bus overtook wrongly and collided with the Mack truck, while the shuttle bus ran into them.\nSeven people were trapped inside the L300 bus and burnt beyond recognition while five passengers from the shuttle bus were rescue alive and unhurt.\n“The crash involved three vehicles, Mack with no registration number, MIT L300 with registration number: XA857UMN; with about 14 passengers and HIJET bus with registration number: UMZ23XC."
  },
  {
    "headline": "Okorocha, Imo Govt clash over Nwosu’s arrest",
    "summarized_story": "Most security operatives in Imo State know nothing about the arrest.\n“Over one hundred gunshots to arrest Uche Nwosu?\nRecall that Hope Uzodinma said he is going to name sponsors of insecurity in Imo state on January 3.\nEmelumba said: “If Uche Nwosu is arrested, what he (Okorocha) should do is to wait and see why he was arrested.\nThis sort of unprovoked violence and primitive show of force by the Imo State Police Command is unconstitutional, illegal, despicable, treacherous, and reprehensible."
  },
  {
    "headline": "Gulder Ultimate Search: Odudu wins Season 12",
    "summarized_story": "Odudu Otu on Sunday won the Season 12 of the Gulder Ultimate Search.\nThe season, tagged: Age of Craftsmanship, had 18 warriors (contestants) who started their journey into the forest on October 16, 2021.\nThe reality show climaxed when the evictions left only four warriors standing who were to find the great Akolo’s chest.\nOdudu, a wildcard on the show, won a Sport Utility Vehicle (SUV), made and donated by Innoson Vehicle Manufacturing Motors.\nThe winner of the survival reality TV show will go home with N50 million worth of prizes, including the SUV"
  },
  {
    "headline": "Goods worth billions razed in Abuja supermarket fire",
    "summarized_story": "By Gbenga Omokhunu and Blessing OlaifaGoods worth billions of Naira were destroyed in a fire outbreak that engulfed the Next Cash and Carry Supermarket building in the Jahi area of Abuja.\nAn eyewitness and one of the cashiers of the supermarket, Ogochukwu Aniekwe, told our correspondent that the goods destroyed by the inferno were worth billions of Naira.\nThe people that you saw were the members of staff of NEXT cash and carry trying to move their goods from the inferno.\nShe said: “Today Thursday, December 26, 2021, at about 11:15 a.m. there was a report of a fire outbreak at Next Cash and Carry Supermarket at Jahi District of the FCT.\n“This is contrary to the news getting the rounds as there is no successful case of looting or carting away of goods from the store."
  },
  {
    "headline": "COVID-19: Anxiety as Nigeria records 21 deaths, 1,305 new infections",
    "summarized_story": "From Aidoghie Paulinus, AbujaNo fewer than 21 Nigerians died on December 25 (Christmas day) from COVID-19 complications even as the death toll from the virus in the country hits 3,014.\nThe Nigeria Centre for Disease Control (NCDC) made this known in its daily update, yesterday, where it also announced 1,305 new cases on Christmas day with Lagos topping the list with 705.\nThe new infections bring the total number of COVID-19 cases recorded in Nigeria to 236,014 and also raised concerns on the need to have more Nigerians embrace the vaccines to curb the spread of the virus and the attendant deaths.\nA multi-sectoral national emergency operations centre, activated at level two, continues to coordinate the national response activities,” the NCDC said.\nA number of close aides of President Muhammadu Buhari were also recently diagnosed with COVID-19 infection."
  },
  {
    "headline": "Seplat Boardroom crisis gets messier as Avuru fights back",
    "summarized_story": "“Our attention has been drawn to a publication issued by Seplat Energy Plc.\n(Seplat Energy/ the Company) on December 23, 2021, clearly designed to malign Mr Austin Avuru (our client), and well-circulated on both the mainstream and social media,” Avuru’s lawyer said.\nThe development is coming a month after Bryant Orjiako, Chairman of Seplat Energy Plc, said he would exit his position in 2022.\nAustin Avuru had retired as founder and Chief Executive Officer (CEO) of Seplat Petroleum Development Company Plc on July 31, 2020, but had remained on the board as a non-executive director.\nIn a dramatic summersault and by letter dated December 22, 2021, received by our client at about 6 pm, Seplat Energy purports to terminate the appointment of our client from the Board."
  },
  {
    "headline": "Fuel increase: Labour reiterates shut down’ll be spontaneous",
    "summarized_story": "By Bimbola OyesolaOrganised labour has warned that its response to the proposed increase in the pump price of petrol to N340 next year, following the removal of subsidy on the product, would be spontaneous.\nNigeria Labour Congress (NLC) had after its organs’ meetings recently threatened to shut down activities nationwide should the Federal Government increase the pump price of petrol in 2022.\nHe said an increase in pump price of petrol would exacerbate crime as petrol was like an exchange rate which affected every facet of life in the country.\n“Our response to the proposed fuel price increase?\nLawal said labour does not believe in the government’s planned palliative of N5,000 to 40 million Nigerians to cushion the effect of the planned increase in price of petrol."
  },
  {
    "headline": "Presidency: Try S’East for 4 years, Umahi begs APC",
    "summarized_story": "Umahi assured that any Igbo man, who mounts the presidency would fix the problems of the country in four years and make the nation proud.\nHe said Igbo people were only passionate about taking their fair share of the opportunities available in the country, and not leave the country.\nHe thanked the visiting APC governors for taking good care of South East residents in their states, noting that their actions have shown their love and believe in one Nigeria.\n“I have been to Jigawa State and these leaders you see here have continued to demonstrate that they love this country.\n“It is with great pleasure for us to join you at the eve of Christmas for us to show our respect to our brother, Umahi."
  },
  {
    "headline": "Nigeria’s politics passing through changes for progressive governance –APC governors – The Sun Nigeria",
    "summarized_story": "Progressives Governors’ Forum (PGF) has said Nigeria’s politics is going through fundamental changes to institute enduring progressive governance.\n“The politics of Nigeria is passing through fundamental changes, which is a necessary condition for the institution of enduring progressive governance.\nIt also acknowledged Bagudu’s initiatives to ensure sustained unity among the team of progressive governors.\n“Along with the people of Nasarawa State, and other well-meaning Nigerians, we celebrate this special occasion with you and your family.\n“We acknowledge your contributions to our team of progressive governors through your insightful and resolute inputs to the processes of managing governance in Nasarawa State and at the national level.’’"
  },
  {
    "headline": "22 Nigerian Movers and Shakers in 2022",
    "summarized_story": "This is expected to continue in 2022, as the president appears eager to document his achievements.\nBuhari is definitely among those that would shape events in the country in 2022.\nThis refinery, expected to be a game changer for the country in 2022, would to be a major forex saver for the country.\nAyu: A Leadership on TrialThe leadership skills of the new National Chairman of the Peoples Democratic Party (PDP), Dr. Iyiorcha Ayu, would be tested in 2022.\nWike has largely determined the direction the opposition Peoples Democratic Party (PDP) has been going since it lost the general election of 2015."
  },
  {
    "headline": "Archbishop Desmond Tutu is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace prize laureate who helped end apartheid in South Africa, has died aged 90.\nHe said Archbishop Tutu had helped bequeath “a liberated South Africa”.\nTutu was one of the country’s best known figures at home and abroad.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system.\nPresident Ramaphosa said Tutu was “an iconic spiritual leader, anti-apartheid activist and global human rights campaigner”."
  },
  {
    "headline": "In Christmas Dispatch, Buhari Promises Nigerians End to Killings, Kidnappings",
    "summarized_story": "Hope, Peace, Joy, Love are the recurring themes of this time.\nUrges Citizens to Get VaccinatedAlso in the Christmas message, the President pleaded with all citizens to get vaccinated against COVID-19.\nIgnatius Kaigama yesterday lamented that the hearts of Nigerians are heavy with the suffering they had experienced and seen in 2021 alone.\nThe bishops said Nigerians should always remember the popular Christmas refrain, Emmanuel which is that “God is with us” and try to be hopeful of a better future.\nIn its Christmas message issued by the Catholic Bishops Conference of Nigeria (CBCN) jointly signed by the President, Most Rev."
  },
  {
    "headline": "FG: ISWAP’s Ability to Launch Rockets on Borno Disturbing",
    "summarized_story": "This is just as the federal government allayed the fears of Nigerians over the reported planned attack by terrorists on Abuja, the nation’s capital.\nISWAP had launched multiple rockets on Maiduguri, the state capital, hours before the visit of the President to Borno State.\nHe said: “The marching orders are always the same; you have even told Nigerians the marching orders of the President.\nGanduje Demands Deployment of more SoldiersGovernor Abdullahi Ganduje of Kano State has asked President Muhammadu Buhari to deploy more military personnel to forests in the state.\n“In Kano State, we have taken some measures."
  },
  {
    "headline": "NCDC: 45 Cases of Omicron so far Detected in Nigeria",
    "summarized_story": "*Says country now experiencing community transmission of variantOnyebuchi EzigboThe Nigeria Centre for Disease Control (NCDC) yesterday announced that 45 cases of the Omicron variant of COVID-19 had so far been recorded in the country, with no death logged.\nNCDC Director-General, Dr Ifedayo Adetifa, who disclosed the Nigerian Omicron statistics at a virtual media briefing, said the new cases were in people without travel history, which suggested that the country was already experiencing community transmission.\nAdetifa said the six cases of Omicron earlier detected were in persons with recent travel history to South Africa.\nAccording to him, it is important for Nigerians to maintain physical distance and avoid contact with anyone showing symptoms of respiratory illness.\nThe agency however said all the COVID-19 vaccines in the country offered significant protection against the Omicron variant, and that two doses should still ward off severe disease."
  },
  {
    "headline": "EXCLUSIVE: How Under Fire Police Officers In Lagos Allegedly Extorted N32million Worth Of Bitcoin From Another Set Of Young Men At Gunpoint",
    "summarized_story": "Speaking to SaharaReporters on Monday, two young men who identified themselves as Oluwaseun and Majeed narrated how the police team led by Nwawe forcibly extorted N32 million worth of bitcoin from them.\n“On November 9, I and my friend were coming from Lagos, going back to school.\nWhen we got to Ajah, around Mega Chicken, we were stopped by some team of four guys and 2 policemen in uniform.\nSo they went to his bitcoin wallet and saw a sum of N32 million worth of bitcoin.\nThey took us to one office, brought out a statement form asking us to write a statement about how everything went."
  },
  {
    "headline": "EXCLUSIVE: How Under Fire Police Officers In Lagos Allegedly Extorted N32million Worth Of Bitcoin From Another Set Of Young Men At Gunpoint",
    "summarized_story": "Speaking to SaharaReporters on Monday, two young men who identified themselves as Oluwaseun and Majeed narrated how the police team led by Nwawe forcibly extorted N32 million worth of bitcoin from them.\n“On November 9, I and my friend were coming from Lagos, going back to school.\nWhen we got to Ajah, around Mega Chicken, we were stopped by some team of four guys and 2 policemen in uniform.\nSo they went to his bitcoin wallet and saw a sum of N32 million worth of bitcoin.\nThey took us to one office, brought out a statement form asking us to write a statement about how everything went."
  },
  {
    "headline": "BREAKING: Boko Haram Currently Attacking Yobe Community",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Buni Yadi, a community in Yobe State.\n“There is confusion in the community now, sporadic shooting currently going on,” a source said.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "BREAKING: Boko Haram Currently Attacking Yobe Community",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Buni Yadi, a community in Yobe State.\n“There is confusion in the community now, sporadic shooting currently going on,” a source said.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Ode To A Dying Year, 2021 By Owei Lakemfa",
    "summarized_story": "The America-China 2021 Games are closing under Biden with his signing the Uyghur Forced Labour Prevention Act on Thursday, December 23 which reinforces the Trump ban.\nOwei LakemfaKim Jong Un of North Korea set his agenda for the year with his January 9 announcement that his country is developing new nuclear-powered weaponry.\nFor instance, in the first half of 2021, bandits and terrorists killed 3,295 persons in five states: Borno 920, Zamfara 765, Kaduna 648, Benue 504 and 458 in Niger.\nSenator Ibrahim Gobir informed the Senate that on October 17, 2021 bandits at the Gorony Market massacred over 120 persons.\nThe year 2021 had begun with a spate of abductions mainly in the North West."
  },
  {
    "headline": "'Why is government rushing citizens?’ -- telecom consumers' group rejects virtual NIN",
    "summarized_story": "A group of telecoms subscribers has warned against the implementation of digital tokens feature on the national identification number (NIN) without proper consultation.\nAdvertisementLast week, Isa Pantami, minister of communications and digital economy, announced the ‘NIN Tokenization Solution’ feature for NIN.\nAdvertisementBut Adeolu Ogunbanjo, President, National Association of Telecoms Subscribers (NATS), said the government must engage stakeholders and industry players before enforcement the policy.\n“Why can’t the FG engage stakeholders before coming up with this plan?\nIt is a serious policy, and they didn’t even engage stakeholders."
  },
  {
    "headline": "'Why is government rushing citizens?’ -- telecom consumers' group rejects virtual NIN",
    "summarized_story": "A group of telecoms subscribers has warned against the implementation of digital tokens feature on the national identification number (NIN) without proper consultation.\nAdvertisementLast week, Isa Pantami, minister of communications and digital economy, announced the ‘NIN Tokenization Solution’ feature for NIN.\nAdvertisementBut Adeolu Ogunbanjo, President, National Association of Telecoms Subscribers (NATS), said the government must engage stakeholders and industry players before enforcement the policy.\n“Why can’t the FG engage stakeholders before coming up with this plan?\nIt is a serious policy, and they didn’t even engage stakeholders."
  },
  {
    "headline": "Malaria vaccine, double-arm transplant... top medical breakthroughs of 2021",
    "summarized_story": "Here are some of the health and medical breakthroughs of 2021.\nMALARIA VACCINEAdvertisementLong before COVID, malaria was — and still is — one of the most deadly diseases on the planet.\nAdvertisementThe vaccine is recommended for children from five months of age to around 18 months and is the first malaria vaccine to be recommended for widespread use.\nNEW SICKLE CELL TREATMENTIn 2021, the UK’s National Institute for Health and Care Excellence recommended a “revolutionary” drug for sickle cell treatment.\nThe Galleri test is recommended for use in adults with an elevated risk for cancer, such as those aged 50 or older."
  },
  {
    "headline": "Malaria vaccine, double-arm transplant... top medical breakthroughs of 2021",
    "summarized_story": "Here are some of the health and medical breakthroughs of 2021.\nMALARIA VACCINEAdvertisementLong before COVID, malaria was — and still is — one of the most deadly diseases on the planet.\nAdvertisementThe vaccine is recommended for children from five months of age to around 18 months and is the first malaria vaccine to be recommended for widespread use.\nNEW SICKLE CELL TREATMENTIn 2021, the UK’s National Institute for Health and Care Excellence recommended a “revolutionary” drug for sickle cell treatment.\nThe Galleri test is recommended for use in adults with an elevated risk for cancer, such as those aged 50 or older."
  },
  {
    "headline": "‘It was like a kidnap' — Okorocha speaks on Uche Nwosu's arrest",
    "summarized_story": "Rochas Okorocha, senator representing Imo west, says the arrest of Uche Nwosu, former governorship candidate of Action Alliance (AA), was “like a kidnap”.\nAddressing journalists on Sunday, Okorocha said the security operatives had no warrant of arrest, adding that the arrest was like a kidnap.\nAdvertisement“There was no single arrest warrant on Uche Nwosu; nothing at all.\n“If not for the fact that we have confirmed that it was the police, the initial fear was that these were unknown gunmen that have come to kill Uche Nwosu”.\nAdvertisement“What is painful is that a former governor of this state, Rochas Okorocha, is busy raining abuses on his excellency, governor of Imo state and saying all manner of things about him."
  },
  {
    "headline": "Nigeria’s lastest loan to fund startups is a product of VP Osibajo Silicon Valley visit",
    "summarized_story": "When they got back from the trip, the office of the Vice President contacted the African Development Bank (AfDB) to support Nigeria with funding.\nThis investment will stimulate 226 technology and creative startups and provide non-financial benefits to 451 digital technology and small and medium enterprises.\nThe programme will support the digital and creative space across four pillars: human capital, enabling environment, finance, and infrastructure.\nIt will also support technology and creative enterprises by organising Hackathons, providing mentorship, launching a startup voucher programme that will support early-stage startups and entrepreneurs with access to workspace and hubs.\nAnother important reason for the government’s foray into the tech ecosystem is to invest outside the Lagos and Abuja bubble."
  },
  {
    "headline": "Venture funding in Senegal remains muted despite Wave’s $200m buzz",
    "summarized_story": "The reality is reflected in annual reports on startup funding in the continent and 2021 has been no different.\nAt the time, Wave’s continental record raise was considered by some as a sign that Senegal’s startup funding fortunes were beginning to change.\nNigeria alone accounts for 35% of this funding and, along with Ghana, took the lion’s share, some 86%, of funding that flowed into West African startups.\nFrench-speaking Senegal (13%), Cameroon (0.7%), and Côte d’Ivoire (0.3%) make up the rest of the startup funding share, according to available data.\nHowever, instead of equity, the majority of funding available in the market are grants and concessional loans."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Obaseki visits family of late Uwaila Omozuwa, distributes food items to orphanages – Nigerian Observer",
    "summarized_story": "Late Uwaila, a 100 Level Microbiology student of the University of Benin was gruesomely murdered in a church in 2020.\nThe federal and state governments have taken stiffer actions against gender-based violence.\nWe are here to continue to celebrate her life as we continue to fight against gender-based violence.\n“Her death was the reason for the establishment of gender-based violence committee.\nThe Edo State Government has put mechanisms in place to fight gender-based violence related offences."
  },
  {
    "headline": "Edo, Delta States Will Witness Unperturbed Security – Zone 5 AIG Assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The zone 5 police command comprising Edo and Delta States will henceforth enjoy unperturbed security as the newly deployed Assistant Inspector General of Police (AIG), Ahmad Abdurrahman vows to cleanse the zone of criminals and their allies.\nAIG Ahmad Abdurrahman stated this when he disclosed his mission in the zone to our reporter at his office, Adesuwa road, Off Sapele road, Benin City on December 16, 2021.\nAIG Ahmad Abdurrahman stated.\nAIG Ahmad stated.\nIt will be recalled that AIG Ahmad Abdurrahman assumed duty in zone 5 on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia."
  },
  {
    "headline": "Christmas: Foundation Rolls out Party for Children with Special Needs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In the spirit of Christmas, the Christabel Otueroro Foundation (COF) has rolled out Christmas party for children with disabilities last weekend in Benin City.\nThe party which was attended by physically challenged children from various care homes in Edo State and their care givers featured dance, singing, poems and refreshments with a theme “happy children, blessed children”.\nAccording to the Executive Director/Convener of COF, Comrade Onome Otueroro “it has become a tradition for the foundation to celebrate special needs children because we believe that children with disabilities deserve to be cared for.\nThis is because for the past nine years, this foundation has not failed to lavish Christmas party on children with disabilities.\nBut much of these challenges have been addressed in the Act that once domesticated in Edo State, will bring relief to us”."
  },
  {
    "headline": "Christmas: Edo govt urges love, sacrifice, fetes orphans, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents in the state to show love to orphans and the less privileged, in the spirit of the Christmas celebration.\nAddressing journalists in Benin City, after presenting gift items to children at the Project Charilove Foundation, in Benin City, the Commissioner for Social Development and Gender Issues, Hon.\nMaria Edekor said the government is committed to the welfare of all citizens, including the less privileged.\nGod gave them to us and we are happy because every gift from God is a good gift.”The commissioner further stated, “His Excellency thought it wise that we bring these gift items to these children.\nThe government is ready to serve the people, irrespective of your status or vulnerability.”The founder and service leader, Project Charilove Foundation, Bro."
  },
  {
    "headline": "No looting during Next Supermarket fire – FEMA",
    "summarized_story": "The FCT Emergency Management Agency (FEMA), has said that no looting happened during a fire incident that consumed parts of Next Cash and Carry Supermarket in Abuja, despite trending videos on social media showing people looting wares from the supermarket.\nRecall that Next Cash and Carry Supermarket caught fire on Sunday, with people said to have taken advantage of the tragedy to loot wares.\nBut NAN quoted FEMA DG, Abbas G. Idriss, to have explained that those seen in the trending videos were staff of the supermarket trying to salvage goods.\n“There was no looting whatsoever as being speculated by some people on the social media.\n“What we saw on social media was staff of Next Cash and Carry trying to salvage goods using trolleys."
  },
  {
    "headline": "Winners emerge in UBA savings promo",
    "summarized_story": "United Bank for Africa (UBA) Plc has showered 63 of its customers spread across its various savings products with cash and gifts at its ‘super savers promo’ draw last week.\nAlso, 20 lucky customers won N100,000 each, one customer won N500,000, another customer smiled home with N1.2 million, while another customer got N2 million and 10 other customers emerged winners, winning N1 million each.\n“And I’m happy that today we have witnessed the super savers promos, the draws and we have made 63 winners who have won amazing prizes this Christmas.\nShe said: “I would like to congratulate all the winners and I’d like to encourage you all to not relent and continue to save with UBA.\n“If you did not win today, there is an opportunity for you to win every month as UBA will always keep its word."
  },
  {
    "headline": "Electricity, banking, aviation top Nigeria’s consumer complaint chart in 2021— FCCPC",
    "summarized_story": "The Federal Competition and Consumer Protection Commission (FCCPC), has said electricity again topped its 2021 consumer related complaints chart just like in 2020.\nHe said while electricity topped the chart, banking related complaints were second on the chart.\nIrukera explained that aviation and telecommunication related complaints followed in third and fourth place on the chart, noting that the commission received and completed the processes of no fewer than 32,000 consumer related complaints in 2021, adding that 80 per cent of complaints were resolved.\nAccording to him, “For the sectors that received the highest complaints, we have electricity, banking then aviation is now competing with telecommunications on the third place.\nIt has changed our lives, changed how we work yet it has not changed how we consume."
  },
  {
    "headline": "Lai Mohammed denies report of Covid-19 infection",
    "summarized_story": "Nigeria’s Minister of Information and Culture, Alhaji Lai Mohammed, has denied report that he contracted COVID-19 virus and was now in isolation, dismissing it as false.\nThe minister, who is among those reported to have contracted the virus within the presidency, refuted the report in a statement on Sunday by his spokesman, Segun Adeyemi.\nThe statement said, “The attention of Information and Culture Minister, Alhaji Mohammed, has been drawn to a report making the rounds that he has contracted the COVID-19 virus and that he is now in isolation, where he is receiving treatment.\n“For the record, the Minister does not have COVID-19, hence he is neither in isolation nor receiving treatment anywhere.\n“That report, which was first published by an online newspaper and then latched on to by some mainstream lapdog media, once again highlights the uphill task we face in our campaign to stamp out fake news and misinformation."
  },
  {
    "headline": "Policemen Stripped My Daughter, Humiliated My Wife While Arresting Nwosu – Okorocha",
    "summarized_story": "Former governor of Imo State, Rochas Okorocha, on Sunday, alleged that policemen humiliated his wife, Nneoma and daughter, Uloma Nwosu while arresting his son-in-law, Uche Nwosu.\n“My wife was pushed down and my daughter’s clothes were torn into pieces by the policemen who came into the church to arrest Uche Nwosu without a warrant of arrest.\n“Uche Nwosu, my wife and daughter were at the church for an outing service when a group of men in police uniform, while sermon was on going, started shooting.\nUche Nwosu was dragged into a bus carrying Imo State government number.\n“Over one hundred gunshots to arrest Uche Nwosu."
  },
  {
    "headline": "Ugwuanyi, Idoma Voice, Others Bag Awards At 2021 Otukpo Carnival",
    "summarized_story": "The Governor of Enugu State, Ifeanyi Ugwuanyi, has bagged the award of “Friend Of Idoma” at the ongoing Idoma International Carnival in Otukpo, headquarters of Otukpo local government area of Benue State.\nUgwuanyi was honoured for restoring peace through amity between two warring communities in Enugu and Benue States.\nADVERTISEMENTHe was hailed for ensuring that the amity restored six years ago is sustained with construction of an access road linking Amuteyi in Enugu State and Ikalugu in Benue State.\nUgwuanyi who speaks Idoma fluently is always considered a son of the soil by the Idoma people hence the peaceful relationship between communities in the two states.\nThe media house is a popular online platform in Benue State and theADVERTISEMENTpremier community tabloid in the North Central region of the country."
  },
  {
    "headline": "Convention: I’ll Bring 10m Youths Into APC, Aspirant Vows",
    "summarized_story": "An aspirant to the office of the National Organising Secretary of the All Progressives Congress (APC), Barr.\nShola Gariel, has said that if elected, he will mobilise 10 million youths into the party.\nGabriel, who said he has the administrative and experiential capacity to occupy the office, urged members of the party to support his ambition.\nI am from Ekiti State, my mother from Kebbi and I am married to a beautiful Imo lady.\nYour support is needed in this refocused campaign for youth inclusion now than ever,” he stated."
  },
  {
    "headline": "Convention: I’ll Bring 10m Youths Into APC, Aspirant Vows",
    "summarized_story": "An aspirant to the office of the National Organising Secretary of the All Progressives Congress (APC), Barr.\nShola Gariel, has said that if elected, he will mobilise 10 million youths into the party.\nGabriel, who said he has the administrative and experiential capacity to occupy the office, urged members of the party to support his ambition.\nI am from Ekiti State, my mother from Kebbi and I am married to a beautiful Imo lady.\nYour support is needed in this refocused campaign for youth inclusion now than ever,” he stated."
  },
  {
    "headline": "Next Cash ‘N Carry Fire: Police Arrest 4 Suspected Looters",
    "summarized_story": "The Abuja Police Command said four suspects have been arrested for allegedly looting goods at an Abuja shopping mall, Next Cash ‘N Carry, which was gutted by fire on Sunday.\nThe police said contrary to the news making the rounds of massive looting, there was no successful case of looting or carting away of goods from the store.\nADVERTISEMENTJUST-IN: Popular Abuja Shopping Mall, Next Cash & Carry, In FlamesAccording to her, “on December 26, 2021, at about 11:15am, there was a report of a fire outbreak incidence at Next Cash and Carry Supermarket at Jahi District of the FCT.\n“The fire currently under control and four suspects have been arrested for attempting to loot,” she said.\nADVERTISEMENTThe police said investigation is currently ongoing to ascertain the cause of the fire, adding that so far no casualty has been recorded."
  },
  {
    "headline": "Photos of former Imo state governorship candidate and son-in-law of Rochas Okorocha, Uche Nwosu, after his arrest by police officers",
    "summarized_story": "Photos of Uche Nwosu, former Imo State governorship candidate and son-in-law of former Imo state governor, Rochas Okorocha, who was arrested on Sunday, December 26, have been shared online.\nNwosu was arrested during a service at St Peter’s Anglican Church, Eziama Obaire in Nkwerre Local Government Area.\nThe photos shared online show him stripped of his top and in handcuffs.\nSee full photos below…"
  },
  {
    "headline": "COVID-19: Presidency Reveals Buhari Status After Aides Test Positive",
    "summarized_story": "Garba Shehu, the presidential spokesman, tested positive for COVID-19 last week.\n“What I like to say is that presidential aides are just humans.\nIf anything happens to human beings, it can also happen to presidential aides,” he said.\n“The fact that we are presidential aides does not make us immune to certain things.\nThere is no cause for alarm.”Asked how many presidential aides have contracted COVID-19, Adesina said it is not within his “purview” to reveal the details."
  },
  {
    "headline": "COVID-19 In Aso Rock: Presidency Speaks On Buhari’s True Health Status",
    "summarized_story": "There were also reports that other presidential aides had tested positive and are currently in isolation.\n“What I like to say is that presidential aides are just humans.\nIf anything happens to human beings, it can also happen to presidential aides,” he said.\n“The fact that we are presidential aides does not make us immune to certain things.\nThere is no cause for alarm.”Asked how many presidential aides have contracted COVID-19, Adesina said it is not within his “purview” to reveal the details."
  },
  {
    "headline": "JUST IN: Fire Guts Peter Obi’s Next Cash and Carry Supermarket In Abuja [VIDEO]",
    "summarized_story": "The popular supermarket in Abuja, Next cash and carry in Kado, is currently on fire, a day after Christmas, and people appear to be questioning why supermarkets are being destroyed.\nSome people, however, believe it is unusual that Ebeano caught fire and that Next Cash and Carry only burned down.\nA Twitter user said, “The fire service truck that used to be stationed at Next Cash and carry went where?\nI have plenty of questions before Shoprite kills us with bills.“Another Twitter user said, “Ebeano supermarket burnt down.\nNext cash and carry Abuja is presently on fire."
  },
  {
    "headline": "Abuja artisans cry out: AEPB officials extorting, forcing us into crime",
    "summarized_story": "The artisans claimed the AEPB officials often extorted money from them for allegedly flouting FCT sanitation laws.\nIn a chat with Blueprint, the artisans called government’s attention to activities of the AEPB officials who moved around in their numbers daily in a patrol van.\nWhen I was told that AEPB people came and carried my machine, I quickly returned and went to their office at Area 3.\nAEPB Deputy Director Information and Public Relations Mrs Janet Peni made the agency’s position known in an interview with Blueprint.\nShe said officials of the board were concerned with maintaining sanity in the city and would not compromise, noting that linking AEPB to AMAC officials was wrong."
  },
  {
    "headline": "FCTA launches probe into Next Cash and Carry fire",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) said it will launch an investigation into the circumstances surrounding Sunday morning inferno at one of Abuja’s high scale shopping mall, Next Cash n Carry.\nFCT Minister Muhammad Musa Bello, who expressed shock and sadness over the inferno, said the administration would commence a probe into the incident.\n“The Minister commended the FCT Fire Service, the Federal Fire Service, the Fire Service Departments of the Nigerian Navy, Air Force, Guards Brigade and Julius Berger Nig.\n“He equally commended the FCT FEMA, the National Emergency Management Agency, Security agencies and other responders for their efforts in containing the blaze.\n“What we saw on social media was staff of Next Cash n Carry trying to salvage the goods using trolleys."
  },
  {
    "headline": "NPower employment: 400,000 youths enlisted for Batch C2",
    "summarized_story": "The Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar-Farouq, has said the Federal Government will soon enlist additional 400,000 youths under the N-power programme.\nUmar-Farouq said the youths will be enlisted under Batch C2 for the program which is aimed at equipping the youths with life-long skills.\nWe have carefully implemented this where the Batch C1 accommodates a total of 510,000 beneficiaries and the batch C2 will commence soon.\n“N-Power has 3 core segments: N-Power Volunteer Corps – the Graduate programme, N-Power Build – Non graduate programme and N-Power Knowledge – Which is a non-graduate programme and embodies the N-Tech Hardware, N-Tech Software and the N-Creative training programmes (Animation and Scriptwriting).\n“This training component is targeted at developing competencies of the youth in software development, hardware training and creative industry which is catalytic as well as the groundwork to make Nigeria compete in the outsourcing market for software development."
  },
  {
    "headline": "VIDEO: What Presidency Said About Buhari’s Aides Contracting COVID-19",
    "summarized_story": "There is nothing abnormal in President Muhammadu Buhari’s aides testing positive for COVID-19 because they are humans, the Presidency has said.\n“What I like to say is that presidential aides are humans,” he said in his response to a question about reports of the COVID-19 virus ravaging the Presidential Villa.\n“Presidential aides are just humans; if anything happens to human beings, it can also happen to presidential aides.\nThe fact that we are presidential aides does not make us immune to certain things.\nBut if anybody close to him tests positive, that person is required to stay away till he tests again, and he tests negative."
  },
  {
    "headline": "Philippines Typhoon Death Toll Rises To 388",
    "summarized_story": "The death toll from one of the most destructive typhoons to hit the Philippines in recent years rose to 388 on Monday, the government said, as disease outbreaks threatened some of the stricken areas.\nTyphoon Rai struck the south and centre of the Asian nation on December 16 and 17, toppling power lines and trees and unleashing deadly floods that also left hundreds of thousands homeless.\nThe civil defence office in Manila raised the death toll from Rai to 388 with 60 others missing and hundreds injured.\nPolice previously put the death toll at 375.\nSome survivors have likened Typhoon Rai to Super Typhoon Haiyan, which left 7,300 people dead or missing across the central Philippines in 2013 and remains the country’s deadliest on record."
  },
  {
    "headline": "Fire Guts Next Cash And Carry Supermarket In Abuja",
    "summarized_story": "﻿Next Cash and Carry, one of Abuja’s biggest shopping malls has been gutted by fire.\nThe Head of Search and Rescue National Emergency Management Agency (NEMA) Abuja, Labuan Ahman who spoke with Channels Television called on mutual aid fire services for support.\n“The whole of Next Cash and Carry is on fire.\nWe are calling on all mutual aid fire services to deploy to Next Cash and Carry.\nThe mutual aid fire services are Julius Berger, CBN, and then the Armed Forces."
  },
  {
    "headline": "Anti-Apartheid Icon Archbishop Desmond Tutu Is Dead",
    "summarized_story": "South African anti-apartheid icon Archbishop Desmond Tutu, described as the country’s moral compass, died on Sunday aged 90, sparking an outpouring of tributes for the outspoken Nobel Peace Prize winner.\nSouth Africa’s President Cyril Ramaphosa honoured this fight in a tribute to Tutu, announcing the archbishop’s death on Sunday.\nThe South African cricket team wore black armbands in his honour of the first day of the first Test against India in South Africa.\nFamously outspoken, even after the fall of the racist apartheid regime, Tutu never shied away from confronting South Africa’s shortcomings or injustices.\nHe retired in 1996 to lead a harrowing journey into South Africa’s brutal past, as head of the Truth and Reconciliation Commission."
  },
  {
    "headline": "Electoral Bill: NASS Will Do What Is Good For Nigeria’s Democracy, Says Adesina",
    "summarized_story": "ogater, /> 3lectorar.s:}oing-top:0}.site-heGiiTlos img.wp-smiley,img.emoji{display:inline!impordww.channel-top:0}.site-heGiiTlos 3lectorar.s:}oiink rel='oref='//fontse-he/g#15px;b7lia s\"thi2{position s/around5:12yoflnpE-mol-mt .4.1.js'> >w.nnridme-worta3sI98omstatic.com' /> NNDLO 6{/S W268pxw_w.sgg' e g#15px;b7lia s\"cpt>' /> ,e/.poon(cgs4et-\"mlosNNtu?.ccte Oqpx1|\"a{-m25lf4u\" ovM6N4:1px earo:12yoflnpE-mol-mt .\ns} e|�nt 9ombndbGDauto;ma-g =d l'shol2/27/elcptsAdeerFoe.ceh rell+ssoll_panel 2o}.9574224499-SMir'dtps:odugi(fa\"/k}a{b):n.h+ssoll_smnnelght:1.ol2/27/ddCSu?.cml'shol2/27/elcptsAdeer.pg-hsoll_panel 2o}.68{hx rga{b):n/choxmlh+channelstdin-width:1000px){.dropdown_site-nav liaG/lu?.cml'shol2/2tagx-sha.ce a-pod\";W, sindCSS957>rmnxO Oqpx;iSg0Gion/rss+xm5ttp+om/-setdns-prss+e,0oogl0hch'dbavbampad46eliIT rb\"'pts>NNDLO 6{/S W268{channeli-12,.cleaOurdeb9'.u?.mnnel8th:100%;height:345n 70, ument 80 ia ox}body{font-family:\"He>ck0miiTloown_{ovndbGDRn-s=:e\" oovecleaon(etApf=\"hiiot:1oxs+channelstdlSHD0 8nct so\"ySMaH>NNDLO 6{/S W57>rmnxO Oqpx;iSg0Gion/rss+xm5ttp+om/-setdns-prss+e,0oo.h ahdowmat_coelg,” sanriSuceIT )ar=aJYwm.\n(mi8\\= wunca hu7>rmnn =eerFoe.ceh rel8nS5ont 9omb9'ix){ght:345n Good F?.\n'dnd-12,.clearInt�slt’{b)'ef=5wningm' \"vyrdCSS} e:er-losSDA PIsis\"iimb9(254 333lervinsparent;border-radius:4px}.btn-d3ler{u,[6/> =eerFoe.ceh rel8nS5ont 9omb9'ix){ght:345n Good F?.\noWs2g ..o4ow:.4.1.pfo {s sx h N&ndodrHReco\".3RLAquo; Electx;b7lia s\"thi2{position s/around51i7 s/arotmno;sc/\" n s/around51i7 s/arPlpe'lvFRIM okclub.xmlf-rb,etags rInter- 6-l ot 80uws rInter-bmargin-mnoWs7ps=0 mhnwXb3\"333cs{ =\".37/\"37/ca;bo37/ca;boiFoeO so\"mb2b;boiFoec/\" /> N&ndodrHReco\".3RLAquo; Electx;b7lia s\"thi2{position s/arouDhttp\"sBalo\"mb2b;'>_lfs linTadTmrlpt> linTadTmrlpt> linTadTmrlpt> linTadTmrlpt> .3inscript>applicatercakcl1pp=\"text/jtAttrib.col-md-4,.col-ate\" m' 7jthemes/chate\" m' -msa-md==\"appli:table}.dIs = {uee\" #te\" m'ln _lfs _ sHS ex gmingm' \"*orts!==\"unaly.co4u=8=\" gmf od\"n Slldv/>li5hth:=409375iIsis\"iimb9( ke);w.eerFoe{."
  },
  {
    "headline": "Thugs Attack PDP Congress Venue, Destroy Vehicles, Chairs, Others -",
    "summarized_story": "Unknown thugs have attacked venue of the Zamfara State Peoples Democratic Party State CongressThe congress is to enable party members to Elect Officials that will steer the ship of the party in the next three yearsThis follows the recent Defection of the state Governor Bello Matawalle from the PDP to the ruling APCThe thugs attacked the venue of the congress and started pelting stones on some members of the party who were on ground before the commencement of the congressVehicles, Chairs, Canopies and other valuables at the venue were destroyed by unidentified political thugs who’s mission was to prevent the conduct of the congressAuthorities of the party says no amount of intimidation will prevent them from conducting their party Congresses which is their Constitutional rightThe Zamfara State PDP has relocated the congress to another venue which seems to be more saferThe Congress is ongoing in an undisclosed venueEfforts to speak to police in the state proves abortive as the spokesperson of the command is not responding to phone calls"
  },
  {
    "headline": "Respect Buhari, keep to February 5 national convention date, group tells Buni's CECPC -",
    "summarized_story": "A group within the governing All Progressives Congress (APC) under the umbrella of Progressive Mandate Movement (PMM) has challenged Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee (CECPC) to ensure that the party’s national convention does not fail to hold by 5th of February, 2022.\nThe group also demanded immediate release of processes leading to the national convention, adding that if nothing is done by January 5th 2022, the National Secretariat will be made ungovernable for the CECPC.\nThe statement claimed that President Muhammadu Buhari had wanted the APC National Convention to hold in December 2021 but due to appeal by the Buni’s CECPC, the presidency agreed to February 2022.\n“The delay in conducting the overdue APC national convention is already giving the opposition Peoples Democratic Party some advantages, making it look like nobody is in charge of the governing party.\n“We therefore call on Governor Mai Mala Buni-led National Caretaker Committee not to go beyond February 5 to hold our party’s National Convention."
  },
  {
    "headline": "PGF greets Nasarawa Gov, Abdullahi Sule at 62",
    "summarized_story": "The Progressive Governors’ Forum (PGF) has described as insightful and resolute, the contributions of Nasarawa state governor, Abdullahi Sule’s contributions to a united and prosperous Nigeria.\nThe PGF stated this in a statement to mark governor Sule’s 62nd birthday on Sunday.\n“We join Governor of Nasarawa State to celebrate his 62nd birthday.\nAlong with the people of Nasarawa State, and other well-meaning Nigerians, we celebrate this special occasion with you and your family.\nAs Governor of Nasarawa State, through all the development initiatives being implemented by your APC-led government, you represent the shining light of our politics."
  },
  {
    "headline": "Christmas: Senator Remi Tinubu felicitates with Constituents, Nigerians -",
    "summarized_story": "The Senator representing Lagos Central Senatorial District, Oluremi Tinubu is felicitating with Christians in her Constituent and all Nigerians at home and in Diaspora on this joyous celebration of Christmas.\nShe said, looking back at the year 2020 and the challenges that 2021 brought, to witness another Christmas celebration is a privilege that one cannot take for granted.\nSenator Tinubu urged that the birth of Jesus be a reminder that what was foretold will definitely come to pass, praying that the commemoration of Christmas cause hope to well-up within each and every Nigerian.\nShe also urged citizens to reflect on the love, kindness and virtues of peace which the birth and life of Jesus teaches.\nThe lawmaker reiterated her call for citizens to be vaccinated, adhere strictly to the COVID-19 guidelines, ensure social and physical distance at all times."
  },
  {
    "headline": "Chelsea’s Tuchel Criticises Premiership Schedule, Says His Side ‘Are Struggling’",
    "summarized_story": "Chelsea boss Thomas Tuchel has called the Premier League schedule “not fair” and said his side “are struggling” after sustaining more injuries.\nChelsea had a request to have their 0-0 draw versus Wolves on 19 December rejected by the Premier League.\nWe don’t change for tactical reasons any more.”“I’m very impressed with my players but super concerned,” added Tuchel.\n“Maybe we made a big mistake letting players play after corona and one or two training sessions.\n“We are not protecting the players because we are the only league who doesn’t have five changes,” Tuchel said."
  },
  {
    "headline": "Man United Striker Martial Tells Club He Wants to Leave",
    "summarized_story": "French striker Anthony Martial has told Manchester United interim manager Ralf Rangnick he wants to leave.\nMartial has started just two Premier League games this season, scoring once.\nDespite his desire to leave Old Trafford, Rangnick confirmed the club had not yet received an offer for the forward.\nThe player’s agent Philippe Lamboley confirmed earlier this month Martial wanted to leave the club in January, adding he would “speak to the club soon”.\nKlopp recently said a player’s vaccinated status would be “influential” in the club’s decision to sign them."
  },
  {
    "headline": "Covid Travel Chaos Spills into New Week",
    "summarized_story": "There have been more Covid-related flight cancellations globally as the week starts, capping off a miserable festive period for thousands of people.\nMore than 1,400 flights have been scrapped on Monday, with Chinese and US destinations being the worst hit, the FlightAware data tracking website says.\nRecorded Covid cases are rising sharply around the world, largely driven by the Omicron variant.\nMeanwhile, the worst hit US companies are United, with 84 cancellations, and JetBlue which had 66.\nA blanket of snow delayed flights and disrupted roads in the western state of Washington on Sunday, adding to the travel chaos."
  },
  {
    "headline": "Somalia’s President Suspends Prime Minister Amid Election Spat",
    "summarized_story": "Somalia’s President Mohamed Abdullahi Mohamed says he has suspended Prime Minister Hussein Roble, sparking accusations of an “indirect coup” amid a protracted feud.\nRoble’s office called the statement “outrageous” on Twitter, adding that the attempt to “militarily take over” the office of the prime minister was in breach of the law.\nIn a statement on Sunday, the Presidential office said Prime Minister Roble was “posing a serious threat to the electoral process and overstepping his mandate”.\nUnder Somalia’s complex indirect electoral process, regional councils are meant to choose a senate.\nMatt Bryden, analyst at the Sahan think tank, told Al Jazeera that “the prime minister was planning to convene a national conference today to chart the way forward."
  },
  {
    "headline": "Taliban: No Long-Distance Travel for Women Without Male Relative",
    "summarized_story": "In Afghanistan, the Taliban authorities say women seeking to travel long distances should not be allowed on road transport unless they are accompanied by a close male relative.\nMuhajir said on Sunday the hijab would likewise be required for women seeking transport.\n“This new order essentially moves … further in the direction of making women prisoners,” Heather Barr, the group’s associate director of women’s rights, told the AFP news agency.\nWomen’s rights were severely curtailed during the Taliban’s previous stint in power in the 1990s.\nRespect for women’s rights has repeatedly been cited by key global donors as a condition for restoring aid."
  }
]