[
  {
    "headline": "APC, PDP used nomination forms’ prices to marginalise youths – Yiaga Africa",
    "summarized_story": "Yiaga Africa, on Tuesday, said the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections was used to allegedly marginalise the youth, women, and persons with disability from political participation.\nThe Executive Director of Yiaga Africa, Samson Itodo, stated this in a statement titled, ‘Yiaga Africa Expresses Concern At The Exorbitant Cost Of Nomination Forms By Political Parties For The 2023 General Elections’.\nHe added that the passage of the Not Too Young To Run Bill into law before the 2019 general elections had raised hopes of the youth, but it was surprising major political parties were charging exorbitant prices for nomination forms.\nHe added, “We note that this is a huge disservice to teeming young Nigerians and women who nurse the ambition to run for elective office in next year’s general elections.\n“We welcome the concessions made by some political parties to women, youth, and PWDs and call for a further downward review of the cost of nomination forms to allow for an inclusive process without discrimination against any group or demography of the society.”Copyright PUNCH."
  },
  {
    "headline": "14 civilians killed in eastern DR Congo attack",
    "summarized_story": "Fourteen civilians were killed in an attack on a displaced persons’ camp in Ituri province in the conflict-torn eastern Democratic Republic of Congo, a monitoring group said on Tuesday.\nThe attack occurred on Monday, according to the Kivu Security Tracker, a respected monitor of violence in the region.\nIt added that it suspected militants from an ethnic armed group called CODECO to be behind the attack.\nCODECO – the name for the Cooperative for the Development of the Congo – is a political-religious sect that claims to represent the interests of the Lendu ethnic group.\nIt is considered one of the deadliest militias operating in the east of the country, blamed for a number of ethnic massacres in Ituri."
  },
  {
    "headline": "Kano man to die by hanging for killing five-year-old nephew",
    "summarized_story": "A Kano State High Court presided by Justice Usman Naabba has sentenced a 19-year-old man, Ibrahim Khalil to death by hanging for killing his five-year-old nephew, Ahmad Ado, by sellotaping his nose and mouth.\nIn his judgement, Justice Na’abba, held that the prosecution had proven their case beyond reasonable doubt and consequently, sentenced the convict to 14 years imprisonment for kidnapping.\nNa’abba also sentenced the convict to death by hanging for homicide.\nEarlier, the Prosecution Counsel, Mr Lamido Sorondinki, had informed the court that the convict committed the offence sometime in 2019 at Karkasara Quarters in Kano metropolis.\nThe prosecution presented three witnesses to the court and four exhibits to prove their case against the defendant."
  },
  {
    "headline": "What I’ll do to any girl who hurts my sons – Omoni Oboli",
    "summarized_story": "Nollywood actress, Omoni Oboli, has sent a warning to any girl who would attempt to hurt any of her sons.\nShe added that if any girl attempts to hurt her son, they’d be shocked by her actions.\nOboli noted that though her sons’ girlfriends and wives would enjoy her immensely, she wouldn’t hesitate to show them the lion in her if they hurt her child.\n“My sons’ girlfriends and wives will enjoy me immensely but if you try to hurt my son, my sister in the lord, You will see a LION!\n#NoToDomesticViolence #GenderBasedViolence”The 44-year-old filmmaker and her husband, Nnamdi, are blessed with three sons: Gozi, Chizi, and Tobe Oboli."
  },
  {
    "headline": "Afghan women protest Taliban decree to cover faces",
    "summarized_story": "About a dozen women protested in the Afghan capital on Tuesday against the Taliban’s new edict that females must fully cover their faces and bodies when in public.\nAfghanistan’s supreme leader and Taliban chief Hibatullah Akhundzada issued a mandate over the weekend ordering women to cover up fully, ideally with the traditional all-covering burqa.\nAkhundzada’s decree, which also orders women to “stay at home” if they have no important work outside, has triggered international condemnation.\nSome Afghan women initially pushed back against the curbs, holding small protests where they demanded the right to education and work.\nBut the Taliban soon rounded up the ringleaders, holding them incommunicado while denying that they had been detained."
  },
  {
    "headline": "Abia govt launches investigation into illegal refinery explosion",
    "summarized_story": "By Steve OkoAbia State Government has set up a team of investigators to unravel the cause(s) of the explosion that occurred at an illegal oil refinery, located at Uzuaku Community, in Ukwa West Local Government Area of the state.\nSpeaking with Vanguard yesterday, Commissioner for Petroleum and Solid Minerals, Eze Samuel Nwanganga, said the investigative team would be visiting the community today.\nHe also said that security had been beefed up around the community.\nThe fire incident is coming barely two weeks after a deadly explosion at another illegal refinery claimed over 100 lives in Ohaji Egbema, Imo State.\nPolice Public Relations Officer, PPRO, in charge of Abia State, Mr Geoffrey Ogbonna, told Vanguard yesterday that the incident was yet to be reported to the Command."
  },
  {
    "headline": "Breaking: We didn’t buy presidential form for Jonathan – Northern Group",
    "summarized_story": "….Says reports that we bought forms for Jonathan mischievousBy Nwafor SundayCoalition of Northern Groups, CNG, has said it didn’t buy All Progressives Congress,APC, presidential nomination form for former President Goodluck Jonathan as being insinuated.\nYesterday a certain Fulani group purchased the 100 million naira presidential form for Jonathanto be part of the 2023 Presidential election.\nAs the news filtered, some news media not Vanguard, reported accused Northern Group, CNG, of buying the form for Jonathan.\n“We are particularly worried that the report which purportedly suggests that CNG has purchased the presidential nomination forms for former President Goodluck Jonathan was broadcast by such reputable outlets.\n“For a very long time, CNG has come to be properly addressed as “The Coalition of Northern Groups ” and no longer “A Coalition of Northern Groups ” as featured in the trending report."
  },
  {
    "headline": "18 political parties want 37-day extension of INEC’s primary election deadline",
    "summarized_story": "Omeiza Ajayi, AbujaNigeria’s 18 registered political parties under the aegis of Inter-Party Advisory Council IPAC have appealed to the Independent National Electoral Commission INEC to tinker with its electoral timelines and shift the June 3 deadline for the conduct of primary elections by the parties.\nThe parties are asking the electoral umpire to shift the deadline by 37 days.\nIPAC National Chairman, Engr.\nSani Yabagi made the appeal on Tuesday in Abuja at the INEC’s interactive session with political parties.\nDetails later…"
  },
  {
    "headline": "Meet with Matt Dean from Aston University In Lagos and Abuja",
    "summarized_story": "Meet with Matt Dean, Director of International Recruitment at Aston University in Abuja and Lagos on the 12th and 13th May 2022.\nWe prepare students for a successful career through practical teaching and work experience.\nBelow are some of our credentials:Aston was awarded UK University of the Year 2020 (Guardian Ranking, 2020).\nBefore the final year of a bachelor’s course, Aston offers a placement year when students can gain work experience in the UK or abroad.\nAt master’s level, students have the opportunity to gain work experience in the UK for up to 12 months with a Tier 4 visa sponsored by the University."
  },
  {
    "headline": "Nnamdi Kanu to appear in court next week Wednesday – Lawyer",
    "summarized_story": "Nnamdi Kanu, IPOB leaderBy Chinonso AlozieOwerri- The lead Counsel to the Indigenous People of Biafra, IPOB, Ifeanyi Ejiofor, on Tuesday said the next court outing of the detained IPOB leader, Nnamdi Kanu, will be on 18 May, 2022 at the Federal High Court in Abuja.\nEjiofor disclosed this to newsmen in Owerri, after the IPOB legal team had visited the IPOB leader, at the Department of State Services, DSS, in Abuja, last Monday.\nAccording to the IPOB legal team, “By the subsisting Court-Order, we visited our Client – Onyendu Mazi Nnamdi Kanu.\nMay we remind UmuChineke, that your prayers are most compelling now, such devotion is not taken for granted.\nThe next Court date is the 18th of May, 2022, keep it in your prayers and your mind,” Ejiofor said."
  },
  {
    "headline": "Senate mourns Arthur Nzeribe, observes one-minute silence",
    "summarized_story": "The Senate, on Tuesday, observed a minute silence to mourn the demise of Senator Arthur Nzeribe.\nThe first republic politician and former lawmaker, who represented Imo West Senatorial District, died on Sunday at the age of 83.\nHe noted that the late Nzeribe was an astute politician and philanthropist who was loved by his people in Oguta and beyond.\nThe lawmaker urged the Senate to push for the immortalization of the deceased in the Federal Capital Territory.\nIn his remarks, the Senate President, Ahmad Lawan, urged young politicians to emulate the life of service of the deceased politician."
  },
  {
    "headline": "Again, Stella Oduah’s arraignment over alleged N7.9bn fraud stalls",
    "summarized_story": "For the sixth time, the planned arraignment of former Minister of Aviation, Senator Stella Adaeze Oduah on N7.9 billion money laundering charges stalled at the Federal High Court in Abuja on Tuesday.\nJustice Ekwo subsequently fixed October 12 and 13 for the plea of the defendants to be taken and for trial.\nSenator Oduah’s planned arraignment had before now, been stalled five times due to her initial persistent absence in court.\nOther defendants are Gloria Odita, Nwosu Emmanuel Nnamdi, Chukwuma Irene Chinyere, Global Offshore, and Marine Limited, Tip Top Global Resources Limited, Crystal Television Limited, Sobora International Limited, and a foreign construction company.\nThey are charged with conspiracy and money laundering, as well as maintaining anonymous bank accounts."
  },
  {
    "headline": "Court discharges HEDA Chairman, Suraju from cyberstalking charges",
    "summarized_story": "The Chairman of the Human and Environmental Development Agenda (HEDA), Mr Olanrewaju Suraju, has been discharged from cyberstalking crime charges brought against him by the Federal Government.\nCounsel to Suraju, Mr Muiz Banire, (SAN), however, asked to court to acquit his client saying that was the natural cause of action following such an application for withdrawal.\nIn a short ruling, Justice Binta Nyako discharged Suraju and also discharged the N7 million bail bond.\nJustice Nyako, however, ordered the prosecution to pay N250,000 to the defendant, whenever the case was going to be refiled.\nSuraju was docked before Justice Nyako on a two-count amended charge bordering on allegedly cyberstalking former Attorney General of the Federation, Mr Mohammed Adoke."
  },
  {
    "headline": "Nigeria’s insecurity: Robert Clarke asks Buhari to extend tenure after advocating military takeover",
    "summarized_story": "Elder statesman, Robert Clarke wants tenure elongation for Nigeria’s President Muhammadu Buhari.\nClarke said this would enable him to tackle the lingering insecurity before the 2023 general elections.\nClarke said the belief that the President cannot stay in office for more than eight years was erroneous.\nDAILY POST recalls that in May 2021, the senior citizen asked the military to take over the Federal Government.\nThe military vowed to remain “apolitical, subordinate to the civil authority, firmly loyal to the Commander-in-Chief, President Buhari and the constitution”."
  },
  {
    "headline": "Nnamdi Kanu to appear in court next week Wednesday, can’t reveal certain secrets – Lawyer",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, will, on next week Wednesday appear at the Federal High Court in Abuja.\nIfeanyi Ejiofor, the secessionist’s lawyer disclosed this after a routine meeting between Kanu and his legal team at the headquarters of the Department of State Services, DSS, in Abuja on Monday.\nIn a Facebook post, Ejiofor disclosed that details of the legal team’s engagement with Kanu could not be made public because some enemies may use it against him.\nAccording to Ejiofor: “Onyendu is very firm in his conviction and unshaken in his resolve for a better tomorrow for UmuChineke.\n“The next Court date is the 18th of May, 2022, keep it in your prayers and your mind.”"
  },
  {
    "headline": "14 Cross River APC Gov aspirants accept Otu as consensus candidate",
    "summarized_story": "Fourteen of the All Progressives Congress (APC) governorship aspirants in Cross River State have reportedly accepted Senator Bassey Otu as the consensus candidate of the party.\nAyade was said to have begged the stakeholders to unite and present a consensus aspirant from the South.\nThe Governor reportedly picked Otu, stating acceptability and popularity were responsible for the choice.\nBut two aspirants, Senator John Owan-Enoh and Chief Chris Agara, from the central senatorial district, refused the consensus arrangement instantly.\nWhen contacted, Cross River APC chairman, Alphonsus Eba, said he was in another meeting and will call back."
  },
  {
    "headline": "BREAKING: Parties urge INEC to alter 2023 poll timetable",
    "summarized_story": "Political parties have urged the National Independent National Electoral Commission (INEC) to alter the timetable for the 2023 elections to allow for robust participation.\nThey particularly demanded that the deadline for the conduct of party primaries be extended by two months.\nINEC, in line with the new Electoral Act, fixed the deadline for the conduct of primaries by political parties for June 3.\nDetails Shortly…."
  },
  {
    "headline": "We didn't purchase APC presidential form for Jonathan",
    "summarized_story": "Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) has denied media reports it obtained the All Progressives Congress(APC) presidential form for former President Goodluck Jonathan.\nIt said it did not and will not buy any form for any candidate contesting the 2023 general elections.\nHe said: “The attention of MACBAN has been drawn to a trending story in which we are being quoted as having bought a presidential nomination form for former President Goodluck Jonathan for the 2023 elections.\n“We wish to make it clear that MACBAN did not and will not buy any form for any Candidate contesting elections.\n“We call on the media to take their time to understand the difference between the various fulbe organisations and avoid dragging us into political mud”."
  },
  {
    "headline": "Jonathan: I didn’t authorise group to obtain APC form",
    "summarized_story": "He said he did not authorise any group to purchase the form for him.\n“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorize it.\nThe group, led by one Ibrahim Abdullahi, claimed that it had picked the form for the former president.\nHe added: “No one will give out N100 million to buy a presidential form from a party he’s not a member of.\nSpeaking with reporters after collecting the nomination forms for the Senate President, Nkire said the Lawan’s antecedents qualified him for the prime job."
  },
  {
    "headline": "Politicians offer us nothing being in office",
    "summarized_story": "Politicians offer us nothing being in office – Mr MacaroniPopular skit maker Adebowale Adedayo aka Mr Macaroni has stated no politician offers Nigerians anything by being in office.\nMr Macaroni has been advocating for good governance through his skits and pronouncements lately.\nThe 29-year-old comedian tweeted on Tuesday: “No politician is doing the Citizens a favor by being in office.\nThe concept of leadership is service, selflessness and sacrifice.\nThe people must unite and stop fighting themselves.”"
  },
  {
    "headline": "2023 presidency: Lawan’s entry causes jitters in South",
    "summarized_story": "His entry into the already crowded race has sent jitters into the camps of aspirants from the Southern part of the country.\nOur source said his background and acceptability among the Northern elite is a major headache to the array of aspirants in the South.\nThe development has confirmed The Sun’s report that Southern presidential aspirants on the platform of the APC were in a dilemma over the increasing number of opponents from the North.\nDaily Sun had also reported that many stakeholders from the South were particularly worried because of reports that Northern aspirants were being encouraged to join the race by President Buhari.\nBefore now, all the APC presidential aspirants, apart from the Kogi State Governor, Yahaya Bello were from the South."
  },
  {
    "headline": "…Kalu withdraws from race, lauds Senate President, opts for Senate",
    "summarized_story": "He had consistently said that for equity and justice, the two zones that should be given preference in the 2023 presidential race were South East and North East, which have not produced the President.\nHe said he would only contest for the post if the All Progressives Congress (APC) zoned the ticket to South East.\nI am most glad because he is from the North East, the only zone alongside South East that is yet to produce President of Nigeria.\nThis is because it would be the closest to the equity, fairness and Justice everyone is talking about.\nIt further means that the justice is on its way to the South East."
  },
  {
    "headline": "PDP NWC holds crucial meeting today as Saraki records breakthrough among delegates",
    "summarized_story": "The Peoples Democratic Party (PDP) National Working Committee (NWC) will today take a final decision as to whether to zone its presidential ticket or not.\nThis is coming at a time when former Senate President, Bukola Saraki, is recording breakthrough among PDP delegates in North Central, North West and South West, as he prepares to embark on South East tour.\nAlso, in South West, delegates have shown preference for the former Senate President owing to his ancestry and marriage in a famous Yoruba family.\nMeanwhile, there is strong lobbying over the composition of the convention committee that will conduct the PDP presidential primary.\nThere are indications, however, that the PDP may pick the chairman of the convention committee from South West."
  },
  {
    "headline": "2023: Court rejects CBN gov’s request to stop INEC, AGF from disqualifying him",
    "summarized_story": "The CBN governor also prayed Justice Ahmed Mohammed to stop INEC from taking any action against him in the bid to contest in the presidential primary by virtue of his office.\nWhile INEC is the 1st defendant, the AGF is the 2nd defendant in the suit.\nHe desires to run for the office of president of Nigeria in the election coming up in 2023.\nIf he can run, when must he leave office as CBN governor?\nAccording to him, the matter is currently on appeal and the Court of Appeal has not come up with a decision."
  },
  {
    "headline": "Fulani group picks APC nomination forms for Jonathan",
    "summarized_story": "From Romanus Ugwu, AbujaNomadic pastoralists and the Almajari communities under the aegis of Miyetti Allah, yesterday, picked APC N100 million expression of interest and nomination forms for former president, Dr. Goodluck Jonathan to contest ticket for the 2023 presidential election.\nLed by the leader of the group, Alhaji Abdullahi Ibrahim, they had arrived the International Conference Centre around 6.35pm and presented the draft of the payment for the forms.\nThe nomadic pastoralists and the Almajari communities who have decided to purchase this form for our former president, Dr Goodluck Ebele Jonathan, to come back and rule this country and continue with the good work he has started.\nIt was the dream and vision of President Goodluck Jonathan that if that programme had continued it would one day produce from the Almajiri system of education doctors and engineers.\nOther parts of the community (the vulnerable community) that Goodluck Jonathan wanted to really give a sense of belonging was the Fulani community, the nomadic pastoralist."
  },
  {
    "headline": "2023: Jonathan Meets Adamu, Hours After Group Purchased Forms on His Behalf",
    "summarized_story": "The meeting, THISDAY gathered, took place few hours after a Fulani group, under the aegis of the Nomadic Pastoralists and the Almajiri Communities, purchased the ruling party’s nomination and expression of interest forms, sold for N100 million, for Jonathan.\nThe meeting between Jonathan and Adamu held at a secret location in Abuja and lasted about an hour, specifically between 9pm and 10 pm.\nThe statement read, “It has come to the notice of His Excellency Dr. Goodluck Ebele Jonathan, that a group has purportedly purchased Presidential Nomination and Expression of Interest forms, of the APC in his name.\n“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorise it.\nOthers are: Governor Yahaya Bello of Kogi State; Ebonyi State governor, Dave Umahi; former Imo State governor, Senator Rochas Okorocha; Minister of State, Education, Hon."
  },
  {
    "headline": "Presidential Poll: Court Summons INEC, AGF over Emefiele’s Participation",
    "summarized_story": "Emefiele had amongst others, approached the Federal High Court for an order restraining the defendants from preventing or hindering his participating in the process of the presidential election slated for February next year.\nHe submitted that constitutional provisions stipulated that he can only resign his appointment as Governor of CBN 30 days to the presidential election which he is interested in contesting.\nArguing the motion for maintenance of status quo, Emefiele’s lawyer, Chief Mike Ozekhome, SAN, told the court that Emefiele “is in a dilemma” as to whether he can run in the forthcoming presidential election.\nFHC/ ABJ/ CS/610/2022, the plaintiff sought the interpretation of certain parts of the constitution that has to do with his aspiration of contesting the 2023 presidential election.\nHe sought another declaration that he can validly participate in the congresses of any political party of his choice as well as vote and be voted for."
  },
  {
    "headline": "Dasuki Formally Hands over Finance Ministry, Extols Tambuwal for Getting World Bank’s $55m Grant for Sokoto",
    "summarized_story": "Former Sokoto State Commissioner for Finance, Hon.\nDasuki who took over the affairs of the Ministry in 2019, had earlier tendered his resignation in March in compliance with the Electoral Act.\nHe recently returned from a foreign trip to formally hand over to the permanent secretary.\nHe said with the reforms initiated and executed, the Finance Ministry was adequately prepared to continue to lead the way in the development agenda of the state government.\nDasuki said those reforms boosted the state’s cash inflow and paved way for the provision of developmental projects across Sokoto."
  },
  {
    "headline": "Fulani Group Picks APC Presidential Nomination Forms for Jonathan",
    "summarized_story": "Adedayo AkinwaleA Fulani group has picked All Progressives Congress expression of interest and nomination forms for former President Goodluck Jonathan.\nJonathan who was elected President on the platform of the Peoples Democratic Party was defeated by President Muhammadu Buhari in 2015.\nThere had been speculations that the former president was considering taking another shot at the presidency but on the plaform of APC, the party which sent him out of Aso Rock seven years ago.\nSee photos of members of the group at the International Conference Centre Abuja, where they picked the forms for JonathanShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Kalu Withdraws from Presidential Race",
    "summarized_story": "Sunday AborisadeThe Chief Whip of the Senate, Orji Uzor Kalu, on Monday, formally withdrew from the race to succeed President Muhammadu Buhari next year.\nKalu, in a statement personally signed by him in Abuja, however declared his support for the candidature of the Senate President, Ahmad Lawan, for the top job.\nThe Senate President had on Monday, received the N100 million All Progressives Congress’ (APC) presidential forms purchased for him by the National Stability Project led by Chief Sam Nkire, who is the chairman of the movement.\n“In the absence of a South-easterner being president of Nigeria in 2023, I have my full support for a North-easterner.\nThis is because it would be the closest to the equity, fairness and justice everyone is talking about."
  },
  {
    "headline": "BREAKING: Former Nigerian President, Goodluck Jonathan, Involved In Auto Crash, Two Aides Dead",
    "summarized_story": "Former Nigerian President, Goodluck Jonathan, was on Wednesday involved in a fatal auto crash that killed two of his aides, a report by People's Gazzate said.\nJonathan was returning from the Nnamdi Azikiwe International Airport in Abuja when the accident happened.\nGoodluck JonathanThe former President is said to have escaped unhurt."
  },
  {
    "headline": "BREAKING: Former Nigerian President, Goodluck Jonathan, Involved In Auto Crash, Two Aides Dead",
    "summarized_story": "Former Nigerian President, Goodluck Jonathan, was on Wednesday involved in a fatal auto crash that killed two of his aides, a report by People's Gazzate said.\nJonathan was returning from the Nnamdi Azikiwe International Airport in Abuja when the accident happened.\nGoodluck JonathanThe former President is said to have escaped unhurt."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "Senate passes bill to allow statutory delegates vote at party congresses, conventions",
    "summarized_story": "The senate has passed a bill seeking to enable statutory delegates to vote at the congresses or conventions of political parties.\nThe upper legislative chamber passed the bill for third reading after Ovie Omo-Agege, deputy senate president and its sponsor, led a debate on it.\nAdvertisementThe deputy senate president said the error on the part of the national assembly was not “intended”.\n“Section 84 (8) provides for the participation of elected delegates in the conventions, congresses or meetings of political parties held to nominate candidates.\n“The electoral act has a deficiency that was never intended and that deficiency will deny all statutory delegates in all political parties from participating in congresses and conventions,” Lawan said."
  },
  {
    "headline": "Senate passes bill to allow statutory delegates vote at party congresses, conventions",
    "summarized_story": "The senate has passed a bill seeking to enable statutory delegates to vote at the congresses or conventions of political parties.\nThe upper legislative chamber passed the bill for third reading after Ovie Omo-Agege, deputy senate president and its sponsor, led a debate on it.\nAdvertisementThe deputy senate president said the error on the part of the national assembly was not “intended”.\n“Section 84 (8) provides for the participation of elected delegates in the conventions, congresses or meetings of political parties held to nominate candidates.\n“The electoral act has a deficiency that was never intended and that deficiency will deny all statutory delegates in all political parties from participating in congresses and conventions,” Lawan said."
  },
  {
    "headline": "Report: Nigerian billionaire building US biggest consulate in Nigeria is an ex-convict",
    "summarized_story": "The United States government has been accused of going into business with Gilbert Chagoury, Nigerian-Lebanese developer and funder of Eko Atlantic, despite his criminal records.\nBorn in Nigeria to Lebanese immigrants, Chagoury co-founded the Chagoury Group in Lagos in 1971.\nThe Eko Atlantic project, which started in 2008, is a real estate project that features residential and commercial properties.\nIn May 2019, the US mission in Nigeria announced that it had purchased about 50,000 square meters of land at Eko Atlantic city to build its new consulate.\nAdvertisementBetween 2012 and 2016, Chagoury reportedly sought to help fund election campaigns of US politicians believed to be “supportive to his cause” — the protection of Christians in the Middle East."
  },
  {
    "headline": "Report: Nigerian billionaire building US biggest consulate in Nigeria is an ex-convict",
    "summarized_story": "The United States government has been accused of going into business with Gilbert Chagoury, Nigerian-Lebanese developer and funder of Eko Atlantic, despite his criminal records.\nBorn in Nigeria to Lebanese immigrants, Chagoury co-founded the Chagoury Group in Lagos in 1971.\nThe Eko Atlantic project, which started in 2008, is a real estate project that features residential and commercial properties.\nIn May 2019, the US mission in Nigeria announced that it had purchased about 50,000 square meters of land at Eko Atlantic city to build its new consulate.\nAdvertisementBetween 2012 and 2016, Chagoury reportedly sought to help fund election campaigns of US politicians believed to be “supportive to his cause” — the protection of Christians in the Middle East."
  },
  {
    "headline": "Airline operators to get aviation fuel for three months at N480 per litre",
    "summarized_story": "The Nigeria National Petroleum Corporation (NNPC) Limited, Central Bank of Nigeria (CBN) and airline operators have agreed to provide six million litres of aviation fuel at N480 a litre for three months.\nOn Friday, the Airline Operators of Nigeria (AON) announced plans to shut down operations from Monday over the high cost of aviation fuel.\nThe group complained that aviation fuel, also known as Jet A1, has reached an all-time high of N700 per litre.\nWhile appreciating all the stakeholders for the efforts put in at resolving the issue at stake, he thanked the airline operators for being nationalistic in calling off the strike.\nAdvertisementSpeaking at the meeting, Allen Onyema, vice-president of AON, said the scarcity can be addressed if airliners are allowed to purchase aviation fuel directly."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "How Saze Ibraheem found satisfaction in marketing",
    "summarized_story": "Share this article:“I’m fortunate to really enjoy what I do for work, and want to have more of an impact on the people I work with.” — Saze Ibraheem, Head of Marketing, ART X Collective.\nSaze Ibraheem, who moderated the panel session with three other Twitter executives, was consulting for Techpoint Africa.\nChatting with Saze Ibraheem at her home in LagosI can say that the event has played a part in shaping the Nigerian narrative.\nWhere it all startedSaze Ibraheem, Head of Marketing, ART X Collective“I’m so bullish on Lagos; it really has my heart.\nUp the ladder and still goingSaze Ibraheem, Head of Marketing, ART X CollectiveSaze usually prefers to help businesses turbo-charge their ideas, but she hasn’t always been a fan of entrepreneurship."
  },
  {
    "headline": "Adaverse and EMURGO encourage founders to build solutions on the Cardano blockchain",
    "summarized_story": "EMURGO is the official commercial arm governing investment operations of the Cardano blockchain, which is regarded as one of the top platforms for building tech solutions in the blockchain space.\nDiscussing the good, he said that the absence of regulation in the blockchain space gives people the opportunities to experiment.\nThe settlement layer and the combination layer are the layers present in the Cardano blockchain.\nThe goal of the collaborations is to increase the Cardano blockchain usage and encourage founders to build solutions that will be hosted on the blockchain.\nFounders and developers are encouraged to build their solutions on the Cardano blockchain."
  },
  {
    "headline": "Meta hasn’t come to play",
    "summarized_story": "And that’s one reason we have the Techpoint Africa Podcast.\nMeanwhile, Meta CEO, Mark Zuckerberg, stated that similar functionality would be added to Facebook soon and possibly to other Meta apps in the future.\nPerhaps unsurprisingly, Facebook says it will continue to collect users’ location data for other experiences to personalise and improve its products and recommend ads to you.\nTechpoint Africa will host entrepreneurs and startup enthusiasts at Techpoint Pitch Friday on Friday, May 13, 2022, by 5 p.m at 43b Emina Crescent, Opebi, Allen, Ikeja.\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "IvoryPay to Launch Crypto Payment Gateway for Online Businesses in Emerging Markets",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Trade, commerce, and the entire system of value exchange are no longer confined to the geographical boundaries of one country.\nWith IvoryPay, businesses in emerging markets will be able to reduce the cost of transacting, increase transaction processing and payment confirmation speed, and accept payments in stable currencies.\nThe IvoryPay ecosystem comprises three components which include the Ivorypay payment gateway solution, the NFT Storefront, and the IVRY token.\nThe payment gateway infrastructure helps online businesses easily accept payment in stablecoins and the IVRY token, offering customers the option to make payments using the most convenient means.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "ARM Labs partners Techstars to support, deepen fintech development in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo kickstart the programme, the firm recently launched ARM Labs Techstars Accelerator programme in Lagos.\nChief Executive Officer, ARM, Jumoke Ogundare, said: “Over the years, ARM has been on a mission to support African fintech startups that are solving key problems in innovative ways.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Five things to know to start your Tuesday",
    "summarized_story": "Five things to know to start your TuesdayMarket gains over N520bn amid bullish start to new weekThe Nigerian Exchange Limited (NGX) All-Share Index (ASI) and market capitalisation increased remarkably by 1.90 percent or N521billion on Monday May 9, from week-open lows of 50,935.03 points and N27.460 trillion respectively to 51,903.44 points and N27.981trillion.\nThe bullish start to stocks trading in this new week pushed this year’s record positive return to new high of 21.51percent.\n“Specifically, opportunities for capital repatriation on large-cap stocks that have dual listing (Airtel Africa and Seplat) could drive buying activities.\nA situation that forced the company to remove the country’s debt status from the “overweight” category.\n“It will then enrich the output to produce 4 million tonnes of high-grade ore with more than 60 percent iron content,” he added."
  },
  {
    "headline": "EXPLAINER: What you will get from revised pension regulation",
    "summarized_story": "The recently released revised regulation on retirement and terminal benefits by the National Pension Commission (PenCom) for contributors and retirees has strengthened the responsibility of Pension Fund Administrators (PFAs) towards their clients, as well as enhanced protection for Retirement Savings Account (RSA) holders.\nThe following are the issues that have been addressed in the revised regulation:Documentation processWhile the old regulation outlined the documents required for retirees to access benefits, the revised regulation has simplified the documentation process.\nHowever, the revised regulation provides that where the employer fails/refuses to accept the resignation letter from the employee.\nRead also: Pension sector set for transformation on new capitalRSA consolidation before payment of benefitsThe revised regulation has also clarified that the RSA must be consolidated before retirement benefits can be accessed.\nAccrued pension benefits for private sector contributorsFurthermore, the revised regulation has made provision for the administration of Pre-Act Benefits, which are the accrued pension benefits of contributors mainly in the private sector in line with the employer’s trust deed prior to the commencement of the CPS in June 2004."
  },
  {
    "headline": "Biggest cement producers grow Q1 revenue to N600bn",
    "summarized_story": "The data showed that Dangote Cement recorded the highest revenue of N413.18 billion, followed by BUA Cement (N96.99 billion), and Lafarge Africa (N90.61 billion).\nDangote Cement, the country’s biggest cement producer, saw its revenue rise by 24.2 percent in Q1 2022 from N332.65 billion in the same period of last year.\nDomestic sales increased by 34 percent to N321.9 billion in Q1 2022 from N239.7 billion in 2021.\nIts production cost of sales increased by 20 percent from N128 billion in Q1 2021 to N154 billion in Q1 2022.\nBUA Cement grew its revenue by 58.5 percent to N96.99 billion in Q1 2022 from N61.19 billion in the same period last year."
  },
  {
    "headline": "Fulani group buys N100m APC presidential forms for Jonathan",
    "summarized_story": "A group known as the Association of Fulani-Almajir Monday night obtained the N100 million All Progressives Congress (APC) presidential forms for former President Goodluck Jonathan.\nIt was the dream and the vision of President Goodluck Jonathan that if that programme had continued it would one day produce from the almajiri system of education; doctors, engineers.\nGoodluck Jonathan is for all Nigeria.\nIf you are talking about Goodluck Jonathan, I don’t think there is any aspirant so far that we have seen that can be compared in any way with Goodluck Ebele Jonathan.\nYou see I am a Fulani man, coming from the far north but I tell there is no Nigerian today that I can cast my vote for, campaign vote except Jonathan."
  },
  {
    "headline": "WHO prequalification: A leading strategy for strengthening pharmaceutical manufacturing in Africa",
    "summarized_story": "Unfortunately, Africa lags behind as only South Africa, Morocco and Uganda have prequalified pharmaceutical manufacturing companies with the right to take part in international tenders for medicines and sell their pharmaceutical products to other countries across the globe.\nBenefits of WHO prequalification for pharmaceutical manufacturing companiesThe attainment of WHO PQ by pharmaceutical manufacturers in Africa holds several benefits for the companies, individual countries, and Africa as a whole.\nBarriers to achieving WHO prequalification in AfricaA major barrier to achieving WHO PQ in Africa is the high upfront cost.\nInvestment from government and foreign donors is needed to reduce the financial burden of WHO PQ on pharmaceutical companies.\nThis project will achieve the first ever WHO PQ of pharmaceutical companies in Nigeria."
  },
  {
    "headline": "Over 250 participants for 4th Templars, Patrelli Cricket Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOver 250 participants are expected to feature in the fourth edition of the Templars and Patrelli Secondary School Cricket Competition in Benin.\nTemplars and Patrelli are both law firms located in Lagos, but will individually organize the male and female categories of the event respectively.\nThe Templars tournament will see 11 secondary schools participate in the male event while Patrelli competition, which is focused on promoting and providing equal participation and opportunities for girls in sport, will have eight schools featuring.\nOthers are Odion Isesele, David Abiebhode, Asia Joshua, Selim Salau, Reigneth Osagie among others —who are part of the Edo State Under17 squad.\nThis program is a key aspect of the Templars and Patrelli corporate sustainability and responsibility strategy which focuses on youth empowerment through sports as well as support the youth development initiative of the Edo state government."
  },
  {
    "headline": "PWDs receives training on liquid soap, perfume production, others in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – No fewer than 40 persons living with disabilities in Edo State has benefited from a 2–Day skill acquisition program put together by Network for the Advancement of Persons Living With Visible Disabilities (NAPVID).\nThe training program held between Friday 6th and 7th Saturday May in Benin city is part of the network’s ‘Project HELP’ initiative to empower special persons drawn from across Edo state.\nThe participants were trained in liquid soap, perfume, air freshener, detergent, vaseline and air cream production.\nAccording to the organisers, the training was geared towards empowering persons with disabilities to be self reliant as current economic realities showed paid employment can not sustain households demands.\nA beneficiary, Ucheaga Grace expressed gratitude to the organisers, saying “the training is very educative and encouraging to us”."
  },
  {
    "headline": "Edo charges MSMEs to take advantage of grants to grow their businesses – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged small businesses in the state to take advantage of grants under the Edo-Cares programme, so as to grow their businesses and contribute to the state’s economic development.\nShe noted that the Edo-Cares grant, an emergency state-level intervention programme, is designed to support micro and small enterprises in Edo State affected by the economic crisis caused by the Covid-19 pandemic.\nShe urged business owners to take advantage of the opportunity, noting that the Edo-CARES grant offers businesses the opportunity to build their businesses, pay off business debts, enhance their working environment as well as scale up employment rate in the state.\n“Entrepreneurs in Edo state are encouraged to apply for this opportunity via the website, https://cares.plax.ng/edo.\nInterested business owners can also visit any of Edo Job Centres across the state,” she said."
  },
  {
    "headline": "Okomu Did Not Block Community Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOkomu oil Palm Company Did Not Block the Road leading to the Community but dug a trench round its plantation to forestall theft of over ten tons of Banga daily.\nAccording to him, it was a peaceful protest to alert the management of the company that the trench blocked their road to the primary and secondary school, Catholic Church and other villages.\n“We have made several appeals to the government to assist us with electricity, roads, health centers and a secondary school” he added.\nThe DPO advised the protesting community to remain calm and go about their duties as law abiding citizens until the issues are resolved.\nThe Nigerian Observer gathered that the Enogie of Udo has also setup machineries in motion to resolve the issues at stake which he described as a breakdown in communication between the community and Okomu Oil Palm Company."
  },
  {
    "headline": "2023: Uzodinma asks APC, PDP to zone presidential ticket to Southeast",
    "summarized_story": "Governor of Imo State, Senator Hope Uzodinma, has asked both the All Progressives Congress (APC) and the People’s Democratic Party (PDP) to zone their presidential tickets to the Southeast in the interest of equity and justice.\nHe said the Southeast is in a similar state now and many Nigerians know.\nWhat is utmost in the mind of every political party is to win election.\n“The 1999 situation is repeating itself and many Nigerians are in support of the presidency going to the South-East.\nSpeaking on the alleged disunity among five governors of the Southeast, Uzodimma said: “The situation in the South-East is not different from other zones."
  },
  {
    "headline": "Nigeria’s tech startups raised $678m in funds between Jan-April 2022 – Report",
    "summarized_story": "Africa Tech and Fintech report by Renaissance Capital has said that Nigeria’s tech startups raised a total of $678 million from investors in the last four months.\nAccording to the report, Nigeria accounted for 31 per cent of the total funds raised by African tech companies in the four months.\nKenyan tech companies topped the fundraising in the period as they secured a total of $750 million, while Nigeria came second.\nWhile noting that global venture funding is slowing, Renaissance Capital observed that the African tech scene has had a busy first quarter, but was beginning to witness a slowdown in April.\nOn a MoM basis, Nigeria and South Africa each saw their share of YtD funds raised decline by 3 ppts each, while Egypt was unchanged."
  },
  {
    "headline": "Fidelity Bank approves N10.14 billion dividend payment for FY 2021",
    "summarized_story": "Fidelity Bank Plc has approved a dividend of 35 kobo per share totalling N10.14 billion to be paid to its shareholders for the full-year period ended December 2021.\nThis was passed as a resolution at the recently concluded 34th Annual General Meeting held on Thursday, May 5, 2022.\nThe qualification date for the Register of Members will be communicated duly to shareholders, as well as the date of payment.\nThe AGM also passed resolutions recognising the election of Mrs. Morohunke Adenike and Mr. Stanley Chiedoziem Amuchie as Independent Non-Executive Director and Executive Director, respectively and the re-election of Mr. Mustafa Chike-Obi, Alh.\nHenry Obih as Non-Executive Director."
  },
  {
    "headline": "COP15: Amina Mohammed seeks investment in land restoration programmes",
    "summarized_story": "Deputy secretary-general of the United Nations (UN), Amina Mohammed, has asked countries to invest in land restoration policies.\nShe said countries can either reap the benefits of land restoration now or continue with the disastrous path of climate crisis.\nMohammad asked all countries to invest in tackling desertification and land degradation, stressing that land restoration connects with all sustainable development goals (SDGs).\n“Investments in tackling desertification and land degradation are among the most effective we can make.\n“Land restoration connects with every single SDG, with every country, and with every person on the planet."
  },
  {
    "headline": "ACEN Hosts FIDIC Africa 2022 Infrastructure Conference",
    "summarized_story": "The Association for Consulting Engineering in Nigeria (ACEN) has said that all is set for the 28th Annual FIDIC Africa Infrastructure Conference, slated for 15 – 17 May 2022 at the Eko Hotel & Suites, Lagos.\nFIDIC Africa is the Group of African Member Associations of FIDIC, and it represents the interest of the consulting engineering industry in the African region.\nMembership of FIDIC AFRICA region now stands at 18 national member associations in Africa.\n“The Annual FIDIC Africa Conference is one of the biggest networking events for African consulting engineers.\nHe listed the sub-themes to include Global Partnerships with African Consultancies for Infrastructure delivery; Sustainability and maintenance of Infrastructure: Exploring diverse opportunities; Infrastructure Delivery: Best practices towards enhanced sustainable implementation; Infrastructure Development and the Environment: Examining the main issues; The PPP model and infrastructure development in Africa; Infrastructure development and Technology: The potential benefits to Africa’s Economy."
  },
  {
    "headline": "Bamidele Submits Re-election Forms For APC Ekiti Central Senatorial District",
    "summarized_story": "Chairman, Senate Committee on Judiciary Human Rights and Legal Matters, Senator Michael Opeyemi Bamidele on Monday submitted his Expression of Interest and Nomination forms for All Progressive Congress (APC), Ekiti Central Senatorial District for re-election as Senator of the Federal Republic of Nigeria.\nSenator Bamidele in a statement issued by his media Office in Abuja, pledged to attract more dividends of democracy to the people of Ekiti Central if re-elected as Senator of Federal Republic of Nigeria.\nHe also thanked the leadership of APC in Ekiti State and party members for their continuous support towards his re-election.\nThe statement reads, “ Today Senator Michael Opeyemi Bamidele submitted his nomination and expression of interest forms, at the International conference center, Abuja.\n“Bamidele after submitting the nomination and expression of interest form appreciated the leadership of All Progressive Congress (APC) in Ekiti State and members of the party for their continuous support towards his re-election to the Red Chamber in 2023.”"
  },
  {
    "headline": "Saraki Fit To Lead Nigeria –Sambo – Leadership News",
    "summarized_story": "Namadi Sambo, has stated that former president of the Senate, Dr. Abubakar Bukola Saraki, has the capacity and experience needed to lead Nigeria.\n“I remember, when I was governor, he gave special attention to Kaduna State.\nAs the chairman of the Nigeria Governors Forum, sometimes, I felt like his ‘self-appointed deputy’ — even though the forum has no deputy.\nAs the chairman of the Nigeria Governors Forum, he formed the Peer Review Mechanism that allowed consultants to go state-by-state to report the development plans and progress of each state to the Governors Forum.\n“As the Senate President, we all know the success that he brought to this nation."
  },
  {
    "headline": "Saraki Fit To Lead Nigeria –Sambo – Leadership News",
    "summarized_story": "Namadi Sambo, has stated that former president of the Senate, Dr. Abubakar Bukola Saraki, has the capacity and experience needed to lead Nigeria.\n“I remember, when I was governor, he gave special attention to Kaduna State.\nAs the chairman of the Nigeria Governors Forum, sometimes, I felt like his ‘self-appointed deputy’ — even though the forum has no deputy.\nAs the chairman of the Nigeria Governors Forum, he formed the Peer Review Mechanism that allowed consultants to go state-by-state to report the development plans and progress of each state to the Governors Forum.\n“As the Senate President, we all know the success that he brought to this nation."
  },
  {
    "headline": "Enugu 2023 Guber: Journalists Demand Equity, Fairness",
    "summarized_story": "A non-governmental organisation of Journalists in Enugu State, the Nsukka Journalists Foundation (NJF), has warned the ruling Peoples Democratic Party (PDP) in the state against undermining justice, equity and fairness in the selection of their flag bearers in the state.\nThe NJF is particularly concerned at the devious acts going in the name of politics to domicile all political positions in Enugu East in just one area of the senatorial zone.\nThe NJF further noted that there was a deliberate move to bury the Gburuburu Movement of the Governor Ugwuanyi and resurrect the dreaded Ebeano political family that many Enugu State families have traumatising memories of.\n“NJF therefore wants to warn that it would mobilise its people and men and women of goodwill elsewhere in the state in support of its kith and kin suffering oppression in Enugu East.\nNJF would also take copious and profuse interests in the role of political or corporate leaders particularly from Nsukka in the propagation of this injustice against Isi Uzo people."
  },
  {
    "headline": "Prepare for worst fuel scarcity, petrol marketers alert Nigerians",
    "summarized_story": "By Muhammad Nur TijaniThe Independent Petroleum Marketers Association of Nigeria said the scarcity surfacing in Abuja is just the tip of the iceberg as Nigerians must prepare for the worst fuel crisis.\nThe IPMAN chairman in Kano State, Bashir Danmalam, made the remarks while addressing a news conference in Kano State on Monday.\nBridging claims is the cost of hauling petroleum products from refineries and depots to fuel stations.\n“The non-payment of the debt for over eight months has crippled the businesses of many members as they cannot transport available petroleum products.\nDanmalam called on the Federal Government to intervene before the situation degenerated into a serious fuel crisis that spread to other parts of the country."
  },
  {
    "headline": "Court orders University of Ibadan to pay N200,000 to Aderemi Ojo",
    "summarized_story": "By Olawale AkinremiA Federal High Court, Ibadan, has ordered the University of Ibadan (UI) to pay N200,000 to Mr Aderemi Ojo, a former students union leader, for failing to open its defence in the ongoing case.\nThe judge noted that the matter had suffered unnecessary setbacks at the instance of the defendant, adding that justice delayed was justice denied.\n“However, the respondent must pay a cost of N200,000 to the plaintiff for wasting the time and resources of the plaintiff,” Agomoh said.\nEarlier, Adeosun had urged the court to foreclose the defendant from calling witnesses.\nHe told the court to order U I to pay a cost of N500,000 to his client if the court would not foreclose the case."
  },
  {
    "headline": "Yobe: Five die, 41 others injured as violent windstorm wreaks havoc in",
    "summarized_story": "Five persons have been confirmed dead and 41 others injured following a violent windstorm accompanied by a heavy downpour in Damaturu, the Yobe State capital.\nDr Mohammed Goje, the Executive Secretary of Yobe State Emergency Management Agency (SEMA) gave the confirmation in a post via his personal Facebook page.\nHe said the search and rescue team of SEMA on 9th May 2022 responded to distress calls by good Samaritans and supported the evacuation of victims to Yobe State Specialist Hospital.\n“All victims are receiving medical treatment free and already 23 were discharged”, he posted.\nChecks by DAILY POST showed that residents of Damaturu are counting their losses following yesterday’s late evening sandstorm and heavy rainfall in the metropolis."
  },
  {
    "headline": "BREAKING: Stella Oduah arrives court for arraignment on N7.9bn corruption charges",
    "summarized_story": "A former Minister of Aviation, Mrs Stella Adaeze Oduah has arrived the Federal High Court in Abuja to take her plea in the alleged N7.9 billion fraud charges brought against her by the Federal Government.\nShe is to be arraigned before Justice Inyang Eden Ekwo, alongside two other women and four companies.\nAlready, the Federal Government’s lawyer, Dr Hassan Liman, SAN, has also arrived in court.\nAbout five Senior Advocates of Nigeria are also in court to defend the Senator and her co-defendants.\nOther defendants are Gloria Odita, Nwosu Emmanuel Nnamdi, Chukwuma Irene Chinyere, Global Offshore, and Marine Limited, Tip Top Global Resources Limited, Crystal Television Limited, Sobora International Limited, and a foreign construction company."
  },
  {
    "headline": "‘Fraudsters, drug dealers’ – Full list of 162 convicts pardoned with Dariye, Nyame",
    "summarized_story": "A copy of the 162 convicts recommended for pardon by the Presidential Advisory Committee on Prerogative Of Mercy has emerged.\nOn the list obtained by our reporters are scores of people convicted for fraud, money laundering, drug trafficking, forgery and stealing.\nFormer coup plotters made the clemency list as well as some military officers who were dismissed for mutiny.\nIn all, 26 inmates, 85 surviving ex-convicts and one deceased ex-convict were recommended for presidential pardon.\nFor presidential clemency, 27 inmates were on the list, as well as 13 others whose terms of imprisonment were to be reduced."
  },
  {
    "headline": "Everyone Free To Run But They Can’t All Become President – Ex-Lagos Governor, Tinubu",
    "summarized_story": "Everyone Free To Run But They Can’t All Become President – Ex-Lagos Governor, TinubuFormer Lagos State governor and presidential aspirant of the All Progressives Congress (APC), Bola Tinubu, has said that anybody was free to come out to aspire to become president, but not everyone could become the president.\nAccording to the News Agency of Nigeria, Tinubu speaking in Katsina State on Monday, said his ambition to become Nigeria’s president was to offer “hope, prosperity and unity for Nigerians.”“Anybody that wants; he can run, but not everybody can become the president,” the APC chieftain remarked.\nThe APC presidential hopeful added that he would develop a new strategy and commit enough resources to fight bandits and other criminal elements if voted as president.\n“I come to unite Nigeria and not to divide it; I come to bring you hope, prosperity, happiness, job and stability.\nResponding, Governor Aminu Masari of Katsina expressed the belief and confidence that Nigeria would certainly overcome the challenges confronting it soon."
  },
  {
    "headline": "As Fulani/Almajiri group picks presidential forms for Jonathan: Lawan joins Badaru, Yerima to boost North’s candidacy in APC primaries",
    "summarized_story": "“It was the dream and the vision of President Jonathan to produce doctors, lawyers and Engineers from Almajarai, but unfortunately that laudable vision was abandoned once he left office.\nPledging his support for the vice president, Speaker of the Niger State House of Assembly, Abdullahi Wuse, said the vice president had the best of the capacity to lead as from 2023.\n“Few people have the intellectual capacity, the capabilities that you are exhibiting as the vice president of this country.\n“You love this country, and we are sure by the time the vice president takes over from President Buhari, you will start where he ends.\nBy the special grace of God, the vice president will take over the ticket of the APC,” Abdullahi said."
  },
  {
    "headline": "NNPC’s non remittance to federation account: JPMorgan delists Nigeria from emerging market sovereign list ￼",
    "summarized_story": "JPMorgan has removed Nigeria from its list of emerging market sovereign recommendations that investors should be ‘overweight’ in, saying Nigeria had not taken advantage of high oil prices, while adding Serbia and Uzbekistan.\n“Nigeria’s fiscal woes amid a worsening global risk backdrop have raised market concerns despite a positive oil environment,” they said.\nEmerging market sovereign debt is at the “mercy” of the Federal Reserve’s interest rate decisions, JPMorgan analysts said in a note on Monday, as the U.S. central bank’s rate raises drain capital from developing markets.\nJPMorgan’s Emerging Markets Bond Index Global Diversified (EMBIGD) index has fallen 16% this year, the analysts said, “with most of the losses having come from rates” and $4 billion in net outflows from emerging markets since mid-April.\nHowever, the analysts said the “front-loaded pain” for emerging market bonds, which they said had begun underperforming in September 2021, was a positive."
  },
  {
    "headline": "Breaking: Senate President, Ahmad Lawan, receives N100m form, joins presidential race",
    "summarized_story": "The widely rumoured Presidential aspiration of the Senate President, Ahmad Lawan, turned to reality Monday when he received the All Progressives Congress ( APC) N100million nomination form from the National Stability Project at the Senate Guest House, Maitama.\nThe group led by Chief Sam Nkire said they bought the form for the Senate President being a stabiliser Nigeria needed at the moment.\nHe said membership of the National Stability Project cuts across the 36 States of the Federation and 774 local government Councils.\nAccepting the offer, the Senate President described the moment as memorable and historic and indeed, a clarion call to serve.\n“Today is a special day with the Clarion call made on me to serve by Nigerians through the movement known as National Stability Project."
  },
  {
    "headline": "Adegbite extols gemstone, Jewellery grandaunts",
    "summarized_story": "Adegbite gave this commendation on Friday, during the graduation ceremony of the first batch of the gemstone and jewelry making trainees of the Abuja Chambers of Commerce and Industry.\nWhile addressing the graduands, the minister charged them to impart the knowledge they have acquired to others in their communities.\nAdegbite further assured them as he disclosed that the second phase of the training was in progress.\nHe commended the doggedness of the 21 participants of the first batch of the training for staying through to the end.\nThe Project Coordinator disclosed that there are plans for advanced training for the 21 successful master training graduands, this, he said would be communicated to them in due course."
  },
  {
    "headline": "NHP Taraba named ‘Muhammadu Buhari’ Housing Estate",
    "summarized_story": "…,To promote decent housing access for the people of Taraba State.\n– Taraba State GovernorBy Chioma NnodimMinister of State for Works and Housing Mr.Mu’azu Jaji Sambo, Executive Governor of Taraba State Darius Dickson, Ishaku, top government officials and local residents in Jauro –Yinu Taraba State converged at the commissioning and handover ceremony of National Housing Programme in Jalingo Taraba State, as Sambo named the National Housing Programme in Jalingo, Taraba Stste Muhammadu Buhari Housing Estate weekend.\nIt is on this note and for his contribution to National Development through the National Housing Programme that I, Mu’azu Jaji Sambo Hon.\nMinister of State, Works and Housing name the National Housing Project site in Jalingo , Taraba State as “ Muhammadu Buhari Housing Estate , Jalingo,” Sambo said.\nThe use of available local building materials in the National Housing Programme has stimulated the economy through the production and use of local materials ."
  },
  {
    "headline": "Customs seize poisonous bags of rice imported from India",
    "summarized_story": "According to acting Controller Ejibunu, “Pursuant to the Federal Government’s policy that encourages local production of rice against the importation of foreign parboiled rice, this Unit had seized 7,259 (of 50 kg each) bags of rice, which is an equivalent of over twelve (12) trucks load.\n“Consequent upon this laboratory analysis on the foreign parboiled rice; as a responsible government agency, we are letting Nigerians know that apart from the negative economic impact of importing foreign rice into the country, some of these imported rice are unhealthy for human consumption.\nThus, we advise consumers to desist from patronizing the federal government banned foreign parboiled rice.\n“We as citizens have a collective responsibility to safeguard our economy and health for the benefit of all.\n“A total of twelve suspects were arrested in connection with some of the seizures; for committing various Customs offences."
  },
  {
    "headline": "33% Pension increase: PHCN retirees excluded by wages commission – PTAD",
    "summarized_story": "“This is because PHCN pensioners were already on a special salary structure before the Pension review for Pensioners who while in service were on one of the Harmonized Salary Structures of the Federal Public Service.\n“It should be noted that PHCN pensioners took the Federal Government to the National Industrial Court (NIC) Abuja on this issue.\nAfter several engagements, President Muhammadu Buhari, approved the implementation of 9.7% increase in the pensions of Ex-PHCN Retirees under the Defined Benefit Scheme (DBS).\nIt is therefore preposterous and uncalled for that this group wants to conveniently forget the amicable agreement reached by all parties and arm-twist the Federal Government to make claims on the 33% pension increment,” PTAD said in a statement it issued on Friday.\nThe pensioners reportedly alleged that PTAD colluded with some “powerful individuals” to deprive them of the 33% pension increment as approved by the federal government in 2010."
  },
  {
    "headline": "PBR Cowpea has revolutionalised Nigeria’s food production – NABDA DG",
    "summarized_story": "By Eunice OrikeAs Nigeria prepares for the 2022 planting season, director-general of the National Biotechnology Development Agency NABDA, Prof. Abdullahi Mustapha, has commended the Pod Borer Resistant PBR, Cowpea for revolutionalising Nigeria’s food production.\nMustapha who spoke during a press conference on the commercialisation of the new variety of cowpea, said that the food crop is revolutionalising Nigeria’s food production with its tremendous yield, quick harvest, non-shattering and good cooking characteristics.\nAnd that if the 3 million hectares, PBR Cowpea is planted on 1million hectares, the savings on the cost of insecticide is N16,200 billion annually.\n“The feat attained with the development and commercialisation of the PBR Cowpea has, again, proven that if determined, Africa has what it takes to solve its challenges.\nSpeaking on the safety of the improved PBR Cowpea, the director-general, National Biosafety Management Agency (NBMA), Dr. Rufus Ebegba, assured Nigerians the crop is safe for both human consumption and the environment."
  },
  {
    "headline": "JUST IN: Political Parties Ask INEC To Extend Timeline For Primaries",
    "summarized_story": "Political parties in the country have asked the Independent National Electoral Commission (INEC) to extend the timelines for the 2023 general elections by two months.\nSpecifically, the parties want slight changes to the primaries’ timeline, as stipulated by the electoral umpire.\nChairman of the Inter-Party Advisory Council (IPAC), Yusuf Yabagi, made the appeal on Tuesday at a meeting of the electoral umpire and leaders of various political parties at the INEC headquarters in Abuja.\nAccording to Yabagi, who also serves as the National Chairman of the Action Democratic Party (ADP), the extension is necessary to help political parties put things in order for the forthcoming general elections.\nHe explained that discussions would focus on issues concerning the continuous voters’ registration, the upcoming governorship elections in Ekiti and Osun States, as well as political parties’ primaries for the 2023 polls."
  },
  {
    "headline": "ASUU Strike: NANS Directs Students To Block Airport Roads, Others Daily For Three Hours",
    "summarized_story": "The National Association of Nigerian Students (NANS) has directed all its structures and organs to block all federal roads in protest against the continued shutdown of public universities in the country.\nAgainst the backdrop of the extension of the warning strike by the Academic Staff Union of Universities (ASUU), NANS asked the students to ensure the roads are blocked daily for at least three hours until the Federal Government resolves its impasse with the aggrieved lecturers.\nREAD ALSO: ASUU Extends Strike By 12 WeeksAcademic activities have been grounded in public universities across the country following a warning strike by ASUU in February.\nWhile the ASUU strike persists, according to the union, students will continue to occupy roads leading to airports and might be forced to disrupt political activities, including parties’ primaries to elect candidates for the 2023 general elections.\n“There shall be no primaries, there shall be no political activities in Nigeria except the ASUU strike is resolved."
  },
  {
    "headline": "Reps Secure 6m Litres Of Aviation Fuel For Airlines, Seek Permanent Solution",
    "summarized_story": "The House of Representatives on Monday secured the cooperation of the Nigerian National Petroleum Corporation (NNPC) to make available six million litres of JetA1 (aviation fuel) to aviation fuel marketers chosen by the Airlines Operators of Nigeria (AON).\nREAD ALSO: Airline Operators Suspend Withdrawal Of Services Hours To DeadlineThe AON had threatened to shutdown local airline services on Monday but withdrew the threat on Sunday under pressure from the Federal Government.\nThe airline operators say rising cost of key inputs such as aviation fuel necessitated the intended shutdown.\nThe CBN governor, Godwin Emefiele, who eventually walked into the meeting abput 15 minutes later, gave reasons why he had to be represented before his eventual arrival.\nIn his remarks, Speaker Gbajabiamila said the nation was at a crucial moment as the shutdown by the airline operators amounts to a potential shutting down of the country."
  },
  {
    "headline": "‘An Insult’: Jonathan Rejects APC Presidential Form",
    "summarized_story": "Former President Goodluck Jonathan has rejected the presidential form of the All Progressives Congress purchased for him on Monday by a group of his supporters from the north.\n“We wish to categorically state that Dr Jonathan was not aware of this bid and did not authorise it,” the statement read in part.\n“Buying a presidential aspiration form in the name Dr Jonathan without his consent, knowing the position he had held in this country, is considered an insult to his person.\nSporting fez caps with the inscription ‘run Jonathan run’, members of the coalition said the former president is the most qualified person to succeed President Muhammadu Buhari.\nIn rejecting the forms, Dr Jonathan kept his plans close to his chest."
  },
  {
    "headline": "Two Mexican Journalists Killed, Officials Probe Motive",
    "summarized_story": "Two journalists were murdered Monday in Mexico’s violent eastern state of Veracruz, according to authorities, who said they were investigating whether the crime was related to the women’s work.\n“All lines of investigation will be exhausted, including their journalistic activity,” Veracruz Attorney General Veronica Hernandez said in a statement.\nMedia rights groups Reporters Without Borders (RSF) and Article 19 said they were gathering information about the double murder.\nEven before Monday’s murders, nine journalists had been killed in Mexico since the start of the year, according to RSF and Article 19.\nThe United States and the European Parliament have urged Mexico to ensure adequate protection for journalists following the recent string of killings."
  },
  {
    "headline": "Election timetable, timeline will not be reviewed, INEC declares -",
    "summarized_story": "Leaders of Political Parties are currently meeting with the leadership of the Independent National Electoral Commission in Abuja.\nIt is the commission’s regular quarterly Consultative meeting with political parties to review activities ahead of the election and give updates where necessary.\nIn his opening remark, Chairman of the Independent National Electoral Commission, Professor Mahmood Yakubu, disclosed that timetable and timeline of elections will not be reviewed.\nThe INEC chairman also added that political parties should conduct primaries in a transparent manner.\nThe IPAC Chairman said the alteration in the dates will not in anyway affect the timetable of the 2023 general elections"
  },
  {
    "headline": "Again, Police fail to produce Farah Dogogo in court",
    "summarized_story": "The Rivers Stste Police Command on Monday failed to produce detained Rivers State PDP Governorship aspirant, Farah Dogogo in court for second consecutive day.\nThe member of the House of Representatives faces criminal charges for allegedly hiring thugs to disrupt the screening of party’s State and National Assembly aspirants in Port Harcourt.\nThe aspirant has been in detention since the 28th of April 2022."
  },
  {
    "headline": "Delegates recieve Atiku in Ondo, Former VP promises Change -",
    "summarized_story": "The former vice President said it is sad that students have been at home for more than three months.\nHe won the last delegates election to emerge as the Presidential Candidate of the Peoples Democratic Party in 2019.\nAlhaji Atiku Abubakar was Vice President to President Olusegun Obasanjo between 1999-2007 under the Peoples Democratic Party under the administration of Former President Olusegun Obasanjo.\nHe was originally elected Governor of Adamawa State before his nomination as Vice Presidential Candidate by Chief Olusegun Obasanjo in 1999.\nAlhaji Atiku was the Leader of the reputed Strongest Political Group of the over 34 that formed the Peoples Democratic Party, the Peoples Democratic Movement."
  },
  {
    "headline": "Ex-lawmaker, Akindele Adeniyi picks nomination form for Ondo Assembly -",
    "summarized_story": "A former member of the Ondo State House of Assembly, Hon Akindele Adeniyi has obtained nomination and expression of interest forms to represent the people of Akure North state constituency again.\nAdeniyi while addressing his supporters after purchasing the forms at the party secretariat, said he is in the race to bring meaningful development to his people.\nHe expressed optimism that the party leadership would provide a level playing field for all the aspirants in the party.\nAdeniyi who is a former vice chairman in Akure North local government, said he would use his experience in the legislative arm to ensure that Akure North is well represented.\nHis words, ” I am optimistic that our party will provide a level playing field for all of us."
  },
  {
    "headline": "Nigerian Airlines Reach Truce with Government, Get Jet Fuel at N480 per Litre, Cancel Shutdown Plan",
    "summarized_story": "The operators had last Friday announced their plan to stop flight operations due to the high ofcost of aviation fuel that had risen to N700 per litre.\nFemi Gbajabiamila, it was agreed that six million litres of jet fuel would be made available through the intervention of the CBN governor, at the rate of N480 to the operators.\nAs a long term measure they also resolved that the operators would begin the process of application for their licence to import jet fuel directly for their operations.\n“But I said no, that the marketers you are going to give are the same marketers that would handle it for us.\nSomebody must handle aviation fuel."
  },
  {
    "headline": "Aviation Fuel Cheaper in Nigeria Than Other West African Countries, Marketers Say",
    "summarized_story": "MOMAN specifically said in comparative terms, the aviation industry was already benefitting from government’s intervention when local prices are compared to West African regional prices, despite the deregulated status of aviation fuel.\nThe marketers warned that the situation was not sustainable given the already humongous N4 trillion annual subsidy cost being borne by the country.\n“In comparative terms, the aviation industry is already benefitting from government’s intervention when local prices are compared to West African regional prices, despite the deregulated status of aviation fuel.\nIt explained that with respect to aviation fuel, verifiable prices in West Africa ranged from $1.25 per litre in Ghana to as high as $1.51 per litre in Liberia, saying even then, the product has remained scarce across the sub-region.\n“Aviation fuel (Jet A1), like other petroleum products used in Nigeria is not produced in-country and is subject to international price movements which are currently suffering the twin shock of increased post pandemic demand and the ongoing sanctions against Russia, a large producer of petroleum products."
  },
  {
    "headline": "Former Senate President Saraki Meets Obasanjo, Warns Nigerians Against Electing President without Energy",
    "summarized_story": "Also, a former Vice President, Namadi Sambo, has stated that Saraki has the capacity and experience needed to lead Nigeria.\nRelatedStories No Content AvailableHowever, speaking to delegates in Ogun State, Saraki said what Nigeria needed was a president that would stand bold and courageous.\n“We all know my four years as the Senate president, I stood for this country.\nWe need a Nigerian for all Nigerians.”Saraki who was accompanied by PDP former National Chairman Abubakar Kawu Baraje, held a closed-door meeting with Obasanjo at the Olusegun Obasanjo Presidential Library.\nAs the chairman of the Nigeria Governors Forum, sometimes, I felt like his ‘self-appointed deputy’ — even though the forum has no deputy."
  },
  {
    "headline": "Nigeria: Ex- President Jonathan Meets APC Chairman Adamu, Hours After Group Buys Presidential Nomination Forms for Him",
    "summarized_story": "Nigeria’s former president, Dr. Goodluck Jonathan, on Monday met with National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, in Abuja, a reliable source informed THISDAY.\nThe AfDB president also met with President Muhammadu Buhari in Côte d’Ivoire, during the ongoing conference organised by the United Nations.\nThe statement read, “It has come to the notice of His Excellency Dr. Goodluck Ebele Jonathan, that a group has purportedly purchased Presidential Nomination and Expression of Interest forms, of the APC in his name.\n“We wish to categorically state that Dr. Jonathan was not aware of this bid and did not authorise it.\nOthers are: Governor Yahaya Bello of Kogi State; Ebonyi State governor, Dave Umahi; former Imo State governor, Senator Rochas Okorocha; Minister of State, Education, Hon."
  },
  {
    "headline": "Buhari Urges World Bank and AfDB to Activate $19bn Fund for Climate Investment",
    "summarized_story": "President Muhammadu Buhari has charged the World Bank and African Development Bank (AfDB) to activate the $19 billion pledge, meant for land restoration, tree planting, development of climate resilience infrastructure and investments in small- and medium-sized farms.\nVarious African countries put in place extreme measures to curtail to effect of the virus and limit the socio-economic impact such as lockdowns and stimulus package.\nHe said, “One key issue during early discussions before this meeting is the issue of debt cancellation for African countries and this initiative is already gaining traction.\nOf course, there is the argument of how much African continent got.\nthe dependency of African countries on Russia and Ukraine, the war disruption has added to looming food crisis in Africa."
  }
]