[
  {
    "headline": "Abia doctors suspend industrial action over kidnapped colleague",
    "summarized_story": "Sunday NwakanmaThe Nigerian Medical Association, Abia State Branch, on Friday, suspended the industrial action they embarked upon over their kidnapped colleague, Prof Uwadinachi Iweha.\nThis resolution came after an Emergency General Meeting of the State Officers Committee to review the efforts put in by the Abia State Government and security agencies geared towards rescuing Prof. Iweha.\nProf. Iweha was kidnapped on June 6 and on Monday, June 14, the doctors embarked on strike over the matter.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Abia doctors suspend industrial action over kidnapped colleague",
    "summarized_story": "Sunday NwakanmaThe Nigerian Medical Association, Abia State Branch, on Friday, suspended the industrial action they embarked upon over their kidnapped colleague, Prof Uwadinachi Iweha.\nThis resolution came after an Emergency General Meeting of the State Officers Committee to review the efforts put in by the Abia State Government and security agencies geared towards rescuing Prof. Iweha.\nProf. Iweha was kidnapped on June 6 and on Monday, June 14, the doctors embarked on strike over the matter.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Abuja nurses demand justice over doctor’s assault on colleague",
    "summarized_story": "The National Association of Nigeria Nurses and Midwives, FCT Chapter, has demanded justice over an assault on its member, Nurse Ebalu Marvis of the National Hospital, Abuja.\nThe chairman alleged that on June 13, Ikeya disregarded every medical and professional code of conduct to physically and verbally assault the nurse working as a colleague with him at the hospital.\nShe stated that the explanation of nurse Marvis to the doctor that she was attending to a patient on Naso Gastric tube feeding fell on deaf ears.\nUkamaka Godwin’s relative replied that the doctors in the O and G department said they will be doing the dressing.\nThe accused (Dr. Ikeya) and the management of the hospital are yet to react to the allegation and development, respectively."
  },
  {
    "headline": "Abuja nurses demand justice over doctor’s assault on colleague",
    "summarized_story": "The National Association of Nigeria Nurses and Midwives, FCT Chapter, has demanded justice over an assault on its member, Nurse Ebalu Marvis of the National Hospital, Abuja.\nThe chairman alleged that on June 13, Ikeya disregarded every medical and professional code of conduct to physically and verbally assault the nurse working as a colleague with him at the hospital.\nShe stated that the explanation of nurse Marvis to the doctor that she was attending to a patient on Naso Gastric tube feeding fell on deaf ears.\nUkamaka Godwin’s relative replied that the doctors in the O and G department said they will be doing the dressing.\nThe accused (Dr. Ikeya) and the management of the hospital are yet to react to the allegation and development, respectively."
  },
  {
    "headline": "Viral video purporting Lawan’s defection false, mischievous – Aide",
    "summarized_story": "President of the Senate, Sen. Ahmed LawanMr Ola Awoniyi, Special Adviser to President of Senate, Dr Ahmad Lawan, has described as false and mischievous a viral video purporting that Lawan had defected to Peoples Democratic Party (PDP) from All Progressives Congress (APC).\n“So how could the senate president have made such announcement at plenary, either on Tuesday or Wednesday, without it being reported by journalists who covered the proceedings?\n“It was the video clip of the senate president reading out Sen. Aliero’s letter that was doctored to give the wrong impression that Lawan has renounced his membership of APC.\n“For the avoidance of doubt, Sen. Lawan is a committed member of APC and has no reason whatsoever to renounce his membership of the party,” he said.\nAwoniyi urged members of the public to discountenance the video in reference, as it was the handiwork of mischief-makers."
  },
  {
    "headline": "Food Production: Agric Ministry, partners USAID, others to galvanize extension services",
    "summarized_story": "Inaugurates cttee to review of extension manualBy Gabriel Ewepu – AbujaThe Federal Government, has moved to partner USAID FtF Extension Activity, Rural Resilience (Mercy Corps), Winrock International Farmer to Farmer (F2F) Programme to galvanize extension services in achieving food and nutrition security, improve quality seedlings and boost production.\nThis was disclosed by the Permanent Secretary in the Federal Ministry of Agriculture and Rural Development, Dr Ernest Umakhihe, while inaugurating the Committee for the Extension Manual Review at the Ministry’s headquarters in Abuja.\nUmakhihe said the review of the extension manual is targeted at promoting effective and efficient extension services delivery in the Nigerian agricultural sector, wherefore produce a harmonized copy for evaluation and validation.\nHe added the committee would recommend Manpower training for Agricultural Extension Services Personnel aimed at improving extension services in the agricultural sector as well as streamline policies towards achieving quality seedlings and increase in food production.\nEarlier, an address of welcome, the Director, Agricultural Extension Services, Engr Frank Kudla, said that, ‘’The technical review team was composed from the Developmental Partners like USAID, Sasakawa Africa , Federal University of Abeokuta, National Roots Research Institutes, among others ."
  },
  {
    "headline": "#EkitiDecides: APC chieftain lauds INEC on effectiveness of BIMODAL Accreditation System",
    "summarized_story": "A Chieftain of the All Progressives Congress,(APC), Prof. Adio Afolayan, has described the seamless operation of BIMODAL Accreditation System for the conduct of ongoing governorship election in Ekiti by the Independent National Electoral Commission (INEC) as excellent.\nINEC is adopting BIMODAL Accreditation System, in which accreditation and voting were done simultaneously in the Saturday governorship election.\n“So far, INEC arrangement is so superb and okay.\nWithin five minutes, one is accredited, do the voting, unlike before you accredit, hours later you still queue to cast your vote,” Afolayan said.\nHowever, some voters in Ifaki-Ekiti, raised alarm that the Bi-modal Voter Accreditation System (BIVAS) machines were not functioning well in many areas of the town."
  },
  {
    "headline": "Ikere-Ekiti voters decry non inclusion of stamp pads in election materials",
    "summarized_story": "Some electorate in Ikere-Ekiti area have decried the non inclusion of stamp pads in the election materials supplied to the town, alleging that the process has been compromised.\n“But, no matter how long it takes INEC to produce the stamp pads, I will continue to wait,” Elizabeth said.\nCommenting, Dr Wole Oluyede, the Governorship candidate of the Action Democratic Congress (ADC), complained that the election had been compromised following non inclusion of vitals items in the election materials despatched to the town.\nRecall that as at 10:15 a.m, at Ugele Arokun Ward 3 Unit 6 in Ikere-Ekiti, where the ADC candidate was expected to vote, ballot stamp pads were missing in the voting materials dispatched to the polling unit.\nHe, however, assured the electorate that arrangement had been to get another stamps so that voting could commence in earnest."
  },
  {
    "headline": "Ekiti Poll: APC candidate, Oyebanji hails INEC, security describes poll excellent",
    "summarized_story": "Dayo Johnson Ado EkitiThe governorship candidate of the All Progressive Congress, Biodun Oyebanji has described the exercise as excellent.\nSpeaking with newsmen after casting his vote, at unit 3 ward 06, lkogosi, Oyebanji around 1040am said the accreditation across as timely and orderly.\nSpeaking on the introduction of the Bimodal Voter Accreditation System into the electoral Oyebanji described it as commendableOyebanji “The process is excellent, I just cast my vote, it went very well .\nThe accreditation process has been perfect.\nAsked if he has received information on security breaches, the APC candidate said he could only adjudge the process in his polling unit."
  },
  {
    "headline": "Court stops FG from taking further actions on disputed e-Customs Concession Project",
    "summarized_story": "A Federal High Court in Abuja has restrained the Federal Government from enforcing or giving effect to the controversial Customs Modernisation Project, otherwise known as e-Custom, allegedly executed by its agents on May 30, 2022.\nThe agents, who allegedly executed the disputed concession project are the Nigerian Custom Service, Trade Modernisation Project limited, Huawei Technologies Company Nigeria limited and African Finance Corporation.\nJustice Inyang Ekwo, while ruling on the ex-parte application granted the prayers of the plaintiffs having placed sufficient evidence of interest in the concession project.\nThe two plaintiffs had in their statement of claims narrated how they proposed to carry out Custom Modernisation Project through several government officials for the benefits of the Nigerian Custom Service.\nThey averred that Tade Modernisation Project Limited was incorporated in April, 2022 at the Corporate Affairs Commission (CAC) with one Alhaji Saleh Ahmadu a close friend of the Comptroller General as the Chairman."
  },
  {
    "headline": "Bayelsa Govt breaks silence on total blackout",
    "summarized_story": "Bayelsa State Government has offered reasons for the recent power outage witnessed in Yenagoa, the city capital and other parts of the State.\nDAILY POST gathered that for some weeks now, the State capital has witnessed total blackout, apart from the Suburbs where SHELL and other means are distributing power.\nAyibaina Duba made the disclosure in a statement in Yenagoa at the weekend.\nAyibaina Duba disclosed that a team comprising the State Ministry of Power, Bayelsa Electricity Company Limited, in collaboration with the Port Harcourt Electricity Distribution Company is already engaging the TCN to ensure the restoration of power supply to the State.\nAccording to the Commissioner, the team is also working on appropriate measures to prevent future occurrence."
  },
  {
    "headline": "Ohanaeze: Okafor, Obiawuna back Isiguzoro on Okowa",
    "summarized_story": "Reactions have continued to trail the statement made by the Secretary-General of Ohanaeze Ndigbo Worldwide, Mazi Okechukwu Isiguzoro over the emergence of Governor Ifeanyi Okowa as the running mate to Atiku Abubakar.\nIsiguzoro had lambasted the Peoples Democratic Party, PDP, for not looking the way of the South-East.\nBut reacting, Dr. Chigozie Okafor, the Deputy Secretary-General, Ohanaeze Ndigbo and Prof Jude Obiawuna, the National Vice President-General, said Isiguzoro had been firm on issues concerning the interest of Ndigbo.\n“We are aware of attempts by the agents of doom to blackmail the person of Mazi Okechukwu Isiguzoro after attempts to bribe him failed.”They further stated that should anything happen to the Ohanaeze scribe, “we will know who to hold responsible.\nMoreover, no one sponsors the activities of Ohanaeze Ndigbo except Igbos home and abroad.”"
  },
  {
    "headline": "NSCDC reacts to worsening insecurity in Zamfara, blames informants",
    "summarized_story": "Zamfara State command of the Nigeria Security and Civil Defense Corps (NSCDC) has lamented the rising insecurity in the State.\nThe State commandant of the Corps, Mr. A A Sparks, who spoke through the command’s spokesman, DSC Ikor Oche said that there have been some security strategies put in place to address the teething problems in the State.\n“We have deployed our security operatives to various locations of the State in order to secure lives and properties of the residents considering the rising insecurity situation in the entire State,” he added.\nCommenting on Zurmi attack in the early hours of Friday, 17th June, 2022, the Corps commandant noted that intelligence report indicated that informants were the brains behind the deadly attack.\n“The bandits would not have succeeded without the assistance of the informants and the command has taken stringent security measures to ensure that the informants would no longer have their way in the dubious business,” he said."
  },
  {
    "headline": "Tinubu: Bauchi Polytechnic suspends female staff over alleged partisanship",
    "summarized_story": "The Bauchi State Polytechnic authority has suspended a staff member, Raliya Mohammed Kashim over her alleged involvement in partisan politics.\nAccording to a statement by the institution’s Public Relations Officer, Maimako Baraya, the staff had posted videos containing campaign materials of the All Progressives Congress (APC), gubernatorial candidate of Bauchi State and its presidential candidate, Bola Ahmed Tinubu on her WhatsApp status.\nAccording to him, her postings violated the Public Service Rules that prohibit civil servants from engaging in partisan politics.\n“Management determined the action as inappropriate and a clear violation of the Public Service rule 1.4.1.9, which clearly prohibits public officers from engaging in partisan politics,” the statement readsIt further informed the general public, especially the good people of the State, that the management of the Polytechnic “wishes to state categorically that the institution is a professional entity governed by rules and regulations”, adding that “having achieved this feat, it shall leave no stone unturned in its determination to ensure that all its employees maintain the highest level of professionalism and respect for the laws of the institution and the State.”The statement assured members of the public that there would not be any sacred cow and that it shall not be intimidated by the political jobbers, fifth columnists and enemies of the State."
  },
  {
    "headline": "Five die as gunmen, vigilance group clash in Anambra The Nation Newspaper",
    "summarized_story": "Five persons were confirmed dead in Anambra at the weekend when gunmen and members of the Vigilance group clashed.\nThe residents, in a viral video, hailed the vigilance group seen shooting none stop in celebration while carrying the corpses in a Hilux vehicle along the way.\nThe incident happened at Akwa village in Ihiala during a clash between Vigilante and unknown gunmen.\n“The argument of the gunmen was that Ebubeagu people ought not to enter Anambra State when there are people controlling the area.\n” The incident happened at the village called Umuojimaka in Akwa and when the shooting became so much, the family took back the corpse to the mortuary."
  },
  {
    "headline": "People will wait to see votes count, says ex-Deputy Gov The Nation Newspaper",
    "summarized_story": "A former Deputy Ekiti Governor Prof Olusola Eleka, has said that his people would wait till the votes are counted.\nEleka, who voted at Unit 7, Ward 2 Okeruku, Ikere Ekiti, described the ongoing governorship election as fair, transparent and orderly.\n“The process itself is quite fair and I think it will make the process count.\nUsually, you will expect the people to wait behind to defend their votes.\nEven if you don’t tell them to wait, they will want to wait so that the votes are counted correctly.”"
  },
  {
    "headline": "Oni still in Ekiti Gov race, says running mate The Nation Newspaper",
    "summarized_story": "Ladi Owolabi, running mate of Ekiti Social Democratic Party (SDP) Gov candidate Segun Oni, has refuted reports that his principal has stepped down from the race.\nOwolabi, who spoke with The Nation after casting his vote on Saturday, alleged that the viral statement was the handiwork of the opposition.\nHe said: “The opposition are the one saying Oni has stepped down, and that’s not true.\nThey even said that I’ve been offered house of rep position which is not true.\nOni is still very much in the race.”"
  },
  {
    "headline": "BREAKING: Enugu Catholic Diocese bans Mbaka's ministry The Nation Newspaper",
    "summarized_story": "The Enugu Catholic Diocese has banned all priests and Catholic faithful from attending the Adoration Ministry, Enugu led by controversial priest, Rev.\nIn a letter he personally signed and addressed to all clergy, religious and lay faithful, the Bishop of Enugu Catholic Diocese, Most Rev.\nCallistus Onaga, banned all Catholic faithful and clergy in the Diocese from having anything to do with the Mbaka’s Adoration Ministry.\nThe letter reads: “In the light of the happenings in the Catholic Adoration Ministry Chaplaincy Enugu capable of undermining the Catholic faith and teachings; and after several fraternal corrections and admonitions to Fr.\nMbaka and the Catholic Diocese of Enugu as I entrust him and the Diocese to the maternal carç thee and protection of the Blessed Virgin Mary, Queen of the Apostles.”"
  },
  {
    "headline": "BREAKING: APC's Oyebanji votes, confident of victory The Nation Newspaper",
    "summarized_story": "Candidate of the ruling All Progressives Congress (APC) in the ongoing governorship election in Ekiti Biodun Oyebanji has voted.\nHe was accredited and voted alongside his wife, Prof. Olayemi at ward 06, unit 03, Okelele Area of Ikogosi-Ekiti around 10:40am.\nSpeaking after voting, the APC standard bearer hailed the peaceful conduct of the excercise, expressing confidence that he will win the contested election with wide margin.\n“I am coming with a change agenda and my manifesto is clear about the changes I am bringing,” he said.\nOyebanji is contesting the governorship election with Segun Oni of the Social Democratic Party (SDP), Bisi Kolawole of the People’s Democratic Party (PDP), Dr. Woke Oluyede of the African Democratic Party and 12 others."
  },
  {
    "headline": "Anambra: 5 killed as gunmen, IPOB clash in Ihiala",
    "summarized_story": "From Odogwu ObinnaFive of the gunmen terrorising parts of Anambra State were on Friday neutralised when the criminals reportedly clashed with the members of the Indigenous People of Biafra (IPOB) in Ihiala.\nA trending video showed a Hilux van carrying some bodies out of the town.\nThe incident happened at Akwa village in Ihiala during a clash between IPOB and unknown gunmen.\n“The gunmen have a camp at a place called Oseakwa from where they have been terrorizing Ihiala, Okija, Uli and other neighbouring communities.\n“On June 17, IPOB swooped on the gunmen in their camp and five people were killed during the shootout."
  },
  {
    "headline": "Catholic Church slams Mbaka, bans adoration worshipers",
    "summarized_story": "From Jude Chinedu, EnuguThe Catholic Bishop of Enugu Diocese, Calistus Onaga has shut down Rev.\nMbaka’s Adoration Ministry over his outburst against Labour Party presidential candidate, Peter Obi.\nIn a letter addressed to ‘All the Clery, Religious and Lay Faithful in the Catholic Diocese of Enugu’, Bishop Onaga banned them from having anything to do with the Adoration Ministry.\nHe said in the letter that Mbaka having refused to heed to the Church’s persistent directives, “and in fulfillment of my pastoral duties as the Chief Shepherd”“I hereby prohibit all Catholics (clergy, religious and lay faithful) henceforth from attending all religious and liturgical activities of the Catholic Adoration Ministry until the due canonical process initiated by the Diocese is concluded.”While noting that his decision was based on the fact that Mbaka’s teaching and utterances were not consistent with the teachings of the Catholic Church, he enjoined “all Christian faithful to keep praying for Fr."
  },
  {
    "headline": "Ekiti decides: ADC, SDP allege vote buying",
    "summarized_story": "The agents of the African Democratic Congress (ADC) and the Social Democratic Party (SDP) at the Ward 2 Unit 8, Iworoko, Ifelodun/Irepodun Local Government Area of Ekiti State, have alleged vote-buying at the ongoing Ekiti State governorship poll.\nThe allegation was, however, countered by the agent of the All Progressives Congress (APC) and that of the Peoples Democratic Party, (PDP) who certify that the election is smooth.\nSDP agent, Bukunmi Oluwafemi, who spoke to journalists, said the exercise was peaceful, but observed that a particular political party was trying to do “see and buy.”Are you a Man 40 yrs and above?\n“They (voters) are showing their ballot papers to agents of a party and we said that shouldn’t be.\nA particular party is buying votes,” Kehinde said."
  },
  {
    "headline": "Breaking: Tipper drivers block Onitsha bridgehead over extortion",
    "summarized_story": "From Jeff Amechi Agbodo, OnitshaThe Tipper Drivers Association in Anambra state this morning blocked the ever busy Onitsha River Niger Bridgehead over alleged extortion by security operatives in the area.\nThe drivers who came out as early as possible used their vehicles to block the road causing serious gridlocks.\nThe motorists and commuters were stranded as the road was totally blocked, stopping those either coming into Onitsha or those going out of Asaba, Delta state.\nIt was gathered that trouble started when the tipper drivers rejected and refused the payment of N1000 to a security operative leading to the bursting of tyre of one of the tippers by an officer at bridgehead which angered the drivers for protest.\nThe President-General of Great Tipper Drivers Association Comrade Ebuka Unekwe said that their action was due to incessant molestations and dehumanizing treatment meted out on them by security officers in the area."
  },
  {
    "headline": "BREAKING: Ekiti guber: Segun Oni has not withdrawn from contest – Spokesman",
    "summarized_story": "The governorship candidate of the Social Democratic Party (SDP) in Ekiti State, Segun Oni, has not withdrawn from the governorship race as speculated in a section of the media.\nThe clarification was made on Saturday morning by his spokesperson, Moses Jolayemi, after a letter went viral on the social media, alleging that Oni has withdrawn from the governorship election holding today.\nA copy of the purported withdrawal letter sighted by The Sun Newspapers, carried the endorsement Segun Oni.\nI am urging the people of the state to go out en masse and vote for Segun Oni.\nOur people should disregard the statement as the handwork of the mad people.”Partner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Live Updates: Ekiti Governorship Election 2022",
    "summarized_story": "Oyebanji spoke in Ikogosi Ekiti, Ekiti West Local Government Area of Ekiti State after voting at Okelele ward 06 unit 003 in the town.\nMeanwhile, the Economic and Financial Crimes Commission, EFCC, has deployed its operatives in Ekiti state to monitor today’s governorship election with a view to addressing the possibility of vote buying.\nSome of the operatives and armed police personnel attached to the commission were sighted in a convoy of vehicles within Ado Ekiti, the state capital.\nIn some units in Ado Ekiti, Ilawe, Igede and Iyin Ekiti, voters were being accredited with the aide of Bimodal Voter Authentication System(BVAS) and given the ballots to vote.\nThe influence of Segun Oni’s Deputy, Ladi Owolabi in Ado Ekiti is also enormous."
  },
  {
    "headline": "Ekiti Decides: Oyebanji, Oni, Kolawole in Three-Horse Race",
    "summarized_story": "The electoral umpire had earlier revealed that 988,923 voters captured in the Commission’s register would decide who becomes the new Ekiti State Governor.\nOyebanji and Kolawole are from Ekiti Central Senatorial District, comprising five local government areas – Ado, Irepodun/Ifelodun, Efon, Ijero and Ekiti West.\nThe influence of Segun Oni’s Deputy, Ladi Owolabi in Ado Ekiti is also enormous.\nVictory for APC Ekiti Central may be by a narrow margin.\nAPC won the five councils in Ekiti North in the last election, but Oni was still in the ruling party then."
  },
  {
    "headline": "Owo Killings: Akeredolu Weeps at Burial, Laments Failure to Protect Citizens",
    "summarized_story": "Fidelis David in AkureGovernor Rotimi Akeredolu of Ondo State yesterday blamed himself and government at all levels for failing to defend the victims of June 5 attack on St Francis Catholic Church, Owo, which claimed 40 lives.\nAkeredolu made the declaration during the funeral Mass for 18 of the victims, held at the Mydas Resort and Hotel, Owo.\nAkeredolu, who wept during his speech, said the government failed to protect the victims of the terror attack.\nResponding, the Bishop of Ondo Catholic Diocese, Dr. Jude Arogundade declared that Akeredolu had not failed in protecting his people.\n“Indeed, the event catapulted Ondo State, the Catholic Diocese of Ondo and Nigeria into the limelight of world attention, unfortunately, for the wrong reason."
  },
  {
    "headline": "Margaret Obaigbena, Princess of Owa Kingdom Passes on",
    "summarized_story": "Princess Obaigbena, who left her footprints in the health sector of the defunct Bendel State and later, Delta State was adviser to three successive governments in Delta State due to her wealth of experience.\nThe demise of the matriarch was announced by the Royal family of Owa Kingdom led by the Obi of Owa Kingdom, HRM Emmanuel Efeizomor in what he termed “celebration of life and times” of the matriarch.\nFondly called “my pearl” by her father, Princess Obaigbena spent her early years in Enugu and Onitsha before she finally settled in Agbor when her father retired.\n“On behalf of my family, I wish to convey my deepest condolences to the Obaigbena family of the Owa kingdom of Delta State.\nTinubu said: “We must thank God that Princess Obaigbena died at an advanced age and left worthy children including you and your other siblings."
  },
  {
    "headline": "Buhari Mourns Margaret Obaigbena, Mother of Chairman THISDAY/Arise Group",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has sympathised with the Royal Palace of the Obi of Owa Kingdom in Delta State on the passing of a most treasured daughter, Princess Margaret Obaigbena, nee Usifoh, at the age of 88.\nCommiserating with members of the family, and Prince Nduka Obaigbena, Chairman of THISDAY/Arise Group, President Buhari, in a release issued Friday by his Media Adviser, Femi Adesina, described the late Princess Margaret as a pillar of strength for the family, an accomplished mother and revered community leader, whose absence will be felt far beyond her immediate environment.\nNoting that the death of Princess Margaret Obaigbena will create a great vacuum in the community, the President urged the family to take solace in the understanding that she lived her passion by caring for the distressed and disadvantaged.\nHe also eulogised her steadfast disposition to servicing mankind, beginning early in life and reaching the peak of the nursing profession, channelling her energy and resources to the realisation of lofty convictions.\nThe President prayed that God Almighty grants her soul eternal rest."
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,195 polling units where voting will take place."
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,195 polling units where voting will take place."
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Voter turnout is massive... it's very unusual, says Biodun Olujimi on Ekiti guber",
    "summarized_story": "Biodun Olujimi, senator representing Ekiti central, says the voter turnout in Ekiti governorship election is massive.\n“During elections, it is usually very peaceful early in the morning, that is the way it is.\nWe don’t usually experience violence until mid-afternoon,” she said.\nAdvertisement“But we are praying that we don’t experience it this time because the last experience was very rough.\n“We have not seen it here, maybe because of our past experience and maybe people have devised new means of doing it."
  },
  {
    "headline": "Voter turnout is massive... it's very unusual, says Biodun Olujimi on Ekiti guber",
    "summarized_story": "Biodun Olujimi, senator representing Ekiti central, says the voter turnout in Ekiti governorship election is massive.\n“During elections, it is usually very peaceful early in the morning, that is the way it is.\nWe don’t usually experience violence until mid-afternoon,” she said.\nAdvertisement“But we are praying that we don’t experience it this time because the last experience was very rough.\n“We have not seen it here, maybe because of our past experience and maybe people have devised new means of doing it."
  },
  {
    "headline": "Etiki guber: Segun Oni alleges vote buying in Oye LG",
    "summarized_story": "Segun Oni, Ekiti governorship candidate of Social Democratic Party (SDP), says he received reports of vote buying in Oye — a local government area in the state.\nThis is as the governorship election is currently taking place across 16 LGAs of the state.\nSpeaking after casting his vote, the governorship candidate said the voting process for him went well.\n“We have to wait till we get reports of how it is all over the state.”On vote buying, Oni said, “I have received reports of vote buying in Oye.”Advertisement“On the new electoral act, it has raised the confidence of the people.\nClearly, vote buying is a threat to our electoral democracy."
  },
  {
    "headline": "Etiki guber: Segun Oni alleges vote buying in Oye LG",
    "summarized_story": "Segun Oni, Ekiti governorship candidate of Social Democratic Party (SDP), says he received reports of vote buying in Oye — a local government area in the state.\nThis is as the governorship election is currently taking place across 16 LGAs of the state.\nSpeaking after casting his vote, the governorship candidate said the voting process for him went well.\n“We have to wait till we get reports of how it is all over the state.”On vote buying, Oni said, “I have received reports of vote buying in Oye.”Advertisement“On the new electoral act, it has raised the confidence of the people.\nClearly, vote buying is a threat to our electoral democracy."
  },
  {
    "headline": "'APC N10k... PDP N5k... SDP N3k' — ADP candidate alleges vote buying in Ekiti guber",
    "summarized_story": "Kemi Elebute-Halle, governorship candidate of the Action Democratic Party (ADP) in Ekiti, has alleged that other political parties are inducing voters with money in the ongoing election.\nElebute-Halle spoke with TheCable after voting at polling unit eight, ward 10, Ikole LGA in Ekiti.\nThe female governorship candidate commended the process of accreditation and voting at her polling unit, saying it is credible.\nShe alleged that the All Progressives Congress (APC), the Peoples Democratic Party (PDP) and the Social Democratic Party (SDP) are buying votes with N10,000; N5,000, and N3,000 respectively.\n“At my polling unit here — ward 10, unit eight — we are aware that APC has started buying votes for the sum of N10,000; PDP are buying for N5,000 and SDP for N3,000."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abena, a voice assistant wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "Meet 11 female founders making strides in Africa",
    "summarized_story": "This article aims to recognize some African female founders making great strides across various industries and sectors on the continent.\nMeet 11 African female founders we are rooting:Sethebe Manake – Botswana 🇧🇼Image source: Sethebe ManakeMy name is Sethebe Manake (she/her) and I am a real-estate expert turned tech entrepreneur who enjoys dancing and game nights.\nLinkedIn: Neema IyerTao Laine Boyle – South Africa 🇿🇦Image source: Tao BoyleMy name is Tao Boyle (she/her).\nThato Schermer – South Africa 🇿🇦Image source: Thato SchermerMy Name is Thato Schermer (she/her) and I’m the Founder of Zoie Health Technologies.\nI graduated from the University of Cape Town (South Africa) and the University of California (Los Angeles) with a triple major in computer science, genetics, and biochemistry."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "CBN’s printing of money harming Nigeria’s economy say World Bank, EIU",
    "summarized_story": "At a time when central banks around the world are mounting desperate battles to contain inflation, in Nigeria it could be a case of the country’s central bank fanning embers of spiralling inflation, according to the Economist Intelligence Unit, EIU and economists at the World Bank.\nThe EIU in particular said the central bank might have been breaking the law which stipulates a limit beyond which it shall lend to government.\nNigeria’s central bank tightened monetary policy with a 150-basis point hike last month, supposedly to attain its 9% inflation target, but the same central bank has continued to directly finance government deficit in an unbridled manner, the economists say.\nWhen central banks around the world tighten monetary policy the primary goal is to curtail money supply, but there is a curious case in Nigeria where the central bank is tightening monetary policy and at the same time pumping more money into the system by deficit financing and by its development finance initiatives says the World Bank.\nThe continued printing of money at the same time as tightening policy would prevent effective control of the price level,” the EIU said."
  },
  {
    "headline": "What Tinubu and Obi’s ‘dummy candidates‘ mean for 2023 elections",
    "summarized_story": "The All Progressive Congress (APC) Presidential candidate, Bola Tinubu nominated Ibrahim Masari, a renowned Katsina politician, as the party’s place holding or dummy candidate, for his yet to be named running mate so as to meet up with INEC deadline.\nBusinessDay checks show that the concept of ‘ dummy or place holding candidates’ was evolved by the political parties as a temporary measures, where there are disputes over the choice of running mates.\nSimilarly, the Commission also gave the parties up to August 12 for the withdrawal and replacement of withdrawn candidates by the political parties.\nAn Abuja based Lawyer, Francis Obalim, told BusinessDay that the parties“ will not have issues substituting such candidates since they did not participate in any primary election”.\nAccording to Obalim, “running mates cannot refuse to step down, because they did not pass through any formal process of election”."
  },
  {
    "headline": "How to lead in a multicultural organisation",
    "summarized_story": "However, a formal leader from another culture may not be accepted in a multicultural situation because of cultural differences, particularly in expected leadership methods.\nA leader who can meet followers’ expectations of a good leader can develop better trust and quality relationships.\nSome followers need more leading along each of these dimensions than others.\nTrying to mimic the behaviours of a leader belonging to the followers’ culture may lead to unintended consequences.\nIn multicultural situations, it is probably best not to model your leadership behaviour after a leader in the follower’s culture."
  },
  {
    "headline": "Ex-parte orders: Code of Conduct Bureau set to prosecute Justice Ekwo over abuse of office – Nigerian Observer",
    "summarized_story": "Justice l.E Ekwo, of the Federal High Court, Abuja.\n” One result from the Edo State PDP supervised by the National office of the PDP and another result from Chief Dan Orbih faction backed by Barr.\nNyesom Wike and endorsed by Justice Ekwo.\nEven though there was an earlier order from the Edo State High Court validating the result of the PDP Ward congresses across the State.\n” His Lordship Order was in contradiction to the earlier order of the Edo State High Court on the same subject matter and also operated as appeal against the earlier Order of the Edo State High Court”, he said."
  },
  {
    "headline": "Fire Wreaks Havoc In Ekpoma, Destroys Goods Worth Millions Of Naira – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Goods worth millions of naira were yesterday destroyed by ‘strange’ fire on Akere Lane, Alli Square in the university town of Ekpoma, Esan West Local Government Area of Edo State.\nOver 10 stores affected by the inferno, include electronic shops, interior decoration shop, cyber café, Photo Studio, generator sales and repair shop, building materials stores, among others.\nIt was gathered that one of the shops destroyed by the inferno was a photo Studio, with state of the art equipments, commissioned less than week before the incident.\nThe NIGERIAN OBSERVER gathered that the fire began from an electronic sales shop, at about10pm on Thursday, before spreading to other affected shops.\nAs at the time of this report there were still billows of smoke from the affected shops, while sympathizers gathered at the scene to catch a glimpse of the damages."
  },
  {
    "headline": "Ease of doing business: Edo trains 50 persons on Alternative Dispute Resolution – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Poised to improve the business operating environment in the state and provide an alternative to litigation through the Multi-Door Court House, the Edo State Government has commenced another training of 50 persons in Alternative Dispute Resolution (ADR).\nThe training is sponsored by the German Agency for International Development in the Pro-poor Growth and Promotion of Employment in Nigeria (GIZ-SEDEN) in collaboration with the Edo State Judiciary.\nDeclaring the training open, the Chief Judge of Edo State and Chairman Governing Council of the Edo State Multi-Door Court House, Hon.\nAcha, who was represented by the Acting Director of the Edo State Multi-Door Court House, Mrs. E.O.\nFacilitators at the training include the Coordinator of GIZ-SEDIN in Edo State, Ms."
  },
  {
    "headline": "Law Week Ends With Call For Financial Autonomy, ICT Use – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigerian Judiciary has been told to leverage on its use of information communication technology (ICT) to help it fast track on filing and documentation processes even as it continues the fight for financial autonomy.\nPeter Efosa Osakue hailed the Judiciary and its use of soft copies during the filing process which he noted was a new innovation.\nHe nonetheless called lawyers to be computer literate to cut down on turning in blank documents CD’s to judges.\nGoing further, he called on the executives arm of government to grant financial autonomy to the judiciary to make it independent.\nNBA Chairman, Pius Oiwor while speaking on irregularities bedeviling the judiciary touched on the issue of financial autonomy, which he said was guaranteed by the constitution."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Atiku’s running mate: I didn’t betray south – Okowa to South, Middle Belt leaders",
    "summarized_story": "Dr. Ifeanyi Okowa, governor of Delta State and vice presidential candidate of the People’s Democratic Party (PDP), has said that he did not betray southern Nigeria by accepting to be Atiku Abubakar’s running mate.\nOkowa, who spoke on Arise Television on Friday night, said he would not join issues with any group on the issue, especially the Southern and Middle Belt Leaders’ Forum (SMBLF) “because they are leaders I hold in high esteem”.\n“We are not expecting that he would be the candidate from the North and also have a vice presidential candidate from the North.\nOkowa said that he had a very clear understanding of what the issues in the polity were and how to navigate through them.\nOn unifying the party, Okowa said that he had started reaching out to his colleagues and other leaders of the party and that he was encouraged by the response so far."
  },
  {
    "headline": "Financial Inclusion: Experts identify gaps in CBN’s set target",
    "summarized_story": "“As some of us will remember, the CBN initiated the National Financial Inclusion Programme in year 2012 that is, about a decade ago.\nOgubunka, pointed that the above situations were identified to have negative/adverse consequences/implications for the financial system and the economy, especially as almost half of the financial resources in the country were in the hands of people operating outside the formal financial system.\nThus, it floated the Financial Inclusion programme and supported it with a Strategy Document tagged ”National Financial Inclusion Strategy” that encapsulated, among many othethings, the Strategy Objectives, Strategy Stakeholders and their Interests, and Key Financial Inclusion Targets.\nHe bemoaned the sustained lack of considerations for the disabled in the Nigerian financial system through different kinds of neglect and rights denials.\nHe admonished prevailing attitudes of the financial systems against the disabled, describing it as major institutional barrier to financial inclusion"
  },
  {
    "headline": "Buhari sets up national early warning centre in Osibanjo’s office",
    "summarized_story": "A National Centre for the Coordination of Early Warning and Response Mechanism has been established with the signing of Executive Order 12 by President Muhammadu Buhari.\nUnder the ECOWAS instruments, including the 1993 Revised ECOWAS Treaty, each member state is to establish a national early warning centre to address issues related to threats to human security as part of the regional body’s peace and security architecture.\nThe President had earlier approved the appointment of Mr Chris Ngwodo as the Director General of the National Centre.\nBefore his last appointment as Senior Special Assistant to the President on Policy Research in the Office of the Vice President, Ngwodo had served as Technical Assistant to the President on Justice, Conflict and Security in the Office of the Vice President.\nA lawyer by profession, Mr Ngwodo has worked on conflict, human security, policy and development issues for over a decade."
  },
  {
    "headline": "JUST IN: Despite apology, Catholic Church suspends Mbaka’s adoration ministry over attack on Obi",
    "summarized_story": "Enugu Catholic Diocese, has barred all Catholics, including the clergy and laity from attending Father Ejike Mbaka’s adoration ministry, pending the conclusion of its investigation of the priest.\nHowever, the Enugu Catholic Diocese, in a letter to priests and the laity of the diocese by Bishop Callistus Onaga, its bishop, barred them from attending Mbaka’s adoration till further notice.\nThe letter released on Friday, read “In the light of the happenings in the Catholic Adoration Ministry Chaplaincy Enugu capable of undermining the Catholic faith and teachings; and after several fraternal corrections and admonitions to Fr.\nI hereby prohibit all Catholic clergy, religious and lay faithful henceforth from attending all religion and Liturgical activities of the Catholic Adoration Ministry until the the canonical process initiated by the Dices in concluded.\nCamillus Ejike Mbaka at the Catholic Adoration Ministry are not consistent with the teachings and faith of the Catholic Church“I enjoin all the Christian Faithful to keep praying for Fr."
  },
  {
    "headline": "Elumelu’s Afriland Properties enters partnership with Lagos to build Falomo Towers",
    "summarized_story": "Tony Elumelu’s Afriland Properties has signed a joint redevelopment partnership with the Lagos State Development and Property Corporation (LSDPC) to turn the former Falomo Shopping Complex to a sky-high real estate.\nAfriland Properties Plc is a subsidiary of Heir Holdings, owned by the foremost entrepreneur and banker, Mr. Tony Elumelu.\nBabajide Sanwo-Olu and the political leaders of the State for believing in the private sector.\nWhat we are witnessing today attests to their beliefs in the private sector as a driver of development in the State“For the private sector to do well, the political leadership must create the right environment.\nThis is a clear example of what Public Private Partnership (PPP) model is out to achieve when partnerships and collaborations are pursued and implemented with seriousness."
  },
  {
    "headline": "Parties Present List Of Presidential Candidates, Running Mates To INEC",
    "summarized_story": "The political parties themselves also made no attempt to present their vice presidential nominees, who are meant to help them win over voters in the presidential election, to the public.\nBesides Okowa and Wike, the Akwa Ibom State governor, Udom Emmanuel, was also in contention for the vice presidential ticket which was unofficial zoned to the South South.\nHowever, for the ruling All Progressives Congress (APC) and its presidential candidate, Bola Ahmed Tinubu, LEADERSHIP Weekend gathered that it has narrowed down the search for a vice presidential candidate to the North East geopolitical zone.\nHowever, the name of the vice presidential candidate of the APC is yet to be determined.\nHe will be the Vice Presidential Candidate of the Young Progressives Party in the 2023 Presidential election."
  },
  {
    "headline": "INEC Debuts E-transmission Of Results For Ekiti Election",
    "summarized_story": "We want to trust the efficiency of the devices and gadgets to be deployed by INEC for the election.\n“The e-transmission of election results and the use of BVAS is a very welcome development and we are we are well prepared for it,” he said.\nMeanwhile, Governor of Ekiti State, Dr Kayode Fayemi and his predecessor, Mr Ayodele Fayose, have called for peace in today’s governorship election in the state.\nSecurity operatives have tightened security in Ekiti ahead of today’s governorship election, the News Agency of Nigeria (NAN) reports.\nA resident of Ado-Ekiti, Mr Joshua Aremu, in an interview, described as impressive the security personnel deployed in the state for the election."
  },
  {
    "headline": "Ekiti Guber Poll: APC, PDP Candidate Cast Votes, Hail INEC Over BVAS",
    "summarized_story": "The duo said the technology has improved the credibility of the poll and has given the voters confidence in the electoral system.\nThere is an improvement by INEC.\n“I am coming with a change agenda and my manifesto is clear about the changes I am bringing,” Oyebanji stated.\nAlso, the Commissioner for Local Government Affairs, Prof. Adio Folayan, who voted at ward 04, unit 004 in Efon Alaaye, praised INEC for the exercise.\nBut in ward 7, the machine was not working and we are seeking replacement and we believe INEC will respond to this,” Folayan said."
  },
  {
    "headline": "Running Mate: Stop Mounting Pressure On Tinubu, Agbomhere Tells Nigerians",
    "summarized_story": "Blessing Agbomhere, has asked Nigerians to give the presidential candidate of the party, Asiwaju Bola Ahmed Tinubu, the freedom to choose whoever he prefers as a running mate.\nWe cannot afford to lose focus by being distracted about who Tinubu may decide to choose as his running mate.\n“The solution to the challenges confronting Nigeria does not rest on whether the running mate to Tinubu is Christain or Muslim.\n“Nigerians are not interested on who becomes running mate to any of the presidential candidates.\n“We are ready to support and vote for Tinubu irrespective of who he chooses as his running mate and we will work to ensure that Nigerians do the same.”"
  },
  {
    "headline": "At UNEP, Jelani Aliyu Says Africa Needs Electric Mobility More Than Other Continents",
    "summarized_story": "The Director-General of the National Automotive Design and Development Council (NADDC), Jelani Aliyu, has called on African countries and research institutions to promote and adopt electric vehicles.\nAliyu made the call on Wednesday at a three-day workshop staged by the UN Environment Programme (UNEP), which held at the UN Africa headquarters in Nairobi, Kenya.\nADVERTISEMENTAccording to him, Africa needed electric mobility more than other parts of the world.\nThis, he said, must be done without destroying the continent’s environment and that with the abundance of sustainable energy, electric mobility would be the unparalleled solution.\nIt also brainstormed on the needed support to help them improve the efficiency of their relative vehicle fleets, including developing economy and Electric Mobility policies."
  },
  {
    "headline": "BREAKING : EkitiDecides: SDP Candidate, Segun Oni Alleges Vote-buying By Other Political Partie",
    "summarized_story": "Segun Oni, the candidate of the Social Democratic Party (SDP) in the ongoing governorship election in Ekiti State says residents are being induced to vote for some political parties.\nOni disclosed this shortly after casting his vote at polling unit 006, Ward 4, Ifaki 11, Ido/Osi Local Government Area of the state.\nThe former governor who was accompanied by his wife and son voted around 10:22 am.\nWhen asked about the situation reports he had been getting from his agents across the state, he said, “Some of my agents are worried for the fact that they alleged that there is vote-buying in Ado-Ekiti, Oye and other locations across the state.\n“Although, we have captured those areas and we are awaiting what the results from there would be before taking necessary steps.”"
  },
  {
    "headline": "Enugu Diocese Bishop Bans Catholics From Attending Father Mbaka’s Adoration Ministry Over Anti-Peter Obi Comments",
    "summarized_story": "The Catholic Bishop of Enugu Diocese, Bishop Calistus Onaga has banned the Catholic faithful from attending Rev.\nEjike Mbaka’s Adoration Ministry.\nThis comes following Mbaka’s recent comments against the Labour Party’s Presidential candidate, Mr. Peter Obi, whom he called a ‘stingy man’.\nNews Direct earlier reported that Mbaka apologised to Obi and his supporters on Friday after the Enugu Diocese dissociated itself from the cleric’s utterances which it described as divisive and unbecoming of a priest.\nHowever, in a letter Bishop Onaga personally signed, which was addressed to ‘All the Clergy, Religious and Lay Faithful in the Catholic Diocese of Enugu’, the diocese banned Catholics from having anything to do with the Adoration Ministry."
  },
  {
    "headline": "Alleged N321bn fraud: Court quashes report indicting 2 ex-Bauchi Govs",
    "summarized_story": "Both Yuguda and Abubakar, who served as governors between 2007 and 2019, had approached the court to challenge the legal validity of the probe committee which they contended was constituted under a repealed law.\nMeanwhile, Bauchi State Government, through its Attorney-General, shunned the suit.\nThe court said there was nothing before it to establish that the panel was validly set up.\n“Without evidence of the executive instrument or order of the 5th defendant (Bauchi State Government) which established the said committee, it means that the 5th defendant has not effectively controverted the assertion of the plaintiffs.\n“Furthermore, since the executive instrument is in the possession of the 5th defendant and it failed or refused to produce it in either their counter affidavit or further counter-affidavit, it in my opinion means that it is being withheld by the 5th defendant.”"
  },
  {
    "headline": "Vice Presidential Candidate: Tinubu Has Named Kabiru Masari As Running Mate – Faskari",
    "summarized_story": "The All Progressives Congress (APC) presidential candidate Bola Tinubu has named Kabiru Masari as his running mate for the 2023 elections.\nA chieftain of the party Kabiru Faskari said this during an interview on Channels Television’s Politics Today.\n“Ibrahim Kabiru Masari is our vice presidential nominee.\nHe is quite close to the presidential candidate and has been with him for a very long time,” he explained.\n“I think what it is is that it was the decision of the presidential candidate after due diligence,” the APC chieftain added."
  },
  {
    "headline": "2023: Kwankwaso reveals NNPP ‘s alliance talks with Peter Obi ‘s Labour Party",
    "summarized_story": "The presidential candidate of the New Nigeria People’s Party (NNPP) and former governor of Kano state, Senator Rabiu Kwankwaso, has announced that his party is in talk with his Labour Party counterpart, Peter Obi, about forming a coalition ahead of 2023 general election.\nSpeaking with newsmen on Saturday, he said they were looking into the possibility of merging in order to win the presidential election in 2023.\nAccording to him; “We are really talking to Peter Obi, or at least saying that the committee is working on it (and cooperating with him), and friends and family are coming to talk to us about it,” he said.\nHe assured that only a merger will allow them to defeat either the All Progressive Congress or the People’s Democratic Party.\nPeter Obi’s Campaign Director General, Doyin Okupe, had on Friday claimed that Nigeria is witnessing the greatest political coalition in its history."
  },
  {
    "headline": "Happening now: Accreditation, voting begin as many troop out to elect Fayemi’s successor in Ekiti [PICTURES]",
    "summarized_story": "As electorate in Ekiti state troop out on Saturday June 18, 2022 to elect new governor, accreditation and voting have started at various polling units.\nThe process started at exactly 8:30am at polling units 2, 3 and 4 at ward 6 Oke-Inyimi in Ado-Ado Ekiti.\nIndependent National Electoral Commission (INEC) officials are using the Bimodal Voter Accreditation System (BVAS) to accredit, voting happens at the same time.\nINEC had introduced the BVAS machine during the November 18, 2021 governorship election in Anambra state.\nShare this: TwitterFacebook"
  },
  {
    "headline": "[Breaking] Stingy comment: Catholic church bans members from attending Father Mbaka’s adoration ministry",
    "summarized_story": "The Catholic Church has prohibited the founder of Adoration Ministry, Enugu, Nigeria (AMEN), Rev.\nEjike Mbaka and catholic faithfuls from attending religious activities of the adoration ministry following continuous outburst that allegedly smeared the image of the church.\nIn a statement late Friday, the Catholic bishop of Enugu diocese, Most Rev.\n“I hereby prohibit all Catholics (clergy, religious and layfaithful) henceforth from attending all religious and liturgical activities of the Catholic adoration ministry until the due canonical process initiated by the diocese is concluded.\nCamillus Ejike Mbaka at the Catholic adoration ministry are not consistent with the teachings and faith of the catholic church."
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "Ekiti Election: EFCC Arrests Persons Engaged In Vote Buying",
    "summarized_story": "﻿The Economic and Financial Crimes Commission (EFCC) has arrested persons alleged to have engaged in vote buying in the Ekiti governorship election.\nThe EFCC is part of security agencies deployed to monitor the election.\nParading some of the suspects at the Oke Ori Omi Area Division of the Nigerian Police Force, the suspects were said to have been caught with monies allegedly used to induce voters, an act the EFCC officials say were carried out surreptitiously.\nThe EFCC thereafter proceeded to burst another residence where some persons were caught with a book containing details of voters of certain voting area."
  },
  {
    "headline": "2022 Ekiti Elections: Channels Television, YIAGA Africa Launch Election Results Analysis Dashboard",
    "summarized_story": "Channels Television and Yiaga Africa have launched an Election Results Analysis Dashboard (ERAD) to promote transparency of election results.\nThe dashboard is based on official results uploaded on the INEC’s Results Viewing Portal (IReV).\nThe real-time publishing of polling unit-level results and transmission of results using the IReV demonstrates INEC’s commitment to transparency in results management.\nThis commitment is backed by the Electoral Act 2022, which confers INEC with powers to transmit election results electronically.\nTo achieve this goal, the Election Results Analysis Dashboard will be embedded within the election-day broadcast of Channels Television."
  },
  {
    "headline": "Vice Presidential Candidate: Tinubu Has Named Kabiru Masari As Running Mate – Faskari",
    "summarized_story": "The All Progressives Congress (APC) presidential candidate Bola Tinubu has named Kabiru Masari as his running mate for the 2023 elections.\nA chieftain of the party Kabiru Faskari said this during an interview on Channels Television’s Politics Today.\n“Ibrahim Kabiru Masari is our vice presidential nominee.\nHe is quite close to the presidential candidate and has been with him for a very long time,” he explained.\n“I think what it is is that it was the decision of the presidential candidate after due diligence,” the APC chieftain added."
  },
  {
    "headline": "I Am ‘Standing In’ As Vice Presidential Candidate Of Labour Party – Doyin Okupe",
    "summarized_story": "Former presidential spokesperson Dr Doyin Okupe on Friday said he is ‘standing in’ as vice presidential candidate of the Labour party.\nHowever, Dr Okupe might be a placeholder to beat INEC’s deadline for the submission of the name of a vice presidential candidate.\n“INEC allows you to present a candidate and later on, if you want to substitute, you may do so, if necessary.\n“So the present situation is that we believe that this Labour party government that is essentially going to be about young Nigerians.\n“I am willing to put down my back, so that young people can stand and come to the top.”"
  },
  {
    "headline": "Minister of Trade and Investment, Niyi Adebayo, commends INEC -",
    "summarized_story": "Minister of Industry, Trade and investment, Niyi Adebayo, has commended INEC for introducing technology into Nigeria’s electoral process saying it could have helped him earn a second term in 2003.\nOtunba Niyi Adebayo was the Governor of Ekiti State under the platform of the Alliance for Democracy in Ekiti State at the return of Democracy in 1998.\nBoth Otunba Niyi Adebayo and Ayodele Fayose have been prominent since then in the Politics of Ekiti State as Godfathers to governors or even Governors themselves.\nThe 2007 election was contested by Kayode Fayemi of the Action Congress and Segun of the Peoples Democratic Party with Kayode Fayemi enjoying the support of Otunba Niyi Adebayo and Ayodele Fayose while Segun Oni was backed by Chief Afe Babalola and Olusegun Obasanjo.\nThe election eventually went the way of Kayode Fayemi after Segun was initially sworn in as Governor followed by a re-run election and an Election Petition that lasted over 3 years."
  },
  {
    "headline": "Ekiti Governorship Election live Updates",
    "summarized_story": "As at 7am, some voters are still checking their names to confirm that they are in the right polling unit.\n7:05am: Corps members are still pasting the lists on the school walls.\n7:30am: Arrival of electoral officers at Afao ward 1 unit 8INEC ad hoc staff mixing gum to paste information about the election.\nArrival of voting materials at Ifaki 2 , polling unit 010, Ekiti North Senatorial District.\nThe process here has been peaceful and voters have maintained reasonable orderliness=================================================A 105 old woman, Felicia Fayomi expresses happiness casting her vote."
  },
  {
    "headline": "2023: Shaibu hails Okowa as Atiku's running mate",
    "summarized_story": "Deputy Governor of Edo State, Philip Shaibu has hailed Governor Ifeanyi Okowa over his emergence as the running mate of the People’s Democratic Party, (PDP) presidential candidate, Atiku Abubakar.\nAs a Governor, Okowa has positioned himself as a moral compass for government.\nShaibu in his congratulatory message, described Governor Okowa as a goal-getter and achiever who is driven by faithfulness to God and patriotism to humanity.\nHe will surely engage his astute brilliance and dogged determination in adding value to the efforts of rescuing the nation.\nThe deputy Governor, Philip Shaibu appealed to Nigerians not to write off the country but be patient and support Atiku and Okowa in rewriting our story and in putting Nigeria in a proper perspective."
  },
  {
    "headline": "APC Presidential candidate, Tinubu meets Governor Uzodinma -",
    "summarized_story": "Presidential candidate of the All Progressive Congress, Asiwaju Bola Tinubu said his visit to the Governor of Imo State, Hope Uzodinma is to discuss plans for the party’s presidential campaign ahead of the 2023 Elections.\nAsiwaju Tinubu who has been mending fences with other presidential aspirants and meeting with some leaders of the party to seek their support, believes the party needs to be united to secure victory at the polls.\nHe admits that the closed door meeting with Governor Uzodinma is inline with plans to ensure that all hands are on deck for APC to retain power at the federal.\nThe Imo State Governor expressed optimism that Asiwaju Tinubu will win the presidential election."
  },
  {
    "headline": "Migrants Due for Removal from the UK Could Be Electronically Tagged",
    "summarized_story": "Some asylum claimants who arrived in the UK in small boats or in the back of lorries could be electronically tagged under a new Home Office trial.\nThe first to be tagged will likely be people who successfully challenged their removal to Rwanda this week.\nThe pilot comes days after the first flight taking asylum seekers from the UK to Rwanda was cancelled following a last-minute intervention by the European Court of Human Rights (ECHR).\nIt is unclear exactly how decisions will be made on who to tag, but Home Office guidance says it will not include children or pregnant women.\nThe Rwanda plan, announced by the government in April, intends to give some migrants who cross the Channel to the UK a one-way ticket to Rwanda to claim asylum there instead."
  },
  {
    "headline": "Remains of British Journalist Found in Amazon, Police Name New Suspect",
    "summarized_story": "A forensic exam carried out on human remains found in the Amazon rainforest confirmed on Friday that they belonged to British journalist Dom Phillips, Brazil’s federal police said, adding that a search was underway for a man suspected of involvement in his killing.\nPereira and Phillips vanished on June 5 in the remote Javari Valley bordering Peru and Colombia.\nHe is the third suspect named by police after Oliveira and his brother, Oseney da Costa, who was taken into custody this week.\n“We all know that violence in the Javari Valley is linked to a wide chain of organized crime,” it said in a separate statement.\nPolice said they were still searching for the boat Phillips and Pereira were traveling in when they were last seen alive."
  },
  {
    "headline": "I’m from Delta State and Definitely an Igbo Man, Says PDP Vice Presidential Candidate Okowa",
    "summarized_story": "Delta State Governor, Ifeanyi Okowa, has said he regards himself as an Igbo man from the South-south geopolitical zone of the country and that even though it did not come as a surprise to him, he was lucky to have been chosen to be the running mate to the Presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubarkar.\nOkowa said he was lucky to have gotten the position of Vice Presidential candidate, because there were other equally qualified people in the party.\nAccording to Okowa, the PDP had to throw open its presidential contest because the time was too short to adhere to an understanding that the next president of Nigeria should come from the Southern region.\nWithin the PDP, we felt that the time was rather too short with regard to zoning to a particular part of the country.\nOkowa said he was not unmindful of the fact that some of his colleagues would have been able to get the ticket but that at the end of the day, he was the lucky one."
  },
  {
    "headline": "Owo Massacre: Ondo Governor Akeredolu Weeps at Burial, Laments Failure to Protect Citizens",
    "summarized_story": "Akeredolu made the declaration during the funeral Mass for 18 of the victims, held at the Mydas Resort and Hotel, Owo.\nAkeredolu, who wept during his speech, said the government failed to protect the victims of the terror attack.\nBut as at the last count, these animals came to the church and murdered 40 people.” governor Akeredolu said.\nResponding, the Bishop of Ondo Catholic Diocese, Dr. Jude Arogundade declared that Akeredolu had not failed in protecting his people.\n“Indeed, the event catapulted Ondo State, the Catholic Diocese of Ondo and Nigeria into the limelight of world attention, unfortunately, for the wrong reason."
  },
  {
    "headline": "Nigeria: Oyebanji, Oni, Kolawole in Three-Horse Race to Succeed Fayemi as Ekiti Governor",
    "summarized_story": "Thousands of voters will on Saturday file out in Ekiti State to elect a new governor that will succeed Kayode Fayemi who is at the tail end of his second four-year tenure.\nThe electoral umpire had earlier revealed that 988,923 voters captured in the Commission’s register would decide who becomes the new Ekiti State Governor.\nAs strong as Oni is in Ekiti North, he will meet a match in Fayemi, who is from the area.\nThe Director General, Biodun Oyebanji campaign council, Cyril Fasuyi, is also from Ekiti North.\nBut Segun Oni still has visible and electrifying presence in Ido/Osi, Moba and IlejemejeAPC also has influential politicians in Ekiti North."
  }
]