[
  {
    "headline": "Reps urge FG to protect schools against mass abductions",
    "summarized_story": "The House of Representatives has called on the Federal Government to enhance security around schools across Nigeria to protect students and workers against mass abductions.\nAt the plenary on Tuesday, the House particularly urged the Federal Ministry of Education to work out appropriate modalities for the provision of basic security and safety measures to protect schools in the country.\nThe House also mandated the Committees on Basic Education and Services; Tertiary Education and Services; and Legislative Compliance to ensure compliance with the resolution.\nHe said, “The House is cognisant of the need to deploy modern technology in the provision of basic security measures in schools.”Copyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "OAU pushes ahead with airstrip project",
    "summarized_story": "The management of the Obafemi Awolowo University, Ile Ife, Osun State, on Tuesday said it planned to construct airstrip for the training of aeronautic engineers.\nOgunbodede, who reeled out several accomplishments of the institution since its establishment in 1961, explained that the airstrip project would be done in conjunction with relevant government agencies and corporate organisations.\nAccording to the Vice Chancellor, when completed, the university would generate its own electricity, adding that Transmission Corporation of Nigeria had issued marketing license as an electricity distributor to the institution.\nHe added that the OAU was among few universities with 100 per cent accreditation of their programmes in the country.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Increase HIV fight to end AIDS ‘epidemic of inequalities’ by 2030 — UN",
    "summarized_story": "The UNGA President acknowledged that AIDS-related deaths had reduced by 61 per cent since the peak in 2004.\n“Put simply: AIDS is an epidemic of inequalities; to end AIDS by 2030, we must end inequalities,” the UN top official said.\n“If we are to deliver the 2030 Agenda for Sustainable Development, all Member States must re-commit to ending the AIDS epidemic by 2030.\nAs the world stands firm in galvanising action to address the COVID-19 pandemic, the Assembly President said that “now” is the time to “re-commit to our 2030 targets and accelerate our efforts to end AIDS by 2030”.\n“To end AIDS, we need to end the intersecting injustices that drive new HIV infections and prevent people from accessing services,” she said."
  },
  {
    "headline": "NDDC board: Sylva, Akpabio maintain good relationship – Aide",
    "summarized_story": "The Minister of State for Petroleum Resources, Chief Timipre Sylva, says there is no rift between him and Minister of Nigeria Delta Affairs, Sen. Godswil Akpabio, over the constitution of the board of the Niger Delta Development Commission (NDDC).\nSylva disclosed this in a statement by his Media Aide, Mr Julius Bokoru, in Abuja on Tuesday.\n“The duo consider themselves brothers and comrades in the quest for building a more prosperous Niger Delta and a stronger Nigeria.\n“The fake, divisive article is intended to create anxiety in the Niger Delta region to the desperate ends of its sponsors which is to create needless tension and chaos.\n“The public is thereby advised to disregard the report as it is totally untrue, malicious and engineered purely for mischief."
  },
  {
    "headline": "Kalu cautions perpetrators of violence in South-East",
    "summarized_story": "Sen. Orji Uzor-Kalu (APC-Abia) has advised individuals sponsorship violence in the South East to stop as it is not in the interest of the people.\nKalu, also Senate Chief Whip of Senate in a statement on Tuesday in Abuja.\nKalu urged the masterminds of the violence to have a rethink of their actions, while advising them to choose a legitimate means of expressing their grievances.\nKalu added:“We should not either by words or actions pursue a repetition of the 1967 horrible genocide.\n“Is it not wiser to come to table and avoid destruction?, we need infrastructure , we need investments , we don’t need hostilities."
  },
  {
    "headline": "Gov Makinde promises to end insecurity in Ibarapa land",
    "summarized_story": "Seyi Makinde of Oyo State on Tuesday promised to empower local security guards and members of vigilance group to end insecurity in Ibarapa land.\nMakinde’s visit followed the last Saturday night attack on Igangan community in Ibarapa axis of Oyo State by yet to be identified gunmen.\nMakinde, however, vowed that his government would do everything possible to prevent a recurrence of the violent attacks on Igangan and other communities in the state.\nMakinde, also pledged that such bad occurrences would never happen again in Igangan or anywhere in the state.\nI urge all the families that lost their loved ones to this attack, because sometimes, emotion can really be high."
  },
  {
    "headline": "Cleric explains Islam views on early marriage",
    "summarized_story": "The Chief Imam of the Nasrul-lahi-li Fathi Society of Nigeria (NASFAT), Abdul Azeez Onike, says that Islam does not support any underage marriage which exposes the wife to dangers.\nAccording to him, the scripture is clear about marriage instead of using contemporary standards to determine it.\nIf medically a child, because of age, is exposed to sexually transmitted infections, death at childbirth, such marriage is unjust.\n“As a person, you must be seen to be promoting mercy and any form of violence against women and girls, God frowns at it.\nHe noted that Islam is a religion of peace and must be seen to be promoting that in all ramifications."
  },
  {
    "headline": "N-Power: Nigerian govt updates Batch C applicants on next actions",
    "summarized_story": "Nigerian Government has provided applicants of the next batch of the social investment programme, N-Power with some vital updates.\nSadiya Umar Farouq, the Minister of Humanitarian Affairs, Disaster Management and Social Development, said that candidates who registered to be part of the Batch C of the N-Power programme should keep their application details handy.\nShe said the prospective participants will be communicated with call centre establishment to that effect, adding that the final enrollment of the applicants was getting close.\nShe further explained that the e-mail notifications sent to the shortlisted candidates contains detailed instructions on next steps of the enrollment.\nSoutheast youths urged to take advantage of N-Power Batch C enrolment"
  },
  {
    "headline": "BPP DG asks lawmakers to make laws to regulate birthdate in Nigeria",
    "summarized_story": "The Director-General of Bureau Public Procurement (BPP), Mamman Amadu, has asked the National Assembly to make laws to regulate birth.\nAmadu said the law should regulate the number of children can be born, in a bid to check population explosion.\nAccording to the lawmaker, Nigeria’s population was 59 million at independence, now it is over 200 million.\nA disguised attempt to regulate social media – NBA threatens action over Twitter ban“Our country is young.\nApart from that, you all know that about the time of our independence, we were about 59 million, today we are about 200 million."
  },
  {
    "headline": "Twitter ban: Buhari fighting against God",
    "summarized_story": "Bishop announces new prophecy about Nigeria’s breakup, Igbo presidencyHighlighting the sequence of events since the ban, the Bishop noted that it was the Attorney General of the Federation who issued the threat of prosecution against anyone who dared the Twitter ban.\nHe explained that since the pronouncement of the ban by the Minister of Information, Lai Muhammed, no prominent Northern personality has spoken out against the Twitter ban.\nThe Osun based cleric cautioned Buhari and his cabinet to stop fighting against God by his actions.\nTherefore, President Buhari should within seven days reverse his decision and unban Twitter.\nBishop Adeoye praised Pastor Enoch Adeboye and Pastor Williams Kumuyi who relied on the United Nations article which Nigeria is a signatory to by totally rejecting the Islamic agenda of President Buhari over the Twitter ban."
  },
  {
    "headline": "Iganga attack: I am responsible, it will not happen again",
    "summarized_story": "Governor Seyi Makinde of Oyo State, on Tuesday, said that people of Ibarapa geo-political zone should hold him responsible for the recent attack that occurred in Iganga.\nIganga is one of the towns in Ibarapa North local Government Area of the state.\nDAILY POST recalls that the latest attack was the killing of about twenty people during an attack that occurred at Iganga between Saturday and Sunday.\nMakinde, who spoke during a visit to the town on Tuesday, declared that he was the one to be held responsible for what happened.\n“I have told your chairman that all the vigilantes and security guards, the government will be responsible for them."
  },
  {
    "headline": "June 12: Deal with whoever threatens our security",
    "summarized_story": "The Inspector-General of Police (IGP), Usman Alkali Baba, has ordered Zonal Assistant Inspectors General of Police and Commissioners of Police in the 36 states and FCT, to deal firmly with anybody or group of persons, who may want to take advantage of June 12 celebrations to threaten internal security order.\nHe whoever warned officers to remain civil with law abiding citizens.\nIGP, Alkali redeploys 2 DCPs, 14 Assistant Commissioners of Police, others“June 12 Democracy Day is days away.\nWe’re currently reviewing the security situation, with a view to ensuring a hitch-free exercise.\nBaba’s directive comes amid speculation there might be protests around the country on June 12."
  },
  {
    "headline": "VPN can expose your bank accounts, data to hackers, APC warns Nigerians",
    "summarized_story": "By Jide Orintunsin, AbujaThe All Progressives Congress (APC) has warned Nigerians to avoid the use of Virtual Private Network (VPN) in accessing social media contents.\nIt also said warned that bank accounts and data of users of the communication platform are vulnerable to hackers.\n“The APC emphasises that VPN users expose their devices to vulnerabilities because the network allows third parties access to personal data and changes user location to another country, which compromises data integrity.\n“Many individuals and organisations using VPN have lost their investments after compromising the security of their devices.\nThe APC strongly advises that Nigerians should avoid installing or using VPN to access social networking sites in order to protect their privacy and security online."
  },
  {
    "headline": "INEC asked to okay Diaspora voting in 2023",
    "summarized_story": "By Osagie Otabor, AkureA political advocacy group, One Nation, One Destiny Advocacy and Awareness Initiative, on Tuesday urged the Independent National Electoral Commission (INEC) to amend the Electoral Act to make provision for Nigerians in the Diaspora to participate in the 2023 elections.\nThe group said taking such a step ahead of the polls would help to build a new, affectionate and united Nigeria.\nRead Also: INEC set to publish new polling unitsHajia Lamisila emphasised the essence of love and unity for establishing oneness and togetherness in then country.\nShe urged relevant government agencies to sensitise Nigerians for a national rebirth.\nThe activist also urged Nigerians to rekindle the passion for love and unity among the citizenry to save the nation from disintegration."
  },
  {
    "headline": "Fed Govt to JUSUN: reopen courts",
    "summarized_story": "This was the outcome of Tuesday’s parley of the Presidential Implementation Committee on the Autonomy for the Judiciary and Legislature with stakeholders and how to end the JUSUN strike.\nOther stakeholders at the meeting are: the Chief Justice of Nigeria (CJN) Justice Ibrahim Tanko Muhammad, members of the National Judicial Coouncil (NJC) and JUSUN representatives.\nThe presidential panel’s parley also focused on how to reopen the courts nationwide because of the increasing number of suspects awaiting trial.\nThe CJN also pleaded with JUSUN to shelve its strike because of outstanding cases.\nIt was learnt that the only outstanding issue is the reopening of the courts and Houses of Assembly."
  },
  {
    "headline": "House passes Bill seeking to regulate political parties",
    "summarized_story": "By Tony Akowe, AbujaThe House of Representatives on Tuesday passed for second reading a Bill seeking to alter the provisions of 1999 Constitution to strengthen political parties’ structures in the country.\nThe Bill, which has been referred to the Special Ad Hoc Committee on the Review of the 1999 Constitution, also seeks to regulate the political parties that should contest elections in the country.\nADVERTISEMENTHe said when passed, the proposed law would further help to structure political parties in the country.\nBut opposing the Bill, Nkem Abonta (PDP, Abia) said there was need to respect the freedom of association, hence excluding a party for political participation was not in the spirit of the constitution.\nWhen the Bill was put to a voice vote, majority of the lawmakers voted in its favour."
  },
  {
    "headline": "BREAKING: Federal Secretariat, Asaba on fire",
    "summarized_story": "From Paul Osuyi, AsabaA mysterious fire has engulfed the Federal Secretariat complex along Okpanam Road in Asaba, Delta State capital.\nAt the moment, the raging inferno seems to have overwhelmed the fire fighting machinery stationed at the complex.\nEven the state fire service is not up to the task of putting out the fire.\nBut our correspondent learnt that a reinforcement is being mobilised from the fire service at Asaba Airport to help contain the situation.\nThe secretariat complex houses most annex offices of Federal ministries, departments and agencies in the state."
  },
  {
    "headline": "Kalu cautions masterminds of insecurity in South East, warns against repetition of 1967 genocide",
    "summarized_story": "Instead of destructions before coming to the table, is it not wiser to come to table and avoid destruction?\nOn the killing of innocent young people, kalu charged the security agencies to desist from harassment , molestation and killing of innocent young people in the region.\nHe said he is worried that some security agents have been reported to be killing innocent souls .\n“ It is better to thoroughly conduct your investigations and avoid the indiscriminate killings of young innocent Igbo men .\nOur people have raised alarm and we are very worried at the rate of disappearance and deaths of innocent young men ."
  },
  {
    "headline": "Kalu bags award on constituency devt",
    "summarized_story": "From Kenneth Udeh, AbujaIn recognition of his responsive representation and execution of numerous constituency projects as a first time senator, former governor of Abia State and Senate Chief Whip, Dr. Orji Uzor Kalu, has been honoured with the constituency development award at the Senate Press Corps 2021 award ceremony.\nThe media body which comprises the nation’s print and online media houses, presented the award to Dr. Kalu at a ceremony in Abuja which had in attendance the Senate President, Ahmed Lawan, his deputy, Ovie Omo Agege, Ajibola Bashiru, principal officers of the Senate and other members.\nThe Senate Press Corps Chairman, James Itodo, said the body unanimously decided to bestow the award on Kalu in recognition of his commitment and capacity despite being a first time legislator to bring so much transformation to his Abia North constituency.\nItodo said Kalu’s execution of projects in all the local government areas in Abia North -Arochukwu, Bende, Isuikwuato, Ohafia and Umenneochi, are worthy of emulation and deserves commendation.\nOthers who received awards included Lawan, Governors Yahaya Bello (Kogi), Hope Uzodimma (Imo), Douye Diri (Bayelsa) and Ifeanyi Okowa (Delta)."
  },
  {
    "headline": "El-Rufai, Akeredolu, Fayose, Adeboye, Kumuyi, Sani shun Twitter ban",
    "summarized_story": "From Magnus Eze, Enugu and Aidoghie Paulinus, AbujaFour days after the Federal Government slammed indefinite ban on use of Twitter, prominent Nigerians have continued to flout the order.\nExplaining why Deeper Life Church would remain active on Twitter, Kumuyi said his tweets were targetted at over 100 nations where the church has branches.\nHe said the church made use of Twitter to share contents from any of the locations across the five continents.\nIt, however, remains unclear if the order from the office of the AGF would be effected on, Adeboye, El-Rufai, Akeredolu and other “offenders”.\nHe also said the meeting was in their usual friendly way, to discuss and share opinions with respect to the Twitter ban and clarify certain things."
  },
  {
    "headline": "Imo police boss probes killing of German-based businessman",
    "summarized_story": "The CP, in a statement issued by the command’s Spokesperson, Bala Elkana, assured that his office would ensure that justice prevailed.\n“The deceased person is alleged to have been shot by personnel suspected to be staff of 211 Regiment of the Nigerian Air Force, responsible for the security of the International Airport.\nA survivor stated that one of the Air Force operatives shot the car of Oguchi when he failed to stop at the Air Force checkpoint after they had flagged him down.\n“According to the Air Force, being suspicious of the mission of the occupants of the said vehicle at the International Airport, they made an effort to demobilise the vehicle.\nHe was, however, rushed to the hospital by the Air Force team for medical attention, where the doctors on duty made frantic efforts to stabilise him."
  },
  {
    "headline": "Video: President Macron Slapped in the Face During Visit to Southeastern France",
    "summarized_story": "BY REUBEN ABATI “Omo, I see you are still on Twitter.\nHow you dey take do am?\nCome and teach your brother…” “Eishhh, Ishhh…Will you keep..."
  },
  {
    "headline": "Senate in Close-door Session",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe Senate at the resumption of plenary on Tuesday went into a close-door session.\nThe upper chamber after the opening prayer was said by the President of the Senate, Dr Ahmad Lawan, dissolved into an executive session.\nThe outcome of the meeting is expected to be made public by Lawan later before the Senate plenary resumes.\nDetails later..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "News in Photographs: Security Council Meeting Under way in State House",
    "summarized_story": "By Deji ElumoyeAn emergency National Security Council (NSC) meeting is on-going at the State House, Abuja with President Muhammadu Buhari presiding.\nThe meeting holding at the Conference Hall of the Office of the First Lady, is being attended by Vice President Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha; Chief of Staff to the President, Prof Ibrahim Gambari; Ministers of Defence, Major-General Bashir Magashi (rtd), Foreign Affairs, Geoffery Onyema; and the National Security Adviser, Major General Babagana Monguno (rtd.).\nAlso attending the ‘crucial’ meeting are the Chief of Defence Staff, General Lucky Irabor; Chief of Army Staff; Major General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Zubairu; Chief of Air Staff, Air Marshal Isiaka Amoo ; Inspector General of Police, Usman Baba; the Director-General, National Intelligence Agency (NIA), Ahmed Rufa’i, the Director General of the Department of State Services, Yusuf Bichi and other presidential aides.\nThe meeting is expected to review the current security situation in the country.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Twitter Loses Billions, Nigerians Lose Instant Communication Tools",
    "summarized_story": "For Twitter the saga has cost it billions of cash, while Nigerians, in both private and public sectors have lost their means of instant communication.\nMany Nigerians, have, however, circumvented the federal government’s blockage of the micro-blogging facility, resorting to the virtual private network (VPN) to connect Twitter.\nHowever, the federal government’s directive suspending Twitter’s operations in Nigeria was silent on whether or not Nigerians should deactivate their accounts.\nChecks by THISDAY yesterday showed that Twitter accounts belonging to government Ministries, Departments and Agencies (MDAs) are also being retained.\nNBC Orders Broadcast Stations to Suspend Twitter PatronageThe National Broadcasting Commission (NBC) has ordered all broadcast stations to suspend the patronage of Twitter with immediate effect."
  },
  {
    "headline": "Uneasy Calm over Buni’s Alleged Plans for APC Chairmanship",
    "summarized_story": "The sources said a self-succession motive by Buni to become the substantive national chairman is currently stalling moves to hold a national convention.\nBut after 12 months in office, no date has been announced for the election of the executive committee members.\nBefore winning the election to become the governor, he was the national secretary of APC when Oshiomhole was the national chairman.\nSome of the APC members who did not want to be quoted said they had concluded plans to seek legal action against any plans by the committee members to self-perpetuate themselves in office.\nHe stated: “The president has not agreed with what the caretaker committee is trying to do as regards another elongation."
  },
  {
    "headline": "REVEALED: How Malami Downloaded VPN, Logged Into Twitter To Deactivate Account",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami (SAN), on Tuesday logged into Twitter and deactivated his account using Virtual Private Networks (VPN), a screenshot posted by the minister has showed.\nMalami had on Saturday threatened to prosecute Nigerians who were still using VPN to access the micro blogging platform.\nVPN is a connection that allows users to establish a protected network connection when using public networks.\nBREAKING: Nigeriaâ\u0080\u0099s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account | Sahara Reporters https://t.co/SQF0PBodx2 pic.twitter.com/D3zHennjvF — Sahara Reporters (@SaharaReporters) June 8, 2021Malami took to his Facebook page on Tuesday, posting a screenshot from the Twitter app showing his account has been deleted.\nDespite his threat, many Nigerians have been using VPN to access Twitter."
  },
  {
    "headline": "REVEALED: How Malami Downloaded VPN, Logged Into Twitter To Deactivate Account",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami (SAN), on Tuesday logged into Twitter and deactivated his account using Virtual Private Networks (VPN), a screenshot posted by the minister has showed.\nMalami had on Saturday threatened to prosecute Nigerians who were still using VPN to access the micro blogging platform.\nVPN is a connection that allows users to establish a protected network connection when using public networks.\nBREAKING: Nigeriaâ\u0080\u0099s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account | Sahara Reporters https://t.co/SQF0PBodx2 pic.twitter.com/D3zHennjvF — Sahara Reporters (@SaharaReporters) June 8, 2021Malami took to his Facebook page on Tuesday, posting a screenshot from the Twitter app showing his account has been deleted.\nDespite his threat, many Nigerians have been using VPN to access Twitter."
  },
  {
    "headline": "BREAKING: Nigeria’s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account",
    "summarized_story": "Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, has defied the Nigerian government’s Twitter ban.\nDespite his threat, many Nigerians have been using Virtual Private Networks to access Twitter.\nIn a post on his verified Facebook page on Tuesday, the Attorney General posted a screenshot from the Twitter app showing his account has been deleted.\n“My Twitter account deactivated,” he wrote.\nHowever, checks by SaharaReporters showed that a Twitter account can’t be deactivated unless you have access to the app, meaning Malami must have logged in to deactivate it."
  },
  {
    "headline": "BREAKING: Nigeria’s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account",
    "summarized_story": "Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, has defied the Nigerian government’s Twitter ban.\nDespite his threat, many Nigerians have been using Virtual Private Networks to access Twitter.\nIn a post on his verified Facebook page on Tuesday, the Attorney General posted a screenshot from the Twitter app showing his account has been deleted.\n“My Twitter account deactivated,” he wrote.\nHowever, checks by SaharaReporters showed that a Twitter account can’t be deactivated unless you have access to the app, meaning Malami must have logged in to deactivate it."
  },
  {
    "headline": "BREAKING: Nigeria’s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account",
    "summarized_story": "Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, has defied the Nigerian government’s Twitter ban.\nDespite his threat, many Nigerians have been using Virtual Private Networks to access Twitter.\nIn a post on his verified Facebook page on Tuesday, the Attorney General posted a screenshot from the Twitter app showing his account has been deleted.\n“My Twitter account deactivated,” he wrote.\nHowever, checks by SaharaReporters showed that a Twitter account can’t be deactivated unless you have access to the app, meaning Malami must have logged in to deactivate it."
  },
  {
    "headline": "Trump 'congratulates' Nigeria for 'banning' Twitter",
    "summarized_story": "Former US President Donald Trump has “congratulated” Nigeria over the recent suspension of the operations of Twitter in the country.\nAdvertisementOn June 4, Lai Mohammed, minister of information, had announced the “indefinite” suspension of Twitter in Nigeria for allowing its platform to be used for activities that “undermine Nigeria’s corporate existence”.\nIn a statement on Tuesday, Trump congratulated the federal government on the decision, and urged other countries to follow suit.\nAdvertisement“Congratulations to the country of Nigeria, who just banned Twitter because they banned their President.\n2024?”Trump’s statement comes days after Facebook banned him from accessing his social media accounts for two years."
  },
  {
    "headline": "Trump 'congratulates' Nigeria for 'banning' Twitter",
    "summarized_story": "Former US President Donald Trump has “congratulated” Nigeria over the recent suspension of the operations of Twitter in the country.\nAdvertisementOn June 4, Lai Mohammed, minister of information, had announced the “indefinite” suspension of Twitter in Nigeria for allowing its platform to be used for activities that “undermine Nigeria’s corporate existence”.\nIn a statement on Tuesday, Trump congratulated the federal government on the decision, and urged other countries to follow suit.\nAdvertisement“Congratulations to the country of Nigeria, who just banned Twitter because they banned their President.\n2024?”Trump’s statement comes days after Facebook banned him from accessing his social media accounts for two years."
  },
  {
    "headline": "Presidency: Documentary recognising Abiola as 1993 election winner to premiere June 12",
    "summarized_story": "The presidency says a documentary titled ‘Nigeria: Consolidating Democracy and National Unity’ in recognition of Moshood Kasimawo Abiola, as winner of the 1993 presidential election, will premiere on June 12.\nAdvertisementGarba Shehu, presidential spokesman, disclosed this in a statement on Tuesday.\nAccording to Shehu, the documentary will be aired on the Nigeria Television Authority (NTA) and Channels TV.\nThe presidential spokesman explained that the documentary is to commemorate the third year of officially recognising June 12 as Democracy Day.\nAdvertisementPresident Muhammadu Buhari, in 2018, had declared June 12 as the new date for the celebration of Democracy Day to honour MKO Abiola, the presumed winner of the 1993 election."
  },
  {
    "headline": "Presidency: Documentary recognising Abiola as 1993 election winner to premiere June 12",
    "summarized_story": "The presidency says a documentary titled ‘Nigeria: Consolidating Democracy and National Unity’ in recognition of Moshood Kasimawo Abiola, as winner of the 1993 presidential election, will premiere on June 12.\nAdvertisementGarba Shehu, presidential spokesman, disclosed this in a statement on Tuesday.\nAccording to Shehu, the documentary will be aired on the Nigeria Television Authority (NTA) and Channels TV.\nThe presidential spokesman explained that the documentary is to commemorate the third year of officially recognising June 12 as Democracy Day.\nAdvertisementPresident Muhammadu Buhari, in 2018, had declared June 12 as the new date for the celebration of Democracy Day to honour MKO Abiola, the presumed winner of the 1993 election."
  },
  {
    "headline": "Makinde: If we're given licence, I'll buy AK-47 rifles for Amotekun",
    "summarized_story": "Seyi Makinde, governor of Oyo, says if the law permits, he would prefer that operatives of the Western Nigeria Security Network, codenamed Amotekun, carry AK-47 rifles to boost security operations.\nAccording to him, challenges facing the nation would have been effectively addressed, if state governments are given the power to control security operatives in their states.\nAnyone who has been involved in security at any level will tell you that policing is local,” Makinde said, according to a statement by Taiwo Adisa, his spokesman.\n“One of the reasons why the Western Nigeria Security Network, code-named Amotekun, is recording success is because members of the corps are drawn from the locality.\nIf we are given the authority and licence, I will also buy AK-47 rifles for Amotekun."
  },
  {
    "headline": "Nigerian lawmakers summon Lai Mohammed for questioning over Twitter ban",
    "summarized_story": "Nigeria’s House of Representatives on Tuesday passed a resolution to investigate the legality of the suspension of Twitter in the country.\nThe committees are expected to question Lai Mohammed and report to the House within 10 days to guide further action by the lawmakers on the matter, Gbajabiamila said.\nThe U.S. social media giant has said it is “deeply concerned” by the ban.\nNigerians continue to use Twitter, however, thanks to Virtual Private Networks (VPNs) that have helped bypass the ban.\nThe country’s broadcast regulator has also ordered television and radio stations to suspend their use of Twitter."
  },
  {
    "headline": "WhatsApp won’t restrict users who don’t agree to its privacy policy",
    "summarized_story": "WhatsApp recently announced that it will not be limiting access to the features of the app for those who reject the new privacy policy and disagree to let it share its data with Facebook and other third-party companies.\nThe initial deadline for the acceptance of its privacy policies was set to February 8, 2021, but after receiving backlash from its global users and dealing with media scrutiny, Facebook decided to extend the deadline to May 15, 2021.\nUsers will be “able to receive calls and notifications” but they “won’t be able to read or send messages” anymore.\nDuring this period, Whatsapp’s policy related to inactive users will apply.\nWhat’s nextAlthough users will no longer lose access to the app if they don’t agree to the new terms of service agreement, users will still get reminded about the new policy if they haven’t accepted it."
  },
  {
    "headline": "South African mobility startup WhereIsMyTransport raises $14.5million for expansion",
    "summarized_story": "South African Mobility startup WhereIsMyTransport has raised a $14.5 million Series A extension round to continue its expansion across emerging markets.\nFormed in 2016, WhereIsMyTransport is a big data platform that provides sustainable mobility solutions in emerging markets.\nWith this new investment, WhereIsMyTransport plans to continue its expansion across emerging markets, with a launch in Peru planned for later this year.\nMobility in emerging markets via public transportation is often a hassle – it’s inefficient and time-consuming.\nThe successful expansion of WhereIsMyTransport would reduce friction in the movement of people and goods across Africa and other emerging markets."
  },
  {
    "headline": "EASYSHARE.AFRICA LAUNCHES PLATFORM USING SAFE, LOW COST, CRYPTOCURRENCY TECHNOLOGY",
    "summarized_story": "By using innovative low-cost crypto-technology to drastically cut transaction fees, Easyshare will also allow consumers to perform micro-transactions safely, securely and affordably.\nSpeaking on the launch of the beta platform, Ben Onuoha Co-founder and Head of Partnerships & Community at EasyShare.Africa said, “Easyshare was born out of a lot of research.\nUsers can seamlessly send money to a mobile wallet or bank account using crypto in five easy steps.\nThe Easyshare.Africa platform is crowdsourcing to meet its expansion plansIn addition to serving ordinary consumers, Easyshare.Africa is committed to extending its impact, by pioneering the world’s first decentralized network of verified peer to peer crypto-powered remittance agents.\nCurrent crypto remittance systems and peer to peer platforms use centralized escrows to guarantee settlement."
  },
  {
    "headline": "PlugnPlay IoT To Hold Asset Tracking 101 Seminar For Top Nigerian Business Leaders",
    "summarized_story": "Digital transformation has reinforced the importance of investing in the Internet of Things (IoT) technology for asset monitoring, data collection, and decision making, to maximize value from operational assets in advanced and emerging economies.\nLagos, Nigeria: Today, PlugnPlay IoT, a subsidiary of NovaTrack Limited announced that it will be organizing a private Asset Tracking seminar in Lagos, Nigeria that will discuss the importance, necessity, and the ‘how’ of adopting the use of the Internet of Things (IoT) technology for business advancement, especially in emerging economies through digital transformation focused on asset management and tracking.\nAs rightly stated by PlugnPlay IoT, “the recent security challenges in major African economies, especially Nigeria highlight the need for increased security protocols for valuables.\nThis is why PlugnPlay IoT has put together the Asset Tracking 101 Seminar to present industry leaders who participate with the unfair advantage of business asset tracking with IoT technology.\nAbout PlugnPlay IoTPlugnPlayIoT is an IoT service provider, powered by NovaTrack Ltd, that empowers system integrators, technology experts, software developers and entrepreneurs to build and scale their own IoT business verticals at a relatively low cost."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Bolt adds e-bikes, tuk-tuks to fleet of food delivery vehicles in Kenya",
    "summarized_story": "Door-to-door food delivery platform, Bolt Foods, has added electronic bikes and tuk-tuks to its Kenyan fleet.\nCurrently, It is only available for food delivery, although the company is looking to expand the use of these EVs to its ride-hailing services.\nPreviously known as Taxify, the company launched Bolt Foods in August 2019.\nIn Africa, Bolt Foods is only available in SouthAfrica, Ghana, and Kenya.\nThe latter is the first African market where their EVs for food delivery will be launched."
  },
  {
    "headline": "Learn how to sustain your business with technology at SME Clinic 2021",
    "summarized_story": "Are you a small business owner?\nDo you want to learn how to sustain your business with technology?\nThis is why the upcoming edition of SME Clinic 2021 themed “Sustaining your business with technology” is a must-attend if you want to give your business a boost.\nWho can attend SME Clinic 2021?\nSME Clinic is for anyone who owns, manages or plans to start any kind of small business."
  },
  {
    "headline": "UberX Hourly launches in Nigeria, MoneyHash pre-seed raise, more on #TwitterBan",
    "summarized_story": "Good day,Today, I’m discussing:UberX Hourly launches in NigeriaMoneyHash pre-seed investment roundUpdates on the Twitter ban in NigeriaUber Launches UberX Hourly in NigeriaOn Monday, June 7, 2021, US-based ride-hailing platform, Uber, announced the official launch of UberX Hourly in Nigeria.\nBefore now, UberX Hourly was only available in Africa in Tanzania’s largest city, Dar Es Salaam.\nTime will tell how affordable UberX Hourly will be.\nMoneyHash raises undisclosed pre-seed roundL-R MoneyHash co-founders Nader Abdelrazik, Anisha Sekar and Mustafa Eid.\nSource:The Capital QuestEgypt-based fintech startup, MoneyHash, raised an undisclosed pre-seed investment on Monday, June 7,2021."
  },
  {
    "headline": "Analysts differ as World Bank upgrades Nigeria’s growth to 1.8% in 2021",
    "summarized_story": "Analysts differ as World Bank upgrades Nigeria’s growth to 1.8% in 2021Nigeria’s economy is projected to expand at a modest rate of 1.8 percent in 2021 and edge up to 2.1 percent next year, assuming higher oil prices, a gradual implementation of structural reforms in the oil sector, and a market-based flexible exchange rate management, the World Bank said on Tuesday.\nThe projected growth of Africa’s…"
  },
  {
    "headline": "China shows Nigeria how to ease public health pressure",
    "summarized_story": "China has announced a series of measures for high-quality development of public hospitals in the next five years, including providing medical resources to underdeveloped areas and improving public health emergency policies.\nThese sub-branches are called regional medical centres and will be expanded to all provinces by the end of next year.\n“Public hospitals will focus on improving quality and efficiency rather than expanding in scale.\n“All these measures aim to provide efficient medical services with high quality, and to prevent and fight major epidemics and public health emergencies.\nThe central government is requiring public hospitals to be better prepared for major epidemics."
  },
  {
    "headline": "NLNG signs agreement to supply local market 1.1mmt of Liquefied Natural Gas",
    "summarized_story": "The Nigerian LNG has signed a gas supply agreement with three power companies setting off the distribution of liquefied natural gas to the local market.\nRead Also: NLNG to supply local market with Liquefied Natural Gas Tony Attah, NLNG CEO/MD announced this at a press conference during the Nigerian International Petroleum Summit on Tuesday.\nThree companies…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki urges citizens’ ownership, warns against destruction of government property – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Group offers to comb highways for criminal hideoutsBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called on citizens to take ownership of government property in their localities, to sustain ongoing development across the state.\nObaseki said this when he received leaders and elders of Ekosodin community in Ovia North-East Local Government Area of the state, who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha, said his administration will continue to work for the people of Edo State.\nIt has brought development to the people of Ekosodin Community in Ovia North-East.”In another engagement, Odolevbo O’sioba Initiative, led by the Commandant General, Comr.\n“We will continue to collaborate in the area of security, as we have made great impact in the area of keeping the state safe and peaceful,” he said."
  },
  {
    "headline": "Obaseki explores options to accelerate completion of Benin",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… plans new road, rail line to link Benin River Port to OkpellaBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, is exploring a number of options to speed up the completion of Benin-Auchi Road, which has been in a state of disrepair for years.\nOne of the options being considered is a proposal to take over the management and maintenance of the Benin-Auchi Road under the Federal Government’s Highway Development and Management Initiative (HDMI) being promoted by the Federal Ministry of Works and Housing.\nWe are designing a new road from the Benin River Port to Okpella.\nHopefully, one day in our development plan, we would be able to put a rail link there,” he added.\nObaseki further noted that, “When you try to get a flight to Edo State now, it becomes difficult because a lot of people are trying to utilize the business friendly environment created by this administration.”..."
  },
  {
    "headline": "NFF Gives State FAs 10 Days To Submit Aiteo Cup Champions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Football Federation, NFF, organiser of Aiteo Cup Competition has given the 36 State and FCT Football Associations ten days to submit the name of club that will represent them in the 2021 National Aiteo Cup Competition.\nThis is contained in a statement dated 4th June and signed by the Secretary of the Organising Committee, Wilfred Onaji, which reads, “The Organising Committee of Nigeria Football Federation NFF on the directive by CAF all countries should submit by 30th June 2021 names of the teams that will take part in the various CAF Competitions.\n“In view of the above, the Committee concluded that all States Football Association should produce one representative latest 14 of June, 2021.\nA national draw will be held at a date that will be communicated for the 37 teams that qualified “."
  },
  {
    "headline": "Football Enthusiasts condemn Attack On Bendel Insurance Players During League Game – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Football enthusiasts in Yenagoa, the Bayelsa State capital have condemned the unruly behavior exhibited by fans of Remo Stars Football club against players and officials of Bendel Insurance FC in a matchday twenty one group B2 game of the Southern conference of the Nigeria National League, NNL played at Ikenne Ogun state on Sunday.\nRemo Stars who were at home allowed their supporters to beat up two Bendel Insurance players and secretary Charles Ihimekpan with other players seen escaping the stadium through the fence in a video that went viral on Sunday night.\nHe called on the Nigeria Football Federation and organizers of the league to sanction Remo stars FC and perpetrators of such violence in order to curtail the acts of hooliganism and insecurity in match venues across the country.\nAnother football enthusiast, Alaowei Mieseigha called on the league body to banish Remo Stars from Ikenne as well as place a fine on the team to serve as deterrent to others.\nAlso, Raphael Okolai noted that if strong measures were not taken against Remo stars, fans would continue to molest visiting teams whenever the home team fails to win a match on their ground."
  },
  {
    "headline": "Insecurity not sufficient reason to stop 2023 poll – Moghalu",
    "summarized_story": "ADVERTISEMENTNigeria’s state of insecurity is not a sufficient reason to stop the 2023 general elections from holding, a presidential aspirant said on Monday.\n“I think we have to understand that we have a commitment to democracy, even America, during war held elections.\nMr Moghalu presented five recommendations to the current administration to kickstart and forge a united path for Nigerians.\nIn addition to this, Mr Moghalu spoke about the need to localise the country’s policing and embark on constant training for officers to enhance professionalism in the force.\nMr Moghalu has declared to run for Nigeria topmost seat in the coming election, but he is yet to declare the party on whose platform he would do so."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun 2022: Irewola APC stalwarts back Oyetola, Alabi for second term",
    "summarized_story": "Akinola Olasunkanmi Omotuntun, secretary, also pledged unflinching support for the chairman of the party in the state, Prince Gboyega Famodun.\nThe communique reads this: “That the incumbent Governor, His Excellency, Mr. Isiaka Adegboyega Oyetola and His loyal Deputy Governor, His Excellency, Benedict Olugboyega Alabi should continue with their second term in office.\nThe objective of TOP is meant to weaken APC party in Osun and distract His Excellency Governor Isiaka Adegboyega Oyetola from delivering dividend of democracy to the generality of the people.”Present at the meeting were: Rt.\nAkeem Oladeni, Prince Remi Abass, Hon Opeyemi Adeboye, Hon Lasisi Kadiri chairman LCDA Orile Owu, Hon Wasiu Oyelami, Hon.\nIsiaka Ayandiran, Mr Soji Opawumi, Mr. Akintoye Kehinde, Mr. Alagbada Kamar, Alhaja Badejoko Sariyu, Alhaja Bola Alabi, Sabainah Adegboye, Alh."
  },
  {
    "headline": "Christ International Divinity College Releases Entry Requirements, Courses",
    "summarized_story": "According to the Press Release signed By Emmanuel Adeniran, the Media Consultant to the College, copies of which made available with the newsmen in Osogbo on Tuesday, the College was established in 1986 by Prophet Dr. S.K.\nThe Press Release also revealed the location of the Satellite Campuses to includes Akure Campus, Ikare Akoko Campus, Ilesa Campus, Osogbo Campus, Ado Ekiti Campus, Ondo City Campus, Ilorin Campus, Ogbomoso Campus, Ibadan Campus, Ikirun Campus, Abeokuta Campus as well as Lagos Campus.\nThe Media Consultant in his press release maintained that “the entry prerequisites into the Christ International Divinity College are five credits in WAEC and NECO including English and Mathematics.\n), Bachelor of Education in Guidance and Counselling (B.ed), Bachelor of Education in English Language Education (B.ed), Bachelor of Education in Education Management (B.ed), Bachelor of Education in Political Science Education (B.ed) and Bachelor of Education in Social Studies Education (B.ed).\nIn addition, the press release enjoined all Christians and Associates of the Founder, Prophet Dr. S.K."
  },
  {
    "headline": "Insecurity: Igbo senior journalists call for peace, decry wanton killing of youth by security agents",
    "summarized_story": "The group in a statement on Tuesday, by its chairman, Sir Abuchi Anueyiagu and secretary, Elder Ngwuoke Ngwuoke, also condemned the wanton killing of innocent youth of the zone by security agencies in the guise of fighting Eastern Security Network (ESN).\n“IZUNWANNE condemns in strong terms the wanton violence that has suddenly engulfed the Southeast and Southsouth geo-political zones of the country, and call for the return of peace,” the group said.\n“We also condemn in very strong terms the attack on government agencies and assets, as well as the killing of security personnel by whichever unidentified gunmen in the zones.\n“Our association also roundly condemns the attendant indiscriminate killing of innocent persons in the guise of going after the arsonists and destroyers of public facilities in the area.\nNdigbo are not in support of any group of persons who have taken to violence under whatever name or guise."
  },
  {
    "headline": "Resignation of Gen. Umahi from Ebube Agu, an embarrassment to Southeast governors – ADF",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), says it has, after a review of the recent resignation of Gen. Obi Umahi (rtd), the Chairman of the Security Advisory Committee, created by the South-East Governors Forum, it wishes to state, among other things, that it’s now clear that there is poverty of leadership in South East governors’ forum.\nUmahi had yesterday, tendered his resignation from the zone’s security committee meant to foresee the setting up of Ebube Agu, a regional security outfit, citing lack of funding and commitment from the governors.\nReacting to Umahi’s decision in a statement by chairman of its publicity bureau, Abia Onyike, the ADF said his resignation is further proof that governors of the South East are not serious about providing security in the zone.\n“The resignation by Gen. Umahi has exposed the poverty of leadership in the South-East Governors Forum,” the ADF said.\n“This development has sealed off expectations that the South East Governors can effectively brace up to the challenges of insecurity for the region."
  },
  {
    "headline": "Uzodimma, Okonjo-Iweala, Jack Rich, Others To Headline Black Celebrity Magazine",
    "summarized_story": "This month’s Black Celebrity Magazine cover star is the award winning actress cum singer, Supernova.\nIn this edition, the magazine also featured, Ondo State Governor Rotimi Akeredolu where his achievements during his first term in office ever since the people of the state trusted him and faithfully gave him a second chance was highlighted.\nAdditionally, the magazine also showcased the benevolence acts and stances on developing the living standards of the people of Niger Delta, a very sensitive and volatile geopolitical zone of the country, Nigeria.\nIn his words, he said “Some special men and women who hail from the Niger Delta and have done tremendously well in alleviating the poverty level of their people are giving exceptional recognition in this edition.\nOne of them is Jack Rich, the founder and Chairman of Belema Oil."
  },
  {
    "headline": "Uzodimma, Okonjo-Iweala, Jack Rich, Others To Headline Black Celebrity Magazine",
    "summarized_story": "This month’s Black Celebrity Magazine cover star is the award winning actress cum singer, Supernova.\nIn this edition, the magazine also featured, Ondo State Governor Rotimi Akeredolu where his achievements during his first term in office ever since the people of the state trusted him and faithfully gave him a second chance was highlighted.\nAdditionally, the magazine also showcased the benevolence acts and stances on developing the living standards of the people of Niger Delta, a very sensitive and volatile geopolitical zone of the country, Nigeria.\nIn his words, he said “Some special men and women who hail from the Niger Delta and have done tremendously well in alleviating the poverty level of their people are giving exceptional recognition in this edition.\nOne of them is Jack Rich, the founder and Chairman of Belema Oil."
  },
  {
    "headline": "Federal Govt Directs JUSUN, PASAN To Call Off Strike",
    "summarized_story": "The Federal Government on Tuesday directed members of the striking Judiciary Staff Union of Nigeria (JUSUN) and the Parliamentary Staff Association of Nigeria (PASAN) to resume work at courts and the State Houses of Assembly respectively, so that the May 20, 2021 Memorandum of Action (MoA) signed by all parties and further reinforced by another meeting on implementation of timelines on June 4, can take effect .\nThis was contained in a statement by Charles Akpan, the Deputy Director, Press and Public Relations at the ministry of labour and Employment.\n“The Federal Government has sadly noted that the MOA between all the stakeholders involved in the JUSUN/ PASAN strike, mainly JUSUN/PASAN, Governors’ Forum and the Presidential Implementation Committee is yet to take effect because of non-compliance by parties.\n“We note that the strike has not been called off as of noon, today, June 8, 2021, leading to courts and various State Houses of Assembly still remaining under lock and key contrary to the promise made by the two unions at a further dialogue which was attended by the President of the Nigerian Labour Congress.\nThe Statement added that the Ministry will not be happy to be pushed into invoking sections of the Trade Disputes Acts capable of eroding all the gains made so far in the negotiations since May 6, 2021."
  },
  {
    "headline": "Federal Govt Directs JUSUN, PASAN To Call Off Strike",
    "summarized_story": "The Federal Government on Tuesday directed members of the striking Judiciary Staff Union of Nigeria (JUSUN) and the Parliamentary Staff Association of Nigeria (PASAN) to resume work at courts and the State Houses of Assembly respectively, so that the May 20, 2021 Memorandum of Action (MoA) signed by all parties and further reinforced by another meeting on implementation of timelines on June 4, can take effect .\nThis was contained in a statement by Charles Akpan, the Deputy Director, Press and Public Relations at the ministry of labour and Employment.\n“The Federal Government has sadly noted that the MOA between all the stakeholders involved in the JUSUN/ PASAN strike, mainly JUSUN/PASAN, Governors’ Forum and the Presidential Implementation Committee is yet to take effect because of non-compliance by parties.\n“We note that the strike has not been called off as of noon, today, June 8, 2021, leading to courts and various State Houses of Assembly still remaining under lock and key contrary to the promise made by the two unions at a further dialogue which was attended by the President of the Nigerian Labour Congress.\nThe Statement added that the Ministry will not be happy to be pushed into invoking sections of the Trade Disputes Acts capable of eroding all the gains made so far in the negotiations since May 6, 2021."
  },
  {
    "headline": "ACJHR Alerts On Alleged Smear Campaign Against Zenith Bank",
    "summarized_story": "The African Centre for Justice and Human Rights (ACJHR) has alerted Nigerians to an alleged smear campaign by Obinna J. Nwankwo against the Zenith Bank brand.\nShe said in the poorly executed job, Zenith bank, the overall best bank in Nigeria, was targeted for smear.\nShe further explained that Zenith Bank did not get to where it is today without excellence corporate governance and adoption of international best practices in all its affairs.\n“Zenith Bank is an international brand and one ill-bred political hireling cannot bring it down.\nPoliticians only resort to smear campaigns against rivals when they are afraid of losing to such rivals."
  },
  {
    "headline": "No Nigeria pilgrim will travel without the Commission – NCPC",
    "summarized_story": "Tom Okpe, AbujaExecutive Secretary of the Nigeria Christian Pilgrim Commission, (NCPC) Rev Yakubu Pam has stated that no Nigerian pilgrim would be allowed to travel out on Christian Pilgrimage without clearance from NCPC.\nThe NCPC henchman made this disclossure in his office in Abuja on Tuesday during a courtesy visit by the Christian Tourism Practitioners Association of Nigeria (CTPAN).\nHe stated that taking pilgrims out of the country without NCPC is illegal and against the Act that established the Commission.\nThe Executive Secretary encouraged the Christian Tourism Practitioners Association of Nigeria to always stand for truth and to discourage abscondment among pilgrims.\nEarlier, President of the Christian Tourism Practitioners Association of Nigeria (CTPAN) Rev Dr. Israel Kristilere thanked the Executive Secretary for receiving them despite his busy schedule."
  },
  {
    "headline": "Anambra Gov’ship election; Uba says state in a cross-road",
    "summarized_story": "Tom Okpe, AbujaA major contender in the forrhcoming Anambra State governorship election under the All Progressives Congress,(APC), Senator Andy Uba said the state is in a cross-road and has the plan to change and uplift it to its glory.\nUba told journalists at the party Secretariat on Tuesday when he came to submit his nomination and expression of interest forms to contest the November, 6th Governorship election that he once won the state governorship election, with the plans to change the state gor better.\n“If you remember, in 2007 when I won the election as the governor of Anambra state, I had the plan to change the face of Anambra.\n“My plan was to lift the youths, to help, empower them, women and be able to take Anambra to a different level.\nAnambra will be a different state once I am elected as the governor,” he said."
  },
  {
    "headline": "Reconsider your decision on twitter suspension, NESG urges FG",
    "summarized_story": "By PHILIP CLEMENTThe Nigerian Economic Summit Group (NESG) has called on the federal government to consider the economic implications of the recent suspension of twitter usage in Nigeria as many business rely on the social media platform to sell and trade their products.\n“Despite the inflow of investment into the digital economy, overall Foreign Direct Investment (FDI) inflow into Nigeria is yet to achieve its true potential.\nIt urged the Federal Government to reconsider the twitter ban decision and rescind the suspension to foster inclusive development, global competitiveness, and much faster economic growth in Nigeria.\nIn 2020, Nigeria slipped into its second recession in five years, with a GDP contraction of 3.6% in the third quarter of 2020.\nThis means that the digital sector remains crucial in accelerating Nigeria’s recovery from the devastating impacts of the pandemic."
  },
  {
    "headline": "NESG, UN, finance ministry advocates better food systems for Nigeria",
    "summarized_story": "By Philip ClementThe Nigerian Economic Summit Group (NESG), in collaboration with the Ministry of Budget and National Planning, United Nations Nigeria and the Alliance for a Green Revolution in Africa (AGRA), has held a Private sector Exploratory dialogue on Nigeria’s Food Systems where they advocated for a better and efficient food management systems for the country.\nShe stated that at the 26th Nigerian Economic Summit (NES#26), stakeholders acknowledged the absence of a warehouse security system, contributing largely to food insecurity issues affecting Nigeria.\nMrs. Idowu reiterated that food systems touch all part of human existence, and for Nigeria to feed its growing population sustainably, agricultural productivity must grow alongside the entire food system.\nHe said partnership by all stakeholders would help to sustain and improve the agricultural sector and help the country become more successful.\n“The best way to deal with food insecurity, malnutrition and hunger is collective and concerted collaboration and effort between government, private sector, civil society organisations and all stakeholders”, She concluded."
  },
  {
    "headline": "Amputee woman accuses LASUTH of negligence, demands compensation",
    "summarized_story": "A 35-year-old woman, Oluwadamilare Aremu, has accused the Lagos State University Teaching Hospital of negligence leading to the amputation of her right leg.\nAremu told PUNCH Metro that she was admitted to LASUTH in December 2018 when an 18-passenger vehicle she boarded was involved in a crash on the Third Mainland Bridge, leading to her suffering a broken thighbone.\nLASUTH doctors told me that I would walk again.\nOak Hospital couldn’t remove the iron that LASUTH inserted in my leg, so they called a consultant to come.\nI want justice and proper compensation.”When PUNCH Metro contacted the Chief Medical Director of LASUTH, Prof Tokunbo Fabanwo, he said investigation into the case had begun."
  },
  {
    "headline": "Amputee woman accuses LASUTH of negligence, demands compensation",
    "summarized_story": "A 35-year-old woman, Oluwadamilare Aremu, has accused the Lagos State University Teaching Hospital of negligence leading to the amputation of her right leg.\nAremu told PUNCH Metro that she was admitted to LASUTH in December 2018 when an 18-passenger vehicle she boarded was involved in a crash on the Third Mainland Bridge, leading to her suffering a broken thighbone.\nLASUTH doctors told me that I would walk again.\nOak Hospital couldn’t remove the iron that LASUTH inserted in my leg, so they called a consultant to come.\nI want justice and proper compensation.”When PUNCH Metro contacted the Chief Medical Director of LASUTH, Prof Tokunbo Fabanwo, he said investigation into the case had begun."
  },
  {
    "headline": "On your own: Ayade’s aides refuse to defect, resign",
    "summarized_story": "TWO aides of the Cross River State Governor, Ben Ayade, on Monday resigned their appointments.\nThe two aides are the Special Adviser on Sustainable Development Goals, Mark Obi and the Director General, Urban Renewal Commission (South), Cecil Ita.\nIn two separate letters made public on Monday, the duo made reference to recent political happenings in the state for their decision.\n“Consequently, being a founding and subsisting member of the Peoples Democratic Party in Cross River State, I cannot in good conscience remain in my current appointment as Special Adviser.\nHe added, “The President has been to Cross River a couple of times."
  },
  {
    "headline": "On your own: Ayade’s aides refuse to defect, resign",
    "summarized_story": "TWO aides of the Cross River State Governor, Ben Ayade, on Monday resigned their appointments.\nThe two aides are the Special Adviser on Sustainable Development Goals, Mark Obi and the Director General, Urban Renewal Commission (South), Cecil Ita.\nIn two separate letters made public on Monday, the duo made reference to recent political happenings in the state for their decision.\n“Consequently, being a founding and subsisting member of the Peoples Democratic Party in Cross River State, I cannot in good conscience remain in my current appointment as Special Adviser.\nHe added, “The President has been to Cross River a couple of times."
  },
  {
    "headline": "Attorney-General Malami deactivates his Twitter account",
    "summarized_story": "By Nimot SulaimonNigeria’s Minister of Justice and Attorney General of the Federation, Abubakar Malami, on Tuesday, deactivated his Twitter account.\nHe announced this on his Facebook page this evening with a screenshot of his activity.\nThis is following President Muhammadu Buhari’s order that the use of Twitter in Nigeria, be suspended.\nHowever, the question that comes to mind, is how AGF Malami was able to access Twitter before deactivating his account.\nRecall that the Twitter URL has been suspended by all Internet Service Providers in the country."
  },
  {
    "headline": "Sylva debunks rift with Akpabio",
    "summarized_story": "By Edith Ike-Eboh/AbujaMinister of State for Petroleum Resources, Chief Timipre Sylva, said there was no rift between him and Minister of Niger Delta Affairs, Sen. Godswil Akpabio, over the Niger Delta Development Commission (NDDC) board.\nSylva trashed the rumour Tuesday in a statement by his media aide, Mr Julius Bokoru, in Abuja on Tuesday.\nHe said that those concocting the rift were enemies of progress and urged the general public to discountenance the rumour.\n“The duo consider themselves brothers and comrades in the quest for building a more prosperous Niger Delta and a stronger Nigeria.\n“The fake, divisive article is intended to create anxiety in the Niger Delta region to the desperate ends of its sponsors which is to create needless tension and chaos."
  },
  {
    "headline": "EFCC busts 50 suspected internet fraudsters in Ibadan",
    "summarized_story": "By Kazeem UgbodagaOperatives of the Economic and Financial Crimes Commission, EFCC has arrested 50 suspected internet fraudsters in Ibadan, Oyo State.\nThe suspects were arrested at Alaro Sango, Agbaje Ijokoro, and Apete Aladura areas of Ibadan, Oyo State following intelligence on their alleged involvement in internet fraud.\nOthers are: Awoyinka Afeez Ayodeji, Afonja Olarenwaju, Akingbade Taofeek, Ezekiel Adekunle, Ganiyu Sodiq, Abioye Abiodun, Ogunbayo Daniel, John Timileyin, Ominiyi Daniel, Adeniyi Idris Sodiq, Joseph James, Adeyemi Segun Oluwaseun, Adeleke Rasheed, Saliu Tomiwa Rasheed, Itoro Edet Ime and Oseni Nasirudeen.\nHe said some items used in perpetrating the crime were recovered from them.\n“The suspects will be charged to court as soon as investigations are concluded,” Uwujaren said."
  },
  {
    "headline": "Angry Residents Burn Three Kidnappers To Death In Iyana Ipaja (Video)",
    "summarized_story": "An irate crowd burned a man and the car he was traveling in with two other men in Iyana Ipaja, Agege, Lagos State, over allegations of kidnapping three people.\nOne of the guys died on the way to the police station, according to witnesses, while the other fled with injuries.\nThe suspected kidnappers’ fate was sealed, according to witnesses, when a biker raised the alarm that there were three persons in the car’s boot.\nThey noticed that one of the youngsters had died of asphyxia, while the other was struggling for air.\nOne was completely burned, another died on the way to the police station, and the third managed to flee with minor injuries."
  },
  {
    "headline": "Oyo State Governor, Seyi Makinde Reveals When Nigeria’s Problem Will End",
    "summarized_story": "Seyi Makinde, the governor of Oyo, believes that fiscal federalism and devolution of powers are the only solutions to Nigeria’s challenges.\nTrue federalism, Makinde argued, is the country’s future democracy, and he urged the federal government to give states more power.\nMakinde said: “As we continue to deliberate on the future of democracy in Nigeria, let us remember that true federalism is the way forward.\nRestructuring the Nigerian state, and giving the federating units more powers is the route to economic prosperity.\n“For true federalism to thrive, the federating units should have more powers and autonomy."
  },
  {
    "headline": "Malami Uses VPN, Logs Into Twitter To Deactivate Account",
    "summarized_story": "The AGF took to his Facebook page on Tuesday, posting a photo and a caption which read, “My Twitter account deactivated’.\nHowever, Malami’s post received over 1,100 comments about 40 minutes later with many of his Facebook followers asking him how he accessed Twitter without using VPN.\nAkintunde Babatunde wrote, “How were you able to deactivate Twitter without VPN?\nAnother Facebook user, Kazeem Badaru, asked the AGF if Nigerians should throw a party because he had deactivated his Twitter account.\nThe President’s wife, Aisha Buhari, had similarly deactivated her Twitter account."
  },
  {
    "headline": "SERAP, Falana Drag Buhari Govt To ECOWAS Court Over Twitter Ban",
    "summarized_story": "Following the removal of Buhari’s post, Information Minister Lai Mohammed said last week that Twitter operations will be suspended.\nThe government has threatened to arrest and prosecute anyone who uses Twitter, and the National Broadcasting Commission (NBC) has ordered all broadcast stations to stop using it.\nThey said that the Buhari administration was about to hit telecommunication corporations, media firms, broadcast stations, and others with criminal charges and fines.\nThe complaint stated, in part:“The suspension of Twitter is aimed at stopping Nigerians from using Twitter and other social media platforms to assess government policies, expose corruption, and criticize acts of official impunity.\n“The free communication of information and ideas about public and political issues between citizens and elected representatives is essential."
  },
  {
    "headline": "Twitter ban controversy: SERAP, 176 concerned Nigerians head to ECOWAS Court",
    "summarized_story": "The controversy over the Twitter ban by the Nigerian government took another turn Tuesday as the Socio-Economic Rights and Accountability Project (SERAP) and 176 concerned Nigerians filed a lawsuit against the President Muhammadu Buhari-led administration.\n“The suspension of Twitter is arbitrary, and there is no law in Nigeria today permitting the prosecution of people simply for peacefully exercising their human rights through Twitter and other social media platforms.\n“AN ORDER setting aside the suspension, ban, sanction or other punishments whatsoever imposed on Twitter, Nigerians, media houses, broadcast stations and any social media service providers by the Defendant and its agents.\nHe, however, noted that the House also needed to hear from the government, especially the information and culture minister who issued the directive suspending the social media app in the country.\nAdeboye, in a tweet Monday, had said his church is present in over 170 countries and tweeting is in accordance with Article 19 of the United Nations Universal Declaration of Human Rights."
  },
  {
    "headline": "School fees hike: Kaduna varsity shut down",
    "summarized_story": "Kaduna State University has suspended undergraduate activities until further notice to restore law and order.\nThe suspension did not however affect the postgraduate students from the various departments who are currently writing their examinations.\nStudents of the university recently engaged in protest march to the Sir Kashim Ibrahim Government House, Kaduna to protest the hike in school fees by the Governor Nasir el-Rufai administration.\nBlueprint investigations revealed that the tuition fees which previously stood at N27,000 has been increased to N100,000 ahead of the new session by the Kaduna state government to enable the state provide basic infrastructures and teaching materials.\n“The management of Kaduna State University wishes to notify staff, students and the general public that academic activities for undergraduate students have been suspended indefinitely."
  },
  {
    "headline": "Breaking: Again, Super Eagles fail to score vs Lions in Austria",
    "summarized_story": "For the second time in four days, Nigeria’s Super Eagles failed to score against the Indomitable Lions of Cameroon in an international friendly match decided in Vienna Austria.\nWhile the first friendly match ended one nil in favour of the Cameroonians, the second game was goalless at regulation time on Tuesday.\nDetails loading…"
  },
  {
    "headline": "Why EFCC is after me – Nwoko, Ex A’Ibom AG -NigPilot",
    "summarized_story": "So because of that matter, we got an injunction stopping the EFCC from interfering with the transactions of the Akwa Ibom State government.\nNot the transactions of the days of governor Udom Emmanuel, transactions that happened before he came into government.\nIf they win, they win, if I win, I win.\nSo because of the injunction, they couldn’t access Akwa Ibom State.\nNo one naira of Akwa Ibom State money was used to pay the legal bills of the governor."
  },
  {
    "headline": "SENATE PRESS CORPS CONFERS CONSTITUENCY DEVELOPMENT AWARD ON SEN. OBA -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Centre LSD unveils Build Grant to bridge gender imbalance -NigPilot",
    "summarized_story": "The African Centre for Leadership Strategy and Development (Centre LSD) has officially unveiled the “Centre LSD Build Grant,” to bridge the unacceptable gender imbalance in the extractive industry in the country.\nThe Centre said the Build Grant is for general support for strengthening an intersectional approach to gender and natural resources management, and a project for institutional strengthening.\nThe Programme Coordinator, Centre LSD, Ms. Victoria Udoh said this while unveiling the Grant in a press conference in Abuja.\n“Institutional Strengthening Interventions seeks to build the capacity of staff to deliver on the BUILD grant and beyond.\nFor example, as land is expropriated for extractive industry projects, so are family farms that women often manage."
  },
  {
    "headline": "Taking pilgrims out of country without NCPC is illegal-Pam",
    "summarized_story": "Executive Secretary of the Nigeria Christian Pilgrim Commission, NCPC, Rev.\nYakubu Pam has warned against taking pilgrims on pilgrimage outside the country without passing through the Commission, describing such as illegal.\n“It is illegal for people to travel out of the country on pilgrimage without due respect to NCPC proceedings.\nThe Executive Secretary encouraged the Christian Tourism Practitioners Association of Nigeria to always stand for truth and to discourage abscondment among their pilgrims.\nThe Newly elected executive members of CPTAN were led by the former Chairman, Mrs. Adeola Adekola and other brand new executive members."
  },
  {
    "headline": "#TwitterBan: PDP Reps Walk Out During Plenary",
    "summarized_story": "﻿Some lawmakers of the Peoples Democratic Party (PDP) on Tuesday staged a walkout during plenary at the House of Representatives.\nThe lawmakers staged the walkout after its caucus leader Kingsley Chinda was ruled out of order by Speaker of the House, Femi Gbajabiamila.\nThe Speaker, therefore, ruled Chinda out of order, a decision that did not go down well with some members of the opposition who walked out of plenary.\nThe PDP lawmakers also insisted that they would continue with their threat to go to court over the matter.\nPDP caucus in the House of Representatives had earlier threatened legal action against the Federal Government over its ban of Twitter operations in Nigeria."
  },
  {
    "headline": "#TwitterBan: SERAP Drags FG To ECOWAS Court",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) and 176 concerned Nigerians have dragged the Federal Government to the ECOWAS court over the unlawful suspension of Twitter in Nigeria.\n“The free communication of information and ideas about public and political issues between citizens and elected representatives is essential.\nThis implies a free press and other media able to comment on public issues without censor or restraints, and to inform public opinion.\nAn order setting aside the suspension, ban, sanction or other punishments whatsoever imposed on Twitter, Nigerians, media houses, broadcast stations and any social media service providers by the Defendant and its agents.\nSuch further orders the Honorable Court may deem fit to make in the circumstances of this suit."
  },
  {
    "headline": "Reps To Invite Lai Mohammed, Investigate Legality Of Twitter Ban",
    "summarized_story": "﻿Members of the House Representatives have resolved to invite the Minister of Culture and Information, Lai Mohammed in a bid to investigate the legality of the Twitter ban by the Federal Government.\nThe Speaker said the House recognises that Twitter is a very important means of communication.\nHe directed relevant committees of the House to constitute a single committee and commence investigation into the circumstances surrounding the ban, and its legality.\nMr. Chinda had prayed the House to urge the Federal Government to suspend the ban while the House investigation is ongoing as directed by the Speaker.\nThis comes after the Federal Government of Nigeria had last week announced the indefinite suspension of Twitter in the country."
  },
  {
    "headline": "‘I Alone Cannot Restore Security In Imo’ – Uzodinma",
    "summarized_story": "﻿The Imo State Governor, Senator Hope Uzodinma has called on fellow leaders to join hands to bring an end to the insecurity in the state, noting that himself alone cannot restore security.\nHe made the appeal on Tuesday while addressing journalists after a meeting with President Muhammadu Buhari in the State House.\nGovernor Uzodinma called on stakeholders including traditional rulers, religious leaders and politicians, to engage more with the issues in order to engender peace in the country.\nHe also stated that former political office holders who have failed to speak out against the security crisis in the country have questions to answer.\nRead Also: Police Operatives Rescue Five Kidnap Victims In KadunaAccording to him, if all leaders speak out condemning perpetrators of insecurity, a lot of changes would be visible."
  },
  {
    "headline": "EFCC Arrests 50 For Alleged Internet Fraudsters",
    "summarized_story": "The Ibadan Zonal Office of the Economic and Financial Crimes Commission (EFCC) has arrested 50 suspected internet fraudsters.\nThe suspects were arrested at Alaro Sango, Agbaje Ijokoro, and Apete Aladura areas of Ibadan, Oyo State following intelligence on their alleged involvement in internet fraud.\nOthers are: Awoyinka Afeez Ayodeji, Afonja Olarenwaju, Akingbade Taofeek, Ezekiel Adekunle, Ganiyu Sodiq, Abioye Abiodun, Ogunbayo Daniel, John Timileyin, Ominiyi Daniel, Adeniyi Idris Sodiq, Joseph James, Adeyemi Segun Oluwaseun, Adeleke Rasheed, Saliu Tomiwa Rasheed, Itoro Edet Ime and Oseni Nasirudeen.\nSome items used in perpetrating the crime were also recovered from them.\nThe law enforcement agency says the suspects will be charged to court as soon as investigations are concluded."
  },
  {
    "headline": "Obasanjo, Abdulsalami, Others to meet over State of the Nation",
    "summarized_story": "Former President, Chief Olusegun Obasanjo, General Abdulsalami Abubakar(rtd), Sultan of Sokoto and John Cardinal Onaiyekan and some eminent Nigerians are set to meet on Thursday, June 19th at the Transcorp Hilton Hotel in Abuja to discuss the State of the Nation and Chart a way forward.\nThe meeting which is convened by Former President Olusegun Obasanjo will also have in attendance leaders of industry, Labour and Other sectors of the nations’ diverse ethnic and religious mix.\nThe meeting is not unconnected with the recent spate of insecurity, agitation from most parts of the country and the seeming failure of the several solutions proffered by the Federal Government to bring an end to the issues."
  },
  {
    "headline": "Angry mob set suspected motorcycle thief ablaze in Makurdi",
    "summarized_story": "A young man was on Tuesday afternoon set ablaze for allegedly attempting to steal a motorcycle at the Wurukum Market area of Makurdi, the Benue State capital.\nEye witnesses confirmed that the suspected motorcycle thief was caught while he was trying to use a master key to unlock a motorcycle which the owner had just parked and entered the market“Some onlookers who saw all that was happening raised alarm which made the thief to start running away to escape.\n“Luck however ran out on him as some youths who were close by ran after him, caught him and wasted no time in sourcing for tyre, petrol and matches to set him ablaze.\nAs I speak to you now, smoke from his remains is billowing as I can see from where I’m standing.\nShe advised members of the public against taking laws into their hands but rather hand over any suspect to the police for proper investigation nd prosecution."
  },
  {
    "headline": "Intelligence sources confirm Abubakar Shekau’s death",
    "summarized_story": "Intelligence sources have confirmed the death of Boko Haram’s commander Abubakar Shekau weeks after the Islamic state west Africa province announced that he had been killed as they Advanced on his Stronghold in Sambisa Forest.\nAs it stands , insurgents loyal to Abubakar Shekau are said to be regrouping and others pledging their loyalty to ISWAP.\nThe Nigerian military has continued to step up its offensive against insurgents in the north eastWith this confirmation of the death of the leader of Boko haram, members of the group are likely to flee or seek refuge away from the north east and the heart of the Hadin Kai theatre command"
  },
  {
    "headline": "Nigeria: Benue Governor Ortom Tweets, Says Twitter Ban Meant to Shield President Buhari’s Failure",
    "summarized_story": "Benue State Governor Samuel Ortom has described President Muhammadu Buhari’s ban of Twitter operations in Nigeria as an ill-advised move to divert the attention of citizens from his failure to tackle insecurity.\nThe northcentral Benue state governor also noted that the ban on Twitter operations is illegal.\nMr Ortom stated this on Tuesday in a post he made on the microblogging platform describing the suspension as a suppression of the fundamental rights of Nigerians.\n“The ban on Twitter is not only illegal but it is also an ill-advised move to divert the attention of Nigerians from the FG’s failure to tackle insecurity in parts of the country,” he tweeted.\nBy Abel Ejikeme"
  },
  {
    "headline": "Nigeria v Cameroon Ends Goalless in Vienna",
    "summarized_story": "Nigeria’s Super Eagles were in action again on Tuesday against the Indomitable Lions of Cameroon, the second friendly encounter in three days.\nIt was a goalless encounter with three shots on target from both sides in the entire game.\nSuper Eagles coach Gernot Rohr made two changes from Friday’s clash, Valentine Ozornwafor and Ahmed Musa – started in place of the injured William Troost Ekong and Oghenekaro Etebo.\nAnayo Iwuala also came on for captain Ahmed Musa.\nSuper Eagles line-up– Maduka Okoye; Jamilu Collins, Shehu Abdullahi, Valentine Ozornwafor, Chidozie Awaziem; Wilfred Ndidi, Alex Iwobi, Moses Simon, Ahmed Musa (C); Kelechi Iheanacho, Paul Onuachu"
  },
  {
    "headline": "UN Orders Cape Verde to Suspend Extradition of Venezuelan Diplomat Saab to the US",
    "summarized_story": "The UN has demanded Cape Verde “refrains from extraditing” Venezuelan diplomat”Alex Saab to the US and ensure all necessary measures to ensure access to appropriate health care”.\n“This case of arbitrary arrest is emblematic of serious and systematic violations of human rights and international law by Cabo Verde.\nAfter having decided to ignore the ruling of the ECOWAS Court of Justice obliging it to release Alex Saab, Cabo Verde is now being called to order by the United Nations.\nNo State respecting international law and the rule of law could legitimately ignore this new call to reason and to respect human rights.\nTherefore, there is no doubt that Cabo Verde must comply with the interim measures according to its human rights obligations.”By Abel Ejikeme"
  },
  {
    "headline": "French President Macron Slapped in Face on Visit to Small Town",
    "summarized_story": "French President Emmanuel Macron was slapped in the face Tuesday by a man during a visit to a small town in southeastern France, an incident that prompted a wide show of support for the head of state from politicians across the ideological spectrum.\nThe French president was greeting the public waiting for him behind barriers in the town of Tain-l’Hermitage after he visited a high school that is training students to work in hotels and restaurants.\nMacron just managed to turn his face away as the aggressor’s right hand connected, making it appear that the president took more of a glancing blow than a direct slap.\nFrench news broadcaster BFMTV said police detained two people – the man suspected of slapping Macron and another man who filmed a video.\nCalled “crowd baths” in French, they have long been a staple of French politics and only very rarely produce shows of disrespect for the president."
  },
  {
    "headline": "Bosnian Serb Commander Ratko Mladic Loses Genocide Appeal",
    "summarized_story": "Ratko Mladic, the military chief known as the “Butcher of Bosnia” for orchestrating genocide, crimes against humanity and war crimes in the Balkan nation’s 1992-95 war, lost his final legal battle Tuesday when U.N. judges rejected his appeals and affirmed his life sentence.\nHis former political chief, ex-Bosnian Serb President Radovan Karadzic, already is serving a life sentence after being convicted for the same crimes.\nSerge Brammertz, the prosecutor who finally brought both Karadzic and Mladic to justice, said Mladic “ranks among the most notorious war criminals in modern history” who abused his position of power to commit crimes including genocide.\nThe court also rejected an appeal by prosecutors of Mladic’s acquittal on one other count of genocide linked to ethnic purges early in the war.\nOutside the court, another mother from Srebrenica, Munira Subasic had a message for young people in Serbia and the Serb part of Bosnia."
  }
]