[
  {
    "headline": "14 killed as police repel bandits attack in Benue",
    "summarized_story": "John Charles, MakurdiFourteen armed bandits were early hours of Sunday, reportedly gunned down during a gun duel with the police in the Katsina-Ala town, Katsina-Ala Local Government Area of Benue State.\nThe armed bandits were said to have met their waterloo when they stormed a police station in the town where some of the bandits were being detained.\nIt was reliably gathered that the police engaged the bandits in a gun duel leading to the death of 14 of the attackers.\n“Officers at the division who were already at alert engaged them in a gun duel and were able to subdue the bandits.\nThe PPRO said that security operatives were currently on the trail of suspected armed bandits who are now at large."
  },
  {
    "headline": "ASUU threatens fresh strike over unpaid salaries",
    "summarized_story": "The Academic Staff Union of Universities has threatened to embark on an industrial action if the 13 months’ salaries of over 1,000 of its members across the country were not paid.\nThe chairman alleged that the affected members were being threatened to either enrol into the Integrated Payroll and Personnel Information System (IPPIS) platform or have their salaries withheld.\n“Despite the directive given by Mr President to pay the salaries of all lecturers, the AGF has refused to pay their salaries, for periods ranging from four to thirteen months, respectively.\nSo, it is very clear that this is a deliberate act on the part of the AGF and his staff.\n“Many of our members at the University of Jos have not been paid salaries from February 2020 to date."
  },
  {
    "headline": "Man shoots 19-yr-old mentally deranged to death in Enugu",
    "summarized_story": "By Ikechukwu Odu – NsukkaA man identified as Lawrence Ezeoha, has allegedly shot a 19-year-old mentally deranged young man, Ifeanyi, AKA, Agudo, to death at Ikem, Isi-Uzo Local Government Area of Enugu State.\n“This development angered the youths of the community and they quickly mobilized themselves, went and razed down houses belonging to him and that of his son.\n“The youths wanted to kill the man too but he quickly rushed to the police before they arrived.\nLeft with no other choice, they destroyed everything in his house and set it ablaze.\nThey also went and set ablaze the house his son newly built.”Vanguard News Nigeria"
  },
  {
    "headline": "Obaseki begins e-registration of Edo workers",
    "summarized_story": "By Gabriel Enogholase – BeninEdo State government weekend in Benin disclosed that it has commenced digital registration of all workers across the 18 local government areas of the state.\nThe State governor Mr Godwin Obaseki stated this while addressing members of Edo State Civil Service Commission, led by the chairman, Mrs. Ekiuwa Inneh, who visited him in his office.\nWe have started the process of digitally registering every staff member in public and civil service in Edo.\nBeyond accountability to the people, we want to now account for productivity in their various work places.”He continued: “We won the last election because of the hope that the government will deliver services to the people; our priority as government is for us to deliver good services to the people.\n“I want to assure you that we will key into your transformation agenda for the civil service; you have recognized the fact that the civil service has to be empowered,” she added."
  },
  {
    "headline": "SERAP drags FG, Lai Mohammed to Federal High Court over ban of ‘unpatriotic’ Twitter",
    "summarized_story": "By Olasunkanmi AkoniSocio-Economic Rights and Accountability Project, SERAP, has filed a lawsuit asking the Federal High Court in Abuja “to stop the Federal Government and the Minister of Information and Culture, Mr Lai Muhammed from using their patently unlawful directive to all television and radio stations not to use Twitter and delete their accounts.\nSERAP, described the directive as a pretext to harass, intimidate, suspend or impose criminal punishment on journalists and broadcast stations simply for using social media platforms.\nREAD ALSO: NDDC: Only someone from oil-producing community can represent us – Warri group“SERAP and concerned Nigerians are entitled to the rights to freedom of expression, access to information, and media freedom subject only to lawful restrictions.\nSERAP and concerned Nigerians frequently rely on the Twitter handles of many broadcast stations as sources of information for our activities in the promotion of transparency and accountability in the country.\nMeantime, no date has been fixed for the hearing of the suit."
  },
  {
    "headline": "My career was never built on winning awards, Grammy’s – Femi Kuti",
    "summarized_story": "By Ayo OnikoyiAfrobeats superstar, Femi Kuti has been nominated for a Grammy award four times but he has never won.\nIn a radio chat with Beat FM 99.9 the “Stop The Hate” star explains his music and the importance of Grammy to it, citing what is more important to him than winning awards or the Grammy’s.\n“My career was never built on winning awards,” he said.\nIf my career were built on winning the Grammy’s, I would probably not be based in Nigeria.\nFemi Kuti was nominated in 2003, 2010, 2012 and 2013 in the World Music category of the Grammy’s."
  },
  {
    "headline": "How my lifestyle cost my sister a job – Denrele",
    "summarized_story": "By Ayo OnikoyiThere are many things weird about the entertainment personality known as Denrele (born Adenrele Oluwafemi Edun).\nAnd since he broke into the entertainment world people have not stopped talking about his strange bohemian lifestyle.\nProbably except for one time when his sister was the one at the receiving endRecounting the story of how he was responsible for his sister’s dismissal from her job, Denrele said, “My sister recently lost her job just because her employer found out she is related to me.\nHe says he deals with this by understanding that social media is not a validation for his existence and one has to remain true to themselves against all odds.\nDenrele made the revelation at last week’s episode of #WithChudeVanguard News Nigeria"
  },
  {
    "headline": "FG urged to probe mercenaries, fake military uniforms in Ebonyi",
    "summarized_story": "The Nigeria Parents Forum has urged the Federal Government to investigate the alleged mobilization of mercenaries and military uniforms in Ebonyi.\nEze regretted that the situation is in spite of the Federal Government’s peace initiative in the troubled town within Ohaukwu Local Government Area.\nEze noted that the under-utilisation of the operatives could be responsible for the continued killings by “alleged war mercenaries who dress in military and other security uniforms”.\nThe Forum appealed to the Federal Government to ensure that security personnel are posted to the rest of identified flashpoints.\nInsecurity: Call in mercenaries now, no one is safe – Ondo workers tell Buhari"
  },
  {
    "headline": "Buhari's policies detrimental to peaceful coexistence",
    "summarized_story": "The Director-General, Centre for Justice on Religious and Ethnicity, Rev.\nKallamu Musa Ali Dikwa, has said that the President Muhammadu Buhari-led government from 2015 to date, has introduced some policies that are detrimental to the peace, unity and the future development of Nigeria.\nHowever, after the age of 18 and above, one is considered an adult.”Rev.\n“The plan is to use the RUGA project to ensure the jihadist war continue and captured every part of the country,” he said.\nISWAP fighters die as troops foil Dikwa attack"
  },
  {
    "headline": "EFCC set to probe Ogun Assembly, Speaker reacts",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is set to probe the Ogun State House of Assembly over alleged financial misappropriation.\nOluomo was asked by a listener if it was true that the EFCC is about to probe the State Assembly.\nThe Speaker replied in the affirmative, saying the EFCC letter was received during the recent parliamentary workers’ strike.\n“There is one piece of information I want the people of Ogun State to know, Ogun State House of Assembly is not autonomous.\nI challenge the EFCC to do their job thoroughly in the Ogun State House of Assembly."
  },
  {
    "headline": "Revert VAT to 5 percent",
    "summarized_story": "A People’s Democratic Party (PDP) stalwart, Nnamdi Onochie, has advised the President Muhammadu Buhari government to revert Value Added Tax (VAT) from 7.5 percent to 5 percent.\nHe warned that retaining VAT at 7.5 percent would do more harm to citizens trying to cope with economic hardship.\nOnochie cautioned against repeated foreign loans, noting that macroeconomic measures should be adopted to pull Nigeria out of the financial crunch.\nHe maintained that foreign loans and harsh tax methods have impacted negatively on the populace.\nBanditry: Niger Govt orders boarding schools in Tegina, Rafi to revert to day"
  },
  {
    "headline": "Buhari praises predecessor, Jonathan",
    "summarized_story": "President Muhammadu Buhari hailed his predecessor, Goodluck Jonathan during his address at the ECOWAS summit in Ghana.\nThe Nigerian leader commended Jonathan for his efforts toward the restoration of stability in Mali.\nJonathan, an ECOWAS Special Envoy and Mediator to Mali, presented a report on his latest working visitMali did not attend the Accra event due to suspension from the body.\nBuhari urged ECOWAS to remain engaged with all stakeholders for a peaceful resolution of the situation in the country.\nThe President described Jonathan as an “astute mediator” and congratulated him “for his untiring efforts thus far”."
  },
  {
    "headline": "Dorathy lambasts Wathoni over alleged relationship with Ozo",
    "summarized_story": "By Sam AnokamBBNaija Lockdown first runner up Dorathy went ballistic over Wathoni’s claim that she was in a relationship with Ozo but failed to admit it.\nThe BBNaija Lockdown housemates gathered for reunion to clear the air and put actions in right perspectives.\nADVERTISEMENTWathoni had claimed Dorathy and Ozo shared some moments and insisted that Dorathy was emotionally attached to Ozo but refused to admit it.\nDorathy wouldn’t take the claim likely as she got into an altercation with Wathoni when she alleged that Dorathy tried to snatch Ozo from Nengi.\nThe moment had Dorathy calling Wathoni names and insisting she has no reason to interfere in the discussion because she wasn’t involved."
  },
  {
    "headline": "Law enforcement officer arrested for selling drugs to students, cultists",
    "summarized_story": "By Nicholas Kalu, AbujaA serving officer of a law enforcement agency, Popoola Abayomi, has been arrested for allegedly selling assorted illicit drugs to students of a federal university and cultists in Ogun State.\nDirector, Media & Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi, who said this in a statement on Sunday, did not reveal the security outfit Abayomi works with.\nBabafemi said the suspect had arrived the ‘D’ arrival hall of the airport on 14th June on a Turkish airline flight from Pakistan with the illicit drug inserted in his anus.\n“The following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial micra car.\nIn Kaduna state, a drug trafficker, Segun Abraham was arrested at Panteka area of the state on 17th June with 211.500kg of skunk heading to Kano state.”"
  },
  {
    "headline": "Why Ozo doesn’t want to be with Dorathy, by Ka3na",
    "summarized_story": "During the show, Ka3na disclosed why she thinks Dorathy and Ozo’s ship couldn’t sail.\n“I think Ozo likes Dorothy’s personality and not the physical shape,” Ka3na said.\nDorathy got mad that Ozo couldn’t keep a conversation between them as he always goes back to discuss everything they said with Nengi.\n“You bring your problems to me, I talk to you about it and you go back to tell the person.\nYou know how hurtful that is?” Dorathy said to Ozo."
  },
  {
    "headline": "JUST IN: Gunmen kill popular Ibadan OAP",
    "summarized_story": "By Yinka Adeniran, IbadanPopular Ibadan-based On-Air Personality (OAP) Titus Badejo aka Ejanla has been killed by gunmen.\nThe Nation learnt he was shot dead on Saturday night by gunmen in Oluyoye area of Ibadan, the Oyo state capital city.\nBadejo, who worked with Space FM and later Naija FM in Ibadan, died a week after he celebrated his 40th birthday.\nIt was gathered he was murdered outside a club at Oluyole Estate, Ibadan around 11:30pm.\nREAD ALSO: Gunmen kill doctor in NigerHe was gunned down when he was about leaving around 11:30pm, sources told The Nation."
  },
  {
    "headline": "My pointed nose, boobs, my selling point –Titi Adeoye, actress",
    "summarized_story": "By Damilola FatunmiseFor Titi Adeoye, acting is her second nature.\nShe can play any role spontaneously having been acting in school and church before going professional.\nIn this interview, she narrated her journey into the movie industry, her heartbreak experience and greatest fear.\nWhat’s your greatest fear in life?\nMy greatest fear is failure."
  },
  {
    "headline": "Dot-in-circle: Amechi lambasts Buhari",
    "summarized_story": "I have said it personally that I believe in a bigger country, Nigeria that I fought for.\nBut if Nigeria breaks, Buhari is responsible for the breaking of the country.\nBuhari is the only president who wants to equate Fulani economy and empire with his attempt to Fulanize Nigeria and to Islamize Nigeria.\nThe point we got it wrong is at the point of Muhammadu Buhari as the president of Nigeria.\nIt started with President Buhari because of his other ambition of colonizing Nigeria, that Nigeria is a property bequeathed to them by Uthman Dan Fodio."
  },
  {
    "headline": "There’ll never be peace if Biafra, Oduduwa republics are created –",
    "summarized_story": "I know many people will say Fulani are the bandits, kidnappers, this is how they have been frustrated.\nIf you continue to talk about Fulani this way, they will not have peace and if they don’t have peace, you cannot have peace yourself.\nWhen you keep on blackmailing them as foreigners they will come to Nigeria to help Fulani in Nigeria to fight.\nHow did the urban Hausa caused the fight?\nWhen such republics are created there will never be peace in Nigeria because we will continue to fight with our former brothers."
  },
  {
    "headline": "Minor hiccups as over 1.4m candidates begin 2021 UTME",
    "summarized_story": "By Gabriel DikeThe 2021 Unified Tertiary Matriculation Examination (UTME) kicked off yesterday with minor hiccups in few Computer-Based Test (CBT) centres.\nThe Joint Admissions and Matriculation Board (JAMB) said that over 1.4million candidates are writing the 2021 UTME in over 800 CBT centres nationwide.\nThe candidates arrived at their various exam centres as early as 7:00a.m, but after biometrics, the UTME started at 9:30a.m, 30 minutes behind schedule.\nThe second session candidates started at 1:05p.m while few candidates reported late.\nAt Bafuto CBT centres, Ikotun, at 9:40a.m, the first session candidates finished and came out from the exam hall."
  },
  {
    "headline": "S’East leaders warn Northern leaders: Protect our people in your states",
    "summarized_story": "From Jude Chinedu, EnuguSoutheast governors and other leaders in the zone have called on their Northern counterparts to protect the Igbo living in the North.\nThe call was made during an emergency security meeting of Southeast leaders in Enugu yesterday.\nThose present at the meeting included the host Governor of Enugu State, Rt.\nAlso in attendance were the Speaker of Enugu State House of Assembly, Rt.\nDr. Emmanuel O. Chukwuma, Chairman, Enugu State Traditional Rulers’ Council, HRH Igwe Amb."
  },
  {
    "headline": "Breaking: Rescue Operation Still on for Kidnapped Kebbi Students",
    "summarized_story": "Rescue operation is still on for the kidnapped students and teachers of the Federal Government College, Birnin Yauri, Kebbi State, THISDAY has learnt.\nMore than 80 students, a majority of them girls, and five teachers were kidnapped last week by bandits who stormed the federal government-owned college in Yauri.\nSources told THISDAY Sunday morning that some of the students had been rescued by troops.\nThe remaining abducted students, sources said, had been split into five groups by the bandits, who had now been surrounded by troops.\n“They have been surrounded by troops but they are negotiating so that the girls would not be killed,” the source said."
  },
  {
    "headline": "Breaking: 15 Kidnap Victims Escape from Captivity in Niger",
    "summarized_story": "By Laleye Dipo in MinnaNot less than 15 people recently kidnapped by bandits in Tegina town of Niger state at the weekend escaped from their Abductors.\nThe 15 were among the adults abducted along with the 156 pupils of the Salihu Tanko Islamic school more than two weeks ago.\nTHISDAY gathered that the escapees moved in different directions so that they will not arouse suspicion from other bandits in the forest.\nA top government official told THISDAY that the escapee was treated, given food and new dress and will soon be reunited with his family in Kuta.\nThe escape of the 15 has raised hopes that the 156 children also picked by the bandits will soon regain their freedom."
  },
  {
    "headline": "Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "The troops, THISDAY gathered, were able to rescue the students and their teachers after closing in on the bandits and killings scores of them, before the rest abandoned their hideouts, leaving the victims behind.\nBandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officersduring an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters."
  },
  {
    "headline": "Bawa: EFCC Won’t Hand over Cases of Interest to any State",
    "summarized_story": "•Says commission as a creation of N’Assembly supersedes states’ establishmentsKingsley Nwezeh in AbujaChairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nThe EFCC chairman also denied asking the management teams of banks to declare theirs assets to the commission.\n“There are a lot of Supreme Court decided cases on this particular issue.\n“We are yet to see how the EFCC is going to hand over cases that they are interested in to any state government or see any correspondence to that effect."
  },
  {
    "headline": "South-east Governors, Leaders Set up Committees to Engage Agitating Youths",
    "summarized_story": "This followed a meeting in Enugu State.\nAccording to a communiqué read by the chairman of South-east Governors Forum and Governor of Ebonyi State, Dave Umahi, the South-east leaders said in order not to manage the situation in the zone, they “have set up a committee to engage such youths to stop and allow elders speak to address such fears”.\nThe governor regretted that although leaders in the South-east had reassured people from other regions of their safety, Ndigbo were still being threatened, especially, in the north.\nThose present at the meeting included the host, Governor of Enugu State, Hon.\nIn attendance also were Speaker of Enugu State House of Assembly, Rt."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXCLUSIVE: Three Secondary School Students Killed As Bandits, Vigilantes Exchange Gunfire In Kebbi",
    "summarized_story": "Three students of Federal Government College, Birnin-Yauri in Kebbi state have been killed during a gun duel between bandits and vigilantes.\nSaharaReporters had reported how bandits on motorcycles from Rijau forest stormed the school on Thursday after overpowering the mobile police unit guarding the school, killing one officer.\n“Three of the students were killed during a gun duel between vigilante group and the gunmen in Makuku village.\nMeanwhile, some students, who were forcibly taken by armed bandits at the school have managed to escape on Friday.\nOur Abductors Were Not Nigerians, Escaped Kebbi School Student Says | Sahara ReportersDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of an officer."
  },
  {
    "headline": "EXCLUSIVE: Three Secondary School Students Killed As Bandits, Vigilantes Exchange Gunfire In Kebbi",
    "summarized_story": "Three students of Federal Government College, Birnin-Yauri in Kebbi state have been killed during a gun duel between bandits and vigilantes.\nSaharaReporters had reported how bandits on motorcycles from Rijau forest stormed the school on Thursday after overpowering the mobile police unit guarding the school, killing one officer.\n“Three of the students were killed during a gun duel between vigilante group and the gunmen in Makuku village.\nMeanwhile, some students, who were forcibly taken by armed bandits at the school have managed to escape on Friday.\nOur Abductors Were Not Nigerians, Escaped Kebbi School Student Says | Sahara ReportersDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of an officer."
  },
  {
    "headline": "Biafra Is Valid, By Evans Ufeli Esq.",
    "summarized_story": "Human rights as a social fact can be viewed as normative responses to expressions of oppression and domination.\nHowever, when nationhood fails, people recline to their tribes and the tribe is a natural enemy of the state.\nWith the aforementioned provisions of law, Biafra is achievable by undertaking procedures laid down by law without necessarily resorting to violence that will lead to casualties and the wanton destruction of lives and properties.\nMy advocacy therefore is that if violence and/or peaceful agitations could not grant Biafra its request in the past it is time to change the approach.\nEvans Ufeli Esq is a Lagos based Lawyer and Executive Director Cadrell Advocacy Centre."
  },
  {
    "headline": "Fashola: 2nd Niger bridge will be completed in 2022",
    "summarized_story": "Babatunde Fashola, minister of works and housing, says the construction of the second Niger bridge will be completed in 2022.\nThe construction of the bridge commenced on September 1, 2018.\nAccording to Fashola, the bridge, which will serve as a major link between the south-east and the south-west will be delivered between the second and third quarters of 2022.\nAdvertisement“We should finish the bridge next year between the second quarter and third quarter.”The bridge is 1.6km long and furnished with other ancillary infrastructure, including a 10.3km highway and an interchange.\nThe bridge spans from Asaba in Delta state to Ozubulu, Ogbaru and other communities in Anambra state."
  },
  {
    "headline": "Fashola: 2nd Niger bridge will be completed in 2022",
    "summarized_story": "Babatunde Fashola, minister of works and housing, says the construction of the second Niger bridge will be completed in 2022.\nThe construction of the bridge commenced on September 1, 2018.\nAccording to Fashola, the bridge, which will serve as a major link between the south-east and the south-west will be delivered between the second and third quarters of 2022.\nAdvertisement“We should finish the bridge next year between the second quarter and third quarter.”The bridge is 1.6km long and furnished with other ancillary infrastructure, including a 10.3km highway and an interchange.\nThe bridge spans from Asaba in Delta state to Ozubulu, Ogbaru and other communities in Anambra state."
  },
  {
    "headline": "NCDC: No new COVID death in Nigeria for 15 days in a row",
    "summarized_story": "For the 15th consecutive day, the Nigeria Centre for Disease Control (NCDC) on Saturday reported zero new COVID-19 related deaths across the country.\nAdvertisementThe COVID-19 death toll in the country remains unchanged at 2,177.\nAccording to the agency’s update for June 19, 2021, the country also recorded 51 new coronavirus cases in four states and the federal capital territory.\nAlso, 10 persons were discharged on Saturday after recovering from the virus, raising the country’s total number of recoveries to 163,550.\nA total of 167,206 coronavirus cases have now been confirmed across the country."
  },
  {
    "headline": "NCDC: No new COVID death in Nigeria for 15 days in a row",
    "summarized_story": "For the 15th consecutive day, the Nigeria Centre for Disease Control (NCDC) on Saturday reported zero new COVID-19 related deaths across the country.\nAdvertisementThe COVID-19 death toll in the country remains unchanged at 2,177.\nAccording to the agency’s update for June 19, 2021, the country also recorded 51 new coronavirus cases in four states and the federal capital territory.\nAlso, 10 persons were discharged on Saturday after recovering from the virus, raising the country’s total number of recoveries to 163,550.\nA total of 167,206 coronavirus cases have now been confirmed across the country."
  },
  {
    "headline": "Buhari to ECOWAS leaders: Take realistic decisions that will positively impact citizens",
    "summarized_story": "President Muhammadu Buhari has asked leaders of countries in West Africa to take practical and realistic decisions that will reflect positively on citizens.\nAccording to Garba Shehu, presidential spokesman, Buhari also spoke on the political situation in Mali.\nAdvertisementSpeaking at the summit, Buhari said the situation in Mali could take a turn for the worse if not properly handled.\nIn doing so, we must take realistic and practical decisions which will positively impact our citizens,” he said.\n“Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "When two years seem like eternity",
    "summarized_story": "Some have described the next two years as an “eternity”, saying that to endure the “suffocating air” for the next two years would be the worst punishment for Nigerians.\nDuring the 2015 general election campaign, the then ruling party and the main opposition party promised Nigerians a lot of goodies.\nYet, they don’t see any difference in the current situation within the remaining two years of this administration.\nIt will definitely get worse in the remaining two years of Buhari,” Angwe Yakubu, a retired senior security personnel, said.\nThis APC- led government is a failure.”According to Daramola, “The President is clueless on providing security for Nigerians not to talk of foreigners."
  },
  {
    "headline": "Is Nigerian Senate playing politics with PIB, Electoral Act and Constitutional Amendment?",
    "summarized_story": "So, the emergence of Senator Ahmad Lawan from Yobe North Senatorial District and Ovie Omo-Agege from Delta Central Senatorial District as president and deputy Senate president, respectively, was largely seen as mission accomplished.\nSimilarly, the $30 billion loan request of the president to the 8th Senate was also rejected to save the country from sinking deeper into indebtedness.\nBesides, on May 18, 2021, Buhari had sought the approval of the Senate to borrow a fresh N2.343 trillion ($6.18bn) external loan.\nNonetheless, the Electoral Act Amendment bill is one bill Nigerians are calling the 9th Senate to also expedite action on in view of the 2023 general election.\nLawan has again promised Nigerians that the Electoral Act Amendment bill and the Constitutional Amendment bill will the passed by mid July 2021 before going on recess."
  },
  {
    "headline": "Egbin power seeks $2bn in equity and debt to double output",
    "summarized_story": "Egbin power seeks $2bn in equity and debt to double outputNigeria’s Egbin Power Plc, the biggest in Africa’s most populous nation, is to raise $1.8 billion to more than double generation capacity as it seeks to boost output and export electricity to West African countries, reports Bloomberg.\nIt is looking at a combination of debt and equity to meet the funding requirements ahead of the…"
  },
  {
    "headline": "Edo State Govt assures SACA of collaboration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestENIN CITY – Edo State government has assured of its commitment in view of partnering with the Edo State Action Committee on Aids (SACA) in its drive towards mitigating the spread of HIV/AIDS in the state.\nThe Permanent Secretary, Edo state Ministry of Communication and Orientation, Mr. Joses Sede gave the assurance when he played host to the team of SACA who were on a courtesy visit to the Ministry yesterday in Benin city.\nWhile appraising SACA’s roles towards cushioning the spread of HIV disease in the society, which he said were in line with the state governor, Godwin Obaseki’s vision of making Edo state great again, Joses said the present administration was committed towards restoring the dignity of the state, hence the Make Edo State Great Again ( MEGA).\nAcknowledging that Edo State had always been rated top since Midwest era, the PS charged the good people of Edo State on the need to strengthen their cooperation with the state governor towards moving the state to enviable height.\nShe thanked the PS for granting them audience to acquaint the Ministry with SACA’s activities in the state and appealed for continuous collaboration."
  },
  {
    "headline": "Obaseki begins e-registration of Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said his administration has commenced digital registration of all workers across the 18 local government areas of the state.\nObaseki stated this while addressing members of Edo State Civil Service Commission, led by the chairman, Mrs. Ekiuwa Inneh, on a courtesy visit, at the Government House, Benin City.\nAccording to him, “We have sent Information Technology Communications (ITC) experts to scan all your documents into a digital format.\nWe have started the process of digitally registering every staff member in public and civil service in Edo.\n“I want to assure you that we will key into your transformation agenda for the civil service; you have recognized the fact that the civil service has to be empowered,” she added."
  },
  {
    "headline": "Fathers’ Day: Obaseki hails sacrifice, resilience of fathers amid COVID-19 crisis – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI celebrate fathers for their immense role in holding the family unit together despite the disruptions caused by the coronavirus pandemic and the attendant dislocations in economies across the world.\nDespite the challenges, fathers remained strong pillars of support in the family.\nWhile it must be acknowledged that the economies of the world have been heavily impacted by the coronavirus pandemic, fathers walked a tight rope to keep families whole, even in the face of adversities.\nFathers were resilient and made immense sacrifice to keep the family united, even with the effects of the lockdown.\nGodwin N. ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Obaseki celebrates Dame Uzamere at 60, extols her exemplary life – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Saturday, led other top government functionaries to the 60th birthday celebration of Dame Iriagbonse Joy Uzamere, at St. Matthew’s Cathedral in Benin City.\nDame Iriagbonse Joy Uzamere is the mother of the immediate past Chief of Staff to the Governor, Mr. Osaze Ethan Uzamere.\nAccording to him, “She’s a pillar, not only in her family but also in the church and in the community.\nImasuen said Dame Iriagbonse Joy Uzamere is a gift to mankind and her family.\nOther dignitaries at the event are wife of Edo Governor, Mrs. Besty Obaseki; immediate past chief judge, Edo State, Esther Edigin; Sen. Matthew Urhoghide; Edo State head of service, Anthony Okungbowa and former chairman, Edo All Progressives Congress (APC), Anselm Ojezua, among others."
  },
  {
    "headline": "ASUU threatens fresh strike over non-payment of members’ salaries",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has threatened to embark on an industrial action if the 13 months’ salaries of over 1,000 of its members across the country were not paid.\nThe chairman alleged that the affected members were being threatened to either enrol into the Integrated Payroll and Personnel Information System (IPPIS) platform, or have their salaries withheld.\n“Idris, from all intent and purposes, is bent on withholding the salaries of over 1,000 members of ASUU spread across the country, with more than 100 of such lecturers being members of our branch at the University of Jos.\n“Despite the directive given by Mr President to pay the salaries of all lecturers, the AGF has refused to pay their salaries, for periods ranging from four to thirteen months, respectively.\n“Many of our members at the University of Jos have not been paid salaries from February 2020 to date."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "UN Re-appoints Nigeria’s Amina Mohammed As Deputy Sec-Gen",
    "summarized_story": "António Guterres has re-appointed Nigeria’s Amina Mohammed as deputy Secretary-General of the United Nations (UN) after his re-appointment by the UN General Assembly for the second term on Friday.\nWhile speaking with journalists after taking the oath of office for a second term, he said he has extended an offer to Mrs Mohammed to continue in office.\n“After being elected, I have the pleasure to invite the deputy secretary-general to remain in my second mandate and I hope she will accept,” he said.\nRecall that Amina Mohammed served as Nigeria’s Minister of Environment from 2015 to 2016, as well as the special adviser to Ban Ki-moon on post-2015 development planning, which focused on the 2030 agenda for sustainable development goals.\nShe is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "UN Re-appoints Nigeria’s Amina Mohammed As Deputy Sec-Gen",
    "summarized_story": "António Guterres has re-appointed Nigeria’s Amina Mohammed as deputy Secretary-General of the United Nations (UN) after his re-appointment by the UN General Assembly for the second term on Friday.\nWhile speaking with journalists after taking the oath of office for a second term, he said he has extended an offer to Mrs Mohammed to continue in office.\n“After being elected, I have the pleasure to invite the deputy secretary-general to remain in my second mandate and I hope she will accept,” he said.\nRecall that Amina Mohammed served as Nigeria’s Minister of Environment from 2015 to 2016, as well as the special adviser to Ban Ki-moon on post-2015 development planning, which focused on the 2030 agenda for sustainable development goals.\nShe is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "JUST-IN: PDP Wins Kaduna Assembly Bye-election",
    "summarized_story": "Alhaji Usman Baba (Ubale) of the Peoples Democratic Party (PDP) has been declared winner of the bye-election for the Sabon Gari State Constituency seat in Kaduna State House of Assembly.\nHe defeated his closest contender from the All Progressives Congress (APC), Malam Musa A. Musa, who polled 7,404 votes.\nThe returning officer also announced that Anas Abdullahi of the ADC polled 62 votes, Chindo Ibrahim of ADP polled 61 votes and Musa Halilu of PRP polled 305 votes.\nAlhough there was low turnout of eligible voters during the election, voters, however, conducted themselves in a peaceful and orderly manner throughout the election.\nLEADERSHIP recall that the Sabon Gari seat initially occupied by the former Speaker of the House, Hon."
  },
  {
    "headline": "JUST-IN: PDP Wins Kaduna Assembly Bye-election",
    "summarized_story": "Alhaji Usman Baba (Ubale) of the Peoples Democratic Party (PDP) has been declared winner of the bye-election for the Sabon Gari State Constituency seat in Kaduna State House of Assembly.\nHe defeated his closest contender from the All Progressives Congress (APC), Malam Musa A. Musa, who polled 7,404 votes.\nThe returning officer also announced that Anas Abdullahi of the ADC polled 62 votes, Chindo Ibrahim of ADP polled 61 votes and Musa Halilu of PRP polled 305 votes.\nAlhough there was low turnout of eligible voters during the election, voters, however, conducted themselves in a peaceful and orderly manner throughout the election.\nLEADERSHIP recall that the Sabon Gari seat initially occupied by the former Speaker of the House, Hon."
  },
  {
    "headline": "Revenue Drive Suffers Setback Over Obsolete Taxation Laws",
    "summarized_story": "The practitioners believe that with this, the nation’s tax law would be compliant with current realities, more effective and generate the much needed revenue for the country.\nThe highest tax-to-GDP ratio in Nigeria was 9.6 per cent in 2011, with the lowest being 5.3 per cent in 2016.\nBetween 2015 and 2018, the country had recorded N16.395 trillion revenue as against N20.408 trillion that was projected during the period.\nOn tax administration, Oyedele of PwC noted that the administration of taxation in Nigeria hasn’t impacted revenue growth in the economy.\nThere are many tax laws we inherited from the British laws before our independence, and we haven’t done much to improve them since then."
  },
  {
    "headline": "ASUU threatens industrial action over non-payment of members’ salaries",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has threatened to embark on an industrial action if the 13 months’ salaries of over 1,000 of its members across the country were not paid.\nThe chairman alleged that the affected members were being threatened to either enrol into the Integrated Payroll and Personnel Information System (IPPIS) platform, or have their salaries withheld.\n“Despite the directive given by Mr President to pay the salaries of all lecturers, the AGF has refused to pay their salaries, for periods ranging from four to thirteen months, respectively.\nSo, it is very clear that this is a deliberate act on the part of the AGF and his staff.\n“Many of our members at the University of Jos have not been paid salaries from February 2020 to date."
  },
  {
    "headline": "Earth trapping heat at an alarming new rate – study — Daily Times Nigeria",
    "summarized_story": "The difference between the amount of heat absorbed by Earth, and the amount reflected back into space is called an energy imbalance.\nIn this case, they found that from 2005 to 2019, the amount of heat absorbed by Earth was going up.\n“And over this period they’re both causing warming, which leads to a fairly large change in Earth’s energy imbalance.\n“My hope is the rate that we’re seeing this energy imbalance subsides in the coming decades,” Loeb told CNN.\n“Otherwise, we’re going to see more alarming climate changes.”"
  },
  {
    "headline": "Many killed, 26 kidnapped as S'Kaduna vows to reclaim all lands —",
    "summarized_story": "IDBIA GABRIEL, KADUNAPresident of Southern Kaduna Peoples Union (SOKAPU), Hon.\n“Not less than 26 persons were kidnapped, including the two wives of Na’Allah Na’Dare – Ruth Na’Alla and Blessing Na’Alla.\n“The parent of slain Yossie Timothy, Timothy Adamu and his wife were also kidnapped.\n“What is even more disturbing is that Kaduna State government has refused to acknowledge and document all these crimes in its daily ‘Security Updates’ usually signed by Kaduna State Commissioner of Home Security and Internal Affairs, Samuel Aruwan.\n“It was alright for Samuel Aruwan to carry along some top military brass, Kaduna State Commissioner of Police among others to condole the Emir of Zaria, HRH."
  },
  {
    "headline": "Police arrest suspected gun runners, robbers — Daily Times Nigeria",
    "summarized_story": "Investigation later revealed that the suspect happens to be a Nollywood producer who hired the above mentioned guns for film production.\n“Further investigation led to arrest of the suspected gun runner, one Chief Otuya Josiah ‘m’ 57yrs of Umuebu community who confessed renting same to the first suspect at cost of fifty thousand naira (N50,000.00) for film production.\n“Monday Igwe also confessed that he bought the arms at Nnewi in Anambra State at the rate of thirty thousand naira each (N30, 000.00).\nAll suspects have been arrested and transferred to state criminal investigation department for further investigation.\nHe assures Deltans that very soon, criminals will be forced to relocated as the command will leave no stone unturned.”"
  },
  {
    "headline": "Opinion: The Dignity of Labour – By DANIEL IGHAKPE",
    "summarized_story": "“There is benefit in every kind of hard work .\nA talented Nigerian musician, Adekunle Gold, in one of his popular songs titled ‘WORK,’ encouraged people to work hard.\nMany who are able to work, willing to work hard, and even actively searching for work, are still unable to find work – they are unemployed!\nMoreover, it contributes to our self-respect, after all, hard work is just that – hard.\nHis Word, The Bible says: “There is nothing better for a man than to eat and drink and find enjoyment in his hard work."
  },
  {
    "headline": "Opinion: The Dignity of Labour – By DANIEL IGHAKPE",
    "summarized_story": "“There is benefit in every kind of hard work .\nA talented Nigerian musician, Adekunle Gold, in one of his popular songs titled ‘WORK,’ encouraged people to work hard.\nMany who are able to work, willing to work hard, and even actively searching for work, are still unable to find work – they are unemployed!\nMoreover, it contributes to our self-respect, after all, hard work is just that – hard.\nHis Word, The Bible says: “There is nothing better for a man than to eat and drink and find enjoyment in his hard work."
  },
  {
    "headline": "Social media eroding family ties – CBAAC boss",
    "summarized_story": "The Director-General of the Centre for Black and African Arts and Civilisation, Dame Oluwabunmi Amao, says social media is eroding family closeness as many people now spend more time on their phones than with family.\nShe said, “There is almost a total collapse of cultural values and morality in our society today.\n“The advent of social media has also compounded issues.\n“The onus lies on us parents to ensure that our children and wards are properly nurtured in accordance with our rich cultural values and tradition.\nThe CBAAC boss maintained that good aspects of African cultural values are being lost to the forces of so-called civilisation."
  },
  {
    "headline": "Social media eroding family ties – CBAAC boss",
    "summarized_story": "The Director-General of the Centre for Black and African Arts and Civilisation, Dame Oluwabunmi Amao, says social media is eroding family closeness as many people now spend more time on their phones than with family.\nShe said, “There is almost a total collapse of cultural values and morality in our society today.\n“The advent of social media has also compounded issues.\n“The onus lies on us parents to ensure that our children and wards are properly nurtured in accordance with our rich cultural values and tradition.\nThe CBAAC boss maintained that good aspects of African cultural values are being lost to the forces of so-called civilisation."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "Nigeria Will Not Make Meaningful Progress Without Borrowing – Fashola",
    "summarized_story": "Fashola told the Nigerian News Agency (NAN) that the country would not make significant progress until it took loans to improve infrastructure.\nHe stressed that borrowing is not a sin, and that it is necessary for the economy to flourish.\n“I do not support irresponsible borrowing so let us be clear; there has to be some sense to this.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Assist My Govt Fight Corruption, Buhari Tells Appeal Court President",
    "summarized_story": "Major General Muhammadu Buhari, the President of Nigeria (retd.)\nMajor General Muhammadu Buhari (retd.)\nhas appealed to Justice Monica Dongban-Mensem, President of the Court of Appeal, for assistance in the battle against corruption.\nBuhari made the call in Jos on Saturday during a thanksgiving mass in honour of the Court of Appeal president over her appointment last year.\nFayemi said the success of women like Justice Monica creates more room for Nigerian women to occupy other sensitive offices and perform creditably."
  },
  {
    "headline": "Twitter ban: FG, Lai Mohammed Sued Over Directive To Broadcasters",
    "summarized_story": "The Socio-Economic Rights and Accountability Project has filed a lawsuit in Federal High Court in Abuja, asking the court to “prevent the Federal Government and the Minister of Information and Culture, Mr Lai Muhammed, from using their patently unlawful directive to all TV and radio stations not to use Twitter, and to delete their accounts as a pretext to harass, intimidate, suspend, or impose criminal punishment on them as a pretext to harass, intimidate, suspend, or impose criminal punishment on themThis comes after the National Broadcasting Commission ordered TV and radio stations to “immediately halt the patronage of Twitter” after the social media giant was banned in the country for deleting President Muhammadu Buhari’s tweets (retd.).\nThey intended to safeguard the people of this country from punishment without trial by duly constituted courts.\n“A DECLARATION that the acts of the NBC and Mr Lai Muhammed in relying on the National Broadcasting Act and the Nigeria Broadcasting Code to unilaterally direct broadcast stations to delete their Twitter handles and desist from using Twitter without recourse to the court amount to infringement on sections 6[1] & [6][b], 36 and 44[1] of the Nigerian Constitution of 1999 [as amended], Articles 1 and 7 of the African Charter on Human and Peoples’ Rights and Article 9 of the International Covenant on Civil and Political Rights.\n“A DECLARATION that the provision of section 2[1][r] of the National Broadcasting Act and sections 5.6.3, 5.11.3 of the Nigeria Broadcasting Code being inconsistent and incompatible with sections 36[1], 39 and 22 of the Nigerian Constitution, Article 9 of the African Charter on Human and Peoples’ Rights and Article 19 of International Covenant on Civil and Political Rights are null and void to the extent of their inconsistency and incompatibility.\n“A DECLARATION that the NBC and Mr Lai Muhammed lack the power and authority to unlawfully impose penalty such as fines and other sanctions on any journalists and broadcast stations for using Twitter, and refusing/failing to deactivate their Twitter handles.”No date has been fixed for the hearing of the suit."
  },
  {
    "headline": "“Youths Can’t Think”: Bishop David Oyedepo Begs FG To Regulate Twitter",
    "summarized_story": "David Oyedepo, the General Overseer of the Living Faith Church Worldwide, has endorsed the Nigerian government’s planned social media legislation.\nUnrestricted access to social media platforms, he claims, is robbing youths of their future, and he calls for immediate action to curtail such access.\n“This social media saga has eroded the substance of destiny of most youths today.\n“Many youths spend less than 10 to 20 percent of their time on their tasks per day.\n“We must devise means to put a check on free access to social media, particularly those that are not adding values."
  },
  {
    "headline": "VIDEO: Moment World boxing legend, Deontay Wilder, revealed Nigeria as his origin",
    "summarized_story": "NextTokyo Olympics ‘ll be different for Team Nigeria – Minister"
  },
  {
    "headline": "FGC Yauri Abduction: Gov. Bagudu vows to lead rescue operation in forest",
    "summarized_story": "Atiku Bagudu of Kebbi State on Saturday vowed to lead the rescue operation of teachers and students abducted from the Federal Government College (FGC), Birnin Yauri, in Ngaski Local Government Area of the State.Bagudu, who is also Chairman, Progressives Governors’ Forum, spoke when local hunters visited him.\nThe News Agency of Nigeria (NAN) reports that the Chairman, Nigeria Governors’ Forum (NGF) and Ekiti State Governor, Dr Kayode Fayemi, and his Jigawa State counterpart, Alhaji Badaru Abubakar, also paid a solidarity and sympathy visit on Gov.\n“But, we also need to mobilize, kit ourselves and take on these bandits.\nWe should follow these bandits wherever they are and take them on.”Bagudu also described the abduction as very callous, even as he lauded the security agencies, management of the school, ‘Yan Sakai and vigilantes for their heroic efforts since the bandits struck at the college.\n‘We are in solidarity with governor Bagudu, we are aware of his prompt intervention and the positive results so far recorded in the rescue operation,” he said.He described the quick response of the governor on the rescue effort as highly commendable, pointing out that no governor has achieved such a feat in Nigeria in similar situation of abduction.Zauro warned criminals to stay away from Kebbi State as they have no hiding place."
  },
  {
    "headline": "Breaking: Germany beat Portugal, return to Euro winning ways",
    "summarized_story": "From a goal down, Germany race to 4-1 while Portugal reduce the deficit 23 minutes to the end.\nThe tie eventually ended 2-4 in favour of Germany.\nPortugal go down from the summit to No 3, a point behind both new leaders France and Germany.\nPortugal will next face France in their last group game on Wednesday, at the same time that Germany will engage Hungary.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "NAF working steadily in right direction -NigPilot",
    "summarized_story": "When the Chief of the Air Staff, Air Marshal Isiaka Oladayo Amao hinted of a new and renewed synergy in the Nigerian military setup, most of us doubted its workability.\nA keen observer will note that in the past the different arms of the military seem to be working to restore peace without collaboration.\nJust last week, the Nigerian Army troops in conjunction with elements of the Nigerian Air Force rescued some of the abducted teachers and students of Federal Government College, Birnin Yauri.\nThis is not to mention numerous positive results being recorded across the country, with NAF playing a key role.\nBefore him, the Kano State Governor, Abdullahi Ganduje came calling too and lauded NAF for it’s role in fighting crime in the state."
  },
  {
    "headline": "JAMB begins 2021 UTME nationwide -NigPilot",
    "summarized_story": "Nigerian Pilot gathered that about 1, 338, 687 candidates registered for the 2021 UTME which started today, 19th June, 2021,across the nation, while about 75,328 candidates successfully registered for Direct Entry.\nA visit to some of the JAMB approved Computer Based-Test, CBT , centres around Federal Capital Territory, FCT, revealed that there were more suiting arrangements in this 2021 UTME than what it used to be previously.\nSpeaking to our correspondent, a parent, Mr. Ogbonna Ugochukwu who came along with his son at Digital Bridge Institute said, ” This year’s JAMB exam is more organised than before.\nThere was no case of malpractice or system failure.To me, this is a great feet that JAMB has achieved so far.\nOn the parts of the candidates, especially those who had sat for UTME in the previous years, said there was no stress locating their centres , capturing their biometrics, and operating computer during the 2021 UTME."
  },
  {
    "headline": "Troops rescue abducted students, teachers in Kebbi State -NigPilot",
    "summarized_story": "The fierce gun duel between troops of Operations Hadarin Daji and armed bandits that abducted school students and teachers in Kebbi State has led to their rescue from the bandits, the Nigerian Army has said.\nThe Service, however, regretted that one of the female students lost her life in the process.\n“The troops also recovered 800 cattle rustled by the bandits.\nThe gallant troops are still on the heels of the kidnappers in order to rescue the remaining abductees still in captivity.\n“The rescued teachers and students will be handed over to the Kebbi State Government.The Nigerian Army appreciates the cooperation so far from good spirited citizens and wish to solicit for more”."
  },
  {
    "headline": "Banditry does not represent any ideology, doctrine, religion – Gov Masari -NigPilot",
    "summarized_story": "The Governor of Katsina State, Rt.\nAminu Bello Masari, has said that banditry in Katsina State and environs was peculiar as it does not represent any ideology, doctrine, religion, or political party.\nGovernor Masari gave this commendation when he paid a courtesy call on the CAS at NAF Headquarters, Abuja.\nDirector of Public Relations and Information Nigerian Air Force, Air Commodore Edward Gabkwet in a statement noted that Governor Masari said that banditry in Katsina is pure criminality.\nThe Chief of Air Staff, Air Marshal Oladayo Amao thanked Governor Masari for his support to the NAF and other security agencies in Katsina State."
  },
  {
    "headline": "SERAP Sues FG, Lai Mohammed Over Repressive Directive Asking Broadcasters To Stop Using Twitter",
    "summarized_story": "They intended to safeguard the people of this country from punishment without trial by duly constituted courts.\nThese principles are so fundamental and must be respected.”“The directive to broadcast stations has seriously undermined the ability of Nigerians and other people in the country to freely express themselves in a democracy, and undermined the ability of journalists, media houses, broadcast stations, and other people to freely carry out their professional duties.”“The Twitter accounts by broadcast stations and media houses are their own properties acquired upon privity of terms and conditions formulated by the Twitter Inc. and accepted by the stations and media houses.”SERAP is also asking the Federal High Court for the following reliefs:1.\nA DECLARATION that the acts of the NBC and Mr. Lai Muhammed in relying on the National Broadcasting Act and the Nigeria Broadcasting Code to unilaterally direct broadcast stations to delete their Twitter handles and desist from using Twitter without recourse to the court amount to an infringement on sections 6[1] & [6][b], 36 and 44[1] of the Nigerian Constitution of 1999 [as amended], Articles 1 and 7 of the African Charter on Human and Peoples’ Rights and Article 9 of the International Covenant on Civil and Political Rights.\nA DECLARATION that the NBC and Mr. Lai Muhammed lack the power and authority to unlawfully impose penalties such as fines and other sanctions on any journalists and broadcast stations for using Twitter, and refusing/failing to deactivate their Twitter handles.\nNo date has been fixed for the hearing of the suit."
  },
  {
    "headline": "South East Governors Condemn Violent Secessionist Groups, Back United Nigeria",
    "summarized_story": "Members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nHe added, “The impression that South East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\nThe forum also condemned the killing of security agencies, burning of strategic infrastructure, and killing of civilians in the South East and other regions.\n“The meeting endorsed our South East joint security outfit – Ebubeagu and asked them to work with security agencies and to respect the rights and privileges of all those living in South East and our visitors,” Governor Umahi said while reading the communique issued at the end of the meeting."
  },
  {
    "headline": "Pressure Mali To Return To Civilian Rule, Buhari Tells ECOWAS Leaders",
    "summarized_story": "President Muhammadu Buhari on Saturday called on West African leaders to exert pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nThe Nigerian leader spoke on the situation in Mali which was recently suspended from the regional bloc due to a military coup.\n“Pressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, President Buhari faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they were disarmed.\nIn his capacity as the ECOWAS champion on the fight against COVID-19, President Buhari also drew attention to the need for more citizens in the region to be vaccinated, stressing the need for adherence to other non-pharmaceutical interventions."
  },
  {
    "headline": "Secession Agitation: To Say We Are Silent Is Not Correct – South East Leaders",
    "summarized_story": "Leaders in the South East have faulted the notion that they have been unbothered about the agitation for secession by some youths in the region.\n“The impression that South East leaders are silent over some of our youths’ agitation for secession is not correct; South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations,” he said.\nREAD ALSO: South East Governors Condemn Violent Secessionist Groups, Back United NigeriaThe governor added, “We condemn in totality, the activities of violent secessionist groups in the South East and elsewhere, we firmly proclaim that we do not support them, they do not speak for South East.\nAccording to him, the leaders have noted the threats by some groups against the people of the South East and will protect them and everyone from other regions.\n“We condemn the killing of security agencies, burning of strategic infrastructure, and killing of civilians in South East and other regions."
  },
  {
    "headline": "Raisi Iran Win Is A ‘Wake Up’ For Nuclear Pact Parties – Israel PM",
    "summarized_story": "Israel’s new premier Naftali Bennett Sunday described the victory of ultraconservative Ebrahim Raisi in Iran’s presidential election as a “wake up” call for parties to a nuclear deal with Tehran.\nRaisi was elected with just under 62 percent of votes cast in Friday’s poll, and will replace moderate President Hassan Rouhani — whose landmark achievement was a 2015 nuclear deal between Iran and world powers — in August.\nIsrael and Iran are arch enemies and the Jewish state has always opposed the nuclear agreement, which it says could enable the Islamic republic to develop nuclear arms.\nIran has always denied seeking a nuclear weapon.\nLapid, who became foreign minister as part of the coalition agreement, earlier this week pledged Israel “will do whatever it takes to prevent Iran obtaining a nuclear bomb” and said he was opposed to a revival of the 2015 deal."
  },
  {
    "headline": "South East Leaders urge other regions to protect Igbo Indigenes",
    "summarized_story": "The South East leaders who made the request in view of what they described as “threats by some groups against our people”, promised to protect everyone, including Igbos and people from other regions, residing in the zone.\nDavid Umahi, Governor of Ebonyi State and Chairman of the South East Governors’ Forum.\nThe communiqué revealed that South East leaders, in order not to mismanage the unfortunate situation, “have set up a committee to engage such youths to stop and allow elders speak to address such fears”.\n“The meeting endorsed our South East joint security outfit – Ebubeagu and asked them to work with security agencies and to respect the rights and privileges of all those living in the South East and our visitors.\nCallistus Onaga, Chairman, Enugu State Traditional Rulers’ Council, HRH Igwe Amb."
  },
  {
    "headline": "Kebbi kidnap: Fayemi tells hunters, vigilantes to use all resources against bandits",
    "summarized_story": "Ekiti State Governor Kayode Fayemi has asked local hunters and vigilantes to use all of their resources to combat bandits.\nFayemi, the Chairman of the Nigeria Governors Forum, made the call on Saturday while speaking to local hunters and vigilantes in Birnin Kebbi, the capital of Kebbi State.\n“Hunters and people of the state should use all power within their possession to end bandits attack.\nDuring a gunfight between soldiers and the abductors, one of the students kidnapped from school was killed.\nHowever, the Nigerian Army had confirmed that five of the abducted students and two teachers have been rescued."
  },
  {
    "headline": "Covid-19 protocols: UAE lifts travel ban between Dubai and Nigeria",
    "summarized_story": "After a protracted disagreement about Covid-19 protocols, the United Arab Emirates, UAE, finally removed the travel ban between Dubai and Nigeria on Saturday.\nAfter the initial test in Nigeria, the UAE insisted on travelers from Nigeria undergoing several additional covid-19 tests.\nA message from the Dubai Media Office announced the resumption of flights between the two countries, saying passengers from Nigeria are now expected to “have received a negative result for a PCR test taken within 48 hours before departure.”” Passengers are also expected to present a negative PCR test certificate with a OR code from laboratories approved by the Nigerian government, while also undergoing the same test upon arrival at the Dubai airport”.\nReacting to the resumption of normal flights between Nigeria and Dubai yesterday, Emirates in a statement said : “Emirates welcomes the latest protocols and measures announced by Dubai’s Supreme Committee of Crisis and Disaster Management to allow the safe resumption of passenger travel from South Africa, Nigeria and India to Dubai.”Advertisement“We look forward to facilitating travel from these countries and supporting various travelers’ categories.\nWe will resume carrying passengers from South Africa, Nigeria and India in accordance with these protocols from 23rd June.”” We thank the Supreme Committee for their continuous efforts in monitoring the development of the situation and announcing the appropriate guidelines and protocols to protect the community and safeguard travel sector,” the statement added."
  },
  {
    "headline": "Finally, Emirates Concedes as Nigerians Can Now Travel Directly to Dubai",
    "summarized_story": "Emirates Airlines will resume flights to Nigeria from June 23, five months after it banned outbound flights from Abuja and Lagos.\nBesides the new condition for Nigerian travellers, UAE has new regulations for passengers travelling from South Africa and India to Dubai.\n“Passengers must present a negative test result for a PCR test taken within 48 hours before departure; UAE citizens are exempted.\nAll passengers must undergo a PCR test on arrival at Dubai airport.\nWe travel agents also paid a huge price because if Emirates flights were operating, we would have made money; we wouldn’t have been at the state we are now financially."
  },
  {
    "headline": "Buhari Canvasses Stronger Pressure on Mali to Return to Civil Rule",
    "summarized_story": "President Muhammadu Buhari has called on West African leaders to exert more pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nMali was recently suspended from the regional bloc due to a military coup in the country.\nPressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, Buhari faulted the recent United Nations resolution to expel all foreign fighters in Libya without first ensuring that they were disarmed.\nThis positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens."
  },
  {
    "headline": "Nigeria: Anti-graft Chair Bawa Says EFCC Won’t Hand Over Cases to States",
    "summarized_story": "Chairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nBut those laws do not contain anything that says that EFCC has nothing to do with investigating their states, they would rather be complementing what the EFCC is doing.\n“There are a lot of Supreme Court decided cases on this particular issue.\nWe have 90 per cent to 95 per cent success rate in court on the cases that we have charged."
  },
  {
    "headline": "Nigeria: Abducted Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "Bandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officers during an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters.\nMore than 800 students were believed to have been taken from their schools in the region since December."
  },
  {
    "headline": "Israel Voices ‘Grave Concern’ Over Iranian President-elect Ebrahim Raisi",
    "summarized_story": "Israel has said the international community should have grave concerns about the election of Iran’s new president-elect, Ebrahim Raisi.\nA spokesman for Israel’s foreign ministry, Lior Haiat, said Mr Raisi is Iran’s most extremist president yet.\nMr Raisi, who will be inaugurated in August, is Iran’s top judge and holds ultra-conservative views.\nIn his tweets, however, Mr Haiat said more than 30,000 people were killed, which is a number also referenced by Iranian human rights groups.\nHowever, human rights groups have said Mr Raisi should be investigated for atrocities."
  }
]