[
  {
    "headline": "How I was prevented from entering Nigeria over COVID-19 permit –Soyinka",
    "summarized_story": "Gbenga AdenijiNobel laureate, Prof Wole Soyinka, on Thursday said he was prevented from boarding at the Charles de Gaulle Airport in Paris, France, for failing to obtain what the airline staff described as a ‘permit to travel’ to Nigeria.\nSoyinka spoke in Lagos on the theme, ‘COVID, technology and citizen banishment,’ during an interaction with journalists.\nAt the end of the exercise, a barcode is generated, indicating a permit to travel.\nIt was that they had not gone to something called the Nigerian Travel Porter and obtained a permit to travel.\n“But it did not generate the permit to enter Nigeria, which has a square barcode."
  },
  {
    "headline": "How I was prevented from entering Nigeria over COVID-19 permit –Soyinka",
    "summarized_story": "Gbenga AdenijiNobel laureate, Prof Wole Soyinka, on Thursday said he was prevented from boarding at the Charles de Gaulle Airport in Paris, France, for failing to obtain what the airline staff described as a ‘permit to travel’ to Nigeria.\nSoyinka spoke in Lagos on the theme, ‘COVID, technology and citizen banishment,’ during an interaction with journalists.\nAt the end of the exercise, a barcode is generated, indicating a permit to travel.\nIt was that they had not gone to something called the Nigerian Travel Porter and obtained a permit to travel.\n“But it did not generate the permit to enter Nigeria, which has a square barcode."
  },
  {
    "headline": "NAFDAC warns Nigerians against using US recalled drug",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has urged the public, healthcare professionals, distributors and importers who are in possession of recalled lots of Ruzurgi (Amifampridine) 10mg tablets to discontinue sale or use.\nThe warning is in a statement signed by the agency’s Director-General, Prof. Moji Adeyeye on Friday in Abuja, following the recall of the drug by the US Food and Drug Administration.\nAdeyeye noted that NAFDAC was informed by the US FDA that the drug was found to be contaminated with yeast, mold and aerobic bacteria based on laboratory test results.\nShe, therefore, encouraged health professionals and patients to report adverse events or quality problems experienced with the use of the medicine to the nearest NAFDAC office.\nShe called for the handover of the remaining stock to the agency’s nearest office or via [email protected] or the website — www.nafdac.gov.ng."
  },
  {
    "headline": "NAFDAC warns Nigerians against using US recalled drug",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has urged the public, healthcare professionals, distributors and importers who are in possession of recalled lots of Ruzurgi (Amifampridine) 10mg tablets to discontinue sale or use.\nThe warning is in a statement signed by the agency’s Director-General, Prof. Moji Adeyeye on Friday in Abuja, following the recall of the drug by the US Food and Drug Administration.\nAdeyeye noted that NAFDAC was informed by the US FDA that the drug was found to be contaminated with yeast, mold and aerobic bacteria based on laboratory test results.\nShe, therefore, encouraged health professionals and patients to report adverse events or quality problems experienced with the use of the medicine to the nearest NAFDAC office.\nShe called for the handover of the remaining stock to the agency’s nearest office or via [email protected] or the website — www.nafdac.gov.ng."
  },
  {
    "headline": "Adamawa cancels council election",
    "summarized_story": "The Adamawa State Independent Electoral Commission (ADSIEC) has put off its proposed local government council election.\nThe state electoral body, which earlier scheduled the election for December 4, 2021, gave no new date for the exercise.\n“Preparations by the commission to conduct the LGC election are suspended to give government time to source for supplementary funds,” the ADSIEC chairman said.\n“These changes will require additional funds to organise and conduct the election; hence, the suspension of the exercise, to enable government source supplementary funds,” the ADSIEC boss concluded.\nIt is unclear how a vacuum to be created by not doing the election early in December will be tackled, as the term of incumbent chairmen and councillors across the 21 LGAs of the state will be up on December 8, 2021"
  },
  {
    "headline": "Whereabouts of Supreme Court Justice, Mary Peter unknown after invasion of her residence by security operatives",
    "summarized_story": "Anxiety and confusion on Friday trailed the fate and whereabouts of the Supreme Court Justice, Mary Ekaego Peter Odili following the alleged unlawful siege laid on her Abuja family residence by security operatives.\nHowever, security operatives guarding the house were said to have resisted the take over of the house without a court order or instructions from the above.\n“The Commission enjoins the public to discountenance the report,” a statement was issued by Mr Wilson Uwujare, Head, Media & Publicity read.\nThe Director of the Press and Information at the Supreme Court of Nigera, Dr Festus Aweneri Akande switched off his phone when our correspondent tried to reach Hime.\nOur correspondent recalled that the husband of the Supreme Court Justice, Dr Peter Odili had running battle with the Nigerian Immigration Service over unlawful seizure of his international passport upon arrival from a trip to the United Kingdom."
  },
  {
    "headline": "Google lists Tiwa Savage sextape, Tyson Fury fight, Nnamdi Kanu, others as top trending searches",
    "summarized_story": "Google has announced the emergence of a sextape involving Nigerian favourite pop star, Tiwa Savage, as among the top trending searches on Google in October.\nThe conclusion of the much-anticipated boxing bout between Tyson Fury and Deontay Wilder also piqued the interest of Nigerian sports fans on Google.\nGoogle announced this in its October search trends report on Friday in Lagos, NAN reports.\nOther interesting searches by Nigerians in October, according to Google report, were the releases of hit songs Alcohol and Levels by Joe Boy and Flavour, respectively.\nRecall that the search trends information is gleaned from data collated by Google based on what Nigerians have been searching for and asking Google."
  },
  {
    "headline": "FG to create more programmes to tackle insecurity, unemployment in Nigeria",
    "summarized_story": "The Federal Government has pledged to create more programmes to tackle unemployment and insecurity in the country.\nHe said this was part of the multi-pronged strategy of the federal government to create jobs and tackle insecurity.\nThe informal economy is badly hit.\nThe minister commended the Central Bank of Nigeria for its interventions in the government economic recovery plans, noting particularly the recent one-year moratorium given on interests to entrepreneurs.\n”To this extent, there is no zone in Nigeria that is not affected by one insecurity problem or the other."
  },
  {
    "headline": "Troops neutralize ISWAP fighters in Borno Army base attack",
    "summarized_story": "Nigerian troops repelled an attack by the Islamic State’s West Africa Province (ISWAP) in Borno State.\nThe insurgents had attempted to overrun the Damboa Super Camp of the Nigerian Army Thursday night.\nThey stormed the location in about nine gun trucks, three Armoured Personnel Carriers (APCs) and three MRAPs.\n“Ground troops, with the support of the military Air Task Force (ATF) engaged them, and eliminated scores”, he said.\nThree gun trucks used by the terrorists were destroyed, while arms and ammunition were recovered."
  },
  {
    "headline": "We’ve not called for Anambra poll boycott, says IPOB",
    "summarized_story": "The proscribed group said it had neither made any official statement nor called for the boycott of the poll.\nOur position has nothing to do with Anambra election.\n- Advertisement -“All we need is the release of our leader who committed no crime to be held perpetually in custody.\n“We knew their evil plans when they were killing their fellow politicians and blaming it on IPOB.\nIPOB has never, at any time, called for boycott of Anambra election."
  },
  {
    "headline": "Confusion over alleged invasion of ex-Gov Odili’s home by security agents",
    "summarized_story": "By Eric Ikhilae and Nicholas Kalu, AbujaSome security agents reportedly invaded the Abuja residence of the former Rivers Governor, Peter Odili in Maitama on Friday evening.\n- Advertisement -The residence is said to also be occupied by his wife, Justice Mary Odili of the Supreme Court.\nThe security agents, The Nation learnt, showed up at the residence around 5pm but were prevented from accessing the property by a team of security officials stationed in the house.\n- Advertisement -It was also not clear who, between the wife and husband, was the target of the security agents suspected to be from the SSS.\nAn insider claimed that SSS operatives came to the house but were denied entry by the security agents attached to the house, who said the visiting security men did not provide convincing information about their mission."
  },
  {
    "headline": "National Convention: PDP leaders in crucial meeting over Oyinlola, Arapaja",
    "summarized_story": "Leaders and stakeholders in the Peoples Democratic Party (PDP) met on Friday night to resolve the lingering stalemate over the position of Deputy National Chairman (South).\n- Advertisement -Others are NEC members, Board of Trustees (BoT) members, National Working Committee members, National Assembly members, former Governors and former cabinet ministers among others.\nA former Osun Governor, Prince Olagunsoye Oyinlola and a former Oyo Deputy Governor, Taofeek Arapaja are contesting for the position.\nEfforts by party leaders to pick one of the contestants as consensus candidate have failed to yield positive results.\nBut some elders and leaders of the party have a different opinion on the matter, as many of them have expressed preference for Oyinlola."
  },
  {
    "headline": "Buhari returns to Abuja from Saudi Arabia",
    "summarized_story": "President Muhammadu Buhari returned to Abuja on Friday evening after a five-day outing in Saudi Arabia where he was involved in a couple of activities, including attending the Future Investment Initiative Institute Summit in Riyadh.\n- Advertisement -On arrival at the Nnamdi Azikiwe International Airport, Abuja, President Buhari was received by his Chief of Staff, Professor Ibrahim Gambari; Minister of the Federal Capital Territory (FCT), Mallam Muhammad Musa Bello; the Inspector-General of Police, Usman Alkali Baba, and the Director-General of the Department of State Service (DSS), Yusuf Magaji Bichi.\nOn the trip to Saudi Arabia, the President was accompanied by the Minister of Industry, Trade and Investment, Otunba Niyi Adebayo; Minister of Communications and Digital Economy, Prof. Isa Ali Ibrahim Pantami; Minister of State for Foreign Affairs, Amb Zubairu Dada; and the Minister of State for Petroleum Resources, Chief Timipre Sylva.\nOthers on his entourage were the Director-General of National Intelligence Agency, Amb.\nAhmed Rufai Abubakar; Managing Director of Nigerian Sovereign Investment Authority, Uche Orji; as well as the Senior Special Assistant on Media and Publicity, Mallam Garba Shehu."
  },
  {
    "headline": "Abducted Customs Officer found dead in Ogun",
    "summarized_story": "By Steve AgbotaThe dead body of a customs officer who was allegedly abducted on Tuesday by suspected smugglers in Ogun State has been found.\nSuspected smugglers, on Tuesday ambushed a Customs patrol team at Yewa South Local Government Area of Ogun, and abducted two customs officers in the process.\nAs if that was not enough on Tuesday, October 26, in the same Ogun State suspected smugglers ambushed another patrol team in Yewa South Local government area of Ogun State and abducted two officers.\n“The search for the second missing officer continued till yesterday, Friday, when the dead body of the second abducted officer was found.\nThis will be the last time I will come on air to discuss issues of attack and killing of Customs officer."
  },
  {
    "headline": "PDP: Court dashes Secondus fate, okays national convention",
    "summarized_story": "From TONY JOHN, Port HarcourtThe Court of Appeal in Port Harcourt, Rivers State, has dashed the attempts by the embattled former national chairman of the People’s Democratic Party (PDP), Uche Secondus, to stop the national convention scheduled for today (Saturday) and tomorrow.\nThis was the outcome of yesterday’s ruling delivered by Justice Gabriel Kolawole of the Appeal Court.\n“The so-called personal rights to preside at the sixth respondent national convention is, in my view, a power confered by the sixth respondent constitution.\nThe court continued: “The appellant having been suspended as a member of the sixth respondent, can no longer partake in the affairs of the sixth respondent in any capacity.\n“So the court has directed that the PDP can continue with the national convention."
  },
  {
    "headline": "BREAKING: NECO releases 2021 JUNE/JULY SSCE Results",
    "summarized_story": "However 945,853 candidates out of the 1,226,796 that sat for this year’s June/July Senior School Certificate Examination SSCE got five credits and above including English language, representing 77.72 per cent, indicates 2.3 percent increase in performance of candidates compare to 2020.\nIn the same vein, 1,094,291 candidates scored credits and above in Mathematics, representing 90 percent, also a decline in the performance of candidates compare to 2020 where 1,060,100 candidates, representing 90.08 percent scored credit and above in mathematics.\nHe however attributed the decline in the performance of candidates to last year’s Examinations to high level of Insecurity, adding that last year, candidates had a better atmosphere despite EndSARS protests.\nHe added that no fewer than 20 supervisors were blacklisted for various offenses ranging from poor comprise, extortion, aiding and abetting and connivance.\nAccording to him, “the 2021 June/July SSCE can therefore be adjourned to be a huge success despite the decline in the performance of candidates, “I am delighted to confirmed that NECO has again delivered on its mandate”."
  },
  {
    "headline": "Breaking:Court dashes Secondus fate, okays PDP convention",
    "summarized_story": "From TONY JOHN Port HarcourtCourt of Appeal in Port Harcourt, Rivers State, has given the People’s Democratic Party (PDP) nod to hold its national convention.\nThis was a unanimous decision in the ruling of a three-man appeal panel delivered today (Friday).\nDetails soon….."
  },
  {
    "headline": "2023: Christian/Christian, Muslim/Muslim ticket not acceptable to us, CAN warns",
    "summarized_story": "From Fred Ezeh, AbujaAs the political process leading to the 2023 general elections gather momentum, the Christian Association of Nigeria (CAN) has advised political parties against choosing their presidential and governorship candidates from the same religion, either on Christian/Christian or Muslim/Muslim ticket.\nIt cautioned the leading political parties against heating up the polity with such arrangement saying it could trigger unnecessary suspicion, acrimony and denial by voters.\nThey should rather guide their utterances and actions because there is already tension in the land because of insecurity.\nWe neither want Christian/Christian ticket nor Muslim/Muslim ticket.”USA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply .\nHe said the APC would not field candidates from the same religion on its presidential ticket."
  },
  {
    "headline": "News in Photographs: Buhari Returns to Abuja from Saudi Arabia",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja from Saudi Arabia.\nBuhari departed for Riyadh, Saudi Arabia, Monday to participate in a three-day investment conference organized by the Future Investment Initiative Institute.\nIn Saudi Arabia, the President also performed the lesser Hajj and met with Nigerians before returning to Abuja on Friday evening.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Confusion as EFCC Denies Raiding Justice Odili’s Home",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Economic and Financial Crimes Commission (EFCC) has denied conducting any operation in the Maitama, Abuja, home of a judge of the Supreme Court, Justice Mary Odili.\nBut a statement issued by the EFCC denied executing any search warrant at the residence of Justice Odili.\n“The commission by this statement wishes to inform the public that the report is false as it did not carry out any operation at the home of Justice Odili.\nIf there was any such operation as claimed by the media, it was not carried out by the EFCC.\nAlso in 2020, the former governor approached a Federal High Court for another injunction to stop an impending probe."
  },
  {
    "headline": "Osinbajo, Tinubu Meet in Abuja",
    "summarized_story": "Vice President Yemi Osinbajo on Friday visited All Progressives Congress leader, Asiwaju Bola Tinubu, at his residence in Abuja.\nThough details of their meeting have not been released, photos released by the Office of the Vice President showed the two men embracing and later discussing while seated.\nRecent media reports had indicated frosty relations between Tinubu and Osinbajo over 2023 presidential race.\nBoth are aspiring to succeed President Muhammadu Buhari, whose second term ends on May 29, 2023.\nThough, the duo have not formally declared their aspirations to succeed Buhari, groups canvassing for them are emerging across the country."
  },
  {
    "headline": "NECO Releases 2021 SSCE Results",
    "summarized_story": "By Laleye DipoThe National Examination Council NECO on Friday released the results of the Senior School Certificate Examination it conducted nationwide between June and July this year.\nRegistrar and Chief Executive Officer of the organisation Professor Dantani Ibrahim Wushishi, who released the results in Minna, said more than 878,925 candidates recorded credit in five subjects including English and Mathematics.\nThe Registrar also disclosed that 1,226,796 candidates scored five credits irrespective of English and Mathematics while 1,094,291 candidates had credit in Mathematics.\n1,226,796 candidates made up of 657,389 males and.\n576,242 sat for the examination out of the 1,233,631 that registered."
  },
  {
    "headline": "I Will Leave in 2023, Buhari Reassures Nigerians",
    "summarized_story": "Warns tenure extension campaigners to desistPresident Muhammadu Buhari has reassured Nigerians that he would leave office on May 29, 2023 when he would have served his constitutionally stipulated two-terms.\nHe therefore warned tenure extension campaigners to desist.\nNo “Tazarce’’ (tenure extension).\nI will not accept that,” President Buhari vowed at a meeting in Makkah with a select group of Nigerians resident in the Kingdom of Saudi Arabia where he just ended a visit.\nPresident Buhari urged Nigerians living in the country to respect the laws, remain law-abiding and do nothing to derogate from the many years of friendly and mutually beneficial relationships between the two countries."
  },
  {
    "headline": "BREAKING: Former Nigerian Senator, Hosea Ehinlanwo Is Dead",
    "summarized_story": "A two-term senator from Ondo State, Hosea Ehinlanwo, is dead.\nLate Hosea EhinlanwoSaharaReporters learnt that Ehinlanwo died in Abuja on Friday shortly after he returned from the hospital.\n“Ehinlanwo died at home in Abuja shortly after he returned from the hospital,” a source revealed.\nEhinlanwo belonged to the sub-committee on the executive, which was to consider proposals relating to the executive branch of government across the three tiers.\nEhinlanwo had a Bachelor of Law degree, a barrister at law and a master's degree in business administration."
  },
  {
    "headline": "BREAKING: Former Nigerian Senator, Hosea Ehinlanwo Is Dead",
    "summarized_story": "A two-term senator from Ondo State, Hosea Ehinlanwo, is dead.\nLate Hosea EhinlanwoSaharaReporters learnt that Ehinlanwo died in Abuja on Friday shortly after he returned from the hospital.\n“Ehinlanwo died at home in Abuja shortly after he returned from the hospital,” a source revealed.\nEhinlanwo belonged to the sub-committee on the executive, which was to consider proposals relating to the executive branch of government across the three tiers.\nEhinlanwo had a Bachelor of Law degree, a barrister at law and a master's degree in business administration."
  },
  {
    "headline": "2023: Buhari Reveals There Is Third Term Agenda As Earlier Exposed In SaharaReporters’ Story",
    "summarized_story": "President Muhammadu Buhari on Friday confirmed an earlier expose by SaharaReporters that the Presidency cabal was plotting a Third Term agenda despite his maladministration and repressive eight-year regime.\nSaharaReporters on October 7 revealed that some members of the Aso Rock cabal were pushing a third-term agenda for Buhari and for the amendment of the Nigerian Constitution to allow the President to stay beyond 2023.\nThe so-called Third Term Agenda collapsed on May 16, 2006, when the Nigerian Senate threw out the Constitutional Amendments Bill.\n“Buhari to visit Glasgow, Scotland, Paris, France and Dubai, UAE before the end of 2021 amidst strong rumour of third term agenda,” another source had said.\nThis comes two years after an APC chieftain, Charles Enya filed a suit, seeking the amendment of the constitution to allow Buhari to get another term in office."
  },
  {
    "headline": "2023: Buhari Reveals There Is Third Term Agenda As Earlier Exposed In SaharaReporters’ Story",
    "summarized_story": "President Muhammadu Buhari on Friday confirmed an earlier expose by SaharaReporters that the Presidency cabal was plotting a Third Term agenda despite his maladministration and repressive eight-year regime.\nSaharaReporters on October 7 revealed that some members of the Aso Rock cabal were pushing a third-term agenda for Buhari and for the amendment of the Nigerian Constitution to allow the President to stay beyond 2023.\nThe so-called Third Term Agenda collapsed on May 16, 2006, when the Nigerian Senate threw out the Constitutional Amendments Bill.\n“Buhari to visit Glasgow, Scotland, Paris, France and Dubai, UAE before the end of 2021 amidst strong rumour of third term agenda,” another source had said.\nThis comes two years after an APC chieftain, Charles Enya filed a suit, seeking the amendment of the constitution to allow Buhari to get another term in office."
  },
  {
    "headline": "2023: Buhari Reveals There Is Third Term Agenda As Earlier Exposed In SaharaReporters’ Story",
    "summarized_story": "President Muhammadu Buhari on Friday confirmed an earlier expose by SaharaReporters that the Presidency cabal was plotting a Third Term agenda despite his maladministration and repressive eight-year regime.\nSaharaReporters on October 7 revealed that some members of the Aso Rock cabal were pushing a third-term agenda for Buhari and for the amendment of the Nigerian Constitution to allow the President to stay beyond 2023.\nThe so-called Third Term Agenda collapsed on May 16, 2006, when the Nigerian Senate threw out the Constitutional Amendments Bill.\n“Buhari to visit Glasgow, Scotland, Paris, France and Dubai, UAE before the end of 2021 amidst strong rumour of third term agenda,” another source had said.\nThis comes two years after an APC chieftain, Charles Enya filed a suit, seeking the amendment of the constitution to allow Buhari to get another term in office."
  },
  {
    "headline": "No name, wrong address... flaws in search warrant presented at Mary Odili's home",
    "summarized_story": "Documents have revealed that the warrant presented by security operatives to search the Abuja residence of Mary Odili, a justice of the supreme court, carries a wrong address.\nAdvertisement“That on the strength of the affidavit, we seek for a search warrant to enable us carry out investigation at No.\nWhile Odili’s address is 7, Imo river street, Maitama, the address on the warrant is 9, Imo street, Maitama.\nA search warrant must have the name of the person that you want to carry out a search on his or her house,” he said.\n“Also, if they were looking for Imo street, they should look for Imo street elsewhere."
  },
  {
    "headline": "No name, wrong address... flaws in search warrant presented at Mary Odili's home",
    "summarized_story": "Documents have revealed that the warrant presented by security operatives to search the Abuja residence of Mary Odili, a justice of the supreme court, carries a wrong address.\nAdvertisement“That on the strength of the affidavit, we seek for a search warrant to enable us carry out investigation at No.\nWhile Odili’s address is 7, Imo river street, Maitama, the address on the warrant is 9, Imo street, Maitama.\nA search warrant must have the name of the person that you want to carry out a search on his or her house,” he said.\n“Also, if they were looking for Imo street, they should look for Imo street elsewhere."
  },
  {
    "headline": "Defence minister: Why FG hasn't declared bandits as terrorists",
    "summarized_story": "Bashir Magashi, minister of defence, says the need to follow due process is responsible for the delay in declaring bandits as terrorists.\nAdvertisementThere have been calls for the federal government to declare bandits as terrorists, amid accusation that the government is handling bandits with “kid gloves”.\nBut, Lai Mohammed, minister of information and culture, had said the federal government’s approach is not to make a distinction between bandits and terrorists.\nSpeaking with journalists in Maiduguri on Friday, Magashi said there is a procedure that needs to be observed before such a declaration.\nAdvertisement“We are not declaring them terrorists because there is a procedure for doing that,” he said."
  },
  {
    "headline": "Defence minister: Why FG hasn't declared bandits as terrorists",
    "summarized_story": "Bashir Magashi, minister of defence, says the need to follow due process is responsible for the delay in declaring bandits as terrorists.\nAdvertisementThere have been calls for the federal government to declare bandits as terrorists, amid accusation that the government is handling bandits with “kid gloves”.\nBut, Lai Mohammed, minister of information and culture, had said the federal government’s approach is not to make a distinction between bandits and terrorists.\nSpeaking with journalists in Maiduguri on Friday, Magashi said there is a procedure that needs to be observed before such a declaration.\nAdvertisement“We are not declaring them terrorists because there is a procedure for doing that,” he said."
  },
  {
    "headline": "Soldiers, police operatives search Mary Odili's residence in Abuja",
    "summarized_story": "Security operatives, on Friday, conducted a search on the home of Mary Odili, a justice of the supreme court, in Abuja.\nThe security operatives, who were made up of soldiers and officers of the Nigeria Police Force (NPF), identified themselves as members of a joint task force.\nThe security operatives, who came with a search warrant, said they received information on “illegal activities” going on in the house.\nThe security operatives were, however, said to have not discovered anything of interest in relation to the alleged illegal activities, and left after about an hour.\nAdvertisementMeanwhile, the Economic and Financial Crimes Commission (EFCC) has denied the involvement of its operatives in the search."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Bolt’s EV option, aYo Holdings’ new business model, Facebook’s new name, Namibia’s crime-busting plans",
    "summarized_story": "The company plans to drive greater scale, better customer experience, and faster access to markets across the African continent in the coming years.\n50 countries in Africa have introduced mandatory SIM card registration laws.\nUa-Ndjarakana said that the SIM card registration process would be done to protect consumers’ privacy.\nDo you think SIM card registration combats crime or increases surveillance in Africa?\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "But then, it took her five years to build her first factory, and nine years in total to the Series A.Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Tuesday November 2, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Stitch’s Nigeria expansion, Africa’s military coups, RecoMed’s $1.5m funding, and Union45’s $3m seed",
    "summarized_story": "Source: Supplied,South African API fintech startup, Stitch has today announced its expansion into Nigeria and a $2M seed extension, with investment from Future Africa and Norrsken Foundation, among others.\nStitch announced an initial $4 million seed in February when it came out of stealth.\nThe startup launched officially in February 2021 with an API that provides software companies with identity verification tools and access to users’ financial data.\nWhile fintech startups still get a significant chunk of African funding, healthtech startups seem to be attracting some serious cash.\nApply hereCall for climate-focused startups: Africa ClimAccelerator Applications open."
  },
  {
    "headline": "Bread price: Consumers, bakers disagree over increment in Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOrhionmwon – Enforcement of a one-week strike by bread bakers in Edo State degenerated into chaos on Thursday at Abudu, administrative headquarters of Orhionmwon local government area, as some youths resisted the strike enforcers from stopping a bread seller who came in from neighbouring Delta state.\nAs a result they protected the seller who came in with a van loaded with bread to distribute at the area where bakers observing the one-week strike have resolved to stick to a new price regime.\nThe youths chased away some enforcers on motorcycle who tried to confront the Agbor bread seller while he distributes to mostly table sellers.\nThe added, upon expiration of the One-week strike on Friday 29th October 2021, the price of bread will increase to meet current market realities of price of flours and sugar which are essentials in bread production.\n“Due to the continuous massive increment in the price of baking materials and other things like diesel, gas, firewood etc."
  },
  {
    "headline": "Obaseki charges tertiary institutions on alternative sources of funding – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… As Edo First Lady, three others bag honorary fellowshipBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged tertiary institutions in the state to explore alternative sources of funding to ensure the viability of the higher institutions and address the issue of paucity of funds.\nObaseki gave the charge while delivering his speech at the 3rd and 4th Convocation Ceremony of the Edo State Polytechnic, held at the school’s main auditorium in Usen, Ovia North East Local Government Area of Edo State.\nThe convocation ceremony also featured the conferment of honourary fellowship awards on four Nigerians, including the Edo State First Lady, Mrs. Betsy Obaseki, for their contribution to the development of the state and the country.\nOur tertiary institutions must promote and encourage scholarship, entrepreneurship and produce skilled manpower relevant to the needs of the labour market.\nThe country needs Edo State for its development.”In his convocation speech, the rector of the polytechnic, Prof. Abiodun Falodun commended the governor for his commitment, focus and determination in repositioning the institution."
  },
  {
    "headline": "Troops deactivate 27 illegal refining sites in Niger Delta – DHQ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTroops of Operation Delta Safe have deactivated a total of 27 illegal refining sites across Niger Delta region, in the last two weeks.\nOnyeuko said the illegal refining sites had 57 ovens, 17 cooking pots/boilers, two cooling systems, 37 reservoirs, nine large dugout pits and 27 storage tanks, drums and sacks laden with illegally refined oil products.\nHe added that nine suspects were arrested while one dane gun, among other items were recovered in the course of the operations.\n“Also, five criminals associated with pipeline vandalism, piracy, illegal oil bunkering and armed robbery were arrested within the period.\n“Troops of Operation Delta Safe have remained steadfast in the execution of land, maritime and air operations in the South-South Zone, to forestall activities of economic saboteurs and other criminal elements,” he said."
  },
  {
    "headline": "FG spends N4.5bn to feed 228,646 Gombe pupils in 5 yrs – NSIP – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestGOMBE – The Federal Government has spent N4.5 billion to feed 228,646 pupils in Gombe State since the school feeding programme started in 2016.\nDr Umar Bandir, National Coordinator of the National Social Investment Programme (NSIP), made the declaration in Gombe on Thursday while donating 225,000 branded plates to Gombe State government for the programme.\nBandir said 1,234 schools in Gombe State had benefitted since the programme began.\nThe NSIP coordinator reiterated that while the Federal Government provided funds for the programme, state governments had the responsibility of ensuring its smooth implementation.\nResponding, Secretary to Gombe State government, Abubakar Njodi, assured that the donation would be used judiciously."
  },
  {
    "headline": "ZAƁEN 2023: ‘Yan Najeriya sun gaji da gajiyayyen shugaban da ba shi da ƙarfi, sai ƙarfin ‘yan fada -Bishof Ajakaye",
    "summarized_story": ""
  },
  {
    "headline": "Sake fantsamar cutar korona a Turai, Rasha da Chana ta fara karya farashin gangar ɗanyen mai a duniya",
    "summarized_story": ""
  },
  {
    "headline": "Mun fada cikin tsananin talauci da mawuyacin hali dalilin zaman ‘Kulle’ da IPOB suka kakaba a jihohin mu – Direbobin Abia",
    "summarized_story": ""
  },
  {
    "headline": "Mun kammala titunan sama da naira biliyan N88.4 da Sule Lamido ya yi watsi dasu",
    "summarized_story": ""
  },
  {
    "headline": "Yadda yaran Dogo Gide suka yi gunduwa-gunduwa da dan bindiga Damina a garin Farin Ruwa",
    "summarized_story": ""
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "100 Out-of-School Girls, Others Participate in U.S. Sponsored Entrepreneurship Programme",
    "summarized_story": "Girls Creativity Hub, U.S. government exchange alumni-led project, has completed a 12-month long entrepreneurship program for 100 out-of-school girls and young women.\nAged 18-25, the participants received training and mentorship in areas of creative design, entrepreneurship, and leadership skills, with the overall goal of establishing economic independence.\n“The United States believes that the economic empowerment of women is crucial to the development of every country.\nWithout women’s inclusive participation in society, any gains in economic growth, development, science, or technology are unsustainable,” Siddiqi said.\nYou were able to align your priorities for the benefit of your fellow citizens to improve economic growth and development, and we are proud of you for giving back to your communities,” he added."
  },
  {
    "headline": "Nigerian soldiers kill Biafra National Guard gunman, arrest another",
    "summarized_story": "The Nigerian Army has said troops conducting Exercise GOLDEN DAWN have neutralised one of the Biafran National Guard (BNG) gunmen who attacked their location at Amaekpu, Ohafia Local Government Area of Abia State on Thursday 28 October 2021.\nBNG is a new armed separatist group operating in Nigeria’s Southeast, with stated mission to declare an independent state of Biafra on October 30.\nAccording to the statement, the troops neutralized one gunman, while others abandoned their vehicles and retreated in disarray with gunshot wounds.\nWhile the criminals withdrew, having been overwhelmed, they were promptly intercepted at Eda by troops of Forward Operating Base Ohaozara in Ebonyi State.\nThe troops recovered additional three vehicles and apprehended one of the gunmen."
  },
  {
    "headline": "Former Ondo governor, Olusegun Mimiko rejoins PDP",
    "summarized_story": "Dr Olusegun Mimiko, former Ondo State governor, has rejoined the Peoples Democratic Party (PDP).\nHe made the decision following a visit to him by PDP governors, including Sokoto State governor, Aminu Tanbuwal; Oyo state governor, Seyi Makinde; Rivers State governor, Nyesom Wike and Abia State governor, Okezie Ikpeazu on Wednesday.\n“The stakeholders meeting was called to discuss the meeting with the PDP governors and intimate members with the outcomes of series of interactions with PDP leaders on the invitation extended to him.\nEarlier, after about an hour closed door meeting with Mimiko, governor Tambuwal said “we are here in the beautiful of Ondo Town, in Ondo state the home of our leader, and brother, Dr Olusegun Mimiko, former governor of Ondo state to re-invite him back to his family, his political family, PDP and work towards rescuing Nigeria.\nAccording to him “We have listened to them and going to have our stakeholders meeting and ultimately it’s the people, the stakeholders that will decide."
  },
  {
    "headline": "Facebook rebrands, names itself Meta to emphasize ‘metaverse’ vision NEW",
    "summarized_story": "Feeling truly present with another person is the ultimate dream of social technology.\nWhile most tech companies focus on how people interact with technology, we’ve always focused on building technology so people can interact with each other.\nIn our DNA, we build technology to bring people together.\nOver time, I hope we are seen as a metaverse company, and I want to anchor our work and our identity on what we’re building towards.\n“But all of our products, including our apps, now share a new vision: to help bring the metaverse to life."
  },
  {
    "headline": "Gunmen Kill 2 Police Personnel In Anambra",
    "summarized_story": "No fewer than two policemen have been killed by a gang of unknown gunmen in Anambra State with several other persons inflicted with bullet wounds.\nLEADERSHIP gathered that the incident occurred on Friday at Ekwulobia, Aguata local government area of the state.\n“As at 11am, the whole of Ekwulobia roundabout area, including the market were deserted, until soldiers arrived there,” the source stated.\nHe continued: “Before you can pass through the round about since the soldiers arrived you must hands up.\nWhen the policemen were firing them, their bullets were not penetrating the boys, and, some people where hailing them,” the source told LEADERSHIP."
  },
  {
    "headline": "Gunmen Kill 2 Police Personnel In Anambra",
    "summarized_story": "No fewer than two policemen have been killed by a gang of unknown gunmen in Anambra State with several other persons inflicted with bullet wounds.\nLEADERSHIP gathered that the incident occurred on Friday at Ekwulobia, Aguata local government area of the state.\n“As at 11am, the whole of Ekwulobia roundabout area, including the market were deserted, until soldiers arrived there,” the source stated.\nHe continued: “Before you can pass through the round about since the soldiers arrived you must hands up.\nWhen the policemen were firing them, their bullets were not penetrating the boys, and, some people where hailing them,” the source told LEADERSHIP."
  },
  {
    "headline": "Body Of Missing Customs Officer Found In Ogun River, Rifle Missing",
    "summarized_story": "The body of a Customs officer declared missing by the Nigeria Customs Service (NCS) has been found floating on Ipaja River, Yewa South local government area of Ogun State.\nThe recent killing made it the third officer to be killed by smugglers in the State in the last three weeks.\nAccording to him, a Customs officer was matcheted to death at Ado-Odo after intercepting 45 bags of rice being smuggled into the country.\nHowever, on 26th of October, at Oke-Odan in Ogun State, specifically fagbohun Village, officers were ambushed and two were declared missing.\n“The border of Ogun State remained under locks and keys and smuggling is not what to bequeath to any generation because smugglung is alien to our constitution,” he stated."
  },
  {
    "headline": "Body Of Missing Customs Officer Found In Ogun River, Rifle Missing",
    "summarized_story": "The body of a Customs officer declared missing by the Nigeria Customs Service (NCS) has been found floating on Ipaja River, Yewa South local government area of Ogun State.\nThe recent killing made it the third officer to be killed by smugglers in the State in the last three weeks.\nAccording to him, a Customs officer was matcheted to death at Ado-Odo after intercepting 45 bags of rice being smuggled into the country.\nHowever, on 26th of October, at Oke-Odan in Ogun State, specifically fagbohun Village, officers were ambushed and two were declared missing.\n“The border of Ogun State remained under locks and keys and smuggling is not what to bequeath to any generation because smugglung is alien to our constitution,” he stated."
  },
  {
    "headline": "PDP Convention: South-West Stakeholders Endorse Oyinlola, Ologunagba As National Officers",
    "summarized_story": "In a last-minute effort to secure a united front in the national convention to elect national officers of the Peoples Democratic Party (PDP), stakeholders of the party from the South-West zone, have concluded negotiations on candidates to adopt as consensus options.\nSources at the consultative meeting held in Lagos on Wednesday said that the stakeholders have concluded on a former Osun State governor, Prince Olagunsoye Oyinlola as the deputy national chairman (South) and Hon.\nIn addition to that is the claim that the emergence of a former deputy governor of Oyo State, Taofeek Arapaja, was a creation of Governor Makinde.\n“Now, remember that the Osun State governorship election is next to the 2023 general election.\nWe, the stakeholders, believe that Prince Oyinlola, having been governor in Osun State and with records of his achievements in office, should be the person to lead our campaign in the Osun State governorship election."
  },
  {
    "headline": "Anambra Guber: ‘Stop feigning ignorance about Anambra’s huge debts,’ Uba tells Soludo",
    "summarized_story": "By CHIKA CHIMEZIE…says State’s debt profile is alarmingThe Senator Andy Uba Governorship Campaign Organisation, SAUGCO has asked former Governor of the Central Bank of Nigeria(CBN), Professor Charles Soludo to stop feigning ignorance about the total debt liability of the state he so desperately seeks to govern.\nThe usually verbose Professor of Economics had been pointedly asked if he knew what the state’s debt overhang was, and how he intended to deal with it.\nInstead of offering a definitive answer, the APGA candidate embarked on a rigmarole, before stating that he would find out when he becomes governor.\nVictor Afam Ogene, Director, Media and Publicity of the Senator Andy Uba Governorship Campaign Organisation, SAUGCO said in a statement today.\n“Whichever is the case, Professor Soludo owes ndi Anambra the patriotic duty of researching into what really is the debt liability of our dear state, Anambra."
  },
  {
    "headline": "TASUED: Crisis brews as NANS gives Army 24-hour ultimatum to release students",
    "summarized_story": "The National Association of Nigerian Students has given the Nigerian Army a 24-hour ultimatum to release the Tai Solarin University of Education students arrested on Friday.\nThis came in a statement signed by the NANS President, Sunday Asefon, who stated that the arrest was a breach of the fundamental human rights of the harmless students which is against the constitution.\nAsefon also accused the Army of flagrant abuse of power, similar to the military rule imposed on Nigerians in the past, while noting that the organisation would not overlook the incident.\n“It is therefore incumbent on us as the most populous, virile and ideological students movement in Africa to address the growing rate of similar fragrant abuse of state power by men of the military against harmless students and Nigerians.\nWe have had enough intimidation, extortion and harassment from the Nigerian Police, we must not allow same by the Nigeria Army to degenerate to the level that cannot be controlled,” Asefon stated."
  },
  {
    "headline": "Fans react as BBNaija star, Liquorose rocks see-through dinner dress",
    "summarized_story": "Former Big Brother Naija Shine Ya Eye housemate, Liquorose, set tongues wagging with her see-through dinner dress, which she wore to a party last night.\nThe see-through shiny dress clearly highlighted her black panties and her skin-coloured silicon bra pads were used to cover her breasts.\nShe rocked the dress with a matching head scarf, a glittering purse and a pair of shiny sandal heels.\nFan, critics react to Liquorose’s dressTaking to her Instagram comment section, fans hailed the dancer for her outfit.\nExtremely exceptional.”However, the critics stated that the dancer was promoting nudity, stating that she should have better."
  },
  {
    "headline": "TASUED: Crisis brews as NANS gives Army 24-hour ultimatum to release students",
    "summarized_story": "The National Association of Nigerian Students has given the Nigerian Army a 24-hour ultimatum to release the Tai Solarin University of Education students arrested on Friday.\nThis came in a statement signed by the NANS President, Sunday Asefon, who stated that the arrest was a breach of the fundamental human rights of the harmless students which is against the constitution.\nAsefon also accused the Army of flagrant abuse of power, similar to the military rule imposed on Nigerians in the past, while noting that the organisation would not overlook the incident.\n“It is therefore incumbent on us as the most populous, virile and ideological students movement in Africa to address the growing rate of similar fragrant abuse of state power by men of the military against harmless students and Nigerians.\nWe have had enough intimidation, extortion and harassment from the Nigerian Police, we must not allow same by the Nigeria Army to degenerate to the level that cannot be controlled,” Asefon stated."
  },
  {
    "headline": "Buhari arrives Abuja from Saudi Arabia (Photos)",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja after a five-day visit to Riyadh, Madinah, and Makkah in Saudi Arabia.\nThe president arrived Abuja on Friday night and was welcomed by some members of the Federal Executive Council and military chiefs.\nSee photos below.."
  },
  {
    "headline": "Sanwo-Olu unveils new name, logo for gaming authority",
    "summarized_story": "Governor Babajide Sanwo-Olu Friday unveiled the new brand identity for the Lagos State Lotteries and Gaming Authority.\nThis comes six months after he signed the amended Lagos State Lotteries and Gaming Authority Bill into law, following its passage by the State House of Assembly.\nHe officially changed Lagos State Lotteries Board to Lagos State Lotteries and Gaming Authority as part of extensive reforms initiated by his administration to reposition the industry for greater efficiency and stakeholder satisfaction.\n“For us, the future has begun and we are excited about the unfolding development in the gaming industry.\nThen State Lotteries and Gaming Authority Law of 2021, Olotu said, has also addressed contemporary challenges and issues that may arise from time to time."
  },
  {
    "headline": "Why We’ve Not Declared Bandits As Terrorists – Defense Minister.",
    "summarized_story": "Maj. Gen. Bashir Magashi (Rtd), Minister of Defence, has stated that the delay in classifying bandits as terrorists is due to the need to follow due process.\nMagashi said this while fielding questions from reporters in Maiduguri on Friday, adding that there was a procedure that had to be followed before such a pronouncement.\n“We are not declaring them terrorists because there is a procedure for doing that.\n“When the procedure is followed, they will be classified as terrorists.\nHe said his team met with the Theatre Commander and other component commanders to deliberate on the next phase of operations, adding that the meeting also identified problems that required urgent attention to enhance the operations."
  },
  {
    "headline": "BREAKING: Bandits Kill 20 Security Operatives In Zamfara, Set Their Corpses On Fire.",
    "summarized_story": "NEWS DIRECT gathered that the security operatives were sent to a village where bandits have been ravaging for a long time without any security stoppage.\nIt was gathered that bandits ambushed the security operatives, killed scores of them and set the corpses on fire in the early hours of Friday.\nAmong the victims was Alhaji Shehu Mallami, a resident of the community.\nWhen contacted, the Public Relations Officer of the Nigeria Security and Civil Defense Corps (NSCDC), Mr. Aminu Mary confirmed the incident, saying that the state commandant of the corps had already left to the scene to ascertain what really happened."
  },
  {
    "headline": "BREAKING: Osinbajo, Tinubu Meet Amid Rumoured Feud Over 2023 Presidency",
    "summarized_story": "Vice-President Yemi Osinbajo and Asiwaju Bola Tinubu, National Leader of the All Progressives Congress (APC), met in Abuja on Friday.\nBoth men, who were locked in a warm embrace, met amid speculations that they were fighting each other over the 2023 presidential contest.\nNeither Tinubu nor Osinbajo has publicly declared interest in the race but there are indications that they are interested in succeeding Buhari.\nDetails later:"
  },
  {
    "headline": "Breaking: Secondus Loses As Court Okays PDP Convention",
    "summarized_story": "The Appeal Court in Port Harcourt, Rivers State has granted the Peoples Democratic Party (PDP) the right to hold its national convention scheduled for October 30 and 31, 2021.\nSecondus, through his counsel, Tayo Oyetibo (SAN), in an appeal marked CP/PH/339/2021, is seeking an order of injunction restraining the PDP, its officers and representatives from holding or conducting the national convention on Saturday and Sunday, or any other date pending the hearing and final determination of the appeal.\nThe embattled former chairman was edged out following his feud with Governor Nyesom Wike of Rivers State.\nThe ruling was delivered on Friday by Justice Gabriel Kolawale on behalf of two other justices.\nAll the three judges led by Justice Haruna Tsammani affirmed the ruling without any dissenting voice."
  },
  {
    "headline": "Breaking: EFCC opens up as security operatives invade Mary Odili’s residence",
    "summarized_story": "The residence of a Supreme Court Justice, Mary Odili, on Friday suffered invasion by suspected armed Police and Soldiers.\nThis is as the Economic and Financial Crimes Commission (EFCC) has swiftly denied being involved in the reported raid.\nReports earlier suggested that the security operatives arrived at Justice Odili’s Abuja residence and made immediate attempt to break in, but the wife of former Rivers State Governor, Peter Odili, fervently resisted the attempts to raid her residence by the operatives, telling the operatives that she had no business with them.\nHer husband has been facing corruption charges raised by the Economic and Financial Crimes Commission (EFCC).\nDetails loading…"
  },
  {
    "headline": "Tension as PDP holds ‘consensus national convention’",
    "summarized_story": "Like Ogbeh, another Obasanjo’s friend, Ahmadu Ali, was made the party’s national chairman.\nConsequently, Vincent Ogbulafor was elected the new chairman at the party’s national convention of 2008.\nThis has led to mass defections of party members from state to national levels, and this has affected their performances in many elections.\nThe conventionOf all the positions, only those of the national auditor, national youth leader and deputy national chairman (South) would be contested out at the convention ground as the others have already been concluded on a consensus arrangement.\nThe Enugu state governor, Ifeanyi Ugwuanyi, introduced the Abia state governor, Okezie Victor Ikpeazu."
  },
  {
    "headline": "Breaking: 2 dead as DSS operatives suffer attack in Anambra, 1 week to governorship poll",
    "summarized_story": "Gunmen on Friday ambushed operatives of the Department of State Services (DSS) and killed two Friday in Anambra.\nThe bloody incident happened about one week to scheduled governorship election in the state which has recently turned hot bird for all sorts of criminalities.\nTalking about the attack, the officers were attacked as gunmen ambushed their convoy while on election campaign duty in Ekwulobia, Blueprint reports.\nThere is already trending video showing the aftermath of the attack on social media.\nAlready, forces comprising the police and the military have condoned the area, and the remains of those killed have been taken away."
  },
  {
    "headline": "Defence Minister promises improved welfare for ex- servicemen, dependants of fallen heros, widows -NigPilot",
    "summarized_story": "Minister of Defence, Retired Major General, Bashir Magashi has promised to improve welfare needs of the ex-servicemen, widows, and dependants of the Nigerian Armed Forces Fallen Heroes.\nMagashi made this known during the Nigerian Legion Humanitarian Day Celebration line up with the activities of the Armed Forces Remembrance Day Celebration 2022, at the Legion Headquarters in Abuja.\nWhile appreciating the Nigerian Legion for their efforts towards sustaining the organisational mandate, General Magashi assured ministry of defence commitment to provide succour to the veterans, widows and orphans of fallen heroes.\nMeanwhile, some of the beneficiaries expressed gratitude to the minister of defence, Nigerian legion and other partners organisation for their selfless service to the humanity.\nHighpoint of the event, were the medical treatment to the ex-servicemen and widows, distribution of palliatives items, cash money, scholarship to the children of the fallen heroes amongst others."
  },
  {
    "headline": "Defence Minister promises improved welfare for ex- servicemen, dependants of fallen heros, widows -NigPilot",
    "summarized_story": "Minister of Defence, Retired Major General, Bashir Magashi has promised to improve welfare needs of the ex-servicemen, widows, and dependants of the Nigerian Armed Forces Fallen Heroes.\nMagashi made this known during the Nigerian Legion Humanitarian Day Celebration line up with the activities of the Armed Forces Remembrance Day Celebration 2022, at the Legion Headquarters in Abuja.\nWhile appreciating the Nigerian Legion for their efforts towards sustaining the organisational mandate, General Magashi assured ministry of defence commitment to provide succour to the veterans, widows and orphans of fallen heroes.\nMeanwhile, some of the beneficiaries expressed gratitude to the minister of defence, Nigerian legion and other partners organisation for their selfless service to the humanity.\nHighpoint of the event, were the medical treatment to the ex-servicemen and widows, distribution of palliatives items, cash money, scholarship to the children of the fallen heroes amongst others."
  },
  {
    "headline": "Osinbajo advocates sustainable procurement,environmental, social safeguards to achieve ERGP in Nigeria -NigPilot",
    "summarized_story": "Vice President of Nigeria, Prof. Yemi Osinbajo has said that if Nigeria must achieve the objectives of the Economic Recovery Growth Plan ERGP, and the Sustainable Development Goals SDGs, the country must get it right in procurement, environmental and social safeguards.\nOsinbajo made this revelation while officially launching the Sustainable Procurement, Environmental and Social Standards Enhancement Project, SPESSE in Abuja on Thursday.\nProf. Osinbajo noted that to achieve this, there is a need to build the adequate technical capacity required for efficient and effective procurement, environmental and social safeguard systems.\n“The SPESSE Project is Nigeria’s first attempt at institutionalising sustainable capacity building in the fields of Procurement, Environmental, and Social Standards, by offering professionalisation and academic programmes in a custom-made, fit-for-purpose and sustainable manner, through the Centres of Excellence.\nThe Sustainable Procurement, Environmental and Social Standards Enhancement Project centres, SPESSE, are domiciled in six universities across the 6geo-political zones of Nigeria."
  },
  {
    "headline": "Osinbajo advocates sustainable procurement,environmental, social safeguards to achieve ERGP in Nigeria -NigPilot",
    "summarized_story": "Vice President of Nigeria, Prof. Yemi Osinbajo has said that if Nigeria must achieve the objectives of the Economic Recovery Growth Plan ERGP, and the Sustainable Development Goals SDGs, the country must get it right in procurement, environmental and social safeguards.\nOsinbajo made this revelation while officially launching the Sustainable Procurement, Environmental and Social Standards Enhancement Project, SPESSE in Abuja on Thursday.\nProf. Osinbajo noted that to achieve this, there is a need to build the adequate technical capacity required for efficient and effective procurement, environmental and social safeguard systems.\n“The SPESSE Project is Nigeria’s first attempt at institutionalising sustainable capacity building in the fields of Procurement, Environmental, and Social Standards, by offering professionalisation and academic programmes in a custom-made, fit-for-purpose and sustainable manner, through the Centres of Excellence.\nThe Sustainable Procurement, Environmental and Social Standards Enhancement Project centres, SPESSE, are domiciled in six universities across the 6geo-political zones of Nigeria."
  },
  {
    "headline": "DHQ to unveil Exercise SKY LOCK on Nov 1 -NigPilot",
    "summarized_story": "The Headquarters (DHQ), on Thursday, announced its plan to unveil a new military exercise code named Exercise SKY LOCK for participants ofhe war colleges of the three service on November first.\nAccording to the statement, “The Defence Headquarters (DHQ) Abuja, is scheduled to conduct a Joint Operations Planning Exercise (JOPEX) for the participants of the Army War College Nigeria (AWCN), Naval War College Nigeria (NWCN) and Air Force War College Nigeria (AWCN) from 1 – 7 November, 2021 at the Army War College, Nigeria premises located at WU Bassey Barracks, Asokoro, Abuja.\n“The exercise nicknamed Exercise SKY LOCK is the maiden edition to be organized by the DHQ for the 3 Services War Colleges at the instance of the Chief of Defence Staff, General Lucky Irabor.\nThe key objective of the training is to enable participants effectively respond to contemporary security challenges bedeviling Nigeria using a joint and multi-agency approach”.\nThe one-week exercise will draw umpires, observers, and visitors from the Armed Forces of Nigeria , Paramilitary, and international military assistance partners, among others."
  },
  {
    "headline": "Appeal Court Grants PDP Right To Hold National Convention",
    "summarized_story": "The Appeal Court in Port Harcourt, Rivers State has granted the Peoples Democratic Party (PDP) the right to hold its national convention scheduled for October 30 and 31, 2021.\n“It is a sign that PDP is prepared for 2023.”The Governor said Mr Secondus had already handed over his chairmanship to PDP National Deputy Chairman (South), Yemi Akinwonmi, and had no right to seek the postponement of the convention.\nSecondus vows to appealMeanwhile, Mr Secondus has said he will challenge the ruling of the Appeal Court, according to a statement obtained by Channels Television.\n“I have just been briefed of the ruling of the Court of Appeal, Port Harcourt dismissing my motion to halt the National Convention of the party,” he said.\nAs a foundation member of this party who has served at various levels, State Chairman, Chairman of state Chairmen, National Organizing Secretary, Deputy National Chairman, Acting National Chairman and now National Chairman, am very much abreast with the workings of the party."
  },
  {
    "headline": "‘I Will Leave Office In 2023’: Buhari Warns Tenure Extension Campaigners",
    "summarized_story": "President Muhammadu Buhari has assured Nigerians that he has no intentions of running for President again once his tenure is over in 2023.\n“I swore by the Holy Qur’an that I will serve in accordance with the constitution and leave when my time is up.\nI don’t want anybody to start talking about and campaigning for an unconstitutional extension.\nPresident Buhari urged Nigerians living in the country to respect the laws, remain law-abiding and do nothing to derogate from the many years of friendly and mutually beneficial relationships between the two countries.\nAccording to them, “Nigerian professionals are doing well and projecting a good image of our country.”"
  },
  {
    "headline": "National Security: Service Chiefs, Defence Minister Visit Borno",
    "summarized_story": "The service chiefs on Friday visited the theatre command of operation in Hadin Kai, the Borno State capital.\nThe delegation was led by the Minister of Defence, Bashir Magashi.\nThe commander of the multinational joint task force and other service commanders were also on the ground to receive the delegation.\nThe minister of defence in his opening remarks said he was in Borno to get the operational brief from the headquarters of the theatre command.\n“I think the success is not far away and with your determination and commitment I’m sure we’ll get out of the woods very very soon.”"
  },
  {
    "headline": "APC Won’t Give Presidential Ticket To Candidates Of Same Religion – Omo-Agege",
    "summarized_story": "Deputy Senate President, Senator Ovie Omo-Agege has assured Nigerians that the ruling All Progressives Congress (APC) will respect religious diversity by not fielding a presidential ticket with two people of the same religion in the 2023 presidential election.\nSenator Omo-Agege charged all political parties to balance their presidential tickets among major faiths in Nigeria.\nHe buttressed his argument with the 2015 APC primaries where the party averted a Muslim/Muslim presidential ticket.\nThe cleric also kicked against the idea of Muslim-Muslim or Christian-Christian presidential candidates and running mates ahead of the 2023 presidential election.\nWe don’t want a Christian/Christian ticket nor a Muslim/Muslim ticket."
  },
  {
    "headline": "EFCC Denies Involvement In Raid On Justice Odili’s Home",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Friday denied it carried out an operation on the home of Justice Mary Odili.\nReports of a raid on her home were condemned by the Commission’s spokesperson, Wilson Uwujaren, who noted that none of its officers carried out any operation on the Justice’s home.\nThere had been reports earlier that the EFCC had gone to Justice Odili’s home to execute a search warrant, as part of investigations into her husband, former Governor of Rivers State, Peter Odili.\nAnd as you are aware, the work that we do, the judiciary is our biggest partner.\nThey are just trying to cause problem where there is no problem.”"
  },
  {
    "headline": "BREAKING: Secondus loses bid to stop PDP National Convention -",
    "summarized_story": "The Court of Appeal in Port Harcourt has refused the application for injunction filed by the former national chairman of the party, Uche Secondus.\nThe appellate thereafter cleared way for the conduct of PDP’s National Convention on 30th and 31st of October, 2021.\nThe former national chairman of the party had earlier approached the court, seeking injunction to stop the planned national convention.\nMr Secondus was suspended by his ward for anti-party activity and other gross misconduct."
  },
  {
    "headline": "Gombe bans migrating herders till January 2022, orders farmers to harvest before deadline",
    "summarized_story": "Gombe State Government has announced the ban on migrating herders from the State till January 2022.\nThe state government also ordered farmers to harvest before the deadline.\nThis was contained in a statement issued on Friday and obtained by TVC News in Gombe.\nThe statement added that the plan is to prevent frequent attacks between herders and farmers in the state."
  },
  {
    "headline": "Minister of Defence, Service Chiefs visit Operation Hadin Kai",
    "summarized_story": "The minister of Defence, Bashir Magashi alongside service chiefs have arrived Maiduguri the Borno state Capital on an operational visit to the Theatre command Operation Hadin Kai.\nThis is the third time the minister is visiting the Theatre of war to assess the level of achievement made so far and how best torestrategize in the onslaught against Insurgency.\nOn arrival, the minister alongside the service chiefs were received by the Theatre commander Operation Hadin Kai, Major General Christopher Musa and other top security officers.\nThis visit is coming few hours after Damboa Town which is about 88km away from the state capital was attacked by suspected members of ISWAP.\nThe visiting service chiefs are currently in a close door meeting."
  },
  {
    "headline": "Soldiers allegedly kill Biafran National Guard Gunman, recover vehicles, weapons -",
    "summarized_story": "Nigerian Army says it has successfully demobilized and killed one of the Biafran National Guard that attacked it’s troop at Amaekpu, Ohafia Local Government Area of Abia state.\nThis was contain in a statement signed by the Director Army Public Relations, Brigadier General Onyema Nwachukwu.\nThe Army said the assailants who were heavily Armed, opened fire on the troops “Exercise Golden Dawn’ location, but were met with stiff resistance by it’s personnel.\nIt said the troops neutralized one gunman, while others abandoned their vehicles and escape with bullet woundsAt another location, the Army said the gunmen were also intercepted at Eda by troop of Forward Operations Based Ohaozara in Ebonyi state.\nItems recovered from the assailants were One Pump action gun, three vehicles and apprehended one of the gunmen."
  },
  {
    "headline": "Standard Bank, Flutterwave Collaborate to Drive Digital Transformation Efforts Across Africa",
    "summarized_story": "Africa’s largest bank by assets, Standard Bank, has signed a partnership with Flutterwave, Africa’s leading payments technology company, to enhance digital payments experiences for its customers across Africa.\nThe bank’s customers in Nigeria, Zambia, Tanzania, Uganda, Ghana, Mauritius, Cote D’Ivoire and Malawi would enjoy enhanced digital payments experience in partnership with Flutterwave.\nA shift to digital payments accounted for 33% of all Covid-19 responses by governments and the private sector of Sub-Saharan African countries in 2020.\nWith this partnership, Standard Bank will provide agile tech solutions to its customers to help them grow their businesses online and offline.\nStandard Bank Group is the largest African bank by assets, operating in 20 African countries and 5 global financial centres."
  },
  {
    "headline": "Kwankwaso: Nigeria Needs a President That Can Unite Everyone",
    "summarized_story": "During the 2015 presidential election, Senator Rabiu Kwankwaso, in his capacity as governor of Kano State, delivered 1.9 million votes to the All Progressives Congress, APC, to seal the victory of Muhammadu Buhari over the incumbent Nigerian president, Dr Goodluck Jonathan.\nThe number of electoral votes declared by the Independent National Electoral Commission, INEC, raised eyebrows and got many wondering how Buhari amassed that number of votes from just one state in the north.\nHowever, supporters of Buhari argued at the time that this was made possible by Kwankwaso and his formidable Kwankwasiyya Movement in Kano, which had decamped from the ruling Peoples Democratic Party, PDP, to the APC a year earlier.\nA supplementary election conducted two weeks later enabled Ganduje to recoup and snatch victory from the jaws of defeat by a narrow margin of 8,982 votes.\nEver since, Kwankwaso has cooled his political heels and has been engaged in several philanthropic activities targeted at poverty alleviation and the education of indigent children in his home state."
  },
  {
    "headline": "There Is No Boko Haram Stronghold in Nigeria, Says Lai Mohammed – Trending With Ojy Okpe",
    "summarized_story": "The Minister of Information and Culture, Lai Mohammed, on Thursday slammed The Economist, over its controversial article titled ‘Insurgency, Secessionism and Banditry, Threaten Nigeria’, which accused the federal government of ineptitude, while lambasting the Nigerian military, alleging that it often sold weapons to insurgents…The minister at a press briefing in Abuja said the claim by the magazine that jihadists were carving out a caliphate in the North-East was inaccurate, especially at a time when terrorists were surrendering in droves.\nA video now making the rounds on social media captured some men wearing military camouflage claiming to be members of a security outfit known as the Biafra National Guard.\nThe men were seen filling up their tanks at a fuel station and stealing provisions from a grocery store in a quest for the liberation of Biafra.\nIt’s not often you come across a video showing a billionaire businessman dancing on Tik Tok.\nFemi Otedola shows off his dancing skills with his beautiful daughter, actress Temi Otedola."
  },
  {
    "headline": "Microsoft to Become World’s Most Valuable Stock As Apple Slides",
    "summarized_story": "The premarket trading Friday is putting Microsoft Corp. on pace to become the world’s largest listed company by market capitalisation, after a drop in Apple’s shares.\nApple fell 3.6% to $147.10 in premarket trading after reporting fourth-quarter revenue that came in below the average analyst estimate.\nThe iPhone maker’s market value would fall to $2.41 trillion should shares continue to trade at this level during regular hours.\nMicrosoft closed at a market value of $2.44 trillion on Thursday, blowing past Apple after reporting estimate-topping results for an 11th straight quarter earlier this week.\nMicrosoft was little changed in premarket trading as of 7:00 a.m. in New York."
  },
  {
    "headline": "Despite Being Banned in Nigeria, Twitter Records $1.28bn Revenue Increase In Q3 2021",
    "summarized_story": "Despite Twitter ban in Nigeria, the platform recorded $1.28 billion in revenue for the third quarter of 2021, representing a 37 percent increase over $936 million recorded in the corresponding period in 2020.\nBut 145 days after the ban, Twitter has seen an increase in monetisable users and revenue.\nAccording to Q3 2021 financial statement released, Twitter generated $742 million in the United States, an increase of 45 percent, while international revenue stood at $542 million, an increase of 28 percent.\nThe report also said the company’s total advertising revenue stood at $1.14 billion, an increase of 41 percent.\nBy region, US advertising revenue stood at $647 million, an increase of 51 percent compared to a year-over-year increase of 98 percent last quarter."
  }
]