[
  {
    "headline": "Avert airlines’ operations shutdown, Reps minority caucus tells Buhari",
    "summarized_story": "The Minority Caucus in the House of Representatives has called on the President, Major General Muhammadu Buhari (retd.\n), to take immediate steps to avert an imminent shutdown of flight operations in Nigeria, warning that it will have grave consequences on the country’s national life.\nThe caucus was reacting to the strike notice issued to the Minister of Aviation, Hadi Sirika; and the Director-General, Nigerian Civil Aviation Authority, Musa Nuhu, by the Airline Operators of Nigeria.\nMinority Leader of the House, Ndudi Elumelu, in a statement issued on Saturday and titled ‘Minority Reps Tasks President Buhari to Avert Shutdown of Airline Operations,’ blamed the crisis in the aviation sector on the government of the All Progressives Congress and the regime led by Buhari.\n“A shutdown of the aviation sector will therefore cripple millions of businesses as well as economic and commercial activities thereby increasing unemployment, worsen the economic hardship, put pressure on our already ailing roads and exacerbate insecurity in our country."
  },
  {
    "headline": "There’s hope for West Africa -Catholic bishops",
    "summarized_story": "Despite their challenges, the 16 West African countries would overcome their current travails, Catholic bishops from the sub-region said on Saturday.\nThey insisted that political leaders must stop draconian policies and practices which permit the exploitation of the masses.\nThe bishops under the auspices of the Reunion of the Episcopal Conferences of West Africa also resolved to work with critical stakeholders to remove all obstacles to peaceful coexistence, development and productivity in the West African region.\nWhile acknowledging that West African countries were battling the common challenges of insecurity, corruption, and sectional marginalisation among others, they said there was no need to despair because tough times do not last forever.\nThe Catholic bishops said, “We recognize the inherent dangers in our current society, but we remain optimistic that none of the problems bedevilling our sub-region is insurmountable."
  },
  {
    "headline": "Biafra: Asari Dokubo slams Ezeife for backing Nnamdi Kanu, IPOB",
    "summarized_story": "Former Niger Delta militant leader, Asari Dokubo, has lambasted erstwhile Governor of Anambra State, Chukwuemeka Ezeife, for backing Nnamdi Kanu and the Indigenous People of Biafra, IPOB.\nDokubo described Ezeife as a useless old man for supporting Kanu and IPOB.\nSpeaking on Facebook Live, the former militant leader accused Ezeife of “playing politics”.\nAccording to Dokubo: “Old useless men like Ezeife who are playing politics, at this old age, when they are at the train station to leave.\n‘Yes, Eastern Security Network (ESN) is the best internal security’, and you are clapping for him (Kanu).”"
  },
  {
    "headline": "Gov Buni begs ASUU to call off strike",
    "summarized_story": "Yobe State Governor, Mai Mala Buni, has begged the leadership of Academic Staff Union of Universities (ASUU), Yobe State University branch to call off its ongoing solidarity strike embarked by its national body.\nThe governor, represented by the Secretary to State Government, Baba Malam Wali, made the appeal when he hosted members of the union as well as management of the varsity in a meeting.\nHe told them that the meeting was convened to appeal to the union to review its earlier decision of joining the ongoing nationwide strike embarked upon by their national body as a mark of solidarity.\nThe governor further emphasized the numerous support and investments by the state government in the areas of capital projects and manpower development as well as prompt payment of salaries and other entitlements.\n“As the state is just recovering from the insurgency and with the declaration of emergency in education, the union should look into the peculiarity of the state and call off the strike,” he begged."
  },
  {
    "headline": "Unity Schools: Lagos tops enrolment as 69,828 candidates sit for NECO nationwide",
    "summarized_story": "The National Examinations Council (NECO) has placed the number of candidates who enrolled in the National Common Entrance Examination (NECO) for this year at 69,828.\nLagos State, however, registered the highest number of candidates with 19,516 while the least registered state was Kebbi State with 74 candidates; 37 males and 37 females, respectively.\nAccording to him, out of the 69,828 candidates, 36,855 were female applicants while the balance of 32,000 plus were male.\nOn his part, Prof. Ibrahim Wushishi, the Registrar and Chief Executive Officer, NECO, confirmed that Lagos State recorded the highest number of registered candidates for this year’s examination.\nWushishi said, “Lagos state registered the highest number of candidates with 19,516 candidates, while the least registered state is Kebbi with 74 candidates; they had 37 males and 37 females.”"
  },
  {
    "headline": "ASUU strike: Buhari govt has failed us – TUC",
    "summarized_story": "The Trade Union Congress (TUC) in Kogi State has lambasted President Muhammadu Buhari-led Federal Government over the lingering strike embarked upon by the Academic Staff Union of University (ASUU).\nHe maintained that the present administration led by President Buhari has failed Nigerians, adding that things have fallen apart and the government is no longer in control of the country.\n“The Political class has failed us because their children are not in the country as they are all abroad.\nFor me, the political class has failed us, not only in the educational sector, but in all ramifications,” he lamented.\nHe, however, called on the Federal Government to implement the 2009 agreement with ASUU, saying, “the strike is one too many.”"
  },
  {
    "headline": "Banditry: Matawalle commiserates with victims in Zamfara",
    "summarized_story": "Governor Bello Mohammed Matawalle of Zamfara State has called for special prayers that would restore peace in the state.\nMatawalle said his administration was doing all it could to end the banditry activities in the state.\nThe governor said this when he visited victims of banditry attacks in Mada and Magazu communities of the state.\nHe assured the communities and the entire state that his administration will continue to fight these criminals until the required peace and tranquility is achieved in every part of Zamfara State.\nWith the help of security operatives, we shall get the desired target of eliminating these miscreants in our midst”, Governor Matawalle advised."
  },
  {
    "headline": "2023: Familiar faces square off in contest for Abia Senate seats",
    "summarized_story": "The race for the Abia North senate seat got more interesting recently when Senate Chief Whip, Senator Orji Uzor Kalu, announced his withdrawal from the presidential race.\nSenator Orji Uzor Kalu (APC, Abia North) is the Chief Whip of the Senate and a former governor of the state.\nNkole joined the Abia North Senatorial race after serving out his term in the House of Representatives.\nOkezie Ikpeazu (PDP, Abia South)Dr. Okezie Ikpeazu is the incumbent governor of Abia State who will be serving out his 8 year tenure by 2023.\nBut many are eagerly waiting to see if Ikpeazu will gun for the senate seat."
  },
  {
    "headline": "2023: Newcomers battle old hands for senate seats in Cross River",
    "summarized_story": "Last December, Senator Onor declared his interest in contesting for governor of Cross River State, 2023.\nAlthough there are a couple of contenders, they all understand the fact that Governor Ayade is favoured to take the seat if he decides to run.\nSince his emergence, he has displayed total loyalty to the governor, Senator Ayade.\nBassey Ewa, who was former Speaker of the state assembly, before serving in the House of Representatives for two terms.\nAnother contender for the APC southern senatorial district ticket is the current Commissioner for Agriculture, Ntufam Okon Owuna, from Akamkpa local government area."
  },
  {
    "headline": "See Warri and cry: Tale of Oil City’s fall from grace to grass",
    "summarized_story": "Dubbed the Oil City, it is the economic hub of the state, and a once flourishing nexus of oil and gas commerce in Nigeria.\nIn the Oil City, businesses are oiled by activities of ‘Yahoo boys’.\nHe is a Warri boy, whose emergence raised hope that the Oil City would finally be developed.\nThere were others like the Warri-Trans-Ode-Itsekiri (Big Warri) road project, Omadin, Okerenkoko – Oporoza and others to link the mainland (Warri metropolis) to the other Warri LGA’s of the state.\nDelta state needs a leader that carries the whole people because Delta is a multilingual, multiethnic state."
  },
  {
    "headline": "Cross-border movements within the global village",
    "summarized_story": "The Americans were at that point beginning to build the railways which stitched their large country together.\nA new kind of migration took place in the period immediately following the end of the Second World War.\nGermany and Turkey, at that time the leading part of the now defunct Ottoman Empire were allies in the First World War.\nIn other words, they are a form of development aid from the underdeveloped to vastly more developed countries.\nThe situation is made worse when the would-be migrants profess a religion which is different from the prevailing Christianity of the Western countries."
  },
  {
    "headline": "Reactions over UK’s new visa policy ‘excluding’ Nigerian varsity graduates",
    "summarized_story": "Mixed reactions have trailed the exclusion of Nigerian graduates from a new United Kingdom visa – high potential individual visa.\nBut some of the requirements excluded those who graduated from Nigerian universities.\nThe university has to be one of the top global universities as published in the global universities list by the Home Office.\nBut checks by The Nation show Nigerian universities do not appear in any of these global rankings.\nlf Nigeria had a system that works and piloted by responsible leaders, Nigeria universities as at today will be highly."
  },
  {
    "headline": "Sun awards is the award -Sanwo-Olu",
    "summarized_story": "The Governor of Lagos State, Babajide Sanwo-Olu has commended the management of The Sun Publishing Limited for finding him worthy to win the Governor of Year award of the publishing house.\nGovernor Sanwo-Olu spoke at Eko Hotels in Lagos saying that the award has elevated him greatly, noting that he had been receiving so many awards, “but the Sun award is the award.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nDetails soon…Are you a Man 40 yrs and above?\nDo not miss the Vital Information, it goes off in 2 days!"
  },
  {
    "headline": "Anambra PDP: Appeal panel disqualifies Ozigbo, Nwoye, others from running in 2023 NASS election",
    "summarized_story": "The panel also disqualified Obinna Uzor, Tony Nwoye, Dr. Chira Obiora and Johnmary Akachukwu.\nThe three-man panel made up of Dr. Alfred Isename, Chairman, Okpara Ahamefula, Member and Barr.\nOn Dr. Uzor, the panel said he deliberately misinformed the party in his nomination form.\n“The above shows that the aspirant deliberately failed to disclose the facts of this charge, his arraignment and trial,” the panel stated.\nOn Nwoye, the panel alleged that he was disqualified because he was one of those that destroyed Anambra State in 2004 and had a documented history of tax related infractions."
  },
  {
    "headline": "We never added IPOB to list of terrorist groups – UK",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom (UK), has said it never added the Indigenous People of Biafra (IPOB) to its list of terrorist groups.\nThe British High Commission, Abuja, in a statement made available to Saturday Sun, said it was aware of inaccurate reporting circulating in the media and online that the UK Government has added IPOB to the UK’s list of terrorist groups or organisations banned under UK law.\nThe “Indigenous People of Biafra” (IPOB) is not a proscribed organisation in the UK,” the British High Commission said.\n“CPINs provide country of origin information (COI) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "The Sun Awards: Umahi, Rabiu, Lawan, Uzodimma, Bala",
    "summarized_story": "Ebonyi State Governor, Dave Umahi; Alhaji Abdulsamad Rabiu, Chairman, BUA Group; Senate President, Ahmad Lawan; Governor Babajide Sanwo-Olu of Lagos State; Governor Bala Mohammed of Bauchi State and Governor Hope Uzodimma of Imo State will today be honoured at The Sun Awards.\nGov Umahi and Rabiu will be honoured as Man of the Year 2021, while Lawan is Political Icon of the Year 2021.\nGovernors Mohammed, Uzodimma and Sanwo-Olu will receive awards as Governor of the Year, with Gov Babagana Zulum of Borno State being honoured with the Courage in Leadership award.\nMethodist Bishop and co-chair of Inter-faith Dialogue Forum for Peace, Bishop Sunday Onuoha, will chair The Sun Awards 2021.\nBishop Sunday has received the Global Peace Interfaith Leadership Award from the Global Peace Foundation for his efforts in advancing interfaith medical collaboration, humanitarian service and peace through Vision Africa and NIFAA."
  },
  {
    "headline": "Fuel cost: Nigerian airlines to shut down operations Monday",
    "summarized_story": "By Chinelo ObogoAirline Operators of Nigeria (AON) have said that due to the high cost of aviation fuel, member airlines will from Monday, May 9, discontinue operations nationwide until further notice.\nMusa Nuhu, the body said aviation fuel price (JetA1) has risen from N190 per litre to N700 currently and that no airline in the world can absorb the shock from such an astronomical rise over a short period.\n“Overtime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\n“While AON appreciates the efforts of the current government under the leadership of President Muhammadu Buhari to ensure air transport in Nigeria grows, unfortunately, the cost of aviation fuel has continued to rise unabated thereby creating huge pressure on the sustainability of operations and financial viability of the airlines.\n“To this end therefore, the AON wishes to regrettably inform the general public that member airlines will discontinue operations nationwide with effect from Monday May 9, 2022 until further notice."
  },
  {
    "headline": "Game on as Rice Farmers Buy APC Presidential Forms for Emefiele, Unsettle Other Aspirants",
    "summarized_story": "On the same day, South-west APC presidential aspirants and leaders met in Lagos and reached an agreement to ensure that the next presidential candidate of the party is produced by the region.\n22 APC Presidential Aspirants Pick FormsAs at last night, no fewer than 22 presidential aspirants had purchased the Expression of Interest and Nomination forms of the APC ahead of Tuesday’s deadline.\nOthers are Jigawa State Governor, Abubakar Badaru; the former Governor of Zamfara State, Sani Yerima and the former speaker, House of Representatives, Dimeji Bankole.\nSouth-west presidential aspirants meet in LagosSouth-west APC presidential aspirants and leaders met in Lagos yesterday and reached an agreement to ensure that the region produces the next APC presidential candidate.\nHe said the South-west APC presidential aspirants, governors and other leaders are united ahead of the 2023 general elections."
  },
  {
    "headline": "Imo Loses, S’Court Cedes 17 Oil Wells to Rivers State",
    "summarized_story": "*Declares only Rivers entitled to 13% derivation from the wellsAlex Enumah in AbujaThe Supreme Court yesterday resolved the issue of the state entitled to the revenues from 17 oil wells in Akri and Mbede communities in favour of Rivers State.\nBoth Rivers and Imo states have been engaged in legal battles over the ownership of the 17 oil wells located in boundary communities between the two states.\nThe National Boundary Commission had in the Nigeria Administrative Map, 10th, 11th, 12th, and other maps delineated the two communities in which the 17 oil wells are located in Imo State.\nBut, Rivers State, citing decree No.\nThe apex Court also declared that based on the correct instruments, maps and documents for determining the boundary between Rivers and Imo states, the following Rivers State communities wrongly attributed to Imo State, among other communities, are communities within the territorial boundaries of Rivers State and therefore communities in respect of which Rivers State was entitled to exercise governmental and administrative powers, including entitlement to benefits derivable from mineral or other resources within the communities."
  },
  {
    "headline": "News in Photographs: S’West APC Leaders Meet Osinbajo, Tinubu, Other Presidential Aspirants",
    "summarized_story": "News in Photographs: S’West APC Leaders Meet Osinbajo, Tinubu, Other Presidential AspirantsA meeting of South West leaders of the All Progressives Congress with presidential aspirants from the zone is under way in Lagos.\nThe meeting convened by former Governors Bisi Akande and Segun Osoba is holding at the State House, Marina.\nIn attendance are APC presidential aspirants from the zone, including Vice President Yemi Osinbajo, Asiwaju Bola Ahmed Tinubu, Governor Kayode Fayemi and former Governor Ibikunle Amosun.\nAlso attending the meeting are Speaker Femi Gbajabiamila, Works Minister Babatunde Fashola, Interior Minister Rauf Aregbesola, Governor Gboyega Oyetola, Governor Babajide Sanwo-Olu, Governor Rotimi Akeredolu, Governor Dapo Abiodun, APC National Secretary Iyiola Omisore, former Governor Gbenga Daniel and Trade Minister Niyi Adebayo, among others.\nThough the agenda of the meeting was not announced, it was gathered that the meeting was aimed at addressing rhe rising number of presidential aspirants from.the zone on the platform of APC."
  },
  {
    "headline": "Amosun, Onu Pick N100m APC Presidential Nomination Forms",
    "summarized_story": "Adedayo Akinwale in AbujaFormer Governor of Ogun State, Senator Ibikunle Amosun; Senator representing Ondo-North senatorial district, Prof. Ajayi Boroffice; and Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, have obtained N100 million Expression of Interest and Nomination forms of the All Progressives Congress (APC) to run for president.\nIt was also gathered that former Governor of Zamfara state, Sani Yerima, will obtain his form today.\nThe forms were collected for the aspirants by proxy.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ACF to Southern Leaders: Enough of Blackmail, North Not Afraid of Break-up",
    "summarized_story": "*Says threat over zoning unacceptable“These Southerners contest the facts that the North has 78% of the landmass of Nigeria.\nThey refuse to accept that the North has over 55% of the population of Nigeria.\nThey refuse to accept that the North has over 55% of the population of Nigeria.\nBut in-spite of this, some southern politicians are furious, issuing dare warnings against the election of any Northerner as president.\nGone are the days when Northerners felt blackmailed and intimidated by threats of re-structuring, secession, break up or break down of Nigeria."
  },
  {
    "headline": "BREAKING: IPOB Not On Our List Of Terrorist Groups Nor Proscribed In Britain – UK Makes Clarifications On Contentious Document",
    "summarized_story": "The United Kingdom government has stated that the Indigenous People of Biafra is neither a terrorist group nor proscribed in the European country.\nThe UK in a release on Friday obtained by SaharaReporters said reports claiming it designated the group as terrorists were false.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "BREAKING: IPOB Not On Our List Of Terrorist Groups Nor Proscribed In Britain – UK Makes Clarifications On Contentious Document",
    "summarized_story": "The United Kingdom government has stated that the Indigenous People of Biafra is neither a terrorist group nor proscribed in the European country.\nThe UK in a release on Friday obtained by SaharaReporters said reports claiming it designated the group as terrorists were false.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "BREAKING: IPOB Not On Our List Of Terrorist Groups Nor Proscribed In Britain – UK Makes Clarifications On Contentious Document",
    "summarized_story": "The United Kingdom government has stated that the Indigenous People of Biafra is neither a terrorist group nor proscribed in the European country.\nThe UK in a release on Friday obtained by SaharaReporters said reports claiming it designated the group as terrorists were false.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“The CPIN on separatist groups in the South East, including the Indigenous People of Biafra (IPOB), provides a general assessment of risks faced by individuals belonging to those groups."
  },
  {
    "headline": "Plot Thickens As Impostors Backed By Buhari Regime Connive With Electoral Body, INEC To Stop Sowore’s Presidential Bid",
    "summarized_story": "A group of impostors supported by the Muhammadu Buhari regime are presently plotting to use the Independent National Electoral Commission (INEC) and other available means to stop the presidential bid of human rights activist, Omoyele Sowore.\nOmoyele Sowore“Ezenwa and his group were recently mobilised by the Muhammadu Buhari regime to do everything possible to stop Sowore from contesting in the 2023 elections.\nMr. Ezenwa is also a stooge used by INEC chairman Mahmood Yakubu to boost the image of INEC and bribe political parties to look away from INEC infractions,” a top source revealed.\nSaharaReporters learnt that Ezenwa had again been freshly mobilised to launch attacks against Sowore’s presidential bid through his cronies in the AAC and elsewhere.\n\"INEC had no option but was forced to withdraw their objection, asking that Sowore’s appeal be struck out."
  },
  {
    "headline": "Plot Thickens As Impostors Backed By Buhari Regime Connive With Electoral Body, INEC To Stop Sowore’s Presidential Bid",
    "summarized_story": "A group of impostors supported by the Muhammadu Buhari regime are presently plotting to use the Independent National Electoral Commission (INEC) and other available means to stop the presidential bid of human rights activist, Omoyele Sowore.\nOmoyele Sowore“Ezenwa and his group were recently mobilised by the Muhammadu Buhari regime to do everything possible to stop Sowore from contesting in the 2023 elections.\nMr. Ezenwa is also a stooge used by INEC chairman Mahmood Yakubu to boost the image of INEC and bribe political parties to look away from INEC infractions,” a top source revealed.\nSaharaReporters learnt that Ezenwa had again been freshly mobilised to launch attacks against Sowore’s presidential bid through his cronies in the AAC and elsewhere.\n\"INEC had no option but was forced to withdraw their objection, asking that Sowore’s appeal be struck out."
  },
  {
    "headline": "The cat-and-mouse game over zoning",
    "summarized_story": "But there is a game within the game and, to use a tired cliché, this is heating up the polity.\nHis rhetoric, I believe, is influenced by the game going on in the Peoples Democratic Party (PDP).\nI support zoning but I also know that even without zoning, power can still shift to the south.\nMeanwhile, APC presidential hopefuls from the south-west are not showing any signs of considering conceding to the south-south or south-east.\nThe underlying factor behind the cat-and-mouse game between APC and PDP over zoning is cold political calculation."
  },
  {
    "headline": "The cat-and-mouse game over zoning",
    "summarized_story": "But there is a game within the game and, to use a tired cliché, this is heating up the polity.\nHis rhetoric, I believe, is influenced by the game going on in the Peoples Democratic Party (PDP).\nI support zoning but I also know that even without zoning, power can still shift to the south.\nMeanwhile, APC presidential hopefuls from the south-west are not showing any signs of considering conceding to the south-south or south-east.\nThe underlying factor behind the cat-and-mouse game between APC and PDP over zoning is cold political calculation."
  },
  {
    "headline": "Our region has potential votes to determine next president, say north-west APC leaders",
    "summarized_story": "Leaders of the All Progressives Congress (APC) in the north-west say the history of voting during general election shows that the region has what it takes to determine the next president.\nMusa Mailafiya, APC north-west publicity secretary, said this in a statement issued on Saturday.\nAccording to Mailafiya, the north-west APC leaders also asked the party’s zonal officials to remain united ahead of the 2023 elections.\nAdvertisementThe meeting, which held in Lagos on Friday, involved presidential hopefuls and south-west APC leaders.\nThe APC leaders were said to have cautioned the presidential hopefuls from the region against name-calling, saying all aspirants have a right to contest."
  },
  {
    "headline": "Our region has potential votes to determine next president, say north-west APC leaders",
    "summarized_story": "Leaders of the All Progressives Congress (APC) in the north-west say the history of voting during general election shows that the region has what it takes to determine the next president.\nMusa Mailafiya, APC north-west publicity secretary, said this in a statement issued on Saturday.\nAccording to Mailafiya, the north-west APC leaders also asked the party’s zonal officials to remain united ahead of the 2023 elections.\nAdvertisementThe meeting, which held in Lagos on Friday, involved presidential hopefuls and south-west APC leaders.\nThe APC leaders were said to have cautioned the presidential hopefuls from the region against name-calling, saying all aspirants have a right to contest."
  },
  {
    "headline": "Pro-Akinwumi Adesina support groups buy APC presidential nomination form",
    "summarized_story": "A coalition of 28 support groups has procured the presidential nomination and expression of interest forms of the All Progressives Congress (APC) for Akinwumi Adesina, president of the African Development Bank (AfDB).\nAdesina is, however, yet to declare his interest in contesting the presidency in the 2023 general election.\nHe listed some members of the coalition to include the One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, and persons with disabilities.\nAdvertisementBabatunde, a former presidential candidate of the defunct Nigeria Community Movement Party (NCMP) in the 2019 presidential election, said the groups believe in Adesina’s capacity to fix the country’s challenges.\n“This is one of the supports we are fundamentally and passionately determined to render for ourselves by putting Adesina forward to Nigerians.”"
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?",
    "summarized_story": "Share this article:The Anambra State Governor, Charles Chukwuma Soludo, has announced the appointment of Chukwuemeka Fred Agbata as the MD/CEO of the Anambra State ICT Agency for a four-year tenure.\nMuch of the growth in Nigeria’s tech sector has been seen in Lagos State.\nThe hub provides a place for state residents to convene and potentially build technological products.\nAccording to data from the National Bureau of Statistics, the South Eastern region of Nigeria, where Anambra State is, has the lowest Internet penetration rates, with 13.7 million users.\nIn Agbata’s experience and Soludo’s previous experience as a Governor of the Central Bank of Nigeria (CBN), the state could become a digital powerhouse."
  },
  {
    "headline": "TikTok will start rewarding creators",
    "summarized_story": "AdvertisementToday, I’ll be discussing:Problems YC-backed startups are solvingTikTok’s PulseTigerrise’s plan to improve mental healthWhat problems are YC-backed startups solving?\nIsn’t this fantastic news for TikTok Pulse creators?\nTigerrise to improve mental health accessPhoto by Emily Underworld on UnsplashIn Africa, mental health care is scarce.\nTo back up this claim, Kenya’s health ministry reports that 75% of people in need of mental health services cannot obtain them.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with ADHD."
  },
  {
    "headline": "What problems are Y Combinator-backed startups solving in Africa?",
    "summarized_story": "This has significantly changed how African startups operate and, per some founders, helped refine their business processes.\nLittle wonder that 53% (51) of YC-backed African startups (95) are from Nigeria.\nBut the big question remains: What problems are Y Combinator-backed startups solving?\nWhat problems are Africa’s YC-backed startups solving?\nSo far, YC has invested in a whopping 47 Financial Services startups in Africa, almost half of its Africa alumni."
  },
  {
    "headline": "Aladdin Digital Bank, Closes a Debt-Financing Deal Up to $3.5 Million",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Aladdin Scheme Ltd, the leading Ecosystem Digital bank in Nigeria has announced its successful closing of a debt-financing deal up to $3.5 million.\nIn the last couple of months, Aladdin Digital bank has transformed from a digital bank app to a full scale financial powerhouse for individuals, freelancers and SMEs consistently delivering state of the art digital products on its banking platforms to support their hustle.\nIG: @aladdinbankngFacebook:@aladdinbankngLinkedIn:@aladdindigitalbankBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Microsoft Africa Development Center (ADC) West Africa inspires schoolgirls on the International Girls in ICT Day 2022",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:The International Girls in ICT Day was celebrated globally on April 28th, 2022, and the team at the Microsoft Africa Development Center (ADC), West Africa, celebrated the day at an intimate event with schoolgirls and female tech enthusiasts.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Ibom Air pulls out of planned airlines shutdown",
    "summarized_story": "Ibom Air, one of Nigeria’s carriers has pulled out of plans by most airlines in Nigeria to shut down flight operations from Monday.\nThis decision is coming barely 24 hours after the Airline operators of Nigeria, (AON) disclosed plans to shut down operations following the continuous increase in Aviation fuel.\nIn a statement by the airline, Ibom Air stated that it acknowledges the existential threat that these runaway fuel price increases pose for the air transport industry in Nigeria and agree that this out-of-control situation is simply unsustainable.\nRead also: Ibom Air to spend N138bn on 10 new A220 planes“Ibom Air has financial obligations to suppliers, financiers and staff, which depend on uninterrupted flow of revenue to service.\n“Apart from the above factors, Ibom Air is currently the only airline serving Akwa Ibom State directly and as such, any voluntary stoppage of operations would completely cut off access by air into and out of the State."
  },
  {
    "headline": "Okomu Did Not Block Community Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOkomu oil Palm Company Did Not Block the Road leading to the Community but dug a trench round its plantation to forestall theft of over ten tons of Banga daily.\nAccording to him, it was a peaceful protest to alert the management of the company that the trench blocked their road to the primary and secondary school, Catholic Church and other villages.\n“We have made several appeals to the government to assist us with electricity, roads, health centers and a secondary school” he added.\nThe DPO advised the protesting community to remain calm and go about their duties as law abiding citizens until the issues are resolved.\nThe Nigerian Observer gathered that the Enogie of Udo has also setup machineries in motion to resolve the issues at stake which he described as a breakdown in communication between the community and Okomu Oil Palm Company."
  },
  {
    "headline": "Edo NEWMAP urges media support in campaign to curb flooding, other environmental hazards – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Coordinator of Nigeria Erosion and Watershed Management Project (NEWMAP), Dr. Tom Obaseki, has canvassed for media collaboration in driving the conversation on flood control as the rains intensify.\nObaseki made the submission at a flood engagement workshop organised by the agency in Benin City, the Edo State capital.\nAccording to him, “The media has a crucial role in spreading information in bridging the knowledge gap and enhancing public awareness.\nThe media chooses which issues to highlight to its viewers and how to frame them, influencing what people perceive to be a priority.\n“We have built a total length of over 40kms of secondary drains."
  },
  {
    "headline": "Master Plan: Obaseki kicks off ‘Operation Plan Edo’ …exercise kicks off in Ugbor area – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced ‘Operation Plan Edo,’ an exercise aimed at recertifying building plans and collecting data on socio-economic needs of communities within the Benin metropolis.\nAccording to her, “The programme enables the government to know what services and infrastructure the people need.\nThe ‘Operation Plan Edo’ will involve various ministries, such as Education, Roads and Bridges, Health, Power, among others”.\nShe called on citizens to cooperate with officials of the ministries and provide necessary information to help plan the city and State in line with the 30-year master plan.\nCondemning attacks on its staff by residents, she warned: “Edo State Government frowns at the attack on Staff of Ministry of Planning, Urban and Regional Planning on duty."
  },
  {
    "headline": "2023: Edo PDP’ll obey party decisions, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state’s chapter of the Peoples Democratic Party (PDP) will obey any decision reached by the party at the national level ahead of the presidential primary election as long as the decision is fair and just.\nHe said, “I believe that you know what the issues are in Nigeria today and have practically touched all of them.\nThere is nothing wrong when you throw your hat in the ring, and you’ve been quite clear and not ambiguous.\nThey also have the privilege to hear from you and know the decision to take when the time comes,” Obaseki noted.\nI know the country very well and the people of the country know me."
  },
  {
    "headline": "AfDB president, Akinwunmi Adesina joins presidential race, buys N100m APC forms",
    "summarized_story": "Dr Akinwumi Adesina, president of the African Development Bank (AfDB) has joined the 2023 presidential race under the platform of All Progressives Congress (APC).\nThe former minister of Agriculture under the Goodluck Jonathan administration on Saturday obtained the presidential nomination and expression of interest forms of the APC for N100 million, Leadership reported.\nA coalition of 28 groups comprising Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, Youth Arise Movement, women groups, farmers, people with disabilities and other civil society organizations, were said to have contributed the N100m fee to buy the forms for the AfDB president.\nLed by the head of One Nigeria Group, Mohammed Saleh, the groups made the payment and collected the acknowledgement slip for Adesina at the International Conference Center where the APC is currently selling the forms."
  },
  {
    "headline": "2023: I’ve not decided to run for president – Emefiele",
    "summarized_story": "Mr. Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), says he has not made up his mind about running for president of the country in 2023.\nHowever, reacting to the development in a statement on Saturday, Emefiele thanked the farmers and those asking him to run for the country’s highest office, but noted that he has not decided to run for the office.\nThe governor said should he decide to contest for president, he would purchase his own nomination forms and do so in accordance with the laws of the land.\n“I am humbled by the growing interest of those asking that I run for the Office of President in the 2023 general elections: I have not come to that decision,” Emefiele said.\n“I note and salute the sacrifices of those farmers and patriots going as far as raising personal funds and offering me Presidential Nomination Forms: I thank them most profusely."
  },
  {
    "headline": "CSCS grows revenue by 39.2%, pays N3.7bn dividends",
    "summarized_story": "The N3.7Billion dividend, which translates to 83.7% payout ratio, reflects the resilient profitability of the Company, notwithstanding the impact of lower trading activity on most Exchanges in the Nigerian capital market and inflationary pressures.\n“This fact is evident in the impressive revenue growth of 39.2%, driven by stellar growth in ancillary income.\nAlbeit income from ancillary services recorded a significant boost, contributing N2.2billion or 21.5% of total income in 2021FY, from N526million or 11.3% of total income in 2020FY.\n“It has been twenty-five years of meritorious service, as the infrastructure for the Nigerian capital market.\nWhilst we relish our progress working with other stakeholders in transforming the Nigerian capital market, we reckon there is a long way to go in bridging the gap towards our aspiration of positioning the Nigerian capital market as the hub of securities services in Africa and one of the leading capital markets, globally."
  },
  {
    "headline": "UK govt denies declaring IPOB as a terrorist organisation",
    "summarized_story": "The United Kingdom has denied reports that it added separatist group, the Indigenous People of Biafra (IPOB) to a list of terrorist groups banned from the country.\n“We are aware of inaccurate reporting circulating in the media and online that the UK Government has added the Indigenous People of Biafra (IPOB) to the UK’s list of terrorist groups or organisations banned under UK law.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK,” a statement from the UK high commission in Nigeria said on Friday.\npic.twitter.com/pPou7SxQ9S — UK in Nigeria🇬🇧🇳🇬 (@UKinNigeria) May 6, 2022Meanwhile, the Nigerian governor, relying on the apparently inaccurate report of the UK prescribing IPOB as a terrorist group, on Friday evening, released a statement welcoming the decision.\n“Nigeria welcomes the decision by the United Kingdom to proscribe the Indigenous People of Biafra (IPOB) as a terrorist group,” a tweet from the official Nigerian government twitter handle read."
  },
  {
    "headline": "Kaduna Guber Aspirant, Abbas, Appoints Campaign Team Chair, Others",
    "summarized_story": "A statement by the director, Public Affairs and Corporate Communications of the campaign team, Hon.\nHe also approved the appointment of Alhaji Bala Alwa’u as deputy chairman of the Barrister Mohammed Sani Abbas campaign council.\nOthers were the director, contact and mobilisation, Adamu Abdullahi a.k.a Charles Taylor; director media,Ishak Alhassan Kaura-Mata, and deputy director, media, Mr Amos Tauna.\nAlso, Mr. Victor Mathew Bobai is appointed as director, public affairs and corporate communications while Abubakar Yusuf Jamwala is appointed the deputy director, public affairs and corporate communications.\nYusuf Sambo; director, research and strategy, Dr. Umar Tabari and deputy director, research and strategy, Wali Mukhtar."
  },
  {
    "headline": "EXCLUSIVE: AfDB President, Adesina, Is Running For Presidency – Aide",
    "summarized_story": "The President of the African Development Bank (AfDB), Dr Akinwumi Adesina, will contest Nigeria’s presidential poll in 2023, LEADERSHIP can authoritatively report.\n“They have been pushing for him at the highest levels.\nYes, he is ready to make the sacrifice for the sake of our country,” Oyeyinka said.\nA coalition of 28 groups comprising Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, Youth Arise Movement, women groups, farmers, people with disabilities and other civil society organizations, were said to have contributed the N100m fee to buy the forms for the AfDB president.\nLed by the head of One Nigeria Group, Mohammed Saleh, the groups made the payment and collected the acknowledgement slip for Adesina at the International Conference Center where the APC is currently selling the forms."
  },
  {
    "headline": "Aregbesola, Malami, Others To Discuss Issues In Immigration At Lawyers’ Conference",
    "summarized_story": "The Nigerian Immigration Lawyers Association has concluded arrangements to host its 2022 Annual Immigration Law and Policy Conference in Abuja.\nTopics that would be discussed at the conference are: key Implications of the Immigration Regulation 2017; Overview of the Nigerian Visa Policy 2020; The Ease of Doing Business: Navigating the Immigration Requirements in Nigeria; What Consular Officers are really looking for?\n; Nigerian Local Content & Managing Expatriate Employment in the Oil & Gas Industry and Exploring Legal migration Pathways from Nigeria to Canada.\n“Participants at the event will be welcomed by Prof. Epiphany Azinge, SAN, President and Chairman BOT of NILA, while the Hon.\nMinister of Interior, Ogbeni Rauf Aregbesola (as Chief Guest of Honour) and other special guests including Abubakar Malami, (HAGF & Minister of Justice), Hon."
  },
  {
    "headline": "Aregbesola, Malami, Others To Discuss Issues In Immigration At Lawyers’ Conference",
    "summarized_story": "The Nigerian Immigration Lawyers Association has concluded arrangements to host its 2022 Annual Immigration Law and Policy Conference in Abuja.\nTopics that would be discussed at the conference are: key Implications of the Immigration Regulation 2017; Overview of the Nigerian Visa Policy 2020; The Ease of Doing Business: Navigating the Immigration Requirements in Nigeria; What Consular Officers are really looking for?\n; Nigerian Local Content & Managing Expatriate Employment in the Oil & Gas Industry and Exploring Legal migration Pathways from Nigeria to Canada.\n“Participants at the event will be welcomed by Prof. Epiphany Azinge, SAN, President and Chairman BOT of NILA, while the Hon.\nMinister of Interior, Ogbeni Rauf Aregbesola (as Chief Guest of Honour) and other special guests including Abubakar Malami, (HAGF & Minister of Justice), Hon."
  },
  {
    "headline": "JUST-IN: Tinubu’s Campaign Manager, Abdulmumin Jibrin, Quits APC",
    "summarized_story": "A former member of House of Representatives and Director-General of the Bola Tinubu Support Group Council, Hon.\nAbdulmumin Jibrin, has announced plan to quit the ruling All Progressives Congress (APC).\nJibrin, who represented Kiru/Bebeji federal constituency of Kano State, was lately an ardent supporter of Asiwaju Bola Ahmed Tinubu’s presidential aspiration.\nJibrin wrote: “I have done my best for APC.\nI will announce my new political party within the next 24 hours insha Allah."
  },
  {
    "headline": "28 groups drag AfDB's Adesina into APC presidential race",
    "summarized_story": "By Emmanuel Oloniruha/AbujaA Coalition of 28 groups has paid N100 million into the coffers of the All Progressives Congress to pick the presidential forms for Dr. Akinwumi Adesina.\nIt said the challenging situation of the country informed their call for Adesina to join the race.\nBabatunde told NAN that the coalition was set to obtain the APC Presidential Nomination and Expression of Interest forms for Adesina on Sunday.\nHe listed some of the groups obtaining the nomination form as One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities and other civil society groups.\n“We are very much aware of the critical time that Nigerians and our country, Nigeria, are going through."
  },
  {
    "headline": "Britain doubles aid to Ukraine",
    "summarized_story": "Britain said it will provide a further £1.3 billion ($1.60 billion) in military support and aid to Ukraine.\nPrime Minister Johnson has been one of the strongest supporters of Ukraine’s efforts to resist Russian forces since Russian President Vladimir Putin launched the invasion on Feb. 24.\nBritain said the extra spending on Ukraine will come from a reserve used by the government for emergencies.\nWhile Britain has provided significant military aid, it has so far accepted relatively few of the more than 5 million Ukrainians who have fled their country.\nThe British government said on Saturday that so far it had issued more than 86,000 visas to Ukrainians, of whom about 27,000 had reached Britain."
  },
  {
    "headline": "BREAKING: Coalition Picks N100m APC Nomination Forms For AfDB President, Adesina",
    "summarized_story": "This is as a coalition of 28 groups consisting of Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities, and other civil society groups, raised the N100 million fee to purchase the forms for the former minister.\nThe coalition is led by the Head, of One Nigeria Group, Mohammed Saleh.\nThe payment acknowledgment slips exclusively seen by our correspondent on Saturday carried Adesina’s name as the recipient of the forms.\nMore to come…"
  },
  {
    "headline": "President Buhari’s Aide Reacts As Abdulmumin Jibrin Dumps APC",
    "summarized_story": "The personal assistant to President Muhammadu Buhari on new media, Bashir Ahmad has reacted after former lawmaker Abdulmumin Jibrin announced his decision to dump the All Progressives Congress (APC).\nThe reaction comes after Jibrin on Saturday announced that he has done his best for the APC and it’s time for him to move on.\nJibrin wrote on Twitter: “I have done my best for APC.\nI will announce my new political party within the next 24 hours insha Allah.\nI will make a formal statement in due course.”Reacting to the tweet, Ahmad wrote: “This is serious!”"
  },
  {
    "headline": "2023 Presidency: Taraba PDP Delegates Assures Governor Tambuwal of Bloc Votes",
    "summarized_story": "Leading Peoples Democratic Party [PDP] Presidential aspirant and governor of Sokoto state, Aminu Waziri Tambuwal, has been assured of delegate votes during the party’s May 28 presidential primary elections.\nThe Taraba state PDP chairman, Kefas Dantalab who stated this when Govenror Tambuwal visited the state on his Presidential campaign tour said “Taraba is Tambuwal, Tambuwal is Taraba”.\nGovernor Tambuwal who was received at the Taraba state government House by Governor Ishaku Darius; the state deputy governor Haruna Manu, Speaker of the state House of assembly Rt Hon.\nJoseph Albasuk; Taraba State PDP chairman Hon Kefas Dantalab, members of the State executive council as well as members of the state House of assembly said he’s the leader that is accepted by all regions and sectors of Nigeria.\nHe further spoke on governor Tambuwal’s humity which he said he witnessed first hand while the governor was speaker of the House of Representatives."
  },
  {
    "headline": "JUST IN: Tinubu Campaign DG Jibrin Dumps APC, To Announce New Party In 24Hrs",
    "summarized_story": "The National Leader of the All Progressives Congress, APC, Bola Ahmed Tinubu’s campaign Director-General, AbdulMumin Jibrin, has dumped the party.\nReport has it that Jibrin announced this on his official Twitter page.\nHe Said, “I have done my best for APC.\nI will announce my new political party within the next 24 hours, Insha Allah.\nI will make a formal statement in due course.”More to come…"
  },
  {
    "headline": "Breaking: Ahead party presidential primaries, Tinubu’s campaign DG dumps APC",
    "summarized_story": "A former member of the House of Representatives and Director-General of a group campaigning for the presidential ambition of Bola Tinubu, Abdulmumin Jibrin, has defected from the All Progressives Congress (APC).\nJibrin who disclosed this on Saturday via his official Twitter handle, said his new political party would be made known soon.\nHe tweeted, “I have done my best for APC.\nI will announce my new political party within the next 24 hours insha Allah.\nI will make a formal statement in due course.”Details loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Premier League club with 5 Super Eagles’ players relegated",
    "summarized_story": "Watford have been relegated from the Premier League after Wilfried Zaha’s first-half penalty secured a deserved victory for Crystal Palace at Selhurst Park.\nNigeria’s Super Eagles vice captain William Troost Ekong plays for Watford.\nFour other Super Eagles players including Oghenekaro Etebo, Samuel Kalu, Maduka Okoye and Bonaventure Dennis are part of Watford squad.\nIt is the second time Watford have dropped out of the top flight in the past three seasons.\nThe manager-less Hornets also went went down on the final day of the 2019-20 campaign before securing an immediate return under Xisco Munoz."
  },
  {
    "headline": "Breaking: At last, CBN governor, Emefiele, opens up on 2023 presidency",
    "summarized_story": "Hours after Nigerians poured out reactions on the purchase of his All Progressives Congress (APC) presidential forms ahead of 2023 general elections, Central Bank of Nigeria (CBN) Governor Godwin Emefiele has outrightly rejected the offers made by farmers in the country.\nCategorically, the CBN Boss said he has not taken a stance on 2023 Presidency.\nEmefiele who spoke via his Twitter handle on Saturday though thanked the farmers for their concern, said if he decides to contest, he would use his personal resources.\nI note and salute the sacrifices of those farmers and patriots going as far as raising personal funds and offering me Presidential Nomination Forms: I thank them most profusely.\nThis is a serious decision that requires God’s Divine intervention: in the next few days The Almighty will so direct.”Share this: TwitterFacebook"
  },
  {
    "headline": "Bandits Kill 48 In Fresh Zamfara Attacks",
    "summarized_story": "They reportedly killed nine people and then proceeded to Damri community where they killed four persons including a Police officer and personnel of Nigeria Security and Civil Defence Corps (NSCDC).\nREAD ALSO: Police Arrest Notorious Gang Leader In ZamfaraThe outlaws also set ablaze a Hilux vehicle belonging to the Nigerian Police.\nThe bandits then killed eight persons in Kalahe community, a village between Sabon Gari Damri and Damri townAccording to Suleiman, the bandits attacked a healthcare facility in Damri town and killed some patients who were receiving treatment in the hospital.\n“The bandits in their large number were on motorcycles with three persons on each motorcycle first attacked Sabon Gari Damri and killed four people,” he said.\n“Military personnels entered the town and exchange fire and forced the bandits to move back to Sabon Gari Damri, after killing nine people at the village, they went back and killed about twenty-one people.”Suleiman confirmed that a total of 48 people were killed during the attacks."
  },
  {
    "headline": "Ibom Airlines Rejects Monday Shutdown, To Continue Operations",
    "summarized_story": "Ibom Airlines says it will not join the planned shutdown of flights announced by the Airlines Operators of Nigeria (AON).\nThe AON had on Friday said its members would suspend flight services on Monday due to the unbearable high cost of aviation fuel (JetA1) and other associated costs.\nBut in a statement, Ibom Airlines said obligations to its customers, suppliers and staff, would not allow it participate in the shutdown.\nREAD ALSO: ‘Consider The Multiplier Effects’, FG Appeals To Airline Operators Over Monday Shutdown“Apart from the above factors, Ibom Air is currently the only airline serving Akwa Ibom State directly and as such, any voluntary stoppage of operations would completely cut off access by air into and out of the State,” the statement added.\nMeanwhille, the Minority Caucus in the House of Representatives has called on President Muhammadu Buhari to intervene and avert the imminent shutdown which, it believes, will cripple the nation’s economy."
  },
  {
    "headline": "Coalition Purchases APC Presidential Forms For Akinwumi Adesina",
    "summarized_story": "A coalition of 28 groups have purchased the All Progressives Congress’ presidential forms for the President of the African Development Bank and former minister of Agriculture, Dr Akiwumi Adesina.\nThe coalition consists of groups such as Youth Arise Movement, Nigerians in Diaspora, One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, and other civil society groups.\nREAD ALSO: Akeredolu Asks CBN Governor To Resign Over Presidential AmbitionDr Adesina has not publicly signaled his intention to run for President.\nOn Friday, some supporters also picked up APC presidential forms for Governor of the Central Bank, Godwin Emefiele.\nMr Emefiele has since rejected the forms, saying he has not decided to run for President."
  },
  {
    "headline": "2023: I Have Not Decided To Run For Presidency, Says Emefiele",
    "summarized_story": "The Central Bank of Nigeria (CBN) Governor, Godwin Emefiele, says he has not made a decision on running for the presidency, hours after a group purchased the All Progressives Congress (APC) nomination form for him.\nREAD ALSO: 2023 Presidency: Support Groups Pick Up Nomination Form For Osinbajo“I am humbled by the growing interest of those asking that I run for the Office of President in the 2023 general elections: I have not come to that decision.\nI note and salute the sacrifices of those farmers and patriots going as far as raising personal funds and offering me Presidential Nomination Forms: I thank them most profusely,” he wrote.\nIn a statement released late Friday, Akeredolu asked him to resign, calling on Buhari to sack the CBN governor if he fails to do so.\n“Consequently, we admonish Mr Emefiele to leave the office, immediately, for him to pursue his interest,” Akeredolu said."
  },
  {
    "headline": "Lula Launches Presidential Campaign To ‘Rebuild Brazil’",
    "summarized_story": "Former president Luiz Inacio Lula da Silva launched his campaign for a new presidential term Saturday, vowing to rebuild Brazil after what he called the “irresponsible and criminal” administration of far-right incumbent Jair Bolsonaro.\nThe campaign launch sealed a remarkable political comeback for Lula (2003-2010), four years after the 76-year-old leftist icon was jailed on controversial corruption charges.\n“We need to change Brazil once again… We need to return to a place where no one ever dares to defy democracy again.\nThe ruling instantly set up this year’s elections as a polarizing clash between arch-enemies Lula and Bolsonaro.\nLula has reportedly shaken up his campaign team recently, removing long-time ally Franklin Martins as communications chief."
  },
  {
    "headline": "Asiwaju Tinubu Intervenes in Kano APC Dispute -",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has stepped in to resolve the local political squabbles between Abdulmunin Jibrin and key stakeholders in his constituency in Kano State.\nAbdulmumin Jibrin had announced his decision to leave the Kano State Chapter of the APC for an undisclosed party early on Saturday.\nThere had been a crisis of confidence between Jibrin and Kano State Governor, Abdullahi Ganduje, for some time over local political issues.\nAsiwaju Tinubu reportedly reached out to Governor Ganduje to reach a truce and ensure the unity withion the Kano State Chapter of the APC is not ruptured.\nThe source said Asiwaju Tinubu has already intervened on Jibrin’s behalf with Governor Ganduje and everything will be resolved."
  },
  {
    "headline": "Interest Groups obtain APC Nomination Forms for AfDB President, Adesina -",
    "summarized_story": "The President of the African Development Bank and former minister of Agriculture, Dr Akinwumi Adesina has picked up the N100m Expression of Interest and Nomination form for the 2023 presidential election.\nA coalition of 28 groups, led by the Head of One Nigeria Group, Mohammed Saleh, raised the fee to purchase the form for Adesina.\nThey include; Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities and other civil society groups.\nThe former Minister joinsa crowded group of aspirants that have obtained the nomination form.\nSome of those who have obtained the forms are Vice-President Yemi Osinbajo, APC National Leader, Bola Tinubu, the Minister of State for Education, Emeka Nwajuiba; Pastor Tunde Bakare; Jigawa Governor, Mohammed Badaru."
  },
  {
    "headline": "I have not made any decision on Presidential Contest",
    "summarized_story": "Mr Emefiele disclosed this in a statement he issued on his verified twitter handle and personally signed by him.\nSee full statement belowI am humbled by the growing interest of those asking that I run for the Office of President in the 2023 general elections: I have not come to that decision.\nI note and salute the sacrifices of those farmers and patriots going as far as raising personal funds 1/4and offering me Presidential Nomination Forms: I thank them most profusely.\nAnd should I not run for elected office, 3/4I will continue to serve and sacrifice for the good people of Nigeria under the able leadership of President Muhammadu Buhari.\nThis is a serious decision that requires God’s Divine intervention: in the next few days The Almighty will so direct."
  },
  {
    "headline": "Returning Presidency to the North in 2023 evil, undemocratic",
    "summarized_story": "The Campaign for Democracy, CD said it is evil, undemocratic and unjust, if presidency is allowed to go back to the North.\nCD in a statement issued by its General Secretary, Ifeanyi Odili, said any attempt for the north to take over power again may lead to disintegration.\nThe group said It is a conspiracy against the South by the North for the two major parties, PDP and APC to project fielding Northern candidates in 2023.\n“It is evil, undemocratic and unjust if we fold our hands and allow presidency to go back to the North.\nIt is a conspiracy against the South by the North for the two major parties, PDP and APC to project Northern candidates in 2023″."
  },
  {
    "headline": "Nigeria’s Central Bank Chief Emefiele Says He Hasn’t Decided on Presidency Bid",
    "summarized_story": "Nigerian central bank Governor Godwin Emefiele denied that he has decided to run for president in next year’s election, not excluding the possibility that he might do so.\nIn a series of tweets on Saturday, the central banker said he was “humbled” by calls for him to run to succeed President Muhammadu Buhari.\nHe said he saluted “the sacrifices of those farmers and patriots going as far as raising personal funds” to offer him presidential nomination forms.\nEmefiele said if he decides to seek a presidential nomination, he will use his own money to acquire the forms.\nThe last day to acquire and submit the APC’s presidential nomination forms is May 11."
  },
  {
    "headline": "Olisa Metuh: We Need a National Consensus, But in its Absence, PDP Has Suitable Candidates",
    "summarized_story": "Former National Public Secretary of the People’s Democratic Party and party Chieftain, Olisa Metuh, discusses the evolution of his party, having been out of power for 7 years, and with the general elections fast approaching.\nMetuh also addresses the ongoing crisis between Nnamdi Kanu, IPOB and the government of Nigeria."
  },
  {
    "headline": "Nigeria: Buhari Dashes Hopes of Igbo Leaders on Nnamdi Kanu, Says Court will Decide IPOB Leader’s Fate",
    "summarized_story": "The Igbo leaders, during a meeting with the President at the Government House, Abakaliki, had pleaded with Buhari to release Kanu.\nThe Chairman, South-East Traditional Rulers Council, Eze Charles Mkpuma, delivered the plea.\nThe Chairman of South-east Traditional Rulers, Eze Charles Mkpuma and CAN Chairman, South-east, Very Rev.\nThe Ohanaeze had in a statement on Tuesday hoped that Buhari’s visit to Ebonyi State would kick-start the process to get Kanu freed.\nThe Igbo socio-cultural organisation, in the statement said, “Ohanaeze Ndigbo Worldwide has given assurances of peace and security ahead of the planned presidential visit to Ebonyi State."
  },
  {
    "headline": "Nigeria: South-west APC Presidential Aspirants Agree Next President Should Come from Region",
    "summarized_story": "South-west APC presidential aspirants and leaders met in Lagos on Friday and reached an agreement to ensure that the region produces the next APC presidential candidate.\nA former National Chairman of the APC, Chief Bisi Akande, made this known while addressing journalists at the end of the meeting.\nHe said the South-west APC presidential aspirants, governors and other leaders are united ahead of the 2023 general elections.\nThe governors of Lagos, Osun, Ogun, Ondo and Ekiti, Babajide Sanwo-Olu, Gboyega Oyetola, Dapo Abiodun, Rotimi Akeredolu and Kayode Fayemi, respectively were present.\nThe National Secretary of APC, Chief Iyiola Omisore was also at the meeting."
  },
  {
    "headline": "Rice Farmers Buy APC Presidential Forms for Nigeria’s Central Bank Chief Emefiele",
    "summarized_story": "On the same day, South-west APC presidential aspirants and leaders met in Lagos and reached an agreement to ensure that the next presidential candidate of the party is produced by the region.\nEmefiele has not officially indicated interest in competing for the Presidential flag of the APC, saying he is focused on strengthening the nation’s economy.\n22 APC Presidential Aspirants Pick FormsAs at Friday night, no fewer than 22 presidential aspirants had purchased the Expression of Interest and Nomination forms of the APC ahead of Tuesday’s deadline.\nOthers that had earlier picked forms are Governor Yahaya Bello of Kogi State; Ebonyi State governor, Dave Umahi; former Imo State governor, Senator Rochas Okorocha; Minister of State, Education, Chukwuemeka Nwajuiba; former Governor of Lagos State, Bola Tinubu and Uju Kennedy, the only female aspirant.\nOthers are Jigawa State Governor, Abubakar Badaru; the former Governor of Zamfara State, Sani Yerima and the former speaker, House of Representatives, Dimeji Bankole."
  }
]