[
  {
    "headline": "Kenyan man kills wife, three children, surrenders to police",
    "summarized_story": "A man in Ndalat market, Nandi County of Kenya, has killed his wife and three children, after which he surrendered at the Kipkaren Salient police station.\nAccording to NTV Kenya, the incident occurred Wednesday night during a domestic feud between the couple.\nPhilip Lokuruen, 40, confessed to the police that he killed his wife Rispa Chelimo, 35, and his children: Ian Kipkosgei, 11; Brenda Cheruto, 9; and Linus Kipkosgei, 7, respectively.\nLocal media reports Nandi County Area Chief, Eunice Luley, was said to be first among eyewitnesses at the scene of the crime on Wednesday.\nDepression is real!”The police have not issued a statement on their investigation as at the time of filing this report."
  },
  {
    "headline": "Ukraine: Kyiv accuses Hungary of aiding Putin",
    "summarized_story": "Ukraine on Thursday accused its neighbour, Kremlin-ally Hungary, of appeasing Russian aggression and disrupting EU unity following a telephone call between the Hungarian and Russian leaders.\n“Apparently, after the elections, Budapest moved on to the next step – helping (Russian President Vladimir) Putin continue his aggression against Ukraine,” the Ukrainian foreign ministry said in a statement.\nThe two leaders spoke again Wednesday and Orban told Putin that Hungary would be prepared to pay Russia in rubles for gas imports.\n“Proposals to hold peace talks between Ukraine and Russia in Budapest look cynical,” Kyiv’s statement said.\nDuring his call with the Russian president, he restated his opposition to Hungary sending weapons to Ukraine and to the EU imposing an embargo on Russian energy imports, on which Hungary is highly dependent."
  },
  {
    "headline": "Senate asks FG to retain the name Harold Dappa Biriye House in New NDDC Head Office",
    "summarized_story": "By Henry Umoru, ABUJATHE Senate has the Federal Government to as a matter of urgency, retain the name, Harold Dappa Biriye House in the New Niger Delta Development Commission, NDDC permanent headquarters in Port Harcourt, Rivers StateThe Senate urged the Secretary to the Government of the Federation, SGF, Boss Mustapha and the Minister of Niger Delta Affairs, Senator Godswill Akpabio to immediately direct and ensure the retention of Harold Dappa Biriye House in the NDDC permanent headquarters.\nThe resolution of the Senate yesterday was a sequel to a motion titled, “Need to retain the name Harold Dappa Biriye House in the New Head Office of the NDDC.” It was sponsored by Senator Seriake Dickson, Peoples Democratic Party, PDP, and Bayelsa West.\nHe collaborated with General Gowon, General Murtala Mohammed and all leaders and heads of state including General Obasanjo at the return of democracy;“Notes also that Until his death, Harold Dappa Biriye was the founding Chairman of the board of trustees of the Ijaw National Congress and was deputized by Pa E.K.\nClark who took over after his death.\n;“Aware that through Henry Willink’s Commission of 1957, which he fought for and pushed, informed the establishment of the Niger Delta Basin Development which later was replicated in other regions in the country;“Notes that he offered advice to President Olusegun Obasanjo’s administration on how to restore peace to the Niger Delta region and was, therefore, one of the leaders that facilitated the establishment of the NDDC;“Notes that following the establishment of the NDCC, the Federal Government and the management of the NDDC with the support of the Rivers State Government led by Sir Dr Peter Odili, who himself was one of the several political protégés of Harold Dappa Biriye decided to name the NDDC temporary Headquarter donated by the Rivers State Government, after him, as a mark of recognition for his services to the Niger Delta people and Nigeria at large;“Observes that the NDDC after over 20 years of existence has commissioned its permanent headquarters last year but observes with dismay that while the NDDC has commissioned and moved its personnel and activities into its permanent headquarters which is commendable, it has refused, neglected or failed to transfer the name Harold Dappa Biriye House to adorn its permanent Headquarters as should have been done even before the commissioning; and“Observes that, unlike his colleagues and contemporaries who fought for Nigeria’s independence, whose names and images adorn our national currency and strategic national assets, Harold Dappa Biriye has nothing in his name order than this.”Vanguard News Nigeria"
  },
  {
    "headline": "Appeal Court orders status quo in Akwa Ibom APC Exco",
    "summarized_story": "The Court of Appeal sitting in Abuja on Thursday ordered that statusquo be maintained in the Akwa Ibom State All Progressives Congress (APC) executive elected on 16th October, 2022 and inaugurated by the APC National Caretaker Committee until the determination of the motions for jurisdiction and stay of execution which comes up on 17th May, 2022.\nAugustine Ekanem emerged as the Akwa Ibom State APC Chairman alongside other State Executives following nationwide State Congresses conducted by the APC.\nThe APC in Akwa Ibom has been embroiled in a lingering battle between the former National Secretary of APC Caretaker Committee, Sen. John James Akpanudoedehe and the Minister of Niger Delta Affairs, Sen. Godswill Akpabio."
  },
  {
    "headline": "Healthy environment, improved healthcare for mothers’ll reduce infant mortality — Adebola Salami",
    "summarized_story": "In this interview, she shares her passion for the Mobaby Care brand and how it is addressing healthy living in our economy.\nDo you think Nigeria has been able to address healthy living and health infrastructure upgrades generally compared to other developed countries?\nNot many Nigerians can afford basic health care, Health insurance is not accessible to all and when available, rarely addresses concerns that are most life-threatening.\nWith World Health Day themed ‘Our Planet, Our Health,’ how does the planet boost healthy living in Nigeria and globally?\nTechnologies to reduce pollution at its source are plentiful, as are technologies that reduce pollution by filtering it away from the emission source (end-of-pipe solutions; Examples of technologies to reduce air pollution include the use of lead-free gasoline, which allows the use of catalytic converters on vehicles’ exhaust systems."
  },
  {
    "headline": "Govt either meets us or we turn here to abattoir, Kaduna train attack terrorists threaten",
    "summarized_story": "A screengrab image of the Managing Director of the Bank of Agriculture (BOA), Alwan Ali-Hassan, flanked by the terrorists.\nBy Ibrahim Hassan-Wuyo, KadunaThe terrorists that attacked the Abuja-Kaduna bound train have threatened to kill those in their captivity unless the government meets them.\nThe government knows what we want.”Already, they’ve released the Managing Director of the Bank of Agriculture (BOA), Alwan Ali-Hassan.\nHowever, a source confided in journalists that contrary to the terrorists claim, N100 million or so was allegedly paid as ransom before the Managing Director was released.\nIn the short video, which went viral, four of the terrorists were seen in military uniform wielding arms, with the Managing Director in the middle."
  },
  {
    "headline": "Non-payment of Ground rate: There’ll be no sacred cow, hiding place for defaulters — Ebonyi Govt threatens",
    "summarized_story": "…As Clevero hotel complies with Government’s directiveBy Peter Okutu, AbakalikiEbonyi State Government, Wednesday threatened that there will be no sacred cow or hiding place for any property owner who defaults in the payment of Ground Rate in the State.\nRecall that the State Government had earlier sealed four hotels in Abakaliki, the Ebonyi state capital for refusing to pay their ground rate.\nThe hotels affected by the first phase of the enforcement exercise include Clevero hotel, City Pride hotel, Island Comfort hotel and Abuson hotel in Abakaliki.\nAs the second phase of the exercise continued, the Management of Clevero hotel has cleared their own ground rate by paying into the government’s designated account.\nThis has necessitated the state government to unseal Clevero hotel and clear them of all indebtedness regarding non-payment of ground rate."
  },
  {
    "headline": "Bauchi Assembly moves state fire service to SEMA for quick response",
    "summarized_story": "In a move aimed at ensuring a quick response, the Bauchi State House of Assembly on Wednesday at plenary resolved to remove the state Fire Service Department from the Ministry of Works and Transport and transfer it to the State Emergency Management Agency (SEMA), which is under the office of the state governor.\nLeading debate on the motion, Aliyu, who is the Assembly’s Majority Leader, informed that many fire incidents occurred across the state in recent times.\nAccording to him, “Fire safety is in a sorrowful situation in Bauchi State.\n“Recently, there was a fire incident in Matsango Azare and they are sharing the same wall with the fire service office but they have nothing to do because they don’t have the machines to fight the fire.\nHe added that if the motion passed by the Assembly to make fire service part of the State Management Agency (SEMA) instead of the Ministry of Works and Transport, fire incidents would be reduced."
  },
  {
    "headline": "Redeem N10bn pledge to rebuild displaced communities – Sen Gyang to Buhari",
    "summarized_story": "Senator representing Plateau North, Istifanus Gyang has described the killing of Internally Displaced Persons and injuring of others trying to rebuild their ancestral homes at Rantis, Barkin Ladi LGA of Plateau State, as ‘the height of impunity and wickedness”.\nHe called on President Muhammadu Buhari to redeem the Federal government’s pledge of N10 billion to assist in rebuilding and resettling communities destroyed by terror attacks in the State.\nGyang who is the Deputy Chairman Senate Committee on Defence added that “Consequent upon this heinous act, I’m calling on the Commander Operation Safe Haven and the Commissioner of Police Plateau State Command to ensure that the terrorists are apprehended for prosecution.\nHe also urged that security be provided to guarantee the safety of the IDPs undertaking the rebuilding of their ancestral home.\n“I’m equally reminding President Muhammadu Buhari of the need to redeem the N10 billion Federal government pledge which was made to assist in rebuilding and resettlement of communities destroyed by terror attacks in Plateau state”, Gyang stressed."
  },
  {
    "headline": "I would rather die than stay quiet over insecurity – Sacked Abuja Imam, Khalid",
    "summarized_story": "Sheikh Nuhu Khalid, former Chief Imam of Apo Legislative Quarters Central Mosque in Abuja, has vowed to continue speaking about the failure of President Muhammadu Buhari-led Federal Government.\nKhalid said he would rather die of hunger than stay quiet when Nigerians are being killed under the current government.\nThe Islamic Research and Da’awah Foundation founder told Daily Trust: “I have nothing to lose.\nI would rather die of hunger than be quiet when people are killed.\nTherefore, I know the difficult situation the people of this country are going through.”Khalid was sacked as the Chief Imam of the Apo legislative quarters Juma’at mosque in Abuja because he berated Buhari’s government over its inability to tackle insecurity in the country."
  },
  {
    "headline": "Tension as Federal High Court set to deliver make or mar judgment on Governor Ayade’s defection",
    "summarized_story": "Palpable tension has gripped the political camp of Governor Ben Ayade of Cross River State as a Federal High Court in Abuja is set to deliver a make or mar judgment in a defection suit against him.\nJustice Taiwo Taiwo is expected to make his decision known later today on the legality or otherwise of the defection of the governor from the People’s Democratic Party PDP to the All Progressives Congress APC.\nAt the time of this report, hundreds of supporters and sympathizers of the governor have stormed the court premises debating the direction of the court’s pendulum.\nAlthough the judgment ought to have been handed down yesterday, it was shifted till today following a Court of Appeal’s latest decision on defections.\nJustice Taiwo halted the judgment to enable him consider the implications of the Court of Appeal’s fresh judgment on the defection related matters."
  },
  {
    "headline": "US building military biological capability, creating labs in countries – Russia",
    "summarized_story": "Russia has accused the United States of building its military biological potential in regions across the world.\nA senior official Igor Kirillov said Washington is creating biological laboratories in different countries and connecting them to a unified system.\nKirillov alleged that the US has spent more than $5 billion on military biological programmes, Xinhua quoted him as saying.\nThe military chief said the facilities are monitoring the biological situation in proposed areas for the deployment of North Atlantic Treaty Organisation (NATO) contingents.\n“It is collecting and delivering strains of dangerous microorganisms to the United States and studying potential agents of biological weapons."
  },
  {
    "headline": "Gunmen kill two, injure others in Plateau IDPs camp",
    "summarized_story": "Gunmen kill two, injure others in Plateau IDPs campSuspected gunmen on Wednesday killed two persons and injured at least two others at the Internally Displaced Persons(IDPs) camp in Rantis community of Gashish District I Barkin Ladi Local Government Area of Plateau State.\nIt was learnt the gunmen, numbering six, stormed the camp on three motorcycles and shot sporadically around 3:40pm.\nThe IDPs were said to have completed work for the day and were about leaving the site when the gunmen showed up.\nThe Nation learnt the gunmen also burnt a Volkswagon Vento belonging to one of the deceased, Dalyop Boyi.\nHe said: “We are aware of the attack at th IDP camp by unknown gunmen, two people were killed, two injured."
  },
  {
    "headline": "Cheers as Lagos inaugurates ‘catch them young’ poultry pens in public schools",
    "summarized_story": "Four other poultry pens were also inaugurated under the programme in four other public primary schools.\nNow, with the inauguration of the school’s poultry pen, the boy said he would have the opportunity to learn more about his hobby in a school setting.\nThe inauguration, apart from the Community Primary School II Egan, also took place simultaneously at four primary schools — Obele Primary School, Itire; Roman Catholic Primary School, Ipakodo; and Methodist Primary School, Gberigbe.\nThe poultry pens are aimed at inculcating farming into young ones.\nThe sixth poultry pen at Christ Central Primary School, Mushin LGEA is still under construction."
  },
  {
    "headline": "Terrorists: we bombed Kaduna train to get something from govt",
    "summarized_story": "Terrorists who bombed the Abuja-Kaduna train, killed eight passengers on board and kidnapped unspecified number of others, have explained why they struck.\nThey spoke in a video shortly before releasing the Managing Director of Bank of Agriculture (BOA) Alwan Ali-Hassan.\nThe terrorists, in the one minute, 21 seconds video, said they did not attack the Kaduna-bound train because of ransom but to press home a particular demand from the government.\nThey threatened to kill the rest of the passengers in their captivity if the government does not hasten up in meeting their demands.\nBut, I can confirm to you that I left a lot of people in the terrorists den who are in need of urgent rescue."
  },
  {
    "headline": "Outcry in Southeast schools over ‘sit-at-home’",
    "summarized_story": "Lecturers, teachers and other stakeholders have decried the negative effects of Mondays’ sit-at-home order by Indigenous People of Biafra (IPOB) enforcers.\n“Sit-at-home has negatively impacted academics in tertiary institutions in the Southeast in many ways.\nExcept private universities in the Southeast, which have their academic activities unhindered, others which are government-owned have succumbed to the threats of sit-at-home on Mondays and other days IPOB announces as sit-at-home.\nThis is why you can’t find anyone in any school on Mondays or any day IPOB may determine as sit-at-home day.\n“Another evil this sit-at-home has brought upon us is that no conference or seminar holds anymore in the Southeast because of the fear of the attacks that might result from sit-at-home."
  },
  {
    "headline": "Why we released BoA MD, by terrorists",
    "summarized_story": "Terrorists, who attacked the Abuja-Kaduna train on March 28, 2022, said the Managing Director of the Bank of Agriculture (BoA) Alwan Ali-Hassan was released on compassionate ground.\nIn a video circulating on social media, one of the terrorists, who spoke in Hausa language, said they decided to have mercy on the BOA MD in the spirit of the Ramadan season and his age.\n“We are responsible for the attack on the Abuja-Kaduna train and we are allowing theman to go because of his age and in the spirit of Ramadan.\nHassan, who was flanked by the heavily armed terrorists before his release, also confirmed they were releasing him on compassionate grounds.\nThe BoA MD, who was directed to speak in the video before his release, pleaded with the government to listen to the terrorists so that other captives can be released."
  },
  {
    "headline": "Court orders final forfeiture of N95.3 million traced to ex-SGF Awudu",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court has ordered the final forfeiture of the sum of N9.3 million traced to a former Surveyor-General of the Federation (SGF), Ebisintei Bietoru Awudu, to the coffers of the Federal Government.\nThe order was a sequel to an application brought by the Independent Corrupt Practices and Other Related Offences Commission(ICPC), describing the money as suspected proceeds of crime.\nThe judge held that the Independent Corrupt Practices and Other Related Offences Commission(ICPC), proved beyond reasonable doubt that the property and the money were proceeds of crime as defined by the Money Laundering Prohibition Act of 2011.\nJustice Maha had on December 9, 2021, granted an exparte motion by the Independent Corrupt Practices and other Related Offences Commission (ICPC) for an interim order forfeiting the properties to the Federal government.\nListed as respondents in the motion exparte dated November 23, 2021, are Surveyor Ebisintei Bietoru Awudu, Kumeni Services Limited and Geolev Nigeria Limited."
  },
  {
    "headline": "2023: PDP has committed suicide –Ohanaeze",
    "summarized_story": "From Magnus Eze, Enugu and Chukwudi NwejeApex Igbo socio-cultural organisation, Ohanaeze Ndigbo, yesterday, described the Peoples Democratic Party (PDP) as a betrayer saying it committed political suicide by throwing its 2023 presidential ticket open to all aspirants, irrespective of geopolitical zone.\nIt is therefore curious that the PDP should commit political hara-kiri at a time it is struggling for a fresh air.\nPresident of the MBF, Dr. Pogu Bitrus, agreed with Ohanze’s position that what the PDP had done amounted to a political suicide.\nSo, throwing the contest open actually amounts to a political suicide unless if they succeed in electing a southern candidate during the primary,” he said.\nHowever, President of the Arewa Youths Consultative Forum (AYCF), Alhaji Yerima Shettima disagreed with Ohaneze’s assertion of PDP committing political suicide saying there was nothing like political suicide in what the PDP has done."
  },
  {
    "headline": "FG counters Obasanjo on insecurity, blames PDP for worsening economy",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government, yesterday, declared that contrary to public perception, it is not overwhelmed with the security challenges ravaging the country.\nFormer president, Chief Olusegun Obasanjo, had recently claimed that the President Muhamamdu Buhari-led government was overwhelmed by the security challenges bedevilling the country.\nHe, whoever, explained that despite the various challenges, the current administration is doing everything within its power to address the situation.\nHe also blamed the media for providing oxygen for terrorists by publishing their activities on the front page of every newspaper.\nMeanwhile, the Federal Executive Council (FEC) has approved N36.130 billion for the construction of the Keffi-Nasarawa-Toto Road in Nasarawa State."
  },
  {
    "headline": "Buhari assents to EO 11 on public buildings maintenance",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, assented to Executive Order 11 (EO11) on national public buildings maintenance.\nThe signing of the document preceded the weekly Federal Executive Council (FEC) meeting at the Council Chambers of the State House, Abuja.\nSpeaking before appending his signature, the president directed all Ministries, Departments and Agencies of government (MDAs) to set up maintenance departments in line with the provisions of the new Executive Order.\nPresident Buhari said the order now gives legal backing to the country’s national maintenance policy, following its earlier approval by FEC.\nBy this Order, I expect MDAs to set out and ensure the operation of their maintenance departments and make necessary procurements for their maintenance in accordance with the provisions of the public procurement act,” he said."
  },
  {
    "headline": "Kaduna military base attack: Number of soldiers killed rises",
    "summarized_story": "From Molly Kilete, AbujaThe number of soldiers killed during an attack by terrorists on a military base in Birnin Gwari, Kaduna State, has risen to 17, Daily Sun has gathered.\nThe soldiers from 2 Battalion, stationed at Polewire, in the village, had come under heavy attack from the terrorists on Monday night, with 12 soldiers killed, while 20 others were severely wounded.\nIt was, however, learnt, yesterday, that the casualty figure rose from 12 to 17 as five more injured soldiers died.\nThe military authorities in Kaduna have been able to make contact with the families of the slain soldiers just as arrangements have been concluded to bury the Muslims among the deceased soldiers.\nThe team was said to have successfully evacuated and resuscitated 21 wounded soldiers from the scene of the attack to a military hospital."
  },
  {
    "headline": "Zenith Shareholders Reap Bumper Harvest as Bank Pays N97.3bn Dividend",
    "summarized_story": "The shareholders gave the approval at the bank’s 31st Annual General Meeting (AGM) held yesterday at Civic Centre, Victoria Island, Lagos.\nSunny Nwosu, expressed the delight of shareholders over the consistent payment of dividends by Zenith Bank, noting that the bank’s shares remain the toast of investors because the bank has never failed to pay dividends to shareholders.\nIts profit before tax also grew by 10 per cent, from N255.9 billion to N280.4 billion in the current year.\nThis further led to a seven per cent increase in net interest income of N320.8 billion in 2021, from N299.7 billion in 2020.\nRetail deposits grew by N146 billion from N1.72 trillion in 2020 to N1.87 trillion in 2021."
  },
  {
    "headline": "THISDAY Projects: With Northern Presidential Candidate, PDP Set to Lose Key Southern States",
    "summarized_story": "So, the party would face an uphill task winning these states even with a northern presidential candidate and the APC fielding a southern candidate.\nA Pan-Niger Delta Forum, (PANDEF), has also expressed its disappointment at the PDP decision, saying it was an awful decision that would have consequences.\nA copy of the recommendation of the zoning committee obtained by THISDAY stated thus: “Zoning, as in our party constitution, is affirmed.\nAlso, it stated that, 35 in every 100 Nigerian that registered to vote in 2019 presidential election, voted.\nHis words: “I am not talking as a zoning committee member or the chairman of zoning committee; I am talking as Samuel Ortom."
  },
  {
    "headline": "Jonathan Escapes Unhurt as Two Aides Die in Abuja Road Accident",
    "summarized_story": "•Ex-president, Atiku mournEmmanuel Addeh andKingsley Nweze in AbujaEx-President Goodluck Jonathan yesterday escaped unhurt in a road accident in Abuja, although the crash left two of his police aides dead and others injured.\nAlthough it wasn’t clear what caused the accident, Jonathan was said to have left Yenagoa, Bayelsa, his home state, for Abuja in the afternoon before the accident which saw a number of the cars in the convoy mangled, happened.\nMeanwhile, a former Vice President of Nigeria, Atiku Abubakar has commiserated with Jonathan over the occurrence, describing the deaths as shocking.\nOn his Twitter handle, Atiku stated that the story of the accident and the loss of two of Jonathan’s aides were heart-wrenching.\n“I console the immediate families of the deceased as well as President Jonathan."
  },
  {
    "headline": "Wood McKenzie: Oil Theft Gone Beyond Crisis Point in Nigeria",
    "summarized_story": "Woodmac added that although improved security and monitoring reduced losses at Forcados, lack of pump capacity at Ughelli had a major impact on oil production in the Western Delta.\nIt disclosed that Eni’s Brass oil pipelines in the northern areas are now worst affected, while local security officials contend with an unprecedented number of incidents.\n“Oil thefts have gone beyond crisis point and are deterring investment in the onshore.\nCrude theft and sabotage have long been problems in Nigeria, but 2021 saw record levels of theft.\nNNPC reports that crude thefts in 2021 reached 200,000 barrels per day a quarter of onshore production."
  },
  {
    "headline": "Ohaneze: PDP Has Committed Political Suicide by Discarding Zoning",
    "summarized_story": "* Says it’s highly inconceivable that Igbo ‘ll validate a party that runs roughshod over its sensibilitiesPresident General of Ohanaeze Ndigbo World Wide, Prof George Obiozor, has said the Peoples’ Democratic Party (PDP) has committed political suicide by jettisoning zoning.\nObiozor was reacting to the decision of the Governor Ortom-led PDP committee on zoning of its presidential ticket to throw the party’s ticket open.\nIt is therefore curious that the PDP should commit political hara-kiri at a time it is struggling for a fresh air.\nOne of the roles of a political party in a democracy is nation building and for the PDP to shirk its responsibilities is an unfortunate path to Golgotha.\n“Ohanaeze Ndigbo Worldwide urges all the Igbo presidential aspirants to remain focused and undaunted because of the PDP shenanigans."
  },
  {
    "headline": "EXCLUSIVE: Aggrieved Nigerian Policemen Pick New Date For Nationwide Protest, Strike Action",
    "summarized_story": "Nigeria Police Force junior personnel have again stated their resolve to commence a nationwide strike on May 1st, 2022, SaharaReporters has gathered.\nThe aggrieved policemen had in March 2022 said they would embark on a warning strike to protest against poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\n“We have started planning another protest and strike action.\n“Strike and protest will be done together.\nWe relaxed the planned strike action initially because we were reliably informed that the salary would be paid last month."
  },
  {
    "headline": "EXCLUSIVE: Aggrieved Nigerian Policemen Pick New Date For Nationwide Protest, Strike Action",
    "summarized_story": "Nigeria Police Force junior personnel have again stated their resolve to commence a nationwide strike on May 1st, 2022, SaharaReporters has gathered.\nThe aggrieved policemen had in March 2022 said they would embark on a warning strike to protest against poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\n“We have started planning another protest and strike action.\n“Strike and protest will be done together.\nWe relaxed the planned strike action initially because we were reliably informed that the salary would be paid last month."
  },
  {
    "headline": "Nigerian Youth Service Scheme, NYSC Warns Corps Members Against Criticising Buhari Government On Twitter, Facebook, Others",
    "summarized_story": "The Director-General of National Youth Service Corps (NYSC), Maj.-Gen. Shuaibu Ibrahim, has warned corps members against criticising the policies of President Muhammadu Buhari’s government on social media.\nIbrahim on Wednesday gave the warning during the inauguration of the senior staff quarters at the NYSC Permanent Orientation Camp, Ikare-Akoko, Ondo.\nIbrahim said, “Let me warn you against using social media to disparage government policies.\n“This is part of the reasons you have been enrolled on the National Health Insurance Scheme (NHIS),” he said.\n“I want you to reciprocate the kind gesture and welcome development from the government and contribute your quota at your various places of primary assignment and host communities.”"
  },
  {
    "headline": "Nigerian Youth Service Scheme, NYSC Warns Corps Members Against Criticising Buhari Government On Twitter, Facebook, Others",
    "summarized_story": "The Director-General of National Youth Service Corps (NYSC), Maj.-Gen. Shuaibu Ibrahim, has warned corps members against criticising the policies of President Muhammadu Buhari’s government on social media.\nIbrahim on Wednesday gave the warning during the inauguration of the senior staff quarters at the NYSC Permanent Orientation Camp, Ikare-Akoko, Ondo.\nIbrahim said, “Let me warn you against using social media to disparage government policies.\n“This is part of the reasons you have been enrolled on the National Health Insurance Scheme (NHIS),” he said.\n“I want you to reciprocate the kind gesture and welcome development from the government and contribute your quota at your various places of primary assignment and host communities.”"
  },
  {
    "headline": "Lawless Nigeria’s Secret Police, DSS, Illegally Detains Corps Member In Ondo, Denies Family Members, Lawyer Access To Him",
    "summarized_story": "A young man who is currently undergoing his National Youth Service Corps (NYSC) programme in Ekiti State, Olupona Olusegun Adewale has been arrested by operatives of the Department of State Services (DSS).\nSaharaReporters gathered that Adewale was on March 24, 2022 arrested at a branch of Union Bank in Akure, Ondo state.\nIt was learnt that the young man has been denied access to his lawyers and family members by the DSS since his arrest.\nSpeaking to SaharaReporters, human rights lawyer, Tope Temokun accused the secret police of disrespecting the corps member’s rights as if the agency is above the constitution of the land.\n2004 and the statutorily known as State Security Services (SSS), but self-styled itself as the Department of State Services (DSS),” the lawyer said."
  },
  {
    "headline": "EXTRA: N547k to Ghana, N920k to Kenya -- travel agency unveils relocation package for Nigerians",
    "summarized_story": "Aero hub travel and tours, a travel agency, says it is offering a relocation package for Nigerians to Ghana and Kenya.\nIn a flyer found online, the agency said it offers options of air and land travel to Ghana which costs N547,800 and N470,800 respectively.\nAdvertisementAccording to the agency, relocation services to Kenya costs N920,500.\nIt said the money covers flight tickets, five-day hotel accommodation, airport transfer, rent and visa fee.\nHe added that relocation to Ghana could be done on the same day of payment."
  },
  {
    "headline": "EXTRA: N547k to Ghana, N920k to Kenya -- travel agency unveils relocation package for Nigerians",
    "summarized_story": "Aero hub travel and tours, a travel agency, says it is offering a relocation package for Nigerians to Ghana and Kenya.\nIn a flyer found online, the agency said it offers options of air and land travel to Ghana which costs N547,800 and N470,800 respectively.\nAdvertisementAccording to the agency, relocation services to Kenya costs N920,500.\nIt said the money covers flight tickets, five-day hotel accommodation, airport transfer, rent and visa fee.\nHe added that relocation to Ghana could be done on the same day of payment."
  },
  {
    "headline": "Inside Oyo community where snakebites are causing avoidable deaths",
    "summarized_story": "We rushed her to the UCH facility immediately, and we were told that they were expecting someone.\nFor Okewole Muritala, aged 60, another maize and millet farmer, the unavailability of workers at the UCH facility worsened the situation.\nSNAKEBITE TREATMENT CENTRE DESERTEDThe comprehensive health centre in Sepeteri is under the administration of the University College Hospital (UCH), Ibadan.\nThe facility also consists of a snakebite treatment centre, which is now deserted and surrounded by bushes.\nN24M ALLOCATED FOR SEPETERI SNAKEBITE CENTREWhile the centre sits idle, according to the 2021 budget, a total of N24,295,265 was allocated for the “construction and equipping of snakebite treatment centre in Sepeteri, Oyo state”."
  },
  {
    "headline": "Inside Oyo community where snakebites are causing avoidable deaths",
    "summarized_story": "We rushed her to the UCH facility immediately, and we were told that they were expecting someone.\nFor Okewole Muritala, aged 60, another maize and millet farmer, the unavailability of workers at the UCH facility worsened the situation.\nSNAKEBITE TREATMENT CENTRE DESERTEDThe comprehensive health centre in Sepeteri is under the administration of the University College Hospital (UCH), Ibadan.\nThe facility also consists of a snakebite treatment centre, which is now deserted and surrounded by bushes.\nN24M ALLOCATED FOR SEPETERI SNAKEBITE CENTREWhile the centre sits idle, according to the 2021 budget, a total of N24,295,265 was allocated for the “construction and equipping of snakebite treatment centre in Sepeteri, Oyo state”."
  },
  {
    "headline": "FACT CHECK: Is it true Nigeria loses 80% of oil production to theft as claimed by Adeboye?",
    "summarized_story": "Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), has claimed the government confirmed that 80 per cent of Nigeria’s oil production is lost to theft.\nLast month, Tony Elumelu, chairman of the United Bank for Africa (UBA) Plc, had claimed 95 per cent of oil production is lost to oil thieves.\nVERDICTAdvertisementThe claim that the government has backed the assertion that 80 per cent of Nigeria’s oil production is lost to oil theft is FALSE.\nBased on the regulator’s record, only 7.6 percent of crude oil is lost to theft.\nAdvertisementCLAIM TWO: MORE THAN 90 PER CENT OF NIGERIA’S REVENUE USED TO REPAY DEBTAccording to Adeboye, more than 90 per cent of Nigeria’s oil revenue is being used to service the country’s debt."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "CBN fines 3 banks $1.9 million for crypto trading",
    "summarized_story": "The Central Bank of Nigeria (CBN) has fined 3 of the country’s commercial banks for flouting a cryptocurrency trading restriction levied a year ago.\nThe 3 banks, Stanbic IBTC, Access Bank, and United Bank for Africa (UBA) were fined a total of ₦800 million (~1.9 million) for operating accounts used for crypto trading.\nStandard Bank Group Ltd was fined ₦200 million (~$481,000) for 2 accounts alleged to have been used for crypto transactions.\nLike most countries like China that have restricted crypto trading, CBN cited financial safety as the reason for the ban.\nSo Nigerians can still buy and trade crypto, just not through any Nigerian bank or fintech."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Buhari seeks revision of 2022 MTEF as budget deficit increases to N7.35trn",
    "summarized_story": "President Muhamadu Buhari has written to the House of Representatives, requesting the revision of the 2022 Medium-Term Expenditure Framework (MTEF) upon which this year’s budget is hinged.\nBuhari in a letter read by Femi Gbajabiamila, Speaker of the House at resumed plenary on Thursday said, the revision becomes necessary, as the 2022 budget deficit is projected to increase to N7.35 trillion representing 3.99 percent of the Gross Domestic Product (GDP).\nThe President said in the letter that the increment in the budget deficit will be financed by new borrowings from the domestic market.\n“The total budget deficit is projected to increase by N965.42 billion to N7.35 trillion representing 3.99 percent of the GDP.\nThe increment in the deficit will be financed by new borrowings from the domestic market."
  },
  {
    "headline": "Edo ramps up efforts to tackle Lassa fever, confirms 176 cases – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has recorded 176 cases of Lassa fever since the outbreak of the disease in the state, with the government stepping up efforts to contain the epidemic.\nThe Edo Commissioner of Health, Prof. Obehi Akoria, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nProf. Akoria said Etsako West and Esan West Local Government Areas are the worst hit by the disease.\nIf properly run, primary healthcare facilities will become the gateway and bedrock of quality healthcare for the people of Edo State.\nWe will make Primary Healthcare Centres (PHCs) work in the state.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki receives new AIG Zone 5, urges collaboration to end communal clashes, land disputes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, received the new Assistant Inspector-General of Police, Zone 5 Command Headquarters, Benin, AIG Lawan Tanko Jimeta, charging him to collaborate with the state government to resolve communal clashes and land disputes in the State.\nThe governor noted that Jimeta was a commissioner of police in Edo before he was promoted and posted out of the state.\nHe noted, “I am happy that you are back and will help us deal with the lingering land crisis in the state.\nSince you left, the issues of communal clashes and land disputes have increased astronomically.\nThe security situation in Edo State is relatively calm and we can’t thank the police enough for ensuring peace in the state."
  },
  {
    "headline": "Shaibu mourns renowned FIFA Referee, Festus Okubule – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Deputy Governor, Rt.\nComrade Philip Shaibu, has joined the football world to mourn the passing of FIFA – graded Nigerian Referee, Festus Bolaji Okubule, alias ‘Show Boy’.\nIn a condolence message to the deceased family and personally signed, Shaibu described the late Okubule as “an international referee who scored many firsts in the history of Nigerian football”.\nThe Deputy Governor went further to say that: “It is on record that he was the first FIFA – badged Referee in Nigeria; first Nigerian Referee to officiate at both the Nations and World Cup,as well as a former National President of the Nigerian Referee Association ( NRA).\n” Let me commiserate with his immediate family,the Nigerian Football Association, the Nigerian Referee Association and indeed, the football world for this irreparable loss."
  },
  {
    "headline": "Cross-Border Drug Trafficking: NDLEA Nabs Queen Of Drug cartel In Taraba, Adamawa – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLagos – The National Drug Law Enforcement Agency (NDLEA) has caught a big fish as a notorious queen of drug cartel supplying psychoactive substances to traffickers in Taraba state, Lami Mai Rigima nabbed months after being on their wanted list.\nAccording to the NDLEA spokesman, the search for Lami began in October 2021 following the arrest, prosecution and conviction of a drug dealer, Abdullahi Madaki, 50.\nAfter serving his brief jail sentence, Madaki returned to the illicit trade with Lami still as his supplier.\nBabafemi stressed, “He was arrested at Garden city, Mubi, Mubi North LGA on Tuesday 5th April while preparing to supply his customers who came from Republic of Cameroon.\n“At least, 172 kilograms of cannabis was recovered from two suspects: Zaidu Mohammed Kamba and Hussaini Dauda in Kamba area of Kebbi state on Monday 4th April by NDLEA operatives."
  },
  {
    "headline": "‘Terrorists collected N100m in cash before releasing Bank of Agric MD’ – Bukarti",
    "summarized_story": "Making the revelation about the ransom payment in a tweet via his twitter handle, @bulamabukarti, on Thursday, Bukarti, said “A family source confirmed to me that N100m, in cash, was paid for the release of the MD of Bank of Agric.\nThe crazy money terrorists are making in Nigeria!\nIt’s sad.”A family source confirmed to me that N100m, in cash, was paid for the release of the MD of Bank of Agric.\nThe crazy money terrorists are making in Nigeria!\nOne of them, who spoke in Hausa, said the MD was released due to his age and in the spirit of Ramadan."
  },
  {
    "headline": "Excitement as Zenith Bank shareholders get N97.33bn as dividends",
    "summarized_story": "The shareholders of Zenith Bank Plc, Nigeria’s leading lender, have approved a proposed final dividend of N97.33 billion for the financial year ended December 31, 2021.\nThe bank’s shareholders gave their approval at the 31st annual general meeting (AGM) of the bank held on Wednesday in Lagos.\nThe chairman of Zenith Bank, Mr Jim Ovia, thanked the shareholders for their unflinching loyalty, which has enabled the bank to rise to the pinnacle of the nation’s financial services industry, and assured them of the bank’s commitment to consistently deliver superior value to them.\nAlso, the president of the Association of the Rights of Nigerian Shareholders (AARNS), Dr Faruk Umar, said, “The bank is doing very well.\nThis was on the back of a 23 per cent YoY growth in non-interest income from N251.7 billion to N309 billion and a two per cent YoY growth in interest income from N420.8 billion to N427.6 billion."
  },
  {
    "headline": "FG uses N6.2bn to teach, equip Bauchi youths to repair smart phones",
    "summarized_story": "The federal government of Nigeria has said it spent N6.2 billion to train and equip 16,820 Bauchi youths in the art of smartphone repairs to enable them to become financially self-reliant.\nThe Ministry is working with carefully selected consulting firms to provide the N-Skills training services for 6,475 unemployed youths across the Federation.\n“The 6-week training is designed to equip target beneficiaries with life, vocational and entrepreneurship skills preparatory to the work-based learning during the 6 months apprenticeship.\n“Upon completion of the training, the target beneficiaries would be provided with a Starter Packs and deployed to Master Craft Persons for a 6-month apprenticeship,” the minister noted.\nShe expressed optimism that if President Buhari approves expansion of the NSIP, the ministry will double job and wealth creation opportunities for the teeming youths of the Bauchi State."
  },
  {
    "headline": "NURTW crisis: MC Oluomo wins as Lagos govt appoints him chairman of parks management c’ttee",
    "summarized_story": "Lagos State government has appointed Musiliu Akinsanya, alias MC Oluomo as chairman of a 25-man committee set up to manage parks in the state.\nThe appointment follows Oluomo’s suspension by the national leadership of the National Union of Road Transport Workers over insubordination and misconduct.\nThe NURTW had also announced the dissolution of its Lagos council which Oluomo headed before his suspension.\nHowever, in what seems like a big win for Oluomo in the controversy, the Lagos State government has appointed him to chair a committee to oversee parks in the state in bid to restore sanity.\nRecall, that the state government on March 10 suspended NURTW operations in all parks and garages, following the tension sparked by some events in the union."
  },
  {
    "headline": "The Legacy of Comfort Lamptey in Nigeria",
    "summarized_story": "I’m so sorry for keeping you waiting; I was busy with other pressing issues in my office,” Ms Lamptey tells me with a large smile.\nTime later revealed Ms Lamptey as a trail blazer, a lady that is loved across board, emotionally intelligent and with passion for her work.\nMs Lamptey was at the forefront of advocacy against Gender-based Violence; she was very active during the lockdown when GBV was rife.\nYoung women in politics get more recognition, acceptance and support through the great works from her office.\nComfort Lamptey is the one you can proudly call ‘Mama for the girls.’Thank you for loving Nigerians and your commitment to Nigerian women and girls."
  },
  {
    "headline": "The Art of Having a Conversation",
    "summarized_story": "The dictionary describes a conversation as an informal talk between two or more people in which information and ideas are exchanged.\nThis will enable you to determine if a conversation is safe or unsafe.\nTier 1: Small TalkMovies, sports, the weather, food, pop culture and music are all usually safe topics anywhere and with anybody.\nLearn about these topics so that at any given time you can hold a good conversation on any of them.\nConversation Killers· Why aren’t you getting married or having kids?"
  },
  {
    "headline": "WASH: UK Foundation Takes Campaign To Borno, Yobe Schools",
    "summarized_story": "To enhanced safe practices around Water, Sanitation and Hygiene (WASH) among students in North-East schools, Jose Foundation UK, an independent child-centred not-for-profit organisation has commenced sensitisation campaign targeting secondary schools in Borno and Yobe States.\nJose Foundation UK in a statement on Wednesday signed by its president, Dr Martins Abhulimhen, said the foundation was committed to eradicating extreme poverty, advancing children’s rights, and ensuring girl child equality across the globe.\nThe facilitator also trained the school girls on handwashing and safe use of latrines in their schools to prevent transmission of infections.\nJose Foundation UK team led by Ms Joy Otuonye donated facemasks, washing soaps, disinfectants and other PPEs to the school girls aswell as to the school management.\nIn appreciation of the support to the school, headmistress, Muhammadu Buhari Academy, Maiduguri, Hajia Amina Mustapha Haruna, appreciatedthe leadership of Jose Foundation UK for selecting the school for the campaign."
  },
  {
    "headline": "Senate Moves To Establish Commission For Religious Harmony",
    "summarized_story": "The Senate, on Wednesday, considered a Bill to establish the National Religious Harmony Commission (NRHC).\nThe National Religious Harmony Commission (Establishment) Bill 2022, sponsored by Senator Sadiq Suleiman Umar (Kwara North), scaled second reading during plenary.\nLeading debate on the general principles of the Bill, Umar said the piece of legislation seeks to establish the NRHC to serve as an intervention to promote religious tolerance, peace and harmony in Nigeria.\n“Having realised the sensitive role religion plays in national security, peace and harmony, the Federal Government wishes to promote inter-religious harmony and understanding due to the Chequers history of religious intolerance in the Nigerian polity,” Senator Umar said.\nHe added that the NRHC would be charged with the responsibility to review safeguards provided under the Constitution or any law for the protection of religious rights and recommend measures for their effective implementation and enforcement."
  },
  {
    "headline": "BREAKING: Soludo Sets Up 15-man Panel To Settle IPOB Crisis",
    "summarized_story": "Anambra State governor, Prof. Charles Soludo, has appointed a 15-member Truth, Justice and Peace Commission to stop the activities of the outlawed Indigenous People of Biafra (IPOB).\nThe committee is headed by human rights activist, Prof. Chidi Odinkalu, with Amb.\nFr (Msgnr); Jerome Madueke and Canon Dr. Okechukwu C. Obi-OkoyeOthers are Dr. John Out; Mr. Ngozi Odumuko; Dr. Joe Abah, Mr. Chukwuma Okpalaezeukwu; Mr. Sam Egwuatu and Prof. Joseph Ikechebelu.\nIt has a six-month timeline to conclude the assignment from the date of inauguration.\nNo date has been fixed for the inauguration of the committee."
  },
  {
    "headline": "Run, Osinbajo run: Intense pressure on VP to join presidential race",
    "summarized_story": "Despite the squelching of the rumour that Vice President Yemi Osinbajo would make a pitch for the presidency today, intense pressure continues unabated.\nA trending video by Man of Letters, shows a female pupil, who has declared a boycott of school until Osinbajo joins the race.\nUncle Yemi please!”The video as at noon Thursday has garneOne of the commenters on Twitter, @theonly1acre threatened to go on 10-day hunger strike.\n“10 days Hunger strike if Osinbajo fails to declare.Nobody should beg me”, he wrote.\n“For this remaining 61 Days, I will deny myself sleep until Prof Yemi Osinbajo declare to contest the 2023 Presidency”, he tweeted."
  },
  {
    "headline": "Kaduna man Mark Paul bags one year jail for Internet fraud",
    "summarized_story": "Aliyu of Kaduna High Court on Thursday sentenced one Mark Paul to one-year imprisonment for internet fraud.\nAliyu sentenced Paul after he pleaded guilty to the allegation of internet-related fraud brought against him by the Economic and Financial Crimes Commission (EFCC).\nEarlier, the EFCC counsel, P. C. Onyeneho, had told the court that the convict was arrested by operatives of the Commission, during sting operations.\nOnyeneho said the convict was arrested based on intelligence information received on his internet-related fraud activities.\nHe said that on receiving the Intelligence, the convict was arrested at his residence at Ungwan Rimi, Kaduna."
  },
  {
    "headline": "Former Ekiti Governor, Oni, Others Attacked By Armed Hoodlums During Political Event",
    "summarized_story": "On Wednesday, the convoy of Chief Segun Oni, the Social Democratic Party (SDP) governorship candidate in the June 18 Ekiti governorship election, was ambushed at Efon Alaaye in the state’s Efon Council area.\nOn their way to the town for the former governor’s consultative meetings with SDP members in the council area, members and supporters of the party were attacked with rifles, cutlasses, and other hazardous weapons, according to reports.\nAccording to a source, vehicles were damaged, and numerous members of the SDP party were injured to varied degrees.\n“Shortly after the Efon Local Government members and supporters of the SDP had converged at the venue to wait for the arrival of the party’s governorship candidate, Asiwaju Oni, the thugs started to shoot guns and attacked the SDP supporters with sticks and cutlasses.\nHe said the police were able to ensure there was no breakdown of law and order, adding that an investigation into the incident had begun."
  },
  {
    "headline": "Nnamdi Kanu will be released soon – Amaechi speaks ahead of Friday court ruling",
    "summarized_story": "Mbazulike Amaechi, a First Republic Minister of Aviation, has assured that Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, would soon be released.\nAmaechi gave the assurance while addressing journalists in Onitsha, Anambra State, ahead of Kanu’s court hearing slated for Friday.\nThe former Minister, last year, had led a delegation of Igbo elders to a meeting with President Muhammad Buhari over Kanu’s release.\nHowever, Amaechi said despite Buhari’s assurances of releasing the IPOB leader, Kanu is still in custody.\nAlthough, these agitations have demonstrated that only the release of Kanu will stop the agitations and we are working towards his release.”"
  },
  {
    "headline": "Train Attack: Family Of Abducted Bank Of Agriculture MD, Ali-Hassan Sold Abuja House To Raise N100m Paid As Ransom To Terrorists",
    "summarized_story": "Train Attack: Family Of Abducted Bank Of Agriculture MD, Ali-Hassan Sold Abuja House To Raise N100m Paid As Ransom To TerroristsThe Managing Director of the Bank of Agriculture, Alwan Ali-Hassan was on Wednesday set free by terrorists who attacked a Kaduna-bound train after his family paid N100 million as ransom, SaharaReporters has gathered.\nAli-Hassan and others were abducted last Monday, March 28 by terrorists who bombed the Kaduna-bound train carrying over 362 passengers.\nA source close to the family said Ali-Hassan was released after paying a ransom of N100 million.\nThey collected N100 million, though they initially asked for N200 million.\n“The house was sold for more than N100 million but we are happy he is back with us."
  },
  {
    "headline": "Lagos Shuts Medville Global Health Centre Over Negligence In Death Of Patient",
    "summarized_story": "Following an allegation of suspected negligence in the death of a 28-year-old woman during childbirth, the Lagos State government has shut down Medville Global Health Centre.\nThe Health Facility Monitoring and Accreditation Agency, which is part of the government, released a statement on Tuesday (HEFAMAA).\nTrimple Mchaty, a Twitter user, detailed on Sunday how his pregnant wife died in the hospital on March 29.\nShe did all the scans and tests required of her and everything was perfect,” Mr Mchaty, an IT consultant, wrote.\n“On Sunday noon, 28th March she chatted me that water had dropped off her leg so she called the hospital to inform them."
  },
  {
    "headline": "Jonathan breaks silence as accident kills 2 security aides",
    "summarized_story": "Former President Goodluck Jonathan has reacted to a ghastly auto crash that claimed the lives of two of his security aides.\nThe ECOWAS envoy was involved in an accident on Wednesday while on his way from the Nnamdi Azikiwe International Airport to his Abuja residence.\nThe former president, however, commiserated with the families of the deceased and prayed God to grant them eternal rest.\n“Two other officers sustained injuries in the accident which involved a car conveying the security men.\n“The office of the former President has offered condolences to the families of the bereaved and the Police High Command."
  },
  {
    "headline": "COVID-19: 11 months after, FG lifts restrictions on curfew, large gatherings",
    "summarized_story": "Eleven months after, the federal government Wednesday lifted the nationwide midnight curfew earlier imposed to contain the coronavirus pandemic.\nSimilarly, restrictions on parties, concerts, other large gatherings and related activities were also lifted.\nThe message was titled “Implementation Guidelines for Easing COVID-19 Restrictions.”The nationwide ban on social gathering and imposition of curfew were announced May 10, 2022.\nUnder the arrangement, a nationwide curfew was, among other measures, imposed from 12.00am- 4.00am to arrest further spread of the virus.\nThey said substantial improvements in adult vaccination are needed to reduce the health consequences of vaccine-preventable diseases."
  },
  {
    "headline": "Breaking: Ex-Nigerian President, Goodluck Jonathan, escapes death in auto crash",
    "summarized_story": "Immediate past Nigeria’s President Goodluck Jonathan on Wednesday escaped after cars in convoy were involved in a road crash which reportedly claimed two persons.\nThe two fatalities Blueprint gathered were his aides.\nThe accident which happened in Abuja while the former President was returning from a trip according to eyewitness spared his life.\nNo official confirmation on the latest development."
  },
  {
    "headline": "Social Media Marketing for Franchises is Meant for Women",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Radio Air Time Marketing: A New Strategy for the Economy",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Style Spy: Fashion Model Goes Casual in Faux Furr and Plaid",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Now Is the Time to Think About Your Small-Business Success",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Entrepreneurial Advertising: The Future Of Marketing",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Pastors Protest Killings In Kaduna, Demand Massive Bombing Of Bandits",
    "summarized_story": "﻿A group of pastors under the umbrella of Interfaith Alliance have staged a peaceful protest against the incessant attacks and killings by bandits in Kaduna State.\nThe protesters are asking the Federal Government to step up actions against banditry with the aim of wiping them out.\nThe protest comes days after 10 soldiers were killed and some others injured by bandits proscribed as terrorists who attacked a military base in Birnin-Gwari Local Government Area of the State.\nREAD ALSO: 10 Soldiers Killed As Bandits Attack Military Base In KadunaThe religious leaders marched through the major roads of the Kaduna metropolis with placards of various inscriptions.\nThey appealed to the Federal government to implement the submissions made by Governor Nasir El-Rufai and launch a massive and precise bombing of the bandits inside the forest."
  },
  {
    "headline": "New Revenue Formula: Buhari To Wait For Constitution Review Process",
    "summarized_story": "President Muhammadu Buhari on Thursday said he will await the final outcome of the constitutional review process before presenting the report of the review of the vertical revenue allocation formula to the National Assembly as a Bill for enactment.\n‘‘I am aware that the present revenue allocation formula has not been reviewed since the last exercise carried out in 1992,” he said.\nPresident Buhari, therefore, declared that for the nation to have a lasting review of the present revenue allocation formula, there must first be an agreement on the responsibilities to be carried out by all the tiers of Government.\nHe announced that the proposed vertical revenue allocation formula advised 45.17 per cent for the Federal Government, 29.79 per cent for State Governments and 21.04 per cent for the Local Governments.\nHe added that literature reviews were conducted on revenue allocation formula in Nigeria dating back to pre-independence period while the Commission received memoranda from the public sectors, individuals and private institutions across the country."
  },
  {
    "headline": "CBN Fines Four Banks Over N800m For Violating Crypto Policy",
    "summarized_story": "The Central Bank has fined four banks for flouting its directive on cryptocurrency transactions.\nThe CBN had in February 2021 ordered all banks to close accounts of anyone who transacts in cryptocurrency.\nREAD ALSO: My Focus At This Time Is Fighting Inflation – EmefieleThe banks include Stanbic IBTC Bank, Access Bank, United Bank for Africa and Fidelity Bank.\nAccess Bank was fined N500 million for failure to close customers’ crypto accounts; UBA was fined N100 million and Fidelity Bank was fined N14.3 million.\nNigeria, according to Paxful, a Bitcoin marketplace, accounts for the largest volume of cryptocurrency transactions outside the U.S."
  },
  {
    "headline": "MC Oluomo Appointed As Chairman Of Lagos Parks Management Committee",
    "summarized_story": "Mr Musiliu Akinsanya, popularly known as Mc Oluomo, has been appointed as Chairman of the Lagos Parks Management Committee.\nThe committee is expected to oversee the affairs of all motor parks and garages in the state.\nThe Government on March 10 had suspended NURTW operations in all parks and garages, following the tension sparked by some events in the union.\nOn Wednesday the national leadership of the NURTW had sacked MC Oluomo as the Chairman of its Lagos chapter.\nThe NURTW in March had suspended MC Oluomo over alleged misconduct, insubordination and incitement."
  },
  {
    "headline": "Forbes: Amid Economic Troubles, Wealth Of Nigerian Billionaires Grows In 2022",
    "summarized_story": "Nigerian billionaires improved their ranking in the latest Forbes World’s Billionaire List, which compiles the fortunes of the richest people in the world.\nAfrica’s richest man Aliko Dangote saw his wealth increase from $11.5 billion in 2021 to $14 billion in 2022.\nForbes, in its summary, said “war, pandemic and sluggish markets hit the world’s billionaires this year.\nChina (including Macau and Hong Kong) remains number two, with 607 billionaires worth a collective $2.3 trillion.\n“We used stock prices and exchange rates from March 11, 2022 to calculate net worths,” Forbes said of its methodology."
  },
  {
    "headline": "Wife of fmr Anambra gov Willie Obiano picks APGA nomination form for Senate",
    "summarized_story": "The wife of Anambra State’s immediate past governor, Mrs Ebelechukwu Obiano, has picked her expression of interest and nomination forms to compete for the Senate seat of Anambra North District in the 2023 general election.\nThis comes just hours after the former governor’s Chief of Staff, Mr. Primus Odili, stated his intention to compete for the same position.\nObiano announced her desire to her supporters and party faithful in early March at her home in Aguleri, Anambra East Local Government Area.\nChief Paul Iwuala, the state chairman of the APGA in Imo State, was among those who sponsored Mrs Ebelechukwu Obiano’s senatorial ambition and vowed assistance in various capacities.\n“We trust in her capacity to speak for us, protect our interest and that of our region and children, nkea bu nke anyi,” Iwuala said."
  },
  {
    "headline": "Nigerian's Spending On Cinema hits N340 Million",
    "summarized_story": "The Cinema Exhibitors Association of Nigeria says it generated N346.6 million from tickets sold across the country in March.\nThe CEAN’s National President, Patrick Lee, said the figure represented a 45 percent increase compared to the 189 million realized in March 2021.\nHe also said that there was a seven percent improvement in ticket sales in March, as N301.48 million was generated in February.\nMr. Lee listed the highest-grossing films in Nigeria in the month of March as: “The Batman”; “Uncharted”; “The Contractor”; “A Simple Lie” and “Turning Red”.\nHe said others were: The Blood Covenant, Twenty Nine, Ben from Downstairs, The Lost City, Rainy Day, The Man for the Job, Memory and Downtown Abbey: A New Era, and A Hunt for Joe."
  },
  {
    "headline": "INEC advises parties to adhere to electoral laws in conduct of primaries",
    "summarized_story": "The Independent National Electoral Commission (INEC) has advised political parties to conduct their primaries in accordance with internal democracy and electoral laws in advance of general elections.\nOkoye stated that any political party that fails to follow the provisions of the laws in the conduct of its primaries will be disqualified.\n“The commission wishes to reiterate that parties must adhere strictly to the principles of internal democracy, drawing from their constitutions, guidelines, the Electoral Act and other regulations and guidelines issued by the commission.\n“Primaries must be conducted in the various constituencies as provided in Section 84 of the Electoral Act as it is a violation of the law to conduct primaries outside the constituencies for which parties are nominating candidates.\n“The Notice of Election was published on Feb. 28, while nomination forms have been made available on the Commission’s website since March 1 for political parties to download and issue to their candidates."
  },
  {
    "headline": "INEC Warns Parties, we will bar your candidates if you infringe on the Law -",
    "summarized_story": "The Independent National Electoral Commission, says it will bar any Political Party that violates the provisions of the Electoral Act in choosing its candidate in the 2023 Elections.\nThe Election Management Body warned that Primaries must be held for each elective position a party is nominating candidates for.\nAll the activities are in line with the provisions of the Constitution of the Federal Republic of Nigeria 1999 (as amended) and the Electoral Act, 2022.\nThe Notice of Election was published on 28th February 2022, while nomination forms have been made available on the Commission’s website since 1st March 2022 for political parties to download and issue to their candidates.\nPolitical parties are enjoined to avoid acrimonious primaries that could result in unnecessary litigations that may lead to failure to nominate and field candidates for elections in some constituencies."
  },
  {
    "headline": "Oil Major Shell to Write Off up to $5bn in Assets after Exiting Russia",
    "summarized_story": "Shell has announced that it will write off between $4 and $5 billion in the value of its assets after pulling out of Russia following the country’s unprecedented invasion of Ukraine.\nThursday’s announcement offers a first glimpse at the potential financial impact to Western oil majors of exiting Russia.\nwrite-downs of receivable, expected credit losses, and onerous contracts) relating to Russia activities are expected to be $4 to $5 billion,” Shell said in a statement Thursday.\nShell was forced to apologize on March 8 for buying a heavily discounted consignment of Russian oil two weeks after Russia’s invasion.\nThe company said it would no longer purchase Russian crude oil and would shut its service stations, aviation fuels and lubricants operations in Russia."
  },
  {
    "headline": "Turkey Suspends Trial of Saudi Suspects in Khashoggi Killing",
    "summarized_story": "Turkey also sided with Qatar in a diplomatic dispute that saw Doha boycotted by Bahrain, Egypt, Saudi Arabia and the United Arab Emirates.\nIt was not clear , however, if Saudi Arabia, which has already put some of the defendants on trial behind closed doors, would open a new trial.\nHuman rights advocates had urged Turkey not to transfer the case to Saudi Arabia, arguing that justice for Khashoggi would not be delivered by Saudi courts.\nTurkey, which had vowed to shed light on the brutal killing, began prosecuting the defendants in absentia in 2020 after Saudi Arabia rejected requests for their extradition.\nA Saudi court issued a final verdict in 2020 that sentenced five mid-level officials and operatives to 20-year jail terms."
  },
  {
    "headline": "Ukraine Seeks Arms from NATO as Fight Looms on Eastern Front",
    "summarized_story": "“My agenda is very simple… it’s weapons, weapons and weapons,” Kuleba said as he arrived at NATO headquarters for talks with the military organization’s foreign ministers about Ukraine’s fight to defend itself.\nStill, he NATO Secretary-General Jens Stoltenberg urged member nations to send Ukraine more weapons, and not just defensive arms.\nHe said Russian forces also were carrying out “brutal measures” in the southern Kherson region, which they hold.\nWestern officials warned that similar atrocities were likely to have taken place in other areas occupied by Russian troops.\nRussian forces bombed hospitals, including one where 50 people burned to death, he said."
  },
  {
    "headline": "Asari Dokubo On Oil Theft In The Niger Delta",
    "summarized_story": "Illegal oil refining in Nigeria is at an all-time high and the Federal Government says about $3.27 billion worth of oil has been lost to oil theft and pipeline vandalism in the past months.\nThis is one of the many critical issues rocking the nation, as the issue of insecurity is also a major concern in the country at a time when the country is gearing up for its general elections.\nNiger Delta Activist, Asari Dokubo speaks on the Arise Interview."
  },
  {
    "headline": "Nigeria: Ex-President Jonathan Escapes Unhurt as Two Aides Die in Abuja Road Accident – Arise News",
    "summarized_story": "Former Nigeria President Goodluck Jonathan on Wednesrday escaped unhurt in a road accident in Abuja, although the crash left two of his police aides dead and others injured.\nMeanwhile, a former Vice President of Nigeria, Atiku Abubakar has commiserated with Jonathan over the occurrence, describing the deaths as shocking.\nOn his Twitter handle, Atiku stated that the story of the accident and the loss of two of Jonathan’s aides were heart-wrenching.\n“I console the immediate families of the deceased as well as President Jonathan.\nMay the souls of the departed rest in peace,” Atiku stated."
  }
]