[
  {
    "headline": "I’ve never taken antiretrovirals since my HIV diagnosis in 1992 –Medical doctor",
    "summarized_story": "Lara AdejoroDr. Patrick Matemilola has lived with HIV for almost 30 years having been diagnosed with HIV in 1992.\nSince 1992 up till today, though I still go for regular tests, I’ve never had any sickness associated with HIV.\n“What they were doing was watching your CD4 count until they can start you on drugs, which was wrong,” he narrated.\n“Someone with a CD4 count below 200 is described as having an advanced HIV disease (AHD).\n“So, if your CD4 count is falling, there are certain things you can do to help your body to maintain it."
  },
  {
    "headline": "I’ve never taken antiretrovirals since my HIV diagnosis in 1992 –Medical doctor",
    "summarized_story": "Lara AdejoroDr. Patrick Matemilola has lived with HIV for almost 30 years having been diagnosed with HIV in 1992.\nSince 1992 up till today, though I still go for regular tests, I’ve never had any sickness associated with HIV.\n“What they were doing was watching your CD4 count until they can start you on drugs, which was wrong,” he narrated.\n“Someone with a CD4 count below 200 is described as having an advanced HIV disease (AHD).\n“So, if your CD4 count is falling, there are certain things you can do to help your body to maintain it."
  },
  {
    "headline": "NARD backs MDCN’s mandatory training attachment for foreign-trained doctors",
    "summarized_story": "Lara AdejoroThe President of the National Association of Resident Doctors, Dr. Dare Ishaya has backed the new six-month mandatory attachment programme introduced by the Medical and Dental Council of Nigeria for foreign-trained medical and dental graduates, noting that it is a welcome development.\nPUNCH HealthWise had reported that the MDCN says all medical graduates who schooled abroad and seek to take its council’s assessment examination would undergo a six-month mandatory attachment programme.\nAccording to a statement posted on the council’s website, the first attachment programme will start in January and end in June 2022 while subsequent ones will be fixed accordingly.\n“Concerning the new mandatory attachment programme introduced by the MDCN for foreign-trained medical and dental graduates, we see it as a welcome development considering the high rate of failure of these graduates in their assessment exams.\n“This will also ensure quality assurance of the medical personnel imports into the country so that Nigeria doesn’t become a dumping ground for poorly trained medical and dental graduates."
  },
  {
    "headline": "NARD backs MDCN’s mandatory training attachment for foreign-trained doctors",
    "summarized_story": "Lara AdejoroThe President of the National Association of Resident Doctors, Dr. Dare Ishaya has backed the new six-month mandatory attachment programme introduced by the Medical and Dental Council of Nigeria for foreign-trained medical and dental graduates, noting that it is a welcome development.\nPUNCH HealthWise had reported that the MDCN says all medical graduates who schooled abroad and seek to take its council’s assessment examination would undergo a six-month mandatory attachment programme.\nAccording to a statement posted on the council’s website, the first attachment programme will start in January and end in June 2022 while subsequent ones will be fixed accordingly.\n“Concerning the new mandatory attachment programme introduced by the MDCN for foreign-trained medical and dental graduates, we see it as a welcome development considering the high rate of failure of these graduates in their assessment exams.\n“This will also ensure quality assurance of the medical personnel imports into the country so that Nigeria doesn’t become a dumping ground for poorly trained medical and dental graduates."
  },
  {
    "headline": "STATE OF THE NATION: Head of Service calls for accountability in leadership roles",
    "summarized_story": "By Fortune Eromosele, AbujaHead of the Civil Service of the Federation, Folashade Yemi-Esan, has called for accountability in all spheres of leadership.\nShe made the call at the third anniversary and ordination of 14 deacons/pastors of the Exousia Church of God, Abuja.\nAccording to her, God will hold accountable leaders who misuse their leadership roles in any position they find themselves.\n“We believe that God will help our country Nigeria and help our leaders to lead us right, leadership is very key in the fulfilment of a people.\nIt came to me not as a surprise but as a task and responsibilities that I have to do to sustain this position.”"
  },
  {
    "headline": "Food Crisis: Women farmers urge FG to commence food voucher intervention",
    "summarized_story": "…as 12m people in 16 Northern States face food insecurityBy Gabriel Ewepu and Fortune EromoseleWOMEN farmers under the auspices of Smallscale Women Farmers Organisation in Nigeria, SWOFON, Monday, urges Federal Government to commence food voucher intervention to tackle current food crisis in the country.\nThis was part of the recommendations contained in a communique signed by the National President, SWOFON, Mary Afan, after a ‘2 Day SmallScale Women Farmers Organisation in Nigeria (SWOFON) National Advocacy Forum’ held in Abuja from 29th – 30th November 2021.\nREAD ALSO: Tingo Mobile Plc intensifies support for female farmers“States should create budget lines to fund the implementation of the National Gender Policy in Agriculture“States should create specific annual budget lines for smallholder women farmers and ensure total release.\n“The gender unit of Federal Ministry of Agriculture and Rural Development should establish new mechanism and indicators for data collection which should be gender sensitive, specifically reflecting the concerns of smallholder women farmers.\n“Federal Ministry of Agriculture and Rural Development and State Ministries of Agriculture should provide appropriate labour-saving technologies for smallholder women farmers through the Green Imperative Project and other programmes; and Federal and State Governments should support smallholder women farmers with training on Nutrition Sensitive Agriculture at the household level.”"
  },
  {
    "headline": "Release Kanu, other illegally detained Igbo youths – Ohanaeze youths tells Buhari",
    "summarized_story": "By Chinedu AdonuOhanaeze Ndigbo Youths Worldwide, has called on President Muhammad Buhari to released the leader of Indigenous People of Biafra, IPOB, Mazi Nnamdi Kanu and 19 other Igbo youths illegally detained by security agencies.\nThe group however urged South East governors to put every mechanisms in place to encourage Igbo youths, to fully take charge of the operational runnings of local security outfit, known as Ebube Agu.\n“That the federal government, should immediately declare a state of emergency to deplorable south east roads, which has turned a death trap.\n“That Ndigbo Youth, should be given a level playing field, and empowered economically like their counterparts in other part of the country so as to enable us discharge our civic duties, and expedite action on the release of 19 Igbo youths who are being persecuted on trumped up charges.\n“That the illegal detention of our brother and son Mazi Nnamdi Kanu, be revisited and subsequently released with immediate effect,” The group demanded.”"
  },
  {
    "headline": "2023: I won’t disappoint you by not running, Bello assures Kebbi, Sokoto stakeholders",
    "summarized_story": "The Governor of Kogi State, Yahaya Bello has assured Traditional, political, religious stakeholders from Kebbi and Sokoto states that he will yield to their calls for him to run for presidency in 2023Bello stated this on Sunday when he received the delegations at the Kogi state’s government lodge in Abuja.\nThe Governor also alleged a deliberate attempt by some persons who are supposed to support President Muhammadu Buhari but pulled his government down instead.\nHe is the same person but the situation is different now.”“The president did not just inherit those troubles.\nPeople who were supposed to support him are the ones that are pulling him down by their actions, utterances, inactions and by their silence.\n“This is the situation the president found himself in from 2015 to date."
  },
  {
    "headline": "Oromoni’s death: NANS S/West set up committee, pledge to take up case",
    "summarized_story": "The student body has also pledged to take up the case and ensure that justice is done.\nThe Zonal Coordinator, Comrade Kappo Olawale Samuel, said this on Monday, adding that the committee to be set up was in line with the directive of the national leadership of the association that the zonal body should step into the matter.\n“The deceased was a student before he died and NANS is for the interest of all students and this matter must be pursued to a logical conclusion.\nA viral video shared by the family has shown how Sylvester was writhing in pain while bleeding from his mouth.\n“We also need the police to act immediately and investigate the circumstances and events that led to his death."
  },
  {
    "headline": "Matawalle restores telecommunication networks in Zamfara",
    "summarized_story": "Governor Bello Mohammed Matawalle of Zamfara State has directed the immediate restoration of telecommunication networks which were blocked in the 13 local government areas of the state due to insecurity.\nAn investigation carried out by DAILY POST revealed that eight local government areas had their telecommunication networks restored on Sunday night.\nRecall that Matawalle had earlier blocked all the telecommunication networks in the state including Gusau, the state capital, due to banditry activities ravaging the state.\nHe restored the networks in Gusau after much lamentations from residents who were complaining of economic hardship due to the telecommunication network blockage.\nKaduna residents express joy over restoration of telecommunication services"
  },
  {
    "headline": "Omicron: UK should review, rescind decision – Lai Mohammed on Nigeria’s inclusion on red list",
    "summarized_story": "The Nigerian Government has reacted to the decision of the United Kingdom, UK, to put Nigeria on its red list over the Omicron variant of COVID-19.\nLai Mohammed, the Minister of Information and Culture, expressed hope that the UK government would immediately review and rescind its decision.\nAddressing a press conference in Abuja on Monday, Mohammed said the UK government’s decision was unjust, unfair, punitive, indefensible, and discriminatory.\nAccording to Mohammed: “As you are aware, Britain has put Nigeria on its red list and banned foreign travels from our country.\n“We sincerely hope the British Government will immediately review the decision to put Nigeria on its red list and rescind it immediately."
  },
  {
    "headline": "NAAT warns FG against subsidy removal",
    "summarized_story": "Members of the National Association of Academic Technologists (NAAT) have cautioned the Federal Government against the planned total removal of subsidy from Premium Motor Spirit (PMS) from next year.\nThe group said subsidy removal at this point in time would further dwindle the nation’s economy, and put the ordinary man in a precarious situation.\nReacting to the Omicron variant of COVID-19, NAAT called on the public to be aware and conscious.\nThe NEC said it has approved and perfected an arrangement to reward and encourage academic performance across Nigerian tertiary Institutions.\nThe communique reads,”NAAT commended the Federal Government efforts in its fight against insecurity and urged them to intensify more efforts in curbing the menace."
  },
  {
    "headline": "Niger Gov commiserates with Kano over death of longest-serving kingmaker",
    "summarized_story": "Governor Abubakar Sani Bello of Niger State and Chairman, North Central Governors Forum (NCGF), has commiserated with the government and people of Kano State over the death of one of the longest-serving kingmakers in the history of Kano Emirate, Sarkin Bai Kano, Alhaji Mukhtar Adnan.\nBello, in a condolence message, described the death of the first Commissioner of Education in the old Kano State as a great loss not only to the people of the state, but the entire country.\nHe said late Alhaji Adnan served humanity with sincerity of purpose as a public servant, politician and traditional institution whose records have remained a reference point to all.\nBorn in 1926, late Alhaji Mukhtar Adnan was the first Commissioner for Education in the old Kano State and a Chief Whip in the First Republic Parliament.\nThe deceased was the District Head of Dambatta and a kingmaker who served Kano Emirate for 63 years and participated in the selection of Emir of Kano Muhammadu Inuwa (1963), Emir of Kano Ado Bayero (1963-2014), Emir of Kano Muhammad Sanusi II and the current Kano State Emir, Aminu Ado Bayero in 2020."
  },
  {
    "headline": "Omicron: Ban on African countries unfair, discriminatory – Adesina",
    "summarized_story": "President of African Development Bank (AfDB), Dr Akinwumi Adesina, on Monday said that the travel ban placed on some African countries over Omicron, the new COVID-19 variant, is “very unfair, non-scientific and discriminatory”.\nRecall that due to the newly detected coronavirus variant in South Africa, many developed countries have been shutting their doors against African countries.\nWriting on his verified twitter handle, Adesina urged the western countries to lift the travel ban on the African countries.\nHe queried why the travel ban was not placed on non-African countries where Omicron had also been found.\nSingling out African countries is very unfair, nonscientific and discriminatory."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Dowen College tragedy: Rethinking Nigerian boarding school system",
    "summarized_story": "However, with the current level of insecurity and moral decadence plaguing the Nigerian system, the Legal Assistance and Citizens Rights Initiative (LACRI) is alarmed by the recent spate of ugly incidents in the Nigeria Boarding School system.\nWe are persuaded to ask if boarding schools is still the way to go?\nBut the management of the school has maintained that he sustained injuries from a fall while playing football.\nWhatever the case, human life is sacred and the school management must be held responsible for any mishap on the grounds of the school.\nAlso is the story 11-year-old Don Davis, of Deeper Life High School, Uyo whose mother, Deborah Okezie alleged was starved and sexually assaulted for bed wetting."
  },
  {
    "headline": "JAMB changes literature texts for language subjects ahead of 2022 UTME",
    "summarized_story": "JAMB changes literature texts for language subjects ahead of 2022 UTMEJAMB says it has changed the literature texts in four language subjects and Literature- in-English, ahead of the 2022 Unified Tertiary Matriculation Examination (UTME).\nIt stated in its weekly bulletin issued on Monday that the four language subjects are Hausa, Igbo, Yoruba and Arabic.\nFor Arabic language, “The Nigerian Arabic Poems: a case study between the old and the new by Abdulwahab Shith is one of the new texts.\n- Advertisement -For Hausa language JAMB listed “Prose (Zube) Turmin Danya, Poetry (Waka) Wakokin Hausa and Drama (Wasan kwaikwayo) Abin Da Kamar Wuya 3 as the new texts.\n“New texts for the Yoruba Language include `Akojopo Alo Ijapa, Apa Kinni, by Adeboye Babalola; `Awon Oriki Orile Metadinlogbon’ by Adeboye Babalola, `Moremi Ajasoro’ by Debo Awe."
  },
  {
    "headline": "UNN: Inside the ramshackle Zik’s Flats",
    "summarized_story": "However, the most debilitating is Zik’s Flats.\n“And to think that most of the Vice-Chancellors in recent times, including the current V-C, Prof. Igwe, were occupants of Zik’s Flats makes the rumours strongly believable.\nRebuilding Zik’s Flats alone will gulp more than N5 billion and after that, you begin to charge N12, 000 or N15, 000 accommodation fees per session.\n“After my husband passed on in 1996, we started noticing that Zik’s Flats are facing gradual deterioration.\nThat Zik’s legacy will not go downThis is a very big legacy that Zik’s family will prevent from going down."
  },
  {
    "headline": "LAWSAN Board nullifies election of executive, others",
    "summarized_story": "The Board of the Law Students’ Association of Nigeria (LAWSAN) has nullified the Election and Convention, which purportedly produced Michael Arinze and other persons parading themselves as an executive, senate and appointees of the Association.\nThe Secretary to the Board of LAWSAN, Mohammed Kime, who disclosed this in a statement in Abuja, said that a new timetable for election to the National Executive Council and Legislative Arm of LAWSAN shall be released before the 20th of December 2021.\nAccording to him, the actions of the Board followed resolutions reached at its inaugural meeting held on December 2, 2021, in Abuja.\nHe said the Board also resolved that 30th day of November of every year shall be the official anniversary date of LAWSAN.\nThe Board, according to him, noted that LAWSAN is opened to all students studying law in Nigerian Accredited Universities."
  },
  {
    "headline": "Visa ban: FG demands immediate reversal",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has demanded a reversal of Britain’s travel ban on Nigerians as well as including the country on a Red List.\nMinister of Information, National Orientation and Culture, Alhaji Lai Mohammed, conveyed government’s decision at a press conference in Abuja, today.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nGovernment described the ban and Red List as unjust, discriminatory and not based on science.\nClick Here to Apply ."
  },
  {
    "headline": "Dowen College: Kalu laments death of 12 year-old Sylvester Oromoni",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has expressed sadness over the death of 12 year old student- Sylvester Oromoni (Jnr) of Dowen college, Lagos, who was reported bullied and tortured by his colleagues in school.\nKalu, while commiserating with the Oromoni family , prayed to God to grant the deceased eternal rest.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said, “I received with shock the devastating news of the death of 12 year-old Sylvester Oromoni (Jnr) of Dowen college, Lagos who was reported bullied and tortured by his colleagues in school.\n“I am also deeply pained that secondary school students have started embracing cultism and other social vices."
  },
  {
    "headline": "COVID-19: UK suspends visa issuance for Nigerians, others",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom, has suspended issuance of visas to Nigeria and other countries on its COVID-19 and associated variants red list.\n“If you apply for a visit visa in a red list country and you meet the UK Immigration Rules, your application will be paused.\nYou will not receive a decision on your visit visa application whilst red list travel restrictions remain in place.\nSeparate guidance is available for travellers entering Wales, Scotland and Northern Ireland,” the British High Commission also said.\n“If you choose to continue with your visa application, you will not receive a decision on your visit visa whilst red list travel restrictions remain in place."
  },
  {
    "headline": "8 children found dead in Lagos abandoned car",
    "summarized_story": "By Christopher OjiEight children were, yesterday afternoon, found dead in an abandoned car at Adelayo Street, Jah-Michael bus stop, along Badagry Expressway, Lagos.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nA witness said the owner of the vehicle, a woman, has been arrested by the police, while the bodies have been moved to the Badagry General Hospital.\nLagos State Police Public Relations Officer (PPRO), CSP Adekunle Ajisebutu, who confirmed the story, said :”The eight children were said to have mistakenly locked themselves in an abandoned car while playing.\nTheir bodies have been recovered and deposited at the Badagry General Hospital’s morgue for autopsy, so as to determine the actual cause of death."
  },
  {
    "headline": "7 doctors face disciplinary panel for professional misconduct",
    "summarized_story": "From Fred Ezeh, AbujaSeven health professionals comprising of medical doctors and dentists would appear before the Medical and Dental Practitioners Disciplinary Tribunal (MDPDT) today, for alleged professional misconduct, even as trial for 10 others accused of professional misconduct would continue.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe exercise which will run till Thursday, will provide opportunities for the accused doctors to defend themselves either in person or be represented by a legal counsel.\nMDCN had advised patients, who are unsatisfied with the professional conduct of the medical doctors, to always approach the council using various communication channels to report such cases and expect justice.\nMDCN disciplinary book recommended several punishments for erring doctors, including outright withdrawal of practicing licence of any doctor convicted of gross negligence or other forms of professional misconduct."
  },
  {
    "headline": "Anger, Dismay Across Nigeria over UK’s Red Listing of Country",
    "summarized_story": "“The UK did not talk to the Nigerian government about the red list until one hour before the announcement.\nIt was not until a full month after (around 23 April 2021) that the UK government added India to the red list.\n“If you apply for a visit visa in a red list country and you meet the UK Immigration Rules, your application will be paused.\nYou will not receive a decision on your visit visa application whilst red list travel restrictions remain in place.\nIf you already hold a valid visit visa and are intending to travel to England as a visitor from a red list country, you will not be allowed to enter,” the statement added."
  },
  {
    "headline": "Outrage as ECOWAS’ Report Uncovers ISWAP’s N18bn Terror Financing Network",
    "summarized_story": "The federal government was criticised for its failure to track the movement of funds by the terrorist groups, Boko Haram and ISWAP, through the country’s financial system.\nThe organisation is a specialised institution of ECOWAS responsible for strengthening the capacity of member states towards the prevention and control of money laundering and terrorist financing in the region.\nThe report estimated ISWAP’s revenues, which it put at $36 million (N18 billion) annually, to be larger than that of Boko Haram.\nSpeaking on the GIABA report, Executive Director of the Rule of Law and Advocacy Centre (RULAAC), Mr. Okechukwu Nwangwuma, deplored the federal government’s failure to contain terror financing.\n“There is also a challenge of making available information on what government has done with countering terror financing.”Umar also acknowledged that though government had taken steps to address the issue of terror financing, gaps still remained."
  },
  {
    "headline": "Onyeagwu Emerges ‘CEO of the Year,’ Zenith Bank Wins Four Other Awards",
    "summarized_story": "*Named ‘Most Responsible Organisation in Africa’Dike OnwuamaezeGroup Managing Director/Chief Executive Officer (CEO) of Zenith Bank Plc, Mr. Ebenezer Onyeagwu, has emerged ‘CEO of the Year’ for a second consecutive year at the Sustainability, Enterprise and Responsibility (SERAS) CSR Africa Awards held in Lagos at the weekend.\nUnder his leadership, the Zenith Bank’s social investments totalled N3.285 billion in 2020, representing nearly two per cent of the bank’s profit after tax, a statement explained.\nThe judges found Onyeagwu worthy for his commitment to promoting sustainability and responsible business practices in Nigeria, through his frontal leadership of sustainability in Zenith Bank, thereby enabling best industry practices in the banking sector.\nThe statement added, “The bank also ensures the assurance of its sustainability report by reputable independent third parties.\nThe Sustainability, Enterprise and Responsibility Awards (SERAS) is an initiative of TruCSR, which celebrates and promotes investments by corporate organisations in the society through CSR and sustainability initiatives."
  },
  {
    "headline": "NNPC Remitted N511.66bn Out of Projected N2.09tn to Federation Account in 10 Months",
    "summarized_story": "The data was part of the national oil company’s November presentation to the Federation Account Allocation Committee (FAAC).\nThe section of the document tagged, “2021 Monthly Actual NNPC Oil and Gas Revenue and Distribution to FAAC”, indicated that for the entire year, NNPC had projected a total of N2.511 trillion as payment to the three tiers of government.\nFayemi added that the failure of the NNPC to remit funds into the federation account was responsible for the decision of his administration, for instance, to slash the subvention of Ekiti State University (EKSU).\nIn January, the national oil company paid N90.8 billion of the N209.3 billion projection; in February it remitted N64.16 billion and in March, the NNPC paid N41.1 billion into the federation account.\nThings appeared better in August, when NNPC remitted N80 billion to the joint account, but it fell again to N67.533 billion in September, before slumping to N14.85 billion in October."
  },
  {
    "headline": "2023: Persuade Other Zones for Presidency, Anyim, Ezeife Urge S’East",
    "summarized_story": "They said this on Saturday at the United For Better Nigeria Initiative (UBNI) National Convention in Abuja.\nHowever, Anyim, while speaking at the UBNI convention, said it was neither a right nor legal for the southeast to demand Igbo presidency in 2023.\nHe said the Igbo had to persuade other zones to support their dream if they would produce a president in 2023.\nMkparu said UBNI, a non-partisan political advocacy group, which had been involved in enlightenment for a united Nigeria deemed it fit to beam searchlight on the issue.\nNigeria has the capacity to hold everybody, Nigeria has the intellectuals, Nigeria has all it takes to lift the county."
  },
  {
    "headline": "BREAKING: Myanmar Court Sentences Former Leader, Suu Kyi To Four Years In Jail",
    "summarized_story": "A court in Myanmar on Monday sentenced the country’s deposed leader, Aung San Suu Kyi, to four years in jail, according to the AFP.\nAung San Suu KyiZaw Min Tun said she received two years in prison on each of the two charges.\nReuters and the Associated Press, citing sources familiar with the proceedings, also said Suu Kyi and Myint were sentenced to four years in prison each.\nThe trial in Naypyidaw has been closed to the media, while the military has barred Suu Kyi’s lawyers from communicating with the media and the public.\nSuu Kyi, who had spent 15 years in house arrest under a previous military government, denies all the charges."
  },
  {
    "headline": "BREAKING: Myanmar Court Sentences Former Leader, Suu Kyi To Four Years In Jail",
    "summarized_story": "A court in Myanmar on Monday sentenced the country’s deposed leader, Aung San Suu Kyi, to four years in jail, according to the AFP.\nAung San Suu KyiZaw Min Tun said she received two years in prison on each of the two charges.\nReuters and the Associated Press, citing sources familiar with the proceedings, also said Suu Kyi and Myint were sentenced to four years in prison each.\nThe trial in Naypyidaw has been closed to the media, while the military has barred Suu Kyi’s lawyers from communicating with the media and the public.\nSuu Kyi, who had spent 15 years in house arrest under a previous military government, denies all the charges."
  },
  {
    "headline": "BREAKING: Secret Police, DSS Invite Ex-Kogi Commissioner Over Comment On Sheikh Gumi's Visit To Okunland",
    "summarized_story": "The former commissioner said his comment on Gumi's visit to meet with foreign Fulani in the state was based on grapevine sources.\nHe said: \"I have been invited to the DSS State office in Lokoja slated for Tuesday, 7th December 2021 at 10 am\"The DSS has not formally accused or charged me for anything.\nIn the last six years, an influx of foreign Fulani into Okunland has taken place with disastrous consequences for our People.\nIn Okun land, many areas have been occupied illegally by foreign Fulani, (foreign to us and Nigeria.\nWe encountered them in Okun land and they confessed to coming from Mali in one instance)."
  },
  {
    "headline": "BREAKING: Secret Police, DSS Invite Ex-Kogi Commissioner Over Comment On Sheikh Gumi's Visit To Okunland",
    "summarized_story": "The former commissioner said his comment on Gumi's visit to meet with foreign Fulani in the state was based on grapevine sources.\nHe said: \"I have been invited to the DSS State office in Lokoja slated for Tuesday, 7th December 2021 at 10 am\"The DSS has not formally accused or charged me for anything.\nIn the last six years, an influx of foreign Fulani into Okunland has taken place with disastrous consequences for our People.\nIn Okun land, many areas have been occupied illegally by foreign Fulani, (foreign to us and Nigeria.\nWe encountered them in Okun land and they confessed to coming from Mali in one instance)."
  },
  {
    "headline": "Divorce-Seeking Housewife Assaulted, Brutalised By Defunct SARS Officers On Husband's Instructions In Adamawa",
    "summarized_story": "A divorce-seeking housewife, Lantana Isiyaku, has allegedly been brutalised by two former Special Anti-Robbery Squad (SARS) operatives, in Adamawa State.\nIsiyaku, 25, was alleged to have been manhandled by Inspector Bidas and one other officer, yet to be identified, on the instruction of her husband, Umar Ibrahim.\nIn the suit, Isiyaku prayed the court to terminate her marriage to Ibrahim, who was also married to two other women.\nThe court ruled and ordered the estranged wife (Isiyaku), who was living with her parents to return to her matrimonial home.\nKolone further alleged that \"she was arrested by Inspector Bidas, tortured, slapped, kicked and left with swollen hand(s).\""
  },
  {
    "headline": "Boss Mustapha: We have enough COVID vaccines to cover 70% of Nigerians",
    "summarized_story": "Boss Mustapha, secretary to the government of the federation (SGF), says Nigeria has enough vaccines that can cover over 70 percent of the country’s population before the end of 2022.\nAdvertisementMustapha said this at the national COVID-19 summit which was held at Muhammadu Buhari Conference Centre in Abuja.\nThe summit was tagged ‘Pushing Through the Last Mile to End the Pandemic and Build Back Better’.\nHence the need to adopt an ambitious (but cautious) agenda to end the COVID-19 pandemic by the year 2022.\n“Nigeria has invested in enough vaccines that can cover over 70% of our population before the end of 2022."
  },
  {
    "headline": "Boss Mustapha: We have enough COVID vaccines to cover 70% of Nigerians",
    "summarized_story": "Boss Mustapha, secretary to the government of the federation (SGF), says Nigeria has enough vaccines that can cover over 70 percent of the country’s population before the end of 2022.\nAdvertisementMustapha said this at the national COVID-19 summit which was held at Muhammadu Buhari Conference Centre in Abuja.\nThe summit was tagged ‘Pushing Through the Last Mile to End the Pandemic and Build Back Better’.\nHence the need to adopt an ambitious (but cautious) agenda to end the COVID-19 pandemic by the year 2022.\n“Nigeria has invested in enough vaccines that can cover over 70% of our population before the end of 2022."
  },
  {
    "headline": "Aung San Suu Kyi, ousted Myanmar leader, jailed for four years",
    "summarized_story": "She was found guilty of inciting dissent and breaking COVID restrictions under a natural disasters’ law.\nSuu Kyi has been in detention since the country’s military toppled her civilian government on February 1.\nThe coup came less than 10 years after the military handed over to a civilian government.\nAdvertisementMyanmar had been under military control until democratic reforms began in 2011."
  },
  {
    "headline": "Aung San Suu Kyi, ousted Myanmar leader, jailed for four years",
    "summarized_story": "She was found guilty of inciting dissent and breaking COVID restrictions under a natural disasters’ law.\nSuu Kyi has been in detention since the country’s military toppled her civilian government on February 1.\nThe coup came less than 10 years after the military handed over to a civilian government.\nAdvertisementMyanmar had been under military control until democratic reforms began in 2011."
  },
  {
    "headline": "NFIU: Report on ISWAP moving N18bn through Nigerian banks stale",
    "summarized_story": "The Nigerian Financial Intelligence Unit (NFIU) says a report that N18 billion was moved by the Islamic State in West African Province (ISWAP) through the country’s financial system is stale.\n“A study estimated ISWAP’s revenues, deemed larger than Boko Haram’s, at up to USD$36m annually, much of it from trading activity and taxation in the Lake Chad region,” the report said.\nAdvertisementBut in a statement on Monday, Ahmed Dikko, NFIU chief media analyst, said the report by the organisation is based on a 2019 country evaluation report “which is literally stale and irrelevant today”.\n“The ECOWAS body released its report to justify putting Nigeria’s Financial System under enhanced review process alongside other countries in the Sahel.\n“All our neighbours have proofs of our exchange of terrorist financial intelligence with them real time.”"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "#Tech4Disabled, January 2022 and 5G in Nigeria, Flex Finance’s pre-seed",
    "summarized_story": "Share this article:Hi there,Today I’m discussing:A tech-inclusive world for Africa’s disabled personsNigeria and its 5G launch progress?\nWith MTN Nigeria’s recent share sales, continuing profits recorded by telcos operating in Nigeria, and a 5G auction coming up, 2022 is shaping up to be an exciting year for the telecommunications space in the country.\nNigeria-based Flex Finance raises pre-seedFlex Finance team.\nSource: SuppliedSpend management startup, Flex Finance has announced a six-figure pre-seed round to build the Ramp of Africa.\nWith an official launch in March 2021, Flex Finance currently operates an all-in-one spend management application equipped with a digital wallet to help African businesses efficiently perform trackable spending."
  },
  {
    "headline": "4 tech innovations that can make life easy for physically challenged Africans",
    "summarized_story": "However, the World Health Organisation (WHO) puts the number of people living with disabilities at 300 million.\nThe UN also affirms that most Africans living with disabilities are excluded from school and work opportunities.\nIn celebration of the International Day of the Disabled, we are looking at four tech innovations that could help people living with disabilities globally.\nRecalling when a group of visually impaired persons was testing the Eone, Kim was asked if the watch was made specifically for the blind.\nMore attention needs to be paid to assistive tech but, more importantly, persons with disabilities."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Nigerians’ bid to migrate abroad don’t match visas granted",
    "summarized_story": "For instance, as of September 2021, Canada has issued 22,867 temporary resident visas to Nigerians and 9,215 permanent resident visas.\nBy 2019, applications from Nigerians for permanent resident visas increased to 18,774 of which 12,699 (67.6 percent) were granted visas.\nIn 2018, 31,865 temporary resident visas were issued to Nigerians, while 8,077 got permanent resident visas.\nThe number increased in 2019 (within the same period ) to 32,431 for temporary resident visas, and 10,290 permanent resident visas.\nOf the visas granted so far, only 7,877 were for work-related visas and 288 were refused."
  },
  {
    "headline": "Nigerians’ bid to migrate abroad don’t match visas granted",
    "summarized_story": "For instance, as of September 2021, Canada has issued 22,867 temporary resident visas to Nigerians and 9,215 permanent resident visas.\nBy 2019, applications from Nigerians for permanent resident visas increased to 18,774 of which 12,699 (67.6 percent) were granted visas.\nIn 2018, 31,865 temporary resident visas were issued to Nigerians, while 8,077 got permanent resident visas.\nThe number increased in 2019 (within the same period ) to 32,431 for temporary resident visas, and 10,290 permanent resident visas.\nOf the visas granted so far, only 7,877 were for work-related visas and 288 were refused."
  },
  {
    "headline": "Nigerian nurses joining UK workforce hit all-time high",
    "summarized_story": "BusinessDay’s analysis of data from the register of the Nursing and Midwifery Council (NMC) of the United Kingdom, shows that a record 1,334 Nigerian trained nurses joined the workforce between March and September 2021.\nFor context, within the same period of 2017, only 23 Nigeria-trained nurses joined the UK workforce.\nWith the recent addition, there are now 5,612 Nigeria-trained nurses in the UK, a 51 percent increase within four years from 2,792 as of March 2017.\nIn February, BusinessDay had reported a four-year high increase in Nigeria-trained nurses joining the UK workforce, but as data continues to show, the exodus is likely to continue and even quicken.\nHowever, by March 2021, when the UK NMC had data for exactly a year after, 685 Nigerian nurses had joined."
  },
  {
    "headline": "Obaseki to spend N51bn on physical infrastructure, construction of roads, bridges in 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the state plans to expend N51billion in 2022 for the development and sustenance of physical infrastructure, as well as the construction and rehabilitation of roads and bridges.\nThe governor, who recently presented the 2022 budget proposal to Edo State House Assembly in Benin City, said N30bn will be spent on improving roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nReassuring the completion of all ongoing road projects in the state, Obaseki, reassured residents that his government remains committed to infrastructural development across the state.\nIn the new financial year, we have budgeted N30bn to improve roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nThese include roads linking towns as well as small township and inner-city roads."
  },
  {
    "headline": "Obaseki intensifies efforts at human capital devt, begins 5-month business training for youths, women – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has launched a 5-month training on business development and sustainability for youths and women in oil-producing communities in the state, in line with the government’s focus on human capacity development.\nHe said the government’s commitment to human capacity development necessitated the creation of the Human Capital Development Department as approved by the Board of EDSOGPADEC.\nBut the new focus of EDSOGPADEC, in line with its core mandate, is now human capital development.\nThis is also in line with the Governor Godwin Obaseki-led administration’s Making Edo Great Again (MEGA) Agenda.\nThe Director, Human Capital Development Department, Mr. Godwin Ogieriakhi said the empowerment programme cuts across the three (3) oil-producing local governments of the State, with 50 persons drawn from each local government area in the first phase."
  },
  {
    "headline": "Obaseki seeks int’l partners’ support to strengthen impact of agric programmes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has urged international donors to support the government in executing sustainable agricultural programmes to check food security.\nWhile commending IFAD on its impactful role across Africa, Obaseki said the assistance provided by the Fund can help leapfrog systems and institutions in Nigeria and Edo State.\nHe noted, “We have failed to create the real market for agricultural produce, economic culture, subsidizing agricultural produce and mixed pricing of exchange rate.\n“As a government, our focus is how to be serious and help address the challenges.\nAgricultural Development Programme (ADP) Office carry a lot of signboards with all sorts of assisted programmes but yet no much impact or difference has been made in agricultural production and output."
  },
  {
    "headline": "Okowa, Group Demand Justice For Slain 12-Year-Old -Dowen College Student – Nigerian Observer",
    "summarized_story": "As we continue to watch this case closely, we extend our prayers and support to the Oromoni family.\nEbilade Ekerefe National Spokesman, Ijaw Youth Council and made available to newsmen in Warri, the group said,“We watched with awe and shock the reported circumstances surrounding the death of a 12-year-old student of Dowen College in Lagos, Sylvester Oromoni Jnr.\n“The supposed injuries from the beatings led to his death, according to a Twitter user with the handle@perrisonoromoni, the boy’s cousin.\n“Late Sylvester Oromoni Jnr is a son of Ijaw land from Ogbeh-Ijoh area of Warri South-West Local Government of Delta State.\nThis story if true amounts to organizing a party around the corpse of the late Sylvester Oromoni."
  },
  {
    "headline": "Resolving 70m unbanked population will increase market participation – eTranzact",
    "summarized_story": "He said resolving the issue of 70 million Nigerians without bank accounts but with active mobile lines would advance the financial inclusion and increase more participation.\nToluwalope said that only 150 million of Nigeria’s 200 million population owned mobile phone lines, 110 million owned 150 million mobile phone lines while about 40 million had active bank verification numbers.\nToluwalope noted that financial Inclusion holds the answers to three questions that every capital market leader has which include how do we increase the participation of retail investors?\nIn the same vein, by utilising technology to democratise capital market access and participation, we can direct, expand the current digital savings and investment offerings to leverage the capital market for increased returns.\nToluwalope said regulators and other stakeholders had explored different initiatives that have been utilised to deliver financial inclusion in the past."
  },
  {
    "headline": "Gov David Umahi’s anarchic tendencies and failed presidential bid, By Abia Onyike",
    "summarized_story": "What kind of backward administration is Umahi bequeathing in Ebonyi State.\nThis is jungle justice and government of double standards as perpetrated by an anarchic ruler, a despot and brutal dictator.\nUmahi is making a mockery of the Courts in Ebonyi state and he should be called to order.\nUMAHI’S FRUSTRATIONS AND OUTBURSTS OVER ASUU LEADERSHIP IN EBSUIn continuation of his anarchic and totalitarian bullying of other independent/autonomous bodies in the polity, Gov.\nAbia Onyike is a former commissioner for information in Ebonyi State."
  },
  {
    "headline": "NNPC remits N511.66bn out of projected N2.09tn to federation account in 10 months",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited remitted N511.66 billion between January and October, 2021 to the federation account, about 25 per cent less than the N2.09 trillion expected to be remitted for the period.\nThe data was part of the national oil company’s November presentation to the Federation Account Allocation Committee (FAAC).\nFayemi added that the failure of the NNPC to remit funds into the federation account was responsible for the decision of his administration, for instance, to slash the subvention of Ekiti State University (EKSU).\nIn January, the national oil company paid N90.8 billion of the N209.3 billion projection; in February it remitted N64.16 billion and in March, the NNPC paid N41.1 billion into the federation account.\nThings appeared better in August, when NNPC remitted N80 billion to the joint account, but it fell again to N67.533 billion in September, before slumping to N14.85 billion in October."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Court Hears Suit Against Bauchi APC Congress December 13",
    "summarized_story": "A suit filed by Sarkin Arewa of Bauchi and a staunch member of the All Progressives Congress (APC) in the state, Alhaji Hassan Mohammed Sheriff, will be heard on December 13, 2021.\nThe matter is before Bauchi High Court 2 where Sheriff is seeking an interim injunction restraining the APC, its national caretaker chairman, education minister Adamu Adamu and APC Extended Stakeholders’ Committee from parading the newly elected officials of the party in the state as its executive officers.\nJoined in the suit as dependents are Yakubu Dogara, Bauchi State APC chairman – Babayo Aliyu Misau, APC screening and selection committee, APC Bauchi State secretary – Haruna Rikala, Mustapha Shehu Zarami, Bauchi APC Legal Adviser – Rabi’u Garba, and Bauchi State APC Treasurer –Shu’aibu Habi, and the 42 respondents.\nIn the suit filed before the court, the applicant who contested the seat of the state chairman of the party in the recent elections which saw the emergence of two paralleled chairmen, is seeking court injection against the defendants pending the hearing and determination of the substantive suit filed before the court between the parties.\nThe matter is adjourned to 13th December, 2021 for hearing."
  },
  {
    "headline": "Court Hears Suit Against Bauchi APC Congress December 13",
    "summarized_story": "A suit filed by Sarkin Arewa of Bauchi and a staunch member of the All Progressives Congress (APC) in the state, Alhaji Hassan Mohammed Sheriff, will be heard on December 13, 2021.\nThe matter is before Bauchi High Court 2 where Sheriff is seeking an interim injunction restraining the APC, its national caretaker chairman, education minister Adamu Adamu and APC Extended Stakeholders’ Committee from parading the newly elected officials of the party in the state as its executive officers.\nJoined in the suit as dependents are Yakubu Dogara, Bauchi State APC chairman – Babayo Aliyu Misau, APC screening and selection committee, APC Bauchi State secretary – Haruna Rikala, Mustapha Shehu Zarami, Bauchi APC Legal Adviser – Rabi’u Garba, and Bauchi State APC Treasurer –Shu’aibu Habi, and the 42 respondents.\nIn the suit filed before the court, the applicant who contested the seat of the state chairman of the party in the recent elections which saw the emergence of two paralleled chairmen, is seeking court injection against the defendants pending the hearing and determination of the substantive suit filed before the court between the parties.\nThe matter is adjourned to 13th December, 2021 for hearing."
  },
  {
    "headline": "We’ll Support Gov Inuwa’s Re-election – APC Chieftain",
    "summarized_story": "Gombe State All Progressives Congress (APC) chieftain, Saidu Ishiaku Babadidi, has said that the people of Gombe State are convinced with the leadership style of Governor Muhammadu Inuwa Yahaya, adding that they will support his reelection in 2023.Babadidi said Governor Yahaya has overwhelmingly performed in just a little over two years more than any governor in the history of the state and that people will not regret voting him for the second time.\n“We’ve visibly seen roads constructed within the urban and rural areas of the state, hospitals, schools and lots more,” he said.\nADVERTISEMENTHe reiterated that Governor Yahaya is the party leader in the state and those who aren’t comfortable with the scheme of things in the state are the selfish and ingrates who don’t want the progress of the state."
  },
  {
    "headline": "We’ll Support Gov Inuwa’s Re-election – APC Chieftain",
    "summarized_story": "Gombe State All Progressives Congress (APC) chieftain, Saidu Ishiaku Babadidi, has said that the people of Gombe State are convinced with the leadership style of Governor Muhammadu Inuwa Yahaya, adding that they will support his reelection in 2023.Babadidi said Governor Yahaya has overwhelmingly performed in just a little over two years more than any governor in the history of the state and that people will not regret voting him for the second time.\n“We’ve visibly seen roads constructed within the urban and rural areas of the state, hospitals, schools and lots more,” he said.\nADVERTISEMENTHe reiterated that Governor Yahaya is the party leader in the state and those who aren’t comfortable with the scheme of things in the state are the selfish and ingrates who don’t want the progress of the state."
  },
  {
    "headline": "Borno Leaders Seek Equal Distribution Of COVID-19 Vaccines",
    "summarized_story": "Religious and traditional leaders have called for equal distribution of COVID-19 vaccines especially, to people living with disabilities and the less privileged in the society.\nHe added that involvement of religious and traditional rulers in programmes of government for the pandemic will ensure adequate sensitisation towards acceptance of the vaccines, since both leaders are closer to the grassroots.\nBishop Naga who was represented by Abraham Akporue said:” Government should make the vaccine available to the less privileged and avoid politicisation of the process.\nFrom the beginning, the government would have worked with the religious leaders and the traditional leaders in discussing this issue so that it would be able to penetrate to the grassroots.\nOn the mandatory vaccination order issued to federal workers by government, Umara said the order is more of moral issue than constitutional matter, noting that it is a moral duty for citizens to abide by the order so as to curtail spread of the virus."
  },
  {
    "headline": "Emir of Kano, Gov, others hail Dangote’s contributions to Nigeria’s economy through investments",
    "summarized_story": "The Emir also commended the Kano Government, the KACCIMA and other participating companies in the 42nd Kano International Trade Fair which will close on Saturday, December 11, 2021.\nEmir Bayero said he is very happy with Dangote Group even with the world-class Refinery currently under construction saying the project is timely given the challenges the country and businesses are facing.\nAccording to him: “ We have visited the Trade Fair, and we are happy with development so far despite the economic situation around the world.\nSpeaking to newsmen, the Director-General of the KACCIMA, Mustapha M. Aliyu commended the Dangote Group for the partnership and sponsorship of the Trade Fair.\nDangote Group urged participants who seek to do business with any of the company’s subsidiaries, to avail themselves of such opportunities through Special Desks at its pavilion."
  },
  {
    "headline": "Emir of Kano, Gov, others hail Dangote’s contributions to Nigeria’s economy through investments",
    "summarized_story": "The Emir also commended the Kano Government, the KACCIMA and other participating companies in the 42nd Kano International Trade Fair which will close on Saturday, December 11, 2021.\nEmir Bayero said he is very happy with Dangote Group even with the world-class Refinery currently under construction saying the project is timely given the challenges the country and businesses are facing.\nAccording to him: “ We have visited the Trade Fair, and we are happy with development so far despite the economic situation around the world.\nSpeaking to newsmen, the Director-General of the KACCIMA, Mustapha M. Aliyu commended the Dangote Group for the partnership and sponsorship of the Trade Fair.\nDangote Group urged participants who seek to do business with any of the company’s subsidiaries, to avail themselves of such opportunities through Special Desks at its pavilion."
  },
  {
    "headline": "Anxiety as ASUU’s ultimatum to FG ends, lecturers say demands unmet",
    "summarized_story": "But the union told one of our correspondents that government had only met one of its demands.\nThe Federal Government promised to pay N30bn as revitalisation fund to universities.\nIt also promised to pay N22.1bn earned allowances to university workers.\nWhen contacted on Saturday night, ASUU president told one of our correspondents that government had not met all the demands.\nThe payment will be paid as soon as due process is concluded by the ministry of finance."
  },
  {
    "headline": "Anxiety as ASUU’s ultimatum to FG ends, lecturers say demands unmet",
    "summarized_story": "But the union told one of our correspondents that government had only met one of its demands.\nThe Federal Government promised to pay N30bn as revitalisation fund to universities.\nIt also promised to pay N22.1bn earned allowances to university workers.\nWhen contacted on Saturday night, ASUU president told one of our correspondents that government had not met all the demands.\nThe payment will be paid as soon as due process is concluded by the ministry of finance."
  },
  {
    "headline": "Shekarau visits Tinubu amidst battle with Ganduje for Kano APC",
    "summarized_story": "While the G7 faction elected Haruna Danzago as the chairman of its executive, Abdullahi Abbas was elected to lead the Ganduje faction of the party.\nGanduje and members of his faction of APC are believed to be strong supporters of the presidential ambition of Tinubu.\nThe expectation was that Ganduje will bring in the strength of Kano APC to support Tinubu when the push comes to shove on the selection of APC presidential candidate.\nIndeed, a national newspaper had on Saturday reported that the judgment giving control of Kano APC to Shekarau was a setback for presidential ambition of Tinubu.\nThe recognition of Danzago as Kano APC Chairman by Fayemi, who is also said to be interested in the 2023 presidential ticket of APC was widely reported in national newspapers."
  },
  {
    "headline": "Fani-Kayode replies 'sad words' from Buba Galadima",
    "summarized_story": "Femi Fani-Kayode has given his opinion on the statements credited to Buba Galadima over the declaration of bandits as terrorists.\nThose who declared these bandits as illegal or outlaws suggest that they know who the bandits are and have not done anything about them.\nGaladima said: “How about those who went to the President to request the release of Nnamdi Kanu who is the professed leader of IPOB?\nFan-Kayode, however, took to his Facebook page to reply to his “erudite old friend.”He wrote: “Sad to hear these words from an ordinarily profound and erudite old friend like Buba.\nI guess in his world we should call the bandits angels and saints instead of calling them terrorists.”"
  },
  {
    "headline": "Buhari Not Loyal To Nigeria, Will Retire To Niger Republic In 2023 – Ohanaeze Chieftain, Ibegbu",
    "summarized_story": "President Muhammadu Buhari, according to Chuks Ibegbu, a former National Publicity Secretary of the ‘Ohanaeze Ndigbo, is an unpatriotic Nigerian.\nBuhari, according to Ibegbu, is more patriotic and committed to the Niger Republic than to Nigeria, where he is president.\nBuhari will retire to the Niger Republic in 2023, according to the former Ohanaeze spokesman, who talked exclusively with DAILY POST.\nNigeria is currently building a 284-kilometer standard gauge rail connection that will allow Nigeria and Niger Republic to link.\n“As soon as his tenure ends, he will return to his country which is Niger Republic."
  },
  {
    "headline": "2023: Why Igbos May Never Produce President Of Nigeria – Bishop Azubuike",
    "summarized_story": "Athan Azubuike, the Presiding Bishop of the House of God International Church, has declared that the Igbos would always be second best and may never provide a president of Nigeria, even if they have everything it takes to govern the country in 2023.\nThis was said by the cleric during an Owerri event for young clergy.\nHe claimed that the average Igbo man is a trader rather than a politician because they lack the ability to mobilize people on a grassroots level.\nHe said,” One thing about an Igbo man is that an average Igbo person is a trader only interested in profit-making, we are not interested in working.\nYou’ll tell me it’s Rochas Okorocha, Anyim Pius Anyim, Sam Ohuabunwa among others but since Pius became the Senate President, how many times have you seen him and others in Imo State."
  },
  {
    "headline": "FG Reacts To Calls To Scrap NYSC Scheme",
    "summarized_story": "The National Youth Service Corps is here to stay, according to the Federal Government, and its contributions to national growth are undeniable.\nThe film was made to raise awareness of the program’s importance in developing national unity, patriotism, peace, and cohesion.\nThis movie needs to travel and hit every viewing platform across Nigeria and in the diaspora; it must go viral.\n“Let the message go out strong and clear, that the NYSC has come to stay.\nThe scheme is more relevant now than it has ever been before in the country”."
  },
  {
    "headline": "Embattled Dowen College Speaks On Sylvester’s Death, Vows To Assist Police With Investigation",
    "summarized_story": "Embattled Dowen College has vowed to work alongside the authorities in the investigation into the death of one of its pupils, Sylvester Oromoni, who was allegedly tortured by colleagues for refusing to join a cult.\nThe tragic and unfortunate incident which transpired this past November, and Sylvester’s untimely death requires a thorough and proper investigation.\n“Dowen College is fully committed to this.\n“We pray that God, who alone knows how to comfort the sorrowing, will comfort Sylvester’s family and all those who loved and knew him.\n“We commiserate with the Oromoni family, and the students of Dowen College who have lost a friend and fellow student."
  },
  {
    "headline": "Omicron COVID-19: Red alert begins, British Airways cancels UK bound flight, passengers stranded, at Lagos Airport",
    "summarized_story": "After 21 Omicron cases linked to the country, the United Kingdom added Nigeria to its red alert with effect from Monday (4.00am).\nSources at the airport linked it to the implementation of the travel ban imposed on countries considered red flags to the new Omicron variant of COVID-19.\nAirport sources further said “the situation was to get a clearer picture of what’s happening around the Omicron variant of a thing.\nHe tweeted, “In light of the most recent data, we are taking further action to slow the incursion of the Omicron variant.\n“As our world-leading scientists continue to understand more about the Omicron variant we are taking decisive action to protect public health and the progress of our COVID-19 vaccination programme."
  },
  {
    "headline": "Breaking: Barrow leads as vote count continues in Gambia presidential election",
    "summarized_story": "Gambian President Adama Barrow had a narrow early lead after Saturday’s presidential election, according to provisional results from the first few constituencies to be verified by the electoral commission.\nUnder the simple majority system, provisional results are expected to be announcedlater on Sunday with numbers from individual constituencies released in the interim.\nGambia uses a unique voting system – marbles dropped into each candidate’s ballot drum – to avoid spoiled ballots in a nation with a high illiteracy rate.\nJammeh, who was defeated by an opposition coalition that backed current President Barrow, fled to Equatorial Guinea in 2017 after refusing to accept defeat.\nEarlier on Saturday, Barrow cast his vote in Banjul and said he was confident of victory."
  },
  {
    "headline": "Kaduna: Terrorists free abducted Baptist church members",
    "summarized_story": "Up to 65 members of the Baptist church and others who were kidnapped by bandits in Kaduna state have been released by their abductors.\nThe victims were kidnapped by bandits on October 31 when they invaded the Emmanuel Baptist Church, Kakau Daji in the Chikun Local Government Area of Kaduna State.\nOn Saturday, the victims including women, men and children were brought to the Albarkar Baptist Church in the Kaduna state capital after their release and were reunited with their families.\nMeanwhile, the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the victims were handed over to the state government by the military for an onward reunion with their families.\nHe also said the victims, upon their release, were taken to the hospital by the military for a post-trauma evaluation."
  },
  {
    "headline": "Omicron: UK Red Listing Nigeria Is Unjust, Discriminatory – Lai Mohammed",
    "summarized_story": "The Minister of Information and Culture, Lai Mohammed, has condemned the red listing of Nigeria by the UK government over the two cases of the omicron variant of COVID-19.\nSpeaking at a news conference in Abuja, Mr Mohammed described the decision as unjust and discriminatory.\n[Read Also] Omicron: FG Expresses Disappointment Over UK Govt’s Red Listing Of NigeriaLai Mohammed’s comments are the latest reactions to the red listing which has continued to stir debates in Nigeria and across the world.\nEarlier, the Minister of Health, Dr Osagie Ehanire, expressed disappointment over the United Kingdom government’s placement of Nigeria on its red list following the detection of the COVID-19 Omicron variant.\n“From what we know about the COVID-19, there are many ways to manage it, and besides, not much is still known about the Omicron variant."
  },
  {
    "headline": "Police Begin Probe As Eight Children Die In SUV",
    "summarized_story": "The Lagos State Police Command said it is investigating the death of eight children, whose bodies were recovered in a Lexus Sport Utility Vehicle (SUV) van in the Badagry area of Lagos State.\nSpokesman of the Lagos State Police Command, CSP Adekunle Ajisebutu, confirmed the incident to Channels Television via a statement.\nCSP Ajisebutu noted that their bodies were found locked in the vehicle parked on Adelayo Street in the Jah-Michael area of Badagry.\n“Notwithstanding the report made to the Police, the Commissioner of Police, CP Hakeem Odumosu, has ordered a thorough and speedy investigation into the circumstances surrounding their death.”Multiple reports suggest that the car had a child lock feature and could only be opened from outside.\nThe children, mostly between four and six years old, were reportedly found dead when a parent was looking for her child."
  },
  {
    "headline": "Omicron: FG Expresses Disappointment Over UK Govt’s Red Listing Of Nigeria – Channels Television",
    "summarized_story": "The Minister of Health, Dr Osagie Ehanire, has expressed disappointment over the United Kingdom government’s placement of Nigeria on its red list following the detection of the COVID-19 Omicron variant.\n“We were not very happy when six countries in Sub-Saharan Africa were placed on a red list and the WHO also advised against putting each other on the red list,” the minister said on Channels Television’s Sunday Politics, less than one day after the UK announced the move.\nWhile reiterating that the placement of countries on the red list will not help in the global fight against the pandemic, Ehanire said Nigeria is anticipating the fourth wave of the disease.\n“If every country were going to put other countries on the ban list, very soon you would have a large number of countries on your red list,” the minister said.\nAside from Nigeria, Egypt and Malawi were the other countries recently added to Canada’s travel ban list."
  },
  {
    "headline": "Sylvester Oromoni: Police Begin Investigation Into Death Of Dowen College Student",
    "summarized_story": "The police in Lagos have announced that they have commenced an investigation into the death of Sylvester Oromoni jr, a 12-year-old student of Dowen college in the Lekki area Of Lagos.\nOdumosu added that the command is teaming up with the Delta State Police Command in the investigation to unravel the mystery behind the death of the minor.\nIn a viral video, Oromoni jr was seen writhing in pain.\nWith the series of video evidence in circulation, the Management of Dowen College has released a statement saying they will cooperate with authorities to dig deep into the matter.\nThe Lagos State government through its Ministry of Education who had paid an earlier inquiry visit to the college on Friday has announced that the school be shut down indefinitely."
  },
  {
    "headline": "EXTRA: T.B Joshua’s Synagogue Church Reopens For Service After 21 Months",
    "summarized_story": "The Synagogue Church of All Nations (SCOAN) reopened for regular services on Sunday, 21 months after the Lagos-based religious centre was shut owing to the COVID-19 pandemic.\nTB Joshua, the late founder of the SCOAN, had stopped regular services in March 2020 after the Federal Government announced measures to curb the spread of the disease.\nBut in a statement on TB Joshua’s Ministries official Facebook page, the church wrote: “At God’s time, everything is beautiful!\nThe service, conducted in compliance with COVID-19 protocols, was led by Evelyn Joshua who emerged as the leader of the Lagos-based church after a leadership tussle.\nSunday’s return to regular church service is coming five months after the death of the Ondo-born cleric who was credited to have attracted several high-profile politicians to the SCOAN when he was alive."
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "Low turnout as Ekiti residents vote to elect Council chairmen, Councillors -",
    "summarized_story": "There was low turn-out of voters today at the Local Government Elections held in Ekiti State to determine which party will Pilot the affairs of the 16 LGA, and 20 LCDAs for the next two years.\nTVc monitored the Election around the State and reports that asides the fact that Vehicular Movement was restricted, the Voting Exercise was largely PeacefulIn most Polling units visited ,voters didn’t turn up until 10am, and before 12pm,the exercise has been concluded as party agents were nowhere to be found in most of the Wards and Units.\nThe Creation of 20 LCDAs had generated Controversies of its own in the last few months, and it is yet to be seen how the meagre resources available to Ekiti State will be able to take care of 36 Local Councils altogether."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Wayas was a special breed, his death painful",
    "summarized_story": "Former President, Olusegun Obasanjo has disclosed that the late Senate President, Dr. Joseph Wayas lived for the welfare and security of the common man.\nThe late Senate President died early hours of Wednesday, in United Kingdom after illness at age 80.\nWayas was a special breed who contributed immensely to the development of the country and became a parliamentarian in the Second Republic.\n“He was such a great patriot who had contributed his own quota to the legislative governance and overall development of Nigeria.\nHis knowledge of practices and procedures of the Senate, according to Obasanjo “helped him greatly in running the affairs of the Senate."
  },
  {
    "headline": "Lagos Releases Full #EndSARS Report as Panel Adjudicates on 11 of 65 Police Petitions",
    "summarized_story": "The Lagos State Government has released the two volumes of the report of the Judicial Panel of Inquiry (JPI), detailing the fallout of the #EndSARS protests in October last year.\nTagged “Consolidated Report on General Police Brutality Cases,” out of the 11 cases, eight were considered worthy of compensation while three were considered undeserving.\nOther petitioners considered by the panel included ACP Oketunji Sola, ASP Elizabeth Enadhuze, Iliyasu Muhammed, Shina Olunlade, Gbolahan Olugbemi and Taiwo Kasumu.\n“At the close of hearing and deliberation during the conference, which held on 30th October, 2021, eight of the petitions were found to be meritorious while three were not awarded compensation.\n“The panel consequently recommends that the state government approves and release the amounts awarded to the respective petitioners,” the body suggested."
  },
  {
    "headline": "Nigeria: US Foundation, ABUAD Hospital, Others Plan Free Open-heart Surgery",
    "summarized_story": "A Healthy Heart Foundation (HHF), the Afe Babalola University Multi-System Hospital and United States of America-based VOOM Foundation have gone into a partnership to carry out free heart surgeries for indigent patients in Ekiti and across Nigeria.\nThe free health intervention programme has been scheduled to take place in the ultra-modern 400-bed ABUAD multisystem hospital based in Ado Ekiti, Ekiti State.\nA statement by the Director, Corporate Affairs of Afe Babalola University, Ado-Ekiti(ABUAD), Mr. Tunde Olofintila yesterday, ABUAD Multi-system Hospital was chosen as the location for the December edition because of its sophisticated equipment.\nHe said: “This is my first visit to Ekiti and the ABUAD Hospital was my first stop.\nHe added that the HHF was set up to provide care (surgery) to indigent patients and training to willing Clinicians."
  },
  {
    "headline": "UniAbuja Mounts 24-hour Security Patrol, Deploys Hunters, Vigilantes Against Kidnappers",
    "summarized_story": "The Pro-Chancellor and Chairman of University of Abuja Governing Council, Modibbo Mohammed has disclosed that the university has mounted 24 hours security patrol not only within the campus but within the perimeters of the tertiary institution.\nThe initiative, according to him, was to prevent a repeat of the recent kidnapping that occurred at its staff quarter.\n“We have also employed additional hunters, vigilantes to patrol in areas that are not fenced because it is a very vast land,” he said.\nOn the staff quarters which was then reported to be in a deplorable state, he said: “Our staff housing is below standard.\n“The council has met the Minister of FCT and he has assured us to do something soon."
  },
  {
    "headline": "Nigeria: $10bn Train 7 Risks Suspension as Senate, Saipem Bicker",
    "summarized_story": "The Senate Committee on Local Content had last Wednesday, accused Saipem of deliberately circumventing Nigeria’s Local Content Act by sidelining Nigerian manufacturers in the bidding for the contract awards as provided for in the law.\nContractors for the project are SCD JV Consortium, comprising Nigerian affiliates of Saipem (Italy), Chiyoda (Japan) and Daewoo (South Korea.\nIt’s a warning that it’s no longer business as usual – you cannot sign Local Content Plan and do whatever you like.\nHowever, in its reaction, NLNG reiterated its full commitment to the delivery of the Train 7 Local Content Plan and the overall delivery of the project.\nHowever, NCDMB, the country’s local content agency, declined to comment on the matter as its corporate communications personnel did not respond to an enquiry sent to him as of the time of filing in this report."
  },
  {
    "headline": "Nigeria: Persuade Other Zones for 2023 Presidency, Anyim, Ezeife Urge South East",
    "summarized_story": "They said this on Saturday at the United For Better Nigeria Initiative (UBNI) National Convention in Abuja.\nHowever, Anyim, while speaking at the UBNI convention, said it was neither a right nor legal for the southeast to demand Igbo presidency in 2023.\nHe said the Igbo had to persuade other zones to support their dream if they would produce a president in 2023.\nNigeria has the capacity to hold everybody, Nigeria has the intellectuals, Nigeria has all it takes to lift the county.\nDoes that mean that the South East is not being recognised as a geopolitical zone in Nigeria?” he asked."
  }
]