[
  {
    "headline": "Incessant killings: Plateau, Benue gunmen kill 44, youths deposit corpses at Government House",
    "summarized_story": "There was tension in the local government following the attack as youths berated the state government for failing to protect the residents.\nIt was gathered that when the gunmen got to the community, they were shooting in every direction before they went from house to house and gunned down many residents.\n“I have been informed that some gunmen attacked my people last night (Tuesday) in the Naraguta community with many casualties.\nThey were, however, prevented from entering the Government House by security operatives, who mounted roadblocks at the road leading to the gates.\nHe stated, “The attackers came in the night and started shooting unsuspecting members of the community from house to house."
  },
  {
    "headline": "Suspected herders kill eight on market day in Benue community",
    "summarized_story": "Eight persons were allegedly killed by suspected herders in the Yelwata community, Guma Local Government Area of Benue State, on Tuesday.\nA native of Yelwata, who did not want his name in print, said the herders invaded the community went and straight to the market and shot at people.\nThe native stated, “The incident happened around 6pm yesterday (Tuesday) when some herders came to our community’s market and gunned down eight persons and injured several others.\n“Yesterday (Tuesday) was the Yelwata market day and the people were still in the market around 6pm when the herdsmen came and started shooting indiscriminately.\nA military source confirmed the attack and added that troops had been deployed in the area to restore normalcy in the community."
  },
  {
    "headline": "Ondo Amotekun rescues hypnotised Lagos teenager from ritualist",
    "summarized_story": "The victim after regaining his consciousness discovered he was not in Lagos state but in Ore, Ondo state.\n” lt was when he took the bag from me that I regained my memory and realized that I’m already in Ondo state.\nSewumi street Mushin, Lagos State said, “I got a call at about past three from somebody that said he was calling from Amotekun.\nHe said my son who left home at about 9 am for where he was receiving training as a mechanic was found in Ondo state.\nI say kudos to the Ondo state government for setting up such an agency that is reliable and dependable”."
  },
  {
    "headline": "Adamawa Govt approves N233m for procurement of farm inputs",
    "summarized_story": "The Adamawa government has approved the sum of N233 million naira for the purchase of agricultural inputs for the 2021/2022 farming season, Dr. Umar Pella, Commissioner for Information and Strategy, said on Wednesday.\nBriefing newsmen shortly after the State Executive Council Meeting ( SEC) in Yola, Pella said the planned purchase of fertilisers, seedlings and herbicides will ultimately contribute to increased production, reduced food imports, increase in farmer access to the right inputs and enhanced food security.\nAccording to the commissioner, the inputs would be procured from reputable manufacturers and sold at subsidised rate to farmers for both wet and dry season farming.\nHe noted that the government’s move was aimed at reaching out to smallholder farmers, who were the major food producers in the state.\nContributing, Alhaji Umar Daware, Commissioner for Agriculture, said the targeted inputs were carefully selected, because they will support such crops as rice, maize and sorghum for multiple cycle production, as well as boost agriculture in the state to attain food security."
  },
  {
    "headline": "We are committed to executing more developmental projects – Fayemi",
    "summarized_story": "Governor Kayode Fayemi of Ekiti StateGovernor Kayode Fayemi of Ekiti on Wednesday restated the commitment of his administration towards executing more developmental projects and transformation of Ado Ekiti, the state capital.\nGovernor Fayemi, who made the commitment during the celebration of the year 2021 Udiroko Festival in Ado-Ekiti, described the new Ado-Iyin dual carriageway as one of such projects.\nThe Governor said Ado Ekiti has grown rapidly in population and has extended to nearby towns like Ikere Ekiti, Iyin Ekiti, Iworoko Ekiti, Ilawe Ekiti and Ijan Ekiti.\n“Our administration is for the development of Ado Ekiti where we are executing many capital projects some of which will soon be commissioned for the use by our people.\n“This is a key legacy project for the people of Ado Ekiti."
  },
  {
    "headline": "Kathy Hochul sworn in as New York’s first female governor",
    "summarized_story": "Kathy Hochul has been sworn-in as first female governor of New York, promising to change the state’s political culture and work to ensure that New Yorkers believe in their government again.\nHochul, a Democrat from Buffalo who turns 63 this week, officially became New York state’s 57th governor in a private ceremony.\nHochul, who was sworn-in by the state’s highest judge, takes over the governor’s office in the wake of a sexual harassment scandal that drove her predecessor, Andrew Cuomo, from power.\nCuomo had on Aug. 10 resigned because of a sexual harassment scandal that crippled his administration and that the resignation would take effect after two weeks, which is Aug. 24.\nThe new governor pledged to strengthen the state’s response to the COVID-19 pandemic and speed direct aid to residents in need."
  },
  {
    "headline": "Gunmen attack bullion van in Ore, kills driver, policeman",
    "summarized_story": "The Police Command in Ondo has confirmed the attack on a bullion van in Ore by gunmen.\nThe police also confirmed the killing of the bullion van driver and a policeman during the attack.\nNAN recalls that the attack occured barely two weeks after a bullion van was also attacked in the Emure-Ile axis of the state by suspected armed robbers.\nAccording to an eye witness: “The dare-devil armed robbers opened fire on the bullion van which was carrying an undisclosed amount of money and the police escort car.\n“Yes, I can confirm to you that the driver of the bullion van and a police officer died in the attack, but the police have launched their investigation to trail the gunmen."
  },
  {
    "headline": "Flood: Buni charges traditional rulers to enlighten subjects on dangers of waterways blockage [Photos]",
    "summarized_story": "Yobe State Governor, Mai Mala Buni has charged traditional rulers in the state to enlighten their communities on the need to keep the waterways free from blockage.\nHe assured the monarchs that the government would work towards providing permanent solutions to the floods in their communities.\n“Government will consider building massive water ways, drainages and channels to divert the flow of the rain water from residential buildings”, he said.\nGovernor Buni assured that, “the government will support victims of the floods to cushion their hardships”.\nThe Emir of Damaturu, Alh Baba Shehu Hashimi Ibn El-kanemi; Alh."
  },
  {
    "headline": "Kidnapping, cultism biggest security challenges in Ogun – Abiodun",
    "summarized_story": "Ogun State Governor, Prince Dapo Abiodun has admitted that random kidnapping and cultism are the biggest security challenges confronting the state.\nThe governor admitted that, “The biggest issues we have today in Ogun State are that of random kidnapping and cult activities.\n“I believe that the cult activities have abated now because of the joint efforts of the Nigeria Police, the State Security Services and the Nigerian Army.\n“However, we are still struggling and dealing with issues that relate to kidnapping of contractors, farmers and innocent Ogun State residents.\nDAILY POST reports that kidnapping has become a ‘money-making venture’ for bandits in Ogun State in the past few months."
  },
  {
    "headline": "We have zero tolerance for sexual harassment – OAU VC",
    "summarized_story": "The Vice-Chancellor, Obafemi Awolowo University (OAU), Ile-Ife, Prof. Eyitope Ogunbodede, has said the institution has zero tolerance towards any form of sexual harassment and other social vices on campus.\nOgunbodede said this at the launching of the anti-sexual harassment policy of the institution on Wednesday in Ile-Ife.\nAlso speaking, the wife of the Ekiti State Governor, Dr Bisi Fayemi, urged every tertiary institution across the country to emulate Obafemi Awolowo University by having a policy on sexual harassment and a zero-tolerance culture.\nShe noted that every tertiary institution leadership needed to demonstrate its unwillingness to condone a culture of abuse, silence and impunity.\n“Where there are policies in place to prevent and deal with sexual harassment, they should be implemented to the fullest extent possible,” she said."
  },
  {
    "headline": "Akeredolu, Fayemi visit Tinubu in London",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State and his Ekiti State counterpart, Kayode Fayemi have visited former Lagos State Governor and National Leader of the All Progressives Congress, APC, Asiwaju Bola Ahmed Tinubu in London, United Kingdom.\nTinubu has, for a while, been in London for reported medical reasons.\nThe APC leader, who had been reported to be eyeing the APC presidential ticket ahead of the 2023 general election, has in recent times been frequently traveling abroad.\nOn his recent visit to London, President Muhammdu Buhari had paid a visit to Tinubu.\nAlso, Governor Babajide Sanwo-Olu of Lagos State, as well as some APC leaders, had also traveled to London to visit him."
  },
  {
    "headline": "Ex-petroleum minister, Kachikwu, Dazz Motors in Jaguar car theft case",
    "summarized_story": "Former Petroleum Minister, Ibe Kachikwu has denied smuggling a car stolen from a Jaguar assembly in the United Kingdom into America.\nThe 2007 Jaguar XKR was taken from its facility in Birmingham, England.\nKachikwu admitted to the forfeiture of the vehicle and agreed to pay $10,000 instead of the vehicle being confiscated.\nHe said Kachikwu bought the Jaguar car in 2009 from Dazz Motors Nigeria Ltd., whose MD was Emmanuel Jack, and had an office in Victoria Island, Lagos.\nKachikwu gave them the details of the car and they reached out to the car dealer, who corroborated his narration and validated his innocence."
  },
  {
    "headline": "PDP tearing apart over 2023 zoning",
    "summarized_story": "NWC affirms AkinwonmiGovernors meet on crisisThe Peoples Democratic Party (PDP) leadership crisis was aggravated by the antagonistic positions of the competing forces on zoning of party offices and the 2023 presidential ticket, it was learnt last night.\nThe forum enjoined PDP members and stakeholders to exercise patience as efforts were on to ensure the stability of the party in the days ahead.\nThe decision has put paid to claims by the Deputy National Chairman (North), Suleiman Nazif who on Tuesday, declared himself Acting Chairman.\nA source said NWC members were unanimous in their decision to recognise Akinwonmi as Acting Chairman.\nADVERTISEMENTLukman said: “A similar style was adopted, prior to the 2015 general election, towards the tail end of Alh Bananga Tukur regime as National Chairman."
  },
  {
    "headline": "PDP women wing, Secondus clash over court case",
    "summarized_story": "More trouble came on Wednesday for suspended National Chairman of the Peoples Democratic Party (PDP) Prince Uche Secondus.\nThe party’s Women Caucus in Andoni Local Government Area of Rivers State expressed disappointment at Secondu’s attempt to upturn a court injunction that barred him as national chairman.\nThey said they were appalled by an alleged move by Secondus to procure a court order challenging his suspension from Nasarawa State judiciary.\n“We had expected Secondus, who had been suspended in his Ward in Andoni Local Government Area of Rivers State, for anti-party activity to defend himself in the suit filed against him here in Rivers State.\nPeople who went to court are now afraid of court."
  },
  {
    "headline": "Leaders need more than piety to run government",
    "summarized_story": "Most Nigerians will readily attest to the fact that both President Buhari and Vice President Osinbajo are pious men.\nAnd they have not disappointed us as the two pious men have continued to live and govern by faith.\nThe body wants “Returning fighters to be treated like brothers newly found because What they need is our understanding, cooperation and kindness”.\nBut as 2023 beckons, perhaps it is time to remind ourselves that government is too important to be left in the hands of pious men driven only by sense of self-righteousness.\nPiety is perhaps the least attribute needed by those who want to run government."
  },
  {
    "headline": "Ebonyi, three others get N24b for ranching",
    "summarized_story": "Ebonyi, Yobe and Katsina states, as well as the Federal Capital Territory (FCT), have received N24billion for ranching from the Federal Government.\nRead Also; Ortom urges more states to enact ranching lawHe said any state that is interested and meets the requirement will get the same grant.\n“So far, about N24billion has been disbursed to about four states for ranching and associated activities.\nThe revelation that Ebonyi got the funds will come as a surprise to many in the Southeast.\nThe state and other Southern governors had said they had no land for ranching."
  },
  {
    "headline": "PIA: Ex-militants blow hot, blame Sylva, senators",
    "summarized_story": "From Paul Osuyi, AsabaFormer Niger Delta agitators have vowed to make the region ungovernable until provision in the Petroleum Industry Act (PIA) for oil bearing communities is reviewed upward from the current three per cent equity.\nThey said the minister and senators from the region backed President Muhammadu Buhari in hurriedly signing the bill into law for their selfish interests.\nThey vowed that the region would not know peace if the review was not done.\nThey said host communities had suffered several degradation over the decades of oil exploration by oil companies and that the PIB was geared to address this injustice.\nAccording to them, the region can no longer be short changed, intimidated and oppressed."
  },
  {
    "headline": "Your balanced reporting endeared The Sun to me –Koko, NPA boss",
    "summarized_story": "By Amechi Ogbonna and Steve AgbotaActing Managing Director of the Nigerian Ports Authority (NPA) Mr Bello Koko, yesterday eulogised the management and staff of The Sun Publishing Limited for its high level of professionalism in news reporting.\n“We appreciate The Sun for balanced reporting of events in the country.\nThis is unlike some others who pick up fake and unfounded stories to continue to misinform the reading public.”“The Nigerian Ports Authority is a national asset created to improve port facilities across the country.\nHe said he was impressed by the reforms currently being implementing by the NPA management, including its efforts at improving the Ease of Doing Business.\nOnuoha also commended the NPA boss for his efforts at making the Eastern seaports operational, urging him not to relent in the fight to end congestion on Lagos port roads and make it a thing of the past."
  },
  {
    "headline": "Buhari’s refusal to restructure sign things’ll get worse –NEF",
    "summarized_story": "By Chukwudi NwejePresident Muhammadu Buhari has again been accused of failing to restructure the country.\nAccording to the Northern Elders Forum (NEF) spokesman, Hakeem Baba Ahmed, the North is the first victim of President Buhari’s alleged misgovernance.\nAhmed who spoke at the second Annual Ripples Dialogue in Lagos, claimed the president’s refusal to restructure the country is indicative that things may get worse before March 2023.\n“The North is the first victim of President Buhari’s misgovernance.\n“The cause of the mistrust is the 1999 constitution."
  },
  {
    "headline": "36 killed, houses razed in fresh attack on Plateau community",
    "summarized_story": "From Gyang Bere, Jos and Juliana Taiwo-Obalonye, AbujaNo fewer than 36 persons were killed yesterday morning, when suspected bandits attacked Yelwan Zangam community in Jos North Local Government Area of Plateau State.\nThe gunmen also destroyed houses and the bridge linking the town to the community making access to the area difficult for security agencies.\nTroops eventually got to the scene of the attack by navigating through other villages and met some houses already burnt and casualties recorded.\nTroops are in pursuit in the direction the killers fled.”David Zaion, member of the community, said 36 bodies have been recovered while more than 20 houses were burnt.\n“The bandits invaded the community in a large number in the early hours of Wednesday and killed women, children and the aged persons."
  },
  {
    "headline": "Your ‘secret fulanization agenda’ allegation wicked, false, Presidency replies Ortom",
    "summarized_story": "The statement read: “Governor Samuel Ortom has few political principles.\nWe can see this from the fact that he has changed political party five times during his undistinguished career.\n“Specifically, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\n“As was the case in Rwanda where the then Hutu leaders of the country incited their countrymen against each other, claiming there was a “secret Tutsi agenda” over the Hutu, Ortom claims there is a “secret Fulanization agenda” over other ethnic groups in his state and in Nigeria.\n“For the governor of a major state in Nigeria to be politically driven by ethnic hatred is a stain on our country."
  },
  {
    "headline": "Presidency Accuses Ortom of Fanning Embers of Disunity",
    "summarized_story": "*Describes Benue gov as ethnic jingoist, political failure that has changed party five timesDeji ElumoyeThe Presidency has reacted to recent utterances by Governor Samuel Ortom of Benue State saying he is all out to cause disunity among Nigerians.\nAccording to the statement, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\nWe can see this from the fact that he has changed political party five times during his undistinguished career.\nUnfortunately, for the good citizens of Benue State, the most dangerous direction he blows in today is that of sectarianism and ethnicity.\n“The good, and fair-minded people of Benue State deserve more than this, and we look forward to the next elections when they have an opportunity to restore its greatness”, the Presidency stated."
  },
  {
    "headline": "Plateau Killings: House Speaker Calls for Calm as Community Takes Corpses to Assembly",
    "summarized_story": "The Speaker, Plateau House of Assembly, Abok Ayuba, has called for calm and restraint over Tuesday’s attack on Yelwa Zangam community in the state by gunmen.\nAbok made the call when members of the Yelwa Zangam community took corpses of their loved ones killed in the attack, to the Assembly.\nYelwa Zangam, a community in Jos North Local Government Area of the state, was attacked by hoodlums on Tuesday night during which 35 people were reportedly killed.\nMembers of the community cried to the assembly and urged it to liaise with other arms of government to tackle the menace.\n“We are all affected by what is happening in Plateau, but please, calm down as government is doing everything possible to end the killings."
  },
  {
    "headline": "Tax Evasion: Tribunal Orders Multichoice to Pay N900bn to FG",
    "summarized_story": "James EmejoThe Tax Appeal Tribunal (TAT) sitting in Lagos has ordered Multichoice Nigeria Limited, DSTV, to pay 50 per cent of N1.8 trillion which the Federal Inland Revenue Service (FIRS) had determined through a forensic audit to be the amount in taxes that Multichoice Nigeria Limited had failed to pay to the federal government in past assessment years.\nAhmed, issued the order following an application to it by the counsel to FIRS.\nThe details of the development was contained in a statement issued Wednesday by Director, Communications and Liaison Department, FIRS, Dr. Abdullahi Ismaila Ahmad.\nIn response, however, the FIRS counsel asked TAT to issue an order requiring that Multichoice makes the statutory deposit of 50 per cent of the disputed sum.\nThereafter, TAT adjourned the appeal to September 23, 2021 for report of compliance with its order and continuation of the hearing, subject to compliance with the tribunal’s order."
  },
  {
    "headline": "Irabor Allays Fears over Repentant Terrorists",
    "summarized_story": "By Kingsley NwezehThe Chief of Defence Staff (CDS), General Lucky Irabor, has allayed fears over the 1,200 insurgents, who recently surrendered to troops in the North-east.\nNorth-east communities have protested the development and the likelihood of reintegration of the terrorists after they left a trail of blood and destruction in the region.\nSpeaking at a parley with military veterans in the North-east held in Yola, capital of Adamawa State, Irabor allayed fears of the return of the insurgents and assured them that the military would deal with the matter in the interest of the region.\n“According to him, the AFN would deal with the matter for the good of the region, as there will be no loose ends”.\nThe CDCIMIC urged the veterans to make useful contributions towards the goal of securing the NE zone and the country at large."
  },
  {
    "headline": "Buhari: Attack on NDA won’t Deter Armed Forces’ Resolve to End Criminality",
    "summarized_story": "Deji ElumoyePresident Muhammadu Buhari has declared that Tuesday’s attack on the facility of the Nigerian Defence Academy (NDA) rather than demoralising the nation’s Armed Forces as it is intended to, will strengthen their determination to make a decisive end to criminality in the country.\nThe president, in a release issued Wednesday by his Media Adviser, Femi Adesina, noted that the attack, which led to loss of lives, came at a time that the military had put insurgents, bandits, kidnappers and other types of criminals on the retreat.\nAccording to him, the heinous action would accelerate the total uprooting of evil in the polity, which members of the Armed Forces are solidly resolved to accomplish in the shortest possible time.\nWhile commiserating with the families that lost their loved ones and praying God to comfort them, President Buhari vowed that the deceased would not die in vain, as the degenerate act would have consequences that will eventually clean the country of vermin, and emancipate the polity from deliberate, targeted and contrived atrocious acts.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Nigeria’s Petroleum Corporation Executives Shamelessly Throw Lavish Party To Celebrate Aisha Katagum’s Promotion Amid Corruption Allegations",
    "summarized_story": "Sources told SaharaReporters that the corporation incurred humongous expenses at the party where they treated themselves to the country’s scarce resources like royalties.\nThe party is coming amid several allegations of corruption and contracts racketeering among the top workers of the corporation.\nYou will recall the announcement of promotions to top management in NNPC last week.\nTo our great disgust, a party was thrown in Abuja to celebrate Aisha Farida Katagum who was promoted to GED Corporate Services.\nSome of the top management staff of NNPC have been accused of receiving bribes recently in exchange for favourable contracts."
  },
  {
    "headline": "Nigeria’s Petroleum Corporation Executives Shamelessly Throw Lavish Party To Celebrate Aisha Katagum’s Promotion Amid Corruption Allegations",
    "summarized_story": "Sources told SaharaReporters that the corporation incurred humongous expenses at the party where they treated themselves to the country’s scarce resources like royalties.\nThe party is coming amid several allegations of corruption and contracts racketeering among the top workers of the corporation.\nYou will recall the announcement of promotions to top management in NNPC last week.\nTo our great disgust, a party was thrown in Abuja to celebrate Aisha Farida Katagum who was promoted to GED Corporate Services.\nSome of the top management staff of NNPC have been accused of receiving bribes recently in exchange for favourable contracts."
  },
  {
    "headline": "Nigeria’s Petroleum Corporation Executives Shamelessly Throw Lavish Party To Celebrate Aisha Katagum’s Promotion Amid Corruption Allegations",
    "summarized_story": "Sources told SaharaReporters that the corporation incurred humongous expenses at the party where they treated themselves to the country’s scarce resources like royalties.\nThe party is coming amid several allegations of corruption and contracts racketeering among the top workers of the corporation.\nYou will recall the announcement of promotions to top management in NNPC last week.\nTo our great disgust, a party was thrown in Abuja to celebrate Aisha Farida Katagum who was promoted to GED Corporate Services.\nSome of the top management staff of NNPC have been accused of receiving bribes recently in exchange for favourable contracts."
  },
  {
    "headline": "BREAKING: 30 Residents Reported Dead In Fresh Attacks In Jos",
    "summarized_story": "Many people have been reportedly killed at Yelwan Zangam community in Jos North Local Government Area of Plateau State.\nAccording to Daily Trust, several houses were also burnt down in the attacks which reportedly claimed more than 30 lives.\nThis is coming barely one week after 27 travelers were killed in Gada-biyu – Rukuba road, still in Jos North LGA.\nHe said more than 30 people were killed, adding that security personnel had been deployed in the area.\nThe Plateau State Police Command is to is yet to give details of the incident, as at the time of filing this report."
  },
  {
    "headline": "BREAKING: 30 Residents Reported Dead In Fresh Attacks In Jos",
    "summarized_story": "Many people have been reportedly killed at Yelwan Zangam community in Jos North Local Government Area of Plateau State.\nAccording to Daily Trust, several houses were also burnt down in the attacks which reportedly claimed more than 30 lives.\nThis is coming barely one week after 27 travelers were killed in Gada-biyu – Rukuba road, still in Jos North LGA.\nHe said more than 30 people were killed, adding that security personnel had been deployed in the area.\nThe Plateau State Police Command is to is yet to give details of the incident, as at the time of filing this report."
  },
  {
    "headline": "Garba Shehu: NDA attack might be politically designed to embarrass Buhari",
    "summarized_story": "Garba Shehu, presidential spokesperson, says the recent attack on the Nigerian Defence Academy (NDA) might be a ploy to embarrass the President Muhammadu Buhari administration.\nAdvertisementTheCable had reported that gunmen attacked the NDA in the early hours of Tuesday, which resulted in the death of two officers.\nReacting to the development on Wednesday, Shehu, in an interview on Channels Television, said the presidency expects the military to thoroughly investigate and disclose what happened.\nIt is now left for the military authorities to thoroughly investigate this and bring out what happened,” he said.\n“So, in a climate — political climate — in which people seek to make political capital out of this unfortunate incident, you don’t rule in anything, you don’t rule out anything."
  },
  {
    "headline": "Garba Shehu: NDA attack might be politically designed to embarrass Buhari",
    "summarized_story": "Garba Shehu, presidential spokesperson, says the recent attack on the Nigerian Defence Academy (NDA) might be a ploy to embarrass the President Muhammadu Buhari administration.\nAdvertisementTheCable had reported that gunmen attacked the NDA in the early hours of Tuesday, which resulted in the death of two officers.\nReacting to the development on Wednesday, Shehu, in an interview on Channels Television, said the presidency expects the military to thoroughly investigate and disclose what happened.\nIt is now left for the military authorities to thoroughly investigate this and bring out what happened,” he said.\n“So, in a climate — political climate — in which people seek to make political capital out of this unfortunate incident, you don’t rule in anything, you don’t rule out anything."
  },
  {
    "headline": "Lagos PDP chairman dies of COVID-19 complications",
    "summarized_story": "Adegbola Dominic, chairman of the Lagos state chapter of the Peoples Democratic Party (PDP), is dead.\nAdvertisementIn a statement on Wednesday, Taofik Gani, the publicity secretary of the party in the state, said Dominic died of COVID-19 complications.\nHe described the late party chairman as a grassroots politician who stood for the development of the state.\nHe had held many political positions, notable amongst being State SDP officer; State Chairman of PAC; National Chairman of APN (Founded by late Jakande); State Chairman of Lagos PDP.\n“He had also contested lagos state governorship under the platform of APGA."
  },
  {
    "headline": "Lagos PDP chairman dies of COVID-19 complications",
    "summarized_story": "Adegbola Dominic, chairman of the Lagos state chapter of the Peoples Democratic Party (PDP), is dead.\nAdvertisementIn a statement on Wednesday, Taofik Gani, the publicity secretary of the party in the state, said Dominic died of COVID-19 complications.\nHe described the late party chairman as a grassroots politician who stood for the development of the state.\nHe had held many political positions, notable amongst being State SDP officer; State Chairman of PAC; National Chairman of APN (Founded by late Jakande); State Chairman of Lagos PDP.\n“He had also contested lagos state governorship under the platform of APGA."
  },
  {
    "headline": "Presidency: Ortom using language reminiscent of Rwandan genocide to cause deaths of Nigerians",
    "summarized_story": "The presidency has accused Samuel Ortom, governor of Benue state, of “using language reminiscent of the Rwandan genocide” to cause the deaths of Nigerians.\nAdvertisementThe presidency said the governor is trying to boost his “sinking political fortunes” by stirring up hatred and targeting one ethnic group.\nOrtom had in a recent interview accused President Muhammadu Buhari of trying to “Fulanise” the country.\n“Specifically, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\nThis is a copy of the language of Hutu Power – which falsely, and intentionally, accused the Rwandan Tutsi of plans to dominate the country."
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "Ethiopia is building local competitors to Facebook, WhatsApp, Twitter and Zoom",
    "summarized_story": "Ethiopia has begun developing its own social media platforms to rival Facebook, Twitter, WhatsApp and Zoom, as per Reuters.\nIn a local media outlet on Friday, Shumete accused Facebook of blocking users who were “preaching national unity and peace”.\nSupporters of the different sides have taken the conversation over to social media.\nTo build these platforms, Ethiopia is relying solely on local expertise.\nThis begs the question of whether investing in state-owned social network platforms should be on its list of priorities."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Egyptian eCommerce platform, MaxAB, gets $15m Series A extension, acquires Morocco-based WaystoCap",
    "summarized_story": "MaxAB’s acquisition of WaystoCap is in line with its plans to scale across Africa.\nThe company initially operated as a platform for cross-border trading activities allowing it to establish a presence in Ivory Coast and Togo.\nThis acquisition will see MaxAB position itself in Morocco and the Maghreb region, which comprises Algeria, Libya, Mauritania, Morocco, and Tunisia.\nStore owners can use the platform to purchase goods, arrange for delivery or logistics, and communicate with a customer support team.\nThere are several positive projections for the eCommerce industry in the MENA region, and news of large fundings and acquisitions support these projections."
  },
  {
    "headline": "SME Clinic 2021 in the rearview mirror",
    "summarized_story": "Share this article:Themed, Sustaining Your Business with Technology, SME Clinic 2021 held on Saturday, August 21, 2021, at Zone Tech Park, Gbagada, Lagos.\nThe hall was composed of small business owners, aspiring business owners, field professionals, and niche experts from various fields looking to scale in this digital age.\nTope Olofin at SME Clinic 2021Chioma Ifeanyi-Eze — Founder, Accountinghub.Ng — left the hall more stunned, aware, and thoroughly enlightened than she met it.\nChioma Ifeanyi-Eze at SME Clinic 2021“Tell me about it; I learnt a whole lot at the bookkeeping session.\nGrant winners at SME Clinic 2021“I absolutely didn’t see this coming."
  },
  {
    "headline": "Ethiopia takes on Facebook, Facebook Marketplace expansion, EcoCash users to pay more, Chari.ma acquires Karny.ma",
    "summarized_story": "The conflict has seen supporters of both sides take to social media to show support and push each party’s agenda.\nSuggested read: Sub-Saharan Africa lost $237.4 million to Internet censorship in 2020Ethiopia’s desire to build local alternatives to existing social media platforms is not surprising.\nAdvertisementFacebook Marketplace launches in 37 African countriesGood news: Yesterday, Facebook announced the launch of Facebook Marketplace in 37 sub-Saharan African countries and territories, including Comoros, Democratic Republic of the Congo, Djibouti, Eritrea, Eswatini, Equatorial Guinea, and Guinea-Bissau.\nUntil now, Facebook Marketplace was only available in four African countries — South Africa, Ethiopia, Kenya, and Nigeria.\nAfter its last review of transaction charges in January 2021, users will pay about 10% more when making transactions."
  },
  {
    "headline": "Obaseki pays August salaries, pensions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has paid workers salaries and pension for the month of August, in line with its commitment to the welfare of civil and public servants in the state.\nSecretary to the State Government, Osarodion Ogie Esq., said the Governor Godwin Obaseki-led administration has been consistent with meeting its statutory obligations to workers in the state.\nAccording to him, “The Edo State Government has paid salaries and pensions of its workers for the month of August 2021.\nThis is in line with the tradition of meeting this obligation on or before the 26th of every month.”Ogie noted that the state government will continue to prioritise the welfare of workers and ensure they are provided a conducive work environment to optimally serve the good people of Edo State."
  },
  {
    "headline": "Obaseki engages stakeholders on career devt, entrepreneurship initiatives – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will tomorrow, Thursday, August 26, 2021, play host to religious and traditional leaders, as well as other stakeholders to deliberate on their collaborative role in the career advancement of youths and how to better leverage government’s entrepreneurship initiatives.\nIn a statement, Managing Director of the Edo State Skills Development Agency (EdoJobs), Ukinebo Dare, said Governor Obaseki will play host to the stakeholders in Government House, Benin City, the state capital.\nShe noted that the session will explore areas of potential collaboration to bring job creation initiatives closer to youths across the state.\nAccording to her, the topmost priority of the Obaseki-led administration is how residents in Edo State can fully participate and benefit from EdoJobs initiatives.\n“Through EdoJobs, the Governor Obaseki-led administration provides unique career development opportunities and entrepreneurship programmes."
  },
  {
    "headline": "Olu Of Warri Performs First Spiritual Duty , Reverses Curse And Pronounces Blessings – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The newly crowned Olu of Warri, Ogiame Atuwatse III, who was crowned the 21st Olu of Itsekiri, on Saturday,21 August, 2021, has performed his first spiritual duty by reversing a longtime curse on Iwere land.\nThe Olu recalled that , after the curse was placed on the land, there was no record anywhere, when the said curse was reversed.\n“In reaction , a curse was placed on the land by both of them.It is not recorded that Olu Erejuwa II reverse the curse over the land neither is it recorded that Oba Akenzua II did the same.\nOlu Atuwase Ill is the eldest son of the 19th Olu of Warri Atuwatse II ,who reigned for 28 years (1987-2015).\nHe attended the Nigerian National Petroleum Corporation (NNPC) Primary School Warri, Delta State, from where he proceeded to Adesoye College, Offa in Kwara State from 1995 to 2001."
  },
  {
    "headline": "Edo@ 30: Prince Akenzua sues for Recognition of Oba Erediauwa, other Founding Fathers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY_ As Edo State celebrates its 30th Anniversary as a state, His Royal Highness, Prince Edun Akenzua, the Enogie of Obazuwa- Iko dukedum, has called on Edo youths to emulate the sterling qualities of the founding fathers of the state.\nHe gave the admonition during a press briefing with Journalists at his Palatial house in Benin City, the Edo State Capital yesterday.\nAt that time, Edo state had not formed requested for the creation of a state.\n“It is necessarily to tell this story in full because most Edo people and Nigerians do not know the Genesis of the formation of Edo state.\n“Those in authority now may wish to honour the founding fathers of the state whose 30th Anniversary is coming up on August 27th, 2021."
  },
  {
    "headline": "27 Internet fraudsters convicted in Rivers",
    "summarized_story": "The Federal High Court in Port Harcourt, Rivers State, on Wednesday convicted 27 Internet fraudsters.\nMr Uwujaren said the trial judge, A.T Mohammed, convicted the defendants following their guilty plea.\nThe convicted Internet fraudsters were arraigned separately on one count charge bordering on impersonation and obtaining by false pretences.\nThe duo of Damilola Michael and David Oluwatobi were sentenced to two years imprisonment or N300, 000 fine each.\nOthers bagged two years imprisonment or a fine of N200,000 each while the three sureties bagged two years imprisonment with option of N100,000 fine each."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari govt accuses Ortom inciting violence against Fulani",
    "summarized_story": "The President Muhammadu Buhari government has accused Benue State governor, Samuel Ortom of inciting violence against people of Fulani ethnic group in the country.\nOrtom, whose state has been under series of attacks by suspected Fulani herdsmen, is a vocal critic of President Buhari who he accuses of protecting the interest of the Fulani to the detriment of those of other Nigerians.\n“Unfortunately, for the good citizens of Benue State, the most dangerous direction he blows in today is that of sectarianism and ethnicity.\n“Specifically, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\n“The good, and fair-minded people of Benue State deserve more than this, and we look forward to the next elections when they have an opportunity to restore its greatness.”"
  },
  {
    "headline": "Zenith Bank launches AI powered Ziva WhatsApp banking",
    "summarized_story": "OBINNA EZUGWUTop Nigerian lender, Zenith Bank Plc, has introduced an Artificial Intelligence (AI) powered Chatbot on WhatsApp named ZIVA (Zenith Intelligent Virtual Assistant), which enables customers to perform financial transactions and enjoy real-time customer service from their mobile phones.\nThis product provides the convenience for the bank’s customers to interact and transact on a 24 hours basis on the encrypted WhatsApp platform.\nCommenting on the new banking solution, the Group Managing Director/Chief Executive of Zenith Bank Plc, Mr. Ebenezer Onyeagwu said: “The launch of ZIVA is driven by the need for additional secured channels of communication with our customers as we deepen our retail penetration”.\nZenith Bank has continued to distinguish itself in the Nigerian financial services industry through superior service offerings, unique customer experience and sound financial indices.\nZenith Bank places a premium on its core business strategy anchored on People, Technology and Service, to create value for its numerous clientele."
  },
  {
    "headline": "34 Nigerian states at risk of flood – NiMet warns",
    "summarized_story": "The Nigeria Meteorological Agency (NiMet), has said there are slim chances of flash floods across 34 states of the federation in the next three days.\nThe moderate to heavy rainfall which could lead to flash floods are expected to commence from Tuesday, 24 through to Wednesday 25 and Thursday 26 of August, 2021, the agency said.\nThe Agency disclosed some States that could be affected to include; Sokoto, Zamfara, Katsina, Kaduna, Kano, Jigawa, Bauchi, Gombe, Yobe, Kebbi, Niger, FCT, Plateau, Adamawa, Taraba, Kwara, Oyo, Lagos, Ondo, Ogun, Edo, Delta, Bayelsa, Cross River, Akwa Ibom, Benue, Enugu, Ebonyi, Imo, Anambra, Abia and River States.\nA statement by NiMet’s spokesperson Muntari Ibrahim, said that the slim chances of flash flood events on roads, settlements, farmlands and bridges could be more pronounced and as a result there are increased likelihood of cars skidding off the road and chances of car crashes.\nThe agency cautioned Nigerians to take heed and avoid damages from rain related hazards occasioned by the predicted flash flood."
  },
  {
    "headline": "Lalong reimposes 24-hour curfew in Jos North as suspected herders unleash mayhem",
    "summarized_story": "Governor of Plateau State, Simon Lalong has re-imposed a 24-hour curfew in Jos North Local Government Area of the state following killing of at least 36 persons in an overnight raid on Tuesday by suspected herders.\nThe 24-hour curfew earlier imposed in the council area was relaxed last week to dusk-to-dawn alongside two other LGAs of Jos South and Bassa.\nThe statement said, “Plateau State Government has reinstated the 24-hour curfew earlier relaxed in Jos North Local Government Area following growing tensions arising from the attack on Yelwa Zangam village of the Local Government where people were killed and properties destroyed.\n“According to Governor Simon Lalong, the 24 hour will come into force from 4pm, today Wednesday 25th August 2021 until further notice.\n“Also, the 6pm to 6am curfew in Jos South and Bassa LGAs still remains in place until further notice."
  },
  {
    "headline": "Lagos PDP Chairman Dies Of COVID-19",
    "summarized_story": "The Lagos State chairman of the Peoples Democratic Party (PDP), Dr. Adegbola Dominic, is dead.\nConfirming his demise, the state publicity secretary of the party, Gani Taofeek, in a statement said, “The Lagos State PDP chairman, Dr Adegbola Dominic has just died of COVID-19 related ailments.\n‘’He had held many political positions, notable amongst being state SDP officer; state Chairman of PAC; National Chairman of APN (Founded by late Jakande); state Chairman of Lagos PDP,” the statement said.\nThe party’s spokesman also said in the statement that the late chairman once contested Lagos State governorship seat on the platform of APGA.\nHe stood for the development of Lagos and he sure regrets that this Lagos is not as he wished."
  },
  {
    "headline": "Lagos PDP Chairman Dies Of COVID-19",
    "summarized_story": "The Lagos State chairman of the Peoples Democratic Party (PDP), Dr. Adegbola Dominic, is dead.\nConfirming his demise, the state publicity secretary of the party, Gani Taofeek, in a statement said, “The Lagos State PDP chairman, Dr Adegbola Dominic has just died of COVID-19 related ailments.\n‘’He had held many political positions, notable amongst being state SDP officer; state Chairman of PAC; National Chairman of APN (Founded by late Jakande); state Chairman of Lagos PDP,” the statement said.\nThe party’s spokesman also said in the statement that the late chairman once contested Lagos State governorship seat on the platform of APGA.\nHe stood for the development of Lagos and he sure regrets that this Lagos is not as he wished."
  },
  {
    "headline": "Kidnapping, Cultism, Biggest Security Challenges Facing Ogun – Abiodun",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has listed random kidnapping and cultism as the biggest security challenges confronting the state.\nThe governor lauded the Air Wing of the Police Force for helping in combating criminal activities, especially kidnapping in the state.\n“The biggest issues we have today in Ogun State are that of random kidnapping and cult activities.\n“I believe that the cult activities have abated now because of the joint efforts of the Nigeria Police, the State Security Services and the Nigerian Army.\n“However, we are still struggling and dealing with issues that relate to kidnapping of contractors, farmers and innocent Ogun State residents."
  },
  {
    "headline": "Kidnapping, Cultism, Biggest Security Challenges Facing Ogun – Abiodun",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has listed random kidnapping and cultism as the biggest security challenges confronting the state.\nThe governor lauded the Air Wing of the Police Force for helping in combating criminal activities, especially kidnapping in the state.\n“The biggest issues we have today in Ogun State are that of random kidnapping and cult activities.\n“I believe that the cult activities have abated now because of the joint efforts of the Nigeria Police, the State Security Services and the Nigerian Army.\n“However, we are still struggling and dealing with issues that relate to kidnapping of contractors, farmers and innocent Ogun State residents."
  },
  {
    "headline": "27 Terrorists Killed As ISWAP, Boko Haram Clash",
    "summarized_story": "Scores of ISWAP and Boko Haram members have been killed during a deadly clash between the terrorist groups in Northern Abadam, Borno State.\nAccording to a news agency, PRNigeria, Boko Haram militants who had planned to surrender came under heavy attack by their angry ISWAP counterparts in the Gusuriya community, located in Dumbawa village.\nThe Boko Haram members were on their way to surrender to the Multinational Joint Task Force (MNJTF) at a border with the Niger Republic last Sunday, August 22, 2021 when they were attacked.\nADVERTISEMENTOne of the intelligence sources, who is familiar with the development, disclosed that ISWAP leadership was rattled by Boko Haram fighters’ desertion and placed a death sentence on any fleeing member in the Lake Chad axis.\n“Some high ranking Commanders bearing the titles of ‘Amir’ and ‘Khaid’ (Chiefs) at under the Shekau’s Caliphate in Sambisa were reduced to ordinary militants fighters after paying allegiance to the ISWAP leadership."
  },
  {
    "headline": "Touts attack 50 drivers, injure scores in Anambra",
    "summarized_story": "No fewer than 50 drivers were reportedly attacked by suspected touts over alleged multiple levies in Onitsha, Anambra state.\nThe touts, numbering over 30, allegedly demanded payment of multiple levies from their victims.\nMost of the drivers, predominantly commercial tricycle and motorcycle operators, were said to have been injured while their machines were damaged in the process.\nReacting, Chairman of United Commercial KEKE NAPEP and Motorcycle Riders Association (UCKEMORAN) Anambra State Chapter, Chief Arinze Igbanuka, expressed worries over the incident, saying the touts would always go scott-free after the attack.\n“There is no day that passes without 10, 20, 30, 40 and 50 drivers being attacked by the touts who collect multiple levies from them."
  },
  {
    "headline": "Touts attack 50 drivers, injure scores in Anambra",
    "summarized_story": "No fewer than 50 drivers were reportedly attacked by suspected touts over alleged multiple levies in Onitsha, Anambra state.\nThe touts, numbering over 30, allegedly demanded payment of multiple levies from their victims.\nMost of the drivers, predominantly commercial tricycle and motorcycle operators, were said to have been injured while their machines were damaged in the process.\nReacting, Chairman of United Commercial KEKE NAPEP and Motorcycle Riders Association (UCKEMORAN) Anambra State Chapter, Chief Arinze Igbanuka, expressed worries over the incident, saying the touts would always go scott-free after the attack.\n“There is no day that passes without 10, 20, 30, 40 and 50 drivers being attacked by the touts who collect multiple levies from them."
  },
  {
    "headline": "Illegal detention: Court insists EFCC must pay N10m fine to man",
    "summarized_story": "He held that there was no error or ambiguity in the earlier decision of the Federal High Court, hence, the appeal was dismissed.\nThe twist in the appellate court’s decision was the downward review of the fine slammed by the Federal High Court on the anti-graft agency.\nThe appellate court ordered that the EFCC should pay N10 million as opposed to the N50 million earlier ordered by the Federal High Court Abuja.\nThe EFCC had dragged Morakinyo to the Federal High Court Abuja on March 19 on a 23-count that bordered on alleged money laundering.\nJustice Inyang Ekwo had ruled in favour of Morakinyo and ordered that EFCC pay N50 million damages."
  },
  {
    "headline": "Illegal detention: Court insists EFCC must pay N10m fine to man",
    "summarized_story": "He held that there was no error or ambiguity in the earlier decision of the Federal High Court, hence, the appeal was dismissed.\nThe twist in the appellate court’s decision was the downward review of the fine slammed by the Federal High Court on the anti-graft agency.\nThe appellate court ordered that the EFCC should pay N10 million as opposed to the N50 million earlier ordered by the Federal High Court Abuja.\nThe EFCC had dragged Morakinyo to the Federal High Court Abuja on March 19 on a 23-count that bordered on alleged money laundering.\nJustice Inyang Ekwo had ruled in favour of Morakinyo and ordered that EFCC pay N50 million damages."
  },
  {
    "headline": "Fears as 1,106 cases of tuberculosis recorded in Ondo",
    "summarized_story": "The National Tuberculosis, Buruli Ulcer and Leprosy Control Programme, has revealed that the Ondo State has detected a total of 1106 cases of tuberculosis disease.\nAccording to the agency, the cases were recorded between January and June 2021 across the 18 local government areas of the state.\nThe Ondo State Coordinator of the programme, Dr Oluwafemi Aina, revealed the development in Akure, the state capital, on Wednesday.\nThe Coordinator stated that the cases were reported on quarterly basis, explaining that from January to March , 635 cases were recorded while from April to June, a total of 471 cases were recorded.\nAlso we have tuberculosis and leprosy supervisors in the 18 local governments who continue doing their community sensitisation by going for outreach,” Aina explained."
  },
  {
    "headline": "Breaking: Nigeria, Russia sign military pact to finish Boko Haram",
    "summarized_story": "Nigeria and Russia have signed a military pact, providing a legal framework for the supply of equipment and the training of troops, the Nigerian embassy in Moscow said on Wednesday.\nPresident Muhammadu Buhari had expressed interest in such a pact with Russia as far back as 2019, when he met with his Russian counterpart Vladimir Putin at a Russia-Africa summit.\nThe Nigerian ambassador to Russia at the time said Buhari felt Russia could help defeat the Boko Haram Islamic insurgency in the northeast of the country, which remains a major problem.\nNigeria already uses some Russian fighter jets and helicopters, alongside military equipment purchased from Western powers such as the United States.\nHe said he was not aware that the Nigerian government had made such huge order for arms."
  },
  {
    "headline": "Kathy Hochul sworn in as New York’s first female governor",
    "summarized_story": "By Cecilia OlogunagbaKathy Courtney Hochul has been sworn in as the first female governor of New York, promising to change the political culture of the state.\nHochul, a Democrat from Buffalo who turns 63 this week, officially became New York state’s 57th governor in a private ceremony.\nShe was sworn in by the state’s highest judge and will take over the office in the wake of a sexual harassment scandal that drove her predecessor, Andrew Cuomo, from power.\nCuomo had on Aug. 10 resigned because of a sexual harassment scandal that crippled his administration and that the resignation would take effect after two weeks, which is Aug. 24.\nThe new governor pledged to strengthen the state’s response to the COVID-19 pandemic and speed direct aid to residents in need."
  },
  {
    "headline": "Again, Gunmen Attack Bullion Van In Ondo, Kill Two Policemen",
    "summarized_story": "In a bullion van attack in Ondo State, gunmen suspected of being armed robbers shot and killed two mobile police officers and one civilian.\nThe robbery occurred just two weeks after a bullion van was attacked by bandits in the Emure-Ile axis of the state.\nThe dare-devil armed thieves opened fire on the bullion van and the escort van as they were in motion, according to sources.\nWhen they ran into the criminals, the bullion van was conveying an undisclosed sum of money to Rubber Estate, Araromi Obu, Odigbo Local Government, according to one source.\nA police officer and the driver of the bullion van were slain in the attack, according to the state Police Command’s spokesperson, DSP Funmilayo Odunlami."
  },
  {
    "headline": "Terrorists Revealed Names Of Nigerian Governors, Senators, Aso Rock Officials As Sponsors — Ex-Naval Officer",
    "summarized_story": "Former Nigerian Navy Commodore Kunle Olawunmi has questioned President Muhammadu Buhari’s refusal to investigate high-profile politicians revealed as sponsors by Boko Haram terrorists during interrogation.\n“I told them that the centre of gravity of Boko Haram in Nigeria is the sponsors of the programme.\n“Recently, 400 people were gathered as sponsors of Boko Haram, why is it that the Buhari government has refused to try them?\n“You remember this Boko Haram issue started in 2012 and I was in the military intelligence at that time.\nSome of them are governors now, some of them are in the Senate, some of them are in Aso Rock."
  },
  {
    "headline": "Leadership Crisis: PDP Govs Hold Emergency Meeting Thursday",
    "summarized_story": "Following the present leadership crisis in the opposition Peoples Democratic Party, PDP, governors elected on the platform will convene in Abuja on Thursday for an emergency meeting.\nC.I.D Maduabum, the Director-General of the PDP Governors’ Forum, said this in a statement on Wednesday.\nThe emergency meeting was called by the forum Chairman and Governor of Sokoto State, Aminu Tambuwal, in conjunction with his colleagues, according to the statement.\nIt was stated that the 5 p.m. meeting would discuss recent developments in the PDP.\nThe forum urged all PDP members and stakeholders to be patient as efforts were made to ensure the party’s stability in the coming days."
  },
  {
    "headline": "BREAKING: Governor Fayemi, Akeredolu Visit Tinubu In London",
    "summarized_story": "Nigerian state governors, Fayemi and Akeredolu, has joined the list of prominent Nigerians who have paid Bola Ahmed Tinubu a visit in the United Kingdom.\nWithin this 60 days, he has been visited by the President Muhammadu Buhari, Muiz Banire and former governor of Borno state, Kashim Shettima.\nTinubu was also hospitalized in Maryland, the United States, according to SaharaReporters in July 2021.\nOn August 9, Tinubu had another knee surgery at the John Hopkins University Hospital in Maryland, the United States.\nOf recent, the President, other notable politicians have paid a visit to Tinubu in London and the latter was seen with a walking stick during Buhari’s visit, confirming SaharaReporters’ story that he underwent a second surgery in the United States."
  },
  {
    "headline": "NNPC projects $57 p/barrel benchmark for 2022 budget",
    "summarized_story": "Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari has projected $57 per barrel as crude oil bench mark for 2022.\nMallam Kyari, in his presentation to the National Assembly provided a base oil price scenario in the medium term as follows $57 per barrel for 2022, $61 per barrel for 2023 and $62 per barrel for 2024.\nKyari said the assumptions were arrived at after a careful appraisal of the three-year historical dated Brent Oil Price average of $59.07 per barrel premised on Platts Spot Prices.\nHe said that people who are smuggling are not looking for officially priced petroleum products.\nThis guarantees our market at a period when every country is struggling to find market for their crude oil’’ he explained."
  },
  {
    "headline": "PDP crisis: BoT summons expanded stakeholders’ meeting",
    "summarized_story": "As the crisis rocking the Peoples Democratic Party (PDP) festers, the party’s Board of Trustees (BoT) has summoned another expanded stakeholders meeting to discuss recent development in the party.\nAfter a High Court in Port Harcourt, Rivers state, restrained the party National Chairman, Prince Uche Secondus on Monday, the factions led by PDP Deputy National Chairman (South) Elder Yemi Akinwonmi and Deputy National Chairman (North), Senator Sulieman Nazif on Tuesday laid claim to the Secondus’ seat.\nAccording to a reliable source who does not want his name to be mentioned in print, “there will be no NEC meeting this Friday.\nWhat you will have is expanded stakeholders meeting.\n“The Board of Trustees (BoT) have already sent out notice for the expanded stakeholders meeting."
  },
  {
    "headline": "Breaking: Aubameyang fires hat-trick as Arsenal ‘go goal gaga’, whip West Brom in EFL clash",
    "summarized_story": "Pierre-Emerick Aubameyang was on fire for Arsenal as his hat-trick gingered a bewildered London club that thrashed Championship side West Brom 6-0 in the Carabao cup second round contest on Wednesday night.\nNicholas Pepe, Saka and Lacazette were the other Arsenal players that registered their names on the scoresheet.\nBefore the match, Arsenal had suffered defeat during their opening English Premier League matches against Brentford and Chelsea in the past days.\nDetails loading…"
  },
  {
    "headline": "Army denies colluding with criminals in Abia State -NigPilot",
    "summarized_story": "The Nigerian Army has denied the allegation that its officers are colluding with criminals in Abia State who perpetrate criminality in the state.\nThe service, however, accused the member representing Isuikwuato constituency of Abia State in the House of Assembly of engaging in media trial.\nIt is most unfair for anyone at that height of the social ladder to sponsor a smear campaign against the Nigerian Army for whatever reason; particularly knowing that he has access to the leadership of the military.\n“The Nigerian Army, therefore, wishes to state that the misguided report is actually an abysmally failed attempt at blackmailing the NA for denying unscrupulous elements the freedom of action to foist lawlessness and violence on the good people and government of Abia state.\nWe, therefore, appeal to members of the public to approach the Army on any issue requiring clarification rather than resorting to blackmail”."
  },
  {
    "headline": "CDS orders NDA to probe invasion of the academy -NigPilot",
    "summarized_story": "The Chief of Defence Staff (CDS), General Lucky Irabor has ordered the hierarchy of the Nigerian Defence Academy (NDA) , to probe the circumstances surrounding the invasion of the Academy by armed bandits, with the view to unravel the remote and immediate cause of the compromised security.\nThe statement also noted that the alleged publication by an online news portal that the Nigerian Defence Academy (NDA) CCTV monitoring room was sleeping when bandits attacked the officers’ residential quarters leading to the death of two officers and the abduction of 1 other officer, was false.\n“The Nigerian Armed Forces wishes to state categorically that the allegation is untrue and hence challenge the Cable Online to publish forthwith a verifiable proof of personnel sleeping during the incident.\n“It is therefore imperative to caution the Cable Online media to guide against being used as a propaganda tool by enemies of our dear country.\n“The troops of the Armed Forces of Nigeria will continue with it’s operations to ensure all those involved in the dastardly act are brought to justice,” the statement conclueded."
  },
  {
    "headline": "You’ve not shown more love for Benue than PMB, Tiv youths tell Ortom",
    "summarized_story": "Tiv Youth Council Worldwide has challenged Benue State governor, Samuel Ortom, to point out projects he has executed in the state to show his love for the people.\nAccording to the group, all projects executed in the state within the last six years are done by President Muhammadu Buhari‘s administration.\nConsequently, the group president, Hon.\n“The council notes that Governor Ortom has not demonstrated love for the Benue people more than PMB.\nThe group thereby called on all Benue stakeholders, traditional leaders, groups, party men and women to speak truth to power by calling Governor Ortom to order."
  },
  {
    "headline": "Hosa Okunbo’s family denies putting Wells Carlton Hotel up for sale -NigPilot",
    "summarized_story": "The family of the late billionaire, Captain (Dr) Idahosa Wells Okunbo’s has debunked reports that they have put up Wells Carlton Hotel , Abuja for sale.\nPart of the statement reads: “The family states from the outset that the story was reprehensible, preposterous, fallacious and outright mischievous.\nThe writer went overboard in the enterprise of propagating a concocted falsehood in a noxious attempt to ridicule and dishonor the memory of Captain (Dr) Idahosa Wells Okunbo.\n“The Okunbo family stands united in ensuring the consolidation of the laudable legacy our departed dearly beloved son, brother, father, grandfather, and highly celebrated global citizen left behind.\nWe are unyielding on this commitment and nothing will distract this family, under any circumstance(s), before, during, and after the burial obsequies."
  },
  {
    "headline": "Plateau Govt Re-Imposes 24-Hour Curfew On Jos North LGA",
    "summarized_story": "The Plateau State government has re-imposed a 24-hour curfew on Jos North Local Government Area (LGA).\nDirector of Press and Public Affairs to Governor Simon Lalong, Dr Makut Macham, announced this in a statement on Wednesday.\nImposing curfew on the local government follows tensions sparked by the attack on Yelwa Zangam – a village in Zangam District of the state.\nAccording to Governor Lalong, the 24-hour curfew will come into force from 4pm on August 25 until further notice.\nGovernor Lalong equally states that the 6pm to 6am curfew in Jos South and Bassa LGAs still remains in place until further notice."
  },
  {
    "headline": "Insecurity: Matawalle Calls For State Of Emergency In Northern Nigeria",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, has called for a state of emergency in the northern part of the country over the security challenges in the region.\nRead the full text of the briefing below:My dear people of Zamfara State.\nFollowing the recent upsurge in banditry attacks in some parts of our dear State, I feel compelled to address you on the new steps being taken by my administration to contain the situation.\nThe amazing successes of our peace efforts made our initiative appealing to some of the states sharing similar experiences as our state.\nMy good people of Zamfara state, you are living witnesses to all our unwavering commitments to peace."
  },
  {
    "headline": "When Nigeria Will Stop Importing Petrol – NNPC Boss",
    "summarized_story": "Nigeria will stop the importation of Premium Motor Spirit (PMS), popularly known as petrol, when the Petroleum Industry Act (PIA) comes into full effect, and when the Dangote Refinery kicks off operations.\nThe Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mele Kyari, disclosed this on Wednesday in Abuja.\nWhile responding to questions on the Dangote Refinery, the NNPC chief justified the Federal government’s equity share in the plant.\n“Our decision to take equity in the Dangote Refinery was a very calculated and conscious decision,” Kyari said.\nThe NNPC chief disclosed that the corporation borrowed funds from the Afreximbank to pay for the stake in Dangote Refinery."
  },
  {
    "headline": "Several Feared Killed, Many Injured In Fresh Plateau Attack",
    "summarized_story": "Several persons were feared killed with many others injured after suspected herdsmen attacked Yelwa Zangam village, Zangam District in Jos North Local Government Area, Plateau State.\nThe attack which occurred on Tuesday night also left several houses burnt.\nWhile there’s yet to be any official statement from security agencies, Channels Television observed on visiting the Plateau State Specialist Hospital, that there were no fewer than 16 corpses at the morgue while those injured were receiving treatment.\nThis comes just days after the State Governor, Simon Lalong had imposed a curfew on Jos North, Bassa and Jos South Local Government areas following an attack on Rukuba Road in Jos North Local Government Area.\nTwenty-three people – who were travelling from Bauchi en-route Jos to Ikare in Ondo State – were killed in the incident while 23 others were injured during the attack."
  },
  {
    "headline": "Soldier Injured As Troops Repel Boko Haram Attack On Yobe Community",
    "summarized_story": "Troops of the Nigerian Army on Wednesday repelled an attack by suspected Boko Haram terrorists in Yobe State.\nA reliable military source confirmed to Channels Television that the troops succeeded in recovering one Toyota van out of the three the attackers came with.\nHowever, a soldier was injured and is receiving treatment after the insurgents stormed Babbangida, the headquarters of Tarmuwa Local Government Area of the north-eastern state.\nSpeaking to Channels Television via the telephone conversation, a resident Audu Yakubu, said that the attackers came in three Toyota vans and drove straight to the military base.\nBabbangida is located 50 kilometres away from Dapchi, where 110 students of the Government Girls Science Technical College were abducted in February 2018."
  },
  {
    "headline": "Governor Ortom not fit for public office – Presidency",
    "summarized_story": "The Presidency has accused Benue Governor Samuel Ortom of inciting ethnic and religious hatred in his State, steering up a Rwandan-styled crisis.\n“Governor Samuel Ortom has few political principles.\n“Specifically, Ortom stirs up hatred by targeting one single ethnic group in Nigeria – using language reminiscent of the Rwandan genocide.\n“These are not the actions of a man who should be trusted with running public services or holding public office.\n“For the governor of a major state in Nigeria to be politically driven by ethnic hatred is a stain on our country."
  },
  {
    "headline": "ISWAP, Boko Haram clash claims 27 terrorists",
    "summarized_story": "Scores of ISWAP and Boko Haram fighters have been reportedly killed during a deadly clash between the terrorist groups in Northern Abadam Local Council of Borno State.\nTVC news gathered that Boko Haram militants who had planned to surrender came under heavy attack by their angry ISWAP counterparts in the Gusuriya community, located in Dumbawa village.\nSources say the Boko Haram members were on their way to surrender to the Multinational Joint Task Force at a border with the Niger Republic when they were attacked.\nOne of the intelligence sources, who is familiar with the development, disclosed that ISWAP leadership was rattled by Boko Haram fighters’ desertion and placed a death sentence on any fleeing member in the Lake Chad axis."
  },
  {
    "headline": "Robbers again attack bullion van in Ondo, kill two persons",
    "summarized_story": "Two persons have been reportedly killed as some robbers attacked a bullion van in Ore – Shagamu-Benin Expressway Area of Ondo State on Wednesday.\nThe incident came barely two weeks after a bullion van was attacked at Emure Ile in Owo Local Government Area of the state.\nThis has brought to four bullion van attacks in the last two monthsIt was gathered that the bandits attacked the van while it was heading towards Ore from Benin in Edo state killing.\nAdvertisementThe bandits were said to have carted away some undisclosed amount of money, contained in the bullion van.\nHowever another source stated that five people were killed, including policemen and bank officials who were all in the company of the bullion van."
  },
  {
    "headline": "UK Researchers Say Covid Vaccine Protection Wanes Within Six Months",
    "summarized_story": "Protection against COVID-19 offered by two doses of the Pfizer/BioNTech and the Oxford/AstraZeneca vaccines begins to fade within six months, underscoring the need for booster shots, according to researchers in Britain.\nAfter five to six months, the effectiveness of the Pfizer jab at preventing COVID-19 infection in the month after the second dose fell from 88% to 74%, an analysis of data collected in Britain’s ZOE COVID study showed.\nFor the AstraZeneca vaccine, effectiveness fell from 77% to 67% after four to five months.\nThe company’s ZOE COVID Symptom Study app is a not-for-profit initiative in collaboration with King’s College London and funded by the Department of Health and Social Care.\nBritain and other European nations are planning for a COVID-19 vaccine booster campaign later this year after top vaccine advisers said it might be necessary to give third shots to the elderly and most vulnerable from September."
  },
  {
    "headline": "Ethiopia Developing Local Social Media Platform to Rival Twitter, Facebook – Arise News",
    "summarized_story": "Ethiopia’s communications security agency says the East African country is developing its own social media platform to rival Facebook, Twitter and WhatsApp, though it does not plan to block the global services.\nIt’s believed the Ethiopian government wants its local platform to “replace” Facebook, Twitter, WhatsApp and Zoom with the director-general of the Information Network Security Agency (INSA), Shumete Gizaw, accusing Facebook of deleting posts and user accounts which he said were “disseminating the true reality about Ethiopia”.\nInternational human rights groups have criticised the Ethiopian government for unexplained shutdowns to social media services including Facebook and WhatsApp in the past year.\nEthiopia, a country of about 115 million, has about 6 million Facebook users according to Statista.\nHe also told Al-Ain Amharic that authorities were working on the platform to replace Facebook and Twitter, while a trial has already been completed of a platform to replace WhatsApp and Zoom and that platform will soon be operational."
  },
  {
    "headline": "UK Researchers Say Covid Vaccine Protection Wanes Within Six Months",
    "summarized_story": "Protection against COVID-19 offered by two doses of the Pfizer/BioNTech and the Oxford/AstraZeneca vaccines begins to fade within six months, underscoring the need for booster shots, according to researchers in Britain.\nAfter five to six months, the effectiveness of the Pfizer jab at preventing COVID-19 infection in the month after the second dose fell from 88% to 74%, an analysis of data collected in Britain’s ZOE COVID study showed.\nFor the AstraZeneca vaccine, effectiveness fell from 77% to 67% after four to five months.\nThe company’s ZOE COVID Symptom Study app is a not-for-profit initiative in collaboration with King’s College London and funded by the Department of Health and Social Care.\nBritain and other European nations are planning for a COVID-19 vaccine booster campaign later this year after top vaccine advisers said it might be necessary to give third shots to the elderly and most vulnerable from September."
  },
  {
    "headline": "Delta Air Lines to Charge $200 Monthly Health Insurance for Unvaccinated Staff",
    "summarized_story": "Delta Air Lines on Wednesday said employees will have to pay $200 more every month for their company-sponsored healthcare plan if they choose to not vaccinate against COVID-19.\nAmerican Airlines is offering vaccinated employees an additional day off in 2022 and $50 through its employee recognition platform.\nBastian said unvaccinated Delta employees will be required to wear masks in all indoor settings, effective immediately.\nAny employee in the United States who is not fully vaccinated will be required to take a COVID-19 test every week.\nThe company will offer COVID-19 pay protection starting Sept. 30 only to fully vaccinated employees who are experiencing a breakthrough infection, he said."
  },
  {
    "headline": "Harry Kane to Stay at Tottenham as Daniel Levy Wins Man City Transfer Battle – Arise News",
    "summarized_story": "Harry Kane has announced that he will stay at Tottenham this summer after a move to Manchester City failed to materialise.\nIt has been a summer of speculation for the England captain with stories galore about a potential move to Premier League champions Manchester City.\nThe England captain, though, remains adamant that he was always scheduled to come back later than his teammates after Euro 2020.\nAt first, he worked on his fitness with Tottenham’s sports science staff, missing the first two games of the season against Manchester City and Pacos de Ferreira, the latter in the Europa Conference League play-offs.\nKane came off the bench for the final 15 minutes of the encounter and was well received by the thousands of travelling Tottenham fans."
  }
]