[
  {
    "headline": "Resign if you’re interested in politics, Gov Bello tells appointees",
    "summarized_story": "The Niger State Governor, Abubakar Bello, has directed all political appointees who are interested in contesting party executive positions to tender their resignation letters.\nSecretary to the State Government, Ahmed Matane, said this in a statement on Monday; adding that the measure was in compliance with the constitution of the ruling All Progressives Congress.\nThe statement further requested that the resignation letters should be submitted to the Office of Secretary to the State Government with immediate effect.\nThe SSG enjoined those affected to comply with the directive."
  },
  {
    "headline": "NDLEA seizes 795kg hard drugs, arrests suspects in Imo",
    "summarized_story": "The National Drug Law Enforcement Agency seized 794.5kg of hard drugs and arrested 107 suspects in Imo between January and September.\n“Six drug addicts are currently undergoing rehabilitation, while the 73 drug users who were counselled had been reunited with their families,’’ he said.\n“The NDLEA also conducted drug abuse and prevention sensitisation in the state in line with its Drug Demand Reduction programme,” he said.\n“The sensitisation was conducted at Imo State University, Owerri; ABC Transport Company Ltd, Owerri; Priscillia Memorial Secondary School, Oguta Local Government Area and at the Nigerian Navy College, Owerrinta.\nHope Uzodimma for supporting the agency and called on the Imo State government to build and equip drug rehabilitation centres with functional facilities."
  },
  {
    "headline": "Child marriage kills over 60 girls daily ― Save the Children",
    "summarized_story": "By Ibrahim Hassan – KadunaSave the Children International has said that Child Marriage Kills more than 60 Girls a day, the organisation’s Global Girlhood Report revealed on the International Day of the Girl.\nIt said an estimated 44% of girls in Nigeria are married before their 18th birthday, one of the highest rate of child marriage globally.\n“With the highest rate of child marriage in the world, West and Central Africa accounts for nearly half (9,600) of all estimated child marriage-related deaths globally, or 26 deaths a day.\n“A further 10 million girls are now expected to marry by 2030,[i] leaving more girls at risk of dying.”Inger Ashing, CEO of Save the Children International, said: “Child marriage is one of the worst and deadliest forms of sexual and gender-based violence against girls.\nGovernments must prioritise girls and ensure they’re protected from child marriage and premature childbirth-related deaths."
  },
  {
    "headline": "Imabong’s nuggets for women in troubled times",
    "summarized_story": "By Prisca Sam-DuruObviously, Imabong Martins wrote her book, “Taking Care Of Me”, while putting into cognizance, the severity of the times we are in now.\nHere in Nigeria, the bad economy is stinging harder by the day, forcing women into living a stressed-filled life; with many becoming depressed.\nThe book helps readers nurture themselves while multi-tasking, hence, its relevance in today’s world of women.\nStress is a killer and in this same chapter, women are encouraged to make out time to ‘refuel and kindle their fire’.\n“Taking Care Of Me” makes an excellent read for every woman."
  },
  {
    "headline": "ENDSARS: We’ll use legitimate means within constitutional powers to suppress planned protest – CP Odumosu",
    "summarized_story": "File photoBy Esther OnyegbulaThe Commissioner of police Lagos State Command, Hakeem Odumosu, on Monday announced that the police will use all legitimate means within their constitutional powers to suppress any planned protest.\nOdumosu said that credible intelligence at the disposal of the Command has revealed clandestine plans by some youths, individuals or groups to embark on protest today in commemoration of one year anniversary of ENDSARS.\n“The Command wishes to use this medium to warn the youths, groups, or associations planning such protest to jettison the idea forthwith.\n“To forestall breakdown of law and order, the police will use all legitimate means within their constitutional powers to suppress the planned protest.\n“Therefore, parents and guardians are advised to warn their children against participating in the planned protest."
  },
  {
    "headline": "Buhari’s bursary bonanza for education students",
    "summarized_story": "ORDINARILY, President Muhammadu Buhari’s approval of N75,000 for students of Education in our public universities and polytechnics and N50,000 in Colleges of Education per semester should be cheered by all education-loving Nigerians.\nThe Minister also said that his ministry will work with state governments to make sure that when the bursary beneficiaries graduate, they will get automatic employment.\nWe had hoped that the federal, state and local governments as well as private educators will sit together and fashion a new roadmap for education.\nAlso, in July this year, Buhari had promised to increase the federal education vote by 50 per cent and ensure that by 2025, it would have gone up to 100 per cent.\nHow far will the granting of these stipends to education students actually attract better brains to the teaching profession which is already bedevilled?"
  },
  {
    "headline": "International Day of Girl Child: Bridge underscores the importance of Girls’ Education to the society",
    "summarized_story": "However, large inequalities persist in some regions, with women and girls systematically being denied the same rights as men and boys.\nThe United Nations holds the annual International Day of the Girl Child on October 11 to promote girls’ rights and highlight gender inequalities all over the world.\nThe gender digital divide should however go beyond connectivity and access to devices, as girls still face having their ambitions questioned.\nElizabeth Williams-Charles10-year-old Elizabeth Williams-Charles is a Primary six pupil that loves to be in school learning new things with her friends.\nThe International Day of the Girl Child is marked every year, to recognise girls’ rights and the unique challenges girls face around the world."
  },
  {
    "headline": "Buhari’s two years in second term most productive – Boss Mustapha",
    "summarized_story": "Mr Boss Mustapha, Secretary to the Government of the Federation (SGF), has described the last two years of President Muhammadu Buhari’s administration as productive and remarkable.\nMustapha, who spoke during the opening ceremony of the Mid-Term Ministerial Performance Review Retreat on Monday, said the last two years of the Buhari-led administration have been most productive.\n“During this 2nd term of Mr President from May 29, 2019, to Aug. 31, the Federal Executive Council held 52 Meetings and granted 579 Approvals comprising of 381 Contracts, 110 Policies, and 88 Briefs/Notes.\n“Today, there are embedded systems for performance management and improved accountability and transparency for the delivery of services to citizens.\n“The key focus of this Mid-Term ministerial retreat is to review the status of progress towards the delivery of the nine priority areas,” NAN quoted him as saying."
  },
  {
    "headline": "Buhari reveals when second Niger Bridge, Lagos-Ibadan expressway, others will be completed",
    "summarized_story": "President Muhammadu Buhari Monday in Abuja assured Nigerians that the 11.9km Second Niger Bridge, 120 km Lagos-Ibadan Expressway and other key projects under the Presidential Infrastructure Development Fund (PIDF) will be completed within the second term of this administration.\nThese include the 11.9km Second Niger Bridge, 120 km Lagos-Ibadan Expressway, 375 km Abuja – Kaduna – Zaria – Kano Expressway, and the East-West Road.\nPresident Buhari expressed delight that over the past two years, ministers have rendered reports to the Federal Executive Council on their activities related to the achievement of their ministerial mandates.\nOn other efforts to strengthen national security, the President said it was gratifying to note that Nigeria has received six A-29 Super Tucano.\nOn the Power Sector, President Buhari noted that the implementation of a ‘Willing Buyer-Willing Seller’ policy has opened up opportunities for increased delivery of electricity to underserved homes and industries."
  },
  {
    "headline": "Afghanistan: Taliban reveals details of meeting with US officials",
    "summarized_story": "The Taliban caretaker government in Afghanistan has held talks with United States officials.\nOn Monday, the Taliban said talks with America would continue if necessary.\n“The two-day dialogue between the delegations of the Islamic Emirate of Afghanistan (IEA) and the United States of America went well”, a statement read.\nThe Taliban revealed that the U.S. representatives announced that America will provide humanitarian assistance to Afghans and facilities for other humanitarian organisations to deliver aid.\n“The meeting in which talks were candid was considered a good opportunity of understanding”, the statement added."
  },
  {
    "headline": "Kwara Arabic students’ brutality: Muslim clerics attend birthday parties, victims deserve justice – Activist",
    "summarized_story": "An activist, Abdullah Ayofe has charged the Kwara government to prosecute the Mudir (Head) of Musbaudeen Al Islamy Arabic School.\nThe school authorities are under fire for brutalizing five students, including a girl, for attending a party.\nAyofe noted that in the pictures circulating, Malt, Predator and Fayrouz were the drinks the students ordered not alcohol.\nI plead everyone across the nation to look into this.”Ayofe added that the founder of Misbaudeen Al Islamy Arabic School must, “apologize publicly after he faces his trial”.\nFollowing the outrage, the Kwara State government suspended the Madrasah Arabic School Mudir Sunday night."
  },
  {
    "headline": "Ekweremadu tasks Igbos in diaspora on S/East’s stability",
    "summarized_story": "On Nnamdi Kanu, Ekweremadu said: “Let me also assure you that the South East Caucus of the National Assembly is not resting on its oars.\nWe are working quietly and surely to address these issues, including finding a political solution to the Mazi Nnamdi Kanu matter.\nWe also did it in the case of Mazi Nnamdi Kanu in 2017.\nEkweremadu, however, enjoined the Igbo in the diaspora to show interest in leadership recruitment in Igboland.\n“The Igbo diaspora must show more than a passing interest in leadership recruitment at all levels in Alaigbo."
  },
  {
    "headline": "Lagos CP warns #EndSARS anniversary protesters",
    "summarized_story": "The Lagos State Command of the Nigeria Police Force said credible intelligence at its disposal has revealed clandestine plans by some youths, individuals or groups to embark on protest today in commemoration of one year anniversary of #ENDSARS.\nHe said: “The Command wishes to use this medium to warn the youths, groups, or associations planning such protest to jettison the idea forthwith.\n“To forestall breakdown of law and order, the police will use all legitimate means within their constitutional powers to suppress the planned protest.\n“Therefore, parents and guardians are advised to warn their children against participating in the planned protest.\n“Meanwhile, the Commissioner of Police, CP Hakeem Odumosu assures all law-abiding residents of the state to go about their legitimate businesses without fear of harassment or intimidation."
  },
  {
    "headline": "Many persons waiting for Nigeria to disintegrate –FG",
    "summarized_story": "Minister of Information and Culture, Alhaji Lai Mohammed, has expressed optimism that Nigeria would emerge from its challenges stronger.\n“It is unfortunate today that many people are waiting for the country to disintegrate and many of them are disappointed that we are still standing on our feet.\nHe said Nigerians should resist the temptation by some selfish elites campaigning that Nigeria was better divided.\n“It is because there is a country call Nigeria that is why there are journalists, professors, doctors and what have you.\nThe distance from Maiduguri to Bama is about 78 kilometres, but no single vehicle is on the way."
  },
  {
    "headline": "Boss Mustapha, SGF, to chair The Sun Awards",
    "summarized_story": "Secretary to the Government of the Federation (SGF), Mr. Boss Mustapha, will be the chairman of The Sun Awards 2020.\nThe Sun Awards 2020 holds on Saturday, October 16, 2021 at the Expo Convention Centre, Eko Hotels & Suites, Victoria Island, Lagos.\nIn accepting the invitation to chair the awards ceremony, Mustapha said it would be a delight to be part of an event honouring Nigerians who have done well in different fields of human endeavours.\nNnamdi Ezeigbo, chairman, SLOT Systems Limited and Dr. ABC Orjiako, chairman, SEPLAT Petroleum Company Ltd (Entrepreneur of the Year); Alhaji Mustapha Ado, chairman, Ammasco International Ltd and Chief Ebuka Onunkwo, chairman, Seahorse Lubricant Industries Limited (Industrialist of the Year).\nBabagana Kingibe, former SGF (Lifetime Achievement); Chief Frank Okafor, chairman of Marco Polo Group Limited and Prince Chris Igwe, chairman, Mainland Oil Limited (Investor of the Year)."
  },
  {
    "headline": "1999 constitution, draconian, lopside sham -Pastor Bakare",
    "summarized_story": "By Chinelo ObogoServing Overseer of The Citadel Global Community Church (CGCC) and Convener, Save Nigeria Group (SNG), Pastor Tunde Bakare, has described the 1999 constitution as draconian and lopsided sham which must be torn down for the country to move forward.\nHe said many of those who say Nigeria’s unity is non-negotiable pay lipservice to a version of unity that serves their selfish interests.\n“Our founding fathers signed a contract in 1960 detailing the terms and conditions of our union or unity following a series of negotiations.\nWhile the 1999 Constitution opens with the preamble: “We the people,” ‘we, the people of Nigeria’ were neither duly consulted nor did we accept the conditions under which we are now being governed.\nHow, then, can anyone hypocritically insist that our unity is non-negotiable?"
  },
  {
    "headline": "2022 Budget: Exchange rate gap’ll worsen deficit, arbitrage –Experts",
    "summarized_story": "By Chinwendu ObienyiThere are fresh concerns that Nigeria’s 2022 budget presented last week to the National Assembly by President Muhammadu Buhari would widen the deficit and escalate arbitrage in the foreign exchange (FX) market.\nPresident Buhari had stated that the 2022 Appropriattion Bill was meant to build on the achievements of previous budgets to deliver on the nation’s goals and aspirations as encapsulated in its soon-to-be launched National Development Plan of 2021 to 2025.\nHe also stated that the priorities of the 2022 budget would be diversifying the economy, with robust MSME growth; investing in critical infrastructure; strengthening security and ensuring good governance; enabling a vibrant, educated and healthy populace; reducing poverty; and minimizing regional, economic and social disparities.\nThey also expressed concerns that pegging the naira official rate at N410 when exchange rate is almost at N600/$1 was an unrealist proposition.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Osinbajo: Buhari is Nigeria’s Most Popular, Only Credible Leader Ever",
    "summarized_story": "Osinbajo stressed the need for Nigeria to remain an indivisible country, assuring that its challenges would soon be overcome.\nThe vice president spoke during an interactive session with top officials of the Nigerian High Commission in London.\nHe declared, “If you look at all of us sitting here, we represent all the geopolitical zones.\n“We need that level of credibility to be able to solve problems in our country.\n“Let us not be discouraged, let us be very confident, because our country will come out of all these problems and emerge stronger."
  },
  {
    "headline": "Tinubu: Only God Can Take My Life",
    "summarized_story": "*Gbajabiamila, Sanwo-Olu, Olamilekan say work has started for task aheadSegun JamesNational leader of All Progressives Congress (APC), Senator Bola Tinubu, yesterday, said only God, the giver of life, could take his life.\nTinubu made the remarks on Sunday at the Lagos House, Marina, in his “Thank you speech” during a reception to welcome him back home, organised by Governor Bababjide Samwo-Olu of Lagos State, on behalf of the state government.\nThe reception featured prayers for Tinubu, who expressed gratitude to God for bringing him back to Nigeria safely.\nGod is the giver of life and He alone can take it.\nWe thank you for your guidance, we pray, we will continue to enjoy your mentorship.”Hamzat said, “It is only God that is constant; He cannot sick."
  },
  {
    "headline": "Falana Writes AGF, Seeks Enforcement of $62bn Supreme Court Judgment against IOCs",
    "summarized_story": "Falana in the letter dated October 8, 2021, also threatened legal action against the AGF if he refuses to enforce the said judgment.\nHe wrote on behalf of his clients Professor Omotoye Olorode and Jaye Gaskia of the People’s Alternative Political Movement (PAPM).\nThe letter titled: “Request For Compliance with Judgment of The Supreme Court of Nigeria in Suit No SC.\nLet us consider that as a lost opportunity, the money was not in a cupboard, they have taken it.\n“As we await your reply to this letter please accept the assurances of our highest esteem and professional regards”, the letter added."
  },
  {
    "headline": "2022 Budget: National Assembly Gets N234bn",
    "summarized_story": "The President had last Thursday presented the 2022 Aggregate FGN Expenditure (inclusive of GOEs and project-tied Loans) projected to be N16.39 trillion, which was 12.5 per cent higher than the 2021 budget.\nThe proposed N134 billion as National Assembly’s statutory allocation for the 2022 fiscal year was N6 billion higher than the sum of N128 billion proposed by the Presidency in the 2021 budget estimates which was approved by the legislative arm.\nOther 2022 budget lines captured in the Statutory Transfer included: “N120 billion (against N110 billion proposed in 2021 estimates) for National Judicial Council (NJC); N46.172 billion (against N29.70 billion proposed in 2021 estimates) for North East Development Commission (NEDC); N4.5 billion (against N3 billion proposed in the 2021 estimates) for National Human Right Commission (NHRC); N98.712 billion (against N63.51 billion) for Niger Delta Development Commission (NDDC).\nIn all, a total sum of N24,835,805,231 was earmarked for the Office of the President which came under State House Operations and made up of N2,861,041,921 for overhead and N21,974,763,310 for capital expenditure.\nIn addition, the State House headquarters got a budget proposal of N12,313,408,181 with the components being N1,736,064,934 for personnel, N2,860,063,433 for overhead and N7,717,279,814 for capital."
  },
  {
    "headline": "Electoral Act: Saraki Appeals to N’Assembly on Direct Primaries",
    "summarized_story": "“Even if the big parties have the funds and facilities to organise direct primaries nationwide, how about the smaller parties?\nThe direct primaries option will also put pressure on the Independent National Electoral Commission (INEC), whose officials must monitor all the primaries.\n“The direct primaries provision may work for us in the future but not now that we are not prepared for it as the primaries may hold next June.\nThe time for adequate and necessary preparations towards direct primaries is even not there.\n“From my experience, this issue of direct primaries was raised in the Eighth National Assembly, when we passed the Electoral Act (amendment) Bill."
  },
  {
    "headline": "2022 Budget: Loan-Borrowing Buhari Presidency To Spend N13billion On Presidential Jets, N2.3billion On Foreign, Local Trips",
    "summarized_story": "President Muhammadu Buhari will spend a total of N2,309,066,788 on foreign and local trips in 2022.\nThe figure is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe President is also expected to spend a total of N12.5 billion on the Presidential Air Fleet in 2022.\nAbout N1.6 billion is provided for the purchase of vehicles and spares.\nAbout N180,089,000 is provided for purchase of tyres for bulletproof vehicles, plain cars, CCU vehicles, platform trucks, jeeps, ambulances and other utility and operational vehicles."
  },
  {
    "headline": "2022 Budget: Loan-Borrowing Buhari Presidency To Spend N13billion On Presidential Jets, N2.3billion On Foreign, Local Trips",
    "summarized_story": "President Muhammadu Buhari will spend a total of N2,309,066,788 on foreign and local trips in 2022.\nThe figure is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe President is also expected to spend a total of N12.5 billion on the Presidential Air Fleet in 2022.\nAbout N1.6 billion is provided for the purchase of vehicles and spares.\nAbout N180,089,000 is provided for purchase of tyres for bulletproof vehicles, plain cars, CCU vehicles, platform trucks, jeeps, ambulances and other utility and operational vehicles."
  },
  {
    "headline": "How Buhari's Attorney General, Malami Conspired With Adoke Against Nigeria’s Interest In Over $1billion Malabu Oil Scam",
    "summarized_story": "Fresh moves by Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) to thwart the prosecution of suspects in the Malabu oil scam, including one of his predecessors, Mohammed Adoke have been uncovered.\nThe Malabu oil scandal involved the transfer of over $1 billion by Shell and ENI through the Nigerian government to accounts controlled by a former Nigerian Petroleum Minister, Dan Etete.\nOther defendants include Abubakar, Rasky Gbinigie, and four companies- Malabu Oil and Gas Limited, Nigeria Agip Exploration Limited, Shell Nigeria Ultra Deep Limited, and Shell Nigeria Exploration Production Company Limited.\nMost Nigerians don’t know there is a conspiracy that was arched in the Maitama private office of Malami between Malami, Turaki, and Adoke.\nThe Italian court which indicted Adoke of receiving bribes in the deal must also be monitoring developments,” the source said."
  },
  {
    "headline": "How Buhari's Attorney General, Malami Conspired With Adoke Against Nigeria’s Interest In Over $1billion Malabu Oil Scam",
    "summarized_story": "Fresh moves by Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) to thwart the prosecution of suspects in the Malabu oil scam, including one of his predecessors, Mohammed Adoke have been uncovered.\nThe Malabu oil scandal involved the transfer of over $1 billion by Shell and ENI through the Nigerian government to accounts controlled by a former Nigerian Petroleum Minister, Dan Etete.\nOther defendants include Abubakar, Rasky Gbinigie, and four companies- Malabu Oil and Gas Limited, Nigeria Agip Exploration Limited, Shell Nigeria Ultra Deep Limited, and Shell Nigeria Exploration Production Company Limited.\nMost Nigerians don’t know there is a conspiracy that was arched in the Maitama private office of Malami between Malami, Turaki, and Adoke.\nThe Italian court which indicted Adoke of receiving bribes in the deal must also be monitoring developments,” the source said."
  },
  {
    "headline": "How Buhari's Attorney General, Malami Conspired With Adoke Against Nigeria’s Interest In Over $1billion Malabu Oil Scam",
    "summarized_story": "Fresh moves by Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) to thwart the prosecution of suspects in the Malabu oil scam, including one of his predecessors, Mohammed Adoke have been uncovered.\nThe Malabu oil scandal involved the transfer of over $1 billion by Shell and ENI through the Nigerian government to accounts controlled by a former Nigerian Petroleum Minister, Dan Etete.\nOther defendants include Abubakar, Rasky Gbinigie, and four companies- Malabu Oil and Gas Limited, Nigeria Agip Exploration Limited, Shell Nigeria Ultra Deep Limited, and Shell Nigeria Exploration Production Company Limited.\nMost Nigerians don’t know there is a conspiracy that was arched in the Maitama private office of Malami between Malami, Turaki, and Adoke.\nThe Italian court which indicted Adoke of receiving bribes in the deal must also be monitoring developments,” the source said."
  },
  {
    "headline": "'The exchange rate is artificially low' -- Osinbajo asks CBN to devalue naira",
    "summarized_story": "Vice-President Yemi Osinbajo has called on the Central Bank of Nigeria to devalue the naira to reflect the reality of the market.\nAdvertisementSpeaking at the midterm retreat of President Muhammadu Buhari’s second tenure, the vice-president said the exchange rate is artificially low, and this is deterring investors from bringing foreign exchange into the country.\n“As for the exchange rate, I think we need to move our rates to [be] as reflective of the market as possible.\n“We can’t get new dollars into the system, where the exchange rate is artificially low.\nSpeaking on surviving the economic challenge of 2020, Osinbajo said Buhari deserves the credit for providing steady leadership through the crisis."
  },
  {
    "headline": "'The exchange rate is artificially low' -- Osinbajo asks CBN to devalue naira",
    "summarized_story": "Vice-President Yemi Osinbajo has called on the Central Bank of Nigeria to devalue the naira to reflect the reality of the market.\nAdvertisementSpeaking at the midterm retreat of President Muhammadu Buhari’s second tenure, the vice-president said the exchange rate is artificially low, and this is deterring investors from bringing foreign exchange into the country.\n“As for the exchange rate, I think we need to move our rates to [be] as reflective of the market as possible.\n“We can’t get new dollars into the system, where the exchange rate is artificially low.\nSpeaking on surviving the economic challenge of 2020, Osinbajo said Buhari deserves the credit for providing steady leadership through the crisis."
  },
  {
    "headline": "SGF: Buhari administration approved 878 contracts in six years",
    "summarized_story": "Boss Mustapha, secretary to the government of the federation, says the administration of President Muhammadu Buhari approved 878 contracts in the past six years.\nThe SGF said the Buhari administration also approved 319 policies and 206 briefs/notes within the last six years, adding that analysis of the approved policies show that the administration is committed to addressing the myriads of needs and challenges of citizens.\nMustapha said the last two years have been the most productive as the federal executive council approved 381 contracts, 110 policies and 88 briefs/notes.\n“Overall, the total number of contracts, policies and briefs/notes approved by the federal executive council between November 2015 and August 2021 stand at 1,403 comprising 878 contracts, 319 policies and 206 briefs/notes.\nAdvertisement“From the above, the 878 contracts approved by FEC have mostly targeted the provision of infrastructure, geared towards enabling faster economic growth and development."
  },
  {
    "headline": "SGF: Buhari administration approved 878 contracts in six years",
    "summarized_story": "Boss Mustapha, secretary to the government of the federation, says the administration of President Muhammadu Buhari approved 878 contracts in the past six years.\nThe SGF said the Buhari administration also approved 319 policies and 206 briefs/notes within the last six years, adding that analysis of the approved policies show that the administration is committed to addressing the myriads of needs and challenges of citizens.\nMustapha said the last two years have been the most productive as the federal executive council approved 381 contracts, 110 policies and 88 briefs/notes.\n“Overall, the total number of contracts, policies and briefs/notes approved by the federal executive council between November 2015 and August 2021 stand at 1,403 comprising 878 contracts, 319 policies and 206 briefs/notes.\nAdvertisement“From the above, the 878 contracts approved by FEC have mostly targeted the provision of infrastructure, geared towards enabling faster economic growth and development."
  },
  {
    "headline": "ALERT: Stop consuming unapproved US infant formulas, NAFDAC warns Nigerians",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) has warned Nigerians against consuming and distributing infant formulas manufactured by Able Group, a US-based company.\nAdvertisementAccording to NAN, Moji Adeyeye, NAFDAC director general, disclosed in a statement that the agency received information from the US-FDA on the recall of certain infant formulas.\nAdeyeye said the infant formulas from the company were said to contain insufficient iron levels and lacked other requirements of the US Food and Drug Administration (US-FDA).\nAdvertisementShe named the products as HiPP comfort milk formula; HiPP Dutch stage one combiotic infant milk formula; HiPP HA Germany hypoallergenic stage pre-combiotic infant milk formula; Holle Bio stage one organic infant milk formula, Holle Bio stage pre-organic infant milk formula; Lebenswert Anfangsmilch stage one organic infant milk formula, and HiPP UK stage one combiotic first infant milk formula.\n“Infant formula products that contain less than one milligram of iron per 100 calories are required to include a statement on the label indicating that additional iron may be necessary,” she said."
  },
  {
    "headline": "Aggregators are enabling independent voices in Kenya’s controlled news circuit",
    "summarized_story": "Data-driven digital media is taking the place of print in Kenya.\nEmerging to take the place of rifling through the morning newspaper are scrollable, swipeable news aggregators that have the potential to change Kenya’s media landscape.\nThe Standard Group comes in second, with three spin-offs: The Standard, The Standard on Saturday, and The Standard on Sunday.\nMuch like other aggregators, like Google News and Flipboard, Opera News’ AI crawls the internet for content.\nAs Kenya’s 2022 elections draw near, content moderation will become harder than ever and the nation’s news aggregators will have to rise to the challenge."
  },
  {
    "headline": "China’s growing influence is transforming African tech",
    "summarized_story": "The African market offers Chinese companies and investors a growing young population expected to reach 1.7 billion by 2030.\nThese Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\n“Until African countries manufacture their own equipment, they’ll always be susceptible to international organisations having access to their data,” Tugendhat said.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "Attend the Product-Led Growth (PLG) guide, for B2C mobile apps, founders’ meet and greet hosted by Netcore, in partnership with Techpoint Africa",
    "summarized_story": "In three words — product-led growth (PLG).\nBut, what does product-led growth actually mean?\nThis playbook is your pocket guide to understanding product-led growth in depth and uncovering key strategies to embracing and implementing a product-led strategy.\nB2C mobile apps have been implementing solutions to improve in-app user experiences without realising that these strategies tie back to product-led growth.\nProduct teams own product-led growthThe success of a PLG strategy is a lot about the product itself and a little less about the product teams."
  },
  {
    "headline": "The African woman’s tech journey, Payday’s $1m pre-seed, Nigeria’s bread scarcity",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nAccording to Techpoint Africa’s West African Startup Decade Report 2020, only 10% of startups with a female co-founder have raised $1 million.\nAdvertisementDespite these statistics, some African women have defied the odds and are gradually turning the tables in the tech scene.\nBut I found a thread on Twitter by Joshua Wong, co-founder, Tokyo Coding Club, about lessons for startup founders and thought I should share.\nWatchOpportunitiesTalentQL is organising a 1-week private bootcamp for African Startups’ CTOs, Engineering Managers & Tech Leads facilitated by Engineering Managers from FAAMG."
  },
  {
    "headline": "Nabsolute’s SpinHeard for artists, Uber’s latest expansion, and Klasha’s $2.4m seed",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Nabsolute’s SpinHeardUber’s expansionKlasha’s $2.4m seedNabsolute’s SpinHeard aims to help independent artistsVictor Okpala, Founder of Nabsolute.\nAdvertisementThis is what Nabsolute Media, a media communications and marketing agency based in Nigeria, is looking to do for independent artists with its recently launched platform, SpinHeard.\nUS-based technology company, Uber, known primarily for its ride-hailing service, has announced an expansion into Ibadan and Port Harcourt.\nKlasha’s $2.4m seed round will be used to bolster cross-border payments infrastructureJessica Anuna, Klasha’s FounderFirst, the news: Klasha, a US-based, Africa-focused cross-border payments startup, has announced raising $2.4m in seed investment.\nNotable eCommerce platforms like WooCommerce and OpenCart have integrated Klasha’s plugins, with the startup also having an official partnership with BigCommerce."
  },
  {
    "headline": "Buhari’s insatiable appetite for debt",
    "summarized_story": "Nigeria’s debt stock has tripled under the current administration to N35 trillion as at June 2021.\nThe World Bank recently ranked Nigeria fifth on the list of 10 countries to which it has the highest debt exposure.\nAccording to the figures from the Debt Management Office (DMO), Nigeria’s debt profile had risen to 31.009 trillion naira (USD 85.897 billion) as of June 2020.\nNigeria’s economic growth fell from 11.9% in 2015 to 0.51% in Q1 2021, and then rose to 5.01% in Q2 2021.\n“Since assuming office in 2015 President Buhari’s government has added considerably to the nation’s debt, which now exceeds $85 billion."
  },
  {
    "headline": "Buhari’s insatiable appetite for debt",
    "summarized_story": "Nigeria’s debt stock has tripled under the current administration to N35 trillion as at June 2021.\nThe World Bank recently ranked Nigeria fifth on the list of 10 countries to which it has the highest debt exposure.\nAccording to the figures from the Debt Management Office (DMO), Nigeria’s debt profile had risen to 31.009 trillion naira (USD 85.897 billion) as of June 2020.\nNigeria’s economic growth fell from 11.9% in 2015 to 0.51% in Q1 2021, and then rose to 5.01% in Q2 2021.\n“Since assuming office in 2015 President Buhari’s government has added considerably to the nation’s debt, which now exceeds $85 billion."
  },
  {
    "headline": "Nigeria’s 2022 Budget: Where is the Money Going?",
    "summarized_story": "Nigeria’s 2022 Budget: Where is the Money Going?\nNigeria’s minister of finance, budget and national planning, Zainab Ahmed, made a presentation Friday on how the 2022 budget will be allocated.\nAggregate Capital Expenditure of N5.35trillion is 32.7% of total expenditure.\nAt N3.16tn, the repayment of loans or debt servicing gulps 22% of the total expenditure and 35.6% of total revenues.\nThis represents 38% of the total budget and 3.39% of Nigeria’s GDP."
  },
  {
    "headline": "Obaseki felicitates with Lady Eghobamien at 80 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has joined family members and well-wishers to celebrate Lady Amenaghawon Eghobamien, on her 80th birthday.\nSpeaking at an event held in Benin City to celebrate Lady Eghobamien’s 80th birthday, Obaseki said, “We are here to celebrate mama as she is a branch of the Ogbeide-Oyo family.\nHer late husband, Alfred Eghobamien was a special uncle and we all know the contributions he made for the development of the society and also to our government.\n“We are privileged to celebrate mama at 80 as a family.\nWe pray she continues to be with us for many more years to come in good health,” he added."
  },
  {
    "headline": "Edo Innovates gets Board of Directors, with Asemota as chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has inaugurated a Board of Directors for Edo Innovates, to drive the next phase of development of the state’s innovation hub to launch and support careers in technology and innovation in the state.\nThe board is chaired by the Founder and Chief Executive Officer (CEO) of Swifta Systems and Services, Mr. Victor Asemota, with Hub Manager of Edo Innovates, Mr. Asemota Izoduwa Precious as Secretary.\nAccording to the governor, “Edo Innovates is an initiative of the Edo State Government with an objective to leverage skills development and investment promotion in tech for job creation.\nHe noted that the key purpose of the Edo Innovates Board of Directors is to serve as the overarching layer in the governance structure of Edo Innovates, providing strategic policy guidance, strengthening the governance structure to re-assure existing and new stakeholders and support the government’s objectives of a thriving hub.\nFor example, online work and micro-work are global work opportunities that could be made available to the youth of Edo State,” Obaseki noted."
  },
  {
    "headline": "Obaseki approves 2021 promotions for Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has approved 2021 promotions for workers in the state’s civil and public service.\nThe approval was disclosed in a letter dated September 28, 2021 and signed by the Functioning Permanent Secretary, Directorate of Establishment, Training and Manpower Services, Mrs. F.A.O Edwards on behalf of the Edo State Head of Service, Anthony Okungbowa Esq.\nShe explained that the approval is in line with the government’s commitment to the welfare of the workers in order to improve efficiency, productivity and optimal service delivery.\nThe letter with Reference Number TM.701/VOL.11/101, directed all Ministries and Extra-Ministerial Departments “to forward the list of all eligible officers on grade level 07 to 16 who are due to be promoted in the year 2021 to the Office of the Head of Service for necessary action.”The government also directed that “the Name, Rank, Grade Level, Date of Birth, Date of Confirmation, Date of Present Appointment and Retirement of the Officers should be forwarded to the Office of the Head of Service.”The circular, which is directed to be treated as extremely urgent, was sent to the Office of the Secretary to the State Government, Head of Service, All Honourable Commissioners, Permanent Secretaries, and All Heads of Extra Ministerial Departments.\n“All Accounting Officers are to with immediate effect ensure strict compliance with this directive,” the letter read."
  },
  {
    "headline": "UNIJOS, National Film Institute and War of Regularisation – Nigerian Observer",
    "summarized_story": "I got an SMS from a number saying I had been admitted to study Film at the National Film Institute, Jos.\nOn the surface, it’s because I’m yet to have my original JAMB admission letter, but, deep down, there’s more to this than meets the eye.\nI got admission to study film at the National Film Institute, Jos in 2015.\nFrom November 2nd, 2020 up till now, I still haven’t received my original JAMB admission letter.\nBut what is the struggle for printing admission letter really all about?"
  },
  {
    "headline": "Pandora Papers: Ex-governors, ex-minister, others kept N117 billion assets in two tax haven banks",
    "summarized_story": "The co-own BVI company, Allendale Properties, worth $1.5 million and £2.5 million (about N2.8 billion), kept with Standard Chartered Bank Jersey.\nThrough the three entities, he had assets worth $1.7 million and £1 million kept with Standard Chartered Bank in Jersey.\nThe three entities held assets worth $3.9 million (approximately N2.3 billion) with Standard Chartered Bank (Jersey).\nHe had his $3.3 million (N2.6 billion) worth of assets in Standard Chartered Bank, Jersey.\nThat company and Mr Otedola’s Fenman 2 Settlement kept $34.4 million (N19.8 billion) with Standard Chartered Bank, Jersey."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "More ministers may go as Buhari opens cabinet performance review",
    "summarized_story": "More ministers may be headed for the exit door as President Muhammadu Buhari, today, declared open, the Mid-term ministerial performance review in Abuja.\nRecall that the president had on September 1, removed the Ministers of Agriculture, Mohammed Sabo Nanono, and Mamman Saleh, his power counterpart and replaced with the Ministers of Environment, Mohammed Mahmoud Abubakar, and Minister of State, Works and Housing, Abubakar Aliyu.\nHe had warned that exercise would be a continuous process, and his latest review has sparked uncertainly among his cabinet and other top government officials as to what lies ahead of them.\nPresident Buhari noted that the idea of the assessment is to identify weak areas with a view to strengthening the ability of the government to deliver the goods to the peopleFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Nigeria’s external reserve rise to $42bn on Eurobond inflow",
    "summarized_story": "Nigeria’s external reserves have risen to $42 billion, a 25-month high on the back inflow of the recent Eurobond issued by the federal government.\nThe last time the country’s external reserves were around their present value was on September 26, 2019, when it was $42.05 billion.\nAnalysts also revealed that forex rationing by the central bank has also supported the external reserves accretion.\nIt pointed out that even though Nigeria’s external reserves have risen, the country’s debt level has also been climbing.\nThe World Bank recently raised Nigeria’s 2021 growth forecast to 2.4 per cent, from 1.8 per cent previously."
  },
  {
    "headline": "NUPENG calls off planned strike to allow government address grievances",
    "summarized_story": "The National Union of Petroleum and Natural Gas Workers (NUPENG), has called its planned strike to allow the federal government to address issues.\nNUPENG had said the strike became necessary because it has lost many members and properties due to dilapidated roads.\nHowever, the Nigerian National Petroleum Corporation (NNPC) had appealed to the union to shelve the planned strike as it will negatively affect energy security.\nSpeaking to NAN on Sunday, Aboyeji said the planned strike by NUPENG and its affiliate association — the petroleum tanker drivers (PTD) — has been suspended in the interest of Nigerians.\nAccording to him, the suspension of the strike will allow the government to address the issues raised by the union."
  },
  {
    "headline": "Electoral Bill: Senate, Reps C’ttees to meet for harmonisation",
    "summarized_story": "Senate and House of Representatives committee members on the Electoral Act Amendment Bill will meet this week for deliberation and harmonisation of the discrepancies in the bill.\nThe panel was set up to harmonise grey areas in the bill, passed by both chambers in July.\nThis is even after members of the House committee were said to have agreed with the Senate on both direct and indirect methods.\n“We have met on the side of the House but we have not met with the Senate side as a joint committee for harmonisation.\nI can assure you that the National Assembly would be done with Electoral Bill this month,” the source said."
  },
  {
    "headline": "Gbajabiamila Organises Workshop For Kano Health Workers",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has organised a three-day training workshop for over 65 health workers in Kano State, with a view to strengthening their capacity for better service delivery and professionalism.\nThe workshop with the theme, ‘Improving Patient’s Outcome Through Ethical Conduct and Professionalism in the Covid Era,’ was aimed at reawakening the health workers to the seriousness of their duties and the need for them to adhere to ethical principles and standards.\nThe second in the series of the national health programme of the Speaker, the workshop was also to instill in health workers a diligent attitude when attending to patients and to remind them of the legal rights of patients in the case of an injury caused as a result of medical negligence.\nThe Kano State Commissioner for Health, Dr. Aminu Ibrahim Tsanyawa, represented by the Director of Medical Services in the ministry, Dr. Shehu Usman Abdullahi, noted that both the Speaker and Governor Ganduje shared the same vision for the health sector.\nThe Speaker had organised a similar national health programme in Lagos last November where many health workers were trained for better service delivery."
  },
  {
    "headline": "Gbajabiamila Organises Workshop For Kano Health Workers",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has organised a three-day training workshop for over 65 health workers in Kano State, with a view to strengthening their capacity for better service delivery and professionalism.\nThe workshop with the theme, ‘Improving Patient’s Outcome Through Ethical Conduct and Professionalism in the Covid Era,’ was aimed at reawakening the health workers to the seriousness of their duties and the need for them to adhere to ethical principles and standards.\nThe second in the series of the national health programme of the Speaker, the workshop was also to instill in health workers a diligent attitude when attending to patients and to remind them of the legal rights of patients in the case of an injury caused as a result of medical negligence.\nThe Kano State Commissioner for Health, Dr. Aminu Ibrahim Tsanyawa, represented by the Director of Medical Services in the ministry, Dr. Shehu Usman Abdullahi, noted that both the Speaker and Governor Ganduje shared the same vision for the health sector.\nThe Speaker had organised a similar national health programme in Lagos last November where many health workers were trained for better service delivery."
  },
  {
    "headline": "Vigilantes Arrest 2 Suspected Armed Robbers In Kwara",
    "summarized_story": "Some gallant local vigilantes have arrested two members of an armed robbery gang which has been terrorising the people of Asa local government area of Kwara State.\nLEADERSHIP gathered that the armed robbers had been terrorising the people of the LGA, especially in Temidire and Alapa communities in recent times.\nNemesis, however, caught up with two of the suspected armed robbers last Saturday as some vigilantes chased and arrested them after a robbery operation in Alapa community.\nThe spokesman of NSCDC, Kwara State Command, Babawale Afolabil confirmed the arrest of the two suspected armed robbers to LEADERSHIP.\n“There have been report of the nefarious activities of armed robbers at some communities at Alapa town in Asa local government area of the state."
  },
  {
    "headline": "Vigilantes Arrest 2 Suspected Armed Robbers In Kwara",
    "summarized_story": "Some gallant local vigilantes have arrested two members of an armed robbery gang which has been terrorising the people of Asa local government area of Kwara State.\nLEADERSHIP gathered that the armed robbers had been terrorising the people of the LGA, especially in Temidire and Alapa communities in recent times.\nNemesis, however, caught up with two of the suspected armed robbers last Saturday as some vigilantes chased and arrested them after a robbery operation in Alapa community.\nThe spokesman of NSCDC, Kwara State Command, Babawale Afolabil confirmed the arrest of the two suspected armed robbers to LEADERSHIP.\n“There have been report of the nefarious activities of armed robbers at some communities at Alapa town in Asa local government area of the state."
  },
  {
    "headline": "Ebonyi Bans Storage Of Solid Minerals In Residential Buildings",
    "summarized_story": "Ebonyi State Ministry of Solid Minerals Development yesterday warned residents of the state against storage of solid minerals in residential buildings, insisting that such unhealthy acts are prohibited by the law.\nThe special assistant to the state governor on solid minerals, Hon Ozoemena Njoku who gave the warning in a statement said that henceforth, any one caught storing solid minerals in residential areas shall have such buildings sealed and the persons involved prosecuted by law.\nHe further warned that any confiscated solid minerals not cleared within seven days will be disposed of by the committee on solid minerals and the amount realised paid into the state IGR account.\n“All miners and dealers on solid minerals are to proceed to the Ministry of Solid Minerals Development Communities to register their Warehouses.\n“The mining companies and buyers of solid minerals are advised to install their weighing bridge for easy assessment of the tonnage of every truck loaded with solid minerals."
  },
  {
    "headline": "10 AMAZING FACTS ABOUT FORMER ANAMBRA GOV, PETER OBI",
    "summarized_story": "2 He was a two-term governor of Anambra State and hugely transformed the state during his tenure.\n3 Celebrated and soft-spoken Obi was the vice presidential candidate of the PDP in the 2019 general election.\n4 Obi was the first Governor in Nigeria to legally challenge his wrongful impeachment and was reinstated by the Courts.\n6 Multiple awards winning Obi is the recipient of the Bill and Melinda Gates Foundation’s Best Performing Governor on Immunisation in South East Nigeria.\n9 Obi, a former chairman of south east governors forum, was also an ex chairman, board of Securities and Exchange Commission, (SEC)."
  },
  {
    "headline": "10 AMAZING FACTS ABOUT FORMER ANAMBRA GOV, PETER OBI",
    "summarized_story": "2 He was a two-term governor of Anambra State and hugely transformed the state during his tenure.\n3 Celebrated and soft-spoken Obi was the vice presidential candidate of the PDP in the 2019 general election.\n4 Obi was the first Governor in Nigeria to legally challenge his wrongful impeachment and was reinstated by the Courts.\n6 Multiple awards winning Obi is the recipient of the Bill and Melinda Gates Foundation’s Best Performing Governor on Immunisation in South East Nigeria.\n9 Obi, a former chairman of south east governors forum, was also an ex chairman, board of Securities and Exchange Commission, (SEC)."
  },
  {
    "headline": "Student’s allegations: Trouble looms as senate summons FUTO leadership, lecturers",
    "summarized_story": "THE Senate Committee on Ethics, Privileges and Public Petitions has again summoned the management of the Federal University of Technology, Owerri, over alleged victimisation, extortion and criminal breach of duty.\nAlso summoned are two lecturers of the institution, Williams Akionbare and C. Onanuju.\nThey are to appear for the public hearing on a petition written by the law chamber of M.A.\nOsolo stated that the parties would now appear for the public hearing on Tuesday, 12, October 2021 at Room 120, New Senate Building of the National Assembly Complex, Abuja by 1:00pm.\nThe petitioner, (Otobha), a student of Project Management Technology Department with Registration Number 20091700346, is accusing his lecturers of stalling his graduation since 2014 by deliberately failing him in some of the examinations he sat for."
  },
  {
    "headline": "Student’s allegations: Trouble looms as senate summons FUTO leadership, lecturers",
    "summarized_story": "THE Senate Committee on Ethics, Privileges and Public Petitions has again summoned the management of the Federal University of Technology, Owerri, over alleged victimisation, extortion and criminal breach of duty.\nAlso summoned are two lecturers of the institution, Williams Akionbare and C. Onanuju.\nThey are to appear for the public hearing on a petition written by the law chamber of M.A.\nOsolo stated that the parties would now appear for the public hearing on Tuesday, 12, October 2021 at Room 120, New Senate Building of the National Assembly Complex, Abuja by 1:00pm.\nThe petitioner, (Otobha), a student of Project Management Technology Department with Registration Number 20091700346, is accusing his lecturers of stalling his graduation since 2014 by deliberately failing him in some of the examinations he sat for."
  },
  {
    "headline": "Adebola Williams launches book on Girl Child",
    "summarized_story": "In commemoration of International Day of the Girl Child, Pan African entrepreneur and RED | For Africa co-founder, Adebola Williams has released a self-published children’s book capturing the lives of notable women of African origin.\nWilliams, through his book, “African Power Girls” seeks to underscore the notion of positivity, diversity, and inspiration among young girls who are daily faced with inequality, chauvinism, and misogyny.\n“I got the inspiration for this book while trying to purchase inspirational publications for my god daughters,” said Williams.\n“This book is the first in a series of three books highlighting powerful women in Africa,” he added.\nAdebola Williams co-founded and runs RED | For Africa, the continent’s largest portfolio of media and storytelling brands engaging the youth."
  },
  {
    "headline": "Neymar hints at retiring after 2022 World Cup",
    "summarized_story": "Neymar has admitted that the 2022 World Cup will probably be his last for Brazil attributing it to the mental strain football has had on him in recent times.\nHe said this while speaking in the documentary Neymar & The Line Of Kings, produced by DAZN.\n“I think it’s my last World Cup,” the Paris Saint-Germain forward confided.\n“So I’ll do everything to turn up well, do everything to win with my country, to realise my greatest dream since I was little.\nAnd I hope I can do it.”The 29-year-old has played at two World Cups previously."
  },
  {
    "headline": "IPOB not as bad as Northern terrorists: Gov. Ikpeazu",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has stated that members of the proscribed Indigenous People of Biafra (IPOB) are not as bad as terrorists or bandits in the North.\nIkpeazu while fielding questions during a recent interview with Vanguard, appealed to the Federal Government to engage and negotiate with IPOB members.\nIPOB leader, Nnamdi Kanu is currently in the custody of the Department of State Security (DSS) after he was arrested in Kenya and extradited to Nigeria in June 2021, to face treason charges.\nIkpeazu said; “We must engage with IPOB.\nNigeria is sitting on a keg of gunpowder but the solution is not too difficult to find.”“I regard Nnamdi Kanu as my citizen but not as leader of IPoB because I am the governor."
  },
  {
    "headline": "Drug cartels kidnap ex-NDLEA officer in Benue",
    "summarized_story": "The National Drug Law Enforcement Agency says a group of drug cartels has abducted a retired NDLEA officer after its officers arrested a 19-year-old female drug dealer, Mngunengen Achir, in Benue State.\nNDLEA spokesman, Femi Babafemi, in Abuja in a statement Sunday, said Achir was arrested with 5.5kg cannabis and 112grams of diazepam on October 6 in Aliade area of the state.\nBabafemi, however, didn’t give further details on the incident.\nHe added that NDLEA officers had, in the past week, arrested 110 drug dealers in nine states, dismantled their hideouts and seized assorted illicit substances.\nHe listed the states as Lagos, Benue, Kwara, Ondo, Kano, Nasarawa, Akwa Ibom, Oyo and Rivers."
  },
  {
    "headline": "President Buhari Reveals When Second Niger Bridge, Lagos-Ibadan Expressway, Others Will Be Completed",
    "summarized_story": "These include the 11.9km Second Niger Bridge, 120 km Lagos-Ibadan Expressway, 375 km Abuja – Kaduna – Zaria – Kano Expressway, and the East-West Road.\nMost of these projects are expected to be completed within this 2nd term of our Administration,’’ he said.\nPresident Buhari expressed delight that over the past two years, ministers have rendered reports to the Federal Executive Council on their activities related to the achievement of their ministerial mandates.\nOn other efforts to strengthen national security, the President said it was gratifying to note that Nigeria has received six A-29 Super Tucano.\nOn the Power Sector, President Buhari noted that the implementation of a ‘Willing Buyer-Willing Seller’ policy has opened up opportunities for increased delivery of electricity to underserved homes and industries."
  },
  {
    "headline": "BREAKING: Governor Umahi Orders Arrest Of Journalist Over Facebook Posts About Nigerian Politicians, Army",
    "summarized_story": "On the orders of the state governor, David Umahi, police in Ebonyi State arrested a journalist, Godfrey Chikwere, over his Facebook posts.\nAlready, aggrieved youths and activists in the state are organising a protest to demand the freedom of Chikwere.\n“Make una free this young man Godfrey Chikwere is high time government occupy (sic) themselves with relevant issues in the society instead of pursuing shadows.\n“The present day House of Assembly in Ebonyi state are so interested in their personal gain from his Excellency forgetting their constituents who elected them to represent them.\nThe ongoing arrest in Ebonyi state is nothing but a political fight against any perceived political opposition member in the state."
  },
  {
    "headline": "2023: Southeast Won’t Get Presidency, Igbo Politicians Are Betrayals — Primate Ayodele",
    "summarized_story": "Primate Elijah Ayodele, the leader of the INRI Evangelical Spiritual Church, has predicted that the Southeast presidential plan will collapse in 2023.\nBecause of betrayal, according to Primate Ayodele, the Southeast would not be able to accomplish its presidential ambitions.\nPrimate Ayodele stated some Southeast politicians would betray the region’s presidential agenda in a statement issued by his Media Aide, Oluwatosin Osho.\nThe separatist group claims that desperate Southeast politicians are to blame for the region’s insecurity.\nHowever, Primate Ayodele said: “Don’t blame any group for the killings in the South-East, rather blame bad governance."
  },
  {
    "headline": "Your Fighter Jets Will Be Used To Collapse Nigeria — Mbaka Warns Buhari",
    "summarized_story": "Ejike Mbaka, Spiritual Director of Adoration Ministry Enugu, has warned President Muhammadu Buhari that the fighter jets he is buying will be used to destroy Nigeria.\nOn Sunday, the cleric announced this during a sermon at his church.\nBuhari, according to Mbaka, should instead concentrate on expanding the economy.\n“The jets you are buying are going to be used to collapse Nigeria.\n“Please, the first person to meet President Buhari after this message, should tell him that all these jets he is buying will be used to destroy Nigeria."
  },
  {
    "headline": "Dokpesi on PDP 2023: For equity, North must have PDP presidential ticket",
    "summarized_story": "A member Board of Trustees (BoT) Peoples Democratic Party (PDP) Dr Raymond Dokpesi has said for equity, fairness and justice, the party must zone its presidential ticket for the 2023 general elections to the North.\nAlthough the report was silent on the presidential ticket, stakeholders believed it simply implied the party’s presidential ticket is coming from the south.\nDokpesi faults partyBut faulting the party’s position, Dr. Dokpesi argued that with the south having 14 of the 16-year PDP rule, it would be unjust for the south to still take another short at the party’s presidential ticket.\nWe came to 2015, the PDP had done 16 years in power, if you like, 14 years of the South, two years of the north.\nNow, in 2015, when we fielded in PDP, Jonathan, the north had started clamouring, agitating, saying it is their turn."
  },
  {
    "headline": "Breaking: Fuel scarcity averted as NUPENG calls off proposed strike",
    "summarized_story": "The Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) on Sunday evening has called off its proposed strike.\nNUPENG’s President, Comrade William Akporeha, and the General Secretary, ComradeAfolabi Olawale revealed this in a press statement.\nPart of the statement reads: “The leadership of the Nigeria Union of Petroleum and Natural Gas Workers hereby announced the suspension of the intended withdrawal of the services of Petroleum Tanker Drivers earlier scheduled to commence midnight of Sunday, 10th October 2021 following the understanding reached with the Union by the management of NNPC at a meeting held in Ibadan, Oyo State, today, 10th October 2021 and the expected outcome of the follow up meeting that is scheduled to hold on Tuesday, 12, October 2021 in Abuja as contained in the communique issued today.\n“The suspension of our planned action is predicated on our belief that the understanding reached with the government today as well as at meeting of Tuesday 12th, October 2021 will be fulfilled to the letters.\n“We wish to clearly made it known to all well meaning Nigerians that have variously appealed to us on these issues that our plan was not intended to inflict further pains on Nigerians but to ensure observance of minimum safety on our highways for the good of lives and properties.”"
  },
  {
    "headline": "Pictures: Naija Ratels, Ghana Police Ladies end Flying Officer’s Cup opener goalless",
    "summarized_story": "Naija Ratels started their 2021 Flying Officers Cup campaign with a goalless draw against Ghana Police Ladies at the Area 10 Sports Complex on Sunday evening.\nNaija Ratels FC missed three good chances in the first 19 minutes of the game, Agama and Adugbe being the biggest culprit.\nGhana Police Ladies FC came out in the second half to upset the host but Doris Ohia briliantly saved Naija Ratels from conceding.\nThere was a scary moment for the host in the 69th minute as Ghana Police Ladies FC saw their effort hitting the cross bar.\nNaija Ratels FC will face Royal Queens FC of Warri in their next game on tuesday while Ghana Police Ladies FC square up with Honey Badgers FC on October 13."
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Access Bank, Xploits Consulting donate food, school items to orphanages in FCT -NigPilot",
    "summarized_story": "In continued efforts to bring succor to orphans across the FCT, Access Bank Plc and Xploits Consulting Ltd , have donated food and school items to some orphanages as part of their projects to ensure that they have a better life.\nSome of the orphanages captured in the project and visited include Daughters of Charity Orphanage, Bwari, Destined Children’s Orphanage, Kado Estate, Abuja, Best Life Orphanage, Gwagwalada, Al’ansar Orphanage, Kuje in the FCT.\nSpeaking at the handing over of the items, Director, Communications, Xploits Consulting Ltd, Mrs, Grace Taiwo said that the presentation of the items were part of Access Bank Plc’s Corporate Social Responsibility, CSR adding that the bank’s commitment was largely focused around the United Nations Sustainable Develop Goals.\nTaiwo assured that her organisation with support from Access Bank Plc will continue to invest in the lives of Nigerians especially in areas of education, health, gender equality, arts.\nShe listed some of the items donated to include food items, toiletries and stationeries."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "Buhari Unveils Digital Performance Management System",
    "summarized_story": "President Muhammadu Buhari on Monday officially unveiled a digital Performance Management System (PMS) that would help track government projects across the country in real-time.\nBuhari launched the PMS at the Midterm Ministerial Performance Review Retreat which held at the Banquet Hall, Presidential Villa, Abuja.\nAccording to President Buhari, the PMS has been in effect since January 2021 and has helped him to monitor the performance of ministries and by extension, monitor the progress of his administration.\nREAD ALSO: Ribadu Denies Accusing President Buhari, Others Of Sponsoring BanditsThe president disclosed that it was in the continued drive to ensure accountability that his government “incorporated performance management framework into the functions of the Central Delivery Coordination Unit”.\nFurthermore, President Buhari said that the retreat will effectively evaluate the activities of the ministries over the last two years to ascertain how well they have helped deliver on the promise made to Nigerians."
  },
  {
    "headline": "Falana Asks Malami To Enforce $62b Supreme Court Judgment",
    "summarized_story": "A Senior Advocate of Nigeria, Mr. Femi Falana, has asked the Attorney-General of the Federation, Mr. Abubakar Malami, to recover a $62 billion debt owed by six international oil companies.\nIn a letter dated October 8 and obtained by Channels Television on Sunday, Falana said the Supreme Court in 2018 had ordered the Federal Government to immediately recover the debt.\nBut, based on the posture of the Minister of State for Petroleum, Mr. Timipre Sylva, it appeared the Federal Government wasn’t committed to the recovery process, Falana said.\n“Our clients have instructed us to remind you that the Federal Government has not enforced the above-mentioned Judgment of the Supreme Court of Nigeria delivered on October 20, 2018.\nLet us consider that as a lost opportunity, the money was not in a cupboard, they have taken it."
  },
  {
    "headline": "Tear Down 1999 Constitution And Build A Great Nation – Bakare Tells Buhari",
    "summarized_story": "Pastor Tunde Bakare has urged President Muhammadu Buhari to do away with the 1999 constitution, saying it is a great inhibitor of the nation’s progress.\n“In the same spirit, I say to President Muhammadu Buhari: Mr President, stop passing the buck to the National Assembly.\nTear down this inhibiting concoction of a constitution; tear it down so we can build a truly great nation”.\nThrowing more light on the need to get rid of the 1999 constitution, Pastor Bakare asserted that the constitution was erroneous to say the unity of the nation was not negotiable.\n“The 1999 Constitution was imposed upon the nation by the military and has completely removed the ancient landmark set by our founding fathers in the 1960 Independence Constitution and the subsequent 1963 Republican Constitution respectively."
  },
  {
    "headline": "I’m Hale, Hearty And Well – Tinubu Tells Nigerians",
    "summarized_story": "The National Leader of the All Progressives Congress (APC), Bola Ahmed Tinubu has told Nigerians that he is hale and hearty after undergoing knee surgery in the United Kingdom.\nI give glory to God because I’m standing before you hale, hearty, and well.\nREAD ALSO: Tinubu, Osinbajo Can Clearly Defeat PDP Candidate – Bwala“I’m a little emotional now but I’m happy.\nWe give glory to God who brought you (Tinubu) back with sound health and stronger vigour.\nThe Speaker wondered why a “simple knee surgery” became a national issue but said the solidarity shown towards Tinubu across ethnic divides indicated the APC National Leader is an enigma."
  },
  {
    "headline": "Fire Breaks Out At Lebanon Fuel Storage Facilities",
    "summarized_story": "Firefighters in Lebanon Monday battled to contain a fire at key fuel storage facilities, AFP correspondents and the National News Agency said, sparking alarm as the country grapples with dire hydrocarbon shortages.\nAn AFP photographer saw flames lick up above the storage tank on fire, and huge plumes of dark smoke billowing into the sky.\n– ‘Loud bang’ –A worker in a plantation near the facilities told AFP he had heard a loud bang before the fire broke out.\nThe Zahrani facilities also include the power plant of the same name, and provide 15 percent of the country’s fuel oil.\nThat outage came after two key power plants, including the one in Zahrani, ran out of fuel."
  },
  {
    "headline": "Police arrest 3 suspected gun runners with over 500 ammunition in Niger",
    "summarized_story": "The Niger State Police Command has arrested three suspected gun runners and confiscated over 500 live ammunition from the suspects in the state.\nThe state Commissioner, Monday Bala Kuryas, said the suspects confessed to the crime after being paraded in Minna.\nHowever, he explained that the two suspects were later arrested with the help of the community.\nHe stated that when questioned, they claimed that the arms were being taken from Sokoto to one Yellow at Mokwa.\nThe guns comprised six double barrel and eight triple barrel guns."
  },
  {
    "headline": "Cut N26bn Presidency budget for medical centre, travels, meals – SERAP tells Buhari",
    "summarized_story": "“The proposed spending figures highlight the lack of political will to cut the cost of governance, starting from the presidency.\nN250,836,273 is proposed to be spent on refreshments, meals, honorarium, sitting allowance, publicity and advertisements.\n“For the Office of the Vice-President, N1,136,717,757 is proposed for local and foreign travels, meals and refreshments, purchase of office furniture and fittings, and other expenses.\n“N168,210,826 is proposed for office stationeries/computer, consumables, printing of documents, uniforms and other clothing, food stuff and catering materials supplies.\n“N99,795,229 is proposed to be spent on refreshments, meals, honorarium, sitting allowance, publicity and advertisements."
  },
  {
    "headline": "Paramount ruler of Jukun kingdom Masa-Ibi Kuvyon dead",
    "summarized_story": "The paramount ruler of the Jukun kingdom and Chairman of Taraba State Council of Traditional Rulers, Shekarau Angyu Masa-Ibi Kuvyon is dead.\nChairman of Wukari LGA, Adigrace Daniel, confirmed the development in a statement signed by the Special Adviser on media, Jolly Agbu Masa-Ibi.\nMr. Agbu also said traditional rites in accordance with the Jukun tradition had since commenced.\nDr Shekarau Angyu Masa-Ibi (Kuvyon II) was the 27th Aku Uka of Kwararafa and the Wukari’s 13th since its establishment.\nHe was crowned king in 1976 as a second-class traditional ruler but was later upgraded to a first-class chief in 1982."
  },
  {
    "headline": "Plateau LG poll: APC wins all seventeen LGAs",
    "summarized_story": "The Plateau State Independent Electoral Commission has declared the All Progressives Congress winner of the Local Government Election held in the State on Saturday, 9th of October.\nAnnouncing the results in Jos on Sunday, the chairman of the Commission, Fabian Ntung, said that the candidates of the ruling All Progressives Congress won all the chairmanship seats in the 17 council areas.\nHe also said that the APC candidates won all the councillorship seats across the 325 wards in the state.\nSeven parties participated in the election, but the main opposition, People’s Democratic Party was excluded from participating in the polls."
  },
  {
    "headline": "Pandora Papers: I Did Not In Any Respect Violate Any Law, Peter Obi Says",
    "summarized_story": "Since local media organisations commenced publication of the leaked Pandora Papers, former governor of Anambra State, Peter Obi, has been hard pressed to deny the revelations on his secret business dealings overseas.\nLike similar document leaks before it, the Pandora Papers have helped to expose the concealed fortunes in offshore tax havens and, in some cases, money laundering by some of the most powerful people in the world.\nBut in a statement, Obi dismissed a report by Premium Times, which disclosed that the former governor had concealed a number of offshore businesses and investments when he was at the helm of affairs in Anambra State.\nAccording to Musikilu Mojeed, editor-in-chief of Premium Times, Obi may have violated the Code of Conduct Bureau and Tribunal Act by not declaring his or that of his family’s beneficial ownership in the said assets.\nObi, a Vice Presidential candidate in the 2019 elections, joined ARISE News to give his side of the story on the allegations made against him by Premium Times."
  },
  {
    "headline": "NNPC Missing as China, Saudi Arabia Top World’s Biggest Oil Revenue Earners in 2021",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has failed to make the latest list of the world’s highest income-grossing oil companies, both nationally-run and privately-owned.\nChina also came second on the list with PetroChina, the publicly listed arm of the state-owned company, China National Petroleum Corp, exceeding its post-pandemic expectations.\nThe two Chinese companies were followed by Saudi Aramco with $230 billion revenue for the year under review.\nRevenue fell by approximately $77 billion, though most analysts expect this to reverse again across 2021.\nThe offer by the national oil company came after the threat of industrial action by the PTD of NUPENG."
  },
  {
    "headline": "At $42bn, Nigeria’s External Reserves Hit 25-month High on Eurobond Inflow",
    "summarized_story": "Nigeria’s external reserves have risen to its highest level in 25 months to $42 billion presently due to the inflow of the recent Eurobond issued by the federal government, THISDAY findings have revealed.\nThe last time the country’s external reserves were around their present value was on September 26, 2019, when it was $42.05 billion.\nAnalysts also revealed that forex rationing by the central bank has also supported the external reserves accretion.\nIt pointed out that even though Nigeria’s external reserves have risen, the country’s debt level has also been climbing.\nThe World Bank recently raised Nigeria’s 2021 growth forecast to 2.4 per cent, from 1.8 per cent previously."
  },
  {
    "headline": "Mbappe Gives France Comeback Win in Nations League Final Against Spain",
    "summarized_story": "Kylian Mbappe fired a contentious winner as France came from behind to beat Spain and become the second team to win the Nations League.\nMbappe was adjudged to be onside when he slid the ball under Unai Simon after Karim Benzema’s stunning equaliser at Milan’s San Siro.\nSpain had taken the lead through Mikel Oyarzabal, who shrugged off defender Dayot Upamecano to beat Hugo Lloris.\nAnd even though France had less possession (36%), they constantly looked a threat on the counter-attack as Mbappe struck the decisive – and perhaps fortunate – blow.\n“We showed strength of character, because this team is very strong, never gives up and we have proven it today."
  },
  {
    "headline": "Nigeria: Only God Can Take My Life, Says APC Leader Tinubu",
    "summarized_story": "National leader of Nigeria’s governing political party, the All Progressives Congress (APC), Senator Bola Tinubu, on Sunday, said only God, the giver of life, could take his life.\nTinubu made the remarks on Sunday at the Lagos House, Marina, in his “Thank you speech” during a reception to welcome him back home, organised by Governor Bababjide Samwo-Olu of Lagos State, on behalf of the state government.\nThe reception featured prayers for Tinubu, who expressed gratitude to God for bringing him back to Nigeria safely.\nGod is the giver of life and He alone can take it.\nFemi Gbajabiamila; and Senator Adeola Olamilekan, said in their speeches that they were working to ensure Tinubu’s mandate in 2023."
  }
]