[
  {
    "headline": "PANDEF faults planned establishment of naval base in Kano",
    "summarized_story": "The Pan Niger Delta Forum has decried the approval of a naval base in Kano State, saying the move is one of the biases by the regime of the President, Major General Muhammadu Buhari (retd.).\nSpeaking with The PUNCH in a telephone interview on Sunday, PANDEF spokesman, Ken Robinson, said it was funny for any person to consider establishing a naval base in a desert.\nThe Kano State Governor, Abdullahi Ganduje, had asked for the visibility of the Nigerian Navy to strengthen security in the state, a request that led to the approval of the establishment of a naval base in the state.\nHe stated, “What is federal character in establishing a naval base when you cannot adhere to federal character in appointments?\n“You don’t think of federal character in appointment, but you are thinking of federal character in infrastructure allocation."
  },
  {
    "headline": "NEF kicks over imposition of restrictions on northern communities",
    "summarized_story": "The Director, Media and Publicity, NEF, Dr Hakeem Baba-Ahmed, who made the observations in a statement titled, ‘Security of besieged communities’, warned that such restrictions would compound the desperate conditions of living of many communities in the North.\nThe statement read in part, “The Northern Elders Forum is closely following the condition of many northern communities that have become particularly vulnerable to attacks and abuse by bandits, kidnappers and related organised criminals.\n“These measures represent virtual economic and social lockdowns on people, who have been at the mercy of criminals for a long time.\n“The forum calls on the Federal Government to assist states to relieve communities that are now living under additional pressures.\nState governments imposing additional hardships on communities must know that the measures they are introducing must produce tangible results within a period that makes them meaningful and tolerable.”Copyright PUNCH."
  },
  {
    "headline": "Tito Obaigbo: Promoting Reading Culture",
    "summarized_story": "Tito Obaigbo, Founder and President of the Smart Book Club (SBC), is a prolific reader, with an undying love for books.\nWhat informed the creation of the Smart Book Club and would you say the objective has been achieved?\nIt began 3 years ago precisely on the 1st of April 2018 when Smart Book Club was formerly founded.\nWe give them pep talks during their school assembly from time to time, and classroom book reading to Nursery and Primary school pupils.\nSo we are saying, women should continue to imbibe that culture of reading and also encourage their children to read."
  },
  {
    "headline": "Tito Obaigbo: Promoting Reading Culture",
    "summarized_story": "Tito Obaigbo, Founder and President of the Smart Book Club (SBC), is a prolific reader, with an undying love for books.\nWhat informed the creation of the Smart Book Club and would you say the objective has been achieved?\nIt began 3 years ago precisely on the 1st of April 2018 when Smart Book Club was formerly founded.\nWe give them pep talks during their school assembly from time to time, and classroom book reading to Nursery and Primary school pupils.\nSo we are saying, women should continue to imbibe that culture of reading and also encourage their children to read."
  },
  {
    "headline": "Behold HRM Ogiame Atuwatse III….King With Vision And Mission",
    "summarized_story": "An accomplished businessman and CEO of Noble Nigeria Souvenir Limited now Ogiame Atuwatse III, he speaks exclusively to Vanguard on the stormy journey to the throne and his vision and mission to his beloveth Itsekiri people.\nHIS ROYAL MAJESTY, TESOLA EMIKO, ATUWATSE III, THE OLU OF WARRI KINGDOMYour Majesty, let me start by congratulating you on your acension to the throne of your forefathers as the 21st Olu of Warri.\nI think we witnessed some new things that we introduced by way of organization, procession, music and visuals in the ceremony.\nI plan to do many unprecedented things that will enhance, and promote, the rich heritage of the Itsekiri people.\nAs the primary custodian of Itsekiri culture and an avid lover of history, I desire to bring a renaissance of our identity and purpose as a people."
  },
  {
    "headline": "Behold HRM Ogiame Atuwatse III….King With Vision And Mission",
    "summarized_story": "An accomplished businessman and CEO of Noble Nigeria Souvenir Limited now Ogiame Atuwatse III, he speaks exclusively to Vanguard on the stormy journey to the throne and his vision and mission to his beloveth Itsekiri people.\nHIS ROYAL MAJESTY, TESOLA EMIKO, ATUWATSE III, THE OLU OF WARRI KINGDOMYour Majesty, let me start by congratulating you on your acension to the throne of your forefathers as the 21st Olu of Warri.\nI think we witnessed some new things that we introduced by way of organization, procession, music and visuals in the ceremony.\nI plan to do many unprecedented things that will enhance, and promote, the rich heritage of the Itsekiri people.\nAs the primary custodian of Itsekiri culture and an avid lover of history, I desire to bring a renaissance of our identity and purpose as a people."
  },
  {
    "headline": "Mercy Eke: Living Her Dream",
    "summarized_story": "Words by- Josephine AgbonkheseOur cover personality Mercy Eke needs almost no introduction.\nIn this interview, she speaks of her newly-launched platform for giving back: The Mercy Eke Foundation, life as the only woman to have won the BBN grand prize so far; her love life and much more.\nHas it always been your dream to formally giveback to society or did this come as an afterthought?\nSo yes, I’ve been giving, and giving back has always been my thing.\nSo who’s the man in your life right now and what do you love most about him?"
  },
  {
    "headline": "Insecurity: Northern Elders warn govt over imposition of curfew, restrictions of communication, others",
    "summarized_story": "Northern Elders Forum has warned that some of the measures being taken by some state governments will compound the desperate conditions of living of many communities in the north.\n“Worse, they could further embolden the bandits and the kidnappers when it becomes clear that governments and security agencies cannot go beyond lockdowns on communities.\n“Communities themselves will lose even more faith in the capacity of the Nigerian State to respond to their desperate circumstances.\n“The Forum calls on the federal government to assist States to relieve communities that are now living under additional pressures.\n“State governments imposing additional hardships on communities must know that the measures they are introducing must produce tangible results within a period that makes them meaningful and tolerable.”"
  },
  {
    "headline": "Nigerian govt reacts to Coup D’etat in Guinea",
    "summarized_story": "The Federal Government of Nigeria has reacted to the coup d’etat, which occured on Sunday in a West African Country, Republic of Guinea.\nA video sighted by AFP had indicated that soldiers took over the country by suspending the current constitution and reportedly detaining President Alpha Conde.\nReacting, the Federal Government in a statement issued by Esther Sunsuwa, a spokesperson for the Ministry of Foreign Affairs condemned the move by the military, saying it violates ECOWAS Protocol on Democracy and Good Governance.\nThe statement read, “The Nigerian government is saddened by the apparent coup d’etat that has taken place in the Republic of Guinea today, in clear violation of the ECOWAS Protocol on Democracy and Good Governance.\n“The Government of Nigeria strongly condemns and rejects any unconstitutional change of government and therefore calls on those behind the coup to restore constitutional order without delay and protect lives and property.”"
  },
  {
    "headline": "Ex-Abia Commissioner of Sports, Uche Mpamah is dead",
    "summarized_story": "A former Commissioner for Sports in Abia State, Uche Mpamah, has been confirmed dead.\nThe late Mpamah died of undisclosed illness on Saturday.\nMeanwhile, the Member representing Ikuwano/Umuahia federal constituency of Abia state in the House of Representatives, Hon Sam Onuigbo has expressed sadness over the passing of the former Commissioner of Sports Chief Uche Mpamah.\nThe federal lawmaker described the demise of Late Uche Mpamah as a huge loss to the people of the state.\nOnuigbo, however, prayed God almighty to grant family, friends and associates of the Late Uche Mpamah, the strength to come to terms with the huge loss."
  },
  {
    "headline": "Nigeria drifting towards precipice – Falae",
    "summarized_story": "A former Secretary to the Government of the Federation, Chief Olu Falae, has stated that the country is already drifting towards precipice due to the surging insecurity situation and the country’s state of economy.\nChief Falae, who stated this in Akure, the Ondo State capital, emphasized that indices prepared by international bodies that Nigeria had become the corruption capital of the world, unemployment capital of the world and underdevelopment capital of the world were indications that things are getting worse.\nThe question is, are they going to topple into the abyss below?\nOr are we going to find a way of pulling back from the precipice?\n“For us to pull back, there must be a political initiative that will signal that tomorrow will be better than today."
  },
  {
    "headline": "Rotary Int’l President, others extol Gov. Ugwuanyi’s leadership qualities",
    "summarized_story": "The IR President explained that the 116-year old organization (Rotary Club) has spread to more countries “even more than the United Nations”.\nIn his speech, the District Governor, Rotary International (District 9142), Okey Okonkwo, expressed gratitude to Gov.\n“You do not need to go far to realize that Enugu State is really in the hands of God.\n“As a Rotarian, past President of Rotary Club of Emene and now Governor of Enugu State by God’s grace, Rotary Four-Way test has been a useful guidepost to our administration.\nThe Government of Enugu State, under my watch is committed to truth, fairness, goodwill and better friendship as well as benefit to all."
  },
  {
    "headline": "Why I distanced myself from Diri’s govt, by Dickson",
    "summarized_story": "Bayelsa State former governor Seriake Dickson has denied rift with his successor, Governor Douye Diri.\nDickson stressed that he was in touch with Diri, especially on issues bordering on the development of the state.\nGovernor Diri said PDP remained the party of choice for ‘Bayelsans’ and would be difficult to beat in any election.\nThe state PDP Chairman, Solomon Agwana; Bayelsa West Caucus Leader Chief T.K.O.\nOkorotie; Chief Fyneman Wilson and Michael Magbisa eulogised Diri and leaders of Bayelsa West for their services to people."
  },
  {
    "headline": "INEC redeploys RECs in Ogun, Osun, Bayelsa, Cross River",
    "summarized_story": "The Independent National Electoral Commission (INEC) has announced the redeployment of five Resident Electoral Commissioners (RECs) and four directors.\nAt the same time, his counterpart in Ogun State, Prof. AbdulGaniy Olayinka Raji, will take charge as REC for Osun State.\nIn the same vein, the REC in Bayelsa State, Dr. Cyril Omorogbe, will take up his new role as the REC for Cross River State.\nEmannuel Alex Hart proceeds to Bayelsa State as the REC, from his former office in Cross River State; the REC for Zamfara State, Dr. Asmau Sani Maikudi, has also been redeployed to Kaduna State.\nADVERTISEMENT“Similarly, the Director (Voter Education and Publicity), Mr. Nick Dazang, has proceeded on terminal leave."
  },
  {
    "headline": "Buhari okays establishment of 109 farm estates",
    "summarized_story": "The Muhammadu Buhari administration has approved the setting up of integrated farm estates in all the senatorial districts across the country.\nIkonne said the President was committed to and working towards ensuring that the country achieved food security.\nHe wants to see that we achieve food security in the country, and NALDA is purely under the supervision of Mr. President.\n“As Mr. President is pursuing food security, he is at the same time creating job opportunities for Nigerians.\nIkonne said Nigerians would live to remember the foundation President Buhari is laying to make the country achieve food sufficiency."
  },
  {
    "headline": "Ex-AFC CEO Alli joins Heirs Holdings’ board",
    "summarized_story": "Heirs Holdings has appointed Andrew Alli to its Board of Directors.\nAccording to the organisation, Alli will be bringing his experience in senior management and multi-sector investment across Africa.\nADVERTISEMENTRead Also: Buhari reappoints Ajiboye as TRCN RegistrarThe appointment comes as Heirs Holdings’ investment portfolio accelerates its ambitious expansion in energy and infrastructure, across Africa.\nRecently, Heirs announced the launch of its mass retail insurance play, demonstrating its determination to improve lives and transform Africa.\nIts Chairman, Tony Elumelu Holdings, stated: “We are pleased to welcome Andrew to our Board."
  },
  {
    "headline": "Conflicting orders: CJN to quiz 7 Chief Judges today",
    "summarized_story": "From Godwin Tsa, AbujaThe Chief Justice of Nigeria (CJN), Justice Ibrahim Mohammad will today grill seven Chief Judges over conflicting court orders that emanated from their various states.\nThose to be quizzed are the Chief Judges of Rivers, Cross River, Anambra, Imo, Jigawa, Kebbi and Delta states.\nMeanwhile, Daily Sun gathered that Justice Mohammad has already directed them to come with the records of proceedings in all the suits from which conflicting ex parte orders emanated.\nThe CJN who is the Chairman of the National Judicial Council (NJC) had on August 30, issued the summons to the Chief Judges.\nThe summons read in part, “My attention has been drawn to media reports to the effect that some Courts of coordinate jurisdiction were granting conflicting ex parte orders on the same subject matter."
  },
  {
    "headline": "How Sowore was killed by suspected kidnappers –Edo police",
    "summarized_story": "From Tony Osauzo and Ighomuaye Lucky, BeninThe Edo State Police Command, yesterday, gave an update on how Felix Olajide Sowore, younger brother of the convener of Revolution Now, Omoyele Sowore, was killed Saturday by suspected kidnappers.\nAddressing journalists in Benin City, spokesman of the Command, Bello Kontongs, clarified that the younger Sowore was not an occupant of a commercial bus from which five persons were abducted.\nHe explained that Sowore was driving from Okada to Benin when he ran into the suspected kidnappers, who were shooting at the bus which broke down on Friday night and the occupants had to find somewhere else to sleep.\nKontongs added that the stranded commuters had returned early on Saturday to pick their personal effects from the bus, when the kidnappers, who had laid ambush, opened fire on them and Sowore drove into the firing line, unknowingly.\n“The Sowore Felix was not one of the occupants of the bus that some of them were kidnapped."
  },
  {
    "headline": "Bandits abduct district head, demand N100m ransom in Niger",
    "summarized_story": "From John Adams, MinnaBarely two days after armed bandits killed no fewer than 20 villagers in reprisal in magami, Shiroro local Government Area of Niger State, the District Head of Wawa in the Borgu emirate of the state, Mr Mahmud Ahmed Aliyu,has been abducted.\nThe Dodo of Wawa as the District head is popularly referred to, was abducted by the heavily armed men from his palace on Saturday night.\nThe Wawa town where the he was abducted is about two kilometers to the 221 Wawa Military cantonment in Borgu.\nThe Doodo of Wawa is most richest District head in Borgu Emirate, a Malaysia trained doctorate degree holder in Environmental Science who returned to the country last year after his programme.\nThe incident had thrown the entire Wawa community into confusion, bringing all activities into a halt."
  },
  {
    "headline": "PIA evil, oppressive, says Gov Diri",
    "summarized_story": "Bayelsa Governor, Senator Douye Diri, has described the Petroleum Industry Act (PIA) as evil and oppressive to people of the Niger Delta.\nDiri said the three per cent allotted to host communities in the Act was paltry and would continue to be opposed until justice was served.\nA lot of ignorant people were against the former governor of Bayelsa State, who rose and championed a walkout in the Senate.\nDiri promised to stand for the actualisation of the creation of two additional states for the Ijaw ethnic group, namely the Oil River and Toru-Ibe states.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NDDC: Niger Delta leaders urge Buhari to publish names of indicted contractors",
    "summarized_story": "The Niger Delta Movement for Development (NDMD) has urged President Muhammadu Buhari to ensure full implementation of the forensic audit report and prosecute persons such as contractors and politicians indicted for diverting “our commonwealth.”It also flayed the Ijaw Youths Council (IYC) for what it described as unwarranted and irresponsible attacks on the Minister of Niger Delta Affairs, Senator Godswill Akpabio.\nThe convener, Victor Matthew, in a statement, yesterday, described the audit report as thorough and far-reaching, saying the recommendations when implemented, would reposition the commission to actualise its mandate.\n“Nobody named in that report to have in way or the other contributed in the underdevelopment of the Niger Delta by diverting monies meant for projects for personal use should be spared by the Presidency.\n“All of them must be prosecuted no matter their tribes, even if they are from the Ijaw extraction.\nMatthew recalled that Igbifa had earlier mobilised the youths for a protest to thwart the audit, a situation he said divided the IYC."
  },
  {
    "headline": "Breaking: Heavy Gunfire Reported Near Guinea’s Presidential Palace, President’s Fate Unclear",
    "summarized_story": "The fate of Guinea’s President Alpha Condé is unclear after an unverified video showed him in the hands of soldiers, who said they had staged a coup.\nHowever, the defence minister has been quoted as saying the attempted takeover had been thwarted.\nThis follows hours of heavy gunfire near the presidential palace in the capital, Conakry.\nIn the video, the soldiers from a unit of elite special forces ask President Condé to confirm he is unharmed but he refuses to respond.\nPresident Condé was re-elected for a controversial third term in office amid violent protests last year."
  },
  {
    "headline": "Just In: District Head Kidnapped in Niger",
    "summarized_story": "By Laleye DipoThe District Head of Wawa in the Borgu emirate of Niger state Alhaji Mahmud Ahmed Aliyu has been kidnapped.\nThe District Head popularly called the Dodo of Wawa was abducted by unknown gunmen from his palace on Saturday night.\nIt was gathered that the heavily armed gunmen stormed the district Head palace at about 10pm and started shooting sporadically causing panic within the palace and the entire community.\nA source said the gunmen took Alhaji Aliyu through the Kainji National Park, towards Benin Republic.\nWhen contacted, Police Public Relations Officer Niger State Police Command DSP Wasiu Abiodun confirmed the incident."
  },
  {
    "headline": "Secondus Asks Appeal Court to Affirm His Four-year Tenure",
    "summarized_story": "•Insists his tenure ends December 9•Says only NEC can suspend PDP national officerChuks Okocha in AbujaThe embattled National Chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, has asked the Abuja Division of the Court of Appeal to affirm that his four-year tenure ends on December 9, 2021.\nHe also asked the appellate court to quash the orders of the two high courts that restrained him as the national chairman of the party.\nIn obedience to the Rivers State High Court order, Secondus abdicated his office and handed over to his deputy, Mr. Yemi AkinwonmiHowever, his supporters went to a Kebbi State High Court, which issued an interim order directing him to resume office, pending the determination of the substantive suit.\nTo ensure that he returns to his desk and also remains in office until the end of his tenure, Secondus has asked the appellate court to affirm that his four-year tenure will end on December 9, 2021.\nIn the appeal filed by his lawyer, Mr. Emeka Etiaba (SAN), the PDP chairman is challenging the order of the Degema High Court in Rivers State and the Calabar High Court in Cross River State."
  },
  {
    "headline": "Parallel Congresses Hit APC in Lagos, Oyo, Sokoto, A’Ibom, Ogun, Others",
    "summarized_story": "Two factions of the APC also held parallel congresses in some local government areas in Oyo State.\nIn Sokoto State, THISDAY gathered that two LG executives emerged from the parallel congresses held.\nOn the eve of yesterday’s congresses, the seven-man congress committee led by Mr. Wale Ohu had cautioned the APC members in the state against holding parallel congresses.\nThe two APC factions in Lagos State also held parallel local government congresses across the 245 wards of the 20 local government areas of the state.\nIn Bayelsa State, a faction of the party held congresses despite a court order that restrained the party from holding congresses in the state."
  },
  {
    "headline": "Govs Caution FG over Payment of $418m Paris Club Refund to Six Consultants",
    "summarized_story": "The governors argued that the said payment is already an issue of litigation.\nAccording to the senior lawyer, the governors on August 3, 2021, got wind of the federal government’s move to effect the payment.\n“The Minister of Finance is said to have directed the Director-General, Debt Management Office (DMO) to issue Promissory Notes in favour of the Consultants.\nHe explained that the consultants relied on judgments of the Federal High Court which are presently being challenged by the 36 governors in several actions in various courts.\n“The nation is already going through economic adversity and every dollar is needed to be channelled to people-oriented projects."
  },
  {
    "headline": "WATCH LIVE: TF Interviews: A Conversation With Omoyele Sowore",
    "summarized_story": "You may also like"
  },
  {
    "headline": "WATCH LIVE: TF Interviews: A Conversation With Omoyele Sowore",
    "summarized_story": "You may also like"
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "Why Nigerians Find Ways To Be Happy Amid Bad Leadership, Life Of Misery— Activist, Sowore",
    "summarized_story": "Human rights activist, Omoyele Sowore has said Nigerians always find ways to make themselves happy despite living almost miserable lives.\nSowore stated this while responding to a question from Toyin Falola on the reconciliation between the security challenges bedevilling the country and the elaborate social events held in the country.\nFalola asked: “How do we reconcile banditry, killings with the elaborate social events in Nigeria, Obi Cubana, Buhari's son's wedding ceremony?\"\nSowore said the Nigerian state is already riddled with an internal crisis and Nigerians, young and old, simply find a way to keep their hopes alive.\nHe said: “The Nigerian state is riddled with internal contradictions and these contradictions are multi-layered, some of them we can explain within sociology, some you can explain within the realm of religion, some you can explain within the realm of just keeping hope alive."
  },
  {
    "headline": "Northern elders: Locking down communities in the north may worsen living conditions",
    "summarized_story": "The Northern Elders Forum (NEF) says shutting down communication and imposing curfews will compound living conditions in the northern region.\nAdvertisementAs part of efforts to curb insecurity, some state governments had shut down markets and schools.\nAdvertisement“Northern Elders Forum is closely following the condition of many Northern communities that have become particularly vulnerable to attacks and abuse by bandits, kidnappers and related organized criminals,” the statement reads.\n“Worse, they could further embolden the bandit and the kidnappers when it becomes clear that governments and security agencies cannot go beyond lockdowns on communities.\n“Communities themselves will lose even more faith in the capacity of the Nigerian State to respond to their desperate circumstances.”AdvertisementHe called on the federal government to assist states to relieve communities that are now living under additional pressure."
  },
  {
    "headline": "Northern elders: Locking down communities in the north may worsen living conditions",
    "summarized_story": "The Northern Elders Forum (NEF) says shutting down communication and imposing curfews will compound living conditions in the northern region.\nAdvertisementAs part of efforts to curb insecurity, some state governments had shut down markets and schools.\nAdvertisement“Northern Elders Forum is closely following the condition of many Northern communities that have become particularly vulnerable to attacks and abuse by bandits, kidnappers and related organized criminals,” the statement reads.\n“Worse, they could further embolden the bandit and the kidnappers when it becomes clear that governments and security agencies cannot go beyond lockdowns on communities.\n“Communities themselves will lose even more faith in the capacity of the Nigerian State to respond to their desperate circumstances.”AdvertisementHe called on the federal government to assist states to relieve communities that are now living under additional pressure."
  },
  {
    "headline": "FULL LIST: presidency lists 'jinxes' broken by Buhari administration",
    "summarized_story": "The presidency says Muhammadu Buhari is the first president to start and complete a rail project in Nigeria’s history.\nAdvertisement(3) More than 6 billion dollars of inherited Cash Call Arrears now being cleared by the Buhari Administration, since 2016.\n(18) President Buhari is the first President to start and complete a rail project in Nigeria’s history (Lagos-Ibadan Rail).\nPresident Buhari has successfully flagged off Train 7 construction.\n(24) The Nigerian Air Force has enjoyed the largest investment in fleet renewal in decades, under President Buhari, acquiring more than two-dozen new aircraft since 2016."
  },
  {
    "headline": "FULL LIST: presidency lists 'jinxes' broken by Buhari administration",
    "summarized_story": "The presidency says Muhammadu Buhari is the first president to start and complete a rail project in Nigeria’s history.\nAdvertisement(3) More than 6 billion dollars of inherited Cash Call Arrears now being cleared by the Buhari Administration, since 2016.\n(18) President Buhari is the first President to start and complete a rail project in Nigeria’s history (Lagos-Ibadan Rail).\nPresident Buhari has successfully flagged off Train 7 construction.\n(24) The Nigerian Air Force has enjoyed the largest investment in fleet renewal in decades, under President Buhari, acquiring more than two-dozen new aircraft since 2016."
  },
  {
    "headline": "UN condemns military takeover in Guinea, demands release of Alpha Conde",
    "summarized_story": "Soldiers said they had taken over the government of President Alpha Conde after hours of heavy gunfire near the presidential palace in Conakry, the capital.\nMamady Doumbouya, head of the elite national army unit, said the president had been taken into custody.\nDoumbouya accused Conde’s government of “trampling of the rights of citizens” and disrespecting “democratic principles”.\nHe also announced that the country’s land borders had been closed and the government dissolved"
  },
  {
    "headline": "OPay accused of participating in a money-laundering scheme in India",
    "summarized_story": "Nigeria-based fintech giant, OPay, is currently embroiled in an ongoing money-laundering investigation in India.\nPCFS is accused of remitting Rs 429 crore ($58.7 million) to 13 of its other related companies, including OPay, for non-existent marketing and digital software services.\nThe misuse of personal data and breach of privacy by quick-loan mobile apps seems to be a global trend.\nIn January, the Chinese company was accused of providing “predatory” loans in Nigeria and Kenya by a short seller, Hindenburg Research.\nThe PCFS scandal involving OPay emerged less than a week after the startup announced a $400 million fundraising, which saw it become Africa’s latest unicorn."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Rwanda’s new SIM registration, Somalia’s Trade Information Portal, Cellulant’s partnership with GAINDE 2000",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Rwanda’s new SIM registration directivesSomalia’s Trade Information PortalCellulant’s partnership with GAINDE 2000 to improve Africa’s tradeRwanda’s new SIM registration directivesWhat’s the news?\nSomalia has developed a Trade Information Portal with the assistance of the International Finance Corporation (IFC) to reduce costs and simplify trade procedures for Somali importers and exporters.\nWhat’s more, the Trade Information Portal will help the Somali business community find needed information to facilitate their import-export activities.\nCross-border trade between Somalia and its neighbour is expected to increase following the launch of the Trade Information Portal.\nWhy GAINDE 2000?"
  },
  {
    "headline": "Building Shopify for Africa: Nigeria’s Bumpa plans to digitise thousands of African businesses",
    "summarized_story": "Share this article:Nigerian eCommerce startup, Bumpa, has raised a $200,000 pre-seed to digitise thousands of African businesses on its platform.\nAdvertisementAfter school, Opayele founded HostCabal, a company that helps small businesses host their businesses online.\nSo the idea was to figure out how to get businesses online because they were completely offline and lacked the resources to digitise their operations.\nBumpa helps merchants grow their businesses onlineThe startup, which Umechukwu calls “Shopify for Africa,” assists merchants and businesses in moving their operations online.\nThe co-founders, therefore, believe that small businesses will grow if offered Bumpa as a solution product."
  },
  {
    "headline": "Experts explain how founders can strategically avoid the pitfalls of business partnerships",
    "summarized_story": "Prudence’s story — a true one, I should add — is only a simple example of what can go wrong in a business partnership.\nA study shows that 70% of business partnerships fail and 90% of startups ultimately fail in the first 10 years mainly because of bad partnerships.\nA good example is a business owner whose elaborate long-term plans are far removed from a prospective partner’s short-term financial goals.\nSome contracts have an exclusivity clause restricting startups from entering other partnerships for the duration of the contract.\nWellaHealth on the other hand, as a healthtech startup, can find partnerships with a mobility company or a payments company, or vice versa."
  },
  {
    "headline": "Edo Police, local vigilante comb forests, assure arrest of killers of Olajide Sowore – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA combined team of security operatives in Edo State at the weekend combed the forests in search of the killers of Olajide Sowore, the younger brother of Sahara Reporters’ Publisher and human rights activist, Omoyele Sowore.\nThe security team includes men and officers of the Edo State Police Command, local hunters and members of the Edo State Vigilante Security Network.\nThe Edo Police Public Relations Officer (PRO), Kontongs Bello, disclosed this while addressing journalists in Benin City on Sunday.\n“Sowore who was coming from Okada going towards Benin was just a victim whom they tried to stop and he refused and they shot at his car.\nThe Commissioner of Police is doing everything possible to ensure that these people are arrested and those kidnapped are rescued.”..."
  },
  {
    "headline": "Edo govt announces resumption of schools for 2021",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said schools in the state will resume for the 2021/2022 academic session on Monday, September 6, 2021.\nIn a statement, Permanent Secretary, Edo State Ministry of Education, Mrs. Stella-Maris Imasuen, said parents/guardians are to ensure that all relevant learning materials are provided for their children/wards.\nShe noted, “It is hereby announced for the information of the general public especially School Heads/Principals and Proprietors of Private Schools, that Schools in Edo State will resume for academic activities on Monday 6th of September, 2021 for first term of the 2021/2022 academic session.”According to her, all school Heads/Principals and Proprietors are to collect the School Calendar for 2021/2022 academic session from the Office of the Chief Inspector of Education in their respective Local Government Area.\n“For safe school environment, School Heads/Proprietors are to ensure strict compliance with the COVID-19 protocols, which include compulsory use of face mask, use of infrared thermometer, regular hand washing and use of hand sanitizers,” she added."
  },
  {
    "headline": "Fayemi Visits Olu Of Warri, Assures Of Governors’ Forum’s Support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Governor of Ekiti State, Dr. Kayode Fayemi has visited Olu Of Warri, His Majesty, Ogiame Atuwatse III, in his place in Warri, Warri South Council Area of Delta State.\nThe governor said the speech has made Nigeria and particularly, the Warri kingdom, the toast of the global community.\nWe want to create services that will improve not just Warri kingdom but the country”.\nMeanwhile, His Majesty Ogiame Atuwatse III, on Saturday formally confirmed seven additional traditional chiefs in Itsekiriland in continuation of the revalidation exercise.\nAll the chiefs pledged their moral and financial support for the socioeconomic agenda of His Majesty, Ogiame Atuwatse III to transform Warri kingdom."
  },
  {
    "headline": "SEC Promises to Reduce Operating Cost … Assures of Profitability in 2 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Securities and Exchange Commission has unveiled plans to reduce its operating costs in order to boost profitability within the next two years.\nSpecifically, he said that the total revenue so far paid by SEC into the treasury as of the end of June, 2021 was about N1.5bn.\nOn the high overhead costs, the SEC DG explained that this is being reduced aggressively.\n“It has reduced because we have since we came, aggressively looked at the overhead and staff cost and reduced certain components of our staff pay that has generated over N2bn of savings as at now.\n“If you take the MTEF numbers, as you go forward, you find that by 2024 staff cost reduces to only N5.88bn."
  },
  {
    "headline": "AMCON: Experts call for National Policy On Debt Recovery",
    "summarized_story": "The Nigerian government has been challenged to expand the laws that granted the Asset Management Corporation of Nigeria (AMCON) special debt recovery powers in the AMCON Act into a national law.\nSince then, AMCON said it has worked tirelessly to recover the huge debt, which were covered by various collaterals.\n“But as the years roll by, AMCON obligors have become more daring, and hiding under all manners of legal technicalities to delay the agency from recovery,” the agency said.\nThere must be a national law on debt recovery.\nThe AMCON CEO had earlier said the agency will continue to highlight the dangers of not recovering outstanding debt because of its grave implication."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Glo gains more customers as other telcos lose",
    "summarized_story": "A new report from the Nigerian Communications Commission (NCC), has shown that telecommunications firm, Globacom, is top of the gainers’ chart of new customers at the end of the month of July, 2021.\nMTN lost 447,460 subscribers plummeting from 73,571,192 in June to 73,123,732 in July as Airtel’s figure of 50,665,723 in June dropped to 50,301,237 in July, with a loss of 364,486 customers.\n9mobile lost none and gained none as its figure stood at 12,908,092 for the two months.\nIn the same vein, Globacom won new data customers during the period under review with 338,189 new data customers added to its data subscriber base from 37,875,966 in June to 38,214,155 in July.\nThe network has also gained repute for offering subscribers highly competitive products with immense benefits."
  },
  {
    "headline": "Section 59 (3) of PDP Constitution: The need for NEC to correct Secondus’ misuse of power, By Abayomi Ojosegun",
    "summarized_story": "In a recent interview with the media, Uche Secondus was quoted to have said that “NOBODY OR ANY ORGAN OF THE PARTY CAN REMOVE ME OR ANY MEMBER OF NEC EXCEPT THE NEC.” Isn’t that awesome?\nOlasoji Adagunodo, a member of NEC like Uche Secondus, with official fiat without recourse to the same NEC that has that power to which he has suddenly turned to for adjudication.\nOlasoji Adagunodo, the State Chairman, Prince Bola Ajao, the State Secretary and Hon.\nRather than accepting the recommendations of the fact finding committee, Uche Secondus inadvertently exonerated the last two and held on to Adagunodo as if he ever did anything wrong.\nOlasoji Adagunodo back to office which is the only solution to the lingering crisis of the party in that state."
  },
  {
    "headline": "Adamawa shuts boarding schools over insecurity",
    "summarized_story": "The government of Adamawa State has announced the closure of 30 boarding junior secondary schools in the state out of the 34 junior schools over insecurity.\nThe four schools that will not be affected by the closure are the Government Girls Junior Secondary School, Yola; General Murtala Mohammed College, Yola; Special School Jada; and Special School, Mubi.\nFrom now henceforth, all the 30 government junior secondary schools are now day schools,” the statement said.\n”The remaining four that are not affected are Government Girls Junior Secondary School Yola, General Murtala Mohammed College Yola, Special School Jada and Special School Mubi.\n”All students from the affected schools are to be placed in the nearest public junior secondary schools within their catchment or domicile areas."
  },
  {
    "headline": "APC L.G Congress: Osun Deputy Gov. Alabi, Oyebamiji, others express satisfaction with conduct in state",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State deputy governor, Mr Benedict Alabi, members of the National Committee on Local Government Congress, among others, have expressed satisfaction with the peaceful conduct of Saturday’s All Progressives Congress (APC) Local Government Congress in the state, noting that there was no parallel congress anywhere.\nOyebamiji also expressed satisfaction on the conduct of the national delegation under the chairmanship of Hon.\nCommittee Express SatisfactionSimilarly, members of the National Committee on Local Government Congress of the party expressed satisfaction over the peaceful conduct of the party’s members in the State.\nGbenga Elegbeleye, lauded the peaceful conduct of the party loyalists, describing it as commendable and worthwhile.\nAs you all know, the party’s members have reposed confidence in you and you must justify this and you must not disappoint them,” Oyetola added."
  },
  {
    "headline": "Bandits Kidnap Katsina SSG’s Brother, Lawmaker’ Wife, Children",
    "summarized_story": "Suspected bandits have kidnapped 78-year-old Kabir Muhammad, the elder brother of the secretary to the Katsina State government (SSG) Mustapha Muhammad Inuwa.\nSimilarly, some suspected bandits on Saturday night abducted the wife and two children of the lawmaker representing Bakori local government area at the State House of Assembly, Dr Ibrahim Kurami.\nThe source added that the bandits left the member of the First Aid Group of Islam on the ground, lying with varying degrees of injuries.\nThe source said: “Bandits attacked the residence of our lawmaker, Dr Ibrahim Kurami, yesterday (Saturday) and kidnapped his wife and his two children.\nThey also shot one of our members of the First Aid Group of Islam."
  },
  {
    "headline": "Bandits Kidnap Katsina SSG’s Brother, Lawmaker’ Wife, Children",
    "summarized_story": "Suspected bandits have kidnapped 78-year-old Kabir Muhammad, the elder brother of the secretary to the Katsina State government (SSG) Mustapha Muhammad Inuwa.\nSimilarly, some suspected bandits on Saturday night abducted the wife and two children of the lawmaker representing Bakori local government area at the State House of Assembly, Dr Ibrahim Kurami.\nThe source added that the bandits left the member of the First Aid Group of Islam on the ground, lying with varying degrees of injuries.\nThe source said: “Bandits attacked the residence of our lawmaker, Dr Ibrahim Kurami, yesterday (Saturday) and kidnapped his wife and his two children.\nThey also shot one of our members of the First Aid Group of Islam."
  },
  {
    "headline": "Malnutrition Claims 10,000 In Adamawa, Borno, Yobe – UNICEF",
    "summarized_story": "Data from the United Nations Children’s Fund (UNICEF), nutrition partners and state governments have showed that 10,165 children have died from Severe Acute Malnutrition (SAM) in Borno, Adamawa and Yobe states between January 2017 and July 2021.\nUNICEF said the number of death recorded in OTP in the period were 7,020 and 3,145 in SC, totally 10, 165.\nMeanwhile, UNICEF has identified multiple displacement, conflict, food crisis and others as factors fueling malnutrition in North East Nigeria.\nHe said early detection, referral, and good management of severe acute malnutrition in children remains key in saving children under the age of five from preventable deaths.\nThe communication officer, UNICEF Maiduguri, Folashade Adebayo, informed that the purpose of the workshop is to increase the knowledge and capacity of media practitioners on child malnutrition, adding that the outcome of the workshop is expected to elevate the visibility of child nutrition issues among policy makers."
  },
  {
    "headline": "Malnutrition Claims 10,000 In Adamawa, Borno, Yobe – UNICEF",
    "summarized_story": "Data from the United Nations Children’s Fund (UNICEF), nutrition partners and state governments have showed that 10,165 children have died from Severe Acute Malnutrition (SAM) in Borno, Adamawa and Yobe states between January 2017 and July 2021.\nUNICEF said the number of death recorded in OTP in the period were 7,020 and 3,145 in SC, totally 10, 165.\nMeanwhile, UNICEF has identified multiple displacement, conflict, food crisis and others as factors fueling malnutrition in North East Nigeria.\nHe said early detection, referral, and good management of severe acute malnutrition in children remains key in saving children under the age of five from preventable deaths.\nThe communication officer, UNICEF Maiduguri, Folashade Adebayo, informed that the purpose of the workshop is to increase the knowledge and capacity of media practitioners on child malnutrition, adding that the outcome of the workshop is expected to elevate the visibility of child nutrition issues among policy makers."
  },
  {
    "headline": "PDP Chieftain Alleges EFCC Under Pressure To Persecute Party Leaders",
    "summarized_story": "A chieftain of the Peoples Democratic Party (PDP), Christopher Olulade, has alleged undue pressure on the Economic and Financial Crimes Commission (EFCC) to nail some leaders of the party especially from the North since some stakeholders said the opposition party would zone the presidency to the region in 2023.\nOlulade, who spoke with journalists in Lagos, accused leaders of the ruling All Progressives Congress (APC) of working clandestinely to cripple the PDP ahead of the 2023 presidential poll.\n“We are very much aware of the plans and schemes of leaders of the APC to decimate our ranks.\nHe said the APC had been jittery with the decision of the PDP to zone its presidential ticket to the North.\nADVERTISEMENTOlulade further alleged that those next in line to be arrested are Lamido, Aliyu and former Kano State governor Rabiu Musa Kwankwaso among several others whom he claimed had been penciled down from the northern part of the country."
  },
  {
    "headline": "Bishop calls for prayers, as gunmen abduct former Abia Chief Judge",
    "summarized_story": "Bishop calls for prayers, as gunmen abduct former Abia Chief JudgeBishop calls for prayers, as gunmen abduct former Abia Chief JudgeA former Chief Judge of Abia State and Chancellor of the Anglican Diocese of Ohaji/Egbema in Imo State, Justice Nnenna Oti has been abducted.\n×Justice Oti was kidnapped on Saturday at Orlu in Imo State on her way to Anambra State.\nRevd Chidi Collins Oparaojiaku, canvassed prayers in all churches of the Diocese for safe release of their Chancellor, Justice Nnenna Oti.\nIn a statement on Sunday, he called on churches to as a matter of urgency remember the Chancellor in their prayers.\nThe Bishop said that her captors have made contact while calling for fervent prayers for safekeeping without molestation and violence."
  },
  {
    "headline": "Bishop calls for prayers, as gunmen abduct former Abia Chief Judge",
    "summarized_story": "Bishop calls for prayers, as gunmen abduct former Abia Chief JudgeBishop calls for prayers, as gunmen abduct former Abia Chief JudgeA former Chief Judge of Abia State and Chancellor of the Anglican Diocese of Ohaji/Egbema in Imo State, Justice Nnenna Oti has been abducted.\n×Justice Oti was kidnapped on Saturday at Orlu in Imo State on her way to Anambra State.\nRevd Chidi Collins Oparaojiaku, canvassed prayers in all churches of the Diocese for safe release of their Chancellor, Justice Nnenna Oti.\nIn a statement on Sunday, he called on churches to as a matter of urgency remember the Chancellor in their prayers.\nThe Bishop said that her captors have made contact while calling for fervent prayers for safekeeping without molestation and violence."
  },
  {
    "headline": "Insecurity: Adamawa orders closure of 30 boarding schools",
    "summarized_story": "Adamawa Government has announced the closure of 30 boarding junior secondary schools in the state out of the 34 junior schools over insecurity.\nThe four schools that will not be affected by the closure are the Government Girls Junior Secondary School, Yola; General Murtala Mohammed College, Yola; Special School Jada; and Special School, Mubi.\nFrom now henceforth, all the 30 government junior secondary schools are now day schools.\n”The remaining four that are not affected are Government Girls Junior Secondary School Yola, General Murtala Mohammed College Yola, Special School Jada and Special School Mubi.\n”All students from the affected schools are to be placed in the nearest public junior secondary schools within their catchment or domicile areas."
  },
  {
    "headline": "Insecurity: Adamawa orders closure of 30 boarding schools",
    "summarized_story": "Adamawa Government has announced the closure of 30 boarding junior secondary schools in the state out of the 34 junior schools over insecurity.\nThe four schools that will not be affected by the closure are the Government Girls Junior Secondary School, Yola; General Murtala Mohammed College, Yola; Special School Jada; and Special School, Mubi.\nFrom now henceforth, all the 30 government junior secondary schools are now day schools.\n”The remaining four that are not affected are Government Girls Junior Secondary School Yola, General Murtala Mohammed College Yola, Special School Jada and Special School Mubi.\n”All students from the affected schools are to be placed in the nearest public junior secondary schools within their catchment or domicile areas."
  },
  {
    "headline": "King-size eviction sees Tega, Michael, Peace, Boma out of BBNaija",
    "summarized_story": "BBNaija has again delivered on its promise by giving viewers a thrilling king-size eviction that saw four nominated housemates out of the House.\nTega Dominic-Ajeboh, Michael Ngene, Peace Ogor and Boma Akpore were evicted from the show on Sunday.\nMichael and Peace were evicted shortly after Tega.\nThe duo said that they didn’t see the eviction coming as they believed that they put up their best.\nBoma who is fondly called the “Okro man” didn’t see the eviction coming."
  },
  {
    "headline": "Scientists uncover 55 long term effects of COVID-19",
    "summarized_story": "Scientists have uncovered 55 long term effects of having COVD-19, even for those who experienced mild symptoms, according to a report published in Nature’s Scientific Reports.\nThe lingering effects are worse for those hospitalised for the virus, even after getting a clean bill from doctors.\nThe study reviewed thousands of publications for studies of longterm COVID effects.\nThe most common long-term side effect, they found, is fatigue, affecting 58% of people in the study.\nThe study included side effects reported anywhere from 14 days to 110 days after infection."
  },
  {
    "headline": "Likely Coup In Guinea As Soldiers Detain President Conde",
    "summarized_story": "Guinea’s Special Forces are said to have seized power on Sunday after President Alpha Conde was detained.\nThe soldiers declared the country’s institutions to be dissolved, although the Defense Ministry claims the attack on the president was repelled.\n“We have decided after having taken the president, who is currently with us…to dissolve the current constitution, to dissolve the institutions.\n“We have also decided to dissolve the government and the closure of land and air borders”, one of the coup plotters declared.\nThe threat was also contained by the guard, defense and security personnel, loyalists, and republicans, according to the report."
  },
  {
    "headline": "BREAKING: UN Chief Condemns ‘Takeover’ By Force In Guinea",
    "summarized_story": "UN Secretary-General Antonio Guterres criticized Guinea’s alleged coup on Sunday and asked the country’s detained president to be released by putschists who claimed power.\nI strongly condemn any takeover of the government by force of the gun and call for the immediate release of President Alpha Conde,” Guterres tweeted.\nSoldiers who staged an uprising in Guinea’s capital on Sunday claimed on state television that they had disbanded the country’s government and constitution, as well as shut down all land and air borders.\nAn attack on the presidential palace in Conakry, however, was resisted, according to the defense ministry.\n“While the president was proclaiming everywhere that he wanted to govern differently by annihilating corruption, the embezzlement of public funds increased."
  },
  {
    "headline": "Beg President Buhari To Resign Immediately – HURIWA Tells Nigerians",
    "summarized_story": "HURIWA, the Nigerian Human Rights Writers Association, has urged Nigerians to implore President Muhammadu Buhari to resign immediately.\nThe group is concerned about terrorism’s increasing boundaries in the North West, as well as the extraordinary levels of armed kidnappings in Katsina, Niger, and Zamfara States, as well as armed Fulani attackers’ persistent shelling of sections of Southern Kaduna State.\nHURIWA warned that Nigeria was eroding into a vast ungoverned vacuum, requiring collaborative action from world leaders and the United Nations to prevent the country’s constitutional democracy from collapsing.\nBecause of the toxic body language of people in control of the political strata of power in Abuja, the rights advocacy group feels the assailants have become considerably more bold.\nHURIWA said it won’t be shocking if the terrorists were able to take over the newly purchased Tucano military jets because the current administration was unwilling to wage a law-based war on terror against the armed Fulani attackers."
  },
  {
    "headline": "Open Grazing: Buhari Creating Problems For State Govs – Falana",
    "summarized_story": "Femi Falana, an activist lawyer, has urged President Muhammadu Buhari’s government to cease causing problems for state governors.\nFalana believes that instead of causing problems for states, the Buhari administration should let them deal with the issue of open grazing.\nHe warned President Obama about reopening grazing routes.\nBuhari’s decision to grant funds for ranching in Katsina State was questioned by Falana.\n“So if you are giving money for ranching to Katsina state, why are you now looking for grazing routes in other states?"
  },
  {
    "headline": "NEF to Masari, El-Rufai, Matawalle, Sani Bello: Your security measures lockdown on the North",
    "summarized_story": "As part of efforts at tackling banditry and related criminals in the North, some northern state governors, including Mohammed Bello Matawalle of Zamfara, Katsina state Governor Aminu Bello Masari, Kaduna state Governor Nasir el-Rufai and their Niger state counterpart, Abubakar Sani Bello announced certain measures.\n“30 boarding junior secondary schools out of the 34 schools in the state have been de-boarded with effect from September 6, 2021.\n“From now henceforth, all the 30 government junior secondary schools are now day schools.\n“The remaining four that are not affected are Government Girls Junior Secondary School, Yola, General Murtala Mohammed College, Yola, Special School, Jada and Special School, Mubi.\nHe directed that affected students would be distributed to the nearest public junior secondary schools."
  },
  {
    "headline": "Doctors’ strike: Court case’ll go on unless… – Ngige",
    "summarized_story": "Minister of Labour and Employment, Senator Chris Ngige, said this at the weekend after a meeting with President Muhammadu Buhari.\nAs you all know, the resident doctors are still on strike, their strike has now entered the 33rd day today.\n“So, you have a right to strike, but your employer also has the right to withhold your emolument.\nThey will also agree on the number of days the strike will last.\nWe take it in its stride as the days come by, but we discuss politics, the state of our party, nationally and in my,” he said."
  },
  {
    "headline": "Breaking: Michael, Peace evicted from BBNaija season 6 show",
    "summarized_story": "Micheal and Peace have been evicted from the ongoing big brother Naija house season six Shine Ya show.\nBoth were evicted from the Sunday’s ‘Kingsize Eviction’ edition.\nThey joined Tega who earlier left on Sunday.\nDetails loading…"
  },
  {
    "headline": "JAMB withdraws 2021 UTME result of 19year-old candidate over forgery – NigPilot",
    "summarized_story": "The 19 year old candidate who claimed that JAMB has been altering his results since 2019 was also handed over to Nigeria Police for investigation.\nOloyede accused the candidate of result tempering, adding that he will be handed over to the police for investigation and subsequently prosecuted.\nBecause this boy has accused JAMB, we are going to withhold his result until the investigation is concluded.\nEarlier, John had said: The result I have been receiving is not the result I am entitled to.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Abuja Police arrest 2 adolescent kidnappers – Nigpilot",
    "summarized_story": "Federal Capital Territory FCT Police Command Abuja has arrested two adolescent kidnappers operating along Kwali area Council of the City.\nPublic Relations Officer of the Command in a statement on Thursday in Abuja, said the Command arrested one Musa Mukailu 18 years and one Damina Wali 17 years all male suspected to be kidnappers along Kwali axis of the FCT.\nAdding that they met their waterloo while trying to kidnap two women along kwali axis of the FCT.\nEffort is in place to arrest other members of the syndicate.”Stressing that the Command pledges its undeterred resolve to ensure lives and properties of residents within the FCT are protected.\nAnd urged the FCT residents to report all suspicious movements,"
  },
  {
    "headline": "Buhari has recovered about N1trn stolen funds, assets since 2015 – APC group – NigPilot",
    "summarized_story": "As part of its anti-corruption drive, the administration of President Muhammadu Buhari has recovered about a trillion Naira worth of stolen funds and assets since assuming office in 2015, Nigerian Pilot has gathered.\nThis is according to APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress, APC.\nThe group noted that under President Buhari’s watch the Federal Government has prioritized the recovery and return of stolen assets belonging to the Nigerian people.\nLukman, APC-LAC said all final forfeitures are being deployed for use in the Government’s special Infrastructure and Social Investment Programmes, or put into the annual Budget.\nIt added that the most recent Abacha and Ibori Loots were transferred to the Nigeria Sovereign Investment Authority (NSIA), for transparent management under the Presidential Infrastructure Development Fund (PIDF)."
  },
  {
    "headline": "President replaced, not sacked Minister -Adesina. ~ Says national service is to God and humanity – NigPilot",
    "summarized_story": "Special Adviser to the President on Media and Publicity, Femi Adesina has said President Muhammad Buhari did not sack, but replaced ministers of Agriculture and Rural Development, Alhaji Mohammed Nanono and his Power counterpart, Saleh Mamman, saying national service is to God and humanity.\nSpeaking in an interview with Channels TV on Sunrise Daily yesterday, Adesina said contrary to media and public views, the president only called to thank the replaced ministers for their services but never sacked them.\n“The president never said their performances were weak but said he had called them personally to thank them for their services to the country and needed to move on to replace them.\n“The president must have had reasons for dropping the two ministers but he never said their performances were weak,” he emphasised.\nHe reassured Nigerians of President Muhammadu Buhari’s commitment towards the yearnings of the current challenges, saying that the president is resolute on tackling all issues headlong to secure the future of the country."
  },
  {
    "headline": "FG Condemns ‘Unconstitutional Change Of Govt’ In Guinea",
    "summarized_story": "The Nigerian Government has condemned what it describes as an apparent coup d’état in the Republic of Guinea.\nAccording to the statement, the takeover of power by the military is in clear violation of the ECOWAS Protocol on Democracy and Good Governance.\nAnother video sent to AFP showed a rumpled-looking President Conde sitting on a sofa, surrounded by troops.\n“I am personally following the situation in Guinea very closely,” he said in a social media post.\n“I strongly condemn any takeover of the government by force of the gun and call for the immediate release of President Alpha Conde.”"
  },
  {
    "headline": "‘We Are Starving Here,’ Nigerians In UAE Lament Work Permit Restrictions",
    "summarized_story": "It’s been a tough period for many Nigerians living in the United Arab Emirates (UAE), especially those in Dubai, as they lament the loss of jobs and difficulty in obtaining a work permit.\nOfficials at the Nigerian Embassy in the UAE say they are doing everything in their power to resolve the issue, but the question the victims are asking is for how long?\n766 of 2015, a worker whose employment is terminated due to contract expiration can get a new work permit whenever he/she wishes to join new employment.\nThe law also allows an employee to get a new work permit for all limited and non-limited contracts if it is determined that the employer has failed to meet the legal and contractual obligations, among other conditions.\n“From what I believe as an official position from the UAE, the UAE is a very welcoming country."
  },
  {
    "headline": "CJN Demands Court Records Of All Conflicting Orders",
    "summarized_story": "The Chief Justice of Nigeria and Chairman National Judicial Council (CJN), Justice Tanko Muhammad has demanded the records of proceedings in all the suits on which conflicting exparte orders were given.\nSpokesperson of the National Judicial Council, Soji Oye confirmed to Channels Television that the memo was indeed sent out from the office of the CJN.\nChannels TV also confirmed that the Chief Judges of Rivers, Kebbi, Cross Rivers, Anambra, Jigawa and Imo states are to meet with the CJN on Monday, September 6, to answer questions on the controversial conflicting orders delivered in their various states.\nThe CJN is also expected to meet with the leadership of the Nigerian Bar Association in the course of the week, over the issue.\nThe unprecedented move by the leadership of the judiciary is aimed at resetting the anti-corruption efforts of the CJN and entrenching a new culture of accountability in the judicial system."
  },
  {
    "headline": "Military Arrests Guinea President, Takes Over Power",
    "summarized_story": "Later on Sunday, the head of Guinea’s military special forces Lieutenant-Colonel Mamady Doumbouya appeared on public television, draped in the national flag, and cited government “mismanagement” as a reason behind his actions.\nThe apparent coup comes amid a long period of political tension in Guinea, first spurred by Conde’s highly contested bid for a third presidential term last year.\nThe day before the presidential election last year, the military blocked access to Kaloum after an alleged military rebellion east of the capital.\nViolent ElectionsThe most recent presidential poll in the nation of some 13 million people, in October 2020, was violently disputed and also marred by accusations of electoral fraud.\nDozens of people were killed during demonstrations against a third term for the president, often in clashes with security forces."
  },
  {
    "headline": "Boma, Tega, Peace, Michael Evicted From BBNaija Show",
    "summarized_story": "Four more Big Brother Naija housemates have been evicted from the ongoing Season Six of the reality TV show tagged ‘Shine Ya Eye’.\nTega, Peace, Michael, and Boma left the house on Sunday evening following the ‘King Size’ eviction earlier announced by the organisers of the show.\nJackie B and Jay Paul were exempted from the threat of leaving the house after the duo won the Head of House task.\nMichael, who was with Jackie B throughout his stay in the house, was evicted from the show after about two months.\nPeace, who is also one of the housemates evicted on Sunday, emerged as the first runner-up in the task."
  },
  {
    "headline": "Robbers notify Ogun community of impending invasion",
    "summarized_story": "Residents of Olosan Community in Leme, Abeokuta, Ogun State, have been fearful since armed robbers notified them of a planned visit to their homes.\nThe robbers informed residents of their intentions through notices pasted on walls throughout the neighborhood.\nIn the notice, the robbers, which described itself as ‘Oga Oga’ meaning ‘ master of masters,’ threatened to kill residents who fail to keep money for them during the impending robbery.\nThe notice read: ‘Important notice to residents of Olosan community.\n“Please help us beg them (the robbers), we don’t have money, please."
  },
  {
    "headline": "Bandits kill 20 persons in reprisal attack in Magami, Niger State",
    "summarized_story": "Armed bandits invaded Magami community in the Shiroro local government area of Niger state on Friday night, killing at least twenty persons in what a source close to the community described as a retaliatory attack by the gunmen.\nSeveral locals are claimed to be missing as a result of the night onslaught, while others fled to neighboring settlements for protection.\n“Kuta the headquarters of Shiroro local government which is considered a safer ground is swelling up with fleeing IDPs who have since vacated the troubled areas scampering helter skelter for shelter, peace and security” Kukoki said in the statement.\nThis, according to him, will guarantee peace and enable the locals to continue with their lawful and legitimate activities.\nA Government official who spoke on condition of anonymity confirmed the attacks on Kukoki, Bassa, Magami and Madaka villages saying “they attacked and kill many people but the number is yet to be ascertained”."
  },
  {
    "headline": "Lagos, Rivers to begin VAT collection, FG, North disagree",
    "summarized_story": "Now, at the end of the month, Rivers State government has never received more than N2bn from VAT.\nIn 2020, for example, total VAT collection was about N1.53tn, with import VAT being N348bn while foreign non-import VAT was N420bn and local VAT amounted to N763bn.\nSo, we are keen on joining Rivers State Government should the Federal Government appeal the judgment which granted Rivers State the right to collect VAT.\nIt is other parts of the country that make Lagos and Rivers states what they are.\n“The state government is still studying the VAT judgment to understand its details, impact and ramifications.”"
  },
  {
    "headline": "Osinbajo meets Doctors via Zoom to end strike, NMA remains resolute",
    "summarized_story": "Vice President Yemi Osinbajo has intervened in the ongoing strike by members of the Nigerian Association of Resident Doctors, according to reports.\nHowever, 33 days after the commencement of the strike, Osinbajo reached out to the doctors in a bid to find a lasting solution to the crisis.\nTVC news gathered that the vice president had a zoom meeting with one of the officials of the doctors’ association on Friday where issues relating to the strike were discussed.\nWe trust his judgement.”Meanwhile, the Nigerian Medical Association said the Federal Government has yet to reach out to the association.\nWhen you visit these other countries, you can acquire medical licenses to practice in other fields.”"
  },
  {
    "headline": "Nigeria: Cholera Kills 150 in Northwest Katsina State",
    "summarized_story": "Nigeria’s northern Katsina state has recorded over 150 deaths resulting from the outbreak of cholera, the state’s Primary Health Care Development Agency has said.\nShamsudeen Yahaya, executive secretary, Katsina Primary Health Care Development Agency (PHCDA), said the northern state has also recorded at least 5,677 reported cases since the outbreak of the disease in the state.\nYahaya said the figures were gotten from hospitals and other primary health care centres in the state.\n“Just like it is happening in some parts of the country, we still have cholera cases in Katsina state.\n“As at Thursday, September 2, we had 5,677 cases of cholera covering the 34 local government areas of the state."
  },
  {
    "headline": "South Africa’s Jailed Ex-President Zuma Placed on Medical Parole – Arise News",
    "summarized_story": "Former South Africa president Jacob Zuma was Sunday granted medical parole, prison authorities announced.\n“The Department of Correctional Services (DCS) is able to confirm that Mr Jacob Gedleyihlekisa Zuma has been placed on medical parole,” it said in a statement.\nThe parole is effective Sunday and he will serve out the rest of the 15-month jail sentence outside jail.\nThe decision to accord him parole was compelled “by a medical report” the department received, it said.\nHis long-running corruption trial over an arms deal dating back more than two decades was last month postponed to September 9, pending a medical report on his fitness to stand trial."
  },
  {
    "headline": "UAE Unveils New Residency Guidelines to Attract Foreigners",
    "summarized_story": "“Green Visas” will allow expatriates to apply for work without being sponsored by an employer, targeting investors and highly skilled workers as well as top students and graduates.\nGreen visa holders will be able to sponsor their parents and children up to the age of 25 on their permits.\nAnd in an effort to loosen the job market, it’s allowing for the hiring of temporary workers above the age of 15.\nOil-rich Gulf states have long resisted offering permanent residency, let alone citizenship, to their millions of foreign workers, guarding generous privileges enjoyed by their nationals.\nBoth Saudi Arabia and Qatar have taken steps toward allowing some expatriates permanent residency."
  },
  {
    "headline": "‘This Is Life from Now On’: Israel’s Coronavirus Czar Warns People to Prepare for Fourth Covid Jab – Arise News",
    "summarized_story": "With over 2.5 million Israelis already inoculated with three Covid-19 vaccine doses, the national coronavirus czar, Salman Zarka, has said preparations need to begin for an eventual fourth jab due to the virus’ growing variants.\n“This is our life from now on, in waves,” Zarka added.\nHe believes booster shots that deal with new variants of the virus more effectively could be ready by late 2021 or early 2022.\nDespite two-thirds of the Israeli population already being vaccinated with two doses, health officials expect that the more spreadable Delta will continue to lead to a rise in cases and hospitalizations in the fall months.\nIsrael was among the first countries to offer a third dose of the vaccine, which over 2.5 million people have already received."
  },
  {
    "headline": "Guinea Soldiers Say on TV That President Conde ‘Taken’ and Government ‘Dissolved’ – Arise News",
    "summarized_story": "Soldiers who staged an uprising in Guinea’s capital on Sunday said in a short broadcast on state television that they have dissolved the constitution and the government in the West African state.\nHowever, the defence ministry said an attack on the presidential palace by mutinous forces had been put down.\nHeavy gunfire had broken out near the presidential palace in Conakry on Sunday morning, with several sources saying an elite national army unit led by a former French legionnaire, Mamady Doumbouya, was behind the unrest.\nThe soldier spoke after videos shared on social media – which Reuters could not immediately authenticate – showed President Alpha Conde surrounded in a room by army special forces.\nMany soldiers, some heavily armed, were posted around the palace, the source added."
  }
]