[
  {
    "headline": "States bank on PPP projects as cash crunch bites harder",
    "summarized_story": "State officials, who disclosed this in separate interviews with The PUNCH on Sunday, ruled out sacking workers or slashing salaries in order to reduce the states’ wage bills.\nThe officials said states that had yet to start the PPP, were also planning to embrace it to finance projects.\nThey confided in our correspondents that no matter how tight the finances of their states were, governors would not contemplate sacking workers because of the possible political backlash.\n“Instead of sacking workers, we are focusing on ensuring that the payroll and the nominal roll of the state are sanitised to prevent fraud and corruption.\nAroh stated, “He (the state governor) is also working hard to see how he will cut overheads in the state."
  },
  {
    "headline": "119 passengers from high-risk countries refuse isolation – Lagos",
    "summarized_story": "The Lagos State Commissioner for Health, Prof. Akin Abayomi, has raised the alarm that 119 passengers from high-risk countries have refused to be isolated after coming back into the country.\nWe have isolated 433 passengers in our various accredited hotels and facilities; 262 are in isolation and 154 passengers have been discharged with a negative COVID-19 test.\nOf the remaining 135 passengers, 119 have refused isolation and 16 are unaccounted for.\nAbayomi also disclosed the state government’s intention to partner the private sector and Federal Government in ramping up vaccination in the state.\nGiven the requirement for achieving herd immunity, Lagos State still needs to vaccinate about 14 million people to reach this target."
  },
  {
    "headline": "GRAPHICS: Combined police operatives kill Gulak’s killer, Imo CP says",
    "summarized_story": "It was widely reported that Gulak was on Sunday morning killed in Imo State while on his way to Sam Mbakwe International Cargo Airport, Owerri.\nPolice Spokesperson in Imo, Bala Elkana, in a statement on behalf of the CP, explained that “riffles, pistol, and ammunition were recovered from the slain suspects.\nElkana also revealed that the vehicles the slain hoodlums used in killing the former Presidential aide were recovered by the command.\nThree out of the four vehicles used in attacking Gulak were recovered.\n“The Commissioner of Police Imo State, CP Abutu Yaro, fdc commended the gallant effort of the team and admonished them to continue to protect the public space,” he in the statement."
  },
  {
    "headline": "Releaf, OnePipe partnership deepens financial inclusion, improves productivity for South-South farmers",
    "summarized_story": "Over 65 percent of Nigerians are outside the financial services envelope, with millions unbanked or under-banked.\nThe combination of COVID-19 disruptions and the widening digital divide in the rural and underserved areas has threatened the attainment of financial inclusion targets in Nigeria.\nThis partnership between Releaf and OnePipe is thus a welcome initiative to the National Financial Inclusion Strategy and provides opportunities for thousands of rural farmers across Nigeria’s South-South region.\nOnePipe’s Founder and Chief Plumber, Ope Adeoye described the partnership with Releaf as “an exciting opportunity to co-create value with Releaf.\nOnePipe is at the vanguard of the embedded finance movement in Sub-Saharan Africa and has assisted companies like Releaf to provide seamless digital financial services to their partners."
  },
  {
    "headline": "South- East NASS Caucus laments attacks, killings in South East",
    "summarized_story": "The statement was signed by for Deputy President of the Senate, Sen. Ike Ekweremadu for Enugu State, Senate Minority Leader, Sen. Enyinnaya Abaribe for Abia State; Sen. Sam Egwu for Ebonyi State; Sen. Frank Ibezim for Imo State and Sen. Stella Oduah for Anambra State.\nOthers are Hon Toby Okechukwu Enugu State;; Hon Nkiruka Onyejiocha Abia State; Hon Lynda Chuba Ikpeazu Anambra State; Hon Jerry Alagboso Imo State and Hon Sylvester Ogbaga Ebonyi State.\n“We have had cause always to deploy the instrumentalities of the institution of state to alert the government of Nigeria about some of the vexed issues of injustice, inequity and obvious marginalisation of the South East in governance structure.\n“However, we are worried over recent developments in the South East, which has thrown the zone into violence and confusion.\n“We advise the security agencies to continue to show restraint in the discharge of its mission to restore peace in the Southeast."
  },
  {
    "headline": "Re: Anambra 2021: Youth political appointment may not be part of my agenda – Soludo",
    "summarized_story": "Kindly Share This Story:Cee Cee Soludo Media Office attention has been drawn to the above headline published by the Nigerian Tribune Newspaper, online medium, bordering on the statement allegedly made by Prof Chukwuma Charles Soludo, on May 24, 2021 when he was hosted by the Njikoka, Anaocha and Dunukofia Federal Constituency led by Honourable Dozie Ferdinand Nwankwo, Member, Representing the Constituency at the Federal House of Representatives, at his Enugwu-Ukwu country home in Njikoka Local Government Area of Anambra StateThe Soludo Media Office considers the above headline misleading and a wrong representation of the statements made by Cee Cee Soludo at the eventFor the avoidance of doubt and to keep the records straight, it has become necessary to issue this release to correct the wrong or erroneous impression the misleading headline would have created in the mindset of millions of youths and all Soludo supporters within Anambra State and beyondREAD ALSO:However, the true version of what Cee Cee Soludo said at the event while speaking to thousands of jubilant youths and supporters who came to welcome him to the occasion, was that in addition to government regular employment or political appointments for the youths, he will also inspire and encourage them to imbibe the spirit of entrepreneurship by putting in place an enabling environment that will help create one thousand youth millionaires every year who will in turn create employment opportunities for others if elected Governor of Anambra State by their supportSoludo hinged his statement on the philosophy of teaching the people how to fish as a means of further galvanising wealth creation and Industrial development of the stateAs usual and most unfortunately, these innocuous statements were deliberately and maliciously ‘twisted’ and taken out of context for a misleadingheadline by the Tribune online news blogger to deceive the general public by inferring a different statement which Soludo never madeWithout a shadow of doubt, Cee Cee Soludo who had played the role of a father-figure, role model and mentor to a vast majority of Anambra youths and other youths across the federation, will nevertheless, continue to engage and inspire them to aim higher in life, just as he has always professed both in private and public engagements that the future belongs to the youthsSigned: Cee Cee Soludo Media OfficeKindly Share This Story:"
  },
  {
    "headline": "Constitution Review an exercise in Futility, waste of time, public funds — Afenifere",
    "summarized_story": "Also read:“Amending the constitution is an exercise in futility and a waste of time and public fund.\n“We cannot claim to be a federal Republic and be governed by a unitary constitution.\n“We cannot claim to be in a democracy and be governed by a constitution that does not emanate by the people.\n“Every session of the two arms of the National Assembly, since 2007, has embarked on the same jamboree of constitutional amendment spending public funds on public hearings, without any result.\n“The National Assembly is part of the issue to be determined in the process of restructuring and cannot legitimately be the judge in such exercise."
  },
  {
    "headline": "BREAKING: Security operatives kill IPOB fighters over Gulak’s murder in Imo",
    "summarized_story": "He disclosed the IPOB militants moved in a Toyota Camry 2005 Silver color, Toyota Sienna 1998 Model Gold Color, Toyota Hilux White color and Lexus RX 330 Gold Color.\n“3 of the Four Vehicles Toyota Sienna, Toyota Hilux and Toyota Camry used by the IPOB/ESN Terrorist for their Operation were demobilized/recovered.\n“7 of the terrorists with bullet wounds were completely burnt inside the Toyota Sienna and Hilux vehicles that caught fire during the gun battle”, the Sitrep read.\nThree AK-47 rifles, one English Pistol, five AK-47 magazines, 92 AK-47 ammunition, several charms and three operational vehicles of the IPOB and ESN were recovered.\nEfforts are on to trace and arrest wounded IPOB and ESN members hiding in the surrounding forests and villages."
  },
  {
    "headline": "Nigerians need new constitution, not review – Rights activist, Ikimi",
    "summarized_story": "Human rights activist, Mr. Oghenejabor Ikimi, has said that Nigerians need a national conference of all ethnic nationalities with a view to draft and give themselves a “people oriented constitution that’s acceptable.”Mr. Ikimi made the assertion in a telephone chat with a DAILY POST correspondent in Warri, Delta State.\nHe noted that the existing constitution is a product of “Decree 34” and it’s not the people’s constitution.\nWhat we just need is a brand new constitution.\n“So, what we really need is a kind of National Conference irrespective of the Senate or our representative.\nWhile noting that Nigeria cannot develop, Mr. Ikimi said something has to be done so Nigerians can have a befitting constitution for the country to move forward."
  },
  {
    "headline": "Abia: Two inspectors died, no firearm stolen – Police chief speaks on attack",
    "summarized_story": "DAILY POST reported that unknown gunmen had razed the Umuagu Police station in Umuahia North Local Government area of the state.\nThe Police Commissioner said the attackers had stormed the police formation at about 6pm on Saturday, shooting sporadically.\nShe added that some of the attackers escaped with gunshot wounds while two vehicles were recovered.\nThe facility, the Police boss said, was burnt down following the detonation of an explosive through the back of the building.\nShe therefore urged medical facilities within and outside the state to report to security agencies in the event that patients with suspected bullet wounds come for treatment."
  },
  {
    "headline": "Gulak: Atiku reacts to assassination of Jonathan’s ex-aide in Imo",
    "summarized_story": "Former presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar, has reacted to the death of Ahmed Gulak, ex-aide to former President Goodluck Jonathan.\nAtiku said the spate of killings would stop when security agencies start holding people accountable.\nAccording to Atiku: “The spate of killings across the country should be a source of concern to every Nigerian.\nThese needless killings have reached pandemic levels.\n“The killings in Benue and shooting to death of former presidential adviser, Ahmed Gulak by yet-to-be-identified persons stands condemned."
  },
  {
    "headline": "Gulak: We can no longer coexist with Igbos in Nigeria – Northern coalition",
    "summarized_story": "The Coalition of Northern Groups (CNG) on Sunday said the North can no longer continue to coexist with people of Igbo extraction in Nigeria.\nCNG said the assassination of Ahmed Gulak, a former aide to ex-President Goodluck Jonathan in Imo State, was an indication that the North can no longer coexist with southeasterners in Nigeria.\nSpokesman of CNG, Abdul-Azeez Suleiman, said Gulak’s assassination is a wider plan by the people of Igbo extraction to replicate the ugly events of 1966.\nIn a statement by Suleiman, CNG claimed that people of the Southeast are funding “gangs” like the Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) to cause havoc.\nHe said the constitution review was just another exercise in futility with the sole motive of diverting the huge public funds allocated for it as with all previous attempts."
  },
  {
    "headline": "Mr P, Rudeboy should hug it out after Chelsea win, says Ebuka",
    "summarized_story": "Popular media personality, Ebuka Obi-Uchendu has urged Nigerian twin musicians, Mr. P and Rudeboy to end their feud.\nA few years ago, they decided to go their separate ways and do music individually which caused uproar on social media.\nIt is also no news that they coincidentally support the same football team, Chelsea.\nThe defunct P Square twin, Mr. P and Rudeboy were not left out as they took to their different social media pages to post videos and pictures of them celebrating the the win of their beloved football club, Chelsea.\nEbuka’s tweet reads: “Maybe Peter and Paul will hug it out tonight with their excitement after this win."
  },
  {
    "headline": "BREAKING: Bandits abduct many students in Niger",
    "summarized_story": "Several students have been feared abducted in an Islamiyya school at Tegina in Rafi local government area of Niger state.\nDirector General of the Niger State Emergency Management Agency (NSEMA), Alhaji Ibrahim Ahmed Inga, confirmed the incident.\nSources hinted the abducted students could be as many as 200 but The Nation could not confirm this.\nNiger Government also confirmed the attack but said the number of abducted students were yet to be known.\nChief Press Secretary to Niger Governor, Mary Noel Berje, in a statement said: “A number of conventional Islamiyya students of Salihu Tanko Islamic School Tegina in Rafi Local Government Area of Niger State have been abducted."
  },
  {
    "headline": "30 feared killed in fresh herdsmen attack in Ebonyi",
    "summarized_story": "Gunmen suspected to be herdsmen on Sunday attacked some Ebonyi communities, killing at least 30 persons.\nThe gunmen attacked Odoke, Ndiobasi and Obakotara communities in Ebonyi local government area.\nThe communities share boundary with Ado local government area in Benue State.\nAn attack on an Izzi village inside Benue State, allegedly by herdsmen, resulted in many casualties.\nChairman of Ebonyi local government area, Chinyere Nwaogbaga confirmed the incident."
  },
  {
    "headline": "BREAKING: Bandits on rampage in Niger town",
    "summarized_story": "Bandits are attacking Tegina town in Rafi local government area of Niger state.\nThe Nation gathered the bandits are operating in the main Tegina town shooting, sporadically.\nA security source said everyone has taken cover from shots by the bandits.\nSome other sources confirmed the development, stating the bandits have taken over Tegina-Zungeru-Minna road stopping vehicles and attacking them.\nCalls made to the Police Public Relations Officer (PPRO) were unanswered."
  },
  {
    "headline": "BREAKING: Umahi dissolves Ebonyi executive council",
    "summarized_story": "Ebonyi Governor David Umahi has dissolved the State Executive Council with immediate effect.\nSecretary to the State Government (SSG) Kenneth Ugbala announced the dissolution after the council’s meeting on Friday in Abakaliki.\nHe however pointed out some key officers were not affected by the first phase of the dissolution.\nThose not affected, according to him, include SSG, Attorney General and Commissioner for Justice, Cletus Ofoke; Commissioner for Finance, Orlando Nweze and Commissioner for Information, Uchenna Orji.\nOthers are Commissioner for Border Peace, Stanley Okoro Emegha; SSA Investment, Chioma Nweze and Commissioner for Capital City, Onyekachi Nwebonyi."
  },
  {
    "headline": "South East senators, reps give IGP marching orders to fish out unknown gunmen",
    "summarized_story": "From Fred Itua, AbujaSenators and members of the House of Representatives from the South East geopolitical zone, have urged the acting Inspector-General of Police (IGP), Usman Alkali, to fish out unknown gunmen carrying out killings in the region.\nThey said the IGP must unravel the actual identities of the unknown gunmen in the South East and bring them to justice.\nThey said the investigation has become necessary in the current circumstances as a result of the magnitude of recent attacks.\nIn a statement signed by chairman of the South East caucus, Ike Ekweremadu, Minority Leader, Enyinnaya Abaribe, among others, siad majority of Igbo are opposed to any form of violence in furtherance of any cause.\n“We note the increasing agitation for restructuring of Nigeria and increasing separatist agitations across the country due to perceived and real issues of marginalisation."
  },
  {
    "headline": "End 6 years of disregard for rule of law, SERAP tells Buhari",
    "summarized_story": "Socio-economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to use the sixth anniversary of his government in power to halt Nigeria’s backsliding from constitutional and international obligations.\nWe are gravely concerned about persistent attacks on the rule of law.\nThis government’s effort to use anniversary celebrations to deflect attention from its record of assault on the rule of law isn’t going to work.\nInstead, it should use the occasion to create a rule of law-friendly environment that would make Nigerians safer.\nSystematically breaching the rule of law is not a sign of strength."
  },
  {
    "headline": "Restructure now or Nigeria’ll die, Southern, Middle Belt Leaders Forum",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaSouthern and Middle Belt Leaders Forum (SMBLF) has called on President Muhammadu Buhari to address Nigerians on the various challenges facing the country, including insecurity.\nPresident is not an emperor, he is not a king, he is not a monarch, he is a politician.\nHe also stressed the need for the 2023 presidency to be zoned to the south since the north would have had eight years at the end of Buhari’s tenure.\nThe elders also called on President Buhari to heed calls for a national dialogue to trash out contending issues facing the country.\nThe communique was signed by Chief Clark, Leader; Chief Ayo Adebanjo, Leader of Afenifere; Prof George Obiozor, President General, Ohanaeze Ndigbo Worldwide; Dr. Bitrus, National President, Middle Belt Forum; and Senator Emmanuel Ibok Essien, National Chairman PANDEF."
  },
  {
    "headline": "Michael Okpara centenary celebration holds in Abuja June 3",
    "summarized_story": "The first posthumous and commemorative centenary anniversary in honour of Dr. Michael Iheonukara Okpara, first republic politician, nationalist and former premier of Eastern Region of Nigeria (1959 -1966) holds on Thursday, June 3 at Sheraton Hotels and Towers, Abuja.\nThe event will also feature the presentation of Okpara Leadership Prize to a number of personalities, two universities and their Vice Chancellors, namely Michael Okpara University of Agriculture, Umudike (MOUAU) in Abia State and the University of Nigeria, Nsukka (UNN).\nThe Centenary Organising Committee proffered reasons for presenting the Okpara Leadership Prize to the personalities.\nThe amiable Premier and nationalist, Dr. Okpara would have been 100 years old having been born on 25 December 1920.\nDr. Okpara was former member of Eastern Nigeria House of Assembly on the ticket of the National Council of Nigeria and the Cameroons (NCNC)."
  },
  {
    "headline": "Sit-at-home: Tension, fear grip South East",
    "summarized_story": "Similarly, MASSOB leader, Uchenna Madu, yesterday, warned the Nigeria security agencies that their threats would not hold waters.\nThis came as the various police commands threatened to crush any form of procession or gathering relating to Biafra today.\nAttendance in many churches was scanty due to fear, as many people assumed the sit-at-home started yesterday as it used to.\nSimilarly, a wave of uncertainty enveloped Enugu State, yesterday, ostensibly because of recent security threats.\nHis warning is coming on the heels of the sit-at-home order for today by members of the Indigenous People of Biafra (IPOB)."
  },
  {
    "headline": "Police Kill Gulak’s Killers in Shoot-out, Recover Arms, Vehicles",
    "summarized_story": "Police in Imo State Sunday night said the killers of former presidential adviser, Ahmed Gulak, had been killed in a shoot-out.\nPolice said the six hoodlums who carried out the killing and four other members of their gang were fatally injured, while three of the four vehicles used in attacking Gulak were recovered.\n“Having established the identity of the assailants and the description of the vehicles used in carrying out the attack, the teams further got details of the direction the hoodlums have taken.\nThree out of the four vehicles used in attacking Gulak were recovered.\n“The Commissioner of Police Imo State, CP Abutu Yaro, fdc commended the gallant effort of the team and admonished them to continue to protect the public space.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Again, Bandits Invade Niger Community, Kill Two, Kidnap Several Islamic School Children",
    "summarized_story": "By Laleye DipoBandits, again on Sunday, invaded Tegina town in Rafi Local Government Area of Niger State, killing two people, while many children in an Islamic school were kidnapped.\nThis is the front view of the Islamic school where the children were kidnapped Sunday eveningThe bandits, according to an eyewitness, stormed the town riding on many motorcycles and shot sporadically into the air to create fear in the people.\nThe eyewitness said the gunmen went to the Islamic school close to the Tegina police station, where they abducted an unspecified number of the children.\nTegina town is a few kilometres from Kagara, the headquarters of Rafi Local Government, where 27 school boys were abducted in February.\nThe Director General of the Niger State Emergency Management Agency (NSEMA), Alhaji Ibrahim Ahmed Inga, confirmed the incident, but said: “We don’t have the details yet.”The police could not be reached for comment."
  },
  {
    "headline": "Police: How Gulak Was Killed by Six Gunmen",
    "summarized_story": "The Police in Imo State have narrated how Ahmed Gulak, former Political Adviser to former President Goodluck Jonathan, was killed by unknown gunmen Sunday morning.\nThe statement noted that Gulak left his room at Protea Hotel without informing the police or any security agency despite the insecurity in the South east, and Imo in particular.\nAccording to the police, the cab driver took an irregular route to the airport where his veicle was intercepted by six gunmen in another vehicle.\nThe police statement read: “On the 30/5/2021, at about 07:20hrs, armed bandits intercepted and attacked a Toyota Camry cab carrying Ahmed Gulak and two others who were on their way to Sam Mbakwe Airport to catch a flight.\n“Ahmed Gulak left his room at Protea Hotel without informing the Police nor sister agencies in view of the fragile security situation in the South East and Imo in particular."
  },
  {
    "headline": "Breaking: Ahmed Gulak, Ex-Political Adviser to Former President Jonathan, Killed in Owerri",
    "summarized_story": "Ahmed Gulak, a former political adviser to former President Goodluck Jonathan, was shot dead on Sunday in Owerri, Imo State capital.\nPolice have confirmed his murder but details of his death are still scanty.\nReports said he was shot dead by unknown gunmen who ambushed his vehicle on his way to Sam Mbakwe Airport in the state capital.\nGulak conducted the controversial gubernatorial primary in Imo State that led to the emergence of Senator Hope Uzodimma as the candidate of the All Progressives Congress (APC).\nFollowing the controversy that trailed the primary, the Gulak-led committee was dissolved by the national headquarters of the APC."
  },
  {
    "headline": "After 40 Days in Captivity, All Remaining Abducted Greenfield Students Freed",
    "summarized_story": "Five out of the abducted students and a Male warden were grossly murdered by the bandits.\n“Governor Nasir El-Rufai welcomed the news of the students’ release, and conveyed solace and encouragement to them following their harrowing ordeal.\n“Yes, 14 of the students of the Greenfield University were released from captivity this evening (Saturday), remaining three of them still in captivity,” Jalige explained.\nHe did not give details of the students’ release and why three were still being held.\nThe last batch of 27 of the students was released about two weeks ago after spending 56 days in captivity."
  },
  {
    "headline": "BREAKING: Over 200 Islamic School Students Kidnapped In Niger",
    "summarized_story": "No fewer than 200 students of an Islamiyya school located at Tegina in the Rafi Local Government Area of Niger State have been abducted.\nA resident of the area, Zayyad Mohammed, confirmed the incident to Channels Television on the phone.\nAccording to him, the Salihu Tanko Islamiyya school where the incident took place, was built by a retired immigration officer.\nDetails of the attack are still sketchy, but sources said the school is not the usual Sangaya boarding Islamic school, but a conventional one where parents send their children on a daily basis for the purpose of acquiring Islamic education.\nOn Saturday, some kidnapped students of Greenfield University, Kaduna regained freedom after spending weeks in captivity."
  },
  {
    "headline": "BREAKING: Over 200 Islamic School Students Kidnapped In Niger",
    "summarized_story": "No fewer than 200 students of an Islamiyya school located at Tegina in the Rafi Local Government Area of Niger State have been abducted.\nA resident of the area, Zayyad Mohammed, confirmed the incident to Channels Television on the phone.\nAccording to him, the Salihu Tanko Islamiyya school where the incident took place, was built by a retired immigration officer.\nDetails of the attack are still sketchy, but sources said the school is not the usual Sangaya boarding Islamic school, but a conventional one where parents send their children on a daily basis for the purpose of acquiring Islamic education.\nOn Saturday, some kidnapped students of Greenfield University, Kaduna regained freedom after spending weeks in captivity."
  },
  {
    "headline": "EXCLUSIVE: Army, Police Invade Enugu Church, March 50 Members Away Over Alleged IPOB Membership",
    "summarized_story": "Nigerian Army and police operatives in the early hours of Sunday stormed a church on Owerri Road, Enugu State, marching away over 50 members over their suspected membership of the Indigenous People of Biafra (IPOB).\nSaharaReporters obtained a video of the incident which showed the operatives in commando style, molesting the members as they raised their two hands and were searched.\n“The Nigeria police and military have just stormed a church in Owerri Road, Enugu State, molesting over 50 men, both old and young while matching them to an unknown destination.\nWATCH: @HQNigerianArmy, @PoliceNG Invade Enugu Church, March 50 Members Away Over Alleged IPOB MembershipVisit: https://t.co/12qJDXpbXn for full story.\nOthers are Ohaji/Egbema Local Government Area of Imo State and communities of Ebonyi State."
  },
  {
    "headline": "EXCLUSIVE: Army, Police Invade Enugu Church, March 50 Members Away Over Alleged IPOB Membership",
    "summarized_story": "Nigerian Army and police operatives in the early hours of Sunday stormed a church on Owerri Road, Enugu State, marching away over 50 members over their suspected membership of the Indigenous People of Biafra (IPOB).\nSaharaReporters obtained a video of the incident which showed the operatives in commando style, molesting the members as they raised their two hands and were searched.\n“The Nigeria police and military have just stormed a church in Owerri Road, Enugu State, molesting over 50 men, both old and young while matching them to an unknown destination.\nWATCH: @HQNigerianArmy, @PoliceNG Invade Enugu Church, March 50 Members Away Over Alleged IPOB MembershipVisit: https://t.co/12qJDXpbXn for full story.\nOthers are Ohaji/Egbema Local Government Area of Imo State and communities of Ebonyi State."
  },
  {
    "headline": "Buhari Speaks On Killing Of Ex-President Jonathan’s Aide, Gulak In Imo",
    "summarized_story": "President Muhammadu Buhari has reacted to the murder of former President Goodluck Jonathan’s aide, Ahmed Gulak, in Owerri, Imo State by yet-to-be-identified gunmen, saying the perpetrators will be brought to book.\nThe President through his spokesperson, Garba Shehu, said on Sunday that the murder was perpetrated by wicked persons “to undermine the peace, unity and territorial integrity of our country.”“President Muhammadu Buhari has expressed outrage and disgust over what he called the heinous murder of Adamawa politician Ahmed Gulak in Owerri, Imo State by yet-to-be identified gunmen.\n“Reacting to the development on Sunday, the President said: ‘I'm repulsed by such premeditated and gruesome murder of Gulak by evil people who are determined to undermine the peace, unity and territorial integrity of our country.\n“Let me warn however that nobody or group of people who engages in such despicable acts should expect to go free.\nWe will deploy all resources at our disposal to ensure that such callous and criminal elements are brought to justice.’\"Let me warn however that nobody or group of people who engages in such despicable acts should expect to go free."
  },
  {
    "headline": "Naira is in best possible health it can be, says Garba Shehu",
    "summarized_story": "Garba Shehu, presidential spokesperson, says the naira is in the “best possible health it can be, given the circumstances we are in”.\nSpeaking during Sunday Politics, a Channels Television programme, Shehu argued that over the past year, the COVID-19 pandemic has negatively affected the global economy.\nThe presidential spokesperson claimed that only the Nigerian economy is recording “positive growth” in Africa.\nAdvertisementShehu made the comments when he was presented with statistics on how the economy fared in 2015 compared with 2021.\nIn response, he said the minister of finance is in the best position to comment on the economy."
  },
  {
    "headline": "Naira is in best possible health it can be, says Garba Shehu",
    "summarized_story": "Garba Shehu, presidential spokesperson, says the naira is in the “best possible health it can be, given the circumstances we are in”.\nSpeaking during Sunday Politics, a Channels Television programme, Shehu argued that over the past year, the COVID-19 pandemic has negatively affected the global economy.\nThe presidential spokesperson claimed that only the Nigerian economy is recording “positive growth” in Africa.\nAdvertisementShehu made the comments when he was presented with statistics on how the economy fared in 2015 compared with 2021.\nIn response, he said the minister of finance is in the best position to comment on the economy."
  },
  {
    "headline": "Niger abduction: Bandits release 11 children 'who were too small to walk'",
    "summarized_story": "Eleven of the children abducted from Salihu Tanko Islamic School in Rafi LGA of Niger state have been released.\nAdvertisementBandits had invaded the school located at Tegina on Sunday and shot one person dead and left one seriously injured.\nMary Noel-Berje, chief press secretary to the Niger state governor, said the bandits released the children “who were too small and couldn’t walk”.\nAdvertisementNoel-Berje said the gunmen came with about 70 motorcycles and attacked 17 communities in Rafi, Wushishi, and Lavun LGAs of the state.\nAdvertisementNoel-Berje said Sani Bello, Niger governor, is outraged at the “escalating level of banditry” in the state and has reiterated his call on the federal government to promptly intervene."
  },
  {
    "headline": "Niger abduction: Bandits release 11 children 'who were too small to walk'",
    "summarized_story": "Eleven of the children abducted from Salihu Tanko Islamic School in Rafi LGA of Niger state have been released.\nAdvertisementBandits had invaded the school located at Tegina on Sunday and shot one person dead and left one seriously injured.\nMary Noel-Berje, chief press secretary to the Niger state governor, said the bandits released the children “who were too small and couldn’t walk”.\nAdvertisementNoel-Berje said the gunmen came with about 70 motorcycles and attacked 17 communities in Rafi, Wushishi, and Lavun LGAs of the state.\nAdvertisementNoel-Berje said Sani Bello, Niger governor, is outraged at the “escalating level of banditry” in the state and has reiterated his call on the federal government to promptly intervene."
  },
  {
    "headline": "Akeredolu: Gulak's murder an attempt to instigate north against south-east",
    "summarized_story": "Rotimi Akeredolu, Ondo state governor, says the murder of Ahmed Gulak, a chieftain of the All Progressives Congress (APC) is an attempt to create discord between northerners and south-easterners.\nAdvertisementThe former aide of ex-president Goodluck Jonathan was shot dead on Sunday while on his way to the airport in Owerri, Imo state capital.\nIn a statement, the Ondo state governor described his killing as “one murder too many”.\nAdvertisementHe called on the south-east governors “to brace up and confront the current security challenges” in the region.\nAdvertisement“We want to use this medium to express our solidarity with our brother Governor of Imo State, Hope Uzodinma."
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Cameroon cannot request for Nigeria’s territories – Boundary Commission – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The National Boundary Commission (NBC) says the rumour trending that the Republic of Cameroon is demanding for more territories from Nigeria in Adamawa and Borno parts of the country is not true.\nThe Director-General of the commission, Mr Adamu Adaji, made this known when he features the News Agency of Nigeria (NAN) forum in Abuja.\n“So, it is not true that Republic of Cameroon is asking for more communities or territories from Nigeria.\nI think the appropriate thing to do is to contact the commission to get appropriate records and information,” Adaji said.\nThe NBC boss reiterated that there was no such request from the Cameroonian government, adding that they could not request such from Nigeria."
  },
  {
    "headline": "Gulak left hotel without security escort in Imo – Police – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOwerri – The Police in Imo said that Mr Ahmed Gulak an All Progressives Congress (APC) chieftain killed in the state on Sunday by unidentified gunmen left his hotel without security escort.\nThe Commissioner of Police in Imo, Abutu Yaro made the disclosure in a statement issued in Owerri on Sunday by the command’s spokesperson, SP Bala Alkana.\n“On the 30/5/2021, at about 07:20hrs, armed bandits intercepted and attacked a Toyota Camry cab carrying Ahmed Gulak and two others who were on their way to Sam Mbakwe Airport to catch a flight.\n“Ahmed Gulak left his room at Protea Hotel without informing the Police nor sister agencies in view of the fragile security situation in the South East and Imo in particular.\nNAN reports the development has caused serious panic in Imo with some churches hurriedly dismissing members from sunday services."
  },
  {
    "headline": "Children’s Day Celebration: the SUBEB Example …Over 7 million books distributed since 2018. – Nigerian Observer",
    "summarized_story": "A day was set aside to celebrate children, and that day is “CHILDREN’S DAY”.\nEven though Children’s Day is celebrated globally by most of the countries in the world on June 1st, Universal Children’s Day takes place annually on November 20th.\nIn a message to celebrate Edo children, Governor Godwin Obaseki assured that his administration will sustain ongoing reforms to strengthen public institutions to guarantee a sustainable future for Edo children.\nShe explained that the COVID 19 pandemic led to SUBEB taking it a step further by organising “micro children’s day” celebration across the 18 LGA.\nHe emphasized that the collaboration between SUBEB and Edo State Government has improved the education system in Edo State."
  },
  {
    "headline": "EIRS takes tax compliance campaign to Igbinedion Varsity, Teaching Hospital – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPoised to encourage dutiful taxpayers, the Edo State Internal Revenue Service (EIRS), has hailed Igbinedion University, Okada (IUO) for being tax compliant.\nDr. Nosa Edogiawerie, the Bursar of the institution, expressed appreciation to EIRS and encouraged the continuation of the compliance exercise to ease tax administration in the state.\nHe affirmed that non-payment of tax would dent the image of the hospital and possibly attract a riot act from the government.\nDirector of Administration, Igbinedion University Teaching Hospital, Michael Strauss, stated that taxes must be paid by responsible employees to the government, which depends on tax revenue to engender development.\nHe stated that if taxes are not paid to government, one could get punished as obtainable in advanced countries."
  },
  {
    "headline": "Gulak: Police blame IPOB, say killers neutralised",
    "summarized_story": "The police in Imo State have said that the killers of Ahmed Gulak, a chieftain of the All Progressives Congress (APC) and a former political adviser to President Goodluck Jonathan, are members of the secessionist group, IPOB, and its security arm, ESN.\nMr Gulak was shot dead in Owerri, Imo State, Sunday morning, while on his way to Sam Mbakwe Airport for his flight, according to an earlier statement from the police.\n“The assailants were identified as members of the proscribed IPOB and ESN,” the police spokesperson in Imo, Bala Elkana, said in the statement.\nThree out of the four vehicles used in attacking Gulak were recovered.\nThe Commissioner of Police Imo State, CP Abutu Yaro, commended the gallant effort of the team and admonished them to continue to protect the public space."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "BREAKING: Ahmed Gulak’s assailants killed by police in gun duel",
    "summarized_story": "OBINNA EZUGWUThe Imo State Police command says it has killed gunmen suspected of murdering All Progressive Congress (APC) chieftain, Ahmed Gulak earlier on Sunday.\nAbutu Yaro, the state commissioner of police announced that the command’s Tactical Units, Intelligence Response Team, and Police Mobile Force killed the suspected assailants in a gun duel on Sunday evening.\nGulak was on Monday morning killed in Imo State while on his way to Sam Mbakwe International Cargo Airport, Owerri.\nThe statement also disclosed that the vehicles the slain hoodlums used in killing the former Presidential aide were recovered by the command.\n“The assailants were said to have used a Toyota Camry 2005 model with silver color; Toyota Sienna 1998 Model with golden color; Toyota Hilux with white color; and a Lexus RX 330 with golden Color."
  },
  {
    "headline": "Gulak killed by hired assassins for political reasons – Ekenulo",
    "summarized_story": "Activist, politician and acclaimed whistle-blower, Ebubeagu Ekenulo, has alleged that Ahmed Gulak, a chieftain of the All Progressive Congress (APC) was killed by hired assassins for political reasons not far from the outcome of the ruling party’s governorship primaries in Imo State in 2019.\n“Without mincing words Ahmed Gulak was assassinated by hired assassins for political reasons not far from the outcome of 2019 APC Governorship primaries,” he said.\n“We question why Ahmed Gulak was not quartered at the Presidential lodge with high level of privacy and better security architecture.\n“We call upon His Excellency Gov Uzodimma to ensure that the perpetrators and sponsors of this gruesome murder of Ahmed Gulak don’t go Scot free.\n“There is nothing like unknown gunmen in this case and or for any one to want to link this gruesome murder of Ahmed Gulak by bitter politicians to IPOB/ESN."
  },
  {
    "headline": "Bandits kidnap 200 Islamiyya Students in Niger",
    "summarized_story": "Bandits have abducted about 200 students of Islamiyya school, Tegina in Rafi Local Government Area of Niger State.\nThe development is the latest in series of kidnap of students by bandits in the Northern part of the country, and is coming hours after 14 of the remaining abducted students of Greenfield University were freed on Saturday after spending 40 days in captivity.\nThe gunmen were said to have stormed the community around 4:30pm on Sunday shooting sporadically into the air.\nConfirming the story, a resident of the area Zayyad Mohammed , the Salihu Tanko Islamiyya school where the incident took place, was built by a retired Immigration Officer.\nOther sources according to Channels, said , the Islamiyya school is not the usual Sangaya boarding Islamic school, but a conventional one where parents send their children on a daily basis for the purpose of acquiring Islamic education"
  },
  {
    "headline": "BREAKING: Herdsmen kill 30 in Ebonyi communities",
    "summarized_story": "Gunmen suspected to be herdsmen on Sunday killed about 30 in communities in Ebonyi State.\nThe gunmen attacked Odoke, Ndiobasi and Obakotara communities in Ebonyi local government area, the Nation reported.\nThe communities share boundary with Ado local government area in Benue State.\nAn attack on an Izzi village inside Benue State, allegedly by herdsmen, resulted in many casualties.\n“Yes, the communities are Izzi(a clan in Ebonyi) speaking communities but they are geographically located in Benue."
  },
  {
    "headline": "2023: Kano PDP Backs Calls For Bala Muhammad Presidency",
    "summarized_story": "Kano State chapter of People’s Democratic Party (PDP) has declared support for the calls on Bauchi State governor, Senator Bala Abdulkadir Mohammed, to join the 2023 presidential race on the platform of the party.\nDeclaring the Kano PDP support for the Bauchi governor, Lamido said the ruling All Progressives Congress (APC) has failed Nigeria and Nigerians, stating that it was only the PDP that can rescue the country from collapse.\n“If the PDP decides to give the presidential ticket to the North-East, Senator Bala Abdulkadir Mohammed will be the right choice.\nSpeaking earlier, BAM-V director-general, Mohammed Abubakar Jibo, informed that the group was at the Kano PDP secretariat to canvass support of critical stakeholders for Governor Mohammed to contest the 2023 presidential election.\nGwarzo based his assertion on what he termed the unassailable track records of Governor Mohammed as a senator, minister and a sitting governor as well as his commitment to nation-building."
  },
  {
    "headline": "2023: Kano PDP Backs Calls For Bala Muhammad Presidency",
    "summarized_story": "Kano State chapter of People’s Democratic Party (PDP) has declared support for the calls on Bauchi State governor, Senator Bala Abdulkadir Mohammed, to join the 2023 presidential race on the platform of the party.\nDeclaring the Kano PDP support for the Bauchi governor, Lamido said the ruling All Progressives Congress (APC) has failed Nigeria and Nigerians, stating that it was only the PDP that can rescue the country from collapse.\n“If the PDP decides to give the presidential ticket to the North-East, Senator Bala Abdulkadir Mohammed will be the right choice.\nSpeaking earlier, BAM-V director-general, Mohammed Abubakar Jibo, informed that the group was at the Kano PDP secretariat to canvass support of critical stakeholders for Governor Mohammed to contest the 2023 presidential election.\nGwarzo based his assertion on what he termed the unassailable track records of Governor Mohammed as a senator, minister and a sitting governor as well as his commitment to nation-building."
  },
  {
    "headline": "Controversy Trails Ownership Of NNPC Retail Outlets",
    "summarized_story": "According to a source, these individuals may be masterminds of the NNPC retail outlets that are scattered in some parts of Lagos and Ogun states.\nBetween Oju Ore in Ota to Winners Chapel, all in Ogun State, there are almost eight of these petrol stations, why?\nSome of the retired NNPC officials own almost 70 per cent of these petrol stations,’’ the source claimed.\nWho is responsible to oversee the retail outlets?\nLEADERSHIP reports that the NNPC Retail Limited is a fully-owned subsidiary of the NNPC that operates in the downstream sector of the Nigerian oil and gas industry."
  },
  {
    "headline": "Controversy Trails Ownership Of NNPC Retail Outlets",
    "summarized_story": "According to a source, these individuals may be masterminds of the NNPC retail outlets that are scattered in some parts of Lagos and Ogun states.\nBetween Oju Ore in Ota to Winners Chapel, all in Ogun State, there are almost eight of these petrol stations, why?\nSome of the retired NNPC officials own almost 70 per cent of these petrol stations,’’ the source claimed.\nWho is responsible to oversee the retail outlets?\nLEADERSHIP reports that the NNPC Retail Limited is a fully-owned subsidiary of the NNPC that operates in the downstream sector of the Nigerian oil and gas industry."
  },
  {
    "headline": "Entrepreneurs Should Leverage New Emerging Consumer Trends – Expert",
    "summarized_story": "An expert, Smart Emmanuel, has said entrepreneurs should leverage new emerging consumers trends, adding that his focus was to widen the scope to research the latest business trends which through his former company Cacaphony Solutions, had enabled him to coach over 1000 entrepreneurs within and across Africa.\nHe hinted that entrepreneurs focus on products they assume consumers need and not products the consumers really wanted, noting that this had enabled him within the last 10 years to help entrepreneurs create fast selling products and brands.\nResearch shows that four out of five new businesses fail, we exist to reverse this ugly trend and help businesses thrive.\n“It’s quite easy if you create products and services that customers need and price them correctly and consistent sales are guaranteed,” Emmanuel said.\nHe noted that by simply leveraging on data, he changed the fortune of his clients’ businesses and put them miles ahead of their competitors."
  },
  {
    "headline": "“Nigeria will not depart, Tinubu will succeed Buhari in 2023”- Nigerian cleric prophesy",
    "summarized_story": "Bishop Ayodeji Ipinmoroti, the General Overseer of Christ Revelation Church of God (Holy Promise), says former Lagos Governor Bola Tinubu will be president in 2023.\nThe cleric said God showed him that the All Progressives Congress (APC) national leader will succeed President Muhammadu Buhari.\nIpinmoroti spoke at a sermon to commemorate the Children National, The Nation reports.\nNoting that Tinubu will emerge victoriously, he predicted many of the politician’s associates would betray him before the elections.\nBola Tinubu is a right peg in the right hole in the 2023 presidential election.”Ipinmoroti described the APC stalwart as a man of integrity with administrative experience and political wherewithal."
  },
  {
    "headline": "Bobrisky has been having cheap surgeries in Lagos not abroad as he claims",
    "summarized_story": "A popular anonymous blog on Instagram has alleged that celebrity crossdresser Bobrisky did not leave the country as claimed for surgery.\nBob who had relayed the information that he’s traveling out of the country for an alleged surgery to get his dream banging body has been dragged for lying.\nREAD ALSO: Lucifer is more potent than the name, Jesus – Daddy FreezeGistbloggers took to their platform to announce that Bob is in Nigeria and his skin has deteriorated.\nAlthough the doctors are asking him to postpone the surgery for two months because of the level of skin damage, Bob has refused."
  },
  {
    "headline": "Lucifer is more potent than the name, Jesus – Daddy Freeze",
    "summarized_story": "Media personality, Daddy Freeze is here once again with another controversial piece of information as he speaks on the potency of the name of Jesus.\nDaddy Freeze is always saying one or the other but this time he has dropped a bomb.\nHe stated that there is more potency in the name of Lucifer compared to the name of Jesus.\nStating that the name Jesus us a name given by the colonial master as so it has no potent power.\nTaking to the gram, he wrote; I declare to you today that praying in the name or title ‘Lucifer’ is more potent than praying in the name your colonial masters gave your savior."
  },
  {
    "headline": "Misconduct: Uni Abuja expels 46 students — Daily Times Nigeria",
    "summarized_story": "Doosuur Iwambe, AbujaAt least 46 students of the University of Abuja have been expelled by the Senate over their involvement in various acts of misconduct in breach of their sworn matriculation oath.\nIt disclosed further that the expelled students cut across several departments.\nWhile 15 of the students were in their 400 level; 20 were in 300 level; eight, 200 level; and three, 100 level.\nThe affected students have been directed to handover any University property in their possession, including identity card, to their heads of department and unit.\nThe University authority wishes to restate its unwavering determination to protect its values, and strongly warns students to respect and uphold their matriculation oath as they would be held accountable whenever they breach it."
  },
  {
    "headline": "THE BUHARI ADMINISTRATION AT 6: COUNTING THE BLESSINGS ONE BY ONE",
    "summarized_story": "THE BUHARI ADMINISTRATION AT 6: COUNTING THE BLESSINGS ONE BY ONEThe Muhammadu Buhari administration clocks six years May 29, 2021.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "THE BUHARI ADMINISTRATION AT 6: COUNTING THE BLESSINGS ONE BY ONE",
    "summarized_story": "THE BUHARI ADMINISTRATION AT 6: COUNTING THE BLESSINGS ONE BY ONEThe Muhammadu Buhari administration clocks six years May 29, 2021.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Insecurity: Reps suspend zonal constitutional review hearing in Imo",
    "summarized_story": "The House of Representatives Special Committee on Constitution Review Zonal Public Hearing scheduled to take place in Owerri, Imo State, has been suspended till further notice.\nThe hearing at the Owerri Centre, which was supposed to host Imo and Abia States, was scheduled for Tuesday, 1st and Wednesday, 2nd June, 2021.\nA statement by the Deputy Speaker and Chairman, House Special Committee on Constitution Review, Ahmed Idris Wase, on Sunday announced the suspension.\nAlthough no reason was given for the suspension, it was gathered it may not be unconnected with the issue of insecurity.\n“The Committee regrets any inconveniences this might cause our esteemed invited guests, stakeholders and the general public,” Wase said."
  },
  {
    "headline": "Insecurity: Reps suspend zonal constitutional review hearing in Imo",
    "summarized_story": "The House of Representatives Special Committee on Constitution Review Zonal Public Hearing scheduled to take place in Owerri, Imo State, has been suspended till further notice.\nThe hearing at the Owerri Centre, which was supposed to host Imo and Abia States, was scheduled for Tuesday, 1st and Wednesday, 2nd June, 2021.\nA statement by the Deputy Speaker and Chairman, House Special Committee on Constitution Review, Ahmed Idris Wase, on Sunday announced the suspension.\nAlthough no reason was given for the suspension, it was gathered it may not be unconnected with the issue of insecurity.\n“The Committee regrets any inconveniences this might cause our esteemed invited guests, stakeholders and the general public,” Wase said."
  },
  {
    "headline": "JUST IN: Police shoot 10 killers of Gulak dead in gun-battle",
    "summarized_story": "By Kazeem UgbodagaThe Imo State Police Command late Sunday said it has shot 10 members of the gang who killed a former presidential aide, Ahmed Gulak, dead during gun-battle.\nHe said the police special forces were deployed to the scene at Obiangwu Junction at Ngorokpala LGA of Imo state.\n“The assailants were said to have used a Toyota Camry 2005 model with silver color; Toyota Sienna 1998 Model with golden color; Toyota Hilux with white color; and a Lexus RX 330 with golden Color.\nThree out of the four vehicles used in attacking Gulak were recovered.\n“During the encounter, two of the police armored personnel carriers (APC) were riddled with bullets but survived the gun battle."
  },
  {
    "headline": "Bizman Maduabuchi Owuamanam murdered in Ibadan",
    "summarized_story": "By Suleiman Shehu/IbadanThe Police Command in Oyo State on Sunday confirmed the killing by gunmen of a 51-year-old Ibadan businessman, Maduabuchi Owuamanam.\nOwuamanam was murdered on Saturday at a relaxation spot at Oremeji Mokola area of Ibadan.\nThe Command’s Public Relations Officer (PPRO), DSP Adewale Osifeso, confirmed the incident in a statement made available to newsmen in Ibadan.\nOsifeso said that investigation commenced immediately to unravel the circumstances surrounding the gruesome murder of Owuamanam.\n“The deceased was allegedly attacked and eventually murdered by unknown assailants around a relaxation spot at Oremeji Mokola area of Ibadan."
  },
  {
    "headline": "Tompolo to Buhari: Set up NDDC board or get rage of Niger Delta",
    "summarized_story": "By AbankulaFormer Niger Delta warlord, Government Ekpemupolo a.k.a Tompolo, has given President Buhari a seven-day ultimatum to set up the substantive board of the Niger Delta Development Commission(NDDC).\nHe is about to be awakened to the rage of the Niger Delta region”, he said.\nThe continuous running of the Niger Delta Development Commission (NDDC) by a sole administrator at the instance of the minister of Niger Delta Affairs Senator Akpabio, is undemocratic and anti-development, hence unacceptable to the people of the region.\nNo one can tell the amount of money that has been spent by Senator Akpabio in pursuing this divisive agenda.\nHe is about to be awakened to the rage of the Niger Delta region."
  },
  {
    "headline": "JUST IN: One Killed, 200 Islamiyya Students Kidnapped In Niger",
    "summarized_story": "At least 200 students of an Islamiyya school located at Tegina in Rafi Local Government Area of Niger State have been abducted.\nDetails of the attack are sketchy, but Mohammed says the Salihu Tanko Islamiyya school where the incident took place, was built by a retired Immigration Officer.\nAccording to him, this Islamiyya school is not the usual Sangaya boarding Islamic citadel, but a conventional one where parents send their children on a daily basis for the purpose of acquiring Islamic education.\nHowever, the Secretary to the Niger State Government, Ahmed Matane says the number of the abducted students is yet to be ascertained.\nAccording to him, “Yes, there was an attack at the Islamiyya school, but we do not yet have the exact number of students that were abducted."
  },
  {
    "headline": "JUST IN: Buhari Accuses Obasanjo Of Plotting His Ouster",
    "summarized_story": "The Buhari Media Organisation (BMO) has accused former President Olusegun Obasanjo of plotting President Muhammadu Buhari’s demise.\nAlthough the organisation avoided making a pointed reference to Obasanjo, it was unmistakable it had Obasanjo in mind.\nObasanjo, one of the two civilian presidents alive, is the only one capable of assembling ’eminent persons’ to proclaim on the Buhari presidency.\nIn 2018, Obasanjo, a Buhari critic had tried to cobble a political front to defeat Buhari’s re-election.\nIn a statement signed by its Chairman Niyi Akinsiju and Secretary Cassidy Madueke, the pro-Buhari group lampooned the conspirators for their recourse to unconstitutional means to force the resignation of President Buhari, describing the move as reckless and anti-Nigeria."
  },
  {
    "headline": "BREAKING: Gunmen Set Ablaze Newly Built INEC Office In Imo",
    "summarized_story": "At Okwudor community in Njaba local government area of Imo, a newly constructed office of the Independent National Electoral Commission was set ablaze.\nThe arson attack, according to INEC, occurred around 11:30 a.m. on Sunday.\nThe burnt office was commissioned shortly before the 2019 General Elections, according to reports.\nMore details later…"
  },
  {
    "headline": "Breaking: ECOWAS slams suspension on Mali",
    "summarized_story": "West African leaders, meeting in a regional summit Sunday, suspended Mali from the Economic Community of West African States bodies after a second coup by the Malian military.\n“The suspension from ECOWAS takes immediate effect until the deadline of the end of February 2022 when they are supposed to hand over to a democratically elected government,” Ghana’s Foreign Minister Shirley Ayorkor Botchwey told reporters.\n“One of the decisions of the heads of state is that they should ensure that in the next few days a civilian prime minister is put in place to form the next government,” she added.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Breaking: Another INEC office set ablaze",
    "summarized_story": "The Independent National Electoral Commission (INEC) has stated that its office in Njaba Local Government Area of Imo state was set ablaze on Sunday May 30, 2021.\nIt is also the 8th INEC office to be attacked in Imo State since the 2019 General Election.\n“The total number of INEC offices attacked nationwide since 2019 has now risen to 42.\n“INEC buildings, infrastructure and equipment are critical national assets that guarantee the continuity of electoral activities throughout the federation.\n“Attacking these offices is not in the national interest and has the capacity of compromising electoral activities and the credibility of the democratic process.”Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "How Ahmed Gulak was ambushed, killed, Police opens up",
    "summarized_story": "The Imo state police command has revealed how former presidential aide to Goodluck Jonathan, Ahmadu Ali Gulak, was murdered by unknown gunmen.\nIn a statement issued by the Police Public Relations Officer, Sp Bala Elkana Sunday, reads; “On the 30/5/2021, at about 07:20hrs, armed bandits intercepted and attacked a Toyota Camry cab carrying Ahmed Gulak and two others who were on their way to Sam Mbakwe Airport to catch a flight.\n“Ahmed Gulak left his room at Protea Hotel without informing the Police nor sister agencies in view of the fragile security situation in the South East and Imo in particular.\nHe left without any security escorts and while the cab driver took irregular route to the airport, six armed bandits who rode in a Toyota Sienna intercepted, identified and shot at Ahmed Gulak at around Umueze Obiangwu in Ngor-Okpala Local Government Area close to the Airport.\nHe led the committee that conducted the governorship primary election which produced Governor Hope Uzodinma as APC gubernatorial candidate in 2019."
  },
  {
    "headline": "Arewa youths gives Uzodima 2 weeks to produce killers of Gulak or be declared persona non grata",
    "summarized_story": "“The Imo State Governor must bring the killers of Ahmad Gulak to Justice or we declare him non grata in the entire Northern soil.\n“The government of Imo state must give an account of those who killed Gulak.\n“Let us state categorically that the Northern youths will do everything within their power to force the government of Imo state to bring the perpetrators of this crime to justice.\n“The Imo governor and other Southeast governors should take note that we shall no longer accept the continued killing of Northerners in their region.\n“Therefore, the governor of Imo has two weeks to investigate this killing, or we shall declare him persona non grata across the entire Northern soil,” End"
  },
  {
    "headline": "NYSC remains a pivot of national unity – Sarkin Hausawa Nyanya, Abuja – NigPilot",
    "summarized_story": "National Youth Service Corps, NYSC, has been commended for sustaining national unity and purposeful development in Nigeria.\nDala, who praised the gallantry and sacrifice of our heroes past, further cautioned that there is no alternative capable of replacing the NYSC Scheme.\nHe called on all patriotic and well-meaning Nigerians to join forces together towards ensuring that the Scheme is reformed and supported to effectively address contemporary developmental challenges.\nHe stressed that we do not have any other country besides Nigeria, charging everyone to uphold it.\nThe Sarkin Hausawan also reminded Nigerians that nobody outside Nigeria will be responsible for addressing our national challenges, other than Nigerians."
  },
  {
    "headline": "NAF to take delivery of six A-29 Super Tucano in July – NigPilot",
    "summarized_story": "Director of Public Relations and InformationNigerian Air Force, Air Commodore Edward Gabkwet made this disclosure in a statement in Abuja.\nSpecifically, members of the joint committee are in the USA to assess the status and progress of work on the NAF A-29 Super Tucano aircraft.\nOn arrival at EDSI on 27 May 2021, the NASS team led by Senator Michael Nnachi, was briefed on the progress of work on the NAF A-29 Super Tucano programme and the scheduled date of delivery.\nSenator Michael Nnachi commended EDSI for the quality of work on the NAF A-29 Super Tucano.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Aliyu laments the effect of COVID-19 on children – NigPilot",
    "summarized_story": "Federal Capital Territory Minister of State, Dr. Ramatu Tijjani Aliyu, has stated that the costs of the COVID-19 pandemic for children are immediate but warned that if unaddressed, it may last a lifetime.\nAliyu noted that the Children’s Day celebration offers an inspirational entry-point to advocate, promote and celebrate children’s rights, translating into dialogues and actions that would build a better world for the children, she, however, regretted that the COVID-19 crisis has resulted in a child rights crisis.\nWhile commending the theme: “Effect of COVID-19 pandemic on the total well-being of Nigerian Child: The way forward”, she however noted that the COVID-19 has affected lives and homes in so many ways; some children have lost their parents, just as the nation’s economy has been drastically affected.\nSecretary FCT Social Development Secretariat, Dr. Kelvin Ike, commended the FCT Minister of State for reviving the FCT Children’s Day celebration despite the challenges.\nOther activities according to him include FCT Children’s parliament election, inauguration and summit, essay writing and poem recitation competitions among selected Primary, Junior and Senior Secondary school levels and cultural dance competition."
  },
  {
    "headline": "At Least 200 Islamiyya Students Kidnapped In Niger",
    "summarized_story": "At least 200 students of an Islamiyya school located at Tegina in Rafi Local Government Area of Niger State have been abducted.\nMohammed said the Salihu Tanko Islamiyya school where the incident took place, was built by a retired Immigration Officer.\nDSP Abiodun said operatives are yet to ascertain how many children were abducted from the Salihu Tanko Islamic school.\nThe police spokesman called for calm, saying that the force in conjunction with other security agencies will do everything possible to ensure that the children are rescued unhurt.\nHe said though the simultaneous attacks were overwhelming for security agencies at the time, the government in collaboration with the security agencies has mobilized troops to the various locations, including local vigilantes."
  },
  {
    "headline": "Army Vows To Crush Boko Haram, IPOB",
    "summarized_story": "﻿The Nigerian Army has reiterated its commitment to crushing Boko Haram terrorists, members of the banned Indigenous Peoples of Biafra (IPOB), and ending all forms of criminality in the country.\nNigeria’s Chief of Army Staff (COAS) Major General Farouk Yahaya stated this on Saturday during the passing out parade of the 80 regular recruits intake at the Nigerian Army Depot, Zaria in Kaduna State.\n“Nigeria is facing numerous security challenges occasioned by the activities of Boko Haram terrorist group, armed bandits kidnappers, IPOB and other criminal elements.\nREAD ALSO: Seven IPOB Members Killed In Rivers – Army SpokespersonOn Saturday, the Nigerian Army had raided a Boko Haram logistics base in Guibja, Yobe State.\nA Nigerian court has outlawed IPOB and the Federal Government has designated the group as terrorists."
  },
  {
    "headline": "Gunmen Kill Jonathan’s Former Aide, Gulak",
    "summarized_story": "Gunmen have killed a chieftain of the All Progressives Congress (APC) Ahmed Gulak around Umueze Obiangwu in Ngor-Okpala Local Government Area close to the Sam Mbakwe Airport road in Owerri, Imo State.\nSources told Channels Television that Gulak who was a former aide to ex-President Goodluck Jonathan was heading to the airport on Sunday when the assailants attacked him and shot him on the spot.\nGulak was trailed from his hotel room to the spot where he was killed.\n“Ahmed Gulak left his room at Protea Hotel without informing the Police nor sister agencies in view of the fragile security situation in the South East and Imo in particular.\nIn April 2014, Gulak was sacked as Jonathan’s special adviser on political matters but the former Nigerian leader did not give any reason for his dismissal."
  },
  {
    "headline": "Gunmen Set Fire To Newly Completed INEC Office In Imo",
    "summarized_story": "Gunmen set ablaze the newly completed office of the Independent National Electoral Commission (INEC) located at Okwudor community in Njaba local government area of Imo.\nAccording to INEC National Commissioner & Chairman, Information and Voter Education Committee, Festus Okoye, the office which was built and commissioned shortly before the 2019 General Elections, was burnt to a considerable degree.\nThe attack is coming exactly a week after the INEC office in Ahiazu Mbaise Local Government Area of the State was vandalized.\nIt is also the 8th INEC office to be attacked in Imo State since the 2019 General Election.\nThe total number of INEC offices attacked nationwide since 2019 has now risen to 42."
  },
  {
    "headline": "Police Kill Murderers Of Ahmed Gulak, Recover Ammunition And Vehicles",
    "summarized_story": "The Imo State Police Command has neutralised the killers of a chieftain of the All Progressives Congress (APC), Ahmed Gulak, and recovered ammunition and vehicles from them.\n“The assailants were said to have used a Toyota Camry 2005 model with silver color; Toyota Sienna 1998 Model with golden color; Toyota Hilux with white color; and a Lexus RX 330 with golden Color.\n“Having established the identity of the assailants and the description of the vehicles used in carrying out the attack, the teams further got details of the direction the hoodlums have taken.\n“Three out of the four vehicles used in attacking Gulak were recovered.”Gulak was killed around Umueze Obiangwu in Ngor-Okpala Local Government Area close to the Sam Mbakwe Airport road in Owerri, Imo State on Sunday morning.\nGulak was trailed from his hotel room to the spot where he was killed."
  },
  {
    "headline": "FCT Primaries: Governor Yahaya Bello heads 7-member APC reconciliation panel",
    "summarized_story": "Following the processes of nomination of the All Progressives Congress (APC) candidates for the forthcoming Federal Capital Territory (FCT) Area Council Elections, the National Chairman of the APC Caretaker/Extraordinary Convention Planning Committee (CECPC), Governor Mai Mala Buni has approved the Constitution of a Reconciliation Committee.\nThe full composition of the Committee is as follows:1.\nH.E, GOVERNOR YAHAYA BELLO – CHAIRMAN2.\nH.E, GOVERNOR ABDULLAH SULE-MEMBER3.\nSENATOR AHMED YUSUF YUSUF – MEMBER4."
  },
  {
    "headline": "Buhari expresses outrage, disgust over gruesome murder of Ahmed Gulak",
    "summarized_story": "President Muhammadu Buhari has expressed outrage and disgust over what he called “the heinous murder of Adamawa politician Ahmed Gulak in Owerri, Imo State by yet to be identified gunmen.”Reacting to the development on Sunday, the President said: “I’m repulsed by such premeditated and gruesome murder of Gulak by evil people who are determined to undermine the peace, unity and territorial integrity of our country.\n“Let me warn however that nobody or group of people who engages in such despicable acts should expect to go free.\nWe will deploy all resources at our disposal to ensure that such callous and criminal elements are brought to justice.”President Buhari expressed his “deep condolences to the family of the deceased, the people and government of Adamawa State as well as his friends and associates all over the country."
  },
  {
    "headline": "ECOWAS Suspends Mali Until Return to Civil Rule",
    "summarized_story": "Mali has been suspended from the West African regional bloc, Economic Community of West Africa States (ECOWAS), until the current military dictators vacate office and return the country to civil rule.\nGhana’s Foreign Affairs minister, Shirley Ayorko Botchwey told journalists that the Mali junta’s non-adherence to the mediatory role of ECOWAS necessitated the decision of ECOWAS leaders.\nECOWAS envoy, former Nigerian president, Goodlluck Jonathan had briefed the meeting behind closed-doors of his mediatory trips to Mali last week.\nThe Heads of State subsequently demanded the immediate release of the former President and Prime Minister of the Transition who are kept under house arrest.\nThey decided to suspend Mali from ECOWAS institutions in line with ECOWAS provisions; and called for a new civilian Prime Minister to be nominated immediately."
  },
  {
    "headline": "Bandits Abduct ‘About 200’ School children in Nigeria’s North-central Niger State",
    "summarized_story": "Reports suggest no less than 200 children have been allegedly abducted by bandits during an attack on Salihu Tanko Islamic School in Rafi Local Government Area of Niger state in northcentral Nigeria.\nIt’s believed that the bandits had invaded the school on Sunday in their numbers on motorcycles and started shooting sporadically into the air.\nSpokesman of the Niger State Police command, Wasiu Abiodun, confirmed the attack and added that tactical teams have been mobilised to the location to rescue the victims.\n“However, the Command has immediately mobilized all tactical teams including operation puff 2 to the location for rescue of the victims.\n“The Command also calls for calm as the Police and other security agencies shall do everything humanly possible to ensure that the children are rescued unhurt.”Several school children of the Government Science College (GSC) Kagara had been abducted in Niger state in a previous attack this year."
  },
  {
    "headline": "Nigeria: Ahmed Gulak, Ex-political Adviser to Jonathan Shot Dead in Imo",
    "summarized_story": "A former political adviser to ex-Nigeria President Goodluck Jonathan, Ahmed Gulak, has been killed by unknown gunmen in Imo State.\nMr Gulak was shot dead on his way to the Sam Mbakwe International Cargo airport in Owerri, the Imo state capital.\nBarr Gulak was said to have been killed last night by unknown gunmen in Owerri, IMO State,” he said.\n“May Allah (SWT) forgive his sins, bless his soul and reward his good deeds with Aljannah on the Day of Resurrection.\nMay Allah (SWT) also give all his children, relatives, friends and loved ones, the fortitude to bear the irreparable loss."
  },
  {
    "headline": "Nigeria: Another Electoral Office Set Ablaze in Southeast Imo, Eighth Since 2019 Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) says another of its office in Nigeria’s southeastern state of Imo was set ablaze by hoodlums.\nThe commission said although no life was lost the building located in Njaba Local Government Area of the state was substantially burnt down, along with electoral materials, office equipment and furniture.\nThe attack is coming exactly a week after another INEC’s office in Ahiazu Mbaise Local Government Area was vandalized and makes it the eighth office of the commission to be attacked in Imo State since the 2019 General Election.\nHe said “INEC buildings, infrastructure and equipment are critical national assets that guarantee the continuity of electoral activities throughout the federation.\n“Although no life was lost, the building was substantially burnt down, along with electoral materials, office equipment and furniture."
  },
  {
    "headline": "Nigeria: Regional Groups Ask Buhari to Declare National Emergency on Security Now, Southern",
    "summarized_story": "Leaders of the Southern and Middle Belt Forums in Nigeria are demanding the federal government declares a national emergency on security noting that the 2023 general elections could be jeopardized if the security situation is not dealt with and banditry reduced to the barest minimum.\nThe leaders of the socio-political groups stated this at the end of an expanded meeting on Sunday in the Nigerian capital, Abuja.\nIn a communique issued shortly after the meeting, the leaders called on the country’s two main political parties, the governing All Progressives Congress (APC) and the opposition People’s Democratic Party (PDP) as well as other political parties to zone the Presidency, in 2023 to the South; at the next election.\nIn attendance were Elder statesman, Edwin Clark, who chaired the meeting, Ayo Adebanjo who leads the Southwest group Afenifere; George Obiozor – President General, Ohanaeze Ndigbo Worldwide for the Southeast, Pogu Bitrus – National President, Middle Belt Forum andSenator Emmanuel Essien, National Chairman PANDEF for the South-south region.\nBy Abel Ejikeme"
  }
]