[
  {
    "headline": "Lagos moves to ensure safety compliance in hotels",
    "summarized_story": "ThE Lagos State Government has said it will intervene in the hospitality industry to ensure hotels in the state comply with safety practices.\nThe Director-General, Lagos State Safety Commission, Mr Lanre Mojola, said this on Thursday during a stakeholders’ forum on hotel safety, on Victorial Island.\n“As safety professionals our eyes are meant to be trained to identify and manage these hazards.\n“Accidents commonly associated with hotels include musculoskeletal disorders, food poisoning, drowning, electrocution and fire incidents.\nThis is why there needs to be audit and inspection carried out on hotels in the state, particularly as Lagos has the highest number of hotels,” Iden said."
  },
  {
    "headline": "LASG to build monument in memory of ex-gov Jakande",
    "summarized_story": "The Lagos State Government has said it would immortalise the first civilian Governor of Lagos, late Alhaji Lateef Jakande, by building a monument to keep his memory alive.\nJakande died on February 11, 2021,The Permanent Secretary, Ministry of Tourism, Arts and Culture, Adenike Adedoyin-Ajayi, said this in a statement on Wednesday.\nAdedoyin-Ajayi was quoted to have said this during a visit to the Jakande family to seek their buy-in ahead of the commencement of the initiative.\nShe said, “We are here to formally inform the family that Governor Babajide Sanwo-Olu has approved the erection of a monument of Baba Jakande to immortalise him and to keep his memory alive for everyone, including those yet unborn, so that they recognise and appreciate Baba for his landmark achievements in Lagos State.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "$119m Power Plant dispute: Court adjourns case till Jan",
    "summarized_story": "By Ikechukwu NnochiriHearing in the dispute between Rivers state government, SAIPEM SPA and six others, over alleged $119million power plant fraud, has been adjourned till January 11, 2022.\nJustice Okogbue Gbasam of the Rivers State High Court deferred hearing on the matter following the absence of some of the Defendants in court.\nWhile Chief Godwin Obla, SAN, represented the Rivers State Government, Mr Odein Ajumogobia, SAN and Patrick Osu, appeared for the 1st and 2nd Defendants (SAIPEM SPA & SAIPEM Contracting Nigeria Ltd) respectively.\nThe 3rd -7th Defendants were not represented though the court noted that they were duly served with the hearing notice.\nThe court held that since the matter was criminal in nature, all the Defendants must be in court for the proceeding to go on."
  },
  {
    "headline": "W/Bank approves $700m credit for Nigeria’s agro-climate project",
    "summarized_story": "World BankBy Emma Ujah, Abuja Bureau ChiefThe World Bank has approved a $700 million credit from the International Development Association (IDA) for the Nigeria Agro-Climatic Resilience in Semi-Arid Landscapes (ACReSAL) Project.\nAccording to the bank, the project would increase the implementation of sustainable landscape management practices in northern Nigeria and strengthen the country’s long-term enabling environment for integrated climate-resilient landscape management.\nThe bank said that the productivity of major crops in Nigeria has been steadily declining over the past two decades, in part due to climate change.\nREAD ALSOReps ask MDCN to stop outrageous charges imposed on graduatesIt added that persistent water shortages, especially in the extreme north, continue to exacerbate land degradation, desertification, and habitat loss.\n“This scenario not only threatens food security, livelihoods, and productivity, but also exacerbates fragility and increases the risk of violence."
  },
  {
    "headline": "Lack of public trust major challenge in COVID-19 vaccination – Sultan",
    "summarized_story": "The Sultan of Sokoto, Alhaji Sa’ad Abubakar III, on Thursday said that lack of public trust remained a major challenge to the effective COVID-19 vaccination exercise in the country.\nAbubakar stated this at the 2021 4th quarter review meeting of Northern Traditional Leaders Committee on Primary Health Care Delivery (NTLC) in Abuja.\nThe News Agency of Nigeria (NAN) reports that the 4th quarter review meeting resolved to set up mass vaccination sites in palaces, to promote public confidence in the vaccines and increase uptake.\nThe merting provides engagement opportunities and interaction with traditional leaders on their role and responsibility towards increasing COVID-19 vaccination uptake as well as improving PHC delivery.\nOther highlight of the meeting centred on discussions around the current COVID-19 Mass Vaccination Campaign, Polio Outbreak Response and Non-Polio."
  },
  {
    "headline": "Reps want multiple checkpoints removed on South East Roads",
    "summarized_story": "The House of Representatives has urged security agencies to remove multiple checkpoints on highways leading to the South East, ahead of the yuletide.\nThis followed the adoption of a motion by Rep. Obinnna Chidoka (Anambra-PDP) at plenary on Thursday in Abuja.\nMoving the motion, Chidoka said that security checkpoints on the Lagos-Onitsha Road were up to 60, causing untold hardship to motorists.\n“These multiple checkpoints, couple with the terrible condition of the roads cause unnecessary traffic buildup on the roads with untold hardship to users,” he said.\nThe House thereafter, directed that the checkpoints be removed forthwith to facilitate free flow of traffic to and from the South East."
  },
  {
    "headline": "Yuletide: Chinese community in Nigeria supports low income earners with cash, gift items",
    "summarized_story": "The Chinese Community in Nigeria in collaboration of all Chinese companies in Lagos, has supported low income earners and physical challenged Nigerians with cash and various gifts ahead of the Christmas celebration to cushion the effects of the coronavirus pandemic.\nThe event tagged, Sharing love without Borders, is aimed at supporting 50 families from all walks of life with N100,000 cash and gift items like 1 kva generators, face masks, lamps, toiletries and food items.\n“This has been our regular ways of appreciating the communities and further strengthen the good relationship between the People’s Republic of China and the Federal Republic of Nigeria.”The Chinese Community listed the names of the organisation that donated towards the programme is as followed: Jinfeng Hotel, The China-Africa Mazu Cultural Exchange Association, Nigerian Express Non-Express Gift, United Pharmaceutical Group, The Nigerian China Business Enterprise Association, Century Industry, Shuangfeng Tire International Company, AS Trading Company, Dabu Mechanical and Electrical Ltd, Tower of Heaven Sky, Seven-star paper factory, Xinyuan Global Import and Export Trading Ltd, Future Star SocksFolletel Shoes, Hasue industry ltd, Zhu Yinjie, Zheng Yuefeng, Zhou Restaurant, Cai Rui,’Hunan Aiwei Imp & Exp Trading Co Ltd, Speedaf Express, Foshan Aster Energy Equipment Co Ltd’.\nAmong the dignitaries at the event were, Hon.\nEnitan Dolapo-Badru, member of the House of Representatives; Chief Matthew Uwaekwe, coordinator, Nigeria-China Business Council, Chioma Ajunwa, Nigeria’s first Olympic gold medalist, and a host of other dignitaries from China and Nigeria."
  },
  {
    "headline": "Oyo lawmakers pass 3 bills into laws",
    "summarized_story": "Members of Oyo State House of Assembly have passed no fewer than three bills into law.\nDAILY POST reports that the three bills were passed by the lawmakers during their plenary on Thursday.\nThe bills that sailed through third reading and were finally passed into laws were Sexual and Gender-Based Violence Response Team and Referral Centre Bill, 2020, Hotel Occupancy and Restaurant Consumption Tax Bill, 2021 and Oyo State Audit Commission (Amendment) Bill, 2021.\nThe three bills were passed following the presentations of reports of the committees that considered them.\nSpeaker of the Assembly, Adebo Ogundoyin, in his own contribution, said the three bills that have become laws had joined the list of bills passed by the 9th Oyo Assembly."
  },
  {
    "headline": "Reps ask FG to remove redundant planes at airports",
    "summarized_story": "The House of Representatives has urged the federal government to remove all abandoned airplanes at the airports.\nThe green chamber mandated the Nigerian Civil Aviation Authority (NCAA) and the Federal Airports Authority of Niger (FAAN) to ensure the clearance of the planes.\nSpeaking on the abandoned crafts, he said the planes are a visible eyesore that should be removed.\n“The non-functional airplanes visible even from the runway demonstrates a low capacity in maintenance and recycling culture in the country,” he said.\nAnd the committee is to report back within three (3) weeks for further legislative action"
  },
  {
    "headline": "Insecurity: Ishaku warns traditional rulers as terrorists move to take over Taraba",
    "summarized_story": "Governor Darius Dickson Ishaku of Taraba State, on Thursday, warned traditional rulers in the state against accommodating strangers in their domains.\nThe warning, he said became necessary following an alleged plan by terrorists to take advantage of the state by establishing their camps in some local government councils of the state.\nThe governor, who handed down the warning while signing the 2022 appropriation bill into law, said his administration would no longer condone any traditional rulers who harbour unknown visitors in their domains.\nThe monarchs as directed by him, must work tirelessly round the clock to frustrate terrorists from using their domains as camps to launch attacks on the state.\nStressing how traditional rulers are supposed to “report any suspicious movements in their domains”, the reverse as expressed by him, has been the case."
  },
  {
    "headline": "NYSC: Corps members to repeat service year in Lagos",
    "summarized_story": "Five corps members have been found wanting by the National Youth Service Corps (NYSC) in Lagos State in the course of the service year and are to repeat the programme.\nMr. Eddy Megwa, Coordinator, NYSC Lagos, made this known on Thursday in Lagos at the passing out of 1,188 corps members of the 2020 Batch B, Stream 2 deployed to the state.\nMegwa, however, congratulated the outgoing corps members on successful completion of their service year and urged the corps members to make the best use of skill acquisition they acquired to make wealth and be employers of labour.\nOnce we notice that a corps member is not available consecutively for three months, we declare he/she absconded and the punishment is a repeat of the service year.\n“I am proud of other corps members, having selflessly committed and contributed to the socio-economic development of the local government areas, state and the nation at large."
  },
  {
    "headline": "Trade fair: Emir of Kano, others applaud NCC’s consumer initiatives",
    "summarized_story": "The Emir of Kano, Aminu Ado Bayero, influential individuals, who visited the Nigerian Communications Commission (NCC) pavilion as well as telecom consumers, who participated at the ‘NCC Special Day’ at the recently-concluded 42nd edition of the Kano International Trade Fair, 2021 in Kano State, have commended the Commission for its various consumer-centric initiatives.\nAnother eminent visitor to the Commission’s pavilion on the exhibition ground at the trade fair was the Karaje in Kano State, Ibrahim Abubakar II.\nIn the same vein, the NCC’s Director, Consumer Affairs Bureau, Efosa Idehen, in his address, took a great deal of time enlightening the consumers on various consumer-centric initiatives put in place by the Commission to protect consumer rights.\nThe initiatives explained in great detail include the NCC’s various channels of lodging complaints, the NCC toll-free Number 622, the Do-Not-Disturb (DND) shortcode 2442, the NCC’s Emergency Number 112, among several other consumer-focused programmes.\nIn his remarks, KACCIMA President, Dalhatu Abubakar, applauded NCC for prioritising consumer protection in all that it does."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Oyinlola: I’ve details of how Akande financed his reelection",
    "summarized_story": "A former Governor of Osun State, Prince Olagunsoye Oyinlola, has alleged that Chief Bisi Akande financed his 2003 re-election by collecting part payment from the contractor building the governor’s office.\nHe said: “On the Osun State Governor’s Office (Bola Ige House contract), Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“But the project consultant shocked everyone with his claim that part of the payment was taken back to finance the 2003 re-election bid of Chief Akande.\nOne of Akande’s appointees confessed collecting money from this contractor for Akande’s re-election.\n“I consulted Chief Akande on this."
  },
  {
    "headline": "‘My father rebelled against my grandfather to embrace Islam’",
    "summarized_story": "Former All Progressives Congress (APC) National Chairman Chief Bisi Akande has said his father, Lawani Bamgbose Akande, rebelled against his grandfather to embrace Islam.\nAkande, in his book, ‘My Participations’, said his grandfather was a Sango devotee.\nAccording to him, his father at some point decided to join a radical Islamic group known as Kewulere.\n“My father joined a group of radical youths known as Kewulere (Islamic prayers have rewards).\nHe was devoted to Sango while his son, my father, Lawani Bamgbose Akande, embraced the new religion of Islam."
  },
  {
    "headline": "Lawan, Gbajabiamila, governors, others salute Buhari at 79",
    "summarized_story": "By Bolaji Ogundele, Tony Akowe, Sanni Onogu and Frank Ikpefan, AbujaSenate President Ahmad Lawan, House of Representatives Speaker Femi Gbajabiamila and Deputy Speaker Ahmed Idris Wase yesterday felicitated President Muhammadu Buhari on today’s celebration of his 79th birthday.\nAlso, Governors Babajide Sanwo-Olu (Lagos), Adegboyega Oyetola (Osun) as well as Labour and Employment Minister Chris Ngige saluted the President on the celebration.\nPresident, Nigeria and Nigerians are proud of you.\nThe event, with the theme: Enhanced Partnership for Common Development and Prosperity, is being hosted by Turkish President Recep Tayyip Erdogan.\nThe third Turkey-Africa Partnership Summit is coming on the heels of President Erdogan’s recent state visit to Nigeria."
  },
  {
    "headline": "Omicron: UK lifts restriction on visitor visa application",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom (UK), has lifted pause on processing of visitor visa application.\n“UK Visas and Immigration (UKVI) will lift the pause on processing visitor visas in all countries previously on the red list.\n“Due to extremely high global demand, standard UK visitor visas are currently taking significantly longer than usual to be processed.\nUKVI are working hard to process visitor visa applications as soon as possible and sincerely apologise to all our customers affected.\n“If you have already submitted your visitor visa application, and you need to urgently travel to the UK for compassionate reasons, you can contact UK Visas and Immigration for help."
  },
  {
    "headline": "BREAKING: Anxiety as abducted Imo monarch, youth leader found dead",
    "summarized_story": "From Stanley Uzoaru, OwerriPalpable fear has gripped Ihite Ihube autonomous community in Okigwe Local Government Area of Imo state as their traditional ruler, Eze Paul Ogbu, and youth leader of the community who were abducted on Sunday were found dead on Wednesday.\nThe source disclosed that another traditional ruler, Acho Ndukwe abducted same day with the late monarch broke the news to the community.\nThe source said ” Eze Paul Ogbu and the youth leader have been found dead.\nEze Acho Ndukwe, revealed that the criminals killed Eze Paul Ogbu in his presence.\nSecurity operatives went back to the criminals camp with the indigenes and the corpse of the traditional ruler was identified lying in a ditch."
  },
  {
    "headline": "Army Chief upholds logistics as game changer in war against insurgency",
    "summarized_story": "BY PHILIP NWOSU AND VIVIAN ONYEBUKWAThe Nigerian Army said logistics planning and deployment could influence the outcome of the war against insurgents in the North Eastern part of the country.\nHe spoke at the graduation of officers of the Logistics Management Course 19 of the college, saying that the establishment of Nigerian Army College of Logistics (NACOL) was a vital part of the force’s strategy towards strengthening its capacity in the deployment of logistics in military operations.\nThe COAS stated this at the first combined graduation ceremony of Logistics Management Courses 19 and 20 of 2021, which took place at the Nigerian Army College of Logistics, Ojo, Lagos.\nThe Commandant, Nigeria Army College of Logistics, Ojo, Major General Obiora Enendu, described the event as historic and expressed no doubt that the graduating students are well equipped to return back to their various institutions.\nThe Nigerian Army College of Logistics Magazine was equally launched at the event."
  },
  {
    "headline": "Breaking: Glamour as APC chairmanship aspirants clash in Abuja",
    "summarized_story": "The Adetokumbo Ademola Crescent, Wuse 11, FCT Abuja, venue of the public annual lecture, involving the entire All Progressives Congress (APC) National Chairmanship aspirants, was full of glitz and glamour in the early hours of Thursday.\nSupporters of the aspirants numbering hundreds converged at the entrance of the Rockview Hotel, grounding vehicular and human movement with their drumming and dancing.\nWielding posters of the various aspirants with various inscriptions projecting them, the supporters had a fun-filled day.\nThe annual lecture was organised by the APC Press Corps which had the topic: “APC beyond 2023-the tasks ahead: The role of stakeholders, was used as an intellectual ground for the aspirants for the position of the chairmanship of the party."
  },
  {
    "headline": "Don’t set Nigeria on fire, FG warns Obasanjo, critics",
    "summarized_story": "On Monday, Obasanjo, at a retreat on inclusive security in Abuja, organised by the Global Peace Foundation and Vision Africa, said: “President Buhari has done his best.\nMohammed, said: “The polity has recently been awash with heightened commentary on the security situation in the country.\n“President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country.\nPresident Buhari continues to do much more to keep Nigerians safe.\nPresident Buhari is leaving a legacy of security, infrastructural development, economic prosperity and social cohesion for Nigeria."
  },
  {
    "headline": "NJC Slams Promotion Ban on Three Judges for Issuing Conflicting Exparte Orders",
    "summarized_story": "Specifically, the affected judges will not get “promotion to higher Bench for a period ranging from two to five years whenever they are due”.\nThe affected judges are Justice Okogbule Gbasam of the High Court of Rivers State; Justice Nusirat I. Umar of the High Court of Kebbi State and Justice Edem Kooffreh of the High Court of Cross River State.\n“His Lordship is also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\nHe is also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\n“He is also to receive warning letter to be circumspect in granting such Exparte Orders in the future."
  },
  {
    "headline": "Adebanjo Fights Back, Debunks Akande’s Claim Tinubu Built Lekki House for Him",
    "summarized_story": "Akande had in his book titled ‘My Participation’ launched last Thursday, claimed that Adebanjo brought pressure on Tinubu to build the Lekki home for him.\n“The house was commissioned in 1972 by Chief Obafemi Awolowo.\n“It was later occupied by one of the wives Chief Pius Akinyelure, who often visit his wife there in company of Senator Bola Tinubu.\n“I then took a loan from GTBank to complete the house in Lekki where I am living now*.\n“The contractor who built my Lekki house is Engr."
  },
  {
    "headline": "To Boost Morale, FG Increases Police Salary By 20% Effective January 2022",
    "summarized_story": "Dingyadi said FEC also approved a review and upgrading of the take home pay of police personnel in Nigeria.\nThis will come out to about ten billion and thirty million naira with effect from 2022.\nMost importantly, government also approved payment of about 20 per cent of CONPOST, it is peculiar allowances to boost morale, and take home pay of the Nigeria Police.\n“This 20 per cent is percentage of the total salary, known as peculiar allowance.\nAhmed assured that the police salary increase would come into effect once the supplementary budget was approved by the legislative arm."
  },
  {
    "headline": "Electoral Bill: Three Days to Go, Buhari Keeps Nigerians in Suspense",
    "summarized_story": "Timothy Golu, has expressed optimism that Buhari would sign the bill eventually.\nBut the presidency and the National Assembly had quickly come out to dismiss it as untrue.\n“I mean, it belies logic that the president would write to the National Assembly after they had proceeded on recess.\n“I don’t think the president will be ready to be embarrassed by the National Assembly at that level.\nThose who do not want it know, those who didn’t want it know what they did to get to the National Assembly,” Golu further stated."
  },
  {
    "headline": "Otedola: I Have No Interest in Holding Any Board Position in FBN Holdings, First Bank",
    "summarized_story": "Dike OnwuamaezeThe Chairman of Geregu Energy Group and billionaire businessman, Mr. Femi Otedola has debunked speculations that he is interested in holding any board position in FBN Holdings, First Bank or any of their subsidiaries.\nIn a brief chat with THISDAY at the ExecuJet Private terminal in Lagos yesterday, Otedola was asked about his next steps after becoming the single largest shareholder of FBNHoldings.\nHe smiled and said he did not acquire the bank’s shares because he wanted to be chairman of the bank.\nMy interest, contrary to speculations is not to become chairman of the bank or its holding company (Holdco).\nOtedola praised the financial institution, saying “being the single largest shareholder doesn’t mean I must necessarily hold a position in the bank."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Ogun Visit As President Falls Sick En Route To Turkey",
    "summarized_story": "President Muhammadu Buhari has cancelled his visit to Abeokuta, Ogun State earlier scheduled for next week.\nThe Ogun State Government also confirmed the planned visit in a short statement on Thursday.\nSee Also Exclusive EXCLUSIVE: Junketing President Buhari Plans Local Trip To Ogun After Return From Turkey“His Excellency, President Muhammadu Buhari, GCFR will be visiting Ogun State for the commissioning of some of the legacy projects of our dear Governor, Prince Dapo Abiodun, MFR.\nAccording to the source, Buhari fell sick on his way to Turkey.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Ogun Visit As President Falls Sick En Route To Turkey",
    "summarized_story": "President Muhammadu Buhari has cancelled his visit to Abeokuta, Ogun State earlier scheduled for next week.\nThe Ogun State Government also confirmed the planned visit in a short statement on Thursday.\nSee Also Exclusive EXCLUSIVE: Junketing President Buhari Plans Local Trip To Ogun After Return From Turkey“His Excellency, President Muhammadu Buhari, GCFR will be visiting Ogun State for the commissioning of some of the legacy projects of our dear Governor, Prince Dapo Abiodun, MFR.\nAccording to the source, Buhari fell sick on his way to Turkey.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE."
  },
  {
    "headline": "Boko Haram Terrorists Dare Buhari Government, Mount ‘Security’ Checkpoints On Borno Highways",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have mounted roadblocks in some parts of Borno State.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nSince the death of JAS leader, Abubakar Shekau, the group has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Boko Haram Terrorists Dare Buhari Government, Mount ‘Security’ Checkpoints On Borno Highways",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have mounted roadblocks in some parts of Borno State.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nSince the death of JAS leader, Abubakar Shekau, the group has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Boko Haram Terrorists Dare Buhari Government, Mount ‘Security’ Checkpoints On Borno Highways",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād have mounted roadblocks in some parts of Borno State.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nSince the death of JAS leader, Abubakar Shekau, the group has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Withdraw your book and apologise for dishonouring Yoruba elders, Bode George tells Akande",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), has asked Bisi Akande, a former governor of Osun state, to withdraw his recently released autobiography, ‘My Participations’.\nGeorge, in a statement on Thursday, described the book as “shameful” and said the author needs to apologise to Yoruba elders.\nAdvertisement“Akande must apologise openly to Yoruba elders.\nIs it his legacy to dishonour Yoruba elders?” the statement reads.\nHe has maligned Yoruba elders and highly respectable people in the country."
  },
  {
    "headline": "Withdraw your book and apologise for dishonouring Yoruba elders, Bode George tells Akande",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), has asked Bisi Akande, a former governor of Osun state, to withdraw his recently released autobiography, ‘My Participations’.\nGeorge, in a statement on Thursday, described the book as “shameful” and said the author needs to apologise to Yoruba elders.\nAdvertisement“Akande must apologise openly to Yoruba elders.\nIs it his legacy to dishonour Yoruba elders?” the statement reads.\nHe has maligned Yoruba elders and highly respectable people in the country."
  },
  {
    "headline": "Oyinlola: Akande lied... his appointee confessed that state funds were used for 2003 campaign",
    "summarized_story": "Olagunsoye Oyinlola, a former governor of Osun, says one of the appointees of Bisi Akande, his predecessor, confessed that state funds were used for the latter’s 2003 governorship election campaign.\nHe, however, lost the 2003 governorship election to Oyinlola, who contested on the platform of the Peoples Democratic Party (PDP).\n“That was what ended the case of my alleged stealing in Osun State.\nNo one ever wrote any petition against me to the EFCC, ICPC or the police for any fraud or wrongdoing during my term of office,” Akande wrote.\n“Chief Akande said the 2003 governorship election in Osun State was rigged in my favour."
  },
  {
    "headline": "Oyinlola: Akande lied... his appointee confessed that state funds were used for 2003 campaign",
    "summarized_story": "Olagunsoye Oyinlola, a former governor of Osun, says one of the appointees of Bisi Akande, his predecessor, confessed that state funds were used for the latter’s 2003 governorship election campaign.\nHe, however, lost the 2003 governorship election to Oyinlola, who contested on the platform of the Peoples Democratic Party (PDP).\n“That was what ended the case of my alleged stealing in Osun State.\nNo one ever wrote any petition against me to the EFCC, ICPC or the police for any fraud or wrongdoing during my term of office,” Akande wrote.\n“Chief Akande said the 2003 governorship election in Osun State was rigged in my favour."
  },
  {
    "headline": "NGF: States to clear ALL outstanding pensions after fuel subsidy removal",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) says states will clear all outstanding pension liabilities after the removal of fuel subsidy in 2022.\nThe federal government had said that it would end fuel subsidy by 2022 and replace it with a N5000-a-month transportation grant to the poorest Nigerians.\nIn a communique released after the meeting, Kayode Fayemi, chairman of NGF and governor of Ekiti, said the governors have resolved to include settlement of all outstanding pension obligations as part of the social compact with citizens for the removal of fuel subsidy.\nAdvertisementFayemi further affirmed governors’ support for the federal government’s transport palliative scheme.\nIt said the 36 state governments currently hold 53 percent equity while the FG holds 47 percent equity in the ten power plants."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "The Nigeria Startup Bill has been approved by the FEC",
    "summarized_story": "The Nigeria Startup Bill (NSB) is a step closer to getting enacted into law as it has now been approved by the Federal Executive Council (FEC).\nThe approval was made on December 15, and now, the Presidency will submit the bill to the National Assembly for consideration.\nThere will also be incentives to attract local and foreign investors to the Nigerian startup community.\nThe bill is the result of a collaborative effort between the Presidency, the Federal Ministry of Communications and Digital Economy, the Nigerian Export and Promotion Council and wider government bodies.\nGoogle Nigeria and the UK overnment, through the West Africa Research and Innovation Hub and the UK-Nigeria Tech Hub, are also backing the bill."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Entering the metaverse, Edukoya’s $3.5m pre-seed and a Wowzi funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Entering the metaverseEdukoya’s $3.5m pre-seedWowzi’s fundingEntering the metaverseThe metaverse has been making the headlines in the last few weeks.\nGo deeper: Nestcoin’s new product, Metaverse Magna, wants to help Africans earn by playing games in the metaverseEdukoya’s $3.5m pre-seedAfrican edtech startups seem to be on a roll.\nTo get a glimpse of what it could look like, check out Ogheneruemu’s article: Technology, funding, learning models: What is the next frontier for edtech startups in Africa?\nSource: TechCrunchWowzi, a Kenyan startup that connects social media users to businesses, has bagged $3.2 million in funding.\nPer TechCrunch, the funding combines a $2 million seed round led by 4DX Ventures and a $1.2 million pre-seed round."
  },
  {
    "headline": "Nestcoin’s new product, Metaverse Magna, wants to help Africans earn by playing games in the metaverse",
    "summarized_story": "On November 29, 2021, BusinessToday.in reported that Canadian investment firm, Tokens.com, spent $2.5 million on a virtual land in the metaverse.\nNestcoin’s new product, Metaverse Magna (MVM), is creating a path for Africans that’ll ease them into the metaverse through games.\nBut in the metaverse, gaming is done a bit differently.\nAxie Infinity is, to date, the most established metaverse gaming platform.\nUnlike regular games, Axie Infinity exists on a blockchain which means you buy and sell characters, upgrades, and power-ups with cryptocurrencies."
  },
  {
    "headline": "IP valuation in IP-based financing",
    "summarized_story": "Share this article:Financial institutions use different approaches to IP valuation as part of their financing process.\nBecause the enterprise’s technology is new and unproven, and the enterprise lacks an established market, IP valuation may not work for startups.\nLiens, warrants, and debentures on IP assets, as well as numbers relating to IP capitalized on the balance sheet, may be examined – but only as risk factors, not as part of a formal IP valuation.\nThis reluctance in the IP valuation market may be attributed to information asymmetry, regulatory lapses and market immaturity.\nThere is a clear need to increase market actors’ confidence and certainty in IP valuation methods in order to stimulate IP transactions, support IP-based financing, and provide companies with tools to provide information about their intellectual property."
  },
  {
    "headline": "Nigeria, 73 other countries to benefit from $93bn IDA package – World Bank",
    "summarized_story": "Nigeria is among the 74 countries that would benefit from a $93 billion replenishment package of the World Bank’s International Development Association (IDA) for low-income countries (LIC), a new report by the World Bank indicated.\nDue to the urgent development needs of IDA countries, the World Bank said the replenishment was advanced by one year.\nIDA is one of the largest sources of assistance for the world’s 74 poorest countries, 39 of which are in Africa.\nAbout a third of IDA countries are facing a looming food crisis.\nWhile IDA20 will support countries globally, resources are increasingly benefiting Africa, which will receive about 70 percent of the funding."
  },
  {
    "headline": "Airtel Africa’s mobile money attracts $50m from Abu Dhabi-based Chimera",
    "summarized_story": "Airtel Africa, one of the continent’s leading providers of telecommunications and mobile money services, has announced the introduction of Chimera Investment LLC as an additional investor in Airtel Mobile Commerce BV (‘AMC BV’), through a $50m secondary purchase of shares of AMC BV.\nChimera is an Abu Dhabi-based private investment firm managing a diversified portfolio of listed and unlisted equities on both local and regional markets.\nAMC BV is the holding company for several of Airtel Africa’s mobile money operations and ultimately is intended to own and operate the mobile money businesses across all of Airtel Africa’s fourteen operating countries.\nAccording to BusinessDay estimates, Airtel, Nigeria’s second-largest telco by number of subscribers, could make an additional $405 million a year from mobile money operations in Nigeria, more than the $401 million it made in total mobile money revenues last year.\nHowever, analysts do not expect Airtel Africa to replicate its mobile money success in other markets in Nigeria due to the competition in the already developed financial services industry in Africa’s most populous nation."
  },
  {
    "headline": "Lawyer in Ecobank’s tango with Honeywell, Ogunba got back rank of SAN in 2018",
    "summarized_story": "Kunle Ogunba, counsel to Ecobank in the dispute between it and Honeywell had his rank of senior advocate of Nigeria (SAN) restored in 2018 after a review of his case by the Legal Practitioners Committee which had earlier indicted him for misconduct as reported by BusinessDay on December 20, 2021.\nOn January 11, 2018, the Legal Practitioners Privileges Committee (LPPC) sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of SAN and all other privileges attached to the rank.\nHowever, BusinessDay is now in receipt of a September 20, 2018 letter by the LPPC titled, “Kunle Ogunba SAN: Notice of restoration of the award of the rank of Senior Advocate of Nigeria on your person with all its privileges” and in which the restoration of the rank was conveyed.\nAccording to Hadizatu Uwani Mustapha, chief registrar of the Supreme Court and secretary of the LPPC, “further to your letter of September 11, 2018, in which you presented to the Legal Practitioners’ Privileges Committee attached documents in compliance to the conditions laid down in paragraph 27 of legal practitioners privileges committee guidelines 2018.\nAs set out above, Mr. Ogunba on behalf of Ecobank deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.”"
  },
  {
    "headline": "Counter-Terrorism: NAF ‘wings’ 4 pilots, 12 UAV operators – Nigerian Observer",
    "summarized_story": "“In the area of pilot training, 11 student pilots are currently undergoing training in South Africa, while three are undergoing Alpha Jet conversion in Egypt.\nHe added that 12 student pilots were undergoing Basic Transport Training, 32 undergoing Ab-Initio Flying Training and eight undergoing Instructor Training at 401 Flying Training School, Kaduna.\n“Special arrangements are also currently being made to upgrade UAV training facilities to enhance the operational capacity of UAV operators in anticipation of increased tempo of air operations with the recently acquired UAVs.\n“I most sincerely express profound gratitude and appreciation to CAS, whose leadership has created the enabling environment for timely turn out of pilots and UAV operators in the NAF.\n“To the pilots and UAV operators, tomorrow brings a new journey, but today marks the end of a chapter in your career as you have become qualified pilots and UAV operators.”..."
  },
  {
    "headline": "We Are In The Business Of Driving Human Progress – Chevron – Nigerian Observer",
    "summarized_story": "Represented by the Area Manager, PGPA ,(Field Operations) ,CNL, Mr. Sam Daibo, Brikinn said, Chevron had over the years, worked and demonstrated ethical, environmentally responsible, safe, and respectful business practices.\n“Everywhere we work, we demonstrate ethical, environmentally responsibile safe and respectful business practices.As we would say, we are in the business of driving human progress.\n“Our primary contributions is by safely developing and delivering affordable and reliable energy that is necessary for social and economic progress.\n“It is important to note that community development can only be sustained in atmosphere of peace that is conducive for business activities”, Brikinn said.\nConstruction of Gbokoda community Cottage hospital, Construction of Bateren Community health Center, among others in Education, Health Care, well as Human Capital development."
  },
  {
    "headline": "Obaseki: Only PDP can save Nigeria from current socio-economic woes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has declared that only the Peoples Democratic Party (PDP) can rescue Nigeria and place it on the path of economic prosperity and sustainable development.\nAccording to him, “If Nigeria is going to be salvaged, PDP has to step into the throne to salvage this country politically.\nThe stakes are too high; we cannot allow Nigeria to continue the way it is going.\n“Our great party must come to the rescue and take over the reins of power in this country.\nAddressing members of the delegation, Obaseki stated, “The decision is of the majority of our people, which is the way we will go."
  },
  {
    "headline": "Obaseki inaugurates 12-man road safety advisory council – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has inaugurated a 12-man Edo State Road Safety Advisory Council, charged with the responsibility of coordinating the state’s road safety targets and driving the implementation of the road safety sector strategic plan.\nWhile inaugurating the council, Obaseki said, “The responsibilities of this council is to help coordinate our road safety targets and to drive implementation of the road safety sector strategy plan.\n“We believe that as an advisory council, you are going to help in building the agencies to implement programmes that are in the sector’s strategic plan.\nWe have to enforce road safety regulations.”He continued: “We are going to make sure that the mobile courts work with the designs of our roads so that we can have rest areas.\nGovernor for this opportunity and assure him of our unalloyed commitment to making sure that the purpose for which this advisory council was established is actualized.”..."
  },
  {
    "headline": "Osun 2022: What you need to know about Ademola Adeleke, By Alhaji Kazeem Akinleye",
    "summarized_story": "He is from the Adeleke family of Ede in Osun State.\nOn 23 July 2018, Adeleke emerged as the governorship candidate of PDP in Osun State after defeating Akin Ogunbiyi by seven votes.\nThe testimonial Adeleke submitted to INEC dated 20 July 1988, as its Heading Ede Muslim Grammar School, Osun State, as at that year Osun state was not in existence.\nAdeleke ran for Osun state governorship election under the PDP against top contenders Alhaji Gboyega Oyetola of APC and Iyiola Omisore of SDP on 22 September 2018.\nThe Supreme Court later affirmed Gboyega Oyetola as the authentic winner of the 2018 Osun State governorship election on Friday, July 5, 2019."
  },
  {
    "headline": "Google invests in SafeBoda through its Africa investment fund",
    "summarized_story": "Tech giant, Google, has announced its first investment from its Africa Investment Fund in the Ugandan super app, SafeBoda, which has presence in Nigeria.\nThe Africa Investment Fund is part of a broader plan by Google to support digital transformation in Africa.\nThe investment comes only two months after Alphabet CEO, Sundar Pichai revealed the company’s plans to invest $1 billion in “tech-led initiatives” over the next five years, including a $50 million Africa Investment Fund aimed at early- and growth-stage African startups.\nSafeBoda said the investment from Google’s Africa Investment Fund will help “drive its growth in Uganda and Nigeria, scaling its transportation-led app to offer new payment and financial services solutions for its expanding set of customers: passengers, drivers, and merchants.”Commenting on the investment, Ricky Rapa Thomson co-founder of SafeBoda said, “SafeBoda welcomes Google to their community and is excited to continue to drive innovation in informal transportation and payments in the boda boda (East Africa) or okada (West Africa) industry.\nSafeBoda is thrilled that leading global companies such as Google see the importance of backing startups working towards these goals.”In his remarks, Nitin Gajria, Managing Director for Google in Africa said, “I am thrilled about our first investment from the $50M Africa Investment Fund that we announced two months ago."
  },
  {
    "headline": "U.S. Unveils Platforms for Nigerian Agribusiness to Attend Gulfood Show, Agribusiness Trade Mission in Dubai",
    "summarized_story": "The two agribusiness trade events will provide considerable opportunities to meet U.S. companies.\nThe goal of the Gulfood 2022 Show and the trade mission is to increase two-way trade between the United States and other countries of the world.\n“The Foreign Agricultural Service is ready to welcome Nigeria buyers to this opportunity to interact with high quality U.S. exporters,” Smith said.\nNigerian agribusiness companies interested in attending the Gulfood Show and Agribusiness Trade Mission must register in advance and pay their own way to participate.\nTo register your interest or seek additional information, contact Foreign Agricultural Service of the U.S. Mission in Nigeria at [email protected]."
  },
  {
    "headline": "NUJ inducts Osun Finance Commissioner, Oyebamiji, others into Hall Of Fame",
    "summarized_story": "By Sunday Oguntuyi, OsogboIt was another feather to the cap of Osun Commissioner for Finance, Mr Bola Oyebamiji as he was on Thursday inducted into the Hall of Fame of the Nigeria Union of Journalist (NUJ), Osun Council, in recognition of his meritorious service to society.\nInducted alongside Mr Oyebamiji were: the APC chairman, Prince Gboyega Famodun; Chairman and Chief Executive Officer, Sammya Nigeria LTD, Engineer Adigun Sammy Oreoluwa and the Pioneer Chairman of NUJ in Osun state, late Comrade Lekan Awoyemi.\nSpeaking at the event, Chairman of the occasion, Prince Kayode Adedire described Mr Bola Oyebamiji as a worthy recipient of the honour going by his antecedents in the society, as he has through his selfless service touched many lives positively.\nBola Oyebamiji, I always hear about what he does and how good he has been to people and especially the Osun Council of the NUJ, I am also very impressed with his professionalism in the running of Osun Ministry of Finance.\nResponding shortly after receiving the honour, Osun Commissioner for Finance, Mr Bola Oyebamiji who was represented at the occasion by the Senior Special Assistant to Governor Adegboyega Oyetola on Finance, Dr Wale Tijani said the induction into the NUJ hall of fame is a great honour and a call to do more for the development of the society."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Omicron: UK Removes Nigeria, 10 Others From Travel Red List",
    "summarized_story": "LEADERSHIP had earlier reported that the red list was to be rescinded just two weeks after it was introduced, following intense pressures from Nigerian travelers and the Nigerian government, which threatened retaliation.\nThe red list forced thousands into hotel quarantine at a cost of £2,285 per person for 10 days.\n“On Tuesday 14th December, UK Ministers made the decision – based on scientific and public health data – to remove Nigeria from the UK’s travel red list.\nNow that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron.\nMeanwhile, the United Arab Emirates (UAE) has conceded seven slots to Air Peace to end the diplomatic row with Nigeria."
  },
  {
    "headline": "Omicron: UK Removes Nigeria, 10 Others From Travel Red List",
    "summarized_story": "LEADERSHIP had earlier reported that the red list was to be rescinded just two weeks after it was introduced, following intense pressures from Nigerian travelers and the Nigerian government, which threatened retaliation.\nThe red list forced thousands into hotel quarantine at a cost of £2,285 per person for 10 days.\n“On Tuesday 14th December, UK Ministers made the decision – based on scientific and public health data – to remove Nigeria from the UK’s travel red list.\nNow that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron.\nMeanwhile, the United Arab Emirates (UAE) has conceded seven slots to Air Peace to end the diplomatic row with Nigeria."
  },
  {
    "headline": "PROMOTIONAL: 2021: Against All Odds, CBN Weathers The Storm",
    "summarized_story": "Xola Collective, an independent, not-for-profit, non-partisan think tank based in Abuja, was born in the midst of adversity in Q3, 2021.\nDefending, Growing Nigeria’s EconomyADVERTISEMENTThe far-reaching interventions of the Central Bank of Nigeria (CBN) in various sectors have shielded the nation’s economy from collapse, especially from a deep post-COVID-19 crisis.\nSeries of interventions by the CBN through targeted policy instruments have been the springboard for modest growth recorded in the economy.\nPrior to the outbreak of COVID-19, the CBN, in 2019, began sectoral support across some select commodities with value addition to the economy.\nThe bank designed financial interventions for various sectors."
  },
  {
    "headline": "Reps order checkpoints removal from roads linking South-East to Lagos, Abuja",
    "summarized_story": "The House of Representatives has called on the Nigeria Police Force and other security agencies to remove the multiple checkpoints from the roads linking the South-East geopolitical zone with Lagos and Abuja “forthwith.”At the plenary on Thursday, the House particularly said the removal is to “to facilitate free flow of traffic, relieve the pains and hardship of the motorist and other road users travelling to and from the South-East region, especially during this festive period.”The House also asked the police and other agencies to “immediately disband all checkpoints at the Head Bridge,” while mandating the Federal Road Safety Corps to deploy men and materials to ensure free flow of traffic between Asaba (in Delta State) and Onitsha (in Anambra State).\nThe lawmakers further urged the agencies to collaborate with one another in the discharge of their responsibilities and “avoid dissipation of resources as exemplified by the multiple checkpoints on the roads, especially those leading to and from the South-East region.”In addition, the parliament directed the Federal Ministry of Works and Housing, and the Federal Roads Maintenance Agency to “remove all abandoned makeshift roadblocks used as checkpoints and debris from the roads and highways to facilitate free flow of traffic on these roads.”Furthermore, the House called on the FRSC to position ambulances at major intersections along the roads and highways, especially during this festive season, to provide first aid to accident victims and evacuate them to the hospitals.\nThese resolutions were sequel to the unanimous adoption of a motion moved by the lawmaker representing Idemili-North/Idemili-South Federal Constituency in Anambra at the House, Obinna Chidoka, titled ‘Motion for the Disbandment on Multiple Security Checkpoints on Roads Leading to the South-East Region.’ PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Reps order checkpoints removal from roads linking South-East to Lagos, Abuja",
    "summarized_story": "The House of Representatives has called on the Nigeria Police Force and other security agencies to remove the multiple checkpoints from the roads linking the South-East geopolitical zone with Lagos and Abuja “forthwith.”At the plenary on Thursday, the House particularly said the removal is to “to facilitate free flow of traffic, relieve the pains and hardship of the motorist and other road users travelling to and from the South-East region, especially during this festive period.”The House also asked the police and other agencies to “immediately disband all checkpoints at the Head Bridge,” while mandating the Federal Road Safety Corps to deploy men and materials to ensure free flow of traffic between Asaba (in Delta State) and Onitsha (in Anambra State).\nThe lawmakers further urged the agencies to collaborate with one another in the discharge of their responsibilities and “avoid dissipation of resources as exemplified by the multiple checkpoints on the roads, especially those leading to and from the South-East region.”In addition, the parliament directed the Federal Ministry of Works and Housing, and the Federal Roads Maintenance Agency to “remove all abandoned makeshift roadblocks used as checkpoints and debris from the roads and highways to facilitate free flow of traffic on these roads.”Furthermore, the House called on the FRSC to position ambulances at major intersections along the roads and highways, especially during this festive season, to provide first aid to accident victims and evacuate them to the hospitals.\nThese resolutions were sequel to the unanimous adoption of a motion moved by the lawmaker representing Idemili-North/Idemili-South Federal Constituency in Anambra at the House, Obinna Chidoka, titled ‘Motion for the Disbandment on Multiple Security Checkpoints on Roads Leading to the South-East Region.’ PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Jega warns: Insecurity may prevent 2023 polls from holding",
    "summarized_story": "A former Chairman of the Independent National Electoral Commission, Prof. Attahiru Jega, has warned that unless the insecurity challenges ravaging the country were adequately stopped, the 2023 general election may not hold.\nJega said security was very key to the conduct of any election whose outcome would be acceptable to parties involved.\nAccording to him, insecurity which is ravaging the country poses a serious threat to the 2023 general elections, saying the threats must be effectively tackled to ensure the conduct of the elections.\n“As we look forward to the 2023 general elections, there is increasing apprehension that the pervasive insecurity situation in the country may present a formidable obstacle if not an obstruction to that election.\nHow do we protect the government of the people, by the people for the people?”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Jega warns: Insecurity may prevent 2023 polls from holding",
    "summarized_story": "A former Chairman of the Independent National Electoral Commission, Prof. Attahiru Jega, has warned that unless the insecurity challenges ravaging the country were adequately stopped, the 2023 general election may not hold.\nJega said security was very key to the conduct of any election whose outcome would be acceptable to parties involved.\nAccording to him, insecurity which is ravaging the country poses a serious threat to the 2023 general elections, saying the threats must be effectively tackled to ensure the conduct of the elections.\n“As we look forward to the 2023 general elections, there is increasing apprehension that the pervasive insecurity situation in the country may present a formidable obstacle if not an obstruction to that election.\nHow do we protect the government of the people, by the people for the people?”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Oyinlola fights back: 'Akande lied against me, I'll expose him in my book'",
    "summarized_story": "Former Governor of Osun State, Olagunsoye Oyinlola has rubbished claims by former Interim Chairman, APC, Chief Bisi Akande that he wrongly accused him of corruption.\nHe vowed to expose Akande in his new book which would soon be published.\nThe former military administrator added that he consulted Akande on this and that he denied having any deal with the contractor and the consultant.\n“I have the details of who collected how much in my forthcoming book,” he said.\nHe stated that everything was completed and commissioned within his first year in office, saying that the state had continued to use the structures till date."
  },
  {
    "headline": "Hutchins death: Police get search warrant for Baldwin's phone",
    "summarized_story": "A search warrant has been issued for actor Alec Baldwin’s phone in the investigation of October’s fatal shooting of cinematographer Halyna Hutchins.\nHutchins was shot dead by Baldwin on the New Mexico set of his Western movie “Rust.”Documents filed in a court in Santa Fe, New Mexico showed the police obtained the search warrant Thursday.\nThe Santa Fe County Sheriff’s office believes there are key conversations on Baldwin’s phone related to what led to the prop gun death of Hutchins in October.\nInvestigators previously asked the 63-year-old actor for his phone but he told them they would need to get a warrant, New York Post reported.\nEarlier this month, Baldwin told ABC News’ George Stephanopoulos he “didn’t pull the trigger.”"
  },
  {
    "headline": "Breaking: Popular Balogun Lagos market set ablaze, goods destroyed",
    "summarized_story": "A popular market located in Balogun, Lagos state has been consumed in fire between Wednesday night and Thursday morning.\nWhile the fire raged, goods worth millions of naira were burnt down few days to Christmas, traders who turned out for usual business on Thursday lamented.\nThey said the cause of the fire unknown to many was yet to be ascertained.\nOfficials of Lagos state government are yet to speak on the latest development, Blueprint reports.\nDetails loading…"
  },
  {
    "headline": "Breaking: Farida Abubakar sworn-in as first female NUJ chair in Kaduna (PICTURES)",
    "summarized_story": "History has been recorded in Kaduna Council of the NIgeria Union of Journalists (NUJ) as the first female chairman has been sworn-in.\nThe Credentials Committee Chairman, Evangelist Mordecai Ibrahim, said she emerged unopposed, following the disqualification of her only opponent Asmau Yawo Halilu.\nHe commended the Mordecai Ibrahim-led credentials committee for being thorough and adhering to the NUJ constitution.\nSubsequently, the outgoing chairman handed all documents of the council to new chairman, Farida.\nOutgoing executive present at the swearing-in include, Adamu Yusuf (Chairman), Femi Adi (Secretary) and Mohammed Sabiu (Vice Chairman)."
  },
  {
    "headline": "Buhari providing quality leadership amidst rising insecurity – FG",
    "summarized_story": "Speaking at a media parley Wednesday in Abuja, the minister who acknowledged banditry and kidnapping posed a great challenge in the nation’s fight against insecurity, however, said the Buhari administration was providing quality leadership to halt the menace.\nPresident Buhari has done his best.\n“The President has also continued to work with our neighbouring countries and indeed our Western partners to tackle insecurity, especially terrorism.\n“Gentlemen, President Buhari has done so much, under very difficult economic and social conditions, to tackle insecurity in our country.\nPresident Buhari continues to do much more to keep Nigerians safe."
  },
  {
    "headline": "Lassa Fever: 434 Cases, 80 Deaths Recorded In 2021 – NCDC",
    "summarized_story": "The statistics by the Nigeria Centre for Disease Control (NCDC) have revealed that 434 cases of Lassa fever have been recorded in Nigeria in 2021.\nAccording to NCDC’s recent Lassa Fever situation report, at least 80 persons were confirmed to have died of the disease this year.\nCurrently, seven laboratories have the capacity to test for Lassa fever in Nigeria and this is coordinated by the NCDC National Reference Laboratory (NRL).\nThis is also geared towards the development of vaccine and therapeutics for Lassa fever,” the NCDC report read in part.\nAccording to the report, two persons died from Lassa fever on the 8th of December."
  },
  {
    "headline": "Three Judges Barred From Promotion For Granting Conflicting Orders",
    "summarized_story": "Three Judges of Courts who granted conflicting ex parte orders have been barred from promotion to higher bench for a period ranging from two to five years whenever they are due.\nThe National Judicial Council took the decision following its two days meeting held on December 14 and 15 in Abuja, the nation’s capital.\nIn a statement issued on Thursday, NJC’s Director of Information, Soji Oye, said even though there was no written petition, allegations of corruption or impropriety against the subject judges, the Council nevertheless, initiated investigation.\nJustice Okogbule Gbasam of the High Court of Rivers State was barred from elevation to higher Bench for two years whenever he is due.\nJustice Nusirat I. Umar of the High Court of Kebbi State be barred from elevation to higher Bench for two years whenever due."
  },
  {
    "headline": "Nigeria’s COVID-19 Cases Rise With 1,424 New Infections, Highest In Six Months",
    "summarized_story": "The latest statistics by the Nigeria Centre for Disease Control (NCDC) have revealed that the number of confirmed COVID-19 cases in Nigeria increased to 220,020 with 1,424 additional cases confirmed on Wednesday.\nThe NCDC made this known on its website on Wednesday night, noting that the new infections were recorded from 15 states in the country.\nREAD ALSO: UK Records Highest Ever Daily COVID-19 CasesIn Delta State, 153 cases were recorded from 13th (13), and 14th (139) December 2021 while zero cases were reported from Bauchi, Ekiti, Osun, and Zamfara States.\nThe 1,424 new cases show a surge in the number of cases in the country compared to cases recorded in the past weeks.\nA total of 730 new cases of the virus were recorded on Tuesday while 385 cases were recorded on Monday."
  },
  {
    "headline": "Tambuwal Asks FG To Create Special Forces To Tackle Banditry",
    "summarized_story": "Sokoto State Governor Aminu Tambuwal has urged the Federal Government to consider the option of creating a Special Forces to tackle banditry.\nGovernor Tambuwal said the Special Forces should comprise locals of the affected communities because they have rich knowledge of the areas.\nHave special forces for all these areas and states affected with banditry?\nIn his address, Katsina State Governor Masari expressed his condolences to Sokoto State on the recent attacks by bandits.\nTwenty-three persons were confirmed dead last week, after an attack on travellers in Angwan Bawa, Sabon Birni Local Government Area of Sokoto State."
  },
  {
    "headline": "EPL: Everton Snatch Draw To Frustrate Chelsea’s Title Push",
    "summarized_story": "Chelsea’s Premier League title challenge suffered a major setback as Everton snatched a 1-1 draw just hours after four of the European champions’ stars tested positive for the coronavirus on Thursday.\nThomas Tuchel’s side were without Romelu Lukaku, Timo Werner and Callum Hudson-Odoi after the latest Covid-19 outbreak to rock the Premier League.\nIt was the 19-year-old defender’s first goal for Everton in just his third Premier League start.\nThe 22-year-old’s seventh goal this season was his fourth in his last four Premier League appearances.\nPickford ensured Everton held on as the man of the match made a brilliant stop from Thiago Silva’s header."
  },
  {
    "headline": "Gov Akeredolu visits Olowo over Elewere’s assassination",
    "summarized_story": "Governor of Ondo State, Oluwarotimi Akeredolu, has commiserated with the Olowo of Owo, Oba Ajibade Ogunoye, over the killing of one of his High Chiefs, Chief Elewere Tunde Ilori.\nChief Elewere was killed by unknown gunmen on a farmland on Wednesday evening.\nChief Elewere had a complain about another family in respect of a farmland.\nI raised a team of chiefs to go and do the inspection of the land and their report seemed to favour chief Elewere.\nChief Elewere was very dear to me, very close and very loyal."
  },
  {
    "headline": "Governor Akeredolu makes five fresh appointments",
    "summarized_story": "Ondo state governor, Rotimi Akeredolu has sent five names to the state House of assembly for confirmation as members of the Ondo State House of Assembly Service Commission.\nThey are expected on Monday, 20th December, 2021, at 10.00am, to appear before the Selection Committee of the House for screening.\nThey include Dare Emiola Francis (Chairman), Idowu Adebusuyi (Member), Adeloye Oladejo (Member), Kunle Odidi (Member) and Ola Oguntimehin (Member).\nThe House had earlier been informed of their nominations vide a letter signed by Secretary to the State Government, Princess Catherine Oladunni Odu.\nThe Speaker, David Bamidele Oleyelogun in a statement urged the nominees to forward twenty (20) copies of their curriculum vitae to the House and liaise with the members from their different constituencies ahead of the screening on Monday."
  },
  {
    "headline": "NJC bars three Judges from promotion over conflicting ex-parte orders",
    "summarized_story": "The National Judicial Council has barred the three Judges of Courts of concurrent jurisdiction who granted conflicting Exparte Orders in matters with same parties and subject matter from promotion to higher Bench for a period ranging from two to five years whenever they are due.\nEven though there was no written petition, allegations of corruption or impropriety against the Judges, the NJC initiated investigation pursuant to its inherent disciplinary powers under the Constitution to unravel the circumstances that led to the spate of Exparte Orders granted by these Courts of coordinate jurisdiction.\nHe is also to receive warning letter to be circumspect in granting such Exparte Orders in the future.\nThe Council also placed him on its Watch-List for a period of two years.\nMeanwhile, the Council approved the appointment of 63 Judges for 16 States, 9 of which are Heads of Court."
  },
  {
    "headline": "Nollywood Star, Kabiru Fubara, dies months after surviving cancer -",
    "summarized_story": "Nollywood Star, Karibi Fubura has died months after surviving cancer.\nA family member of Nollywood actor, Karibi Fubara, announced his death nineteen months after he survived surgery on his kidney.\nThe post was met with tributes from several Nollywood actors and actresses including, Rita Dominic, Funke Akindele, Kate Henshaw, Sharon Ooja, among others.\nThe “God calling” actor married popular Nollywood fashion entrepreneur, Yolanda Okereke in 2019.\nUntil his death, Fubara was a Nollywood actor who rose to prominence after starring in Before 30, God Calling, Quam’s Money, Castle and Castle, Royal Hibiscus Hotel, Smart Money Woman, and MMM."
  },
  {
    "headline": "Nigerians React To the Menace Of Cultism – Trending With Ojy Okpe",
    "summarized_story": "Some Northern senators on Wednesday, kicked against a proposed law for women empowerment in Nigeria, saying its contents contradict Islam and northern cultural values.\nThe northern senators said the bill was not properly worded, especially its title that seeks equality rather than equity.\nIn another development, Congolese singer Koffi Olomidé was sentenced to 18 months in jail for kidnapping his dancers.\nThe Versailles Court sentenced the singer on Monday, December 13th, after finding him guilty of holding his former female dancers against their will, an accusation the singer denied.\nKofi Olumide’s judicial record is lengthy and includes a conviction in 2019, for rape of a minor under the age 15."
  },
  {
    "headline": "Millions at Risk as Super Typhoon Rai Slams into Philippines",
    "summarized_story": "The Philippine’s weather bureau, PAGASA, said Typhoon Rai made its first landfall in Surigao del Norte’s Siargao Island at 05:30 GMT.\nThe Joint Typhoon Warning Center (JTWC) of the US Navy has declared Rai as a super typhoon.\n“Filipinos are tough but this Super Typhoon is a bitter blow for millions of people who are still recovering from devastating storms, floods and COVID-19 in the past year,” said Richard Gordon, chairman of the Philippine Red Cross.\nA COVID-19 vaccination drive has also been suspended in some parts of the country due to the typhoon.\nEastern Samar and Leyte provinces were among those hardest hit by the 2013 super typhoon Haiyan, which left thousands dead."
  },
  {
    "headline": "Three Days to Deadline, Buhari Keeps Nigerians in Suspense Over Electoral Bill",
    "summarized_story": "Timothy Golu, has expressed optimism that Buhari would sign the bill eventually.\nBut the presidency and the National Assembly had quickly come out to dismiss it as untrue.\n“I mean, it belies logic that the president would write to the National Assembly after they had proceeded on recess.\n“I don’t think the president will be ready to be embarrassed by the National Assembly at that level.\nThose who do not want it know, those who didn’t want it know what they did to get to the National Assembly,” Golu further stated."
  },
  {
    "headline": "Nigeria Boosts Police Morale with 20% Salary Increase",
    "summarized_story": "In a morale-boosting effort, Nigeria’s Federal Executive Council (FEC) on Wednesday approved a new welfare package, including a 20 per cent increase in allowances, for personnel of the Nigeria Police.\nDingyadi said FEC also approved a review and upgrading of the take home pay of police personnel in Nigeria.\nThis will come out to about ten billion and thirty million naira with effect from 2022.\nMost importantly, government also approved payment of about 20 per cent of CONPOST, it is peculiar allowances to boost morale, and take home pay of the Nigeria Police.\nAhmed assured that the police salary increase would come into effect once the supplementary budget was approved by the legislative arm."
  },
  {
    "headline": "Nigerian Magnate Otedola Says ‘No Interest’ in Holding Any Board Position in FBN Holdings, First Bank",
    "summarized_story": "The Chairman of Geregu Energy Group and billionaire businessman, Mr. Femi Otedola has debunked speculations that he is interested in holding any board position in FBN Holdings, First Bank or any of their subsidiaries.\nIn a brief chat with THISDAY at the ExecuJet Private terminal in Lagos on Wednesday, Otedola was asked about his next steps after becoming the single largest shareholder of FBNHoldings.\nHe smiled and said he did not acquire the bank’s shares because he wanted to be chairman of the bank.\nMy interest, contrary to speculations is not to become chairman of the bank or its holding company (Holdco).\nOtedola praised the financial institution, saying “being the single largest shareholder doesn’t mean I must necessarily hold a position in the bank."
  }
]