[
  {
    "headline": "28 states with storage facilities get vaccine doses",
    "summarized_story": "The Federal Government on Tuesday said it had delivered Moderna vaccine doses to 28 states and the Federal Capital Territory, Abuja.\nIt added that eight states had yet to receive the vaccine because they lacked requisite vaccine storage capacity, especially backup cold chain facilities.\nHe said the second phase of vaccination with AstraZeneca COVID-19 vaccine would formally begin on Wednesday (today) and would end on September 5.\nHe said, “So far, we have deployed Moderna vaccine to 28 states and the FCT.\nIt is pertinent to state that we could not deploy the vaccine immediately after NAFDAC certification because, unlike the AstraZeneca, the Moderna vaccine did not come with complete bar-coding."
  },
  {
    "headline": "PDP splits as two chairmen emerge, Wike, Secondus divide NWC",
    "summarized_story": "“A court has also ordered that from August 23, 2021, Prince Uche Secondus should stop parading himself as the national chairman.\nThe deputy national chairmen shall perform the following functions: 1) assist the national chairman in the discharge of his duty.\n4) In the absence of the national chairman and the deputy national chairman from the region or part of the country where the national chairman originates from, the other deputy national chairman shall act as the national chairman without prejudice to Section 47 (6) of this Constitution.\nIf the national chairman is not available, someone will take over; if the deputy national chairman, South, is not available, the deputy chairman, North, will take charge.\nThe National Chairman, Uche Secondus, is the head of all of us followed by the Deputy National Chairman 1, which I am."
  },
  {
    "headline": "Jos killings: M-Belt Youth tackles Northern groups, says you’re promoting violence",
    "summarized_story": "The Youth Wing of MBF noted that the outburst of CNG through its press conference on the killings was the symbol of appalling bigotry that is slowly eating up the soul of the nation.\n”More worrisome, the deliberate attempt at demonising the Irigwe ethnic nationality as perpetrators of these killings has been orchestrated without any evidence.\n”As youths of the Middle belt region, there seems to be a veil over what truly happened in Jos last Saturday.\n”We are quick to call the attention of the government on the continued killings of university students in Jos.\n”The Middle Belt Youths are aware that there are plots to subjugate our people and enthrone the Fulani as masters over our people."
  },
  {
    "headline": "BREAKING: Major abducted by bandits in NDA is dead",
    "summarized_story": "Viral picture of the Major with his pregnant wifeA major, abducted in the early hours of Tuesday by armed bandits at the Nigerian Defence Academy, NDA, Kaduna has been found dead.\nThe major was kidnapped during a raid at the Nigerian Defence Academy, Kaduna, leaving two persons dead and one kidnapped."
  },
  {
    "headline": "Gov Emmanuel’s infrastructural transformation commendable, outstanding — Atiku",
    "summarized_story": "…says visit aimed at cementing friendship, brotherhoodFormer Nigerian Vice President, Alhaji Atiku Abubakar, has described Governor Udom Emmanuel’s led massive economic development and infrastructural transformation in Akwa Ibom State as commendable and worthy of emulation.\nWe want to commend your brotherly welcome and hospitality extended to us which we acknowledge Akwa Ibom is at the top”, he said.\nAlso speaking, former Governor of Niger State, Babangida Aliyu Muazu, described Governor Emmanuel as a silent achiever.\nAccording to Muazu, “Governor Udom Emmanuel has done so well with little noise in Akwa Ibom State, and has also succeeded in taming those that do not know that their tenure ends in eight years.\nReceiving the guests, Governor Udom Emmanuel welcomed the former Vice President and his entourage to Akwa Ibom State, describing him as a detribalized leader who is committed towards the growth and progress of the nation."
  },
  {
    "headline": "Just in: Multichoice Nigeria loses top executive",
    "summarized_story": "MultiChoice Nigeria has announced the passing of Martin Mabutho, the company’s 47-year-old Chief Customer Officer, who died on Tuesday in Cape Town, South Africa, after a brief illness.\n“Mabutho joined MultiChoice Botswana as a Customer Service Supervisor in 1999, and later became a Brand Manager at MNet in 2003.\n“He led the Marketing and Sales effort for DStv Mobile in Sub-Saharan Africa before his appointment as MultiChoice Nigeria’s General Manager, Sales and Marketing in 2013.\n“In 2018, he was appointed Chief Customer Officer, responsible for driving the MultiChoice Nigeria customer group strategy,” Ugbe said.\nHe further noted that the deceased was able to achieve tremendous success in customer value management, sales, marketing, customer experience and care."
  },
  {
    "headline": "Nigerian Army denies enlisting former terrorists into the Force",
    "summarized_story": "“The Young Elder in a comic way tried to express worries about the surrendered terrorists.\n“The amateurish production conjured some unfounded and baseless claims that only exist in the figment of their imagination, claiming that surrendered terrorists where going to be absorbed into the Nigerian Army (NA).\n“Surrendered terrorists will be received, processed and passed to the appropriate Government agencies that are saddled with the responsibility of handling them.\nIt is most unfair for anyone at that height of the social ladder to sponsor a smear campaign against the Nigerian Army for whatever reason; particularly knowing that he has access to the leadership of the military.\nNigerians, including residents of Abia state are assured of their security as we relentlessly continue to discharge our constitutional responsibilities.”Vanguard News Nigeria"
  },
  {
    "headline": "NIMET warns against impending flood in 32 states",
    "summarized_story": "The Nigeria Meteorological Agency, (NIMET), warned of possible flash floods across 32 states in the next three days.\nA statement released by the agency on Tuesday indicated that the moderate to heavy rainfall which could lead to flash floods are states such as, Sokoto, Zamfara, Katsina, Kaduna, Kano, Jigawa, and Bauchi.\nOther States are Gombe, Yobe, Kebbi, Niger, FCT, Plateau, Adamawa, Taraba, Kwara, Oyo, Lagos, Ondo, and Ogun.\nImpending flood: Gov Buni directs ministries, SEMA to relocate communities to safer groundsStates of Edo, Delta, Bayelsa, Cross River, Akwa Ibom, Benue, Enugu, Ebonyi, Imo, Anambra, Abia and River are also not exemptedConsequently, the Nigeria Meteorological Agency cautioned the public that the slim chances of flash flood could be more pronounced on roads, settlements, farmlands and bridges."
  },
  {
    "headline": "Plateau: Federal lawmaker lauds troops for killing bandits",
    "summarized_story": "The lawmaker representing Jos South Federal Constituency, Hon.\nDachung Musa Bagos, on Tuesday, lauded Operation Safe Haven and the combined team of the Inspector General of police for neutralising 6 kidnappers.\nThe lawmaker in a statement made available to DAILY POST by his Media Aide, Mr Danja Yakubu, described the killing and arrest of 6 kidnappers in Mangu Local Government Council of the state as a good development and a warning to criminal elements that their days were over.\nBagos, who is the Deputy Chairman, Reps Committee on Corruption, said, it took courage and gallantry for the operatives to achieve that feat.\n“Sadly, in the crossfire, we lost two brave men of the Nigeria Police."
  },
  {
    "headline": "Plateau: Security forces kill 6 bandits who murdered Police IRT officers",
    "summarized_story": "The troops of Operation SAFE HAVEN (OPSH) and Police units neutralised the syndicate.\nMajor Ishaku Gaji Takwa, Military Information Officer, in a statement said operation involved the Divisional Police Headquarters at Mangu.\nThe late IRT officers earlier made a distress call that bandits attacked them and took away their guns.\nThe remains of the IRT members and the eliminated gang members were recovered.\nCommander Operation SAFE HAVEN, Major General Ibrahim Ali charged the troops to continue the collaborative efforts and sustain the assaults against criminals in Plateau State."
  },
  {
    "headline": "Gov. Ugwuanyi approves 60 percent CONHESS for health workers",
    "summarized_story": "Ugwuanyi for his benevolence and unflinching commitment to the welfare of health workers in the state.\nUgwuanyi that “we are very grateful to the Almighty God who has chosen you, Your Excellency, to actualize the implementation of Consolidated Health Salary Structure (CONHESS) for the health professionals and workers in Enugu State”.\n“To assuage the situation, Your Excellency (Ugwuanyi) approved 10 percent CONHESS in 2018 and in 2021, you approved additional 31 percent making a total of 41 percent CONHESS.\n“We also appreciate your aggressive investment in the health sector in Enugu State.\nUgwuanyi that the workers of Enugu State visit the Government House without carrying placards in protest, saying that “we are in Government House today to register our appreciation”."
  },
  {
    "headline": "Grazing routes: Igbo youths warn lawamker backing open grazing",
    "summarized_story": "The Igboayaka O. Igboayaka-led Ohanaeze Youth Council (OYC), a socio-cultural group, has warned members of State Houses of Assembly in Igbo land that are plotting and executing the plan of total open grazing law should drop the idea or face the wrath of angry Igbo youths from their various constituents.\nThe warning comes on the heels of the recent directive by the President Muhammadu Buhari-led federal government for the review of 368 grazing reserves in 25 states.\nOYC in a release sent to DAILY POST on Tuesday, called on state lawmakers from the southeast region to urgently pass the anti-open grazing bill into law in Igboland to save lives and property or be recalled.\nThe Igbo organization also urged them to emulate their Rivers State counterparts that have acted on the request of the masses in the state by passing the anti-open grazing bill.\nOYC partly stated, “There will be an All- Igbo Youth Match to the family house of the house of assembly members to demonstrate a civil disobedience from the people."
  },
  {
    "headline": "What to expect from Tokyo 2020 Paralympic Games",
    "summarized_story": "The opening ceremony of Tokyo 2020 Paralympic Games took on Tuesday after a year delay due to COVID-19 that has continued to ravage the world.\nThe Tokyo 2020 Paralympic Games will feature around 4,400 athletes who will compete in 539 medal events.\nBelow are what to lookout for in the 22 featured games at Tokyo 2020 Paralympic Games:• At least 1,756 slots for female athletes, the most ever, which represents a 17 per cent increase in the number of women that took part in London 2012.\n• Badminton and taekwondo: The two sports that will make their Paralympic debut in Tokyo, have been awarded with 14 and 6 medal events respectively.\n• Four sports – canoeing, shooting, table tennis and wheelchair fencing – have more medal events than Rio 2016 while athletics and swimming have fewer events."
  },
  {
    "headline": "Court strikes out DSS’ motion seeking reversal of bail to Igboho’s associates",
    "summarized_story": "Justice Obiora Egwuatu, in a ruling on Tuesday, struck out the motion following an oral application by DSS’ lawyer, Idowu Awo for the withdrawal of the motion filed on August 9.\nAwo said the DSS filed a notice of appeal on August 13 against the court’s earlier ruling, granting bail to the detainees.\nADVERTISEMENTHe said since the DSS decided to go on appeal, there was no need to retain the motion earlier filed.\nLawyer to the detainees, Sunday Adebayo did not object to Awo’s oral application, following which Justice Egwuatu struck out the motion.\nJustice Egwuatu said such complaint was unnecessary, because Adebayo knew what to do if the DSS chose not to accept a release order issued by the court."
  },
  {
    "headline": "UPDATED: Confusion in PDP as two factions lay claim to Secondus’ seat",
    "summarized_story": "There was confusion on Tuesday as the national leadership of the Peoples Democratic Party (PDP) split into two factions.\nDeputy National Chairman (South), Elder Yemi Akinwonmi, leads one faction while the Deputy National Chairman (North), Senator Suleiman Nazif, has taken charge of the other.\nAkinwonmi and Nazif are laying claim to the position of the National Chairman, to fill the leadership gap created by the suspension of the substantive National Chairman, Prince Uche Secondus.\nThe Section states: “In the absence of the National Chairman and the Deputy National Chairman from the region part of the country where the National Chairman originates from, the other Deputy National Chairman shall act as National Chairman without prejudice to 47 (6) of this Constitution”.\nIf the deputy national chairman south is not available, the deputy chairman north will take charge."
  },
  {
    "headline": "Suspected gunmen abduct female KWASU student",
    "summarized_story": "Suspected gunmen have abducted a student of the Kwara State University (KWASU) Malete.\nA university said the kidnappers had contacted the university for a ransom of N50 million.\nReacting to the incident, the university KWASU spokesperson Abdulrazaq Sanni, said the student was abducted along Okoru Road in Malete town.\nADVERTISEMENTAccording to Sanni, the school authorities have swiftly responded to the development and are working with the relevant security operatives to secure her release.\nKwara Command’s spokesperson Ajayi Okasanmi said effort would be exerted to rescue the victims."
  },
  {
    "headline": "Anger, fear as bandits invade NDA, kill 2 officers, abduct Major",
    "summarized_story": "The bandits reportedly entered the NDA premises disguised in military uniforms and passed through the security gate into the academy officers quarters and started shooting sporadically.\nIt is very worrisome that bandits could have the audacity to attack military academy and kill officers.\nThis has never happened in the history of the military that bandits could have the effrontery to attack military academy.\nToday, the factory where all Nigerian military officers are produced has been invaded and desecrated.\nWhat else do we need to show that our national security system is running on reverse gear?"
  },
  {
    "headline": "Confusion in PDP as Akinwonmi, Nazif lay claim to party leadership",
    "summarized_story": "From Ndubuisi Orji, Abujacrisis rocking the Peoples Democratic Party (PDP) assumed a new twist, yesterday, as the Deputy National Chairman ( South), Elder Yemi Akinwonmi and the Deputy National Chairman (North), Suleiman Nazif, laid claim to the leadership of the opposition party.\nA Degema High Court, in Rivers State, had on Monday, restrained the PDP National Chairman, Uche Secondus, from parading himself as national chairman, pending determination of the substantive suit.\nNazif explained that Section 35(3)(d) of the PDP Constitution (2017) empowers him to take over the affairs of the party in acting capacity, in the absence of the national chairman and deputy national chairman (South).\nHowever, Akinwonmi insisted he was the authentic acting national chairman of the party and declared Nazif’s decisions null and void.\nThe chairman is followed by the deputy national chairman 1 (South), followed by the deputy national chairman (north)."
  },
  {
    "headline": "Insecurity: Over 100,000 killed in North East –Zulum",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaGovernor Babagana Zulum said over 100,000 people have been killed in the 12-year insurgency in the North East.\nHe also said the whereabouts of about 10 per cent Borno indigenes were not known as a result of insecurity in the state.\nHe said 2,600 insurgents were in custody of the state, but not all of them that have surrendered were criminals.\nZulum made the disclosure while briefing journalists after a meeting with President Muhammadu Buhari in Abuja, yesterday.\nHe said no law prescribes the killing of surrendered insurgents, saying they would be trained for the purpose of reintegration into the society."
  },
  {
    "headline": "Detained Igboho’s associates still in detention after bail",
    "summarized_story": "From Godwin Tsa, AbujaIt’s a long walk to freedom for the 12 detained associates of Sunday Adeyamo, a Yoruba activist, as they are yet to regain freedom 19 days after a Federal High Court granted them bail.\nJustice Obiora Egwuatu of the Abuja division of the court had, on August 4, admitted all the 12 applicants to bail on different terms and conditions.\nWhile eight of them were granted bail in the sum of N5 million each and two sureties in the like sum, the other four were admitted to bail in the sum of N10 million each and two sureties in the like sum.\nMeanwhile, the DSS, through its counsel, Idowu Awo, has withdrawn its motion seeking to nullify the bail granted to Amudat Habibat, Abideen Shittu, Jamiu Oyetunji and Bamidele Sunday.\nEgwuatu of the Federal High Court in Abuja had, on August 4, granted bail to the 12 associates of Sunday Igboho."
  },
  {
    "headline": "Secessionist groups, Cameroon align to destabilise West Africa -NSA",
    "summarized_story": "From Molly Kilete, AbujaNational Security Adviser (NSA), Major Gen. Babagana Mungono, has raised the alarm over plans by secessionist groups in Nigeria to go into alliances with their counterparts in Cameroon to destabilise the peace and security of both countries.\nMungono said any attempt to form alliances between secessionist groups in Nigeria and Cameroon would be decisively dealt with.\nThe NSA stated this at the opening of the eight session of the Cameroon/Nigeria trans border security committee in Abuja.\nHe said Federal Government would continue to support efforts of Cameroonian authorities by engaging all aggrieved parties to de-escalate the security concerns in the North West and South West regions of the country.\n“We will work closely together to ensure that any real or perceived attempts to form any alliances between secessionist groups in Nigeria and Cameroon are decisively dealt with."
  },
  {
    "headline": "Borno Gov: Over 100,000 Lives Lost to N’east Insurgency",
    "summarized_story": "By Deji ElumoyeGovernor Babagana Zulum of Borno State has disclosed that over 100,000 lives have been lost to the 12-year-old insurgency in the North-east zone.\nZulum, who stated this on Tuesday while speaking with newsmen at the State House, Abuja, also said there are a total of 2,600 surrendered insurgents now in custody, emphasizing that not all of them are criminals.\nWhile noting that many of them are women and young children who have been trained to handle AK-47, the governor assured Nigerians that the repentant insurgents would be subjected to the extant laws of the country.\nHe, however, stressed that no law prescribes the killing of surrendered insurgents, adding that they would be trained for the purpose of reintegration.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NDA Confirms Attack by Bandits",
    "summarized_story": "By John ShiklamThe Nigerian Defence Academy (NDA) has confirmed the attack on the institution by bandits, saying its security architecture was compromised.\nThe statement titled “Security breach of Nigerian Defence Academy architecture” read: “The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\n2Lt Onah, who sustained gunshot injuries, was said to be receiving treatment at the NDA Medical Centre.\nNDA is a Military University based in Kaduna.\nAfter independence in 1960, it became known as the Nigerian Military Training College before it was renamed Nigerian Defence Academy."
  },
  {
    "headline": "Breaking: Bandits Attack NDA, Kill 2 Officers, Abduct 1",
    "summarized_story": "By John ShiklamBandits have attacked the permanent site of the Nigerian Defence Academy (NDA) Kaduna, killing two officers.\nI am awaiting the Commandant’s approval”, Jajira responded on the WhatsApp chat group of the NDA and the media.\nNDA is a Military University based in Kaduna.\nThe military institution trains the officer corps of the Nigerian Army, Navy and Air Force.\nAfter independence in 1960, it became known as the Nigerian Military Training College before it was renamed Nigerian Defence Academy."
  },
  {
    "headline": "Ex-NADECO Chieftain, Olabiyi Durojaiye, is Dead",
    "summarized_story": "Former Presidential aspirant on the platform of defunct Social Democratic Party (SDP) and chieftain of the National Democratic Coalition (NADECO), Senator Olabiyi Durojaiye, is dead.\nHe died on Tuesday morning after a brief illness.\nThe late Durojaiye served as Senator for Ogun East Senatorial District on the platform of the Alliance for Democracy between 1999 and 2003.\nIn Senate, he served in the Judiciary, Establishment and Special Project committees.\nHe vied for the presidential ticket of the SDP, which was won by late Chief MKO Abiola."
  },
  {
    "headline": "PDP Crisis Worsens as Court Restrains Secondus from Parading as Chairman",
    "summarized_story": "Part of the prayers were that Secondus be stopped from performing the functions of national chairman of the PDP while on suspension as a member of the party.\nIn line with series of meetings and a determination to resolve the crisis to save PDP, Chairman of the PDP Board of Trustees, Senator Walid Jubrin, summoned an expanded board meeting.\nIn the long run, BoT chairman, Walid Jibrin, identified numerous problems in the PDP, which needed urgent attention.\nThis, sadly, underscored how much Secondus’ ouster meant to the Rivers governor, hence he attended the BoT meeting for the first time.\nThe media office, in a statement by Ike Abonye, said, “PDP and Secondus are not afraid of court."
  },
  {
    "headline": "Military Personnel In Charge Of CCTV Slept Off When Bandits Attacked Defence Academy – Report",
    "summarized_story": "Personnel monitoring closed-circuit television (CCTV) at the Nigerian Defence Academy (NDA) were reportedly asleep when bandits attacked the premises on Tuesday, killing two officers.\nA source later told SaharaReporters that the kidnappers had contacted the military authorities to demand a ransom of N200 million.\nHowever, sources told TheCable the bandits sneaked in through a part of the facility that had no fence.\nBashir Muhd Jajira, spokesperson for the academy, in a statement said, “The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\nWe assure the general public that this unknown gunmen would soon be apprehended and the abducted personnel rescued.”"
  },
  {
    "headline": "Military Personnel In Charge Of CCTV Slept Off When Bandits Attacked Defence Academy – Report",
    "summarized_story": "Personnel monitoring closed-circuit television (CCTV) at the Nigerian Defence Academy (NDA) were reportedly asleep when bandits attacked the premises on Tuesday, killing two officers.\nA source later told SaharaReporters that the kidnappers had contacted the military authorities to demand a ransom of N200 million.\nHowever, sources told TheCable the bandits sneaked in through a part of the facility that had no fence.\nBashir Muhd Jajira, spokesperson for the academy, in a statement said, “The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\nWe assure the general public that this unknown gunmen would soon be apprehended and the abducted personnel rescued.”"
  },
  {
    "headline": "Military Personnel In Charge Of CCTV Slept Off When Bandits Attacked Defence Academy – Report",
    "summarized_story": "Personnel monitoring closed-circuit television (CCTV) at the Nigerian Defence Academy (NDA) were reportedly asleep when bandits attacked the premises on Tuesday, killing two officers.\nA source later told SaharaReporters that the kidnappers had contacted the military authorities to demand a ransom of N200 million.\nHowever, sources told TheCable the bandits sneaked in through a part of the facility that had no fence.\nBashir Muhd Jajira, spokesperson for the academy, in a statement said, “The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\nWe assure the general public that this unknown gunmen would soon be apprehended and the abducted personnel rescued.”"
  },
  {
    "headline": "BREAKING: Bandits Attack Nigerian Defence Academy, Kill Military Officer, Abduct Two Personnel",
    "summarized_story": "Bandits have invaded the Afaka barracks of the Nigerian Defence Academy (NDA), Kaduna State, killing a naval officer.\nAccording to Daily Trust, the bandits who attacked the barracks around 1am on Tuesday are still believed to be inside the academy.\nA reliable source within the barracks said security had been beefed up within and around the barracks to stop the bandits from escaping with the officers.\nOne of the officers who was injured in the attack is currently being treated at a hospital within the barracks.\nThe source said that there are, however, fears that the bandits may decide to kill the officers in a bid to escape."
  },
  {
    "headline": "BREAKING: Bandits Attack Nigerian Defence Academy, Kill Military Officer, Abduct Two Personnel",
    "summarized_story": "Bandits have invaded the Afaka barracks of the Nigerian Defence Academy (NDA), Kaduna State, killing a naval officer.\nAccording to Daily Trust, the bandits who attacked the barracks around 1am on Tuesday are still believed to be inside the academy.\nA reliable source within the barracks said security had been beefed up within and around the barracks to stop the bandits from escaping with the officers.\nOne of the officers who was injured in the attack is currently being treated at a hospital within the barracks.\nThe source said that there are, however, fears that the bandits may decide to kill the officers in a bid to escape."
  },
  {
    "headline": "Bakare: We're building a formidable shadow cabinet for 2023",
    "summarized_story": "Tunde Bakare, serving overseer of the Citadel Global Community Church, says he and a group of Nigerians are building a formidable team, like a shadow cabinet, for the next administration.\nHe said anyone plunging into the election in 2023 is plunging his head inside hot water, hence a team is needed to do so.\nAdvertisement“Very shortly, you will see the formidable team that we are presenting to the nation like a shadow cabinet, these are the men that would do it.\nIt is going to hit it big time, in a positive manner.”He said the nation’s next president must be the best candidate, praying that God will heal Nigeria from such sad comments that “the best candidate may not win”.\n“What we are faced with now, is that the best candidate emerges: it can go to the north, the south, if it’s an Igbo man, so be it."
  },
  {
    "headline": "Bakare: We're building a formidable shadow cabinet for 2023",
    "summarized_story": "Tunde Bakare, serving overseer of the Citadel Global Community Church, says he and a group of Nigerians are building a formidable team, like a shadow cabinet, for the next administration.\nHe said anyone plunging into the election in 2023 is plunging his head inside hot water, hence a team is needed to do so.\nAdvertisement“Very shortly, you will see the formidable team that we are presenting to the nation like a shadow cabinet, these are the men that would do it.\nIt is going to hit it big time, in a positive manner.”He said the nation’s next president must be the best candidate, praying that God will heal Nigeria from such sad comments that “the best candidate may not win”.\n“What we are faced with now, is that the best candidate emerges: it can go to the north, the south, if it’s an Igbo man, so be it."
  },
  {
    "headline": "FULL LIST: Lagos approves 183 COVID vaccination sites",
    "summarized_story": "The Lagos ministry of health has approves 183 sites for the administration of the Moderna COVID-19 vaccine.\nAdvertisement“Successful enrollees should then proceed to any of the 183 vaccination sites picked at the point of registration at the time scheduled to get the first dose of vaccine.\n“Eligible persons are advised to Pre-register on the NPHCDA E-Registration portal before visiting the Vaccination sites.\n“Kindly note: ONLY pre-registered persons should visit the vaccination sites as scheduled.\nModerna Vaccine is Safe, Effective and Free.”AdvertisementSee the list of the 183 vaccination sites below."
  },
  {
    "headline": "FULL LIST: Lagos approves 183 COVID vaccination sites",
    "summarized_story": "The Lagos ministry of health has approves 183 sites for the administration of the Moderna COVID-19 vaccine.\nAdvertisement“Successful enrollees should then proceed to any of the 183 vaccination sites picked at the point of registration at the time scheduled to get the first dose of vaccine.\n“Eligible persons are advised to Pre-register on the NPHCDA E-Registration portal before visiting the Vaccination sites.\n“Kindly note: ONLY pre-registered persons should visit the vaccination sites as scheduled.\nModerna Vaccine is Safe, Effective and Free.”AdvertisementSee the list of the 183 vaccination sites below."
  },
  {
    "headline": "Ortom: No constitutional basis for review of grazing reserves",
    "summarized_story": "Samuel Ortom, governor of Benue, says President Muhammadu Buhari’s decision to review grazing reserves across the country is unconstitutional.\nThis statement comes following Buhari’s approval of the recommendations of a committee to review 368 grazing reserves across 25 states in the country — a development that has been met with criticism.\nFemi Falana, human rights lawyer, had criticised Buhari for the decision, adding that open grazing is “obsolete”.\nAdvertisementSpeaking on the development when he featured on Sunrise Daily, a Channels Television programme, on Tuesday, Ortom described the president’s decision on grazing reserves as “disappointing”.\nI have said ‘Look, when we had grazing routes and grazing reserves, what was the total population?"
  },
  {
    "headline": "Ethiopia is building local competitors to Facebook, WhatsApp, Twitter and Zoom",
    "summarized_story": "Ethiopia has begun developing its own social media platforms to rival Facebook, Twitter, WhatsApp and Zoom, as per Reuters.\nIn a local media outlet on Friday, Shumete accused Facebook of blocking users who were “preaching national unity and peace”.\nSupporters of the different sides have taken the conversation over to social media.\nTo build these platforms, Ethiopia is relying solely on local expertise.\nThis begs the question of whether investing in state-owned social network platforms should be on its list of priorities."
  },
  {
    "headline": "Bitnob to launch a free, 10-second remittance transfer service for Africans via Bitcoin Lightning Network",
    "summarized_story": "But the Bitcoin Lightning Network connecting Strike and Bitnob is a system that could upend the global remittance market and threatens the very existence of legacy players.\nWith @Bitnob_official's Lightning Network integration, we now have free, instant, non-reversible remittances of any size to and from the United States, Nigeria, and Ghana.\nThe Lightning Network is what we call the layer 2 technology – like a highway on top of a road for people to move faster.\nThe Lightning Network is also a protocol where any two nodes can talk to each other.\nAnd on the Lightning Network, there’s a number of ways to make money as a node."
  },
  {
    "headline": "Led by SoftBank, Nigeria’s OPay raises $400m at $2bn valuation",
    "summarized_story": "Nigeria-based OPay has secured $400 million in a new funding round led by SoftBank Vision Fund, the venture capital arm of Japanese conglomerate, SoftBank.\nThe latest funding brings investments to date in OPay to $570 million and values the Nigerian mobile payments platform at $2 billion.\nIt is the single-largest investment round secured by an African-based startup and marks the first investment in a startup on the continent by the SoftBank Vision Fund.\nThey include Sequoia Capital China, DragonBall Capital, Redpoint China, Source Code Capital, SoftBank Ventures Asia, and 3W Capital.\nFounded in 2018, OPay raised two investments in 2019; $50 million in June and a $120 million Series B in November."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Nigeria wants businesses registered in hours, yet it takes months",
    "summarized_story": "Nigeria wants businesses registered in hours, yet it takes monthsHassana (not her real name) is wedged behind her HP workstation with stacks of documents required to register a client’s business in a one-room apartment in Jabi, Abuja.\nOn a table nearby, a scanner and a printer whir along as she spends monotonous hours signing and scanning document after document to upload onto the website…"
  },
  {
    "headline": "Low pay, poor compliance shutting out retirees from pension benefits",
    "summarized_story": "For getting low pay while in employment, late enrolment or non-compliance of employers to the Contributory Pension Scheme (CPS), about 3,398 retirees who left employment in the first quarter of 2021 would not be able to get a pension package for retirement.\nThe reason is that the balance in their Retirement Savings Account (RSA) as at the date of disengagement is below the threshold required to procure a pension package as provided in the Pension Reform Act.\nIndustry analysts say some of the reasons for this unhealthy development is poor compliance among private sector institutions, as some started compliance late, and when they started remittances were irregular.\nThey also attribute it to low pay earned by some employees, which amounts to almost nothing and too low to procure a pension package in retirement.\nThe group says the introduction of the Pension Framework by PenCom aimed at enhancing pension of those who are on Programmed Withdrawal under the CPS might not meet the expectations of pensioners."
  },
  {
    "headline": "Consumer trends open opportunities for Nigerian manufacturers",
    "summarized_story": "Going back in time, Hypo, as a bleaching product, was considered primarily for clothes.\nBy 2020, it had been repurposed as a disinfectant for surfaces as awareness increased in curtailing the spread of coronavirus.\nIt is one of several consumer products that have been adapted to other uses over the years, some, for much longer…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Washed off road: Project constructed by Federal Ministry of Agric – Edo govt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said viral pictures of a poorly executed road project linking Uokha and Ohami in Owan East Local Government Area (LGA) of the state, which according to reports washed off two months after completion, is a project of the Federal Ministry of Agriculture and Rural Development.\nChief of Staff to the Edo State Governor, Osaigbovo Iyoha, in a statement, said the project does not represent the standard of roads constructed by the Edo State Government, reassuring the government’s commitment to quality and durable infrastructure.\nAccording to him, “The attention of the Edo State Government has been drawn to viral online pictures showing shoddy job on a road project linking Uokha and Ohami in Owan East Local Government Area of Edo State, which according to reports, washed off two months after completion.\n“The poorly executed project, titled ‘construction of 4.0km Asphaltic Road at Uokha to Ohami,’ as clearly stated in the signpost at the construction site, is a project of the Federal Ministry of Agriculture and Rural Development and executed by Messr.\n“The shoddy and substandard job does not represent the standard of projects in Owan East or any part of Edo State under the leadership of Governor Godwin Obaseki."
  },
  {
    "headline": "Obaseki eulogises late Captain Hosa Okunbo, celebrates life of selfless service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has described late Capt.\nIdahosa Okunbo as an icon of selfless service, noting that his death was a great loss to the state and country.\nThe governor said this when he paid a condolence visit to the Okunbo family in Benin City, the Edo State capital.\nIdahosa Okunbo is not just a loss to the Okunbo family, it is a bigger loss to the Benin and Edo family, as well as Nigeria.\nWe must learn from his life, particularly his life of generosity.”“Captain was generous to a fault."
  },
  {
    "headline": "Obaseki meets police, army chiefs, urges efforts to tackle arms build-up, set up of military bases in crime-prone areas – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for increased synergy between the government and security agencies to tackle the proliferation of arms and combat insecurity in the state.\nObaseki also received the Inspector General of Police (IGP), Usman Alkali Baba, stating the need to set up a special squad to tackle arms build-up in Edo communities.\nWe also appeal that you support us with a special squad to complement our efforts in calming the restiveness that we are seeing around communities, largely because of land disputes.\n“We will be seeking your assistance to help us set up a special squad to handle this problem, especially the arms buildup in communities across the State.\nEarlier, the IGP commended Obaseki for ensuring synergy between the government and the police, noting, “Edo State is the best amongst states in the federation in terms of community policing."
  },
  {
    "headline": "IGP Alkali lauds Edo govt on security, tasks officers on commitment to duty. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Inspector-General of Police IGP Usman Alkali Baba has commended the Edo State government for the support it gives to the state police command.\nAlso, the IGP urged operatives of the state police command to reciprocate the state government support by ensuring that Edo State is better policed than before.\nIGP Alkali stated this while addressing men and officers of Edo State Police Command at the state police headquarters in Benin City, yesterday.\nIGP Alkali further expressed confidence that the rebuilding of some police infrastructure destroyed during the EndSARS crisis in Benin City would also serve as morale booster.\nThe IGP who was in Benin City on a one-day familiarisation visit, urged the officers to keep hope alive as the proposed review of their salaries would soon be achieved."
  },
  {
    "headline": "More controversy in PDP as another ‘national chairman’ emerges",
    "summarized_story": "The Deputy National Chairman (North) of the Peoples Democratic Party (PDP), Suleiman Nazif, has declared himself the acting national chairman of the party further deepening the crisis rocking the main opposition party.\nRelying on Section 45 (2) of the PDP Constitution, Mr Akinwonmi had declared himself national chairman pending the determination of the restraining order on the embattled Mr Secondus.\nBeing from the south as Mr Secondus, Mr Akinwonmi is next in line to the national chairman, going by the party’s constitution.\nThe section states: “In the absence of the National Chairman and the Deputy National Chairman from the region part of the country where the National Chairman originates from, the other Deputy National Chairman shall act as National Chairman without prejudice to 47 (6) of this Constitution”.\nIf the deputy national chairman south is not available, the deputy chairman, north will take charge."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun @30: NUJ to hold symposium to mark creation anniversary",
    "summarized_story": "By Sunday Oguntuyi, OsogboNigeria Union of Journalists (NUJ), Osun state Council, will on friday hold the 2nd edition of its quarterly intellectual discourse, NUJ Guest Platform at NUJ Press Centre, Osogbo by 11amThis edition will focus on OSUN @30: THE JOURNEY SO FAR, THE PROSPECT AND PROJECTION.\nA Statement by the chairman of the planning Committee, Comrade Season Adeleke and Bisola Ariwodola, indicated that a renowned professor of history, Siyan Oyeweso will be the guest speaker, while Osun state commissioner Budget and Economic planning, Professor Olalekan Yinusa is the co speaker.\nThe statement noted that Osun state governor, Mr Gboyega Oyetola is the special Guest of hour, while Senator representing Osun West senatorial district, Adelere Oriolowo will chair the occasion.\nIt hinted that Orangun of Oke-Ila, Oba Adedokun Abolarin, Aroyinkeye 1st is the Royal Father of the day.\nOther invited guests include the deputy chief of staff to the governor, Mr Abudulahi Adeyanju Binuyo; Osun State Commissioner for Information and Civic Orientation, Mrs Funke Egbemode; Osun State House of Assembly Chief Whip, Hon Tunde Olatunji and Chief Press Secretary to Osun State governor, Mr Ismail Omipidan."
  },
  {
    "headline": "Attack on NDA an assault on Nigeria’s territorial integrity – Kaduna speaker",
    "summarized_story": "Speaker of Kaduna State House of Assembly, Alhaji Yusuf Zailani, has described the invasion of Nigerian Defence Academy (NDA) by bandits in the early hours of Tuesday as an assault on the country’s territorial integrity.\nRecall that bandits on Tuesday invaded the premises of NDA in Kaduna, killing two soldiers and kidnapping.\nThe speaker described NDA as the premier training citadel for members of Nigeria’s armed forces and pride to the country and Africa.\nHe said that attack on such an institution was unacceptable and must be investigated by the military hierarchy.\n“This shows their complete loss of confidence in the APC administration and the empty promises by the Buhari Presidency."
  },
  {
    "headline": "Osun APC Crisis: Oyetola appeals for calm, calls on state party chairman to discontinue court case",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Adegboyega Oyetola, on Tuesday, further demonstrated his love for peace as he charged the State All Progressives Congress (APC) Caretaker Chairman, Prince Gboyega Famodun, to discontinue the court case against some chieftains of the party who had invaded the party secretariat with armed thugs a fortnight ago.\nThey were accused of assaulting one Muideen Ajetunmobi and Usman Lekan at the APC Secretariat on August 14, 2021.\nTo this end, he has directed the party chairman in the state to withdraw the complaints and take necessary measures to discontinue the matter.\n“The invasion of the party secretariat by armed thugs stands condemned as no sane society will condone the resort to self help in settling disagreements within a family,” he said.\n“But as the governor, I have directed our party chairman to discontinue the matter in the interest of peace and harmony within the party.”"
  },
  {
    "headline": "Osun Dep. Gov, Alabi salutes speaker Owoeye on his birthday anniversary",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State Deputy Governor, Mr Benedict Alabi, has extolled the enviable virtues of the Speaker of Osun State House of Assembly, RT.\nTimothy Owoeye, on the occasion of his 49th birthday.\nAlabi described Owoeye as a worthy ambassador of the young generation of lawmakers in Osun and Nigeria at large.\n“Certainly, you have proven yourself as a worthy ambassador of young generation of Lawmakers in our state and beyond.\n“Happy birthday our cerebral Speaker”, Alabi remarked ."
  },
  {
    "headline": "Nigeria Must Stop Fuel, Power Subsidies, Borrowing Now – Sanusi",
    "summarized_story": "A former governor of the Central Bank of Nigeria (CBN) and 14th Emir of Kano, Sanusi Lamido Sanusi, has said Nigerians should brace up for hard decisions as he said the country will be in jeopardy if it continues with the trend of excessive borrowing and subsidising fuel and power.\nAccording to Sanusi, Nigeria’s borrowing has grown to an unsustainable level and the country ought not to be subsidising fuel and power over critical sectors such as health and education.\n“Nigerians have to understand that the way we have ran the state is unsustainable we cannot continue subsidizing fuel, we cannot continue subsidising power.\n“This generation will continue borrowing to consume while passing the debt to the next generation to pay.\nOut of all the United Nations sustainable goal, if you’ve asked me which goal has the greatest impact for dealing with development issues, it would be educating the girl child."
  },
  {
    "headline": "Nigeria Must Stop Fuel, Power Subsidies, Borrowing Now – Sanusi",
    "summarized_story": "A former governor of the Central Bank of Nigeria (CBN) and 14th Emir of Kano, Sanusi Lamido Sanusi, has said Nigerians should brace up for hard decisions as he said the country will be in jeopardy if it continues with the trend of excessive borrowing and subsidising fuel and power.\nAccording to Sanusi, Nigeria’s borrowing has grown to an unsustainable level and the country ought not to be subsidising fuel and power over critical sectors such as health and education.\n“Nigerians have to understand that the way we have ran the state is unsustainable we cannot continue subsidizing fuel, we cannot continue subsidising power.\n“This generation will continue borrowing to consume while passing the debt to the next generation to pay.\nOut of all the United Nations sustainable goal, if you’ve asked me which goal has the greatest impact for dealing with development issues, it would be educating the girl child."
  },
  {
    "headline": "Nigeria Army Denies Recruiting Repentant Terrorists",
    "summarized_story": "The Nigeria Army (NA) has allayed the fears that repentant Boko Haram Terrorists are being enlisted into the Nigerian Army.\nNwachukwu stated this while reacting to a viral video by a comic actor, Young Elder, comparing Nigeria with Afghanistan.\nADVERTISEMENTIn the video, Young Elder in a comic way expressed worries about the surrendered terrorists in Nigeria.\n“The amateurish production conjured some unfounded and baseless claims that only exist in the pigment of their imagination, claiming that surrendered terrorists where going to be absorbed into the Nigerian Army (NA).\n“Surrendered terrorists will be received, processed and passed to the appropriate Government agencies that are saddled with the responsibility of handling them,” he added."
  },
  {
    "headline": "Nigeria Army Denies Recruiting Repentant Terrorists",
    "summarized_story": "The Nigeria Army (NA) has allayed the fears that repentant Boko Haram Terrorists are being enlisted into the Nigerian Army.\nNwachukwu stated this while reacting to a viral video by a comic actor, Young Elder, comparing Nigeria with Afghanistan.\nADVERTISEMENTIn the video, Young Elder in a comic way expressed worries about the surrendered terrorists in Nigeria.\n“The amateurish production conjured some unfounded and baseless claims that only exist in the pigment of their imagination, claiming that surrendered terrorists where going to be absorbed into the Nigerian Army (NA).\n“Surrendered terrorists will be received, processed and passed to the appropriate Government agencies that are saddled with the responsibility of handling them,” he added."
  },
  {
    "headline": "Multichoice Executive, Martin Mabutho, Is Dead",
    "summarized_story": "The Chief Customer Officer of Multichoice Nigeria, Mr Martin Mabutho, is dead.\nMabutho was said to have died on Tuesday morning after a brief illness in his home country, South Africa.\nADVERTISEMENTChief Executive Officer of Multichoice, Mr John Ugbe, confirmed his death in a memo which reads, “It is with deep personal grief that I inform you of the passing of Martin Mabutho, our Chief Customer Officer.\n“Martin passed away earlier today, Tuesday August 24, 2021, after a brief illness.\nAs colleague and as a business, we will continue to honour his memory in all that we do.”"
  },
  {
    "headline": "NDA attack: Identities of military officers killed, kidnapped by bandits",
    "summarized_story": "Bloodthirsty bandits killed two military officers and kidnapped another when they attacked Nigeria’s foremost military university, the Nigerian Defence Academy, Kaduna on Tuesday.\nThe murdering bandits shot Lieutenant Commander Wulah and Flight Lieutenant Okoronkwo while Major Datong is still missing.\nIncidentally, the military institution is opposite the Federal College of Forestry Mechanization, Afaka where 39 students were abducted by bandits on March 11, 2021.\nIn a statement confirming the attack, the NDA revealed that it is on the trail of the gunmen who compromised its security architecture.\nWe assure the general public that these unknown gunmen would soon be apprehended and the abducted personnel rescued.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "NDA attack: Identities of military officers killed, kidnapped by bandits",
    "summarized_story": "Bloodthirsty bandits killed two military officers and kidnapped another when they attacked Nigeria’s foremost military university, the Nigerian Defence Academy, Kaduna on Tuesday.\nThe murdering bandits shot Lieutenant Commander Wulah and Flight Lieutenant Okoronkwo while Major Datong is still missing.\nIncidentally, the military institution is opposite the Federal College of Forestry Mechanization, Afaka where 39 students were abducted by bandits on March 11, 2021.\nIn a statement confirming the attack, the NDA revealed that it is on the trail of the gunmen who compromised its security architecture.\nWe assure the general public that these unknown gunmen would soon be apprehended and the abducted personnel rescued.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "NPDC, Ogoni People Pledge Cooperation on Oil Production",
    "summarized_story": "By JOHN MOMODUThe leaders of Ogoniland in Rivers State under the auspices of the Ogoni Liberation Initiative have pledged to cooperate with the Nigerian Petroleum Development Company (NPDC) in the exploration and production of oil and gas resources in its territory.\nThe Ogoni leaders made the pledge Tuesday at the Ogoni Liberation Day which held in Bori with the Managing Director of NPDC, Mr. Mohammed Ali-Zarah, as an invited guest.\nSpeaking at the event, the Convener and leader of the Ogoni Liberation Initiative, Rev.\nThe Ogoni leader described the judgment that handed OML11 to NPDC as liberation for the Ogoni people, stressing that the people of Ogoni have “looked forward to this freedom over the years”.\nOil production operations were suspended in Ogoniland in the early 1990s due to disruptions caused by local unrest."
  },
  {
    "headline": "NPDC, Ogoni People Pledge Cooperation on Oil Production",
    "summarized_story": "By JOHN MOMODUThe leaders of Ogoniland in Rivers State under the auspices of the Ogoni Liberation Initiative have pledged to cooperate with the Nigerian Petroleum Development Company (NPDC) in the exploration and production of oil and gas resources in its territory.\nThe Ogoni leaders made the pledge Tuesday at the Ogoni Liberation Day which held in Bori with the Managing Director of NPDC, Mr. Mohammed Ali-Zarah, as an invited guest.\nSpeaking at the event, the Convener and leader of the Ogoni Liberation Initiative, Rev.\nThe Ogoni leader described the judgment that handed OML11 to NPDC as liberation for the Ogoni people, stressing that the people of Ogoni have “looked forward to this freedom over the years”.\nOil production operations were suspended in Ogoniland in the early 1990s due to disruptions caused by local unrest."
  },
  {
    "headline": "Breaking: Major Datong abducted by bandits at NDA killed",
    "summarized_story": "The military officer Major Christopher Datong abducted today at Nigerian Defence Academy, Afaka in Kaduna has been murdered.\nAccording to reports, his body was found on Tuesday evening, hours after he was captured by bandits.\nThe speaker described NDA as the premier training citadel for members of Nigeria’s armed forces and pride to the country and Africa.\nWhile commending security personnel for making efforts to decimate bandits and insurgents nationwide, he said that they should not let the NDA incident demoralise them.\n“I am, however, pleased that the NDA authorities have given assurance that the assailants are being trailed and that they will be apprehended,” the speaker added."
  },
  {
    "headline": "MultiChoice Nigeria loses 'most trusted adviser' Martin Mabutho",
    "summarized_story": "MultiChoice Nigeria has announced the passing of Martin Mabutho, the company’s 47-year-old Chief Customer Officer, who died on Tuesday in Cape Town, South Africa, after a brief illness.\n“Mabutho joined MultiChoice Botswana as a Customer Service Supervisor in 1999, and later became a Brand Manager at MNet in 2003.\n“He led the Marketing and Sales effort for DStv Mobile in Sub-Saharan Africa before his appointment as MultiChoice Nigeria’s General Manager, Sales and Marketing in 2013.\n“In 2018, he was appointed Chief Customer Officer, responsible for driving the MultiChoice Nigeria customer group strategy,” Ugbe said.\nHe further noted that the deceased was able to achieve tremendous success in customer value management, sales, marketing, customer experience, and care."
  },
  {
    "headline": "BREAKING: Major Kidnapped By Bandits In NDA Found Dead",
    "summarized_story": "A major who was kidnapped by armed bandits at the Nigerian Defence Academy in Kaduna in the early hours of Tuesday has been found dead.\nDuring a raid at the Nigerian Defence Academy in Kaduna, the major was abducted, leaving two people dead and one kidnapped.\nDetails later…"
  },
  {
    "headline": "BREAKING: Abiodun Olukoya, Ex-Ondo Military Governor Is Dead",
    "summarized_story": "Abiodun Olukoya, former Military Governor of Ondo State and retired Rear Admiral, died on Sunday.\nAfter suffering an illness, Olukoya passed away on Tuesday.\nOlukoya was the Governor of the united States between 1989 and 1992, before Ondo and Ekiti were divided.\nRetired Commodore Olabode George was succeeded by Olukoya, who was thereafter turned over to Chief Bamidele Olomilua.\nOlukoya passed away few hours after Olabiyi Durojaiye, the former Chairman of the Nigerian Communications Commission (NCC), passed away."
  },
  {
    "headline": "Plateau Unrest: Eight Killed, Scores Injured As Police Engage Bandits In Gun Duel",
    "summarized_story": "According to the Plateau Police Command, six bandits were killed in a gunfight on Monday in Kwoi village, Gindiri district, Mangu Local Government Area.\nDuring the gun battle with the bandits, the Command lost a personnel and a member of a vigilante organization, according to Ogaba.\n“Yesterday, at about 2 p.m., we received credible information about the activity of a notorious syndicate of gunrunners at Kwoi Village in Mangu Local Government Area of the state.\n“Regrettably, one Insp Abdulrahaman Isah, Commander of the IGP’s IRT based in Mangu and one Hassan Mohammed, a local vigilante member, gallantly paid the supreme price,” he said.\nHe said the Police has commenced investigation and intensifying efforts to arrest the fleeing bandits and other members of the group, NAN reports."
  },
  {
    "headline": "How bandits gained access to NDA -Spokesman",
    "summarized_story": "Authorities of the Nigerian Defence Academy, Kaduna, say that the security architecture of the institution was compromised, allowing the bandits to gain access to the well fortified institution.\nThey confirmed the attack on its facility where two officers were killed and another abducted by bandits on Tuesday.\nConfirming the attack, the spokesman of the NDA, Major Bashir Jagira, said that the security architecture of the institution was compromised, hence the bandits gained access to well fortified institution.\nThe statement titled, ‘Security breach of the Nigerian Defence Academy architecture,’ reads: “The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\nWe assure the general public that this unknown gunmen will soon be apprehended and the abducted personnel rescued.”"
  },
  {
    "headline": "Pictures: How Ministers Dare, Farouk, Nwajiuba hosted victorious Team Nigeria athletes from World U-20 Athletics Championship",
    "summarized_story": "Reception for Nigerian contingent to the U-20 World Athletics Championship hosted by Minister of Youth and Sports Development, Sunday Dare at MKO Abiola National Stadium, AbujaMinister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Farouk, Minister of Women Affairs, Dame Pauline Tallen, Minister of State for Education, Emeka Nwajiuba and SSA on Sports to the President,Mr Daniel Amokachi also attended the Reception"
  },
  {
    "headline": "VIDEO: Drug trafficker caught, hides cannabis in sacks",
    "summarized_story": "The operative of the Nigeria Drug Law Enforcement Agency (NDLEA), have arrested one Chizoba Francis in Lokoja, the Kogi state capital on Saturday.\nAccording to a statement on Tuesday by the spokesman of the anti-drugs agency, Femi Babafemi, said, the suspect was arrested at the weekend in Lokoja with 54 kilogrammes cannabis hidden in sacks and covered with used footwears.\nHe said the consignment was bought at Emure, Ondo state with Kaduna as destination.\nRelatedNo tags for this post."
  },
  {
    "headline": "Breaking: PDP ‘splits’ as two acting National chairmen emerge",
    "summarized_story": "The crisis rocking the Peoples Democratic Party (PDP) is deepening by the day as deputy national chairman (north), Senator Sulieman Nazif has declared himself the acting national chairman of the party.\nFlanked by nine members of the National Working Committee (NWC), Nazif, who made the declaration at the party’s headquarters in Abuja, Tuesday, said his declaration is in accordance with the party’s constitution as amended.\nNazif’s declaration is coming less than three hours after the party Deputy National Chairman (South), Elder Yemi Akinwonmi, announced that he had taken charge of the party’s affairs and suspended the NWC meeting indefinitely.\nDetails loading…"
  },
  {
    "headline": "FMSTI Sensitises Nigerians on Methanol Fuel Technology -NigPilot",
    "summarized_story": "Minister of Science, Technology, and Innovation, Dr. Ogbonnaya Onu has launched the sensitization campaign on Methanol Fuel Technology.\nThe Methanol Fuel Technology policy was developed jointly with The Federal Ministry of Transport, Finance, Petroleum, Agriculture, Power, Environment among others.\nMethanol technology the Minister said is a fuel with lower risk of flammability compared to gasoline and other products.\nThe minister said that with Methanol Fuel Technology, more value will be added to the country’s natural resources.\nMni, said that strategies have been put in place to source for funding to boost the Methanol Fuel Technology value chain."
  },
  {
    "headline": "TETFund approves N292.6bn for varsities, others, okays 217 research grants -NigPilot",
    "summarized_story": "At the briefing session, Bogoro also explained that the responsibility of completing the National Library Project in Abuja has been bestowed on TETFund.\nHe said this accounted for the setting up of the National Research Fund which has consistently increased from N3 billion to N8.5 billion in recent times.\n“I have signed the letters of allocation for the research grants that we are issuing out, 217.\nBogoro said TETFund is also providing support to boost research activities in Defence Industries Corporation of Nigeria,DICON, among others, to address the nation’s security challenges.\n“We intend to continue strengthening some in terms of cancer facilities, urology research clinical facilities and heart facilities,” he said."
  },
  {
    "headline": "FG to induct A-29 Super Tucano into NAF inventory -NigPilot",
    "summarized_story": "The Federal Government has concluded a plan to induct the six (6) newly acquired 29 Super Tucano fighter jets into the Nigerian Air Force (NAF) inventory.\nThe Director of Public Relations and Information,Nigerian Air Force, Air Commodore Edward Gabkwet announced the planned induction ceremony in a statement in Abuja.\n“As part of programmes lined up for the induction ceremony, a symbolic flypast will be performed by some of the newly acquired A-29 Super Tucano aircraft within the vicinity of the induction ceremony,” the statement said.\nThe NAF Spokesperson recalled that the first batch of 6 A-29 Super Tucano aircraft arrived Kano, Nigeria on 22 July 2021.\nAir Commodore Gabkwet concluded that the second batch of the remaining 6 A-29 Super Tucanos are expected in Nigeria before the end of 2021."
  },
  {
    "headline": "Digitalization: Head of Service begins development of Standard Operating Procedures -NigPilot",
    "summarized_story": "Office of the Head of the Civil Service of the Federation has commenced the process for the development of Standard Operating Procedures, SOPs in core Ministries.\nThis was announced in a circular issued by the Head of the Civil Service of the Federation, Dr. Folasade Yemi-Esan, dated August 5, 2021.\nAIG also facilitated the development of comprehensive training materials on SOP development, including a training video, workshop templates and training manuals that will guide future SOP development activities.\nAccording to the circular and an appended schedule for the exercise, a pilot exercise involving four Ministries Departments and Agencies, MDAs namely: Federal Ministry of Finance, Budget and National Planning; Federal Ministry of Transportation; State House; and the Federal Civil Service Commission.\nSOPs aim to achieve efficiency, quality output and uniformity of performance while reducing miscommunication and noncompliance with industry regulations."
  },
  {
    "headline": "Insurgency: I Was Attacked More Than 40 Times – Zulum",
    "summarized_story": "﻿Borno State Governor, Babagana Zulum, says he has survived many attacks numbering over 40 by insurgents in the state.\n“I was attacked more than 40, 50 times,” said the governor while responding to questions from the reporters.\nWhile the latest development has been commended by many, others want the Federal Government not to pardon the repentant terrorists.\nBut this position has been rejected by Governor Zulum whose state is one of the worst-hit by the insurgency.\nHe believes accepting the repentant terrorists is the way to go if Nigeria wants an end to the insurgency."
  },
  {
    "headline": "CDS Describes Attack On NDA As ‘Madness’, Seeks Speedy End To Banditry",
    "summarized_story": "The Chief of Defence Staff (CDS), General Lucky Irabor, has condemned the attack on the permanent site of the Nigerian Defence Academy in Kaduna State.\nAddressing reporters on Tuesday in Yola, he described the attack carried out by bandits as madness that must be stopped as soon as possible.\nHe said the solutions to the security challenges in the North East lie in the region, with hopes that the situation will get better in the days ahead.\nGeneral Irabor equally allayed the fears of Nigerians on the ongoing mass surrendering of Boko Haram and Islamic State of West Africa Province (ISWAP) ex-fighters to the military.\n“What remains very clear is the desire and will of the AFN to speedily turn around the fortune of the North East to a state where everyone will be happy again,” the CDS said."
  },
  {
    "headline": "Bandits Attack NDA, Kill Two Officers, Abduct One",
    "summarized_story": "Bandits have attacked the permanent site of the Nigerian Defence Academy in Kaduna State, killing two officers and abducting one other officer.\nThe Spokesman for the academy in the state Major Bashir Muhd Jajira confirmed that that the incident occurred in the early hours of Tuesday.\n“The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen,” Jajira said in a statement.\nA combined team of security operatives has now launched a manhunt of the bandits inside the bush including air surveillance with a view to arresting them and rescuing the kidnapped officer.\nThe Nigerian Defence Academy is located few metres away from the Federal College of Forestry Mechanization Afaka, in Igabi Local Government Area of Kaduna State, where 39 students were abducted by bandits in March."
  },
  {
    "headline": "Eight Killed As Police Engage Gunrunners In Plateau Village",
    "summarized_story": "Eight persons have been killed in a gunfight between a combined team of security operatives and gunrunners at Kwoi Village in Plateau State.\nThe Police Public Relations Officer in the state, Ubah Ogaba, confirmed the incident and the number of those killed in a statement on Tuesday.\n“On 23/08/2021 at about 1400hrs, the command received credible information about the activity of a notorious syndicate of gunrunners at Kwoi Village in Mangu LGA of the state,” he said.\nMonday’s incident comes barely two weeks after gunmen attacked travellers along the Rukuba Road in Jos North Local Government Area of Plateau State.\nPlateau State Governor, Simon Lalong, who condemned the incident had warned those bent on fomenting trouble in the state to desist from such actions."
  },
  {
    "headline": "Algeria Cuts Diplomatic Ties With ‘Hostile’ Morocco",
    "summarized_story": "“Algeria has decided to cut diplomatic relations with the Kingdom of Morocco from today,” Lamamra announced during a press conference.\n“History has shown… Morocco has never stopped carrying out hostile actions against Algeria,” he added.\nLamamra accused Morocco’s leaders of “responsibility for repeated crises” and behaviour that has “led to conflict instead of integration” in North Africa.\nAlgeria last week accused Morocco of supporting the group, which it classifies as a “terrorist organisation”.\nAlgeria’s foreign minister also accused Morocco of leading “a media war… against Algeria, its people and its leaders”."
  },
  {
    "headline": "Nigerian Army not ruling out inside collaboration in attack on NDA – CDS",
    "summarized_story": "The Chief of Defence Staff (CDS), General Lucky Irabor has declared that the Nigerian Army is not ruling out an inside collaborator in the attack on Nigerian Defence Academy (NDA).\nGunmen suspected to be bandits earlier on Tuesday invaded the Afaka barracks of the Nigerian Defence Academy (NDA), killing two officers and abducted one other.\nThe attack happened less than a week after President Muhammadu Buhari charged security chiefs to double up their efforts because he did not want to leave office as a failure."
  },
  {
    "headline": "President Buhari’s Development Initiatives in the Niger Delta – APC Group",
    "summarized_story": "The APC Legacy Awareness, has commended President Muhammadu Buhari’s administrationFor seeing through One of the biggest investments in Nigeria, the Train 7 of the Nigeria Liquefied Natural Gas (NLNG) Limited, in Bonny, Rivers State.\nMore than a decade after Train 6 was completed and launched, President Buhari has in 2021 flagged off construction of Train 7.\nAdvertisementIn addition to the remediation, the Clean Up project is also rehabilitating old water schemes and constructing new ones across Ogoniland.\nOne of the first tasks in the Clean Up was a water quality assessment in all four local governments that make up Ogoniland.\nThe Project will also make interventions in healthcare facilities and systems in the region."
  },
  {
    "headline": "MultiChoice Nigeria loses Chief Customer Officer",
    "summarized_story": "MultiChoice Nigeria has announced the passing of Martin Mabutho, it’s Chief Customer Officer.\nAdvertisementHe will be greatly missed,” said John Ugbe, CEO, MultiChoice Nigeria.\nMabutho joined MultiChoice Botswana as a Customer Service Supervisor in 1999, and later became a Brand Manager at MNet in 2003.\nHe led the Marketing and Sales effort for DStv Mobile in Sub-Saharan Africa before his appointment as MultiChoice Nigeria’s General Manager, Sales and Marketing in 2013.\nIn 2018 he was appointed Chief Customer Officer, responsible for driving the MultiChoice Nigeria customer group strategy covering customer value management, sales, marketing, customer experience and care."
  },
  {
    "headline": "Accuser Says R.Kelly Sexually Abused Her at 17",
    "summarized_story": "The Marvel fans have been given a first taste of what to expect from the unmasked Peter Parker, with the release of the first trailer for upcoming Christmas sequel, “Spider-Man: No Way Home.” Directed by Jon Watts is set for release exclusively in theaters from 17 December.\nAlso, an update on the ongoing R. Kelly sex-trafficking trial, another accuser identified as “Jane Doe,” has taken the witness stand to testify that the R&B superstar sexually abused her on his tour bus and in hotel rooms when she was still a high school student and an aspiring singer.\nShe also claimed that she contracted herpes after having sex with him and hadn’t disclosed he had a sexually transmitted disease."
  },
  {
    "headline": "Nigeria: Deputy National Chairman Suleiman Nazif Takes Over as PDP Acting National Chairman",
    "summarized_story": "A Deputy National Chairman (North) of Nigeria’s opposition People’s Democratic Party (PDP) Suleiman Nazif has taken over as the acting National Chairman of the party.\nMr Nazif made the announcement after an emergency National Working Committee meeting held Tuesday at the Party’s headquarters in Abuja.\nEarlier, a Deputy National Chairman (South) of the PDP, Yemi Akinwomi suspended the scheduled National Working Committee, NWC, meeting of the party till further notice.\nHe said his action was based on a restraining order by a Rivers State High Court sitting in Port Harcourt Court against the National Chairman, Uche Secondus.\nThe Constitutional section says that in absence of the National Chairman, the Deputy National Chairman South takes over the running of the party."
  },
  {
    "headline": "Bandits Invade Nigerian Defence Academy in Kaduna, Kill Two Officers, Abduct One",
    "summarized_story": "Armed bandits have invaded the Nigerian Defence Academy (NDA), Afaka in northern Kaduna state, killing two officers.\nARISE News is yet to confirm the identity of the officers killed but reports suggest an undisclosed number of officers were also abducted in the raid.\nSources within the barracks said the bandits also abducted two majors.\nOne of the officers who was injured in the attack is currently being treated at a hospital within the barracks.\nThere are however fears, that the bandits may decide to kill the officers in a bid to escape."
  },
  {
    "headline": "THISDAY Launches WhatsApp Edition With Free Delivery to 73m MTN Subscribers",
    "summarized_story": "THISDAY Newspapers has launched a WhatsApp edition to deliver the digital PDF copy of its newspapers to over 73 million MTN subscribers for a free download on the MTN Zigi Chatbot.\nLaunched last year, the MTN Zigi Chatbot, is the telco’s new digital personal assistant that can answer questions, and assist subscribers with products, services, and activations.\nZigi chats in English language and she is available to chat with both existing MTN customers and non-MTN customers as a guest.\nThe Zigi chatbot saves the time of customers waiting for customer care representative to respond to question.\nCommenting about ‘Zigi,’ the Chief Customer Relations Officer, MTN Nigeria, Ugonwa Nwoye, said, “Zigi offers personalised, intuitive and prompt service to our customers."
  },
  {
    "headline": "High Hopes as Zambia Swears in Hakainde Hichilema",
    "summarized_story": "Veteran opposition leader Hakainde Hichilema will be sworn in as the seventh president of Zambia on Tuesday, after getting more than 2.8 million votes to President Edgar Lungu’s 1.8 million votes, achieving one of the biggest electoral wins in the country’s history.\nHichilema, a 59-year old businessman contesting the presidency for the sixth time, promised democratic reforms, investor-friendly economic policies, better debt management as well as “zero tolerance” to corruption.\nZambia recorded economic progress for more than a decade and achieved middle-income status in 2011, but now the country is beset by high inflation, high debt and allegations of corruption.\nLockdown measures pushed Zambia into its first recession since 1998 and the economy contracted by 1.2%, according to the World Bank.\nHowever, fears of a reversal of those gains emerged recently as Lungu closed some media houses and detained critics."
  }
]