[
  {
    "headline": "NGO partners Switzerland, constructs school, borehole in Nasarawa community",
    "summarized_story": "The Government of Switzerland in collaboration with a non-governmental organization, Global Peace Development, have donated three classroom blocks and a solar-powered borehole to the Lafia Local Government Education Authority primary school in Ungwan Galadima 2 community of Nasarawa state.\nThis is in a bid to ensure that pupils of the school have access to quality education and portable water for their daily usage.\nI want to also thank the Embassy of Switzerland for supporting them to achieve this feat.\nWe would ensure that the facilities are maintained so that the community can continue to experience rapid growth”, he said.\nOur Correspondent reports that the district head of Ungwan Galadima 2 community in Lafia and well-wishers from neighboring communities graced the occasion."
  },
  {
    "headline": "Kaduna: 61 kidnapped Baptist Church worshippers regain freedom after 35 days",
    "summarized_story": "After 35 days in captivity, the Kaduna State chapter of the Christian Association of Nigeria has confirmed the release of the remaining 61 kidnapped worshippers of Emmanuel Baptist Church in the Chikun Local Government Area of the state.\nJohn Hayab, who made this known to The PUNCH on Saturday, said nine other victims were also released alongside the 61 worshippers on Friday evening.\nUngwan Gimbiya is located around Sabo area of the state, had witnessed mass exodus of residents from the area following the activities of bandits in the area.\nThe community is few kilometres away from Kakau Daji where over 60 worshippers of Baptist Church were kidnapped on Sunday 31, October, 2021 during church service.\nRead AlsoThe bandits had demanded N99m as ransom for the release of the remaining 61 victims."
  },
  {
    "headline": "Over 80 CSOs hail Buhari’s plans to remove subsidy",
    "summarized_story": "The coalition noted that the subsidy regime was unsustainable, adding that the best way to tackle the problem was to remove subsidies.\nAccording to the communique, the conference, titled: “Fuel Subsidy Removal in Nigeria”, was deliberately chosen in view of the realities of the times.\nThey further recommended that the fuel subsidy regime be stopped from January 2022.\n“In the group discussions, participants were unanimous that Nigeria was the only country in the world that sustained fuel subsidy regime for the past 20 years.\n“The fuel subsidy regime was a capitalist and elitist policy that services only the top-heavy, hence, successive governments found it difficult to implement their economic policies."
  },
  {
    "headline": "No student was turned to yams by ritualist in Ibadan ― Education Commissioner",
    "summarized_story": "There is no iota of truth in the report that two students of Bashorun High School, Ibadan, were on Friday turned to tubers of yam by a suspected ritualist.\nThe Oyo State Commissioner for Education, Mr Abiodun Abdulramah, made this clarification, while addressing students, parents and guardians of the school when he visited the school.\nThe commissioner had visited the school on Friday afternoon, while on a fact-finding mission, following a report on the social media that such incident happened in the school.\nAbdulramah said findings from the school management showed that none of the school students was reported missing.\nThe commissioner admonished the general public to remain patient, saying that the safety of every resident in the state was a priority for the Gov."
  },
  {
    "headline": "Why Nigeria remains most viable, most attractive investment destination in Africa – Buhari",
    "summarized_story": "President Muhammadu BuhariPresident Muhammadu Buhari says Nigeria remains the most viable and attractive investment destination in Africa.\nThe event was organised by the Nigerian-Arabian Gulf Chamber of Commerce in collaboration with Nigeria’s Ministry of Industry, Trade and Investment and the Nigerian Investment Promotion Commission.\nMr Femi Adesina, the president’s spokesman said in a statement that President Buhari said that Nigeria was reaping from his administration’s efforts to consciously improve the country’s environment.\n‘‘Nigeria’s pavilion at the Expo 2020 clearly shows why we remain the most viable and attractive investment destination in Africa.\nHe commended their unwavering commitment to strengthen trade and investment relations between both countries through various initiatives, partnerships and support."
  },
  {
    "headline": "Refrain from actions that worsen your marginalization — Uzodike tells IPOB, Ndigbo",
    "summarized_story": "By Chimaobi Nwaiwu, NnewiForemost industrialist, Chief Dr Ajulu Uzodike, yesterday said that Ndigbo can still do better and live above their obvious marginalization in Nigeria if they refrain from actions that also worsen their marginalization by the Federal government of Nigeria.\nHe said that while it is clear that the Federal government of Nigeria has continued the obvious marginalization of Ndigbo in Nigeria, the Igbo’s should be blamed for some actions that have worsened their marginalization because of the selfishness of the present and past leaders whose only target is the largesse from Federal government.\nAlthough the cause IPOB is fighting for is right but the action they are taking will worsen the situation Ndigbo already found themselves in Nigeria.\nThis IPOB style of civil disobedience where South East is constantly locked down and people made to sit-at-home will worsen the situation of Ndigbo who are already marginalized.\nAnybody who is attacking that Igbos means of livelihood, ostensibly is fighting the rest of the people and it is very wrong."
  },
  {
    "headline": "Kaduna: 521,096 enrol in health insurance scheme amid cry of inadequate hospital bed space, doctors",
    "summarized_story": "This is coming as the Kaduna Contributory Health Management Authority (KADCHMA) announced that 521,096 persons in the state have enrolled in the health insurance scheme.\nHe took time to explain to her in the Hausa language, at the end of which she expressed with delight that she now knew about the Basic Health Care Provision Fund, and other related information.\nAlso, the need to sensitize the health workers at the SHF on the Kaduna state contributory health scheme (KSCHS)/BHCPF.\nAccording to him, 8,292 were captured under the Tertiary Students Health Insurance Programme and 45,529 under the Basic Health Care Provision Fund (BHCPF).\nJoseph Jockshan, BHCPF Focal Person, Kaduna State Primary Health Care Development Board, said the BHCPF was established under Section 11 of the National Health Act, 2014."
  },
  {
    "headline": "Kabiru Babai: Youth council condemns incessant police brutality, killing in Osun",
    "summarized_story": "The Chairman National Youth Council of Nigeria (NYCN) Osun chapter, Comrade Ismail Abdulazeez has condemned the killing of a borehole drilling truck driver, Kabiru Babai in Osogbo by a yet to be identified police officer.\nThis is as he condemned the incessant harassment and killing of civilians by men of the Nigeria police in the State.\nHe was brutalized before he was shot dead in the chest at the Ota-Efun area Osogbo.\nAccording to him, “it is saddening that Police still continue to operate unethically despite the challenges and outcome of last year EndARS.\nNo, but Police have decided to remain, act unruly and instead to uphold and enforcing law, they are becoming offenders."
  },
  {
    "headline": "‘Nigerians are not happy’ – Sanwo-Olu’s representative booed at ‘The Experience’ [VIDEO]",
    "summarized_story": "A Lagos State government representative was on Friday booed at the Experience, a programme l at the House of the Rock Cathedral, Lekki.\nThe atmosphere changed in the church when Governor Babajide Sanwo-Olu’s representative was invited to speak to the crowd at the event.\nThis may be connected to the displeasure of Lagosians and youths concerning the End SARS Panel report.\nHere are some reactions from Nigerians after Sanwo-Olu’s representative was booed on stage:@OfficialArole “ You booed someone in the presence of God.\nFantastic, the people are not happy with Lagos state leadership and the handwriting is clear!”@CitizenOla “I love the attitude of Nigerians against Sanwo-Olu and his representative in the ongoing #TheExperience2021."
  },
  {
    "headline": "Osun has no economy – Ex-Reps member, Lasun Yusuff",
    "summarized_story": "A former Deputy Speaker of the House of Representatives, Lasun Yusuff has declared that there is no economy yet in Osun State.\nHe promised to transform the State to a trillion Naira economy under eight years if given the chance and elected as governor.\nYusuff, in a radio programme monitored in Osogbo on Friday, stated that he has what it would take to create an economy for the State.\nAccording to him, “I will create an economy that the people will live on.\n“I have what it takes to create an economy for the state and since I want to be governor, I will create and transform Osun economy in a timeline of four years."
  },
  {
    "headline": "Why telecommunication network has not been restored in Zamfara – State govt",
    "summarized_story": "Zamfara State government has finaly given reasons it has not restored telecommunication networks in the rural areas even after the Governor has assured on the restoration.\nDAILY POST had reported that the telecommunication networks would be restored on Monday or Tuesday this week.\nIbrahim Magaji Dosara in a press statement, gave the reasons for the not restoring the telecommunication networks.\n“The request for the restoration from the Minister of Communications and NCC will not restore the telecommunication networks without the security reports and other bureaucratic procedures involved.\n“In the same vein, security situation reports from various communities and local government areas are being compiled for onward submission to the Hon."
  },
  {
    "headline": "Ogun former Speaker resigns from Abiodun govt",
    "summarized_story": "Less than three weeks after the former Attorney General and Commissioner for Justice in Ogun State, Akingbolahan Adeniran, left the cabinet of Governor Dapo Abiodun, another appointee has resigned.\nDAILY POST reports that a former Speaker of the Ogun State House of Assembly from 1999 to 2003, Hon.\n“I further thank you for the opportunity given me to continue in the service of Ogun State which I started way back in 1999 as the Speaker of the State House of Assembly.\nBefore turning in his resignation letter, Oladipo had recently met with leaders of the Amosun group in Sagamu Local Government, declaring his loyalty to the Ogun Central Senator.\nThere is nothing strange in going back to where you left.”Meanwhile, the Ogun State Government has confirmed the receipt of Oladipo’s resignation letter."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "We’ll hold Orji Kalu responsible if anything happens to Kanu -IPOB",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has raised alarm over the life of its detained leader, Mazi Nnamdi Kanu following what it termed unsolicited visit of former Abia Governor, Sen. Orji Uzor Kalu to him at the DSS custody.\n“We don’t know the mission of Orji Uzor Kalu over the visits and we are worried.\nWe therefore, wish to put the world on notice that Orji Uzor Kalu will be held responsible for whatever happens to our leader Mazi Nnamdi KANU in detention.\n“We are not comfortable with Orji Uzor Kalu’s suspicious visits to our leader.\nWe all knew that Orji Uzor Kalu’s name is among those who bankrolled and sponsored the extraordinary rendition of Mazi Nnamdi Kanu from Kenya to Nigeria.”"
  },
  {
    "headline": "Only gullible women fall for men’s lies, says Ese Eriata",
    "summarized_story": "FOR Nollywood actress, Ese Eriata, only gullible women will fall for men’s lies.\nEriata disclosed in a long post how women fall into the wrong hands all in the name of love.\n- Advertisement -She continues; “I’m speaking on behalf of all the gullible women who always believe what comes out from your mouth.\n“If you want to play your games, avoid sensitive women who are looking for true love, why does it always interest you to toy with women who are looking for true love and happiness.\n“And for you sensitive women, avoid the kind of guys you like because it’s looking like good girls like bad boys!"
  },
  {
    "headline": "Sanwo-Olu: White Paper more than walk in the park",
    "summarized_story": "Sanwoolu commended the panel and immediately set up a four-man committee to produce the White Paper of the report for the state to act on.\nAnd as the wait for the White Paper continued, there were fears that the fierce exchanges could ignite a fresh fire in Lagos.\nAlso throwing his weight behind the White Paper, counsel to Lagos State Government, Abiodun Owonikoko praised the White paper saying it mitigated the weakness of the original report.\nOwonikoko said: “The White Paper cannot but be controversial even with the obvious pain taken by the government to provide context to it.\nSimilarly, the Federal Government threw its weight behind the white paper, promising to take further actions."
  },
  {
    "headline": "Electoral Bill: Buhari is still consulting, hasn’t declined assent – Presidency",
    "summarized_story": "“There is no truth in the story that President Muhammadu Buhari has declined signature on the bill,” Shehu said.\nSani in a statement in Abuja said President Buhari should not bow to pressure from the governors not to sign the electoral bill.\nThe governors are especially against the recommendation of direct primary as the mode of picking candidates by the parties for elective offices.\n“As regards the costs of direct primary bandied about to scare Mr President from assenting the Electoral Amendment Bill, one wonders the wisdom.\nThe President should assent the Bill for the larger interest of multiparty democracy and, thus, for national interest.”Civil societies to Buhari: Sign Electoral Bill into lawSeveral Civil Society Organisations (CSOs) have asked President Muhammadu Buhari to sign the contentious Electoral Act Amendment Bill before him into law."
  },
  {
    "headline": "2023: S’West APC govs begin consultations",
    "summarized_story": "We are talking about South West.\nWe are here for one agenda, which is we want Yoruba to be president of Nigeria in 2023.\nIn the last eight years, APC has been in the saddle and we are looking for a better leadership and we hope, we know and we pray that APC from South West will provide that better leadership.\nThat is why we try to ensure that it is not negotiable, as far as we are concerned, that presidency comes to the South West.\nIt was agreed at the end of the meeting that the gathering would be rotated among the six states in the South West."
  },
  {
    "headline": "How to secure Kanu’s freedom-Ahamba",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMouma maintained that political solution remains the best option in solving the Kanu issue.\n“The AGF is sadly out of his depth in political maneuvers and goes from one blunder to another.\nIt is unlikely his advice will hold sway on a political solution.\nInsisting on political solution as the best option to solve the festering problem in the South-East, he demanded the unconditional release of Kanu, Yoruba Nation activist, Sunday Igboho and other political prisoners."
  },
  {
    "headline": "It’s wrong to politicise Bayelsa oil spillage – Yusuf, Arewa youth leader",
    "summarized_story": "The firm, he said, “has since mobilised to ground zero and has fully deployed measures to contain the leak including an effective fast-track spill recovery programme.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nDespite efforts by Aiteo to professionally contain the spill in Nembe, some see this incident as an opportunity to attack the company.\nSome interests are even, curiously, putting out old spill videos to create a negative false impression of the extent incident.\nLatest Jobs in Nigeria (Graduates/Non-graduates)."
  },
  {
    "headline": "Omicron variant: FG releases new Int’l travel guidelines",
    "summarized_story": "The full statement reads: Revised International Travel Protocol.\n“The Presidential Steering Committee on COVID-19 has reviewed the International Travel Protocol of 22nd October 2021.\nCOVID-19 PCR test to be done within 48hrs before departure; 2.\nPost-arrival Day 2 COVID-19 PCR test; 3.\nDay 7 post-arrival exit PCR test (for unvaccinated and partially vaccinated individuals) “Out-bound Passengers: All out-bound Passengers are required to provide either of the following documentation; 1."
  },
  {
    "headline": "Charles Mba, CEO, CDV Group at 50: Impacting people’s lives",
    "summarized_story": "Chief Charles Ndubuisi Mba, (CEO) of CDV Group, is the brain behind CDV Properties & Development Ltd, a frontline real estate firm with properties spread across Nigeria.\nThe construction magnate behind 34V Engineering Limited, Chief Mba hails from Orba in Udenu Local Government Area of Enugu State.\nYou see, where I grew up from, when we were growing up, I saw all those things that confronted people.\nYou have just clocked 50 today.\nSo, I appeal to the youths of today to stay off drugs and be committed to whatever they are doing."
  },
  {
    "headline": "At Dubai Expo 2020, Buhari Tasks World Leaders on Partnership to Stem COVID-19",
    "summarized_story": "On the same day, amid the raging Omicron COVID-19 variant in Southern Africa and some other parts of the world, the federal government unveiled a revised COVID-19 protocol, without restricting inbound travellers from any country.\nBuhari, while addressing the global audience at Dubai Expo 2020, said: “The concerted efforts by world leaders, working together, enabled us to limit the catastrophic consequences of this pandemic.\nFG Refuses to Restrict Inbound Travellers over OmicronNotwithstanding the raging Omicron COVID-19 variant in Southern Africa and some other parts of the world, the federal government yesterday unveiled a revised COVID-19 protocol, without restricting inbound travellers from any country.\nFG Approves Booster DoseThe federal government has formally endorsed the administration of booster dose of the COVID19 vaccine for Nigerians.\nAccording to the DG, NPHCDA, Faisal Shuaib, a COVID-19 booster dose gives greater protection against the virus and urged all Nigerians to take advantage of the opportunity offered by the federal government."
  },
  {
    "headline": "ARISE Fashion Week Lights up Dubai with Spectacular Runway, Music",
    "summarized_story": "President hails show for showcasing Nigeria’s style, arts to the worldVanessa ObiohaARISE Fashion Week (AFW) yesterday got global attention by adding splendour to the city of Dubai, United Arab Emirates, with spectacular runway and music.\nFashion designers like Lisa Folawiyo, Lanre Da Silva Ajayi, Kenneth Ize, Onalaja, Ziva Lagos and Hudayya showcased dynamic creativity that celebrated the vibrancy of Nigerian fashion.\nPresident Buhari commended the organisers of the ARISE Fashion Week for showcasing Nigeria’s fashion and arts to the world, while describing his as a listening government that would ensure justice and equity for all Nigerians.\n“I’m very glad to be here to witness another landmark achievement for the country: the first ARISE Fashion Week in Dubai.\nHe further stressed that so far, about USD5 billion had been disbursed to support the creative industry initiatives in fashion, film, music and television."
  },
  {
    "headline": "ISWAP Attacks Military in Rann, Malam Fatori, 2 Senior Officers Killed",
    "summarized_story": "About 24 hours after the attack in Rann, Boko Haram also attacked Malam Fatori in Abadam Local Government Area, Borno State.\nNigerian troops killed 20 ISWAP fighters in battle at Rann.\nMalam Fatori Also AttackedMeanwhile, Boko Haram also attacked Malam Fatori, Abadam Local Goverment Area, Borno State yesterday.\nMalam Fatori is one of the two LGAs without human activities, where Governor Babagana Zulum had insisted on returning displaced persons by December 31.\nArmy spokesman, Onyema Nwachukwu was not immediately available to comment on the terror attacks in Rann and Malam Fatori."
  },
  {
    "headline": "Lagos Shuts Dowen College over Student’s Death",
    "summarized_story": "The Lagos State Government has ordered the indefinite closure of Dowen College, Lekki, over the death of Sylvester Oromoni Jnr., a student of the school.\nMrs Folashade Adefisayo, Commissioner for Education, in a statement on Friday, announced the closure after a meeting with the school management and staff.\nAdefisayo said that the closure was pending the outcome of an investigation into the death of the student.\nShe called for calm, saying that no effort would be spared in getting to the root of the incident.\nReports alleging that the 12-year-old boy died mysteriously after he was tortured for refusing to join a cult group had been debunked the by the school."
  },
  {
    "headline": "In Dubai, Buhari Commends ARISE Fashion Week for Showcasing Nigeria",
    "summarized_story": "By Vanessa Obioha in Dubai, UAEVisiting Dubai for the World Expo 2020, President Muhammadu Buhari Friday, commended organisers of the ARISE Fashion Week for showcasing Nigeria’s fashion and arts to the world while describing his administration as a listening government that will ensure justice and equity for all Nigerians.\nThe president, represented by the Minister of Industry, Trade and Investment Otunba Niyi Adebayo, said that by hosting AFW in Dubai, the organisers were showcasing Nigerian fashion to the world.\n“I’m very glad to be here to witness another landmark achievement for the country: the first ARISE Fashion Week in Dubai.\nWe are here to celebrate the birth of Nigerian culture as we unleash the power of youth for a new positive image for Nigeria.\nHe recognised that the entertainment industry is a major factor for the country to be recognised globally."
  },
  {
    "headline": "Representative Of Lagos Governor, Sanwo-Olu, Booed At ‘Experience’ Concert Days After Release Of White Paper Denying Lekki Toll Gate Massacre",
    "summarized_story": "A representative of Lagos State governor, Mr Babajide Sanwo-Olu, was on Friday night booed by participants at this year’s ‘Experience’ concert organised by the House on the Rock Church.\nFriday’s event came days after the Lagos State governor denied the killing of peaceful protesters at the Lekki Toll Gate by military personnel and policemen on October 20, 2020.\nThe panel report urged the Lagos Government and other relevant authorities to punish all those involved in the killing of innocent protesters.\nIn the White Paper, the Lagos State Government described the claim of the panel that nine persons were shot dead as “assumptions and speculations”.\nThe Federal Government has since backed Sanwo-Olu’s administration into claiming that there was no massacre at the Lekki Toll Gate on October 20, 2020."
  },
  {
    "headline": "Representative Of Lagos Governor, Sanwo-Olu, Booed At ‘Experience’ Concert Days After Release Of White Paper Denying Lekki Toll Gate Massacre",
    "summarized_story": "A representative of Lagos State governor, Mr Babajide Sanwo-Olu, was on Friday night booed by participants at this year’s ‘Experience’ concert organised by the House on the Rock Church.\nFriday’s event came days after the Lagos State governor denied the killing of peaceful protesters at the Lekki Toll Gate by military personnel and policemen on October 20, 2020.\nThe panel report urged the Lagos Government and other relevant authorities to punish all those involved in the killing of innocent protesters.\nIn the White Paper, the Lagos State Government described the claim of the panel that nine persons were shot dead as “assumptions and speculations”.\nThe Federal Government has since backed Sanwo-Olu’s administration into claiming that there was no massacre at the Lekki Toll Gate on October 20, 2020."
  },
  {
    "headline": "Representative Of Lagos Governor, Sanwo-Olu, Booed At ‘Experience’ Concert Days After Release Of White Paper Denying Lekki Toll Gate Massacre",
    "summarized_story": "A representative of Lagos State governor, Mr Babajide Sanwo-Olu, was on Friday night booed by participants at this year’s ‘Experience’ concert organised by the House on the Rock Church.\nFriday’s event came days after the Lagos State governor denied the killing of peaceful protesters at the Lekki Toll Gate by military personnel and policemen on October 20, 2020.\nThe panel report urged the Lagos Government and other relevant authorities to punish all those involved in the killing of innocent protesters.\nIn the White Paper, the Lagos State Government described the claim of the panel that nine persons were shot dead as “assumptions and speculations”.\nThe Federal Government has since backed Sanwo-Olu’s administration into claiming that there was no massacre at the Lekki Toll Gate on October 20, 2020."
  },
  {
    "headline": "How MTN Wrongly Interpreted Nigerian Communications Act To Block Peoples Gazette Website As Directed By Buhari Regime",
    "summarized_story": "What MTN Nigeria Communications Plc relied on to block its subscribers from accessing the Peoples Gazette website is in Section 146 of the Act.\nBut no one has found Peoples Gazette guilty of committing any crime in Nigeria,” a source told SaharaReporters.\nIn a letter addressed to the Peoples Gazette by MTN's lawyers, it was stated that the directive to block access to the site was pursuant to a directive from the Nigerian Communications Commission in January 2021.\nIt reads, “We acknowledge receipt of your letter dated 20 October 2021 requesting MTN Nigeria Communications Plc (MTNN) to lift the restrictions barring the website of People Gazette www.peoplesgazette.com from gaining access on the MTN Network.\n“The NCC under President Muhammadu Buhari conducted its blocking of Peoples Gazette’s website entirely in secret and in the manner consistent with cyber-hackers."
  },
  {
    "headline": "How MTN Wrongly Interpreted Nigerian Communications Act To Block Peoples Gazette Website As Directed By Buhari Regime",
    "summarized_story": "What MTN Nigeria Communications Plc relied on to block its subscribers from accessing the Peoples Gazette website is in Section 146 of the Act.\nBut no one has found Peoples Gazette guilty of committing any crime in Nigeria,” a source told SaharaReporters.\nIn a letter addressed to the Peoples Gazette by MTN's lawyers, it was stated that the directive to block access to the site was pursuant to a directive from the Nigerian Communications Commission in January 2021.\nIt reads, “We acknowledge receipt of your letter dated 20 October 2021 requesting MTN Nigeria Communications Plc (MTNN) to lift the restrictions barring the website of People Gazette www.peoplesgazette.com from gaining access on the MTN Network.\n“The NCC under President Muhammadu Buhari conducted its blocking of Peoples Gazette’s website entirely in secret and in the manner consistent with cyber-hackers."
  },
  {
    "headline": "Okowa: Those behind death of Dowen College student must be punished",
    "summarized_story": "Ifeanyi Okowa, governor of Delta, has reacted to the death of Sylvester Oromoni Jnr, the 12-year-old student of Dowen College in Lekki, Lagos.\nAdvertisementThe student was alleged to have been attacked by “some senior colleagues” for refusing to join a cult group.\nIn a Facebook post on Saturday, Okowa vowed that his administration will ensure the student, who is from Warri south LGA in Delta, gets justice.\n“Last night, I spoke to Mr. Sylvester Oromoni, the father of late Sylvester Oromoni Jr., the Dowen College student who unfortunately died under very controversial and unclear circumstances,” he wrote.\n“During the call, I expressed my agreement with the decision of the Lagos State government to launch an investigation into the death of Sylvester, a native of Warri South LGA in Delta State."
  },
  {
    "headline": "Dowen College shuts down as family moves to protest student’s death",
    "summarized_story": "Dowen College in Lagos has shut down temporarily over the controversy surrounding the death of Sylvester Oromoni.\nThe student’s father, who bears the same name as his son, told TheCable Lifestyle that the claims surrounding his death were “true”.\nIn an email release sent to parents of the students on Friday, Dowen College announced a two-day shutdown.\nAdvertisement“This will also afford the students the opportunity to revise for their forthcoming examinations starting next week.”A source in the know of the development also told TheCable Lifestyle that the bereaved family is mobilising for protest.\nIn Dowen College’s response to the student’s demise, it had debunked claims about bullying and cultism in the school."
  },
  {
    "headline": "‘Justice must be served’ — death of Dowen College student sparks outrage",
    "summarized_story": "The death of Sylvester Oromoni, the 12-year-old pupil of Dowen College in Lagos, has begun to generate outrage on Twitter.\nAdvertisementThe late student, fondly called Junior, was earlier rumoured to have been brutally beaten to death for refusing to join a cult group in the school.\n#JusticeForSylvester#ShutDowndowen — Your Favourite Sugar Girl💕💕 (@The_sugargirl) December 2, 2021Innocent boy was killed at school, the school is covering the murderers, our government are protecting the school.\nPlease keep sharing until Justice is SERVED and Dowen college answer for their negligence!!!\nOnly slyvester knows — lady of lagos (@_weyimi) December 3, 2021Dowen College should do a proper investigation about what happened to Sylvester.#Justiceforsylvester — Mindset🗝️ (@Mindset_tweet) December 3, 2021This boy didn’t deserve to die."
  },
  {
    "headline": "DOWNLOAD: White Money drops ‘Selense’ — first song after BBNaija",
    "summarized_story": "White Money, the 2021 BBNaija winner, has come through with ‘Selense’, his first song after the reality show.\nAdvertisementThe reality star announced the release of the track and it’s visuals via his social media pages on Friday.\nAccompanied by a colourful video, ‘Selense’ makes use of cutaways from events before, during and after his stint at the BBNaija ‘Shine Ya Eye’ house.\nAdvertisementOn November 20, Ifeanyi Ugwuanyi, governor of Enugu, named the 29-year-old reality star as the state’s ambassador for creative arts.\nDOWNLOAD: ‘SELENSE’ BY WHITE MONEYCopyright 2021 TheCable."
  },
  {
    "headline": "BBNaija's Khloe hits Dowen College over Oromoni's death",
    "summarized_story": "Abiri Oluwabusayomi, former Big Brother Naija (BBNaija) housemate better known as Khloe, has accused Dowen College in Lagos of raising “uncouth” students.\nAdvertisementThe school situated in Lekki has been in the public eye in recent days over the death of Sylvester Oromoni Jnr, a 12-year-old student.\nThe student was alleged to have been attacked by “some senior colleagues” for refusing to join a cult group.\nKhloe also demanded that the school be accountable for the death of the teenager.\n“I had to ask for her teacher, to speak to her teacher for permission but nobody stopped me."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "Herconomy raised $600,000 in a day. Here's how they did it",
    "summarized_story": "The book was a culmination of all the opportunities Durosinmi-Etti had been sharing on her personal Instagram profile for months.\n“I just wanted to create a place where women could get access to opportunities, grants and fellowships,” Durosinmi-Etti told TechCabal in an interview.\nThe startup plans to introduce financial services to its community members which it believes will be of great benefit to them.\nWithin a day, as Durosinmi-Etti explains, she got “hundreds of responses” from community members who were interested in investing.\nThey did this because it was extremely important for their community members to be part of this raise."
  },
  {
    "headline": "Nigeria’s Payourse secures $600k pre-seed to accelerate crypto adoption across Africa",
    "summarized_story": "But as good as this may sound, navigating through most of the available crypto products still feels like Chinese arithmetic to many Africans.\nAnd this experience is shutting out a large number of Africans from the crypto economy, thereby hindering even wider adoption.\nOne of them, Payourse, a Lagos-based blockchain startup that builds user-friendly products and tools to accelerate the adoption of crypto in Africa, has secured a $600,000 pre-seed investment to scale its products, hire more talent and expand into new markets.\nBut because of its seamless experience, Coinprofile began to gain traction among crypto users.\nUnlike other companies that charge fees on every transaction, Coinprofile doesn’t charge users on a transaction."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 tech innovations that can make life easy for physically challenged Africans",
    "summarized_story": "However, the World Health Organisation (WHO) puts the number of people living with disabilities at 300 million.\nThe UN also affirms that most Africans living with disabilities are excluded from school and work opportunities.\nIn celebration of the International Day of the Disabled, we are looking at four tech innovations that could help people living with disabilities globally.\nRecalling when a group of visually impaired persons was testing the Eone, Kim was asked if the watch was made specifically for the blind.\nMore attention needs to be paid to assistive tech but, more importantly, persons with disabilities."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Payourse’s $600k pre-seed, Herconomy’s 24hr funding and Octamile’s $500k pre-seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Payourse’s $600k pre-seed$600k pre-seed by HerconomyWorld AIDS DayOctamile’s $500k pre-seedOfferZen’s $5.1m Series APayourse’s $600k pre-seedL-R Payourse Co-founders, Bashir Aminuy and John Anisere.\nAdvertisementFive years later, Payourse — the brainchild of Aminu, Hakeem Oyewole, and John Anisere — has announced the raise of a $600k pre-seed to build the next crypto powerhouse.\nYou can read it here: Nigeria-based blockchain startup, Payourse raises $600k pre-seed to build a Web3 powerhouseHerconomy bags $600k pre-seedHerconomy TeamHerconomy is a startup that empowers women by offering them capacity building, jobs, networking, and financial services.\nOn Wednesday, December 1, 2021, the startup announced a $600,000 pre-seed raise, led by members of the Herconomy community.\nOctamile raises $500k pre-seedOctamile Founder, Gbenro DaraOctamile, an African insurtech startup, has closed a $500,000 pre-seed round to simplify access to insurance for Africans."
  },
  {
    "headline": "Nigeria to begin rollout of COVID-19 booster shots December 10",
    "summarized_story": "Nigeria will begin the much-awaited administration of COVID-19 vaccine booster shots December 10 as Africa’s most populous nation moves to speed up one of the continent’s slowest vaccine rollout exercise ahead of a likely fourth wave.\nRead Also: Nigeria considers offering covid booster jabs in bid to beat virusIn a statement released Friday, Faisal Shuaib, the executive director, NPHCDA said the eligibility criteria for taking the booster dose includes being age 18 and above.\nHe urged all Nigerians to take advantage of the opportunity offered by the Federal Government of Nigeria.\nSome 6,887,362 eligible Nigerians, representing 6.2 percent of the population, have received their first doses of the vaccine, according to the NPHCDA.\nMeanwhile, 3,720,695 Nigerians, representing 3.3 percent of the population, have been fully vaccinated as of December 2."
  },
  {
    "headline": "Why Nigeria will struggle to meet OPEC’s production quota",
    "summarized_story": "“Some Nigeria assets may be under-invested, resulting in potential upside opportunities”.\n“Despite the profitability of their Nigeria assets, the IOCs are under increased pressure to accelerate their energy transition and divest non-core assets,” Wood & Mackenzie said.\n“Many indigenous operators are sitting on significant resources, with opportunities to grow production with access to capital investment,” Wood & Mackenzie added.\n“Nigeria’s oil production is currently struggling at levels never seen before, but the regulators are ignoring the problem and disguising under OPEC’s quota,” Charles Akinbobola, energy analyst at Lagos-based Sofidam Capital, says.\nAlso, a new wave of security threats in Nigeria has emerged that could further dent Nigeria’s production."
  },
  {
    "headline": "BUA Group set to list food businesses on Nigerian Exchange",
    "summarized_story": "BUA Group, Nigeria’s leading foods, infrastructure, mining and manufacturing conglomerate is at the verge of completing the processes to list the shares of its Food businesses –Flour & Pasta, Sugar, Edible Oils, and Rice –on the Nigerian Exchange Limited (NGX).\nWe believed in the capacity of the Nigerian capital market to handle those transactions regardless of the economic headwinds.\nAll the sugar and allied investments of BUA Group are set up to take advantage of the entire sugar production value chain.\nBUA Group has also acquired about 70,000ha of land in both locations for the purpose of setting up large-scale sugar plantations.\nIn 2001, BUA Group acquired Nigeria Oil Mills Limited which was established in 1951."
  },
  {
    "headline": "Int’l Day of Persons with Disabilities: Obaseki pledges inclusion, assures equal access to health, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said his administration will sustain efforts at ensuring a level playing ground for persons with disabilities to thrive and realize their fullest potentials, ensuring inclusive and equal access to health services, education and employment opportunities, among others.\nThe governor said this in commemoration of this year’s International Day of Persons with Disabilities, with the theme, “Leadership and participation of persons with disabilities toward an inclusive, accessible, and sustainable post-COVID-19 world.”He reassured that the government will continue to implement policies that provide sustainable structures and reforms that guarantee persons with disabilities a better chance of expression, economic empowerment, and self-fulfillment.\nAccording to him, “As we commemorate the International Day of Persons with Disabilities, it is imperative to reassure that my administration will sustain programmes and policies to ensure that persons with disabilities in the state realize their fullest potentials, ensuring inclusive and equal access to health services, education and employment opportunities, among others.\n“This year’s commemoration presents yet another opportunity to engage, interact, interface and hold genuine conversations to fashion pragmatic policies that impact the community of persons living with disability in our state.”The governor further noted, “In the last five years, we have demonstrated strong commitments to ensuring persons with disabilities are carried along in the formulation and implementation of government policies and programmes, and will continue to implement policies that provide sustainable structures and reforms that guarantee persons with disabilities better chance for expression, economic empowerment, and self-fulfillment.”“We are also collaborating with other stakeholders including rights groups in building a society where persons with disabilities will live life to the fullest, supported with policies, laws and other social and economic enablement required to assist them to achieve their aspirations.”Reassuring the government’s commitment to the welfare and wellbeing of persons with disabilities, he continued: “We have demonstrated our keen support for persons with disabilities during previous recruitment exercises in the state by ensuring a sizable number of persons with disabilities are given equal opportunity for employment.\n“Other practical initiatives that have been taken by this administration to further demonstrate inclusiveness and participation of persons with disabilities include the implementation of the amended Violence Against Persons (VAP) Law, which aims at eliminating violence against vulnerable persons and groups in private and public life, and provides maximum protection and effective remedies for victims.”..."
  },
  {
    "headline": "Edo arrests three illegal revenue collectors in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Joint Security Operation, Wabaizigan and officials of the state’s Public Works Volunteers (PUWOV) have arrested three suspected illegal revenue collectors in Benin City, the Edo State capital.\nAccording to him, “PUWOV officials have apprehended one Friday Imade, a suspected illegal revenue collector, who has been extorting residents along Airport Road axis in Benin City.\n“In the same vein, the state’s joint security operation, Wabaizigan arrested two other illegal revenue collectors along Oba Market Road, who were illegally selling tickets and extorting unsuspecting traders.\nThe suspects have been handed over to the Police for further investigation and prosecution.”Noting the government’s efforts at ending all forms of extortion and multiple taxations across the state, the PUWOV coordinator said, “The Edo State Government is committed to apprehending all illegal ticket racketeers and other illegal revenue collectors.\nGovernor Obaseki is very involved and will never support oppression or exploitation of Edo citizens.”..."
  },
  {
    "headline": "Obaseki boosts economic activity in varsity community with completion of 4.86km Ekosodin road – Nigerian Observer",
    "summarized_story": "The adjoining streets include Ehigeagba, Osanidowonyi, Boundary and Edo Streets, as well as Main Ekosodin road and Newton Road.\nIn a statement after an inspection tour of the newly completed road project, the Commission’s Chairman, Pastor Kennedy Osifo said all is now set for the commissioning of the project.\nHe noted that before the road was constructed, motorists using the road had to bear the pain of taking their cars to the mechanic on a daily basis, which cost them a lot.\nResidents of the community, including tricycle riders, students, pedestrians and motorists were filled with joy and expressed their excitement on the current shape of the road.\nThey commended Obaseki for coming to their rescue, stressing that the road was in a terrible condition and residents had to leave the environment because the roads deteriorated and became impassable."
  },
  {
    "headline": "Edo communities laments continued blackout – Nigerian Observer",
    "summarized_story": "The Nigerian Observer learnt that, the system, coupled with clearing of unpaid electricity bills amounting to millions of Naira ‘owed’ BEDC were conditions the company handed the affected communities before it can restore power and commence services in the area.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Isua, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, Igbanke, among others have been without electricity for more than five years.\n“No banks, no major businesses, just POS stands everywhere; and without electricity nobody will be serious to come here and invest.\nBarely two months after installation, vandals took advantage of poor security arrangement in the area to steal armoured cables from the yet-to-be powered transformer.\nConsequently, a representative of Orhionmwon local government at the commission, Charles Aideyan assured that contractor handling the project has been mandated to replace the stolen equipment."
  },
  {
    "headline": "Armed herdsmen destroy IYM founder, Elliot Uko’s farm in Enugu",
    "summarized_story": "Armed herders on Friday, invaded the farm of Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement (IYM) at Nike, Enugu State, destroying crops, killing chicken in what seemed to be a premeditated attack.\nThe herders, witnesses said, broke into the fenced settlement which houses crops and poultry farms, killed some chickens and led cows to eat up vegetables before leaving.\nNarrating the incident to our correspondent who contacted him on Friday evening, Uko said the herders ruined everything on the farm before leaving in the morning hours of the day.\nAccording him, “Armed Fulani herdsmen deliberately breached my fence by breaking down the wall, led their cattle right into my poultry Farm, violated my Farm, and destroyed all they could.\n“My Farm, established 2009, twelve years ago, is located at Ugwuomu Nike."
  },
  {
    "headline": "2023: Anyim consults with Babangida, Abdulsalami over presidential aspiration",
    "summarized_story": "Nigeria’s former senate president and a leading aspirant for president ahead of the 2023 presidential election, Anyim Pius Anyim, has consulted with elder statesmen and former heads of state, General Ibrahim Babangida (rtd) and General Abdulsalami Abubakar (rtd) over his presidential ambition.\n“Today, I was received in a private audience by two of our nation’s esteemed leaders and patriots.\nI met with former President Ibrahim Babangida and former Head of State, General Abdulsalami Abubarkar,” he wrote.\n“I consulted with them on my intention to contest for the presidency of our beloved country.\n“Such calls resurfaced in the early part of 2021 and I chose to be quiet over the issue."
  },
  {
    "headline": "AI-Powered LG ThinQ Enriching Smart Home Experience",
    "summarized_story": "The fact that the LG ThinQ app has been downloaded over a million times is proof that there is an audience that’s hungry for the conveniences offered by smart products.\nLG Magic Remote not only controls your TV but your other LG-connected devices too, and one can complete their smart adaptive viewing experience with voice-responsive LG smart audio devices like LG Soundbar AI ThinQ which supply immersive sound that changes settings according to content”, he explained.\nWith just a simple voice request, LG AI TVs make suggestions suited to your preference such as movies, programs or music.\nAccording to the LG ThinQ 2021 Smart Home Report, the largest group of smart homeowners say saving energy is the greatest benefit of owning a smart home.\nThe advantages of AI technologies like LG ThinQ will undoubtedly enable humans to live better and smarter lives."
  },
  {
    "headline": "250 Women Graduate from U.S. Consulate Academy for Women Entrepreneurs",
    "summarized_story": "A diverse group of 250 women on Friday graduated from the 3rd cohort of the Academy for Women Entrepreneurs (AWE), a U.S. government initiative that supports women entrepreneurs around the world.\nDesigned to cultivate entrepreneurial know-how, AWE helps women entrepreneurs connect with funding opportunities, enhance opportunities for business expansion, and increase the likelihood of entrepreneurial success.\nThe AWE participants come from a range of backgrounds and levels of business expertise.\nThe benefits of the AWE initiative will continue long after the program ends, as the participants apply skills learned to their own businesses and become part of a robust network of women business leaders.\nThis year’s participants included 50 repatriated irregular migrants who are in various stages of building their businesses."
  },
  {
    "headline": "World Soil Day: Experts Warn Against Soil Salinity",
    "summarized_story": "As Nigeria join the rest of the world to observe this year’s World Soil Day, experts in the agricultural sector have warned against practices that salinate the soil and deplete its productivity.\nThey gave the warning during the 2021 World Soil Day celebration in Abuja on Saturday.\nMinister of agriculture and rural development, Dr. Mohammad Mahmood Abubakar, said Nigerians must halt soil salinisation in order to boost soil productivity especially in the dry regions of the country.\nADVERTISEMENTSpeaking on this year’s theme, “Halt Soil Salinisation, Boost Soil Productivity”, chairman of the House of Representatives Committee on Agric, Colleges & Institutions, Hon.\nDan-Agundi stressed the need to sensitise stakeholders on the importance of halting soil salinisation."
  },
  {
    "headline": "World Soil Day: Experts Warn Against Soil Salinity",
    "summarized_story": "As Nigeria join the rest of the world to observe this year’s World Soil Day, experts in the agricultural sector have warned against practices that salinate the soil and deplete its productivity.\nThey gave the warning during the 2021 World Soil Day celebration in Abuja on Saturday.\nMinister of agriculture and rural development, Dr. Mohammad Mahmood Abubakar, said Nigerians must halt soil salinisation in order to boost soil productivity especially in the dry regions of the country.\nADVERTISEMENTSpeaking on this year’s theme, “Halt Soil Salinisation, Boost Soil Productivity”, chairman of the House of Representatives Committee on Agric, Colleges & Institutions, Hon.\nDan-Agundi stressed the need to sensitise stakeholders on the importance of halting soil salinisation."
  },
  {
    "headline": "28 Bag First Class At Al-Hikmah University’s 11th Convocation",
    "summarized_story": "Al-Hikmah University, Ilorin, Kwara State, on Saturday, graduated a total of 1,079 students with 28 of them bagging first class degree honours.\nSpeaking at the 11th convocation, the vice chancellor of the university, Prof. Noah Yusuf, said the university was growing in population and expanding its academic programmes.\nAlso speaking, the university’s chancellor, Alh.\n“One year down the line, I am proud to say that the vice chancellor has walked his talk.\nThe Kwara State governor, AbdulRahaman AbdulRazaq, commended Al-Hikmah university for its contributions to the growth of the state."
  },
  {
    "headline": "28 Bag First Class At Al-Hikmah University’s 11th Convocation",
    "summarized_story": "Al-Hikmah University, Ilorin, Kwara State, on Saturday, graduated a total of 1,079 students with 28 of them bagging first class degree honours.\nSpeaking at the 11th convocation, the vice chancellor of the university, Prof. Noah Yusuf, said the university was growing in population and expanding its academic programmes.\nAlso speaking, the university’s chancellor, Alh.\n“One year down the line, I am proud to say that the vice chancellor has walked his talk.\nThe Kwara State governor, AbdulRahaman AbdulRazaq, commended Al-Hikmah university for its contributions to the growth of the state."
  },
  {
    "headline": "Edo: Obaseki Kick-starts Physical, Socio-economic Devt With New Plan",
    "summarized_story": "Determined to engender a coordinated socio-economic and physical development in Edo State, the governor, Godwin Obaseki, has said that the new 30-year development plan will guide infrastructure delivery in the state to enhance the quality of life of residents.\nSpeaking at a recent workshop during the overview of the Edo State Development and Physical Plan, put together by the ministry of physical planning /urban development and the state ministry of budget and economic planning, Obaseki explained that the newly launched 30-year development plan is a comprehensive and all-encompassing document to drive sustainable socio-economic growth and development in the state over the next three decades.\nWelcoming guests to the overview workshop, held in Government House, the governor “said the 30-year development plan is a very comprehensive and all-encompassing plan, which not only looks at our socio-economic development plans over the next 30 years but also deals with the physical development plans.\nObaseki further projected a strong economic outlook for the state, on an irreversible nexus between physical planning and economic growth.\nAccording to the project manager, Edo 2050, Dr. Francis Ntamu, the three main process phases in the development plan include; stakeholders consultations, communications and focus on risk management."
  },
  {
    "headline": "Onaiyekan warns: Nigeria may split before 2023 elections",
    "summarized_story": "As preparations for the next general elections gathers momentum, a former Catholic Archbishop of Abuja Diocese, John Cardinal Onaiyekan, has raised fears that Nigeria may split before 2023 because of the sad realities in the country, including security challenges.\nHe said Nigerian leaders would always want to remain in office even after their tenure because of “greed, wickedness and stupidity”.\nThe cleric stated that one of the obstacles that had been threatening democracy in Nigeria was that incumbent governments did not want free and fair election.\n“As for the election, we are not even sure whether Nigeria will be one country or whether we would have an independent country.\n“All of it; greed, wickedness and stupidity."
  },
  {
    "headline": "Onaiyekan warns: Nigeria may split before 2023 elections",
    "summarized_story": "As preparations for the next general elections gathers momentum, a former Catholic Archbishop of Abuja Diocese, John Cardinal Onaiyekan, has raised fears that Nigeria may split before 2023 because of the sad realities in the country, including security challenges.\nHe said Nigerian leaders would always want to remain in office even after their tenure because of “greed, wickedness and stupidity”.\nThe cleric stated that one of the obstacles that had been threatening democracy in Nigeria was that incumbent governments did not want free and fair election.\n“As for the election, we are not even sure whether Nigeria will be one country or whether we would have an independent country.\n“All of it; greed, wickedness and stupidity."
  },
  {
    "headline": "World Disability Day: Obi calls for more inclusiveness of people with disabilities",
    "summarized_story": "Obi, in a statement on Friday to mark the International Day for People with Disabilities, stated that the physically challenged deserve a conductive environment to thrive, develop and fulfill their potentials.\nHe called on governments at all levels to take into consideration, the peculiar needs of the physically challenged and give them equal opportunities to achieve their dreams.\nObi further spoke against every form of stigma meted out on the physically challenged by society.\nHe said that brotherly love and kindness should be everyone’s attitude towards the physically challenged.\nOur physically challenged brethren need our support to harness their potentials and function productively in society,” Obi said."
  },
  {
    "headline": "World Disability Day: Obi calls for more inclusiveness of people with disabilities",
    "summarized_story": "Obi, in a statement on Friday to mark the International Day for People with Disabilities, stated that the physically challenged deserve a conductive environment to thrive, develop and fulfill their potentials.\nHe called on governments at all levels to take into consideration, the peculiar needs of the physically challenged and give them equal opportunities to achieve their dreams.\nObi further spoke against every form of stigma meted out on the physically challenged by society.\nHe said that brotherly love and kindness should be everyone’s attitude towards the physically challenged.\nOur physically challenged brethren need our support to harness their potentials and function productively in society,” Obi said."
  },
  {
    "headline": "[JUST IN] Itunu Babalola: Nigerian Lady Who Died In Ivory Coast Prison Buried In Oyo",
    "summarized_story": "Itunu Babalola, the Nigerian lady who died in prison in Côte D’Ivoire after she was wrongly jailed, has been buried in Ibadan, Oyo State.\nBabalola reportedly died on November 14 and Nigerians had taken to social media to express deep anger over the death of Babalola.\nAccording to reports, 21-year-old Babalola from Oyo State was a trader based in Bondoukou, Cote d’Ivoire.\nHe reportedly offered her a settlement worth roughly N100,000 to drop the case, an amount lesser than the N300,000 worth of stolen effects.\nIn defence, Dabiri-Erewa, blamed Babalola, saying she reported her plight late to the Nigerian Commission in Ivory Coast after she had spent two years in jail."
  },
  {
    "headline": "BREAKING: Explosions Rock Maiduguri Metropolis, As Terrorists Attack Borno Capital",
    "summarized_story": "At least four distinct explosions were heard early Saturday morning in Maiduguri, Borno State, in the villages of Gomari district and 1000 housing estates.\nTerrorists are suspected of masterminding the explosions, which fired rockets in several directions while troops and an airforce task team engaged them in an attempt to repel the onslaught.\nThe explosions began early, according to eyewitnesses, with the first two happening at Gomari airport and the third erupting in a structure near the Hajj Transit Camp, where repentant Boko Haram fighters are being housed.\nSpeaking to one of the victims who was among those killed, Mallam Kulima said he owes it all to God to thank him for preserving his and his family’s life, as no one was killed."
  },
  {
    "headline": "How My Son Sylvester Oromoni Was Tortured Before He Died – Father Explained (Video)",
    "summarized_story": "Mr. Oromoni, the late Sylvester Oromoni’s father, has described how his son was abused by fellow classmates, resulting in his death.\nSylvester was a student at Dowen College in Lekki, Lagos, and lived at the school hostel when he died.\nDowen College blamed his death on injuries suffered while playing football.\nFollowing public outcry, the school announced that it would temporarily shut its doors and reopen next week as exams are scheduled to start soon.\nBut the Lagos State Government has ordered the school to be shut down until the education ministry and relevant authorities conclude a probe into Oromoni Jnr’s death."
  },
  {
    "headline": "BREAKING: Soldiers Battle Boko Haram Terrorists in Borno Town, Malam Fatori",
    "summarized_story": "The border town headquarters of the Abadam Local Government Area, Malam Fatori, is under siege by boko Haram terrorists.\nMalam-Fatori is one of the two LGAs without human activities where Governor Zulum had insisted on returning displaced persons by December 31.\nThere were 500 mobile police personnel deployed to clear the town in preparation for the return of 1,000 refugees from Niger republic.\nThe mobile Police crack team have since abandoned the town and returned to Maiduguri while the military personnel are still there.\nReports reaching The PUNCH in Maiduguri indicated the terrorists are engaging the army formation in Malam-Fatori Friday evening."
  },
  {
    "headline": "Pictures: Dangote hands rehabilitated Moshood Abiola stadium pitch, digital score board to FG",
    "summarized_story": "The Federal Ministry of Youth and Sports Development on Friday formally received the rehabilitated Moshood Abiola stadium pitch and digital score-boards from the Dangote Industries Group (DIG) after years of neglect.\nThe revival of the pitch was made possible under the “Adopt-a-pitch” initiative of the incumbent Minister, Sunday Dare.\nThe Permanent Secretary of the Ministry, Ismaila Abubakar, lauded Dangote group for believing in the vision of the Minister vis-a-vis examplifying a Public-Private Partnership (PPP) that works.\nHe charged the Dangote group to consider extending the period of maintenance beyond two years, stating that after expending $1 million to renovate the facility, long-term maintenance was paramount.\n“We thank Alhaji Aliko Dangote for opening his doors to us, and accepting to adopt the Moshood Abiola Stadium when we came up with our ‘Adopt-a-Pitch’ proposal."
  },
  {
    "headline": "From bandits to terrorists: Will status change end insecurity?",
    "summarized_story": "“Commercial, educational, and farming activities in the North-west and North-central have been disrupted as a result of the groups’ activities,” the federal government noted.\nGumi in a statement by his media aide, Tukur Mamu, said declaring the herdsmen bandits as terrorists is a decision taken for political expediency.\n“Will bandits become terrorists because they have been categorised as terrorists?\nFighting terrorists and fighting bandits who have been declared terrorists at the same time will further complicate the war against terrorism.\n“It is easy to change labels, and tag bandits as terrorists."
  },
  {
    "headline": "Breaking: Bandits kidnap 13, kill 1 in Zaria",
    "summarized_story": "Armed Bandits have abducted 13 people and killed 1 following an attack Thursday night on 2 communities of Kanuwar Isa and Kugu of Dutse Ward in Zaria local government of Kaduna state.\nA source in Zulkifil Sani disclosed to Blueprint that the Bandits invaded Kasuwar Isa community Thursday night where they kidnapped nine people from the community and proceeded to Kugu and abducted four.\n“They shot dead a former councillor that represented the ward in Zaria Local Government known as Honourable Magaji Shaka-Zulu “, he said.\nAt the time of filing this report, the Police spokesperson in the state, ASP Mohammed Jalige, could not be reached so as to seek for comment on the attack."
  },
  {
    "headline": "Explosion Rocks Residential Area In Maiduguri",
    "summarized_story": "A mortar bomb exploded early Saturday morning in a residential estate in Maiduguri, Channels Television can report.\nThe name of the estate is 1,000 Housing estate, located along the Maiduguri-Damaturu expressway.\nMeanwhile, the Federal Airports Authority of Nigeria (FAAN) has debunked reports that an explosion rocked the Maiduguri airport in Borno State.\nBombings in Maiduguri are not a novelty and are usually launchd by Boko Haram/ISWAP terorrists.\nIn February, at least 10 persons died and about 60 were injured after Boko Haram insurgents fired rocket bombs into the town."
  },
  {
    "headline": "FG Approves COVID-19 Booster Shots Amid Omicron Variant",
    "summarized_story": "The Federal Government has approved COVID-19 booster shots as the world battles to contain the new Omicron variant.\nHe quoted the Executive Director of the agency, Dr. Faisal Shuaib, as saying that the booster doses are for people from 18 years and above.\n“COVID-19 booster dose gives greater protection against the virus and urged all Nigerians to take advantage of the opportunity offered by the Federal Government of Nigeria,” Faisal was quoted as saying.\nREAD ALSO: Australia Halts Border Reopening As WHO Warns On New VariantA Regretable, Unfortunate MoveThe approval of the booster doses in Nigeria is coming at a time when the world is battling the Omicron COVID-19 variant.\nThe move has generated a series of debates with the South African government faulting the travel ban imposed on the country."
  },
  {
    "headline": "Lagos Govt Orders Indefinite Closure Of Dowen College",
    "summarized_story": "The Lagos State Government has ordered the indefinite closure of Dowen College, located in the Lekki area of the state.\nThis is pending the outcome of an investigation into the death of Sylvester Oromoni Jnr, a student of the school.\nThe Commissioner also called for calm, saying no effort will be spared in getting to the root of the incident.\nHowever, Dowen College in a press release that also went viral on social media expressed surprise at the allegation.\n“The resident doctor also called the mother later in the week to check up on his progress but she informed the doctor that he was sleeping at the time."
  },
  {
    "headline": "Three Smugglers Bag 16-Year Jail Term For Importing 661 Pump Action Rifles",
    "summarized_story": "Others convicted and sentenced to jail terms by Justice Ayokunle Faji led-court are Oskar Okafor; and Mahmud’s company, Hassan Trades Limited.\nJustice Faji, however, discharged and acquitted the fifth defendant.\nWhile delivering the judgement, Justice Faji, said the offence committed by the convicts touches on the security of the country.\nThe convicts were arraigned before the court for illegally importing 661 pump-action rifles into the country.\nThe judge said the sentence shall run concurrently; the convicts were sentenced on count one and two other counts struck out."
  },
  {
    "headline": "Senegal Transport Workers End Strike",
    "summarized_story": "Senegalese transport unions ended a strike overnight from Friday to Saturday that had paralysed capital Dakar and other regions over police harassment and illicit competition.\nAlthough there remained “some stumbling blocks” in talks with the government, transport workers would give politicians a month to sort through all the problems, said Gora Khouma of the CUSTRS union.\nHe added that the police and gendarmes had been ordered to find ways of reducing harassment.\nMuch of Senegal was stuck fast between Wednesday and Friday, with passenger and goods transport vehicles almost absent from the country’s roads.\nCUSTRS went on strike to force the government to address a list of 11 grievances, with police harassment top of the list, as well as illegal competition and excessive numbers of road checkpoints."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Wayas was a special breed, his death painful",
    "summarized_story": "Former President, Olusegun Obasanjo has disclosed that the late Senate President, Dr. Joseph Wayas lived for the welfare and security of the common man.\nThe late Senate President died early hours of Wednesday, in United Kingdom after illness at age 80.\nWayas was a special breed who contributed immensely to the development of the country and became a parliamentarian in the Second Republic.\n“He was such a great patriot who had contributed his own quota to the legislative governance and overall development of Nigeria.\nHis knowledge of practices and procedures of the Senate, according to Obasanjo “helped him greatly in running the affairs of the Senate."
  },
  {
    "headline": "Niger Gov signs 2021 revised budget into law",
    "summarized_story": "Niger State governor, Abubakar Sani Bello has assented into law the State “Budget Revision law, 2021”.\nThe Governor signed the law at the Government House, Minna.\nSpeaking to newsmen, the Permanent Secretary, Niger State Planning Commission, Hajiya Ramatu Umar explained that the 2021 budget was reviewed downward following the significant reduction in the inflow of revenue to the state.\nThe Permanent Secretary disclosed that the revised budget allocated N72.5 billion for recurrent expenditure while the sum of 77.3 billion is for capital expenditure bringing the total of the revised 2021 budget to N149.9 billion.\nIn the revised budget, Economic Sector has the highest allocation with N54.7 billion, N14.8 billion is to Social Sector, N7.2 billion was allocated to Administrative Sector while Law and Justice got N580 Million."
  },
  {
    "headline": "Ondo Assembly confirms appointment of 14 Commissioner-nominees -",
    "summarized_story": "The Ondo State House of Assembly has ratified the appointment of fourteen new commissioners.\nA letter of request for the confirmation of appointment of the fourteen Commissioners, signed by Secretary to the State Government, Princess Catherine Oladunni Odu had earlier been forwarded to the House.\nSpeaking after confirmation of the nominees, the Speaker, Oleyelogun Bamidele David congratulated the newly confirmed Commissioners.\nThe Speaker urged the new Commissioners to work with the Governor to enhance the delivery of democracy dividends to the people of Ondo State.\nOthers are: Razak Obe, Dr Banji Ajaka, Pastor Emmanuel Igbasan, Mrs Yetunde Adeyanju, Pastor Femi Agagu and Wale Akinlosotu."
  },
  {
    "headline": "Buhari Tasks World Leaders on Covid Partnership at Dubai Expo",
    "summarized_story": "With the global surge in COVID-19 and its new Omicron variant, President Muhammadu Buhari on Friday emphasised the urgent need for world leaders to work together and reinforce partnerships to limit the catastrophic consequences of the pandemic.\nBuhari, while addressing the global audience at Dubai Expo 2020, said: “The concerted efforts by world leaders, working together, enabled us to limit the catastrophic consequences of this pandemic.\nHe described Dubai Expo 2020 as the single most important global event of its kind to take place in the Middle East, Africa and the South East Asian regions in recent years.\n“We are proud to be a part of this dynamic evolution of pragmatic partnerships that are both creative and innovative for the progress of the country,” the President said.\nCharles Ajunwa in Lagos, Deji Elumoye, Onyebuchi Ezigbo and Olawale Ajimotokan in Abuja"
  },
  {
    "headline": "Omicron: Nigeria Refuses to Restrict Inbound Travellers, Approves Booster Doses",
    "summarized_story": "Notwithstanding the raging Omicron COVID-19 variant in Southern Africa and some other parts of the world, Nigeria’s federal government on Friday unveiled a revised COVID-19 protocol, without restricting inbound travellers from any country.\nThe Nigeria Centre for Disease Control (NCDC) later announced on Wednesday that three cases of Omicron had been detected in the country.\nThe federal government also formally endorsed the administration of booster dose of the COVID19 vaccine for Nigerians.\nHe also said that the time interval of two months or more after receiving the Johnson and Johnson vaccine should be observed before taking the booster dose.\nAccording to the DG, NPHCDA, Faisal Shuaib, a COVID-19 booster dose gives greater protection against the virus and urged all Nigerians to take advantage of the opportunity offered by the federal government."
  },
  {
    "headline": "New Online Archive for Benin Bronzes to Go Live at End of 2022",
    "summarized_story": "An online archive bringing together information on thousands of Benin Bronze artefacts in museums around the world is expected to go live at the end of next year, one of the organisers said on Friday.\nThe Benin Bronzes, which are mostly in Europe, were stolen from Nigeria’s Benin City during colonialism and are among Africa’s most significant heritage objects.\n“It will be a major source for research and knowledge about Benin art and cultural history relating to this art.”In October the University of Aberdeen and Cambridge University’s Jesus College returned two Benin Bronzes to Nigeria.\nThe returns were seen as likely to increase pressure on the British Museum in London, which holds by far the largest and most significant collection of Benin Bronzes.\n“We are looking at having new museums in Benin City of international standard that will house these artefacts,” he said."
  },
  {
    "headline": "Trump Faces Flurry of Investigations Beyond January 6 Probe",
    "summarized_story": "Trump has long dismissed the investigations as nothing more than a politically motivated “witch hunt” that began with the probe into Russian meddling in the 2016 election.\nGEORGIAIn Atlanta, Fulton County District Attorney Fani Willis opened an investigation in January into possible attempts to interfere with the administration of the state’s 2020 election, which Trump narrowly lost.\nIf Trump were to be charged, it would be a low-level misdemeanor, with a maximum sentence of six months in jail.\nTrump is also facing a defamation case brought by columnist E. Jean Carroll, who says Trump raped her in the mid-1990s in an upscale Manhattan department store.\nSeparately, Trump’s estranged niece, Mary Trump, has sued him and other family members, accusing them of defrauding her of millions of dollars of inheritance money."
  },
  {
    "headline": "Parents Captured after Son Charged in Oxford School Shooting",
    "summarized_story": "Ethan Crumbley, 15, emerged from a bathroom with a gun, shooting students in the hallway, investigators said.\nThe Crumbleys failed to ask their son about the gun or check his backpack and “resisted the idea of their son leaving the school at that time,” McDonald said.\nJennifer Crumbley texted her son after the shooting, saying, “Ethan, don’t do it,” McDonald said.\nAsked at a news conference if the father could be charged for purchasing the gun for the son, McDonald said that would be the decision of federal authorities.\nHe also acknowledged the meeting of Crumbley, the parents and school officials."
  }
]