[
  {
    "headline": "Caring for persons living with type two diabetes",
    "summarized_story": "People living with diabetes constantly have to take medication to steady their blood sugar levels, check their blood sugar regularly and be careful of how they live in general.\nRemind them to constantly check their blood sugar, and maintain a daily record of their weight, blood sugar readings, medicine schedule, meals, exercise and mood are needed.\nSometimes, people with type 2 diabetes experience a drop in blood sugar.\nSince low blood sugar can cause confusion, your loved one may be unable to articulate the steps to raise their blood sugar at the moment.\nA diabetes community or support group is very beneficial for the physical and mental health of people living with diabetes, as well as their caregivers."
  },
  {
    "headline": "Caring for persons living with type two diabetes",
    "summarized_story": "People living with diabetes constantly have to take medication to steady their blood sugar levels, check their blood sugar regularly and be careful of how they live in general.\nRemind them to constantly check their blood sugar, and maintain a daily record of their weight, blood sugar readings, medicine schedule, meals, exercise and mood are needed.\nSometimes, people with type 2 diabetes experience a drop in blood sugar.\nSince low blood sugar can cause confusion, your loved one may be unable to articulate the steps to raise their blood sugar at the moment.\nA diabetes community or support group is very beneficial for the physical and mental health of people living with diabetes, as well as their caregivers."
  },
  {
    "headline": "UPTH debunks death of 14 infants over power outage",
    "summarized_story": "Dennis Naku, Port HarcourtThe Management of the University of Port-Harcourt Teaching Hospital has debunked reports that 14 infants died as a result of a power outage in its facility.\nThe acting Public Relations Officer, Elabha Meni, said this in a statement issued in Port Harcourt on Saturday.\nMeni was reacting to reports on social media that 14 infants died at the hospital, although he confirmed that there was a power outage.\nThe statement reads, “The University of Port-Harcourt Teaching Hospital is an institution, where the world’s best medical standards are practised and maintained.\n“Our attention has been drawn to a story of the 14 to 19 babies dying in the hospital, this is not correct."
  },
  {
    "headline": "UPTH debunks death of 14 infants over power outage",
    "summarized_story": "Dennis Naku, Port HarcourtThe Management of the University of Port-Harcourt Teaching Hospital has debunked reports that 14 infants died as a result of a power outage in its facility.\nThe acting Public Relations Officer, Elabha Meni, said this in a statement issued in Port Harcourt on Saturday.\nMeni was reacting to reports on social media that 14 infants died at the hospital, although he confirmed that there was a power outage.\nThe statement reads, “The University of Port-Harcourt Teaching Hospital is an institution, where the world’s best medical standards are practised and maintained.\n“Our attention has been drawn to a story of the 14 to 19 babies dying in the hospital, this is not correct."
  },
  {
    "headline": "Nigeria lacks selfless, charitable leaders, says Shettima",
    "summarized_story": "Kashim Shettima…as Yusuf Alli assumes leadership of Rotary ClubFormer Governor Kashim Shettima of Borno State, yesterday, said Nigeria lacked selfless and charitable leaders dedicated to meeting the needs of the less provoked in the society.\nHe commended the Rotary International for their selfless service to humanity, saying they have become the conscience of the society.\nShettima said: “There’s a reason both religious groups and corporate organizations revolve around the principle of giving back to the society.\nShettima said he was not surprised that Alli was chosen as the 11th President of the Rotary Club of Abuja Maitama.\nAs long as I serve humanity, I do not expect anything in return.”The immediate past President of the Club, Rotn."
  },
  {
    "headline": "ASUU strike: Stakeholders express worry, want immediate resolution",
    "summarized_story": "Education Minister, Adamu AdamuSome stakeholders in the education sector have continued to deep express worry over the lingering crisis between the Federal Government and the Academic Staff Union of Universities (ASUU).\n“The effects of ASUU strike on the youth of this nation is quite enormous.\nOlawade said that the four months strike had grounded the productive academic sector and other aspects of the economy of the nation.\n“One of the major effect of ASUU strike on Nigerian universities is the fact that it’s going to draw us back.\n” Yes, it is true that the lecturers are demanding for their welfare and the welfare of the university system as a whole."
  },
  {
    "headline": "Buhari condoles with Prof. Ango Abdullahi over eldest son’s death",
    "summarized_story": "President Muhammadu Buhari has expressed his sympathy over the death of Isa Abdullahi, the eldest son of Prof. Ango Abdullahi, the Chairman of the Northern Elders Forum.\n“We are proud of his services to the country.\nMay his soul rest in peace.\n”May Allah comfort you and give you the strength to overcome this great and irreparable loss.”In a similar development, President Buhari has described the death of Rep. Jude Ise-Idehen, a federal legislator from Edo as a sad loss to the nation.\nHe expressed heartfelt condolences to the family of the deceased, the government and people of Edo, the leaders, and membership of the National Assembly."
  },
  {
    "headline": "Benue ‘ll kick against reintroduced Water Resources bill – Ortom",
    "summarized_story": "Ortom and government functionaries at the flag off of distribution of improved seeds and seedlings in MakurdiBy Peter Duru, MakurdiGovernor Samuel Ortom of Benue state has reiterated the resolve of the state to kick against the reintroduced Water Resources bill before the National Assembly.\nThe Governor said: “We will resist the reintroduction of the Water Resources Bill.\nThe federal government should go and concentrate and manage the Federal Capital Territory, FCT, because even if other states accept it, Benue state would not support it.\n“I want to therefore urge Benue indigenes to rise up and reject the bill because it is targeted at taking over our ancestral heritage.\nThe improved seeds flagged-off for distribution include, 6,900 bags of rice, 833 bags of maize, 1,000 tins of watermelon seeds, 333 bags of sorghum and 11,000 bundles of cassava stems."
  },
  {
    "headline": "INEC monitoring security situation ahead Osun guber poll – Yakubu",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Saturday said it was closely monitoring the security situation in Osun, ahead of July 16 governorship election.\nINEC Chairman, Prof. Mahmood Yakubu, disclosed this in Abuja at a special meeting of the Inter-agency Consultative Committee on Election Security (ICCES).\nThe chairman said the state Resident Electoral Commissioner (REC), Prof. Abdulganiyu Raji, and the Commissioner of Police,CP Wale Olokode, would brief the meeting on the readiness for the Osun election.\nYakubu said that on the part of INEC headquarters, all necessary arrangements had been completed for a hitch free poll.\n“It will also meet its staff, security agencies, transporters and traditional rulers to solicit their support for peaceful elections."
  },
  {
    "headline": "ADC demands investigation as African migrants die at Spain-Morocco border",
    "summarized_story": "The African Diaspora Congress (ADC) has called for an investigation into the alleged mistreatment and death of African migrants on the Spanish-Moroccan border.\nAbout 2,000 migrants, mainly from Sudan in June 24th tried to cross the barbed-wire fence at the militarized border the North African country and city of Melilla share.\nADC, a coalition of African and African Diaspora groups worldwide, on Saturday in a communique I signed by the Secretary-General of ADC, Prof. Apollos Nwauwa described the viral videos and pictures showing the alleged maltreatment of 23 African men at the Melilla-Morocco border as worrisome.\nThe communique read, “The reports showed African migrants were alleged to have been slaughtered by combined forces of Spanish and Moroccan security agents, as they attempted to cross the border into Spain.\n“If it’s confirmed that Spain enabled the death of these migrants, the global community and organisations must ensure the country is held responsible."
  },
  {
    "headline": "Rivers model seaport loses over N1bn in 6 months",
    "summarized_story": "The Onne Model Seaport, Oil and Gas free zone and other multinationals located in Rivers State have lost over one billion naira in containerized cargos and other domestic goods within six months.\nAlso, about 27 trailers have suffered untold losses for fallen off the road with loaded cargos worth millions of naira.\nGiwa explained that the huge losses were due to the long neglected Rivers-Eleme East-West road.\nHe said the roads are dotted with deep potholes from Port-Harcourt-Eleme junction down to the trailer park linking the model seaport.\nRegrettably, Giwa added that the major federal roads linking Abia, Akwa Ibom, Bayelsa and Delta states are long in deplorable conditions."
  },
  {
    "headline": "Zamfara NUJ elects new leadership",
    "summarized_story": "The Zamfara State council of the Nigeria Union of Journalists (NUJ) has concluded its 2022 triennial delegates conference with the election of Comrade Ibrahim Musa Maizare as chairman.\nMaizare will oversee the affairs of the council in the next three years.\nDAILY POST reports that Maizare defeated his closest rival, Comrade Nasiru Shehu Aula with 68 votes to 31.\nIn the Treasurership contest, Comrade Jamilu Sani Tsafe also scored 68 votes to defeat Comrade Yakubu Kaura, who polled 31 votes.\nHe maintained that other positions were unopposed as some of the aspirants stepped down for their opponents which made the election easier."
  },
  {
    "headline": "Boko Haram, ISWAP terrorists targeting Igbo soldiers, we wont allow Islamization of Nigeria – IPOB",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has vowed not to allow Fulanis Islamize Nigeria.\nIPOB spokesman, Emma Powerful, claimed that Igbos are being targeted because they stopped Fulanis from Islamizing the Southeast and Nigeria.\nPowerful alleged that terrorist groups like bandits, Boko Haram, Ansaru and ISWAP are targeting Igbo soldiers.\n“That single plan to start a war in Nigeria made them instruct and put Igbo soldiers where they will be murdered by bandits and terrorists that they formed and equipped.\n“IPOB is not ready to allow Fulani to Fulanise and Islamise Nigeria, they can apply any formula and it shall consume them."
  },
  {
    "headline": "Gov Ayade begs Obono-Obla to withdraw suits against Cross River lawmakers",
    "summarized_story": "The meeting with Obono-Obla was held at the Governor’s Lodge on Saturday in Calabar.\nAs a result of the suit, the state House of Assembly could not function as it should be.\nSources close to the Government House disclosed that Obono-Obla, who sought interpretation of the affidavit sworn by members in the court reneging their membership of the APC, reportedly withdrew the suit with suit No.\nFHC/CA/CS/927/2022 Vs APC and three others after a three-hour meeting with the governor on Saturday.\nOthers who witnessed the meeting included Chief Daniel Ubana, Sir Patrick Okoi Otu, Sir Barnabas Abam, Hon."
  },
  {
    "headline": "FG assures elderly, retirees of health insurance The Nation Newspaper",
    "summarized_story": "The Federal Government has stated that while it is committed to achieving Universal Health Coverage (UHC) for all Nigerians, the provision of health insurance for the elderly and retirees remains a priority.\nThe Minister of Health, Dr. Osagie Ehanire, made this known in Abuja at the formal presentation of the Ministerial Committee report on the provision of health insurance for retirees and elderly in Nigeria.\nThere is no doubt that this is a very important document and a big step forward, not only for the elderly and the retirees, but for the whole country.\n“We must make sure that nobody is left behind – the young, old – are taken care of by those who are able.\nWe have researched and realise that no society can fund health care from only one source."
  },
  {
    "headline": "Lawan mourns death of Yobe APC chair's mother The Nation Newspaper",
    "summarized_story": "Senate President, Ahmad Lawan, on Saturday expressed sadness over the death of Hajia Hauwa, the mother of the Chairman, Yobe State Chapter of the All Progressives Congress (APC), Alhaji Mohammed Gadaka.\nLawan in a statement by his media aide, Ola Awoniyi, in Abuja, commiserated with the government and people of Yobe State on the passage of the centenarian, describing it as a great loss to the entire people of the state.\nRead Also; Soludo mourns beheaded lawmaker“I commiserate with the Chairman of our party in Yobe State, Alhaji Mohammed Gadaka, over the death of his mother.\n“The centenarian lived an impactful life, a life of care for her children and community.\nShe will be sorely missed,” Lawan says."
  },
  {
    "headline": "Buhari condoles with Ango Abdullahi over son's death The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has expressed his sympathy over the death of Isa Abdullahi, the eldest son of Professor Ango Abdullahi, the chairman of the Northern Elders Forum.\n“We are proud of his services to the country.\nMay Allah comfort you and give you the strength to overcome this great and irreparable loss,” the President added.\nPresident Buhari, in another message, described the death of Representative Jude Ise-Idehen, a federal legislator from Edo State as a sad loss to the nation.\nHe expressed heartfelt condolences to the family of the deceased, the government and people of Edo State, the leaders, and membership of the National Assembly."
  },
  {
    "headline": "Africa over $11m online fraud The Nation Newspaper",
    "summarized_story": "The INTERPOL in South Africa has arrested a Nigerian wanted for online fraud and money laundering worth $11m (R 192m),the South African Broadcasting Corporation (SABC) reported.\nJames Junior Aliyu (28), is believed to be part of a cyber-crime ring involved in phishing, internet scams and money laundering.\nAliyu was arrested at an upmarket estate in Sandton, Johannesburg, during the week following a take-down operation.\nThe arrest followed a widespread investigation involving law enforcement authorities from South Africa (SA) and the United States of America (USA).\nThe cyber-crime suspect has been conducting his criminal activities from South Africa."
  },
  {
    "headline": "Buhari returns to Abuja after five-day state visit to Portugal The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari, Saturday evening, returned to Abuja after a five-day state visit to the capital of Portugal, Lisbon.\nWhile in Lisbon, President Buhari led the Nigerian entourage to the signing of several agreements and memoranda of understanding (MoU).\nThe President was accompanied to Portugal by Minister of Foreign Affairs, Geoffrey Onyeama; Minister of Information and Culture, Lai Mohammed; Minister of Industry, Trade and Investment, Adeniyi Adebayo; Minister of Youth and Sports, Sunday Dare.\nOthers are National Security Adviser, Maj-Gen Babagana Monguno (rtd); Director General, National Intelligence Agency (NIA), Amb.\nAhmed Rufa’i Abubakar and Chairman, Nigerians in Diaspora Commission (NiDCOM) Honorable Abike Dabiri-Erewa."
  },
  {
    "headline": "PDP crisis: Real reasons Wike is angry with Atiku",
    "summarized_story": "PDP presidential candidate, Atiku Abubakar, recently unveiled Okowa as his running mate for the 2023 general elections.\nLoyalists of Wike are of the view that he ought to have been chosen as the PDP vice presidential candidate as favoured by the panel.\nOthers absent at the event included the Chairman of the Campaign Council and Bayelsa State governor, Diri Douye; Sokoto State governor, Aminu Tambuwal; Bauchi State governor, Bala Mohammed; Edo State governor, Godwin Obaseki, Akwa Ibom state governor, Udom Emmanuel and Adamawa State governor, Ahmadu Fintiri.\nThe PDP chairman, a day after the national convention, had visited Tambuwal in company of former Jigawa State governor, Sule Lamido.\n“Most of the NWC members are not happy the way he (Ayu) handled the vice presidential candidate issue."
  },
  {
    "headline": "Incessant killings: Nigerians disagree over self-defence",
    "summarized_story": "For Benue State governor, Samuel Ortom, Matawalle’s call was essentially an adoption of the Benue option, when in 2019 he advised residents of the state to defend themselves against armed invaders.\nThe state governor, by such pronouncement is institutionalizing disorder and criminality.\nJust recently, Randegi is one of the areas where these bandits go through to get to Zamfara State and Niger State.\nAnd at what point will Zamfara State government retrieve all the said guns licensed to them?\nI’m telling you, just mere provocation, he would enter the room, carry it and fire.”Upcountry in Taraba State, Governor Darius Ishaku differed from the Matawalle’s position."
  },
  {
    "headline": "Why Kwankwaso/Obi alliance talk is stalled –Senator Rufai Hanga",
    "summarized_story": "By Omoniyi SalaudeenSenator Rufai Hanga is one of the leading members of the New Nigeria Peoples Party (NNPP) in Kano State.\nWould you say that the New Nigeria Peoples Party (NNPP) genuinely represents the Third Force people have been yearning for?\nWe are talking with Peter Obi, but the talk is stalled by some little disagreement on who should be the presidential candidate and the running mate.\nPeter Obi is not all that experienced when it comes to governance and he is even a lot younger than Kwankwao.\nIf only Peter Obi and his people will agree with us, we can go along together and have an alliance."
  },
  {
    "headline": "2023 presidency: Injustice to Ndigbo’ll soon end – Ohanaeze",
    "summarized_story": "From Magnus Eze, EnuguThe Ohanaeze Ndigbo Worldwide has told the Igbo not to despair over the historic injustices they have suffered in the country, especially with the outcome of the primary elections of the two major political parties.\nDescribing the gross historic injustice demonstrated towards Ndigbo by this machination as beyond expectations, he wondered what actually the country wanted from Ndigbo.\nAccording to the statement signed by the National Publicity Secretary of Ohanaeze Ndigbo, Dr Alex Ogbonnia, the Igbo leader who is convalescing in a Dubai hospital noted that Nigeria, by the deliberate injustice had failed the Rotary Club International four-way tests, namely: ‘Is it the truth?\nAnd will it be beneficial to all concerned?’“For Ndigbo, I urge us not to lament much, but wait for the verdict of history.\n“In the end, this political manipulation will end in a pyrrhic victory for those who rejoice and celebrate injustice."
  },
  {
    "headline": "Ondo: Police nab 2 pastors, rescue 77 persons locked in church",
    "summarized_story": "From Bamigbola Gbolagunte, AkureNo fewer than 77 persons said to have been kidnapped and detained inside a church in Ondo, headquarters of Ondo West Local Government Area of Ondo State have been rescued by the police.\nPolice Public Relations Officer (PPRO) for the state police command, Funmilayo Odunlami, confirmed that two pastors allegedly involved in the abduction saga were arrested.\nThe PPRO also disclosed that some members of the church where the victims were discovered were also arrested by the police who stormed the church following a tip off.\nShe said the incident happened at The Whole Bible Believers Church also known as Ondo Church located at Valentino area, Ondo.\n“The two pastors are in police custody; investigation has commenced, and the outcome will be made known to the members of the public,” she added."
  },
  {
    "headline": "CONVERSATION WITH MY BILLIONAIRE FRIEND – THISDAYLIVE",
    "summarized_story": "SESSION 22NATIONAL SECURITY AND WEALTH BUILDINGShortly after our conversation last week, my Billionaire Friend hinted he would like to share his thoughts on national security and its impact on wealth-building endeavours.\nNational security could also be adversely affected by natural disasters such as hurricanes, earthquakes and the likes of Covid-19 pandemic recent occurrence.\n“In the 1960s and the 1970s, some years before and after the Nigerian Civil War, national security was well managed and the country was peaceful.\nWealth building does not survive well in environments of war and where banditry, kidnapping and terrorism prevail.\nAn example is taking cash movement, special peril, fire, and fidelity insurance by such wealth builders."
  },
  {
    "headline": "Buhari Commiserates With Ango Abdullahi over Son’s Death – THISDAYLIVE",
    "summarized_story": "*Also mourns house member IdehenDeji Elumoye in AbujaPresident Muhammadu Buhari has commiserated with the former Vice Chancellor of Ahmadu Bello University (ABU), Zaria and Chairman of the Northern Elders Forum (NEF), Prof Ango Abdullahi, on the death of his first son, Isa Abdullahi.\n“We are proud of his services to the country.\nMay Allah comfort you and give you the strength to overcome this great and irreparable loss,” the President added.\nIn another condolence message, President Buhari, described the death of Representative Jude Ise-Idehen, a federal legislator from Edo State as a sad loss to the nation.\nHe expressed heartfelt condolences to the family of the deceased, the government and people of Edo State, the leaders, and membership of the National Assembly."
  },
  {
    "headline": "Buhari Back in Abuja After 5-Day State Visit to Portugal – THISDAYLIVE",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is back in Abuja after a five-day state visit to Lisbon, capital of Portugal.\nPresident Buhari was on arrival by his Chief of Staff, Prof Ibrahim Gambari; Minister of Federal Capital Territory (FCT), Mohammed Bello; Inspector General of Police, Usman Alkali Baba; among other top government officials.\nWhile in Lisbon, President Buhari led the Nigerian entourage to the signing of several agreements and memoranda of understanding (MoU).\nPresident Buhari was accompanied to Portugal by Minister of Foreign Affairs, Geoffrey Onyeama; Minister of Information and Culture, Lai Mohammed; Minister of Industry, Trade and Investment, Adeniyi Adebayo; Minister of Youth and Sports, Sunday Dare.\nOthers are National Security Adviser, Maj-Gen Babagana Monguno (rtd); Director General, National Intelligence Agency (NIA), Amb."
  },
  {
    "headline": "Non-Disclosure of Assets: CSO Urges CCT to Prosecute Defaulters – THISDAYLIVE",
    "summarized_story": "The group, which alleged that most defaulters of the Act are political office holders, asked the Chairman of the Code of Conduct Tribunal, Justice Danladi Umar, to bring defaulters to book.\nThe organisation also said that political office holders are also not awlays truthful to the law in completing the declaration of assets form.\n“We will publish it at the end of the process and will accordingly drag them before the Code of Conduct Tribunal (CCT) thereafter,” Ajulo said.\n“Declaration of assets at the CCB is no news to any public office holder.\nHe added that any public office holder or politican seeking election who finds it hard to act in accordance with the rule of law cannot be a good representative of the people."
  },
  {
    "headline": "Emir Laments Worsening Insecurity in Katsina, Says Many Traditional Rulers Have Been Abducted – THISDAYLIVE",
    "summarized_story": "*CSOs berate BuhariFrancis Sardauna in KatsinaThe Chairman, Katsina State Traditional Council of Chiefs and Emir of Katsina, Dr. Abdulmumini Kabir Usman, has raised the alarm over what he described as multifaceted worsening security challenges besetting residents of the state.\nUsman, who spoke in Hausa in a two minutes viral video, said some traditional rulers in the state had forfeited their salaries to enable the state government combat banditry in the state.\n“We have the money and weapons to fight these people (terrorists).\nHe added that: “Imagine we and our country living in such fear because of those irresponsible drug addicts.\nWe can tackle them, we have the money and weapons to fight them."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Military Troops Brutally Shot Dead Dozens Of Defenceless Citizens In Ogbaru, Anambra",
    "summarized_story": "Troops of the Nigerian military comprising the Navy and the Army have reportedly killed dozens of innocent citizens in the productive age bracket in Ogbaru communities of Anambra State.\nThey were said to have targeted defenceless locals mainly young males and opened fire on them at close range and killed dozens.\nIn some videos, soldiers were seen placing pump action guns on top of some of the citizens killed to probably justify the massacre or their labeling as \"IPOB/ESN\" fighters.\n\"But latest findings by Intersociety showed that the criminal entities are camped inside big river/swamp Forest of Obene-Ochuche/Umuzu/Okija divided by Ulasi River.\nThe pictures and videos of the incident clearly connote 'egregious and industrial scale massacre of unarmed citizens.'"
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Military Troops Brutally Shot Dead Dozens Of Defenceless Citizens In Ogbaru, Anambra",
    "summarized_story": "Troops of the Nigerian military comprising the Navy and the Army have reportedly killed dozens of innocent citizens in the productive age bracket in Ogbaru communities of Anambra State.\nThey were said to have targeted defenceless locals mainly young males and opened fire on them at close range and killed dozens.\nIn some videos, soldiers were seen placing pump action guns on top of some of the citizens killed to probably justify the massacre or their labeling as \"IPOB/ESN\" fighters.\n\"But latest findings by Intersociety showed that the criminal entities are camped inside big river/swamp Forest of Obene-Ochuche/Umuzu/Okija divided by Ulasi River.\nThe pictures and videos of the incident clearly connote 'egregious and industrial scale massacre of unarmed citizens.'"
  },
  {
    "headline": "PHOTOS: Safe With Foreign Currencies, Posh Vehicles Recovered From Ex-Army Chief, Buratai",
    "summarized_story": "SaharaReporters has exclusively obtained photographs of things including posh vehicles recovered by the Independent Corrupt Practices and Other Related Offences Commission (ICPC) from the house of a former Chief of Army Staff, Lt Gen Tukur Buratai (retd.\nThey include pictures of the safe where foreign currencies were recovered, Mercedes Benz 2022, Bulletproof G Wagon (voice customized), recovered from him valued at N150 million and BMW also recovered from him during the execution of a search warrant.\nSaharaReporters on Friday reported that the ICPC confirmed the recovery of cash, vehicles and other items from a military contractor fronting for Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "PHOTOS: Safe With Foreign Currencies, Posh Vehicles Recovered From Ex-Army Chief, Buratai",
    "summarized_story": "SaharaReporters has exclusively obtained photographs of things including posh vehicles recovered by the Independent Corrupt Practices and Other Related Offences Commission (ICPC) from the house of a former Chief of Army Staff, Lt Gen Tukur Buratai (retd.\nThey include pictures of the safe where foreign currencies were recovered, Mercedes Benz 2022, Bulletproof G Wagon (voice customized), recovered from him valued at N150 million and BMW also recovered from him during the execution of a search warrant.\nSaharaReporters on Friday reported that the ICPC confirmed the recovery of cash, vehicles and other items from a military contractor fronting for Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Ex-President Obasanjo Riding ‘Keke NAPEP’ Is Tale Of Depravity, Wickedness He Unleashed On Nigerians; Not Worth Celebrating – AAC Presidential Candidate, Sowore",
    "summarized_story": "The Presidential candidate of the African Action Congress (AAC) party, Omoyele Sowore, has scolded a former President, Olusegun Obasanjo, for riding a commercial tricycle, popularly called Keke NAPEP in Abeokuta, Ogun State.\nThe former president had on Saturday turned himself into a commercial tricycle rider, picking and dropping passengers across parts of Abeokuta, the Ogun State capital.\nSee Also News Former Nigerian President, Obasanjo Rides Commercial Tricycle In Ogun, Picks PassengersHe had in June donated tricycles to 85 persons as part of an empowerment programme in honour of his 85th birthday.\nReacting, Sowore said, “Former President Olusegun Obasanjo riding “Keke NAPEP” in Abeokuta is not a sign of simplicity, it is the tale of depravity occasioned by the wickedness he unleashed on the people during his tenure and subsequently after as he kept “choosing” leaders for Nigerians.\n“Nigeria should not be celebrating keke napep in 2022."
  },
  {
    "headline": "Presidency: Vote for APC no matter how angry you are, Amaechi tells supporters",
    "summarized_story": "Rotimi Amaechi, former minister of transportation, has urged his supporters to vote for the All Progressives Congress (APC) in the 2023 polls.\nAddressing aggrieved members of the party, who were said to have expected him to win the primary, Amaechi said no matter their anger, they should still vote for the APC.\nAdvertisement“Please, the contest for the presidency, we should know that we should vote for our party, no matter how angry you are.\nOn June 10, Nyesom Wike, Rivers governor, had said the state filed a suit against the former governor over alleged fraud.\nThe process must go through the law.”Speaking further on his advice for aggrieved supporters, Amaechi maintained that they should still support the APC."
  },
  {
    "headline": "Presidency: Vote for APC no matter how angry you are, Amaechi tells supporters",
    "summarized_story": "Rotimi Amaechi, former minister of transportation, has urged his supporters to vote for the All Progressives Congress (APC) in the 2023 polls.\nAddressing aggrieved members of the party, who were said to have expected him to win the primary, Amaechi said no matter their anger, they should still vote for the APC.\nAdvertisement“Please, the contest for the presidency, we should know that we should vote for our party, no matter how angry you are.\nOn June 10, Nyesom Wike, Rivers governor, had said the state filed a suit against the former governor over alleged fraud.\nThe process must go through the law.”Speaking further on his advice for aggrieved supporters, Amaechi maintained that they should still support the APC."
  },
  {
    "headline": "Insecurity: God isn't against self-defence, Adeboye tells RCCG members",
    "summarized_story": "Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), says the Bible has nothing against “children of God” defending themselves against attacks.\nSpeaking on Friday during his sermon at the Holy Ghost service, Adeboye said though safety is of the Lord, the Bible isn’t against Christians defending themselves against harm.\nAdvertisement“I don’t want to say much, because I know whatever I say, some people may want to twist it.\nBut I’ve searched the Bible from cover to cover and there is nowhere in the Bible where God said a child of God cannot defend himself.\nDescribing the claim as the work of “jokers”, Adeboye said those who are children of God do not follow such directives, whether they are true or false."
  },
  {
    "headline": "Insecurity: God isn't against self-defence, Adeboye tells RCCG members",
    "summarized_story": "Enoch Adeboye, general overseer of the Redeemed Christian Church of God (RCCG), says the Bible has nothing against “children of God” defending themselves against attacks.\nSpeaking on Friday during his sermon at the Holy Ghost service, Adeboye said though safety is of the Lord, the Bible isn’t against Christians defending themselves against harm.\nAdvertisement“I don’t want to say much, because I know whatever I say, some people may want to twist it.\nBut I’ve searched the Bible from cover to cover and there is nowhere in the Bible where God said a child of God cannot defend himself.\nDescribing the claim as the work of “jokers”, Adeboye said those who are children of God do not follow such directives, whether they are true or false."
  },
  {
    "headline": "PHOTOS: Obasanjo turns 'tricycle rider', picks up passengers in Abeokuta",
    "summarized_story": "Former President Olusegun Obasanjo, on Saturday, rode a commercial tricycle across parts of Abeokuta, the Ogun capital.\nObasanjo had, in June, donated tricycles to 85 persons as part of an empowerment programme in honour of his 85th birthday.\nThe former president clocked 85 on March 5, 2022.\nSharing photos of Obasanjo on his Facebook page, Daniel Olusanya, a photographer, said the former president rode from his residence in Abeokuta to the Kuto underbridge area.\nAdvertisementSee photos of Obasanjo riding the tricycle below."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "South Africa’s Constitutional Court rules against communications minister’s digital migration deadline",
    "summarized_story": "South Africa’s constitutional court has ruled against Khumbudzo Ntshavheni’s decision to switch off analogue broadcast systems by June 30, 2022, declaring it unconstitutional.\nNtshavheni – who serves as the country’s current Minister of Communications and Digital Technologies – wants South Africa to migrate to digital broadcast systems.\nSTBs would enable households to continue having access to television channels on their analogue television sets after the analogue switch-off.\nIn the final ruling, the High Court dismissed the application from e.tv, MMA and SOS but extended the analogue switch-off date to June 30, 2022.\nIn a unanimous judgment, the Constitutional Court ruled that the power to determine the analogue switch-off date and the registration deadline for STBs is located within the minister’s original constitutional policymaking function."
  },
  {
    "headline": "Binance partners with TikTok star Khaby Lame to drive Web3 Adoption",
    "summarized_story": "Binance, the world’s biggest crypto exchange company, has partnered with 22-year-old Senegalese TikTok sensation, Khaby Lame, to drive global crypto and Web3 adoption.\nResponding to questions about this development, the founder and CEO of the crypto giant, Changpeng Zhao, tweeted: “Well, he’s the most followed creator on TikTok.\nLame rose to fame by reacting wordlessly to complicated and absurd “life hacks” videos using TikTok’s duet and stitch features.\nAccording to him, the partnership with Binance “aligns perfectly” with what he normally does, which is making complicated things easier and more fun.\nLame will also be partnering with Binance to create exclusive nonfungible token (NFT) collections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "INEC Expresses Readiness for Osun Governorship Election …as it promises to tackle issue of vote buying – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Independent National Electoral Commission, INEC has expressed its readiness for the conduct of the Osun state gubernatorial election bail for 16th of July, 2022.\nThe meeting came barely four weeks after a similar meeting was held on 3rd June 2022 to review the security arrangement for the recently concluded Ekiti State Governorship election.\nAccording to the Chairman, the successes recorded during the Ekiti state election was due to the synergy between the Commission and the security agencies.\nOn the of vote buying during the Ekiti state election, the Chairman said it appreciated the role played by the anti-corruption and security agencies in apprehending some of the perpetrators of this brazen assault on our democracy.\nI appeal to all security agencies to continue to join hands with the Commission to tackle this menace”."
  },
  {
    "headline": "2023 Election: FIDA urges women, youths to shun violence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestInternational Federation of Women Lawyers (FIDA), FCT chapter on Friday called on prospective voters to eschew all forms of electoral violence and being used as touts during and after the elections.\n“The purpose of the sensitisation is to educate them on continue voter’s registration exercise and key provisions under the Electoral Act.\n“And, also to promote the inclusion of women, youths and PWD in key electoral and governance processes across the FCT ahead of the 2023 general elections,” Ikenye said.\nShe said FIDA also served to increase the participation and representation of women in decision making and governance.\nOkoye-Chukwuma said members of the communities should ensure they get their PVC and support women, youths and PWDs who want to take leadership positions."
  },
  {
    "headline": "Shiroro attack: COAS vows to go after terrorists behind attack – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Chief of Army Staff (COAS), Lt.-Gen. Faruk Yahaya has vowed to bring to justice terrorists behind attack on troops location in Shororo, Niger State.\nYahaya gave the assurance while addressing journalists at Mogadishu Cantonment Juma’at Mosque prayer in commemoration of the Nigerian Army Day Celebration NADCEL 2022 on Friday in Abuja.\nHe said the terrorists had on Wednesday, ambushed troops in Shiroro while responding to distress call of terrorists attack on a mining site with unspecified number of casualties.\nThe COAS said that even though the Nigerian army had faced challenges, it was determined to address them towards bestowing a peaceful and secured Nigeria.\nHe said the celebration of 159 years of existence of the Nigerian army was a time to reflect on its performance."
  },
  {
    "headline": "FG reappoints Oniha as DG, as DMO releases Sukuk rental payment calender – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Federal Government has reappointed patience Oniha as Director-General of the Debt Management Office (DMO) for another five years.\nMeanwhile, the DMO has released the Federal Government of Nigeria (FGN) Sukuk Rental Payment Calendar.\nAlso on the calendar is the 15.74 FGN Sukuk 2025, issued on Dec. 28, 2018, with Maturity Date as Dec. 28, 2025, and Rental Payment Dates as June 28 and Dec. 28.\nThere is also the 11.20 per cent FGN Sukuk 2027, issued on June 16, 2020, with Maturity Date as June 16, 2027, and Rental Payment Dates as Dec. 16 and June 16.\nThe last item on the calendar is the 13.00 per cent FGN Sukuk 2031, issued on Dec. 29, 2021, with Maturity Date as Dec. 29, 2031, while Rental Payment Dates are June 29 and Dec. 29."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Obasanjo rides tricycle in Abeokuta, asks youths to embrace opportunities",
    "summarized_story": "Chief Olusegun Obasanjo, a former president of Nigeria, on Saturday, rode a tricycle in demonstration of safety of the means of transportation.\nThe former Nigerian leader used the occasion to urge youths to embrace every opportunity with dedication.\nObasanjo rode the tricycle from the premises of the Olusegun Obasanjo Presidential Library (OOPL), through Kuto under bridge, amidst greetings and jubilation by onlookers along the road.\nHe said with tricycles and other small scale businesses, youths can be self employed and ultimately, become economically independent.\nHe said when he recently distributed 85 Keke given young people across the nation, he received some feedback that made riding keke look like an inappropriate gift, even as some wondered if that was the best for young people."
  },
  {
    "headline": "Buhari congratulates transport ministry as Lekki Deep Sea port welcomes first ship",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has congratulated the Federal Ministry of Transportation and the Nigerian Ports Authority on the successful berthing of the first ship at Lekki Deep Sea port.\nThe Nigerian leader also congratulated all stakeholders in the maritime sector over the feat.\nBuhari recalled that his approval of four new seaports in the country, including the Lekki Deep Sea port, was hinged on growing the economy.\nHe commended the staff and management in the nation’s maritime sector who were working round the clock to make the operationalisation of Lekki Deep Sea port before the end of the year a reality.\nAccording to Buhari, the nation’s maritime and aquatic resources are critical to the livelihoods of Nigerians and Government will spare no effort in successfully harnessing the potential of the sector."
  },
  {
    "headline": "Cristiano Ronaldo says he wants out of Manchester United",
    "summarized_story": "Portuguese superstar, Cristiano Ronaldo has reportedly requested that Manchester United let him leave should they receive a satisfactory offer this summer.\nUnited failed to qualify for Europe’s elite club competition following a dismal Premier League season and will instead play in the Europa League next season.\nRonaldo has been part of 19 consecutive Champions League seasons since leaving Sporting Lisbon for English football in the summer of 2003.\nHe has never played in the Europa League, which United qualified for after finishing sixth in the Premier League.\n‘No chance’Meanwhile, Manchester United have already responded angrily to Ronaldo’s reported desire to quit Old Trafford this summer, telling him ‘no chance’."
  },
  {
    "headline": "50 children rescued from underground cell of Ondo church",
    "summarized_story": "About 50 children have been rescued from an underground apartment in a church in Ondo town, Ondo state.\nReports said the children were abducted and kept in the underground cell.\nThe pastor of the church and other accomplices have been arrested by police detectives in the town.\nThe abducted children were seen in a viral video trending on the social mediaThey were seen in a police patrol vehicle which conveyed them to the police station.\nA voice was heard in the video saying “There are kidnapped children found in the underground cell of a church in Valentino Area of Ondo."
  },
  {
    "headline": "Another election with 1999 unitary constitution, a waste of time, By Elliot Uko",
    "summarized_story": "For too long they’ve been stuck with mediocrity, misgovernance and mismanagement of their future and destiny.\nThey know they’ll only begin to take the hyper-aroused youths serious after the February 2023 polls.\nThey’ve not just done it before, they know they’ve done this for decades.\nNobody cares about the likely conduct and outcome of the February 2023 polls.\nThe promises of Eldorado both by the old guard and the prospective alternatives, seem clearly unrealistic under the 1999 constitution."
  },
  {
    "headline": "Tashoshin Radio Da Talabijin Na CGTN Na The Greater Bay Sun Fara Watsa Shirye Shirye A Yankin Hong Kong",
    "summarized_story": ""
  },
  {
    "headline": "Kamfanin CRCC Na Kasar Sin Ya Kammala Aikin Samar Da Ruwan Sha A Angola",
    "summarized_story": "An kammala aikin samar da ruwan sha na Cabinda na kasar Angola, wanda kamfanin gine gine na kasar Sin (CRCC) ya aiwatar, inda aka fara amfani da shi a ranar 30 ga watan Yuni.\nAn ba da rahoton cewa, an gudanar da aikin ne bisa ma’unin gine-gine na kasar Sin, wanda zai samar da ruwa mai yawan kyubik mita 50,000 a ko wace rana, tare da amfanawa mazauna yankin 600,000.\nGwamnan lardin Cabinda, ya bayyana cewa, aikin zai iya samar da ruwan famfo na sa’o’i 24 a ko wace rana, wanda hakan zai kawar da matsalar karancin ruwa da mazauna yankin ke fuskanta, sannan kuma zai yi tasiri mai kyau ga bangarorin masana’antu, da ilimi, al’adu, sufuri ta tashar jiragen ruwa da dai sauransu.\nBaya ga haka, ya godewa kamfanin na kasar Sin saboda muhimmiyar rawar da ya taka wajen gudanar da aikin.\n(Mai fassara: Bilkisu Xin)"
  },
  {
    "headline": "Mutum Miliyan 1.9 Ne Za Su Kada Kuri’a A Zaben Gwamnan Osun A Watan Yuli – INEC",
    "summarized_story": ""
  },
  {
    "headline": "Ronaldo Yana Son Barin Manchester United",
    "summarized_story": ""
  },
  {
    "headline": "Kungiyar Kasa Da Kasa Ta Nemi A Gurfanar Da ‘Yan Siyasar Da Suka Ki Bayyana Kadarorinsu",
    "summarized_story": ""
  },
  {
    "headline": "Kwankwaso: I can’t be running mate to anyone, but I want Obi to be mine",
    "summarized_story": "By Peter Uwumarogie/GombeRabiu Kwankwaso, the Presidential candidate of the New Nigeria People’s Party (NNPP) said accepting to be running mate would lead to the collapse of the party.\nBut he also said he wants Peter Obi, presidential candidate of Labour Party to be his running mateKwankwaso, a former Governor of Kano State, who was in Gombe State to inaugurate the state office of NNPP and meet with elected members of the party stated this in an interview with newsmen.\nKwankwaso confirmed that his party had been in talks with the Labour Party for possible merger but the main issue that hindered progress was the issue of who becomes the presidential candidate.\n“From the discussion with Labour Party, the main issue was who becomes the president if the parties merge.\n“If now I decide to be vice presidential candidate to anybody in this country; NNPP will collapse, because the party is based on what we have built in the last 30 years."
  },
  {
    "headline": "Nigeria's oil thieves snatch $1 billion worth of crude",
    "summarized_story": "Nigeria lost $1 billion in revenue during the first quarter of this year due to crude oil theft, the petroleum regulator said, warning the massive theft was a threat to the economy.\nGbenga Komolafe, the head of the Nigerian Upstream Petroleum Regulatory Commission, said of the 141 million barrels of oil produced in the first quarter of 2022, only about 132 million barrels of oil were received at export terminals.\n“This indicates that over nine million barrels of oil was lost to crude oil theft … this amounts to a loss in government revenue of about $1 billion … in just one quarter,” Komolafe said in a statement.\nCrude oil theft has increased to a daily average of 108,000 barrels in the first quarter of 2022 from 103,000 barrels in 2021, Komolafe said.\nPresident Muhammadu Buhari has pledged to ensure that oil theft is stopped and has set up dedicated courts to combat the problem, but it still persists."
  },
  {
    "headline": "I’m not aware of Tinubu’s plans to reconcile us – Amaechi",
    "summarized_story": "A former All Progressives Congress (APC) presidential contender, Chibuike Rotimi Amaechi, has denied knowledge of purported plans by the party’s presidential candidate, Bola Tinubu, to reconcile him and Senator Magnus Abe.\nThe ex-Minister of Transportation made the denial when he was interviewed by journalists in Port Harcourt, Rivers State.\nHe expressed willingness to meet with the aggrieved members of the party and address their grievances in order to move Rivers APC forward.\n“I am not aware that there are plans by Asiwaju Ahmed Bola Tinubu to reconcile myself and Magnus Abe,” Amaechi stated.\nThe police have not invited me; ICPC has not invited me and EFCC has not invited me."
  },
  {
    "headline": "Wike returns to Rivers after vacationing in Turkey",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has returned to the state after spending a few days in Turkey.\nWike, alongside his Abia State counterpart, Okezie Ikpeazu traveled to Turkey on a vacation and were later joined by Oyo State Governor, Seyi Makinde.\nWike recently lost the contest for the presidential ticket of the Peoples Democratic Party to Alhaji Atiku Abubakar and the vice presidential ticket to his Delta State counterpart, Ifeanyi Okowa.\nWike was said to have also ignored emissaries sent by Atiku while in Turkey.\nHe was also said to have constantly ignored calls from the former VP who had been making efforts to pacify him."
  },
  {
    "headline": "Drogba: Osimhen Can Be ‘Best Striker In The World’",
    "summarized_story": "Didier Drogba, a former captain of COTE D’IVOIRE and Chelsea, thinks that Nigerian striker Victor Osimhen has what it takes to be the best in the world.\nHe had 14 goals and two assists for Napoli in Serie A last season, helping the team finish in the Uefa Champions League spots.\nGreat striker.\nHe can be the best in the world and when you have the talent like he has got, I think it’s just a question of momentum,” the 44-year-old former Blues player said in an interview with Marco Giordano.\nOsimhen has found the target on 28 occasions through two seasons at Napoli, with his stock continuing to rise as further potential is unlocked."
  },
  {
    "headline": "I Walked Through Sambisa Forest For Three Days To Escape – Chibok Schoolgirl Held For Eight Years By Boko Haram",
    "summarized_story": "I Walked Through Sambisa Forest For Three Days To Escape – Chibok Schoolgirl Held For Eight Years By Boko HaramIn spite of allegations that she was saved by the Nigerian Army, one of the missing Chibok schoolgirls who was located on Wednesday described how she managed to free herself after eight years in captivity.\nWhen Boko Haram militants invaded the Government Girls’ Secondary School (GGSS) in Chibok, Borno state, on April 14, 2014, the child was one of more than 200 schoolgirls who were taken hostage.\nAfter their release, some of the kidnapped Chibok girlsShe escaped the militants’ stronghold in Borno State before being found on June 29 by Nigerian Army soldiers.\nThe woman, who identified herself as Ruth Bitrus, reportedly said that she had to journey through the Sambisa Forest for three days before receiving assistance from members of the 21 Armoured Brigade Bama.\n“My name is Ruth Bitrus, I escaped from the Sambisa Forest."
  },
  {
    "headline": "Scores of kidnapped children rescued from church underground in Ondo",
    "summarized_story": "No fewer than 50 people including children were rescued from an underground apartment in a church in Ondo town, Ondo State, by the operatives of State Police Command.\nSources disclosed that the people were said to be abducted and kept in the underground cell in the Whole Bible Believer Church located in the Valentino area of the city.\nThe rescued people were seen in three buses escorted by police patrol vehicles that conveyed them to Police Command headquarters in Akure.\nWhen contacted, the spokesperson for the State Police Command, Funmi Odunlami, confirmed the development.\nAccording to her, “I don’t have the details yet but they are bringing the victims to the headquarters."
  },
  {
    "headline": "Pictures: Drama as ex-President, Olusegun Obasanjo, drives commercial tricycle, picks intra-city passengers in Ogun",
    "summarized_story": "Former President Olusegun Obasanjo drove a commercial tricycle, popularly known as Keke NAPEP, to pick intra-city passengers in Abeokuta, Ogun State capital, on Saturday.\nThe 85-year-old National Open University’s graduate said his action was informed by the desire to show the teaming youths that there were many opportunities to legitimately make a living in the country.\nThe former president added that his action was to further stress what he said earlier that with ‘Keke NAPEP’ business, which his government launched in November 2002, Nigerian youths could still be self-reliant.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Tinubu debunks meeting Wike in France",
    "summarized_story": "The presidential candidate of the All Progressive Congress (APC), Asiwaju Bola Tinubu, has dismissed reports that the Rivers state governor, Nyesom Wike, met with him in France.\nA statement signed by a spokesperson of the Tinubu Media Office, Tunde Rahman, Friday described the reports as “fake”.\nAlthough Asiwaju Tinubu is presently in France, he didn’t have any meeting with Governor Wike whether in that country or anywhere whatsoever.\n“This, however, does not detract from the fact that the APC presidential candidate holds Governor Wike in high esteem.\n“As made public earlier, Asiwaju Tinubu is in France for some important engagements."
  },
  {
    "headline": "Group Berates Oil Marketers, Commends Kyari",
    "summarized_story": "The Coordinator, Stand Up Nigeria, Sunday Attah, on Saturday berates the action of some oil marketers who are hiding under various claims to create artificial logjams in order to force the government to increase the pump price of fuel.\nAttah describe the development as most unfair as even under the current arrangement where the official pump price is N165 the marketers still make huge profits.\nThe group however, exonerated the NNPC from playing any role in the ongoing scarcity after carrying out investigation into the cause of the problem.\nThis is most unfair as even under the current arrangement where the official pump price is N165 the marketers still make huge profits”.\nWe therefore call on the marketers to show more sense of patriotism by taking into cognisance the pains they put other Nigerians through just to make profit."
  },
  {
    "headline": "ACCI Appoints MD/CEO Bristol Group as Vice President – Industry",
    "summarized_story": "The Executive Committee and Council Members of Abuja Chamber of Commerce and Industry has appointed the group Managing Director and Chief Executive Officer (MD/CEO) of Bristol Group, Dr Chijioke Ekechukwu as the Vice President -Industry of the Chamber.\nThe President of ACCI, Dr Al-Mujtaba Abubakar announced the appointment of Dr Ekechukwu at the 16th EXCO meeting on Thursday as ACCI VP Industry to replace the late Ichie Jude Igwe who occupied the position till his demise on the 15th of October 2021.\nDr Chijioke has served as the Director General ACCI betweeen 2017 and 2018.\nHe is on the Board of First Generation Mortgage Bank Ltd, Abuja, Bristol Academy Ltd and Dignity Finance and Investments Ltd.\nHe is also the Chairman of Oriental Rice Mill Ltd.Dr. Ekechukwu, a former President of Rotary Club of Abuja is happily married with children."
  },
  {
    "headline": "Economy Diversification: Why Nigeria’s mining sector offers robust economic potential- Adegbite",
    "summarized_story": "“Let me emphasis that, investment in the minerals and mining sector by stakeholders is a patriotic duty of every citizen who believe in the Nigerian Project.\nThe Federal government is developing a well governed mining sector with sustainable capacity and has also articulated a roadmap to address some of the identified challenges in the mining sector.\nThe initiatives and strategies outlined in the roadmap are designed largely to make the mining and minerals sector an irresistible destination for global capital.\nIn addition, developmental plans should take into cognizance the overall development aspirations of the State alongside the prospects and challenges of mining activities“The Mining sector to significantly contribute to Nigeria’s economy cannot be over-emphasized.\nKey programs of relevance to the sector must be critically and more robustly assessed by qualified professionals in the mix of our national development."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Russian-Ukraine War: Buhari wants EU to increase oil and gas purchases from Nigeria",
    "summarized_story": "By Mathew Dadiya, AbujaPresident Muhammadu Buhari, Thursday in Lisbon, Portugal, indicated that Nigeria is ready to fill the natural gas gaps in Europe predicated by the current Russian-Ukrainian war.\nThe President also said with over 200 million mainly young people, Nigeria is ready to be the hub of the African Continental Free Trade Area (AFCFTA).\nIn his statement on areas of cooperation between Nigeria and Portugal delivered at the Presidential Palace in Lisbon, Buhari urged Portugal to consider Nigeria as a valued and trusted partner in Africa.\nOn oil and gas, Buhari said with the current Russian-Ukraine war, increased cooperation in oil and gas between the two countries has become vital to avoid a crisis in the demand and supply chain, even as Nigeria is already a major supplier of gas to Portugal.\nBuhari also stressed the need to establish a Joint Commission, saying:‘‘We believe that the establishment of a Joint Commission will help to promote the full realization of the objectives of our bilateral relations."
  },
  {
    "headline": "[UPDATED] Police Rescue Children Allegedly Being Held By Church In Ondo, Make Arrests",
    "summarized_story": "﻿The police in Ondo State have found and rescued children allegedly being held by a church at its premises in Ondo Town, Ondo State.\nPublic Relations Officer of Police Command in the state, Mrs Funmilayo Odunlami, told Channels Television that the children were being held on the premises of the church which is located in the Valentino area of Ondo Town.\nIn a statement issued after the news broke, she explained that the police to action following intelligence report gathered by the Police at Fagun Division, Ondo Town, “that some children are being harboured at The Whole Bible Believers Church AKA Ondo Church, Valentino area, Ondo Town”.\n“Policemen were sent to the Church to invite the Pastor and the members of the Church on sighting the Police attacked them,” she added.\n“In all, 77 members – Twenty Six (26) children, Eight (8) teenagers and Forty-Three (43) adult members were rescued,” she disclosed."
  },
  {
    "headline": "Obasanjo Rides Tricycle, Picks Passengers In Abeokuta",
    "summarized_story": "Former President Olusegun Obasanjo on Saturday surprised residents of Abeokuta, the Ogun State Capital as he rode a tricycle across some major parts of the town, taking some passengers along for the ride.\nChief Obasanjo took off from the Moshood Abiola Way, a stone’s throw to the Nigeria National Petroleum Corporation (NNPC) mega station.\nHe turned 85 in March but has continued to engage in activities to celebrate the milestone.\nAt the event tagged “OBJ @85”, free tricycles were presented through the Youth Development Centre of the Olusegun Obasanjo Presidential Library.\n“The first thing we want to prove is that there are opportunities galore in this country,” he said."
  },
  {
    "headline": "Allowing People To Bear Arms Can Lead To Anarchy, Zamfara PDP Warns Matawalle",
    "summarized_story": "The Zamfara State chapter of the Peoples Democratic Party has opposed Governor Bello Matawalle’s directive to the people of the state to bear arms and defend themselves.\nSecretary of the PDP in the state, Faruku Ahmed, said in a statement that the decision to allow people to bear arms could lead to anarchy and political vendetta against the opposition parties.\n“As peace-loving and law-abiding citizens, we fault Zamfara State and the Federal Government for shifting such constitutional responsibility to ordinary citizens,” he said.\nRather than encourage residents to bear arms, he said the party had advised the state government to recruit community protection guards similar to JTF.\nThe Zamfara State governor, Bello Matawalle had on Sunday last week directed the people of the state to prepare and obtain a license to bear firearms to defend themselves against the Terrorists in the State."
  },
  {
    "headline": "I Walked For Three Days To Escape, Says Chibok Girl Held For Eight Years In Sambisa Forest",
    "summarized_story": "﻿One of the Chibok schoolgirls abducted by Boko Haram terrorists on April 14, 2014, has shared how she escaped from captivity after eight years.\nThe insurgents had stormed the Government Girls Secondary School in Chibok, Borno State where they whisked away over 250 girls who were writing their final exams at the time.\nHaving fled the terrorists’ enclave in Borno State, she was eventually discovered by troops of the Nigerian Army on June 29.\n“My name is Ruth Bitrus, I escaped from the Sambisa Forest.\nTheir escape followed sustained massive offensives by the troops of Operation Hadin Kai, leading to hunger and displacement in the terrorists’ enclaves."
  },
  {
    "headline": "FIBA World Cup Qualifiers: D’Tigers Advance To Second Round After Mali No-Show",
    "summarized_story": "Nigeria’s senior men’s national basketball team, D’Tigers have advanced to the second round of the FIBA African World Cup qualifiers with a game to spare after walking over Mali.\nDespite losing their first game of the third window of the qualifiers to Cape Verde, D’Tigers are through to the final qualification phase after Mali failed to turn up for their second group A game, thereby forfeiting the points to Nigeria.\nUnder FIBA rules, the Malians have now been disqualified after forfeiting for the second time.\nREAD ALSO: Fifth Seed Sakkari Shocked By Maria At WimbledonBased on FIBA’s qualification guidelines, the top three teams from each group will advance to the 12-team Second Round.\nIn the Second Round, each team will play each new team in their group during two tournaments played over two event windows scheduled in August 2022 and February 2023."
  },
  {
    "headline": "PDP Faults Governor Matawalle's Directives On Bearing Firearms -",
    "summarized_story": "The Peoples Democratic Party in Zamfara has kicked against the state Governor, Bello Matawalle, over his directive for citizens to bear arms for self defenceThe decision according to the PDP could lead to lead to anarchy and political vendetta against the opposition partiesThe state secretary of the party, Faruku Ahmed stated this at a press conference held at the party’s secretariate in Samaru, GusauHe says it is the sole responsibility of government at all levels to protect the lives and property of all citizensThe Zamfara main opposition party insist the Matawalle’s decision is uncalled for“Security is everybody’s business, hence to secure the lives and property is the responsibility of the state and federal governments“ He said” As peace-loving and law-abiding citizens, we fault Zamfara State and the Federal Government for shifting such a serious constitutional responsibility to ordinary citizens whom majority are struggling to meet their daily damand” Ahmed maintained“It has been clear that the security agencies, groups and legal experts within and outside the state have opposed the firearms acquisition deal”The PDP noted that the ruling APC’s failure has left Governor Bello Matawalle with no option than to manipulate the insecurity situation within the state to witch-hunt opposition https://www.tvcnews.tv/purplegold/post-new.php#parties.\n“As such, the PDP perceived the exercise as a deliberate attempt to divert public resources.”The PDP through it’s Secretary, therefore, called on the federal government and heads of security agencies to stop Governor Matawalle from what they described as dangerous plan of allowing people to bear arms which may not be for the good of the country.\nThe opposition party is also accusing the state government under the leadership of Governor Bello Matawalle of esterblishing security Committees that is Targeted at frustrating opposition parties in the state“We are calling on the Inspector General of police, the DSS and the NSCDC to be eagle eye on the ill-intention of targeting the opposition parties using various security committees established by Zamfara State government because the approach seems to be so tricky.” The PDP Lament."
  },
  {
    "headline": "APC Northwest excos pledge to deliver zone in 2023",
    "summarized_story": "The Northwest Leadership of the ruling All Progressive Congress (APC) has pledged to ensure the party emerges victorious in the coming general elections.\nMr. Salihu Lukman, who is National Vice Chairman of the Northwest region explained that the zone has the political strength to secure victory for the party in 2023.\nHe made this known in Kaduna when critical stakeholders of the party met to strategize on ways to take their campaigns to the grassroots.\nThey also advised the party’s supporters within the zone to ensure they register and obtain their PVC’s."
  },
  {
    "headline": "Tinubu’s supposed meeting with Gov Wike in France is fake news",
    "summarized_story": "The media office of the Presidential candidate of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has described as fake news, the APC stalwart’s supposed meeting with Governor Wike in France.\nIn a statement issued on Friday by the Tinubu’s Media Office, the APC presidential candidate’s media aide said there’s no iota of truth in the trending video and reports.\nAlthough Asiwaju Tinubu is presently in France, he didn’t have any meeting with Governor Wike whether in that country or anywhere whatsoever.\n“This, however, does not detract from the fact that the APC presidential candidate holds Governor Wike in high esteem.\nAnd given the national and across-party lines appeal of Asiwaju Tinubu’s candidature, he will not hesitate to meet any important national leader when desirable."
  },
  {
    "headline": "APC Youth appoint Taskforce to coordinate activities",
    "summarized_story": "Ginika Tor has been appointed as the Secretary of the All Progressives Congress (APC) Youth Wing National Task Force on Revalidation and Registration of APC youth led and youth focused support groups.\nThe National Youth Leader of the party, Dayo Israel announced her appointment in Abuja while inaugurating the taskforce which had a former Commissioner for Youth in Kwara State, Ben Duntoye as the Chairman.\nThe taskforce is part of efforts aimed at galvanising support for the All Progressives Congress towards the 2023 General Elections across the country.\nThe taskforce will also serve as a source of reference to coordinate the actions of all Youth Groups associated with the All Progressives Congress nationwide to support the Presidential aspirations of the Candidate of the party for the 2023 Presidential Elections, Asiwaju Bola Ahmed Tinubu.\nThe Vice Presidential Candidate is expected to emerge on or before the Eid-Ul-Kabir."
  },
  {
    "headline": "US: Biden Predicts States Will Try to Arrest Women Who Travel for Abortions",
    "summarized_story": "President Joe Biden predicted on Friday that some U.S. states will try to arrest women for crossing state lines to get abortions after the Supreme Court overturned the constitutional right to the procedures nationwide.\nWomen in those states seeking an abortion may have to travel to states where it remains legal.\nBiden said the federal government will act to protect women who need to cross state lines to get an abortion and ensure their access to medication in states where it’s banned.\nAbortion rights groups have filed legislation in multiple states seeking to preserve the ability of women to terminate pregnancies.\nread more“(The) filibuster should not stand in the way of us being able to (codify Roe),” Biden said."
  },
  {
    "headline": "New York Bans Guns in Many Public Places after Supreme Court Ruling",
    "summarized_story": "New York state passed a law on Friday banning guns from many public places, including Times Square, and requiring gun-license applicants to prove their shooting proficiency and submit their social media accounts for review by government officials.\nThe law, passed in an emergency legislative session, was forced by a landmark U.S. Supreme Court ruling last week that struck down New York’s restrictive gun-license laws.\nThe court’s conservative majority ruled for the first time that the U.S. Constitution grants an individual the right to carry weapons in public for self-defense.\nNew York’s Democratic leaders have decried the ruling and the court, saying there will be more gun violence if there are more people carrying guns.\nThe court ruled in New York State Rifle & Pistol Association v. Bruen that New York licensing officials had too much subjective discretion over who could enjoy what it said was a constitutional right."
  },
  {
    "headline": "Buhari: Killing of 30 Soldiers, 7 Policemen By Terrorists in Shiroro, a Direct Assault on Nigeria",
    "summarized_story": "Nigeria President Muhammadu Buhari on Friday described the killing of 30 soldiers, seven mobile policemen and two civilians in Shiroro Local Government Area of Niger State last Wednesday by terrorists as a direct assault on Nigeria, vowing that the attackers would not go unpunished.\nThe security agents were ambushed by the terrorists on their way to a mining site in Shiroro, in response to a distress call.\nBuhari in a statement by his spokesman, Mallam Garba Shehu, titled, “President Buhari: Attack on Shiroro is an attack on Nigeria herself.\nThe army chief spoke while addressing newsmen at Mogadishu Cantonment Juma’at Mosque prayer in commemoration of the Nigerian Army Day Celebration, (NADCEL) 2022 and the 159 years of its existence.\n“We are celebrating 159 years of the existence of the Nigerian Army."
  },
  {
    "headline": "Nigeria, Germany Sign Historic Joint Declaration on Return of 1,130 Benin Bronzes",
    "summarized_story": "Nigeria and Germany have signed a historic joint declaration that will formally pave the way for the return of 1,130 Benin Bronzes to Nigeria, 125 years after they were looted from the ancient Benin Kingdom during the Benin Expedition of 1897.\nThe landmark proclamation was signed in Berlin, Germany on Friday.\n“Germany has gained more friends in Nigeria and all over the world by returning to Nigeria what rightfully belongs to it,” Mohammed said.\nOn his part, Ambassador Dada called Germany the “champion of justice and fairness.”In her remarks, the German Minister of Foreign Affairs, Ms. Baerbock, said it was “morally impermissible” to take the Benin bronzes.\nThis is the beginning to right the wrong.”At the signing ceremony and in a symbolic gesture signifying the impending return of the artefacts, two of the Benin Bronzes were handed over to Nigeria."
  },
  {
    "headline": "US Senators Demand Relisting of Nigeria on Religious Freedom Concern List for Violence Against Christians",
    "summarized_story": "They alleged that recent acts of violence targeting Nigerian Christians have underscored the deteriorating state of religious freedom in the country.\n“Last year, however, you inexplicably removed Nigeria’s designation as a Country of Particular Concern (CPC) despite no demonstrable improvement in the country’s religious freedom conditions.\n“Recent high-profile acts of violence underscore the intense religious persecution that is regularly experienced by Nigerian Christians.\nWe remain concerned that the Nigerian government is failing to protect the religious freedom and basic safety of its Christian citizens.\n“The State Department released its 2021 Report on International Religious Freedom on June 2, which starts the 90-day timeline for the Department to make its religious freedom designations."
  }
]