[
  {
    "headline": "Russian gas exports drop 27% January-May",
    "summarized_story": "Russia’s Gazprom said, Wednesday, that its gas exports to countries outside of the former Soviet Union dropped by more than a quarter year-on-year between January and May after losing several European clients.\nExports to countries outside the region totalled 61 billion cubic metres, a 27.6 per cent fall from the same period last year, the energy giant said in a statement.\nSince Russian President Vladimir Putin sent troops into Ukraine on February 24, Moscow had demanded that clients from “unfriendly countries” – including EU member states, paid for their gas in rubles.\nSo far, Poland, Bulgaria, Finland, and the Netherlands have had their natural gas deliveries suspended over refusing to pay in rubles.\nEU countries had scrambled to reduce their dependency on Russian energy but were divided about imposing a natural gas embargo as several member states were heavily reliant on Moscow’s energy supplies."
  },
  {
    "headline": "Southerners are noisemakers, North’ll remain in power –Apostle Suleman",
    "summarized_story": "General Overseer of Omega Fire Ministries, Apostle Johnson Suleman, has doubted the emergence of a southerner as the next president of Nigeria.\nHe said this during his church’s convention in Abuja, saying that the northerners work as a team.\nWhy do you think the North has been in office and power for many years?\nEven if the North is not in the office, the North will be in power.\nAtiku knew the Southerners were noisemakers, and he worked on it."
  },
  {
    "headline": "How Buhari administration encouraged corruption — Buba Galadima",
    "summarized_story": "Buba GaladimaBy Miftaudeen RajiA former member of the board of trustees (BoT) of the All Progressives Congress, APC, Buba Galadima has decried the approach of President Muhammadu Buhari towards nipping corruption in the bud in his administration.\nGaladima, while giving his assessment of the fight against corruption in Nigeria, said the arrest of the former Accountant-General of the federation, Ahmed Idris did not justify that the Buhari-led administration was fighting corruption.\nGaladima, who spoke on a Channels TV programme, said: “Do you believe this man is fighting corruption because he arrested the Accountant-General?\nSpeaking on the specific area the next President would need to work on, Galadima said: “He has to build trust between the governed and the people in government.\n“The beginning of insecurity in Nigeria starts with the stealing of public funds by governors (the local government funds)."
  },
  {
    "headline": "Bamise Murder: BRT driver, Ominnikoron’s trial stalled by okada ban",
    "summarized_story": "By Onozure Dania, LagosThe trial of Andrew Ominnikoron, the driver of Bus Rapid Transit (BRT) who allegedly raped and murdered a 22-year-old fashion designer, Oluwabamise Ayanwole, was, today, stalled due to the ban of commercial motorcycles popularly known as okada.\nGovernor Babajide Sanwo-Olu of Lagos State had, on May 18, announced a total ban on the operations of okada in six local government areas in the state with effect from June 1 (today).\nMartins said: “I don’t think the defendant’s counsel, Abayomi Omotubora, is here and the Correctional Service did not bring inmates to court because of the Okada ban and security reasons.\n“However, we have three witnesses in court.\n“The second prosecution witness (PW2), who needs to finish giving his evidence, and two other witnesses are in court."
  },
  {
    "headline": "2023: Ikeyina emerges SDP presidential candidate",
    "summarized_story": "*…as party extends olive branch to factional groupBy Levinus Nwabughiogu, AbujaSenator Ebenezer Ikeyina, on Tuesday, emerged the presidential candidate of Social Democratic Party (SDP).\nThe Chairman of the National Convention Organising Committee, Chief Mike Odunrinde, who presided over the election in the national convention held in Abuja, said that out of the 311 delegates accredited, 308 voted to elect Ikeyina who represented Anambra Central in the Senate.\nShonibare also gave hints of an extraordinary convention disclosed upon the final determination of the court case bedeviling the party.\nAnd one thing I can assure you is that we will not back-off.\n“So we will continue to do all that we can to ensure that the candidates are not put in any more jeopardy."
  },
  {
    "headline": "Moghalu explains political leadership, plans for economy, security, education",
    "summarized_story": "“Our failure to understand this is why we tend to make the wrong leadership choices.\nMoghalu noted that, in 2023, Nigeria’s national situation requires Nigerians to elect a President that will fix the economy, unite the nation’s diverse peoples, secure territorial borders, as well as restore Nigeria’s standing in the world.\nHe said, “It is up to us as Nigerians to decide if we will be fooled again in 2023.\n“In 2023 Nigerians should elect a candidate who has the competences, experience and performance track record that is directly relevant to the job.\nHe noted that the impact of his life’s work so far has been deep, international, national, and local, empowering millions of people in Nigeria and around the world."
  },
  {
    "headline": "FCT Police Storm Kidnapper’s Den at Dadu Hills, Kuje, Rescue 4 Kidnapped victims, dislodge Bandits",
    "summarized_story": "“Unfortunately, the Criminal elements upon sighting the gallant advancement of the team engaged them in a gun duel where a member of the Destiny hunter paid the ultimate price .\n“The miscreants retreated with various degrees of gunshot injuries owing to the superior firepower of the team.\n“Given the above, the victims were taken to the hospital for medical examination and subsequently reunited with their families.\n“The FCT Commissioner of Police while extending condolences to the family of the deceased reassured residents of the Command’s unflinching commitment to riding the Territory of crime and criminality.\n“This should be done through the following emergency lines: 08032003913, 08061581938, 07057337653, and 08028940883, While the Public Complaint Bureau (PCB) desk, could be reached on: 0902 222 2352.”"
  },
  {
    "headline": "Attacks: We’ll retaliate – Rwanda Minister, Biruta issues warning to Congo",
    "summarized_story": "Rwanda’s Foreign Ministry has said the nation would fight back if it suffers further attacks from the neighbouring country, the Democratic Republic of Congo.\nForeign Minister, Vincent Biruta, told reporters on Wednesday after accusing Congo of firing shells across the border in May this year.\nCongo had summoned Rwanda’s ambassador and suspended RwandAir flights to Congo last weekend in response to what it said was Kigali’s support for M23 rebels carrying out a military offensive in its eastern borderlands.\nThe clashes threaten to unravel relations between both countries, which had improved since Congolese President Felix Tshisekedi came to power three years ago.\nThe M23 insurgency stems from the long fallout of the 1994 genocide in Rwanda"
  },
  {
    "headline": "2023: Be on alert, Buhari planning to impose president on us – Dino Melaye to Nigerians",
    "summarized_story": "Former lawmaker, Senator Dino Melaye has alleged that President Muhammadu Buhari is working towards imposing his successor on Nigerians.\nHe stated this while reacting to Buhari’s comment asking the APC governors to support him in choosing his successor.\nBut Dino, in the video, tackled the president for using the word ‘successor’ and not party flag bearer, alleging that Buhari is aiming at imposing the next president on Nigerians.\nThe president used the word successor and not flagbearer or candidate of the APC.\n“That statement has some negative effects and the negative effect is that Buhari wants to impose a president on Nigerians."
  },
  {
    "headline": "Biafra Remembrance Day: We’re not terrorists, criminals as claimed by Buhari govt – IPOB",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Wednesday rejected the terrorism tag by the Nigerian Government.\nEmma Powerful, the spokesman of IPOB, accused the Nigeria Police Force and Nigerian Army of deliberately attempting to assassinate the character of its members.\nPowerful said immigrations and police officers across the world could attest to the fact that members of the separatist group are not terrorists and criminals.\nHe stated this in his statement to mark May 30, a day set aside for Biafra Remembrance Day.\nWe are no Terrorists; we are no criminals as our oppressor Nigeria wished to tag us."
  },
  {
    "headline": "War: Germany hands Ukraine major boost in battle with Russia",
    "summarized_story": "Germany will send IRIS-T air defense systems to the government of Ukraine amid the ongoing war between Ukraine and Russia.\nScholz said Germany would send its “most modern air defense system,” the IRIS-T, to enable Ukraine to fight Russia.\n“In the coming weeks, we will supply further weapons, for example, the German government has recently decided that we will supply the IRIS-T system, the most modern air defense system that Germany has,” Scholz said.\n“This will enable Ukraine to protect an entire city from Russian air attacks,” he said.\nRecall that the war between Ukraine and Russia began in February this year and several casualties have already been recorded."
  },
  {
    "headline": "2023 elections: Don’t heat up polity – Delta NSCDC Commandant, Akinsanya warns politicians",
    "summarized_story": "Ahead of the forthcoming 2023 general elections, the Delta State Command of the Nigeria Security and Civil Defence Corps, NSCDC, on Wednesday advised politicians not to heat up the polity in order not to breach the security apparatus in the state.\nDelta State NSCDC Commandant, Akinsanya Iskilu Abiodun handed down the advice at a Peace Summit held in Asaba, the state’s capital.\nThe NSCDC boss warned against money politics.\nAkinsanya warned politicians that the command under his watch will not tolerate money politics nor vote buying which is inimical to the socio-political and economic well-being of the country.\nAkinsanya said that 2023 to all lovers of Nigeria should be an opportunity to vote for true leaders and not for politicians."
  },
  {
    "headline": "Bamise murder: Okada ban stalls BRT driver’s trial",
    "summarized_story": "The trial of a Bus Rapid Transit (BRT) driver Andrew Ominnikoron, accused of the rape and murder of a 22-year-old fashion designer, Oluwabamise Ayanwole, was stalled at the Lagos State High Court, Tafawa Balewa Square (TBS) on Wednesday.\nThe Okada ban came into effect on Wednesday.\nLagos Director of Public Prosecutions (DPP), Dr Babajide Martins, noted the NCoS’ security concerns when the case was called.\nOminnikoron, 47, is facing a five-count charge of rape, conspiracy, felony, sexual assault, and murder preferred against him by the Lagos State Government.\nThe alleged offences were said to contravene Sections 411, 223, 260 and 165 of the Criminal Law of Lagos State, 2015."
  },
  {
    "headline": "Kwara reopens school shut over hijab crisis",
    "summarized_story": "The Kwara State government has directed the reopening of Oyun Baptist High School, Ijagbo.\nThe government closed the school over three months ago after a bloody hijab controversy.\nIn a statement, Permanent Secretary, Ministry of Education and Human Capital Development, Mrs. Mary K Adeosun said the ministry “wishes to announce the reopening of the Oyun Baptist High School Ijagbo from Friday June 3, 2022.\nRead Also: Abdulrazaq sets up committee to probe violence over hijab“The mnistry’s decision to reopen the school is one of the government’s multi-prongrd approaches to return normalcy to the school.\n“The government will not hesitate to shut the school again, among other things, if anything threatens the safety of the little children."
  },
  {
    "headline": "God has chosen Tinubu to fix Nigeria in 2023, says cleric",
    "summarized_story": "God has chosen Tinubu to fix Nigeria in 2023, says clericPastor Alamu David of the Christ Apostolic Church (CAC) Abule Egba, Lagos has claimed All Progressives Congress (APC) presidential hopeful, Asiwaju Bola Tinubu will succeed President Muhammadu Buhari in 2023.\nThe cleric, in a statement, explained: “God revealed to me on the 24th June 2008 that a man with the name Bola Ahmed Tinubu will rule the nation, Nigeria for its betterment and I have a strong faith that the time is here; 2023.\n“I strongly believe only ‘A man of pedigree’ Baba Bola Ahmed Tinubu fits into this office.\n“The incumbent president and his vice, Senate President and the speaker, all climbed on this ladder to attain their respective offices.\nI am also appealing to the elders of the Yoruba tribe to intervene, solicit and support him.”"
  },
  {
    "headline": "Full list of 27 Imo APC House of Assembly candidates",
    "summarized_story": "The list of 27 candidates elected on the platform of the All Progressives Congress(APC) forImo House of Assembly have emerged.\nThe list of the 27 successful House of Assembly released by Publicity Secretary, Cajetan Duke, include:1.\nIHITE UBOMA LGA: HON.\nOWERRI NORTH LGA: KELECHI ONUMAJURU OFURUM.\nOWERRI WEST LGA: KANAYO ONYEMACHI"
  },
  {
    "headline": "One killed as Police rescue 4 in gun battle with bandits in Abuja",
    "summarized_story": "One killed as Police rescue 4 in gun battle with bandits in AbujaThe Federal Capital Territory (FCT) Police Command has rescued four kidnapped victims in a concerted effort with the Destiny hunters at Dadu hills Via Chukwuku in Kuje Area Council of the Territory.\nThe development, police said, followed the receipt of actionable intelligence about the movement of suspected Bandits holding some persons hostage.\nUnfortunately, the police said the criminal elements upon sighting them engaged them in a gun duel where a member of the Destiny hunter was killed.\n“The miscreants retreated with various degrees of gunshot injuries owing to the superior firepower of the team.\n“Given the above, the Victims were taken to the hospital for medical examination and subsequently reunited with their families”, Adeh added."
  },
  {
    "headline": "Kaduna: Boko Haram raze eight vehicles, abduct many in latest Birnin-Gwari attack",
    "summarized_story": "From Sola Ojo, KadunaTerrorists suspected to be working with the Ansaru faction of the graded Boko Haram have allegedly set eight vehicles on fire and abducted occupants in their latest nefarious activity along the Birnin-Gwari-Kaduna highway.\nMore so, none of these politicians deems it fit to visit Birnin-Gwari to either see delegates, but rather called delegates to Kaduna for consultations.\nEqually, we pray for the safe return of our people mostly women and children that were abducted.\n“We are citizens of this country and not prodigal sons that were wondering, like sheep without a shepherd.\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "2023 Presidency: Lawan, North-East should be grateful to Orji Kalu – Bashir Lamido",
    "summarized_story": "The Director General of Arewa Summit International, Dr. Bashir Lamido has commended Senator Orji Uzor Kalu’s support for the Senate President, Ahmad Lawan ahead of the 2023 presidential election.\nAccording to Lamido, Senator Kalu has proven that he is a detribalised Nigerian who is always ready to defend the oppressed.\n“Leaders of the North East geo-political zone including the Senate President should appreciate Kalu for being bold enough to champion the course of the zone.\nIt further means that the justice is on its way to the South East .\n“I am most glad because he is from the North East, the only zone alongside South East that is yet to produce President of Nigeria."
  },
  {
    "headline": "Primary: Buhari meets govs, gives hint of preferred successor",
    "summarized_story": "He said this when he had audience with the 22 governors and the National Chairman of the party, Senator Abdullahi Adamu, yesterday.\nBuhari said: “Second term Governors have been accorded the privilege of promoting successors that are capable of driving their visions as well as the ideals of the party.\nHe tasked the governors to ensure the forthcoming convention to pick a presidential candidate reflects all the values and virtues of the party.\nOur party, the APC, shall not be any different, more so as we are still implementing the blueprint for a more prosperous nation.\nWe will support Mr President to have a very successful convention,” he said."
  },
  {
    "headline": "Search for Atiku’s running mate widens in South East",
    "summarized_story": "By Doris ObinnaA few days after former Vice President, Alhaji Atiku Abubakar, emerged as presidential candidate of the opposition Peoples Democratic Party (PDP), the search for his running mate has widened in the South East.\nAtiku and the leadership of the PDP are considering either the South East or South South as a place to pick the running mate, in the North-South presidency composition.\nSources revealed that apart from Wike, Emmanuel, Okowa and Anyim, the search for the running mate has widened in the South East, with fresh names being mentioned.\nAmong those whose names have also come up are former Senate President, Ike Ekweremadu; ex-Enugu State governor and senator representing Enugu East, Dr. Chimaroke Nnamani and former Imo State Governor, Emeka Ihedioha.\nDaily Sun gathered that Atiku is only receiving nominations and engaging in broad consultation, so that he would make a choice that would be acceptable to stakeholders in South East and South South."
  },
  {
    "headline": "Boko Haram commanders killed in clash with Borno hunters",
    "summarized_story": "From Timothy Olanrewaju MaiduguriA Boko Haram commander and his deputy have been killed during a clash with hunters and vigilante in a community in Borno StateLeader of the Hunters/Vigilante (Sarkin Baka) Northeast, Alhaji Mohammed Yohanna, made the disclosure, yesterday, in an interview.\nHe told newsmen on phone that the hunters encountered the insurgents at Shaffa Taku, a remote community on the edge of Sambisa, Boko Haram’s operational base in Damboa Local Government, on Monday.\nThe Boko Haram men have been terrorising communities in the area in the last two weeks,” he disclosed.\nHe said his team stormed the spot at Shaffa Taku, where the insurgents were sighted upon receipt of the information.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "News in Photographs: Osinbajo Presides over FEC Meeting",
    "summarized_story": "Vice President Yemi Osinbajo Wednesday presided over the weekly Federal Executive Council meeting.\nThe meeting held at the Council Chamber was attended by some cabibet members while others joined the meeting virtually from the various offices.President Muhammadu Buhari is currently on a visit to Spain.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Anxiety in Labour Party, as Court Okays Factional Leader’s Fresh Suit",
    "summarized_story": "The judge, Inyang Ekwo, made the order on Monday after hearing an ex parte application filed by a former Deputy national chairman of the party, Calistus Okafor.\nThe committee members are Salisu Mohammed, Lawson Osagie, Isa Aremu, Baba Aye, Ikpe Ektokudo, Sylvester Ejiofor, and Lucy Offiong.\nHe explained that he got the post by virtue of his position as Deputy National Chairman of the party when the late national chairman, Abdulsalam, was in office.\nHe said the LP constitution stipulated that the deputy national chairman should act and/or replace the chairman in the event of death or resignation.\nHe said, “The NLC and the TUC actually registered the Labour Party in 2006, but they were not the ones administering it."
  },
  {
    "headline": "Lawan Writes Delegates, Canvasses for Votes",
    "summarized_story": "This communication is an appeal to all APC delegates as the party prepares for its presidential primaries.\nI am reaching out to you, with humility, to ask for your votes so that I can emerge as the APC Presidential flag bearer for the 2023 Nigerian Presidential election.\nDear APC delegates, you have the sacred mission at this hour of history, during this hour of decision of taking this country to a plain beyond.\nWhile this is expected of every Nigerian, it starts with you, the APC delegates.\nTo this end, I ask for your precious votes and your dedication to our party, APC, and to our motherland."
  },
  {
    "headline": "Clark: Ayu a Thoughtless, Partial Leader, Should Resign",
    "summarized_story": "Clark, in a statement he personally signed yesterday, in Abuja, said with the outcome of PDP’s primary election, it had become imperative for Ayu to resign, saying he could no longer head the National Working Committee of the PDP.\nClark, however, hailed efforts of the Convention Committee that was chaired by former President of the Senate, Senator David Mark, and his assistants, particularly, the Governor of Bayelsa State, Senator Douye Diri.\n“Most disturbing is what happened at the Special National Convention of the PDP, in Abuja, on Saturday, 28th May 2022.\nSenator Ayu has failed to realise that what we are fighting for affects all minorities in Nigeria.\nSenator Iyorchia Ayu’s appalling, thoughtless and unpatriotic public conduct bears grave negative consequences."
  },
  {
    "headline": "Buhari Meets Governors, Moves to Choose Successor, Still Consulting",
    "summarized_story": "Buhari made the appeal at a meeting in Abuja with the governors, which was also attended by other stakeholders.\nThe president said the governors should reciprocate the party’s good gesture of allowing outgoing governors choose their successors in their respective states.\nHe assured that his choice presidential candidate would give Nigerians a sense of triumph and confidence ahead of the general election, and promised to sustain ongoing consultations ahead of the primary election.\nBuhari charged APC governors to ensure that the forthcoming convention to pick a presidential candidate reflected all the values and virtues of the party.\nHe said, “Zoning the presidential ticket to the north because PDP has a northerner as a presidential candidate does not make sense."
  },
  {
    "headline": "Our Fulani Kidnappers Told Us After Buying Enough Weapons, They Will Bombard Igboland, Take Over Nigeria— Methodist Prelate, Uche Recounts Ordeal",
    "summarized_story": "Dennis Mark were abducted on Sunday along the Enugu-Port Harcourt Expressway in the Umunneochi Local Government Area of Abia State.\nI thought it was a joke; I said we were going to pay N10 million and they said what?\nHe said they had taken his rings, chain, and the money they had on them and insisted on N150 million ransom.\nThe clergyman said the abductors later reduced the ransom to N100 million, warning that if they negotiate, they would be killed.\nThe priest maintained that military personnel of Fulani extraction were aiding the kidnappers who disguise as herders in the daytime but are kidnappers at night."
  },
  {
    "headline": "Our Fulani Kidnappers Told Us After Buying Enough Weapons, They Will Bombard Igboland, Take Over Nigeria— Methodist Prelate, Uche Recounts Ordeal",
    "summarized_story": "Dennis Mark were abducted on Sunday along the Enugu-Port Harcourt Expressway in the Umunneochi Local Government Area of Abia State.\nI thought it was a joke; I said we were going to pay N10 million and they said what?\nHe said they had taken his rings, chain, and the money they had on them and insisted on N150 million ransom.\nThe clergyman said the abductors later reduced the ransom to N100 million, warning that if they negotiate, they would be killed.\nThe priest maintained that military personnel of Fulani extraction were aiding the kidnappers who disguise as herders in the daytime but are kidnappers at night."
  },
  {
    "headline": "BREAKING: Ex-Imo Governor, Okorocha Arrives Venue Of Ruling APC Presidential Screening Few Hours After Leaving Detention",
    "summarized_story": "The embattled former Governor of Imo State and one of the presidential aspirants of the ruling All Progressives Congress (APC), Senator Rochas Okorocha has arrived at the venue of the party’s presidential screening in Abuja.\nThe APC presidential screening exercise which started on Monday is expected to end today (Tuesday).\nOne of his legal counsel, Steve Asimobi, had said that Okorocha would be attending the screening exercise of presidential aspirants later in Abuja.\n“His Excellency, Rochas Okorocha would be attending the APC presidential screening later today.\nThe judge also ordered the EFCC to return his international passport to the court today with immediate effect."
  },
  {
    "headline": "BREAKING: Ex-Imo Governor, Okorocha Arrives Venue Of Ruling APC Presidential Screening Few Hours After Leaving Detention",
    "summarized_story": "The embattled former Governor of Imo State and one of the presidential aspirants of the ruling All Progressives Congress (APC), Senator Rochas Okorocha has arrived at the venue of the party’s presidential screening in Abuja.\nThe APC presidential screening exercise which started on Monday is expected to end today (Tuesday).\nOne of his legal counsel, Steve Asimobi, had said that Okorocha would be attending the screening exercise of presidential aspirants later in Abuja.\n“His Excellency, Rochas Okorocha would be attending the APC presidential screening later today.\nThe judge also ordered the EFCC to return his international passport to the court today with immediate effect."
  },
  {
    "headline": "APC Primary: Senate President, Lawan Writes Delegates, Asks Them To Shun Moneybag Aspirants",
    "summarized_story": "Senate President Ahmad LawanThis contained in a letter to All the APC Delegates on Wednesday.\nThe key here is that one’s best predictor of future behavior is past behavior.\nI promise you that I will be that leader.”Here’s the full text of the letter;My Dear APC Party Delegates,Compliments of the season.\nThe key here is that one’s best predictor of future behavior is past behavior.\nTo this end, I ask for your precious votes and your dedication to our party, APC, and to our motherland."
  },
  {
    "headline": "'Many' abducted as bandits block Kaduna highway, set vehicles ablaze",
    "summarized_story": "Some travellers have been reportedly kidnapped by bandits along Kaduna-Birnin-Gwari road in Kaduna state.\nThe bandits were said to have blocked the highway on Tuesday to attack the travellers.\nEight vehicles were reportedly razed by the bandits during the attack.\n“Today 31st May, 2022, terrorists along Birnin-Gwari- Kaduna highway intercepted a convoy of motorists with security escorts between Kuriga and Manini near Udawa and preyed on an unspecified number of people that were abducted into the bush,” the statement reads.\n“We had always appreciated efforts of security personnel in their passion to curtail the precarious insecurity bedevilling Birnin-Gwari general area."
  },
  {
    "headline": "'Many' abducted as bandits block Kaduna highway, set vehicles ablaze",
    "summarized_story": "Some travellers have been reportedly kidnapped by bandits along Kaduna-Birnin-Gwari road in Kaduna state.\nThe bandits were said to have blocked the highway on Tuesday to attack the travellers.\nEight vehicles were reportedly razed by the bandits during the attack.\n“Today 31st May, 2022, terrorists along Birnin-Gwari- Kaduna highway intercepted a convoy of motorists with security escorts between Kuriga and Manini near Udawa and preyed on an unspecified number of people that were abducted into the bush,” the statement reads.\n“We had always appreciated efforts of security personnel in their passion to curtail the precarious insecurity bedevilling Birnin-Gwari general area."
  },
  {
    "headline": "'Vote candidate without baggage' -- Lawan woos APC delegates ahead of presidential primary",
    "summarized_story": "Senate President Ahmad Lawan has asked delegates in the All Progressives Congress (APC) to put monetary incentives aside and elect a presidential standard-bearer who does not have baggage.\nIn a letter addressed to APC delegates on Wednesday, Lawan said they should put the country first in their choices.\nThe senate president said the delegates should vote for him so he could become the presidential candidate of the ruling party and deliver good governance if elected.\n“I am reaching out to you, with humility, to ask for your votes so that I can emerge as the APC Presidential flag bearer for the 2023 Nigerian Presidential election,” he said.\nAnd that journey shall start during the APC Presidential Primary Election process."
  },
  {
    "headline": "'Vote candidate without baggage' -- Lawan woos APC delegates ahead of presidential primary",
    "summarized_story": "Senate President Ahmad Lawan has asked delegates in the All Progressives Congress (APC) to put monetary incentives aside and elect a presidential standard-bearer who does not have baggage.\nIn a letter addressed to APC delegates on Wednesday, Lawan said they should put the country first in their choices.\nThe senate president said the delegates should vote for him so he could become the presidential candidate of the ruling party and deliver good governance if elected.\n“I am reaching out to you, with humility, to ask for your votes so that I can emerge as the APC Presidential flag bearer for the 2023 Nigerian Presidential election,” he said.\nAnd that journey shall start during the APC Presidential Primary Election process."
  },
  {
    "headline": "LOWDOWN: Who is Buhari's preferred candidate? Enter the probables and the possibles",
    "summarized_story": "At his meeting with APC governors on Tuesday in Abuja, he said a number of things that were quite loaded and gave much away without revealing everything.\nANOINTING RATINGConvergence between Buhari and governors: **Connection with masses/victory chances: ***Counterweight to Atiku: **Continuity factor: ****BOLA AHMED TINUBUWHY?\nANOINTING RATINGConvergence between Buhari and governors: **Connection with masses/victory chances: **Counterweight to Atiku: **Continuity factor: ***OGBONNAYA CHRISTOPHER ONUWHY?\nANOINTING RATINGConvergence between Buhari and governors: *Connection with masses/victory chances: *Counterweight to Atiku: *Continuity factor: ***KAYODE JOHN FAYEMIWHY?\nANOINTING RATINGConvergence between Buhari and governors: *Connection with masses/victory chances: *Counterweight to Atiku: *Continuity factor: ***BABATUNDE GBOLAHAN BAKAREWHY?"
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Egypt-born Swvl lays off a third of its staff, two months after going public",
    "summarized_story": "Egypt-born and Dubai-headquartered mobility startup Swvl, has announced plans to lay off a third of its workforce.\nThis announcement was revealed in a letter sent to Swvl employees by CEO Mostafa Kandil on May 30.\nSince the merger, however, Swvl has lost more than half of that number and is now valued at $581 million.\nA source disclosed to TechCrunch, that the majority of the layoffs will come from the company’s Dubai and Pakistan offices.\nOver the past 2 months, the economic downturn has forced tech companies across the globe to lay off significant numbers of their workforce."
  },
  {
    "headline": "“The Experts” hits different 🤭",
    "summarized_story": "Nifemi, our Senior Reporter, recently added something new to her series, The Experts.\nDon’t worry if you don’t know anyone like this.\nWhile these developments appear to be interesting, Sundar Pichai, Google CEO, believes that Google should be doing more for Africa.\nStill on safety in Lagos State, the state government has established an Anti-Okada Squad to enforce the ban on okada riders, which is set to begin today, Wednesday, June 1, 2022.\nRecall that on May 18, 2022, the Lagos State Governor, Babajide Sanwo-Olu, declared a total and indefinite ban on okadas in those areas."
  },
  {
    "headline": "Exclusive: Google CEO, Sundar Pichai, on cutting edge innovation in Africa",
    "summarized_story": "Share this article:A familiar trend in recent years has seen big tech companies announce cutting edge innovations in key markets.\nIn an unprecedented move, Google invited Techpoint Africa for a chat with its CEO to address issues on Google’s innovative efforts in Africa.\nDespite all these initiatives, Sundar Pichai still believes that Google should be doing more for Africa.\nThis is eerily similar to the $1 billion Africa development fund which Pichai says has been a big focus for the company.\nHowever, Google’s flagship Android phone, Google Pixel, has struggled to make inroads in Africa."
  },
  {
    "headline": "How Joram Mwinamo has helped Kenyans make sense of their businesses since 2007",
    "summarized_story": "Interestingly, this article is about Joram Mwinamo, someone who is actively participating in the evolution of tech businesses in Kenya and has been part of the entrepreneurship ecosystem since 2007.\nAnd in 2020, Joram co-founded SNDBX, an entrepreneur support hub — an upgrade from WYLDE.\nBeing ambitious, he needed to create something that would help similarly ambitious entrepreneurs avoid mistakes while building and scaling their businesses.\nA quick reminder that even before SNDBX, Joram was always all about entrepreneurship and innovation.\nUnsurprisingly, stories about how he has helped different businesses steer themselves towards success are at the top of Joram’s success list."
  },
  {
    "headline": "Vault Hill debuts its NFT marketplace with the public sale of metaverse land",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain-based company, Vault Hill, has launched its NFT marketplace with the public sale of land in its human-centric metaverse, Vault Hill City (VHC).\nAs part of the land sale, a free HTC VIVE Flow VR glasses will be given per parcel of land bought.\nThe VHC land parcels are Non-Fungible Tokens (NFTs) built on the Ethereum blockchain (ERC-721) which are unique and distinct.\nIt is also the first virtual world with urban planning and development benefits to ensure users build on their virtual land respectfully.\nFurther information regarding the land sale can be found here and the metaverse development timeline can be viewed in the whitepaper."
  },
  {
    "headline": "Adaverse Backs Cassava Network With A Seed Investment To Empower African Content Creators",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\n“EMURGO Africa is excited to support the development of Cassava Network’s innovative content rewards ecosystem.\nTo apply for funding at Adaverse, visit www.adaverse.coBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "CRICKET: Edo Boys High School Emerges Champions of Templars Schools Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Boys High School Cricket team, Benin City on Friday shown class and style in this year’s male final of the Templars Secondary Schools Boys Competition as they defeated the stubbornly Ohonre Grammar School, Benin by 6 wickets.\nThe second innings didn’t take much time as Edo boys high school only had a target of 31 runs to win.\nIt took them just 6.5 overs to surpass the target and emerge champions.\nHowever, the third place match that took place earlier wasn’t short of the thrill and fun as Government Science and Technical College (GSTC) Benin edged out Christlike Secondary School (IDP Camp).\nAs regards the team’s victory, the coach of Edo boys High School, Mr Theophilus Ibodeme Adophus expressed joy over his team’s victory."
  },
  {
    "headline": "Obaseki seeks doctors’ support to rejig Edo health system, tackle brain drain – Nigerian Observer",
    "summarized_story": "He said, “We need more doctors, particularly with the way the doctors are traveling out for greener pastures.\nWhat we need is to strengthen the institutions that produce doctors.\nThe lesson is that we must fix our healthcare system.\n“We have insisted on healthcare reforms.\n“My focus is on how to produce more doctors by strengthening the basic education system and giving quality education to produce more doctors for the state."
  },
  {
    "headline": "Amstel Malta Ultra Refreshes Okpekpe Race Participants – Nigerian Observer",
    "summarized_story": "The premium beverage brand’s sponsorship of the thrilling road race is part of its commitment to initiating quality interactions and inspiring healthier communities through sporting activities in Nigeria.\nDuring the event, Amstel Malta Ultra, presented as the official malt drink of the race, provided much-needed vitality and motivation for scores of athletes from across the Africa continent who competed to earn a share in the N60million cash reward for top performers.\nSince its launch in 2020, Amstel Malta Ultra has achieved acclaimed recognition among consumers as a drink for health-conscious individuals and fitness enthusiasts.\nThe beverage brand’s ‘no added sugar’ feature makes it the choice drink for athletes and people in the sports industry.\nWith its sponsorship of the 8thOkpekpe International 10km Road Race and its previous editions, Amstel Malta Ultra reiterates its commitment to reviving healthy lifestyle activities, uniting Nigerians through sports, and empowering athletes with premium vitality."
  },
  {
    "headline": "UNIBEN Don laments eroding social value … as NAS organises FOB – Nigerian Observer",
    "summarized_story": "lecturer in Mass Communication deptartment, University of Benin (UNIBEN), Dr. Daniel Ekhereafo has said that the social value in Nigeria has completely broken down within the last 12 years.\n“More worrisome is the monetisation of the political system and the use of youths as thugs and agents of distabilisation.\nAnti-Social behaviour, he added creates a life of affluence that I’d unsubtainable.\nWith anti-social behaviour, he said that the society loses the ingredients for repositioning the society for the better.\nTo remedy the situation, he expressed the need to return to the family value system, while value reorientation must form part of the national and sub-national engagement with the youths."
  },
  {
    "headline": "2023: Attempt by Buhari to impose candidate may backfire – Shittu",
    "summarized_story": "Adebayo Shittu, a former minister of communications, has warned that any attempt by President Muhammadu Buhari to impose a presidential candidate on the ruling All Progressives Congress (APC) ahead of its presidential primary next week may backfire.\nBuhari had asked the governors to support his quest to chose his successor, as they also did in their respective states.\nBut the minister who was in charge of the communications ministry during Buhari’s first tenure warned that the president should not impose any candidate on the party, advising that delegates should be allowed to pick their preferred candidate.\n“In 2019, it was essentially a two-party affair but this year, with what we have seen with the NNPP coming up, with Labour Party coming up with a very strong candidate in Peter Obi.\n“We must also be warned now that the youths are coming up, stronger and more agitated for change."
  },
  {
    "headline": "Kurt Zouma sentenced to 180 hours of community service for kicking a cat",
    "summarized_story": "West Ham and French defender, Kurt Zouma has been ordered to carry out 180 hours of community service after he admitted kicking and slapping his pet cat.\nDistrict judge Susan Holdham told Zouma and his younger brother Yoan, who filmed the incident, that their actions were “disgraceful and reprehensible”.\nKurt Zouma pleaded guilty last month to two counts under the Animal Welfare Act of causing unnecessary suffering to an animal.\nHe was sentenced to 180 hours of community service.\nThe money had been donated to animal welfare groups, according to AFP report."
  },
  {
    "headline": "Nigeria’s crude production up by 70,000bpd to 1.42million bpd in May 2022",
    "summarized_story": "Nigeria recorded improvement in crude oil production, increasing production levels in the month of May, with production, rising by 70,000 barrels per day and averaging 1.42 million bpd.\nThis was disclosed in the Reuters Crude Oil production Survey released on Tuesday based on Refinitiv Eikon flows data, information from tanker trackers such as Petro-Logistics, and information provided by sources at oil companies, OPEC, and consultants.\n“The 10 members of OPEC bound by the deal pumped 24.73mbpd in May, up 280,000bpd from April and above the 274,000bpd increase called for by the accord,” it said.\n“The biggest rise in May of 100,000bpd came from Saudi Arabia.\nExports declined partly, sources in the survey said because Iran has shipped less oil to China since the start of the Ukraine war as Beijing favoured cheaper Russian crude"
  },
  {
    "headline": "No going back on Biafra, IPOB insists",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has insisted that it remained committed to the liberation and restoration of the Sovereign States of Biafra, saying no amount of intimidation will dissuade it from such a noble cause.\nThe group’s Director of Media and Publicity, Emma Powerful, stated this in a statement on Wednesday, while thanking Biafrans for painstakingly participating in the annual May 31 Biafra Day.\n“IPOB leadership brings to you a message of encouragement and hope from our great leader Mazi Nnamdi Kanu who is joyful over the committed participation by IPOB families worldwide who demonstrated to the global community that we are ready to go and to manage our destiny in a free and Independent Biafran Nation.\n“We equally thank IPOB families amongst us whose effort on this year’s Heroes Remembrance Day programme of events attracted distinguished diplomats and dignitaries of high repute, especially from their host countries.\nWe are no terrorists, we are no criminals as our oppressor Nigeria wished to tag us."
  },
  {
    "headline": "Flour Mills earns N1.2trn revenue, posts N28bn profit",
    "summarized_story": "Flour Mills of Nigeria Plc has reported 51 percent growth in revenue, year-on-year, for the year ended March 31, 2022, from N772billion in 2021 to N1.2trillion.\nThe food segment grew by N270 billion due to higher B2B volumes and growth in core B2C categories as the company expanded its focus on local content.\nThe oil and fats business grew revenue by 58 per cent, while the pre-tax profit margin expanded by 141 per cent y-o-y, driven by improved export operations.\nExport operations revenue went up by 26 per cent.\nThe company’s backward integration project in sugar production recorded a 21 per cent improvement in revenue, driven by increased volume."
  },
  {
    "headline": "Troops Repel Terrorist Attack In Borno",
    "summarized_story": "Troops of the Multi-National Joint Task Force (MNJTF), on Monday, repelled attack on its location in Arege, in the North-East of Borno State without casualties on own troops.\nThe troops dealt decisively with the Islamic State’s West Africa Province (ISWAP) terrorists in their failed incursion on troops formation on May 30, 2022.\nThey were, however, said to be subdued by the firepower of the troops.\nZagazola Makama, a Counter Insurgency Expert and Security Analyst in the Lake Chad reported that many other terrorists escaped with bullet wounds.\nItems recovered from the terrorists include; one Hilux, Anti Air Craft Gun and many rounds of ammunition as well as three AK47 magazines."
  },
  {
    "headline": "Troops Repel Terrorist Attack In Borno",
    "summarized_story": "Troops of the Multi-National Joint Task Force (MNJTF), on Monday, repelled attack on its location in Arege, in the North-East of Borno State without casualties on own troops.\nThe troops dealt decisively with the Islamic State’s West Africa Province (ISWAP) terrorists in their failed incursion on troops formation on May 30, 2022.\nThey were, however, said to be subdued by the firepower of the troops.\nZagazola Makama, a Counter Insurgency Expert and Security Analyst in the Lake Chad reported that many other terrorists escaped with bullet wounds.\nItems recovered from the terrorists include; one Hilux, Anti Air Craft Gun and many rounds of ammunition as well as three AK47 magazines."
  },
  {
    "headline": "Reversing Medical Tourism, Brain Drain In Nigeria",
    "summarized_story": "For decades, the Nigerian health sector has been bedeviled with a lot of challenges ranging from poor health facilities, brain drain, frequent strikes by health workers to poor health financing.\nFor instance, the minister of Information and Culture, Alhaji Lai Mohammed, said Nigerians spend between $1.2 and $1.6 billion on medical tourism, adding that it is a huge drain on the country‘s foreign reserves.\nTo add to this is the huge brain drain that is rocking the health sector, especially in the wake of COVID-19 pandemic.\nMohammed recalled that, in the wake of COVID-19, the CBN set up the N100 billion Healthcare Sector Intervention Fund, now expanded to N200 billion, to provide credit support for the healthcare sector through long-term, low-cost financing.\n„You are also aware of the Federal Government’s Intervention in the Healthcare Sector through the Nigerian Sovereign Investment Authority (NSIA)."
  },
  {
    "headline": "Reversing Medical Tourism, Brain Drain In Nigeria",
    "summarized_story": "For decades, the Nigerian health sector has been bedeviled with a lot of challenges ranging from poor health facilities, brain drain, frequent strikes by health workers to poor health financing.\nFor instance, the minister of Information and Culture, Alhaji Lai Mohammed, said Nigerians spend between $1.2 and $1.6 billion on medical tourism, adding that it is a huge drain on the country‘s foreign reserves.\nTo add to this is the huge brain drain that is rocking the health sector, especially in the wake of COVID-19 pandemic.\nMohammed recalled that, in the wake of COVID-19, the CBN set up the N100 billion Healthcare Sector Intervention Fund, now expanded to N200 billion, to provide credit support for the healthcare sector through long-term, low-cost financing.\n„You are also aware of the Federal Government’s Intervention in the Healthcare Sector through the Nigerian Sovereign Investment Authority (NSIA)."
  },
  {
    "headline": "U.S. Grants Adeosun’s Dash Me Foundation Non-profit, Tax-exempt Status",
    "summarized_story": "A United States-based Dash Me Foundation has disclosed it has officially received a non-profit with tax-exempt status under Section 501(c)(3) of the US Internal Revenue Code.\nFounder of Dash Me Foundation, Mrs. Kemi Adeosun, who expressed delight at the development, said contributions from both corporations and individuals, donated to New York based Dash Me Foundation (US) are now fully tax-deductible.\nAdeosun said, “The Dash Me Foundation US is proud to announce that it is officially a non-profit with tax-exempt status under Section 501(c)(3) of the United States Internal Revenue Code.\n“The granting of a non-profit status to Dash Me Foundation in the United States is a major milestone for our growing organisation, and we are excited about the prospects it creates.\nSince its launch in Nigeria in June 2021, Dash Me Foundation has raised funds for orphanages, domestic violence shelters and the physically challenged through its Dash Me Store and other activities."
  },
  {
    "headline": "2023 Presidency: Honour Rotational Agreement – Shehu Sani To Buhari, APC Govs",
    "summarized_story": "Shehu Sani, a former Kaduna Central Senator, has responded to the outcome of President Muhammadu Buhari’s meeting with All Progressives Congress governors.\nAccording to Sani, Buhari and the APC governors should allow the party’s presidential candidate to come from the southern region of the country.\nThe former congressman said in a tweet that Buhari and the APC governors should honor their gentleman agreement and allow a Southern contender to emerge as the party’s nominee.\nHe wrote: “The president and the ruling party Governors should honour their ‘gentleman agreement’ and allow for a southern candidate to emerge.”"
  },
  {
    "headline": "Hunters Kill 2 B’Haram Terrorists In Borno, Recover Rifle",
    "summarized_story": "In Shaffa Taku village of Damboa Local Government Area of Borno State, they also found one AK-47 and a motorcycle used by the militants, he claimed.\nMany more terrorists escaped with bullet wounds during the operation, according to Yohanna, who revealed this in a discussion with newsmen in Maiduguri.\n“Upon receiving the information, I mobilised my team and stormed the spot in the evening at Shaffa Taku, which is a deserted community in Damboa.\nWe engaged them in a gun battle, and we were able to kill the commander and his deputy, while several others fled with gunshot wounds.\n“We also recovered one motorcycle and one AK47 rifle from the terrorists, presently, I have informed the authorities of the 231 Battalion in Biu and we are going to meet today (Tuesday) for onward handing over of the recovered AK47 rifle and the motorcycle,” Yohanna added."
  },
  {
    "headline": "BREAKING: Okorocha Beats Deadline, Arrives For APC Presidential Screening",
    "summarized_story": "Rochas Okorocha has arrived in Abuja for the presidential screening of the All Progressives Congress.\nAfter being arrested and imprisoned by the Economic and Financial Crimes Commission last week Tuesday, Mr Okorocha was in risk of missing the two-day practice.\nThe EFCC has filed a 17-count charge against the former governor, with a total value of N2.9 billion.\nHe is accused of scheming to steal from the public coffers with others, including a member of the All Progressives Congress (APC) and five companies.\nMr Okorocha has stated that he is innocent of any misconduct."
  },
  {
    "headline": "NSCDC Arrest 3 Suspected Bandals In Katsina",
    "summarized_story": "Haris Ishaq, 58, and two others were arrested by the Nigeria Security and Civil Defense Corps (NSCDC) in Katsina State for allegedly vandalizing electricity facilities.\nDSC Mohammed Abdara, the command’s spokesman, stated during a news conference in Katsina on Tuesday.\n“ The principal suspect, Haris Ishaq, is a native of Yangero village, in Jibia Local Government Area,” he said.\nHe said that Hamisu, a resident of Yarnmawa Quarters, Katsina Metropolis, bought 30kg of the cables at the cost of N9500.\nHe expressed the commitment of the NSCDC command to collaborate with other security agencies to fight crime and insecurity in the state."
  },
  {
    "headline": "Revealed! Why Bala failed to back Atiku at PDP primaries",
    "summarized_story": "Reasons have emerged on why Bauchi state Governor Abdulkadir Bala Mohammed did not step down for former Vice President Atiku Abubakar during the recently concluded presidential primaries of the People’s Democratic Party (PDP).\nAkwa Ibom state Governor Emmanuel Udom scored 38 votes, Governor Bala had 20 votes while another former Senate President and Secretary to the Government of the Federation (SGF) garnered 14 votes.\nThe media has been awash with stories of how Governor Bala and Saraki allegedly defied top northern leaders who tried prevailing on them to dump their ambition and support Atiku.\nYou don’t call him back.”Bala’s action explainedBut three days after the exercise, an insight has been provided into reasons Governor Bala chose to carry on with his ambition as against the call by some northern leaders.\nBala Mohammed is a team player who genuinely carries members of his team along."
  },
  {
    "headline": "Buhari to APC governors, stakeholders: Allow me pick my successor",
    "summarized_story": "He spoke Tuesday at a meeting with the 22 APC governors and National Chairman of the party, Senator Abdullahi Adamu, held at the State House in Abuja.\nThey include Jigawa state Governor Abubakar Badaru, former governor of Ogun state, Senator Ibikunle Amosun; Pastor Tunde Bakare, former governor of Zamfara state, Senator Sani Yerima, APC national leader, Asiwaju Bola Tinubu; and former Rivers state Governor Rotimi Amaechi.\nOthers include former Minister of Science, Technology and Innovation Dr Ogbonnaya Onu; Cross River state Governor Ben Ayade, Kogi state Governor Yahaya Bello, former Minister of Information under the late General Sani Abacha regime, Ikeobasi Mokelu.\nThe array of politicians I have seen there are people who are grassroots based,” said the former Akwa Ibom state governor.\nNote that NEC’s donation of its powers was to NWC and not to the National Chairman or any individual."
  },
  {
    "headline": "Ekiti 2022: Your votes will count, INEC assures electorate",
    "summarized_story": "Ahead of the June 18 governorship election in Ekiti state, the Independent National Electoral Commission (INEC) Tuesday assured that every vote of Ekiti electorate will count during the poll.\nINEC Chairman Professor Mahmood Yakubu gave the assurance in Ado-Ekiti, the state capital during an interface with the Ekiti State Council of Traditional Rulers.\nThe INEC helmsman revealed that the commission would conduct the governorship poll alongside the botched Ekiti State Assembly bye election in Ekiti East Constituency 1.\n“I want to appeal to all voters in Ekiti that their votes will count.\nThere will be 16 political parties for the governorship election, but only two for the bye election in Ekiti East,” Yakubu said."
  },
  {
    "headline": "Oil price nears $125 a barrel amid EU ban on 90% Russian oil imports",
    "summarized_story": "Agency reportOil prices jumped on Tuesday after the European Commission (EU) leaders reached an agreement on Monday to ban 90 percent of Russian oil imports by the end of 2022.\nThe EU announced on Monday its agreement to ban 90 percent of Russian oil imports by the end of the year as part of sanctions against Moscow for invading Ukraine.\nIn a tweet on Monday, Charles Michel, president of the European Council, said the move would immediately halt 75 percent of Russian oil imports.\n“The sanctions will immediately impact 75 percent of Russian oil imports.\n“We have covered overall 90 percent of Russian oil being winded down during this time frame."
  },
  {
    "headline": "New Materials Nigeria Company to save $100m forex for Nigeria annually",
    "summarized_story": "By our correspondentNew Materials Nigeria Company, a building material company recently commissioned in the Kuje area of Abuja will save Nigeria a whopping sum of $100m in foreign exchange annually when fully operational, its Managing Director, Mr. Jackie Dai Hui has said.\nSpeaking further, the Managing Director said that so far, over $50 million has been invested in the New Materials Nigeria Company explaining that in no distant time, it will grow its investment in Nigeria by establishing a branch in Lagos.\nAccording to him, the establishment of the New Materials Nigeria Company has gone a long way to provide employment to 150 Nigerians both at senior and junior levels who he said are also being trained in various skills.\nWe train Nigerians to run the company; we are transferring technology to those who are brilliant.\n“We can increase our company’s presence in Nigeria because we can source all our raw materials in Nigeria."
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "Several Abducted As Bandits Block Highway, Set Buses Ablaze In Kaduna",
    "summarized_story": "Several people have been reportedly kidnapped by bandits who attacked travellers along the Kaduna-Birnin-Gwari Road in Kaduna State.\nSources said the bandits blocked the highway on Tuesday and in the process, set about eight vehicles ablaze.\nThey were said to have later taken away an unspecified number of travellers, mostly women and children, to an unknown location.\nHe advised the people of the area to stop travelling through the Kaduna-Birnin-Gwari Highway until when the security situation there improved.\n“Equally, we pray for the safe return of our people, mostly women and children that were abducted,” he added."
  },
  {
    "headline": "Buhari Reveals Criteria For APC Presidential Candidate",
    "summarized_story": "Muhammadu Buhari on Tuesday disclosed his criteria for the ideal presidential candidate of the All Progressives Congress in the 2023 elections.\nThe President made the disclosure while meeting with APC Governors in Abuja.\nREAD ALSO: APC Presidential Panel Screens Osinbajo, Akpabio, Bankole, Others ExpectedThe APC commenced the screening of its presidential candidates on Monday.\n‘Positive Qualities’During Tuesday’s meeting with the Governors, the President charged them to ensure that the party picks a presidential candidate that reflects the APC’s values and virtues.\n“Our party, the APC, shall not be any different, more so as we are still implementing the blueprint for a more prosperous nation."
  },
  {
    "headline": "VIDEO: Abducted Cleric Admits N100m Was Paid For His Release",
    "summarized_story": "At a press conference in Lagos, the cleric said the monies were arranged in five sacks of N20 million.\nThe funds, he noted, were raised by the Methodist Church in Nigeria.\nThe cleric was kidnapped on Sunday in Abia State but was released on Monday.\nThe Prelate had been kidnapped alongside two others, the Bishop of Methodist Church, Owerri Diocese and the Prelate’s chaplain.\nA law criminalising ransom payments was recently signed by President Muhammadu Buhari."
  },
  {
    "headline": "Govt Calls For Calm As Okada Ban Takes Effect In Lagos",
    "summarized_story": "The Lagos State Government on Wednesday commenced enforcement of its ban on commercial motorcycles, also known as Okada, in six local government areas of the state.\nThe local governments include Ikeja, Surulere, Eti-Osa, Lagos Mainland, Lagos Island, and Apapa.\nThe state’s Police Commissioner Abiodun Alabi, has described most Okada riders as criminals who must be taken off the road.\nBut enforcement became lax due to the COVID-19 pandemic, according to the State Commissioner of Information and Strategy, Gbenga Omotoso.\nWe are aware of that and are preparing for it.”‘No anxiety’The Okada operators are expected to protest the ban on Wednesday."
  },
  {
    "headline": "Man Attempts Suicide On Lekki-Ikoyi Link Bridge",
    "summarized_story": "A young man on Wednesday morning attempted to plunge to his death from the Lekki -Ikoyi link bridge in Lagos.\nThe patrol officers were seen trying to motivate the apparently inconsolable man after which he was handed over to law enforcement officials.\n&nbThanks to the quick intervention of LCC Patrol Officers, a young man was saved from commiting suicide on Lekki-Ikoyi Link Bridge.\nAccording to Section 327 of the Criminal Code Act, Attempted Suicide is a crime in Nigeria and is punishable by one year in prison.\nHe also argued that penalizing attempted suicide was hardly a prevention method instead the law should direct the appropriate authorities to assist the traumatized attempters."
  },
  {
    "headline": "2023 Elections: Lulu-Briggs emerges AP candidate in Rivers",
    "summarized_story": "Chief Dumu Lulu-Briggs, a traditional leader in Rivers State, has emerged as the Accord Party’s (AP) governorship candidate in the run-up to the state’s general elections in 2023.\nThe business magnate was elected by delegates from the party’s 23 local government areas across the state as the consensus candidate of the party.\nLulu-Briggs, in his acceptance speech, said his election as the AP’s governorship candidate is a breath of fresh air for better governance in Rivers state in 2023.\nLulu-Briggs said he was humbled to be found worthy as the party candidate.\nWe have a responsibility to give ourselves the Rivers State of our dream."
  },
  {
    "headline": "Late governor Lawal's son emerges Kwara SDP guber candidate -",
    "summarized_story": "Mr Hakeem Lawal, son of a late former governor of Kwara state, Mohammed Lawal, has emerged as the Kwara state governorship candidate of the Social Democratic Party.\nHe defeated two other aspirants to emerge the winner of the primary election for the second time in less than one week.\nHe had earlier emerged as the candidate of the party but the primary election was canceled due to a petition written against his victory.\nMr Lawal was one of the APC governorship aspirants in Kwara state in 2019.\nThe Chairman of the Kwara SDP gubernatorial primary election, Mr Olatunji Agbaminoja announced the result of the election."
  },
  {
    "headline": "Allegation of dollarisation of PDP primary, a mere rumour",
    "summarized_story": "Former Spokesman of the Atiku Abubakar Campaign Organisation and PDP governorship candidate in Ogun state, Segun Sowunmi, has described as mere rumour and exaggeration, the alleged dollarization of the just concluded presidential primary of the party.\n“I think that we must be careful that we do not allow rumour to become fact.\nIf you are looking for Political parties that dollarises and criminalises the process, it’s APC.\nThe governorship candidate, however cautioned cultural groups like PANDEF, Arewa Consultative Forum, Afenifere and others to steer clear of political matters and allow political parties manage its affairs.\n” I have advised that PANDEF, Arewa, Afenifere and others need to be told not to jump into political matters as if they are political parties."
  },
  {
    "headline": "South-South, Southeast delegates endorse Nicolas Felix as consensus candidate -",
    "summarized_story": "A Coalition of delegates from the South-South and South east regions, have endorsed Dr Nicolas Felix as the consensus candidate of the All Progressives Congress from the region.\nThe group made this known during a courtesy visit to Dr Felix at his Abuja residence on Monday.\nThe delegates described Dr Felix as young, vibrant, exposed and energetic aspirant who will conveniently defeat the candidate of the People’s Democratic Party, Atiku Abubakar at the polls in 2023.\nAccording to the group, discussions are ongoing with other aspirants from the two regions to see reasons why Dr Nicolas Felix remains the best option.\nMeanwhile, Dr Nicolas Felix Felix on Monday was screened by the APC Presidential Screening Committee where he excellently responded to questions raised by the panel."
  },
  {
    "headline": "Plan B: PDP To Conduct Fresh Guber Primary for Bauchi Governor Bala Mohammed after His Loss at Presidential Primary",
    "summarized_story": "The Bauchi State Chapter of the Peoples Democratic Party (PDP) has commenced preparations for a fresh governorship Primary election.\nHamza Koshe, Bauchi State PDP Chairman.\nHowever, there are reports of disagreement between Kashim and Governor Mohammed after the primary.\nAccording to reports, Kashim refused to hand over the ticket to the governor who lost the PDP presidential ticket to former Vice-President Atiku Abubakar.\nMohammed, a first term governor, polled just 20 votes in the presidential primary."
  },
  {
    "headline": "French Open: Nadal Beats Djokovic in Late-Night Paris Thriller",
    "summarized_story": "Rafael Nadal demonstrated once again why he is the greatest player in French Open history by beating long-time rival Novak Djokovic in a late-night thriller to reach the men’s singles semi-finals.\nHe did after all miss the Australian Open, Indian Wells and Miami and had not played a match longer than three sets since September’s US Open semi-final.\nNadal’s 29th win over Djokovic will only be truly significant if he goes on to win a 22nd Grand Slam title.\nLengthy games with few routine holds continued and the set eventually tipped in the favour of Djokovic when Nadal cracked a forehand long on the second set point.\n“I gained momentum in the second set and I thought I was back in the game."
  },
  {
    "headline": "Elon Musk’s Ultimatum to Tesla Execs: Return to the Office or Get Out",
    "summarized_story": "The world’s richest man appears to have had it with this whole working-from-home business.\nElon Musk, chief executive officer of Tesla Inc., weighed in on the return-to-office debate Wednesday on Twitter by elaborating on an email he apparently sent to the electric-car maker’s executive staff.\nIt’s not the first time Musk’s tough-love treatment of his employees has come up.\nRoughly two weeks before Musk prevailed in his attempt to strike a deal to buy Twitter Inc., the Silicon Valley venture capitalist and entrepreneur Keith Rabois tweeted a story from Musk’s startup days.\nOnce, at Space Exploration Technologies Corp., Musk had noticed a group of interns milling around while they waited in a line for coffee."
  },
  {
    "headline": "Nigeria Seeks Vaccine to Halt Spread of Monkeypox, Denies Russia’s Allegation of Having Laboratories with Virus",
    "summarized_story": "The government’s move came just as the Nigeria Centre for Disease Control (NCDC) Tuesday dismissed the allegations that it was operating biological laboratories with monkey pox virus in Nigeria.\n“We are also engaging the WHO and the United States Centre for Control to see how Nigeria can also access the global stockpile of Monkeypox vaccination.\nstrategy entailed the expansion of vaccination sites beyond government health facilities to include private health facilities and community pharmacies in line with global best practices.\nMeanwhile, the NCDC has dismissed the allegations of operating biological laboratories with monkey pox virus in Nigeria.\nThat WHO reports that the Monkeypox (MPX) virus responsible for outbreaks in Europe and elsewhere was imported from Nigeria where the United States of America deployed its biological infrastructure."
  },
  {
    "headline": "Buhari Meets Governors, Asks to Choose Successor",
    "summarized_story": "With his words carefully chosen and intention unmistaken, President Muhammadu Buhari, on Tuesday, pleaded with the 22 governors of the ruling All Progressives Congress (APC) to allow him choose his successor in reciprocity, ahead of the party’s presidential primaries next week.\nBuhari made the appeal at a meeting in Abuja with the governors, which was also attended by other stakeholders.\nThe president said the governors should reciprocate the party’s good gesture of allowing outgoing governors choose their successors in their respective states.\nBuhari charged APC governors to ensure that the forthcoming convention to pick a presidential candidate reflected all the values and virtues of the party.\n“The PDP has demonstrated that it has learnt nothing, but as a party, the APC cannot follow her inglorious example."
  }
]