[
  {
    "headline": "Gunmen attack Plateau commissioner’s residence, abduct wife, daughter",
    "summarized_story": "Suspected terrorists in the early hours of Saturday have attacked the house of the Plateau State Commissioner for Environment, Usman Bamaiyi, located in the Gindiri community, Mangu Local Government Area of the state.\nHowever, it was gathered that during the attack, the gunmen in large numbers broke into his apartment and abducted his wife and daughter.\nA resident of Gindiri who confirmed the attack to The PUNCH in Jos said, “Some heavily armed men came to Gindiri last night around 2am.\nThey went straight to the house of the State Commissioner for Environment.\nWhen they eventually left, we discovered that they took the commissioner’s wife away alongside his daughter.”The Police Public Relations Officer in the State, Ubah Ogaba, also confirmed the abduction of the commissioner’s wife and daughter."
  },
  {
    "headline": "Reunion: Obi Cubana promises 20 classmates N2m each",
    "summarized_story": "Businessman and socialite, Obi Iyiegbu, popularly known as Obi Cubana, has promised to give the sum of N2m each to 20 of his secondary school classmates, who are struggling financially.\nIn a video, the socialite urged his other secondary schoolmates to set up a trust fund that will cater for the poor amongst them.\nPeople are going through hell and to the glory of God, some of us, God has actually blessed us.\nWhen you identify these 20 people, 20 people from the poorest and the poor amongst us, I want to give them N2m.\nWe are not giving because we have, but we are giving because God has enabled us to do so.”Copyright PUNCH."
  },
  {
    "headline": "Gunmen abduct wife, daughter of Plateau Commissioner",
    "summarized_story": "Gunmen have abducted the wife and daughter of Mr Usman Bamaiyi, the Commissioner for Environment in Plateau.\nMr Ibrahim Chindo, a resident of the community, told the News Agency of Nigeria (NAN) that Gindiri general area was “under seige”.\nREAD ALSO:“Bandits and terrorists have continued to terrorise innocent citizens with no sign of relief in sight.\nASP Ubah Ogaba, Public Relations Officer of the Police command in the state, confirmed the incident.\nHe said that men of the command were already on the trail of the abductors toward rescuing the duo."
  },
  {
    "headline": "Nnamdi Kanu gradually on way to freedom — Ezeife",
    "summarized_story": "Former governor of Anambra State, Chief Chukwuemeka EzeifeBy Nwabueze OkonkwoFormer Governor of Anambra state, Dr. Chukwuemeka Ezeife has expressed optimism that the leader of Indigenous People of Biafra, IPOB, Mazi Nnamdi Kanu was gradually walking out of detention, based on the outcome of Friday’s proceedings in Abuja High court.\nIn a telephone chat Friday, Ezeife urged those he described as lovers of freedom to remain calm and allow justice to run its natural course as it concerned Kanu’s trial.\nMeantime, there was a total lockdown of the commercial city of Onitsha and its environs yesterday in compliance with IPOB’s directive that sit-at-home should be observed in Biafra land any day their leader, Kanu was appearing in court.\nThe traditional ruler of Ogidi in Idemili North Local Government Area of Anambra state, Igwe Alex Onyido has bemoaned the level of insecurity in Igbo land.\nREAD ALSO:Speaking to newsmen in Ogidi, Igwe Onyido lamented that the situation was becoming inexplicable that sons and daughters of Ndigbo are now very much afraid to return home, not to talk of bringing their investments home."
  },
  {
    "headline": "Ortom appeals to Nasarawa PDP leaders to unite, take back state from APC",
    "summarized_story": "Governor Samuel OrtomBy Peter Duru, MakurdiGovernor Samuel Ortom of Benue State and leader of the Peoples Democratic Party, PDP, in the North Central Zone has charged the leadership of the party in Nasarawa State to unite and take drastic steps to ensure that those who left the party returned.\nHe also advised them to embark on new membership drive to strengthen the fortunes of the party in the 2023 general elections.\nGovernor Ortom lamented that he was “not happy being the only PDP governor in the North Central zone, if we were more in numbers, it would have been better.\nHe assured Governor Ortom of his support to ensure that Nasarawa State was returned to the PDP.\n“I have come with a clean heart to work together with stakeholders of the party for the victory of the party in Nasarawa State,” he stated."
  },
  {
    "headline": "Cartoon: When lunatic calls you ‘mad’, you’re finished",
    "summarized_story": ""
  },
  {
    "headline": "Police kill bandit, recover AK-47, 50 rustled cows in Katsina",
    "summarized_story": "By Ogalah IbrahimThe Katsina State Police Command said it killed one bandit, recovered one AK 47 and 50 rustled cows after its men repelled over 40 armed bandits riding on motorcycle who stormed Gago Village in Dutsima Local Government Area of the state.\nThe Police spokesman in the state, SP Gambo Isah disclosed this while briefing newsmen on recent achievements of the command on Friday.\nThe Commissioner of Police in the state, CP Idrisu Dabban Dauda, commended the efforts of the personnel in repelling the terrorists.\n“The operational strategy and gallantry displayed by the team, made the terrorists to abandoned their heinous mission and fled the scene.\nIn the course of scanning the scene, one AK 47 rifle with five (5) rounds of 7.62mm ammunition and all the fifty (50) rustled cows were recovered."
  },
  {
    "headline": "Soludo swears-in commissioners, says it’s not call to celebrate",
    "summarized_story": "Anambra State Governor, Prof Chukwuma Soludo has sworn-in commissioners and other senior aides of his government.\nHe said: “This is a call to work and not a call to celebrate.\nYou have offered to serve Anambra, and you must provide service.\n“I’m happy that you went to your screening knowing fully which ministry you are going to head.\nYou were selected, knowing your competence in a particular field, and you must deliver,” Soludo said."
  },
  {
    "headline": "Nnamdi Kanu will be granted bail on May 18 – Lawyer Ejimakor",
    "summarized_story": "Aloy Ejimakor, Special Counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has assured that his client would be granted bail on May 18, 2022.\nEjimakor was reacting to yesterday’s ruling by an Abuja Federal High Court, that struck out eight out of the 15-count charges against Kanu.\nJustice Binta Nyako struck out the eight count charges on the grounds that the proof of evidence did not link Kanu to the charges.\n“I have read the counts and counts 6,7, 8, 9, 10, 11, 12 and 14 have not disclosed any offense against the defendent.\nFollowing the ruling, the judge had slated hearing for Kanu’s bail application for May 18, 2022."
  },
  {
    "headline": "MNJTF eliminates another ISWAP commander Dan-Buduma, others in Borno",
    "summarized_story": "Abubakar Dan-Buduma, a top Islamic State’s West Africa Province (ISWAP) commander is dead.\nDan-Buduma was eliminated in airstrikes conducted by the Multinational Joint Task Force (MNJTF).\nThe air and ground operation involved the Nigeriene Air Task Force, Nigeria’s Operation Hadin Kai and the MNJTF.\nDan-Buduma and others were appointed in January by Sani Shuwaram, the ISWAP leader killed some weeks ago.\nBakura Gana was assigned to supervise Jubularam, Malam Musa sent to Jubularam, and Mohamadu Mustapha named the head of Marte unit."
  },
  {
    "headline": "2023: Wike will demolish mosques, Fayemi, Fayose to marginalize Muslims – MURIC claims",
    "summarized_story": "MURIC laid particular emphasis on Governors Nyesom Wike of Rivers State, Kayode Fayemi of Ekiti and his predecessor, Ayodele Fayose.\nIt claimed that Wike would demolish mosques, while Fayemi and Fayose would marginalize Muslims in the country.\nOr was it not Nyesome Wike who, contrary to Section 10 of the 1999 Constitution of the Federal Republic of Nigeria, repeatedly declared Rivers State a Christian State?\nHe said and we quote, “Rivers State is a Christian State and I have no apologies for saying that”“That was on 23rd June 2019.\n“Wike did not stop at mere declaration of Rivers State as a Christian State."
  },
  {
    "headline": "Presidency: You’re Jihadist – Asari Dokubo under fire for endorsing Tinubu, attacking Peter Obi",
    "summarized_story": "Former Niger Delta militant leader, Asari Dokubo has been criticized for endorsing the Presidential aspiration of Bola Tinubu of the All Progressives Congress, APC, while downplaying Peter Obi.\nSome Nigerians accused Dokubo of fighting a Jihad by endorsing Tinubu, while antagonizing Obi and other South-East Presidential aspirants.\nSomeone should give him Costume.”@SundayOlasunbo: “People like Asari Dokubo will always support BAT because BAT knows how to empower criminal gangs to make them become more powerful.”@truthzzzzzzz: “Asari dokubo is nothing more than a jihadist and he makes it soo obvious.\nAsari should be quiet please.”@EL_GEEZZE: “Asari Dokubo has been strategically positioned to antagonize the Southern Aspirants.\nHe is infact protecting his investment.”@JOSEPHOSITA12: “What do you expect Asari Dokubo to say about Peter Obi when Peter has no Kobo to share?"
  },
  {
    "headline": "BREAKING: Bandits abduct wife, daughter of Plateau Commissioner",
    "summarized_story": "Heavily armed bandits have abducted the wife and daughter of Plateau Commissioner for Environment Usman Bamaiyi.\nHe is also one of the aspirants for a seat in the House of Representatives on the platform of the ruling All Progressives Congress (APC).\nThe Nation gathered the bandits broke into the Gindiri residence of the Commissioner and took away his wife and daughterPlateau police spokesman ASP Gabriel Ogaba, who confirmed the incident to The Nation in Jos, said: “We are aware of the incident, the police has swung into action on the trial of the kidnappers.\nInvestigation is on going to save them.\nDetails Shortly…"
  },
  {
    "headline": "Zoning: Atiku, Wike, Saraki, Tambuwal shift lobby to PDP NEC, BOT",
    "summarized_story": "The two bodies are the highest organs of the party, and whatever they decide on the issue of zoning is final.\nSources told The Nation that the three camps that have emerged among the presidential aspirants are piling pressure on members of the NEC and BOT to decide in their favour.\nA close ally of Atiku said associates of the ex-vice president had warned him to beware of the consensus arrangement.\nAside the people who mooted the idea, other presidential aspirants from the north are not comfortable with the arrangement,” a party source claimed.\nAtiku wants to be the President of the whole of Nigeria and not just a northern or southern President,” a source told our correspondent on Thursday."
  },
  {
    "headline": "Insecurity: FG rejects plea by Nigerians to bear arms",
    "summarized_story": "The Minister of Police Affairs, Dr. Muhammad Dingyadi, has rejected calls in some quarters that government should allow all Nigerians to bear arms.\nDingyadi said if allowed, it will worsen the security situation in the country.\n“We need to do all we can to ensure that we minimize the circulation of firearms in this country.\n“We need intelligence to guide our operations and officers.\nIf you are well kitted and you are well armed you will stand a better chance of surviving any attack.”"
  },
  {
    "headline": "APC, PDP: Pertinent lessons from Awo",
    "summarized_story": "WHATEVER may be their shortcomings and failings, the two dominant parties, All Progressives Congress (APC) and Peoples Democratic Party (PDP), are impressive political constructs that took considerable organizational effort to actualize.\nIntellectuals, men of knowledge, ideas and superior insight, not the President or governors, must be the bedrock particularly of a viable, progressive political party.\nI suppose the APC is a political party, a democratic entity, and not a military garrison.\nAgain, Chief Awolowo was not obsessed with numbers as the PDP and APC seem fixated on.\nEach political party strove more than ever before to win votes on the basis of the relative merits of its policies and programmes”."
  },
  {
    "headline": "Court to proceed with eight-count terrorism charge against Kanu",
    "summarized_story": "The court also cleared the Federal Government of allegation of forcibly abducting Kanu from Kenya to stand trial at home.\nA few hours before yesterday’s sitting of the court, gunmen ambushed and attacked an army patrol team in the commercial city of Aba, Abia State.\nOzekhome had argued that Kanu was abducted and forcefully brought to Nigeria in violation of known human rights provisions.\nSimilar argument formed the subject of a N50billion suit filed for Kanu on Thursday by Ozekhome before the Federal High Court, Abuja.\nGunmen ambush, attack soldiers in AbiaEarlier in the day, yet to be identified gunmen waylaid and attacked an army patrol team in the commercial city of Aba, Abia State."
  },
  {
    "headline": "2023: Southern PDP govs insist on power shift",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party(PDP) governors from the South have rejected proposal to throw the contest for the party’s 2023 presidential ticket open to all qualified aspirants.\nThe governors, after a meeting, in Abuja, on Friday night, insisted that the PDP 2023 presidential ticket must be zoned to the South in the spirit of equity and fairplay.\nThe PDP committee on zoning, headed by Benue State governor, Samuel Ortom, had recommended that the presidential ticket should be thrown open to all qualified aspirants.\n“We have not seen any reason to change our position, because the Party was founded on the basis of equity and justice.\nAnd we also think that equity and justice is an important pillar that will ultimately stabilize our politics towards our journey in rescuing Nigeria."
  },
  {
    "headline": "Kaduna train attack: Double trouble as abductors threaten to kill hostages – The Sun Nigeria",
    "summarized_story": "This comes as efforts are being made to raise money to pay the terrorists even if it is not the whole amount being asked for.\nThis will be done by relatives acting as ransom-bearers and who are courageous enough to follow the abductors far into the forests.\nWhen Saturday Sun contacted some of the embattled relatives, they avoided him like a leper.\nHe regretted that in Kaduna State, “human beings have become gold mines and our homes are now gold fields with bandits as the sole miners.\nWhatever government can do to ensure total return of peace and peaceful coexistence in the country is what Nigerians are after now.”"
  },
  {
    "headline": "Insecurity: I won’t tolerate buck-passing when I become President –Yahaya Bello",
    "summarized_story": "I will let you know that Mr President loves this country.\n“This insecurity is not a thing of Mr President even though we shouldn’t pass buck because that is why we came on board.\n“After the various decays, the foundation was shaky and the President spent a lot of money to buy equipment.\nWhatever I observe, in terms of loopholes and lapses, it is between myself and the President to let him know.\n“But if I become the President, I will ensure that every Chief Executive of the various federating units sit up and do their jobs."
  },
  {
    "headline": "Sheik Khalid: I was sacked by Abuja Mosque Committee to please people in high places",
    "summarized_story": "The Mosque Steering Committee of Apo Legislative Quarters Mosque, Abuja, last week, sacked the Imam of the Mosque, Sheik Muhammed Nuru Khalid, popularly known as Digital Imam, accusing him of preaching an inciting sermon.\nAt what point did your relationship with the Mosque committee degenerate to the point of termination of engagement?\nI was disengaged some days ago by the Mosque Committee.\nBefore the sack, did you have any form of meeting with the mosque committee to iron out grey areas?\nBut one of the Mosque Committee members told me that they acted because of pressure from people in high places which he didn’t mention to me."
  },
  {
    "headline": "2023: CSOs back Kalu, Abaribe, Elumelu, others",
    "summarized_story": "From Fred Itua, AbujaAhead of primaries of various political parties for senatorial and House of Representatives seats in the 10th National Assembly, a Coalition of Civil Society Organisations (CSOs) in Nigeria, have called for the reelection of 14 out of the 469 serving federal lawmakers.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe 14 Federal lawmakers as announced by the coalition are Senators Ali Ndume (APC Borno South) , Orji Uzor Kalu (APC Abia North), Smart Adeyemi (APC Kogi West ), James Manager (PDP Delta South), Enyinnaya Abaribe (PDP Abia South), Abiodun Olujimi (PDP Ekiti South), Sani Musa (APC Niger East ) and Olamilekan Adeola ( APC Lagos West) .\nOthers are the Deputy Speaker, Hon Idris Wase (APC Plateau State), Hon Ndudi Elumelu (PDP Delta State), Hon Ado Doguwa (APC Kano State), Hon Muktar Betara (APC Borno State) , Hon Nkiru Onyejeocha (APC Abia State ) and Hon Sergius Ogun (PDP Edo State) .\nHe explained that the advocacy was being done to avoid legislative brain drain, since the 14 lawmakers performed creditably well as far as legislative activism and development -driven legislations are concerned."
  },
  {
    "headline": "Search for Consensus Presidential Candidate in PDP Falters, Atiku Insists on Primary Election",
    "summarized_story": "The pro-consensus presidential aspirants had earlier met with Governor Seyi Makinde of Oyo State and Governor Ifeanyi Okowa of Delta State on the issue.\nA source close to the former vice president told THISDAY last night that Atiku would never be part of any consensus arrangement for the presidential ticket of the PDP.\nThe aspirants should be meeting and selling their ideas to delegates; not meeting over consensus candidate.\nWe need to save hapless Nigerians from this unnecessary distraction.”Another PDP Presidential aspirant, Mazi Sam Ohuabunwa questioned the principles that would govern the choice of a consensus presidential candidate being promoted.\nPeriod.”Meeting with Makinde, OkowaAt the PDP pro-consensus presidential aspirants meeting with Makinde, the governor said the party would work to ensure the success of a consensus presidential candidate arrangement for the PDP."
  },
  {
    "headline": "Court: Nnamdi Kanu Must Stand Trial on 7 Terrorism Charges",
    "summarized_story": "*Refuses to acquit, discharge him, strikes out 8 other counts, to rule on bail application May 18Alex Enumah in AbujaJustice Binta Nyako of a Federal High Court, Abuja yesterday ordered the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu to stand trial on only seven of the 15-count alleged terrorism charges against him.\n“Counts 1, 2, 3, 4, 5, 8 and 15 show some allegations, which the defendant has to answer.“The court shall proceed to try the defendant on those counts.”By the ruling, Kanu would now stand trial on counts 1, 2, 3, 4, 5, 8 and 15, which the court believes he needs to respond to.\nMeanwhile, the court has fixed May 18 to deliver ruling in Kanu’s application for bail.The court fixed the date after listening to arguments for and against granting the application.\nKanu’s lead counsel, Chief Mike Ozekhome, SAN, in moving the bail application said: “Until a person is tried and convicted, he should be allowed to walk free.”He reminded the court that a defendant ought to enjoy the presumption of innocence until proven guilty.\nAfter he was repatriated and arraigned, he pleaded not guilty to the 15-count amended charges bordering on alleged treasonable felony and asked the court to quash the charges for being defective and baseless, adding that the court lacked the jurisdiction to try him based on those charges."
  },
  {
    "headline": "Emefiele: InfraCo to Unlock N8 trillion Pension Funds’ Assets for Deployment to Bankable Infrastructure Projects Across Nigeria",
    "summarized_story": "*Signs terms sheet with four asset managersNume EkegheThe Governor of the Central Bank of Nigeria, Mr. Godwin Emefiele yesterday announced that the Infrastructure Corporation of Nigeria (InfraCo) would unlock N8 trillion of pension funds’ assets to be deployed into bankable infrastructure projects across Nigeria.\nInfracorp is being promoted by the Africa Finance Corporation (AFC) and the Nigerian Sovereign Investment Authority, with KPMG as transaction advisers.\nI understand from the last count that the size of Nigeria pension fund is over N13 trillion.\nI am told that in another three to five years, Nigerian pension assets would rise to almost N20 trillion to N25 trillion.\nHe added: “Upon signing the terms sheet today, we will go straight into execution mode because Nigeria very badly needs to develop its infrastructure."
  },
  {
    "headline": "CBN’s Crackdown on Cryptocurrency Trading Results in N1.314bn Fines for Six Banks in 2021",
    "summarized_story": "In the latest revelation from the banks’ full year 2021 financial report, First City Monument Bank (FCMB), Fidelity Bank Plc.\nThe FCMB was fined N400 million over its failure to close four accounts of customers said to be involved in cryptocurrency trading.Fidelity Bank Plc.\nAccess Bank Plc.\nwas fined N500 million for failing to shut down customers’ crypto accounts, according to a filing with the Nigerian Exchange Limited.\nThe country also has the largest proportion of retail users conducting crypto transactions under $10,000, Chainalysis says."
  },
  {
    "headline": "(Breaking) Nnamdi Kanu: Court Strikes out 8 of 15-count Terrorism Charge",
    "summarized_story": "Alex Enumah in AbujaJustice Binta Nyako of a Federal High Court, Abuja on Friday, struck out eight out of the 15 count terrorism charge filed against leader of the proscribed Indigenous People of Biafra (IPOB), Mr Nnamdi Kanu.\nThe judge struck out eight of the counts while ruling on Kanu’s application to dismiss the suit on the grounds of jurisdiction and being incompetent.\nBy the ruling Kanu would now stand trial on counts 1, 2, 3, 4, 5, 8 and 15, which the court believes Kanu needs to respond to.\nKanu is standing trial on an amended 15-count charge bordering on treasonable felony.\nThe application, premised on 34 grounds and supported by a 36-paragraph affidavit, is also seeking an order acquitting and discharging Kanu."
  },
  {
    "headline": "Newly Employed Personnel Of Nigerian Anti-drug Agency, NDLEA, Lament Seven-month Unpaid Salaries",
    "summarized_story": "Some new personnel of the National Drug Law Enforcement Agency have said they have not been paid their salaries and allowances since they joined the agency seven months ago.\nThey are saying it is not from the agency but we work for the agency and they should try and consider us.\nIt read, “You may be aware that almost all officers and men (newly recruited) have gotten IPPIS number in March 2022.\nWe hope this will be rectified very soon.”Abdullahi, however, told the newly recruited personnel not to expect salary arrears from July 2021.\nAccordingly, newly recruited personnel agitating salary arrears from July 2021 should not expect any arrears from July 2021.”"
  },
  {
    "headline": "Newly Employed Personnel Of Nigerian Anti-drug Agency, NDLEA, Lament Seven-month Unpaid Salaries",
    "summarized_story": "Some new personnel of the National Drug Law Enforcement Agency have said they have not been paid their salaries and allowances since they joined the agency seven months ago.\nThey are saying it is not from the agency but we work for the agency and they should try and consider us.\nIt read, “You may be aware that almost all officers and men (newly recruited) have gotten IPPIS number in March 2022.\nWe hope this will be rectified very soon.”Abdullahi, however, told the newly recruited personnel not to expect salary arrears from July 2021.\nAccordingly, newly recruited personnel agitating salary arrears from July 2021 should not expect any arrears from July 2021.”"
  },
  {
    "headline": "BREAKING: American Actor, Will Smith Banned From Attending Oscars For 10 Years After Slap",
    "summarized_story": "Hollywood's film academy on Friday said its board of governors banned Will Smith from any of its events, including the Oscars, for 10 years after the best actor winner slapped presenter Chris Rock on stage at the Academy Awards ceremony.\n\"However, those moments were overshadowed by the unacceptable and harmful behaviour we saw Mr. Smith exhibit on stage.\"\nThe actor had resigned from the academy on April 1 and has issued statements apologizing to Rock, the Oscars producers, nominees and viewers.\nAt the March 27 televised ceremony, Smith strode up to the stage after comedian Rock made a joke about the appearance of the actor's wife, Jada Pinkett Smith, then smacked Rock across the face.\nRock's joke about Pinkett Smith made a reference to the 1997 film \"G.I."
  },
  {
    "headline": "BREAKING: American Actor, Will Smith Banned From Attending Oscars For 10 Years After Slap",
    "summarized_story": "Hollywood's film academy on Friday said its board of governors banned Will Smith from any of its events, including the Oscars, for 10 years after the best actor winner slapped presenter Chris Rock on stage at the Academy Awards ceremony.\n\"However, those moments were overshadowed by the unacceptable and harmful behaviour we saw Mr. Smith exhibit on stage.\"\nThe actor had resigned from the academy on April 1 and has issued statements apologizing to Rock, the Oscars producers, nominees and viewers.\nAt the March 27 televised ceremony, Smith strode up to the stage after comedian Rock made a joke about the appearance of the actor's wife, Jada Pinkett Smith, then smacked Rock across the face.\nRock's joke about Pinkett Smith made a reference to the 1997 film \"G.I."
  },
  {
    "headline": "Military Kills Another ISWAP Commander, 19 Others In North-East Nigeria",
    "summarized_story": "Airstrikes by the Multinational Joint Task Force have eliminated Abubakar Dan-Buduma, a top ranking Islamic State West Africa Province Commander and 19 others fighters in Nigeria's North-East of Lake Chad.\nDan-Buduma and his foot soldiers were eliminated in a coordinated intelligence-led ground and aerial bombardment by the Nigeriene Air Task Force, under Operation Hadin Kai and Multi National Joint Task Force in Kwalaram Village in Marte Local Government Area of Borno State.\nFile photo used to illustrate story.\nIn January 2022, PRNigeria reported that ISWAP had its leadership reshuffled after the loss of their commanders and fighters in aerial bombardmentsSome of the appointed commanders included Abubakar Dan-Buduma to oversee Bakkassi Buningil and Doron Buhari; Muhammed Ba’ana for Kirta; Mohamet Aliamir for Kwalaram; Bakura Gana for Jubularam; Malam Musa for Jubularam; and Mohamadu Mustapha for Marte.\nAbubakar Dan-Buduma, who had replaced Muhammed Ba’ana, was the ISWAP’s Chief Naval Officer commanding the waterways of Kirta, Bakassi, Buningil and Doron Buhari, in Marte LGA of Borno State."
  },
  {
    "headline": "BREAKING: Amaechi joins 2023 presidential race",
    "summarized_story": "Rotimi Amaechi, minister of transportation, has declared his intention to run for president in 2023.\nAmaechi declared his presidential bid on Saturday at an All Progressives Congress (APC) event in Rivers state.\nThe minister said he would contest the party’s presidential ticket to succeed President Muhammadu Buhari.\n“I stand before you today to declare my intention and submit my application to serve as your next president,” he said.\nAdvertisementMore to follow…"
  },
  {
    "headline": "BREAKING: Amaechi joins 2023 presidential race",
    "summarized_story": "Rotimi Amaechi, minister of transportation, has declared his intention to run for president in 2023.\nAmaechi declared his presidential bid on Saturday at an All Progressives Congress (APC) event in Rivers state.\nThe minister said he would contest the party’s presidential ticket to succeed President Muhammadu Buhari.\n“I stand before you today to declare my intention and submit my application to serve as your next president,” he said.\nAdvertisementMore to follow…"
  },
  {
    "headline": "'Presidential ticket must be zoned to south' -- PDP southern governors insist",
    "summarized_story": "Governors of southern states elected on the platform of the Peoples Democratic Party (PDP) say the party must zone its presidential ticket to the region in the interest of “equity and fairness”.\nThe governors expressed their position after a closed-door meeting on Friday night in Abuja.\nAddressing journalists on behalf of his colleagues, Okezie Ikpeazu, governor of Abia, said the earlier position of the governors on the zoning debate remains valid.\nIkpeazu said the party should adhere to its constitution’s zoning arrangement and rotate the presidential ticket to the southern part of the country.\nAdvertisementAminu Tambuwal, governor of Sokoto; Bala Mohammed, governor of Bauchi, and Bukola Saraki, former senate president, are reported to be interested in clinching the PDP presidential ticket."
  },
  {
    "headline": "'Presidential ticket must be zoned to south' -- PDP southern governors insist",
    "summarized_story": "Governors of southern states elected on the platform of the Peoples Democratic Party (PDP) say the party must zone its presidential ticket to the region in the interest of “equity and fairness”.\nThe governors expressed their position after a closed-door meeting on Friday night in Abuja.\nAddressing journalists on behalf of his colleagues, Okezie Ikpeazu, governor of Abia, said the earlier position of the governors on the zoning debate remains valid.\nIkpeazu said the party should adhere to its constitution’s zoning arrangement and rotate the presidential ticket to the southern part of the country.\nAdvertisementAminu Tambuwal, governor of Sokoto; Bala Mohammed, governor of Bauchi, and Bukola Saraki, former senate president, are reported to be interested in clinching the PDP presidential ticket."
  },
  {
    "headline": "Ukraine: 50 killed in Russian attack on train station",
    "summarized_story": "At least 50 people, including five children have reportedly been killed in a rocket attack on a train station in Kramatorsk, Donetsk Oblast in Ukraine on Friday.\nUkrainian President Volodymyr Zelenskyy said in a statement via Facebook that a Tochka-U short-range ballistic missile was used in Friday’s attack, adding that those involved must be held accountable.\n“Russian troops launched a missile attack on the Kramatorsk railway station this morning.\n“Like mass killings in Bucha, like many other Russian war crimes, the missile strike on Kramatorsk should become one of the accusations at the tribunal that is bound to be held.\nAdvertisementDmitry Peskov, Russia’s presidential spokesman, said the involvement of Russian forces was already ruled out by the Russian ministry of defence, based on the type of missile that was used ."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Can Hytch succeed where GoMyWay failed?",
    "summarized_story": "At the end of October 2018, the Nigerian ride-sharing platform GoMyWay ceased to exist after operating for about 4 years.\nGet the best African tech newsletters in your inboxLike GoMyWay, Hytch has also begun to ramp up users.\nGoMyWay, before it went into oblivion, had said it had over 12,000 users and had completed 106,630 rides across 16 states in Nigeria.\nFor Hytch, the opposite is the case as they want to make money as they go, and are already doing so.\nGoMyWay and others—like Jekalo and Ridebliss, 2 other local carpooling services that’ve since failed—are great learning references for Hytch."
  },
  {
    "headline": "Visa opens its first African innovation Studio in Kenya",
    "summarized_story": "Global payments company Visa has opened a new Innovation Studio in Nairobi, Kenya.\nThis facility will serve the sub-Saharan Africa region and joins a network of innovation centers operated by Visa since 2016, in cities including London, Dubai and Singapore.\nAida Diarra, Senior vice president and head of Visa in Sub-Saharan Africa, said the studio will assist in increasing the Visa market in the region by issuing digital and physical Visa to its clients.\nA photo of the corner fabrics section at the Visa Innovation studio in Nairobi“As a brand built on technology, Visa has driven the major technology advancements that make electronic payments what they are today.\nThe launch of Visa’s first African innovation studio and others serves as a boost to the African tech ecosystem as it’ll encourage the creation, development, and implementation of novel ideas."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "‘I have never been scared of Alex Ferguson, but I was scared to disappoint him’",
    "summarized_story": "I am here to see the creativity of the young ones and to let the world know what we have in Africa.\nDon’t chase the money, money will come.\nLuckily enough, my parents never forced me to play football or be in it because I want to amass money.\nYou were regarded as one of the best left backs in the world by Alex Ferguson¸ how does that make you feel?\nI always say I have never been scared of Alex Ferguson, but I was scared to disappoint him."
  },
  {
    "headline": "CBN to begin payment of FX rebate to exporters next week",
    "summarized_story": "The Central Bank of Nigeria (CBN) will next week begin the payment of rebate for foreign exchange export proceeds or earnings to exporters, Godwin Emefiele said on Friday.\nThe banking and finance regulator had promised to pay N65 bonus for every $1 of repatriated non-oil export proceeds sold at the Investors and Exporters (I&E) window, the official FX rate.\n“So the first set of disbursement for the payment of the rebate has been assured and will be done by next week.\nThese include revenue from crude, export proceeds, Diaspora remittances and maybe foreign and direct portfolio investments into the country.\nWhen you export them the dollar comes in and it is sold into the new window and you earn N65 as rebate,” he said."
  },
  {
    "headline": "Dr. Wiebe Boer- from Calvin alumni to president, the full circle appointment",
    "summarized_story": "The Calvin University Board of Trustees has accepted the presidential search committee’s unanimous recommendation and appointed Dr. Wiebe Boer as the institution’s 11th president.\nDr. Wiebe Boer sat down with editor Lehle Balde for an exclusive interview on this historical appointment, making him the third Nigerian-born president of an American university.\nFrom CEO of All On to the president of Calvin University, your undergraduate alma mater.\nSo obviously, there is going to be a steep learning curve for me both for the sector in general and Calvin University in particular.\nCome to Calvin, the university president will be waiting for the children at the airport."
  },
  {
    "headline": "Edo begins process of forest allocation to timber concessionaires – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the process of forest allocation to prospective timber concessionaires in the state as part of efforts to reopen the state’s forest.\nChairman Forestry Commission, Edward Obiaw, in a statement, urged interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors to pick forest allocation application forms at the Edo State Ministry of Environment and Sustainability.\nThe statement reads: “It is hereby announced for the information of the general public that as part of the process to lift the ban on forest exploitation in the state, the Edo State Government is hereby requesting all interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors that application forms for forest allocation are available at the Ministry of Environment and Sustainability, Room 17, Ist Floor, Palm House, Sapele Road, Benin City with a treasury receipt of payment of a non-refundable application fee of N200,000 (Two Hundred Thousand Naira).\n“All completed application forms are to be addressed and submitted to the Chairman, Forestry Commission within two weeks of this announcement.”Recall that the government had announced the prohibition of all forms of timber exploitation from Tuesday 31st August, 2021, following the expiration of the three-year circle of 2018/2021 Forest Allocation in the state.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo community head, motorists calls for speedy completion of road rehabilitation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOza – Motorists and other road users plying the Evbuobanosa-Iru-Oza-Igbanke road in Orhionmwon local government area of Edo state have called on the contracting firm handling ongoing rehabilitation work on the road to speedily complete the project.\nAccording to the traditional head (Odionza) of Oza community, Chief Amadin Idehen, the rehabilitation has been going on smoothly before the construction firm stopped work recently.\n“They started well initially; suddenly they just abandoned the job”, the Odionza told The Nigerian Observer.\nBut, a source who understands the contractual agreements between the federal government and the firm handling the rehabilitation project attributed the stoppage of work to lack of funds.\n“When you award a contract, you first release 25 percent especially on road projects to start work."
  },
  {
    "headline": "Local Govt Autonomy: NULGE seeks traditional Rulers Support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe leadership of the Nigeria Union of Local Government Employees (NULGE) have appealed to traditional rulers to support the bill for the amendment in granting autonomy for local governments across the country.\nThe President, Edo Chapter of NULGE, Mr Lazarus Adorolo, yesterday made the appeal during an advocacy visit to traditional rulers in Akoko Local Government Area of Edo.\nAdorolo said the visit to traditional rulers was to prevail on the members of state house of assembly to vote in favour of the local government autonomy.\n“Your highness, we are here today to present the people’s charter of demand for local government autonomy for continued support of our traditional rulers for this struggle in our overall interest.\nAlso, the Olokpe of Okpe, Oba Idogun Oshizimete, promised to team up with other traditional rulers to prevail on the lawmakers to ensure the passage of the bill."
  },
  {
    "headline": "Eradicating Lassa fever from Edo State – Nigerian Observer",
    "summarized_story": "Comrade Phillip Shaibu flagged-off Lassa fever eradication campaign at Auchi.\nToday, we decided to flag off Lassa fever eradication campaign.\nOver twenty one persons have died of Lassa fever this year.\nLassa fever can also be passed between patients and staff at poorly equipped hospitals where sterilization and protective clothing is not standard.\nThere is a test centre at Irrua Specialist Hospital, Irrua, Edo State University, Uzarue and the Edo State Government is presently planning a healthy to establish a centre at Auchi Central Hospital."
  },
  {
    "headline": "Service of Songs: Amaechi, Dr. Otti, Dele Momodu, others pay tribute to Prince Emeka Obasi",
    "summarized_story": "As I said in my tribute, Emeka was a merchant of hope and he refused to prepare us for what we are doing today,” he said.\nEmeka personified bravery, courage, elegance – MomoduPaying tribute to the late Prince Obasi at the event, Dele Momodu, presidential hopeful and media mogul, described him as bright star who made great impact in his lifetime.\nMomodu who went down memory lane to 1990 when he first met Prince Obasi at Classique Magazine, then published by May Ellen Ezekial, said he stood out at the time as a very courageous journalist.\n“I meet Prince Emeka, as we called him, at Classique Magazine in 1990.\n“I got to know Prince about 16 years ago, as a rookie media relations officer and he was so instrumental to my development."
  },
  {
    "headline": "Emefiele, Onyeagwu, other Nigerians make Forbes Africa’s list of growth contributors",
    "summarized_story": "Mr. Godwin Emefiele, governor of the Central Bank of Nigeria (CBN); Mr. Ebenezer Onyeagwu, CEO of Zenith Bank Plc, have been named, among other Nigerians, in the Forbes Africa Undiscovered Series for Nigeria.\nAccording to him, the undiscovered series was part of an exclusive list of Nigerians who had been crucial in rebuilding and contributing to the Nigerian growth story in recent times.\nOnojake noted that each year, Forbes Africa looks for resilient game-changers, self-starters, innovators, entrepreneurs, and disruptors who have been leading ideas and industries while purposefully contributing to nation-building and positively impacting the lives around them.\nOnojake said, “Alongside Ogunsemo, public and private sector leaders from business technology, education, the arts, and health sectors were also listed.\n“Some of these names include Chairman and Chief Executive Officer of Cosgrove, Umar Abdullahi; Founder and CEO of Flutterwave, Olugbenga Agboola; GMD/CEO of Zenith Bank Plc, Ebenezer Onyeagwu, amongst others."
  },
  {
    "headline": "Again, PDP extends sale of nomination forms",
    "summarized_story": "Debo Ologunagba, the party’s national publicity secretary, disclosed this in a statement titled ‘2023: PDP adjusts timetable, announces further extension of sales of nomination forms,’ issued in Abuja on Thursday.\nThe party also instructed that all duly completed state assembly forms are to be submitted at the various States Secretariat of the Party.\nWith 13 presidential aspirants who have already picked forms, the PDP has so far made N486m from the sales of expression of interest and nomination forms since March 17, 2022.\nThe presidential nomination form costs N35m while the Expression of Interest form is N5m, totaling N40m per aspirant.\nHowever, female presidential aspirants would pay N1m and N5m respectively for nomination and the Expression of Interest forms."
  },
  {
    "headline": "Those castigating Senator Omisore doing so bad faith – Loowa Adekola",
    "summarized_story": "By Sunday Oguntuyi, OsogboHis Royal Highness, Loowa of Ife, Adekola Adeyeye, on Thursday reacted to the spate of criticisms against their son Senator Iyiola Omisore following his emergence as APC national secretary, saying they are being done in bad faith.\n“With absolute certainty, I can always, conveniently and openly vouch for the integrity, appropriateness and decency of Otunba (Senator) Iyiola Omisore, one of the highly resourceful sons of Ile-Ife, who today by the grace of God is the National Secretary of All Progressives Congress (APC).\n“As an elderstateman, and an octogenarian, I expected the literary icon to know better that such unhealthy development would not do the Yoruba nation proud.\nIn the light of this, I once again stand with Otunba (Senator) Iyiola Omisore and nothing can change that, and every gang ups against him will never stand.\nMay God bless Yorubaland and accordingly bless Nigeria.” Oba Adekola concluded"
  },
  {
    "headline": "Ekiti Wins Best Performing State Disease Surveillance Award In Nigeria",
    "summarized_story": "Ekiti State has been given an Award of Excellence as the best performing state in Nigeria on Disease Surveillance at the 4th Annual Disease Surveillance meeting of Nigeria Centre for Disease Control (NCDC) .\nThe Commissioner for Health and Human Services, Dr. Oyebanji Filani who made this known to journalists in Ado Ekiti said that the state earned the award through the commitment and untiring efforts of the Ekiti State government and the support of the leadership and staff of the state’s Ministry of Health at ensuring health security of Ekiti residents.\nFilani explained that the state had invested in health security through various projects including building a Molecular Laboratory to enable quick and accurate diagnosis and analysis of samples.\n“We have decentralized our Emergency Operation Centre (EOC) functions to all the 16 Local Governments to further strengthen our early warning systems and Surveillance, “he stated.\nThe Director General Nigeria Centre for Disease Control (NCDC) Dr. Ifedayo Adetifa who presided over the meeting noted that Ekiti State emerged first as the best performing state across country stating that all indicators used to measure performance showed that Ekiti scores highest mark in Disease surveillance in Nigeria in the year under review."
  },
  {
    "headline": "Lagos Assembly Harps On Accessible, Sustainable Health Care Delivery",
    "summarized_story": "Lagos State House of Assembly has stressed the need to bring qualitative health care services to the residents.\nTo achieve the objective the State Assembly in partnership with Legislative Advocacy Initiative and Sustainable Initiative have provided a platform to deepen Legislative understanding on health matters.\nSpeaking at the sidelines of a two day parley held in Lagos , the Deputy Speaker Lagos State House of Assembly Wasiu Eshinlokun Sani who represented Speaker of the House Rt Hon.\nIn his own remarks the Chairman Lagos State House of Assembly Committee on Health Hon.\nSetonji David said the projection of the World Health Organization is that health care should be available to mother and child within 30 minutes of need or two kilometers."
  },
  {
    "headline": "Oil Theft: Court Jails Captain 1 Year, Forfeits Vessel To Federal Govt",
    "summarized_story": "Justice Nicholas Oweibo of the Federal High Court in Lagos has convicted and sentenced a vessel Captain, Omosehin Ipinle to one-year imprisonment for illegal oil bunkering.\nThe judge sent Captain Ipinle to jail after he changed his earlier not guilty plea to guilty.\nThey had initially pleaded not guilty to the charge and the court admitted to bail.\nHowever, during the course of their trial, the third defendant, Nsikak Friday, jumped bail and never showed up in court again for his trial.\nWhen the case was called yesterday, the convict changed his plea following a plea bargain agreement with the anti-graft agency."
  },
  {
    "headline": "Put PDP Back On Track Now Or Face Defeat, Bode George Tells Ayu",
    "summarized_story": "A former Deputy National Vice Chairman (Southwest) of People’s Democratic Party (PDP), Chief Bode George, has appealed to the National Chairman of the Peoples Democratic Party (PDP), Iyorchia Ayu to quickly put the party on winning ways by correcting some pitfalls that could mar the party’s chances of winning the forthcoming 2023 general election or face imminent defeat.\nChief George who said he had written a personal letter to the national chairman over what he called political rascality at a caucus added that, ‘’ All we are saying is that the procedure is faulty.\nThey only accredited three Local Governments out of 20 on the day of election and they went in to start voting.\n‘’The Independent National Electoral Commission (INEC) wrote a report that they accredited only three local governments out of 20 .\nIt guarantees that commitment, it guarantees that oneness, it guarantees that you have a sense of belonging to this country called Nigeria,’’ he said."
  },
  {
    "headline": "85 % Of Criminals In Anambra From Neigbouring State –Soludo – Leadership News",
    "summarized_story": "Governor Chukwuma Soludo of Anambra State yesterday said no fewer than 85 per cent of criminals arrested for destabilising the state were from a sister state.\nHe said while the criminals so far arrested at different parts of the state were from a particular state in the South East, the remaining 15 per cent hailed from others states from the region.\nCommunities such as Lilu, ihiala, Orsumogu, Uli and a few others in Aguta share boundaries with some of the areas affected by the IPOB crisis in Imo State.\nThe governor assured the people that peace and stability would return to Anambra and the South East generally.\n“We must create a liveable and prosperous homeland where peace, security and progress must thrive,” he said."
  },
  {
    "headline": "Obi Cubana donates N40m to struggling classmates: Nigerians react",
    "summarized_story": "Billionaire Obi Cubana has surprised some of his classmates at Dennis Memorial Grammar School Onitsha, with a donation of N40m to be shared by 20 of the struggling mates.\nObi Cubana, whose real name is Chief Obinna Iyiegbu, made the donation on Friday as he hosted his class 92 for a reunion in Abuja.\n“Obi Cubana is that friend you want to have.\nObi Cubana exemplifies this”.\nKelechi Imo @Kelechii_Imo also wrote: Obi Cubana has set a standard!"
  },
  {
    "headline": "Blackout: Nigerians slam Eko, Ikeja DisCos",
    "summarized_story": "Nigerians on Saturday slammed Eko Electricity Distribution Company and Ikeja Electric Plc over the epileptic power supply being experienced in Lagos State in the past weeks.\nNAN quotes Eko DisCo as confirming that the national grid had collapsed, a development it said was responsible for the outage being experienced by customers within its network.\nHowever, some customers told NAN that they had not received a power supply from the DisCos for days before the incident.\nWe have been in total darkness since last Saturday,” he said.\nHe explained that the drop in power generation was responsible for the poor supply of power to customers by the DisCos."
  },
  {
    "headline": "BREAKING: Amaechi Declares Interest In 2023 Presidency",
    "summarized_story": "The Right Honourable Minister of Transportation Rotimi Amaechi has entered the presidential run for 2023.\nAmaechi, who has previously stated that he is not interested in running for president in 2023, expressed his interest in the race on Saturday.\nDetails will be provided later…"
  },
  {
    "headline": "Nigerian Musician, Sister Osinachi Nwachukwu Who Sang ‘Ekwueme’ Confirmed Dead",
    "summarized_story": "Sister Osinachi Nwachukwu, a well-known Nigerian musician, has died.\nShe was confirmed dead today, and according to what we’ve learned, she has been on life support for the past two months.\nThe gifted musician, who had an exquisite voice, is well known for the song Ekwueme, and many people have expressed their grief after learning of her death."
  },
  {
    "headline": "BREAKING: Again, Electricity National Grid Collapses",
    "summarized_story": "The country’s electricity national grid has once again collapsed, leaving the country without public power.\nThe grid’s manager, the Transmission Company of Nigeria (TCN), announced last month that it had devised alternate grid management methods.\nTCN had stated that its “in-house engineers have deployed a stop-gap solution to improve grid monitoring and acquisition of data from remote stations (power stations and transmission substations) to the National Control Centre.\n“The stop-gap solution became necessary as TCN could not access and receive comprehensive operational data of the entire power grid for managing the fast-growing system.\nThe existing inadequate SCADA System cannot provide adequate grid visibility, as parts of the existing SCADA system are moribund and damaged, coupled with an ineffective telecommunication network infrastructure."
  },
  {
    "headline": "The EFCC and Real Estate Developers have reached an agreement to fight corruption and money laundering.",
    "summarized_story": "The EFCC and Real Estate Developers have reached an agreement to fight corruption and money laundering.\nThe Economic and Financial Crimes Commission (EFCC) and the Nigerian Real Estate Developers Association (REDAN) have agreed to clean up the industry.\nThe EFCC, according to Bawa, will assist the body in passing the proposed Real Estate Regulation and Development Bill.\n“In Nigeria, real estate has become a convenient means for corrupt public and private sector officials to launder their criminal earnings.\n“There isn’t a day that goes by that the EFCC isn’t tracing one or more profits of crime into real estate,” he said."
  },
  {
    "headline": "Again, gunmen strike, kidnap commissioner’s wife, daughter",
    "summarized_story": "Gunmen on Saturday morning abducted the wife and daughter of the Commissioner of Environment in Plateau State, Idi Bamaiyi.\nAccording to reports, both mother and daughter were abducted when the gunmen invaded the residence of the commissioner.\nAccording to eyewitnesses, the attack lasted for about an hour as the gunmen blocked major roads in the township while the operation was ongoing.\nGindiri township and its environs have been under a series of attacks by gunmen in the past few weeks during which several residents were abducted.\nPolice were yet to make any statement as at time of filling this report."
  },
  {
    "headline": "For the fourth time in 2022, national grid collapses, plunges Nigeria into darkness",
    "summarized_story": "For the fourth time in 2022, the National grid has collapsed, plunging the some part of the country in darkness.\nBoth the Eko Electricity Distribution Company (EKEDC) and Abuja Electricity Distribution Company (AEDC) revealed that the sudden power outage on Friday evening interrupted supply in their areas of operation.\nAEDC in a tweet said, “Please be informed that there has just been a national grid collapse causing an outage in our franchise areas.\n“We apologise for the inconvenience caused and appeal that you bear with us while we await restoration from the TCN (Transmission Company of Nigeria).\nWe regret all inconvenience caused.”EKEDC informed their customers in a similar manner."
  },
  {
    "headline": "[Breaking] 2023: Amidst consensus moves, Southern PDP governors insist on presidential ticket",
    "summarized_story": "Ahead of the People’s Democratic Party (PDP) presidential primary election slated for May 28 and 29, 2022, the governors from the Southern part of Nigeria on the party’s platform have insisted that 2023 presidential ticket should be zoned to the south for fairness and equity.\nBlueprint reports that the Benue state governor, Samuel Ortom-led 37-man PDP zoning committee had earlier recommended that the 2023 ticket be thrown open.\n“We have not seen any reason to change our position, because the party was founded based on equity and justice.\nHe said, “… I want to reiterate the position of the Southern governors, it is not my duty to speculate on what others are doing.\nWhat is it that if we do it today we serve with the fairness of equity and justice."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Soludo declares Monday, a prayer session to counter IPOB sit-at-home order – NigPilot",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has urged the people of the state to observe a one-day prayer session on Monday, to curb the activities of the gunmen terrorising the state and the South East region in general.\nThe governor said the prayer session slated to hold on Monday, April 4, 2022, at churches and other religious worshipping centres across the state was necessary to counter the evil attached to the Indigenous People of Biafra, IPOB sit-at-home order.\nHe explained that the prayer session would be against those hiding under the IPOB name to cause havoc in the state.\n“I enjoin you to pause and join in fellowship as we seek the face of God.It is expected that the conclusion of the prayer session shall mark the end of Sit At Home in Anambra State” Soludo declared.\n” We shall empower them to become useful to their families, communities, state, region and the society at large."
  },
  {
    "headline": "2023 Polls: Throwing Presidential Ticket Open Is Unjust – PDP Southern Governors",
    "summarized_story": "Southern governors elected on the platform of the Peoples Democratic Party (PDP) have demanded that the party’s presidential ticket be zoned to the region ahead of the 2023 general elections.\nThey kicked against the purported recommendation of the PDP Zoning Committee that the slot be thrown open for all to contest.\nThe governors who held an emergency meeting to deliberate on the matter stated that any attempt by the party’s leadership to throw the presidential ticket open would be deemed to be unjust and must be rescinded.\nAbia State Governor, Okezie Ikpeazu, made the position of the governors known to reporters on Saturday morning at the end of the meeting held at the Akwa Ibom Governor’s Lodge in Abuja, the nation’s capital.\nThe PDP National Working Committee inaugurated the zoning committee on March 24 following the debates and controversies over where the party’s presidential candidate should emerge."
  },
  {
    "headline": "Buhari Signs Bill Extending Retirement Age, Service Period For Teachers By Five Years",
    "summarized_story": "President Muhammadu Buhari has assented to the Harmonised Retirement Age for Teachers in Nigeria Act, 2022.\nOn January 20, 2021, the Federal Executive Council (FEC) approved a bill that sought to increase the retirement age and the service years of teachers.\nREAD ALSO: House Passes Bill To Raise Teachers’ Retirement Age, Service YearsFollowing its transmission to the National Assembly after a few months, lawmakers in the House of Representatives passed the bill on November 9 last year.\nTeachers across the country now have their retirement age and years of service extended by five years as President Buhari assents to the Harmonised Retirement Age for Teachers in Nigeria Act.\nApart from the Act, Shehu revealed that the President has assented to the Animal Diseases (Control) Act, 2022."
  },
  {
    "headline": "Blackout Hits Lagos, Abuja, Kano, Others As National Grid Collapses Again",
    "summarized_story": "It is another blackout in Lagos, Abuja, Kano, Katsina and Jigawa States after the national grid collapsed on Friday evening.\nThey include Eko Electricity Distribution Company (EKEDC), Abuja Electricity Distribution Plc (AEDC), and Kano Electricity Distribution Company (KEDCO).\nIn its update to consumers in Kano, Katsina, and Jigawa States, KEDCO apologised for any inconveniences the outage might have caused.\n“We write to inform our numerous customers in Kano, Katsina, and Jigawa States that the current power outage is due to a system collapse on the National Grid.\n“Which as a result causes the current power outage on our network."
  },
  {
    "headline": "Ukraine War Pushes World Food Prices To Record High",
    "summarized_story": "World food prices hit an all-time high in March following Russia’s invasion of agricultural powerhouse Ukraine, a UN agency said on Friday, adding to concerns about the risk of hunger around the world.\nThe index, a measure of the monthly change in international prices of a basket of food commodities, averaged 159.3 points in March.\nThe FAO’s vegetable oil price index surged by 23.2 percent, driven by higher quotations for sunflower seed oil, of which Ukraine is the world’s leading exporter.\nThe United States has accused Russian President Vladimir Putin of creating “this global food crisis”.\nFAO chief Qu Dongyu called Friday on countries not to restrict food exports, which would only worsen the situation for countries dependent imports."
  },
  {
    "headline": "UK Minister’s Wife To Pay Taxes On Worldwide Income Amid Row",
    "summarized_story": "Akshata Murty, wife of Britain’s finance minister Rishi Sunak, announced Friday she will start paying UK tax on “all worldwide income,” amid controversy over her non-domiciled status.\nSunak has accused critics of mounting a “smear” campaign against his wealthy Indian wife, whose substantial foreign earnings have been shielded from UK taxes.\n“This means I will now pay UK tax on an arising basis on all my worldwide income, including dividends and capital gains, wherever in the world that income arises”.\nLike I love mine,” he said, adding that “every single penny she earns in the UK she pays UK taxes on”.\nAllies of the finance minister told the Daily Telegraph newspaper that they believed Johnson’s office was behind damaging recent leaks."
  },
  {
    "headline": "Edo LG Poll: EDSIEC suspends conduct of elections",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has suspended the conduct of the local government elections scheduled for April 19, 2022.\nAccording to a statement signed by Emmanuel Abebe on behalf of the Chairman of EDSIEC, the suspension of the local council elections was due to the restraining order by the Federal High Court, Abuja on the Edo State Independent Electoral Commission.\nThe commission said all processes leading to the conduct of the elections have been suspended, pending the hearing and determination of the Motion on Notice.\nHe said the announcement is for the information of the general public that due to the content of the publication in the Vanguard Newspaper of 7th April, 2022 by which the Federal High Court Abuja restrained the Edo State Independent Electoral Commission from conducting the Local Government Elections in the State scheduled for 19th April 2022, all processes leading to the conduct of the said elections are hereby suspended, pending the hearing and determination of the Motion on Notice.”"
  },
  {
    "headline": "NLC pickets venue of Govs' meeting in Abuja over LG autonomy -",
    "summarized_story": "The Nigeria Labour Congress on Friday picketed the venue of governors’ meeting in Abuja over local government autonomy.\nArmed with placards bearing various inscriptions, the labour leaders say there is no going back on their demand for financial and administrative autonomy for local government.\nSee pictures below:"
  },
  {
    "headline": "Ex-President Jonathan's road crash saddening, says Buhari",
    "summarized_story": "President Muhammadu Buhari has commiserated with former President Goodluck Ebele Jonathan on the demise of his two personal staff in a road accident.\nPresident Buhari joined fellow countrymen in praying for the repose of the deceased aides of the former President and urged their families to see their demise as a sacrifice for the nation.\nThe President expressed gratitude to Almighty God for having President Jonathan escape unhurt from the accident, urging him not to be distracted from his frequent local and international travels which are linked to peace building at home and abroad."
  },
  {
    "headline": "Makinde declares interest in seeking re-election",
    "summarized_story": "Governor of Oyo state, Seyi Makinde has officially declared his intention to run for a second term as the governor of the state in the forthcoming election.\n“Sometime last week, I picked up the Expression of Interest and Nomination forms for a second term as the elected Governor of the good people of Oyo State.\n“In the last three years, Oyo State has seen unprecedented development in all sectors with no zone left behind.\nWe have worked hard in all the four pillars upon which our Roadmap to Accelerated Development in Oyo State 2019-2023 is built.\nIf you, the good people of Oyo State desire it, then we will serve you for four more years”, he added."
  },
  {
    "headline": "Will Smith Banned from Oscars for 10 Years Over Chris Rock Slap",
    "summarized_story": "The Academy of Motion Picture Arts and Sciences will prohibit actor Will Smith from attending the Academy Awards for 10 years following his Oscars night slap of Chris Rock, the organization announced Friday.\nSmith, who slapped Rock for making a joke about his wife, Jada Pinkett Smith, already resigned from the group behind the Academy Awards — a move that prevented the motion picture academy from suspending or expelling him.\nIn a tearful acceptance speech, Smith apologized to the academy.\n“We want to express our deep gratitude to Mr. Rock for maintaining his composure under extraordinary circumstances,” the group said.\nIn “King Richard,” Smith portrays Richard Williams, the ambitious father of tennis superstars Venus and Serena Williams."
  },
  {
    "headline": "Nigeria Overtakes Iraq as Country with Highest Number of IS Attacks",
    "summarized_story": "Nigeria now has the highest number of attacks by the Islamic State (IS), according to Jihad Analytics, a consultancy company which processes data on global and cyber jihad.\nRelatedStories No Content AvailableData by Jihad Analytics showed that while Nigeria has recorded a total of 162 IS operations since January 2022, Iraq has recorded 120.\n“Since the beginning of the year, the Islamic State has conducted half of its attacks in #Africa,” the company wrote in a tweet on Friday.\n“For the first time in the history of the jihadi group, Iraq is no longer the country where #IS claims the highest number of operations: the group #ISWAP is now more active in Nigeria.”ISWAP, since it broke out of Boko Haram, has been terrorising Nigeria’s north-east.\nIt has been reported that as many as former Boko Haram commanders have joined ISWA after Shekau’s death,” the report reads."
  },
  {
    "headline": "Food Insecurity Leaves 8.4 million in Dire Need of Humanitarian Assistance in Northeast Nigeria, UN Says",
    "summarized_story": "The United Nations has said the deterioration of food security in Borno, Adamawa and Yobe states have left more than 8.4 million people in dire need of humanitarian assistance and protection.\n“This is a 19 per cent increase in the number of people in need of food security assistance since the October 2021 analysis, including an alarming 28 per cent increase in the number of people in the emergency category.\nThe analysis indicates that 1.74 million children aged 6-59 months will need treatment for acute malnutrition in 2022.\nThe statement further added that: The 2022 Humanitarian Response Plan for Nigeria is seeking $1.1 billion to support 5.5 million people.\n“The initiative aimed to raise awareness and advocate for urgent resource mobilization from both the international community and the Nigerian Government.”Michael Olugbode in Abuja"
  },
  {
    "headline": "Nigeria: Use Forensic Accounting to Reveal Terrorism Financiers, ICAN Tells Buhari",
    "summarized_story": "The Institute of Chartered Accountants of Nigeria (ICAN) on Friday told President Muhammadu Buhari that the financiers of terrorism in the country could be traced and checked through the application of the principles of forensic accounting.\nICAN President, Mrs Comfort Olu Eyitayo, who spoke on behalf of the Institute, emphasised that Forensic Accounting, working with security outfits, could be used to reduce the security challenges facing the country by tracking all monies used in committing crimes, and payments.\n“Fighting terrorism is a big challenge across the world and we commend the efforts being made to stem this tide in our country.\n“As Chattered Accountants, we acknowledge our role in combating terrorism by the application of the principles of forensic accounting and following the money to fish out the perpetrators of these illegal activities.\nThe President noted the contributions of the Institute in ensuring probity, accountability and transparency, urging more diligence and professionalism."
  },
  {
    "headline": "CBN’s Crackdown on Cryptocurrency Trading Results in N1.3bn Fines for Six Banks in 2021",
    "summarized_story": "In the latest revelation from the banks’ full year 2021 financial report, First City Monument Bank (FCMB), Fidelity Bank Plc.\nThe FCMB was fined N400 million over its failure to close four accounts of customers said to be involved in cryptocurrency trading.\nFidelity Bank Plc.\nAccess Bank Plc.\nThe country also has the largest proportion of retail users conducting crypto transactions under $10,000, Chainalysis says."
  }
]