[
  {
    "headline": "Nnamdi Kanu’s collaborators will not be spared –FG",
    "summarized_story": "The Federal Government on Thursday said none of the collaborators of the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, who was re-arrested on Sunday and repatriated to the country would be spared.\nHe said, “While the investigation continues, we assure you that none of the collaborators, irrespective of their standing in the society, will be spared.\nHe however admitted that the re-arrest was made possible by the diligent efforts of security and intelligence agencies in collaboration with undisclosed countries.\nHe added, “There have been speculations on how this re-arrest was pulled off and in which country the hitherto fugitive leader of the proscribed IPOB was nabbed.\n“We commend the professionalism, diligence, patriotism and painstaking efforts of our security and intelligence agencies."
  },
  {
    "headline": "Nnamdi Kanu won’t be denied fair trial, says FG",
    "summarized_story": "The Federal Government has said the leader of the Indigenous People of Biafra, Nnamdi Kanu, will not be denied a fair trial.\nThis is according to the Minister of Information and Culture, Lai Mohammed, who spoke at a press conference in Abuja on Thursday on the re-arrest of the IPOB leader.\nHe said, “We can tell you that the forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaborators.\n“It is interesting that many are suddenly calling for a fair trial for Kanu as if he didn’t get one before he decided to jump bail and flee.\nHowever, I can assure you that the fair deal that Kanu denied many of the victims of the violence which he willfully instigated through his broadcasts and tweets will not be denied him."
  },
  {
    "headline": "BREAKING: Bloodbath as gunmen invade Sunday Igboho’s residence, move corpses from scene",
    "summarized_story": "Igboho, wife, children not among casualtiesBarely 72 hours to the proposed Yoruba Nation Rally, Sunday Igboho’s Ibadan residence was invaded by gunmen with many feared dead.\nThe gunmen reportedly invaded the house early hours of Thursday in convoy of about 15 vans in camouflaged colours.\nThey engaged in a heavy gun battle with some of Sunday Igboho’s boys leaving unspecified numbers dead.\nReport also has it that some of the gunmen suffered casualties, but as at press time, the bodies of the victims were reportedly taken away by the gunmen.\nEyewitness also confirmed that Sunday Igboho’s wife and children were not in the building at the time of the attack."
  },
  {
    "headline": "We trailed Kanu for over 2 years before his re-arrest – FG",
    "summarized_story": "Lai MohammedThe Federal Government says security and intelligence agencies were on the trail of the proscribed Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu for over two years before he was re-arrested.\nThe minister said Kanu’s re-arrest and repatriation was made possible through the collaboration of Nigerian security and intelligence agencies.\nHe described the re-arrest and repatriation as “one of the most classic operations of its type in the world’’.\nMohammed, however, did not comment on the speculations on how the re-arrest was pulled off and in which country the hitherto fugitive leader of the proscribed IPOB was nabbed.\nThe minister also assured that Kanu would get a fair trial in measure with the offence he was being prosecuted over."
  },
  {
    "headline": "Hold Buhari, Army, DSS responsible for attack on Sunday Igboho ― Prof Akintoye",
    "summarized_story": "He also alleged that the assailants were all dressed in military uniform and spoke French language fluently.\nProf. Akintoye further alleged that the gunmen killed seven occupants in the building and whisked Igboho’s wife and several others away.\nWe have adhered with both the Nigerian and International Laws guiding the agitation for Self-Determination.\n“Therefore, I say on behalf of the Yoruba people that this attack on Chief Ighoho’s house was unnecessary, unfortunate, wicked, callous, cruel, irresponsible, illegal and atrocious.\n“We want to confirm again that the Pro-Yoruba Nation rally scheduled to hold on Saturday July 3rd, in Lagos will proceed as scheduled.”Vanguard News Nigeria"
  },
  {
    "headline": "It’s not a wise step — Reactions trail invasion of Igboho’s house",
    "summarized_story": "Recall the self-acclaimed freedom fighter called on all and sundry to join the Yoruba Rally slated for Saturday, July 3.\nBelow are some of the reactions gathered by Vanguard;@ayemojubar: “Attack on Sunday Igboho’s residence, they came and like they did at Lekki tollgate, they left with the bodies.\nThe pattern is enough to reveal those behind this attack.”@omo_agunlofi: “I don’t know if this is true or not but if the attack on Chief Sunday Igboho’s House was truly from the FG, it isn’t a wise step at all.\nMazi Nnamdi Kanu abducted , Sunday Igboho residence raided by Nigeria security operatives.\nThey can only delay it but can’t kill it.”@YemieFASH: “I watched the BBC Yoruba video of Sunday Igboho’s house after the attack."
  },
  {
    "headline": "Five feared dead as gunmen attack Sunday Igboho’s residence again",
    "summarized_story": "The latest attack on Igboho’s residence would be the third time that such attack would take place.\nIn a viral video, a lady was calling for help before the hoodlums gained entry into the palatial residence at Soka area of Ibadan.\nIn another viral video, the spokesperson of Igboho, Mr Olayomi Koiki, said, “This is the Soka residence of Chief Sunday Igboho.\nThey killed our people and took their corpses away so that there won’t be proofs that they killed them.\nAnother source told Vanguard that one man praying on the mat was killed and another person was killed in the bathroom."
  },
  {
    "headline": "NMGS vows to end illegal mining, indiscriminate borehole drilling in Yobe",
    "summarized_story": "The Nigerian Mining and Geosciences Society (NMGS) has vowed to work in synergy with relevant regulatory agencies with a view to curbing illegal mining and indiscriminate drilling of boreholes in Yobe State.\nHe said illegal mining and indiscriminate drilling of boreholes are inimical to the environment as well as the development of the state.\nHe also stressed that Yobe State is endowed with large deposits of solid minerals across its 17 local government areas.\n“As we all, Yobe State is endowed with large deposits of solid minerals across the 17 local government areas of the state.\n“In Yobe State, our main source of water is from the ground, because of this, there is indiscriminate drilling of boreholes."
  },
  {
    "headline": "Osun govt submits list of caretaker committee of LGs to State Assembly",
    "summarized_story": "Information at the disposal of DAILY POST confirms that the Osun State Government has sent the list of appointees into Chairman, Secretary and members of the Caretaker Management across the local governments, local council development areas and area councils to the Osun State House of Assembly for approval.\nDAILY POST gathered from verified sources that the Speaker of the State House of Assembly, Timothy Owoeye, had received the submitted list since late Wednesday, 30th June, 2021.\nDetails later"
  },
  {
    "headline": "UTME: Osun group hails student for scoring 350",
    "summarized_story": "A group, the Federation of Ede Youths Development Association, has congratulated Qamorudeen Abdulwasii Alabi for scoring 350 out of 400 during the recently concluded Unified Tertiary Matriculation Examination (UTME).\nWhile congratulating Alabi, the group in a signed statement by its national president, Abdulazeez Mufutaudeen Idowu, said Alabi’s success at the UTME examination has made them proud.\nIt stated that this was the second time an indigene of the town was scoring the third best mark in UTME, having achieved the feat in 2020.\nMeanwhile, the Osun State Commissioner for Education, Folorunsho Oladoyin Bamisayemi, disclosed to DAILY POST that the ministry will bring the matter before the attention of the state government.\n“It is a soothing development in these days of overwhelming social media distractions for our students”, he added."
  },
  {
    "headline": "Nnamdi Kanu's rearrest, clear message to Sunday Igboho",
    "summarized_story": "The Arewa Youth Consultative Forum (AYCF) has said that the rearrest of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB) is a clear message to agitators.\nAYCF National President, Yerima Shettima said Kanu’s rearrest would send a clear signal to Yoruba freedom fighter Sunday Adeyemo also known as Sunday Igboho.\nSpeaking with DAILY POST, Shettima said with Kanu’s rearrest, agitators should learn not to resort to violence.\nAsked if Kanu’s arrest was a message to other agitators, Shettima said: “This is a clear message to the likes of Igboho, I’m happy that this happened.\nIt’s a clear message to all those who think that they can undermine the sovereignty of this nation and get away with it."
  },
  {
    "headline": "How Sunday Igboho’s residence was allegedly invaded",
    "summarized_story": "DAILY POST gathered that the residence, located at Soka area in Oluyole Local Government Area of Oyo State was allegedly invaded around 2 a.m. on Thursday.\nMany of the close associates of Sunday Igboho claimed that the house was invaded by security agents, a claim some security agents who spoke with DAILY POST dismissed.\nHowever, sources close to Sunday Igboho, who spoke with journalists on Thursday, insisted that security agents invaded the residence.\nHow gunmen invaded Sunday Igboho’s residence – Aide“They came with many Hilux vehicles.\nOladokun, who was one of the early callers at the Igboho residence on Thursday, decried the attack."
  },
  {
    "headline": "I predicted Burna Boy, Wizkid, Davido’s global acclaim, says Charly Boy",
    "summarized_story": "By Sam AnokamCharly Boy has revealed how he predicted global acceptance which many Nigerian musics acts like Burna Boy, Wizkid and Davido are enjoying.\nIn an exclusive chat with The Nation, Charly Boy said he predicted a time would come when Nigerian artists will be respected globally.\nADVERTISEMENT“Isn’t that what I said 20 years ago when they were treating the Nigerian artists anyhow.\nI said there would come a time when Nigerian artists will be respected.\n“We haven’t even hit the glass ceiling yet, this is just a tip of the iceberg,” Charly Boy revealed."
  },
  {
    "headline": "FG assures Kanu of fair hearing",
    "summarized_story": "By Yusuf Alli and Onyedi Ojiabor, AbujaThe Federal Government has assured detained leader of the Indigenous Peoples of Biafra (IPOB) Nnamdi Kanu will get fair hearing.\nMinister for Information and Culture Lai Mohammed, in a briefing in Abuja, told all those seeking justice for Kanu the suspect will get a fair trial.\nADVERTISEMENT“It is interesting that many are suddenly calling for a fair trial for Kanu as if he didn’t get one before he decided to jump bail and flee.\n“However, I can assure you that the fair deal that Kanu denied many of the victims of the violence which he willfully instigated through his broadcasts and tweets will not be denied him.”"
  },
  {
    "headline": "Five reportedly killed as gunmen attack Sunday Igboho’s residence",
    "summarized_story": "By Yinka Adeniran, IbadanHundreds of youths and supprters of Yoruba Nation Agitator Sunday Adeyemo aka Sunday Igboho on Thursday morning stormed his Soka residence where five persons were reportedly killed during an attack in solidarity.\nUnconfirmed sources hinted at least five persons were killed in the attack.\nThe main building and six other apartments in the compound were ransacked with blood stains on different parts.\nMany windows glass were shattered, furniture damaged with gunshot holes in different parts of the buildings.\nThe youths, who wore sombre look inside the compound and different parts of the street stretch, blamed the military for the attack."
  },
  {
    "headline": "BREAKING: How we re-arrested Kanu, by FG",
    "summarized_story": "It said some countries and intelligence agencies, with which it has obligations, assisted to arrest Kanu.\nBut the government did not name the affected countries or intelligence agencies.\n”Read Also: Security probes Kanu to uncover IPOB financiersHe said Nigeria had been on the trail of Kanu for two years.\n“This was made possible through the collaboration of Nigerian security and intelligence agencies.\n“We commend the professionalism, diligence, patriotism and painstaking efforts of our security and intelligence agencies."
  },
  {
    "headline": "Two killed as unknown persons attack Igboho’s house (See photos)",
    "summarized_story": "Two persons have been killed during an early morning attack on the residence of Yoruba separatist activist, Sunday Adeyemo, also known as Sunday Igboho, in the Soka area of Ibadan, Oyo State, his spokesman, Olayomi Koiki, has said.\nA video circulating on social media shows Sunday Igboho’s building and a pool of blood inside the apartment .\nThe narrator in the video who spoke in Yoruba language said: “The situation now is very bad.\nTwo Yoruba sons have been killed in the house of Chief Sunday Igboho.\nWe do not know of the location where they were taken to.”However the spokesman for Igboho, Olayomi Koiki, said the house was attacked around 1am on Thursday and alleged that the attackers ” soldiers."
  },
  {
    "headline": "Kalu’s magic wand in Abia North",
    "summarized_story": "But, with the election of Orji Kalu, former governor of Abia State and current Senate Chief Whip, into the Senate to represent Abia North, the narrative changed.\nArochukwu LGAMassive roads reconstruction is going on simultaneously in the five local government areas of Abia North senatorial zone, courtesy of Kalu’s political dexterity.\nAn elated Chief Aru told Kalu: “This road is a product of Senator Kalu’s ideology of sincerity in Nigerian politics.\nToday, Abia North stands out among other senatorial districts in Abia State and he has made us proud.\nAlso on Kalu’s construction radar is the 1km extension rural road with drainage and asphalt from Ozara junction to Umuasu (junction of University Road)."
  },
  {
    "headline": "Bandits kill Zamfara lawmaker, kidnap son, driver",
    "summarized_story": "A member of the Zamfara State House of Assembly representing Shinkafi constituency, Alhaji Mohammed G. Ahmed, has been reportedly killed by bandits, on Tuesday night.\nIt was also gathered that the gunmen, after killing the lawmaker, also abducted his son and the driver.\nThe lawmaker’s son and driver were kidnapped by bandits,” he said.\nThe incident was further confirmed by the Clerk of the Zamfara House House of Assembly, Alhaji Shehu Saidu Anka.\nAnka said the late lawmaker was killed along the Sheme – Kankara road, in Katsina state, while travelling out of Zamfara state."
  },
  {
    "headline": "Banditry, kidnapping threat to Anambra, 2023 elections, INEC raises fresh alarm",
    "summarized_story": "From Romanus Ugwu, AbujaIndependent National Electoral Commission (INEC) has raised fresh alarms on security threat from activities of banditry and kidnapping in the country confronting the conduct of free, fair and credible elections.\n“There are reasons to be concerned about the Anambra State governorship election and eventually the 2023 general election.\n“It has become the tradition of the commission, through the electoral institute, to engage stakeholders that will do justice to any topical issue germane to elections.\nIn this circumstance, the electoral institute is engaging security experts, media practitioners and people from the academia to do justice to this topic,” he said.\nDirector General of the electoral institute, Sa’ad Umar, said, “Security issues in Nigeria today are highly multifaceted as they are multi-tasking."
  },
  {
    "headline": "UK engages FG over Kanu’s arrest",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe government of the United Kingdom has disclosed plans to seek clarification from the Federal Government, circumstances surrounding the arrest of Kanu.\nThe British High Commission in Abuja, made the disclosure through its Head of Communications, Dean Hurlock.\n“In response to any queries on whether Nnamdi Kanu was extradited from the UK, we can reaffirm that Nnamdi Kanu was not arrested in the UK and nor was he extradited from the UK.\n“With regards to any questions about the possible legality of his arrest, the British High Commission in Abuja is currently in the process of seeking clarification from the Nigerian Government about the circumstances of the arrest,” the British High Commission said.\nThe British High Commission said the Foreign, Commonwealth and Development Office stood ready to provide consular assistance to Kanu."
  },
  {
    "headline": "UPDATE: Nigerian Soldiers, Secret Police 'Arrested' Cat They Believed Sunday Igboho Turned To During Invasion Of His House—Eyewitnesses",
    "summarized_story": "See Also Insecurity Heavy Gunshots As Soldiers Allegedly Attack Igboho's House, Kill Two Persons In Ibadan“It was God that saved me and others, they came prepared.\n“They even took away his cat when they didn’t see him.\nThey claimed it might be Ighoho that turned to the cat, so they took it away.\n\"They were asking for each person by name and they killed five and took away their corpses.\n\"They even killed some small cats and 'arrested' a bigger cat, believing Igboho might have turned to the cat.\""
  },
  {
    "headline": "UPDATE: Nigerian Soldiers, Secret Police 'Arrested' Cat They Believed Sunday Igboho Turned To During Invasion Of His House—Eyewitnesses",
    "summarized_story": "See Also Insecurity Heavy Gunshots As Soldiers Allegedly Attack Igboho's House, Kill Two Persons In Ibadan“It was God that saved me and others, they came prepared.\n“They even took away his cat when they didn’t see him.\nThey claimed it might be Ighoho that turned to the cat, so they took it away.\n\"They were asking for each person by name and they killed five and took away their corpses.\n\"They even killed some small cats and 'arrested' a bigger cat, believing Igboho might have turned to the cat.\""
  },
  {
    "headline": "Nigeria’s Problem is Nigerians; Not Ethnicity, Religion – Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that the problem confronting Nigeria is Nigerians, and not ethnicity or religion as being opined in some quarters.\nBuhari noted that Nigerians should be blamed for the injustices rather than ethnicity or religion, not minding the complexities of the Nigerian condition.\nHe said, “Our problem is not ethnicity or religion, it is ourselves.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion.\nAnd I’ve been everything; Governor, Minister of Petroleum Resources, Head of State, President and in my second term."
  },
  {
    "headline": "Nigeria’s Problem is Nigerians; Not Ethnicity, Religion – Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that the problem confronting Nigeria is Nigerians, and not ethnicity or religion as being opined in some quarters.\nBuhari noted that Nigerians should be blamed for the injustices rather than ethnicity or religion, not minding the complexities of the Nigerian condition.\nHe said, “Our problem is not ethnicity or religion, it is ourselves.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion.\nAnd I’ve been everything; Governor, Minister of Petroleum Resources, Head of State, President and in my second term."
  },
  {
    "headline": "Nigeria’s Problem is Nigerians; Not Ethnicity, Religion – Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that the problem confronting Nigeria is Nigerians, and not ethnicity or religion as being opined in some quarters.\nBuhari noted that Nigerians should be blamed for the injustices rather than ethnicity or religion, not minding the complexities of the Nigerian condition.\nHe said, “Our problem is not ethnicity or religion, it is ourselves.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion.\nAnd I’ve been everything; Governor, Minister of Petroleum Resources, Head of State, President and in my second term."
  },
  {
    "headline": "EXTRA: Kano Hisbah bans use of mannequins for clothes display",
    "summarized_story": "The Kano Hisbah board has banned the use of mannequins at shops, public and private places for clothes display.\nIbn-Sina said mannequins used by tailors, boutique owners, and for commercials violate Islamic provisions and teachings.\nAccording to him, the board will commence public sensitisation to educate people on the stands of Islam on the use of mannequins.\n”Hisbah prohibits the use of mannequins at shops, commercial and private residences, and other public places.\n“We have divided Kano into five areas for the monitoring and implementation of the ban across the state.”AdvertisementHisbah is a religious corps responsible for the implementation of Shariah law in Kano."
  },
  {
    "headline": "EXTRA: Kano Hisbah bans use of mannequins for clothes display",
    "summarized_story": "The Kano Hisbah board has banned the use of mannequins at shops, public and private places for clothes display.\nIbn-Sina said mannequins used by tailors, boutique owners, and for commercials violate Islamic provisions and teachings.\nAccording to him, the board will commence public sensitisation to educate people on the stands of Islam on the use of mannequins.\n”Hisbah prohibits the use of mannequins at shops, commercial and private residences, and other public places.\n“We have divided Kano into five areas for the monitoring and implementation of the ban across the state.”AdvertisementHisbah is a religious corps responsible for the implementation of Shariah law in Kano."
  },
  {
    "headline": "Army arrests 'ISWAP member running logistics for group' in Ogun",
    "summarized_story": "The Defence Headquarters says troops of Operation AWATSE have arrested one Ibrahim Musa, a suspected member of the Islamic States in West Africa Province (ISWAP), in Sango Otta area of Ogun state.\nAccording to him, an intelligence report revealed that Musa was on a mission to Lagos to acquire certain items for ISWAP’s operations in Maiduguri.\nOnyeuko said the troops had also sustained operational activities to forestall activities of vandals on NNPC pipelines at Gaun, Akute, Wawa I and II and Magbaro areas.\nAdvertisementHe said in another development, the troops, acting on intelligence, arrested one Oyeshola Saheed, for illegal oil bunkering activity at Alimosho NNPC pipeline.\n“However, he named one Mr Akanbi as the sponsor and financier of bunkering activities in the area,” he said."
  },
  {
    "headline": "Army arrests 'ISWAP member running logistics for group' in Ogun",
    "summarized_story": "The Defence Headquarters says troops of Operation AWATSE have arrested one Ibrahim Musa, a suspected member of the Islamic States in West Africa Province (ISWAP), in Sango Otta area of Ogun state.\nAccording to him, an intelligence report revealed that Musa was on a mission to Lagos to acquire certain items for ISWAP’s operations in Maiduguri.\nOnyeuko said the troops had also sustained operational activities to forestall activities of vandals on NNPC pipelines at Gaun, Akute, Wawa I and II and Magbaro areas.\nAdvertisementHe said in another development, the troops, acting on intelligence, arrested one Oyeshola Saheed, for illegal oil bunkering activity at Alimosho NNPC pipeline.\n“However, he named one Mr Akanbi as the sponsor and financier of bunkering activities in the area,” he said."
  },
  {
    "headline": "Report: Lobby firm hired by Nnamdi Kanu engages US government on his arrest",
    "summarized_story": "BW Global Group, the American lobby firm hired by Nnamdi Kanu, Biafra separatist leader, has reportedly engaged the US government over the arrest of the activist.\nAdvertisementForeign Lobby, a Washington-based platform, quoted the firm as saying it “had been in touch with the State Department and Congress” about the arrest of Kanu, who leads the Indigenous People of Biafra (IPOB).\nThe IPOB leader was said to have signed a contract with BW Global Group to help promote IPOB in a bid to achieve its secession objective of Biafra.\nThe $1750,000 deal reportedly took effect from March 1, 2021, and is expected to last for a year.\nThe British High Commission in Abuja said on Wednesday that it is “currently in the process of seeking clarification from the Nigerian government about the circumstances of the arrest”."
  },
  {
    "headline": "Inside Branch’s ambitious '20% investment' challenge to Nigerian banks",
    "summarized_story": "Four years, ₦40 billion (~$97 million) and three million loans later, the business is evolving.\nIt was the first question Dayo Ademola, Branch Nigeria’s managing director, faced on CNBC in May.\nBoth numbers would give a clearer picture of the returns on their three million loans.\nGoing by its profitability and investor capital, it would appear both metrics are in good health.\nIt will then be intriguing to see customer reaction to the newly launched investment offer."
  },
  {
    "headline": "Eswatini government shuts down internet amid violent pro-democracy protests",
    "summarized_story": "pic.twitter.com/Pk9ao9duio — Swazi News (@SwaziNews) June 29, 2021Eswatini protestors now operating at night burning businesses linked to King Mswati and Government properties.\nESWATINI GOVT orders major network providers to cut internet connection, closes schools, imposes 6pm-5am curfew as protests continue.\nBetween January 2020 and February 2021, internet and social media blackouts were imposed in Uganda, Chad, Tanzania, and Ethiopia.\nKing Mswati III has ruled by decree for more than three decades, with unfettered political power over his 1 million people.\nAmid the protests, reports say the king has fled to neighbouring South Africa although Eswatini’s acting Prime Minister, Themba Masuku, denied the claims on Tuesday."
  },
  {
    "headline": "From Supa Strikas to Startups, Tomi Davies’ approach to Angel Investing",
    "summarized_story": "With this knowledge, he co-founded the Lagos Angel Network in 2012, and a few years after, the African Business Angel Network (ABAN).\nAt Slush, they said we needed an African Angel network to create networks and to educate people on what angel investing is all about.\nI looked at Dotun Suleiman, he was my senior at King’s college and we formed the Lagos Angel Network together.\nIn Nigeria, I’ve been responsible for the South-South Angel Network, Abuja Angel Network and also in Lagos, the women’s only angel network called Rising Tide Africa.\nWe created the Diaspora Angel Network, to co-invest in the local angel networks."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "4 global tech giants commit to making their platforms safe for women and girls",
    "summarized_story": "Announced today, July 1, 2020, during the UN Generation Equality Forum held in Paris, is the public commitment of four of the world’s largest tech companies — Facebook, Google, TikTok, and Twitter — to make their platforms safer for women.\nThis is done in a bid to tackle online abuse against women and promote gender equality.\nIt will be specifically opened to women journalists, public figures, and abuse victims.\nKraicer believes that this public announcement would make the companies accountable while making others step up to the challenge.\nHowever, she adds that her organisation will be tracking the companies against their commitments and receive reports annually on their progress."
  },
  {
    "headline": "NIN-SIM linkage extended, Eswatini shuts Internet down, Zeepay raises $7.9M Series A and South Africa’s crypto regulation timeline",
    "summarized_story": "Good day,Today, I’m discussing:Nigerian government postponing NIN-SIM linkage deadlineEswatini’s Internet shutdownZeepay’s Series A fundingSouth Africa’s crypto regulation timeline.\nNIN-SIM linkage deadline postponedIf you’ve not linked your SIM card to your National Identification Number (NIN), the Nigerian government is showing you kindness once again.\nAccording to The Cable, the deadline for NIN-SIM linkage has been extended to July 26, 2021.\nZeepay raises $7.9M Series ASource: TechnextGhanian fintech startup, Zeepay has just closed a $7.9 million Series A round.\nEssentially, the country would oversee crypto activities like any other financial activity."
  },
  {
    "headline": "Nigerian healthtech startup, MDaaS Global, raises a $2.3m seed extension, launches e-diagnostic feature",
    "summarized_story": "Diagnostic healthtech startup, MDaaS, secured a $2.3 million seed extension funding and added a new product feature to its array called SentinelX.\nAlongside Opeyemi Ologun and Genevieve Oni, MDaaS Global was born.\nThey began by bringing secondary medical equipment into Nigeria from the US, offering service support, and then distributing it to hospitals via outright sale, rent, or lease.\nThis funding will be channelled toward building more diagnostic centres in Nigeria.\nFor the big picture, the startup is looking to be one of Nigeria’s three largest diagnostic centres."
  },
  {
    "headline": "Nigeria ranks below Kenya, SA in thriving fintech space despite 3 unicorns",
    "summarized_story": "A new report has ranked Kenya and South Africa in the top fifty cities in the world with thriving fintech ecosystems, ahead of Nigeria which has the highest number of startups in the segment.\nNigeria does not only have the highest number of fintech startups, but it has also produced the first unicorn – Interswitch-…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Despite population 7 times Nigeria’s, China gives malaria final blow",
    "summarized_story": "After seven decades of wrestling with malaria, China on Wednesday dealt the final blow to the deadly disease, demonstrating that commitment to medical research and funding can halt a country’s malaria scourge despite huge population size.\nNigeria accounts for 27 percent of the global malaria cases and 23 percent of global malaria deaths based on the 2020 World Malaria Report by WHO.\nBy the end of 1990, the number of malaria cases in China had plummeted to 117 000, and deaths were reduced by 95 percent.\nIn 2020, after reporting 4 consecutive years of zero indigenous cases, China applied for an official WHO certification of malaria elimination.\nNigeria’s government aims to reduce malaria prevalence to a parasite prevalence of fewer than 10 people and mortality attributable to malaria to less than 50 deaths per 1,000 live births by 2025 as reflected in the new malaria strategic plan 2021 to 2025."
  },
  {
    "headline": "Power potential: Investors tap into DisCos’ underserved franchise areas",
    "summarized_story": "Investors are seeing a path to profitability investing to help troubled power distribution companies improve their network infrastructure across poorly served communities in their franchise areas.\nWhile some have applied for their own independent licences to carve out spaces in areas already allocated to a DisCos, which is poorly served – often resulting in litigation…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Gov. Obaseki to hold solemn birthday July 1, asks friends, others to donate to charities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr Godwin Obaseki has said that he would be having a solemn birthday on July 1, 2021.\nIn a statement, the Chief of Staff to the governor, Hon.\nHe listed the charity bodies as Project Charilove located opposite Central Hospital, Sapele Road, Benin City and Isaac and Oscar Aluyi Foundation for Children with disabilities at No.\n12Aibieyi-Akenzua Street, Off Uwagboe Avenue, Ugbowo, Benin City.\nHe said that, “The governor appreciates the support and solidarity and thanks his friends, associates and well wishers in advance for respecting his wishes, as they channel their energies and resources towards the vulnerable in the society.”..."
  },
  {
    "headline": "RSG to depose chiefs, others who harass contractors – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPort Harcourt – Governor of Rivers State, Nyesom Ezenwo Wike has threatened to depose any monarch and Community Development Committee leaders that attempt to extort money from companies handling government infrastructural projects.\nHe issued the stern warning on Wednesday at the flag-off of the construction of the Rumuepirikom Flyover in Obio/Akpor Local Government Area of the State.\nIf you’re going to airport you’ll follow here; whether it is Ignatius Ajuru University or the Rivers State University you must pass here.\nBefore we used to have the Ikwerre Road and Aba Road, now we have this Ada George Road which takes you into the city.\n“This is a landmark project, it is the 9th Flyover project conceived by the governor."
  },
  {
    "headline": "Obaseki’s reforms: Energy Park in Edo with modular refinery, gas, power plants, others to begin operations in October – Nigerian Observer",
    "summarized_story": "The Energy Park is the second industrial refinery facility in the state, different from the Edo Modular Refinery, which has been completed and set to receive feedstock from Escravos line in August.\nThe Park, which is the first of its kind in West Africa, is the only park with a refinery operation, gas processing plant and power plant sharing the same resources.\nPowered by Platform Capital, the energy park has a 10,000 barrel-per-day refining capacity, a 50 megawatts plant capacity and a 60 million scf gas processing plant.\nThe Nigerian Content Development Board (NCDMB) invested $15 million to acquire an equity stake in Duport Mid-stream for the development of the park.\nDuport Midstream is among the indigenous oil companies that were recently awarded one of the 57 marginal oil fields in the country."
  },
  {
    "headline": "Edo to recruit forest guards, as Obaseki seeks private sector collaboration on forest regeneration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government is hiring forest guards that will be trained and armed to protect the state’s endangered forest reserves for future generations.\nThe governor disclosed this during a courtesy visit by members of Nigeria REDD+ at the Government House, in Benin City.\n“We inherited over 650,000 hectares of forest reserves, but today, we can’t account for more than 135,000 hectares.\n“We are hiring a new generation of forest guards, arming and training them to protect our forests.\nWe believe that the government alone cannot do it, so we are inviting the private sector."
  },
  {
    "headline": "COVID-19: Nigeria has no access to vaccines, to begin manufacturing – Official",
    "summarized_story": "The Minister of State for Health, Olorunnimbe Mamora, has said on Thursday that Nigeria and many African countries have no access to COVID-19 vaccines, despite their availability in developed countries.\nHe said Bio-Vaccine Nigeria Limited, a joint-venture between the Nigerian government and a private firm, is working on manufacturing vaccines for the country.\n“As many are aware, the world is facing inequitable distribution of COVID-19 vaccines, with Africa bearing the brunt of it.\n“In Nigeria, we have taken this opportunity to fully establish our capacity for vaccine manufacturing.\nThe conference also had in attendance representatives from the Federal Ministry of Health, health experts and scientists and other policymakers."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Groups Launch First Space Research For Students",
    "summarized_story": "A civil society organisation (CSO), YouthHubAfrica, in collaboration with American Space Agency, Magnitude.io, has launched a novel event-based space research for students, known as the Exo Lab Mission, the first of its kind.\nThe Exo Lab Mission has positioned Nigerian students alongside others globally at theforefront of scientific research, crop planting and monitoring from the international space station.\nThe exercise brought together students from across the globe in a virtual set-up to investigate effects of microgravity on living things.\nYouthHubAfrica provided Exo Lab kits to 15 students and two teachers of Government Secondary School (GSS), Garki, Abuja, Nigeria.\nThrough YouthHubAfrica’s collaboration with Magnitude.io, students of GSS Garki, Abuja, have honed their skills in conducting experiments, scientific research, inquiry, data collection and analysis, nutrition, food sustainability, and more."
  },
  {
    "headline": "Groups Launch First Space Research For Students",
    "summarized_story": "A civil society organisation (CSO), YouthHubAfrica, in collaboration with American Space Agency, Magnitude.io, has launched a novel event-based space research for students, known as the Exo Lab Mission, the first of its kind.\nThe Exo Lab Mission has positioned Nigerian students alongside others globally at theforefront of scientific research, crop planting and monitoring from the international space station.\nThe exercise brought together students from across the globe in a virtual set-up to investigate effects of microgravity on living things.\nYouthHubAfrica provided Exo Lab kits to 15 students and two teachers of Government Secondary School (GSS), Garki, Abuja, Nigeria.\nThrough YouthHubAfrica’s collaboration with Magnitude.io, students of GSS Garki, Abuja, have honed their skills in conducting experiments, scientific research, inquiry, data collection and analysis, nutrition, food sustainability, and more."
  },
  {
    "headline": "Declare State of Emergency In Kaduna, SOKAPU Urges Federal Govt",
    "summarized_story": "The Southern Kaduna People’s Union (SOKAPU), has called on the Federal Government to declare a state of emergency in Kaduna State over the happenings in the sate.\nIt stated that, “On Monday, 28th June, 2021, students of Kaduna State College of Education (COE), Gidan Waya staged a procession against a shocking hike in the tuition fees of all government owned tertiary institutions in Kaduna state, including the COE, Gidan Waya.\nSuch is the extent that Kaduna State government can go to gag its citizens against a suppressive and exploitative policy.\n“Therefore, Governor Nasir el-Rufai must take responsibility for the cold-blooded murder of these students.\nEl-Rufai and his government must also be held accountable for all the destructive and backward developments that have taken place in Kaduna state owned high institutions since he raised students’ tuition fees.”"
  },
  {
    "headline": "Declare State of Emergency In Kaduna, SOKAPU Urges Federal Govt",
    "summarized_story": "The Southern Kaduna People’s Union (SOKAPU), has called on the Federal Government to declare a state of emergency in Kaduna State over the happenings in the sate.\nIt stated that, “On Monday, 28th June, 2021, students of Kaduna State College of Education (COE), Gidan Waya staged a procession against a shocking hike in the tuition fees of all government owned tertiary institutions in Kaduna state, including the COE, Gidan Waya.\nSuch is the extent that Kaduna State government can go to gag its citizens against a suppressive and exploitative policy.\n“Therefore, Governor Nasir el-Rufai must take responsibility for the cold-blooded murder of these students.\nEl-Rufai and his government must also be held accountable for all the destructive and backward developments that have taken place in Kaduna state owned high institutions since he raised students’ tuition fees.”"
  },
  {
    "headline": "Reps Move To Increase Service Years Of Parliamentary Workers To 65",
    "summarized_story": "The House of Representatives has again introduced a Bill seeking to alter the condition of service of parliamentary workers throughout the federation by increasing the retirement year from the age of 60 years to 65 years or from 35 years to 40 years in service, whichever comes first.\nIn the year 2020, controversy ensued over the condition of service for parliamentary staff when the former clerk to the National Assembly, Sani Omolori relied on a resolution of the 8th Assembly on the retirement age of the National Assembly staff and attempted to remain in office.\nThe National Assembly Service Commission (NASC), however, opposed the move, noting that the National Assembly Service Act, 2014(as amended), provides the retirement age of the staff of the National Assembly Service as 35 years of service or 60 years of age, whichever comes first.\nBut the new piece of legislation before the House at Wednesday’s plenary seeks to amend the existing Act and give legal backing to a new condition of service.\nHe insisted that the Bill would help build institutional memory and develop a career progression plan within the bureaucracy of the National Assembly."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Igboho’s residence allegedly attacked few days to Lagos Yoruba Nation rally",
    "summarized_story": "The Soka Ibadan residence of Yoruba Nation Agitator, Chief Sunday Adeyemo aka Sunday Igboho was raided in the early hours of Thursday by yet-to-be-identified gunmen.\nThe media page of Igboho’s spokesperson, Mr Olayomi Koiki, in a live feed monitored by The Nation, alleged some men adorning military uniforms carried out the attackIt was observed Igboho’s vehicles, including his G-wagon, Prado Jeep, some valuable properties including furniture, and windows were destroyed.\nBullet holes were found in cars parked in the premises while blood stains were seen at the premises.\nIt was also alleged that some persons in the house including a close ally of Igboho identified as ‘Lady K’, were whisked away.\nIt was learnt Igboho was not at home during the attack while some alleged he ‘mysteriously’ disappeared."
  },
  {
    "headline": "Igboho’s residence allegedly attacked few days to Lagos Yoruba Nation rally",
    "summarized_story": "The Soka Ibadan residence of Yoruba Nation Agitator, Chief Sunday Adeyemo aka Sunday Igboho was raided in the early hours of Thursday by yet-to-be-identified gunmen.\nThe media page of Igboho’s spokesperson, Mr Olayomi Koiki, in a live feed monitored by The Nation, alleged some men adorning military uniforms carried out the attackIt was observed Igboho’s vehicles, including his G-wagon, Prado Jeep, some valuable properties including furniture, and windows were destroyed.\nBullet holes were found in cars parked in the premises while blood stains were seen at the premises.\nIt was also alleged that some persons in the house including a close ally of Igboho identified as ‘Lady K’, were whisked away.\nIt was learnt Igboho was not at home during the attack while some alleged he ‘mysteriously’ disappeared."
  },
  {
    "headline": "Gunmen kill three, kidnap bizman in Katsina",
    "summarized_story": "GUNMEN suspected to be bandits have reportedly killed three young men in Danmusa Local Government Area of Katsina State.\nResidents said the gunmen shot at a Golf 3 commercial car travelling from Yantumaki to Danmusa on Sunday night, killing two men identified as Sulaiman and Nura Dogon Gida, in the process.\nA member of a vigilante group in Yantumaki, who also confirmed the incident, said it happened shortly after the vehicle left for Danmusa.\nThe vigilante member said the vehicle left Yantumaki few minutes after 7 pm.\nThe gunmen were also said to have kidnapped a businessman identified as Audu Buzu."
  },
  {
    "headline": "Gunmen kill three, kidnap bizman in Katsina",
    "summarized_story": "GUNMEN suspected to be bandits have reportedly killed three young men in Danmusa Local Government Area of Katsina State.\nResidents said the gunmen shot at a Golf 3 commercial car travelling from Yantumaki to Danmusa on Sunday night, killing two men identified as Sulaiman and Nura Dogon Gida, in the process.\nA member of a vigilante group in Yantumaki, who also confirmed the incident, said it happened shortly after the vehicle left for Danmusa.\nThe vigilante member said the vehicle left Yantumaki few minutes after 7 pm.\nThe gunmen were also said to have kidnapped a businessman identified as Audu Buzu."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "Breaking: Gunmen kidnap Ekiti monarch David Oyewumi",
    "summarized_story": "By Ariwodola Idowu/Ado EkitiAn Ekiti monarch, Oba David Oyewumi, the Obadu of Ilemeso in Oye Local Government Area (LGA) of the state, has been kidnapped by gunmen, the police said.\n“Yes, the incident happened yesterday, (Thursday night) at the Oba’s palace.\nThey said the incident happened at about 8.30 p.m. on Thursday night when the chiefs who visited the place had left.\nIlemeso is a neighbouring town to Isan Ekiti, country home of Gov.\nOba Adetutu Ajayi, the Elewu of Ewu Ekiti, narrowly escaped kidnap at Isan Ekiti, last week on the Ewu-Ayetoro road."
  },
  {
    "headline": "How Sunday Igboho’s Residence Was Allegedly Attacked (Details)",
    "summarized_story": "The residence, which is located in the Soka area of Oluyole Local Government Area in Oyo State, was allegedly invaded around 2 a.m. on Thursday, according to NewsDirect.\nMany of Sunday Igboho’s close friends said that security agents broke into his home, a charge that some security agents who talked with DAILY POST disputed.\nMr. Oladiran Oladokun, convener of the Igangan Development Advocates, confirmed the attack to DAILY POST on Thursday.\nOn Thursday, Oladokun, who was one of the first callers at the Igboho residence, condemned the attack.\nIweha told the DAILY POST that he has yet to see proof that the invasion was carried out by security agents."
  },
  {
    "headline": "BREAKING: “Our rally will go ahead” – Yoruba Nation reacts to attack on Igboho",
    "summarized_story": "Despite the attack on Chief Sunday Adeyemo alias Sunday Igboho’s residence on Thursday morning, the Yoruba nation organization has said that their scheduled Mega event on July 3rd will go ahead as planned.\nIn response to the news, the group declared that their planned mega rally will go on as scheduled.\nThe gunmen were dressed in military clothing, and some of them spoke French, he said.\nThe intruders also kidnapped Mr. Igboho’s wife, according to him.\nThe Gunmen also abducted a large number of individuals, including Chief Ighoho’s wife.”"
  },
  {
    "headline": "BREAKING: Gunmen Abduct Igboho’s Wife, Others",
    "summarized_story": "Sunday Adeyemo aka Sunday Igboho, a Yoruba rights campaigner, has been kidnapped by gunmen who raided his home in the early hours of Thursday.\nMr. Maxwell Adeleye, his Communications Manager, signed a statement on his behalf and made it available to reporters.\n‘Yoruba Nation: Elements of the Nigerian Army, accompanied by International Terrorists hired by the Nigerian State, attacked Sunday Ighoho’s Residence – Akintoye,’ said the statement.\nAccording to the Communications Manager, Akintoye alleged that “the assailants were all dressed in military uniform and spoke French language fluently.\n“He further said that the gunmen killed seven occupants in the building and whisked Igboho’s wife and several others away.”The incident happened 72 hours to the Yoruba Nation rally slated for Saturday in Lagos which will be attended by Akintoye and Igboho."
  },
  {
    "headline": "BREAKING: Father Mbaka Breaks Silence On Nnamdi Kanu’s Arrest",
    "summarized_story": "Fr Ejike Mbaka, Spiritual Director of Adoration Ministries in Enugu, has reacted to the arrest of Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB).\nDuring a sermon, Mbaka expressed his outrage and prayed for the liberation of “his people” who were imprisoned.\nThe preacher also brought up the biblical story of Joseph, who was imprisoned but favored by the jail wardens.\nMbaka also warned Nigerian leaders to do the needful, else there would be a revolution that the leaders will not be able to withstand.\nThere is no reason why this kind of trouble will be in a country blessed by God in this nature."
  },
  {
    "headline": "Breaking: At last, FG reveals how IPOB leader, Nnamdi Kanu, was nabbed",
    "summarized_story": "The federal government has finally revealed how the leader of Indigenous People of Biafra (IPOB), Nnamdi Kanu, was trailed and arrested before he was repatriated to Nigeria on Sunday.\nMinister of Information and Culture, Lai Mohammed, who disclosed this while speaking to Journalists said Nigeria’s security intelligence trailed the leader of the proscribed Mr. Nnamdi Kanu, for two years.\n“We can tell you that the forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaborators,” he stated.\nLai also said the IPOB Leader had strong network, adding that the federal government was duty-bound to fish them out.\n“While the investigation continues, we assure you that none of the collaborators, irrespective of their standing in the society, will be spared."
  },
  {
    "headline": "Revealed! How gunmen killed 2 in attack on Sunday Igboho’s house – Aide",
    "summarized_story": "Two Yoruba sons have been killed in the house of Chief Sunday Igboho.\nWe do not know of the location where they were taken to,” the aide said in a Facebook Live.\nBlueprint gathered that the attack started at 1:50 am on thursday, July 1st 2021.\n“I can confirm that those who came are definitely Nigerian soldiers.\nSome of the occupants of the house were said to have been whisked away by the invaders who were claimed to have dresses in military camouflage."
  },
  {
    "headline": "Pictures: Moments after Sunday Igboho’s house suffered heavy attack",
    "summarized_story": "NextRevealed!\nHow gunmen killed 2 in attack on Sunday Igboho’s house – Aide"
  },
  {
    "headline": "Defection: Gov Matawalle has lost his memory – PDP Chairman -NigPilot",
    "summarized_story": "…Says PDP will bounce back in 2023National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Tuesday said Governor Bello Matawalle of Zamfara State must have lost his memory on how he came into office despite the fact that he lost the 2019 governorship election in the state.\nAddressing a press conference at the PDP national secretariat in Abuja, Prince Secondus said Governor Matawalle, who is on the verge of defecting to the ruling All Progressives Congress, APC, came into office on a statutory mandate given to the PDP by the Supreme Court.\nThe governors have one vote but we are after the people, the masses, the people who are suffering under this government.\n“It is a shame for all the governors that left the PDP for fear.\nThey were intimidated by the instrument of this government but am happy that the masses in their state especially in Zamfara none of them left.”"
  },
  {
    "headline": "Defection: Gov Matawalle has lost his memory – PDP Chairman -NigPilot",
    "summarized_story": "…Says PDP will bounce back in 2023National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Tuesday said Governor Bello Matawalle of Zamfara State must have lost his memory on how he came into office despite the fact that he lost the 2019 governorship election in the state.\nAddressing a press conference at the PDP national secretariat in Abuja, Prince Secondus said Governor Matawalle, who is on the verge of defecting to the ruling All Progressives Congress, APC, came into office on a statutory mandate given to the PDP by the Supreme Court.\nThe governors have one vote but we are after the people, the masses, the people who are suffering under this government.\n“It is a shame for all the governors that left the PDP for fear.\nThey were intimidated by the instrument of this government but am happy that the masses in their state especially in Zamfara none of them left.”"
  },
  {
    "headline": "Terrorism: NAF advocates for regional collaboration -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Air Force (NAF) on Tuesday said that there is a need for enhanced regional cooperation in the fight against insurgency and terrorism in the West African sub-region.\nIt added that the Armed Forces of Nigeria (AFN) and other armed forces in the region must synergize their efforts in view of the transnational nature of terrorism and its impact on the security of the entire region.\nHe applauded the Senegalese Armed Forces for always being on hand to collaborate with the Nigerian Air Force (NAF) whenever the need arises.\nThe Inspector-General of Senegalese Armed Forces (SAF), General El hadji Daouda Niang said he was in Nigeria to seek collaboration as well as strengthen cooperation between the SAF and the AFN.\nHe commended the NAF and other Services for their commitment to Nigeria’s internal security as well as the regional security of West Africa."
  },
  {
    "headline": "Terrorism: NAF advocates for regional collaboration -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Air Force (NAF) on Tuesday said that there is a need for enhanced regional cooperation in the fight against insurgency and terrorism in the West African sub-region.\nIt added that the Armed Forces of Nigeria (AFN) and other armed forces in the region must synergize their efforts in view of the transnational nature of terrorism and its impact on the security of the entire region.\nHe applauded the Senegalese Armed Forces for always being on hand to collaborate with the Nigerian Air Force (NAF) whenever the need arises.\nThe Inspector-General of Senegalese Armed Forces (SAF), General El hadji Daouda Niang said he was in Nigeria to seek collaboration as well as strengthen cooperation between the SAF and the AFN.\nHe commended the NAF and other Services for their commitment to Nigeria’s internal security as well as the regional security of West Africa."
  },
  {
    "headline": "2021 UTME: JAMB denies using wrong syllabus, links performance to ill-preparation -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB, has said that all the 2021 Unified Tertiary Matriculation Examination, UTME, were based on texts prescribed for the examination in its syllabus.\nJAMB was reacting to the candidates’ allegation that the mass failure in the 2021 UTME was as a result of the Board using the old syllabus in setting its questions.\n“The truth of the matter is that all Unified Tertiary Matriculation Examination (UTME) questions are based on texts prescribed for the UTME in its syllabus.\n“For instance, in the 2021 UTME, 1, 415,501 registered for both UTME/DE.\nOut of this figure, 1,340,003 candidates registered for UTME and 75, 498 registered for DE."
  },
  {
    "headline": "Senate Commences Consideration Of Petroleum Industry Bill After Committee Report",
    "summarized_story": "Emperor Simon, AbujaThe Petroleum Industry Bill moved one step closer to becoming law after Senators on Thursday began to consider its provisions after a committee report.\nSenator Sabo Mohammed (Jigawa South-West) who chairs the Joint Committee on Petroleum (Downstream); Petroleum (Upstream) and Gas Resources presented the report of the committee.\nThe committee had recommended that five percent of the actual annual operating expenditure of the proceeding financial year in the upstream petroleum operations should go to the Fund.\nThe Committee recommends 5% of the actual annual operating expenditure of the proceeding financial year in the upstream petroleum operations affecting the host communities for funding of the Host Communities Trust Fund.\nThe Committee recommends 96 amendments to Chapter Four of the Bill for better and attractive tax incentives to achieve the goal of attracting the over 100Bn Dollars capital investment inflow into Africa’s oil and gas industry."
  },
  {
    "headline": "Kaduna Court To Resume Trial Of ElZakzaky, Wife",
    "summarized_story": "Chimezie Enyiocha, KadunaA Kaduna state high court is expected to on Thursday resume the trial of the embattled leader of the Islamic Movement in Nigeria, Sheikh Ibrahim Elzakzaky and his wife Zeenat.\nElzakzaky and his wife are standing trial on an eight-count charge bordering on alleged culpable homicide, unlawful assembly and disruption of the public peace, among others.\nAmong the witnesses who testified against the IMN leader were two Army officers, a retired director of State Security Service(SSS), police officers and a medical doctor.\nHowever, the prosecuting counsel prayed the court to overrule the no-case submission by the defence counsel and to go on and convict the defendants as provided in the law.\nDuring today’s sitting, the defence counsel is expected to open his defence and also present his own witnesses before the court."
  },
  {
    "headline": "PDP Leaders Storm NASS To Protest Onochie’s Nomination As INEC Commissioner",
    "summarized_story": "Leaders of the main opposition party, the People’s Democratic Party (PDP), on Wednesday stormed the National Assembly in protest.\nThe leaders are demanding the immediate reversal of President Muhammadu Buhari’s nomination of Lauretta Onochie as National Commissioner of the Independent National Electoral Commission (INEC).\nLauretta Onochie is currently the media aide to President Buhari on Social Media.\nHe urged the National Assembly leadership to impress on President Muhammadu Buhari to immediately withdraw her nomination.\nWe are, therefore, writing to ask the Chairman to save the Senate President, the Senate itself and Mr. President from being ridiculed."
  },
  {
    "headline": "Zamfara Lawmaker Killed After Welcoming Matawalle To APC",
    "summarized_story": "Bandits have killed the member representing Shinkafi constituency in the Zamfara State House of Assembly Muhammad Ahmad.\nHe was on his way to Kano after attending a rally to welcome Governor Bello Matawalle of Zamfara State and members of the State House of Assembly to the ruling All Progressives Congress (APC).\nThe Director-General of Media and Publicity in the Zamfara State House of Assembly Mustapha Jafaru confirmed the incident to Channels Television.\nAhmad was buried on Wednesday morning at the Mussallah Eid Cemetery in Gusau, the Zamfara State capital.\nREAD ALSO: Bandits Kill 26 In Deadly Attack On Zamfara StateREAD ALSO: 12 Farmers, 10 Others Killed As Bandits Attack Zamfara CommunitiesBanditry Taking ‘Ugly Dimensions’Banditry and kidnappings have become commonplace in Zamfara State."
  },
  {
    "headline": "17 Injured In Explosion After Los Angeles Police’s ‘Catastrophic’ Detonation",
    "summarized_story": "At least 17 people were injured Wednesday night as a Los Angeles bomb squad botched the removal of improvised explosives seized along with thousands of pounds of illegal fireworks, officials said.\nThe blast blew the top off a bomb disposal truck and shot a fireball above the south Los Angeles neighborhood, according to video from local new channels.\nAt a press conference, Los Angeles Police Department Chief Michael Moore said that 10 responding officers and seven civilians had non-life-threatening injuries from the explosion, which damaged homes and blasted out windows in the neighborhood.\nThose devices were scanned and transferred to the specially-designed containment truck and detonated around 6:40 pm.\nThe drought-plagued city of Los Angeles has launched a fireworks buyback program ahead of the holiday, hoping to stop the illegal sale and use of the banned explosives."
  },
  {
    "headline": "Updated: Seven persons allegedly killed as gunmen attack Sunday Igboho’s residence",
    "summarized_story": "Cars and property worth millions of naira have been destroyed in an attack carried out on the Soka residence of Sunday Adeyemo also known as Sunday Igboho by unknown gunmen at about 1am.\nThe spokesperson to Sunday Igboho Olayomi Koiki, who revealed this in an online video alleged that men on military uniforms carried out the attack.\nA statement by the leader of an umbrella body under the aegis of Ilana Omo Oodua, Banji Akintoye also confirmed the incident.\nHe alleged that the gunmen killed seven people in the building and abducted Sunday Igboho’s wife and several others.\nThe Oyo state police command is yet issue a statement on the incident."
  },
  {
    "headline": "LASG, contractor commit to completion of Lagos-Badagry Expressway by December",
    "summarized_story": "The Lagos State Government and CCECC have expressed strong determination to complete the reconstruction and upgrading works on the Lagos-Badagry Expressway by December on separate platforms.\nMore than 26,000 vehicles ply the road every day, he claims, contributing to safety and security issues on the site.\nYaowu, on the other hand, stated that the project’s road component will be completed by the end of the year.\nAdvertisementOn the Bridge components, Yaowu said that construction works will be completed before the end of the year 2022.\nHe disclosed that the Lagos State Government is aware of the current situation and that both parties are maintaining cordial synergy and cooperation to ameliorate the hardship faced by motorists."
  },
  {
    "headline": "FG promises to come down hard on IPOB, Nnamdi Kanu's collaborators -",
    "summarized_story": "The Federal Government has assured that it will come down hard on all collaborators involved with the IPOB group and its Leader , Nnamdi Kanu , irrespective of their standing in the society.\nMinister of Information and Culture, Lai Mohammed disclosed this during a media conference in Abuja.\nHe says forensic investigation carried out so far has revealed a treasure trove of information on the proscribed IPOB leader and his collaboratorsThe Minister also confirmed that Nnamdi Kanu will face an 11-count charge of treason, treasonable felony, terrorism and illegal possession of firearms, among others.\nAdvertisementThe Minister also says the leader of the proscribed IPOB will get a fair hearing even after he denied many of the victims of violence which he willfully instigated through his broadcasts and tweets.\nMr Mohammed tried to clear the air over speculations leading to the rearrest of the IPOB Leaders,He revealed that it was made possible by the diligent efforts of security and intelligence agencies, in collaboration with countries with which they have obligations."
  },
  {
    "headline": "Burkina Faso’s President Sacks Two Ministers Over Deadly Jihadist Attacks",
    "summarized_story": "Burkina Faso’s President Roch Marc Christian Kaboré has sacked two of his Ministers after deadly jihadist attacks led to protest.\nMr Kaboré on Wednesday dismissed Defense Minister Cherif Sy and Security Minister Ousseni Compaore who was replaced by Maxime Koné.\nIn mid-June, the opposition called for the resignation of Prime Minister Christophe Dabiré and the Minister of Defense in light of the increasingly deadly jihadist violence.\nOn the night of June 4-5, gunmen – including “12- to 14-year-olds,” according to authorities – attacked the northeastern village of Solhan, killing at least 132 people.\nThe massacre, which caused a stir, is the deadliest attack in Burkina Faso since the start of jihadist violence six years ago."
  },
  {
    "headline": "Ugandans Begin Payment of New Internet Tax",
    "summarized_story": "Authorities in Uganda have ordered internet users in the country to from Thursday start paying a 12% excise duty on mobile data.\nThe levy replaces the infamous “social media tax” – an over-the-top (OTT) services daily tax introduced in 2018 on the use of social media.\nThe “social media tax” triggered protests in July 2018 that were led by opposition politician Robert Kyagulanyi, better known as Bobi Wine, which were violently dispersed by the security forces.\nMany Ugandans found ways to bypass it by using Virtual Private Networks (VPNs).\nTaxing of internet use continues to cause a public outcry in Uganda, especially among young people who are increasingly using the internet to start small businesses."
  },
  {
    "headline": "Rivers Governor Wike Speaks on Recent Defection of Three PDP Governors to the Governing APC",
    "summarized_story": "Rivers State Governor Nyesom Wike recently declared that the Peoples Democratic Party (PDP) governors and other political office holders, who are defecting to the All Progressives Congress (APC) lacked conscience and could not be trusted.\nHe accused the APC-led government of blackmailing and coercing some PDP governors and members to join its fold, stressing that no amount of blackmail or intimidation would make him leave the PDP.\nGovernor Wike was on ARISE NEWS’ Morning Show on Thursday to speak further on the issue and many more.\nWatch the interview…"
  },
  {
    "headline": "Oil Prices Up to $75 Ahead of OPEC+ Decision on Supply Cuts",
    "summarized_story": "Oil prices edged higher on Thursday, supported by lower U.S. inventories, as investors waited for a decision from key producers on whether they would maintain or reduce supply cuts in the second half of the year.\nBrent crude for September gained 15 cents, or 0.2%, to $74.77 a barrel by 0629 GMT while the U.S. West Texas Intermediate crude for August was at $73.69 a barrel, up 22 cents, or 0.3%.\nAnalysts had forecast a larger supply deficit globally in the second half of the year as the Organization of the Petroleum Exporting Countries and their allies, known as OPEC+, maintained production cuts while demand rises.\nIt reduced supply cuts between May and July by 2.1 million bpd and will meet on Thursday to decide whether to leave production unchanged or boost output, possibly by more than 1 million bpd or by a more modest 0.5 million bpd in August.\nThe group is expected to also discuss whether to extend the supply reduction deal to beyond next April."
  },
  {
    "headline": "Xi Jinping Warns Against Foreign Bullying as China Marks Party Centenary",
    "summarized_story": "“The people of China are not only good at destroying the old world, they have also created a new world,” said Xi, China’s most powerful leader since Mao Zedong, the founder of the People’s Republic.\nOn Thursday, Xi said that the people of China would never allow any foreign force to bully, oppress, or subjugate them.\nResolving the Taiwan question and realising China’s complete “reunification” is an “unswerving historical task” of the party, Xi said.\nHowever, a sweeping national security law imposed on Hong Kong a year ago has seen Beijing drastically tighten its grip on the once freewheeling financial hub.\nXi said the “interests and destiny of all people in China” were tied to the party leadership and any attempt to turn the people against the party was bound to fail."
  }
]