[
  {
    "headline": "NSCDC sensitises Yobe residents to security",
    "summarized_story": "The Nigeria Security and Civil Defence Corps on Tuesday started the sensitisation of Yobe residents to neighbourhood security, and how they could ensure a conducive environment for living.\nThe State Commandant, Useni Navokhi, said this in a statement signed by the command’s Public Relations Officer, Bala Garba, in commemoration of the World Civil Defence Day 2022.\nAccording to Navokhi, the command organised a series of activities to mark the day, including town hall meetings to sensitise stakeholders to security, environmental sanitation, among others.\nHe noted that one of the best ways to improve neighbourhood security was to get the entire community involved.\nNavokhi urged the residents to observe and report any suspicious behaviour or movement to security agencies and to inform others in the community about any criminal activity so all residents would be prepared to curtail such."
  },
  {
    "headline": "Senate approves report on NIPOST bill, confirms Bindawa NCC commissioner",
    "summarized_story": "The Senate, on Tuesday, approved the conference committee report on the Nigeria Postal Services Act (Repeal and Re-enactment) Bill, 2022.\nBindawa’s confirmation on Tuesday followed the consideration of a report by the Senate Committee on Communications.\n…Conference committee report on NIPOST Bill approvedThe conference committee report on the Nigeria Postal Services Act (Repeal and Re-enactment) Bill, 2022 was approved following the consideration of the conference committee report on the bill after it was laid by the Deputy Senate Leader, Robert Ajayi Boroffice (Ondo North).\nBoroffice, in his presentation, said the Conference Committee met and deliberated on the two versions of the bill as passed by the two Chambers.\nThe Senate, thereafter, approved the Conference Committee report on the NIPOST bill, 2022."
  },
  {
    "headline": "[VIDEO] Cerebral palsy: People asked my parents to use me for money ritual -Adejobi, student with best WASSCE result in Lagos school",
    "summarized_story": "Adebolu Adejobi, a teenager with cerebral palsy has emerged as the student with the best WASSCE result in his school.\nHe shares with us his challenges, triumphs and motivation.\nHis parents also revealed some of the challenges they faced raising him as well as how proud they feel at his achievement.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "2023 Presidency: Group opposes Orji Kalu’s aspiration",
    "summarized_story": "By Anayo OkoliA socio-cultural group, Igbo Conscience Movement, ICM, has expressed opposition to the presidential aspiration of Senator Orji Uzor Kalu, the Senate Chief Whip, saying that he is not a good presidential material to be presented by Ndigbo to Nigeria.\nThe group claimed that those who are throwing up Kalu and pushing him to contest are some selfish interest groups from outside Igbo Nation who know that Kalu does not have genuine interest of Ndigbo at heart.\nAccording to them, “Those who are urging the Senate Chief Whip to run for the Presidency are for their selfish interests and not for the good of Ndigbo or Nigeria as a whole”.\nThe group, therefore, urged individuals and groups rooting for Senator Orji Uzor Kalu to contest the 2023 presidential polls to have a rethink and stop deceiving him.\nThe group said they have nothing personal against Kalu but only trying to protect Ndigbo and by extension Nigerian interest."
  },
  {
    "headline": "APC National Convention: Governor Fayemi backs Senator Sani Musa",
    "summarized_story": "Says he has what it takes to move the party to the Next LevelAs Sani Musa unveils his aspiration’s plans and mission for the APC.\nBy Henry Umoru, ABUJAAHEAD of March 26 National Convention of the All Progressives Congress, APC, Chairman, Governor Kayode Fayemi of Ekiti has thrown his weight behind the Senate Services Committee, Senator Sani Musa, APC, Niger East on his aspiration for the position of National Chairman.\nGovernor Fayemi has promised to give his full support to Sani Musa’s ambition to become the National Chairman of the APC.\nSenator Musa, a frontline national chairmanship aspirant of the APC for next month’s National Convention of the party was in Ekiti State alongside members of his campaign team in furtherance of his consultation to party leaders and stakeholders within the party on his aspiration to become the next National Chairman of the ruling APC.\nSenator Sani Musa used the opportunity of their meeting to unveil his mission and blueprint for the Party as a necessary step in sustaining President Muhammadu Buhari’s legacy and ideology for the APC."
  },
  {
    "headline": "Abduction of Imo INEC staff: PDP scribe calls for arrest, prosecution of offenders",
    "summarized_story": "By Chinonso AlozieThe National Secretary of the Peoples Democratic Party, PDP, Samdaddy Anyanwu, Monday, called for arrest and prosecution of those behind the abduction of the ad-hoc staff of the Independent National Electoral Commission, INEC, in the just concluded Imo State by-election of Ngor Okpala state constituency last Saturday.\nAccording to him, the abduction of the ad-hoc staff of INEC showed the process was marred with irregularities.\nAnyanwu said: “We want to condemn in strong terms the abduction of the Adhoc staff of the Independent National Electoral Commission (INEC) in Ngor Okpala State Constituency by-election.\nWe described as despicable and fraudulent, the hijacking of INEC sensitive materials by political thugs suspected to be loyal to the ruling All Progressives Congress (APC).\n“The stealing of the INEC materials came after the news had gone to the public that the PDP candidate was leading in virtually all the polling booths and electoral wards in Ngor Okpala LGA."
  },
  {
    "headline": "Tinubu, Aregbesola move to reconcile",
    "summarized_story": "Tinubu and Aregbesola at the reconciliation meeting.\nBy Nkiruka NnoromThere were strong indications last night that the feud between the National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, and Minister of Interior, Ogbeni Rauf Aregbesola, might be over earlier than it could be imagined.\n“I can say authoritatively that reconciliation efforts to close the rank between Asiwaju Bola Ahmed Tinubu and Ogbeni Rauf Aregbesola are underway, and already beginning to yield positive results.\nThe source added that to underline how important the peace movement has become, the concerned stakeholders have given the reconciliation of Tinubu and Aregbesola top priority.\nIt is a top priority, and there is no doubt that the reconciliation will pacify the aggrieved parties,” the source added."
  },
  {
    "headline": "Buhari leaves Abuja to attend Special Session on UNEP@50 in Kenya, proceeds to UK on 2-weeks medical checks",
    "summarized_story": "This is as the President is expected to proceed to London after the Kenyan trip for routine medical checks that will last for about two weeks.\nA statement issued by the Special Adviser to the President on Media and Publicity, Chief Femi Adesina on Tuesday in Abuja, stated that President Buhari was invited to attend the Special Session by the Kenyan counterpart, Uhuru Kenyatta.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\nAhmed Rufai Abubakar, and the Chief Executive Officer of Nigerians in Diaspora Commission, Abike Dabiri-Erewa.\n“From Kenya, President Buhari will proceed to London for routine medical checks that will last for a maximum of two weeks,” the statement said."
  },
  {
    "headline": "Senate confirms new non-executive commissioner for NCC",
    "summarized_story": "The Nigerian Senate on Tuesday confirmed the nomination of Professor Mansur Auwalu Bindawa as non-executive Commissioner for the Nigerian Communications Commission (NCC).\nThe confirmation followed the satisfactory report of screening earlier conducted by the Senate Committee on Communications chaired by Senator Oluremi Tinubu.\nHe added that there was no petition or objection to his appointment to serve on the board since President Muhammadu Buhari forwarded his name to the parliament.\nHe said: “That the Senate do receive and consider the report of the Committee on the confirmation of the nomination of Prof. Mansur Auwalu Bindawa for appointment as new Non-executive Commissioner of the Nigeria Communications Commission (NCC).”Senator Ahmad Ibrahim Lawan, having considered the submission, called for a voice vote and he was confirmed.\nIn his remark, Lawan said his confirmation would strengthen the activities of the NCC."
  },
  {
    "headline": "Senate approves conference committee report on NIPOST Bill",
    "summarized_story": "The Senate, on Tuesday, approved the conference committee report on the Nigeria Postal Services Act (Repeal and Re-enactment) Bill, 2022.\nThe approval followed the consideration of the conference committee report on the bill after it was laid by the Deputy Senate Leader, Robert Ajayi Boroffice (Ondo North).\nBoroffice, in his presentation, said the Conference Committee met and deliberated on the two versions of the bill as passed by the two Chambers.\nHe explained that after extensive deliberations, the Conference Committee resolved and adopted the Senate Version in Clauses 3(3): 28(5): 35(1); and 36(1) while Clauses 8(1); 9(n); 10(1); 33(t); 68(2)(b); 72(1) and 75 of the House of Representatives’ version of the Bill were adopted.\nThe Senate, thereafter, approved the Conference Committee Report on the NIPOST bill, 2022."
  },
  {
    "headline": "ASUU strike: Very shameless – Aisha Yesufu reacts as Minister gives reason for walking out on students",
    "summarized_story": "Nigerian activist, Aisha Yesufu has berated the Minister of Education, Mallam Adamu Adamu, for walking out on students during a meeting on Tuesday.\nDAILY POST reports that the minister had an impromptu meeting with some members of the National Association of Nigerian Students, NANS, on Tuesday following the lingering strike embarked upon by the Academic Staff Union of Universities, ASUU.\nThe meeting was a sequel to massive protests staged by the students across the country on Tuesday demanding an end to the incessant strikes.\nAccording to reports, the minister, however, walked out on the students as the meeting ended in deadlock.\nAdamu explained that he stepped out of the meeting because the students laid accusations on him."
  },
  {
    "headline": "2,757,833 births recorded in Katsina from 2017 to 2021 – NPC",
    "summarized_story": "Katsina State recorded 2,757,833 births between 2017 and 2021, the National Population Commission has said.\nIsiaka Yahaya, the acting Director, Public Affairs of NPC, in a statement, explained that the data was recorded from the RapidSMS, a tracking tool that collects and collates real time information on birth registration in Nigeria.\nAccording to the statement, Katsina recorded 542,368 births in 2017, 489,488 in 2018, 474,068 in 2019, 499,843 in 2020 and 752,066 in 2021.\nYahaya explained that the figures were higher than the one from the National Bureau of Statistics (NBS).\nHe said that the boost in birth registration, according to the federal commissioner representing Katsina State, Engineer Bala Banye, was following the tremendous support of the Katsina State Government in collaboration with development partners and the traditional institution."
  },
  {
    "headline": "Russia invasion: Viktor Orban states decision on weapons passing through Hungary to Ukraine",
    "summarized_story": "Hungarian Prime Minister, Viktor Orban, has said that western weapon deliveries to Ukraine would not be allowed to transit across Hungary.\n“We have decided that we won’t allow any such deliveries,” Orban said in a statement distributed by the Hungarian news agency MTI on Monday night.\nHungary, both a member of the European Union and NATO, has a 140-kilometre-long border with Ukraine, which has been under attack by Russian forces since last week.\nOrban is usually fairly close to Russian President, Vladimir Putin, but has blocked neither EU sanctions against Russia following the invasion nor decisions to send weapons to Ukraine.\n“It is in the interests of the Hungarian people that Hungary stay out of this war,” said Orban, in more comments from Monday."
  },
  {
    "headline": "Court declares Arabic teacher not guilty of defiling four-year-old",
    "summarized_story": "Sulaimon, of Abesan Estate, Ipaja, Lagos was accused of defiling and sexually assaulting a then four-year-old child at Mahadu Ridwanullah Arabic and Islamic School, Opeki in Abesan Estate.\nHis counsel, Mr. Ahmed Adetola-Kazeem, filed a no-case submission, which the court upheld.\nThe court noted that the witness said one Kehinde Adedeji, who is an uncle to the child, confessed to the crime of defiling the four-year-old.\nI uphold the no-case submission in relation to this count and, therefore, accordingly discharge and acquit the defendant on this count.\nBut the case was transferred to another court when Justice Nwaka was elevated to the Court of Appeal."
  },
  {
    "headline": "Adeboye’s global contributions testimonies of divine calling – Buhari",
    "summarized_story": "President Muhammadu Buhari has noted the contributions of the General-Overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, to Nigeria and the rest of the world stand out as testimonies of his divine calling.\nThe President, who was celebrating the clergy on his 80th birthday anniversary, pointed out that Pastor Adeboye had contributed to the development of the world in the areas of education, health and infrastructural development.\nIn a statement by his Special Adviser on Media and Publicity, Mr Femi Adesina, Buhari joined the Adeboye family, the RCCG folds worldwide, friends and associates of the preacher to celebrate the renowned academic-turned-cleric.\n“President Muhammadu Buhari joins members of Redeemed Christian Church of God (RCCG), the Christian community, particularly clergymen in Nigeria and abroad, in celebrating with Pastor Enoch Adejare Adeboye on the auspicious occasion of his 80th birthday, March 2, 2022.\n“On the cleric’s 80th birthday, President Buhari believes his contributions to the betterment of Nigeria and other countries stand out clearly as testimonies of his divine calling, impacting greatly on education, health and infrastructural development, which include many urban and rural roads."
  },
  {
    "headline": "Electoral bill: Buhari asks NASS to delete section barring political appointees",
    "summarized_story": "President Muhammadu Buhari has urged the National Assembly to urgently delete section 84(12) of the newly assented Electoral Act.\nBuhari, in a letter read by Senate President Ahmad Lawan at plenary, described the section as undemocratic.\nSection 84(12) of the Electoral Act bars serving political appointees from voting or being voted for during party primaries without first resigning their current positions.\nDetails Shortly…"
  },
  {
    "headline": "Evacuation of Nigerians from Ukraine begins tomorrow",
    "summarized_story": "Evacuation of Nigerians from Ukraine by the Federal Government will start tomorrow, Foreign Affairs Minister Geoffrey Onyeama told the House of Representatives leadership yesterday.\nA statement on Sunday by Special Assistant to Presidential Muhammadu Buhari on Media and Publicity Malam Garba Shehu, put the number of Nigerians stranded in Ukraine at more than 4,000.\nOnyeama confirmed that 204 Nigerians resident in Ukraine have been received and provided accommodations by officials of Nigerian Embassy in Romania and others.\nOnyeama was invited by the Speaker to discuss the plight of Nigerians caught in the conflict between Russia and Ukraine.\nThe protesters, which include parents, concerned Nigerians, lamented the horrific reports they were receiving about their loved ones/wards fleeing Ukraine."
  },
  {
    "headline": "BREAKING: Buhari off to London for check-up",
    "summarized_story": "A statement by his Special Adviser on Media and Publicity, Mr Femi Adesina, on Tuesday morning, explained Buhari will proceed to London for routine medical checks that will last for a maximum of two weeks.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\nBut each nation has a crucial role to play in protecting our people and planet”, it said.\nBuhari is expected to deliver the National Statement of the country and participate in High Level Dialogue Sessions on the Environment at the event.\nAhmed Rufai Abubakar, and Chief Executive Officer of Nigerians in Diaspora Commission, Abike Dabiri-Erewa."
  },
  {
    "headline": "FG begins evacuation of Nigerians in Ukraine",
    "summarized_story": "In Warsaw, Poland, 52 Nigerians and 23 others were being processed at the Polish government’s reception point at Hala Kijowska.\nIn a related development, the Nigerian Embassy in Kiev, Ukraine, has begun issuance of Emergency Travelling Certificates to Nigerians fleeing Ukraine.\nOne of the certificates showed that Mr. Azubuike Favour Ikechukwu, with lost Nigerian Passport A11691624, received an Emergency Travelling Certificate from the Nigerian Embassy in Kiev, Ukraine.\nAnother Emergency Travelling Certificate sighted by Daily Sun had the name of Mr Uwadi George Emeka, with Passport Number A10979898.\nThe Nigerian Embassy, Kiev, Ukraine also confirmed that Uwadi is a citizen of Nigeria travelling from Ukraine to Nigeria."
  },
  {
    "headline": "Chieftaincy titles won’t be for sale during my reign –New Olubadan",
    "summarized_story": "From Oluseye Ojo, IbadanOlubadan–designate, Lekan Balogun, who would be officially installed as the 42nd Olubadan of Ibadanland on Friday March 12, by Governor Seyi Makinde of Oyo State, has said Ibadan chieftaincy titles would not be for sale during his reign.\nHe gave the assurance during a meeting held by the Olubadan-in-Council at his Alarere residence in Ibadan, yesterday, which he presided over.\nThe decision was in tandem with the policy of the new Olubadan that Ibadan chieftaincy titles would not be for sale during his reign.\nSo, the expectant Baale, Mogaji or Jagun would be screened by the members of the Olubadan-in-Council before appointment,” Ajibola said.\nAjibola said the meeting, held at the instance of the new Olubadan, expanded the coronation committee with the nomination of Osi Balogun, Lateef Adebimpe; Ekerin Balogun, Olubunmi Isioye; Ekerin Olubadan, Abiodun Kola-Daisi; and Ekarun Olubadan, Hamidu Ajibade."
  },
  {
    "headline": "Court upholds Umahi’s defection to APC",
    "summarized_story": "A High Court in Abakaliki, yesterday, dismissed a suit challenging the defection of Governor David Umahi of Ebonyi and his deputy, Kelechi Igwe from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nMr Sunny Ogbuoji had sought an order to reinstate him as governor, instead of Umahi, who just defected to the party.\nOgbuoji, by originating summons, prayed the Court to hold that Umahi having defected to the APC from the PDP through which he was elected ought to vacate the office of the Governor upon defection.\nUmahi has not offended any provisions of the Constitution or the Electoral Act in his defection to APC.\n“We approached court to investigate the provision of the law visa-vis the defection of the Governor to APC,” Okorie said."
  },
  {
    "headline": "‘2 governors may dump PDP for APC soon’",
    "summarized_story": "From Romanus Ugwu, AbujaAll Progressives Congress (APC) has claimed that no fewer than two governors on the platform of the Peoples Democratic Party (PDP) would join the ruling party before or after the March 26 APC national convention or before the general election.\nHe argued that APC supporters, and Nigerians by extension, did not need to worry about the continued postponement of the party’s convention, stressing that good news of PDP governors joining the party has always greeted each postponement of the convention.\n“Nigerians don’t need to be worried about postponement of the national convention of our party.\nAlthough, there is no plan to postpone the March 26 date, I can tell you two governors are about to join the APC.\nLet me emphasis that two serving PDP governors will join the APC before or after our convention or latest before the general election.”He assured that the party would soon sort out the issue of zoning as the Progressive Governors’ Forum meets."
  },
  {
    "headline": "Nigeria records 35 new COVID-19 infections",
    "summarized_story": "Nigeria recorded 35 COVID-19 infections in seven states and the FCT on Monday, the Nigeria Centre for Disease Control (NCDC) declared on Tuesday.\nFourteen of the new infections were recorded in Rivers; six were recorded in Imo; Lagos State recorded four cases, while the FCT recorded three cases.\nKwara recorded three cases; Bayelsa and Plateau had two cases each, while Akwa Ibom had a singular infection.\nThe NCDC stated that the new infections raised the county’s tally to 254,560, but that 249,079 of the victims had been treated and discharged.\nNo COVID-19 death was recorded on Monday as the death toll in Nigeria stood at 3,142, it added."
  },
  {
    "headline": "Breaking: Lawmakers Kick as Osinbajo’s Wife, Dolapo, Visits House to Observe Voting on Constitution Amendment",
    "summarized_story": "Udora OrizuSome members of the House of Representatives on Tuesday, kicked against move to usher in the Wife of the Vice President, Dolapo Osinbajo, to witness voting on the clauses up for consideration in the Constitution Amendment Bills.\nThe Speaker, Hon.\nFemi Gbajabiamila, who presided over the session had called on the House Leader, Hon.\nAdo Doguwa, to suspend relevant rules of the House and move that the VP’s wife should be ushered in to witness the proceedings.\nThis generated screams of Nays from lawmakers across party lines."
  },
  {
    "headline": "Breaking: Buhari Seeks Amendment to New Electoral Act",
    "summarized_story": "Sunday AborisadePresident Muhammadu Buhari has formally asked the Senate to amend the newly signed Electoral Act 2022.\nBuhari, in a letter to the President of the Senate, Ahmad Lawan, specifically asked the federal parliament to consider deleting Section 84 (12) which has to do with the resignation of political appointees before party primariesDetails later…..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Buhari Departs for Two Weeks Medical Check up in London",
    "summarized_story": "Deji ElumoyePresident Muhammadu Buhari is expected to depart Abuja on Tuesday for a three-day official visit to Nairobi, Kenya from where he will proceed to London, the United Kingdom for routine medical checks that may last two weeks.\nThe Special Adviser to the President on Media and Publicity, Femi Adesina, in a release disclosed that President Buhari’s medical check up in UK will last maximum of two weeks.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\n“UNEP@50 is a time to reflect on the past and envision the future.\nIt provides an opportunity to reinvigorate international cooperation and spur collective action to address the triple planetary crisis of climate change, nature and biodiversity loss, and pollution and waste."
  },
  {
    "headline": "Resilient Zenith Bank Beats Market Expectations with Double-digit Growth in Gross Earnings in 2021",
    "summarized_story": "Also, Zenith Bank’s profit before tax (PBT) grew by 10 per cent from N255.9 billion to N280.4 billion in the current year under review.\nThis further led to a seven per cent increase in net interest income of N320.8 billion in 2021, from N299.7 billion in 2020.\nIts customer deposits increased by 21 per cent, growing from N5.34 trillion in the previous year to N6.47 trillion in 2021.\nFor instance, while retail deposits grew by N146 billion from N1.72 trillion in 2020 to N1.87 trillion in 2021.\nIn recognition of its track record of excellent performance, Zenith Bank was voted as Best Commercial Bank in Nigeria in the World Finance Banking Awards 2021, Best Bank in Nigeria in the Global Finance World’s Best Banks Awards 2020 and 2021, Bank of the Year (Nigeria) in The Banker’s Bank of the Year Awards 2020, and Best in Corporate Governance ‘Financial Services’ Africa 2020 and 2021 by the Ethical Boardroom."
  },
  {
    "headline": "US Cuts Off Russia’s Central Bank from Dollar Transactions",
    "summarized_story": "As part of the move to punish Russia for invading Ukraine, the United States yesterday said it was taking immediate steps to prohibit American dollar transactions with the Russian central bank and fully block the Russian direct investment fund.\nAccording to Bagui Sylla, the Ukrainian border guards said they were merely following instructions from their Polish counterparts – a claim denied by officials in Warsaw.\nThe minister said, “There are some Nigerians on a place called Summi, closer to the Russian border.\nThe European subsidiary of Russia’s biggest bank was on the brink of collapse as savers rushed to withdraw their deposits.\n“We will … ban the transactions of Russia’s central bank and freeze all its assets, to prevent it from financing Putin’s war,” European Commission President Ursula von der Leyen said in a statement."
  },
  {
    "headline": "Buhari’s Minister Tests Positive For COVID-19 As Virus Wave Spreads In President's Circle",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello, has tested positive for COVID-19.\nHe said; “I have tested positive for COVID-19.\nActivities at the Aso Rock Villa, Abuja have also been grounded following the outbreak of the virus at Nigeria’s seat of power.\nIn the past few days, Nigeria has been reporting a steady increase in COVID-19 infections, in what has been confirmed as the fourth wave of the pandemic by the Nigeria Centre for Disease Control (NCDC).\nHe said on his Facebook page, \"I thank Almighty Allah for my speedy recovery from COVID-19."
  },
  {
    "headline": "Buhari’s Minister Tests Positive For COVID-19 As Virus Wave Spreads In President's Circle",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello, has tested positive for COVID-19.\nHe said; “I have tested positive for COVID-19.\nActivities at the Aso Rock Villa, Abuja have also been grounded following the outbreak of the virus at Nigeria’s seat of power.\nIn the past few days, Nigeria has been reporting a steady increase in COVID-19 infections, in what has been confirmed as the fourth wave of the pandemic by the Nigeria Centre for Disease Control (NCDC).\nHe said on his Facebook page, \"I thank Almighty Allah for my speedy recovery from COVID-19."
  },
  {
    "headline": "Buhari’s Minister Tests Positive For COVID-19 As Virus Wave Spreads In President's Circle",
    "summarized_story": "Minister of the Federal Capital Territory FCT, Malam Muhammad Musa Bello, has tested positive for COVID-19.\nHe said; “I have tested positive for COVID-19.\nActivities at the Aso Rock Villa, Abuja have also been grounded following the outbreak of the virus at Nigeria’s seat of power.\nIn the past few days, Nigeria has been reporting a steady increase in COVID-19 infections, in what has been confirmed as the fourth wave of the pandemic by the Nigeria Centre for Disease Control (NCDC).\nHe said on his Facebook page, \"I thank Almighty Allah for my speedy recovery from COVID-19."
  },
  {
    "headline": "EXCLUSIVE: Aso Rock Deserted As Most Presidential Aides Contract COVID-19, Infections Traced To Buhari's Son, Yusuf's Coronation As Talban Daura",
    "summarized_story": "Many presidential aides, prominent politicians and other dignitaries also attended the event.\nGovernor Aminu Masari of Katsina State, his Kano State counterpart, Abdullahi Ganduje, Minister of Aviation, Hadi Sirika, were equally in attendance.\nSpeaking on the development, Adesina, in an interview with Channels Television, said presidential aides are also humans and not immune to happenings around them.\nIf anything happens to human beings, it can also happen to presidential aides,” he said.\n“The fact that we are presidential aides does not make us immune to certain things."
  },
  {
    "headline": "EXCLUSIVE: Aso Rock Deserted As Most Presidential Aides Contract COVID-19, Infections Traced To Buhari's Son, Yusuf's Coronation As Talban Daura",
    "summarized_story": "Many presidential aides, prominent politicians and other dignitaries also attended the event.\nGovernor Aminu Masari of Katsina State, his Kano State counterpart, Abdullahi Ganduje, Minister of Aviation, Hadi Sirika, were equally in attendance.\nSpeaking on the development, Adesina, in an interview with Channels Television, said presidential aides are also humans and not immune to happenings around them.\nIf anything happens to human beings, it can also happen to presidential aides,” he said.\n“The fact that we are presidential aides does not make us immune to certain things."
  },
  {
    "headline": "Senate, reps begin voting on constitution amendments",
    "summarized_story": "The senate and the house of representatives have begun the voting process on the fifth alteration of the 1999 constitution.\nSenate President Ahmad Lawan announced on Tuesday that senators will use electronic voting and not the voice-vote method they use for the confirmation of nominees and the passing of bills and motions.\nOvie Omo-Agege, deputy president of the senate and chairman of the review of the constitution, is currently presenting a report on the amendment bill before voting will commence.\nWe have tested the system and it is working,” the senate president said.\n“If a bill passes in the senate but fails to pass in the house, that bill is dead – and vice versa.”"
  },
  {
    "headline": "Senate, reps begin voting on constitution amendments",
    "summarized_story": "The senate and the house of representatives have begun the voting process on the fifth alteration of the 1999 constitution.\nSenate President Ahmad Lawan announced on Tuesday that senators will use electronic voting and not the voice-vote method they use for the confirmation of nominees and the passing of bills and motions.\nOvie Omo-Agege, deputy president of the senate and chairman of the review of the constitution, is currently presenting a report on the amendment bill before voting will commence.\nWe have tested the system and it is working,” the senate president said.\n“If a bill passes in the senate but fails to pass in the house, that bill is dead – and vice versa.”"
  },
  {
    "headline": "Buhari to visit London for two-week medical checkup -- after UNEP summit in Kenya",
    "summarized_story": "President Muhammadu Buhari will depart Abuja on Tuesday to participate in the commemoration of the 50th anniversary of the United Nations Environmental Programme ([email protected]).\nAccording to Femi Adesina, presidential spokesman, Buhari’s trip to Kenya is sequel to an invitation extended to him by Uhuru Kenyatta, his Kenyan counterpart.\nThe theme of the special session is ‘Strengthening UNEP For The Implementation Of The Environmental Dimension Of The 2030 Agenda For Sustainable Development’.\n“Member States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme, and championing solutions to our shared environmental challenges.\nAdesina also said from Kenya, the president will proceed to London for “routine medical checks that will last for a maximum of two weeks”."
  },
  {
    "headline": "Buhari to visit London for two-week medical checkup -- after UNEP summit in Kenya",
    "summarized_story": "President Muhammadu Buhari will depart Abuja on Tuesday to participate in the commemoration of the 50th anniversary of the United Nations Environmental Programme ([email protected]).\nAccording to Femi Adesina, presidential spokesman, Buhari’s trip to Kenya is sequel to an invitation extended to him by Uhuru Kenyatta, his Kenyan counterpart.\nThe theme of the special session is ‘Strengthening UNEP For The Implementation Of The Environmental Dimension Of The 2030 Agenda For Sustainable Development’.\n“Member States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme, and championing solutions to our shared environmental challenges.\nAdesina also said from Kenya, the president will proceed to London for “routine medical checks that will last for a maximum of two weeks”."
  },
  {
    "headline": "SANs kick against immunity for CJN as n'assembly votes on constitution amendments",
    "summarized_story": "The house of representatives special ad hoc committee on the review of the 1999 constitution had recommended immunity for presiding officers of the national assembly and judicial officers.\nHowever, some senior lawyers in separate interviews with the Punch on Monday described the attempt to confer immunity on more public officers as unnecessary.\n“The Legislative Privileges Act of 2017 actually tried to confer immunity on presiding officers of the national assembly which we found unconstitutional.\n“I believe that it is unnecessary conferment of protection on the national assembly.\nThe same thing goes for every member of the national assembly."
  },
  {
    "headline": "MTN buys 144 plots of digital land, becoming first African company to enter the Metaverse",
    "summarized_story": "Today, Africa’s largest telecom company, MTN bought 144 plots of digital land in the Africarare metaverse Ubuntuland for an undisclosed sum.\nMTN with this purchase laid claim to becoming the first African company to enter the metaverse, according to a press release on the company’s website.\nAfricarare is the first South African metaverse, housing digital land with roots in the African continent.\nAlongside MTN, South African advertising agency M&C Saatchi Abel also purchased its own plot of land in the newly created Ubuntuland.\nOutside Africa, companies like Samsung, Adida and PricewaterhouseCoopers have hopped on the trend too, buying plots of digital land."
  },
  {
    "headline": "Development finance institutions are looking to Africa’s digital frontier for impact and returns",
    "summarized_story": "Development finance institutions have long funded traditional finance and infrastructure projects in Africa; now they’re increasingly backing Africa’s digital future.\nIt can mean more opportunities unlocked as DFI money de-risks investment in high risk but critical business models.\nAfrica’s telecoms infrastructure, the backbone of its digital growth today, is an example of DFI money doing good while making returns.\nIn a perfect world, DFI and MFB activity in Africa’s fairly young venture space should be led (not nominally) by African development finance institutions.\nThat should help these institutions gain more financial clout and firepower to direct African technology to the areas of greatest need."
  },
  {
    "headline": "Payroll tech heats up in Africa, on the heels of a booming fintech sector",
    "summarized_story": "Amid the fintech boom, new frontiers are being explored by African entrepreneurs in the sector, one of which is payroll and corporate benefits management.\nThrough web portals or mobile self-service apps, companies can track time, process a locally compliant payroll, and pay their employees.\nZuberi is a Ghana-based earned wage access platform.\nIt’s easy to see why investors are backing payroll fintechs or broadly tech startups digitising the administrative stack for companies.\nAnd to increase chances of repayment, Bento Africa requires employees that apply for its loans to take unemployment and health insurance covers."
  },
  {
    "headline": "Road to 2023: Profiles of the Presidential aspirants",
    "summarized_story": "In this edition, we bring to you the profiles of major aspirants that have shown interest in the presidential race thus far.\nEventually, Bukola became the President of the Senate of Nigeria, and also chaired the 8th Nigeria National Assembly.\nHe hails from the southern region state, Delta State, Nigeria.\n1994 – He became a Professor of Law following which he was appointed Head of Department of Public Law, University of Lagos.\nBetween 2007 and 2013 – Osinbajo was once again employed as a Professor of Law, Department of Public Law, Faculty of Law, University of Lagos."
  },
  {
    "headline": "Governors resist Senate, FG power grab of electricity sector",
    "summarized_story": "In a rare move, Nigeria’s 36 state governors under the aegis of the Nigeria Governors’ Forum (NGF) have united to resist a plan by the Senate and Ministry of Power to stop states from activating innovative solutions to solving Nigeria’s power problems through a proposed electricity bill.\n“The proposed electricity bill makes Nigeria’s minister of power a defacto GMD, something similar to what we have with the NNPC and its subsidiaries,” Eyo Ekpo, former commissioner at the NERC, told BusinessDay.\nThis is because it is unconstitutional and maintains the policy of Federal Government overreach in the electricity sector that has not yielded development to the country.\n“The governors recommend the constitution of a Working Group, spearheaded by the State Governors under the auspices of the National Economic Council (NEC), to work with the NASS leadership on the way forward for the electricity sector.\n“From this should emerge a new National Electricity Policy and the foundations of a new Act of the National Assembly that, for the first time, will have the full buy-in of the States,” they concluded."
  },
  {
    "headline": "Petrol subsidy: Civil servants risk months of unpaid salaries",
    "summarized_story": "Nigerian government workers are likely to feel the pinch of declining federal allocations in the form of unpaid salaries as a growing petrol subsidy bill takes a toll on public finances.\nFederal allocations fell to a five-year low in January 2022 at N574.66 billion.\nThe NNPC is projected to struggle this year with the burden of an expensive petrol subsidy, which will gulp N3 trillion, 30 percent of the government’s projected revenues for the year.\nThe implication of shrinking allocations is that states have less cash to meet their obligations from payment of workers’ salaries to capital projects.\nStates that are most dependent on the federal handouts to cover their expenses will be the most impacted by the dwindling federal allocations."
  },
  {
    "headline": "COY Promises To Offer Free Internship To 600 Nigerian Students Yearly – Nigerian Observer",
    "summarized_story": "“We are proud to announce to give 100 students internship every year to experience this project.\nFor a start, we will offer internship program to 100 students from Obafemi Awolowo University and their emoluments will be based on minimum wage and will be housed in the staff quarters.\n“Afterwards, it will be extended to top six universities across the country, amounting to 600 students per annum,” Akindele said.\n“I am here as the Vice Chancellor to represent the management, staff and students to say thank you to the partners of this project.\n“We are looking forward to a time when our students will here to enjoy the good things happening to Nigerian students."
  },
  {
    "headline": "Uromi Robbery: Obaseki meets heads of security agencies, beefs up security in Edo – Nigerian Observer",
    "summarized_story": "We applaud this cooperation and urge the people of Edo State to remain calm as we have upgraded our security architecture.”Assuring the security of lives and property of Edo citizens, Obaseki added, “I want to let our people know that we have beefed up security in the state and urge everyone to go about their normal businesses in Edo State.\nHe noted, “This type of incident will not happen again in Edo State.\nThese will lead us to a level where all the perpetrators will be arrested and ensure it doesn’t happen again in Edo.\n“The Edo State Government is ready to support logistics if the need arises.\nVehicles have been recovered and investigation is ongoing; much will not be revealed for now.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NUPENG Has No Right To Give Us Ultimatum On Fuel Price – IPMAN Chairman – Nigerian Observer",
    "summarized_story": "NUPENG Has No Right To Give Us Ultimatum On Fuel Price – IPMAN ChairmanShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Chairman of the Independent Petroleum Marketers Association of Nigeria (IPMAN), Benin Depot, Comrade Douglas Iyike has said that the Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) has no right to give directive to IPMAN to reverse to N165 per litre of petrol.\nRecall that NUPENG in a recent media statement gave 24-hour ultimatum to IPMAN members to revert to the official pump price of petrol hence they will down tool.\n“We have read in newspapers with great disdain the purported 24-hours notice issued to marketers regarding the increment in the pump price of petrol.\n” There has been increment in the ex-depot price which has left marketers with no option than to increase the pump price of petrol above the official N165 per litre in recent weeks.\nThe Benin Depot IPMAN Chairman however, urged NUPENG to channel its energy to the activities of some of its members whom he alleged engaged in reckless driving, illegal charges and diversion of petroleum products, instead."
  },
  {
    "headline": "Obaseki trains 2,000 more teachers on digital pedagogy, advances on EdoBEST 2.0 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, as part of the process for the implementation and on-boarding of junior secondary schools into the Edo Basic Education Sector Transformation (EdoBEST) programme, has completed the training of more than 2,000 junior school teachers on digital pedagogy.\nThe Executive Chairman of Edo Universal Basic Education Board (Edo-SUBEB), Mrs. Ozavize Salami, disclosed this while addressing the teachers after the 10-day Information Communication Technology (ICT) training in Benin City, the Edo State capital.\nShe charged the teachers to be dedicated and committed to their duties, ensuring the implementation of all they have learned during the training programme.\nAccording to her, “This is the beginning of the implementation and on-boarding of junior secondary schools into the EdoBEST programme.\nSo, I urge you to go back to your schools and implement all the things that you learnt here."
  },
  {
    "headline": "Buhari to embark on trip to London for medical checks",
    "summarized_story": "According to the organisers of the event, “for 50 years, UNEP has coordinated a worldwide effort with Member States to address the world’s biggest environmental challenges.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme, and championing solutions to our shared environmental challenges.\n“[email protected] is a time to reflect on the past and envision the future.\nIt provides an opportunity to reinvigorate international cooperation and spur collective action to address the triple planetary crisis of climate change, nature and biodiversity loss, and pollution and waste.\nNo country or continent can solve these global crises alone."
  },
  {
    "headline": "Paris Club Refund: Linas International floors Governors’ Forum as court dismisses its application",
    "summarized_story": "In a suit with no FHC/ABJ/130/2013, the Governors’ Forum had sought the leave of the court of be joined in the suit, among other prayers.\nThe applicant (Governors’ Forum) had also sought the leave of the court to appeal against the judgment of Hon.\n), which asked the defendants to pay Linas International a judgment sum as consultancy fee for the job it carried for local government areas across the country over the Paris Club Refund.\n“Under the doctrine of stare decisis, this court is bound to follow the decision of the Supreme Court on this issue.\n“Accordingly, I hold that this court lacks the jurisdiction to grant the reliefs sought on the motion paper."
  },
  {
    "headline": "Long Russian military convoy heads for Kyiv amid fears of all-out assault",
    "summarized_story": "Russia soldiers appear to be advancing their invasion of Ukraine with satellite imagery indicating that a long convoy of Russian military vehicles is heading towards Ukraine’s capital Kyiv.\nIn some parts of the convoy, the vehicles appear to be traveling three or four abreast on the road.\nAgain, official sources have not confirmed whether these units — or Belarus more broadly — is preparing to join Russian forces in an assault on Ukraine.\nThe Pentagon has noted that the Kremlin still wants its troops to capture Kyiv, despite the stiff Ukrainian resistance.\nFor its part, Ukraine has vowed that it will not surrender to Russia and has demanded an immediate cease-fire and that Russian forces leave its territory."
  },
  {
    "headline": "INEC raises concerns as 602 of 1,750 new polling units in Katsina records no voter registration",
    "summarized_story": "Nigeria’s electoral body, the Independent National Electoral Commission (INEC) has expressed decried the low turnout of residents for registration in the newly-created 1,750 polling units across the 34 local government areas of Katsina.\n“Out of the 1,750 newly-created polling units, we have not recorded a single voter registration at about 602 polling units.\n“It is important to remind our stakeholders of the creation of additional polling units in Nigeria last year.\nKatsina State has 1,750 new polling units, bringing the total to 6,652,” he said.\n“While registration was suspended in 17 LGAs, it has been observed with concern, the low registration in the newly-created polling units."
  },
  {
    "headline": "Ganduje Gives Scholarship To Student With 303 Points In JAMB",
    "summarized_story": "Governor Abdullahi Umar Ganduje of Kano State has given the sum of N3 Million to Suyudi Sani, an indigene of Kano state, from Nassarawa local government, who scored an aggregate mark of 303 points in 2021 JAMB UTME and appeared second best in Northern Nigeria.\nGanduje, during the State Executive Council meeting held at Africa House Government House, Kano yesterday, announced the award when the brilliant student was presented to him.\nOurs is to always assist young people like you achieve their goals and make their dreams reality,” he said.\nAlleged N5bn Fraud: Ex-JAMB Registrar Opts For Plea BargainADVERTISEMENTTo show his appreciation and gratitude, governor Ganduje hinted that, “We are giving the sum of Three Million Naira (N3m) to Suyudi Sani.\nAnd the state government will sponsor your education up to PhD level.”Sani thanked the governor and state government for the gesture and assured that he would do his best not to disappoint the state and his family."
  },
  {
    "headline": "2023: Recycling Of Leaders Will Deter Nigeria’s Growth, Development – Dele Momodu",
    "summarized_story": "The publisher of Ovation magazine and presidential aspirant of the People’s Democratic Party (PDP), Otunba Dele Momodu has warned that growth, progress and development of Nigeria cannot be achieved by recycling the same set of people as leaders.\n“Rather, I will crave Baba’s indulgence to present three volumes of books that I had written which encapsulate my policies.”Momodu later presented the three volumes of books with the titles Pendulum 1, Pendulum 2 and Fighting Lions (The untold story of Dele Momodu’s presidential campaign) to the monarch.\nOba Balogun, who received the presidential aspirant and his entourage was joined by his Olori, Olufunmilayo and Ekarun Olubadan, High Chief Hamidu Ajibade, who responded on behalf of the monarch.\nADVERTISEMENTResponding, High Chief Ajibade said Momodu had used his profession through publication of Ovation Magazine to positively project and advance the cause of Nigeria and Nigerians and prayed that his efforts of the past years would go a very long way to assist his aspiration.\nHe enjoined the aspirant’s wife, Mobolaji who among others accompanied Momodu to Ibadan to always pray for him, stressing that without the support of women in men’s life, to succeed would be difficult."
  },
  {
    "headline": "Over 80 Football Fans Escape Explosion In Kaduna Beer Parlour",
    "summarized_story": "The Kaduna popular beer parlour near Nnamdi Azikiwe bypassed by Abuja highway always witnesses football fans and fun seekers.\nIt was reliably gathered that at the time the suspected object was sighted, several football fans were watching the final match between Liverpool and Chelsea football in the beer parlour.\nAn eyewitness identified as Mr Bayo told journalists that when the owner of the beer parlour sighted the suspected object on Sunday evening, he moved it to a nearby motor mechanic workshop not knowing what the content was.\nBut this morning being Monday, the Kaduna State Commissioner of police came with some of his men who are bomb experts and removed the object.\nADVERTISEMENTMeanwhile, Kaduna State Police command has confirmed an explosion, suspected to be an Improvised Explosive Devices (IED) which occurred on Sunday night in Kabala West area of Kaduna South Local Government Area of Kaduna State."
  },
  {
    "headline": "ICPC Warns Against Demand For Sexual Gratification",
    "summarized_story": "The chairman of the Independent Corrupt Practices and Other Related Offences Commission (ICPC), Prof. Bolaji Owasanoye said demand for sexual gratification for favour or service rendered is an abuse of power and punishable under the ICPC Act.\nProf. Owasanoye stated this at a one-day stakeholders’ meeting on the draft policy on sexual harassment in educational institutions organised by the ICPC in collaboration with the Ford foundation.\nWhen a person in position of power or authority uses such power irresponsibly by demanding sexual gratification, it is an abuse of power under the ICPC Act.\nADVERTISEMENT“The commission has successfully proved in court that sexual harassment is abuse of power where the perpetrator abuses his position and advantage to demand and at times obtain sexual gratification from the victim.\nThe draft policy was reviewed by the stakeholders in the education sector, civil society organisations and the media."
  },
  {
    "headline": "Students Stage Nationwide Protest, Seek End To Federal Govt, ASUU Dispute",
    "summarized_story": "ADVERTISEMENTAnd with the union and federal government set to meet tomorrow, the students have vowed to continue the protest until the strike is called off.\nThe minister had scheduled an impromptu meeting with the leadership of NANS as students barricaded the entrance of the Federal Ministry of Education.\nHe called on the federal government and ASUU to take immediate actions towards resolving the strike in the interest of students.\nIn Adamawa State, a road accident resulted in the death of three persons close to the venue of the students’ protest.\nThe students advised both the federal government and ASUU to resolve their crisis over the ongoing strike of the union for the sake of the students."
  },
  {
    "headline": "Tinubu, Aregbesola set to reconcile in interest of Osun, Yorubaland",
    "summarized_story": "There were strong indications last night that the feud between the National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, and Minister of Interior, Ogbeni Rauf Aregbesola, might be over earlier than it could be imagined.\n“I can say authoritatively that reconciliation efforts to close the rank between Asiwaju Bola Ahmed Tinubu and Ogbeni Rauf Aregbesola are underway, and already beginning to yield positive results.\nThe source added that, to underline how important the peace move has become, the concerned stakeholders have given the reconciliation of Tinubu and Aregbesola top priority.\n“The truce is being arranged to ensure that the matter is put to rest as fast as possible in the overall interest of the Yoruba people and the APC victory in the forthcoming Osun governorship election.\nIt is a top priority, and there is no doubt that the reconciliation will pacify the aggrieved parties,” the source added."
  },
  {
    "headline": "President Buhari departs Abuja for Kenya",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari will depart Abuja on Tuesday, to participate in the Commemoration of the 50th Anniversary of the United Nations Environmental Programme ([email protected]).\nThe event is to hold from March 3 to March 4 in Nairobi, Kenya.\n”Member States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\n”But each nation has a crucial role to play in protecting our people and planet.”According to Adesina, Buhari is expected to deliver the National Statement of the country and participate in High-Level Dialogue Sessions on the Environment at the event.\nAdesina also said that from Kenya, the president would proceed to London for ”routine medical checks that will last for a maximum of two weeks.” (NAN"
  },
  {
    "headline": "Ukrainians Pushed Me Off The Train, Shoved Dirty Diapers In My Face — Fleeing Nigerian Student Narrates Ordeal",
    "summarized_story": "A Nigerian student fleeing the crisis in Ukraine, identified only as Ngubu, has narrated his experience while trying to board a train from Ukraine to Poland.\nThe young man said he was pushed off a train by Ukrainians and a dirty diaper shoved in his face.\nThe young man said he had joined a train departing the city to Poland on Monday but because he was black, he was pushed off and a dirty diaper shoved in his face, an embarrassing and humiliating experience, he said.\nI got on a train to Poland yesterday but they kicked me off and shoved a dirty diaper in my mouth.\nJust yesterday, some Nigerian students fleeing Ukraine due to the Russian military invasion, shared their ordeal at the Romania-Ukraine border."
  },
  {
    "headline": "BREAKING: Sowore Declares To Run For Nigerian President In 2023",
    "summarized_story": "Omoyele Sowore, a human rights activist, has announced her candidacy for President in 2023.\nSowore is set to run on the African Action Congress platform (AAC).\nOn Tuesday, the activist posted on Facebook, “SOWORE FOR PRESIDENT.”Sowore announced this Monday that he would declare for president in 2023 in March.\nAfter his release, the activist expressed optimism about becoming the country’s future president and said that he was not being threatened by anyone.\n“They took me to their detention, when they were tired; they came and call me that I should be going home."
  },
  {
    "headline": "Complete Sports Founder, Sunny Ojeagbase Dies At 71",
    "summarized_story": "The family has confirmed the death of Emmanuel Sunny Ojeagbase, founder and executive chairman of Complete Communications Limited, publishers of Complete Sports newspapers.\nAccording to a statement released by the family, the late Ojeagbase was from Uzebba, Iuleha in Edo State’s Owan West.\nBefore adding Emmanuel to his name, he was known as Sunny Ojeagbase (or simply “S.O.”).\nMr Ojeagbase launched numerous more pioneering sports titles into the Nigerian sports industry between 1984 and 1994, including Complete Football magazine, Complete Football International (CFI), and International Soccer Review (ISR).\nMr Sunny Emmanuel Ojeagbase is survived by his wife, Mrs Ojeagbase, his children both biological and adopted, as well as grandchildren and other relatives."
  },
  {
    "headline": "‘I’ll Kill Nnamdi Kanu In Court With My Hands’ – Asari Dokubo Threatens IPOB Leader",
    "summarized_story": "‘I’ll Kill Nnamdi Kanu In Court With My Hands’ – Asari Dokubo Threatens IPOB LeaderFormer militant leader, Asari Dokubo has threatened to kill Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB.\nDokubo threatened to kill Kanu inside the courtroom with his bare hands.\nDismissing such claims, Dokubo said the day such happens, he will practically go to court and eliminate the IPOB leader personally.\n“I will not send anybody, I will practically go there and kill him with my own hands,” he threatened.\nKanu is facing charges bordering on terrorism before Justice Binta Nyako-led Federal High Court, Abuja."
  },
  {
    "headline": "Russia – Ukraine war: Air Peace to evacuate stranded Nigerians Wednesday – FG",
    "summarized_story": "There are over 4,000 Nigerians in the eastern European country which descended into war last week with an invasion by its neighbour, Russia.\nHe said his ministry had arranged with the management of an indigenous airline- Air Peace – to evacuate Nigerians who have crossed the Ukrainian-Polish border Wednesday March 2, 2002.\nHe said many Nigerians did not believe Russia would invade Ukraine until the crisis erupted.\nShe lauded the federal government’s efforts at making necessary arrangements to evacuate some of the stranded Nigerians to Poland.\nIn southern Ukraine, Russian attempts to cut Ukraine off from the Black Sea appeared to be having more success."
  },
  {
    "headline": "Assent to Electoral Amendment Bill: Presidency exposes Jonathan’s govt – Blueprint Newspapers Limited",
    "summarized_story": "“This came despite the then administration pulling every lever of its sixteen-year incumbency to bend the electoral system to its advantage.\nThe evident inadequacies, the Presidency said, spurred the president to assent the Electoral Act 2022 after the back and forth on some controversial provisions of the bill.\n“What happened since they were elected in 2015 that they couldn’t come up with a new Electoral Act?\nYabagi who commended President Buhari, said the signing of the amended Electoral Act has recorded a remarkable and epochal milestone in the nation’s history of democracy.\n“With the Electoral Act and its revolutionary provisions and innovations, the silver-linings are appearing the nation’s political and democratic firmaments."
  },
  {
    "headline": "At last, FIFA, UEFA hit Russia with suspension *See list of affected Russian clubs, other football teams",
    "summarized_story": "FIFA and UEFA have suspended Russia’s national and club teams from all competitions until further notice.\nA joint FIFA and UEFA statement read: “Following the initial decisions adopted by the FIFA Council and the UEFA Executive Committee, which envisaged the adoption of additional measures, FIFA and UEFA have today decided together that all Russian teams, whether national representative teams or club teams, shall be suspended from participation in both FIFA and UEFA competitions until further notice.\n“Football is fully united here and in full solidarity with all the people affected in Ukraine.\nEuropa League – UEFA has already confirmed Spartak Moscow will not play their Europa League match against RB Leipzig, with the German club advancing to the quarter-finals.\nNations League – In June, Russia are due to play Albania twice, as well as games against Israel and Iceland."
  },
  {
    "headline": "LIVE: Voting On Constitution Amendment Bills Commences In National Assembly",
    "summarized_story": "﻿Voting on the Constitution Amendment bills has commenced at the National Assembly.\nThe two-day exercise is being done electronically.\nLawmakers are voting on 68 Constitution Amendment bills.\nSome of the bills include a bill for an Act to Alter the Constitution of the Federal Republic of Nigeria, 1999 to Provide for the Financial Independence of State Houses of Assembly and State Judiciary; and for Related Matters.\nAnother bill listed is the bill for an Act to Alter the Constitution of the Federal Republic of Nigeria, 1999 to compel persons to obey or comply with Legislative Summons; and for Related Matters."
  },
  {
    "headline": "Dolapo Osinbajo Attends Reps Plenary On Constitution Amendment",
    "summarized_story": "Wife of the Vice President Dolapo Osinbajo is currently attending plenary as the House of Representatives commences the Constitution Amendment.\nThe lawmakers had screamed “no” when a motion to admit Mrs Osinbajo into the chamber to witness proceedings was raised.\nSubsequently, the matter was put to vote and the Speaker, Femi Gbajabiamila, ruled to allow her into the chamber.\nRead Also: Buhari Writes Senate, Seeks Amendment Of Section 84 (12) In Electoral ActLast week, the wife of the President, Mrs Aisha Buhari, was admitted into the chamber when the constitution amendment bills were laid.\nMore to follow…"
  },
  {
    "headline": "Buhari To Attend UN Session In Kenya, Visit London For Two-Week Medical Check-Up",
    "summarized_story": "President Muhammadu Buhari is set to attend a special session to commemorate the 50th Anniversary of the United Nations Environmental Programme ([email protected] 50), scheduled for March 3 and 4, 2022 in Nairobi, Kenya.\nAccording to a statement by the Special Adviser to the President on Media & Publicity, Femi Adesina, the President is expected to depart Abuja later today.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\nAhmed Rufai Abubakar, and the Chief Executive Officer of Nigerians in Diaspora Commission, Abike Dabiri-Erewa.\nFrom Kenya, the President is expected to proceed to London for routine medical checks that will last for a maximum of two weeks."
  },
  {
    "headline": "Ukraine: FG To Begin Evacuation Of Nigerians From Wednesday – Onyeama",
    "summarized_story": "﻿Air Peace and Max Air may begin the evacuation of Nigerians from Ukraine on Wednesday, the Federal Government has announced.\nThe Minister of Foreign Affairs, Geoffrey Onyeama, stated this on Monday during a meeting with the Speaker of the House of Representatives, Femi Gbajabiamila.\nEarlier on Monday the Ministry of Foreign Affairs said hundreds of Nigerians have been received in Poland, Hungary and Romania by Nigerian embassies in those countries.\nEvacuation effortsMany Nigerian students in Ukraine have called for help in leaving the conflict hotspot.\nOn Monday, the Ministry of Foreign Affairs said 130 Nigerians have been received by the country’s embassy in Romania."
  },
  {
    "headline": "Disney, Sony Pictures Halt Film Releases In Russia",
    "summarized_story": "Disney and Sony Pictures are suspending the release of their films in theaters in Russia after Moscow’s assault on Ukraine, the companies announced separately on Monday.\nIt follows the example of other major firms choosing to pull out of the country since President Vladimir Putin launched the invasion last week.\n“Given the unprovoked invasion of Ukraine and the tragic humanitarian crisis, we are pausing the release of theatrical films in Russia, including the upcoming ‘Turning Red’ from Pixar,” Disney said in a statement.\nFacebook, Twitter and Microsoft took steps on Monday to limit the dissemination of information from news outlets affiliated with the Russian government.\nMore drastically, British oil companies BP and Shell have announced that they are dumping their shares in joint projects with Russian oil groups."
  },
  {
    "headline": "Constitution Amendment: Reps admit Osinbajo's wife into chambers -",
    "summarized_story": "Dolapo Osinbajo, wife of the Vice President has been admitted into the chambers of the House of Representatives to support proposed bills for increased women participation in governance.\nSome lawmakers earlier rejected by the house Leader, Alhassan Ado-Doguwa to admit Wife of Vice President into the chambers but the speaker overruled them through voice vote.\nAdvertisementRecall that wife of the president, Aisha Buhari had last month attended the proceeding on the floor of the Senate where she gave support to increased women participation in governance.\nMeanwhile, the House of Representatives has passed the bill to abrogate joint State, Local Government bank accounts.\nAdvertisementAlso, a bill for autonomy of Local Governments scales through at House of Reps."
  },
  {
    "headline": "Organised labour continues protest at NASS, demands autonomy for LG -",
    "summarized_story": "Organised labour has arrived the National Assembly complex in continuation of its advocacy for administrative and financial autonomy of local governments, judiciary and the legislature.\nAdvertisement"
  },
  {
    "headline": "Kyiv, Moscow hold high-level talks at Ukraine-Belarus border",
    "summarized_story": "Ukraine High-level talks between Kyiv and Moscow are taking place at the Ukraine-Belarus border.\nAmidst the talk, Ukraine’s President Volodymyr Zelenskyy said the next 24 hours is “crucial” for Ukraine.\nAdvertisementBut Ukraine’s health ministry says Civilian death toll now stands at 352, including 14 children.\nThe United Nations General Assembly observed a minute of silence for Ukraine as it opens a special emergency session to discuss Russia’s invasion of its neighbour.\nAdvertisementUNGA President Abdulla Shahid led the UN’s 193 members in the moment of meditation before calling for “an immediate ceasefire” in the conflict."
  },
  {
    "headline": "APC Nominates Christianah Afuye as Deputy to Biodun Oyebamiji -",
    "summarized_story": "The Ekiti State All Progressives Congress (Ekiti APC) is announcing the nomination of Chief (Mrs.) Monisade Christianah Afuye as the party’s Deputy Governorship Candidate for the June 18, 2022 gubernatorial election in the state.\nThis development has been formally communicated to the Independent National Electoral Commission (INEC) in keeping with extant electoral guidelines, and necessary formalities concluded.\nShe earned her Ordinary National Diploma and Higher National Diploma in Public Administration from Crown Polytechnic, Ado Ekiti, Ekiti State.\nShe worked as a Catering Supervisor at the College of Education, Ikere-Ekiti (1979-1985) after which she went into private business.\nAfuye, a formidable grassroots politician, is a member of the Ekiti APC State Executive Council as the State Women Leader"
  },
  {
    "headline": "Hollywood Halts Releases in Russia, Including ‘The Batman’",
    "summarized_story": "Warner Bros., the Walt Disney Co. and Sony Pictures said Monday that they would “pause” the release of their films in Russia.\n“The Batman,” one of the year’s more anticipated films, launches Friday in North America and many overseas territories, including Russia.\n“In light of the humanitarian crisis in Ukraine, WarnerMedia is pausing the release of its feature film ‘The Batman’ in Russia,” a spokesperson for the studio said in a statement.\nRussia is not a leading market for Hollywood, but the country typically ranks in the top dozen countries globally in box office.\nAfter Disney and Warner Bros. made their announcements, Sony followed suit."
  },
  {
    "headline": "Russia’s World No 1 Daniil Medvedev Faces Possible Ban By Tennis Governing Body",
    "summarized_story": "New world number one Daniil Medvedev’s spot atop the rankings could be under threat amid calls for Russia and Belarus to be expelled from the International Tennis Federation.\nFollowing the Russian invasion of Ukraine on Thursday, the Ukrainian Tennis Federation are pressuring the ITF to ban Russia from all individual and team events.\nIf the governing body decided to go through with such a drastic move, it would see players like Medvedev banned from competing.\nMedvedev became the first non-Big Four player to hold top spot in the ATP rankings since February 1, 2004 – over 18 years ago.\nThe Russian officially confirmed his new spot when the rankings were updated on Monday, with Medvedev capping a tremendously successful 12 months, including his maiden Grand Slam title when he won the US Open title."
  },
  {
    "headline": "US Expels 12 Russian Diplomats from UN Mission in New York for Spying",
    "summarized_story": "“We are taking this action in accordance with the UN Headquarters Agreement.\nRussia’s UN Ambassador Vassily Nebenzia told reporters the diplomats had been asked to leave by March 7.\ners – including 116 children – have been wounded in the Russian assault.\nThe first round of talks aimed at ending the fighting between Moscow and Kyiv concluded on Monday with no immediate agreements.\nThe talks were held near the Belarus-Ukraine border as Russian troops continued their attack on Ukrainian cities – including the second-largest, Kharkiv – on the fifth day of Russia’s invasion."
  },
  {
    "headline": "Toshiba CEO Resigns Ahead of Vote on Spin-off Plan",
    "summarized_story": "Toshiba’s CEO resigned on Tuesday, adding fresh uncertainty weeks before a key shareholder meeting on a plan to spin off the Japanese conglomerate’s devices unit.\nHe will continue to serve as interim chair of the board of directors, Toshiba said in a statement.\nHis resignation comes ahead of an extraordinary shareholder vote on March 24 on Toshiba’s plan to spin off its electronic devices segment and sell “non-core” businesses.\nThe proposal is a revision of an earlier plan to split Toshiba into three companies, which met with opposition from some key shareholders.\nRepresentative Executive Officer Mamoru Hatazawa is also stepping down from his current position but will continue to serve as a company director, Toshiba said."
  },
  {
    "headline": "40-Mile Russian Convoy Threatens Kyiv as Shelling Intensifies",
    "summarized_story": "A 40-mile convoy of Russian tanks and other vehicles threatened Ukraine’s capital Tuesday, the sixth day of the war.\nAs the talks along the Belarusian border wrapped up, several blasts could be heard in Kyiv, and Russian troops advanced on the city of nearly 3 million.\nMessages aimed at the advancing Russian soldiers popped up on billboards, bus stops and electronic traffic signs across the capital.\nIn a later Facebook post, he said many Russian soldiers and some local residents also were killed during the fighting on Sunday.\nAmong the refugees in Hungary was Maria Pavlushko, 24, an information technology project manager from a city west of Kyiv."
  }
]