[
  {
    "headline": "Nigeria spends $6.2bn to treat 1m HIV patients in 13 years",
    "summarized_story": "The Director-General of the National Agency for the Control of AIDS, Aliyu Gambo, has said that Nigeria has spent about $6.2bn in identifying and treating close to one million HIV patients in Nigeria.\nHe disclosed this on Wednesday during the launch of the national domestic resource mobilisation and sustainability strategy in Abuja.\nHe said; “Between 2005 and 2018, about $6.2 billion was spent to identify close to one million people living with HIV in this country and place them on treatment.\n“However, 80 per cent of this money came from international donors and development partners, only 18 per cent was contributed by the federal and state governments and one per cent came from the private sector.”Aliyu said it was essential for national and state stakeholders to assume greater ownership of the HIV response including financing and strong accountability structures, adding that he was committed to mobilising local resources towards achieving the agency’s objective,He said the strategy, which is designed to run from 2021 to 2025, is needed to monitor the use of the funds that are raised and to ensure that they are spent on activities that will continue to have a real impact on people living with HIV/AIDS.\nHe said the initiative would reduce the over-dependence on international funding and help towards ensuring the availability of sustainable resources for the implementation of programmes to meet the 95:95:95 HIV target by 2030."
  },
  {
    "headline": "Spain probes death of antivirus software pioneer, McAfee",
    "summarized_story": "The body of the 75-year-old founder of the anti-virus McAfee software was discovered at around 7:00 pm on Wednesday in his cell in the Brians 2 penitentiary near Barcelona in what a prison service spokeswoman said was a death “apparently from suicide”.\nSince making a fortune in the 1980s with the antivirus software that still bears his name, McAfee had become a self-styled cryptocurrency guru, claiming to make $2,000 a day.\nMcAfee in 1987 founded the computer security software company and ran it for seven years before resigning.\nMcAfee had more than one million followers on Twitter, where he described himself as a “lover of women, adventure and mystery”.\nA documentary titled “Gringo: The Dangerous Life of John McAfee” released in 2016 focused on his life in Belize."
  },
  {
    "headline": "No hand in anti-media bills — PRESIDENCY",
    "summarized_story": "One of the bills is the Nigeria Press Council, NPC, Amendment Bill seeking control of the Nigerian media by the Federal Ministry of Information.\nWe’ve no hand in anti-media bills – PresidencyThe Presidency said it has no hand in the proposed anti-media legislation.\nThe outrage came as The Presidency said it has no hand in the ongoing attempts at the National Assembly to amend the NPC and NBC Acts.\nNPC bill authoritarian – Ossai“The Press Council Amendment Bill is authoritarian in nature, and not acceptable in a democracy.\nHe opined that certain proposals in the amendment bill will ensure quality control."
  },
  {
    "headline": "JAMB releases 2021 UTME results — Oloyede",
    "summarized_story": "The Joint Admissions and Matriculation Board, JAMB, yesterday released results of the 2021 Unified Tertiary Matriculation Examination, UTME, which started last Saturday.\nJAMB Registrar, Prof. Ishaq Oloyede, who disclosed this at a briefing in Enugu, said he had no reason whatsoever to withhold the results of the UTME.\nHe noted that JAMB registered 1,415,501 candidates in the UTME 2021 and 1,122, 095 had taken the examinations so far while 66,111 had yet to take.\nAccording to him, the board has some 650 examination centres across the country, out of which 30 centres have been delisted for performing below standard.\nI want to commend the media for their criticism and support which made the 2021 UTME successful,” Oloyede said."
  },
  {
    "headline": "FRSC not recruiting ― Spokesperson",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has cautioned job-seekers against online fraudsters posing as its recruitment agents.\nThis is contained in a statement by Corps Public Education Officer, Bisi Kazeem on Thursday in Abuja.\nHe said the attention of the FRSC had been drawn to an online publication misinforming the public about the release of shortlisted names for recruitment.\n“Our recruitment processes have always been transparent, credible and made public through adequate placements of advertorials and notifications on all available media platforms.\n“This includes our website: www.frsc.gov.ng, our social media handles and the National Traffic Radio 107.1FM,’’ he said."
  },
  {
    "headline": "Banditry is business, security agents working with bandits, Gumi alleges",
    "summarized_story": "Gumi, who spoke in an interview on Arise TV, said: ‘’These bandits are operating with a lot of people in the security system.\nAccording to him, government which is supposed to be neutral is taking sides against the bandits, sending security agents after them.\nThe children of herders who are now bandits are also being killed in different parts of the country.\n‘’I don’t speak for bandits committing atrocities; I also don’t speak for those committing atrocities against the bandits, I’m only trying to be neutral.\nBandits are ready to stop banditry if the military is ready to cooperate with them,’’ Gumi said."
  },
  {
    "headline": "Osun residents flee, as soldiers battle police to free detained colleague",
    "summarized_story": "…It was hoodlums that attacked —PoliceBy Shina AbubakarRESIDENTS of Obelawo area of Osogbo, in Osun State, Tuesday, scampered for safety, as some soldiers battled policemen to free a detained colleague.\nThe three soldiers were said to have invaded a police post in the area around 8pm to secure the release of one of their colleague, who was detained by the police, for seeking to bail his friend.\nAdekunle said: “The soldiers, three of them in camouflage shirts, insisted their colleague must be released, which provoked the policemen who threatened to shoot.\nBefore we could leave the scene, one of the policemen began to shoot at the soldiers.\nOpalola said: “Some hoodlums invaded the police station and freed one Sanni Adesegun among 11 suspected cultists earlier arrested at Egbatedo area."
  },
  {
    "headline": "N56 million fence contract followed due process",
    "summarized_story": "The Federal Character Commission (FCC) said on Thursday that the award of contract for the construction of fence and gate house at its proposed training school in Katsina State, Northwest, Nigeria followed all due process.\nThe agency in a statement signed by Abdullahi Adamu Idris and sent to DAILY POST in Abuja, was reacting to reports in some news outlets that a whopping sum of N56,080,593.00 (Fifty-Six Million, Eighty Thousand, Five Hundred and Ninety-Three Naira and Fifty Kobo) was to construct fence of the proposed training school in Katsina around 2016.\nThe Commission further maintained that there are records of transactions with regard to the contract and its doors are opened to scrutiny.\nDismissing the media report, the statement described the report as half-truth and did not comply with the journalistic requirement of paper investigation before rushing to the press.\nFederal Character Commission: Civil society group calls for equity in appointments"
  },
  {
    "headline": "Kano Chief Judge approves appointment of 34 Sharia Court judges",
    "summarized_story": "The Kano State Chief Judge, Justice Nura Sagir, has approved the appointment of 34 additional Sharia Court judges in the state.\nMr Baba Jibo-Ibrahim, the Kano State Judiciary Spokesman, said this in a statement issued to newsmen in Kano on Thursday.\nSharia in South-West: Drop Fulani agenda or you’ll drop dead – PFN’s Oke warnsJibo-Ibrahim said the newly appointed Sharia Court judges would be sworn-in on June 25, 2021.\n“All the newly appointed Sharia Court judges will be sworn-in on June 25, at the conference room of the High Court of Justice, Kano by 10 am,” the statement read in part.\nMeanwhile, Governor Abdullahi Ganduje of Kano State had earlier this month said his administration has no problem with granting financial autonomy to the judicial arm of the government in the State."
  },
  {
    "headline": "IPOB vs bandits: You're terrorists' main sponsor in Nigeria",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB) on Thursday accused Islamic cleric, Sheikh Ahmad Gumi of being the main sponsor of banditry and terrorism in Nigeria.\nThe IPOB leader dared Gumi to stop twisting facts, stressing that the group was not against Northerners in the Southeast but terrorists.\n“Gumi should be ashamed that an Islamic cleric as he claims has suddenly become a mouthpiece for bandits and terrorists.\n“We want to put the world on notice that Sheikh Gumi is the main sponsor banditary and terrorism in Nigeria.\nESN will not allow any person to occupy our forests again.”IPOB vs bandits: Sheikh Gumi will set Nigeria on fire – Omokri"
  },
  {
    "headline": "We’re not recruiting – FRSC",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has warned Nigerians to be wary of online fraudsters posing as its recruitment agents.\nThe Corps Public Education Officer, Bisi Kazeem, gave the warning in a statement on Thursday in Abuja, NAN reports.\nHe said the attention of the FRSC had been drawn to an online publication misinforming the public about the release of shortlisted names for recruitment.\n“We want to call the attention of the public and let them know that the service is presently not recruiting neither is there any shortlisted candidates listed on any platform whatsoever.\n“Our recruitment processes have always been transparent and made public through adequate notifications on all available media platforms."
  },
  {
    "headline": "Enugu shooting: Conduct open trial of killer cops",
    "summarized_story": "The youth wing of apex Igbo socio-cultural organization, Ohanaeze Ndigbo, has asked the Nigeria Police Force to conduct a public trial of the unnamed Inspector involved in the killing of five Enugu residents on Sunday.\nThis was contained in a statement issued by the OYC President-General, Mazi Okwu Nnabuike, and the Secretary-General, Comrade Obinna Achionye.\nThe OYC has now asked the police hierarchy not to shroud the trial of the erring officer in secrecy.\nThe Igbo group said in the statement on Thursday that, “while we thank Enugu youths for remaining calm in the face of this mindless provocation, their calmness should not be taken for granted.\n“The only way to assuage the feelings of the victims’ family members is for the police to conduct open prosecution of the suspect."
  },
  {
    "headline": "NSCDC arrests 76-old man for attempted murder",
    "summarized_story": "By Adekunle Jimoh, IlorinOperatives of the Kwara state command of the Nigeria Security and Civil Defence Corps (NSCDC) have arrested a-76 year old man Zubair Audu for alleged attempt to kill his son with dane gun in Ilorin, the state capital.\nThe incident occurred on Wednesday at Alagbado Area 5, Mountain Avenue in the metropolis.\nCorps command spokesperson Babawale Afolabi said on the said day “NSCDC office at Pake area received a distress call that one 76 years old man was chasing his son with a locally made rifle.\nMr. Afolabi said that the command had launched serious man- hunt for the son who is still at large.\nHe hinted that the state Commandant Iskil Makinde has ordered for full scale investigations into the incident."
  },
  {
    "headline": "Pregnant woman, two others die in Lagos Ibadan Expressway accident",
    "summarized_story": "By Ernest Nwokolo, AbeokutaThree persons, including a pregnant woman, Thursday died in a predawn multiple vehicles accident on the Ogun State corridor of the Lagos – Ibadan expressway.\nThe witnesses said operatives of the Federal Road Safety Corps (FRSC) and Ogun State Traffic Compliance and Enforcement Corps (TRACE) were seen evacuating the victims, clearing the ensuing obstruction, and directing traffic.\nThe Spokesperson for TRACE, Babatunde Akinbiyi, who confirmed the accident, said the remains of the dead were taken to the morgue of Idera Hospital, a private health facility in Sagamu, by FRSC operatives.\nADVERTISEMENTAkinbiyi said among the three casualties are two male occupants of the Mazda bus while the pregnant woman was in a Mazda bus conveying tomatoes.\nWhile commiserating with the families of the dead, the TRACE Corps SpokesmanWarned motorists to desist from overspeeding, especially during this rainy season where the roads are wet with poor visibility likely to affect drivers already fatigued before the break of dawn."
  },
  {
    "headline": "AMCON takes over Sen. Buhari’s houses for N600m loan default",
    "summarized_story": "By Taofik Salako, Deputy Group Business EditorAssets belonging to Senator Abdulfatai Buhari have been taken over by the Asset Management Corporation of Nigeria (AMCON).\nThe corporation said it took the action after securing a court order to sell the assets to recover the loan.\nIt was classified as a Non-Performing Loan (NPL) and purchased by AMCON from the bank during the second phase of eligible bank asset purchases this year.\nThe corporation approached the Federal High Court, to obtain an order to take over assets of Abadat.\nAccording to him, having exhausted all possibilities, AMCON had no other options as a law abiding corporate organisation than to seek judicial intervention."
  },
  {
    "headline": "FC Barcelona send birthday message to Messi as contract expires",
    "summarized_story": "Agency ReporterFC Barcelona sent birthday greetings to Lionel Messi as the club captain turned 34 on Thursday, at a time when his future remains unresolved.\nADVERTISEMENTThere was customary warmth towards Messi in the social media posts by Barcelona, who showcased a reel of his 10 best goals.\nMessi sought to leave Barcelona in 2019, looking to exercise a clause in his contract that he believed allowed him to depart at the end of the season.\nThe club disputed his right to go and, faced with the prospect of a legal battle to try to free himself from his deal, Messi rowed back on that intention.\nThe election of Joan Laporta as club president appears to have been taken as a positive step forward by Messi."
  },
  {
    "headline": "Anambra Election: How Soludo emerged APGA candidate",
    "summarized_story": "FORMER governor of the Central Bank of Nigeria, CBN, Professor Charles Soludo has won the ticket of the All Progressives Grand Alliance, APGA, for the November 6 governorship election in Anambra State.\nFinal Results Of 2021 APGA Governorship Primaries indicates that Professor Soludo won the 2021 APGA governorship primaries overwhelmingly.\nResult SummarySoludo: 740 votesEzenwankwo: 41 votesOkolo: 7 votesIbeh : 4 votesLocal Government BreakdownAguata LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 44Anambra East LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 40Anambra West LGASoludo; 25Ezenwankwo; 1Anaocha LGA:Ezenwankwo 4.\nSoludo: 40Ibeh: 1Okolo: 1Awka North LGAEzenwankwo 4.\nSoludo: 29Ibeh: 0Okolo: 0Awka South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 46Ayamelum LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 28Dunukofia LGAEzenwankwo – 1Damian – NilIbe – 1Soludo – 32Ekwusigo LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 29Idemili North LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 29Idemili South LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 30Ihiala LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 45Njikoka LGAEzenwankwo – 2Damian – NilIbe – 1Soludo – 41Nnewi North LGAEzenwankwo – 2Damian – 5Ibe – NilSoludo – 19Nnewi South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 45Ogbaru LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 38Onitsha North LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 35Onitsha South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 40Orumba North LGAEzenwankwo – 4Damian – NilIbe – 1Soludo – 38Orumba South LGAEzenwankwo – 5Damian – NilIbe – NilSoludo – 37Oyi LGAEzenwankwo – 5Damian – NilIbe – 1Soludo – 30"
  },
  {
    "headline": "We’ve no hand in controversial media bills –Presidency",
    "summarized_story": "Adesina said that President Muhammadu Buhari has approved that the Second Peer Review Country Self-assessment Report should be done.\n“The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\n“Nigeria is ready for the second Peer Review Country Self -assessment Report to be done by AUDA-NEPAD.\nNow, Nigeria is ready for the second review self-assessment report.\n“So, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today."
  },
  {
    "headline": "Anambra guber: Crisis in APGA, PDP’ll give us victory- APC",
    "summarized_story": "A leading pressure group, APC Patriots, Anambra has charged aspirants of the All Progressives Congress to close ranks in order for the party to win the November 6, 2021 gubernatorial election.\nSpeaking against the backdrop of intense crisis currently rocking the ruling All Progressives Grand Alliance, APGA and the People’s Democratic Party, PDD, the APC Patriots said that the discordant tunes emerging from both parties leaves the state open for APC to take.\nPart of its strategies included the April 27, 2021 Interactive Session which it convoked at the Transcorp Hilton, Abuja.\nThe event was attended by Vice President Yemi Osinbajo, all the aspirants, ministers, and leading political figures from the South east, including former Senate President, Ken Nnamani.\nAt that epochal event, the aspirants had pledged to go about seeking the party’s ticket in an atmosphere of camaraderie – a pledge, which the APC Patriots noted they have sustained till date."
  },
  {
    "headline": "N37bn NASS renovation budget: We’re vindicated –Lawan",
    "summarized_story": "From Fred Itua, AbujaSenate President, Ahmad Lawan, has said the reported roof leakage at the National Assembly has vindicated its request for the approval of N37 billion for the renovation of the complex.\nIt obstructed Senate plenary sessionIn his remarks, Lawan said media reports that the money had been approved and siphoned by the leadership of the National Assembly was false.\n“The fact that there was a leakage, to me it is a clear testimony, confirmation and vindication of the position the National Assembly took initially.\n“For emphasis, when we approved the budget of N37 billion for the rehabilitation of this complex, it was not a National Assembly budget, it was an FCDA budget, we have nothing to do with this,’’ Lawan said.\nThe National Assembly approved the N37 billion in the 2020 budget."
  },
  {
    "headline": "2023: Arewa group endorses Gov Mohammed for president",
    "summarized_story": "A pan-Arewa group, Northern Youth Elders Forum (NYEF), has endorsed Bauchi State Governor, Bala Mohammed, for 2023 presidency.\nSpeaking during a meeting in Bauchi, yesterday, National Chairman of the group, Eliot Afiyo, said Mohammed was picked from among 27 prominent Nigerians who were considered as possible presidential candidates for 2023.\nThe NYEF chairman said the group took interest in Mohammed when he defeated a sitting Bauchi governor in 2007 to emerge senator.\nHe said Mohammed again proved his popularity in 2019 when he defeated an incumbent to become Governor of Bauchi State.\nAfiyo said the group, which also endorsed President Olusegun Obasanjo, Umar Yar’Adua, Goodluck Jonathan and Muhammadu Buhari when they vied for president in 1999, 2003, 2007, 2011 and 2015, will mobilise for Governor Mohammed to emerge victorious in 2023."
  },
  {
    "headline": "Presidency Replies Critics, Washes Hands off Media Bills",
    "summarized_story": "The spokesman, however, revealed that the president has approved that the Second Peer Review Country Self-assessment Report should be done.\nHe said: “The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\nNow, Nigeria is ready for the second review self-assessment report.\nSo, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today.\nNUJ President, Mr. Chris Isiguzo, spoke while reacting to the denial by the presidency that they had no hand in the plot."
  },
  {
    "headline": "Petrol Smuggling Rises to 42m Litres Daily, NNPC Cries Out",
    "summarized_story": "•Says subsidy hits N150bn monthlyEmmanuel AddehNigerian National Petroleum Corporation (NNPC) yesterday lamented the escalating incidence of petrol smuggling across Nigeria’s borders, which it puts at a whopping 42 million litres per day.\nThe corporation said the unbridled smuggling has increased Nigeria’s estimated daily consumption of 60 million litres to 102 million litres.\nHe urged all industry stakeholders to collaborate with the NNPC to ensure that the daily national petroleum products consumption, which shot up to 102 million litres in May, is reduced to about 60 million litres.\n“We all know that our daily consumption is not up to 60 million litres.\nHe stated that whatever is being done in the area of deregulation will not make any impact without Nigeria knowing exactly its actual daily consumption of petrol."
  },
  {
    "headline": "Adesina: Presidency has no Input in Media Bills before N’ Assembly",
    "summarized_story": "The spokesman, however, revealed that President Muhammadu Buhari has given approval that the Second Peer Review Country Self-assessment Report should be done.\nAccording to him, “The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\nNigeria is ready for the second Peer Review Country Self -assessment Report to be done by AUDA-NEPAD.\nNow, Nigeria is ready for the second review self-assessment report.\nSo, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today."
  },
  {
    "headline": "US Blocks Iran-affiliated News Sites",
    "summarized_story": "The US has taken down dozens of Iranian and Iran-linked news sites which it accuses of spreading disinformation.\nThe sites were replaced on Tuesday with notices saying they had been “seized” as part of a law enforcement action.\nThe sites had been used by components of the Iranian government “disguised as news organizations or media outlets” to target the US “with disinformation campaigns and malign influence operations”, it alleged.\nYemen’s rebel Houthi movement confirmed that a domain of its news channel, Al-Masirah TV, had been blocked.\nThe .tv domain is owned by the Pacific nation of Tuvalu but is run by the US firm Verisign."
  },
  {
    "headline": "NEITI Report: Minister Applauds Staff on Revenue Increase",
    "summarized_story": "According to him, “I was reading the NEITI report that said that our sector has contributed and set a new record, beating our old record anyway.\nBecause, this report is actually talking about 2020 and what that means is that, next year, we must surpass the goal of 2020.\nThe NEITI report had revealed thatrevenue from the solid minerals sector grew by 15 per cent to hit N79.96 billion in 2019.\nThe 2019 audit report of the solid minerals sector also stated that revenue from the sector in 2018 was N69.47 billion.\nDespite the increase, the solid minerals sector accounted for just 0.51 per cent of total export in 2019, as the report showed that the sector recorded N124.23 billion of the total government exports of N24.275 trillion."
  },
  {
    "headline": "Borno Nursing School Suspends Student For Not Welcoming Buhari During President's Visit",
    "summarized_story": "The Borno State College of Nursing and Midwifery has suspended a student for refusing to welcome President Muhammadu Buhari when he visited the state on June 17.\n\"It cost Zulum N350 million to mobilise the crowd they touted as Buhari's supporters,\" a source in Borno State government had told SaharaReporters.\n\"When President Buhari visited Lagos last week, they had to fly him over the city in a chopper because of a hostile crowd,\" another source had added.\nGovernor Zulum had earlier urged residents to show appreciation to President Buhari during his visit.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "Borno Nursing School Suspends Student For Not Welcoming Buhari During President's Visit",
    "summarized_story": "The Borno State College of Nursing and Midwifery has suspended a student for refusing to welcome President Muhammadu Buhari when he visited the state on June 17.\n\"It cost Zulum N350 million to mobilise the crowd they touted as Buhari's supporters,\" a source in Borno State government had told SaharaReporters.\n\"When President Buhari visited Lagos last week, they had to fly him over the city in a chopper because of a hostile crowd,\" another source had added.\nGovernor Zulum had earlier urged residents to show appreciation to President Buhari during his visit.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "IPOB Calls For Sheikh Gumi's Arrest, Says He's Main Sponsor Of Banditry, Terrorism",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says Islamic cleric Sheikh Ahmad Gumi is not only a spokesman for bandits and terrorists tormenting Nigerians but equally their main sponsor.\nIt noted that the bandits Gumi has been defending kidnap people for ransom, and also spill the blood of their victims.\nWhat does Sheikh Gumi have in common with bandits and terrorists?\nCan you see why Sheikh Gumi should be arrested for investigations and interrogations?\n“We want to put the world on notice that Sheikh Gumi is the main sponsor of banditry and terrorism in Nigeria."
  },
  {
    "headline": "SCAM ALERT: Beware of fraudsters -- we're not recruiting, FRSC warns",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has cautioned job seekers against online fraudsters posing as its recruitment agents.\nAdvertisementIn a statement on Thursday, Bisi Kazeem, FRSC public education officer, said the clarification became necessary following desperate efforts by fraudsters to defraud unsuspecting job seekers.\nHe said the attention of the FRSC had been drawn to an online publication misinforming the public about the release of shortlisted names for recruitment.\n“This is to let the public know that the corps is presently not recruiting neither is there any shortlisted candidates list published on any platform whatsoever,” Kazeem said.\nAdvertisement“Our recruitment processes have always been transparent, credible and made public through adequate placements of advertorials and notifications on all available media platforms."
  },
  {
    "headline": "SCAM ALERT: Beware of fraudsters -- we're not recruiting, FRSC warns",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has cautioned job seekers against online fraudsters posing as its recruitment agents.\nAdvertisementIn a statement on Thursday, Bisi Kazeem, FRSC public education officer, said the clarification became necessary following desperate efforts by fraudsters to defraud unsuspecting job seekers.\nHe said the attention of the FRSC had been drawn to an online publication misinforming the public about the release of shortlisted names for recruitment.\n“This is to let the public know that the corps is presently not recruiting neither is there any shortlisted candidates list published on any platform whatsoever,” Kazeem said.\nAdvertisement“Our recruitment processes have always been transparent, credible and made public through adequate placements of advertorials and notifications on all available media platforms."
  },
  {
    "headline": "2023: At last, INEC launches online portal for voter registration",
    "summarized_story": "The Independent National Electoral Commission (INEC) has finally launched an online portal for Nigerians to register as voters.\nAdvertisementThe portal will go live on Monday when the online registration is scheduled to commence.\nThe electoral umpire stopped the continuous voter registration in August 2018, about six months before the last elections.\n“However, I must quickly reiterate that the online registration is a public service and therefore free of charge.\nThere is no INEC-approved cybercafe, no online registration centre and no scratch card to be purchased for the exercise."
  },
  {
    "headline": "2023: At last, INEC launches online portal for voter registration",
    "summarized_story": "The Independent National Electoral Commission (INEC) has finally launched an online portal for Nigerians to register as voters.\nAdvertisementThe portal will go live on Monday when the online registration is scheduled to commence.\nThe electoral umpire stopped the continuous voter registration in August 2018, about six months before the last elections.\n“However, I must quickly reiterate that the online registration is a public service and therefore free of charge.\nThere is no INEC-approved cybercafe, no online registration centre and no scratch card to be purchased for the exercise."
  },
  {
    "headline": "Daily COVID Tracker: NCDC logs 44 infections in four states -- but zero deaths",
    "summarized_story": "US to send 3 million J&J COVID vaccine doses to BrazilThe United States says it will deliver three million doses of the Johnson & Johnson COVID-19 vaccine to Brazil on Thursday.\nAdvertisementThe donation is part of the US pledge to deliver 80 million vaccine doses to other nations to assist them in the fight against the pandemic.\nAfrica should not be begging for vaccines, Africa should be producing vaccines,” he said.\nNigeria records 44 COVID infectionsAdvertisementThe Nigeria Centre for Disease Control (NCDC) confirmed 44 new cases of COVID-19 on Wednesday across three states and the federal capital territory (FCT).\nAdvertisementThe agency said: “Today’s report includes data from 3 states with zero cases reported: Imo, Kano, and Sokoto”."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "From Konga to mPharma, logistics for health products is growing in Africa",
    "summarized_story": "These health logistics companies include e-commerce players like Jumia, Copia and Konga, and also core health startups like mPharma, Lifestores Pharmacy, Chekkit and Sproxil.\nSnapshot of innovators in the health products distribution space in Africa.\nKonga.com is a marketplace where pharmaceutical companies can list health products like medicines.\nSalient Advisory’s report notes that “clear and harmonised regulations” could boost this entry of e-commerce players into the health products distribution space.\nImudia declines to share what health products logistics currently contributes to Konga’s overall business."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "Baby food market booms on Nigeria’s growing population",
    "summarized_story": "Nigeria’s rapidly growing population is giving life to the baby food market, which has to ensure an estimated 7 million babies born in Nigeria every year are properly fed.\nNigeria currently has a population of 211 million, which according to the United Nations is projected to increase by 90 percent to 401 million by 2050….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Chaos at Lagos airport as infrastructure crumbles",
    "summarized_story": "The worsening state of infrastructure at the Lagos airport is increasingly affecting flight operations and passenger facilitation.\nAs international airports across the world continually work to modernize their infrastructure to improve passenger experience and spur more airline competition, the Murtala Muhammed International Airport (MMIA), which handles 65 percent of the country’s passenger traffic, still battles…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why Nigeria may buck trend of record-low interest rates on African Eurobonds",
    "summarized_story": "Why Nigeria may buck trend of record-low interest rates on African EurobondsIncreased investors’ appetite for African Eurobonds is spurring record low-interest rates, but Nigeria may miss out when it visits the international market later this year.\nDeclining external reserves, insecurity, policy inconsistency and the recent Twitter ban, which heightened the risk premium of Africa’s largest economy, are top reasons why Nigeria is unlikely to follow the…"
  },
  {
    "headline": "Obaseki pledges more support for widows, to set up trust fund to cater for widow’s welfare – Nigerian Observer",
    "summarized_story": "Obaseki pledges more support for widows, to set up trust fund to cater for widow’s welfareShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has reassured of more support for widows in the state, noting that his government will sustain programmes and policies aimed at improving their livelihoods, ensuring that widows and other vulnerable persons are well catered for.\nThe governor gave the assurance in commemoration of the International Widows Day, marked every June 23 by the United Nations and its sister agencies.\nObaseki noted that as part of efforts to ensure the welfare of widows in the state, his government has concluded plans to constitute the Edo State Widow Endowment Trust Fund Committee to ensure that widows and other vulnerable persons in the state are well taken care of.\nAccording to the UN, “For many women around the world, the devastating loss of a partner is magnified by a long-term fight for their basic rights and dignity.\nDespite the fact that there are more than 258 million widows around the world, widows have historically been left unseen, unsupported, and unmeasured in our societies."
  },
  {
    "headline": "Edo launches e-procurement work station, to run digital procurement system – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government will on Wednesday, June 30, 2021, migrate to an e-procurement system, in line with the vision of the Governor Godwin Obaseki-led administration to run a digitally-driven, simple and transparent procurement process.\nThe government, ahead of the move, launched an e-procurement workstation in Benin City and presented high-end laptops to staff and management of the state’s Public Procurement Agency.\nSpeaking to journalists after the launch of the workstation, Managing Director of the Edo State Public Procurement Agency, Henry Idogun, said the implementation of a new e-procurement system would commence with four pilot Ministries, Departments and Agencies (MDAs) in the State.\nIn Edo State, we have embraced procurement reforms in the past eight years and conducted procurements manually.\nBut from 30th of June, 2021, we would be able to go through a procurement process electronically, using technology in some selected MDAs in Edo State.”Idogun added that “there will be more efficiency in our procurement process in the state, using ICT.”..."
  },
  {
    "headline": "Edo honours EDSTMA official for dedication to duty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has rewarded an official of Edo State Traffic Management Agency (EDSTMA), Obass Philip, for his commitment and dedication to duty.\nObass Philip, whose video went viral on social media, was seen controlling traffic during a heavy downpour in the Benin metropolis.\n“I was touched by the video and invited the MD to bring him to my office, for the state government to appreciate him for his dedication to duty.\nHe has done something extraordinary and we will duly reward him.”“The government is watching and will always reward dedication to duty.\nEarlier, the EDSTMA MD, Oloriegbe, said the video of the traffic official went viral on social media and calls came from across the globe, with many impressed citizens contributing to appreciate him."
  },
  {
    "headline": "EDITORIAL: In praise of demolition of illegal structures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State government, weekend commenced the demolition of illegal structures in Benin City in line with the present administration’s urban renewal agenda.\nThe demolition is predicated on Section 7 (5)(I)(III) of the Town and Country Planning Law Cap 165 of Bendel State as applicable to Edo State, as amended by the Town and Country Planning Edit No.\nBesides aesthetics, The Nigerian OBSERVER sees the demolition of illegal structures as an indication that it is no longer business as usual.\nThe Nigerian OBSERVER commends Governor Godwin Obaseki for not lacking in the courage and political will to do what is necessary in the overall interest of Edo people.\nThe state government deserves all the cooperation and support to sustain the laudable initiative which is aimed at restoring the state master plan."
  },
  {
    "headline": "Nigeria’s human rights record ‘very poor’, worse than average in sub-Saharan Africa",
    "summarized_story": "Nigeria’s human rights record is “very poor” and is “worse than [the] average in sub-Saharan Africa,” a new report by an international organisation states.\nThe Human Rights Measurement Initiative (HRMI) said, in the report, that Nigeria’s score for economic and social rights falls within a ‘very bad’ range.\nThe report, which tracked the human rights performance of most countries, stated that Nigeria’s mismanagement of resources is largely responsible for the country’s unfortunate human rights crises.\nEach assessment standard uses a set of indicators that are commonly available and most relevant for these countries, HRMI said.\nADVERTISEMENTFor all the four rights, Nigeria performed worse than most countries in Sub-Saharan Africa."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Shun Unethical Practices, NYSC Tells Own Directors",
    "summarized_story": "The National Youth Service Corps (NYSC) has tasked its directors to shun unethical practices and perform their duties diligently in order not to tarnish the image of the scheme.\nHe also revealed that the Corps has blocked relocation of about one thousand corps members over what it described as unethical practices.\n“Recently we had to block some of the corps members who were involved in it and we said in NYSC we are not going to condole any act of indiscipline, we are not going to compromise our mobilisation process.\nAdvertisements“Some even go to the extent of telling prospective corps members that they can change their date of birth so that they continue to come to service, that era has gone.\nI want to appeal to Nigerians that they should please not fall prey to this fraudsters, our deployment is free where there are challenges we NYSC has a way of addressing it,” Brig-Gen Ibrahim stated."
  },
  {
    "headline": "Shun Unethical Practices, NYSC Tells Own Directors",
    "summarized_story": "The National Youth Service Corps (NYSC) has tasked its directors to shun unethical practices and perform their duties diligently in order not to tarnish the image of the scheme.\nHe also revealed that the Corps has blocked relocation of about one thousand corps members over what it described as unethical practices.\n“Recently we had to block some of the corps members who were involved in it and we said in NYSC we are not going to condole any act of indiscipline, we are not going to compromise our mobilisation process.\nAdvertisements“Some even go to the extent of telling prospective corps members that they can change their date of birth so that they continue to come to service, that era has gone.\nI want to appeal to Nigerians that they should please not fall prey to this fraudsters, our deployment is free where there are challenges we NYSC has a way of addressing it,” Brig-Gen Ibrahim stated."
  },
  {
    "headline": "Constitution Review: We Will Continue To Engage Gulak’s Law Firm – Senate",
    "summarized_story": "The Senate has assured the family members of the late former political adviser to ex- President Goodluck Jonathan, Barr.\nAhmed Gulak, that the professional services of his law firm would still be retained by its committee on the review of the 1999 constitution, adding that everything would be done to cushion the effects of Gulak’s death on the family.\nMembers of the delegation included the Senate Leader, Senator Abdullahi Yahaya; Deputy Senate Leader, Senator Robert Ajayi Boroffice and Senate Minority Leader, Senator Enyinnaya Abaribe.\nLate Gulak was one of the three consultants that were in Owerri for the South-East zonal public hearing on constitution review organised by the Senate Committee.\n“So, on behalf of the President of the Senate, I would like to extend our deepest condolences to the whole family."
  },
  {
    "headline": "Constitution Review: We Will Continue To Engage Gulak’s Law Firm – Senate",
    "summarized_story": "The Senate has assured the family members of the late former political adviser to ex- President Goodluck Jonathan, Barr.\nAhmed Gulak, that the professional services of his law firm would still be retained by its committee on the review of the 1999 constitution, adding that everything would be done to cushion the effects of Gulak’s death on the family.\nMembers of the delegation included the Senate Leader, Senator Abdullahi Yahaya; Deputy Senate Leader, Senator Robert Ajayi Boroffice and Senate Minority Leader, Senator Enyinnaya Abaribe.\nLate Gulak was one of the three consultants that were in Owerri for the South-East zonal public hearing on constitution review organised by the Senate Committee.\n“So, on behalf of the President of the Senate, I would like to extend our deepest condolences to the whole family."
  },
  {
    "headline": "OYA Media Takes Symposium Across Nigeria",
    "summarized_story": "OYA Media has concluded arrangements to host a symposium series tagged ‘How to Fix Nigeria’ across the six geopolitical regions of Nigeria.\nAdvertisementsThis series which was first birthed in London in 2014 in partnership with the Royal African Society comes to Nigeria for its 6th edition.\n‘How to Fix Nigeria’ is a hybrid virtual and physical event comprising Nigerian youth and innovation-led stakeholders.\nThe Nigeria Series of the platform is funded by the MacArthur Foundation and focuses on conversations revolving around the singular theme of Uniting for Action.\nYou can follow the Public Eye on Oya Media – Facebook, MediaOya – Twitter, oyamedia – Instagram, or Watch on YouTube via Public Eye Ng."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Sexual assaults: R. Kelly transferred to New York jail ahead of trial",
    "summarized_story": "R Kelly has been transferred to a New York jail as he prepares to stand trial in his sex trafficking and racketeering case.\nKelly has pleaded not guilty to all counts.\nThe MDC facility is notorious for its allegedly horrific conditions, which have been widely criticised by prisoners, attorneys, and even a senior federal judge, according to the New York Post.\nAmong the current detainees is British socialite Ghislaine Maxwell, who is behind bars without bail on charges of recruiting and grooming young women to be molested by her convicted paedophile ex, late financier Jeffrey Epstein.\nMusicnewsShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Sexual assaults: R. Kelly transferred to New York jail ahead of trial",
    "summarized_story": "R Kelly has been transferred to a New York jail as he prepares to stand trial in his sex trafficking and racketeering case.\nKelly has pleaded not guilty to all counts.\nThe MDC facility is notorious for its allegedly horrific conditions, which have been widely criticised by prisoners, attorneys, and even a senior federal judge, according to the New York Post.\nAmong the current detainees is British socialite Ghislaine Maxwell, who is behind bars without bail on charges of recruiting and grooming young women to be molested by her convicted paedophile ex, late financier Jeffrey Epstein.\nMusicnewsShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Alleged certificate fraud: Adamant minister stops FIIRO DG’s new appointment over demoted officer",
    "summarized_story": "It was learnt that the directive was as a result of his quest to install Chima Igwe, a demoted official of FIIRO, as the agency’s director general.\nThe minister was said to have to stop the appointment of a substantive DG until Igwe was cleared.\nThe PUNCH had reported happenings at FIIRO since 2019 when Igwe was appointed the acting director general under controversial circumstances.\nThe minister, Onu, however, instructed the board to reinstate Igwe as the acting DG, a request that was rejected by the board Chairman, Alhaji Ibrahim Gwarzo.\nSeveral attempts by the board to begin the process of installing a substantive director-general were allegedly rebuffed by the minister."
  },
  {
    "headline": "Alleged certificate fraud: Adamant minister stops FIIRO DG’s new appointment over demoted officer",
    "summarized_story": "It was learnt that the directive was as a result of his quest to install Chima Igwe, a demoted official of FIIRO, as the agency’s director general.\nThe minister was said to have to stop the appointment of a substantive DG until Igwe was cleared.\nThe PUNCH had reported happenings at FIIRO since 2019 when Igwe was appointed the acting director general under controversial circumstances.\nThe minister, Onu, however, instructed the board to reinstate Igwe as the acting DG, a request that was rejected by the board Chairman, Alhaji Ibrahim Gwarzo.\nSeveral attempts by the board to begin the process of installing a substantive director-general were allegedly rebuffed by the minister."
  },
  {
    "headline": "Gumi’s shocking revelation: Army, police supply weapons to bandits",
    "summarized_story": "By Muhaimin OlowoporokuPopular Islamic cleric, Sheikh Ahmad Gumi has alleged that some police and army officers aid bandits in the country with weapons and drugs.\nHe said this in an interview on Thursday as he called on the army and police hierarchy to identify and flush out all the bad eggs.\n“Actually in Zamfara, there are some bad elements in the security but not all of them.\nA few percentage in our security are using the privilege advantage they have to aide bandits in gun running, drug distributions.\nThe Army however denied such claims after Gumi pointed fingers at them."
  },
  {
    "headline": "Oyetola: I didn’t stop severance package for Aregbesola’s loyalists",
    "summarized_story": "The government of Osun State led by Gboyega Oyetola has debunked rumours making the rounds that it withheld the severance package of some former political office holders in Councils to punish them.\nThe Osun government had recently announced the release of a severance package to former elected officers in local government councils, whose tenure ended February 5, 2021.\n“So, the case at hand has nothing to do with Ogbeni Rauf Aregbesola or Governor Gboyega Oyetola.\nIt is purely the policies that we have set out in the ministry that must be complied with.\nAttaching it to Aregbesola’s loyalists is deceptive, mischievous and deliberately designed to score cheap political points and gain undeserved sympathy”, the statement read in part."
  },
  {
    "headline": "Sheikh Gumi will set Nigeria on fire – Omokri",
    "summarized_story": "Reno Omokri, Special Assistant to President Goodluck Jonathan of Nigeria from 2011-2015, has said popular Islamic scholar, Sheikh Gumi would set Nigeria on fire.\nOmokri said this while reacting to Gumi’s comment on the Indigenous People of Biafra (IPOB).\nGumi had said herdsmen and bandits only abduct students for money while IPOB killed security operatives in the Southeast.\nGumi during an interview with Arise TV said: “IPOB is attacking the police, the army, Independent National Electoral Commission (INEC) and other government institutions; killing our men in service.\nGumi may set Nigeria on fire."
  },
  {
    "headline": "ESN Is Necessary As Long As Buhari Is Still The President Of Nigeria– Nnamdi Kanu",
    "summarized_story": "Mazi Nnamdi Kanu, the leader of the outlawed Indigenous People of Biafra, IPOB, has reiterated that the group’s security outfit, the Eastern Security Network, ESN, was formed to combat criminal elements while the entire country is insecure.\nESN after bandits, terrorists not security operatives – Nnamdi KanuHowever, the Biafra freedom fighters has repeatedly dismissed the claim, stating that IPOB and its security wing had not involved in any criminal activity.\nKanu insisted that the ESN was established to protect the Igbos from external forces, particularly the Fulani herdsmen who have several times clashed with farmers in the region.\nIn a tweet on his official Twitter handle on Wednesday night, Kanu restated that the security outfit “was created out of necessity” stating that it would continue to protect the Igbos from all forms of criminalities.\n“ESN will continue to protect Igbo people from the brutal attacks of terrorists, bandits and herdsmen”."
  },
  {
    "headline": "Protest: Senator Uba Demands N5bn For Damages, Threatens To Sue Heritage bank",
    "summarized_story": "Senator Andy Uba, a candidate in the upcoming governorship race in Anambra State, has vowed to sue Heritage Bank after a viral video showing its employees protesting outside his residence’s entrance.\nA video of bank employees protesting outside Uba’s residence a few days ago went viral, asking that he repay a loan he supposedly owed the bank.\nUba, reacting in a letter signed by his lawyer, Ahmed Raji, SAN, threatened to sue the bank, describing the actions of its staff as shameful and embarrassing.\nHe stated that the bank’s action was a mere campaign to smear his image as the APC governorship primary election for Anambra state draws closer.\nUba threatened to take the case to court if the bank refused to tender an apology with payment of N5b for damages to his name."
  },
  {
    "headline": "Hajj Cancellation: Ogun Returns Money To Intending Pilgrims",
    "summarized_story": "The Ogun State Government said that it has begun refunding money to intended pilgrims following the Saudi government’s cancellation of the 2021 Islamic pilgrimage.\nAccording to information obtained by NEWS DIRECT, this is in accordance with the directives of Nigeria’s National Hajj Commission (NAHCON).\nThe reimbursement of money for the 2020/2021 hajj fee has begun, according to the Ogun State Muslim Pilgrims’ Welfare Board.\nThe Executive Secretary of the Board, Alhaji Salau Babatunde, said in a statement that intending pilgrims seeking refund should visit the Board’s Secretariat, Block B Complex, Oke-Mosan, Abeokuta with evidence of payment receipts and other documents.\nHe assured all intending pilgrims not to panic over untoward rumours, saying their money was safe with the State government."
  },
  {
    "headline": "2023: Northern Youths Endorse Bauchi Gov, Bala Mohammed For President",
    "summarized_story": "The Northern Youths Leaders’ Forum (NYLF) backed Senator Bala Abdulkadir Mohammed, the governor of Bauchi State, as its presidential candidate on Wednesday, threatening to act against the governor’s future political interests if he declined.\nNYLF National President, Comrade Elliot Afiyo, revealed the Forum’s endorsement when he led other members on a courtesy visit to the governor at the Government House, Bauchi.\nThe group national president informed that Governor Mohammed emerged the Forum’s preferred presidential candidate for the 2023 presidential election at its 27th delegate conference in Yola, Adamawa State, where members voted to that effect.\n“Your Excellency, this Forum took interest in you when you defeated a sitting governor in the senatorial election in 2007.\nBauchi governor reaffirms commitment to good governance"
  },
  {
    "headline": "ACF to Ohaneze, Afenifere: Protect northerners in Southeast, Southwest",
    "summarized_story": "He said the ACF would soon convene a meeting with the other socio-cultural organisations to address challenges facing all parts of the country.\n“ACF wishes to assure that all Ibos who are living in the North are guaranteed their personal security.\nAnimal husbandry alone accounts for 6% of our Gross Domestic Product (GDP).\nIf animal husbandry is well harnessed it will save Nigeria, this large expenditure.\n“Nigerians are not aware that those involved in the business of animal husbandry are themselves victims of insecurity their cattle are often rustled and they are kidnapped for ransom too."
  },
  {
    "headline": "Attacks on schools: NSCDC releases survey on nationwide vulnerability",
    "summarized_story": "Following the spate of attacks and kidnapping of students in schools across the country, the Nigeria Security and Civil Defence Corps (NSCDC) has conducted a vulnerability survey of all schools in the country across the six geopolitical zones, states, senatorial districts and local governments.\nNSCDC Commandant General Dr Ahmed Audi stated this while briefing corps personnel at the National Headquarters Abuja on his policies and programs to reenergise the service.\nIn a statement released Wednesday in Abuja by Director, Public Relations, DCC Olusola Odumosu, said the Corps Female Squad unveiled recently had been deployed to patrol different schools to curtail the attack.\nThe statement said the CG also ordered all State Commandants to set up the female squad in all the 36 state commands and the Federal Capital Territory.\nI will make sure that all entitlements and operational allowances for the Rapid Response Squad, Female squad and any other assignments given to any personnel are paid so that we can prove to Nigerians that we are back again."
  },
  {
    "headline": "Breaking: Ronaldo, Benzema strike brace as Portugal, France, Germany book Euro 2020 Round 16 places",
    "summarized_story": "Both Cristiano Ronaldo and Karim Benzema produced a brace each to enable their countries – Portugal and France share honours, both top strikers converting from the spot (Ronaldo twice and Benzema once) during the final group matches on Wednesday night.\nRonaldo and Benzema were teammates at Real Madrid before the former moved to Juventus in Italy.\nIn the other fixture, Germany saved themselves from group phase exit with their second equaliser in the 84th minute through Leon Goretzka.\nAll three top sides in the “group of death” – France, Germany and defending champions Portugal – progress to the Round of 16.\nFrance will face Switzerland in the second round, while Germany take on England and Portugal challenge Belgium."
  },
  {
    "headline": "Insurgency: COAS task soldiers to redouble effort in Southeast -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS) Maj Gen Farouk Yahaya , has tasked troops in the Southeast to redouble their effort in order to consolidate on their successes in curtailing insurgency in the zone.\nThe COAS expressed delight in the successes so far recorded by the troops in the Southeast.\nGen Yahaya gave this task at Obinze Barracks, Owerri Imo state while addressing the troops during his maiden operational visit to Headquarters 34 Brigade.\nHe pointed out, that more successes would be recorded through compliance to instructions and loyalty to a superior authority.\nHe appreciated them for their spirit of jointness and synergy towards tackling insecurity in the state."
  },
  {
    "headline": "We would not condone reckless comments, Army replies Gumi -NigPilot",
    "summarized_story": "The Nigerian Army on Wednesday evening warned Sheik Ahmad Gumi to desist from reckless comment capable of causing disaffection or dampening the morale of troops as it would not condone such extreme comments.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu gave this warning in a statement in Abuja.\nHe said: “The Nigerian Army has just been alerted to a submission by Sheikh Ahmad Abubakar Gumi when he featured on ARISE TV Morning Show on Wednesday, 23 June 2021 alleging that the Nigerian Military is colluding with marauding bandits who have been responsible for various crimes and atrocities against Nigerians and the Nigerian state.\nIt is also necessary to reiterate that patriotism must be taken to a trajectory where subversive conversations on the state are brought to the barest minimum.\n“Opinion leaders are enjoined to demonstrate patriotism in building the peace, rather than being agents of distabilization, thereby aggravating the current security challenges facing the nation”."
  },
  {
    "headline": "NIN has no deleterious effect on JAMB’s financial base-Official -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB, has said that introduction of National Identity Number, NIN, as one of the requirements for 2021 Unified Tertiary Matriculation Examination, UTME has no deleterious effect on the financial base of the Board.\nThe Head Media, JAMB, Dr. Fabian Benjamin was reacting to a recent publication alleging that JAMB blames NIN requirement for revenue drops to N5.8bn.\nOn the contrary, the Board greatly appreciates the partnership with NIMC which has led to the inadvertent benefit of revealing the actual number of candidates registered annually.\nHe however said the introduction of NIN has helped in addressing one of the fundamental channels of perpetrating examination malpractice by way of multiple applications, among others.\nTherefore, the Board affirms its resolve not to ever compromise on the integrity of its processes on account of generating fat operating surpluses,” he said."
  },
  {
    "headline": "Senate may pass N895.8bn supplementary budget next week -NigPilot",
    "summarized_story": "Senate President, Dr. Ahmad Lawan, has hinted that the 2021 supplementary Appropriation Bill sent to the upper legislative chamber by President Muhammadu Buhari for approval may be passed next Tuesday.\nThe Supplementary Appropriation Bill of N895,842,465,917 passed the second reading in the upper legislative chamber following the presentation of the lead debate by the Senate Leader, Senator Yahaya Abdullahi during the plenary.\nPresident Muhammadu Buhari had on Tuesday, requested the Senate to consider and approves the supplementary budget to help fight insecurity and purchase vaccines in tackling COVID- 19 pandemic.\nIn line with the request, the Senate President, therefore, referred the Appropriation Bill sent by Buhari on June 15 to the Senate Committee on Appropriation, chaired by Senator Jibrin Barau (APC Kano North) and asked the committee to submit its report Tuesday next week.\nHe said that the 2021 Supplementary Budget was needed to fund defence, security and health-related expenditure."
  },
  {
    "headline": "Alleged Sexual Assault: Nollywood Actor Baba Ijesha Pleads Not Guilty",
    "summarized_story": "Nollywood actor, Olanrewaju Omiyinka, aka Baba Ijesha, has pleaded not guilty to the offence of sexually assaulting a minor.\nMr Ogala specifically asked the court to grant them an audience to argue the bail application.\nIn a short ruling, Justice Taiwo granted the request of the defense team and asked parties to argue the bail application.\nHe asked the court to grant the defendant bail on liberal terms.\nJustice Taiwo has stood the matter down to consider and write her ruling on the bail application."
  },
  {
    "headline": "Soludo Emerges APGA Governorship Candidate In Anambra",
    "summarized_story": "﻿Professor Charles Chukwuma Soludo has emerged as the governorship candidate for the All Progressives Grand Alliance in Anambra State.\nHe was announced as the winner on Wednesday night after the keenly contested primary held at the Professor Dora Akunyili Development Centre, Akwa, the state capital.\nProfessor Soludo, polled 740 votes, which represented more than 90 per cent of the votes cast, to defeat other candidates.\n“It is with humility, gratitude and total submission to the will of God that I hereby accept your nomination as the gubernatorial candidate of APGA in the November 6 governorship election,” he said as he gave an acceptance speech.\n“I want to thank the Alpha and the Omega, who in his infinite wisdom, decided that I should come from Anambra state of Nigeria."
  },
  {
    "headline": "Falana Faults FG, Says Decision To Meet With Twitter Should Have Come Earlier",
    "summarized_story": "﻿Senior Advocate of Nigeria, Mr Femi Falana, has faulted the Federal Government’s suspension of Twitter in Nigeria and its recent decision to hold talks with the company.\nSpeaking on Channels TV’s Politics Today on Wednesday, the SAN said the decision to meet should have been planned before the suspension was done.\n“The Federal Government meeting with Twitter is a good development but in many instances, they put the cart before the horse.\nThe Federal Government has since come under fire for its decision to ban the social media platform in the country both from citizens and the international community.\nBut on Tuesday, the ECOWAS Court of Justice joined the call to condemn the decisions."
  },
  {
    "headline": "Roof Leakage: No Money Released For Renovation Of National Assembly – Senate",
    "summarized_story": "The National Assembly has explained that no money was released for the renovation of the National Assembly complex.\nAlso, the lawmakers said the National Assembly and its leadership is not responsible for the maintenance and renovation of the National Assembly Complex and they have not received a sum of N37 billion or any amount for the renovation of the Complex.\nEven with this reduction, the sum of 9 billion or any amount is yet to be cash backed or released to the National Assembly.\nNone of this amount is even appropriated for the National Assembly bureaucracy or its leadership.\nIt must be reiterated that the National Assembly Complex is a National Monument which falls under the purview of control of the Federal Capital Development Agency."
  },
  {
    "headline": "Security Architecture: FG Will Copy Our Ideas When We Are Through – Makinde",
    "summarized_story": "While addressing the chairmen, Governor Makinde admonished them to step up their game on the issue of security and take responsibility for the security of their domains, saying, though security is the responsibility of everyone in the society, those in government will be held accountable.\nHe said: “There is a state Security Task Force, you can replicate that at the local government level.\nI can bet that by the time we are done grinding our security architecture, they will copy it at the national level in this country.\nSo, you have all contributed to putting the government at the state level there.\n“Some of the policies that we have, which are working at the state level, replicate them at the local government level."
  },
  {
    "headline": "Updated: Court to deliver ruling later today on Baba Ijesha’s bail application",
    "summarized_story": "Justice Oluwatoyin Taiwo of the sexual offences court in Ikeja has heard the bail application of Nollywood actor, Olanrewaju Omiyinka alias Baba Ijesha.\nHe added that the actor has been wrongly accused and is been tried on basis of suspicion.\nBut in her response, the director of public prosecution representing the state , urged the court to deny bail.\nShe adds that the court to be cautious in granting bail as the alleged offences are now rampant.\nShe also alleged that the defendant could jump bail as he is a popular personality and could interfere with the evidence."
  },
  {
    "headline": "Senator Ayogu Eze not suspended, says APC",
    "summarized_story": "The All Progressives Congress, APC has described as untrue, the reports in the media to the effect that it has suspended a former Enugu North senator, Ayogu Eze, saying there has been no such action.\nAPC Chairman in Enugu State, Ben Nwoye made this known at a news conference in Abuja.\nA letter was reportedly written to the national leadership of the party by Mr Nwokedi Ugwuoke accusing Ayogu Eze of anti-party activities and consequently announcing his suspension.\nThe APC State chairman noted that the party is currently enjoying unprecedented peace following the coming together of all their leaders to unify and strengthen the party in the state."
  },
  {
    "headline": "Sokoto contacts Akwa Ibom Govt to help locate mother of caged 12-year-old girl",
    "summarized_story": "Sokoto state government said it has contacted Akwa Ibom State government to help locate the mother of the twelve year old girl rescued after her aunty, Esther Emmanuel locked her in a cage for eight months in Sokoto Cinema area of Sokoto state.\nShe says, Sokoto state Commissioner for Women and Children affairs Kulu Abdullahi Sifawa has contacted her Akwa Ibom state counterpart with the aim of locating the mother of Joy, after surviving been locked in a cage for eight months.\nAdvertisementAccording to her, the girl was at the last Children party organised to celebrate the Children Day by the wife of Sokoto state governor.\nAccording to her, the Sokoto state government saw the need to reunite the girl with her mother even though Joy has indicated interest to stay back in Sokoto.\nTVCNEWS investigation, however discovered that Joy dropped out of school at primary five at the Yahaya Gusau Primary school, Offa road, Old Airport axis of Sokoto south local government area of Sokoto state."
  },
  {
    "headline": "US, EU Condemn ‘Extremely Worrying’ Tigray Airstrike – Arise News",
    "summarized_story": "The EU has called the incident “extremely worrying” in which civilians were “deliberately” targeted.\nThe Ethiopian military denies targeting civilians but has confirmed that their renewed military campaign against the Tigray People’s Liberation Front (TPLF), is aided by airstrikes.\nThe conflict in Tigray has been marked by accusations of abuses and atrocities.\nThe airstrike in Togoga is believed to have left dozens dead or injured.\nHundreds of thousands of people, according to aid agencies, remain unreachable due to the ongoing conflict, exposing them to severe food shortages."
  },
  {
    "headline": "UN: Northeast Nigeria Insurgency to Claim 1.1m Lives If It Continues Till 2030",
    "summarized_story": "The United Nations says more that 1.1million people may die in Nigeria’s northeast if conflict with Islamist insurgencies continues to 2030.\nThe United Nations Development Programme (UNDP) on Thursday said the conflict had already killed nearly 350,000 people as of the end of 2020.\n“Destruction and displacement have set back development in the region by decades, and continued conflict will only further scar the region,” the UNDP said.\n“The full human cost of the war is much greater,” the UNDP said in a report, released with Nigeria’s Ministry of Finance.\nNigeria’s war with Islamist insurgencies Boko Haram and Islamic State’s West Africa Province has spawned one of the world’s worst humanitarian crises, with millions of people dependent on aid."
  },
  {
    "headline": "Egypt Seeks New African Allies in Nile Dam Row",
    "summarized_story": "The past few years, however, has seen a dramatic re-engagement, in particular with the Nile Basin countries.\nThe keyword behind this foreign policy change is the controversial dam Ethiopia is building on the Blue Nile, known as the Grand Ethiopian Renaissance Dam (Gerd).\nCairo clearly wants to highlight the project as an example of its willingness to help development in the Nile Basin countries.\n“Security agreements with some of the Nile Basin countries such as Burundi, Rwanda or Uganda is a good thing, but will not give Egypt the clout it wants,” he writes.\nStrong trade links can achieve far more than military muscle, he argues, pointing to the minuscule trade Egypt has with all nine Nile Basin countries."
  },
  {
    "headline": "‘I Am Traumatised’: Britney Spears Speaks Out against Conservatorship in US Court Hearing",
    "summarized_story": "US pop star Britney Spears has spoken out against her conservatorship at a court hearing in Los Angeles.\n“I just want my life back.”Jamie Spears was granted control over his daughter’s personal and business affairs in a court-ordered conservatorship in 2008.\n“I want to end this conservatorship without being evaluated,” Spears told the court decisively in an emotional 20-minute address, calling the arrangement “abusive”.\nSpears’ conservatorship is split into two parts – one is for her estate and financial affairs, the other is for her as a person.\nBritney Spears catapulted to the top of global pop charts at 16 with her debut single …Baby One More Time."
  },
  {
    "headline": "One Million Copies: Last Apple Daily Newspaper Edition Sold Out Across Hong Kong",
    "summarized_story": "Across Hong Kong, people lined up early Thursday to buy the last print edition of the last remaining pro-democracy newspaper.\nBy 8:30 a.m., Apple Daily’s final edition of 1 million copies was sold out across most of the city’s newsstands.\n“Without Apple Daily, Hong Kong is less free than it was a week ago.\nThe forced closure by Hong Kong authorities “is a chilling demonstration of their campaign to silence all opposition voices,” Raab said.\nThey include media tycoon Jimmy Lai, who founded Apple Daily in 1995."
  }
]