[
  {
    "headline": "UPDATED: Consider students’ plight, call off strike, Buhari begs ASUU",
    "summarized_story": "on Thursday appealed to the Academic Staff Union of Universities to consider the plight of students and call off the ongoing strike.\nHe made the appeal at the 19th National Productivity Day and the conferment of the National Productivity Order of Merit Award to 48 eminent Nigerians and organisations in both the public and private sectors, for their high productivity, hard work, and excellence.\nThis was contained in a statement by his spokesman, Femi Adesina, titled, ‘At National Productivity Day Awards, President Buhari appeals to ASUU to call off strike’.\nHe added that his administration recognised that the future of any nation is contingent on the standard of its educational system.\n‘‘It will be difficult to improve our economic performance and overall productivity, without improving our educational system."
  },
  {
    "headline": "ASUU strike: Protests heat up in Ife as OAU students boo police",
    "summarized_story": "Men of the Nigeria Police Force had militarised the venue of the protesting students of Obafemi Awolowo University, Ile-Ife, Osun State.\nThe protest which began with barely a hundred students on Thursday morning had since grown into a mass movement on the Ife-Ibadan expressway.\nThe PUNCH could confirm the presence of policemen who were being booed out by the agitated students.\n“We are using this opportunity to say no to ASUU strike, we want FG to settle ASUU’s demands, that is all we are saying.\nA statement released on Thursday by the President of the Students’ Union Government, Akorede Afeez, stated that the protest would commence at Under Bridge, Oru, Ago Iwoye, Ogun State."
  },
  {
    "headline": "2023: Buhari didn’t ask Emefiele to resign — Presidency Source",
    "summarized_story": "By Idowu BankoleA source in the presidency has, Thursday, dismissed as untrue claims that Buhari has asked the CBN governor, Godwin Emefiele, to resign.\nReports making rounds in the media had alleged that the President, Muhammadu Buhari had given the CBN governor until Monday to tender his resignation letter.\nAlso Read:2023 presidency: Calls for Emefiele’s resignation laughable, made out of ignorance – Benue CoalitionBut, A source in the presidency, however, debunked the claims reported in the media as totally untrue.\nVanguard News Nigeria"
  },
  {
    "headline": "Amaechi has not resigned — Source",
    "summarized_story": "Reports alleging that the Minister of Transportation, Rotimi Amaechi has resigned have been debunked by a source close to the former River state Governor.\nAlso Read:2023 Presidency: Amaechi has shown commitment to serve Nigeria, says AyadeRecall Some online media (not vanguard) had reported that the Minister has resigned yesterday but the source close to Amaechi dismissed the reports describing them as unfounded and baseless.\nVanguard News Nigeria"
  },
  {
    "headline": "Jonathan and APC: Who is fooling who?",
    "summarized_story": "To that extent, he was the greatest enabler of the Muhammadu Buhari presidency.\nAlso Read:Reports alleging Jonathan gave sitting Gov N200m to buy APC form lies – Reno OmokriSo, Jonathan resurrected Buhari’s dead political career.\nIn the event that it becomes inevitable that power must rotate to the South after Buhari’s statutory eight years in office, they see in another Jonathan presidency the shortest route to power by 2027.\nBy acquiescing to this unholy alliance, Jonathan is pretending not to know that he will be shortchanging the entire South.\nJonathan may think he is fooling Nigerians, taking all for a jolly good ride, but truth be told, the joke is on him."
  },
  {
    "headline": "Diesel hike: Enugu govt increases waste evacuation contracts’ budget to enhance cleanliness",
    "summarized_story": "…Charges contractors to restore city to its enviable sanitary condition…Assures residents of improved serviceCommitted to ensuring that the enviable sanitary condition of Enugu city is restored, the Enugu State government has upwardly reviewed the terms of waste evacuation contracts with the waste disposal contractors in the state to ensure optimum hygienic condition of the city.\nA statement by the Special Adviser to the Governor on Information, Steve Oruruo, said the review was approved to compensate the contractors for the high operating cost occasioned by spike in cost of diesel, vehicle maintenance and labour, among others.\nIt was also to improve the capacity of the waste evacuation contractors to render top-notch service.\nWhile frowning at the declining state of the cleanliness of Enugu city, the state government consequently charged the waste evacuation contractors to urgently reverse the undesirable trend and restore the hitherto enviable sanitary condition of the city.\nIt assured the people of the state that a huge improvement in the cleanliness of the city will be witnessed shortly."
  },
  {
    "headline": "2023: Gombe Governor, Yahaya endorses Fayemi’s presidential ambition",
    "summarized_story": "…Says, he is the best of the restOmeiza Ajayi, AbujaGombe state Governor, Inuwa Yahaya, has pledged the support of his administration and the entire All Progressives Congress APC delegates from the state for the presidential ambition of Ekiti state Governor and Chairman of the Nigeria Governors Forum, Dr John Kayode Fayemi.\nMy brother Fayemi, you have our support because we are convinced that Nigeria needs you.\nI believe I have the education, the energy, the capacity and the knowledge to tackle these myriad of problems” the governor added.\nWhat Nigeria needs now are education, capacity, energy, experience which I have in abundance.\n“Nigeria needs a president who will make the Onitsha man feel comfortable in Sokoto and the Kano man to feel at home in Ibadan or Awka."
  },
  {
    "headline": "2023: CISLAC condemns cost of forms, marginalization of youths, women",
    "summarized_story": "Civil Society Legislative Advocacy Centre (CISLAC) has condemned the “marginalization” of youths and women ahead of the 2023 elections.\nExecutive Director, Auwal Rafsanjani spoke at a town hall meeting on Strengthening Accountability Among Civil Society (SANCUS) project in Keffi, Nasarawa.\nCISLAC and other non-governmental organizations called for more youth and women involvement in the democratic process.\nRafsanjani noted that with youths and women underrepresented in politics, an expensive political process “is a double jeopardy”.\nThe Transition Monitoring Group (TMG) chief said money politics is at the heart of the general crisis of democracy and governance in Nigeria."
  },
  {
    "headline": "We informed, lobbied Senate before we went on strike – ASUU lambasts Lawan",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has declared that it informed, lobbied and appealed to the Senate before it embarked on its strike.\nIt was gathered that the union, upon expiration of the 12 weeks strike, decided to extend the strike by another twelve weeks.\nOur correspondent gathered that the Senate President, Ahmed Lawan had earlier urged protesting students not to use their protest to disrupt political activities.\nAkinwole who condemned Lawan’s statement insisted that the union lobbied the National Assembly to prevent the strike.\n“The Union, ASUU, informed, lobbied and appealed to the Senate to avert the strike but they were not forthcoming."
  },
  {
    "headline": "BREAKING: ASUU strike: Call off, consider students – Buhari begs lecturers",
    "summarized_story": "President Muhammadu Buhari has appealed to the Academic Staff Union of Universities, ASUU, to end the lingering strike.\nBuhari urged ASUU to consider the plight of the students and called off the industrial action.\nThe President made the appeal at the 19th National Productivity Day Celebration and Conferment of National Productivity Order of Merit Award, held at the State House Conference Centre, Abuja.\nHe also urged the National Association of Nigerian Students, NANS, to exercise patience as the government tries to resolve the crisis.\nBuhari recalled his February 1 directive to His Chief of Staff, Ibrahim Gambari, the Ministers of Education and Labour and Employment, Adamu Adamu and Chris Ngige, respectively, to address the concerns of the striking aggrieved workers’ unions."
  },
  {
    "headline": "2023: You’ve betrayed South-East – Orji Kalu attacks Edwin Clark",
    "summarized_story": "Senator Orji Kalu has accused elder statesman, Edwin Clark of betraying the South-East and its quest for the 2023 presidency.\nNoting that Clark is a patriotic Nigerian, he said the Niger Delta leader’s “late hour” support for the South-East is suspicious.\nKalu said Chief Clark knows the South-East cannot get the ticket of any party in an open contest without a gentleman agreement.\nKalu said it would the shortest route for the South-East zone to produce the president “after 8 years instead of waiting for another 16 years”.\n“Nothing stops the South supporting only presidential aspirants from the South East."
  },
  {
    "headline": "Von der Leyen identifies two major reasons Russia is most direct threat to world order",
    "summarized_story": "Ursula von der Leyen, the president of the European Commission has identified two major reasons Russia is currently the most direct threat to world order.\nVon der Leyen said Russia is the most direct threat to world order because of its barbaric war against Ukraine and its worrying pact with China.\nVon der Leyen and Michel are in Tokyo for the 28th EU-Japan summit, during which their support for Ukraine was high on the agenda.\n“We believe that China must stand up to defend the multilateral system that it has benefited from in developing its country.\n“Those responsible for war crimes must be and will be brought to justice.”This is coming less than a week after the EU proposed a ban on Russian oil amid the ongoing war between Russia and Ukraine."
  },
  {
    "headline": "BREAKING: Buhari begs ASUU to call strike off",
    "summarized_story": "President Muhammadu Buhari has appealed to members of the Academic Staff Union of Universities (ASUU) to call off their strike in the interest of students.\nThe President made the appeal at the 19th National Productivity Day Celebration and Conferment of National Productivity Order of Merit Award at the State House Conference Centre, Abuja.\nASUU, in a statement on Monday, said since the President’s directive was issued, no meeting had been held to resolve the conflicts.\nASUU said failure of the government to show concern about its demands forced it to extend the three-month-old strike by another three months.\nThe President also appealed to the National Association of Nigerian Students (NANS), to exercise patience as government works to resolve the crisis."
  },
  {
    "headline": "2023 presidency slipping away from Southeast",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) from Abia State, Chief Sam Nkire, has lamented the 2023 presidency may elude the Southeast.\nNkire however said if the South East fails to get the ticket, it should be given to Senate President Ahmed Lawan from the Northeast.\nHe said: “After watching the body languages of the two leading political parties in the country, I came to the conclusion that none will give the presidential ticket to the Southeast in the next election“I have been a proponent of the Southeast Presidency and I have also been a proponent the Igbo presidency.\nI had also in the past urged my brothers in the Southeast to include our brothers in the South-South zone in the struggle just to ensure that the 2023 presidency never eluded the Igbo tribe”.\nNkire however believes the presidency is eluding the Southeast and in the event that the region loses out, “it should go to the President of the Senate, Lawan Ahmad who is from the North-East, another marginalized zone of Nigeria”."
  },
  {
    "headline": "I will protect Nigerians against terrorists, bandits",
    "summarized_story": "A former Senate President Bukola Saraki said he will protect every part of the country against terrorists and bandits if elected the next President.\nHe said the nation’s dependence on oil will end because non-oil sector will enjoy a leap.\nSaraki, who unfolded his agenda at a media breakfast session in Abuja, said enough of lamentation by Nigerians.\n“Indeed, we can be the generation that says, ENOUGH TALK, ENOUGH LAMENTATION, ENOUGH BLAMING EACH OTHER — THIS IS TIME FOR ACTION.\nThis is the time for real work, this is the time to fix our Nigeria, and to make Nigeria work for all Nigerians.”"
  },
  {
    "headline": "Umahi appoints five new commissioners, aides",
    "summarized_story": "Ebonyi Governor David Umahi has forwarded five commissioner-nominees to the Assembly for screening on Thursday.\nHe said: ” Engr David Nweze Umahi, Governor of Ebonyi State has forwarded to Ebonyi State House of Assembly, his list of nominees for appointment as Commissioners”.\nThe trio left the People’s Democratic Party(PDP) and joined the APC around the time Umahi became Governor in 2015.\nThe Governor also endorsed his Commissioners, family members and followers who moved with him to the APC from the PDP for National and State Assembly positions.\nThe nomination and imminent appointment of the three old APC members as commissioners is seen as further steps by the governor to mend fences with the old APC members in the State."
  },
  {
    "headline": "Quit order: How Buhari shocked ministers at FEC",
    "summarized_story": "Ministers were caught napping yesterday shortly before the end of the Federal Executive Council (FEC) meeting.\nThis follows President Muhammadu Buhari’s bombshell that ministers eyeing political offices, who have obtained nomination forms, must resign.\nNo fewer than 10 ministers are affected by the directive to resign latest on Monday.\nPresident Buhari was said to be uncomfortable with the accusations of conflict of interest levelled against the ministers by notable and well-meaning Nigerians.\nNwajiuba reportedly incurred the wrath of other ministers vying for offices for provoking the President to ask them to resign."
  },
  {
    "headline": "Breaking: Buhari begs ASUU to call off strike",
    "summarized_story": "From Juliana Taiwo-Obalonye and Adanna Nnamani, AbujaPresident Muhamadu Buhari has appealed to Academic Staff Union of Universities (ASUU), to consider the plight of the students and called off the strike.\nThis is even as he has also appealed to National Association of Nigerian Students (NANS), to exercise patience as government navigate ways to resolve the crisis.\nHe made the appeal at the 19th National Productivity Day Celebration and Conferment of National Productivity Order of Merit Award, held at the State House Conference Center, Abuja.\nASUU had in statement on Monday, said since the President’s directive was issued, no meeting had been held by the concerned officials to resolve the conflicts.\nASUU said failure of the government to show concern about its demands forced it to extend the three-month-old strike by another three months."
  },
  {
    "headline": "2023: I’m not a betrayer, Kalu replies Clark",
    "summarized_story": "Clark, had in a media report, erroneously labeled Kalu a betrayal and claimed that he was not in support of South East presidency.\nKalu said: “I have great respect for Chief Edwin Clark.\n“What did you say or do when all the aspirants from South South and South West were buying forms to run against South Easterners who have always supported them .\n“I know some people want us to keep quiet and then allow other Southerners take turn of South East.\nNothing stops the South supporting only presidential aspirants from the South East ."
  },
  {
    "headline": "Fallen container kills 1, other injured in Lagos",
    "summarized_story": "A fallen container has crushed a yet-to-be-identified man to death at COSTAIN Roundabout in Lagos State.\nAlso, the incident, which happened at about 11.30pm on May 11, left a female passerby with a broken leg and other injuries.\nAccording to eye witnesses, the yet-to-be-identified adult male and female were passing by when the incident involving the 40ft container uploaded from the articulated vehicle and crushed the adult male to death instantly, leaving the adult female with severe injuries that included a broken left leg.\n“Unfortunately, the container fell on an adult male and adult female.\n“The deceased adult male body has been bagged and handed over to the State Environmental Health Monitoring Unit, SEHMU, for further action."
  },
  {
    "headline": "Resign now, Buhari orders CBN Governor",
    "summarized_story": "President Muhammadu Buhari has ordered the Governor of the central Bank, Godwin Emefiele to resign from the position as the number one banker in Nigeria, over his intention to run for president in the upcoming general elections.\nThe president’s directive came via a circular on Thursday which directed multiple categories of public officeholders seeking different elective positions in the 2023 general elections to resign now and concentrate on their endeavours.\nMr Emefiele as the head of CBN is captured in the circular, according to two permanent secretaries interviewed by Peoples Gazette.\nHe has filed a lawsuit asking a federal judge to declare him suitable to run for president while serving as CBN governor.\nIt was unclear whether or not President Muhammadu Buhari had the powers to order Mr Emefiele’s resignation or dismissal because the CBN Act emphasises the independence of CBN from external influence, though President Goodluck Jonathan suspended Lamido Sanusi as CBN governor in 2014."
  },
  {
    "headline": "Finally, PDP dumps zoning, moves for consensus in choice of candidates",
    "summarized_story": "The Peoples Democratic Party (PDP) has finally sounded a death knell on zoning, throwing the contest for its presidential ticket open to all aspirants.\nThe opposition party also indicated preference for consensus in the choice of its candidates where possible.\nThe opposition party reaffirmed May 28 and 29 as dates for its presidential primary.\nThe CBN is the custodian and keeper of all INEC sensitive materials used in all elections.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood."
  },
  {
    "headline": "Breaking: FG Issues Circular, Orders Ministers, Heads of Agencies, Ambassadors, Other Appointees Nursing Political Ambitions to Resign",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Federal Government has issued a circular directing serving ministers in the cabinet, heads of government agencies, ambassadors and other political appointees of the administration, nursing political ambitions in 2023 to resign from the government.\nNo.SGF/OP/l/S.3/Xll/173, a copy which was sighted by THISDAY, was issued by the Secretary to the Government of the Federation, Mr Boss Mustapha.\nAlso all ambassadors are to hand over to their Deputy Heads of Mission or the most Senior Foreign Service Officer in line with established practices.\n“For the avoidance of doubt, this directive affects all Ministers, Heads and Members of Extra-Ministerial Departments, Agencies and Parastatals of Government, Ambassadors as well as other political appointees who desire to contest for elective offices.\nAmbassadors shall hand over to their Deputy Heads of Mission or the most Senior Foreign Service Officer in line with established practices."
  },
  {
    "headline": "At Last, PDP NEC Throws Presidential Ticket Open, Recommends Consensus",
    "summarized_story": "Before the NEC, PDP stakeholders had met at the Benue State Governor’s Lodge at 10 am, but no resolution was reached and the meeting was adjourned for further consultation.\nBut before the NEC and BoT meetings, it was agreed to adopt zoning in subsequent elections, and, due to time factor, the presidential ticket of the party should be thrown open.\nThe NEC and BoT, therefore, urged the party to work towards a consensus candidate, if possible.\nHowever, the party should work towards a consensus candidate where possible,” the NEC said, even as it adopted the zoning committee report.\nHouse of Representatives Minority Leader, Ndudi Elumelu, said the array of credible, competent and experienced statesmen as PDP presidential aspirants, had unsettled the failed, corrupt and rejected All Progressives Congress (APC)."
  },
  {
    "headline": "Concerns Mount over N’Assembly’s Amendment of Electoral Act to Boost Lawan’s Chances",
    "summarized_story": "Analysts easily point to what happened to the previous electoral bill where they reached an understanding with the president to amend after signing the amended Electoral Act only for the lawmakers to renege.\n” Curiously, none of the numerous office holders, to which the section of the Electoral Act is targeted has shown interest in the matter.\nThe resultant effect is that the action before the lower court is liable to be struck out and is accordingly struck out.\nThey cannot be modified through subordinate or inferior legislation like the Electoral Act.\n“In that case, the law would remain as it is in the Electoral Act, meaning that political appointees cannot vote or be voted for during primaries”."
  },
  {
    "headline": "2023: Nwajiuba, Onu, Akpabio Resign Following Buhari’s Directive",
    "summarized_story": "Other ministers affected by the presidential directive, who were yet to resign included Minister of Transportation, Rt.\nOn their part, Onu and Akpabio, it was also gathered, submitted their letters of resignation to the Secretary to the Government of the Federation, Boss Mustapha.\nBut presidential spokesman, Mallam Garba Shehu, in another interview, said the president’s directive to the ministers was with immediate effect.\n“He told them to follow the example of Minister of State for Education, Nwajiuba, who purchased form and tendered his resignation.\nThe president said anybody who bought form to contest any elective position, excluding the vice president, should immediately resign and face his ambition."
  },
  {
    "headline": "Breaking: Buhari Orders Ministers Who Have Political Ambition to Resign",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has given all ministers interested in vying for any elective position in 2023 up till Monday, May 16, 2022 to resign.\nInformation and Culture Minister, Alhaji Lai Mohammed, disclosed this to newsmen after the Federal Executive Council (FEC) meeting at the State House, Abuja.He said the President directed all ministers with political ambition to turn in their letters of resignation by next Monday.Those affected are Ministers of Transportation, Rotimi Amaechi; Niger Delta, Godswill Akpabio; Labour and Employment, Chris Ngige; Science, Technology and Innovation, Ogbonnaya Onu; Minister of State for Education and Emeka Nwajiuba; who have joined the presidential race on the platform of the All Progressive Congress (APC).Others are the Minister of State for Mines and Steel, Uche Ogar, who is running for governorship position in Cross Rivers State; Abubakar Malami, who is gunning for Kebbi governorship; the Minister of Women Affairs, Paulline Tallen, who declared her ambition to contest for the senatorial seat in Plateau State.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Jonathan Finally Joins Ruling APC In Bayelsa Ward, Set To Recontest For President",
    "summarized_story": "President Goodluck Jonathan has formally defected to the ruling All Progressives Congress (APC) in a bid to recontest for President in 2023.\nThis comes hours after disowning a nomination form purportedly procured for him by a northern group.\nJonathan lost to the incumbent, President Muhammadu Buhari in 2015 as a member of the Peoples Democratic Party (PDP).\nAccording to the source, some of the African leaders told Jonathan that Nigeria was passing through challenging times and in need of \"a unifier like Jonathan at this time’’.\n“And upon purchasing the form, Jonathan alerted Buhari."
  },
  {
    "headline": "Jonathan Finally Joins Ruling APC In Bayelsa Ward, Set To Recontest For President",
    "summarized_story": "President Goodluck Jonathan has formally defected to the ruling All Progressives Congress (APC) in a bid to recontest for President in 2023.\nThis comes hours after disowning a nomination form purportedly procured for him by a northern group.\nJonathan lost to the incumbent, President Muhammadu Buhari in 2015 as a member of the Peoples Democratic Party (PDP).\nAccording to the source, some of the African leaders told Jonathan that Nigeria was passing through challenging times and in need of \"a unifier like Jonathan at this time’’.\n“And upon purchasing the form, Jonathan alerted Buhari."
  },
  {
    "headline": "BREAKING: Buhari Orders Central Bank Governor, Emefiele, Other Appointees To Resign Over Political Ambition",
    "summarized_story": "), has ordered all heads of agencies, departments, parastatals, and ambassadors with political ambitions to resign.\nThis comes after the President on Wednesday directed ministers with political ambitions to also resign.\nA circular obtained by SaharaReporters on Thursday morning shows that the office of the Governor of the Central Bank of Nigeria, Godwin Emefiele, among other agencies was copied.\nThe circular with reference number SGF/OP/ I/S.3/XII/ 173 was titled, ‘Ministers, heads of government agencies, ambassadors and other appointees with political ambitions to resign’.\nSaharaReporters also reported that though not a cabinet member, Godwin Emefiele, governor of the Central Bank of Nigeria (CBN) might also be affected by the presidential order."
  },
  {
    "headline": "BREAKING: Buhari Orders Central Bank Governor, Emefiele, Other Appointees To Resign Over Political Ambition",
    "summarized_story": "), has ordered all heads of agencies, departments, parastatals, and ambassadors with political ambitions to resign.\nThis comes after the President on Wednesday directed ministers with political ambitions to also resign.\nA circular obtained by SaharaReporters on Thursday morning shows that the office of the Governor of the Central Bank of Nigeria, Godwin Emefiele, among other agencies was copied.\nThe circular with reference number SGF/OP/ I/S.3/XII/ 173 was titled, ‘Ministers, heads of government agencies, ambassadors and other appointees with political ambitions to resign’.\nSaharaReporters also reported that though not a cabinet member, Godwin Emefiele, governor of the Central Bank of Nigeria (CBN) might also be affected by the presidential order."
  },
  {
    "headline": "‘Every Lie Has An Expiry Date’, Sowore Knocks Jonathan Over Initial Denial Of APC Presidential Moves",
    "summarized_story": "Human rights activist, Mr Omoyole Sowore, has decried the defection of Former Nigerian President, Dr Goodluck Ebele Jonathan, from the Peoples Democratic Party (PDP) to the ruling All Progressive Congress (APC).\nSowore, a presidential aspirant on the platform of the African Action Congress (AAC), described the situation as an age-long denial of the truth by metaphorically relating it to a quote from a German philosopher, Arthur Schopenhauer.\nHe said in a tweet on Thursday, \"Every Lie Has An Expiration Date!\n“ME: \"All truth passes through three stages.\n@GEJonathan joins Janjaweed APC @OfficialAPCNgME: â\u0080\u009cAll truth passes through three stages."
  },
  {
    "headline": "'You're betraying south-east' -- Edwin Clark tackles Orji Kalu for supporting Lawan's presidential bid",
    "summarized_story": "Edwin Clark, an elder statesman, has tackled Orji Uzor Kalu, chief whip of the senate, for allegedly betraying the south-east by supporting the presidential aspiration of Senate President Ahmad Lawan.\nHe said supporting Lawan who is from the north-east is the shortest route for the south-east to produce a president.\nBut in a statement on Wednesday, Clark said south-east leaders should punish all those who try to betray the region.\nAdvertisement“I first heard of senator Orji Uzor Kalu, many years ago, when he was an active student of University of Maiduguri, in the north-east,” he said.\nNothing stops the south supporting only presidential aspirants from the south-east."
  },
  {
    "headline": "'You're betraying south-east' -- Edwin Clark tackles Orji Kalu for supporting Lawan's presidential bid",
    "summarized_story": "Edwin Clark, an elder statesman, has tackled Orji Uzor Kalu, chief whip of the senate, for allegedly betraying the south-east by supporting the presidential aspiration of Senate President Ahmad Lawan.\nHe said supporting Lawan who is from the north-east is the shortest route for the south-east to produce a president.\nBut in a statement on Wednesday, Clark said south-east leaders should punish all those who try to betray the region.\nAdvertisement“I first heard of senator Orji Uzor Kalu, many years ago, when he was an active student of University of Maiduguri, in the north-east,” he said.\nNothing stops the south supporting only presidential aspirants from the south-east."
  },
  {
    "headline": "Buhari begs ASUU to call off strike, asks students to be patient",
    "summarized_story": "President Muhammadu Buhari has appealed to the Academic Staff Union of Universities (ASUU) to consider the plight of students and call off the ongoing strike.\nThe president also called on the National Association of Nigerian Students (NANS) to exercise patience as the federal government works on resolving the crisis.\nBuhari made the appeal on Thursday at the 19th National Productivity Day Celebration at the state house conference centre, Abuja.\nAdvertisementBut in a statement issued on Monday, ASUU extended the industrial action by another 12 weeks.\nThe union had said since the president issued the directive, no meeting had been held by the concerned officials to resolve the crisis."
  },
  {
    "headline": "Buhari begs ASUU to call off strike, asks students to be patient",
    "summarized_story": "President Muhammadu Buhari has appealed to the Academic Staff Union of Universities (ASUU) to consider the plight of students and call off the ongoing strike.\nThe president also called on the National Association of Nigerian Students (NANS) to exercise patience as the federal government works on resolving the crisis.\nBuhari made the appeal on Thursday at the 19th National Productivity Day Celebration at the state house conference centre, Abuja.\nAdvertisementBut in a statement issued on Monday, ASUU extended the industrial action by another 12 weeks.\nThe union had said since the president issued the directive, no meeting had been held by the concerned officials to resolve the crisis."
  },
  {
    "headline": "Nothing will stop PDP from taking over power in 2023, says Ayu",
    "summarized_story": "Iyorchia Ayu, national chairman of the Peoples Democratic Party (PDP), says the party is working hard to win the presidential election in 2023.\nThe PDP chairman said members are working “around the clock” to reposition the party and hold a successful presidential primary.\nAdvertisement“We are not only getting more united, but we are also getting more determined to work hard and reclaim power.\n“Everybody is working hard.\n“We are all very well mobilised towards various congresses and national convention, and ultimately, the 2023 general election,” he said."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "Does Nigeria have too many fintech startups? What the numbers say",
    "summarized_story": "Share this article:There are at least 150 fintech startups in Nigeria, depending on who you ask.\nStatista reports that there were 144 fintech startups as of 2021 and a 2020 McKinsey report puts the number of standalone fintech startups at over 200.\nConsequently, it is not unusual to hear comments on the proliferation of fintech startups in the country, which begs the question, are there too many fintech startups in Nigeria?\nWhile the United States has 8,775 fintech startups for its 334.6 million people, the United Kingdom has 1,600 fintech startups serving 68.5 million people.\nLooking at the numbers, one could say that we need at least 1,000 more fintech startups in the country."
  },
  {
    "headline": "How do you create connections?",
    "summarized_story": "Also, Chimgozirim discussed this in today’s episode of the Techpoint Africa Podcast.\nIf you don’t recall that, I believe you should remember the report Intelligence by Techpoint, Techpoint Africa’s data and research arm, issued last Wednesday.\n🧐The report shows the breakdown of the $1.3 billion raised by YC-backed African startups — with 51 from Nigeria — details of featured startups, and other information.\nThis time, Emmanuel wants us to consider how YC is changing the game for African startups.\nThe company intends to collaborate with numerous regulatory agencies to create a world-class data security framework for Africa."
  },
  {
    "headline": "[PODCAST] Fintech bonanza",
    "summarized_story": "In today’s edition of the Techpoint Africa Podcast, we decided to weigh in on the debate about Africa having too many fintech startups.\nStill, on fintech, we talk about why buy now pay later (BNPL) services could be bad for young people.\nIt was a fintech podcast as we closed the discussion with the new developments on eNaira.\nFrom paying bills to USSD enabled transactions, we discuss the upsides and downsides of the eNaira upgrade.\nYou can catch all these insightful discussions on the Techpoint Africa Podcast available on all Podcast platforms, including Spotify, Apple Podcasts, and Google Podcasts."
  },
  {
    "headline": "5 Organisations providing ‘Tech’ and ICT solutions for SMEs in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nSMEDANSmall and Medium enterprise development agency of Nigeria commonly known as SMEDAN, organizes e-business and empowerment training for young entrepreneurs across Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Leofied unveils workforce platform to transform $20bn freelance market.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:This week, Leofied announced the launching of the biggest freelance platform in Africa To strengthen commerce and the workforce across Africa.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Buhari asks heads of agencies, CBN Gov; envoys, others eyeing politics to leave",
    "summarized_story": "President Muhammadu Buhari has asked all Ministers, heads and members of extra-ministerial departments, Agencies and parastatals of the government, ambassadors as well as other political appointees who desire to contest for elective offices to resign on or before Monday, May 16.\nThe president gave the order in a two-paged letter seen by BusinessDay Wednesday, signed by Boss Mustapha, secretary to the government of the federation.\n“Ambassadors shall hand over to their deputy heads of mission or the most senior foreign service officer in line with established practices.\n“Similarly, heads of extra-ministerial departments, agencies and parastatals are to hand over to the most senior director/officer as may be peculiar in the organisation in line with the service wide circular No.\nSGF.50/S 11/C.2/268 of 4th December 2017.”The categories of senior government officials who must now leave because of involvement in partisan politics has been broadened to include heads of government agencies like the central bank governor and ambassadors."
  },
  {
    "headline": "International Nurses Day: Nigeria can’t keep nurses it needs",
    "summarized_story": "Despite huge taxpayers’ money spent yearly on 285 schools of nursing and midwifery across Nigeria, the country has failed to keep the nurses it needs amid growing competition in the international nursing labour market.\nToday, the International Nurses Day is being observed to mark the contributions that nurses make to society, with the theme ‘Nurses: A Voice to Lead – Invest in nursing and respect rights to secure global health’.\nAbout 8,241 Nigerian nurses worked in the UK’s National Health Service in 2019.\nFrom April to September 2021, more than 10,000 new international nurses were registered in the UK, including 1,300 from Nigeria.\nNurses make an essential contribution to all components of primary health care and are frequently the highest level provider, on the frontline, providing primary care services."
  },
  {
    "headline": "Gaping Apapa potholes hurt businesses despite N2.3tn Customs revenue",
    "summarized_story": "The ports in Lagos, namely Apapa, Tin-Can, and PTML, generated over N1.588 trillion last year in Customs revenue, according to official figures.\nPort users lamented that despite the huge revenue, the government failed to repair the potholes on Ijora-Wharf Road and others.\nThe road, port users say, ought to be the only exit from Apapa and Tin-Can Island Ports, following the protracted construction work on Apapa-Oshodi Expressway.\nSegun Demola, a staff of one of the terminals in Apapa Port, said that leaving Apapa at night on a daily basis had become a huge challenge for him and his colleagues.\nHe recalled how his colleague’s car was vandalised and robbed by street robbers at that bad portion of Ijora Road last week."
  },
  {
    "headline": "Obaseki intensifies ongoing construction of Edo agric hub – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government will sustain investment in the agriculture sector in a renewed effort to attain food sufficiency, drive job creation and improve livelihoods.\nThe governor, who spoke to journalists in Benin City, said his government has intensified ongoing construction of the Edo Agricultural Development Hub, reassuring timely completion of the projectThe Edo State Commissioner for Agriculture and Food Security, Mr. Stephen Idehenre, who spoke on behalf of the governor, said the government has also completed the construction of an input warehouse to support agricultural production at the Edo Agricultural Development Hub.\nHe noted that the ongoing construction work on the Edo Agricultural Development Hub comprises administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others.\n“We have also established a Mechanization Hub, and purchased tractors and Harvesters to boost agricultural production and reduce drudgery.”“In addition to these programmes, we are making progress with the construction of the Edo Agricultural Development Hub.\nThe hub will house the administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others,” he added."
  },
  {
    "headline": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti election – Nigerian Observer",
    "summarized_story": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti electionShare FacebookTwitterStumbleuponLinkedInPinterestChairman of the Independent National Electoral Commission, INEC, Prof. Mahmood Yakubu has said the on-going continous voters registration exercise nationwide will be ending soon.\nAccording to the chairman, the ongoing Continuous Voter Registration (CVR) exercise will be ending on the 30th June 2022.\nThese Regulations and Guidelines, together with the Constitution and the Electoral Act, constitute the electoral legal framework that govern the conduct of elections.\n“There are many progressive provisions of the Electoral Act 2022 which require clear understanding to guide implementation.\n“Section 54(2) of the Electoral Act makes provision for assistive materials for Persons with Disabilities (PWDs)."
  },
  {
    "headline": "Gov Obaseki committed to special, inclusive education – Edo SUBEB – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Stakeholders in the special education sector have chatted a roadmap with a view to making education available and accessable to every child irrespective of their disability and location in Edo state.\n“His Excellency is absolutely committed to special and inclusive education”, Salami said while describing the workshop as “timely”.\nExecutive Director of NAPVID, Barr Melody Omosah expressed appreciation to the governor for his administration’s partnership with the organization.\nAccording to Omosah, inclusive education is the core of inclusive governance hence NAPVID is working closely with the state government to ensure the mainstreaming of appreciable numbers of persons with disabilities into the public service is achieved.\n“I want to thank Mr governor for the partnership and we are over confident that this will be sustained throughout his term."
  },
  {
    "headline": "Ossiomo Power Company alerts on forceful shut down of gas facility by NGMC – Nigerian Observer",
    "summarized_story": "Ossiomo Power Company alerts on forceful shut down of gas facility by NGMCShare FacebookTwitterStumbleuponLinkedInPinterestOssiomo Power Company has reported a forceful shut down of its gas facility by the Nigeria Gas Marketing Company (NGMC), a subsidiary of the Nigerian National Petroleum Company (NNPC).\nA statement signed by Adeyinka Ladejobi on behalf of the company said the situation has been escalated to the right quarters in order to resolve the matter.\nAccording to him, “We apologize for this unannounced outage.\nThis outage is as a result of a forceful shut down of our gas plant by NGMC without any notice.\n“The situation has been escalated accordingly and we shall keep you posted."
  },
  {
    "headline": "2023: Buhari orders heads of parastatals, agencies, others to resign before Monday",
    "summarized_story": "President Muhammadu has ordered all government officials contesting political offices to resign before Monday.\nMr Mustapha’s letter was addressed to ministers, heads of agencies, parastatals and departments.\n“For the avoidance of doubt, ths drectve affects all Ministers, Heads and Members of Extra-Ministerial Departments, Agencies and Parastatals of Government, Ambassadors as well as other political appointees who desire to contest for elective offices.\nAmbassadors shall hand over to these Deputy Heads of Mission or the most Senior Foresgn Service Officer in fine with estabéshed practices.\n“Similarly, Heads of Extra-Mirestenal Departments, Agencies and Parastatals are to hand over to the most senior Director/Officer as may be peculiar to the organization, in line with the service wide Circular No."
  },
  {
    "headline": "2023: We know things about Jonathan that you don’t know – Buhari’s aide to ex-president’s supporters",
    "summarized_story": "Bashir Ahmad, aide to President Muhammadu Buhari has told supporters of former president, Goodluck Jonathan, that he knows more about the former president’s plans for 2023 than they do.\n“When I shared the news of former President Jonathan joining our party, his uninformed supporters insulted me saying that can never happen even in the wildest dream,” Ahmad said.\nThey should know that we know something they don’t know and not everything plan and execute on social media.\nHe said, “I think the person you people should be asking the question is the national chairman of the party.\nAsk the national chairman if he has granted him a waiver.”The state APC chairman, however, described Jonathan as “a big fish and an elder statesman”."
  },
  {
    "headline": "Container crushes two in Lagos, one dead on the spot",
    "summarized_story": "The container fell on two individuals, an adult male and an adult female, but while the male died on the spot, the female was dragged out alive.\nLASEMA Permanent Secretary, Dr. Olufemi Oke-Osanyintolu, said the adult female rescued alive sustained severe injuries that included a broken left leg.\nAccording to him, the deceased adult male body has been bagged and handed over to the State Environmental Health Monitoring Unit for further action.\n“Unfortunately, the container fell on an adult male and adult female.\n“The deceased adult male body has been bagged and handed over to the State Environmental Health Monitoring Unit, SEHMU, for further action."
  },
  {
    "headline": "Airtel Nigeria makes N304bn in revenue from data services in two months",
    "summarized_story": "Telecom service provider, Airtel Nigeria has made N304 billion ($734 million) from data services alone between March and April of 2022 in revenue driven by data consumption by subscribers.\nThe figure represents a 41.1 per cent jump in data revenue in comparison to the N227.4 billion ($549 million) the firm made in the same period the year before.\nThe statement from the company said its subscribers increased their consumption from 2.8GB to 4.0GB in the period under review.\nIt shows that the consumption of data by Nigerians has spiked over the last year.\nThe company stated that its data subscriber base has expanded over the past year as it grew by 14.9 per cent while the data Average Revenue also jumped by 37.6 per cent."
  },
  {
    "headline": "Osasu Walks Down The Aisle With Heartthrob, Nate",
    "summarized_story": "Osasumwen Igbinedion recently walked the down the aisle with her heartthrob, Nathaniel Joshua Ogwuche.\nOsasumwen and Nathaniel were joined in holy matrimony at New Estate Baptist Church, Gudu in the Federal Capital Territory (FCT), Abuja.\nApril 16, 2022 witnessed a love-filled atmosphere for Osasu and Nate, as their families, friends and acquaintances gathered to bear witnessto the solemnization of their love.\nThe highpoint of the event came when the officiating minister pronounced them husband and wife with these words: “These are no longer two but one.\nWhat therefore God has joined together, let no man put asunder."
  },
  {
    "headline": "The Age of Social Media: Friend or Foe?",
    "summarized_story": "but now thanks to the explosion of technology, especially social media, information even about strangers in another continent is now available at the click of a button.\nToday’s society fortunately and unfortunately is largely dependent on social media, not just for information gathering but for socialising, exploring, learning, bullying, intimidation, exposure and more.\nWhile social media is generally about creating wholesome personal influences to immense extents, we are here to see if it’s truly a friend or foe.\nThe older generation see social media as a friendly foe of sorts: friendly, because it allows a wider reach; foe, because clothing these days is suddenly barely even recognised as strips of clothing.\nSocial media helps in tourism promotion and in focusing on best practices for interacting with consumers."
  },
  {
    "headline": "Lagos Water Corporation Closes Bid For Water Supply Project",
    "summarized_story": "Confirming the latest intervention measures of the government to LEADERSHIP, the Group Managing Director and Chief Executive Officer, GMD/CEO, of the Lagos Water Corporation, Engr.\nThe GMD, explained that the Baruwa water issue was escalated because the available boreholes sank previously were shallow wells which could not guarantee hygienic drinking water.\nGovernor Sanwo-Olu, has however, expressed readiness of his administration to improve the water supply needs of residents towards achieving universal access to safe water by 2030.\nThe Governor who highlighted the challenges of achieving sustainable water supply at the second edition of the annual International Water Conference, organised by Lagos state Water Regulatory Commission, LASWARCO, noted that Lagos State Water Corporation produces 210 million gallons per day, MGD, against the daily water demand estimate of 540 MGD.\nThe figure showed a clear deficit of over 300 MGD, which translates to less than 40 per cent of the population having access to clean and safe water."
  },
  {
    "headline": "2023: I Am Confident Of Victory, Says Sanwo-Olu",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu has expressed optimism about his chances of being reelected by the Lagos electorate in the 2023 general election in the state, saying he is very confident of victory at the polls.\nHe added that his administration is committed to the delivery of real dividends of democracy in all aspects of life to all Lagos residents.\n“We know where we are as a nation, but Lagos continues to remain safe and secure.\nIt gave us the opportunity to redouble our efforts and ensure that people can feel us meaningfully in all areas.\nWe have improved our health infrastructure and the number of health practitioners that we have in all of our health institutions."
  },
  {
    "headline": "Oyetola Felicitates With Aliyah, Winner Of Microsoft Office Competition",
    "summarized_story": "Governor Adegboyega Oyetola of Osun State has felicitated with a student of City of Knowledge Academy, Ijebu-Ode, Aliyah Adunola, on her emergence as one of the National winners of the Microsoft Office Specialist competition in Nigeria.\nMiss Aliyah an indigene of Osun State recently emerged as one of the national winners of the Microsoft Office Specialist competition in Nigeria.\nThe governor in a statement by his chief press secretary, Ismail Omipidan, on Wednesday congratulated the student for being among those who qualify to represent Nigeria in the United State of America for the world championship.\nWhile commending Aliyah for her feat at the PowerPoint 2016, Oyetola said she indeed displayed the ethos and brilliance of an ‘Omoluabi’ in the competition and that he would be willing to meet Aliyah and her parents soon.\nThe governor said the role of technology and Information, Communication and Technology (ICT), in basic education cannot be overemphasised, adding that “no one can deny the impact technology continues to have on almost every aspect of our daily lives”."
  },
  {
    "headline": "BREAKING: Nigerian Army Arrests Soldier Selling Multi-million Naira Ammunition To Bandits In Zamfara",
    "summarized_story": "A Nigerian soldier attached to the Forward Operations Base (FOB) in Galadi, Shinkafi Local Government Area of Zamfara State has been arrested for selling ammunition and military uniforms to armed bandits in the state.\nNews Direct Reporters gathered that the soldier identified as Bala Nura (19NA/78/3870) was arrested by the military police on Wednesday.\nSources said Nura confessed to selling 100 rounds of 7.62mm special each to the terrorists at the rate of N100,000.\nHe was also caught with 1,000 rounds of the same ammunition which he promised to sell the gunmen for N1 million.\n“ARREST OF SUSPECTED SLDRS SELLING AMMO TO BANDITS."
  },
  {
    "headline": "2023: Buhari’s Aide Confirms Jonathan Now APC Member",
    "summarized_story": "President Muhammadu Buhari’s aide, Bashir Ahmaad has confirmed Goodluck Jonathan’s defection to the All Progressives Congress, APC.\nBashir made the confirmation in a post via his Twitter page on Thursday while responding to those who doubted his earlier prediction that the former President will defect to the ruling party.\nHis tweet read: “When I shared the news of former President Jonathan joining our party, his uninformed supporters insulted me saying it can never happen even in the wildest dream.\nSources confirmed that the former President was at Adamu’s residence to seek assurance of the APC before he could decamp from the Peoples Democratic Party, PDP, to the ruling party.\nSources privy to their discussions told News Direct that although the APC Chairman welcomed the former President to the ruling party, there was absolutely no assurance that he could be handed the party’s presidential ticket."
  },
  {
    "headline": "BREAKING: 2023: Buhari Orders Emefiele, Heads of Agencies, Ambassadors, Others To Resign",
    "summarized_story": "The Federal Government has directed serving ministers in the cabinet, heads of government agencies, ambassadors and other political appointees with political ambitions in 2023 to resign from the government.\nAll ministers affected are to hand over to ministers of state where they exist or to the permanent secretary.\nAmbassadors are to hand over to their Deputy Heads of Mission or the most Senior Foreign Service Officer in line with established practices.\n“Similarly, Heads of Extra-Ministerial Departments, Agencies and Parastatals are to hand over to the most senior Director/Officer as may be peculiar to the organisation, in line with the service wide Circular No.\nMustapha added that the contents of the circular and the incidental directives take effect immediately."
  },
  {
    "headline": "2023: Buhari Extends Resignation Order To Other Appointees",
    "summarized_story": "President Muhammadu Buhari has ordered all political appointees in his administration to resign if they want to run in the 2023 elections.\nThe president announced the order in a circular released by Boss Mustapha, the secretary to the federal government, on Wednesday night (SGF).\nThe president’s order came just hours after another instructing ministers to quit by May 16.\n“For the avoidance of doubt, this directive affects all ministers, heads and members of extra-ministerial departments, agencies and parastatals of government, ambassadors, as well as other political appointees who desire to contest for elective offices.\n“Ambassadors shall hand over to their deputy heads of mission or the most senior foreign service officer in line with established practices."
  },
  {
    "headline": "Marubutan ‘online’ na fuskantar ƙalubale – Khadija Nanerh",
    "summarized_story": "Tana daga cikin marubutan adabi na yanar gizo (online) da tauraruwar su ke haskawa, sakamakon irin salon rubutun da take yi da suka shafi tarbiyya da zamantakewa.\nA zantawarta da wakilin Blueprint Manhaja, Marubuciya Nanerh ta bayyana burin ta da yadda take hangen makomar harkar rubutun adabi a nan gaba.\nWacce riba marubutan ‘online’ suke samu daga labaran da suke sakewa ta waya, kuma wanne ƙalubale ke tattare da hakan?\nWato irin yadda masu bibiyar littattafai na suke min godiya da yadda wasu labaran da nake yi suke sauya musu rayuwa.\nBangon littafin ‘Daren Aurena’Wacce alaqa ke tsakanin ki da sauran marubuta, maza da mata, da ke ba da gudunmawa a wannan harka?"
  },
  {
    "headline": "Kotu ta yi fatali da hukuncin soke Sashe na 84 (12) na Dokar Zaɓe",
    "summarized_story": ""
  },
  {
    "headline": "Sin ta bada gudunmawar rigakafin Sinovac da kayayyakin lafiya ga Benin",
    "summarized_story": ""
  },
  {
    "headline": "Kamfanin Huawei ya bai wa matasan da suka kammala karatun jami’a a Habasha damarmaki a fannin fasahohin zamani na ICT",
    "summarized_story": ""
  },
  {
    "headline": "Kwara to create new five satellite towns",
    "summarized_story": "By Kayode AbdulazeezChairman, Ilorin Master Plan Working Committee, Abdulmutalib Shittu yesterday disclosed that the new Ilorin master will create new five satellite towns to take care of the growing population in the metropolis and environs.\nHe also said that the next 28 days will provide an avenue for further consultation aimed to contribute to and shape development of the Ilorin city master plan.\nThe strategic master plan covers an area just under 2,000 kilometre square and provides a 20 year vision for the future of Ilorin.\nFor one, the capital city is getting a master plan for the second time since the creation of Kwara State in 1967.\nWe are glad to be offering the state its second-ever master plan."
  },
  {
    "headline": "TRCN seeks NASS review of laws to strengthen regulatory powers",
    "summarized_story": "By Ngozi NwankwoAs part of efforts to strengthen its regulatory powers, the Teachers Registration Council of Nigeria, TRCN, on Wednesday, disclosed that it has approached the National Assembly for amendment to the Act establishing the Council to change its name to Teachers Regulatory Council of Nigeria.\n“Part of things we are looking forward to in the future is a change in the name of the Teachers Registration Council of Nigeria to the Teacher Regulatory Council of Nigeria; it’s the same TRCN.\nActually, the idea behind that is that when you hear about the teachers’ registration council, people normally think that the function of TRCN is limited to registration of teachers.\nIt’s the Teachers’ Regulatory Council that would actually capture the essence of what we do at the level of TRCN.\nAjiboye noted that the teaching profession is the major driver of the educational system as teachers are the determinant of quality education in any country."
  },
  {
    "headline": "N1.8bn debt: AMCON takes over Aeroland Travels’ assets",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE Asset Management Corporation of Nigeria said it had taken over assets belonging to Aeroland Travels Limited, and its directors over indebtedness of N1.8bn.\nOsiagor of the Federal High Court, Lagos Division.\n4C Maye Ogundana Street, Magodo Lagos; No.\n10 Oluyomi Oshinkoya Street, Magodo Residential Scheme, Lagos; Plot 8, Block 66, Residential Scheme, Sangisha, Lagos; No.\nThe statement said, “AMCON had purchased the non-performing loan of Aeroland Travels Limited from Polaris Bank (formerly Skye Bank) in 2018."
  },
  {
    "headline": "Kano, Calabar free trade zones remains FG’s economic approach to industralisation_ NEPZA DG",
    "summarized_story": "By Eunice OrikeManaging director ,Nigeria’s export Processing Zones Authority NEPZA’s , Adesoji Adesugba has said the planned concession of the country’s two public free trade zones remains the federal government’s best economic approach to accelerate Nigeria’s industrialisation agenda.\nThis was disclosed in a statement by NEPZA’s spokesman Martins Odey during a roadshow for the concession of the two zones in Lagos.\nThe event was organised by the National Council on Privatisation through its secretariat, Bureau of Public Enterprises BPE, with the Ministry of Industry, Trade & Investment and NEPZA.\nIt was aimed at further attracting investors and their sundry partners to take up the ownership of the zones.\nThe minister pointed out that the decision to privatise them hinged on the government’s preparedness to produce world-class free zones that the country could use to solve some of its economic challenges."
  },
  {
    "headline": "50 Women Begin Training on natural organic products, others in Anambra",
    "summarized_story": "By Tony Oraeki, AwkaThe National Directorate of Employment,NDE, has commenced training for 50 women on natural organic products,Beads/Stones Works and perfumery making as a source of economic empowerments.\n” So, the training strategy was tailored to ensure that women are not trapped in poverty.” She noted.\nShe further said that the training conformed with the programme of women employment branch of NDE which focused on increasing women’s skills, both vocational and entrepreneurial, increase their decision making power and access to economic resources.\nUfelle reiterated that similar training is taking place in the the 36 states of the federation and promised that more training will come before the end of the year.\nHowever, the State Coordinator equally thanked the Director General of the NDE, Mallam Abubakar Nuhu Fikpo for approving the trainings and facilitating their take off across the country."
  },
  {
    "headline": "Consider Students’ Plight And Call Off Strike, Buhari Appeals To ASUU",
    "summarized_story": "President Muhammadu Buhari has appealed to the Academic Staff Union of Universities (ASUU) to consider the plight of students and call off its ongoing strike.\nHe made the appeal at the 19th National productivity day and conferment of the National Productivity Order of Merit award held on Thursday.\nBuhari’s appeal came two days after the union extended its industrial action, accusing the government of unwillingness to address its demands.\nDuring Thursday’s event at the State House, President Buhari conferred the 2019/2020 awards on 37 individuals and 11 organizations.\nREAD ALSO: Buhari Orders FEC Members With Political Ambitions To ResignSo far, three-hundred and eighty-two individuals and 97 organizations have been awarded since the ceremony began in February 1991."
  },
  {
    "headline": "SGF Directs Emefiele, Heads Of Agencies, Others With Political Ambition To Resign",
    "summarized_story": "The Secretary to the Government of the Federation (SGF), Boss Mustapha, has directed the Central Bank Governor, Godwin Emefiele, ambassadors, heads of agencies, and other government appointees with political ambition to step down.\nIn a circular issued on Wednesday, the directive affected the CBN Governor who is among the heads of extra-ministerial departments.\nThe SGF noted that those affected should hand over to the most senior persons next to them.\nNine ministers, who are seeking political offices, both at the federal and state levels, were affected.\nMinister of State for Education, Emeka Nwajiuba, was the first to resign, hours after the President’s directive."
  },
  {
    "headline": "Finland Will Join NATO ‘Without Delay’ – President, PM",
    "summarized_story": "“Finland must apply for NATO membership without delay,” President Sauli Niinisto and Prime Minister Sanna Marin said in a joint statement.\n“NATO membership would strengthen Finland’s security.\nAs a member of NATO, Finland would strengthen the entire defence alliance,” the statement said.\n“Joining NATO would not be against anyone,” Niinisto told reporters on Wednesday, amid Russian warnings of consequences if Helsinki were to seek membership.\nForeign Minister Pekka Haavisto said on Tuesday he believed Finland could be a full NATO member “at the earliest” on October 1."
  },
  {
    "headline": "[UPDATED] PDP NEC Dumps Zoning, Throws Contest For Presidential Ticket Open",
    "summarized_story": "The National Executive Council (NEC) of the Peoples Democratic Party (PDP) has opted to throw the contest for its presidential ticket open rather than zone it to a particular region of the country.\n“After a very extensive deliberation, NEC aligned with the recommendation of the PDP National Zoning Committee that the presidential election should now be left open.\nWe restate our demand to the Economic and Financial Crimes Commission (EFCC) to investigate all APC Presidential aspirants in this regard.\nAfter a very extensive deliberation NEC aligned with the recommendation of the PDP National Zoning Committee that the Presidential Election should now be left open.\nThey kicked against the reports that the zoning committee had recommended an open contest for the top post, arguing that doing so would be deemed unjust and must be rescinded."
  },
  {
    "headline": "COVID-19 Deaths In Europe Pass Two Million Mark – WHO",
    "summarized_story": "The number of people who have died from Covid-19 in Europe, the long-time epicentre of the pandemic, has passed two million, the World Health Organization (WHO) said Thursday.\n“A devastating milestone has passed as reported confirmed Covid-19 deaths from countries in the WHO European Region have exceeded more than 2 million people,” the UN health agency said in a statement."
  },
  {
    "headline": "BREAKING: PDP abandons zoning, throws open 2023 presidential ticket -",
    "summarized_story": "The People’s Democratic Party has left it’s presidential ticket open to all aspirants from different zones.\nThe party has also appointed former Senate President David Mark as the chairman presidential convention Committee, while Ifeanyi Okowa is appointed as the Deputy of the committee.\nThis was announced at the end of its 96th National Executive Committee meeting at the party’s Secretariat in Abuja.\nThe NEC meting was attended by former Senate Presidents, David Mark and Bukola Saraki, State governors, Board Of Trustees and NEC members."
  },
  {
    "headline": "Ex-Ondo lawmaker, Akindele Adeniyi submits nomination form",
    "summarized_story": "The former lawmaker representing Akure North State constituency in the Ondo State House of Assembly, Akindele Adeniyi has submitted the expression of interest and nomination forms at the party secretariat.\nAdeniyi is seeking to represent his people again on the platform of the All Progressives Congress.\nAddressing reporters after submitting the forms, Adeniyi expressed confidence that he would emerge as the party’ s flagbearer.\n“I am loved by my people and that is why they decided to purchase nomination and expression of interest forms for me.\nThe House of Assembly aspirant appreciated Governor for promising to create a level playing field for all the aspirants."
  },
  {
    "headline": "Akpabio resigns as Niger Delta Minister to pursue ambition",
    "summarized_story": "Niger Delta Affairs Minister Senator Godswill Akpabio has resigned in line with President Muhammadu Buhari’s directive.\nThe President during the Federal Executive Council (FEC) meeting ordered all cabinet members eyeing elective offices to quit before May 16.\nThe Minister of Niger Delta Affairs, Obong Godswill Akpabio was a former Two Term Governor of Anambra State as well as a Senator represnting the State in the National Assembly.\nHe was a former member of the opposition Peoples Democratic Party and defected to the ruling party in 2018 in his hometown in Akwa Ibom State.\nhttps://www.tvcnews.tv/purplegold/post.php?post=196953&action=edit#He lost his bid for a return to the National Assembly in the 2019 Election and was later appointed the Minister of Niger Delta Affairs by President Muhammadu Buhari."
  },
  {
    "headline": "Ngige says he is in no hurry to resign -",
    "summarized_story": "Nigeria’s Minister of Labour and Employment, Senator Chris Ngige says he’s not in a rush to leave office.\nSenator Chris Ngige was reacting to President Muhamadu Buhari’s directive that all ministers seeking for any elective office in 2023 should drop their letter of resignation.\nSenator Ngige a former Governor of Anambra State is a Presidential aspirant on the Platform of the All Progressives Congress.\nHe told ministers who have declared their presidential ambition to resign before Monday 16th of May.\nThe issue of the refusal of Political appointees at the Federal Level to resign has been a controversial one."
  },
  {
    "headline": "Finland Seeks NATO Membership ‘Without Delay’",
    "summarized_story": "The decision by the two Nordic countries to abandon the neutrality they maintained throughout the Cold War would be one of the biggest shifts in European security in decades.\nThey are the two biggest EU countries that had stayed out of NATO, and Finland’s 1,300-km (800-mile) border will more than double the frontier between the U.S.-led alliance and Russia, putting NATO guards a few hours’ drive from the northern outskirts of St Petersburg.\n“Finland must apply for NATO membership without delay,” President Sauli Niinisto and Prime Minister Sanna Marin said in a joint statement in Helsinki.\n“We hope that the national steps still needed to make this decision will be taken rapidly within the next few days.”Five diplomats and officials told Reuters that NATO allies expect both countries to be granted membership quickly, paving the way for increased troop presence in the Nordic region to defend them during a one-year ratification period.\nThe announcement came even as Russia’s war in Ukraine was hitting another turning point, with Ukrainian forces driving Russian troops out of the region around the second largest city Kharkiv, their fastest advance since forcing Russia to withdraw from the capital and northeast more than a month ago."
  },
  {
    "headline": "Nigeria Insists on Right to Produce Head of West African Gas Authority",
    "summarized_story": "RelatedStories No Content AvailableNigeria’s federal government has insisted that it wasn’t in breach of any part of the treaty setting up the West African Gas Pipeline Authority (WAGPA) by the selection of a Nigerian to head the organisation.\nWAGPA is an international institution established by the treaty on the West African Gas Pipeline (WAGP) Project signed by the Heads of States of the Republics of Benin, Ghana, Nigeria and Togo.\nHe called for the understanding of member nations, urging them to stick to the rules setting up the body.\n“ But if section 4(2) of Article IV of the Treaty is to the effect that Nigeria is qualified, then, there need not to be further objection against what section 4(2) of Article IV of the Treaty plainly stated,” he argued.\nShe affirmed that she was aware of the sentiments that over-regulation could bring discouragement and be counterproductive , but said that the regulations fashioned out for WAGP Project were amendable where they become counterproductive."
  },
  {
    "headline": "Former Nigeria President Jonathan Appointed to Board of European Council on Africa, Middle East",
    "summarized_story": "RelatedStories No Content AvailableNigeria’s former President, Dr. Goodluck Ebele Jonathan has been appointed to the international advisory board of the European Corporate Council on Africa and the Middle East (ECAM Council).\nOther members of the Advisory board are: Tony Blair, former British Prime Minister, José Manuel Barroso, former President of the European Commission, Nayef Falah Al-Hajraf, Secretary General GCC Gulf Cooperation Council and Amani Abou-Zeid, Commissioner for Infrastructure and Energy at the African Union Commission (AUC).\nIt quoted a letter from ECAM Council to the Office of Jonathan informing him of the appointment to have stated: “For your information, the Chairman of ECAM Council Dr. Kamel Ghribi is well acquainted with Dr. Goodluck Ebele Jonathan.\nEvery year in Italy, ECAM Council hosts a summit, in cooperation with The European House – Ambrosetti.\nFrancis Sardauna in Katsina"
  },
  {
    "headline": "UNICEF Decries 18.5 Million Out-of-School Children in Nigeria – Arise News",
    "summarized_story": "The United Nations Children Fund (UNICEF), Chief of Field Office, Kano, Rahama Farah has expressed concern over the prevailing statistics of out-of-school children in Nigeria, saying the country has 18.5 million out-of-school children.\nHe explained that out of the 18.5 million out-of-school children in the country, over 10 million were girls which represents 60 per cent.\nFarah spoke on Wednesday, during a media dialogue on girls’ education under the Girls’ Education Project 3 (GEP3) funded by the Foreign, Commonwealth and Development Office of the UK and implemented by UNICEF.\nHe, however, said with the interventions of UNICEF, government and other development partners, 1.4 million girls now have access to education in northern Nigeria.\nAccording to him, “Currently in Nigeria there are 18.5 million out of school children, 60 per cent of these out of school children are girls – that is over 10 million girls are out of school“Most importantly you will need to know that the majority of these out-of-school children are actually from northern Nigeria."
  },
  {
    "headline": "Nigerian Ministers Nwajiuba, Onu, Akpabio Resign Following Buhari’s Directive to Appointees with Political Ambitions",
    "summarized_story": "Other ministers affected by the presidential directive, who were yet to resign included Minister of Transportation, Rt.\nBut presidential spokesman, Mallam Garba Shehu, in another interview, said the president’s directive to the ministers was with immediate effect.\nShehu, who spoke in Hausa after the cabinet meeting, said, “The president has given a directive to ministers who purchased nomination forms to contest for the presidency.\n“He told them to follow the example of Minister of State for Education, Nwajiuba, who purchased form and tendered his resignation.\nThe president said anybody who bought form to contest any elective position, excluding the vice president, should immediately resign and face his ambition."
  }
]