[
  {
    "headline": "Naira will fall from N570/$1 to N400/$1 at black market if… – CBN ex-deputy gov, Moghalu",
    "summarized_story": "Moghalu had deputised Sanusi Lamido Sanusi, who was CBN Governor from June 2009 to February 2014.\n), and the CBN Governor, Godwin Emefiele.\nThe downward trend of the naira had fueled calls for the sacking or resignation of the CBN Governor, Godwin Emefiele, by some political groups including the Peoples Democratic Party.\nThey blamed Emefiele, who has been CBN governor since June 2014, for poor monetary policies.\nThe CBN ex-deputy governor, however, lamented that the CBN has lost its autonomy to the political class and has little or no investors’ confidence."
  },
  {
    "headline": "Tanker drivers protest in Niger, block Bida roads",
    "summarized_story": "There is palpable tension in Bida town in Niger state as tanker drivers blocked all the major exits in the town and prevented motorists from going in and out of the town.\nAll the major roads within the town have been blocked by the tanker drivers to protest the deplorable condition of the bad roads in the state, especially Bida-Lapai-Lambata Road.\nDue to the development, hoodlums now extort commercial motorcyclists as they charge between N20 and N50 before they are allowed access to the minor roads left by the tanker drivers.\nThe situation, especially in the Esso area of Bida Town, is alarming as all vehicles stand still without movement.\nResidents of the town have called on the State Governor, Abubakar Sani Bello, to, as a matter of urgency, intervene before the situation gets out of hand."
  },
  {
    "headline": "Auto Draft",
    "summarized_story": "Adeyeye at a sensitization campaign in Nnewi, Anambra State on Thursday, warned that drug abuse, drug misuse, addictions and self-medication are all injurious to public health and wellbeing.\nShe also warned that drug abuse is also trying to decimate the youth population aside from fueling the insecurity stressing that even housewives are not left out.\nYou need to ask valid questions and when children come back from school, check their bags and also observe the peer group or friends of your children, it is very important,” Prof. Adeyeye advised.\n“Most of the nefarious activities being committed by criminal elements, drug abuse is at the heart of it.\nThis, Prof Adeyeye said, showed that there is a critical problem of drug abuse in Nigeria, a reason why NAFDAC is intensifying its campaign against drug abuse with the community to community campaign."
  },
  {
    "headline": "Akwa Ibom assembly passes resolution against jungle justice",
    "summarized_story": "The Akwa Ibom State House of Assembly has passed a resolution against jungle justice in the state.\nThe motion, which was presented by Hon Asuquo Nana, the member representing Ikono State Constituency, was informed by the increasing cases of jungle justice in the state.\nNana in the motion tagged “Rising Cases of Jungle Justice in Akwa Ibom State: Urgent Need to End the Menace,” described jungle justice as a “form of arbitrary extrajudicial killing where a suspected criminal is humiliated, beaten or summarily killed by a crowd,” lamenting that the practice has been on the increase in the state in recent years.\nHe added, “Jungle justice has thrived in the state due to the inability of law enforcement agencies to deliver truthful service to meet the yearnings of the people.”The House, therefore, resolved as follows: “The Commissioner of Police and other security agencies should investigate incidences of jungle justice in Akwa Ibom State, most especially the one at Okpokpo market in Ikot Oku Ikono with a view to arresting and bringing the perpetrators to book.\n“Ministry of Information and Strategy, as well as the Ethical and Attitudinal Reorientation Commission (EARCOM) should sensitize the minds of the youths to shun violence and jungle justice.”The House also implored security and relevant agencies of government to keep watch and ensure that jungle justice is eliminated totally by ensuring that they do their jobs without fear or favour."
  },
  {
    "headline": "Nigerian govt issues security alert ahead of October 1",
    "summarized_story": "The Nigerian government has alerted the general public to heightened security activities preparatory to the country’s 61st Independence anniversary.\nThis was contained in a statement released in Abuja on Friday and signed by Segun Adeyemi, Special Assistant on Media to the Minister of Information and Culture, Alhaji Lai Mohammed.\nThe Minister advised residents of the Federal Capital Territory and its environs not to panic and go about their legitimate activities.\nHe urged residents to report any suspicious movement to the relevant security agencies.\n”Residents are enjoined to report suspicious persons and movements to the security agencies through the following numbers: 09-6305396, 08031230631, 08032003557 and 122,” the statement added."
  },
  {
    "headline": "Buhari to address UN General Assembly amid protest",
    "summarized_story": "President Muhammadu Buhari is set to address the 76th Session of the high-level General Debate of the UN General Assembly at the UN headquarters in New York on Friday.\nHowever, in a four-minute video that emerged online, some protesters stormed New York, where the United Nations meeting is ongoing to state their demands.\nMeanwhile, Buhari would deliver his address around 9 am (around 2 pm Nigerian time) to other world leaders during the morning session.\nBuhari has participated in some bilateral meetings with a number of leaders of other countries’ delegations and heads of International Development organisations.\nThe Nigerian leaders also held a bilateral meeting with Her Majesty, Maxima Zorreguieta, Queen of The Netherlands and participated in a hybrid High-Level event, tagged “Transformative Actions for Nature and People”."
  },
  {
    "headline": "Ohanaeze condemns Army officer’s dehumanization of NYSC member",
    "summarized_story": "Ohanaeze Ndigbo has expressed anger over the maltreatment of Ezeiruaku Ifenyinwa Fidelia, a National Youth Service Corps (NYSC) member in Cross River.\nNwabueze said the incident placed the integrity and public relations principles of the army before the court of public conscience.\n“No matter the height of provocation, Anele crossed the red line of decorum and decency expected of an officer of that level”, Nwabueze noted.\nArmy spokesman, Brigadier General Onyema Nwachukwu, said the officer’s behaviour was against established precepts of discipline.\nThe General urged the public to continue to report abuses to Human Rights Desks in all Army formations."
  },
  {
    "headline": "No going back on mega protest at UN Headquarters – Yoruba Nation, others",
    "summarized_story": "The grand finale of the march coincides with the ongoing UN Assembly where President, Muhammadu Buhari, is expected to address the 76th Session of the UN General Assembly on Friday.\nAkintoye in a statement, on Thursday, made available to The Nation by NINAS Director of Communications, Maxwell Adeleye, accused the Federal Government of sponsoring a counter-protest at the United Nations Headquarters tomorrow.\nHe alleged that the Nigerian Government has started hiring black foreigners living in the United States of America with $500 per head to stage a Pro-Buhari and One Nigeria March opposite the United Nations Headquarters.\nAkintoye vowed that the will of the people would prevail no matter how the Federal Government tries to scuttle the NINAS Grand Finale March.\nAll the indigenous people of the South and Middle-Belt in the United States and Canada have been urged to troop out in large number tomorrow."
  },
  {
    "headline": "Banishment: Sanusi’s suit for judgment Nov 30",
    "summarized_story": "By Eric Ikhilae, Abuja• Kano, DSS urge court to dismiss case- Advertisement -The Federal High Court in Abuja will on November 30 deliver judgment on a suit by deposed Emir of Kano, Sanusi Lamido Sanusi, challenging his banishment to Awe in Nasarawa State.\nSanusi was deposed after a resolution by the Kano State Executive Council on March 9, 2020, for alleged insubordination.\nHe was confined to Nasarawa until his release on March 13, 2020, following an interim order by Justice Anwuli Chikere of the Federal High Court in Abuja.\nJustice Chikere fixed November 30 after entertaining the final arguments from lawyers representing parties in the fundamental rights enforcement suit.\nHe noted that the instrument conveying the ex-Emir’s banishment was authored and endorsed by an official of the Kano State government in the state."
  },
  {
    "headline": "Blocking of terrorism funding yielding results, says Fed Govt",
    "summarized_story": "Agency Reporter• Malami: fresh charges likely against Yoruba Nation agitator IgbohoTerrorists are in for a shock: their sources of funding are being blocked, the Federal Government has said.\nAttorney-General of the Federation and Minister of Justice Abubakar Malami (SAN) attributed the success recorded so far in the battle against insurgency to the crippling of terrorism financing.\nHe also hinted at the possibility of filing fresh charges against Yoruba Nation agitator Sunday Adeyemo, popularly called Igboho.\nAccording to him, an “aggressive” investigation is being conducted that is “positively” impacting the fight against terrorism in the country.\n“We have also blocked the leakages associated with the funding and then embarking on an aggressive investigation that is indeed impacting positively in terms of the fight against terrorism."
  },
  {
    "headline": "Lagos: VAT claim is about fiscal federalism",
    "summarized_story": "The state said VAT collection would neither impoverish other states nor would the process be cumbersome.\nAlso yesterday, Akwa Ibom State Governor Udom Emmanuel said states were entitled to collect VAT.\nMinister of Finance, Zainab Ahmed, yesterday asked all taxpayers to continue remitting VAT to the Federal Inland Revenue Service (FIRS).\nHe backed his Rivers and Lagos states counterparts, Nyesom Wike and Babajide Sanwo-Olu, both of whom have signed their VAT bills.\nBut for states saying they do not need VAT, maybe they do not know the hidden treasure in VAT."
  },
  {
    "headline": "FG has identified, blocked terrorist financiers -Malami – The Sun Nigeria",
    "summarized_story": "The Federal Government has blocked terrorism financing, identified and detained “high profile individuals” responsible for funding terrorists’ activities in the country, Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami, told the News Agency of Nigeria (NAN) in New York.\nThe AGF had announced in May that government was about to begin the prosecution of about 400 suspected Boko Haram financiers and profiling some high-profile Nigerians strongly suspected to be financing terrorism for prosecution.\n“We have succeeded in identifying those that are responsible for funding terrorists.\n“You can see visibly that we are indeed witnessing tremendous successes associated with the Boko Haram, which translate to significant decimation of the Boko Haram terrorists.\n“They (Boko Haram) have been decimated to a larger extent and you can see what is unfolding as far as the North West banditry activities are concerned."
  },
  {
    "headline": "Collection of VAT by FIRS remains –FG",
    "summarized_story": "The Federal Government has said the Federal Inland Revenue Service (FIRS) would continue to collect Value Added Tax (VAT) following the ruling of the Court of Appeal on the matter.\nFIRS had been locked in a legal tussle over VAT collection with Rivers and Lagos states governments after they enacted laws decentralising the collection of the consumption tax.\nHe said it was FIRS that had been collecting the VAT before the dispute arose over which the Rivers government approached the High Court.\nSo with that in mind, the Federal Government has succeeded in obtaining an order that establishes the sustenance of the status quo, which status quo is that the Federal Inland Revenue Service should continue collection.\n“This is pending the determination of the cases that were instituted by states, particularly the Rivers State Government and the Lagos State government."
  },
  {
    "headline": "The Sun Award’ll motivate me to do more –Gov Buni",
    "summarized_story": "The Yobe State Governor, Alhaji Mai Mala Buni, has said The Sun Award, which he will receive next month, will serve as an impetus to render more selfless service to the country and humanity.\nGov Buni, who is also the National Chairman of the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC), will on October 16, 2021 receive The Sun Political Icon award for 2020 along with 22 others, who will receive various awards.\n“This award will certainly be a booster for me to scale up the achievements, both as National Chairman of APC’s CECPC and the governor of Yobe State.\nAbove all and as I said earlier, I thank The Sun management.”Explaining the situation of things in his state, Buni said: “As you all know, Yobe is one of the worst hit states, devastated by the Boko Haram insurgence.\n“As a peacemaker and stabilising voice, you have constantly met party leaders, party groups and interests; to accommodate all in the APC fold."
  },
  {
    "headline": "Agents of govt paying $500 per head to black Americans to stage pro-Buhari’s march –Akintoye",
    "summarized_story": "From Oluseye Ojo, IbadanThe Nigerian Indigenous Nationalities Alliance for Self-Determination (NINAS) has accused the Federal Government of paying black Americans $500 per head to stage a pro-Buhari and ‘one Nigeria march’ opposite the United Nations (UN) Headquarters in New York.\nNINAS had commenced its ‘million-man freedom march’ opposite the UN Headquarters on September 14, the day the UN General Assembly commenced its 11-day 76th session.\nThe grand finale of the march has been fixed for today, when President Buhari will address the 76th Session of the UN General Assembly (UNGA).\nAkintoye alleged that an unnamed top Nigerian government official and a popular Lagos journalist were hired to pay foreigners of African descent to masquerade as “One Nigeria” protesters to counter the NINAS march.\nSovereignty belongs to the people.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "FG may file fresh charges against Igboho",
    "summarized_story": "The Federal Government may file a fresh action against Yoruba secessionist agitator, Sunday Adeyemo (also known as Sunday Igboho), following the judgment of Oyo State High Court which awarded N20 billion in damages in his favour.\nThe Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, told the News Agency of Nigeria (NAN), in New York, that the federal government had the right to appeal the judgement or file a fresh charge.\nHowever, Malami said the position of the federal government on the judgment was about “law and jurisdiction.\nAs far as this matter is concerned, which court is it that has the jurisdiction to determine it?\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Against Mood of the Nation, PDP Retains Chairmanship in South",
    "summarized_story": "What transpired in the committee meeting and ultimately, its outcome is seen as mission accomplished for norther members with presidential ambition.\nTaofeek Arapaja; a former Minister of State for Federal Capital Territory, Chief (Mrs.) Jumoke Akinjide; former governor of Ekiti State, Mr. Ayo Fayose; a former Lagos PDP chairman, Hon.\nWhile all the 25 northern members agreed that the national chairman should come from the south, their southern colleagues insisted that the national chairman must come from the north.\n“The office of the national chairman remains in the south, particularly, to the South West but remains subject to ratification, when we meet next Thursday September 30,” a source said.\nHis words: “Our Committee is strictly limited to the PDP National Executive Offices to be contested at the 2021 PDP National Convention scheduled for the end of October, 2021."
  },
  {
    "headline": "PIA: Akwa Ibom Gov Calls for Upward Review of 3% to Host Communities",
    "summarized_story": "He said oil producing communities in the Niger Delta were hurt by what he described as the paltry three per cent allocation in the Act.\nFor oil producing communities, a paltry three per cent?\nThe host communities are not happy, the oil producing areas are not happy, so something should be done.\nHe said the oil producing state was developing a smart terminal that would process one million passengers every year.\nSo with that in mind, the federal government has succeeded in obtaining an order that establishes the sustenance of the status quo, which status quo is that the FIRS should continue collection."
  },
  {
    "headline": "Emefiele Woos Foreign Investors, Insists Prospects Abound in Nigeria",
    "summarized_story": "Emefiele insisted that despite the economic challenges, numerous investment opportunities with good returns abound in the country.\nThis is just as the Conference of Nigerian Political Parties (CNPP) has disowned the call by the Peoples Democratic Party (PDP) for Emefiele’s resignation.\nWe Nigerians must set examples by folding our sleeves and doing things for ourselves before we can expect others to support us.\nYou all know that infrastructure has been a problem in Nigeria.\n“We feel that some of the things we have done are showing results and so we are going to push very aggressively,” Emefiele said."
  },
  {
    "headline": "Oil Prices Rise on Tight Supply, Hit Three-month High",
    "summarized_story": "The call for higher oil prices would come on top of the already too-high natural gas prices, which have sunk some natural gas power providers in Europe as industry leaders, including the NNPC insist that the natural gas situation will have a spill-over effect on the oil market.\nIn a document obtained by THISDAY yesterday, titled: “Brief on Potential Impact of Recent Higher Natural Gas Prices on Global Oil Demand,” the oil producers’ group, noted that the study was necessary given the recent rise in global natural gas prices, and the current low levels of natural storage in various hubs.\nCompared with $4/mmtu a year ago in South-west Europe, Liquefied Natural Gas (LNG) prices have soared to $25.70/mmbtu as of 20 September, according to Energy Intelligence, while current natural gas prices in Europe are equivalent to $150/b of crude oil.\nThe in-house document showed that hikes in natural gas prices incentivises substitution to more affordable fuels, indicating that switching from natural gas to LPG was already taking place as evidenced by reports of some refineries already feeding their furnaces with refinery LPG instead of natural gas.\nHowever, it noted that assuming a harsher winter in the upcoming winter months, which is from October 2021 through March 2022, it will sustain natural gas prices at high levels and incentivise more fuel switching from natural gas to fuel oil."
  },
  {
    "headline": "US-Africa Policy Chief Hails Buhari’s Counter-terrorism Advice",
    "summarized_story": "Speaking recently at 2021 US-Nigeria Investments Summit held in New York, a side event of the 76th Session of the United Nations General Assembly, Rosenberg described that Buhari’s article as a sensible roadmap for US international relations.\nThe Rosslyn Group founder, urged his audience at the summit to revisit the Buhari’s article owing to its “profound recommendations” for the United States in Africa, specifically concerning its approach to counter-terrorism.\nRosenberg served as a senior intelligence analyst in Afghanistan, as well as Washington lobbyist for the government in Kabul during the Donald Trump administration.\nHe also underscored Buhari’s statement that “Africa is the new frontline of global militancy,” and without a bedrock of security, the prospects for attracting foreign direct investment remain dim.\nDrawing upon his experiences in Afghanistan and other nations beset by terrorism, Rosenberg viewed the comprehensive partnerships laid out by Buhari as a sensible roadmap for US international relations."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General Malami Released Over 300 ‘Powerful’ Boko Haram Sponsors After Collecting Bribes, Left Only Foot Soldiers In Detention",
    "summarized_story": "Over 300 suspects arrested by the Nigerian government for funding Boko Haram terrorists have been released, SaharaReporters has gathered.\nMalami was reacting to public criticism over the secrecy surrounding the identities of the alleged financiers of Boko Haram as Buhari’s government has shunned all calls to name the terror sponsors.\n“Ongoing investigation revealed that the suspects have links with the Boko Haram Terrorist Group.\nThese are all the strategies being used by Malami who has already left the big terror financiers off the hook.\n“The 45 persons are insignificant foot soldiers of terror financiers."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General Malami Released Over 300 ‘Powerful’ Boko Haram Sponsors After Collecting Bribes, Left Only Foot Soldiers In Detention",
    "summarized_story": "Over 300 suspects arrested by the Nigerian government for funding Boko Haram terrorists have been released, SaharaReporters has gathered.\nMalami was reacting to public criticism over the secrecy surrounding the identities of the alleged financiers of Boko Haram as Buhari’s government has shunned all calls to name the terror sponsors.\n“Ongoing investigation revealed that the suspects have links with the Boko Haram Terrorist Group.\nThese are all the strategies being used by Malami who has already left the big terror financiers off the hook.\n“The 45 persons are insignificant foot soldiers of terror financiers."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General Malami Released Over 300 ‘Powerful’ Boko Haram Sponsors After Collecting Bribes, Left Only Foot Soldiers In Detention",
    "summarized_story": "Over 300 suspects arrested by the Nigerian government for funding Boko Haram terrorists have been released, SaharaReporters has gathered.\nMalami was reacting to public criticism over the secrecy surrounding the identities of the alleged financiers of Boko Haram as Buhari’s government has shunned all calls to name the terror sponsors.\n“Ongoing investigation revealed that the suspects have links with the Boko Haram Terrorist Group.\nThese are all the strategies being used by Malami who has already left the big terror financiers off the hook.\n“The 45 persons are insignificant foot soldiers of terror financiers."
  },
  {
    "headline": "EXCLUSIVE: Names Of 45 Out Of 400 Suspected Boko Haram Sponsors Buhari Government Is Hiding From Nigerians",
    "summarized_story": "A list of 45 suspects arrested by the Nigerian government for allegedly funding Boko Haram insurgency in the country has been obtained by SaharaReporters.\nSaharaReporters had earlier reported that the United Arab Emirates named and prosecuted 38 alleged sponsors of terrorism, which include six Nigerians.\nFile PhotoPresidential spokesman, Garba Shehu, had in March 2021 said the Nigerian Government arrested 400 Bureaux De Change operators for allegedly funding Boko Haram insurgency in the country, saying the suspects were transferring money to the terrorists.\nSee Also Politics Buhari Regime Not Interested In Naming, Shaming Boko Haram Sponsors – Femi AdesinaShehu’s colleague, Femi Adesina on Tuesday said the Buhari-led government is not interested in naming and shaming the financiers of terrorism but in their peosecution.\nSee Also Politics Why Buhari Government Will Not Name Sponsors Of Boko Haram Now—Justice Minister, Malami“It is a product of constitutionalism and the law."
  },
  {
    "headline": "EXCLUSIVE: Names Of 45 Out Of 400 Suspected Boko Haram Sponsors Buhari Government Is Hiding From Nigerians",
    "summarized_story": "A list of 45 suspects arrested by the Nigerian government for allegedly funding Boko Haram insurgency in the country has been obtained by SaharaReporters.\nSaharaReporters had earlier reported that the United Arab Emirates named and prosecuted 38 alleged sponsors of terrorism, which include six Nigerians.\nFile PhotoPresidential spokesman, Garba Shehu, had in March 2021 said the Nigerian Government arrested 400 Bureaux De Change operators for allegedly funding Boko Haram insurgency in the country, saying the suspects were transferring money to the terrorists.\nSee Also Politics Buhari Regime Not Interested In Naming, Shaming Boko Haram Sponsors – Femi AdesinaShehu’s colleague, Femi Adesina on Tuesday said the Buhari-led government is not interested in naming and shaming the financiers of terrorism but in their peosecution.\nSee Also Politics Why Buhari Government Will Not Name Sponsors Of Boko Haram Now—Justice Minister, Malami“It is a product of constitutionalism and the law."
  },
  {
    "headline": "NMA meets in Abuja to decide on strike",
    "summarized_story": "The Nigerian Medical Association (NMA) has called for an emergency meeting of its members.\nNMA had issued the ultimatum to the federal government weeks after the National Association of Resident Doctors (NARD) went on strike.\nAdvertisementIn a notice seen by TheCable, the NMA said the meeting will take place on October 2, in Abuja.\n“Notice is hereby given for an Emergency Delegates Meeting (EDM) of the Nigerian Medical Association,” the notice reads.\nCentral Business District Abuja, FCT Agendum: Review of the progress of the implementation of the Memorandum of Understanding Between Federal Ministry of Labour and Employment and The Nigerian Medical Association.”"
  },
  {
    "headline": "NMA meets in Abuja to decide on strike",
    "summarized_story": "The Nigerian Medical Association (NMA) has called for an emergency meeting of its members.\nNMA had issued the ultimatum to the federal government weeks after the National Association of Resident Doctors (NARD) went on strike.\nAdvertisementIn a notice seen by TheCable, the NMA said the meeting will take place on October 2, in Abuja.\n“Notice is hereby given for an Emergency Delegates Meeting (EDM) of the Nigerian Medical Association,” the notice reads.\nCentral Business District Abuja, FCT Agendum: Review of the progress of the implementation of the Memorandum of Understanding Between Federal Ministry of Labour and Employment and The Nigerian Medical Association.”"
  },
  {
    "headline": "Know The Law: Police officers enforcing stop-and-search must be in uniform or present ID",
    "summarized_story": "Law enforcement agencies, including the police are expected to maintain law and order within the ambits of the constitution and respect for fundamental human rights.\nHence, when they act in contrast to the law, it often sparks public criticism.\nOn the issue of search/raids by the police, there have been several reports of abuse, harassment and extortion of citizens.\nAdvertisementIn some cases, police officers conduct a search on commuters as well as enter public places to carry out raids without the appropriate means of identification.\nThis means that without the police uniform or a visible identity card, a police officer does not have the power to exercise a search."
  },
  {
    "headline": "Know The Law: Police officers enforcing stop-and-search must be in uniform or present ID",
    "summarized_story": "Law enforcement agencies, including the police are expected to maintain law and order within the ambits of the constitution and respect for fundamental human rights.\nHence, when they act in contrast to the law, it often sparks public criticism.\nOn the issue of search/raids by the police, there have been several reports of abuse, harassment and extortion of citizens.\nAdvertisementIn some cases, police officers conduct a search on commuters as well as enter public places to carry out raids without the appropriate means of identification.\nThis means that without the police uniform or a visible identity card, a police officer does not have the power to exercise a search."
  },
  {
    "headline": "Oil price hits 2-month high, trades at $77 a barrel",
    "summarized_story": "AdvertisementBrent crude oil futures, global oil benchmark, climbed 0.26 percent to $77.55 a barrel by 10:15 am on Friday.\nChecks by TheCable showed that this is the highest trading price since July 5, when the global oil benchmark traded $77.16 a barrel.\nU.S. West Texas Intermediate (WTI) crude oil futures also witnessed a corresponding increase of 0.11 percent to $73.38 a barrel.\nAdvertisementAnalysts at UBS told Reuters that Brent oil price could hit $80 a barrel by the end of September due to stock draws, lower OPEC production and stronger demand in the Middle East.\nAdvertisementThe rise in crude oil price means an increase in revenue for Nigeria but a headache for the country’s subsidy shortfall payments."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "Ventures Park launches larger hub in Abuja for its expanding user base",
    "summarized_story": "Image credit: Supplied by Ventures Park.\nA shared workspace at the new Ventures Park campus in Abuja.\nThe new Ventures Park campus in Abuja.\nAfter launching its second innovation hub, Ventures Platform is considering partnerships that could see it expand across Africa, according to Oguchi.\n“The work we do at Ventures Platform is pan-African, and the work that Ventures Park does as a part of that vision is really important,” she said."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "How edtech startup, Stranerd is connecting Nigerian students to tutors",
    "summarized_story": "On the supply side, there are more students or prospective students than there are schools.\nSource: SuppliedOn the website, which currently serves mainly Nigerian students, the startup employs a coin system to charge students.\nThe goal, Godwin says, is to become a one-stop-shop for the Nigerian student’s educational needs and possibly African students also.\nThey also want to include connecting students to internships as well as providing study-abroad services to students.\nBut first, the startup plans to build trust among the students before leveraging it to add more services."
  },
  {
    "headline": "Hearing impairments and technology, ReelFruit’s $3m raise, Apple Pay on Paystack",
    "summarized_story": "Today I’m discussing:Living with hearing impairments in a tech-enabled worldRealFruit’s $3 million Series APaystack launching Apple Pay to help Nigerian businessesLiving with hearing impairments in a tech-enabled worldWeYesterday, Thursday, September 23, 2021, was the International Day of Sign Languages.\nPaystack launches Apple Pay to help Nigerian businessesPaystack, an African fintech company that powers and processes payments for businesses, announced yesterday that Pay with Apple Pay is now available on its platform.\nNigerian businesses will have access to millions of Apple Pay users across more than 60 countries where the payments service is available.\nWhen a customer with Apple Pay buys from a Paystack merchant, they will see the option to checkout using Pay with Apple Pay.\nFlutterwave, an African payments company, integrated PayPal into its platform in March 2021, allowing PayPal customers worldwide to pay African merchants via its “Pay with PayPal” feature."
  },
  {
    "headline": "What does communication in a techy world mean for Nigeria’s deaf people?",
    "summarized_story": "#WeSignForHumanRightsNigeria’s deaf communityWeAccording to Oluwaseun Sosanya, a sign language interpreter, tutor, and deaf advocate, the deaf community “is a collection of people that share the same idea, belief, and culture, and use sign language to communicate.\n“The community includes the two categories of deaf — pre-lingual and post-lingual deaf — parents of the deaf, sign language interpreters, and all users of sign language.\nSignFor the African deaf community, the prevalent sign language is the American Sign Language (ASL) which Andrew Foster — regarded as the Father of Deaf Education in Africa — brought into the continent.\nMobile apps that provide sign language tutoring for beginners, such as the ASL American Sign Language and the Ghanian Sign Language app.\nThe deaf community believed it to be more accommodating of the hearing community without regard to the deaf people — who it was purporting to help."
  },
  {
    "headline": "Oil’s price surge goes on as Goldman forecasts $90 a barrel on cold winter",
    "summarized_story": "Oil’s price surge goes on as Goldman forecasts $90 a barrel on cold winterOil is poised for a fifth weekly gain in a market tightened by a global energy crunch that’s set to increase demand for crude.\nFutures in New York held above $73 a barrel, while global benchmark Brent traded above $77 or near its highest settlement since 2018.\nAnalysts at Goldman Sachs say they expect oil to surge to $90 a barrel if the approaching winter in the northern hemisphere proves colder than normal.\nSuch a rise would be $10 higher than the bank’s current forecast and would be accompanied by a prolonged period of high natural gas prices that already have had disastrous consequences for U.K. power providers.\nVarious underlying oil market gauges are also pointing to a stronger market."
  },
  {
    "headline": "Why benefits of rising oil prices keep eluding Nigeria",
    "summarized_story": "Nigeria’s crude oil production has been languishing at only two-thirds of its full capacity this year, especially many of its large oil fields in the Niger Delta.\nDolapo Oni, an international oil and gas expert familiar with Nigeria’s petroleum industry, says Nigeria’s top 10 oil fields over the last decade have shed over 25 percent of output.\nIndustry data have also revealed Nigeria’s crude oil reserves declined by about 600 million barrels on the back of reduced investment in the last few years.\nAnalysts at multi-asset investment management firm Cardinal Stone say the oil sector weakness reflected lower oil production due to OPEC+ supply restrictions, depressed drilling activities and pipeline downtimes during the period.\nTimipre Sylva, Nigeria’s minister of state for petroleum resources, also admitted Nigeria’s oil fields were struggling."
  },
  {
    "headline": "Nigerian banks increasingly tap CBN for cash as liquidity shrinks",
    "summarized_story": "Banks’ borrowings from the Central Bank of Nigeria (CBN) have jumped by more than three folds in the last six years as the lenders’ ability to meet liquidity obligations shrinks.\nNigeria’s deposit money banks borrowed N2.3 trillion from the apex bank’s Standing Lending Facility (SLF), a line of short-term credit available for commercial banks, in April 2021.\nThis is a 737 percent increase when compared with the N274.65 billion reported in the corresponding period of 2020.\nThe CRR is the amount the CBN debits from banks’ accounts in compliance with its monetary policy objective of mandatorily keeping cash on behalf of banks.\nThe five lenders reported a net interest income of N757 billion in 2021, N101 billion more than the N656 billion reported in the corresponding period of 2020."
  },
  {
    "headline": "COVID-19: Edo seeks residents support, warns against submission of false information during sample collection, testing – Nigerian Observer",
    "summarized_story": "Osagie said the submission of wrong information during sample collection by residents makes it difficult for contact tracers to track down confirmed cases after laboratory results are released.\nHe said the state’s COVID-19 team has not been able to reach 87 persons who were recently tested due to wrong phone numbers and addresses.\nAccording to him, “Edo recorded the death of one more person who was not inoculated with the COVID-19 vaccine.\nThe event will also feature the inauguration of the Traditional Leaders Committee on PHC delivery in the South-South Zone.\nIt’s an opportunity to meet with stakeholders and religious leaders in the South-South region of the country.”..."
  },
  {
    "headline": "Road accident: Obaseki visits survivors, to offset hospital bills – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the government will bear the cost of medical treatment of the survivors of the ghastly road accident on Sakponba Road in Oredo Local Government Area of the state.\nOsaigbovo Iyoha, said this on Thursday when he visited some of the survivors at the Edo Specialist Hospital, in Benin City.\nAccording to him, “The Edo State Government is going to take care of all the medical expenses of those that survived in the accident.\nOn behalf of the Edo Government, I want to commiserate with the families of those that lost their loved ones.\nOne has been discharged and the other one is in stable condition.”He continued: “This accident claimed the lives of innocent citizens."
  },
  {
    "headline": "5G network ready January 2022 – Pantami – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMAIDUGURI – Mr Isa Pantami, Minister of Communication and Digital Economy, says the Five Generation (5G) network will be deployed in Nigeria in January 2022, and will aid surveillance against vandalism of public assets.\nThe minister disclosed this on Thursday in Maiduguri at a Town Hall Meeting to address vandalism of power and telecommunications infrastructure.\nThe Minister of Information and Culture, Alhaji Lai Mohammed led the other ministers who were panelists at the town hall meeting.\nPantami, who was represented by Mr Ubale Maska, Commissioner for Technical Services, Nigeria Communication Commission, said the 5G network was recently approved by the Federal Executive Council for increased connectivity.\nThe minister disclosed that there were over 50,000 telecommunication sites across the country, which made it difficult to man manually except through deployment of modern technology."
  },
  {
    "headline": "Obaseki flags off N-CARES programme – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo, on Thursday, flagged off the Nigeria Coronavirus (COVID-19) Action Recovery and Economic Stimulus (N-CARES) programme under which 12,494 smallholder farmers will be provided inputs.\n“For the independent farmers initiative, 1400 smallholder farmers were provided with agricultural inputs to drive cassava, maize, rice, soyabean, poultry and fisheries value chain.\nObaseki explained that the N-CARES programme domesticated in Edo and code-named EDO CARES would also support 3,341 smallholder farmers with priority on providing them small tertiary irrigation by revamping existing dams.\n“The programme is going to make available agricultural assets for the production and mitigating loss and waste which will benefit 4,874 smallholder farmers.\nOdigie promised to ensure that the beneficiaries made good use of all the farm inputs."
  },
  {
    "headline": "An kama mutum uku cikin maharan da suka sace daliban makarantar Bethel a Kaduna",
    "summarized_story": ""
  },
  {
    "headline": "An kama mutum uku cikin maharan da suka sace daliban makarantar Bethel a Kaduna",
    "summarized_story": ""
  },
  {
    "headline": "Yadda hasalallu su ka yi wa gogarman IPOB rugu-rugu da ruwan duwatsu, yayin da ya ke ƙoƙarin tilasta wa jama’a zaman gida dole",
    "summarized_story": ""
  },
  {
    "headline": "Yadda hasalallu su ka yi wa gogarman IPOB rugu-rugu da ruwan duwatsu, yayin da ya ke ƙoƙarin tilasta wa jama’a zaman gida dole",
    "summarized_story": ""
  },
  {
    "headline": "Kotu ta daure matasan da suka watsa bidiyon batsa tsawon shekaru 4 a Sokoto",
    "summarized_story": ""
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun L.G.S.C Boss, Adedeji Charges L.G Staff To Support Oyetola’s Transformation Agenda",
    "summarized_story": "Chairman of the state’s Local Government Service Commission, Elder Tunde Adedeji gave the admonition during visitation tours to Ifedayo Local Government Area, Oke Ila, Ila Local Government Area, Ila Orangun, Ila Central Local Council Development Area, Mogbon, and Odo-Otin Noth Local Council Development Area, Oyan.\nIn their respective speeches, the Vice Chairman Ifedayo Local Government Area, Hon.\nAdedayo Adediran, the Chairman of Ila Local Government Area, Hon.\nOlumide Babatunde, Ila Central Local Council Development Area, Hon.\nAdewole Kolawole and Chairman Odo Otin North Local Council Development Area, Hon."
  },
  {
    "headline": "Osun communities cry out to Oyetola, IBEDC over total blackout",
    "summarized_story": "By Sunday Oguntuyi, OsogboSix communities in Ife North Local Government Area of Osun State, have cried out to the state governor, Gboyega Oyetola and the management of the Ibadan Electricity Distribution Company (IBEDC) over blackout in the communities for the past four months.\nIt was gathered that a transformer, 7.5MVA Substation at Moro, that supplies electricity to the communities had developed fault as a result of overloading.\nSpeaking on behalf of the communities, President of Ipetumodu, Sunday Oyebowale, said the substation is grossly inadequate and requires a total upgrading and overhauling.\nHe said, “It is very sad and very disheartening to note that Ife-North Local Government have been experiencing total blackout four months ago and nothing has been done by the IBEDC to alleviate our problem.\n“The total blackout has been encouraging kidnapping of people, as we know that when there is no light, any bad act is easy to perpetrate."
  },
  {
    "headline": "Top Banker, UK Eke wins Year 2020 Zik Prize",
    "summarized_story": "By Okey OnyenweakuAce banker and Group Managing Director of FBN Holdings, Urum Kalu Eke (UK Eke), has emerged winner of the prestigious Zik Prize in Professional Leadership Award for the year 2020 in recognition of his strides in the banking industry.\nAnd as GMD of FBN Holding’s, he has made his mark.\nAt FBN Holdings, he has continued to prove his mettle.\nIn 2020, however, the impact of the pandemic caused a marginal 1.9 percent drop in the earnings to N579.4 billion.\nFBN Holdings profit grew from N12.24billion in 2016 to N37.7billion in 2017, N58.23billion in 2018, N73.66billion in 2019 and N89.7 billion in 2020."
  },
  {
    "headline": "Stock market rebounds by 0.06%, investors gain N11bn",
    "summarized_story": "Adebayo ObajemuThe Nigerian stock market on Thursday closed on a positive note as the All Share Index appreciated by 0.06% to close at 38,874.13 points from the previous close of 38,852.69 points.\nInvestors gained N11 billion as the Market Capitalisation grew by 0.05% to close at N20.254 trillion from the previous close N20.243 trillion.\nThe Market Breadth closed positive as 16 equities appreciated in their share prices against 12 equities that declined in their share prices.\nPercentage GainersNAHCO led other gainers with 10% growth, closing at N3.52 from the previous close of N3.2.\nPhamadeko, Veritas Kapita and Cornerstone Insurance among other gainers also grew their share prices by 9.55%, 9.52% and 9.43% respectively."
  },
  {
    "headline": "UNIDO Seeks Regulatory Policy On Artisanal Mining To Minimise Hazards",
    "summarized_story": "The United Nations Industrial Development Organisation (UNIDO) has said that 90 per cent of Nigeria’s mining sector is characterised by artisanal miners, using dangerous chemicals which emit mercury into the environment and causing poisoning.\nHe said, “over 90% of Nigeria’s mining sector is characterised by artisanal and small-scale mining and because of the rudimentary ways of carrying out mining and mineral processing activities, there are lots of indiscriminate use of chemicals and its exposure in and around mining sites and communities.\nHe, therefore, restated the support of UNIDO to Nigeria in ensuring that the environment is protected, lives are preserved and the mining sector is sustainably developed and run.\nIkeah added that the project was part of efforts to effectively implement the provisions of the Minamata Convention on Mercury and strategically position the mining sector for economic growth and sustainable development.\nHe said Kebbi State alone has about 350 cooperatives of artisanal miners with not less than 20 persons each."
  },
  {
    "headline": "UNIDO Seeks Regulatory Policy On Artisanal Mining To Minimise Hazards",
    "summarized_story": "The United Nations Industrial Development Organisation (UNIDO) has said that 90 per cent of Nigeria’s mining sector is characterised by artisanal miners, using dangerous chemicals which emit mercury into the environment and causing poisoning.\nHe said, “over 90% of Nigeria’s mining sector is characterised by artisanal and small-scale mining and because of the rudimentary ways of carrying out mining and mineral processing activities, there are lots of indiscriminate use of chemicals and its exposure in and around mining sites and communities.\nHe, therefore, restated the support of UNIDO to Nigeria in ensuring that the environment is protected, lives are preserved and the mining sector is sustainably developed and run.\nIkeah added that the project was part of efforts to effectively implement the provisions of the Minamata Convention on Mercury and strategically position the mining sector for economic growth and sustainable development.\nHe said Kebbi State alone has about 350 cooperatives of artisanal miners with not less than 20 persons each."
  },
  {
    "headline": "Federal Govt Insists On Recognition Of Nigerian Certificates In Ukraine",
    "summarized_story": "As Ukrainian Government intensify efforts to woo more Nigerians to study at almost 400 higher education institutions in Ukraine, the Federal Government of Nigeria has insisted on a bilateral agreement to ensure that certificates obtained from Nigerian institutions are considered for job opportunities in Ukraine.\nCurrently, out of a total of 76,548 foreign students from 155 countries of the world studying in Ukraine, Nigeria accounts for 4,227.\n“We have two types of agreement, the bilateral agreement on education which is training, vocational, medicine and all issues that has to do with learning.\nAccording to the Minister, education in Ukraine is both useful and accessible, saying that the price of education in Ukraine is much lower when compared with other European countries.\nHe maintained that foreign citizens as well as legal asylum seekers residing in Ukraine have the same rights, freedoms and obligations as citizens of Ukraine."
  },
  {
    "headline": "Federal Govt Insists On Recognition Of Nigerian Certificates In Ukraine",
    "summarized_story": "As Ukrainian Government intensify efforts to woo more Nigerians to study at almost 400 higher education institutions in Ukraine, the Federal Government of Nigeria has insisted on a bilateral agreement to ensure that certificates obtained from Nigerian institutions are considered for job opportunities in Ukraine.\nCurrently, out of a total of 76,548 foreign students from 155 countries of the world studying in Ukraine, Nigeria accounts for 4,227.\n“We have two types of agreement, the bilateral agreement on education which is training, vocational, medicine and all issues that has to do with learning.\nAccording to the Minister, education in Ukraine is both useful and accessible, saying that the price of education in Ukraine is much lower when compared with other European countries.\nHe maintained that foreign citizens as well as legal asylum seekers residing in Ukraine have the same rights, freedoms and obligations as citizens of Ukraine."
  },
  {
    "headline": "Fani-Kayode’s Estranged Wife, Precious, Sues Ex-husband, Top Policemen",
    "summarized_story": "The estranged wife of a former Minister of Aviation and chieftain of the ruling All Progressives Congress (APC), Chief Femi Fani-Kayode, Precious Chikwendu, has dragged her ex-husband before a Federal High Court in Abuja, seeking the enforcement of her fundamental human rights.\nThe plaintiff, Chikwendu, is seeking the sum of N800m as damages.\nChikwendu said she was demanding the said amount because of the roles of the respondents in intimidating and harassing her during the pendency of her custody suit.\nIn an affidavit in support of the application deposed to by Chikwendu, she averred that, “I was in a most tempestuous and violent relationship with the fifth respondent (Fani-Kayode), a qualified legal practitioner, a politician and a former minister of the Federal Republic of Nigeria.\n“The fifth respondent and I have four children together and I am forcefully separated from our children, who are all minors."
  },
  {
    "headline": "UN Summit: Buhari restates commitment to national food security",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari Thursday in New York reaffirmed the commitment of the Federal Government to attaining national food security.\nThe President told the Food Systems Summit as part of the High Level meetings of the 76th Session of the United Nations General Assembly, that Nigeria had developed a “food system focused development agenda that prioritizes healthy diets and affordable nutrition, inclusive, efficient, resilient, and sustainable, which will contribute to rebuilding our economy, creating jobs and spurring growth across sectors while sustaining our ecosystems.”The Nigerian leader said the plan was the outcome of a wide range stakeholder-engagement geared towards a better understanding of their food systems, experiences and needs.\nAccording to President Buhari, “following the recommendations from the dialogues and our plan to lift 100 million Nigerians out of poverty within a decade, Nigeria is committed to: investing in food security and nutrition knowledge dissemination, skills’ development, and information management systems to enhance agricultural productivity; building sustainable, responsive, and inclusive food systems; enhancing the productivity of smallholder farmers and empowering women and youths for greater access to food production; while strengthening climate mitigation strategies and conflict early warning systems that will reduce the many stresses and shocks to our food systems.”The President commended the initiative of the Secretary-General of the United Nations for convening the Summit, calling it “a bold step towards achieving the 2030 global development Agenda at a time COVID-19 pandemic and its attendant consequences are threatening progress.”He stressed that as Nigeria works “to transform our food systems and achieve the Sustainable Development Goals and the 2030 Agenda, we hope to learn from, and collaborate with Member States that have grappled or are grappling with food systems concerns similar to ours.”“We especially support the emerging coalitions of actions and sustainable food systems,” he added.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "UN Summit: Buhari restates commitment to national food security",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari Thursday in New York reaffirmed the commitment of the Federal Government to attaining national food security.\nThe President told the Food Systems Summit as part of the High Level meetings of the 76th Session of the United Nations General Assembly, that Nigeria had developed a “food system focused development agenda that prioritizes healthy diets and affordable nutrition, inclusive, efficient, resilient, and sustainable, which will contribute to rebuilding our economy, creating jobs and spurring growth across sectors while sustaining our ecosystems.”The Nigerian leader said the plan was the outcome of a wide range stakeholder-engagement geared towards a better understanding of their food systems, experiences and needs.\nAccording to President Buhari, “following the recommendations from the dialogues and our plan to lift 100 million Nigerians out of poverty within a decade, Nigeria is committed to: investing in food security and nutrition knowledge dissemination, skills’ development, and information management systems to enhance agricultural productivity; building sustainable, responsive, and inclusive food systems; enhancing the productivity of smallholder farmers and empowering women and youths for greater access to food production; while strengthening climate mitigation strategies and conflict early warning systems that will reduce the many stresses and shocks to our food systems.”The President commended the initiative of the Secretary-General of the United Nations for convening the Summit, calling it “a bold step towards achieving the 2030 global development Agenda at a time COVID-19 pandemic and its attendant consequences are threatening progress.”He stressed that as Nigeria works “to transform our food systems and achieve the Sustainable Development Goals and the 2030 Agenda, we hope to learn from, and collaborate with Member States that have grappled or are grappling with food systems concerns similar to ours.”“We especially support the emerging coalitions of actions and sustainable food systems,” he added.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Obateru: Celebrating a Quintessential PR Man at 60",
    "summarized_story": "Another thing I find particularly fascinating about Dr. Obateru is his ability to listen patiently and respond to issues no matter how busy he is.\nBefore his appointment as the Group General Manger, Group Public Affairs of the NNPC in 2020, he was the General Manager, NNPC London Office.\nBetween1993 and1998, Dr. Obateru was the Protocol Officer to the then Honourable Minister of Petroleum Resources.\nDr. Obateru is happily married and his union is blessed with four children.\nDr. Obateru bows out after 29 years of meritorious service to the NNPC."
  },
  {
    "headline": "Obateru: Celebrating a Quintessential PR Man at 60",
    "summarized_story": "Another thing I find particularly fascinating about Dr. Obateru is his ability to listen patiently and respond to issues no matter how busy he is.\nBefore his appointment as the Group General Manger, Group Public Affairs of the NNPC in 2020, he was the General Manager, NNPC London Office.\nBetween1993 and1998, Dr. Obateru was the Protocol Officer to the then Honourable Minister of Petroleum Resources.\nDr. Obateru is happily married and his union is blessed with four children.\nDr. Obateru bows out after 29 years of meritorious service to the NNPC."
  },
  {
    "headline": "BREAKING: Nigerian Govt Issues Security Alert Ahead Of October 1",
    "summarized_story": "The Nigerian government has alerted the general public to heightened security activities preparatory to the country’s 61st Independence anniversary.\nThis was contained in a statement released in Abuja on Friday and signed by Segun Adeyemi, Special Assistant on Media to the Minister of Information and Culture, Alhaji Lai Mohammed.\nThe Minister advised residents of the Federal Capital Territory and its environs not to panic and go about their legitimate activities.\nHe urged residents to report any suspicious movement to the relevant security agencies.\n”Residents are enjoined to report suspicious persons and movements to the security agencies through the following numbers: 09-6305396, 08031230631, 08032003557 and 122,” the statement added."
  },
  {
    "headline": "Court Adjourns Kanu Hotel, AMCON Suit To Nov 11",
    "summarized_story": "The six-year-old case involving former Nigeria international, Nwankwo Kanu, The Hardley Apartments and Asset Management Corporation of Nigeria (AMCON) resumed on Tuesday, September 21 before Justice Chukwujekwu Aneke and was subsequently adjourned to November 11, 2021 for hearing on the motions.\nThe hotel had repaid the sum of N339 million as at 2012 before a dispute arose between the owners of the business, Nwankwo Kanu and Ayoola Gam-Ikon leading to the exclusion of the latter from the business.\nHowever, that same year Skye Bank had transferred the said outstanding loan to AMCON.\nAMCON filed the action against The Hardley Apartments and the directors Nwankwo Kanu and Ayoola Gam-Ikon as defendants.\nThe matter has been adjourned for all pending motions to be heard at the next date."
  },
  {
    "headline": "N20billion Judgement: Igboho’s Lawyer Reacts To Plan By Buhari Government To File Fresh Charges",
    "summarized_story": "This comes after a recent statement made by the Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN) in New York, United States.\nMalami had said the Nigerian government may file fresh charges against Igboho after his recent victory in an Ibadan High Court.\nReacting to the judgement, Malami said the Nigerian government had the right to appeal the judgement or file a fresh charge.\nor file a fresh charge or appeal the judgement!\n“However, one wonders what fresh application or charge MLBS Malami SAN, is referring to!"
  },
  {
    "headline": "Biafra, Oduduwa: Gov Ortom Reveals Major Reasons For Agitations In Nigeria",
    "summarized_story": "On Thursday, Samuel Ortom, the governor of Benue State, stated that Nigerians have lost faith in the presidency, which has resulted in the present agitation for secession in both the Southeast and Southwest geopolitical zones.\nGovernor Ortom made the claim during an event organized by the Radio Nigeria chapel of the Nigeria Union of Journalists, NUJ, in Enugu State.\nGovernor Ortom is known for criticizing President Muhammadu Buhari over his alleged inability to address current security challenges.\nThe governor stated that the Buhari administration’s lack of fairness to Nigerians sparked the present agitation for secession in some parts of the country.\n“As I stated earlier, the current secessionist agitations here in the East and elsewhere are a result of injustice and lack of fairness to Nigerians by the current Presidency."
  },
  {
    "headline": "Right of VAT collection remains with FIRS, AGF Malami insists",
    "summarized_story": "The chief law officer of the federation explained that the ruling of the Court of Appeal that FIRS and the Rivers Government maintain status quo favoured FIRS.\n“So with that in mind, the Federal Government has succeeded in obtaining an order that establishes the sustenance of the status quo, which status quo is that the Federal Inland Revenue Service should continue collection.\n“This is pending the determination of the cases that were instituted by states, particularly the Rivers State Government and the Lagos State government.\nA three-member panel of the Court of Appeal headed by Haruna Tsammani, issued the order being challenged at the Supreme Court by the Rivers government.\n“And we are taking steps to consider the possibility of instituting an action before the Supreme Court for the purpose of having this matter determined once and for all,’’ Malami said."
  },
  {
    "headline": "Breaking: All on board dead as plane crashes",
    "summarized_story": "There are no survivors after a plane carrying 28 people crashed in the far east of Russia on Tuesday, Russian news agencies cited rescue officials as saying.\nCiting sources, Interfax reported that the plane was thought to have crashed into a cliff as it was preparing to land in poor visibility conditions.\nThe weather in the area was cloudy at the time the plane went missing, Russian news agencies reported.\nThe Soviet-era plane type, still used for military and civilian flights in some countries, has been involved in dozens of deadly crashes since it entered service around 50 years ago.\nAn Antonov-28, a similar plane, slammed into a Kamchatka forest in 2012 in a crash that killed 10 people along the same route."
  },
  {
    "headline": "8-month-old hole-in-the heart baby, Adekoya, needs N5m lifeline",
    "summarized_story": "An eight-month-old baby, Ademola Adekoya, currently receiving treatment at the Babcock University Teaching Hospital, Remo, Ogun state, is urgently seeking N5 million for a life-saving surgery which must be conducted within two months.\nPleading for assistance, Mrs Hannah Adekoya said she was referred to the Lagos State University Teaching Hospital, LASUTH, Ayike House.\nThey told me the bill is N5 million.”And with the option that the surgery could only be done at Babcock or abroad, Adekoya took her baby to Babcock to make enquiries.\n“Getting there, we started all over; they did the echo test again and it still showed the same problem.\nLater they gave us the bill for the surgery, and that we have to do it within two months,” lamented the mother."
  },
  {
    "headline": "Ethnic youth leaders to Secondus, PDP: Your call for CBN gov’s resignation baseless, sign of weak NWC -NigPilot",
    "summarized_story": "Nigerian Ethnic Youth Leaders Council, NEYLC, is alarmed over the call made by the Peoples Democratic Party, PDP, that the governor of the Central Bank of Nigeria, CBN, Godwin Emefiele, should resign.\nThe council, which is made up of the Arewa Consultative Youth Movement, Ohanaeze Ndi Igbo Youth Movement, Oduduwa Youths and Middle Belt Youths, is of the strong view that the call is baseless considering the monumental strides of the apex bank under Emefiele’s leadership.\n“The call is laughable and a sign of a weak National Working Committee, NWC, of an opposition party which is ready to play politics with everything, no matter how unreasonable.\n“We pity Ologbondiyan and Secondus because they are like the proverbial drowning men that are desperately looking for a straw to hold on it.\n“We’re really dismayed at the level that which ambition can push people to,” the council noted."
  },
  {
    "headline": "Ortom accuses Buhari of dividing Nigeria -NigPilot",
    "summarized_story": "BENUE State Governor, Samuel Ortom has accused President Muhammadu Buhari of jettisoning the vision of the nation’s founding fathers which was hinged on unity and oneness and instead is pursuing an ethnic agenda.\nOrtom said instead of bringing Nigeria together, the president had succeeded in dividing the country with intimidation and marginalization.\nOrtom said for Nigeria to move in the path of unity and oneness, the people of Eastern Nigeria should be provided with adequate infrastructure.\nOrtom said whereas former President Goodluck Jonathan never threatened or intimidated anybody, under President Buhari, intimidation of dissenting voices in a democracy has been the order of the day.\nOrtom, however, pleaded with Ndigbo not to destroy infrastructure in their place since what they are destroying belongs to them."
  },
  {
    "headline": "NYSC: Army apologies to victim of rights abuse -NigPilot",
    "summarized_story": "He however assured that the rights of the citizenry is sacrosanct and must be respected by all personnel of the Nigerian Army, as any form of infraction will be severely dealt with.\n“It is against this premise that the NA condemns this unimaginable level of infraction by a personnel in its ranks.\nThe Army spokesperson said that the officer’s actions has undoubtedly caused the NA monumental embarrassment and is highly regrettable.\nHe added that the unfortunate act of indiscipline does not in anyway represent the NA and will not be condoned in its entirety.\nThe Service enjoined the public to continue to report such infractions, as Human Rights Desks in all formations of the NA are emplaced to deal decisively with such erring personnel."
  },
  {
    "headline": "Nigerian Army condemns officer dehumanizing Corps Member in Video",
    "summarized_story": "Describes act unprofessional, unacceptableNigerian Army,NA, said it has taken cognizance of a video clip currently making the rounds on the social media, where a female officer was seen dehumanizing a member of the National Youth Service Corps, NYSC , in Calabar, Cross River State.\nThis act is not only condemnable but unprofessional and against established precepts of discipline in the NA.\n” It is against this premise that the NA condemns this unimaginable level of an infraction by personnel in its ranks.\n“The NA wishes to reiterate and assure the general public that such infractions would not be tolerated from its personnel,” it stated.\nThe NA further wishes to tender unreserved apology to the victim, her family members, friends, National Youth Service Corps and to Nigerians in general for the unwholesome treatment meted out to the Corps member."
  },
  {
    "headline": "FG, States, LGs Share N696.965bn As VAT Revenue Hits N166.228bn",
    "summarized_story": "This comes as the nation records a significant increase in the collection of Value Added Tax (VAT) and import duty, amid the lingering controversy over whose responsibility it is to collect VAT.\nThe communique issued at the end of the meeting indicated that the gross revenue available from the Value Added Tax (VAT) for August was N166.228 billion.\nAccording to it, the Federal Government got N24.934 billion of the revenue generated from VAT, while the states and local government councils (LGCs) received N83.114 billion and N58.180 billion respectively.\nThe communique indicated that total revenue distributable for the month included gross statutory revenue of N477.504 billion, VAT of N166.228 billion, exchange gain of N2.830 billion, excess bank charges recovered of N0.403 billion, and N50 billion from non-oil revenue.\nThis brings the total distributable revenue to N696.965 billion for the month of August."
  },
  {
    "headline": "We Have No Mandate To Zone Presidency, Other Political Offices – PDP Committee",
    "summarized_story": "The Zoning Committee of the Peoples Democratic Party (PDP) has said it has no mandate to zone political offices such President or Vice President of Nigeria.\nThe committee was set up by the party’s leadership for the zoning of national offices of the PDP ahead of its national convention set to hold on October 30 and 31.\n“Our committee is strictly limited to the PDP National Executive Offices to be contested at the 2021 PDP National Convention scheduled for the end of October, 2021,” Governor Ugwuanyi said, adding: “We have no mandate to zone political offices such as President or Vice President of the Federal Republic of Nigeria”.\nHe, therefore, encouraged members of the committee to be frank, open, and constructive in their proposals and debates, and exhibit consistency with the enormity of their mandate.\nMahdi Aliyu Mohammed, who serves as Secretary, former Presidents of the Senate, Senator Iyorchia Ayu and Senator Anyim Pius Anyim."
  },
  {
    "headline": "Police Arrest Three Suspects Over Abduction Of 121 Kaduna Schoolchildren",
    "summarized_story": "The police have arrested three persons for their alleged involvement in the abduction of the 121 students of the Bethel Baptist Secondary School in Kaduna State.\nClad in military uniform, Adamu, Lawal, and Abubakar were among the 50 suspects paraded for kidnapping, drugs use and distribution, and arms dealing, among other offences.\nMba, in his remarks, explained that the suspects paraded were part of the successes recorded from the STS of the Nigeria Police.\nThe trio were paraded more than three months after the gunmen forcefully took away the schoolchildren from their hostels on July 5.\nThey were later released in batches – as 28 of them were freed on July 25 after a ransom was reportedly paid to their abductors."
  },
  {
    "headline": "Reps Ask FG To Secure Release Of Nigerians Illegally Detained In Prisons Abroad",
    "summarized_story": "Members of the House of Representatives have raised an alarm over the trend of Nigerians being illegally detained in prisons in foreign lands, and asked the Federal Government to secure their release.\nThis follows a motion raised by a lawmaker, Dennis Idahosa, on the need to ascertain the number of Nigerians detained in foreign prisons, during plenary on Thursday in the lower chamber of the National Assembly in Abuja.\nIn their resolution, they urged the Federal Government to intervene and secure the release of Nigerians being held illegally in prisons abroad.\nThe lawmakers also resolved to mandate the House Committees on Foreign Affairs, Justice and Inter-Parliamentary Relations, to ensure compliance with the resolution reach.\nHe believes the Federal Government needs to employ diplomatic means to assist Nigerians wrongly convicted and being detained in various prisons abroad."
  },
  {
    "headline": "Reps To Probe Leakage Of Classified Security Documents",
    "summarized_story": "Members of the House of Representatives on Thursday ordered an investigation into the leakage of classified security documents to the public.\nThe lawmakers gave the mandate to the House Committee on National Security and Intelligence in their resolution following a motion raised by a member of the House, Samuel Adejare.\nAdejare had moved the motion on the ‘Need to Address Leakage of Classified Security Documents to the Public’.\nWhile addressing his colleagues during plenary in the lower chamber of the National Assembly in Abuja, Adejare raised concern over the recurring incidents of leakage of classified security documents to the public.\nBut he lamented that the leakage of classified security documents and other acts of sabotage was causing failure of intelligence gathering, misunderstanding, and lack of cohesion among operatives involved in different operations against insurgency and other acts of terrorism."
  },
  {
    "headline": "Nigerian Army apologises to Corps member brutalised in Calabar -",
    "summarized_story": "The Nigerian Army (NA) says it has taken cognizance of a video clip currently making the rounds on the social media, where a female officer was seen dehumanizing a member of the National Youth Service Corps (NYSC) in Calabar, Cross River State.\nThis act according to Army Spokesman, Brigadier General Onyema Nwachukwu, is not only condemnable, but unprofessional and against established precepts of discipline in the NA.\nThe Army Spokesman said the unfortunate act of indiscipline does not in anyway represent the Nigerian Army and will not be condoned in its entirety.\nHe said the Nigerian Army will never condone such an attitude or infractions on the rights of Nigerians by its personnel.\nHe tendered an unreserved apology on behalf of the Nigerian Army to the victim, her family members, friends, National Youth Service Corps and to Nigerians in general for the unwholesome treatment meted out to the Corps member."
  },
  {
    "headline": "Policeman killed in clash between Police team, Okada riders in Lagos -",
    "summarized_story": "Unconfirmed reports say there was a fracas between Policemen and Okada riders at Ajao Estate area of Lagos State earlier today.\nThe Fracas according to eyewitnesses was as a result of an attempt by the Police team to arrest some of the Okada riders.\nMembers of the Police team also sustained varying degrees of injuries.\nThe Police Public Relations Officer in Lagos State, Adekunle Ajisebutu, confirmed the incident but promised to give more details later.\nSome reports however say both sides sustained fatalities in the fracas which took place earlier in the day but that cannot be confirmed at this time."
  },
  {
    "headline": "PDP Zoning committee holds inaugural meeting in Enugu",
    "summarized_story": "The People’s Democratic Party (PDP) zoning committee is currently holding its maiden executive meeting.at the Enugu state Government house.\nThe Committee is saddled with the responsibility to deliberate on which zone would produce the next National Chairman of the party.\nOn 17th of September, National Working Committee of the party inaugurated this zoning Sub-Committee, that is headed by the Governor of Enugu State, Ifeanyi Ugwuanyi.\nThey also told party leaders from the South not to accept national chairmanship positions and vice presidential slots.\nWorthy of note that PDP chieftains from South West are currently pushing for the chairmanship seat."
  },
  {
    "headline": "Anambra Guber: ADC DG Harris Chuma announces resignation",
    "summarized_story": "The Director-General of the African Democratic Congress (ADC) Governorship Campaign Organization, Harris Chuma-Odili, has announced his resignation from active and partisan politics in Anambra State ahead of the November 6th governorship election.\nChuma-Odili, also referred to as Ogene Igbo, told reporters in Awka, the state capital, on Thursday that he left party politics to “do the right thing” as a professional journalist.\nAccording to a statement written to the party’s governorship candidate, Nze Akachukwu Nwankpo, and copied to the party’s National Chairman, Chief Ralphs Okey Nwosu, titled “Resignation from Partisan Politics,” he further noted that his decision was made to allow him to embark on new challenges.\n“Without doubt, I will miss the company of my friends and associates and all those relationships I built in the course of promoting your gubernatorial ambition all over the state,” he stated.\n“While I crave for your kind understanding, do accept assurances of my highest regards.”"
  },
  {
    "headline": "Catalan Separatist Carles Puigdemont Arrested in Italy",
    "summarized_story": "Exiled Catalan separatist leader Carles Puigdemont has been detained in Italy on a Spanish arrest warrant.\nHe lives there and sits as a member of the European Parliament.\nMr Puigdemont had travelled to the Mediterranean island for a Catalan folklore festival, his lawyer said.\nAfter Mr Puigdemont and two ministerial colleagues fled, Spain jailed nine other Catalan leaders for sedition for their role in the breakaway vote.\nCatalonia’s new president Pere Aragones – also a separatist – condemned what he called the “persecution” of Mr Puigdemont."
  },
  {
    "headline": "African Leaders Highlight Vaccine Inequity in UN General Assembly Speeches",
    "summarized_story": "The inequity of COVID-19 vaccine distribution came into sharper focus on Thursday as many leaders of African countries, whose populations have little to no access to the life-saving shots, stepped to the podium to speak at the United Nations General Assembly.\nAlready, the struggle to contain the coronavirus pandemic has featured prominently in world leaders’ speeches during the past few days – many of them delivered remotely because of the coronavirus itself.\n“It is, therefore, a great concern that the global community has not sustained the principles of solidarity and cooperation in securing equitable access to COVID-19 vaccines,” he said.\nZimbabwe’s President Emmerson Mnangagwa called on the international community to exercise “enhanced multilateralism and a unity of purpose’ in vaccine distribution.\n“Vaccine nationalism is self-defeating and contrary to the mantra that no one is safe until everyone is safe,” added Mnangagwa."
  },
  {
    "headline": "US-Africa Policy Chief Hails Buhari’s Counter-terrorism Advice",
    "summarized_story": "The Founder of Rosslyn Group, a Washington-based government relations firm specialising in Africa, Mr. John Rosenberg, has lauded President Muhammadu Buhari’s August 15, 2021 article published in The Financial Times of London.\nSpeaking recently at 2021 US-Nigeria Investments Summit held in New York, a side event of the 76th Session of the United Nations General Assembly, Rosenberg described that Buhari’s article as a sensible roadmap for US international relations.\nThe Rosslyn Group founder, urged his audience at the summit to revisit the Buhari’s article owing to its “profound recommendations” for the United States in Africa, specifically concerning its approach to counter-terrorism.\nHe also underscored Buhari’s statement that “Africa is the new frontline of global militancy,” and without a bedrock of security, the prospects for attracting foreign direct investment remain dim.\nDrawing upon his experiences in Afghanistan and other nations beset by terrorism, Rosenberg viewed the comprehensive partnerships laid out by Buhari as a sensible roadmap for US international relations."
  },
  {
    "headline": "Nigeria’s Central Bank Chief Emefiele Woos Foreign Investors with Prospects",
    "summarized_story": "Central Bank of Nigeria (CBN) Governor, Mr. Godwin Emefiele has called on Nigerians in the diaspora and other foreign investors to take advantage of the opportunities in the country.\nEmefiele insisted that despite the economic challenges, numerous investment opportunities with good returns abound in the country.\nThis is just as the Conference of Nigerian Political Parties (CNPP) has disowned the call by the Peoples Democratic Party (PDP) for Emefiele’s resignation.\nWe Nigerians must set examples by folding our sleeves and doing things for ourselves before we can expect others to support us.\n“The central bank would not want the event to take the shine away from the Independence celebration,” he said."
  },
  {
    "headline": "Nigeria: Against Mood of the Nation, PDP Retains Chairmanship in South",
    "summarized_story": "What transpired in the committee meeting and ultimately, its outcome is seen as mission accomplished for norther members with presidential ambition.\nTaofeek Arapaja; a former Minister of State for Federal Capital Territory, Chief (Mrs.) Jumoke Akinjide; former governor of Ekiti State, Mr. Ayo Fayose; a former Lagos PDP chairman, Hon.\nWhile all the 25 northern members agreed that the national chairman should come from the south, their southern colleagues insisted that the national chairman must come from the north.\n“The office of the national chairman remains in the south, particularly, to the South West but remains subject to ratification, when we meet next Thursday September 30,” a source said.\nHis words: “Our Committee is strictly limited to the PDP National Executive Offices to be contested at the 2021 PDP National Convention scheduled for the end of October, 2021."
  }
]