[
  {
    "headline": "Workers demand better deal from govt on May Day",
    "summarized_story": "Nigerian workers on Sunday demanded a better deal from governments at all levels as they joined their counterparts across the world to celebrate this year’s Workers’ Day.\nAkinwole said, “Workers’ Day in Nigeria had turned into a day of lamentation when dirges are sung to fallen workers who have died in their numbers from poverty; as a result of unpaid wages, kidnapping for ransom, and unsustainable remuneration.\nBayelsa State Governor, Mr Douye Diri, acceded to some of the demands of the state NLC and TUC bordering on welfare to motivate the government’s workforce.\nThe Independent National Electoral Commission hailed Nigerian workers for their contribution to the nation’s stability and economic development over the years despite challenges.\nThe chairman of INEC, Prof. Mahmood Yakubu, said these in his message to Nigerian workers on the occasion of the international workers day celebrated every May 1."
  },
  {
    "headline": "Workers’ Day: Obaseki increases minimum wage from N30,000 to N40,000",
    "summarized_story": "…as pensioners protest over unpaid gratuitiesThe Edo State Governor, Godwin Obaseki, on Sunday, announced the upward review of the state workers’ minimum wage from N30,000 to N40,000 in commemoration of the 2022 Workers’ Day.\nIt will be immoral and mindless of us to continue to pretend that we do not know that our workers are suffering.”“The government of Edo has now decided to review the minimum (wage) for Edo workers from N30,000 to N40,000 a month.\nYour welfare is our number one priority.”The governor reiterated the minimum wage review in a series of tweets on his Twitter page, @GovernorObaseki.\nHe tweeted, “I announced that we have reviewed the minimum wage for Edo workers from N30,000 to N40,000 a month.\n“For optimum performance of our workers, we have resolved to do an upward review of the salary of workers of Edo State."
  },
  {
    "headline": "Kaduna Train Attack: SERAP drags FG before ECOWAS court over failure to rescue victims",
    "summarized_story": "The victims have remained with the terrorists for a month, despite repeated appeals for the government to free them from captivity.\nThe suit followed reports that the Federal Executive Council (FEC) failed to approve funds for surveillance equipment that could have helped to prevent the train attack.\nIt also argued that “A fundamental notion of contemporary human rights law is that victims of violations such as the victims of the Abuja-Kaduna train attack enjoy an independent right to effective remedies.\n“The officials of the Buhari government have publicly stated that they knew or had information that an attack on the train was imminent but the government failed and/or neglected to take measures to prevent the train attack.\n“The Buhari government has an obligation to promote and protect the rights to life, security and dignity."
  },
  {
    "headline": "May Eid-el-Fitri rebirth bring Nigeria positive change, Lagos PDP celebrates with Muslim faithful",
    "summarized_story": "The Peoples Democratic Party, PDP, Lagos State chapter, has felicitated the Muslim faithful in the country on the occasion of this year’s Eid-el-Fitri festival, which marks the successful conclusion of the Ramadan fasting.\nThe Lagos State Chairman of PDP, Mr. Philip Aivoji, made the salutation in a statement by the party’s Publicity Secretary, Hakeem Amode, in Lagos on Sunday.\n“I, on behalf of Peoples Democratic Party, PDP, Lagos State, the exco and the big umbrella family at large, salute the Muslim faithful at Eid El-fitr.\n“However, the period is symbolic for every Nigerian, especially with another year of political change close by.\nMay this rebirth bring the so much-desired peace, security and true unity to Nigeria.”"
  },
  {
    "headline": "ACCI inaugurate tourism, hospitality trade group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) today inaugurated the Tourism and Creative Industry Trade Group to create sustainable adventure tourism opportunities and networking amongst members.\nHe said since tourism and travel is a broad and unique businesses, the Chamber has designated a trade group to harmonize its various components to achieve desirable results.\nShe said we should fully leverage innovation to encourage 21st-century activities in the Trade Group while adding that developing new ideas is the way forward to improve tourism and hospitality.\nStakeholders from the tourism sector lauded ACCI’s efforts in inaugurating the trade group toward the development of the tourism and hospitality business in Nigeria.\nSome of the newly inaugurated members of the trade group are; Nigeria Tourism Development Cooperation (NTDC), National Institute for Hospitality and Tourism (NIHOTOUR), The Federation of Tourism Association of Nigeria (FTAN), Hotel Owners Forum Abuja (HOFA) and other owners of hospitality and tourism-related businesses."
  },
  {
    "headline": "Eid-el-Fitr: Sen Musa felicitates with constituents, Nigerians, urges all to imbibe lessons of Ramadan",
    "summarized_story": "***Calls for unity and tolerance among NigeriansBy Henry UmoruAS Muslim faithful in Nigeria join the rest of the world to celebrate this year’s Eid-el- fitr, Chairman, Senate Services Committee, Senator Mohammed Sani Musa, All Progressives Congress, APC, Niger East has felicitated with Muslims across the country.\nSenator Musa who particularly rejoiced withMuslims in his Senatorial District as well as other Muslim faithful across the country for successful completion of the Holy Month urged all Nigerians to imbibe the lessons of Ramadan and the spirit of unity, tolerance for peaceful coexistence.\nHe said, Let’s continue to show these in our daily lives.\nAs Nigerians, we should also continue to pray for security and peace in our beloved country, Nigeria and in the world at large.\nlet us engage in what is right and avoid whatever is forbidden by our faith, and be good representatives of our faith.”Musa who noted that he is much committed to the well-being and development of his constituents, praised them for their resilience and patience in the face of the insecurity, adding, “I will continue to strive hard to bring government closer to my people and see to their welfare because we are in this together.”"
  },
  {
    "headline": "Don’t be used as political thugs, Benue guber aspirant charges youths",
    "summarized_story": "By Providence AyanfeoluwaA gubernatorial aspirant on the platform of All Progressives Congress, APC, Rev.\nHyacinth Alia, has charged Benue youths to shun politicians who want to use them as political thugs in the forthcoming election.\nAt the event with the theme, “Benue Governorship 2023, time for a new direction,” Alia said Benue youths need to be re-directed, stressing that there are much better ways to curb the challenges faced by youths in the state.\n“We need to redirect our youths; there are so many things that can be done.\nA Benue youth is a very intelligent person and I think there is more we can do to get them back on the job."
  },
  {
    "headline": "Workers Day: We’ll only support governorship candidate that will agree to our demands – Akwa Ibom NLC",
    "summarized_story": "The state labour leader urged Gov Udom Emmanuel to assent to all pending and sensitive bills that had been passed by the Akwa Ibom House of Assembly without further delay.\nAccording to him, the bills include; the Youths Development Fund Bill and Bill Establishing Akwa Ibom State College of Science and Technology, among others.\nGov Udom Emmanuel in his remarks, commended labour for their support and resilience to enhance the development of the state.\nIn his goodwill message, Sen. Ita Enang, urged workers to support the candidate that will take workers welfare as priority.\nEnang urged Akwa Ibom workers to support his governorship ambition as someone who has the interest of the down trodden at heart."
  },
  {
    "headline": "Go back to negotiation table – Atiku tells ASUU, FG",
    "summarized_story": "Former Vice President, Atiku Abubakar has asked the federal government to return to the negotiation table with the Academic Staff Union of Universities, ASUU and other striking labour unions to end the lingering strike action.\nAtiku said this in a statement on Sunday in commemoration of International workers day, adding that he feels the pains of Nigerian workers over hunger, inflation and insecurity in the country.\nThe presidential aspirant assured that there’s hope of a better country and continue in the spirit of patriotism.\nYou need not be forlorn; the time is ripe to vote out bad governance,” the statement read.\nASUU strike began on February 14 over grievances related to the implementation of Integrated Payroll and Personnel Information System, IPPIS."
  },
  {
    "headline": "Govt increases minimum wage to N40,000",
    "summarized_story": "Governor Godwin Obaseki of Edo State has approved N40,000 new minimum wage for workers in the state.\nThe governor explained that N30,000 can barely sustain workers in the state, hence the increment.\nAccording to Obaseki: “As we all know, the minimum of N30,000 can barely sustain a family.\n“The Government of Edo has now decided to review the minimum for Edo workers from N30,000 to N40,000 a month.\n“Even though we would have loved to pay more, we hope that this little adjustment would enable us to cushion the impact of the inflation that we are faced with.”Recently, the Nigerian Government increased workers’ minimum wage to N30,000."
  },
  {
    "headline": "Eid-el-Fitr: Sustain lessons of Ramadan – Akeredolu urges Muslims",
    "summarized_story": "Oluwarotimi Akeredolu, the Governor of Ondo State, has congratulated Muslim faithful in the state and around the country on the successful completion of Ramadan and the celebration of this year’s Eid-el-Fitr.\nAkeredolu urged the faithful to uphold the principles of Ramadan, which had ended today in their daily activities.\nIn a statement issued by his Chief Press Secretary, Richard Olatunde, the Governor urged all Muslims to ponder on the lessons of Ramadan by praying and giving supplication for the nation’s peace and growth.\n“We must continue to seek God’s face more than ever before.\nAt this crucial time in our nation, we must join voices and seek God’s intervention on the issues of insecurity."
  },
  {
    "headline": "Seek peace at all times, respect the laws of the land – Saraki appeals to Muslims",
    "summarized_story": "Former Senate President, Bukola Saraki, on Sunday, appealed to Nigerian Muslims to seek peace at all times and respect the laws of the land.\nSaraki has, however, advised the Muslims to extend the lessons of Ramadan to the way they live with their neighbours.\nThe former governor of Kwara State urged Muslims to seek peace at all times and promote tolerance of people who speak different languages with them.\nWe should seek peace at all times, promote tolerance of people who speak different languages with us, and worship God in different ways.\n“We should respect the laws of the land and exhibit discipline at all times."
  },
  {
    "headline": "14 robbery suspects, rail vandals held",
    "summarized_story": "No fewer than 14 suspects were arrested last month for acts of vandalism on the country’s railway, the Railway Police Command said yesterday.\nAlso arrested were suspects who allegedly concealed or collaborated in the crime of stealing tracks, sleepers and other equipment of the Nigerian Railway Corporation (NRC).\nTanko’s truck was intercepted by operatives attached to Kafanchan Division.\nIn Kano, three suspects Abdukarim Haruna, Hasssan Dahiru and Bashir Mumuhamed, were apprehended and 51 railway slippers, 26 rail steels, and several quantities of destroyed rail iron rods and slippers were recovered from them.\nAlso, a 20-year-old man, Abdulahi Fatai alias Akube was arrested on April 6, by operatives attached to Bodija Divisional Headquartered of the Railway Command, Ibadan, for alleged armed robbery."
  },
  {
    "headline": "Ebonyi workers seek improved pay, local govt autonomy",
    "summarized_story": "Organized Labour in Ebonyi State on Sunday called for the full implementation of the minimum wage and autonomy for local government.\nThey made the call in an address to mark this year’s Workers Day celebration.\nThe State Chairman of Nigeria Labour Congress (NLC), Comrade Leonard Nkah and the State Chairman of Nigeria Union of local government Employees (NULGE), Stanley Ewah made the call in separate addresses to the State Governor, David Umahi.\nMr Nkah stated that Ebonyi State is not lagging in her commitment to putting smiles on the faces of its senior citizens.\nThe organized labour while appreciating Governor Umahi for the payment of pensions in the stat, requested that the outstanding gratuities due to the pensioners be paid to enable them to cope with the current economic realities."
  },
  {
    "headline": "Couple charged with N203million bank fraud",
    "summarized_story": "The Federal High Court in Lagos will on May 26 begin the trial of a couple – George Emeka Nwachukwu and his wife Oluchi – in connection with an alleged N203,865,708.08 million bank fraud.\nJustice Peter Lifu fixed the date following the Nwachukwus’ arraignment on April 29, by the Police Special Fraud Unit, Ikoyi, Lagos.\nThe five counts against the trio were conspiracy, obtaining by false pretence, unlawful conversion, and fraud.\nThe prosecution claimed that the couple fraudulently obtained the sum in connivance with some staff of the bank.\nThe alleged offences, the prosecutor added, offended Sections 8(a) and 1(1)(a) and 1(3) of the Advance Fee Fraud and other Fraud Related Offences Act, as well as Section 15(2)(b) of the Money Laundering (Prohibition) Act, 2011 as Amended in 2012."
  },
  {
    "headline": "Train attack: Terrorists free Prof Ango Abdullahi’s son 31 days after abduction",
    "summarized_story": "Barely a week after releasing photos showing 62 victims in their captivity, terrorists who attacked the Abuja-Kaduna train have freed one of Sadik, son of Northern Elders Forum (NEF) convener, Professor Ango Abdullahi.\nA family member of the abducted train passengers confirmed that Sadik Ango Abdullahi was released on Friday after spending 31 days in captivity.\nAccording to him, Sadik was identified by friends and relations when the terrorists released pictures of the 62 abducted train passengers.\nWe are sure the terrorists found out who Sadik was and later decided to negotiate for his freedom,” a family member said.\nSadik is the only son between Professor Ango Abdullahi and his mother, late Hajiya Jummai Alhassan, a former minister, popularly known as Mama Taraba."
  },
  {
    "headline": "Sleeping with dogs, animals punishable",
    "summarized_story": "The warning came amid concerns over viral videos of some ladies having intercourse with dogs.\nThe act of humans engaging in intercourse with animals is referred to as bestiality while the attraction to animals is called zoophilia.\nChecks by The Nation show the Criminal Code Act and the Penal Code Act criminalise sleeping with an animal.\n“The punishment is 14 years imprisonment upon conviction based on Section 214 of the Criminal Code Act; Section 284 of the Penal Code Act.\nThe Nation learnt Police have launched a manhunt for a lady in a viral TikTok video claiming to have had intercourse with dogs."
  },
  {
    "headline": "Nomination forms: APC rakes in over N3b from 6 presidential, 63 gov’ship aspirants",
    "summarized_story": "The ruling party had commenced the sale of nomination forms into State and National Assemblies, governorship and presidential aspirants on Tuesday, last week, with the exercise expected to close on Friday this week.\nChukwuemeka Nwanjuiba who was the first to pick the N100 million expression of interest and nomination forms.\nThe only woman vying for the position, Barrister Uju Kennedy, paid only the mandatory N30 million to pick her nomination forms, bringing the total to N530 million.\nFor governorship nomination forms, eight current serving governors their first term have all picked forms by proxy to seek second term bid for the 2023 general elections.\nOthers incumbent governors include that of Kwara State, AbdulRahman AbdulRazaq, Gombe state, Muhammad Inuwa Yahaya and Borno State, Professor Babagana Zulum."
  },
  {
    "headline": "Workers Day: You can’t dictate to govt-Ngige tells Labour",
    "summarized_story": "From Adanna Nnamani, AbujaThe Minister of Labour and Employment, Chris Ngige has told labour unions to desist from dictating to the government how to run its business.\nNgige assured the government would refrain from interfering in trade union activities if they were willing to reciprocate.\nThe minister spoke at the Nigerian Labour commomeration of International Workers Day 2022 held at the Eagle Square, in Abuja at the weekend.\nNgige said “Trade Unions must desist from dictating to the government on how to run its business just like the government would refrain from interfering in the internal affairs of Trade Unions.\nTherefore, let us all embrace social dialogue to build a sound National Industrial Relations System (NIRS)."
  },
  {
    "headline": "May Day: INEC promises Nigerian workers credible, free, fair election",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) has felicitated with Nigerian workers on the celebration of International Workers Day, promising them a free, fair and credible poll in the forthcoming 2023 general elections.\nIn a statement personally signed by the commission’s chairman, Prof Mahmood Yakubu, the electoral umpire said that “Nigerian workers have contributed immensely and tirelessly to country’s stability and economic development over the years despite the myriad of challenges.”Titled; “Mesage from the INEC chairman on the occasion of the International Workers Day”, the statement read; “INEC joins other Nigerians to celebrate all workers on the special occasion and anniversary of the International Workers’ Day, today 1st May 2022.”“It is an established fact that Nigerian workers have contributed immensely and tirelessly to our country’s stability and economic development over the years despite the myriad of challenges.\n“The Commission appreciates the support and understanding it has received and continues to receive from workers as it implements reforms of the electoral system, such as the expansion of voter access to polling units, continuous voter registration, deployment of appropriate technology, the conduct of numerous off-cycle elections, bye-elections and the on-going preparations for the 2023 General Election.\n“As we collectively reflect on sustainable measures to improve the welfare and professional capacity of Nigerian workers, the commission wishes to assure the nation that we will spare no effort in ensuring that elections conducted by us continue to get better, freer, fairer, more credible and more inclusive,” the statement read."
  },
  {
    "headline": "Embrace dialogue with FG, Osinbajo urges ASUU, NLC",
    "summarized_story": "From Adanna Nnamani, AbujaVice President, Prof Yemi Osinbajo has urged the Academic Staff Union of Universities (ASUU) to embrace dialogue as a potent way of ending the protracted strike that shut down academic learning at various varsities.\n“I appeal to the Academic Staff Union of Universities (ASUU) and the broader labour community to seek the path of dialogue.\nBut at all times, we have through dialogue found a path forward.\n“It in this spirit that I call on ASUU to embrace dialogue with the Government and I call on the Nigeria Labour Congress and the Trade Union Congress to help facilitate a resolution of this dispute through dialogue.\n“We have increased the retirement age of teachers so that they can spend more years in service educating our children."
  },
  {
    "headline": "Ahead of 2023: Ozekhome tackles Falana on Jonathan’s eligibility",
    "summarized_story": "Femi Falana, in his submission on the subject matter argued that former President Goodluck Jonathan cannot contest in the 2023 presidential election.\nHe recalled that Mr Jonathan became the President of Nigeria in 2010 following the sudden death of President Umaru Yar’adua, Yaradua and later contested and won the 2011 presidential election.\nMr Jonathan spent five years in office as President which would make it nine years in office if he contests and wins again, Mr Falana said.\nJonathan is disqualified from contesting the 2023 presidential election.\nWhen President Yar’Adua eventually died on May 5, 2010, Jonathan was sworn in as president to serve the unexpired residue of office of Yar’Adua."
  },
  {
    "headline": "Outrage over APC’s Indecision on Zoning of 2023 Presidency",
    "summarized_story": "Rotimi Amaechi, yesterday said he would support President Muhammadu Buhari and APC’s preferred candidate for the 2023 presidential election.\nIn its reaction to APC’s indecision on zoning, PANDEF described Adamu’s claim as careless and ill-considered.\nAs the leader of the country and the leader of the APC, President Buhari must demonstrate strong courage by ensuring that power is moved to South-east after him,” the organisation noted.\nThe organisation, however, warned that anything outside zoning the presidency to the South-east zone would not only boomerang but threaten the nation’s very existence.\nI will Support Whoever is Buhari, APC’s Choice, Says AmaechiIn another development, the Minister of Transportation, Amaechi, yesterday said he would support President Buhari and APC’s chosen candidate for the 2023 presidential election."
  },
  {
    "headline": "Abdullahi Adamu: No Decision Yet on Zoning of APC’s Presidential Ticket",
    "summarized_story": "The PDP likewise screened all its 17 presidential aspirants yesterday and disqualified two aspirants – Dr. Nwachukwu Anakwenze and Cosmas Ndukwe.\nThe APC swapped its national offices between North and South, leading to the emergence of Adamu from the North-central as the National Chairman in March.\nToday, for me, just as an example, to contest the national chairman of our party, I had to pay N20 million.\nFive of the presidential aspirants have so far paid N100 million and picked up their forms.\nWe don’t foresee any opposition in the contest.”PDP Screens Presidential AspirantsThe PDP yesterday screened all its presidential aspirants ahead of its National Convention slated for May 30."
  },
  {
    "headline": "President Backs Ultramodern Royal Museum at Oba of Benin’s Palace",
    "summarized_story": "The President announced his support while receiving in audience at the State House, Abuja, the Oba of Benin, H.R.M.\nOmo N’Oba Uku Akpolokpolo Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum.\nThe Royal Museum, to be housed in the palace of the Oba of Benin, is in conjunction with the National Commission for Museums and Monuments (NCMM).\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\n‘‘Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin Bronzes to Nigeria."
  },
  {
    "headline": "Breaking; PDP Disqualifies Two Presidential Aspirants, Clears 15",
    "summarized_story": "*Says disqualified aspirants can appeal if not satisfiedChuks Okocha in AbujaThe David Mark-led PDP Presidential screening committee Friday announced the disqualification of two presidential aspirants, stating that they did not meet the committee’s criteria.\nHowever, Mark who briefed journalists after the PDP Presidential screening exercise said that it cleared 15 other aspirants.\nThe chairman of the committee said that those disqualified still had the right of appeal.\nThe appeal committee is headed by the National Chairman of the PDP, Dr. Iyorchia Ayu.\nThe report of the committee, Mark said, will be submitted to the National Working Committee of the party Saturday night."
  },
  {
    "headline": "Buhari Receives Oba of Benin in State House, Says Germany to Return 1,130 Looted Bronzes",
    "summarized_story": "The President gave the assurance while receiving in audience at the State House, Abuja, the Oba of Benin, Oba Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum.\nThe Royal Majesty was at State House to thank the President on the recent return of two important Benin Bronzes to its original place of abode by the University of Cambridge and the University of Aberdeen, both in the United Kingdom, after 125 years.\nSpeaking on the return of the artefacts, President Buhari expressed delight that it had brought immense goodwill and acclaim to Nigeria, the ancient Benin Kingdom as well as happiness to the Oba of Benin.\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\nThis will be a monumental achievement.‘‘Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin Bronzes to Nigeria."
  },
  {
    "headline": "Terrorists Hit Plateau State In Fresh Assault, Kill Five Residents, Abduct 20 Others",
    "summarized_story": "No fewer than five passengers, including a vigilante, were killed along the Sabon Gari-Kampani Road in the Wase Local Government Area of Plateau State.\nThe victims were killed by suspected terrorists, locally dubbed bandits, operating in the area, according to Daily Trust.\nAccording to Abdullahi Usman, a resident of Wase town, the vigilante and one other person were ambushed, while the remaining three were killed during a stop-and-search operation by the bandits.\nUsman added that more than 20 passengers were kidnapped in the incident.\nHe said, “The vigilante and one other person were on a motorcycle from Sabon- Gari to Kampani when the bandits attacked them."
  },
  {
    "headline": "Terrorists Hit Plateau State In Fresh Assault, Kill Five Residents, Abduct 20 Others",
    "summarized_story": "No fewer than five passengers, including a vigilante, were killed along the Sabon Gari-Kampani Road in the Wase Local Government Area of Plateau State.\nThe victims were killed by suspected terrorists, locally dubbed bandits, operating in the area, according to Daily Trust.\nAccording to Abdullahi Usman, a resident of Wase town, the vigilante and one other person were ambushed, while the remaining three were killed during a stop-and-search operation by the bandits.\nUsman added that more than 20 passengers were kidnapped in the incident.\nHe said, “The vigilante and one other person were on a motorcycle from Sabon- Gari to Kampani when the bandits attacked them."
  },
  {
    "headline": "BREAKING: Gunmen Attack Nigerian Army Checkpoint In Anambra, Personnel Feared Dead",
    "summarized_story": "Some gunmen on Saturday attacked soldiers at a checkpoint in Agulu, Anaocha Local Government Area of Anambra State.\nAccording to Daily Post, sources said the gunmen wielded automatic rifles, cutlasses and other dangerous weapons.\nThey reportedly arrived at the checkpoint, which was manned by soldiers and started shooting at them, causing the soldiers to reciprocate in a bid to save themselves.\nMeanwhile, the Anambra State Police Command has confirmed the incident, while also condemning it as an attack on the nation.\nYes, there was a shooting incident at a checkpoint in Agulu but the information is still sketchy.”"
  },
  {
    "headline": "BREAKING: Gunmen Attack Nigerian Army Checkpoint In Anambra, Personnel Feared Dead",
    "summarized_story": "Some gunmen on Saturday attacked soldiers at a checkpoint in Agulu, Anaocha Local Government Area of Anambra State.\nAccording to Daily Post, sources said the gunmen wielded automatic rifles, cutlasses and other dangerous weapons.\nThey reportedly arrived at the checkpoint, which was manned by soldiers and started shooting at them, causing the soldiers to reciprocate in a bid to save themselves.\nMeanwhile, the Anambra State Police Command has confirmed the incident, while also condemning it as an attack on the nation.\nYes, there was a shooting incident at a checkpoint in Agulu but the information is still sketchy.”"
  },
  {
    "headline": "Right Of Nigerian Workers To Participate In Politics, By Femi Falana",
    "summarized_story": "However, successive military and civilian regimes ensured, through draconian laws and backward civil service rules that Nigerian workers are completely ostracised from the political terrain.\nAt the end of military rule the political class who took over the reins of power have made a complete mockery of constitutional rule and endangered the democratic process.\nHappily, the Nigeria Labour Congress and Trade Union Congress have resolved to reposition the Labour Party to contest political power with members of the ruling class.\nIn order to achieve the historic objective the labour movement should proceed to mobilise Nigerian workers and allies to embark on mass registration of the members of the Labour Party.\nIt is therefore incumbent on workers in the private and public sectors to stop agonising about the problems confronting the country."
  },
  {
    "headline": "'Many trapped' as three-storey building collapses in Lagos",
    "summarized_story": "A three-story building has collapsed at Ibadan street, Ebutte Meta, Lagos state.\nMany people are said to have been trapped in the rubble, following the collapse of the building on Sunday.\nOperatives of the Lagos State Fire and Rescue Service, the Lagos State Ambulance Service (LASAMBUS), and the Lagos State Building Control Agency (LASBCA) are currently at the scene of the accident.\nAdvertisementThe incident is the second Yaba-Ebutta Meta axis in the last two months.\nOn February 13, a three-storey building collapsed in the Onike area of Yaba, leading to several casualtiesThe developer of the project was said to have returned to the site despite a stop-work order on the structure."
  },
  {
    "headline": "'Many trapped' as three-storey building collapses in Lagos",
    "summarized_story": "A three-story building has collapsed at Ibadan street, Ebutte Meta, Lagos state.\nMany people are said to have been trapped in the rubble, following the collapse of the building on Sunday.\nOperatives of the Lagos State Fire and Rescue Service, the Lagos State Ambulance Service (LASAMBUS), and the Lagos State Building Control Agency (LASBCA) are currently at the scene of the accident.\nAdvertisementThe incident is the second Yaba-Ebutta Meta axis in the last two months.\nOn February 13, a three-storey building collapsed in the Onike area of Yaba, leading to several casualtiesThe developer of the project was said to have returned to the site despite a stop-work order on the structure."
  },
  {
    "headline": "Final victory against terrorism within sight, says Buhari",
    "summarized_story": "President Muhammadu Buhari says the battle against terrorists is approaching its end.\nThe president, through his spokesperson, Garba Shehu, congratulated the Muslim faithful across the country on the end of the Ramadan month.\nFinal victory is within sight.\nBoko Haram and its offshoots’ final embers are now fading.”Last month, the leader of ISWAP was killed in an airstrike.\n“The seizure of more than 65,000 tons of assorted drugs in this period sets a record for the nation.’’"
  },
  {
    "headline": "Final victory against terrorism within sight, says Buhari",
    "summarized_story": "President Muhammadu Buhari says the battle against terrorists is approaching its end.\nThe president, through his spokesperson, Garba Shehu, congratulated the Muslim faithful across the country on the end of the Ramadan month.\nFinal victory is within sight.\nBoko Haram and its offshoots’ final embers are now fading.”Last month, the leader of ISWAP was killed in an airstrike.\n“The seizure of more than 65,000 tons of assorted drugs in this period sets a record for the nation.’’"
  },
  {
    "headline": "NANS warns FG: Party primaries will NOT hold until ASUU strike ends",
    "summarized_story": "The National Association of Nigerian Students (NANS) says there will be no presidential primaries in Abuja until the federal government and the Academic Staff Union of Universities resolve their differences and call off the strike action.\nThis was made known in a statement issued on Sunday by Sunday Asefon, NANS president.\nAmid the strike action, Chris Ngige, minister of labour and employment, and Chukwuemeka Nwajiuba, minister of state for education, have declared their interest to contest the 2023 presidential election.\nAdvertisementNANS described the declaration of the ministers as “total disrespect” for students who currently “languish” at home due to their “collective failures”.\nThe association said the federal government should either resolve the strike or get ready to “give direct orders to the security operatives to shoot us at the site during party conventions to select a presidential candidate”."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "A Kenyan Eden",
    "summarized_story": "Remember we had a Twitter Space titled Do startups need financial literacy?\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nEden Life’s expansion and acquisitionEden Life, a Lagos-based startup, has announced plans to expand into Nairobi, Kenya.\nBuilding on its success in Lagos, Nigeria, Eden says it intends to remove obstacles to discovering dependable household services in Nairobi.\nWhat I’m reading and watchingOpportunitiesThe FT x Cardano Blockchain Challenge is sourcing ventures building or interested in leveraging the Cardano blockchain platform and community."
  },
  {
    "headline": "“All startup founders must be financially literate.” – Olumide Adesina",
    "summarized_story": "Share this article:What do you think of when you hear financial literacy for startups?\nIf you’re like most people, you’re probably wondering why startups have to be financially literate, especially when much of the conversation around financial literacy has been about personal finance.\nAs surprising as it is, even businesses need financial literacy.\nHowever, he pointed out that knowing about financial issues does not equate to financial literacy.\nWith many startups opting for venture capital investments, Adesina observed that founders need to be careful while deciding what kind of investment they accept."
  },
  {
    "headline": "Another NFT hack?",
    "summarized_story": "Billed as the next generation of the web, Web3 focuses on decentralisation using decentralised blockchains.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nAnother NFT phishing schemeOn Monday, April 25, 2022, the Instagram account of the popular NFT collection, Bored Ape Yacht Club (BAYC), was hacked.\nEssentially, the hacker duped victims into handing over control of their wallets by creating a fake advertisement for an upcoming NFT project.\nThe hacker tricked users into clicking a link to “mint” a bogus NFT by sending Ethereum (eth) and, in some cases, an NFT to wrap into a token."
  },
  {
    "headline": "Bekonta extends blockchain awareness and user education to Serving Corps Members.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain awareness and user education is a background check that must be done to foster blockchain adoption.\nThe Festival of Culture with the Bekonta presence engaged Youth Corps Members in a unique way.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Get 30GB Free Data from Geneix and Free Ear Buds when you buy the Infinix Hot 12",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The recently launched Hot12 from Infinix is nothing short of Hot, Bold, Trendy.\nYou can bet on a Fast and Fun Vibe with the Hot series, but not just that.\nYou can enjoy the best of your internet experiences with a whopping 30GB worth of free data and free quality ear buds for a blissful smartphone experience.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Residents trapped as 3-storey building collapses in Lagos",
    "summarized_story": "A three-storey building located at 32, Ibadan Street, Ebute Meta, Lagos has collapsed.\nThe Lagos State Fire and Rescue Service announced the accident via its Twitter handle @LagosRescue Sunday night.\n“An alert of the collapse of a three storey building by 32 Ibadan Street, Ebute Meta was received at 21:48 hours, Sunday, @LagosRescue at the scene.,Rescue ongoing,”Read also: Ikoyi building collapse: Sanwo-Olu receives panel’s report, sets up four-man committeeThe agency promised to provide updates as operation to identify persons trapped in the collapsed building is ongoing.\nEye witnesses, said some occupants of the building were still trapped inside the building.\nA video shared on the Twitter page of the @LagosRescue shows a large crowd of people making effort to identify and rescue people trapped in the collapsed building."
  },
  {
    "headline": "With $1.3bn, Nigeria can end malaria for children under-5",
    "summarized_story": "With 3.1 percent of the 2022 budget, $1.3 billion, Nigeria could acquire complete doses of the RTS, S/AS01 malaria vaccine for the current generation of children under five, ending the scourge of a disease that kills 95,000 children yearly.\nThe 2018 Nigeria Demographic and Health Survey estimated the rate of malaria in children under five at 23 percent.\nRead also: World Malaria Day: Is malaria elimination achievable in Nigeria?\nThe Gavi, the Vaccine Alliance has also secured more than $155 million to support the introduction, procurement and delivery of the malaria vaccine for Gavi-eligible countries in sub-Saharan Africa.\nBased on the WHO’s estimate, the malaria vaccine can significantly reduce child illness and death from malaria, and save an additional 80 000 African children annually."
  },
  {
    "headline": "More mergers seen in manufacturing as productivity aches persist",
    "summarized_story": "Economic experts have projected the possible increase in the number of mergers and acquisition of manufacturing firms in Nigeria as productivity level declines due to production challenges, rising energy cost and widening supply gap.\nOnyebu revealed that within the last two years, no less than 10 percent of manufacturing firms in the Amuwo-Odofin axis have shut down operations while many more are reducing production activity.\n“The manufacturing sector will witness mergers and acquisitions going forward in order to prevent a shutdown because the macroeconomic condition is not really favorable for businesses and consumers,” Jide Bababtope, an economic analyst told BusinessDay.\nHe explained that manufacturer’s profitability and productivity are already pressured without an avenue for outlet as consumer’s purchasing power and preference for affordability will not permit an increase in prices.\nIn the last six to twelve months, manufacturing companies have been acquired by companies with stronger fundamentals as macroeconomic conditions, production challenges, etc."
  },
  {
    "headline": "PHOTOS: Workers’ Day Celebration In Edo – Nigerian Observer",
    "summarized_story": "Check AlsoBENIN CITY- The Edo State Police Command said its operatives have killed five suspected kidnappers …"
  },
  {
    "headline": "Eid-el-Fitr: Obaseki felicitates with Muslim faithful, urges love, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Governor of Edo State, Mr. Godwin Obaseki, has congratulated Muslims in the state as they celebrate Eid-El Fitr after the successful completion of the Ramadan fast.\nIn his Eid-El Fitr message, Obaseki charged Muslim faithful to sustain the lessons of sacrifice, selflessness, tolerance, discipline and love learnt during the period of Ramadan, noting that the virtues are necessary in achieving peace, unity and sustainable socio-economic development in the country.\nObaseki said, “I felicitate with our Muslim faithful on the occasion of Eid-el-Fitr after completing the Ramadan fast, a major pillar of Islam.\n“However, I urge you not to forget the lessons learnt during this period.\nWe must continue to imbibe the virtues of love, tolerance, sacrifice and charity, as taught by the Holy Prophet Mohammed (S.A.W), as it is only then can we be certain of achieving peace and unity, and place the country on the path of sustainable development.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Catholic priest joins governorship race in Benue – Nigerian Observer",
    "summarized_story": "Hyacinth Alia, a Catholic Priest and governorship aspirant on the platform of the All Progressives Congress (APC) has sought support as he joined the 2023 governorship race in Benue.\nThe News Agency of Nigeria (NAN) recalls that In 1992, Benue had a civilian governor and Catholic priest, late Rev.\nRolling out his Seven Point agenda for development of Benue, Alia said his mission was to ensure that government continued to priorotise the needs of residents and people of the state.\nHe urged all Benue indigenes to rise up and join him to change the “ugly political narrative in the state.\nEarlier, the Chairman of the Alia Alliance, Mr Peter Ashiekaa appealed to the Benue indigenes in Abuja to throw their weight behind what he called, the ‘Divine Project’."
  },
  {
    "headline": "Workers’ Day: Obaseki increases minimum wage to N40,000",
    "summarized_story": "…Approves payment of harmonized pension from May 2022The Edo State Governor, Mr. Godwin Obaseki, has approved #40,000 as the new minimum wage for workers in the state, in commemoration of this year’s Workers’ Day.\nObaseki noted, “As we all know, the minimum of N30,000 can barely sustain a family.\n“The government of Edo has now decided to review the minimum for Edo workers from N30,000 to N40,000 a month.\nHe stated, “I am particularly interested in our senior citizens because they are one of the most vulnerable in our society.\nObaseki however urged workers in the state to take advantage of opportunities offered by his administration in the agricultural sector to increase food production in the country."
  },
  {
    "headline": "Osun 2022: Senator Oriolowo organises prayer for Gov Oyetola’s reelection bid",
    "summarized_story": "Adelere Oriolowo on Saturday, at Iwo, organised a special prayer session for Governor Gboyega Oyetola’s reelection bid ahead of the state’s July 16 governorship election.\n“There was never be any disagreement or misunderstanding between me and Governor Oyetola, we are always together.\n“Those spreading false information about my relationship with Governor Oyetola are merely looking for cheap publicity and make a living out of falsehood.\nThis (second term senatorial bid) is not going to be different.\n“Governor Oyetola took the state out of depts of half-salary to the glory of comfort to the betterment of workers and retirees."
  },
  {
    "headline": "Gunmen unleash terror on Anambra, kill soldier, five others",
    "summarized_story": "Gunmen have killed a soldier and five civilians in a attack in the Anaocha and Nnewi South Local Government Areas of Anambra State.\nFive of the victims were said to have been killed at a restaurant in Obiofia village, Osumenyi, in Nnewi South.\nA source said the gunmen carried out the operation with over three exotic vehicles suspected to have been snatched from unsuspecting members of the public.\nWe saw them; some people even tried to make videos, but everyone was afraid not to be spotted and shot,” the source added.\nVideos from the scene of the incident that trended on social media also showed four male victims and Ndụ lying lifeless in a pool of blood."
  },
  {
    "headline": "FirstBank pays N56bn as commission to Firstmonie agents in 4 years",
    "summarized_story": "FirstBank Nigeria Plc has said it paid N56 billion to FirstMonie agents as commission in four years.\nAdeduntan said FirstBank is deliberately driving impactful programmes that are necessary to achieve shared prosperity for both current and future generations.\nHe also highlighted FirstBank’s Common Good Programmes, which include Financial Inclusion; Responsible Lending/Banking; CRS and Sustainability Actions.\nHe further explained that these programmes cover Agent Banking, FirstMonie, Value Proposition; Women Empowerment; Small & Medium Scale (SME) Business Support and Capability Enhancement Programme; and Employee Volunteer, Start Performing Random Act of Kindness (SPARK), Programme.\n“Over 500, 000 direct and indirect jobs created to tackle unemployment through the FirstBank’s FirstMonie agent network."
  },
  {
    "headline": "IPOB using propaganda to malign us – Nigerian army",
    "summarized_story": "The Nigerian Army has said members of the proscribed Indigenous People of Biafra (IPOB) are using pictures of fake soldiers arrested by Nigerian army troops recently to malign the institution.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu said this in a statement on Sunday in Abuja.\nHe said the said Okafor also alleged that about 87 per cent of Nigerian soldiers were kidnappers and bandits.\nNwachukwu said the said report was a creation of IPOB/ESN social media foot soldiers, with the intent to malign the Nigerian army.\n“Members of the public are therefore urged to disregard this mindless and irresponsible propaganda clearly emanating from IPOB, aimed at promoting insecurity in the country,” he said."
  },
  {
    "headline": "Alleged Fraud: EFCC Declares Rivers Accountant-General, 58 Others Wanted",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), has declared about 59 suspects wanted for various fraudulent activities amounting to about N435bn and $397,758,000.\nAmong the 59 were four Rivers State government officials including the Accountant-General of the State, Fubara Siminayi, wanted over suspected N117 billion fraud, alleged criminal conspiracy, money laundering, and misappropriation of public funds and abuse of office.\nThe Commission, in a wanted list posted on its website, said the offences range from money laundering to obtaining money by false pretence, fraud, internet-related offences and issuance of dud cheque.\nADVERTISEMENTAnother major suspect on the wanted lists is one Maxwell, wanted by the EFCC in an alleged case of conspiracy, obtaining money by false pretence and money laundering to the tune of N213bn.\nA native of Plateau State, identified as Noel, was declared wanted in a case bordering on conspiracy, theft and money laundering to the tune of N131 million."
  },
  {
    "headline": "Youths Task FCT Senator On Inclusive Representation",
    "summarized_story": "The leadership of the Federal Capital Territory (FCT) Resident YouthS Association, has called on the Senator representing the FCT, Philip Aduda, to ensure more youth participation and inclusion in democratic process within the FCT.\nThe association made the call after the Senator’s declaration for third term in the red chamber.\nADVERTISEMENTAccording to him, “However, the senatorial representation style since 2011 has constantly been so weak and refused to aggregate the interests of the Resident Youths, a clear indicator of a non-inclusive representation.\nThe President expressed his confidence in the capacity and competence of the members of the Association to make meaningful and mutually beneficial input to representation in FCT, a potential that has been left untapped for several years.\nHe alluded to the failure of the mayoral status bill at the Senate as an opportunity to liberate the people of FCT that was lost again and reiterated the residents Youth support to reawaken the bill."
  },
  {
    "headline": "May Day: Obaseki Approves N40,000 Minimum Wage For Edo Workers",
    "summarized_story": "The Edo State governor, Mr. Godwin Obaseki, has approved N40,000 minimum wage for workers in the State, jerking it up from the former N30,000, to cushion the hardship being experienced by the workers, particularly the effects of rising food prices.\nObaseki made the announcement at the Samuel Ogbemudia Stadium in Benin City, the Edo State capital, on Sunday, May 1, 2022, during the May Day celebration.\nADVERTISEMENT“For the Edo worker to be effective, we have decided to review upwardly the N30,000 minimum wage of workers so that they can meet their basic needs.”He explained that his administration was not unaware of the hardship being experienced by workers, and said that the current minimum wage of N30,000 could barely sustain the Nigerian workers given the harsh economic realities in the country.\n“Accordingly, the Government of Edo State has decided to review the minimum wage of Edo workers to N40, 000 a month,” he declared.\nADVERTISEMENTThe event was rounded off with a parade by the various workers’ unions in the state."
  },
  {
    "headline": "May Day: Obaseki Approves N40,000 Minimum Wage For Edo Workers",
    "summarized_story": "The Edo State governor, Mr. Godwin Obaseki, has approved N40,000 minimum wage for workers in the State, jerking it up from the former N30,000, to cushion the hardship being experienced by the workers, particularly the effects of rising food prices.\nObaseki made the announcement at the Samuel Ogbemudia Stadium in Benin City, the Edo State capital, on Sunday, May 1, 2022, during the May Day celebration.\nADVERTISEMENT“For the Edo worker to be effective, we have decided to review upwardly the N30,000 minimum wage of workers so that they can meet their basic needs.”He explained that his administration was not unaware of the hardship being experienced by workers, and said that the current minimum wage of N30,000 could barely sustain the Nigerian workers given the harsh economic realities in the country.\n“Accordingly, the Government of Edo State has decided to review the minimum wage of Edo workers to N40, 000 a month,” he declared.\nADVERTISEMENTThe event was rounded off with a parade by the various workers’ unions in the state."
  },
  {
    "headline": "Train Attack: SERAP Drags Federal Govt To ECOWAS Court",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP), has dragged the Federal Government of Nigeria before the ECOWAS Court of Justice in Abuja over the failure of the government to rescue the kidnapped victims of the Abuja-Kaduna train attack.\nSERAP urged the regional court to declare that the train attack, abduction and killing of passengers by terrorist amounts to a failure by the government to protect Nigerians and to prevent the grave human rights violations.\n“A fundamental notion of contemporary human rights law is that victims of violations such as the victims of the Abuja-Kaduna train attack enjoy an independent right to effective remedies.\n“Human life has a special value and dignity which requires legal protection.\nADVERTISEMENT“Few days before the train attack, some terrorists had gained control of and entered the Kaduna airport in a daring attack."
  },
  {
    "headline": "3-storey building collapses in Lagos, many trapped [Video]",
    "summarized_story": "A 3-storey building has collapsed into rubble in Ebute Meta in Lagos, with many residents trapped.\nThe building on 32 Ibadan Street collapsed into a heap around 9:30pm on Sunday.\nLagos State Fire and Rescue Service said its officials were alerted about the building around 21:48 hours on Sunday.\nSearch and rescue operations have begun, along with men of the Lagos State Emergency Management Agency.\nVideo of the wreckage shared on social media showed a large crowd lamenting and shouting that people were inside"
  },
  {
    "headline": "Notorious Church thief 'Bouncer' electrocuted",
    "summarized_story": "By Ijendu IheakaThe Abia Police Command has confirmed the electrocution of a notorious thief called “Bouncer” while stealing from a church in Aba.\nA worker in the Church who pleaded anonymity, said they had recorded several robbery incidents in the church premises with no one ever caught.\nHe said Bouncer was heard shouting ‘oh Jesus’ inside the Church premises about midnight on Saturday 30 April.”He said they discovered the corpse of the street Urchin early on Sunday morning, confirming suspicions that the thief lived around the church.\nHe alleged that the deceased had jumped into the church premises through the rear fence, dismantled other equipment, cutting wires when power was restored, leading to his electrocution.\n“We discovered the thief pulled down some blocks while jumping into the church compound to do his thing."
  },
  {
    "headline": ": Train Attack: Terrorists Release Sadiq Ango Abdullahi",
    "summarized_story": "Terrorists who kidnapped Abuja-Kaduna train passengers freed Sadiq Ango Abdullahi, son of Professor Ango Abdullahi, Chairman of the Northern Elders Forum (NEF), and his late wife, Senator Aisha Jummai Alhassan, called Mama Taraba, over the weekend.\nJournalists were told that Sadiq was released on Friday after a ransom was paid to the terrorists after he had been held captive for nearly a month.\nThe police had not yet responded to the development.\nDetails later…"
  },
  {
    "headline": "Pandemonium As Muslim Worshippers, Hoodlums Clash In Lagos",
    "summarized_story": "Many were feared injured in the early hours of Sunday when a group of Muslim worshippers and hoodlums clashed in the Marina area of Lagos.\nThe reason for the fracas, which lasted from 1 am-5am, according to sources remains unknown.\nThe Nation learned that several dangerous weapons such as cutlasses, knives, and others were used during the brawl, which saw several properties vandalized in the Marina area.\nAn eyewitness said: “I think the area boys tried to rob the Muslims during their early morning prayers and the Muslim folks resisted them which caused the fight.”It was gathered that some men from the Lagos State Neighbourhood Safety Corps(LNSC) later showed up and chased the hoodlums away."
  },
  {
    "headline": "Ex-Govs Dariye, Nyame remain in prison after Buhari’s pardon",
    "summarized_story": "Former Governor of Plateau State, Joshua Dariye, and his counterpart, Jolly Nyame of Taraba State are yet to be released from Kuje Correctional Centre, The Nation learnt yesterday.\nThis is about two weeks after they were pardoned by the National Council of States alongside 157 others.\nDariye was said to have shed tears of joy on learning about his pardon.\nBut the Federal Government is yet to send documents regarding their pardon to the Correctional authorities to enable them to perfect the process for their release.\nDariye and Nyame were jailed for corruption charges by the Federal Government."
  },
  {
    "headline": "One Dies, Many Injured As Police, Shiites Clash In Kaduna",
    "summarized_story": "One Dies, Many Injured As Police, Shiites Clash In KadunaSecurity agents and members of the proscribed Islamic Movement of Nigeria (IMN), often known as Shi’ites, battled in Kaduna on Saturday, killing one person and injuring several others.\nThe trouble began when Shi’ites were marching in a parade to commemorate the annual Quds Day, and security agents stationed along main roadways in Kaduna and Zaria attempted to disperse the assembly.\nSecurity agents fired tear gas and live gunfire at protestors, according to an eyewitness who requested anonymity, while other Shi’ites set fire to numerous vehicles in Zaria.\nHe denied allegations that a police station was burnt and that the Shi’ites had set ablaze vehicles.\nThe Kaduna State Police Command Public Relations Officer, ASP Mohammed Jalige did not pick up his calls for comments."
  },
  {
    "headline": "Nigerian workers used their zeal, sweat to build our nation – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has extolled the virtue of the Nigerian workers whom he said sacrificed their ‘sweat and zeal’ to nurture the nation from birth till date.\nHe said: “The labour movement is a foundational movement in the making of our nation.\n“Over a century ago, the Nigerian working class laid the railway tracks and erected telegraph poles connecting the vast reaches of a country that was about to be born.\n“In this epic struggle, the Nigerian working class was the army of the nationalist movement.\nTherefore, the Nigerian worker in every real sense laid the foundations of our sovereignty and freedom with their blood and tears and nurture it till this day with their sweat and zeal."
  },
  {
    "headline": "2023: Women, youths celebrate as advocate, Mary Ikoku, picks House of Reps forms (PICTURES)",
    "summarized_story": "A philanthropist and strong public advocate, Chief (Mrs) Mary Ikoku, has joined the race to represent Ohafia/Arochukwu federal constituency of Abia state in the House of Representatives ahead of 2023 general elections.\nMary, publisher of Working Moms Africa Magazine and founder Emerge Women Development Initiative has now obtained expression of interest and nomination forms from the ruling All Progressives Congress (APC) in readiness for party primaries in coming weeks.\nI am Nwanyi bu Ihe, ihe ga adi na Arochukwu-Ohafia Constituency come 2023.\nAt the meeting, the elated women leader while hailing the House of Representatives hopeful expressed optimism that Chief (Mrs) Mary would beyond clinching APC ticket, win at the general election.\nEdu who repeatedly promised to continuously support Mary’s aspiration said it was high time women of proven character are entrusted with public positions."
  },
  {
    "headline": "Breaking: Anambra boils as gunmen attack PDP presidential aspirant’s community, soldiers feared shot (VIDEO)",
    "summarized_story": "Unknown gunmen, Saturday, attacked Agulu, a community in Anaocha local government area, Anambra state, forcing soldiers at a checkpoint to flee.\nAgulu is a country-home of the presidential aspirant of the Peoples Democratic Party (PDP) and former governor of Anambra State, Mr Peter Obi.\nAlthough, voices in the trending video claimed that some of the soldiers were actually killed at the spot, no casaulty was shown but gunshots were heard.\nThe Police Public Relations Officer (PPRO) in Anambra state, DSP Tochukwu Ikenga, did not respond to call to confirm the report as at press time.\nAnother group of gunmen also unleashed attack during Easter in Anambra state."
  },
  {
    "headline": "Seplat Energy’s revenue grows by 58.6% to N100.6bn",
    "summarized_story": "The company also generated cash from its operations to the tune of N74.4bn from N1.7bn year-on-year, rising by 197.8 per cent.\nThe energy Company’s also grew its revenue by 58.6 per cent to N100.6bn from N57.9bn year-on-year; as its gross profit soars to N48.8bn from N20.1bn year-on-year, rising by 122.3 per cent.\nIn its operations, Seplat Energy demonstrated a strong safety record, which extended to 26.1 million hours without LTI from operated assets (2.0 million hours in Q1 2022).\nIt will also bring a significant undeveloped gas resource base which, alongside our ANOH gas project development, will underpin Nigeria’s energy transition and drive domestic and export revenues when developed.\n“We have proven we have the financial strength and credibility to attract international finance into Nigeria’s energy sector and this will help us in our aim to deliver energy transition and provide cleaner, more reliable and more affordable energy for Nigeria’s young and growing population.”"
  },
  {
    "headline": "Women in Oil, Gas to benefit from $40m NCDMB/NEXIM Bank Fund- Wabote",
    "summarized_story": "By Palma IleyeExecutive Secretary of the Nigerian Content Development and Monitoring Board, NCDMB, Engr.\nSimbi Kesiye Wabote has said on Wednesday that women entrepreneurs in the Nigerian oil and gas industry should break barriers by taking advantage of the $40m fund created specifically for them under the Nigerian Content Intervention Fund, NCI Fund.\n“To provide a fair chance for women in the oil and gas industry, the Board partnered with the NEXIM Bank to establish a $20 million fund that was matched with an additional $20 million fund by NEXIM bank, making the total pool of funds available to women in oil and gas to be $40 million,” he said.\nHe explained that the Board and its partners have introduced and implemented several initiatives that promote diversity in the oil and gas industry.\nHe added that “the Board has also organized events that were targeted at women and community activities to promote inclusiveness."
  },
  {
    "headline": "N69.4bn Debt: Court orders stay of contempt proceedings initiated by Jimoh Ibrahim against AMCON",
    "summarized_story": "CA/ABJ/CV/269/2022 in the case between the Asset Management Corporation of Nigeria (AMCON) vs Barrister Jimoh Ibrahim has ruled that all proceedings including the contempt proceedings initiated by Barrister Jimoh Ibrahim and co at the trial court should be stayed pending the hearing, and determination of the substantive appeal.\nWith that ruling, Barrister Jimoh Ibrahim and Co have been again neutralized from executing the said contempt proceedings order, which he obtained under questionable circumstances.\nAMCON over the years had tried all reasonable and peaceful resolution strategies to recover the debt from Jimoh Ibrahim to no avail.\nFHC/ABJ/CS/760/2021 to seek justice, and accordingly received an order of the trial court to take over the businesses of Jimoh Ibrahim.\nAMCON further received the backing of the trial court to appoint a Receiver/Manager to oversee the businesses on behalf of AMCON."
  },
  {
    "headline": "MTNN, Pan-Atlantic University launch media innovation programme",
    "summarized_story": "By Kehinde Ibrahim, LagosMTN Nigeria and Pan-Atlantic University (PAU), yesterday, announced the launch of the MTN Media Innovation Programme (MTN MIP), which will be run by PAU’s School of Media and Communication (SMC).\nThe six-month, fully funded fellowship for Nigerian media practitioners is designed to support the sustainable development of the nation’s changing media scene.\nIt is open to media practitioners across the spectrum, including print, electronic, online platforms and social media content creators.\nThus, it is only fitting that we support developments in the Nigerian media space with our infrastructure and enable capacity building initiatives to enable innovation in media practice.\nThe MTN Media Innovation Programme could not have come at a better time for Nigerian media practitioners to imbibe these pertinent values,” Professor Enase Okonedo, Vice Chancellor, Pan-Atlantic University, added."
  },
  {
    "headline": "NCC moves to strengthen colocation, infrastructure sharing market segment",
    "summarized_story": "By Asuelimen OsasuyiNigerian Communications Commission, NCC, has commenced the process of conducting a study to assess the current level of competition in the colocation and infrastructure sharing, CIS, segment of the Nigerian telecommunications sector.\nAccording to NCC, seventy-eight licensees are currently operating in that market segment.\nThe NCC takes this issue as priority in view of the critical role played by the colocation and infrastructure sharing segment of the telecom ecosystem in ensuring robust services.\nFor instance, at the time the 2013 study was conducted, the CIS market segment was still at embryonic stage and as such, much emphasis was not placed on it.\nThe Director PCEA also informed that activities in the CIS market have also attained the targets set out in the Nigerian National Broadband Plan (2020-2025)”."
  },
  {
    "headline": "Labour Day: Workers Hold Rallies, Advocate For Better Welfare",
    "summarized_story": "﻿ ﻿It’s May Day, a day set aside to celebrate workers and highlight their struggles.\nHere in Nigeria, led by the labour unions, workers are holding rallies across the country to mark the event and advocate for better welfare.\nRead Also: [Labour Day] Lawan Seeks ‘Speedy’ End To ASUU StrikeWhat Leaders Are Saying:NASSSenate President Ahmad Lawan has assured workers that the National Assembly will continue to partner with the Organised Labour to address issues relating to them.\n“Today is Workers’ Day.\nAddressing the state workers at the occasion, Governor Abiodun appreciated them for their loyalty, professionalism and perseverance in the face of the global socio-economic challenges."
  },
  {
    "headline": "Workers’ Day: Obaseki Increases Minimum Wage To N40,000",
    "summarized_story": "Edo State Governor, Godwin Obaseki, on Sunday approved N40,000 as the new minimum wage for workers in the state in commemoration of 2022 Workers’ Day.\nObaseki, who made the announcement in Benin while delivering his 2022 Workers’ Day speech, said his government will continue to prioritise the welfare of Edo workers, equipping them with the capacity and environment to deliver efficient and quality service to the people.\nI announced that we have reviewed the minimum wage for Edo workers from N30,000 to N40,000 a month.\npic.twitter.com/6KGVjpcXjX — Godwin Obaseki (GGO) (@GovernorObaseki) May 1, 2022“As we all know, the minimum of N30,000 can barely sustain a family.\n“The government of Edo has now decided to review the minimum for Edo workers from N30,000 to N40,000 a month."
  },
  {
    "headline": "Sallah: Final Victory Against Terrorists Is Within Sight – Buhari",
    "summarized_story": "President Muhammadu Buhari has felicitated Muslims on the Eid Mubarak celebrations, reiterating his administration’s commitment to tackling terrorism in the country.\nBuhari in a statement on Sunday by his spokesman, Garba Shehu, said the final victory against Boko Haram/Islamic State of West Africa Province is within sight.\nAccording to him, the Federal Government is getting the latest military acquisitions across the region to thwart acts of terror.\nThe battle waged against terrorists who falsely masquerade under the name of Islam is approaching its conclusion,’’ said the President.\nThe final victory is within sight."
  },
  {
    "headline": "Soyinka Visits Igboho In Benin Republic",
    "summarized_story": "Nobel Laureate, Wole Soyinka, on Sunday met with Yoruba Nation campaigner, Sunday Adeyemo, also known as Sunday Ighoho.\nThis is coming about five weeks after Akintoye announced the release of Ighoho in the Benin Republic.\nIn July 2021, Igboho fled his Ibadan residence and escaped to the neighbouring Francophone country.\nHe was arrested by the Interpol at a Benin airport on July 19, 2021, while boarding a flight to Germany.\nAfter spending about nine months in a detention facility in the Benin Republic, Igboho was released on health grounds."
  },
  {
    "headline": "‘It’s A Question Of Morality’: Afenifere Re-Echoes Call For South-East Presidency",
    "summarized_story": "The pan-Yoruba socio-cultural group, Afenifere, has re-echoed calls for the presidential seat to be zoned to the South-East region of the country, insisting its stance is based on morality.\nIt is a question of morality.\nIt’s a question of being inclusive in everything we do,” he said during an interview on Channels Television’s Sunday Politics.\nIs it not in Nigeria?” the Afenifere leader asked, maintaining that the country had always given consideration to every part even during the pre-Independence days.\nState police, he said, is the panacea to tackling the rising levels of insecurity across the country, lamenting the increased crime rate."
  },
  {
    "headline": "2023 Presidency: MASSOB leader, Uwazurike leads thousands of youths in solidarity march for Yahaya Bello -",
    "summarized_story": "The youths, who started the procession from the MASSOB leader’s House in Owerri, marched through the streets, carrying different placards, with inscriptions such as “Power to the Youths, Support Yahaya Bello”, “Youths Can Also Lead”, and “Yahaya Bello for the Youths”, among others.\nAccording to them, in this regard, Governor Bello is the right fit for the position of President of the Federal Republic of Nigeria.\n“All Nigerians should rally round the youthful Governor, Yahaya Bello.\nWe are supporting Yahaya Bello for this and no one else.\nWe must give youths a chance, especially one that has demonstrated uncommon capacity, in the person of Yahaya Bello,” he said."
  },
  {
    "headline": "British Member of Parliament to resign for Watching Porn in Parliament",
    "summarized_story": "A Conservative British Member of Parliament, Neil Parish, has announced that he will resign after admitting twice watching pornography in the House of Commons.\nParish told the BBC the first time he viewed the explicit material was an accident after searching online for farm vehicles.\nThe Government of Prime Minister, Boris Johnson, is engulfed in numerous scandals, just days ahead of crucial local elections.\nThe Prime Minister himself has been fined by police for breaching his own Covid rules during the 2020 lockdown, and faces an investigation into whether he misled Parliament about parties in Downing Street.\nWe support his decision to step down as our Member of Parliament.”"
  },
  {
    "headline": "Peterside asks Wike to release detained Farah Dagogo within 48 hours -",
    "summarized_story": "Wike on how he obtained evidence linking the lawmaker to an alleged disruption of proceedings at the Rivers State Secretariat of the Peoples Democratic Party, PDP.\n“Wike had lied at several times such that these days his claims must be subjected to forensic investigation before believed.\nWhile calling on lovers of democracy and free speech to condemn Wike and his fascist style of governance, Peterside reiterated his 48-hour ultimatum to Gov.\n“Wike has 48 hours to ensure that Honourable Farah is set free and allowed to continue to pursue his political aspiration.\nWike cannot be junketing in pursuit of his presidential ambition using Rivers State resources while wickedly gagging another’s on the altar of ego."
  },
  {
    "headline": "Asiwaju Tinubu Receives APC Presidential Nomination Forms -",
    "summarized_story": "The National Leader of the All Progressives Congress and Frontline Presidential Aspirant, Asiwaju Bola Ahmed Tinubu, has received his Expression of Interest and Nomination Forms to enable him participate in the Presidential Primaries of the Party.\nAsiwaju Tinubu who just returned to the Country after performing the lesser Hajj (Umrah) in Mecca received the forms from Lagos State Governor, Babajide Olusola Sanwoolu.\nHis support groups led by former Secretary to the Government of the Federation, Babchir Lawal, and Senator Dayo Adeyeye purchased the forms for him on Friday afternoon.\nThe Party’s Presidential Primaries will hold between the 30th of May and 1st of June.\nThe Party’s Presidential contest has become increassingly crowded in recent days with the declaration of the Vice President Yemi Osinbajo, Governors Yahaya Bello of Kogi State and Kayode Fayemi of Ekiti State, Senators Ibikunle Amosun and Chris Ngige, Minister of Transportation, Rotimi Amaechi, Minister of Education, Chkwuemeka Nwajiuba and Others."
  },
  {
    "headline": "Kingsley Moghalu: I’m The Complete Package for the Nigerian Presidency In 2023",
    "summarized_story": "African Democratic Congress presidential aspirant, Kingsley Moghalu, speaks exclusively to ARISE on #TheMorningShow about his intentions and plans if he were to win the 2023 presidential elections.\nHe shares his philosophies and thoughts with regards to the economic realities in the country and what he can do to turn it around from the highest seat in office."
  },
  {
    "headline": "15% Levy on Imported Used Vehicles Illegal, Nigeria’s Clearing Agents Tell Buhari",
    "summarized_story": "Clearing agents under the aegis of the National Council of Managing Director of Licensed Customs Agents (NCMDLCA), have told President Muhammadu Buhari that there is no provision for the National Automotive Council (NAC) levy of 15 per cent in either the 2020 or 2021 Finance Act, stressing that its implementation by the Nigeria Customs Service (NCS) is illegal.\nAmiwero, who was also a member of the presidential committee on the review of customs laws, therefore, called for a review of the auto policy.\nAccording to him, the Finance Act 2020 specifically approves for motor vehicles the amendment of the First Schedule to the Act, which is amended by inserting and replacing duties and levies.\nHe said: “Duty on Tractors (Heading 8701) from 35 per cent to five per cent; duty on motor vehicles for the transportation of more than 10 persons (HS Heading 8702) from 35 per cent to 10 per cent; levy on motor vehicles for transportation of persons (cars) (HS Headings 8703) from 35 per cent to five per cent and duty for motor vehicles for transportation of goods (HS Heading 8704) from 35 per cent to 10 per cent”.\n“Finance Act provides for five per cent levy for Motor vehicles of Chapter 8703, that is cars; there is no provision for NAC levy of 15 per cent in either 2020 and 2021 Finance Act passed by the National Assembly and signed in to law."
  },
  {
    "headline": "Flour Mills of Nigeria Completes Acquisition of 71% Stake in Honeywell Flour Mills",
    "summarized_story": "Flour Mills of Nigeria Plc (FMN) has announced that it has completed the acquisition of a 71.69 per cent stake in Honeywell Flour Mills Plc (HFMP).\nIt also acquired a 5.06 per cent stake in HFMP held by First Bank of Nigeria Limited.\n“At a total enterprise value of N80 billion, Honeywell Group disposed of a 71.69 per cent stake in HFMP to FMN.\n“Our combined brands and businesses will mean an expansive scale of food production for both Nigeria and Africa and together, Flour Mills of Nigeria and Honeywell Flour Mills will be able to achieve rapid growth while maintaining high-quality products serving the evolving needs of our consumers.\n“As we entrust Flour Mills of Nigeria with building on Honeywell Flour Mills’ strong legacy, we will work closely with them to ensure seamless integration, setting the combined company up for a successful future."
  },
  {
    "headline": "Nigeria: Jonathan’s Rumoured Ambition Poses No Threat, Say Osinbajo, Tinubu’s Support Groups",
    "summarized_story": "Jonathan had recently revealed that he was still considering the call on him to contest the 2023 presidential election.\nReacting, the Tinubu Support Group (TSG) said that it remained unperturbed about the speculation that Jonathan would contest on the platform of APC.\nAdeyanju thought that the purported coming of Jonathan to APC would not jeopardise the chances of the former Governor of Lagos state.\nHe noted that it was laughable to abhor the thought that Jonathan’s entrants into the race would scuttle Osinbajo’s chances.\nHe said the ruling party knows Okorocha’s credentials, adding that it doesn’t matter if former President Jonathan joins the race."
  },
  {
    "headline": "OPEC Signs Deal to Fund Feasibility Study of $25bn Nigeria-Morocco Gas Pipeline",
    "summarized_story": "The Organisation of Petroleum Exporting Countries (OPEC) Fund has announced that it will contribute $14.3 million to Phase II of the feasibility study for the Nigeria-Morocco Gas Pipeline estimated at $25 billion.\nThe study will carry out detailed evaluations of the implementation and design process for the eventual construction of the gas pipeline, thus facilitating the final investment decision.\nMorocco and the OPEC Fund signed an agreement at the weekend to jointly fund the feasibility study ahead of the construction of the world’s longest offshore pipeline connecting Nigeria to Morocco.\nCo-financed with the Islamic Development Bank (IDB), the study comprises a body of research on the execution of the Nigeria-Morocco Gas Pipeline, including the technical, financial, and legal aspects, a statement after the event indicated.\nThe five oil majors initially owed by the national oil company were: Shell Petroleum Development Company (SPDC), Mobil Producing, Nigeria, Chevron Nigeria Limited, Total Exploration as well as Nigeria Agip Oil Company (NAOC)."
  }
]