[
  {
    "headline": "Anxiety as ASUU makes decision on strike Monday",
    "summarized_story": "The Academic Staff Union of Universities is expected to come up with a decision on whether to embark on fresh industrial action known on Monday (today).\nMembers of the union’s National Executive Council have been holding marathon meetings since Saturday.\nASUU decided to embark on the two-day meeting after it had sensitised and mobilised lecturers and students across all universities on the reason the union might likely go on strike.\n), over the lack of implementation of the Memorandum of Understanding the government signed with ASUU in 2009 and others.\nBut ASUU national president, Prof. Emmanuel Oshodeke, and other leaders across the campuses insisted that the Federal Government could not be trusted following its consistent refusal to implement the Memorandum of Action it signed with the union, leading to the suspension of the 2020 strike action."
  },
  {
    "headline": "Arrears: Legislative aides report N’Assembly to EFCC, ICPC today",
    "summarized_story": "The PUNCH reliably learnt on Thursday that the aggrieved aides had already petitioned the leadership of the National Assembly and security agencies, and had now resolved to involve the anti-graft agencies.\nThe Clerk to the National Assembly, Amos Ojo, who spoke through his aide, Austin Adesoro, however, stated that the management was in talks with the leadership of the National Assembly Legislative Aides’ Forum, the umbrella body of the legislative aides, while dismissing the protesting aides as acting in ignorance.\nAre they saying that the clerk should go against the law and pay the legislative aides the arrears?\n“We are appalled by the discretionary manner in which the CNA runs the affairs of the National Assembly.\nSome of these steps include but are not limited to media campaigns/interviews, submission of petitions to the EFCC and ICPC, and ultimately instituting a suit against the CNA and the National Assembly as an institution."
  },
  {
    "headline": "Osinbajo urges vibrant housing market to boost economy, livelihood",
    "summarized_story": "Earlier, Mr Sam Odia, the National Director of the Millard Fuller Foundation expressed appreciation for the Vice President’s presence to commission the housing units.\nThe Millard Fuller Foundation was founded in 2006 and has been working on more inclusive housing for low-income Nigerians.\nThe Federal Government’s N-Power programme also partners with the MFF “as an official building skills training centre.”Also, Chairman, Board of Directors of the Millard Fuller Foundation, Pastor.\nSolomon Yero, said: “We are working hard to improve invisibility of the affordable housing market.\nPrior to that, fuller housing projects have consistently been a most affordable in Nigeria.”"
  },
  {
    "headline": "22 year old Nigerian writer set to take over book writing industry",
    "summarized_story": "Roli Hazel is a multi talented writer that has enjoyed unparalleled success in her writing career.\nThe first jaw dropping moment came with the release of her Audio book titled “I love you” in May which surpassed 657,000 streams in less than three weeks after release.\nREAD ALSO:Reps summons NPA boss over $195m Deep Blue contractThe anticipated release of her Audio book in the United States already registering a pre order for 12 million copies.\nSignificantly, the most outstanding feat being her book “A penny for a tale” credited as the first ever epistolary novel in WhatsApp format.\nAlthough not much is known about the author’s personal life as her only registered presence on social media is her Instagram account set to private."
  },
  {
    "headline": "APC ‘ll continue to rule Lagos, Nigeria — Senate President, Lawan",
    "summarized_story": "*** Urges Nigerians to Continue to Trust APC to rule NigeriaBy Henry Umoru, ABUJAPRESIDENT of the Senate, Senator Ahmad Lawan has boasted that the ruling All Progressives Congress, APC will continue to rule Lagos State and Nigeria as a country.\nThe event which was held at the premises of the Nigeria Police College, Ikeja was also witnessed by the Lagos State Governor, Babajide Sanwo-Olu.\nYou have been consistent in terms of service delivery to the people of Lagos State and indeed this country.\nThe Senate President said the constituency projects were essentially to complement the efforts of the Federal and state governments.\nOn the Senate President entourage from Abuja were Senator Mohammed Sani Musa, Senator Micheal Opeyemi Bamidele and Senator Yakubu Oseni."
  },
  {
    "headline": "Former President Jonathan mourns Magajin Garin Sokoto, Danbaba",
    "summarized_story": "Former President Dr Goodluck Ebele Jonathan has expressed sadness over the passing of Magajin Garin Sokoto, Alhaji Hassan Danbaba who died on Saturday after a brief illness.\nIn a condolence message to the Sultan of Sokoto, the Government and the people of Sokoto State, Dr Jonathan described the late Danbaba as a distinguished leader and traditional ruler whose peaceful disposition endeared him to many people across the country.\nThe former President stated: “I am saddened by the sudden exit of Alhaji Hassan Danbaba, the Magajin Garin Sokoto.\nHe was a distinguished traditional ruler, charismatic leader and bridge-builder who was unflinching in his constant engagement with both traditional and political leaders across the country, towards fostering national unity.\n“He will be sadly missed not only by the people of Sokoto but by all who related with him because of his peaceful disposition and love for humanity."
  },
  {
    "headline": "APC collapses in Udu as 2,000 leaders, members embrace PDP",
    "summarized_story": "Chief Eddie Ono-Sorhue, Chairman PDP Elders Council.\nA cross section of some members that defected to PDP with Udu PDP leaders at the reception ceremony on Saturday.\nThe All Progressives Congress, APC, in Udu Local Government Area of Delta State have totally collapse into the People’s Democratic Party, PDP, with over 2,000 party leaders, elders and members leaving APC with a pledge to join hands with Governor Ifeanyi Okowa to deliver the PDP in 2023.\nThe decampees, led by octogenarian Chief S. M. Savbede, a former councillor and state elder of the APC, and Chief Sylvester Kowho, were received on Saturday by the PDP elders and leaders council in Udu led by Chief Eddie Ono-Sorhue with the PDP Chairman in Udu, David Siloko in attendance.\nAside those who spoke during the ceremony, the decampees include Chief Maxwell Osiobe, Hon Benjamin Mragbozo and others."
  },
  {
    "headline": "Troops foil ISWAP attacks in Borno, survive planted bomb",
    "summarized_story": "Operation Hadin Kai troops foiled attempts by Islamic State’s West Africa Province (ISWAP) to attack commuters at the weekend.\nAlso, 152 Battalion troops responded to another distress call from Bula Yobe – Darel Jamel road and rescued travellers under threat.\nHowever, seven soldiers survived when they ran into an Improvised Explosive Device (IED) planted along Maiduguri – Damboa road.\n“Their vehicle touched an IED planted along the route Delwa – Bulabulin in Damboa Local Government Area on Saturday.\n“No fatality was recorded but seven soldiers sustained injuries and evacuated to Maiduguri for medical attention”, an intelligence source told PRNigeria."
  },
  {
    "headline": "Continue to put your trust in APC – Lawan to Nigerians",
    "summarized_story": "The President of the Senate, Ahmad Lawan has urged Nigerians to continue to entrust the affairs of the country to the All Progressives Congress(APC), stressing that APC is the party to trust.\n“This is to tell you that we desire to develop our country and that APC at all levels deserves the trust of Nigerians because we will always tell Nigerians what it is.\n“I want to assure Nigerians that APC as a political party is the one that you can trust because, for us, the citizens of this country are the most essential elements and people that we must always focus on,” Lawan said.\nThe Senate President urged Lagosians to consider Governor Sanwo-Olu for another term based on his commendable performance.\nOn the Senate President entourage from Abuja were Senator Mohammed Sani Musa, Senator Micheal Opeyemi Bamidele and Senator Yakubu Oseni."
  },
  {
    "headline": "NSCDC warns against hoarding of fuel, hike in pump price in Kwara",
    "summarized_story": "The Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC), on Sunday, threatened to seal fuel stations engaged in hoarding or selling petrol above the official pump price in the state.\nHe handed down the warning during an on-the-spot assessment carried out by the corps at some filling stations in Ilorin, the state capital, on Sunday.\nConsequently, the commandant ordered an on-the-spot assessment of the situation at some filling stations.\nAccording to him, the filling stations visited by the team were NNPC at Surulere Area, Topland and Demo filling stations at Amilegbe, Total Comfort Oilfield at Ita Amon among others.\nThe exercise, he added, will continue on Monday as the NSCDC team is expected to inspect more filling stations."
  },
  {
    "headline": "Focus more on salvation instead of tithing – Pastor Giwa tells religious leaders",
    "summarized_story": "The Senior Pastor of Awaiting The Second Coming Of Christ Ministry, Adewale Giwa, has advised religious leaders to prioritize salvation before tithe.\nGiwa emphasised that tithing was not included in God’s ten commandments to biblical Moses.\n“Tithing is good but is not mandatory and there is nowhere you can see it in God’s ten commandments.\nPreach salvation, love and mercy.\nWhen you continue to preach on tithing, then, that becomes your source of income.”"
  },
  {
    "headline": "Proposed ASUU strike: Students know fate on Monday as NEC meeting continues",
    "summarized_story": "University students across Nigeria will know their fate regarding the proposed strike action by the Academic Staff Union of Universities (ASUU).\nIt was also gathered that no decision has been reached on whether to proceed on the strike or not.\nThe meeting of the NEC of ASUU is currently being held at the F. Ade Ajayi Main Auditorium of the University of Lagos (UNILAG), Akoka.\nAt the ongoing stakeholders meeting, delegates present are expected to vote in favour or against a decision to embark on the nationwide strike.\nAll these come just as students and parents have been on the edge over the implications of embarking on a fresh strike."
  },
  {
    "headline": "CaCovid to support fight against insecurity with N100b",
    "summarized_story": "The Coalition Against COVID-19 (CaCovid), a private-sector coalition, has put together N100 billion to support security agencies.\nChairman, United Bank for Africa (UBA) Plc, Mr. Tony Elumelu made this disclosure in Abuja at the biannual UBA Group Chairman’s Forum 2022.\nAccording to Elumelu, the fund shows how passionate and patriotic members of the coalition are to see Nigeria develop.\nThe most important decision of the coalition, Elumelu added, was the decision “to open up the economy, the economy will crash if we don’t do so, and there was so much pressure on the government”.\nBy providing support to them you are also enabling communities to thrive,” Emefiele said."
  },
  {
    "headline": "IMF links cash shortage to central bank digital currency",
    "summarized_story": "The International Monetary Fund (IMF) has said Nigeria and other countries that launched Central Bank Digital Currency (CBDC) may witness cash shortage as they push for increased adoption of the payment option.\nIn a report obtained at the weekend, the IMF stated that access to payments through CBDC may trigger multiple hurdles, including shortage of cash, firms’ refusal to accept cash, and lack of or recurring disturbances of digital infrastructure.\nThe Central Bank of Nigeria (CBN) digital currency, e-Naira, was launched last October by President Muhammadu Buhari in Abuja.\n“Some jurisdictions are therefore exploring if a CBDC could help achieve or safeguard universal access to payments,” the report said.\nAnd in some countries, existing digital payments are also relatively expensive."
  },
  {
    "headline": "ASUU keeps students, govt in suspense",
    "summarized_story": "By Kofoworola Belo-Osagie, Lagos and Frank Ikpefan, AbujaThe Federal Government, parents and students were being kept in suspense last night by the Academic Staff Union of Universities (ASUU).\nEducation Minister Adamu Adamu could not be reached last night for comments on efforts being made by the government to avert another strike by ASUU.\nI have had interactions with the education minister (Adamu Adamu).\n“They are doing Education ministry meeting tomorrow.\nThe ministry will invite ASUU leadership either Wednesday or Thursday to the education ministry."
  },
  {
    "headline": "Senators, Reps protest proposed exclusion from APC convention",
    "summarized_story": "By Emmanuel Oladesu, Deputy Editor and Emmanuel Badejo, Assistant EditorAll Progressives Congress (APC) National Assembly members are protesting their exclusion from the National Convention in the proposed amendment to the party’s constitution.\nHe disagreed with the proposed amendment in the letter titled: ‘APC Constitution (Amendment)- Proposed Exclusion of NASS Members,’ he said the amendment violated the 1999 Constitution.\nOthers have members of the National Assembly as part of their National Convention.\nThis is against the norm that allows both former and current National Assembly members.\n“Why will there be any proposal to exclude both past and current National Assembly members from participating in the convention?"
  },
  {
    "headline": "#EndSARS: Federal Govt renews battle with Twitter",
    "summarized_story": "The Federal Government yesterday renewed its battle with Twitter.\nIt accused the micro blogging platform of double standards in its reaction to the 2020 #EndSARS protest in Nigeria and the ongoing truckers’ protests in Canada.\nAnd this also explains why we have continued to insist on the regulation of social media to ensure responsible content.\n“We must not allow anyone to destroy our country under the guise of protest or unbridled freedoms.\nWe all must put Nigeria first at all times.”After the #EndSARS protest, the Federal Government suspended Twitter’s operation in Nigeria."
  },
  {
    "headline": "Olubadan stool: Season of new songs",
    "summarized_story": "The new songs were connected with the processes of installing the 42nd Olubadan of Ibadanland, which suffered delays over litigation.\n“Today, I am also happy that the crisis we have been witnessing on the issue of Olubadan stool has been settled.\nIn the judgment, the “high chiefs” elevated to the positions of kings lost their crowns and returned to the status quo.\nThere is no problem.”Baale of Ekotedo had at many forums advised the high chiefs to withdraw their appeal.\n“We told the organisers that they were high chiefs and that they were Olubadan in the making."
  },
  {
    "headline": "Gunmen raid two Niger LGAs, kill 10, abduct many",
    "summarized_story": "Several people were injured in the attack which the Chairman said was carried out on Friday afternoon shortly after the Friday prayers.\nA number of the villagers mostly women and children were either kidnapped or injured while entire cattle in these communities were taken away by the gunmen.\nThe gunmen also took their time to cart away food stuff, provision and other items as all the shops in these communities were burgled.\nAlready the gunmen have demanded N3million as ransom money for the release of each of the abducted victims.\nShe said that N3 million is being demanded by the gunmen for each victim but said the negotiation continues today (Sunday)."
  },
  {
    "headline": "Two dead, two rescued as building collapses in Lagos",
    "summarized_story": "Two bodies have been recovered and two people rescued from the rubble of a three-storey building that collapsed in Yaba, Lagos, on Saturday.\nEarlier on Saturday, an official of LASEMA had said some construction workers were in the building when it collapsed.\n‘Upon the arrival of LASEMA response team at the incident scene, a three-storey building under construction was discovered to have collapsed,’ the official had said.\nFurther investigation revealed that the construction workers numbering about five were on site when the structure came down and are still trapped underneath.\nAn eyewitness also said a part of the building had collapsed in 2021, but that construction had continued."
  },
  {
    "headline": "How Igboho, Kanu can be released – Dansudu, National President,",
    "summarized_story": "But what matters to me and what I think should matter to every Nigerian is not where the next president comes from.\nRather we should be concerned about electing a credible and competent person as the next president.\nSo, as far as I am concerned, there are just two divisions in the country: the North and the South.\nHow best do you think the continued detention of Sunday Igboho and Nnamdi Kanu, two separatist agitators, can be resolved with the Federal Government?\nOn the other hand, Igboho can be released, but then you have to remember that he is not in the government’s custody."
  },
  {
    "headline": "One feared dead as thugs attack Igboho’s residence in Ibadan",
    "summarized_story": "From Oluseye Ojo, IbadanArmed thugs yesterday attacked the Sims, Ibadan residence, of Yoruba nation activist, Chief Sunday Adeyemo, fondly called Sunday Igboho, with one person feared dead, while some others said to be Igboho’s followers also sustained varying degrees of injuries.\nIt was gathered that the attack on Igboho’s house followed the fracas that broke out between people suspected to be members of the Oyo State Park Management System (PMS) and a group known as Federal Boys.\nThe pandemonium, which started two days ago, has caused serious unrest and public disturbance at areas such as Soka, Oremeji, and Agugu, the capital of Oyo State.\nLead counsel to Igboho, Chief Yomi Alliyu (SAN), confirmed the Saturday’s attack on Igboho’s residence to newsmen, saying that the armed thugs stormed the residence with dangerous weapons, which they used to inflict injury on associates of Igboho.\nA source in Igboho’s house alleged that the supporters of the Yoruba nation agitator were the target of the attack, saying that “Soka Junction, Sanyo, Academy, Oremeji were currently under attack."
  },
  {
    "headline": "Buhari, Ganduje, Bayero, Obaigbena Mourn Danbaba, Condole With Tambuwal, Sultan",
    "summarized_story": "President Muhammadu Buhari Sunday sent a high-powered delegation comprising four ministers to condole with the government and people of Sokoto state over the death of Magajin Garin (Mayor of) Sokoto, late Alhaji Hassan Danbaba.\nOthers were the Managing Director of Sokoto Rima River Basin Development Authority (SRRBDA), Alhaji Buhari Bature, and Mal.\nMuhammad Mamman Daura, son of President Buhari’s nephew.\nQuoting a Hadith of Prophet Muhammad, Ibn Sina said: “What Allah has taken is His and what he has given is equally His.\nYou should all exercise patience with whatever trial befalls you.”The visitors later extended their condolences to the family of the late Danbaba at his family house in Gangaren Dankure area of Sokoto metropolis."
  },
  {
    "headline": "Head of Sokoto Caliphate Kingmakers, Danbaba Dies Suddenly, Buried in Glory",
    "summarized_story": "*President expresses shock, millions mournJohn Shiklam in Kaduna and Onuminya Innocent in SokotoThe Head of Sokoto kingmakers, the Magajin Garin Sokoto, Alhaji Hassan Danbaba, who died yesterday, has been laid to rest in a glorious ceremony.\n“By virtue of his position as the head of the kingmakers of Sokoto Caliphate, there is a reserved cemetery, Hubbaren Shehu, where royal leaders are usually buried in Sokoto,” the source added.\nMagajin Garin Sokoto was part of the eminent Nigerians who converged on Lagos last weekend to find solutions to the challenges confronting the country ahead of the 2023 elections.\nMay his soul rest in peace.”Meanwhile, the Senator representing Sokoto North Senatorial district, Aliyu Magatakarda Wamakko, has also expressed grief over the demise of Magajin Garin Sokoto.\nAccording to Wamakko, the Sokoto Caliphate has indeed lost a father and a respected leader who lived a life of service to the Caliphate, Nigeria and humanity."
  },
  {
    "headline": "Atiku Under Fire for Kicking against Zoning Presidential Ticket",
    "summarized_story": "But Atiku, who is one of the prominent northern politicians interested in contesting the 2023 presidential election, has faulted the agitation.\nThe former vice president argued: “There is no zoning in the constitution; there is none.\nPANDEF: Atiku’s Position on Zoning Unfortunate, DisappointingOn its part, the Pan Niger Delta Forum (PANDEF) has described the position of Atiku that zoning is not provided for in the 1999 Constitution as unfortunate and disappointing.\nKen Robinson, told THISDAY yesterday that his group was disappointed at the statement credited to Atiku on the zoning of the presidency.\nHe further noted that Atiku should not to allow his presidential ambition to becloud his sense of reasoning."
  },
  {
    "headline": "FG Rejects Two Cargoes of Adulterated Petrol Imported from Belgium",
    "summarized_story": "Group Managing Director of the NNPC, Mallam Mele Kyari, however, stated that from his investigation, the four petrol cargoes were imported by MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium and Oando.\nEach consortia THISDAY learnt, receives some quantities of crude oil in exchange for petrol.\nRussia delivers Europe with one-third of its natural gas needs and exports around 2 million bpd of both crude oil and refined products to European nations.\nThis was in contrast to December 2021, when it pumped 1.197 million barrels per day and November when it was only able to produce 1.275 million bpd.\nThe biggest increases in crude oil production came from Nigeria, Saudi Arabia, the United Arab Emirates (UAE), and Kuwait, while output declined in OPEC’s second-largest producer Iraq, as well as in Venezuela and Libya."
  },
  {
    "headline": "Security Operatives at Makurdi Air force Base Stop Ortom from Receiving Osinbajo",
    "summarized_story": "It is not clear if the vice president was aware of the governor’s visit to the base to receive him.\nHe expressed regrets that he had set out to attend the burial of Professor Ignatius Ayua but had to delegate his deputy in order to receive the Vice President.\nThe letter which was signed by Ambassador Abdullahi Gwary said the vice president would return through the same route in the afternoon.\nHe vowed to report the matter to the Vice President for necessary action, stressing that there should be a clear difference between politics and governance.\nOrtom further described the presidency as a lame duck who could not tackle the security challenges of the country."
  },
  {
    "headline": "Ailing Tinubu Reportedly Suffering From 'Chronic Urinary Incontinence', Urinates On His Body In Public During A Visit To Ijebu Monarch",
    "summarized_story": "This has piqued the interest of many Nigerians who insisted the wetness of the attire at the spot was urine.\nRecall that last month, Tinubu had informed President Muhammadu Buhari of his ambition to contest the position of president in 2023.\nThe APC chieftain, it was learnt, left the US for the United Kingdom on crutches, a few days after the surgery.\nUpon his return in October, Tinubu confirmed that he underwent surgery on his right knee as well as rigorous post-surgery physiotherapy on the said knee during his medical trip abroad.\nSome days ago, Tinubu returned to the country after going out of the country for medical attention in the United Kingdom for 10 days."
  },
  {
    "headline": "Ailing Tinubu Reportedly Suffering From 'Chronic Urinary Incontinence', Urinates On His Body In Public During A Visit To Ijebu Monarch",
    "summarized_story": "This has piqued the interest of many Nigerians who insisted the wetness of the attire at the spot was urine.\nRecall that last month, Tinubu had informed President Muhammadu Buhari of his ambition to contest the position of president in 2023.\nThe APC chieftain, it was learnt, left the US for the United Kingdom on crutches, a few days after the surgery.\nUpon his return in October, Tinubu confirmed that he underwent surgery on his right knee as well as rigorous post-surgery physiotherapy on the said knee during his medical trip abroad.\nSome days ago, Tinubu returned to the country after going out of the country for medical attention in the United Kingdom for 10 days."
  },
  {
    "headline": "EXCLUSIVE: Story Behind How Buhari’s Minister, Malami, Media Guru, Obaigbena, Other Cabal Members Are Pushing Central Bank Governor, Emefiele’s Presidential Bid",
    "summarized_story": "Indeed, it started with the recent FCT mega rice pyramid, an initiative under the RIFAN/CBN anchor borrowers’ programme, but used to sell the candidacy of the CBN governor.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nThis came after rejecting the President of African Development Bank, Akinwunmi Adesina, and Obaigbena is spearheading this,” the source added.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "EXCLUSIVE: Story Behind How Buhari’s Minister, Malami, Media Guru, Obaigbena, Other Cabal Members Are Pushing Central Bank Governor, Emefiele’s Presidential Bid",
    "summarized_story": "Indeed, it started with the recent FCT mega rice pyramid, an initiative under the RIFAN/CBN anchor borrowers’ programme, but used to sell the candidacy of the CBN governor.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nThis came after rejecting the President of African Development Bank, Akinwunmi Adesina, and Obaigbena is spearheading this,” the source added.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "EXCLUSIVE: Story Behind How Buhari’s Minister, Malami, Media Guru, Obaigbena, Other Cabal Members Are Pushing Central Bank Governor, Emefiele’s Presidential Bid",
    "summarized_story": "Indeed, it started with the recent FCT mega rice pyramid, an initiative under the RIFAN/CBN anchor borrowers’ programme, but used to sell the candidacy of the CBN governor.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nThis came after rejecting the President of African Development Bank, Akinwunmi Adesina, and Obaigbena is spearheading this,” the source added.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "FCT council polls: APC wins in Abaji — but without a candidate",
    "summarized_story": "The Independent National Electoral Commission (APC) has declared the All Progressives Congress (APC) winner of the Abaji area council chairmanship election in the federal capital territory (FCT).\nTheCable had reported that the Peoples Democratic Party (PDP) won in the Abuja Municipal Area Council (AMAC), Bwari and Kuje, while the APC secured victory in Gwagwalada and Kwali.\nAdvertisementMordi, however, said the candidate of the APC cannot be proclaimed the winner of the election in Abaji because of a pending court case.\n“We cannot declare a candidate winner in Abaji because the winning party does not have a candidate here.\nMeanwhile, following the victory in Abaji, the APC and the PDP now control three area councils each in the FCT."
  },
  {
    "headline": "FCT council polls: APC wins in Abaji — but without a candidate",
    "summarized_story": "The Independent National Electoral Commission (APC) has declared the All Progressives Congress (APC) winner of the Abaji area council chairmanship election in the federal capital territory (FCT).\nTheCable had reported that the Peoples Democratic Party (PDP) won in the Abuja Municipal Area Council (AMAC), Bwari and Kuje, while the APC secured victory in Gwagwalada and Kwali.\nAdvertisementMordi, however, said the candidate of the APC cannot be proclaimed the winner of the election in Abaji because of a pending court case.\n“We cannot declare a candidate winner in Abaji because the winning party does not have a candidate here.\nMeanwhile, following the victory in Abaji, the APC and the PDP now control three area councils each in the FCT."
  },
  {
    "headline": "Yaba building collapse: Lagos to prosecute developer for 'defying stop-work order'",
    "summarized_story": "The Lagos state government says the developer of the three-storey building that collapsed in Onike area of Yaba, Lagos state, will be prosecuted.\nFive bodies have been recovered while two others were rescued following the collapse of the building on Saturday afternoon.\nAn earlier statement by the ministry of physical planning and urban development had indicated that the developer — who is yet to be named — has been arrested.\nAccording to the ministry, the developer returned to the site despite a stop-work order on the structure.\nAdvertisement“Salako stated that preliminary findings indicated that the site had been sealed off twice by the Lagos State Building Control Agency in 2021 for non-compliance with building regulations after which the site was abandoned,” the earlier statement reads."
  },
  {
    "headline": "Yaba building collapse: Lagos to prosecute developer for 'defying stop-work order'",
    "summarized_story": "The Lagos state government says the developer of the three-storey building that collapsed in Onike area of Yaba, Lagos state, will be prosecuted.\nFive bodies have been recovered while two others were rescued following the collapse of the building on Saturday afternoon.\nAn earlier statement by the ministry of physical planning and urban development had indicated that the developer — who is yet to be named — has been arrested.\nAccording to the ministry, the developer returned to the site despite a stop-work order on the structure.\nAdvertisement“Salako stated that preliminary findings indicated that the site had been sealed off twice by the Lagos State Building Control Agency in 2021 for non-compliance with building regulations after which the site was abandoned,” the earlier statement reads."
  },
  {
    "headline": "Security operatives rescue 20 abductees as bandits invade Niger community",
    "summarized_story": "The police command in Niger state says security operatives have rescued 20 kidnap victims following an attack on Nasko, Magama LGA of the state.\nAbiodun stated that bandits attacked some villages around Nasko on Saturday and rustled a large number of cattle.\nAccording to him, the police sent for reinforcement and military operatives and vigilantes joined in combing the area.\nAdvertisementHe said a two-hour fierce gun battle later ensued on Ibeto cattle route, while the bandits were trying to escape with the cattle.\nAdvertisementThe spokesman solicited the cooperation of residents in ridding the state of banditry and other crimes."
  },
  {
    "headline": "11 African startups to watch out for in 2022",
    "summarized_story": "About 20 startups are currently listed on its platform and over $400,000 has been invested on the platform.\nThe startup creates a reliable portal to guide African students in their tertiary education, course selection, and career decisions.\nThe startup handles everything it takes for a business to launch in a new African country.\nWe think this startup is building a game-changing product; something that will have a significant impact on the growth of African startups.\nWe know you have some startups you are rooting for this year that we might have missed."
  },
  {
    "headline": "Nigerian stock exchange wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Is it possible to reduce or eradicate fraud in Africa?",
    "summarized_story": "To fight this, the company which claims to specialise in fighting fraud in Africa has recently raised a €20 million (~$23m) Series A to help them improve their game in fighting fraud.\nYes, you read that correctly; over $12 million will be invested in combating mobile fraud in Africa.\nWhile I’m interested in how the company intends to accomplish this, there’s also an indigenous company in Nigeria, Stellas digital bank planning to combat fraud.\nSide bar: Is it possible that the rise of startups focused on combating fraud will help achieve its purpose in Africa?\nTo know how, please, read: Stellas digital bank launches, plans to fix major loophole for fintech fraud in Nigeria."
  },
  {
    "headline": "Stellas digital bank launches with ‘Ghost Mode’ to fix major fintech fraud loophole in Nigeria",
    "summarized_story": "However, fraud remains the bane of both digital banks, and traditional banks alike.\nFor the newly launched Stellas digital bank, it plans to guard against one major loophole.\nToday, the company is launching a digital bank to “offer banking services with ease”.\nBasically, Stellas plans to protect user identities when making transactions, to guard against identity theft and ensure privacy and security.\nIn a space graced by the likes of Kuda, Sparkle, Fairmoney, and Carbon, Nigeria’s digital banking space look set to be exciting."
  },
  {
    "headline": "Rising to the challenge with the all-new Redmi Note 11 series",
    "summarized_story": "Xiaomi launched the Redmi Note 11 series for Nigerian markets on Wednesday, February 9th, 2022, carrying on the legacy of the Redmi Note series with three all-new devices – Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11.\nMoreover, the Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11’s 2MP depth camera allows you to create a natural bokeh effect for your portrait shots.\nAdvertisementThe Redmi Note 11 Pro and Redmi Note 11S rise to the challenge with an advanced octa-core MediaTek Helio G96 processor and up to 8GB of RAM.\nMarket availabilityThe Redmi Note 11 Pro and Redmi Note 11S are available in three configurations: 6GB+64GB, 6GB+128GB, and 8GB+128GB.\nMoreover, the Redmi Note 11 Pro will be available in early March, 2022, while the Redmi Note 11S and Redmi Note 11 are now available."
  },
  {
    "headline": "IMF says Nigeria risking financial squeeze as debt piles",
    "summarized_story": "“Public debt threshold for emerging markets stand at 10 percent; however, Nigeria currently spends above 80 percent to service its debt.\nDebt servicing for Nigeria since the oil decline in 2020 has been dependent on CBN overdraft and Eurobond subscriptions.\n“Nigeria’s debt trend is not looking favorable on the debt portfolio end but the estimates are dependent on various economic factors.\nSince 2017, this administration has spent a total of N15.375trn on debt servicing, excluding N296bn and N110bn allocated for sinking funds in 2019 and 2020.\nThe Nigerian economy has been and is still operating in ‘reverse’, Productivity rates are low while debt servicing is increasing (ridiculous)."
  },
  {
    "headline": "Apathy, dysfunctional BVAS, late arrival of officials mark FCT Area Council poll",
    "summarized_story": "There are a total of 1.373 million registered voters in the FCT spread across the six Area Councils, 62 Wards, and 2,822 Polling Units in the Territory.\n“We have this long-standing issue of non-indigenes not wanting to come out and vote during area council elections,” said a voter who simply identified himself as Ahmed.\nINEC Chairman, Mahmood Yakubu at the last extended stakeholders meeting ahead of the FCT election on Tuesday said lessons learned from the Anambra election had been considered in planning for the Area Council election.\nA visit to most of the centers in Nyanya, Karu, Jikwoyi, Kpeghi, Asokoro, Garki, and Kuduru communities in the Abuja Municipal Area Council, showed no presence of men and materials.\nHowever, security agents made up of Police, Civil Defence and Road Safety were seen at the various polling units visited."
  },
  {
    "headline": "Voter apathy, late arrival of INEC officials, materials hallmark FCT council polls",
    "summarized_story": "The Federal Capital Territory Area Council polls got off to a slow start Saturday morning amidst several challenges, as election did not start until about 10am.\nMany people are however going about their activities, following the decision by the FCT Police to relax movement restrictions.\nBusinessDay checks revealed that election materials and polling officials of the Independent National Electoral Commission INEC did not get to the polling units until at about 9.30am, at Kuje, the capital if Kuje Area Council.\nThis is despite the fact that voters had turned out as early as 7.30am at the various polling units waiting for officials of INEC at the units.\nVoting however, took off at the Agwan tiv and Agwan Egan and Agwan Kaduna polling units at about 10am"
  },
  {
    "headline": "Obaseki harps on accountability in healthcare delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged stakeholders in the healthcare sector to be accountable and transparent in delivering quality healthcare services to members of the public.\nWe need to talk through how we make sure that we contribute enough to sustaining our healthcare system.”The governor further noted, “As far as I am concerned, my goal is to improve the healthcare system.\nGovernment has a responsibility to provide healthcare.\nIn her remarks, Edo State Commissioner for Health, Prof. Obehi Akoria, reiterated the governor’s determination to provide quality healthcare at all levels through the Edo State Health Insurance Scheme to enable a shift from out-of-pocket spending.\nProf. Akoria noted that plans are on to make Edo a regional reference point for quality healthcare delivery and desired destination for health innovations."
  },
  {
    "headline": "Obaseki parleys Edo teachers, reviews strategies to strengthen security in schools – Nigerian Observer",
    "summarized_story": "What do we do about adult education?\nConsidering the role of adult education, should we just leave them like that?” He queried.\nOn strengthening security in schools, Obaseki stated, “It is only a good parent and teacher that will be concerned about the security of students in schools.\nOur priority as a state is education, because that’s the foundation that everything else rests on,” Obaseki noted.\n“We are working things out to make sure that we start a lot of renovations and improvements of our schools,” he assured."
  },
  {
    "headline": "Regional devt plan: Govt engages Edo South stakeholders on priority projects – Nigerian Observer",
    "summarized_story": "The team is meeting with the Enogies, Odionweres, Okhageles, Senior Special Assistants (SSAs) & (Special Assistants (SAs) from Edo South to sensitise them on the Benin City Masterplan and the Edo State Regional Development Plan.\nThe Godwin Obaseki administration is creating an exhaustive plan for the entire Edo State to meet the yearnings and aspirations of the people.\n“You need schools, you need hospitals and health centres; you need healthy spaces to operate your businesses, good markets to trade, beautiful living areas.\nThat is progress, and to achieve all that, we need to work as a team for the state to be healthy.\n“This stakeholder engagement meeting is only an introduction to the greater things ahead."
  },
  {
    "headline": "Edo Govt, First Lady Partner ANPA on Free Healthcare – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Government, the First Lady of Edo State Her Excellency Betsy Obaseki and the Association of Nigerian Physicians in America (ANPA), are embarking on a Free Medical Mission to Edo South Senatorial District of the State.\nThe Commissioner for Health Edo State, Prof. Obehi Akoria disclosed this while she accompanied the First Lady of Edo State, Her Excellency Betsy Obaseki on an inspection tour of the Primary Healthcare Centres designated to handle the treatment.\nWhat they are going to establish is that going forward, the patients that they are going to see will be followed up remotely.\nCommenting on the ongoing plans for the Primary Healthcare Centres in the State, the Health Commissioner said “I was here at the Oredo Primary Healthcare Centre at about 8:15 this morning and there were already patients waiting.\nSo what we are trying to do right now is to make our PHCs good enough for me, my children, grand children and all Edo people.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Osun CAN Honours Asiwaju of Ikire land, Bola Oyebamiji",
    "summarized_story": "Mr Oyebamiji who is the Balogun Musulumi of Ikire land was bestowed with an award during the 2022 Annual General Meeting of the association held at the CAN Secretariat in Osogbo.\nAmos Ogunrinde, said the award is in recognition of the Commissioner’s sound moral value and his immense contribution to evangelism.\nAccording to him, “I am yet to meet a man so committed to the work of God as Mr Bola Oyebamiji.\n“Osun CAN has decided to honour him in recognition of his sound moral values, immense contribution to evangelism; for his love and support to the progress and success of Osun CAN”.\nSpeaking shortly after receiving the award, Mr. Oyebamiji said he will continue to be motivated to propagate the work of God through any religious faith without discrimination."
  },
  {
    "headline": "Osun APC Crisis: Senator Oriolowo calls for unity",
    "summarized_story": "By Sunday Oguntuyi, OsogboSenator Adelere Adeyemi Oriolowo, senator representing Osun West Senatorial District, has enjoined members of the All Progressive Congress (APC) to eschew rancour and close ranks ahead of the gubernatorial elections in the state.\nSenator Oriolowo who made this call while fielding questions from journalists during a press conference at Iwo, also appealed to different factions to jettison their ego and selfish interest for the interest of the masses.\nAccording to Senator Oriolowo, “I wish to call on aggrieved members to keep confidence with the party, while I explore all peaceful means for amicable solution.\nSpeaking on whether he belongs to a particular group within the party, Oriolowo said he is a party man to the core and doesnt believe in group.\nAs for whether am for Ileri Oluwa or TOP, am for both since APC is one in Osun” he added."
  },
  {
    "headline": "Osun 2022: Olubosin, Apetumodu, Salu Edunabon, other monarchs pledges support for Oyetola",
    "summarized_story": "This is even as the Apetumodu of Ipetumodu, Oba Olusegun Joseph Oloyede; the Salu of Edunabon, Oba Kehinde Oladepo and other traditional rulers pledged their loyalty and support for the Governor to serve the State for second term.\nSpeaking on behalf of the traditional rulers in Ife-South Local Government Area, Olubosin of Ifetedo Kingdom, Oba Akinola Akinrera, extolled Governor Oyetola for the good works his Administration has done to transform the State.\nOba Akinrera particularly appreciated the Governor for bringing to life the dilapidated and abandoned Ifetedo General Hospital.\n“On behalf of traditional rulers and the good people in Ife-South Local Government Area, I thank Mr.\nAddressing the traditional rulers and members of his party, Governor Oyetola said his Administration was committed to taking the State to enviable heights ever known in history."
  },
  {
    "headline": "Death toll in Yaba building collapse rises to five",
    "summarized_story": "The number of people who have died in a building that collapsed in Yaba area of Lagos State, have risen to five, the National Emergency Management Agency (NEMA), confirmed on Sunday.\nThis as Ibrahim Farinloye, south-west zonal coordinator of NEMA confirmed the recovery of the body of a student on industrial training on Sunday.\nRecall that a three-storey building at Yaba collapsed on Saturday afternoon.\nFarinloye said the body of the student, who was identified by family members as Damola, was discovered when the rescue operation was almost concluded.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Bayelsa Govt Berates Sylva Over Comments On Gov Diri’s Performance",
    "summarized_story": "Sylva, a former governor of the State, had upbraided the incumbent State governor when he featured as a guest on a Yenagoa-based radio station on Saturday.\nThe State Commissioner for Information noted that Chief Sylva’s comments were unbefitting of the position of an exalted citizen of the state occupying a high national office.\nAyibaina said the state government was surprised that having previously been the number one citizen of the state, Sylva displayed crass ignorance about ongoing projects of the prosperity government.\n“Pray, is Igbedi not a community in Bayelsa State that deserves the benefits of government projects like any other community?\n“If Chief Sylva was referring to darkness arising from power outage, we expect him to know better than to point accusing fingers at the state government for that."
  },
  {
    "headline": "Valentine’s Day: FRSC Warns Youths Against Drunk-driving",
    "summarized_story": "The Rivers State sector command of the Federal Road Safety Corps (FRSC), has warned motorists, especially youths to avoid drunk-driving as the world celebrates Saint Valentine’s Day on February 14, 2022.\nFRSC, in a statement issued in Port Harcourt by its acting spokesperson, Eni Juliana Ugo, also advised motorists to avoid unnecessary overtaking during the celebration.\nThe statement further advised motorists not to do anything that will cause distraction while driving.\nThe statement reads in part: “Another 14th February is here, and the Federal Road Safety Corps RS6.1 Rivers State Command is advising the public especially the youths to celebrate in the spirit of safety.\nDo not over speed and avoid anything that will cause distraction while driving."
  },
  {
    "headline": "Delta Govt Shuts School Where Teacher Flogged 1-yr-old Pupil To Death",
    "summarized_story": "The Delta State government, on Sunday, has shut down a private school, Arise And Shine Nursery and Primary School, Asaba, after a teacher flogged a one-year-old pupil to death.\nThe said pupil was flogged 31 strokes of cane after playing with water during school hours and became wet.\nThe child died at the Federal Medical Centre, Asaba, where he was receiving medical treatment.\nThe proprietress of the school and the culprit, who is a son to the proprietress, have also been arrested while investigation was ongoing.\n“When I said we will make sure justice is done, some of you said Ossai Ovie Success has come again."
  },
  {
    "headline": "Delta Govt Shuts School Where Teacher Flogged 1-yr-old Pupil To Death",
    "summarized_story": "The Delta State government, on Sunday, has shut down a private school, Arise And Shine Nursery and Primary School, Asaba, after a teacher flogged a one-year-old pupil to death.\nThe said pupil was flogged 31 strokes of cane after playing with water during school hours and became wet.\nThe child died at the Federal Medical Centre, Asaba, where he was receiving medical treatment.\nThe proprietress of the school and the culprit, who is a son to the proprietress, have also been arrested while investigation was ongoing.\n“When I said we will make sure justice is done, some of you said Ossai Ovie Success has come again."
  },
  {
    "headline": "NDLEA Arrests Indian Businessman Over Codeine Smuggling To Nigeria",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), have arrested an Indian businessman, Vyapak Nutal, over the smuggling of 134,700 bottles of Codeine syrup into Nigeria through the land border between Nigeria and Niger Republic in Sokoto State.\nNDLEA spokesperson, Femi Babafemi, said the suspect had loaded the consignment into trucks in Cotonou, Benin Republic and drove through the land borders via Niger Republic before entering Sokoto State at the Illela border.\nHe allegedly settled in a hotel in Sokoto State, where credible intelligence revealed that Nutal began to look for buyers for the controlled drug.\nAlso, about 25 kilograms of Methamphetamine, Tramadol, Cannabis and Khat concealed in motor parts, MP3 player, speaker and fabrics heading to USA, UK, Australia, Dubai and Madagascar were seized at three major courier companies in Lagos.\nADVERTISEMENTThis followed the arrest of Aliu Salami, 43, with 143.9kg cannabis at Oke-Ata, Abeokuta South LGA, Ogun state on Wednesday February 9."
  },
  {
    "headline": "Moment Tinubu hit Remo land for Akarigbo (Photos)",
    "summarized_story": "National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu on Sunday visited the Akarigbo of Remo Land, Oba Babatunde Adewale Ajayi, Torungbuwa II.\nThe former governor of Lagos visited the palace of the Akarigbo in Ogun State to solicit his support and blessing for his 2023 presidential aspiration.\nTinubu was welcomed to the palace by a crowd of supporters.\nHe had earlier visited some monarchs in Ogun State on Saturday, one of which was the Awujale of Ijebuland, Oba Sikiru Kayode Adetona."
  },
  {
    "headline": "$10,000 up for grabs in Innovate Africa Engineering Design Solution competition",
    "summarized_story": "Science to Product Africa Initiative (S2PAfrica), a non-profit organization based in Nigeria, that is involved in developing and implementing a holistic approach to engineering education in pre-industrial African communities, is offering the grand prize award of $10,000.00 in a West African Engineering Design competition.\nParticipants for the competition have been drawn from 18 Nigerian, and one Ghanaian university, which had earlier submitted entries.\nS2PAfrica therefore adopted a Products, Processes, Goods and Services (PPGS) philosophy, in which the creation of locally relevant PPGS practices become the core objective of engineering education in Africa.\nNow, in concluding the three-year project, S2PAfrica is organising a West African Engineering Design competition.\nThere is also a commitment from Cummins West Africa – the global power leader, for support of the competition."
  },
  {
    "headline": "JUST IN: Tension As ASUU NEC Holds Final Meeting On Strike",
    "summarized_story": "JUST IN: Tension As ASUU NEC Holds Final Meeting On StrikeStudents in Nigerian universities are concerned about the outcome of a meeting of the Academic Staff Union of Universities, which is now taking place.\nAccording to the PUNCH, the meeting will decide whether or not to strike.\nDr Adeola Egbedokun, Chairperson of OAU ASUU, said the final decision had not been reached as of 08.50 p.m. when contacted.\nA few weeks after, ASUU suspended the planned strike, as N22.1 billion earned allowances were paid to lecturers in federal universities.\n), last month, over the lack of implementation of the Memorandum of Understanding the government signed with ASUU in 2009 and others."
  },
  {
    "headline": "Yaba Building Collapse: 4 Bodies Recovered; 2 Hospitalised, As Lagos Arrests Developer, Begins Probe",
    "summarized_story": "Two bodies were recovered immediately on Saturday afternoon, and two more bodies were recovered late that evening by men from the National Emergency Management Agency, NEMA, Lagos State Emergency Management Agency, LASEMA, Lagos State Fire Service and Rescue, Nigeria Police, and others, bringing the total number of people killed in the tragic incident to four.\nSalako accused the developer of violating a previous “stop-work order” placed on the site by officials from the Lagos State Building Control Agency, or LASBCA.\nEarlier, NEMA’s Lagos Territorial Office Coordinator, Ibrahim Farinloye, said proper investigations into the cause of the incident would be carried out.\n“Proper investigation on the case of the collapse will be carried out by the State to determine the cause of the collapse after the emergency phase,” he said.\nRabiu Ali, on the November 1st, 2021, 21-story Ikoyi building collapse in Lagos."
  },
  {
    "headline": "JUST IN: Final Decision On Strike To Be Reached Soon – ASUU",
    "summarized_story": "JUST IN: Final Decision On Strike To Be Reached Soon – ASUUAt the end of a meeting at the University of Lagos, members of the Academic Staff Union of Universities will make a decision on an upcoming strike.\nA chairman of one of the branches, who asked to remain anonymous because he is unable to speak, said the most recent consideration is a warning strike.\nThe resolution of the ongoing meeting will determine.”Members of the National Executive Committee of ASUU are meeting at UNILAG to finalise the union’s decision on an impending strike.\nASUU is expected to make the final decision on the strike by voting, but The PUNCH gathered that no voting has been held yet.\nWhen contacted on the telephone, the Chairperson of UNILAG ASUU, Dele Ashiru, said, “NEC meeting still ongoing.”"
  },
  {
    "headline": "UPDATED: Death Toll Rises As Three-Storey Building Collapses In Lagos",
    "summarized_story": "Eyewitness accounts said the construction workers were at their various duty posts when the building collapsed on them.\nThe Director-General, Lagos State Emergency Management Agency (LASEMA), Olufemi Oke-Osanyintolu confirmed the incident but did not give further details on it.\nSurvivor Comes Out Of Collapsed Building In Lagos A survivor came out of a collapsed storey building in Lagos on Saturday.\nThe Saturday incident occurred barely three months after a 21-storey Ikoyi building collapsed in Ikoyi area of Lagos killing many people.\nDeveloper ArrestedThe Lagos State government says it has arrested the developer of the three-storey building under construction that collapsed at No."
  },
  {
    "headline": "Executive Order 10: SANs, CSO’s tango over Supreme Court ruling",
    "summarized_story": "They also sought an order “setting aside the Presidential Executive Order No.\n“Thus, the presidential Executive Order 10 is meant to facilitate the implementation of the constitutional provisions.\nSANs differIn his reaction, a prominent South-west lawyer, Chief Adeniyi Akintola (SAN), said the Supreme Court judgement on the Executive Order was in order.\nIn the interval between the executive order and the judgment of the Supreme Court, a lot has happened.\nOjo told one of or correspondents that “Executive order 10 is just an enabled law, it is highly unnecessary."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress overcome Mali, pick 2022 FIBA women’s World Cup ticket",
    "summarized_story": "Later in 2022, Nigeria’s D’Tigress will be among the teams expected to feature during FIBA Women’s World Cup slated for Australia.\nThis is after the Nigerian side won their second match of the qualifier against Mali 73-69 a while ago on Sunday.\nDetails loading…"
  },
  {
    "headline": "[Official] FCT council election: Like Kuje, Bwari, INEC declares PDP winner in AMAC",
    "summarized_story": "Like it did in Kuje and Bwari Area Councils, the Peoples Democratic Party (PDP) has won the Chairmanship election held on Saturday in the Abuja Municipal Area Council (AMAC), in the FCT Area Council election.\nThere are 12 wards in AMAC, including Gwagwa, City Centre, Garki, Kabusa, Wuse, Gwarinpa, Jiwa, Gui, Karshi, Orozo, Karu and Nyanya.\nHowever, the All Progressives Congress (APC) won in only Wuse and Karshi wards, leaving the PDP to win the remaining 10 wards.\nDetails below:Collation of election results for AMAC.\nNYANYA WARDREGISTERED VOTERS : 53, 263ACCREDITED VOTERS: 3301APC: 1,199PDP: 1,861JIWA WARDREGISTERED VOTERS :43, 572ACCREDITED VOTERS : 2831APC: 1,224PDP : 1,429GUI WARDREGISTERED VOTERS : 27,378ACCREDITED VOTERS : 2591APC : 834PDP: 1606KARSHI WARDREGISTERED VOTERS : 13,943ACCREDITED VOTERS : 1678APC: 1,477PDP: 180Reports of Snatching of Chairmanship ballot box and malfunctioning of BVASGWAGWA WARDREGISTERED VOTERS : 39,960ACCREDITED VOTERS : 2952APC: 1,158PDP : 1,624OROZO WARDREGISTERED VOTERS : 30, 417ACCREDITED VOTERS : 1051APC: 335PDP: 674Reports of attacks at the collation centre, two people were killed and others injuredCITY CENTER WARDREGISTERED VOTERS : 74, 245ACCREDITED VOTERS : 2360APC: 1,093PDP: 1,137Reports of attack on INEC officials who were reportedly beaten upGARKI WARDREGISTERED VOTERS : 86,109ACCREDITED : 4,385APC: 914PDP : 2,983KARU WARDREGISTERED VOTERS : 59,485ACCREDITED VOTERS: 2,857APC: 863PDP: 1,848GWARIMPA WARDREGISTERED VOTERS: 99,384ACCREDITED VOTERS : 4,953APC: 2,086PDP: 2,609WUSE WARDREGISTERED VOTERS :88070ACCREDITED VOTERS :1897APC: 933PDP : 857KABUSA WARDREGISTERED VOTERS: 71,448ACCREDITED VOTERS : 4,154APC: 1,124PDP: 2,494Total votesPDP: 19,302APC: 13,240Following the conclusion of the collation, the Retuning Officer, Professor Sani Saka, declared the PDP candidate, Christopher Zakka, winner of the election, having polled 19,302, against the candidate of the APC, Mr Murtala Karshi, who polled 13,240."
  },
  {
    "headline": "[UPDATED]: Five Dead Bodies Recovered From Collapsed Lagos Building, Developer Arrested",
    "summarized_story": "A total of five dead bodies have now been recovered from the collapsed building in the Yaba area of Lagos State, just as the property developer was arrested.\nThe recovered bodies were some of the people working at the building site before it collapsed on Saturday at NO.16 Akanbi Crescent.\nFollowing the incident, the Lagos State Government said it has arrested the developer of the property.\nThe Lagos State Government has arrested the developer of a collapsed building at No.\n@jidesanwoolu @drobafemihamzat @idreezsalako @ud_mpp @gbenga_omo @hmokunola_ pic.twitter.com/iNrObWU44x — The Lagos State Govt (@followlasg) February 13, 2022[READ ALSO] Ikoyi Building Collapse: Mistakes Were Made From All Angles – Sanwo-OluSaturday’s incident is the latest in the rising cases of building collapse in Lagos State."
  },
  {
    "headline": "Delta Govt Shuts School After 19-Month-Old Pupil Flogged By Teacher Dies",
    "summarized_story": "The Delta State Government has shut down a primary school in Asaba following the death of a 19-month-old pupil, Obina Udeze.\nChannels Television gathered that the victim died from injuries sustained by a teacher, Emeka Nwogbo, who reportedly flogged him on Monday, leaving marks on his body.\nThe little boy was said to have fallen sick after the beating and was taken to the Federal Medical Centre, Asaba.\nREAD ALSO: Yaba Building Collapse: Rescue Operations Resume After Being Called OffThe Delta State Commissioner for Basic Education Chika Ossai told Channels Television on Sunday that the school was not approved by the state government.\nThe spokesman of Delta State Police Command, DSP Bright Edafe, said they have commenced investigations into Udeze’s death."
  },
  {
    "headline": "FG Mourns Ahmadu Bello’s Grandson, Sends High-Powered Delegation To Sokoto",
    "summarized_story": "President Muhammadu Buhari has commiserated with the government and people of Sokoto State over the demise of Magajin Garin Sokoto, Hassan Marafa Danbaba.\nHe was the grandson of the late Premier of Northern Nigeria Region Sir Ahmadu Bello.\nThe President sent his condolences through a high-power delegation comprising four ministers, led by the Minister of Justice and Attorney General of the Federation, Abubakar Malami.\nRead Also: Ahmadu Bello’s Grandson, Danbaba Dies in KadunaMalami said the President was shocked by the news and described the demise of the Magajin Gari as a great loss not for Sokoto State alone but for the entire nation.\nMagajin Gari died on Saturday morning in Kaduna State after a brief illness and was buried immediately in accordance with Islamic rites."
  },
  {
    "headline": "Fire Outbreak Destroys Yam Tubers Worth Millions In Taraba",
    "summarized_story": "A fire outbreak has destroyed tubers of yam worth millions at a market in Wukari Local Government Area of Taraba State.\nAlthough the cause of the outbreak which occurred at midnight on Saturday, is yet to be known, the Chairman of the Yam Sellers Association in the state, Anthony Agbu, disclosed that there has been a major misunderstanding between farmers and sellers which may have resulted in the incident.\nRead Also: 20 Abducted Victims Regain Freedom In Niger, Police Kill Several BanditsAccording to Agbu, this is the 14th time this year alone that such an incident is happening mostly after harvest season.\nThe yam sellers and farmers have called out to the government to help them rebuild their lives once again, saying they have lost tubers worth N200million, as well as motorcycles and grains."
  },
  {
    "headline": "20 Abducted Victims Regain Freedom In Niger, Police Kill Several Bandits",
    "summarized_story": "Twenty abducted persons in Niger State have regained their freedom after the police in Niger State raided a bandits’ hideout at Anaba hilltop, Magama Local Government Area of the state.\nThe Police Public Relations Officer, Niger State Command, Dsp Wasiu A. Abiodun disclosed this in a statement on Sunday.\n“Consequently, scores of bandits were neutralised and the rustled cattle were recovered while about 20 abducted victims regained their freedom,” the statement read in part.\nThe Commissioner of Police, Niger State Command CP Monday Bala Kuryas, reiterated the commitment of the Command to rid the state of banditry activities and other crime.\nHe also called for the cooperation and support of Niger residents towards ensuring a crime-free society."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Senator Philip Aduda raises concern over BVAS Operation",
    "summarized_story": "The Senator representing Federal Capital Territory has raised concerns over the functionality of the Bimodal Voting Accreditation System, BVAS.\nPhillip Aduda enjoins INEC to get its act right ahead the 2023 general election.\nAdvertisementHe spoke after casting his vote at the Polling units 004 in Karu.\nWhile he describes his accreditation and voting process as seamless, the lawmaker said reports reaching him from other parts of the nation’s capital are not palatable regarding the BVAS."
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Nigeria: Shake-up in Aso Villa as Buhari Sacks First Lady’s Aide, Redeploys Three Others",
    "summarized_story": "President Muhammadu Buhari has approved the sack of one aide of the First Lady, Aisha Buhari and the redeployment of three others.\nHe also approved the appointment of former President of the Nigerian Union of Journalists (NUJ), Mallam Sani Zorro, as media aide to the First Lady.\nBuhari has also approved the appointment of two more personal aides to Aisha.\nBuhari has also approved the appointment of two more personal aides to the First Lady.\nRimi, is a resourceful administrative executive and a founding partner at Africa Law Practice, a commercial law firm in Nigeria."
  },
  {
    "headline": "Nigeria: No Winner, No Loser in Nullification of Executive Order 10, Senior Lawyers Say – Arise News",
    "summarized_story": "The move it was believed would curtail the alleged dominance of the state executive over the two other arms of government.\nBut the states through theirAttorneys-General swiftly approached the court to challenge the legality of the presidential order, insisting that it was unconstitutional and should be voided.\nAccording to the majority decision, the Executive Order 10 was inconsistent with the 1999 Constitution and therefore unconstitutional, illegal, null and void and of no effect whatsoever.\nHe however, agreed with the majority judgment that since the Constitution has covered the field, the Executive Order 10 made by the President becomes unnecessary.\nState governors over the years have always hijacked the funds of the judiciary and they will now be giving pittance to judiciary as if doing them a favour."
  },
  {
    "headline": "Nigeria: APC Begins Sale of Forms on Monday Ahead of National Convention",
    "summarized_story": "The All Progressives Congress (APC) will on Monday commence the sale of forms to all aspirants vying for national offices ahead of the party’s national convention slated for February 26.\nThe party said: “Sale of Forms to all aspirants vying for National Offices (APC National Secretariat) – 14/02/2022.\nHowever, there appears to be cracks in the Progressives Governors’ Forum over the choice of a consensus national chairman.\nIt was learnt that the two governors presented their choice to the Presidency but other APC governors rejected the choice.\nYari, who spoke through his Chief of Staff, Mr. Abdulkarim Tsafe, told THISDAY that he would prefer an elective convention."
  },
  {
    "headline": "Chelsea Become Club World Champions as Late Havertz Penalty Ends Palmeiras’ Resistance",
    "summarized_story": "In less than a year, he’s crowned Chelsea champions of both Europe and the world.\nFinally, owner Roman Abramovich, who was in attendance, has got his hands on the Club World Cup trophy, making it 20 titles in 19 years of the Russian’s rule.\nN’Golo Kante can now boast of being a world champion for club and country, while Cesar Azpilicueta became the first Chelsea player to complete a clean sweep of honours.\nTuchel and his players will now be targeting more silverware, with Chelsea set to face Liverpool in the Carabao Cup final later this month.\nHe understands how things work at the club and he has every chance of staying longer than the 18 months Chelsea managers average under Abramovich."
  },
  {
    "headline": "Nigeria Rejects Two Cargoes of Adulterated Petrol Imported from Belgium",
    "summarized_story": "Following the circulation of adulterated petrol in Nigeria, which damaged vehicle engines last week, the federal government has turned back two tankers carrying petrol loaded in Antwerp, Belgium, and destined for Lagos.\nGroup Managing Director of the NNPC, Mallam Mele Kyari, however, stated that from his investigation, the four petrol cargoes were imported by MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium and Oando.\nEach consortia THISDAY learnt, receives some quantities of crude oil in exchange for petrol.\nRussia delivers Europe with one-third of its natural gas needs and exports around 2 million bpd of both crude oil and refined products to European nations.\nThis was in contrast to December 2021, when it pumped 1.197 million barrels per day and November when it was only able to produce 1.275 million bpd."
  }
]