[
  {
    "headline": "Seven fun spots in Lagos to spend the Yuletide",
    "summarized_story": "In this piece, The PUNCH highlights seven fun places in Lagos where you can cool off with friends and family this Yuletide.\nAmazing meals and treats are also available from the restaurant at Barracuda Resort, which also features a swimming pool with a garden terrace.\nFacilities available include Swimming pool, Bar, Table tennis/games court, Private Beach with tents, Horse ride, Playground, and Sleep-in guest rooms.\nAvailable at the park include picnic area, volleyball pitch, football pitch, and many others.\nFun activities include surfing, jetskiing, boat riding, volleyball, beach soccer, etc."
  },
  {
    "headline": "Fake Facebook post: Magistrate transfers Goje’s aide from prison to police custody",
    "summarized_story": "Chief Magistrate of Pantami township Area Court, Gombe State, Mohammed Kumo, on Friday ordered a 27-year-old New Media Aide to Senator Danjuma Goje, Muhammad Yayari to be remanded in police custody till Monday 20th December.\nThe embattled social aide is alleged to have shared a false Facebook post on the actual number of All Progressives Congress executives that resigned in Yalmatu Deba Local Government.\nConsidering the condition of the defendant I hereby order that he be taken to police custody,” Kumo said.\nThe prosecution counsel Ramatu Hassan, had earlier applied for adjournment noting that bail application sent by defence counsel can’t be authenticated.\nOn his part, defence counsel, Luka Haruna, said his team has complied with the court’s decision by bringing a formal application to the court."
  },
  {
    "headline": "Nasarawa govt bans use of charcoal",
    "summarized_story": "The Nasarawa State Government has baned the use and sales of charcoal in the state to protect the environment.\nMr Aliyu Agwai, Permanent Secretary, Ministry of Environment and Natural Resources, announced this while addressing newsmen on Saturday in Lafia.\nHe said that the process of producing charcoal is harmful to the environment by destroying the climate and increasing global warming.\nMeanwhile a mobile court, handling environmental-related cases, has prosecuted 32 persons suspected to have violated environmental sanitation laws in Lafia.\nMohammed said that the offences violated Section 9(2), of the state Environmental Sanitation Law."
  },
  {
    "headline": "Nigeria has not, will not, mortgage national assets for Chinese loans — DMO",
    "summarized_story": "The Debt Management Office (DMO) has clarified that loans from China to Nigeria, which presently stood at 3.59 billion dollars, constitute only 9.4 per cent of the country’s total foreign debt stock of 37.9 billion dollars.\nShe also clarified that the loans were largely concessional, as no national asset was tagged as collateral.\n“Nigeria’s total debt stock as of Sept. 30 was 37.9 billion dollars, this figure comprised the external debt stock of the Federal Government, 36 state governments and the Federal Capital Territory.\n“ But total loans from China stands at 3.59 billion dollars, which is 9.47 per cent of the total external debt.\nShe explained that before foreign loans were contracted, very sensitive steps were taken by multiple institutions of government to ensure that they were beneficial to the nation."
  },
  {
    "headline": "Senate President in Katsina for Turbanning of Buhari’s son",
    "summarized_story": "The President of the Senate, Ahmad Lawan arrived in Katsina Saturday morning to attend the turbanning of Yusuf, son of President Muhammadu Buhari.\nHe was received on arrival by the State Governor, Aminu Bello Masari at the Umaru Musa Yar’Adua Airport, Katsina.\nYusuf will be turbaned as Taliban Daura, making him the District Head of Kwasarawa, by the Emir of Daura, Alhaji Umar Farouk.\nThe event is scheduled to hold in Daura, the country home of President Buhari.\nIn the company of the Senate President from Abuja are Senator Yusuf Abubakar Yusuf, Senator Mohammed Sani Musa, and Senator Bello MandiyaThe Senate President is expected back in Abuja immediately after the event."
  },
  {
    "headline": "Nembe Oil Spill: Ijaw Diaspora Council writes Minister of Humanitarian Affairs, demands independent investigation",
    "summarized_story": "According to the letter, OML29 is operated by Aiteo Eastern Exploration and Production Company, with 51 per cent of its equity owned by the Federal Government of Nigeria.\nThe letter reads in part, “Our attention has also been drawn to the cause of the spill by the Bayelsa State Government and the community, who attributed the cause of the spill to equipment failure.\n“However, we await the official position of the National Oil Spill Detection and Response Agency (NOSDRA), which is the agency saddled with the mandate to detect, monitor, and manage oil spills in Nigeria, to the effect that an evidence-based investigation is embarked upon to ascertain the cause of the Spill and its volume.\n“The immediate provision of alternative sources of income, necessitated by the loss of sources of livelihood in the over 40 indigenous Ijaw communities which were directly impacted by the OML 29 oil and gas blowout.\nVanguard News Nigeria"
  },
  {
    "headline": "Gender justice, game-changer for Nigeria — CCN President",
    "summarized_story": "By Luminous Jannamike, AbujaPresident of the Christian Council of Nigeria (CCN), Most Rev.\nDr Benebo Fubara-Manuel, says pursuing gender justice for women will be a game-changer in addressing the nation’s challenges.\n“Many women and girls struggle to survive in spite of their enormous legal and human rights.\n“To say ‘no’ to all this is to pursue justice, and we would truly pursue justice when we affirm our own culpability in injustice.\nHe, however, solicited the support of government and other stakeholders in promoting equal opportunity for women to drive national development, saying: “We cannot pursue justice alone."
  },
  {
    "headline": "Combined military forces neutralize scores of bandits, injure many in Sokoto",
    "summarized_story": "A Joint military taskforce has neutralized scores of bandits operating within Isah Local Government Area of Sokoto State.\nThis is as the military’s taskforce operations launched attacks in the bandits’s camps.\nSources in the army said the military onslaught was led by the General Officer Commanding 8th Division, Nigeria Army Headquarters, Sokoto, Major General Uwem Bassey.\nIt was learnt that two villages within Isa Local Gvernment Area, Satiru and Katanga suffered series of attacks from bandits, which resulted to the death of many community members in the axis.\nThis medium gathered that the military operatives, however, stormed the bandits’ hideouts between Thursday and Friday, killing many of the terrorists in the Local Government Area of the State."
  },
  {
    "headline": "Boko Haram: What Buhari said in Turkey",
    "summarized_story": "President Muhammadu Buhari, Saturday, in Istanbul called on the Turkey-Africa Partnership Summit to provide concrete support to help defeat terrorism and insurgency on the African continent.\nSpeaking at the third edition of the Summit, President Buhari said the Boko Haram terrorist group, though fragmented by internal strife and degraded by Nigeria’s defense forces, was still active and preying on soft targets.\nOn the global coronavirus pandemic, President Buhari urged nations to follow the example of Africa-Turkey cooperation, which emphasizes solidarity and support in tackling the challenge.\nReaffirming that international trade is an engine for development and sustained economic growth, as well as the global eradication of poverty, President Buhari welcomed the significant increase in trade figures between Africa and Turkey.\nHe urged the African Continental Free Trade Agreement (AFCTA) to assist in further increasing the level of Africa-Turkey trade, leading to a win-win for all countries."
  },
  {
    "headline": "Canada lifts travel ban on Nigeria",
    "summarized_story": "The Canadian government has lifted the ban imposed on travel from Nigeria and nine other African countries.\nThis comes almost three weeks after the Canadian government banned 10 African countries over concerns relating to the Omicron COVID variant.\nAside from Nigeria, the other countries affected were Botswana, Egypt, Eswatini, Lesotho, Malawi, Mozambique, Namibia, South Africa and Zimbabwe.\nSpeaking on the reversal of the ban, Duclos said the new development will take effect from December 18.\n“Given the current situation, this measure has served its purpose and is no longer needed,” he said."
  },
  {
    "headline": "Four killed, one injured in fresh militia attack in Southern Kaduna",
    "summarized_story": "Four persons have been killed in another fresh attack by suspected Fulani militia at Zaman Dabo village, Atyap Chiefdom, in Zangon Kataf Local Government Area of Kaduna State.\nDAILY POST recalls that the Atyap Chiefdom has consistently come under attacks by suspected Fulani militias, killing a quiet number of people, setting houses ablaze and destroying other properties, including crops.\nA source, who sought for anonymity, explained that the attackers stormed the village in the night and carried out their evil plan.\nAccording to the source, “Apart from the four persons killed by the attackers, one person was seriously wounded and has been rushed to an undisclosed hospital for treatment.”The State Police Public Relations Officer, ASP Mohammed Jalige, when contacted, promised to get in touch with the Area Commander and get back."
  },
  {
    "headline": "Speculations as Buhari ‘cancels’ trip to Ogun State",
    "summarized_story": "A planned visit of President Muhammadu Buhari to Ogun State has been suspended indefinitely.\nEarlier, the Governor Dapo Abiodun government had announced to the people of the Gateway State that the President would be in the State to commission what it called legacy projects.\nHowever, the Ogun State Government announced on Friday evening that the visit had been postponed.\nThe APC in Ogun State is divided between the Abiodun faction and the former Governor Ibikunle Amosun faction.\nDAILY POST learnt that President Buhari and the leadership of the APC are making efforts to resolve the crisis in Ogun APC through a sharing formular that would be a ‘win-win’ situation for both parties."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Oyinlola: I’ve details of how Akande financed his reelection",
    "summarized_story": "A former Governor of Osun State, Prince Olagunsoye Oyinlola, has alleged that Chief Bisi Akande financed his 2003 re-election by collecting part payment from the contractor building the governor’s office.\nHe said: “On the Osun State Governor’s Office (Bola Ige House contract), Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“But the project consultant shocked everyone with his claim that part of the payment was taken back to finance the 2003 re-election bid of Chief Akande.\nOne of Akande’s appointees confessed collecting money from this contractor for Akande’s re-election.\n“I consulted Chief Akande on this."
  },
  {
    "headline": "Breaking: Customs intercepts container-load of firearms at Tin Can Port – The Sun Nigeria",
    "summarized_story": "By Steve AgbotaThe Tin Can Island Command of the Nigeria Customs Service (NCS) has intercepted a container loaded with guns and ammunition at the terminal B2 (Vehicle) of the TICT.\nSunday Sun learnt that the container was reportedly declared as plasma television, but on examination, Customs discovered it to be loaded with cartons of guns.\nHowever, the incident was surprising to the examination officers and the clearing agent because the shipper made very feeble attempt at concealing the firearms.\n“I wish therefore to confirm that a container suspected to be laden with arms and possibly ammunition was intercepted.\n“Following this development, the command intimated the terminal operators and requested that the suspected container be transferred to our enforcement unit for 100% examination."
  },
  {
    "headline": "Nigerian Navy reiterates commitment to protection of the maritime environment",
    "summarized_story": "BY PHILIP NWOSUThe Nigerian Navy said it would continue to secure the maritime environment for businesses to thrive in the country.\nThe Flag Officer Commanding (FOC), Western Naval Command, Rear Admiral Jason Gbassa said this during the 2021 Nigerian Navy Ceremonial Sunset for Lagos area which held at the Nigerian Navy Ship (NNS) BEECROFT, Apapa.\n“This will re-energise the Nigerian Navy and enhance her as a well-motivated naval force in the discharge of her constitutional mandate.\n“This has been the CNS mantra and we, in the Lagos area will ensure that the maritime environment is secured for economic activities to thrive,” Gbassa said.\nHe urged military personnel to reflect on the expectations of the maritime stakeholders and brace-up to whatever sacrifice they may be called upon to make in ensuring safety of the maritime environment."
  },
  {
    "headline": "Fire in Okeafa, Isolo sends residents panicking",
    "summarized_story": "Property worth millions of naira have been destroyed at the Okeafa plank Market near the Jakande Gate area of Lagos, as a night fire wreaks havoc at the market.\nWitnesses said the fire started late in the evening and continue till very late in the night, as the cause of the fire remains unknown.\nThe huge fire sends residents of the area into panic as they battle along side fire fighters to quell the the fire."
  },
  {
    "headline": "My plan after office in 2023 –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident President Muhammadu Buhari has assured that he would hand over to a successor at the end of 2023 general elections, after which he would return to his farm.\n“I look forward to the year 2023 when I will finish, to go home to take charge of my farm.\n“As he stepped out of his suite moving to the meeting room, President Buhari met a surprise line-up of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\nMeanwhile, President Buhari has said in furtherance of sustained efforts at keeping Nigerians safer, the country would partner with Turkey in dealing with the current security challenges facing the nation.\nHe said: “Turkey has practical experience dealing with challenges over the years and Nigeria stands to gain from that.”"
  },
  {
    "headline": "Popular Ifa priest, Yemi Elebuibon: Blood money ritual a hoax",
    "summarized_story": "Prominent Ifa priest, Chief Ifayemi Elebuibon, has debunked the belief by some Nigerians that using human blood and body parts could generate wealth.\nHe is the founder of Ancient Philosophy International, Osogbo, Osun State, a centre dedicated to teaching African traditional religion and performing arts.\nYou have been consistent as a traditional priest for many years, in spite of the decreasing popularity of traditional religion.\nThere is no lesson that the Bible or the Quran taught us that is not in Ifa Oracle.\nI have never at a time thought of leaving traditional religion."
  },
  {
    "headline": "Turkey to Help Nigeria Tackle Insecurity; Buhari, Erdogan Strengthen Defence Ties",
    "summarized_story": "“I am happy Nigeria is stepping up cooperation with other nations in areas of defence and health, and we are ready to cooperate with you on these areas and more,” said Erdogan.\nPresident Buhari had earlier said Nigeria would partner with the Republic of Turkey in dealing with the current security challenges facing the nation.\nPresident Gets Surprise Birthday Cake in IstanbulPresident Buhari, at a surprise 79th birthday reception organised for him in Istanbul yesterday promised to advance the interest of Nigerians and that of the nation as he prepares to leave office in May, 2023.\nAs he stepped out of his suite, moving to the meeting room, President Buhari met a surprise lineup of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\n“I look forward to the year 2023 when I finish, to go home to take charge of my farm."
  },
  {
    "headline": "NLC to FG: We will Confront Fuel Subsidy Removal with Protests",
    "summarized_story": "*Plans nationwide warning rallies January next yearOnyebuchi Ezigbo in AbujaThe Nigeria Labour Congress (NLC) yesterday warned the federal government against plans to remove the fuel subsidy in 2022, saying the action would be met with nationwide protests.\nThe congress said the protests would commence without warning should the FG announce new fuel prices ahead of its scheduled warning rallies in all the states of the federation in January.\nThe FG had said it would remove the fuel subsidy next year, following advice by the International Monetary Fund, and the World Bank.\nThe NLC argued that fuel subsidy would expose Nigerian workers and the generality of the citizenry to acute deprivation, hardship and suffering, as it would worsen the already established trend of hyperinflation in the country.\nThis, it noted, informed the traditional position of the Congress to reject an incessant increase in the pump price of petrol which is usually disguised as deregulation or removal of fuel subsidy."
  },
  {
    "headline": "US Study: Omicron Markedly Resistant to Vaccines, Booster Shots",
    "summarized_story": "*Canada lifts travel ban on Nigeria, 9 other African countriesOur correspondentsA new study by Columbia University in the United States says the Omicron variant of COVID-19 is “markedly resistant” to existing vaccines and antibody treatments, and that even booster shots may provide only modest protection against infection.\n“We found Omicron to be markedly resistant to neutralisation in individuals vaccinated with one of the four widely used COVID-19 vaccines.\nEven serum from persons vaccinated and boosted with mRNA-based vaccines exhibited substantially diminished neutralising activity against Omicron,” says the study.\nThe country also re-imposed testing, warning that the Omicron variant of COVID-19 risks quickly overwhelming hospitals.\nHe said the lifting of the travel ban would take effect from 11:59 pm today."
  },
  {
    "headline": "In Battle for Control of FBN Holdings, Babalola Out, Abdullahi is New Chairman",
    "summarized_story": "Obinna ChimaIn what is evidently a battle for the control of FBN Holdings (FBNH), Remi Babalola yesterday resigned as Chairman, Board of Directors of the company, two days after FBNH confirmed significant investment by billionaire businessman, Femi Otedola.\nFBN Holdings is the parent company of First Bank of Nigeria.\nLast week, Otedola acquired an additional 2.5 per cent in FBN Holdings Plc., becoming the single largest shareholder in the company.\nIn a corporate filing on the Nigerian Exchange Limited (NGX) on Wednesday, FBN Holdings confirmed the deals.\nCBN Okays Abdullahi as New ChairmanThe CBN yesterday okayed the appointment of Abdullahi as the new Chairman of FBNH to replace Balalola."
  },
  {
    "headline": "How Buhari Marked 79th Birthday in Turkey",
    "summarized_story": "By Garba ShehuOn his 79th birthday, today Friday in Istanbul, Turkey, President Muhammadu Buhari cut a birthday cake moulded in national colours, green-white-green to start the day, went straight to chair a planning meeting with officials in his delegation and thereafter drove to the Dolmabahce Palace for a meeting with his Turkish counterpart, Tayyip Recep Erdogan.\nThe Guards Brigade had written to tell me what they wanted to do on this day.\n“I look forward to the year 2023 when I finish, to go home to take charge of my farm.\nAs he stepped out of his suite moving to the meeting room, President Buhari met a surprise lineup of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\nMinister Onyeama noted in particular that the President continues to have a good run with his health, getting better and more active with time."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Travellers In Ghana Forced To Pay $100 Per Night To Isolate At Hotel That Offers No Water, Food After Testing Positive For COVID",
    "summarized_story": "Aviation authorities in Ghana have heightened their clampdown on Nigerians who test positive for Coronavirus while travelling through any of their airports.\nOfficials of the West African nation move affected Nigerian travellers to M Plaza Hotel in Accra, the country’s capital, and force them to pay $100 (N56,000) per night to isolate themselves at the place.\nAccording to findings by SaharaReporters, the amount does not give the affected person access to water or food at the hotel.\nHe said, “Passengers who test positive for COVID are forced to pay $100 a night in a hotel that’s not worth the amount.\n“There is a pregnant woman currently among the Nigerians being forced to stay at M Plaza Hotel in Accra."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Travellers In Ghana Forced To Pay $100 Per Night To Isolate At Hotel That Offers No Water, Food After Testing Positive For COVID",
    "summarized_story": "Aviation authorities in Ghana have heightened their clampdown on Nigerians who test positive for Coronavirus while travelling through any of their airports.\nOfficials of the West African nation move affected Nigerian travellers to M Plaza Hotel in Accra, the country’s capital, and force them to pay $100 (N56,000) per night to isolate themselves at the place.\nAccording to findings by SaharaReporters, the amount does not give the affected person access to water or food at the hotel.\nHe said, “Passengers who test positive for COVID are forced to pay $100 a night in a hotel that’s not worth the amount.\n“There is a pregnant woman currently among the Nigerians being forced to stay at M Plaza Hotel in Accra."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "Police: We’ve released Oromoni’s body to family for burial after autopsy",
    "summarized_story": "The Lagos state police command says it has released the corpse of Sylvester Oromoni Jnr, the 12-year-old student of Dowen College, to his family for burial.\nAdvertisementAdekunle Ajisebutu, the command’s spokesman, disclosed this in a terse statement sent to TheCable Lifestyle on Friday.\nAjisebutu said the student’s corpse was released to his family after an autopsy was conducted on him to ascertain the cause of his death.\nHe also said the results of the autopsy conducted have not been released.\nCorpse released to family for burial."
  },
  {
    "headline": "VIDEO: Corps member proposes to soldier in Kwara NYSC camp",
    "summarized_story": "A video of a male corps member proposing to a female soldier at the Yikpata orientation camp of the National Youth Service Corps (NYSC) in Kwara has surfaced online and gone viral.\nAdvertisementIn one of the video clips, some corps members were seen having a discussion at a venue believed to be the parade ground of the orientation camp.\nThe corps member was seen wearing the lady’s military cap as she stood directly behind him.\nThe development comes as a shift from incidents of soldiers assaulting corps members in recent times.\nIn September, Chika Anele, a female soldier, provoked widespread criticism for bathing Ezeiruaku Ifeyinwa Fidelia, a corps member in Calabar, Cross River state, with dirty water."
  },
  {
    "headline": "ASUU: FG has turned lecturers to farmers, taxi drivers",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) says the federal government has turned some of its members into farmers and taxi drivers.\nAdvertisementAdelaja Odukoya, Lagos zone coordinator of ASUU, spoke on Tuesday at the end of the union’s zonal meeting held at the Federal University of Agriculture, Abeokuta (FUNAAB) in Abeokuta, Ogun state.\nOdukoya said by refusing to implement the memorandum of action signed with the union in 2020, the federal government is deliberately impoverishing university lecturers in the country.\n“How can Nigerian university teachers play their part in this process if they have to contend with the perennial problem of miserable salaries, especially under conditions of hyperinflation?\nAdvertisement“It is troubling that the Nigerian government has turned a blind eye to the suffering of Nigerian university academics."
  },
  {
    "headline": "NUC names UI as Nigeria's best varsity in 2021",
    "summarized_story": "The National Universities Commission (NUC) has named the University of Ibadan (UI) as the best federal institution in the country for 2021.\nSpeaking at the event, Peter Okebukola, NUC’s former executive secretary, said this year’s ranking involved 113 universities and was done using 12 indicators.\nAdvertisementOther criteria, according to him, include the percentage of international staff, the percentage of programmes with full-time accreditation, and all citations per capital.\nOkebukola disclosed that the Federal University of Technology Akure (FUTA) came second on the list.\nAdvertisement“For this 2021 edition, based on the 12 indicators that we have developed, University of Ibadan is the first followed by Federal University of Technology Akure,” he said."
  },
  {
    "headline": "WATCH: MI, Simi, Mayorkun perform at Chike’s first Lagos concert",
    "summarized_story": "MI Abaga, Simi, and Mayorkun were among the artistes that performed at ‘No Music, No Life’, a concert organised by Chike, the Nigerian singer.\nAdvertisementThe event, hosted by the duo of Funny Bone and Melody Hassan, took place at the Muri Okunola Park in Victoria Island, Lagos, on Friday night.\nBlaqbonez and Olakira also performed at the event as they thrilled the audience with several of their hit songs.\nIt is understood that the concert, originally scheduled to start by 7 pm was delayed till 11:30 pm.\nAfter the reality show, it took me about three years plus to be able to get anything properly to sort myself."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTeamApt deploys an interesting 70% active POS terminal performance management system for cluster managers.\nThis drives cluster managers to identify and recruit the best agents and engage them daily to improve their performance.\nIt affects your cluster manager’s appraisal, which in turn affects your state co-ordinator and regional manager’s appraisal.\nMerchant agents can become cluster managers at LG level, grow into state managers, and finally regional heads, while increasing their earnings along the way."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 reasons you should care about the next frontier",
    "summarized_story": "Since then, we’ve explored The Next Frontier as it relates to edtech and fintech.\nAPI healthtech startupsPhoto by National Cancer Institute on UnsplashThe fintech industry has benefited a great deal from the presence of API fintech startups as they have eased interoperability.\nCurrently, there are no African startups providing healthtech startups with an API.\nWithout API startups, the process of getting your medical history has to begin afresh, but with an API startup, all that information could be gotten in seconds.\nHolding on January 22, 2022, it will feature startup competitions and exhibitions in addition to conversations on The next frontier."
  },
  {
    "headline": "A Zimbabwean Data Protection Act to rule them all. Or not",
    "summarized_story": "Other laws included the Consumer Protection Act, Census and Statistics Act, and the Interception of Communication Act, among others.\nInitially, The Cybercrimes and Data Protection Bill was to cover all things incidental to Cybercrime and Data Protection.\nAdvertisementThe current state of affairsThe Data Protection Act, as it is known now, is styled after the Southern Africa Development Community (SADC) model law on data protection.\nAnd it might be easier than starting afresh.”Following the recommendation of the Parliamentary Joint Committee, the new act was renamed the Data Protection Act instead of the Cybercrimes and Data Protection Act.\nThe European Union’s General Data Protection Regulation — the first comprehensive data protection law — provides for this."
  },
  {
    "headline": "Nigeria-based logistics company launches HELP, to provide ambulance services with its Uber-like model",
    "summarized_story": "Our people are scared for their lives, because what happens in the case of a health emergency?\nHow it worksThe HELP mobile app is currently available for Android users on the Play Store and is soon to be available on the App Store.\nThere are two levels of external partners at HELP, Service Partners and Client Partners.\nService partners on the HELP platform include hospitals, health facilities, and private ambulance owners in the country.\nInterestingly, a random person can access the HELP service with the code."
  },
  {
    "headline": "Recharge card sellers struggle to survive as buyers move online",
    "summarized_story": "People depended on him to sell physical recharge cards to stay in touch with their loved ones or conduct their businesses.\nI had to add provisions and snacks to support myself as the recharge card business started slowing down,” he told BusinessDay.\nShe says the business is still going well as she gets a lot of Customers who buy recharge cards from her.\nAccording to Hammed, the paper recharge card attracts more cost for the company compared to the digital form of recharging.\nKanayo, who was sitting underneath a Recharge card seller’s umbrella, told BusinessDay that he prefers to recharge online than buy the recharge card (on paper) due to the convenience that comes with it."
  },
  {
    "headline": "What to look out for in an artist",
    "summarized_story": "However, just by self proclamation, or being called an Artist by others does not translate to mean that such an artist is considered good or great.\nThe latter part of Amanda Palmer’s quote aptly captures it all; “You’re…a good artist when you make somebody else experience or feel something deep or unexpected.” One can recognise a good or great artist by how her/his art makes them feel.\nHowever, should a good or great artist be measured only by how her/his art makes one feel?\nThere are other things that make up the secret sauce of what makes an artist good or great.\nThe current market value of an artist can in many ways foretell how good or great this artist may become."
  },
  {
    "headline": "Obaseki congratulates Alenkhe on emergence as Edo NUJ chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated Mr. Festus Alenkhe on his emergence as the Chairman of the Edo State chapter of the Nigeria Union of Journalists (NUJ) after a keenly contested election.\nAlenkhe, a crime journalist with the state-owned Edo Broadcasting Service (EBS), defeated the immediate past Secretary of the union, Titus Akhigbe.\nObaseki described the outcome of the election as a reflection of the choice of journalists and media professionals across the different chapels in the state.\nHe noted that Alenkhe is a thorough-bred journalist who has distinguished himself in crime reporting, noting that he was confident that he would bring his wealth of experience to bear in the administration of the NUJ in the state.\nThe governor urged Alenkhe on uniting the NUJ and mobilizing members of the union to meet their function of providing information, enlightenment, entertainment and surveillance to the larger society."
  },
  {
    "headline": "Osinbajo, Obaseki lay foundation for 20-hectare Edo Tech Park, inaugurate shared facility for MSMEs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Vice President Yemi Osinbajo and the Edo State Governor, Mr. Godwin Obaseki, on Friday, performed the groundbreaking for the 20-hectare permanent site of the Edo Tech Park and inaugurated a shared facility for Micro, Small and Medium Enterprises (MSMEs) in Edo State.\nInaugurating the shared facility for furniture production in Edo, Osinbajo said MSMEs are of top priority to the government in boosting the country’s economy.\nCommending the Vice President, Obaseki said the state government will adopt the facility model to build similar facilities in the six technical colleges across the state.\nMeanwhile, laying the foundation for the Edo Tech Park, the Vice President said the government will continue to play the role of a regulator in the tech space.\nThat mustard seed you sowed is what you saw at the take-off campus of the Edo Tech Park."
  },
  {
    "headline": "Students’ unrest: Edo govt shuts Idogbo Secondary School – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Friday, announced the indefinite closure of Idogbo Secondary School in Ikpoba-Okha Local Government Area of the state, following the destruction of the school’s property by some students and hoodlums on December 2, 2021.\nSecretary to the State Government, Osarodion Ogie Esq., in a statement, said the closure of the school is to enable the government to ascertain the level of destruction, effect repairs and put modalities in place to avoid any reoccurrence in the future.\nOgie noted that the resumption date for the school will be communicated in due course.\nAccording to him, “It is hereby announced for the information of the General Public, especially the Principals, Teachers and Students of Idogbo Secondary School, Idogbo, Ikpoba-Okha Local Government Area, that sequel to students unrest, which resulted in the destruction of the school’s property by some students and hoodlums on December 2, 2021, the school is hereby closed down till further notice.\n“The closure of the school is to enable the State Government ascertain the level of destruction, effect repairs and put modalities in place to avoid any reoccurrence in future.”..."
  },
  {
    "headline": "Obaseki strengthens security architecture, donates 50 patrol vehicles, 60 motorcycles to operatives – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has presented 50 patrol vehicles and 60 motorbikes to security agencies to further strengthen the capacity of security operatives to tackle crime and criminality in the state.\nObaseki handed over the vehicles to the security operatives shortly after the monthly Security Council Meeting at the state’s Command and Control Centre in Benin City.\nAccording to him, “Today, we are formally handing over the first batch of vehicles and bikes to security agencies to sustain our security network in Edo.\nThese are made up of 50 vehicles, including patrol and Hilux vans and 60 motorbikes.\nThe governor said all federal security operatives and the state’s vigilante network will be represented at the new Command and Control Centre."
  },
  {
    "headline": "Nigeria’s debt to China rises to $4.15 billion",
    "summarized_story": "Debt Management Office (DMO) in its latest data has revealed that Nigeria’s debt to China is $4.15 billion as of September 2021.\nThis balance is out of a total debt of $6.5 billion available for Nigeria to draw down.\nMost of the debts are for a period of 20 years with a grace period to repay the principal of about 7 years.\nOnly a $200 million debt had a tenor of 12 years with a grace period of 5 years.\nNigeria’s debt to China has risen over the last decade as government diversifies its debt portfolio towards cheaper Chinese loans with rates at an average of 2.5% per annum."
  },
  {
    "headline": "Customs Intercepts Container-Load Of Guns In Lagos",
    "summarized_story": "Officials of the Nigeria Customs Service attached to Tin Can Island Command intercepted a 40ft container carrying arms on Friday.\nThe owner of the container allegedly declared that the content were plasma televisions, but customs officers at the command discovered it contained cartons of guns.\nThe Public Relations Officer of the Tin Can Customs, Mr Uche Ejesieme, confirmed the development, saying that the container of guns was discovered during a routine examination at terminal B2 (Vehicle) of the TICT.\nHe added that, in line with service protocol, the command would inform the Customs high command in Abuja after the container had been thoroughly examined at the enforcement unit of the command.\nCustoms owed to trace the matter to its very roots and apprehend those in connection."
  },
  {
    "headline": "FAAC: FG, States, LGs Share N675.946bn November Allocation",
    "summarized_story": "The communiqué confirmed that from the total distributable revenue of N675.946 billion; the Federal Government received N261.441billion, the State Governments received N210.\nFrom this, the Federal Government received N231.863 billion, the State Governments received N117.604 billion and the Local Government Councils received N90.668 billion.\nIn the month of November 2021, the gross revenue available from the Value Added Tax (VAT) was N196.175 billion.\nThe sum of N5.650 billion allocation to NEDC and N7.847 billion cost of collection were deducted from the N196.175 billion gross Value Added Tax (VAT) revenue, resulting in the distributable Value Added Tax (VAT) revenue of N182.678billion.\nAccording to the Communiqué, in the month of November 2021, Petroleum Profit Tax (PPT), Oil and Gas Royalties, Companies Income Tax (CIT) and Value Added Tax (VAT), increased remarkably."
  },
  {
    "headline": "2021 BRANDCOM Awards: Bua Group wins accolades for excellence",
    "summarized_story": "BUA Group has won the “Most Outstanding Manufacturing Conglomerate of The Year” and the “Most Outstanding Manufacturing Conglomerate In CSR” awards at the 2021 BRANDCOM Awards organized by leading West African brand and marketing publication, Brand Communicator.\nThese awards came shortly after the brand was named “Outstanding Indigenous Conglomerate of the Decade” at the 2021 Marketing Edge Africa Awards.\nA statement by BUA thanked the organizers for their recognition of BUA’s excellence and innovation in the provision of high-quality products and rendering exceptional services.\nAccording to the group, the awards are testament to the Afrocentric economic vision of its Chairman, Abdul Samad Rabiu, to develop Africa using resources available within the continent.\n“This award is dedicated to the thousands of BUA employees and our numerous customers across the world.”Also, the Group Head/General Manager, Corporate Communications of BUA Group, O’tega Ogra, was announced as the, “Most Outstanding Corporate Communications Professional (Manufacturing)”at the same event – an award reserved for corporate communications professionals who have distinguished themselves through hard work, dedication and consistency in upholding excellence as a watchword for service."
  },
  {
    "headline": "The Treasury Will Support NMDPRA To Succeed – AGF Idris",
    "summarized_story": "The Accountant General of the Federation (AGF), Ahmed idris, has pledged the support of the Treasury to the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) to help it succeed in its operations.\nIdris said this when he received the management team of the Agency, led on a courtesy visit by the Executive Director (Finance and Account), Mr. Abiodun Adeniji.\nHe congratulated the management team on their appointment and charged them to uphold the ideals of transparency, accountability and zero tolerance for corruption.\nWhile commending the Accountant General of the Federation for providing visionary leadership for the Treasury, Mr. Adeniji solicited the cooperation of the Treasury to help the Agency succeed in its operations.\nPresent at the courtesy visit were Treasury Directors and members of the management team of the NMDPRA."
  },
  {
    "headline": "CASER Seeks Disengagement Of MedTech, Others In Implementation Of ICTN",
    "summarized_story": "The Citizens Advocacy For Social and Economic Rights (CASER) has decried the blatant disregard for legal standards of public procurement as being witnessed in the alleged manipulation of President Muhammadu Buhari’s earlier directive for an International Competitive Bidding to be conducted for the appointment of an agent to implement the International Cargo Tracking Note (ICTN).\nICTN is a web-based portal for managing the security and accuracy of cargo, freight, and vessels coming into and leaving Nigeria.\nIt is a cargo verification solution that is internet[1]based and provides real-time information on cargo destined to implementing country.\nAddressing a press briefing in Abuja yesterday, the executive director, CASER, Barr Frank Tietie, said to cover up violations MedTech Scientific Ltd and Rozi International were appointed to implement ICTN in the country.\nTietie said they are compelled as a Nigerian civil society organisation, in the public and national interest, to bring to the attention f the public that the ongoing implementation of ICTN as recently directed by President Buhari was fraught with issues of official malfeasance, fraudulent misrepresentation, and brazen violation of known legal standards of public procurement."
  },
  {
    "headline": "WISHLIST: THE TOP five THINGS THAT WILL WOW ME!",
    "summarized_story": "YOU MAYLIKE"
  },
  {
    "headline": "WEEKEND COOKING – Leah Twaki: Crunchy Crispy Chicken",
    "summarized_story": "Nigerian Christmas brings a lot of things to memory, It is always a memorable event for the Christian folks in Nigeria as well as the rest of the world, it is characterized by happiness, sharing of gifts and delicious foods (chicken, salad, rice) and the drinks that go along with them.\nWith Christmas just a week away, garnish your dishes with not just ordinary fried chicken but with YUMMY CRUNCHY CRIPSY CHICKEN that leaves you craving more.\nIngredients: Some chicken thigh, I cup of all-purpose flour, 2 Tsp of onion powder, 2 Tsp garlic powder, ½ Tsp of paprika, 2Tsp of black pepper, hot chilli powder to taste, 2-3 Tsp of salt, 1 egg, and ½ cup of milk.\nProcedure:ADVERTISEMENT"
  },
  {
    "headline": "Rare Nollywood Location Shots: Bad boy Jim Iyke ‘’falls in love’’ with star actress, Eucharia Anunobi",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Rare Nollywood Location Shots: Bad boy Jim Iyke ‘’falls in love’’ with star actress, Eucharia Anunobi",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Opinion: “Unqualified” but quality teachers! – By DANIEL IGHAKPE",
    "summarized_story": "Going by this new policy on possession of only education-related qualifications by all schoolteachers, some pertinent questions arise in the minds of many, especially those who are likely to be affected by it.\nWould people currently working as Teaching Assistants/Assistant Teachers/Classroom Assistants also be required to possess the education-related qualifications currently required of all schoolteachers?\nWhen a person with children to care for loses a job, it is a terrible personal tragedy.\nToday, in fact, some experts note the emergence of an “anticipatory anxiety” related to the possibility of losing one’s job.\nIt should also be noted that many other factors contribute toward the low quality and falling standard of the educational system apart from the inadequate qualifications of some schoolteachers."
  },
  {
    "headline": "Opinion: “Unqualified” but quality teachers! – By DANIEL IGHAKPE",
    "summarized_story": "Going by this new policy on possession of only education-related qualifications by all schoolteachers, some pertinent questions arise in the minds of many, especially those who are likely to be affected by it.\nWould people currently working as Teaching Assistants/Assistant Teachers/Classroom Assistants also be required to possess the education-related qualifications currently required of all schoolteachers?\nWhen a person with children to care for loses a job, it is a terrible personal tragedy.\nToday, in fact, some experts note the emergence of an “anticipatory anxiety” related to the possibility of losing one’s job.\nIt should also be noted that many other factors contribute toward the low quality and falling standard of the educational system apart from the inadequate qualifications of some schoolteachers."
  },
  {
    "headline": "BREAKING: Popular Ex-Minister Is Dead",
    "summarized_story": "Alhaji Hussaini Zanwa Akwanga, a former Minister of Labour and Productivity, is dead.\nAccording to a report by Vanguard, Akwanga died on Friday at the age of 77 after a protracted illness in his country home Akwanga, the headquarters of Akwanga local government of Nasarawa State.\nThe former Minister, a professional teacher, became a minister in 2003 but was sacked by the then President Olusegun Obasanjo.\nIn 2017, the former minister was kidnapped in his farm in Kurmin Tagwaye Village, near Akwanga, but was however released two days later after paying the ransom.\nThe deputy chairman of Akwanga local government area of Nasarawa State, Alhaji Safiyanu Isa who confirmed the death of the former Minister said “the former minister died today (Friday), in Akwanga”He has since been buried according to Islamic rites in his hometown, Akwanga."
  },
  {
    "headline": "BREAKING: Sokoto Governor, Tambuwal Orders Arrest Of Musician Who Released Song Praising Bandit Kingpin, Turji",
    "summarized_story": "Sokoto State governor, Aminu Waziri Tambuwal has ordered the arrest of a musician, Mohammad Danshanawa for praising a bandit kingpin, Bello Turji in his music.\nIn a viral music audio, Danshawa praised the terrorist, Turji, describing him as “a lion, untouchable and a great leader”.\nThe governor’s order comes three days after the song went viral on several social media platforms.\nCommenting on the song, Governor Tambuwal said, “We ordered for his arrest to serve as a deterrent.\nAs it is, one cannot move from Sokoto here to Illeila, yet someone is praise-singing a terrorist.”"
  },
  {
    "headline": "Musician Releases 14-Minute Long Song Celebrating Bandit Kingpin, Bello Turji",
    "summarized_story": "A man named as Adamu Ayuba has released a song in support of and celebration of Bello Turji, the head of a group of lethal robbers.\nTurji, a native of Zamfara State’s Shinkafi, has been linked to a series of attacks on communities in Sokoto, Zamfara, and sections of the Niger Republic.\nAyuba sang the nearly 14-minute song in Hausa, with a female chorus hailing Turji as a hero among heroes.\nThe group said, “Sources close to the Sokoto branch of MURIC have reported the strong nexus between one Bello Turji, a notorious bandit, and insecurity in Sokoto and Zamfara states.\nA commando-style operation may become necessary in order to neutralise Bello Turji."
  },
  {
    "headline": "BREAKING: FEC Approves 20% Salary Upgrade For Police Officers",
    "summarized_story": "The Nigeria Police Force has received a 20% pay raise from the Federal Government.\nMuhammad Dingyadi, Minister of Police Affairs, told State House Correspondents in Abuja on Wednesday after the President, Major General Muhammadu Buhari, presided over the Federal Executive Council meeting (retd.).\nHe also stated that the rise will begin in January 2022.\nThe upward evaluation, according to Dingyadi, is a result of the issues presented during the #EndSARS protests in October 2020.\nHe claims the action is intended to increase police morale across the country."
  },
  {
    "headline": "Sylvester Oromoni, others: Boarding schools now death chambers?",
    "summarized_story": "Are boarding schools now death chambers, PAUL OKAH asks in this report.\nThis is as the House of Representatives directed the Inspector General of Police to investigate all victims of crimes in boarding schools.\nAlthough we do have one or two issues, but, to be frank, there are nothing compared to all these problems recorded in private boarding schools.\nMany parents often take their kids to boarding schools, simply because they’re avoiding responsibilities and also many of the children at boarding schools are products of broken homes.\nMajority of the shortfalls are mostly found within the private boarding schools."
  },
  {
    "headline": "Breaking: Fire engulfs another popular Lagos market",
    "summarized_story": "Another popular market located in Lagos state is currently raging on Friday night with fire, burning goods worth millions of naira.\nThe business space is known as plank market, and is located at Kpako, Oke-Afa in Ejigbo local government area of Nigeria’s commercial city.\nOn Wednesday night, goods at Balogun market reportedly burnt uncontrollably.\nDetails loading…"
  },
  {
    "headline": "2021: FG, States, LGs share N675.946bn in November",
    "summarized_story": "A breakdown showed that the federal government received N261.441 billion, States got N210.\nFrom this, the federal government received N231.863 billion, the States received N117.604 billion and the Local Government Councils received N90.668 billion.\nIn the month of November 2021, the gross revenue available from the Value Added Tax (VAT) was N196.175 billion.\nThe sum of N5.650 billion allocation to NEDC and N7.847 billion cost of collection were deducted from the N196.175 billion gross Value Added Tax (VAT) revenue, resulting in the distributable Value Added Tax (VAT) revenue of N182.678 billion.\nFrom the N182.678 billion distributable Value Added Tax (VAT) revenue, the federal government received N27.402 billion, State governments received N91.339 billion and the Local Government Councils received N63.937 billion."
  },
  {
    "headline": "Nigeria Records 1,584 New COVID-19 Cases, Highest In 10 Months",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has reported 1,584 new infections, as the country’s daily COVID-19 tally continues to rise.\nData from the NCDC revealed that the figure reported on Friday is the highest number of cases to be recorded in the last 10 months.\nREAD ALSO: Again, Nigeria’s Daily COVID-19 Infections Exceed 1,000This is even as Nigeria records a tally exceeding the 1,000 mark for the third consecutive day, following the 1,424 and 1,051 cases reported on Wednesday and Thursday respectively.\nAmid concerns over the recent surge in the number of cases reported daily, authorities in Lagos have declared a fourth wave of the pandemic in the state.\nWhile Ekiti and Sokoto States reported no new case, the NCDC said one more person died, raising the nation’s death toll to 2,984."
  },
  {
    "headline": "Death Toll From Philippines Typhoon Passes 30",
    "summarized_story": "Rai was a super typhoon when it smashed into the popular tourist island of Siargao on Thursday, packing maximum sustained winds of 195 kilometres per hour (120 miles per hour).\n“Everything was flying, it was as if it was the end of the world,” Raphy Repdos, a tour operator visiting the island when the storm hit, told AFP.\n“Walls and roofs were torn and blown off by Odette like paper,” Bag-ao said, using the local name for the typhoon.\n“The information we are receiving and the pictures we are receiving are very alarming.”The overall death toll was least 33, according to official tallies.\nRai hit the Philippines late in the typhoon season — most cyclones typically develop between July and October."
  },
  {
    "headline": "Rohr’s Sack, European Clubs’ AFCON Threat + Other Top Sports Stories This Week",
    "summarized_story": "Rohr’s SackWe begin from home where Nigeria on Sunday sacked long-time coach, Gernot Rohr, following a string of unconvincing results.\nDays after Rohr’s dismissal, the Nigeria Football Federation (NFF) President, Amaju Pinnick, explained that the decision had to be made to avoid disaster.\nThe former Super Eagles defender explained that he also did not see Rohr’s sack coming.\nUEFA Draw DramaIn Europe, the UEFA Champions League knockout draws were held earlier in the week but an “error” from the organisers meant it had to be redone.\nCOVID-19 Ravages EPLAguero’s retirement was not the only health-related issue in European football this week."
  },
  {
    "headline": "NLC Calls For Reversal Of Power Sector Privatisation",
    "summarized_story": "The Nigeria Labour Congress on Friday called for an immediate reversal of the privatisation of the power sector, insisting that its original purpose has been defeated.\nNLC President, Mr. Ayuba Wabba made the call at the union’s National Executive Committee meeting in Abuja.\n“We have said that the privatisation of the power sector has failed, and clearly before the privatisation, a lot of promises had been made, that power is going to be affordable, that it is going to be stable, and that there will be no challenge,” he said.\nREAD ALSO: Bandits Scamper For Safety As Military Raid Criminal Enclave In Sokoto“But all of us are aware that five years down the line, nothing has improved, and we have demanded that the privatisation of the power sector should absolutely be reversed because it has not actually provided any headway into addressing the challenge that was very evident before the privatisation process.\nThe NLC also decried the delay in signing the electoral amendment bill into law and said it would not hesitate to resort to protests over the increase in the price of petrol come 2022."
  },
  {
    "headline": "Paris Cancels New Year Fireworks Over Omicron Fears",
    "summarized_story": "EU chief Ursula von der Leyen has warned the Omicron coronavirus variant could be dominant in Europe by mid-January.\nMany countries have decided to reintroduce travel restrictions and other containment measures since it was first detected in South Africa last month.\n“The fireworks will not take place, nor unfortunately will there be any DJ sets,” the mayor’s office told AFP.\nAccording to the reports, the government will hold a news conference at 1800 GMT to announce the new measures.\nAnd in France, Health Minister Olivier Veran said that jabs will start to be administered to children in the same age group from Wednesday."
  },
  {
    "headline": "PGF Secretariat greets PGF DG, Salihu Lukman at 59",
    "summarized_story": "The Progressive Governors Forum (PGF) Secretariat has congratulated the Director General of the Progressives Governor Forum, Salihu Lukman, on his 59th birthday.\nThe statement reads partly thus: “We appreciate your leadership style and personal commitment to the ideals of progressivism.\nAs the Director General of PGF Secretariat, we celebrate your doggedness and uncommon contributions to the development of policies across the APC controlled States and Nigeria as a whole.\n“Here in the secretariat, you always put your time and energy to make staff members be at their best.\n“Once again, congratulations and Happy Birthday, Comrade Salihu Lukman,” the statement said."
  },
  {
    "headline": "Buhari postpones official visit to Ogun",
    "summarized_story": "Ogun State Government has announced the postponement of the official visit of President Muhammadu Buhari to the State initially scheduled for Tuesday, 21st December 2021.\nIn a statement issued on Friday in Abeokuta by Tokunbo Talabi, Secretary to Ogun State Government, the government said a new date for the visit and commissioning of some of the landmark projects of Prince Dapo Abiodun Administration will be announced in due course.\nThe Government regrets any inconvenience the postponement might cause the invited guests, the statement concluded."
  },
  {
    "headline": "Photos: President Buhari cuts 79th birthday cake in Turkey",
    "summarized_story": "President Muhammadu Buhari, on Friday in Istanbul, Turkey cut his 79th birthday cake in the presence of some senior government officials.\nThe president alongside some of his ministers and other presidential aides had departed the country for the Africa-Turkey Investment Summit in Istanbul.\nAccording to pictures from the short ceremony, President Buhari and other top government officials including the minister of Foreign Affair, Geoffrey Onyeama, Minister of State Education, among others were in cheerful mood.\nSee photos below:"
  },
  {
    "headline": "Gov Akeredolu visits Olowo over Elewere’s assassination",
    "summarized_story": "Governor of Ondo State, Oluwarotimi Akeredolu, has commiserated with the Olowo of Owo, Oba Ajibade Ogunoye, over the killing of one of his High Chiefs, Chief Elewere Tunde Ilori.\nChief Elewere was killed by unknown gunmen on a farmland on Wednesday evening.\nChief Elewere had a complain about another family in respect of a farmland.\nI raised a team of chiefs to go and do the inspection of the land and their report seemed to favour chief Elewere.\nChief Elewere was very dear to me, very close and very loyal."
  },
  {
    "headline": "Tesla Faces Investor Lawsuit Over Musk Tweets on 10% Stock Sales",
    "summarized_story": "Tesla Inc) was hit by a lawsuit over CEO Elon Musk’s social media posts including his Twitter poll on stock sales that pulled down its stock prices.\nTesla investor David Wagner called for access to internal documents to investigate whether Tesla and Musk violated an agreement with the U.S. securities regulator and its board members failed to adhere to their fiduciary duties.\nIn 2018, Musk settled a lawsuit by the Securities and Exchange Commission over his tweet on taking the company private, agreeing to have the company’s lawyers pre-approve tweets with material information about the company.\nTesla shares, which had hovered near record-highs, lost their value by about a quarter after Musk said on Nov. 6 he would sell 10% of his stake if Twitter users agreed.\nThe lawsuit, filed with the Delaware Court of Chancery on Thursday, seeks to obtain records and books related to his tweets, including documents to identify whether the stock sales tweets were reviewed or pre-approved in advance."
  },
  {
    "headline": "US Covid Vaccine Mandate Revived, Supreme Court Showdown Looms",
    "summarized_story": "A US appeals court on Friday reinstated a nationwide vaccine-or-testing COVID-19 mandate for large businesses, which covers 80 million American workers, prompting opponents to rush to the Supreme Court to ask it to intervene.\nread more“While we are disappointed in the Court’s decision, we will continue to fight the illegal mandate in the Supreme Court,” South Carolina Attorney General Alan Wilson said on Twitter.\n“We are confident the mandate can be stopped.”Within hours of the ruling, at least three petitions were filed with the U.S. Supreme Court, asking it to immediately block the mandate.\nread moreCourts have blocked Biden’s vaccine requirement for healthcare workers in half the states and a vaccine mandate for federal contractors has been blocked nationwide.\nRepublicans, conservative groups and trade organizations sued over the OSHA rule, arguing the agency overstepped its authority."
  },
  {
    "headline": "Hafsat Maina Muhammed: I Was Raped and Abducted, But Found My Voice",
    "summarized_story": "A heart-rending video call between two ladies went viral went at the weekend.\nThe lady in the video is Hafsat Maina Muhammed, a married mother of six children, and an indigene of Gwoza Local Government Area in Borno State.\nBefore her abduction, Hafsat worked as a full time journalist in Kano for Pyramid FM, Liberty Radio and T.V, FRCN Kaduna and Freedom Radio Jigawa State.\nShe joins the Morning Show from her base in Prince George’s Country in Maryland, U.S. is Hafsat Maina Muhammed.\nGood morning Hafsat and thank you for joining us on The Morning Show."
  },
  {
    "headline": "Following Confirmation of Otedola as Largest Shareholder, FBN Holdings Names Abdullahi New Chairman",
    "summarized_story": "FBN Holdings is the parent company of First Bank of Nigeria.\nAs at press time, it was not clear whether, Abdullahi was nominated by Otedola, who is now the single largest shareholder in the company.\nIndustry sources said FBNH had on Wednesday informed regulators about Otedola’s new position as the single largest shareholder.\nLast week, Otedola acquired an additional 2.5 per cent in FBN Holdings Plc., becoming the single largest shareholder in the company.\nIn a corporate filing on the Nigerian Exchange Limited (NGX) on Wednesday, FBN Holdings confirmed the deals."
  },
  {
    "headline": "Canada Lifts Travel Ban on Nigeria, 9 Other African Countries",
    "summarized_story": "Canada announced on Friday the lifting of a ban on foreign travellers from Nigeria and nine other African countries.\nThe country also re-imposed testing, warning that the Omicron variant of COVID-19 risks quickly overwhelming hospitals.\nApart from Nigeria, the travel restriction on flights is also lifted on South Africa, Mozambique, Botswana, Zimbabwe, Lesotho, Eswatini, Namibia, Malawi and Egypt.\nHe said the lifting of the travel ban would take effect from 11:59 pm today.\nThe restriction had been announced last month “to slow the arrival of Omicron in Canada and buy us some time,” he said."
  }
]