[
  {
    "headline": "Why I stepped down for Atiku – Tambuwal",
    "summarized_story": "Sokoto State Governor, Aminu Tambuwal, has disclosed reasons why he stepped down his presidential ambition to support the candidacy of Atiku Abubakar at the recent presidential primary of the Peoples Democratic Party.\nTambuwal said, “Thank you very much our leaders and distinguished supporters from all over the country for your support and cooperation.\nI must thank leaders of our party here at Sokoto State level and every level.\n“I thank the people of Sokoto State and all my supporters across the country for their support.\nRest assured, we shall work assiduously for the victory of our party come 2023 general election.”"
  },
  {
    "headline": "Ekweremadu, 15 other aspirants congratulated me",
    "summarized_story": "The other aspirants praised by Mbah were Captain Evarest Nnaji, Prof. Barth Nnaji, Senator Gil Nnaji, Chijioke Edeoga, Sir Christian Chinyeaka Ohaa, Rev.\nOthers were Prof Hilary Odo-Edeoga, Dr. G.O.C Ajah, Pastor Beloved Dan Anike, Dr. Kingsley Udeh, Prof. Jehu Nnaji, Dr. Abraham Chukwudi Nneji, Nwabueze Ugwu and Chief Chikwado Chukwunta.\nMbah in a statement signed by the Spokesperson of his Media Office, Dan Nwomeh, obtained by journalists in Abuja said all the aspirants won his heart for their sense of sportsmanship.\nMore than ever before, all the aspirants won my heart for their sense of sportsmanship.\nHe said all of them pledged their loyalty to and continued support for the togetherness of the PDP in Enugu State."
  },
  {
    "headline": "Umahi, security expert differ on insecurity in S’East",
    "summarized_story": "), and a former chairman of the South-East Security Committee, General Obi Umahi (retd.\n“Solving the problem of insecurity in the South-East will call for a multifaceted approach, including political solutions.\nThe South-East Governors’ Forum had on August 31, 2019, appointed Umahi as the chairman of the committee.\nThe committee was asked to draft a framework for the establishment of a South-East joint security outfit to cater to the security needs of the zone.\nThe retired soldier noted, “There are some political elites that leverage the security situation in the South-East for their selfish gains."
  },
  {
    "headline": "Ride bicycle to improve health and prevent global warming – FRSC",
    "summarized_story": "The Zamfara Sector Command of the Federal Road Safety Corps (FRSC) has advised Nigerians to cultivate the habit of riding bicycle to improve their health and help in ameliorating global warming.\nThe world body thereafter declared June 3 of every year as the World Bicycle Day.\nDanladi said that the greener means of transportation was simple, affordable, reliable, clean and environmentally fit and also fostered environmental stewardship and health.\nThe Sector Commander implored the public to imbibe the greener means of transportation for their improved health and greener environment.\nHe said this was better than motorised means of transportation that emit greenhouse gasses that is responsible for global warming."
  },
  {
    "headline": "2023: Group calls on Deltans to give Ogboru a chance",
    "summarized_story": "OgboruA political group, Delta Development initiative, has called on Deltans to give Chief Great Ogboru, candidate of the All Progressives Grand Alliance, APGA in the 2023 general election a chance to rule Delta state now.\nThey said the state has been suffering from underdevelopment since the former Governor, Chief James Onanefe Ibori left office.\nSince the time of Chief James Ibori, no Governor has been able to surpass what he has done for the State.\n“This is the time to give somebody like Chief Great Ogboru a chance to become the governor of this state.\nSo we are pleading with Deltans to give Ogboru a chance to be our Governor."
  },
  {
    "headline": "Deforestation now a serious crime in Anambra — Commissioner",
    "summarized_story": "deforestationMr Felix Odimegwu, Anambra Commissioner for Environment, has reiterated that activities like deforestation, felling of trees without replanting, bush burning and other environmental attack were now a serious offence in the state.\nThe commissioner made the call in Awka at a news conference to enumerate the ministry of environment Programme to handle environmental challenges in the state .\nHe disclosed that the ministry had a well thought out Programme in partnership with other government agencies related to environment on way forward to achieve a safe environment.\nHe said that NEWMAP, with Anambra state erosion watershed and climate change agency, had developed an erosion control and environmental sustainability manual as a simple guide to community based erosion control and climate change.\nObidiegwu said that the government beggi for collective actions of the people towards sustenance of a safe environment, actions that would only protect and restore earth planet should be engaged always."
  },
  {
    "headline": "Mama Olumo’s death ‘ll draw tourists to Olumo Rock – Commissioner",
    "summarized_story": "Dr Toyin Taiwo, the Commissioner for Culture and Tourism in Ogun, says the death of Mrs Sinatu Aduke Sanni, popularly known as “Mama Olumo” will propel more tourists to the site.\nThe commissioner said that tourists, who visited the site had always sought “Mama Olumo” out to get facts and history about the rock and Egbaland as a whole.\nAlso, Mama Olumo’s grandson, Mr Samad Sanni, told journalists that mama was buried on Thursday night according to Orisa Egun traditional rites.\nMama belongs to Orisa Egun, and there is nothing we can do than to bury her in that rite.\n“Anyone who is an Orisa Egun cannot be buried outside, they are buried inside their houses, so mama was buried inside her room."
  },
  {
    "headline": "NDDC no longer serves N’Delta interests — PANDEF, monarchs, stakeholders",
    "summarized_story": "We are praying that the president should constitute NDDC board immediately”.\n“This is where we hold President Buhari to task, unless the white paper is published and we know those who are implicated and who impoverished the region.\n“Let us see the anti-corruption crusade of President Buhari in NDDC, otherwise we will doubt his credibility in the fight against corruption”.\n“Let us go back to the master plan of the NDDC so that perhaps, development can start.\nNational President, South-South Youths Initiative, Saviour Imeabe, said: “We call on President Buhari to appoint a Minister that will work for the people of Niger Delta."
  },
  {
    "headline": "10,000 pastoralists killed, 2 million displaced in seven years – MACBAN",
    "summarized_story": "Over 10,000 pastoralists were killed and over two million displaced across the country within the last seven years, the Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN), has said.\nIt made the disclosure during a security summit the group organized in collaboration with the Northern Consensus Movement (NCM) in Abuja.\nIn a communique issued on Friday, the MACBAN stated that Fulani pastoralists were the worst victims following the current security challenges in the country, ranging from banditry to kidnapping and cattle rustling.\nAccording to the communique, there are over four million out-of-school pastoral children roaming about.\nThe summit called on government, as well as individuals and non-governmental organisations to support and prioritise the education of pastoralists and rural communities."
  },
  {
    "headline": "Arrest of four court staff: NBA slams Imo govt",
    "summarized_story": "The Nigerian Bar Association, Owerri, has lashed out at the Imo State Government over the arrest and detention of Messrs. Chima Emeka Ndukwe, Akoma Jeremiah, Ikedi Amadi and Nze Moses, senior staff of the National Industrial Court, Owerri.\nThe lawyers’ body said it gathered that the detained senior staff were arrested and taken to an undisclosed location at about 14:30hrs yesterday, Friday the 3rd day of June, 2022, while on official duty.\nThe NBA stated this in a release signed by Chinedu Agu, Secretary NBA, made available to journalists in Owerri, capital of Imo State.\nThe release read, “We, therefore, call on the State Government to cause the immediate and unconditional release of the detained staff of the Court and their official vehicle before 12:00hrs today Saturday the 4th day of June, 2022.\n“Rather than challenge same judgment in the Court of Appeal, the Imo State Government, in a desperate hurry, obtained a Court Order from a High Court sitting in Owerri (a court of coordinate jurisdiction) restraining Zenith Bank Plc from obeying the Judgment of the National Industrial Court, Owerri."
  },
  {
    "headline": "University don, Musa sends message to Buhari as President plans to announce preferred candidate",
    "summarized_story": "Dr. Suleiman Musa, a renowned political sociologist based in Zaria, Kaduna State has called on President Muhammadu Buhari to ensure that those who celebrated his health crisis are not allowed to succeed him in 2023.\nThis was contained in a statement he made available to journalists in Kaduna, yesterday.\nAccording to him, “some highly placed politicians in Nigeria did not believe that President Buhari will be alive today.\n“Others were even positioning to be nominated as Vice President in case of any eventuality.\nReport had emerged that President Buhari would on Sunday, meet with all APC presidential aspirants where he is expected to announce his preferred candidate to fly the party’s flag in 2023."
  },
  {
    "headline": "Bauchi Chief Judge releases 14 awaiting trial inmates",
    "summarized_story": "Bauchi State Chief Judge, Justice Rabi Talatu Umar, on Friday, expressed worry that some inmates at the Bauchi Custodial Centre lack proper records of their trial.\nSpeaking on Friday while releasing 14 awaiting trial inmates at the custodial centre, he attributed their release to God’s intervention in their cases.\nJustice Umar was undertaking routine periodic visits to correctional centres across the State to review the cases of awaiting trial inmates, especially those that have stayed long in those centres without trial.\nThe Chief Judge, while commenting on some of the awaiting trial inmates whose litigation records were completely out of sight, remarked, “We don’t know who brought them here”.\nHe counseled the released awaiting trial inmates to find legitimate means of livelihood."
  },
  {
    "headline": "Osun judiciary reinstates sacked Justice Oloyede",
    "summarized_story": "The Osun State government has reinstated Justice Olamide Folahanmi Oloyede, a sacked High Court Judge, to the Osun State Judiciary.\nThis is consequent upon its failure to appeal the judgement against it with regards to the sacked jurist.\nAfter this, Justice Oloyede was unjustly retired by the National Judicial Council (NJC) in 2016.\nBut a Federal High court sitting in Abuja had described her removal as illegal and called on the Osun government to reinstate her.\nJustice Oloyede won her suit against the State government in June, 2021Justice Oloyede on Tuesday, June 1, 2022, resumed at the Ijebu-Jesa division of the Osun State High Court."
  },
  {
    "headline": "Survivors recall horror scenes at Port Harcourt church stampede",
    "summarized_story": "They didn’t open the gate, so we stood there and others were worried that the gate was not opened.\nShe could not also wear the uniform she sewed to mark the Children’s Day programme at the church on May 29.\nShe said: “I specifically came to Port Harcourt from Ahoada for the programme because of the good stories my neighbour’s told me.\nAround 6:30 am, I attended the church programme with my three children.\nPeople were refused entry, and in such a church event, the gate was not supposed to be locked."
  },
  {
    "headline": "From pulpit, Alia Hyacinth makes grab for power",
    "summarized_story": "The suspended priest in the Catholic Diocese of Gboko who left the ecclesiastical temple, Hyacinth Alia, will be flying the flag of the All Progressives Congress (APC) as its gubernatorial candidate in Benue State.\nHe had previously said that his divine mission is to wake the state from coma and alleviate the sufferings of people.\n“After preaching the gospel on the pulpit for 32 years, I decided to extend it to governance” he said.\nAlia will face Titus Uba, the Speaker of the Benue State House of Assembly who also emerged as the flagbearer of the Peoples Democratic Party (PDP) for the state’s governorship election.\nBorn on May 14, 1966, Alia attended St. Francis Primary school, Gboko, from where he proceeded to St. James Minor Seminary, Makurdi and then St. Augustine Major Seminary, Jos."
  },
  {
    "headline": "SOKAPU distributes relief materials to IDPs from Wike’s N200m donation",
    "summarized_story": "Southern Kaduna People’s Union (SOKAPU) on Friday flagged-off distribution of relief materials for Internally Displaced Persons in Southern Kaduna.\nThe relief materials for the flag-off include 180 bags of rice, 100 bags of beans, 80 bags of Garri, 200 packs of pampers, 200 cartons of Indomie.\nFlagging off the distribution of the materials, SOKAPU President, Hon.\nJonathan Asake said the relief materials were bought from the share of money it got from Rivers State governor Nyesom Wike’s N200 million donation to IDPs in Kaduna State.\nAsake said the donation was shared between North and Southern Kaduna to the various IDPs camps across the respective regions of the State."
  },
  {
    "headline": "FG to establish anti-trafficking squads in 110 unity schools",
    "summarized_story": "The Federal Government will be establishing anti-trafficking and violence against persons squads in all the 110 unity schools across the country.\nShe said, “We are currently establishing what we call a Trafficking in Persons and Violence Against Persons Vanguards in secondary schools.\nWe started last year with the establishment of this platform in Federal Government Girls Collage, Abuja and early this year we got approval from the Federal Ministry of Education to establish this same platform in the 110 unity schools.\nWe are starting with the unity schools before we gradually move into Government schools.\nHow many women know that when someone consistently calls you stupid, it says you are worthless or an idiot and it is a crime?"
  },
  {
    "headline": "2023: Full list of PDP Gov candidates",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "APC presidential ticket: Buhari’s consensus option gets govs’ buy-in",
    "summarized_story": "Fresh facts however emerged within the week that 17 of the Progressive governors have agreed to support whoever preferred aspirant President Buhari presents.\nSpeaking during a meeting with members of Progressive Governors Forum in Abuja, President Buhari had told them that he would want to pick his successor, urging the governors to give him their support.\nSpeaking while submitting the report, Oyegun said: “Every single aspirant that presented himself qualified because it was basis and simple.\nWe would hand them over to the party and it is for the party to decide whom their candidate will be.\nAlthough former President Jonathan was technically missing in the list of the aspirants cleared, the protesters under the platform of Goodluck Jonathan Support Group had stormed the party’s national secretariat, drumming and dancing for hours."
  },
  {
    "headline": "Okada Ban: Lagos crushes 5000 motorcycles, records 85% compliance",
    "summarized_story": "By Lukman OlabiyiLagos State government has disclosed that over 5,000 motorcycles, popularly known as Okada, were crushed in the first quarter of 2022.\nSo, anyone saying Okada is the only way to earn a living in Lagos is not doing any good,’’ the commissioner said.\nAlso speaking at the event, Shola Jejeloye, the chairman, Lagos State Environmental and Special Offences Unit (Taskforce) disclosed that there is 85 per cent compliance on Okada ban in the last three days.\nJejeloye said that there was no going back on enforcement of Okada ban, as government does not make mockery of its policies and decisions.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "APC primary: 68 Senators, 187 Reps member back Lawan",
    "summarized_story": "No fewer than 68 serving Senators and 187 members of the House of Representatives have promised to throw their weight behind the presidential ambition of the President of the Senate, Ahmad Lawan, ahead of the Special Convention of the All Progressives Congress (APC).\nThe legislators drawn from across party lines announced that they are ready to work for the success of Lawan as the next president of Nigeria if he emerges President Muhammadu Buhari’s anointed candidate.\nThe APC Presidential primary is expected to hold on Monday 6th and Tuesday 7th of June in Abuja with the screening panel disqualifying ten of the aspirants ahead of the primaries.\nSimilarly, second-term governors have been accorded the privilege of promoting successors that are capable of driving their visions as well as the ideals of the party.”Buhari said he would be seeking reciprocity from the governors ahead of the presidential primary.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "I have respect for Buhari, North –Tinubu",
    "summarized_story": "Presidential aspirant on the platform of the All Progressives Congress, Asiwaju Bola Tinubu has said his recent speech, in Abeokuta, on his presidential ambition did not demonstrate any disrespect to President Muhammadu Buhari.\nA statement signed by the Director, Media and Communications, Tinubu Presidential Campaign Organisation, Bayo Onanuga, Friday said, no time did Tinubu play any ethnic card or denigrate any ethnic group.\n“That is surely out of his character, as Engineer David Babachir Lawal, attested in his viral whatsApp statement.\nTinubu’s speech did not demonstrate any disrespect to Buhari for whom he has a very high regard, and whose re-election campaign he chaired in 2019.\nHe described the interpretation of Tinubu’s address in Abeokuta, the Ogun State capital on Thursday as erroneous, misleading and mischievous."
  },
  {
    "headline": "Saraki to Tinubu: Nigeria bigger than your ambition",
    "summarized_story": "Former Senate President, Dr. Abubakar Bukola Saraki has stated that he acted in the national interest when he opposed the plan to foist a Muslim-Muslim presidency on Nigeria in 2014, adding that Nigeria was bigger than anybody’s ambition, including that of Asiwaju Bola Ahmed Tinubu.\n“When I and other leaders of the All Progressives Congress (APC) in 2014 stood against having a Muslim-Muslim ticket, it was not a decision targeted at any individual or group but one taken in the national interest.\nAsiwaju knows this and he is just being mischievous by presenting this decision as something aimed at stopping his ambition.\n“The opposition to a Muslim- Muslim ticket was not targeted at Tinubu or any other person.\nIt is a decision which served the purpose of the people of Nigeria and I have no regret supporting it,” Saraki stated."
  },
  {
    "headline": "Tinubu: My Ogun Statement Lost in Translation, Respect for President Buhari High, Unfailing",
    "summarized_story": "In a statement he pushed out yesterday, Tinubu said his comments had been misinterpreted by the media and that he did not disrespect President Buhari.\nHe said: “My respect and regard for President Buhari as Commander-in- chief of this nation and as a person are high and unfailing.\nI also believe President Buhari has a continuing and important role to play even after his tenure as president is over.\nIn fact, I believe I was the first aspirant to inform President Buhari of this presidential intention.\nPresident Buhari who will be accompanied by some Ministers and top government officials is expected back in Abuja later today."
  },
  {
    "headline": "Just In: Tambuwal Receives Hero’s Welcome in Sokoto",
    "summarized_story": "Governor Aminu Waziri Tambuwal received a hero’s welcome Friday on his return to Sokoto after last weekend’s Peoples Democratic Party Presidential Primary.\nDue to the large crowd that received him, the governor’s convoy moved at a snail pace from the airport to the city.\nThe enthusiastic crowd sang and danced as they joined the governor’s convoy to the city.\nTambuwal, one of the top PDP presidential aspirants, had stepped down for former Vice President Atiku Abubakar at the convention venue and directed his supporters to vote for the former vice president.\nThe development has been described as the game changer that made Atiku to clinch the party’s presidential ticket."
  },
  {
    "headline": "Breaking: APC Disqualifies 10 Presidential Aspirants",
    "summarized_story": "Adedayo Akinwale in AbujaThe All Progressives Congress (APC) has disqualified 10 presidential aspirants ahead of the party’s primary scheduled to hold from June 6th to 8th.\nThe Chairman of the Presidential Screening Committee and former National Chairman of APC, Chief John Oyegun, disclosed this Friday in Abuja when he submitted the Committee’s report to the party.\nThe names of the aspirants that were disqualified have not been made known yet.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Tinubu: I Made Buhari President, Osinbajo VP, Abiodun Governor",
    "summarized_story": "“The outburst in Abeokuta today is a sign of frustration with the refusal of President Buhari to endorse him publicly.\nTinubu, who visited Ogun State in continuation of his tour to persuade delegates ahead of the APC presidential primary, declared that he facilitated the ascension of Buhari, Osinbajo, and Abiodun to their current positions.\nAccording to him, “If not for me talking to you today, Buhari would not have been president.\n“This is me telling you between my life and God Almighty, Buhari called me to be his vice president.\n“And I told them that I have a candidate that is a Christian that I can nominate so that the party will not break, that was how I nominated Vice President Yemi Osinbajo."
  },
  {
    "headline": "Key Choices Before Buhari",
    "summarized_story": "But Buhari, typically, has managed to keep sealed lips, while keeping everyone guessing and the nation in suspense.\nAs dependable allies, Buhari and Osinbajo, have walked through the thick and thin of addressing many of Nigeria’s challenges.\nBut he is closer as an adopted member of the Buhari family, who has been with him for many years.\nChibuike AmaechiThe former Rivers State governor wormed his way to the heart of the president long before the election of 2015.\nHis tenure pandered too much to virtually everything Buhari wanted, whether or not it sat well with the people."
  },
  {
    "headline": "Seven South-West Presidential Aspirants In Ruling APC Meet Today To Decide Possible Consensus",
    "summarized_story": "The ruling All Progressives Congress presidential aspirants from the South-West are expected to hold a final meeting in Abuja today (Saturday) to decide on the way forward, Punch reports.\nAlso expected at the meeting are governors; Babajide Sanwo-Olu (Lagos), Dapo Abiodun (Ogun), Gboyega Oyetola (Osun) and Rotimi Akeredolu (Ondo).\nThe meeting would hold at the Abuja home of a former governor of Ogun State, Chief Olusegun Osoba, around 8pm.\nImpeccable sources told Punch that the discussion would border on South-West unity and reach a possible consensus.\nOne of the aspirants, who wished to remain anonymous, said, “We will all be meeting at Chief Osoba’s home by 8pm in Abuja."
  },
  {
    "headline": "Seven South-West Presidential Aspirants In Ruling APC Meet Today To Decide Possible Consensus",
    "summarized_story": "The ruling All Progressives Congress presidential aspirants from the South-West are expected to hold a final meeting in Abuja today (Saturday) to decide on the way forward, Punch reports.\nAlso expected at the meeting are governors; Babajide Sanwo-Olu (Lagos), Dapo Abiodun (Ogun), Gboyega Oyetola (Osun) and Rotimi Akeredolu (Ondo).\nThe meeting would hold at the Abuja home of a former governor of Ogun State, Chief Olusegun Osoba, around 8pm.\nImpeccable sources told Punch that the discussion would border on South-West unity and reach a possible consensus.\nOne of the aspirants, who wished to remain anonymous, said, “We will all be meeting at Chief Osoba’s home by 8pm in Abuja."
  },
  {
    "headline": "Those Who Want To Cause Havoc In Our Party, AAC Have Been Put To Shame — Sowore Reacts To Appeal Court Verdict",
    "summarized_story": "Human rights activist, Omoyele Sowore has reacted to the verdict of an Appeal Court in Abuja, affirming him as the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nSee Also Breaking News BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, NzenwaReacting in a statement on Friday, Sowore said those who wanted to destroy the party have been put to shame.\nOn Thursday, the Appeal Court held that the matter was an internal affair and that the High Court had no jurisdiction to meddle in the party's internal affairs.\nThe court nullified the judgment of the lower court and affirmed Sowore as the national chairman of the party, dismissing Nzenwa."
  },
  {
    "headline": "Those Who Want To Cause Havoc In Our Party, AAC Have Been Put To Shame — Sowore Reacts To Appeal Court Verdict",
    "summarized_story": "Human rights activist, Omoyele Sowore has reacted to the verdict of an Appeal Court in Abuja, affirming him as the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nSee Also Breaking News BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, NzenwaReacting in a statement on Friday, Sowore said those who wanted to destroy the party have been put to shame.\nOn Thursday, the Appeal Court held that the matter was an internal affair and that the High Court had no jurisdiction to meddle in the party's internal affairs.\nThe court nullified the judgment of the lower court and affirmed Sowore as the national chairman of the party, dismissing Nzenwa."
  },
  {
    "headline": "Those Who Want To Cause Havoc In Our Party, AAC Have Been Put To Shame — Sowore Reacts To Appeal Court Verdict",
    "summarized_story": "Human rights activist, Omoyele Sowore has reacted to the verdict of an Appeal Court in Abuja, affirming him as the substantive Chairman of the African Action Congress (AAC).\nSowore had in an appeal marked CA/A/812/2019 challenged a High Court judgment delivered by Justice Inyang Ekwo declaring a Nigerian government usurper, Leonard Nzenwa, as the Acting Chairman of the party.\nSee Also Breaking News BREAKING: Jubilation As Appeal Court Affirms Sowore As Substantive AAC Chairman, Sacks Impostor, NzenwaReacting in a statement on Friday, Sowore said those who wanted to destroy the party have been put to shame.\nOn Thursday, the Appeal Court held that the matter was an internal affair and that the High Court had no jurisdiction to meddle in the party's internal affairs.\nThe court nullified the judgment of the lower court and affirmed Sowore as the national chairman of the party, dismissing Nzenwa."
  },
  {
    "headline": "APC insider: Tinubu, Osinbajo, Amaechi make screening shortlist — Bakare, Nnamani out",
    "summarized_story": "Bola Tinubu, former governor of Lagos, Vice-President Yemi Osinbajo and Rotimi Amaechi, minister of transportation, are said to be among the 13 presidential hopefuls shortlisted by the screening panel of the All Progressives Congress (APC).\nOyegun had said the panel came up with a shortlist of 13 contenders out of the 23 presidential hopefuls who presented themselves for screening.\nAdvertisementThe former APC national chairman said the panel gave special consideration to “younger elements,” adding that 10 presidential hopefuls did not make the shortlist.\nA source said, all 23 aspirants screened were cleared and qualified, but the committee recommended a “safe list” of 13 names.\nAmosun Advertisement Thread pic.twitter.com/cEhNXILljq — Imran Muhammad (@Imranmuhdz) June 4, 2022The APC presidential primary has been slated for June 6 to 8."
  },
  {
    "headline": "APC insider: Tinubu, Osinbajo, Amaechi make screening shortlist — Bakare, Nnamani out",
    "summarized_story": "Bola Tinubu, former governor of Lagos, Vice-President Yemi Osinbajo and Rotimi Amaechi, minister of transportation, are said to be among the 13 presidential hopefuls shortlisted by the screening panel of the All Progressives Congress (APC).\nOyegun had said the panel came up with a shortlist of 13 contenders out of the 23 presidential hopefuls who presented themselves for screening.\nAdvertisementThe former APC national chairman said the panel gave special consideration to “younger elements,” adding that 10 presidential hopefuls did not make the shortlist.\nA source said, all 23 aspirants screened were cleared and qualified, but the committee recommended a “safe list” of 13 names.\nAmosun Advertisement Thread pic.twitter.com/cEhNXILljq — Imran Muhammad (@Imranmuhdz) June 4, 2022The APC presidential primary has been slated for June 6 to 8."
  },
  {
    "headline": "Osinbajo, Tinubu... south-west presidential hopefuls 'to meet' ahead of APC primary",
    "summarized_story": "The south-west presidential hopefuls on the platform of the All Progressives Congress (APC) are expected to have a meeting today.\nThe development comes after the APC rounded off the screening of its presidential hopefuls.\nAdvertisementHowever, Oyegun did not mention the names of the shortlisted hopefuls.\nThe presidential hopefuls from the south-west include Bola Tinubu, former governor of Lagos; Vice-President Yemi Osinbajo; Kayode Fayemi, governor of Ekiti, and Ibikunle Amosun, former governor of Ogun.\nJubril Gawat, senior special assistant to Babajide Sanwo-Olu, Lagos governor, also said he “has no information yet on the meeting.”AdvertisementThe APC presidential primaries will hold from June 6 to 8."
  },
  {
    "headline": "Osinbajo, Tinubu... south-west presidential hopefuls 'to meet' ahead of APC primary",
    "summarized_story": "The south-west presidential hopefuls on the platform of the All Progressives Congress (APC) are expected to have a meeting today.\nThe development comes after the APC rounded off the screening of its presidential hopefuls.\nAdvertisementHowever, Oyegun did not mention the names of the shortlisted hopefuls.\nThe presidential hopefuls from the south-west include Bola Tinubu, former governor of Lagos; Vice-President Yemi Osinbajo; Kayode Fayemi, governor of Ekiti, and Ibikunle Amosun, former governor of Ogun.\nJubril Gawat, senior special assistant to Babajide Sanwo-Olu, Lagos governor, also said he “has no information yet on the meeting.”AdvertisementThe APC presidential primaries will hold from June 6 to 8."
  },
  {
    "headline": "Gas explosion: 'Over 200' Kano residents hospitalised for chemical inhalation",
    "summarized_story": "Not less than 200 residents of Sharada Quarters, Kano state, were said to have been hospitalised on Friday after inhaling chemical from a cylinder dismantled by metal scrappers.\nNAN reports that the victims were rushed to the Murtala Muhammad Specialist Hospital, Sharada Industrial Hospital and Ja’en Hospital.\n“The cylinder chemical explosion occurred on Friday at about 4:00 p.m., at Sharada Industrial Area,” he was quoted as saying.\n“Thirty-five victims received treatment at Sharada Industrial Hospital and 96 at Ja’en Hospital,” he said.\nTwenty people were injured in the gas explosion at a liquefied petroleum gas (LPG) refiling shop in the state."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Founder of Babymigo speaks on reducing maternal deaths in Africa",
    "summarized_story": "Kemi OlawoyeThe role of tech in improving maternal healthcareHA: How big of a role do you think tech can play in improving maternal health in Nigeria?\nHA: What singular aspect of maternal healthcare in Nigeria do you think needs the most urgent intervention?\nHA: What are the things you believe will accelerate the growth of the maternal health sector in Nigeria?\nKO: The first thing will be to identify policies and interventions that affect outcomes in terms of maternal and child health.\nIn the next 3 years, we hope to provide healthcare services to 10 million mums across the African continent."
  },
  {
    "headline": "Patricia’s CEO on taking risks and building for impact",
    "summarized_story": "He’d received a gift card worth ₦30,000 (~$73), in 2015, from his uncle in the US, in lieu of a monthly allowance.\nNeeding to exchange the gift card for cash, he went online to transact with a gift card exchange, only to fall victim to a scam.\nGift card scams are commonplace: users are asked to disclose the card’s number, unwittingly granting the scammer access to its funds.\nFor the next 2 years, from 2017 through 2018, Patricia would operate as a gift card exchange.\nIn 2019, Fejiro transitioned Patricia from gift card exchanging to a line that he found to be blossoming in popularity and demand: crypto trading."
  },
  {
    "headline": "Russia-Ukraine war slows economic recovery of Sub-Saharan Africa – IMF",
    "summarized_story": "Ari Aisen, IMF resident representative to Nigeria has said that Subsaharan Africa was in the recovery process from the Covid pandemic when they suffered a second shock from the Russian-Ukraine war.\nOil and agricultural commodities importers in this region are suffering the negative effects of the war, coupled with inflationary pressures”.\n“Restoring fiscal sustainability and reducing deficits should hinge on efforts to mobilize more revenues not to reduce spending which is already very low,” he said.\nHe added that the fuel subsidies are aggressive and that the rich benefit more from fuel subsidies than the poor.\nThe first thing to do is to fix this situation by compensating the most vulnerable that would be affected by the elimination of the fuel subsidies."
  },
  {
    "headline": "Towards the 2023 general election: A grammar intervention",
    "summarized_story": "The events and activities surrounding the forthcoming 2023 election have been evaluated from different analytical perspectives.\nIt should be mentioned that those who compete for the ticket of a party are aspirants, whereas candidates are the representatives of the different parties in an election.\nThe delegate-based primary election in Nigeria will automatically disqualify up-and-coming politicians who are not so rich, especially the young ones.\nWe can say, therefore, that up-and-coming politicians do not stand a chance in the upcoming general election.\nAs used in the foregoing sentence, people ‘contest’ elections; they do not ‘contest for’ elections."
  },
  {
    "headline": "The political fever is back",
    "summarized_story": "And under his breath in almost a loud whisper, he muttered… dem dey find all means to win…even ritual.\nThis thing e go increase oh as we dey near politics dey go, my driver added.\nAnd his partner in political violence discourse answered.\nIt was an election year and I had written about political posters and psychological profiling of candidates and politicians in the race.\nAs the election fever heightens, let us be wary."
  },
  {
    "headline": "Dear Nigerian entrepreneur: The law applies to you too",
    "summarized_story": "They are also filling a gap in the market – easily accessible, unsecured consumer credit.\nThe banks certainly want nothing to do with that market space, and using the efficient market theory, you cannot hold it against them.\nThe market for consumer credit in a fundamentally black market-oriented economy like Nigeria, is unattractive from a bank’s point of view.\nFrom a market point of view, this is efficiency – a more competitive player stepping in to create value that a less competitive player is unwilling or unable to do.\n“These individuals (are) smart enough to break the rules, but not smart enough to understand why the rules exist in the first place.”"
  },
  {
    "headline": "Edo suspends taskforce on environmental issues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has announced the suspension of the Edo State Taskforce on Development Control and Environmental Issues domiciled at the Ministry of Environment and Sustainability.\nIn a statement by Secretary to the State Government, Osarodion Ogie Esq., the government said that it will, in due course, inaugurate a new taskforce for sanitation to enforce matters relating to environmental sanitation.\nAccording to him, “Members of the public are by this announcement advised to desist from engaging with the defunct taskforce on matters of development control and report anyone found parading themselves as members of the taskforce to the relevant security agencies.\n“The Ministry of Physical Planning, Urban and Regional Development is primarily empowered to regulate development control, including approvals of building plans and other such permits.\nThe government will sustain its campaign – Operation Plan Edo (OPE), in pursuit of the realization of the Edo Regional Development Plan and Benin City Master Plan.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo urges citizens’ participation for a cleaner, greener environment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… serves abatement notices to violatorsBENIN CITY – The Edo State Government has called for the support and participation of all residents and other stakeholders to achieve the government’s plan for a cleaner and greener environment in the state.\nThe state government through the Ministry of Environment and Sustainability and the Edo State Waste Management Board intensified ongoing clean-up exercise across the state to rid Edo of dirt and debris, urging residents to get involved and be a part of the project to ensure a cleaner state.\nThe Commissioner for Environment and Sustainability, Engr.\nNoting that the government will sustain compliance and enforcement of all environmental laws, the Commissioner said the state is serving abatement notices to violators of extant laws on environmental sanitation.\nLawani noted that there is the need for residents to clear their surroundings to avoid blocked drains and the menace of erosion."
  },
  {
    "headline": "UNIBEN Mgt, Ekosodin Elders Laud Obaseki on Roads Construction – Nigerian Observer",
    "summarized_story": "While expressing the University’s appreciation to Governor Godwin Obaseki and Chairman of the Commission, Pastor Kennedy Osifo, Professor Salami said the school would always remember the kind gesture of the state government.\nOn his part, the EDSOGPADEC Chairman said that the construction and asphalting of roads cuts across the three Oil Producing areas of the State.\nSome indigenes of Okabere Community were full of appreciation to the Edo State Governor, for the construction of PZ and Okabere roadsThey said that the construction of the road has made life easy for indigenes of Community.\nReceiving newsmen in his Office, the Chairman of EDSOGPADEC said that the construction of PZ – Okabere road was split into four units, Viz, PZ road 2073km; Ehioghae road 1.93km;Eriaria road, 1.95km and Okabere r, 5km.\nHe said the road which has reached 95 percent completion was first awarded in 2018 and re-awarded by the new Board in 2019."
  },
  {
    "headline": "Missing Crown: Prosecution Counsels Express Fear Over Magistrate’s Neutrality – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Prosecution counsels in the case involving Chief Ayirimi Emami and the Commissioner of Police have expressed lack of confidence on the neutrality of the Magistrate trying the matter at the Warri South Magistrate Court.\nThe aggrieved counsels consequently want the case to be tried by another Magistrate in the court alleging bias by the presiding Magistrate Ejiro Diejomaoh (Mrs).\nThis application was vehemently opposed by the defence counsel, Chief Otomewo arguing that there was no provision for the use of Statement on Oath at the Magistrate’s Court.\nIt is also on record that the Magistrate had never recorded Chief Ariyo as a Chief even though Chief Ariyo announces himself as such.\nThe Prosecution counsels, however, said that they had tried to distinguish between an objection arising from the lack of neutrality of a court and other forms of objection."
  },
  {
    "headline": "Nigeria rakes in $57.79m FDI from tech in Q1 2022",
    "summarized_story": "The latest capital importation report released by the National Bureau of Statistics (NBS) shows that Nigeria’s telecommunications sector attracted a total of $57.79 million in foreign direct investments in Q1 2022.\nThe figure represents a 2.6% increase year-on-year when compared to the $56.28 million the sector attracted in Q1 2021.\nAccording to the The NBS data, the funds attracted by the telecoms sector accounted for 3.67% of the total capital importation in the first quarter of this year, which stood at $1.57 billion."
  },
  {
    "headline": "Statutory delegates can participate in party primaries – Court declares",
    "summarized_story": "A federal high court sitting in Kano, has ruled that statutory delegates cannot be excluded in all meetings, congresses and conventions of any registered political party in Nigeria.\nStatutory delegates are party members holding or have held public offices, including presidents and vice presidents, governors and deputies, political parties’ National Working Committee members, state party chairmen and secretary; councillors, local government chairmen and their vices, political party chairmen in all the 774 LGAs, state and federal lawmakers.\nBut Justice A.M Liman who gave the order on Friday following a suit filed by some members of the APC challenging the exclusion of statutory delegates from participating at political party primaries.\nDelivering judgement in the suit marked: FHC/KN/CS/13712022, the court ruled that statutory delegates are qualified to participate in all political party activities.\nThe suit was filed by APC National Assembly aspirants, including Senator Mas’ud El-Jibrin Doguwa, Hon."
  },
  {
    "headline": "Abiodun’s I’m not an emperor’ post not directed at Tinubu – Ogun govt",
    "summarized_story": "Tinubu had while speaking to the delegates said he expected that those he “helped” should support his 2023 presidential ambition.\nOn Friday, Abiodun posted on Twitter saying that he’s not an emperor.\n“I am not an emperor by any chance and this is not my family inheritance,” he wrote.\n“The comments could, therefore, not have been a response to comments by Asiwaju Tinubu whose visits to Abeokuta came five days later.\n“While Governor Abiodun appreciates the media, including online platforms, as partners in progress with Government, he enjoins media practitioners to always report the truth at all times and refrain from giving vent to fake news, distortions and misinterpretations."
  },
  {
    "headline": "2022: Why PDP candidate, Ademola Adeleke may not govern Osun, By Elugbaju David",
    "summarized_story": "‘Dancing’ Senator Ademola Adeleke of Peoples Democratic Party (PDP) has once again picked up his ambition of governing Osun State after his initial attempt failed in 2018.\n*Petitions to disqualify Ademola Adeleke*Aside the initial ‘spoiler game’ played by another of the Adeleke sons, Bamidele to contest the PDP governorship ticket which almost torn the family apart with super star David ‘Davido’ Adeleke taking sides with his uncle, Ademola, there has been intense calls for the party (PDP) not to field Ademola.\nEarlier on January 10, 2022, the group, led by Akinloye Adeyi, had written a petition to the Osun State Gubernatorial Screening Committee.\nHis only selling point might be his dancing skills, relationship with one of the biggest music artiste out of Africa David ‘Davido’ Adeleke and his Adeleke lineage.\nWhile the PDP maybe highly desirous of winning the state, however, fielding questionable candidates is not the way to go."
  },
  {
    "headline": "Peseiro names Super Eagles squad for AFCON qualifiers: Full List",
    "summarized_story": "Super Eagles coach, Jose Peseiro has named a 27-man squad for his first set of competitive games in his role as the head coach of the Nigerian team.\nThe list was unveiled in a statement released by the Nigeria Football Federation (NFF) in the early hours of Saturday.\nPeseiro made several changes to the squad that lost to both Mexico and Ecuador during the just-concluded US tour, revitalising the team for the 2023 Africa Cup of Nations (AFCON) qualification matches against Sierra Leone and Sao Tome and Principe.\nNapoli forward, Victor Osimhen returns to the team after being left out of the tour alongside Ahmed Musa, who pulled out at the last minute.\nThe list also shaved down the number of the Nigeria Professional Football League (NPFL) players included in the side that played the international friendlies."
  },
  {
    "headline": "3 DAYS TO APC PRESIDENTIAL PRIMARY: Screening Panel Recomends ‘Safe List’ Of 13 Aspirants",
    "summarized_story": "The seven-member presidential screening committee of the All Progressives Congress (APC) has shortlisted 13 aspirants to participate in the presidential primary election billed to hold on Monday.\nADVERTISEMENTAccording to one of the sources, all 23 aspirants screened were cleared and qualified, but the committee recommended a “safe list” of 13 names.\nOthers include former minister of State for Education, Emeka Nwajiuba; former minister of Science and Technology, Dr Ogbonnaya Onu; former Ogun State governor, Ibikunle Amosun; Ebonyi State governor David Umahi, and his Jigawa State counterpart, Abubakar Badaru.\nThe ten aspirants excluded from the shortlist are Pastor Tunde Bakare; former Imo State governor Rochas Okorocha; Cross Rivers State governor, Ben Ayade; former Zamfara State governor, Sani Yerima, and former Senate president, Ken Nnamani.\nMeanwhile, chairman of the screening committee, Odigie-Oyegun yesterday the reasons why his committee pruned the number of presidential aspirants from 23 to 13."
  },
  {
    "headline": "Tinubu Expresses Respect For President Buhari",
    "summarized_story": "National leader of the All Progressives Congress, Bola Tinubu has expressed high respect for President Muhammadu Buhari, coming after comments he insists were misinterpreted.\nMy opponents want to present a narrative that I made comments disrespectful of President Muhammadu Buhari in hopes that such a narrative would convince President Buhari to oppose my aspirations regarding the approaching primary.\nMy respect and regard for President Buhari as Commander-in- chief of this nation and as a person are high and unfailing.”Tinubu said, “I shall never denigrate him.\nI also believe President Buhari has a continuing and important role to play even after his tenure as president is over.\nBut President Buhari, of course, stands as the main driver of this success."
  },
  {
    "headline": "INEC Releases Guidelines For 2023 Polls, Says Only Watermarked Ballot’ll Be Counted",
    "summarized_story": "The Independent National Electoral Commission (INEC) has released the legal framework that will guide the 2023 general elections.\nThe guidelines stipulated that only ballot papers with the official watermark and stamp prescribed by the Commission shall be counted by the presiding officer.\nYakubu said with the presentation of the Regulations and Guidelines, the Commission has concluded formal preparations for the polls.\nHe said the Constitution of the Federal Republic of Nigeria 1999 (as amended), the Electoral Act 2022 and the Regulations and Guidelines constitute the electoral legal framework.\nAccording to him, “On several occasions, the Commission has assured Nigerians that we are finalizing the Regulations and Guidelines for the elections."
  },
  {
    "headline": "2023: Mbah Vows To Eradicate Poverty In Enugu",
    "summarized_story": "ADVERTISEMENTHe said, “We hope to move the economy of the state from N4.4 billion that we are today to N30 billion.\nThat seems impossible, that is why I said it is disruptive because we are going to interrogate the status quo.\nWe are going to disrupt the status quo, the sort of growth strategies we had in the past.\n‘’I hope that in a few weeks’ time when we unveil our manifestoes and development blueprints, you will be led into what we want to do.\nThose who could not go to school , we provided them funds for them to continue their education."
  },
  {
    "headline": "‘Sustainable Insurance Key To Future Of Risk Business’",
    "summarized_story": "Insurance stakeholders must begin to transit practice and promote sustainable insurance as this is the future of the risk business in the country, experts said.\nThey added that, having a consolidated insurance industry effort championed by the regulator around sustainability is imminent.\nThe event, which was themed ‘Sustainable Insurance-Issues and Trends’, convened industry stakeholders that included; the regulator, insurers, brokers and loss adjusters where they discussed issues and trends on sustainable insurance.\nSpeaking on the regulator’s technical perspective, the head, IT department, National Insurance Commission(NAICOM), Mr. AbiodunAribike, disclosed that, NAICOM is using Information Technology to drive sustainable insurance in the country.\nHe added that underwriters and brokers need to collaborate more to push the tenets of sustainable insurance."
  },
  {
    "headline": "201 Kano residents unconscious after inhaling toxic chemicals",
    "summarized_story": "By Ramatu GarbaTwo hundred and one residents of Sharada Quarters, Kano, were on Friday hospitalised after inhaling chemicals from a cylinder dismantled by metal scrappers.\nThe victims were rushed to Murtala Muhammad Specialist Hospital, Sharada Industrial Hospital and Ja’en Hospital, for urgent medical attention.\nThe Kano Territorial Coordinator of the National Emergency Management Agency (NEMA), Dr Nuradeen Abdullahi, confirmed the incident to NAN in Kano.\nA witness, Sani Muhammad, said the victims collapsed and became unconscious after inhaling toxic substance from the cylinder dismantled by some metal scrappers.\n“Thirty-five victims received treatment at Sharada Industrial Hospital and 96 at Ja’en Hospital,” he added."
  },
  {
    "headline": "Pique, Shakira announce separation after 12 years of cohabitation",
    "summarized_story": "Colombian singer Shakira and Barcelona defender Gerard Pique have confirmed that they are bringing an end to their 12-year relationship.\n“Thank you for your understanding.”The statement was released today after days of reports about Pique’s recent infidelity.\nThe Colombian singer and the Barcelona defender have two children together and have decided to part ways peacefully.\nBack storyPique and Shakira started dating after meeting at the 2010 World Cup, but they never actually got married.\nThey have been together all this time and the Colombian singer moved to Barcelona to start a family with the footballer."
  },
  {
    "headline": "Junketing President, Buhari To Travel To Ghana, Meet Ruling APC Presidential Aspirants Sunday",
    "summarized_story": "President Muhammadu Buhari is expected to travel to Ghana today (Saturday) after which he will meet with the ruling All Progressives Congress presidential aspirants on Sunday.\nBuhari, who has been junketing around the world lately amid the leadership crisis rocking the party, will believably seek to enforce his consensus candidate on the aspirants.\nNevertheless, the President, who returned from Spain on Friday afternoon, is expected to meet with the aspirants on Saturday night or Sunday.\nAfter that, he is expected to meet with the aspirants and thereafter reveal his preferred candidate for the party’s ticket,” the official said.\nHe had also charged the governors to ensure that the forthcoming convention to pick a presidential candidate reflects all the values and virtues of the party."
  },
  {
    "headline": "Seven South-West Presidential Aspirants In Ruling APC Meet Today To Decide Possible Consensus",
    "summarized_story": "The ruling All Progressives Congress presidential aspirants from the South-West are expected to hold a final meeting in Abuja today (Saturday) to decide on the way forward, Punch reports.\nAlso expected at the meeting are governors; Babajide Sanwo-Olu (Lagos), Dapo Abiodun (Ogun), Gboyega Oyetola (Osun) and Rotimi Akeredolu (Ondo).\nThe meeting would hold at the Abuja home of a former governor of Ogun State, Chief Olusegun Osoba, around 8pm.\nImpeccable sources told Punch that the discussion would border on South-West unity and reach a possible consensus.\nOne of the aspirants, who wished to remain anonymous, said, “We will all be meeting at Chief Osoba’s home by 8pm in Abuja."
  },
  {
    "headline": "Tinubu retracts explosive comments, says he didn’t mean to humiliate Buhari, other politicians",
    "summarized_story": "The attention of the Asiwaju Bola Ahmed Tinubu Presidential Campaign Organisation has been drawn to the erroneous, misleading and mischievous interpretation of his address in Abeokuta, capital of Ogun State on Thursday.\nThe campaign was surprised at the way the opposition and Tinubu’s traducers had turned his statement to give an interpretation Tinubu did not mean and did not say.\nAt no time did Tinubu play any ethnic card or denigrate any ethnic group.\nThe Tinubu campaign is not surprised why the opposition in the APC have decided to turn and twist the statement.\nThe former Lagos governor, a great party man remains the man to beat at the party’s convention on Monday."
  },
  {
    "headline": "BREAKING: APC Screening Panel Disqualifies 10 Presidential Aspirants, Clears 13",
    "summarized_story": "10 presidential aspirants of the All Progressives Congress (APC) have been disqualified by its screening panel.\nThe screening panel headed by Chief John Oyegun, meanwhile, cleared 13 aspirants to participate in its presidential primary scheduled to hold from Monday, June 6.\nThe Oyegun-led committee is currently submitting its reports to the national chairman Senator Abdullahi Adamu.\nChairman APC Presidential Screening Committee, John Odigie Oyegun, said only thirteen aspirants out of the twenty-three that appeared before the Committee were cleared.\nDetails later…"
  },
  {
    "headline": "Again, Buhari jets out of Nigeria",
    "summarized_story": "President Muhammadu Buhari will on Saturday, June 4 in Accra, Ghana attend an Extraordinary Summit of the ECOWAS Authority of Heads of State and Government on the political situation in Mali and other parts of the sub-region.\nThe Heads of State will also review the situation in the Republics of Burkina Faso and Guinea.\nThe President will be accompanied by the Minister of Foreign Affairs, Geoffrey Onyeama, National Security Adviser, Maj-Gen Babagana Monguno (rtd) and Director-General, National Intelligence Agency (NIA), Amb.\nHe will return to Abuja same day at the end of the Summit.\nShare this: TwitterFacebook"
  },
  {
    "headline": "NPower batch C employment: Another batch of physical verification date revealed *See details",
    "summarized_story": "The Federal Government through the Federal Ministry of Humanitarian affairs has directed the National Social Investment Management System (NASIMS) to begin the physical verification of Npower batch C stream 2 beneficiaries.\nBatch C stream 2 physical verification which according to the information contained in the letter dated 31st May, 2022 addressed to the FCT and State coordinators stated that the Npower batch C stream 2 physical verification exercise will commence Monday, 13th to Friday, 24th June, 2022.\n“It would please you to note that Mr. President has evaluated our partnership with the Ministry and expressed satisfaction with the conduct of our Local Government Inspectors under the supervision of the State Coordinators, ICT Officers and Zonal Inspectors.\nAnd having passed the integrity test, the Ministry has again, set necessary machineries in motion for physical.\n“In the light of the foregoing, and in view of the high premium placed on this exercise, State Coordinators are hereby requested to direct the ICT Units to get the systems ready as used in the last exercise.”Share this: TwitterFacebook"
  },
  {
    "headline": "VIDEO: Week after PDP presidential primaries, Tambuwal returns to heroic welcome in Sokoto",
    "summarized_story": "Governor Aminu Waziri Tambuwal was welcomed to a heroic reception Friday on his return to Sokoto after last weekend’s People’s Democratic Party (PDP) Presidential Primary.\nA mammoth crowd besieged the Sultan Abubakar Airport to receive the govenor and his entourage.\nDue to the large crowd that received him, the governor’s convoy moved at a snail pace from the airport to the city.\nThe enthusiastic crowd sang and danced as they joined the governor’s convoy to the city.\nTambuwal, one of the top PDP presidential aspirants, had stepped down for former Vice President Atiku Abubakar at the convention venue and directed his supporters to vote for the later."
  },
  {
    "headline": "Africa must not be left behind in moving from fossil fuel to renewable energy sources — President Buhari",
    "summarized_story": "Minister of mine and steel Arc Olamilekan Adegbite on Wednesday said Africa needs to join the rest of the world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nAfrican Natural Resources and Mines Limited, ANRML, is a group company of the African Industries Group.\nThe mining sector is the backbone of industrialization of the economy."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria via high yield rice.",
    "summarized_story": "He said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tones per hectares.\nThis outstanding result has ensures that more and more people are showing interest in GAWAL R1.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company, that not only sell seed but teach farmers advance planting technique for optimum yield.\nAs one of the large-scale seed companies in Nigeria, it has supplied over 20,000 mt rice and maize seeds to Nigeria farmers in over 30 states."
  },
  {
    "headline": "Nigeria Committed to Energy Transition, Reducing Gas Emission – Silva",
    "summarized_story": "According to him, “the only viable option currently on the table is natural gas, considering vast proven gas endowments, put at 209 TCF, with 600 TCF potential reserves.\nWe cannot ignore this resource, especially when energy poverty is viciously starring at us.”“The goal of Nigeria’s gas policy is to ensure that gas development is undertaken in accordance with our socio-economic development priorities.\nAccording to him, “the implication of the above is that the issues surrounding energy poverty, climate and sustainable development are not mutually exclusive.\nBut of equal concern is the alarming level of energy poverty.\nEnergy transition is about providing clean energy, and not about discriminating between energy sources."
  },
  {
    "headline": "TRCN Registrar elected president of AFTRA",
    "summarized_story": "By Ngozi NwankwoRegistrar/CE Teachers Registration Council of Nigeria, Prof Josiah Ajiboye has been elected the President of the Africa Federation of Teaching Regulatory Authorities, AFTRA.\nAjiboye was elected the AFTRA president at the end of its 9th Annual Conference and 11th Roundtable held in Accra, Ghana, today June 1.\nNigerian Pilot Newspapers learnt that the Africa Federation of Teaching Regulatory Authorities is a continental body comprising all teaching regulatory authorities in all the 54 Africa countries.\nOther elected officers were Deputy President- Zambia, Secretary General- Ghana, Treasurer – Namibia and Assistant Secretary General- South Africa.\nHe also promised to assist countries who are yet to have teacher regulatory bodies to establish one, so that together Africa teachers will enjoy professional status and benefits."
  },
  {
    "headline": "Why we reversed $3.1bn e-customs project – FG",
    "summarized_story": "By Mathew Dadiya, AbujaFederal Government has explained the reasons why the $3.1 billion contract for ‘complete automation’ of the Nigerian Custom Service, approved by the Federal Executive Council (FEC), in 2020 was reversed.\nIt clarified that disagreements between partners that formed a consortium for the project, delayed its takeoff despite efforts by the government through the office of the Attorney General of the Federation to mediate.\nAsked to explain the rationale behind a new e-Customs concession agreement between the NCS, Africa Finance Corporation (AFC) and China’s Huawei Technologies Limited, Ahmed said: “The E-customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements between the concession partners.\nAnd at the end of the day, I think one of the partners in the concession did not agree with the arrangements”, she stated."
  },
  {
    "headline": "More Intrigues Ahead Of APC Primary: Aspirants Disqualified, Consensus Option Not Ruled Out",
    "summarized_story": "More drama unfolded on Friday as the All Progressives Congress (APC) ramps up preparations for a special convention for its presidential primary.\nWith about three days to the exercise, the atmosphere seems tense for some party faithful over the chances of their preferred aspirants to emerge as the APC presidential candidate.\nHe also hinted that 99 percent of the presidential aspirants agreed to support a consensus candidate.\nNot InterestedA total of 28 aspirants picked the APC presidential nomination and expression of interest forms sold at N100 million.\nThereafter, 23 aspirants appeared before the APC Presidential Screening Committee which cleared 13 for the exercise, with 10 others dropped."
  },
  {
    "headline": "99 Percent Of APC Presidential Aspirants Agreed To Consensus – Oyegun",
    "summarized_story": "Chairman of the All Progressives Congress’ presidential screening committee, John Oyegun, on Friday said 99 percent of its presidential aspirants agreed to support a consensus candidate.\nAccording to Mr Oyegun, only 13 out of the 23 aspirants screened were cleared by the committee.\nHowever when asked about the identity of the disqualified aspirants, Mr Oyegun declined to disclose the names.\nMr Oyegun added that contrary to rumours making the rounds, it didn’t screen former president Goodluck Jonathan.\nCleared aspirants are expected to contest the presidential primary at a scheduled special convention in Abuja between June 6 and 8."
  },
  {
    "headline": "I Did Not Disrespect Buhari In Abeokuta, I Have High Regard For Him – Tinubu",
    "summarized_story": "A presidential aspirant on the platform of the All Progressives Congress, Bola Ahmed Tinubu, has said he holds President Muhammadu Buhari in high regard.\nReactions had trailed Mr Tinubu’s comments in Abeokuta on Thursday where he said he deserves to lead the nation after helping President Buhari win the 2015 election.\nMy opponents want to present a narrative that I made comments disrespectful of President Muhammadu Buhari in hopes that such a narrative would convince President Buhari to oppose my aspirations regarding the approaching primary.\nMy respect and regard for President Buhari as Commander-in-Chief of this nation and as a person are high and unfailing.\nI also believe President Buhari has a continuing and important role to play even after his tenure as president is over."
  },
  {
    "headline": "INEC Launches Regulations, Guidelines For General Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has launched the regulations and guidelines for the conduct of general elections in the country.\n“With the coming into force of the Electoral Act 2022, it has become necessary to review the commission’s regulations and guidelines to govern the conduct of elections,” he said.\n“The Constitution of the Federal Republic of Nigeria 1999 (as amended), the Electoral Act 2022 and the regulations and guidelines constitute the electoral legal framework.\n“On several occasions, the commission has assured Nigerians that we are finalising the regulations and guidelines for the elections.\nBeside the general elections, the INEC chief also spoke about their preparations for the governorship elections in Ekiti and Osun States, as well as the Continuous Voter Registration (CVR)."
  },
  {
    "headline": "2023 Elections: Christopher Imumolen Wins Accord Party’s Presidential Ticket",
    "summarized_story": "Professor Christopher Imumolen has emerged as the presidential candidate of the Accord Party for the general election in 2023.\nMore to follow…"
  },
  {
    "headline": "- TVC News",
    "summarized_story": "Barely 48 hours to the APC Presidential Primaries, youths under the auspices of All Progressives Congress- National Forum say the only chance of the APC to emerge victorious come 2023 presidential elections is to elect a credible and competent aspirant from the North West geo- political zone who will be a presidential flag bearer for the party.The group through their Chairman Mustapha Mala Karamma while briefing Journalists in Maiduguri disclosed that their platform of over 6.8 million members are ever ready to submit to a competent leader who will succeed President Muhammadu Buhari come 2023.\nThey raised concern over the emergence of former Vice President Atiku Abubakar as the presidential candidate of the opposition Peoples Democratic Party, which the only way to challenge him is for APC to desist from zoning formula and unanimously nominate a North West presidential aspirant as Candidate"
  },
  {
    "headline": "I have high regard and respect for President Buhari, says Tinubu -",
    "summarized_story": "My opponents want to present a narrative that I made comments disrespectful of President Muhammadu Buhari in hopes that such a narrative would convince President Buhari to oppose my aspirations regarding the approaching primary.\nPresident Buhari is an experienced and accomplished leader.\nMy respect and regard for President Buhari as Commander-in- chief of this nation and as a person are high and unfailing.\nI also believe President Buhari has a continuing and important role to play even after his tenure as president is over.\nBut President Buhari, of course, stands as the main driver of this success."
  },
  {
    "headline": "Buhari will adopt nobody, but Tinubu",
    "summarized_story": "Those were the words of the Director General of the Tinubu Campaign Organisation, Kashim Shettima, while speaking on TVC’s current affairs programme, Journalist Hangout.\nThe former governor of Borno state described the reception and acceptability of Asiwaju Bola Ahmed Tinubu as overwhelming.\nBut in 2015, President Buhari got 30,8290 in Ogun, 383,603 in Osun, 120,133 in Ekiti.\nIf there’s anyone with the array of contestants, Asiwaju is the leader among his mentees, If at all President Buhari will endorse anyone, it will Bola Ahmed Tinubu.\nSpeaking on the fitness and wellness of Asiwaju Tinubu, the campaign director general said: ” Asiwaju is mentally elicit and alert."
  },
  {
    "headline": "Just In: APC Presidential screening committee clears 13 aspirants to contest -",
    "summarized_story": "The All Progressives Congress has trimmed down its list of presidential aspirants to thirteen ahead of its Monday special convention scheduled to hold between 6th and 8th June.\nOut of 23 presidential aspirants that appeared before the screening committee, 13 were cleared to contest the primaries slated for Monday.\nDetails soon."
  },
  {
    "headline": "Nigeria: See the Frontrunners as APC Clears 13 Presidential Aspirants",
    "summarized_story": "The seven-man All Progressives Congress (APC) Presidential Screening Committee headed by the former national chairman of the party, Chief John Oyegun on Friday announced that it had cleared 13 of the 23 aspirants screened, while recommending10 for disqualification ahead of the party’s Presidential primary election scheduled for next week.\nOf the 13 aspirants cleared, five of them are regarded as the frontrunners, with Vice President Yemi Osibanjo leading.\nOyegun revealed the recommendation to disqualify 10 presidential aspirants when he led other members of the committee to submit their screening report to the Abdulahi Adamu-led National Working Committee (NWC) of the party.\nThe point I want to make is the quality of the people that want to govern this country.\nVarious court decisions have affirmed this position, it is the party that is being represented and not individuals."
  },
  {
    "headline": "Nigeria: Buhari Didn’t Tell Governors to Pick Consensus Presidential Candidate",
    "summarized_story": "Presidential spokesperson, Femi Adesina, on Friday faulted claims that President Muhammadu Buhari asked members of the PGF to pick a consensus presidential candidate for the APC.\nAccording to him, Buhari told them what he would like to see at the APC presidential primary to elect a presidential candidate early next week.\n“He said no word about zoning, consensus, or imposition of candidate.\nAnd the wailing starts.”Buhari had while addressing the governors on Tuesday ahead of the party’s presidential primary taking place on Monday, said he would be seeking reciprocity from the governors ahead of the presidential primary.\nHe asked the governors to ensure that all interests ‘converge’ as regards the outcome of the presidential primary."
  },
  {
    "headline": "Tinubu: My Comments in Ogun Lost in Translation, My Respect for President Buhari High, Unfailing",
    "summarized_story": "In a statement he pushed out Friday, Tinubu said his comments had been misinterpreted by the media and that he did not disrespect President Buhari.\nHe said: “My respect and regard for President Buhari as Commander-in- chief of this nation and as a person are high and unfailing.\nI also believe President Buhari has a continuing and important role to play even after his tenure as president is over.\nBut President Buhari, of course, stands as the main driver of this success.\nPresident Buhari who will be accompanied by some Ministers and top government officials is expected back in Abuja later today."
  },
  {
    "headline": "Super Eagles Manager Peseiro Invites Musa, Ekong, 25 others for Sierra Leone, São Tomé",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria: Group Sues Tinubu, APC, INEC, Says Former Lagos Governor Ineligible to Run for President",
    "summarized_story": "A group representing Gaskiya Youth Movement has filed a suit against the All Progressive Congress, (APC), APC Presidential Aspirant, Bola Ahmed Tinubu and The Independent National Electoral Commission, (INEC) at the Federal High Court, Abuja.\nThe group seeks a ruling that will disqualify Bola Ahmed Tinubu from the presidential race over his “questionable” age and education."
  }
]