[
  {
    "headline": "Controversy surrounds alleged killing of Super TV CEO",
    "summarized_story": "Controversy is hovering over what led to the death of the Chief Executive Officer of entertainment channel, Super TV, Mr Usifo Ataga.\n“The police are working diligently to solve this case and I am confident the perpetrators will be brought to justice.\nThe source said, “Investigation is ongoing in Lagos and Abuja, we have the facility manager of the service apartment in our custody and we are interrogating him.\nThe service apartment does not have enough security measures in place that would have prevented such a thing.\nHe added that the suspect in custody was a tenant who had been using the flat for service apartment, adding that she had been assisting the police investigation."
  },
  {
    "headline": "Runway lights collapse at Lagos airport, international flights diverted, rescheduled",
    "summarized_story": "Some parts of the runway lights at the nation’s flagship airport, the Murtala Muhammed International Airport, Lagos has collapsed, forcing British Airways to divert its flight to the Abuja airport on Thursday.\nThe development forced the Nigerian Civil Aviation Authority, the aviation industry regulator, to downgrade the landing procedure at the Lagos airport from Category Two to Category One.\nThe unserviceable state of the runway lights made it impossible for BA, which flies a large plane, to land at the Lagos airport in the night.\nIt was learnt that touchdown light at the runway of the international wing of the Lagos airport became bad.\nBA was forced to reschedule all its flight out of London to enable it to land at Lagos airport in the afternoon, instead of late evening."
  },
  {
    "headline": "President Buhari calls for concerted efforts to end insecurity",
    "summarized_story": "President Muhammadu Buhari on Saturday called for concerted efforts to end insecurity currently bedevilling the country.\nIn the message, the president said Nigeria required fervent prayers and the involvement of all to overcome the security challenges.\nResponding, Justice Dongban-Mensem thanked God for the privilege to serve as the President of the Court of Appeal, while acknowledging the support of Gov.\nFrom 1990 to1993, Justice Dongban-Mensem served as Deputy Chief Registrar, Supreme Court and was later appointed as Judge, High Court of Justice, Plateau Judiciary from 1993-1996.\nJustice Dongban-Mensem is the second female to head the Court of Appeal, the first being Justice Zainab Bulkachuwa."
  },
  {
    "headline": "Gov Emmanuel, key to unlocking A’Ibom, Nigeria’s locked economic potentials — Nigerian Govs",
    "summarized_story": "Nigerian Governors under the auspices of the PDP Governor’s Forum, have extolled the virtues and achievements of Governor Udom Emmanuel of Akwa Ibom State, noting that he has brought prudence, innovation and competence in the management of state resources.\nSpecial Guest of Honour at the event, and Governor of Sokoto State, Rt.\nTambuwal who is the Chairman of PDP Governors’ forum, announced that all PDP States Governors are in Akwa Ibom State to deliberate over the state of affairs of the nation .\nOn his part, Governor Ahmadu Umaru Fintiri of Adamawa State lauded the new thinking of Governor Udom Emmanuel of Akwa Ibom State whom he described as a pacesetter doing wonders.\nRt Hon Ahmadu Umaru Fintiri noted that the economic realities of the day demands new thinking, saying that is what PDP Governors are doing."
  },
  {
    "headline": "Sickle Cell Day: Author calls for awareness, adequate information",
    "summarized_story": "Malam Shehu Mohammed, author of the book on sickle cell anaemia titled “I am a survivor,” has called on Nigerians to create more awareness and sensitisation exercise to the sickle cell disease.\nAccording to him, he will be embarking on enrolling 100 indigent sickle cell survivors on the National Health Insurance Scheme.\nHe said it would allow the sickle cell survivors to have free access to healthcare.\nDuring a lecture, Mrs Josephine Olunaike, Founder, Beulah Sickle Cell Foundation, said that the disease was not a death sentence.\nOlunaike said that Nigeria had one of the highest prevalence of sickle cell disease in the world."
  },
  {
    "headline": "Indian PM writes President Buhari on health benefits of Yoga",
    "summarized_story": "The Prime Minister of India, Narendra Modi, has written to President Muhammadu Buhari, on health benefits of Yoga, particularly in boosting immunity and helping recovery from COVID-19.\n”While the threat of the pandemic remains, there have been positive developments since the last International Day of Yoga.\n“The theme for this year’s International Day of Yoga is “Yoga for Wellness’’, which is particularly relevant in the current context.\nRegular practice of Yoga can also help them recover.”According to the prime minister, Yoga has an inherent power to connect, saying Yoga is good for community, immunity and unity.\n“Please accept my best wishes to you, your family and your citizens, for good health and well-being,’’ he added."
  },
  {
    "headline": "Truck crushes motorcyclist, passenger to death in Ogun",
    "summarized_story": "James Ogunnaike, ABEOKUTATwo persons were on Friday night crushed to death by a truck on Ilaro- Ibese road in Yewa North local government area of Ogun State.\nThe Spokesman of the Traffic Compliance and Enforcement Corps (TRACE), Mr. Babatunde Akinbiyi confirmed the incident to the newsmen in Abeokuta on Saturday.\nAkinbiyi, while quoting eyewitnesses, said the truck driver drove recklessly, left his lane and faced the motorcycle, thereby crushing both the rider and his passenger to death.\nHe said “an angry mob later set the truck on fire while the driver ran away.\nHe commiserated with the family of the dead victims, while admonishing truck drivers to resist the temptation of reckless and dangerous driving and give consideration to other road users."
  },
  {
    "headline": "Biafra: Igbos will lose more if Nigeria breaks up",
    "summarized_story": "Rochas Okorocha, the Senator representing Imo West, has cautioned the Southeast against their agitations for Nigeria’s breakup.\nOkorocha warned that Igbos would be the worst hit if Nigeria breaks up.\nThe former Imo State Governor spoke in Abuja while addressing some women groups yesterday.\nOkorocha stressed that the Southeast should push towards fixing the country and not its disintegration.\nSoutheast groups like the Indigenous People of Biafra, IPOB, and the Movement for the Actualization of Sovereignty State of Biafra, MASSOB, have been agitating for the disintegration of Nigeria."
  },
  {
    "headline": "Kebbi abduction: I will storm forest with rescue team, I was elected to take such risk",
    "summarized_story": "Recall that armed men suspected to be bandits had abducted students and teachers of the Federal Government College in Birnin-Yauri, on Thursday in the state.\nOne of the students abducted from the school was shot dead during a gun duel between soldiers and the abductors.\nHowever, the Nigerian Army had confirmed that five of the abducted students and two teachers have been rescued.\nBagudu assured that some other governors and stakeholders will join him in the ongoing search operations for the abducted students and staff of the school.\nAccording to him, he will discuss with his colleagues and security agencies in this direction, so as not to jeorpardise the ongoing commendable operations to rescue the abducted students and staff."
  },
  {
    "headline": "Police warns protesters against blocking Kaduna highway over insecurity",
    "summarized_story": "The Police Command in Kaduna State has warned residents to desist from blocking the highways in the State in the name of protest.\nDAILY POST had reported that angry residents of Kakau Ward in Chikun Local Government Area of Kaduna State on Saturday morning blocked the ever-busy Kaduna-Abuja Highway.\nHe described the recent blockade of highways by protesters as “very worrisome”, stressing that the current security challenges were being addressed by government and security agencies.\nMuri advised those staging the protests to stop, as that will only create additional problems rather than tackle the security challenges adequately.\n“The Command, however, is perturbed with the recent activities of some communities engaging in protests and the untoward blocking of highways with its attendant troubles for innocent commuters."
  },
  {
    "headline": "National Assembly staff grapple with tough times amid luxurious lifestyle of lawmakers",
    "summarized_story": "For years, the earnings of members of the National Assembly has been an issue of controversy, with reports of them being one of the highest in the world.\nIn this report, DAILY POST looks at the work environment for staff of the National Assembly.\nFor civil servants working in the National Assembly, the reality has been very grim.\nThe buses which are in terrible conditions, take people from the Eagle Square junction to the second gate of the National Assembly.\nThey even increased the price from N30 to N50,” a worker at the National Assembly told DAILY POST."
  },
  {
    "headline": "Nigerian govt should pay salary to religious leaders to tackle insecurity",
    "summarized_story": "The committee of FCT imams initiative (CFII) has said religious leaders can help fight insecurity in the country.\nTajuddeen Adigun, chairman of CFII said Imams and other religious leaders should be included in the fight against insecurity in Nigeria.\nHe spoke at the 17th extraordinary dawrah (conference) of the FCT Imams on Saturday in Abuja, NAN reports.\nIf government decides to pay salaries to religious leaders so as to maintain peace, it is not too much.\n“When I say religious leaders, I mean generally including the non-Muslim religious leaders, because all religions have influence over their followers."
  },
  {
    "headline": "Truth, dialogue and reconciliation as panacea to Nigeria’s many problems",
    "summarized_story": "I also believe that we can still see president Buhari experience a Pauline conversion.\nI could not, in my life, have imagined what we came to see of President Buhari as elected president of the most populous Black nation on earth.\nAs a commentator on one of my recent articles recently put it, President Buhari did much more to disappoint Nigerians.\nADVERTISEMENTCommented Joshua Oyewande on my article: “President Buhari As I Have Never Seen Him …” of 13 June, 2021: “Buhari has disappointed himself.\nIf President Buhari chooses Nigeria, by disavowing of that annoying claim, in addition to the earlier steps suggested, the stage would have been set for true dialogue between, and reconciliation, of all ethnic groups in Nigeria."
  },
  {
    "headline": "Igboland isn’t a dot, it’s not landlocked",
    "summarized_story": "One of such is the terrible lie, institutionally purveyed since the end of the civil war, to the effect that Igboland is landlocked or has no access to the sea.\nJust recently, President Muhammadu Buhari not only implied the same but he went further to derisively describe Igboland as a “dot in a circle”, using IPOB as a metaphor.\nIf you discount the territories unfairly excised from Igboland during State creations and the damnable boundary adjustments, it will be far less.\nOnne seaport was dredged up to 60 miles to the Atlantic and Calabar seaport was dredged some 45 nautical miles to the Atlantic.\nIbaka seaport is about 30 nautical miles to the Atlantic and the Lagos seaports dredged up to about 50 nautical miles to the Atlantic."
  },
  {
    "headline": "N288b COVID-19 Relief Fund: How govt, MDAs scammed us, by SME owners",
    "summarized_story": "SMEs shortchanged during disbursement as politicians hijack palliativesMore than 100 million Nigerians sink into poverty – NBS/World BankFolashade Adejobi owns a Small and Medium-sized Enterprise (SME) running a catering service in Lagos state.\n“In the case of unemployment by state, Imo state recorded the highest rate of unemployment with 56.64%.\nLagos state recorded the lowest underemployment rate, with 4.5% in Q4, 2020.\n“At the Maryland school complex in Lagos State, the tracking team confirmed that officials followed the due process to a considerable extent as beneficiaries used the QR coded vouchers to access their take-home rations.\nWard chairman is in charge of the distribution of the food in the Agege area in Lagos State."
  },
  {
    "headline": "T.B. Joshua: There was a man I knew",
    "summarized_story": "There was a man I knew who footed the bills of many cancer patients and those that suffered from other terminal illnesses.\nThere was a man I knew who was gifted in the prophetic, who worked many miracles in the name the Lord and who always gave God the glory.\nThere was a man I knew whose Church attracted 6 out of every 10 foreigners that come to Nigeria.\nThere was a man I knew who prayed into power and counselled many world leaders and Presidents than any other.\nThere was a man I knew who suffered more persecution and tragedy than any other man of God in Nigeria without ever complaining."
  },
  {
    "headline": "My pointed nose, boobs, my selling point –Titi Adeoye, actress",
    "summarized_story": "By Damilola FatunmiseFor Titi Adeoye, acting is her second nature.\nShe can play any role spontaneously having been acting in school and church before going professional.\nIn this interview, she narrated her journey into the movie industry, her heartbreak experience and greatest fear.\nWhat’s your greatest fear in life?\nMy greatest fear is failure."
  },
  {
    "headline": "Dot-in-circle: Amechi lambasts Buhari",
    "summarized_story": "I have said it personally that I believe in a bigger country, Nigeria that I fought for.\nBut if Nigeria breaks, Buhari is responsible for the breaking of the country.\nBuhari is the only president who wants to equate Fulani economy and empire with his attempt to Fulanize Nigeria and to Islamize Nigeria.\nThe point we got it wrong is at the point of Muhammadu Buhari as the president of Nigeria.\nIt started with President Buhari because of his other ambition of colonizing Nigeria, that Nigeria is a property bequeathed to them by Uthman Dan Fodio."
  },
  {
    "headline": "There’ll never be peace if Biafra, Oduduwa republics are created –",
    "summarized_story": "I know many people will say Fulani are the bandits, kidnappers, this is how they have been frustrated.\nIf you continue to talk about Fulani this way, they will not have peace and if they don’t have peace, you cannot have peace yourself.\nWhen you keep on blackmailing them as foreigners they will come to Nigeria to help Fulani in Nigeria to fight.\nHow did the urban Hausa caused the fight?\nWhen such republics are created there will never be peace in Nigeria because we will continue to fight with our former brothers."
  },
  {
    "headline": "Minor hiccups as over 1.4m candidates begin 2021 UTME",
    "summarized_story": "By Gabriel DikeThe 2021 Unified Tertiary Matriculation Examination (UTME) kicked off yesterday with minor hiccups in few Computer-Based Test (CBT) centres.\nThe Joint Admissions and Matriculation Board (JAMB) said that over 1.4million candidates are writing the 2021 UTME in over 800 CBT centres nationwide.\nThe candidates arrived at their various exam centres as early as 7:00a.m, but after biometrics, the UTME started at 9:30a.m, 30 minutes behind schedule.\nThe second session candidates started at 1:05p.m while few candidates reported late.\nAt Bafuto CBT centres, Ikotun, at 9:40a.m, the first session candidates finished and came out from the exam hall."
  },
  {
    "headline": "S’East leaders warn Northern leaders: Protect our people in your states",
    "summarized_story": "From Jude Chinedu, EnuguSoutheast governors and other leaders in the zone have called on their Northern counterparts to protect the Igbo living in the North.\nThe call was made during an emergency security meeting of Southeast leaders in Enugu yesterday.\nThose present at the meeting included the host Governor of Enugu State, Rt.\nAlso in attendance were the Speaker of Enugu State House of Assembly, Rt.\nDr. Emmanuel O. Chukwuma, Chairman, Enugu State Traditional Rulers’ Council, HRH Igwe Amb."
  },
  {
    "headline": "Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "The troops, THISDAY gathered, were able to rescue the students and their teachers after closing in on the bandits and killings scores of them, before the rest abandoned their hideouts, leaving the victims behind.\nBandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officersduring an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters."
  },
  {
    "headline": "Bawa: EFCC Won’t Hand over Cases of Interest to any State",
    "summarized_story": "•Says commission as a creation of N’Assembly supersedes states’ establishmentsKingsley Nwezeh in AbujaChairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nThe EFCC chairman also denied asking the management teams of banks to declare theirs assets to the commission.\n“There are a lot of Supreme Court decided cases on this particular issue.\n“We are yet to see how the EFCC is going to hand over cases that they are interested in to any state government or see any correspondence to that effect."
  },
  {
    "headline": "South-east Governors, Leaders Set up Committees to Engage Agitating Youths",
    "summarized_story": "This followed a meeting in Enugu State.\nAccording to a communiqué read by the chairman of South-east Governors Forum and Governor of Ebonyi State, Dave Umahi, the South-east leaders said in order not to manage the situation in the zone, they “have set up a committee to engage such youths to stop and allow elders speak to address such fears”.\nThe governor regretted that although leaders in the South-east had reassured people from other regions of their safety, Ndigbo were still being threatened, especially, in the north.\nThose present at the meeting included the host, Governor of Enugu State, Hon.\nIn attendance also were Speaker of Enugu State House of Assembly, Rt."
  },
  {
    "headline": "Falana: APC Has Perfected Plans to Rule Nigeria Indefinitely",
    "summarized_story": "•Laments Buhari’s failure to amend 2010 Electoral Act•Says demand for self-determination, a constitutional rightGboyega AkinsanmiUnlike the Peoples Democratic Party (PDP) that boasted to rule Nigeria for 60 years, Nigeria’s foremost human rights lawyer, Mr. Femi Falana (SAN) yesterday disclosed that the All Progressives Congress (APC) had perfected plans to rule the country indefinitely.\nFalana, who spoke on diverse issues of national concerns during the interview, said: “Unlike the PDP, which boasted that it would rule Nigeria for 60 years, the APC has perfected plans to rule Nigeria indefinitely.\nHe, however, said: “The APC government deploys armed military and police personnel in the manipulations of elections including local government elections.\nHe explained that Nigeria had ratified and domesticated the African Charter on Human and Peoples Rights, which guaranteed rights to self-determination.\n“The earlier the war mongering tactics of the government is reviewed the better for the corporate existence of Nigeria."
  },
  {
    "headline": "Student Dies in Crossfire as Troops Free Five Kebbi School Abductees",
    "summarized_story": "Governor Abubakar Atiku Bagudu of Kebbi State visited the affected school yesterday, where he met with the parents, and promised that all abducted students would be freed.\nBagudu Promises Freedom for Abducted StudentsMeanwhile, Governor Bagudu yesterday met with parents of abducted Yauri students at the school premises, assuring them that they would be rescued soon.\nYauri Lawmaker LamentsThe lawmaker representing the Igaski/Shanga/Yauri in Kebbi State at the House of Representatives, Yusuf Sununu, has lamented attacks by bandits in Kebbi State.\nSununu warned that the growing insecurity in Kebbi State was a major threat to food security in the country.\nThis tends to deter the progress so far achieved by the Kebbi State Government in terms of agriculture and in terms of promoting access to education.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXCLUSIVE: Three Secondary School Students Killed As Bandits, Vigilantes Exchange Gunfire In Kebbi",
    "summarized_story": "Three students of Federal Government College, Birnin-Yauri in Kebbi state have been killed during a gun duel between bandits and vigilantes.\nSaharaReporters had reported how bandits on motorcycles from Rijau forest stormed the school on Thursday after overpowering the mobile police unit guarding the school, killing one officer.\n“Three of the students were killed during a gun duel between vigilante group and the gunmen in Makuku village.\nMeanwhile, some students, who were forcibly taken by armed bandits at the school have managed to escape on Friday.\nOur Abductors Were Not Nigerians, Escaped Kebbi School Student Says | Sahara ReportersDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of an officer."
  },
  {
    "headline": "EXCLUSIVE: Three Secondary School Students Killed As Bandits, Vigilantes Exchange Gunfire In Kebbi",
    "summarized_story": "Three students of Federal Government College, Birnin-Yauri in Kebbi state have been killed during a gun duel between bandits and vigilantes.\nSaharaReporters had reported how bandits on motorcycles from Rijau forest stormed the school on Thursday after overpowering the mobile police unit guarding the school, killing one officer.\n“Three of the students were killed during a gun duel between vigilante group and the gunmen in Makuku village.\nMeanwhile, some students, who were forcibly taken by armed bandits at the school have managed to escape on Friday.\nOur Abductors Were Not Nigerians, Escaped Kebbi School Student Says | Sahara ReportersDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of an officer."
  },
  {
    "headline": "The World Needs To Act Now Before COVID-19 Overwhelms Africa, By Mosoka P. Fallah And Zacharia Kafuko",
    "summarized_story": "Compare this to India where 255.3 million people have received one dose and the US where more than 311 million doses have been administered.\nThe COVAX platform-created to make vaccines available to the most vulnerable populations has been hamstrung by vaccine nationalism and vaccine diplomacy.\nMost countries in Africa have received less than 2% of the vaccines expected through the COVAX platform.\nAll countries should immediately underwrite initiatives aimed at increasing access to vaccines by supporting ethical standards that call on improved global vaccine access.\nThe COVID-19 situation in India recently has been an unmitigated disaster- the potential for a similar crisis in Africa is clear."
  },
  {
    "headline": "Buhari to ECOWAS leaders: Take realistic decisions that will positively impact citizens",
    "summarized_story": "President Muhammadu Buhari has asked leaders of countries in West Africa to take practical and realistic decisions that will reflect positively on citizens.\nAccording to Garba Shehu, presidential spokesman, Buhari also spoke on the political situation in Mali.\nAdvertisementSpeaking at the summit, Buhari said the situation in Mali could take a turn for the worse if not properly handled.\nIn doing so, we must take realistic and practical decisions which will positively impact our citizens,” he said.\n“Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted."
  },
  {
    "headline": "Buhari to ECOWAS leaders: Take realistic decisions that will positively impact citizens",
    "summarized_story": "President Muhammadu Buhari has asked leaders of countries in West Africa to take practical and realistic decisions that will reflect positively on citizens.\nAccording to Garba Shehu, presidential spokesman, Buhari also spoke on the political situation in Mali.\nAdvertisementSpeaking at the summit, Buhari said the situation in Mali could take a turn for the worse if not properly handled.\nIn doing so, we must take realistic and practical decisions which will positively impact our citizens,” he said.\n“Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted."
  },
  {
    "headline": "'We'll meet on the field' -- Bagudu promises to join hunters to track bandits",
    "summarized_story": "Atiku Bagudu, governor of Kebbi, has promised to join local hunters to track bandits in the state.\nAdvertisementHe stated this on Saturday, when the local hunters in the state paid him a visit, following the recent attack on a school in Kebbi.\nAdvertisementSpeaking while addressing the hunters, Bagudu who was in the company of Kayode Fayemi, governor of Ekiti, said as soon as he gets security clearance from troops, he’ll join the hunters on the field.\n“We are here in solidarity with our brother, the governor of Kebbi state, and all the good people of Kebbi state on the unfortunate incident at FGC Birnin Yauri,” he said.\nWe know as leaders of local hunters, you will go fight them in the bush and defeat them."
  },
  {
    "headline": "'We'll meet on the field' -- Bagudu promises to join hunters to track bandits",
    "summarized_story": "Atiku Bagudu, governor of Kebbi, has promised to join local hunters to track bandits in the state.\nAdvertisementHe stated this on Saturday, when the local hunters in the state paid him a visit, following the recent attack on a school in Kebbi.\nAdvertisementSpeaking while addressing the hunters, Bagudu who was in the company of Kayode Fayemi, governor of Ekiti, said as soon as he gets security clearance from troops, he’ll join the hunters on the field.\n“We are here in solidarity with our brother, the governor of Kebbi state, and all the good people of Kebbi state on the unfortunate incident at FGC Birnin Yauri,” he said.\nWe know as leaders of local hunters, you will go fight them in the bush and defeat them."
  },
  {
    "headline": "‘Two COVID tests in 72 hours’ — new protocol for Nigeria as UAE lifts flight ban",
    "summarized_story": "The Dubai Supreme Committee of Crisis and Disaster Management has released a new protocol directing travellers from Nigeria to undergo COVID-19 tests upon arrival at the airport in the United Arab Emirates.\nAdvertisementFlights between both countries have been suspended since March over issues relating to COVID-19 protocol.\nPassengers are also expected to have taken a COVID test 48 hours before departure, and have negative results to show for it.\nThe ban was lifted after the airline agreed to stop the rapid antigen tests.\nAdvertisementThereafter, in March, the UAE embassy in Abuja announced a new COVID-19 travel protocol for Nigeria as part of measures to curtail the spread of the virus in the country."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "When two years seem like eternity",
    "summarized_story": "Some have described the next two years as an “eternity”, saying that to endure the “suffocating air” for the next two years would be the worst punishment for Nigerians.\nDuring the 2015 general election campaign, the then ruling party and the main opposition party promised Nigerians a lot of goodies.\nYet, they don’t see any difference in the current situation within the remaining two years of this administration.\nIt will definitely get worse in the remaining two years of Buhari,” Angwe Yakubu, a retired senior security personnel, said.\nThis APC- led government is a failure.”According to Daramola, “The President is clueless on providing security for Nigerians not to talk of foreigners."
  },
  {
    "headline": "Is Nigerian Senate playing politics with PIB, Electoral Act and Constitutional Amendment?",
    "summarized_story": "So, the emergence of Senator Ahmad Lawan from Yobe North Senatorial District and Ovie Omo-Agege from Delta Central Senatorial District as president and deputy Senate president, respectively, was largely seen as mission accomplished.\nSimilarly, the $30 billion loan request of the president to the 8th Senate was also rejected to save the country from sinking deeper into indebtedness.\nBesides, on May 18, 2021, Buhari had sought the approval of the Senate to borrow a fresh N2.343 trillion ($6.18bn) external loan.\nNonetheless, the Electoral Act Amendment bill is one bill Nigerians are calling the 9th Senate to also expedite action on in view of the 2023 general election.\nLawan has again promised Nigerians that the Electoral Act Amendment bill and the Constitutional Amendment bill will the passed by mid July 2021 before going on recess."
  },
  {
    "headline": "Egbin power seeks $2bn in equity and debt to double output",
    "summarized_story": "Egbin power seeks $2bn in equity and debt to double outputNigeria’s Egbin Power Plc, the biggest in Africa’s most populous nation, is to raise $1.8 billion to more than double generation capacity as it seeks to boost output and export electricity to West African countries, reports Bloomberg.\nIt is looking at a combination of debt and equity to meet the funding requirements ahead of the…"
  },
  {
    "headline": "Obaseki begins e-registration of Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said his administration has commenced digital registration of all workers across the 18 local government areas of the state.\nObaseki stated this while addressing members of Edo State Civil Service Commission, led by the chairman, Mrs. Ekiuwa Inneh, on a courtesy visit, at the Government House, Benin City.\nAccording to him, “We have sent Information Technology Communications (ITC) experts to scan all your documents into a digital format.\nWe have started the process of digitally registering every staff member in public and civil service in Edo.\n“I want to assure you that we will key into your transformation agenda for the civil service; you have recognized the fact that the civil service has to be empowered,” she added."
  },
  {
    "headline": "Fathers’ Day: Obaseki hails sacrifice, resilience of fathers amid COVID-19 crisis – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI celebrate fathers for their immense role in holding the family unit together despite the disruptions caused by the coronavirus pandemic and the attendant dislocations in economies across the world.\nDespite the challenges, fathers remained strong pillars of support in the family.\nWhile it must be acknowledged that the economies of the world have been heavily impacted by the coronavirus pandemic, fathers walked a tight rope to keep families whole, even in the face of adversities.\nFathers were resilient and made immense sacrifice to keep the family united, even with the effects of the lockdown.\nGodwin N. ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Obaseki celebrates Dame Uzamere at 60, extols her exemplary life – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Saturday, led other top government functionaries to the 60th birthday celebration of Dame Iriagbonse Joy Uzamere, at St. Matthew’s Cathedral in Benin City.\nDame Iriagbonse Joy Uzamere is the mother of the immediate past Chief of Staff to the Governor, Mr. Osaze Ethan Uzamere.\nAccording to him, “She’s a pillar, not only in her family but also in the church and in the community.\nImasuen said Dame Iriagbonse Joy Uzamere is a gift to mankind and her family.\nOther dignitaries at the event are wife of Edo Governor, Mrs. Besty Obaseki; immediate past chief judge, Edo State, Esther Edigin; Sen. Matthew Urhoghide; Edo State head of service, Anthony Okungbowa and former chairman, Edo All Progressives Congress (APC), Anselm Ojezua, among others."
  },
  {
    "headline": "CNL Advocate Stakeholders Collaborations In Curbing Oil Theft And Vandalism – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Chevron Nigeria Limited (CNL) has sought for more cooperation from stakeholders in Niger Delta to reduce oil theft and vandalism.\nThe Bayelsa State Commissioner for Mineral resources, Dr Ebieri Jones, commended CNL for supporting the GMoU, the communities for their peaceful disposition and the KRDF for their achievements.\n“I see KRDF as a change agent and wish to see an integration of KRDF projects and government projects,” he affirmed.\nHe commended CNL for its commitment to the development of the KEFFES communities and emphasized the need for peace in the communities to support CNL operations and provide enabling environment for development.\nLeghemo, the Amanaowei of Koluama 1 and the Chairman, Board of Trustees of the KRDF charged community stakeholders and the government to keep on supporting the Foundation."
  },
  {
    "headline": "#EndSARS: Pathologist tenders autopsy reports of 99 persons killed during protests",
    "summarized_story": "ADVERTISEMENTThe Chief Pathologist of the Lagos State University Teaching Hospital (LASUTH), John Obafunwa, on Saturday submitted the autopsy documents of 99 deaths resulting from the #EndSARS protests in Lagos to the Lagos Judicial Panel of Inquiry.\nIt will help if such is discovered because it will be circumstantial evidence to make you say that this body belongs to this person.\nSoldiers’ shootingOn October 20 last year, soldiers opened fire at unarmed protesters at the Lekki Toll Gate killing yet-to-be-determined number of people.\nAlthough the army initially denied its soldiers shot at unarmed protesters, the multitude of evidence presented by witnesses, including videos showed that soldiers shot at protesters.\nGovernor Babajide Sanwo-Olu, who initially said no one died from the shooting, later said only two persons died."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Revenue Drive Suffers Setback Over Obsolete Taxation Laws",
    "summarized_story": "The practitioners believe that with this, the nation’s tax law would be compliant with current realities, more effective and generate the much needed revenue for the country.\nThe highest tax-to-GDP ratio in Nigeria was 9.6 per cent in 2011, with the lowest being 5.3 per cent in 2016.\nBetween 2015 and 2018, the country had recorded N16.395 trillion revenue as against N20.408 trillion that was projected during the period.\nOn tax administration, Oyedele of PwC noted that the administration of taxation in Nigeria hasn’t impacted revenue growth in the economy.\nThere are many tax laws we inherited from the British laws before our independence, and we haven’t done much to improve them since then."
  },
  {
    "headline": "Revenue Drive Suffers Setback Over Obsolete Taxation Laws",
    "summarized_story": "The practitioners believe that with this, the nation’s tax law would be compliant with current realities, more effective and generate the much needed revenue for the country.\nThe highest tax-to-GDP ratio in Nigeria was 9.6 per cent in 2011, with the lowest being 5.3 per cent in 2016.\nBetween 2015 and 2018, the country had recorded N16.395 trillion revenue as against N20.408 trillion that was projected during the period.\nOn tax administration, Oyedele of PwC noted that the administration of taxation in Nigeria hasn’t impacted revenue growth in the economy.\nThere are many tax laws we inherited from the British laws before our independence, and we haven’t done much to improve them since then."
  },
  {
    "headline": "Again, Bandits Kill 29, Sack 5 Villages, Rustle 1000 Cows, Camels In Zamfara",
    "summarized_story": "No fewer than 29 persons have been killed in an attack on Gana and Rampas communities in Zamfara State by bandits.\nAdvertisementsThe bandits were said to have rustled about 700 cows and over 200 camels in the affected communities, just as residents of five villages have deserted the communities.\nThe report said the bandits sacked about five villages in Anka and Bukuyum communities of Zamfara State.\nAnother local who sought anonymity told the BBC that the bandits came on bikes numbering about 300, each carrying three bandits wielding dangerous weapons.\nKaduna State Police Command yesterday deployed their men to restore law and order in the area and prevent the protest from degenerating into violence."
  },
  {
    "headline": "Again, Bandits Kill 29, Sack 5 Villages, Rustle 1000 Cows, Camels In Zamfara",
    "summarized_story": "No fewer than 29 persons have been killed in an attack on Gana and Rampas communities in Zamfara State by bandits.\nAdvertisementsThe bandits were said to have rustled about 700 cows and over 200 camels in the affected communities, just as residents of five villages have deserted the communities.\nThe report said the bandits sacked about five villages in Anka and Bukuyum communities of Zamfara State.\nAnother local who sought anonymity told the BBC that the bandits came on bikes numbering about 300, each carrying three bandits wielding dangerous weapons.\nKaduna State Police Command yesterday deployed their men to restore law and order in the area and prevent the protest from degenerating into violence."
  },
  {
    "headline": "Child Labour: The Cankerworm Depriving Nigeria Of Her Future",
    "summarized_story": "In respect of Nigeria, it had been observed that over 15 million children aged 5 – 14 years are engaged in child labour.\nAccordingly, a work amounts to child labour if it is exploitative and/or injurious to any aspect of the developing personality of the child.\nThis year’s World Day Against Child Labour focuses on action taken for the 2021 International Year for the Elimination of Child Labour.\nSpeaking on the travail of victims of Child Labour, Barrister Doris Edum blamed Poverty as undoubtedly the predominant cause of child labour around the world.\nThis is a time for renewed commitment and energy, to turn the corner and break the cycle of poverty and child labour."
  },
  {
    "headline": "United Arab emirates lifts ban on travels between Dubai & Nigeria",
    "summarized_story": "The United Arab Emirates, UAE, has finally lifted the ban on travels between Dubai and Nigeria.\nDubai had placed a ban on travelers from Nigeria, South Africa based on breach of COVID-19 protocols.\nREAD ALSO: BBNaija Reunion: Wathoni Apologises for body shaming DorathyReacting to the resumption of normal flights between Nigeria and Dubai, Emirates in a statement confirmed resumption of flights from Nigeria to Dubai from 23rd June.\nPart of the statement read, “Emirates welcomes the latest protocols and measures announced by Dubai’s Supreme Committee of Crisis and Disaster Management to allow the safe resumption of passenger travel from South Africa, Nigeria and India to Dubai.\n“In accordance with these protocols, we resume flights 23rd June.”"
  },
  {
    "headline": "Igbo man marries beautiful Fulani woman in colorful wedding Photos",
    "summarized_story": "A photo of a Fulani bride with her Igbo groom in a wedding ceremony has surfaced on social media.\nThe cultural blend at Fauiza and Jonathan’s traditional wedding was a beautiful sight to behold, which got a lot of people on social media gushing.\nNo doubt, the #Jozy2019 traditional wedding was a pure delight.\nREAD ALSO: BBNaija Reunion: Wathoni Apologises for body shaming DorathyFaiza’s Fulani Michika culture was well represented and we also saw the groom’s culture highlighted during the palm wine carrying.\nAfter you have viewed and loved this feature, check out their white wedding feature and also catch up with their love story and pre-wedding shoot here."
  },
  {
    "headline": "Jonathan, Adesina Join Buhari in Ghana For ECOWAS summit",
    "summarized_story": "President Muhammadu Buhari on Saturday attended the 59th ordinary session of the Economic Community of West African States (ECOWAS) Authority of heads of state and government.\nNaija News reports that former President Goodluck Jonathan and Akinwumi Adesina, president of the African Development Bank (AfDB) also attended the summit.\nAlso present in Accra alongside Buhari are Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), and Geoffrey Onyeama, minister of foreign affairs.\nThe 59th Ordinary Session of the ECOWAS Heads of State and Government was preceded by the 46th Ordinary Session of the ECOWAS Mediation and Security Council (MSC) at the Ministerial Level and the 86th Ordinary Session of the ECOWAS Council of Ministers, in Accra, Ghana.\nThe President is expected back in Abuja at the end of the Summit."
  },
  {
    "headline": "Biafra: Southeast Govs Disown IPOB, Set To Engage Members",
    "summarized_story": "Governors in the Southeast part of Nigeria has publicly condemned activities of the Indigenous People of Biafra, IPOB.\nThe political leaders had met on Saturday in Enugu State to lay out plans on curbing the current security crisis rocking the region, condemned all secession agitation in the country.\n“The impression that South-East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South-East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\n“In order not to mismanage the unfortunate situation, South-East leaders have set up a committee to engage such youths to stop and allow elders speak to address such fears,” he said."
  },
  {
    "headline": "Party suspends Aregbesola’s ex-commissioner, as Osun APC crisis worsens",
    "summarized_story": "The leadership of the All Progressives Congress in Elerin C, Ward 9, Irepodun South Local Council Development Authority, Erin Osun, Osun State has suspended the former commissioner for Local Government and Chieftaincy Affairs, Kolapo Alimi.\nAlimi, a lawyer, who served as commissioner during the tenure of the immediate past Osun governor, Rauf Aregbesola, was suspended from APC over alleged anti-party activities.\nThe letter conveying Alimi’s suspension, dated 16th June and addressed to the state APC Caretaker Committee Chairman, was obtained by Saturday PUNCH on Friday.\nIt read in part, “We the undersigned Elerin “C” Ward 09 Ward Executives members of Irepodun South LCDA, Erin-Osun under the chairmanship of Alh.\nKolapo Moruf Alimi and we concluded that he is due for suspension, as the elders and stakeholders of the party have been duly carried along and he is hereby suspended from the party (APC)."
  },
  {
    "headline": "Party suspends Aregbesola’s ex-commissioner, as Osun APC crisis worsens",
    "summarized_story": "The leadership of the All Progressives Congress in Elerin C, Ward 9, Irepodun South Local Council Development Authority, Erin Osun, Osun State has suspended the former commissioner for Local Government and Chieftaincy Affairs, Kolapo Alimi.\nAlimi, a lawyer, who served as commissioner during the tenure of the immediate past Osun governor, Rauf Aregbesola, was suspended from APC over alleged anti-party activities.\nThe letter conveying Alimi’s suspension, dated 16th June and addressed to the state APC Caretaker Committee Chairman, was obtained by Saturday PUNCH on Friday.\nIt read in part, “We the undersigned Elerin “C” Ward 09 Ward Executives members of Irepodun South LCDA, Erin-Osun under the chairmanship of Alh.\nKolapo Moruf Alimi and we concluded that he is due for suspension, as the elders and stakeholders of the party have been duly carried along and he is hereby suspended from the party (APC)."
  },
  {
    "headline": "FG: No going back on grazing routes recovery",
    "summarized_story": "In spite of the overwhelming outcry against the plan to retrace and recover grazing routes across the country, the Federal Government is not showing signs of relenting.\nSaturday PUNCH findings revealed that stock routes, popularly called grazing routes, are currently being retraced and recovered by the Federal Government for herders to graze their cattle.\nShe said, “There are some stock routes that we have across the country, and in the past, we had monuments along these stock routes, particularly the primary stock routes.\nThe official, who requested not to be named for lack of authorisation, explained that the stock routes were in three classes.\nWe have primary and secondary stock routes and in some cases, we have tertiary stock routes.”Providing further explanation on the three classes of routes, the official said, “The primary stock routes are the major routes that run in a North-to-South direction from the Sahel to the coastal market."
  },
  {
    "headline": "FG: No going back on grazing routes recovery",
    "summarized_story": "In spite of the overwhelming outcry against the plan to retrace and recover grazing routes across the country, the Federal Government is not showing signs of relenting.\nSaturday PUNCH findings revealed that stock routes, popularly called grazing routes, are currently being retraced and recovered by the Federal Government for herders to graze their cattle.\nShe said, “There are some stock routes that we have across the country, and in the past, we had monuments along these stock routes, particularly the primary stock routes.\nThe official, who requested not to be named for lack of authorisation, explained that the stock routes were in three classes.\nWe have primary and secondary stock routes and in some cases, we have tertiary stock routes.”Providing further explanation on the three classes of routes, the official said, “The primary stock routes are the major routes that run in a North-to-South direction from the Sahel to the coastal market."
  },
  {
    "headline": "COVID-19 kills over 500,000 in Brazil",
    "summarized_story": "By Abankula with agency reportsBrazil’s death toll from COVID-19 surpassed 500,000 on Saturday, with experts warning the fatalities may worsen.\nUp till Saturday, Brazil registered 500,800 deaths from 17,883,750 confirmed COVID-19 cases.\nOver the past week, Brazil has averaged 2,000 deaths per day.\nThis week, new confirmed cases in Brazil accelerated to more than 70,000 per day on average.\nOn Saturday, 81,574 cases were logged, with the death toll of 2,247, all world daily records."
  },
  {
    "headline": "Intending couples to do drug test before marriage",
    "summarized_story": "Nigeria’s anti-drug Czar Brig.-Gen. Buba Marwa is pushing his drug war to a new level as he said anyone intending to get married would have to do drug test.\nBut he said President Muhammadu Buhari is resolute in his new thrust to purge the country of illicit drugs.\n“That is why we have put in place various programmes with far reaching effects, one of which is drug integrity test.\n“In the nearest future, anyone seeking employment into any government industry or ministry, parastatal or agency; or seeking admission into tertiary institution; or even getting married must first have to do drug test,” he said.\nExplaining further, Marwa said intending couples have always had to do one test or the other to ensure that they have a successful marriage."
  },
  {
    "headline": "Bagudu vows to lead hunters, vigilantes in battle against bandits",
    "summarized_story": "By Ibrahim BelloKebbi State Governor, Atiku Bagudu, has vowed to lead hunters and vigilantes in the battlefield against bandits ravaging the state.\nHe also joined his counterpart in Ekiti, Dr. Kayode Fayemi to charged the hunters and vigilantes to be ready to defend the territories of states against frequent attacks by bandits.\nThe groups had converged on the state capital to declare their readiness to wage war against bandits.\n“In all what these bandits are doing to us, they have challenged our faiths, our property and our honours and we can’t allow them to go.\nAbubakar Badaru, who also accompanied Fayemi, charged the local hunters to use all power within their possession to rescue and defeat bandits terrorising the state."
  },
  {
    "headline": "We Are Against Nnamdi Kanu’s Agitation For Biafra – S’east Governors, Ohaneze",
    "summarized_story": "They South East Leaders noted threats by some groups against people of South East and firmly promise to protect everyoneeither from other regions or ours and pleaded with the leaders of other regions to protect their people living in their regions.\nThe statement reads,“We condemn the killing of security agencies, burning of strategic infrastructure and killing of civilians in South East and other regions.\n“We condemn in totality, the activities of violent secessionist groups in South East and elsewhere, we firmly proclaim thatwe do not support them, they do not speak for South East.\nThe impression that South East leaders are silent over some of our youths agitators for secession is not correct.\nSouth East Governors, Ohaneze President, National Assembly members, notable leader had come out publicly many times in the past to speak against such agitations."
  },
  {
    "headline": "Boko Haram: Nigerians Proud Of Your Sacrifices – Army Chief, Yahaya tells Injured Soldiers",
    "summarized_story": "Maj. Gen. Farouk Yahaya, the Chief of Army Staff, has told injured troops in the ongoing counter-insurgency operations against Boko Haram that Nigerians are proud of their efforts in restoring peace to the North-East region.\nYahaya also prayed for their quick recovery in a statement released on Saturday.\nThe wounded troops were also guaranteed of good welfare and medical care, according to the COAS.after assuming office“The COAS gave the assurances on Friday when he visited the 7 Division Hospital and University of Maiduguri Teaching Hospital to commiserate with the sick and wounded in action troops recuperating at the medical facilities.\n“He averred that the nation [Nigeria] is indeed proud of their selfless service and sacrifices towards restoring peace to the North-East region.\n“The COAS also appreciated the commitment and selflessness of the troops in the Theatre and implored them to exhibit a high level of professionalism and ensure that all remnants of Boko Haram and ISWAP terrorists are neutralized,” the statement read in part."
  },
  {
    "headline": "Pastor Kumuyi To Return Tithes, Offerings Of ‘Sinful’ Deeper Life Members",
    "summarized_story": "Pastor Williams Kumuyi, the founder of the Deeper Christian Life Bible Ministry, has stated that he will return certain worshippers’ tithes and offerings.\nKumuyi claims that he will return the money to those who are still living in sin.\nKumuyi emphasized the necessity of living a virtuous life, saying that God does not require “sinner’s money.”He claimed that paying tithes and offerings at church is futile for a sinner.\n“God does not require your money if you are a sinner here.\nKumuyi stated, “God does not require it, and the church does not require it.”"
  },
  {
    "headline": "In Ogun, Dangote Truck Crushes Two To Death",
    "summarized_story": "On Friday evening, two people were killed by a truck on the Dangote-Ibeshe route in the Yewa North Local Government Area of Ogun.\nThe incident was reported to NAN in Abeokuta on Saturday by Babatunde Akinbiyi, the spokesman for the Traffic Compliance and Enforcement Corps (TRACE).\nAccording to witnesses, the truck driver drove dangerously, leaving his lane and colliding with the motorcycle, killing both the rider and his passenger.\n“An enraged mob eventually set fire to the Dangote truck, while the driver fled,” he stated.\nHe expresses his condolences to the victims’ families while urging truck drivers to reject the temptation of reckless and risky driving and to consider other road users."
  },
  {
    "headline": "Breaking: Germany beat Portugal, return to Euro winning ways",
    "summarized_story": "From a goal down, Germany race to 4-1 while Portugal reduce the deficit 23 minutes to the end.\nThe tie eventually ended 2-4 in favour of Germany.\nPortugal go down from the summit to No 3, a point behind both new leaders France and Germany.\nPortugal will next face France in their last group game on Wednesday, at the same time that Germany will engage Hungary.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "Amina Mohammed reappointed UN Deputy Secretary-General",
    "summarized_story": "Nigeria’s Amina Mohammed has been re-appointed as Deputy Secretary-General of the United Nations.\nAntónio Guterres on Friday asked Mohammed to serve as Deputy Secretary-General for a second term, shortly after the UN General Assembly re-appointed him for a second term.\nGuterres’ second term starts on January 1, 2022, and will run for a period of five years.\n“After being elected, I have the pleasure to invite the deputy secretary-general to remain in my second mandate and I hope she will accept,” he said.\nMohammed is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "Breaking: Anxiety as residents block Abuja-Kaduna highway, protest bandits’ attack, stranded travellers groan",
    "summarized_story": "Many travellers are currently stranded on the Abuja-Kaduna Highway as angry residents have blocked the road over attacks, especially the killing of a 13-year-old girl by bandits.\nThe tragic incident occurred at Anguwar Magaji in Chikun Local Government Area of the state, according to Daily Trust.\nA resident of the area told Daily Trust that they were not safe at home and their farms.\n﻿He explained that the residents only want security or to be allowed to protect themselves against the bandits.\nA witness told Daily Trust that the protesters refused to listen to the plea of security personnel who approached them."
  },
  {
    "headline": "NAF working steadily in right direction -NigPilot",
    "summarized_story": "When the Chief of the Air Staff, Air Marshal Isiaka Oladayo Amao hinted of a new and renewed synergy in the Nigerian military setup, most of us doubted its workability.\nA keen observer will note that in the past the different arms of the military seem to be working to restore peace without collaboration.\nJust last week, the Nigerian Army troops in conjunction with elements of the Nigerian Air Force rescued some of the abducted teachers and students of Federal Government College, Birnin Yauri.\nThis is not to mention numerous positive results being recorded across the country, with NAF playing a key role.\nBefore him, the Kano State Governor, Abdullahi Ganduje came calling too and lauded NAF for it’s role in fighting crime in the state."
  },
  {
    "headline": "JAMB begins 2021 UTME nationwide -NigPilot",
    "summarized_story": "Nigerian Pilot gathered that about 1, 338, 687 candidates registered for the 2021 UTME which started today, 19th June, 2021,across the nation, while about 75,328 candidates successfully registered for Direct Entry.\nA visit to some of the JAMB approved Computer Based-Test, CBT , centres around Federal Capital Territory, FCT, revealed that there were more suiting arrangements in this 2021 UTME than what it used to be previously.\nSpeaking to our correspondent, a parent, Mr. Ogbonna Ugochukwu who came along with his son at Digital Bridge Institute said, ” This year’s JAMB exam is more organised than before.\nThere was no case of malpractice or system failure.To me, this is a great feet that JAMB has achieved so far.\nOn the parts of the candidates, especially those who had sat for UTME in the previous years, said there was no stress locating their centres , capturing their biometrics, and operating computer during the 2021 UTME."
  },
  {
    "headline": "Troops rescue abducted students, teachers in Kebbi State -NigPilot",
    "summarized_story": "The fierce gun duel between troops of Operations Hadarin Daji and armed bandits that abducted school students and teachers in Kebbi State has led to their rescue from the bandits, the Nigerian Army has said.\nThe Service, however, regretted that one of the female students lost her life in the process.\n“The troops also recovered 800 cattle rustled by the bandits.\nThe gallant troops are still on the heels of the kidnappers in order to rescue the remaining abductees still in captivity.\n“The rescued teachers and students will be handed over to the Kebbi State Government.The Nigerian Army appreciates the cooperation so far from good spirited citizens and wish to solicit for more”."
  },
  {
    "headline": "Banditry does not represent any ideology, doctrine, religion – Gov Masari -NigPilot",
    "summarized_story": "The Governor of Katsina State, Rt.\nAminu Bello Masari, has said that banditry in Katsina State and environs was peculiar as it does not represent any ideology, doctrine, religion, or political party.\nGovernor Masari gave this commendation when he paid a courtesy call on the CAS at NAF Headquarters, Abuja.\nDirector of Public Relations and Information Nigerian Air Force, Air Commodore Edward Gabkwet in a statement noted that Governor Masari said that banditry in Katsina is pure criminality.\nThe Chief of Air Staff, Air Marshal Oladayo Amao thanked Governor Masari for his support to the NAF and other security agencies in Katsina State."
  },
  {
    "headline": "South East Governors Condemn Violent Secessionist Groups, Back United Nigeria",
    "summarized_story": "Members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nHe added, “The impression that South East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\nThe forum also condemned the killing of security agencies, burning of strategic infrastructure, and killing of civilians in the South East and other regions.\n“The meeting endorsed our South East joint security outfit – Ebubeagu and asked them to work with security agencies and to respect the rights and privileges of all those living in South East and our visitors,” Governor Umahi said while reading the communique issued at the end of the meeting."
  },
  {
    "headline": "Pressure Mali To Return To Civilian Rule, Buhari Tells ECOWAS Leaders",
    "summarized_story": "President Muhammadu Buhari on Saturday called on West African leaders to exert pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nThe Nigerian leader spoke on the situation in Mali which was recently suspended from the regional bloc due to a military coup.\n“Pressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, President Buhari faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they were disarmed.\nIn his capacity as the ECOWAS champion on the fight against COVID-19, President Buhari also drew attention to the need for more citizens in the region to be vaccinated, stressing the need for adherence to other non-pharmaceutical interventions."
  },
  {
    "headline": "Secession Agitation: To Say We Are Silent Is Not Correct – South East Leaders",
    "summarized_story": "Leaders in the South East have faulted the notion that they have been unbothered about the agitation for secession by some youths in the region.\n“The impression that South East leaders are silent over some of our youths’ agitation for secession is not correct; South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations,” he said.\nREAD ALSO: South East Governors Condemn Violent Secessionist Groups, Back United NigeriaThe governor added, “We condemn in totality, the activities of violent secessionist groups in the South East and elsewhere, we firmly proclaim that we do not support them, they do not speak for South East.\nAccording to him, the leaders have noted the threats by some groups against the people of the South East and will protect them and everyone from other regions.\n“We condemn the killing of security agencies, burning of strategic infrastructure, and killing of civilians in South East and other regions."
  },
  {
    "headline": "Mob Sets Truck Ablaze For Killing Motorcycle Rider, Passenger",
    "summarized_story": "An angry crowd has set a truck ablaze following an accident that led to the death of two persons in Ogun State.\nSources said the truck had veered off its lane and faced an oncoming motorcycle before it crushed both the rider and the passenger to death.\nThe spokesman for the Ogun State Traffic Compliance and Enforcement Corps (TRACE), Babatunde Akinbiyi, also confirmed the incident to Channels Television on Saturday in Abeokuta, the state capital.\nHe noted that an angry mob descended on the truck and set it ablaze while the driver of the vehicle took to his heels.\nThe TRACE spokesman condoled with the families of the victims over the loss and warned motorists, especially truck drivers against reckless and dangerous driving."
  },
  {
    "headline": "Air Force Trains Personnel To Tackle Incessant Aircraft Crashes",
    "summarized_story": "The Nigerian Air Force (NAF) has commenced the re-training of personnel in order to ensure the safety of its crew, as part of efforts to tackle the incessant air mishaps in the Nigerian military.\nAddressing reporters on Saturday, NAF Director of Training, Air Commodore Esen Efanga, explained that the Chief of Air Staff approved the training to enable the crew to be up to speed with global best practices and reduce human factors that cause air crashes.\n“It is the Chief of Air Staff’s intention to establish a culture of safety in the Nigerian Air Force so that while we have increased and enhanced our operations, we take care of this critical aspect of NAF operations,” he said.\nAttahiru, who was appointed as the Chief of Army Staff in January, died in a plane crash in Kaduna alongside 10 other personnel of the Nigerian Army and Nigerian Air Force.\nThe incident was preceded by two other crashes – the first being Beechcraft KingAir B350i which crashed at Bassa village in Abuja while en route to Minna, killing seven NAF personnel in the process."
  },
  {
    "headline": "Police arrest suspected bandit, recover AK-47 rifle, vehicle",
    "summarized_story": "Operatives of the Kaduna Police command have arrested a suspected bandit while on routine patrol along a forest in Saminaka, Lere Local Government area of the state.\nAmong items recovered from him is an AK- 47 rifle.\nKaduna Police spokesperson Mohammed Jalige said the bandit was intercepted among others in a green Volkswagen vehicle while heading towards Kaduna.\nThe police operatives who gave them a hot chase apprehended one, and after a search of the vehicle found an AK-47 rifle concealed.\nAdvertisementThe police assure that they are working hard to end banditry and all forms of criminality in the state."
  },
  {
    "headline": "South East leaders reaffirm commitment to united Nigeria",
    "summarized_story": "South East Leaders have again reaffirmed their commitment to a united Federal Republic of Nigeria, that allows justice, fairness, love and respect for one another.\nThe leaders made the affirmation after it’s about four hours closed door meeting, held at the government house Enugu.\nReading the communique on behalf of the group, chairman of South East Governors forum and Governor of Ebonyi state, Dave Umahi reinstates their position to condemned the activities of successionist group in the region.\nThe group promised to protect non Igbo residing in the region, while they expect leaders of other regions to address the threat to Ndigbo and protect them.\nAdvertisementThe group also throw their weight behind Ebubeagu corps and said it remains the only recognised community security outfit for the south East."
  },
  {
    "headline": "Insecurity: Governors’ wives organise prayer session in Zamfara",
    "summarized_story": "True repentance, good conduct by Nigerians and good moral upbringing of children are the ways to end the security challenges bedeviling the nationThis was the thrust of the conversation at a prayer session for peace and security organized by the Nigerian Governors Wives ForumThe wife of the Zamfara state Governor Aisha Bello Matawalle joined her counterparts across the thirty six states of the Federation in the national prayers.\nFemale Islamic Scholars, academics and politicians converged on the Zamfara state government House Chamber Gusau, to pray for the state and Nigeria at Large over the spate of Insecurity in all parts of the countryThe prayer session was organized by the Nigerian Governors’ wives association to seek divine intervention over the happenings in the country.\nAdvertisementThe upsurge in banditry, agitations, cattle rustling, kidnappings, rape and other crimes, is worrying and these women believe prayers alone cannot save the country except there is true repentance from the non state actors involved in perpetrating these crimes.\n” It is important for us as people and as a nation to return to God in Prayer to seek divine intervention against the criminal activities ravaging our dear Nation” Aisha Matawalle” There is need for every Nigerian to return to God for a better and more peace country”The wife of the Zamfara State Governor Aisha Bello Matawalle, the Deputy Vice Chancellor of federal University Gusau and other speakers at the event appeal to parents and guardians to control their children and wards in order to prevent their involvement in any act capable of undermining the peace and unity of the countryThe current insecurity and other related crimes in the country has not only crippled farming and socio-economic activities, but has also plunged Nigerians into hunger, poverty and frustration."
  },
  {
    "headline": "Israel Voices ‘Grave Concern’ Over Iranian President-elect Ebrahim Raisi",
    "summarized_story": "Israel has said the international community should have grave concerns about the election of Iran’s new president-elect, Ebrahim Raisi.\nA spokesman for Israel’s foreign ministry, Lior Haiat, said Mr Raisi is Iran’s most extremist president yet.\nMr Raisi, who will be inaugurated in August, is Iran’s top judge and holds ultra-conservative views.\nIn his tweets, however, Mr Haiat said more than 30,000 people were killed, which is a number also referenced by Iranian human rights groups.\nHowever, human rights groups have said Mr Raisi should be investigated for atrocities."
  },
  {
    "headline": "‘A Big Challenge’: Italy’s Roman Fortress Awaits Wales in Eye-catching Euro 2020 Clash",
    "summarized_story": "Wales are within touching distance of the Euro 2020 knockout stage as they visit Rome for their final group game against an Italy side in ominous form.\n“Even if that record wasn’t there, Italy are a big footballing nation and always make games difficult.\n“But Wales have players like [Joe] Allen, Bale, [Daniel] James – skilful, quality players so it will be a difficult match from a physical perspective.\nThis is the first match between Italy and Wales at a major tournament.\nWales have lost just one of their past 15 competitive games, March’s 3-1 defeat by Belgium in a World Cup qualifier."
  },
  {
    "headline": "Ethiopians Set to Vote in Crunch Polls Amid Conflict and Apathy",
    "summarized_story": "After some consideration, Shimelis Yohannes* decided to register to vote in Ethiopia’s delayed general elections due to be held on Monday.\n“I took a vote card because it’s better than sitting out the election,” said the civil servant in the capital, Addis Ababa.\nBut, he adds quickly, he has no illusions over a vote that has been overshadowed by conflict in the northern region of Tigray, instability elsewhere and widespread apathy.\n“I see only one constituency that’s represented in the polls; that is the urban elites and the Amhara region,” the analyst said.\nIn 2005, a police crackdown on unarmed protesters who took to the streets of Addis Ababa to decry election irregularities left nearly 200 demonstrators dead, as well as six police officers."
  },
  {
    "headline": "Brazil Passes 500,000 Covid Deaths, Experts Warn of Worse Ahead",
    "summarized_story": "Brazil has registered 500,800 deaths from 17,883,750 confirmed COVID-19 cases, according to Health Ministry data on Saturday, the worst official death toll outside the United States.\nOver the past week, Brazil has averaged 2,000 deaths per day.\nExperts see the toll in Brazil, already the highest in Latin America, climbing far higher.\nGuimaraes warned that Brazil could revisit scenes from the worst of its March-April peak, when the country averaged 3,000 deaths per day.\nBrazil will need to inoculate some 80 million people to reach Chile’s current per capita vaccination levels."
  },
  {
    "headline": "Airlines, Holiday Companies Ramp Up Pressure on Britain to Ease Travel Rules",
    "summarized_story": "Britain’s airlines and holiday companies are planning a “day of action” on Wednesday to ramp up pressure on the government to ease travel restrictions, with just weeks to go before the start of the peak summer season.\nTravel companies, whose finances have been stretched to breaking point during the pandemic, are desperate to avoid another summer lost to COVID-19.\nOn Wednesday, June 23, pilots, cabin crew and travel agents will gather in Westminster, central London, and at airports across Britain to try to drum up support.\nBritain’s aviation industry has been harder hit by the pandemic than its European peers, according to data published by pilots trade union BALPA on Sunday.\nUK airports were also badly affected, with traffic in and out of London’s second busiest airport Gatwick down 92%, according to the data."
  }
]