[
  {
    "headline": "Fire destroys aid donated for Ukrainians in Greece",
    "summarized_story": "The fire broke out in a storage area outside the Peace and Friendship indoor stadium near the port of Piraeus, the fire department said.\nI am very sorry to be in this situation, to see donations destroyed,” Ioannis Spanolios, founder of aid group Oloi Mazi Boroume, said at the charred site, fighting back tears.\nA fire spokesperson said the blaze had been extinguished and the causes were under investigation.\nA haul of medicine and food was unharmed, aid coordinator Irina Bortnyk told AFP.\nGreece is hosting over 30,000 refugees from Ukraine, including nearly 8,000 minors."
  },
  {
    "headline": "Referendum: Tunisia to vote on ‘new republic’ on July 25",
    "summarized_story": "The vote will come exactly a year after Saied sacked the government and suspended parliament, moves his rivals called a coup, but which he argues were necessary to resolve a crippling political deadlock.\nSaied has since held a widely boycotted public consultation on a new constitution.\nThe draft is to be ready by June 30.\nHe has also called for a “national dialogue” but excluded political parties from the process.\nBut rights groups, political parties and foreign governments have warned of a slide back to dictatorship, a decade after the revolt that overthrew strongman Zine El Abidine Ben Ali."
  },
  {
    "headline": "Abba Kyari alleges threat to life in Kuje Prison, begs court for bail",
    "summarized_story": "Abba Kyari, the suspended Deputy Commissioner of Police (DCP), on Thursday, approached a Federal High Court for another bail plea.\nKyari and three of his co-defendants, through their counsel, urged Justice Emeka Nwite to admit them to bail because their lives in the Kuje Correctional Centre, where they are being remanded, were unsafe.\nIkpeazu said the defendants are being remanded with criminals in the correctional centre, who through them, their arrests were made possible.\nThe senior lawyer said their lives are at risk, hence, the need for their bail.\nJohn Nuhu, listed as 2nd to 5th defendant respectively, are being charged by the NDLEA for an alleged drug offence alongside Kyari."
  },
  {
    "headline": "Gov Ortom visits late AIG Awuna’s family, says death huge loss to Benue",
    "summarized_story": "Benue State Governor, Samuel Ortom has described the death of Assistant Inspector General of Police, AIG Don Awunah as a huge loss to the state.\nThe Governor stated this Thursday, May 26th, 2022 when he led top government officials to pay a condolence visit to the family at their new GRA, Makurdi residence.\nHe admonished them to be comforted and have faith in God as everything happens according to his will.\nHe assured that as a close friend and Benue son, he would maintain close ties with the family and continue to support them.\nHe directed his Chief of Staff, Dr. Tivlumun Nyitse to liaise with the family and furnish him with the financial involvement concerning his burial so that he and others can assist them to give him a befitting burial."
  },
  {
    "headline": "Supreme Court reserves judgment in Electoral Amendment Act suit",
    "summarized_story": "The Supreme Court on Thursday reserved judgment in the suit filed by President Muhammadu Buhari and Attorney-General of the Federation, Abubakar Malami, to void the provisions of Section 84(12) of the Electoral Act, 2022.\nDAILY POST had reported that on May 19, the apex court admitted an application filed by Rivers to be joined in the suit.\nThe applicants told the court that they were opposed to the suit marked SC/CV/504/2022, which originally had the National Assembly as the sole respondent.\nRecall that Buhari and Malami filed a suit at the Supreme Court, seeking an interpretation of Section 84(12) of the Electoral Amendment Act 2022.\nThey are seeking an order of the apex court to strike out the section of the Electoral Act, saying it is inconsistent with the nation’s Constitution."
  },
  {
    "headline": "2023: INEC boss, Mahmood Yakubu reveals worry ahead of general elections",
    "summarized_story": "Mahmood Yakubu, Chairman of the Independent National Electoral Commission (INEC), has raised an alarm about money politics threatening Nigeria’s democracy ahead of the 2023 general elections.\nYakubu said that money politics is becoming more present, adding that the risk is that Nigeria’s democracy may soon become a plutocracy for the rich rather than a democracy for the people.\nHe spoke at an event organised by the Centre for Democracy and Development (CDD) in collaboration with the Open Society Initiative for West Africa (OSIWA) in Abuja on Wednesday.\nThe INEC boss said that some of the challenges the commission is facing ahead of the 2023 general election are insecurity, fake news and money politics.\n“However, there are two dimensions to it, when you’ve willing connectors it becomes a bit more difficult to contain the situation."
  },
  {
    "headline": "Police arrest Ibadan-based broadcaster, Oriyomi Hamzat",
    "summarized_story": "An Ibadan-based broadcaster, Alhaji Oriyomi Hamzat has been arrested.\nDAILY POST gathered that Hamzat, who owns Agidigbo FM, was arrested by the Federal Intelligence Bureau of the Nigeria Police Force on Thursday morning in Ibadan, the Oyo State capital.\nSources said that Hamzat has been taken to Abuja for interrogation.\nBut, sources said that the arrest may not be unconnected with his role in the ongoing case of the murder of late Timothy Adegoke.\nHamzat had been calling for justice over the death of Adegoke who was until his death a Master’s student at Obafemi Awolowo University, Ile-Ife."
  },
  {
    "headline": "2023: Obi dumps PDP, to actualise ambition on another platform",
    "summarized_story": "From Ndubuisi Orji, AbujaFormer Anambra State Governor, Peter Obi, yesterday, announced his resignation from the Peoples Democratic Party (PDP).\nHe also pulled out from the 2023 presidential contest on the platform of the main opposition party.\nIt read: “I am writing to intimate you of my resignation from PDP, which was conveyed to the Chairman of Agulu Ward 2.\nConsequently, I am by this letter informing you of my withdrawal for the PDP presidential primaries.\nHowever, Director General of the Peter Obi Campaign Organisation, Doyin Okupe, said the former governor would actualise his presidential ambition on the platform of another party."
  },
  {
    "headline": "Makinde, Fintiri, Eno, Uba, Mbah, Barde, Oborevwori,",
    "summarized_story": "Makinde secured the ticket with 1,040 votes while his closest rival, former deputy governor of the state, Hazeem Gbolarumi scored six votes.\nThe result was announced by the Secretary of the Oyo State PDP Governorship Electoral Committee, Alhaji Abdullahi MaiBasira, who held brief for the committee’s chairman, Senator Ben Obi.\nAdamawa governor, Fintiri polled 663 votes out of the 668 delegates votes.\nIn Akwa Ibom State, Governor Udom Emmanuel’s anointed candidate, Pastor Umo Eno, garnered 993 delegates votes to beat 13 other contestants.\nThis one too, God has done it and we return all glory to Him.”In Enugu State, lawyer and financial analyst, Mr. Peter Mbah emerged the party’s governorship candidate."
  },
  {
    "headline": "Signposting increasing investment inflows, Temile awards new vessel building contract",
    "summarized_story": "An indigenous firm, Temile Development Co, has signed contract with the same builder for the construction and supervision of its second 23,000 cubic meters LPG/NH3/VCM carrier vessel.\nThe LPG carrier vessel is the second that is being constructed by the Temile Development Company and is a sequel to the first vessel which was delivered in 2020, currently chartered to Nigeria LNG Limited for domestic LPG supply.\nThe first LPG vessel delivered in 2020 and the newly awarded were part of a two-vessel-building project valued at over $120 million.\nHe said: “We are delighted to execute the construction of our new LPG carrier with HMD, bringing onboard NSML to supervise the construction.\nAs an indigenous company, this demonstrates our commitment and support to the Nigerian Local Content Act and, as well, establishes our confidence in local capacity to deliver international acceptable standards."
  },
  {
    "headline": "Akwa-Ibom APC members protest alleged imposition",
    "summarized_story": "Convener of the protest, Obong Victor, in a petition claimed it was the state government that was sponsoring the governorship aspirant.\nThe APC National Chairman and indeed the entire Executive must act and immediately too,” he said.\nMeanwhile, Dr. Alex Otti, former chief executive officer of the defunct Diamond Bank, has backed out of the APC governorship primary in Abia State.\nThis well thought out decision was taken after due consultation with the army of our supporters, stakeholders, and above all, respected leaders of the APC within and outside Abia state,” he said.\nIn Ebonyi State, Elias Mbam Campaign organisationalso alleged plots by persons it described as agents of the government to scuttle the APC gubernatorial primary."
  },
  {
    "headline": "Zulum confirms 32 killed by ISWAP",
    "summarized_story": "From Timothy Olanrewaju MaiduguriBorno State Governor, Babagana Zulum, has confirmed that 32 people were killed in an attack on a community in the central part of the State by the Islamic State West Africa Province (ISWAP), a splinter group of Boko Haram.\nZulum, in a statement signed by his spokesman, Isa Gusau, yesterday, said the 32 killed were youths from Kala Balge Local Government.\nGusau said Governor Babagana Umara Zulum was very disturbed by the unfortunate killing of fellow citizens at the weekend.\nMeanwhile, the Senate President, Ahmed Lawan led a delegation of senate principal officials to condole with the governor and the people of the state.\nHe was accomplished by the Senate Chief whip, Senator Uzor Kalu, and other principal officials."
  },
  {
    "headline": "Buhari, Osinbajo, NEF, CAN Flay Killing of Pregnant Woman, Children in Anambra",
    "summarized_story": "The presidency said, in a statement yesterday, that the security agencies would go after the suspected killers.\nThe Indigenous People of Biafra (IPOB) was suspected to have killed the woman, her four children, and six other northerners in Anambra State on Sunday.\nThis occurred few days after a member of the Anambra State House of Assembly, Dr. Okechukwu Okoye, was beheaded, as allegations mounted about murders by IPOB.\nIn a release Wednesday by Shehu, Buhari assured that the perpetrators of the killings would be brought to justice.\nAccording to the vice president, “What took place in Anambra with the killing of a woman and her children demeans us all."
  },
  {
    "headline": "Adamu: No Decision on Zoning Till After Screening APC Presidential Hopefuls",
    "summarized_story": "•Says aspirants will be scrutinised according to party’s guidelinesAdedayo Akinwale in AbujaThe National Chairman of the All Progressives Congress (APC), Senator Abdulahi Adamu, yesterday, said that the ruling party would take decision on zoning after all the presidential aspirants had been screened.\nBaring his mind on the zoning arrangement, Adamu said no decision would be taken until the aspirants were screened.\nWe will take the decision when we get there.”On likely consensus arrangement, Adamu noted that party members could not be denied the right to contest for president.\n“We have 28 aspirants for the presidential ticket and everybody knows that all of them cannot get the ticket.\nOur delegates should know that anybody sharing money to them can’t be the right candidate for the party."
  },
  {
    "headline": "Breaking: Obi Dumps PDP, to Pursue Presidential Ambition in Another Party",
    "summarized_story": "*Okupe: Certainly, he will be on presidential ballotChuks Okocha in AbujaFormer governor of Anambra State, Peter Obi, Wednesday resigned his membership of the Peoples Democratic Party (PDP) as well as his presidential bid on the platform of the partyHis letter of resignation from PDP was submitted to the National Chairman.\nDr. Iyorrchia Ayu, by the Director General of the Peter Obi Campaign Organisation, Dr. Doyin Okupe.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Citing Inflationary Concerns, CBN Raises MPR to 13%, First Increase in 30 Months",
    "summarized_story": "Emefiele noted that CBN’s action was aimed at curbing inflation, on the one hand, and supporting growth of the economy, on the other.\nEmefiele said, “The concerns about the global rise in inflation and price levels; you all would have seen that the price of crude quite unexpectedly has been above $100 per barrel.\n“This has increasingly fragmented the global economy, imposing huge strains on the tepid post-pandemic recovery.\nAs a result, lead to a higher cost of production and a higher inflation rate.\n“Globally, inflation rate is also increasing and in Nigeria, while there are other factors that contribute to rising inflation, one of the ways of combating that is to also raise rates."
  },
  {
    "headline": "Hayatu-Deen: 2023 Presidential Election is PDP’s to Lose",
    "summarized_story": "Speaking exclusively to THISDAY in a presidential interview series, Hayatu-Deen, punctured arguments in favour of zoning or power shift.\nBut PDP had already deferred to wisdom by throwing its presidential ticket open, he stated.\n“Secondly, the election of 2023 is PDP’s to lose and if caution is not exercised, APC may actually snatch victory from the jaws of defeat if we have an acrimonious convention.\n“Thirdly was that the consensus arrangement was actually going to happen in stages.\nSecondly, it’s now almost a generation and after 23 years, we are still bogged down with power shift."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Stella Oduah threatens to sue NYSC over 'scandalous' abscondment allegation",
    "summarized_story": "Stella Oduah, senator representing Anambra north, has threatened to sue the National Youth Service Corps (NYSC) if it does not retract the allegation that she failed to complete her youth service.\nIn a May 24 letter, the NYSC had claimed that Oduah did not complete the mandatory national youth service scheme.\nAccording to Daily Trust, Shuaibu Ibrahim, NYSC director-general, had said Oduah was mobilised for national service in 1982/83 and was deployed to Lagos — but absconded after the orientation.\nAdvertisement“For the avoidance of doubt, Sen. Oduah’s NYSC place of primary assignment was the popular Nigeria Employers’ Consultative Association (NECA).\nAdvertisement“You are by this letter given 48 hours to retract your statement failing which legal actions shall be commenced against you.”"
  },
  {
    "headline": "Stella Oduah threatens to sue NYSC over 'scandalous' abscondment allegation",
    "summarized_story": "Stella Oduah, senator representing Anambra north, has threatened to sue the National Youth Service Corps (NYSC) if it does not retract the allegation that she failed to complete her youth service.\nIn a May 24 letter, the NYSC had claimed that Oduah did not complete the mandatory national youth service scheme.\nAccording to Daily Trust, Shuaibu Ibrahim, NYSC director-general, had said Oduah was mobilised for national service in 1982/83 and was deployed to Lagos — but absconded after the orientation.\nAdvertisement“For the avoidance of doubt, Sen. Oduah’s NYSC place of primary assignment was the popular Nigeria Employers’ Consultative Association (NECA).\nAdvertisement“You are by this letter given 48 hours to retract your statement failing which legal actions shall be commenced against you.”"
  },
  {
    "headline": "NSIA: FG to take delivery of fertilisers from Russia, Canada next week",
    "summarized_story": "Nigeria Sovereign Investment Authority (NSIA) says the country will take delivery of potash from Russia and Canada next week.\nThe war in Ukraine has led to a scarcity of fertilisers owing to a plodding supply from Russia, Belarus, and Ukraine.\nRussia is the world’s number one exporter of nitrogen fertiliser and second in phosphorus and potassium fertilisers.\nAbout 30 per cent of the world’s potash comes from Russia and Belarus.\nWe have two vessels discharging phosphate, and there’s already more in the warehouses,” Orji said."
  },
  {
    "headline": "NSIA: FG to take delivery of fertilisers from Russia, Canada next week",
    "summarized_story": "Nigeria Sovereign Investment Authority (NSIA) says the country will take delivery of potash from Russia and Canada next week.\nThe war in Ukraine has led to a scarcity of fertilisers owing to a plodding supply from Russia, Belarus, and Ukraine.\nRussia is the world’s number one exporter of nitrogen fertiliser and second in phosphorus and potassium fertilisers.\nAbout 30 per cent of the world’s potash comes from Russia and Belarus.\nWe have two vessels discharging phosphate, and there’s already more in the warehouses,” Orji said."
  },
  {
    "headline": "Adamu: APC presidential hopefuls wooing delegates with money don't mean well for Nigeria",
    "summarized_story": "Abdullahi Adamu, national chairman of the All Progressives Congress (APC), says presidential hopefuls inducing delegates to vote for them don’t mean well for Nigeria.\nSo far, 28 aspirants are jostling for the presidential ticket of the ruling party.\n“I don’t have evidence that aspirants are sharing money with delegates, for me, it’s the delegates that are selling their conscience, which is not proper,” he was quoted as saying.\nAdvertisement“Our delegates should know that anybody sharing money with them can’t be the right candidate for the party, he doesn’t mean well for the country.\n“We have 28 aspirants for the presidential ticket, and everybody knows that all of them cannot get the ticket."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Nigeria wants to help creators sell their intellectual properties",
    "summarized_story": "The Nigerian government has signed a 3-year intellectual property rights (IPR) agreement with Developing Africa Group (DAG) to create a marketplace where Nigerians can sell their intellectual property rights and receive royalties.\nThe platform will allow Nigerian creators commercialise registered intellectual property rights, and enable them to sell or exchange those rights internationally.\nGlobally, the intellectual property rights market is worth $8.2 billion and is set to reach $16.1 billion by 2026 with the advent of cloud-based solutions.\nIntellectual property in NigeriaIntellectual property rights (IPR) are the exclusive rights creators have over their works.\nThe country’s Copyright Act governs the intellectual property rights of literary, artistic, musical works, broadcasting, recorded, and cinematographic works."
  },
  {
    "headline": "Uber crosses 1 billion rides in Africa",
    "summarized_story": "American ride-hailing giant Uber recently announced that it has completed 1 billion rides and over 10 billion kilometres in terms of distance covered across all its markets in Africa.\nThe company first launched in Africa in 2013, establishing a presence in Johannesburg, South Africa.\nWithin the past year, Uber expanded to over 30 cities across its major markets: 21 in South Africa, 4 cities each in Kenya and Nigeria, and 2 in Ghana.\nUberEats, which launched in 2016 in South Africa with just 1,000 restaurants, now serves over 8,000 merchants across 36 cities in South Africa and Kenya.\nDespite the success Uber has recorded in Africa, the ride-hailing company has also had to weather a few hurdles."
  },
  {
    "headline": "Dear healthtech startups, Jumia is coming for your bread!",
    "summarized_story": "It also represents a more formidable competitor for existing healthcare startups.\nThis makes it imperative that healthtech startups build solutions for this purpose.\nIn a chat with Techpoint Africa, he said, “Jumia can potentially build out its healthtech play through more partnerships to facilitate diagnostics.\nHealthtech startups, for example, can provide faster and more efficient services by partnering with Jumia.\nDespite being boosted by the COVID-19 pandemic, healthtech startups are still a long way from meeting Africa’s healthcare needs."
  },
  {
    "headline": "Reclaiming stolen African artefacts",
    "summarized_story": "Also, a Nigerian, Chidi Nwaubani, launched the “Looty” project to reclaim African artefacts stolen by European colonists.\nThe project will create 3D images of these artefacts, sell them as non-fungible tokens (NFTs), and use the proceeds to support young African artists.\nThis is because some of us mistake mental health for a mental illness, which it is not.\nMental health is more than just the absence of a mental disorder.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with mental disorders."
  },
  {
    "headline": "[PODCAST] Relooting African art with NFTs",
    "summarized_story": "Share this article:If you listened to the last Techpoint African Podcast, you definitely remember Oluwanifemi and Chimgozirim going at it for several minutes, debating the Nigerian government’s decision to tax calls to provide healthcare.\nToday we talked about the Kenyan government’s plans to roll out a telemedicine programme.\nBut it also made a nice segue into the African Mobility Conference organised by GIG Mobility which will hold on June 2, 2022, at Eko Hotel and Suites, Victoria Island, Lagos.\nAnother topic on the discussion table was the Central African Republic’s decision to launch an official crypto hub named Sango.\nYou can also get the podcast on Spotify, Apple Podcasts, and Google Podcasts or anywhere else you get your podcasts."
  },
  {
    "headline": "VerifyMe Launches Instant Vehicle License Verification Service in Nigeria",
    "summarized_story": "With products such as license plate verification, VerifyMe continues to bring relevant products to market to help power growth in the fintech, insurance, and services industries.\nAccording to Esigie Aguele, Co-founder/CEO, VerifyMe Nigeria, the plate number verification service is designed to fill the need for trusted real-time data within Nigeria’s burgeoning vehicle and asset verification market.\nHe said: “We are enthusiastic about the possibilities Plate Number Verification service offers in opening new opportunities for the insurance sector.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Where and How to Buy and Sell cars, Spare parts on Carmart.ng",
    "summarized_story": "Nevertheless, its easy for anyone to know how to buy or sell cars on Carmart Nigeria.\nClick on the Sell ButtonThis is one of the final steps to buy and sell a car on Carmart Nigeria.\nWhy Choose Carmart Nigeria to Buy and Sell a CarThis car shop is recognized as a reliable place to buy and sell used vehicles.\nThis is the reason why you need to carefully study the tips on how to buy and sell a car on Carmart Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Investors to exit stocks for fixed income on rate hike",
    "summarized_story": "Bond yields would increase, leading to lower bond prices, stocks valuation would decrease, leading to selloffs and lower values for a limited period.\n“From a macro perspective, we expect the rate hike to result in an upward repricing of yields in the fixed income (FI) market, especially on the long end of the curve.\nAlso, Tajudeen Olayinka, Chief Executive Officer, Wyoming Capital and Partners who believes that the hawkish approach was not unusual and the impact being temporary on the Capital Market, noted that a securities market had self-correcting mechanism that would ultimately lead to an equilibrium between the money market and the capital market.\n“The impacts on the capital market will be temporary.\nBut later, the money market and capital market shall come into equilibrium."
  },
  {
    "headline": "NNPC’s clean energy plan opens opportunity for investors",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) says it will begin to invest in new commercial-ready technologies that can meet energy needs and help fight climate change impacts, a development that signals opportunities for clean energy investors.\nTrends show this is now the case in the energy sector where investments are shifting to new energy sources like hydrogen.\nOkadigbo alluded to NNPC’s quest for new energy forms and selecting low-hanging fruit projects, such as converting industry from raw energy to climate-smart technologies.\n“Once the strategies are in place, carbon offsets can be employed as a faster way to ensure reductions in carbon emissions.\nThis follows the agreement reached by 196 countries at the COP 21 in Paris commonly called the Paris Agreement in 2015, where they committed to cut back on carbon emissions."
  },
  {
    "headline": "Pension funds’ new capital raise triggers M&A",
    "summarized_story": "Barely a month after the end of the pension industry recapitalisation, which led to the successful emergence of 20 players, another wave of mergers and acquisitions (M&A) is brewing in the sector.\nAccess Holdings, owners of Access Pension Fund Custodian (PFC), last week announced the sale of its custodial business to First Pension Custodians.\nAccess Holdings had earlier announced plans by Access Bank to divest from its pension custody subsidiary.\nThe agreement is regarding a proposed purchase by First Pensions of the entire share capital of Access Pension Fund Custodian Limited held by Access Bank Plc.\n“If you look at the pension industry, it is still very fragmented."
  },
  {
    "headline": "Edo steps up efforts to contain Lassa fever in communities, to relocate civil service recreation centre – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is ramping up efforts to contain the spread of Lassa fever across communities in the state, with a charge to environmental health officers in various local government areas to ensure zero incidence in their localities.\nThe Edo State Commissioner for Information, Andrew Emwanta, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nEmwanta said Governor Obaseki has also approved the relocation of the Edo State Civil Service Recreation Centre at Osadebe Avenue in the GRA axis of the state to a more suitable location.\nHe said, “According to the Edo State Commissioner for Health, Prof. Akoria Obehi, who is also a member of the State Taskforce on Lassa fever, the state has not had any new case or incident of the disease.\n“The Council has resolved that the environmental health officers of the various local government areas especially those in the affected area of Lassa fever will be held responsible for any new outbreak of Lassa fever."
  },
  {
    "headline": "Obaseki’s reforms: CBN rallies investors for devt of 1,590 hectares plantation – Nigerian Observer",
    "summarized_story": "With the global demand for oil palm on the increase amid supply disruptions, investors are taking advantage of the Edo State Oil Palm Programme (ESOPP), to deepen imprints in the country’s oil palm sector.\nAlready, Edo has about 120,000 hectares of oil palm plantation under development.\nAgenmonmen said work is in top gear to supply crude palm oil (CPO) and palm kernel oil (PKO) to the market through the current expansion programme of its palm plantation and mill.\nHe stated that there was no better time to invest in palm oil cultivation and production in Nigeria other than now, particularly against the backdrop of the recent ban on the exportation of palm oil and oil palm produced by the Indonesian government.\n“In recent times, people that normally import can no longer import palm oil and other products from Indonesia."
  },
  {
    "headline": "Obaseki parleys Christian bodies on Benin Master Plan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, met with the Christian community in the state, including the Pentecost Fellowship of Nigeria (PFN) and the Christian Association of Nigeria (CAN), to seek the collaboration of Christians and churches toward the realization of the Benin Master Plan and the Edo Regional Development Plan.\nObaseki, at an interactive session/stakeholders’ meeting with the organizations, at the Government House, Benin City, said his government will sustain reforms to improve the livelihoods of the people.\nThe governor said his administration has declared war on land grabbers in the state.\nMrs. Margaret Agbonifo assured the governor that churches in the State will key into the Benin Master Plan and Edo Regional Development Plan to ensure development in the state.\nWe are here to intimate you on what is going on and get your input because the impact of the master plan will benefit all.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki, U.S govt partner to sustain investment in agric, health, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the United States are exploring areas of investment to sustain the gains recorded by the Obaseki-led government in agriculture, economy, healthcare and education, among others.\nObaseki disclosed this when he received the United States Ambassador to Nigeria, Mary Leonard, who was on a courtesy visit at the Government House, Benin City.\nThe governor said his government is sustaining efforts at engendering sustainable growth and development and ensuring economic prosperity for Edo people.\nWhile reassuring the support of the United States, she further hailed the Obaseki-led government for its various programmes to positively engage Edo youths.\nLeonard further revealed that museums in the United States of America are intensifying efforts to repatriate Benin artifacts in their possession."
  },
  {
    "headline": "NYSC Scandal: Stella Oduah threatens to sue corps over ‘false abscondment claim’",
    "summarized_story": "Stella Oduah, former aviation minister and senator representing Anambra north, has threatened to sue the National Youth Service Corps (NYSC) if does not retract its allegation that she failed to complete her youth service.\nIn a May 24 letter, the NYSC had claimed that Oduah did not complete the mandatory national youth service.\nShuaibu Ibrahim, NYSC director-general, had said Oduah was mobilised for national service in 1982/83 and was deployed to Lagos, but absconded after the orientation.\n“For the avoidance of doubt, Sen. Oduah’s NYSC place of primary assignment was the popular Nigeria Employers’ Consultative Association (NECA).\n“You are by this letter given 48 hours to retract your statement failing which legal actions shall be commenced against you.”"
  },
  {
    "headline": "SEC doubles efforts to tackle identity theft in capital market",
    "summarized_story": "The Securities and Exchange Commission (SEC) has noted that the Identity Management System being developed by the capital market would tackle the lingering identity management issues while allowing room for scalability as technology evolves.\nThe Nigerian Capital Market has been on a journey of innovation to drive an efficient Capital Market that would greatly impact the Nigerian economy.\nMembers include Mr. Bayo Olugbemi, Mr. Haruna Jalo-Waziri, Mr. Oladele Sotubo, Mr. Saheed Bashir, Mr. Herbert Wigwe, Mr. Premier Oiwoh and Mr. Adedeji Olowe.\nIt is tasked with a high level Terms of Reference (ToR) that would address legacy issues caused by lack of proper identity management system for the Nigerian Capital Market.\nIt is also to facilitate data accuracy and ease of participation in the capital market"
  },
  {
    "headline": "Banks hit by scarcity of cash, borrow N338.4bn from CBN",
    "summarized_story": "“Activities at the standing facility window during the period reflected improved banking system liquidity.\nHowever, industry expert and the Managing Director, Lancelot Ventures Limited, Adebayo Adeleke, said the public cannot go and deposit money or withdraw money from the CBN.\nThey also control the banks by ensuring that the banks maintain some levels of deposits with CBN.\nAll the banks bank with CBN, they deposit money and also bank with the CBN and that is why the CBN is able to control the influx of the naira into the economy, regulate the interest rates, increasing Monetary Policy Rate and others.\n“They borrow money from the CBN when they don’t have where to borrow money from and they are short of cash."
  },
  {
    "headline": "APC drops consensus plan for presidential primary",
    "summarized_story": "…says option not visibleThe All Progressives Congress (APC) has jettisoned the plan to use the consensus method in determining its presidential candidate.\nAdamu, who emerged as the APC chairman in March after President Muhammadu Buhari (retd.\n), endorsed him and asked other aspirants to step down for him, disclosed that a presidential primary was completely different from a chairmanship election.\nThe reason is that the chairmanship seat is not the same as that of the tussle for the Presidency of the country.\nWe have 28 aspirants for the presidential ticket and everybody knows that all of them cannot get the ticket."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Strike continues, N34bn released by FG not part of our demands: ASUU",
    "summarized_story": "He noted that the federal government had not attended to their demands and the strike will not be called off.\nThe ASUU President, however, sympathized with the University students over the prolonged strike.\nThe ASUU president said the students were not being punished but paying the price to ensure that Nigeria had a good education system.\nThe federal government had on Tuesday released N34 billion for the payment of consequential adjustment for the minimum wage of workers in the education system.\nHowever, it is now clear that the N34 billion released will not stop the ongoing strike by ASUU."
  },
  {
    "headline": "Chidinma Ojukwu's murder trial stalls again",
    "summarized_story": "Ill-health by defense counsel stalled the trial of an undergraduate, Chidinma Ojukwu, charged with murder ofMr. Usifo Ataga, Chief Executive Officer of Super TV.\nOjukwu is facing trial along with her sister, Chioma Egbuchu, and one Adedapo Quadri, before a Lagos high court sitting at Tafawa Balewa Square.\nThey are charged on nine counts bordering on murder, stealing and forgery.\nOjukwu and Quadri are facing the first to eight counts bordering on conspiracy, murder, stabbing, forgery, making of bank statements, and stealing.\nThe trial was also stalled on May 12 due to a change of counsel by Egbuchu."
  },
  {
    "headline": "Breaking: Stella Oduah fires back, gives NYSC 48hrs to retract allegation",
    "summarized_story": "The former Minister of Aviation and the Senator representing Anambra North Senatorial District, Stella Oduah has directed the National Youth Service Corps ,NYSC, to retract the allegation that she did not complete her national service within 48 hours.\nIn the letter addressed to the Director General, National Youth Service Corps and titled, “48 Hours Notice to Retract Your Statement as Contained in Your Letter Dated 24th May 2022 Ref No.\n“For the avoidance of doubt, Sen. Oduah’s NYSC place of primary assignment was the popular Nigeria Employers’ Consultative Association (NECA).\n“In fact, NECA wrote a letter dated January 11, 2017 with Ref: NECA/SELA/H4, signed by the Director General, O.\nA. Oshinowo and stated, “We hereby confirm that you carried out your NYSC primary assignment with NECA in 1982 during the tenure of Mr. Gabriel Okogwa (now of blessed memory)."
  },
  {
    "headline": "BREAKING: Supreme Court Reserves Judgement On 2022 Electoral Act",
    "summarized_story": "The Supreme Court has reserved judgement in a suit filed by President Muhammadu Buhari and the Attorney General of the Federation, seeking an interpretation of Section 84(12) of the electoral act, 2022.\nThe seven-man panel led by Justice Mohammed Dattijo, says the date will be communicated to the parties involved in the suit.\nThe Apex Court arrived at this conclusion, after taking arguments from parties and adopting their processes.\nAPGA, however, opted out by withdrawing its application for joinder which was subsequently struck out by the Apex Court.\nFagbemi objected to the NBA joining as amicus curiae in the matter, insisting it holds an opinion and is taking sides on the matter already."
  },
  {
    "headline": "JUST IN: Suspected Kidnappers Kill Soldier, Driver, Abduct Foreigner In Ondo",
    "summarized_story": "In the ancient town of Owo, in Ondo State, suspected kidnappers killed a soldier, driver, and kidnapped a foreign contractor.\nAt around 5 p.m., the bandits assaulted a construction site in Ogbonmo Ijebu-Owo, Owo council area, according to reports.\nVanguard discovered that they had followed the Lebanese contractor to the building site, where they killed the Soldier and the driver before whisking their victim away to an unknown location.\n“His driver and his security, a soldier were killed.\nThe state security agency nicknamed Amotekun, as well as vigilante groups in the community, have begun combing the jungle to ensure the release of the Victim, according to Vanguard."
  },
  {
    "headline": "VIDEO: Delta Speaker Kneels To Thank Okowa After Winning PDP Gov Ticket",
    "summarized_story": "VIDEO: Delta Speaker Kneels To Thank Okowa After Winning PDP Gov TicketDelta State Speaker, Sheriff Oborevwori, bent a knee to the governor of the state, Ifeanyi Okowa, to thank him during a praise session following his emergence as the governorship candidate of the Peoples Democratic Party, PDP.\nVIDEO: Delta Speaker Kneels To Thank Okowa After Winning PDP Gov Ticket Delta State Speaker, Sheriff Oborevwori, bent a knee to the governor of the state, Ifeanyi Okowa, to thank him during a praise session following his emergence as the governorship candidate of the pic.twitter.com/WleaOYaRHI — Punch Newspapers (@MobilePunch) May 26, 2022Oborevwori polled 597 votes out of total 824 ballots cast by delegates at the PDP governorship primaries held yesterday, May 25, in Delta State.\nThe lawmaker will fly the PDP flag in what is expected to be a tightly contested gubernatorial election in 2023.\nOther candidates expected to contest for the governorship seat includes current Deputy Senate President, Omo-Agege, who is expected to clinch the All Progressive Congress, APC,ticket."
  },
  {
    "headline": "Presidential ticket: APC national chairman, Adamu, breaks silence on consensus arrangement",
    "summarized_story": "Ahead of the All Progressive Congress (APC) presidential primaries scheduled for Sunday, the party’s leadership Wednesday said consensus arrangement on its choice candidate is not on the table for now.\nAPC National Chairman Senator Abdullah Adamu revealed this while speaking to some select journalists in Abuja.\nParty’s standBut speaking in an interview Wednesday at the party’s national secretariat, the APC national chairman, Senator Adamu, said “the party has its own rules and strategies, which I will not expose now.\nLawan had already scheduled some engagements for Wednesday one of which was to meet with the APC leaders and delegates in Borno state.\n“We are therefore here to condole with you, the government and people of Borno state for this loss."
  },
  {
    "headline": "2023: Bala Mohammed in top contention, Atiku, Saraki sure of victory",
    "summarized_story": "With former Anambra state Governor Peter Obi pulling out of the party, fourteen party chieftains are now left in the race for the PDP presidential ticket.\n“Loyalty to the party is also said to be another factor going for the Bauchi State governor.\nTambuwalMeanwhile, Governor Tambuwal has continued his consultation with an appeal to the 811 delegates to vote right and ensure their votes count.\nSpokesperson of the Tambuwal Presidential Campaign Organisation, Prince Daniel made the appeal Wednesday in Abuja.\nEkweremadu withdraws from primariesIn a related development, former Deputy Senate President Ike Ekweremadu, has withdrawn from the PDP governorship primaries."
  },
  {
    "headline": "Breaking: Roma beat Feyenoord, win inaugural Europa Conference League as Mourinho strikes new European record",
    "summarized_story": "Roma won their first major European trophy by beating Feyenoord in the inaugural Europa Conference League final.\nMourinho, who has won the Champions League, Europa League and the Uefa Cup, is the first manager to win all of Uefa’s major European trophies.\nThe Portuguese was criticised after Roma were embarrassed 6-1 in Norway by Bodo/Glimt in the group stage last October.\nBut this win continued the former Chelsea and Manchester United manager’s perfect record in European finals, having now overseen five wins in five finals.\nThis was Mourinho’s first trophy since winning the Europa League with Manchester United in 2017."
  },
  {
    "headline": "Group hails CBN’s decision to raise MPR to 13% after 2yrs",
    "summarized_story": "…commends Emefiele’s achievements…calls on police arrest those behind fake news on alleged Emefiele’s sackA group called South West Professional Forum, SWPF, Thursday, hailed the decision of the Central Bank of Nigeria, CBN, to raise the Monetary Policy Rate (MPR) to 13 per cent after two years.\n“We want hail Emefiele and his seasoned team of professionals that is the Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) to vote unanimously to raise the Monetary Policy Rate (MPR) to 13 per cent on Tuesday, and indeed is a very crucial decision for national interest.\n“Through his people based policies, Nigerians have been offered numerous interventions and support for Small Medium Enterprises, SMEs and others.\n“We condemn those who just woke up from their mischief to relay fake news about the alleged sack of the CBN Governor on Wednesday.\n“This is handiwork of some politicians who have nothing to offer because they have run out of steam and are only out to blackmail the CBN Governor with such sponsored fake news."
  },
  {
    "headline": "GPP 2022: Canon drives innovation, showcases latest digital technologies across industry",
    "summarized_story": "In keeping with global trends in a post-pandemic era, where customer demand has shifted towards digital technologies, Canon will be spotlighting its digital printing technology, inkjet capabilities, wide format technology and complete workflow, from pre-press to post-press technology, spanning various industries including packaging, labelling, and retail.\nOffering 5 dedicated zones with live demonstrations that underscore the real-life applications of inkjet, wide format and production printing, Canon will also have dedicated webinars and virtual stand tours for participants who cannot attend in person.\nBecause of various technological advancements, we always propose the right solution and product to the end customer with this knowledge.\nWe’re doing this by transitioning from offset to digital printing.\nCanon prioritises our customers’ needs in everything we do, including providing expert advice on how to reimagine their business opportunities."
  },
  {
    "headline": "Soludo earmarks 4bn for completion of Anambra Int’l Airport project",
    "summarized_story": "By Tony Oraeki, AwkaAnambra State Governor, Prof. Charles Soludo yesterday said he has budgeted the sum of N4 billion to continue work at the Anambra State International passenger/Cargo Airport, built by his predecessor, Chief Willie Obiano.\nSoludo gave this hint through the State Commissioner for Budget and Economic Planning, Mrs. Chiamaka Nnake, during a press conference on the revised 2022 budget breakdown at the government house, Awka.\nShe added that the funding for the N170 billion 2022 revised budget for the state is not a problem for the state governor, Prof Chukwuma Soludo.\n“The revised budget size is about N170 billion versus the existing appropriation of N142 billion (with the capital expenditure accounting for 64% compared to 57% previously).\n“Capital expenditure increased by 33% from N81 billion to N108 billion while Recurrent expenditure increased marginally by 0.79% from N60.9 billion to N61.4 billion."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Supreme Court Reserves Judgement On 2022 Electoral Act",
    "summarized_story": "The Supreme Court has reserved judgement in a suit filed by President Muhammadu Buhari and the Attorney General of the Federation, seeking an interpretation of Section 84(12) of the electoral act, 2022.\nThe seven-man panel led by Justice Mohammed Dattijo, says the date will be communicated to the parties involved in the suit.\nAPGA, however, opted out by withdrawing its application for joinder which was subsequently struck out by the Apex Court.\nFagbemi objected to the NBA joining as amicus curiae in the matter, insisting it holds an opinion and is taking sides on the matter already.\nThe panel in a short ruling joined the NBA as an Amicus curiaeAn amicus curiae is an impartial adviser to a court of law in a particular case."
  },
  {
    "headline": "Cocaine Saga: Kyari, Six Others Back In Court Over Drug Trafficking",
    "summarized_story": "Suspended police officer Abba Kyari and six others have been brought back to court to answer to drug trafficking related offences brought against them by the National Drug Law Enforcement Agency (NDLEA).\nThe NDLEA had filed eight counts of hard drugs trafficking against Mr Kyari, who is also wanted in the United States for his relationship with convicted fraudster, Ramon ‘Hushpuppi’ Abbas.\nThose arrainged along with Mr Kyari include Assistant Commissioner of Police ACP Sunday Ubua, Assistant Superintendent of Police ASP Bawa James, Inspector Simon Agirigba, Inspector John Nuhu, Chibuinna Patrick Umeibe and Emeka Alphonsus Ezenwanne.\nMr Kyari, before his suspension, was a former Deputy Commissioner of Police.\nThe monetary value of the 202 cartons of Tramadol seized from him in one day was over N3 billion."
  },
  {
    "headline": "Insecurity: Soludo Imposes Curfew On Eight Anambra LGAs",
    "summarized_story": "Anambra State Governor, Professor Chukwuma Soludo, on Wednesday imposed a curfew on eight local government areas of the state.\nWe are working round the clock with the security agencies and the perpetrators must be brought to book.\nThe security agencies will continue to do their part, but we the people, must proclaim that Enough is Enough and demonstrate full ownership.\nNo part of Anambra State (house, bush or forest) shall be used as camps for these criminals.\nWe thank all the stakeholders in the Anambra project, and particularly thank the security agencies for their determination and sacrifice."
  },
  {
    "headline": "Channels TV Wins Nigeria’s Most Admired Media Brand Award",
    "summarized_story": "Multiple award-winning station Channels Television has won the Brand Africa award as Nigeria’s Most Admired Media Brand.\nBrand Africa is a non-profit intergenerational organisation that inspires a brand-led African renaissance to transform the continent’s image.\nREAD ALSO: Channels Television Wins TV Station Of The Year For The 14th Time﻿Just last year, Channels Television won the Nigeria Media Merit Award (NMMA) for Best Television Station of the Year for the 14th time – the highest in the history of the award.\nThe award for Best TV Station, which recognises media excellence in the country, is one of the numerous recognitions Channels Television has received in Nigeria and globally for its programming, with an audience of over 20 million people within and outside the country.\nPrior to the award bagged in October last year, Channels Television last won the Best Station of the Year for 2018."
  },
  {
    "headline": "Nigeria To Get 105,000 Tonnes Of Fertiliser Raw Material From Russia, Canada – NSIA",
    "summarized_story": "Nigeria to receive 105,000 tonnes of fertilizer raw material from Russia, and Canada on June 3 and June 6 respectivelyThis is according to the Managing Director and Chief Executive Officer of Nigeria Sovereign Investment Authority (NSIA), Mister Uche Orji, who disclosed this at the ministerial press briefing at the State House on Thursday.\nHe stated that the Russia-Nigeria potassium link has been re-established in spite of the ongoing Russia-Ukraine war.\nHe further affirmed that the current administration has so far committed over N100bn into the implementation of the ongoing Second Niger Bridge project under the Presidential Infrastructure Development Fund (PIDF).\nAccording to him, only N19 billion had been expended on the project before the coming of the current administration.\nHe added that the money committed to the project and others including the Lagos-Ibadan Expressway, Second Niger Bridge, and Abuja-Kaduna-Kano Highway was part of the $300m recovered from the Abacha loot."
  },
  {
    "headline": "I have all it takes to reposition Nigeria for better",
    "summarized_story": "One of the presidential aspirants on the platform of the People’s Democratic Party, Mohammed Hayatu-Deen says it is a miracle Nigeria is still standing.\nThe aspirant pointed out the reason for the drastic devaluation of naira in Nigeria, and he proposed some solutions that will be implemented if he is elected as Nigerian president.\nI have served as a member of three Presidential Advisory committees and i have also served in government in many other capacities.\nSpeaking on tourism, the PDP Presidential aspirant said tourism remains the epicenter of the development of this country.\nThe issue is that we need a leadership that puts the people at the epicenter of everything they do."
  },
  {
    "headline": "Owo Progressives Union Backs Samuel Ilesanmi Alade's aspiration",
    "summarized_story": "An Owo based youth socio-political group, Owo Progressive Union, has declared their unflinching loyalty and support for the Retired Military General, Rear Admiral Samuel Ilesanmi Alade (SIA)Already, the entire sons and daughters of Akoko extraction are backing the aspiration of Alade to represent Ondo North at the Red Chamber in the coming general election.\nAccording to a communique issued and signed by the group Publicity Secretary, Comrade Adekunle Fatai after the group meeting in Akure Ondo state capital, the group said the Oyin-Akoko born retired but not tired General has what it takes to transform the Senatorial district and beyond.\nIt’s time we invite personalty with exposure to restructure the district as several people has tried but failed us.\nHowever, the group also called on all Ondo North stakeholders beyond party affiliation and all dwellers that meant well for the district to support Alade’s aspiration for Ondo North can be great again.\nHe has what it takes to bring rapid development to the district like he has been doing even without political office.” he added."
  },
  {
    "headline": "Oyo NUJ demands justice for Reporter beaten by Police at PDP primary -",
    "summarized_story": "The Nigeria Union of Journalists Oyo State Council has demanded for justice from the State Police Command over the assault meted to a Reporter of the The Nation Newspaper, Yinka Adeniran at the Peoples Democratic Party gubernatorial primary in Ibadan.\nAdeniran is a reporter attached to the Oyo state Governor’s Office.\nThe incident took place at the primary election of the PDP between the State Governor Seyi Makinde and Mogaji Hazeem Gbolarumi.\nNoticing that The Nation reporter had gained entrance, the visibly enraged officer pounced on Adeniran, ordering other officers to ‘throw’ him out.\nThe quick intervention of other colleagues including the Oyo NUJ Chairman; chairman of the State Correspondents’ Chapel, Oluseye Ojo, leadership and members of the Oyo State Government House Press Crew saved the situation from becoming a full blown crisis."
  },
  {
    "headline": "Kwara PDP Set to start Governorship Primary -",
    "summarized_story": "597 delegates from the 16 local government areas of Kwara state are currently being accredited ahead of the Peoples Democratic Party governorship primary election.\nThey are Mr Ahman Pategi, Mr Yahman Abdullahi and Professor Yisa Gana.\nThe party had zoned its governorship ticket to Kwara north where the three aspirants hail from.\nHe is also the Proprietor of the Ahman Pategi University in Pategi in the Kwara North Senatorial district of the State.\nHe was also a former Gubernatorial aspirant on the platform of the All Progressives Congress in Kwara State and is based in Kaduna."
  },
  {
    "headline": "Minutes Before School Attack, Texas Gunman Sent Online Warning",
    "summarized_story": "Eventually, Ramos, a high school dropout with no known criminal record or history of mental illness, was shot dead by law enforcement.\nThe wounded included “multiple children” who survived the gunfire in their classroom, Texas Department of Public Safety spokesperson Chris Olivarez said.\nVictims’ loved ones took to social media to express anguish over the loss of children who never came home from school.\nThe National Rifle Association’s annual meeting starts on Friday in Houston, where Republicans including Abbott, Texas U.S.\nThe Texas rampage stands as the deadliest U.S. school shooting since a gunman killed 26 people, including 20 children, at Sandy Hook Elementary School in Connecticut in December 2012."
  },
  {
    "headline": "Nigeria: Mohammed, Son of Late Military Dictator Sani Abacha, Emerges Kano PDP Gubernatorial Candidate",
    "summarized_story": "Mohammed Abacha, a son of the late Nigerian military leader Sani Abacha, has emerged winner of the Peoples Democratic Party, primary election in Kano.\nThe returning officer, Barrister Amina Garba, declared Mr Abacha winner after polling 736 votes to defeat his closest rival, Jafar Sani-Bello, who scored 710 votes.\nThe chairman the electoral committee, Mohammed Jamu, said their primaries was legally conducted with validly-elected delegates and supervised by the Independent National Electoral Commission, INEC, police and State Security Service operatives.\nWhile the primary that produced Mr Abacha was conducted at the state party headquarters located at Lugard Avenue, Kano, another parallel primary is was held at the Sani Abacha Youth Center, also in the state capital."
  },
  {
    "headline": "Nigeria, Ethiopia to Hold Bilateral Talks on Trade, Economy, Politics",
    "summarized_story": "Nigeria and Ethiopia have concluded plans to hold a Joint Ministerial Commission meeting in Addis Ababa in June, 2022, to discuss various areas of bilateral relationship and exchange perspectives on a wide range of international issues of mutual interest.\n‘‘Nigerian officials are heading to Addis Ababa in June to discuss various areas of relationship including political, economic, science and technology, mines and industry.\nThe envoy further said: ‘‘The Ethiopian Prime Minister, Dr Abiy Ahmed has always taken Nigeria as one of the pillars in Africa and a strong country in stabilising democracy in Africa.\n‘‘In the private sector, Dangote has a big cement factory in Ethiopia and Ethiopia has an expanding economy in Africa.\n‘‘So this is a very important and useful visit that will help officials from both countries to continue to network.’’"
  },
  {
    "headline": "Okonjo-Iweala: Global Food Crisis Could Last till 2024",
    "summarized_story": "The world’s food crisis could last until 2024 unless safe corridors are created to move Ukrainian food stocks currently blockaded by Russia, Director General of the World Trade Organisation (WTO), Dr. Ngozi Okonjo-Iweala, has warned.\n“He formed a crisis group composed of key UN agencies and related agencies.\nWTO is part of it, to look at the food, energy and finance aspects of the crisis.\nTrade, she pointed out, was part of the solutions to the simultaneous crises gripping the world, adding that the world faces the security crisis, the pandemic, the climate crisis, food crisis, all at same time.\nOkonjo-Iweala explained that the WTO recently revised down its projections for trade growth this year from 4.7 per cent to three per cent."
  },
  {
    "headline": "No Decision on Zoning Till After Screening of APC Presidential Hopefuls, Says Party Chairman Adamu",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, on Wednesday, said that the ruling party would take decision on zoning after all the presidential aspirants had been screened.\nBaring his mind on the zoning arrangement, Adamu said no decision would be taken until the aspirants were screened.\nWe will take the decision when we get there.”On likely consensus arrangement, Adamu noted that party members could not be denied the right to contest for president.\nAsked if the party was considering adopting the type of consensus arrangement that produced him as the chairman of the party, Adamu said the chairmanship position was not the same as the position of the president.\nOur delegates should know that anybody sharing money to them can’t be the right candidate for the party."
  }
]