[
  {
    "headline": "Why young women with cancer should freeze their eggs before chemotherapy –Gynaecologist",
    "summarized_story": "Amarachi OkehA Consultant Obstetrician and Gynaecologist, Dr. Morenikeji Olaniyi has urged young women who have cancer to consider freezing their eggs before starting chemotherapy treatment.\nShe noted that freezing eggs by young women with cancer was necessary before undergoing chemotherapy.\nShe said that due to chemotherapy and radiation treatment that women with cancer will undergo, freezing their eggs enhances their chances of having children in the future.\n“Cryopreservation is also for young women coming down with cancer.\nOvarian cancer, uterine cancer, anal cancer or any form of cancer that may require chemotherapy."
  },
  {
    "headline": "Why young women with cancer should freeze their eggs before chemotherapy –Gynaecologist",
    "summarized_story": "Amarachi OkehA Consultant Obstetrician and Gynaecologist, Dr. Morenikeji Olaniyi has urged young women who have cancer to consider freezing their eggs before starting chemotherapy treatment.\nShe noted that freezing eggs by young women with cancer was necessary before undergoing chemotherapy.\nShe said that due to chemotherapy and radiation treatment that women with cancer will undergo, freezing their eggs enhances their chances of having children in the future.\n“Cryopreservation is also for young women coming down with cancer.\nOvarian cancer, uterine cancer, anal cancer or any form of cancer that may require chemotherapy."
  },
  {
    "headline": "COVID-19: FG adds South Africa to travel ban list",
    "summarized_story": "The Federal Government has added South Africa to the list of countries that can’t have flights coming into Nigeria due to the COVID-19 pandemic.\nThis was disclosed by the Chairman, Presidential Steering Committee on COVID-19, Boss Mustapha.\nHe explained that South Africa recorded over 100, 000 new COVID-19 cases in the last one week while 20,000 were recorded in the last 24 hours.\nWe must provide what we know as W.A.S.H Which is known as Water, Hygiene and Sanitation for our people.\n“We are responding to the outbreak but responding to a cholera outbreak in 2021 is not what we should be doing, we should be facing more difficult diseases.”"
  },
  {
    "headline": "COVID-19: FG adds South Africa to travel ban list",
    "summarized_story": "The Federal Government has added South Africa to the list of countries that can’t have flights coming into Nigeria due to the COVID-19 pandemic.\nThis was disclosed by the Chairman, Presidential Steering Committee on COVID-19, Boss Mustapha.\nHe explained that South Africa recorded over 100, 000 new COVID-19 cases in the last one week while 20,000 were recorded in the last 24 hours.\nWe must provide what we know as W.A.S.H Which is known as Water, Hygiene and Sanitation for our people.\n“We are responding to the outbreak but responding to a cholera outbreak in 2021 is not what we should be doing, we should be facing more difficult diseases.”"
  },
  {
    "headline": "FG approves TETFUND takeover of National Library project — Perm Sec",
    "summarized_story": "The Federal Government has approved the takeover of the financing of the National Library project by the Tertiary Education Trust Fund, (TETFUND), according to Mr Sonny Echono, Permanent Secretary, Federal Ministry of Education.\nHe said the move was aimed at repositioning library services in the education sector for effective delivery, recalling that work on the National Library had been stalled for years due to inadequate funding and efforts to get the private sector to complete the project had not yielded any results.\nResponding, President of the Association, Prof. Innocent Ekoja, commended the Federal government, saying that the completion of the National library would bring honour and pride to all Nigerian librarians.\nHighlights of the one-day working visit included; the investiture of the Service Award on the Permanent Secretary, the highest honour ever bestowed on a non-librarian by the association.\nEkoja revealed that the investiture on the Permanent Secretary was the seventh by the association in the last 40 years."
  },
  {
    "headline": "Leaders, youths lament high profile killing in Ondo community",
    "summarized_story": "Dayo Johnson AkureLeaders and youths in Ifon Community, in the Ose council area of Ondo state, have cried out over high profile killings by gunmen in the area.\n‘”This unfortunate incidence led to the killing of the APC chieftain, Dele Isibor, having sustained severe injuries from the gunshot and four people were kidnapped by the gunmen.\nOne of the community leaders, Sunday Amudeli who spoke at the meeting said that Ifon community had been in the news for over a year as a result of insecurity and other wrong reasons either about killing or kidnapping.\nAmudeli further stated that Ifon occupies a strategic location in the State, serving as a boundary to Edo and Ondo State.\nThe community is conducive and is ready to provide the land for stability, peace and to maintain law and order."
  },
  {
    "headline": "Anambra: APC sets up Appeal committee as seven aspirants kick",
    "summarized_story": "By Omeiza Ajayi, AbujaNational Chairman of the ruling All Progressives Congress APC Caretaker/Extraordinary Convention Planning Committee (CECPC), Governor Mai Mala Buni has approved the appointment of the Governor of Gombe State, Alhaji Inuwa Yahaya as Chairman of the APC Primary Election Appeal Committee for the Anambra State Governorship Election.\nThe appointment came as seven aspirants in the contest issued a disclaimer on Monday night saying the purported primary election never took place.\n“In the evening at about 6pm, eleven of the fourteen aspirants on the platform of the All Progressives Congress (APC) held a briefing with the members of the press to inform the nation of what was happening.\nWhat we are witnessing now is a show of shame that ridicules all of us, and further erodes the standing of the All Progressives Congress (APC) in Anambra State, and the South East of Nigeria.\nAnd we call on the National Party to take action to prevent the imminent demise of the All Progressives Congress (APC) in Anambra State and the South-east of Nigeria”."
  },
  {
    "headline": "Kaduna police confirm death of protesting student",
    "summarized_story": "By Ibrahim WuyoThe Police Command in Kaduna State has confirmed the death of a protesting student at the College of Education Gidan Waya in Kafanchan.\nALSO READ: Why we need knowledgeable, crack teams for international trade, contract negotiations ― Osinbajo“On receipt of the information, the Command immediately dispatched Operatives to restore normalcy.\nAt a point the protesters blocked the convoy of a military sector Commander injuring him and one other,”he said.\nALSO READ: NIN: NIMC registers 57.3m NigeriansHe explained that “the situation resulted into a fracas where three (3) protesters were injured in attempt to use minimal force to disperse the riotous students.\nVanguard News Nigeria"
  },
  {
    "headline": "Immigration boss, others hail Ugwuanyi on peace, development, support to security agencies",
    "summarized_story": "Babandele who spoke through the Comptroller of the Nigeria Immigration Service, Enugu State Command, Joachim Olumba, who paid a courtesy visit to Gov.\nUgwuanyi, at the Government House, Enugu, on Monday, commended the governor’s remarkable support to all security agencies in the state.\nAccording to the State Comptroller of Immigration, “Your Excellency, as a devout Christian, I cannot agree less with your administration’s emphasis that ‘Enugu State is in the Hands of God’.\n“Within my short stay since assumption of office as State Comptroller of Immigration, I have observed that Enugu State is thriving under your dynamic and focused leadership.\nUgwuanyi formally welcomed Olumba, Air Vice Marshal Okparah and Onokohwomomo to Enugu State and congratulated them on their new feats."
  },
  {
    "headline": "Navy SBS, Army invade Boko Haram, ISWAP camps, find grenades",
    "summarized_story": "Special Boat Service (SBS) unit of the Naval Base Lake Chad (NBLC) and 403 Special Force Amphibious Brigade, Nigerian Army, conducted a clearance operation in Baga, Borno State.\nThe military personnel, assisted by Civilian Joint Task Force (CJTF) operatives, targeted Boko Haram and ISWAP camps.\nA statement by Navy Information Director, Suleman Dahun said the offensive was led by Commander NBLC, Commodore Alexander Bingel.\nThe operation lasted four days and covered the Federal College of Freshwater Fisheries Technology (FCFFT), Doro Baga, Tangon Guava, Kwatan Gaba and Kwatan Kuyet.\n“The troops projected further to ensure no elements of ISWAP terrorists were left within the area”, Dahun added."
  },
  {
    "headline": "Army, police, Abba Kyari can't withstand Boko Haram, ISWAP, bandits",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous Peoples of Biafra, IPOB, has said the Nigerian Army, police cannot withstand Boko Haram, bandits in the Northeast.\nKanu made the remark while accusing Nigerian security operatives of killing Igbo youths while failing to curb terrorists in the Northeast.\nThe IPOB leader lamented that DCP Abba Kyari and his team are killing imnocent youths in the Southeast.\nSpeaking through the spokesman of IPOB, Emma Powerful, Kanu insisted that Kyari wrongly tagged innocent Igbo youths as unknown gunmen.\nThe statement reads: “It is unfortunate that super con cop DCP Abba Kyari and his team are killing Igbo youths and labeling them ESN and unknown gunmen."
  },
  {
    "headline": "Police raid black spots in Lagos, warn owners of spy plates, tinted cars",
    "summarized_story": "Odumosu charged the Area Commanders and Divisional Police Officers to enforce the order of the Inspector-General of Police, Usman Baba, against tint permits, siren and SPY number plates.\nThe CP reiterated that existing tint permits remain valid; only new vehicles with factory fitted tints are exempted.\nUnauthorised users of siren and SPY plates will be arrested and their vehicles seized ahead of prosecution.\nOdumosu further warned that approved SPY plates must be fixed on registered trucks/pick ups, not on private SUVs or cars.\nPolice provides update on exiting tinted car permits, SPY number plates in Nigeria"
  },
  {
    "headline": "Traditional worshippers/Muslims clash: Osun government calls for calm",
    "summarized_story": "The Osun State Government has called on residents of the state, especially religious and ethnic groups, to coexist peacefully in order to maintain the peace profile of the state.\n“Based on the update we have, one person was killed yesterday and we have about eight injured people in the hospital.\n“The government will pick the hospital bills of those receiving treatment to ensure that we do not put further pressure on the victims”, Binuyo said.\nDAILY POST reports that on Sunday, a traditional religion group reportedly unleashed terror on worshipers at Kamorudeen Central Mosque, at Oluode Aranyin in Osogbo around 2.30 pm.\nThe incident left one person dead and nine others injured through bullet and machet wounds."
  },
  {
    "headline": "PIB: There is enough oil in the North that can address poverty in Nigeria",
    "summarized_story": "At the meeting, the issue of exploration of oil in the North was at the forefront, as the Sultan called for more exploration of oil in the north.\nNational Assembly to pass PIB in weeks – SylvaThe Sultan said there is enough oil in the North that can address poverty and unemployment in the country.\n“Develop a second address, a more permanent address which you can hand over to your children,” he stated.\nThe House is due to resume on Tuesday, and PIB could be on the agenda before they embark on annual recess.\nTimipre Sylva hints on date for passing of PIB by National Assembly"
  },
  {
    "headline": "Farmers urged to adopt orange-fleshed sweet potato",
    "summarized_story": "By Khadijat Saidu, Birnin-KebbiIn an effort to promote healthy living among the citizens and to ensure food security, the Federal Government has advised potato farmers in the country to adopt planting of orange-fleshed sweet potato.\nThe Federal Government, through the Ministry of Agriculture and Rural Development made the call during the sweet potato farmers’ stakeholder’ meeting held at Presidential Banquet Hall, Birnin-Kebbi the state capital to sensitise them to the potato value chain.\nAddressing the gathering, while declaring it open, the Director, Federal Department of Agriculture, Hajia Karima Babangida, explained that considering the benefits of orange-fleshed sweet potato, the Ministry has resolved to explore the opportunities to further achieve food nutrition and food security.\nRead Also: IFAD earmarks N56m for Anambra farmersKarima, who was represented by Ubandoma Ularamu explain that the objective of convening the stakeholders’ workshop is to create a forum for the stakeholders/major actors in the potato value chain to put forward the realisation of the fullest potentials lurked up in potato production, processing, utilisation and marketing.\nIn achieving the above, she informed the gathering that the ministry is willing to contribute to the development of the potato value chain through its various agencies and research institutes with mandates in rendering technical services."
  },
  {
    "headline": "Benue demolishes wanted kidnapper Azonto's houses",
    "summarized_story": "By Uja Emmanuel, MakurdiThe Benue State government has demolished two houses belonging to a wanted kidnapper and robber Azonto in Sankera axis of Makurdi the Benue State capital.\nThe Demolition was carried out under the Benue State Law of Anti-kidnapping 2017 signed into law by Governor Samuel Ortom.\nThe law, Adoption, Hostage-taking, kidnapping, Secret Cult and Other Related Offences, 2017 was signed along the Benue State Anti-open Grazing Law in 2017.\nThe law of Adoption, hostage-taking, kidnapping, secret cult and other related offences stipulate stiffer punishment for offenders and gives more powers to law enforcement agents.\nThey confess that the houses are used as kidnapping den where Azonto hides his victims and negotiates ransom on their heads."
  },
  {
    "headline": "Police confirm killing of Kaduna student during protest",
    "summarized_story": "Kaduna State government has, however, washed its hands of the killing of the student, saying that it did not deploy security operatives to suppress protesting students.\nAruwan said: “The Kaduna State government is awaiting full reports on Monday’s (yesterday’s) protest by students of the Kaduna State College of Education, Gidan Waya.\n“The Kaduna State Governor Malam Nasir El-Rufai condoles with the family of the student that lost his life, and wished the students and operatives who sustained injuries speedy recovery.\n“The government of Kaduna State also wishes to debunk reports that it deployed security operatives to suppress protesting students.\nAll organs and sister bodies of NANS nationwide are by this resolution put on alert to relocate to Kaduna State for this important National Congress to further ascertain the co-operation and adherence to our demands by the government of Kaduna State."
  },
  {
    "headline": "Can the change come from the top?",
    "summarized_story": "Who can change and what can change?\nWhile the above questions seem pertinent, it is more prudent to ask, “ Can the change come from the top?\nChange only comes through change.\nFor emphasis, those who claim to change our economic woes must first change themselves.\nFor us as a nation, change will come from the bottom when we can say to them “ yes, you are from my state, but you messed up, I am not voting for you."
  },
  {
    "headline": "Over 3.4 million have taken 1st, 2nd of COVID-19 Vaccine – NPHCDA",
    "summarized_story": "‘I am glad to inform you that 3,441,146 doses have so far been utilized for the 1st and 2nd dose vaccinations, which is approximately 88 per cent of the total AstraZeneca COVID-19 vaccine stock in the country.\n‘Although we have had reported cases of mild, moderate and severe reactions since our COVID-19 vaccination roll out in March 2021.\nMore pleasing to mention is that with over 3million people vaccinated, Nigeria has not recorded any death case directly linked with Adverse Event Following Immunization (AEFI).\nWe are equally calling on those who received their first dose not later than May 17th and are yet to take their second dose to make themselves available for their second dose in order to be fully protected against the disease.\n‘Similarly, the government is procuring a total allocation of 29,850,000 of Johnson & Johnson (Janssen) COVID-19 vaccine through the African Union Commission and the AfreximBank arrangement."
  },
  {
    "headline": "Anambra Guber: Ngige calls for cancellation of APC primary",
    "summarized_story": "From Obinna Odogwu and Mokwugwo SolomonFormer Anambra South Senator, Andy Uba, has been declared winner of the governorship primary election of the All Progressives Congress (APC) in Anambra State.\nUbah emerged winner in the primary election contested by 13 other aspirants.\nHe added that the minor delay was not the fault of the committee or that of the party members, but that of logistics.\nMeanwhile, confusion is trailing the outcome as some of the party members and stakeholders have rejected the process leading to the congress.\nReacting to the declaration of Uba, State Publicity Secretary of the party, Okelo Madukaife, rejected the result, describing it as fake."
  },
  {
    "headline": "Buhari replies Niger Delta Avengers, says threat unnecessary",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has replied the Niger Delta Avengers, a militant group in the oil-producing Delta region threatening to resume attacks amid rising insecurity and disagreements over the share of oil wealth communities should get.\nThe president said it was curious that the threat was coming less than 48 hours after he met with the leadership of the Niger Delta and Ijaw National Congress (INC), at the Presidential Villa, where he responded to the germane issues raised, especially call for restructuring of the Federation, and the inauguration of a Board for the Niger Delta Development Commission (NDDC).\nAccording to a statement by Special Adviser to the President on Media and Publicity, Femi Adesina, he said threat was unnecessary.\n“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\n“God Bless the Federal Republic of Nigeria.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Constitution review: Speakers root for state police",
    "summarized_story": "From Paul Osuyi, AsabaSpeakers of the 36 states Houses of Assembly have made a case for the establishment of state police to tackle insecurity in the country.\nThey want the ongoing review of the 1999 Constitution to accommodate the concept of state police and community policing.\nThis was contained in a communiqué issued at the end of the second quarter general meeting of the Conference of Speakers of State Legislatures of Nigeria held in Asaba, Delta State.\nSigned by the chairman of the conference and Speaker of Bauchi State House of Assembly, Abubakar Suleiman, the communiqué commended the Federal Government’s in fighting insecurity.\nHe stated that there was need for dialogue on how to ensure fairness and equity in the governance of the country."
  },
  {
    "headline": "40 oil firms in possession of dormant refinery licenses",
    "summarized_story": "By Adewale SanyaoluEarly hopes of Nigeria’s refining capacity growing by 1,862,000 million barrels per day (bpd) has further been dashed as 40 firms are currently in possession of dormant refinery license, a Department of Petroleum Resources (DPR) refinery status report has revealed.\nThe DPR refinery license status report indicated that as at May 2021, a total of 68 refineries license and approval had been granted, out of which 40 are inactive.\nOthers are; American Exploration Company Nigeria Limited, Epic Refinery and Petrochemical Industries Limited, Masters Energy Oil and Gas Limited, Grifon Energy Limited, Sifax Oil and Gas Company Limited, Capital Oil and Gas Industries Limited, Green Energy International Limited, Fresh Energy Limited, Chyzob Oil and Gas Limited, Ibafon Oil and Gas FZE Refinery Limited, Owena Oil and Gas Limited, Tonwei Refinery, NSP Refineries and Oil Services, Rehoboth Natural Resources Dev.\nThe rest include; Niger Delta Petroleum Resources and Petrochemical Limited, RG Shinjin Petrochemicals Limited, Jil-Amber Consortium PHRC, Dee Jones, Hi-Rev Oil Limited, Starex Petroleum Refinery Limited, Eko Petrochem & Refining Company Limited, Petrolex Oil & Gas Limited, Ikwe-Onna Refinery Limited, Clean Waters Refinery, Southwest Refineries and Petrochemicals Company Limited, Obat Refinery Limited, Antonio Oil Company Limited.\nIn 2019, Kaduna Refining and Petrochemical Company Limited only processed crude in one month (June); Port Harcourt Refining Company Limited in two months (February and March); and Warri Refining and Petrochemical Company Limited in four months (January, February, March and May)."
  },
  {
    "headline": "Why Grazing Routes Are Difficult to Recover",
    "summarized_story": "However, THISDAY’s investigation has revealed that the grazing routes have been taken over, over the years, by modern facilities built for the public good.\nIn Kano State, the state government has acknowledged that the grazing routes have been taken over by public infrastructure, including schools.\nAlthough Niger State has 11 grazing routes, covering about 1,865 kilometres, 1,368 kilometres of these routes are primary routes while the remaining 496 kilometres are secondary routes.\nHe explained: “The committees are working with already list of encroachers on the grazing reserves and discussions are in top gear to reclaim these grazing reserves.\nThe Special Adviser on Media and Public Enlightenment to the Governor, Mr. Zalaini Bappa, said even some former governors who trespassed on the grazing reserves returned the land."
  },
  {
    "headline": "Petrol Subsidy Bites Harder, NNPC Proposes N114.3bn Deduction in June",
    "summarized_story": "These implied that the deduction by the NNPC more than quadrupled from the N25.374 billion in February to N114 billion in June.\nAdded to export crude oil, the revenue generated was $616.037 million.\nAll the transactions were hinged on N382.80 to one dollar exchange rate as advised by the Central Bank of Nigeria (CBN), according to the national oil company.\n“Crude oil export revenue received in May 2021 amounted to $167.72 million, equivalent to N64.2 billion.\nBesides, the corporation said it expended N5 billion on export financing, N8.3 billion on the non-functional refineries and N83.3 billion on the ongoing Nigeria/Morocco pipeline."
  },
  {
    "headline": "Buhari: Drug Trafficking, Abuse Pose More Threat than Insurgency, Banditry",
    "summarized_story": "•Says drug abuse already stretches across three generationsDeji Elumoye in Abuja and Laleye Dipo in MinnaPresident Muhammadu Buhari, yesterday, identified drug trafficking and abuse as more threatening to the stability of the nation than banditry and insurgency that are prevalent in some parts of Nigeria.\nThe enormity of the danger of drug abuse calls for an urgent need to nip the problem in the bud.\n“Today, it is a glaring fact that Nigerian youths are involved in drug abuse.\nHe said: “And in this campaign, we are tackling the scourge of drug abuse and trafficking on all fronts.\nIn addition to the arrest and prosecution of drug offenders, we have worked out intensive drug abuse awareness and sensitisation programmes targeting different groups, with an emphasis on youths."
  },
  {
    "headline": "Army Chief Orders Destruction of All Boko Haram, ISWAP Enclaves in North-east",
    "summarized_story": "The army chief also declared that traditional institutions were critical to bringing the insurgency war to an end.\nA statement issued by the Nigerian Army Headquarters said the army chief ordered troops of Sector 2 Joint Task Force North-east Operation Hadin Kai to destroy all Boko Haram and Islamic State West Africa Province (ISWAP) enclaves in their various locations.\nAmong the dignitaries, who accompanied the COAS were the Chief of Operations (Army) Major General Ibrahim Yusuf and the Theatre Commander Operation Hadin Kai, Major General Christopher Musa.\nMeanwhile, the army chief said traditional institutions were critical to the success of ongoing operation to end Boko Haram insurgency and terrorism in the North-east.\nMeanwhile, the Nigerian Air Force yesterday denied that the Nigerian Air Force Base, Kaduna, was attacked by Boko Haram."
  },
  {
    "headline": "NEITI: $584m Oil, Gas Deals Sealed in Asset Ownership Changes in 2019",
    "summarized_story": "Besides, Nigerian Petroleum Development Company (NPDC) acquired OML 11, formerly operated by Shell Petroleum Development Company (SPDC), in a contract totalling $456.03 million.\nDuring the year under review, seismic data acquisition was up by 348 per cent, field development plans 65 per cent, well activities 45 per cent, while gas development plan was down by 75 per cent, with six approved for 2019, as opposed to 24 in 2018.\nSeplat was next with 7 million barrels, followed by SNEPCo, with 3.8 million barrels.\nIn addition, NPDC and Neconde suffered losses and subsequent deferment of 3.7 million barrels, Newcross’ was 3.2 million barrels, Aiteo deferred 2.84 million barrels, Energia’s share of deferment was 1.7 million barrels, while APDNL’s loss was 733,000 barrels during the year.\nAll deferred production amounted to 55.2 million barrels while there were 1,387 pipeline breaks, with Mosimi recording the highest with 637 breaks, followed by Port Harcourt, 536, and Warri with 96 breaks."
  },
  {
    "headline": "Investigation: How Yakubu Dogara, UBEC Squandered N1 Billion Model School Projects",
    "summarized_story": "“I tabled all the challenges faced in the school and how the school is on the verge of total collapse.\n“See how bad the school looks,” said exasperated Mr Emmanuel Barau, head of sciences laboratory in the school.\nYakubu Dogara will come and see for himself and then tell the public how proud he is of the school,” Mr Bature said.\n“We were only given 80 pieces of 40 leaves exercise books in a school of 398 students,” Mrs Daniel continued.\nContractors Operate in the ShadowThe contractors that executed the N1 billion Dogara Models Schools project mostly operate in the shadow as no trace of their offices in either Bauchi, the seat of government or at Dogara’s constituency."
  },
  {
    "headline": "Investigation: How Yakubu Dogara, UBEC Squandered N1 Billion Model School Projects",
    "summarized_story": "“I tabled all the challenges faced in the school and how the school is on the verge of total collapse.\n“See how bad the school looks,” said exasperated Mr Emmanuel Barau, head of sciences laboratory in the school.\nYakubu Dogara will come and see for himself and then tell the public how proud he is of the school,” Mr Bature said.\n“We were only given 80 pieces of 40 leaves exercise books in a school of 398 students,” Mrs Daniel continued.\nContractors Operate in the ShadowThe contractors that executed the N1 billion Dogara Models Schools project mostly operate in the shadow as no trace of their offices in either Bauchi, the seat of government or at Dogara’s constituency."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Security Operatives Shoot Students Protesting Tuition Hike In Kaduna",
    "summarized_story": "Many students of the Kaduna State College of Education, Gidan Waya, Jema’a Local Government Area of Kaduna State, were on Monday shot by security operatives, SaharaReporters has gathered.\nThe students were protesting over hike in school fees, when the security operatives made attempts to use to force to disperse them.\n“We came out to protest over the increase of school fees when we met security operatives outside.\nThey started shooting us, some of our colleagues are dead now,” a student told SaharaReporters.\nHe added that some students were also arrested and taken away by the police."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Security Operatives Shoot Students Protesting Tuition Hike In Kaduna",
    "summarized_story": "Many students of the Kaduna State College of Education, Gidan Waya, Jema’a Local Government Area of Kaduna State, were on Monday shot by security operatives, SaharaReporters has gathered.\nThe students were protesting over hike in school fees, when the security operatives made attempts to use to force to disperse them.\n“We came out to protest over the increase of school fees when we met security operatives outside.\nThey started shooting us, some of our colleagues are dead now,” a student told SaharaReporters.\nHe added that some students were also arrested and taken away by the police."
  },
  {
    "headline": "'Total fabrication' -- Ngige faults outcome of Anambra APC guber primary",
    "summarized_story": "Chris Ngige, minister of labour and productivity, has faulted the outcome of the All Progressives Congress (APC) governorship primary election conducted in Anambra, on Saturday.\nAdvertisementOn Sunday, Dapo Abiodun, governor of Ogun state and chairman of the APC primary election committee, announced that Andy Uba, a former senator, won the primary election.\nEarlier on Saturday, 11 of the 14 governorship aspirants of APC in Anambra had claimed that the June 26 primary in the state did not hold.\nAdvertisementSpeaking on the development on Monday in an interview with Channels TV, Ngige alleged that the outcome of the primary announced by the Ogun governor was a “total fabrication”.\nWhen confronted that the outcome of the primary was announced by the Ogun governor, he said: “That is a total fabrication."
  },
  {
    "headline": "'Total fabrication' -- Ngige faults outcome of Anambra APC guber primary",
    "summarized_story": "Chris Ngige, minister of labour and productivity, has faulted the outcome of the All Progressives Congress (APC) governorship primary election conducted in Anambra, on Saturday.\nAdvertisementOn Sunday, Dapo Abiodun, governor of Ogun state and chairman of the APC primary election committee, announced that Andy Uba, a former senator, won the primary election.\nEarlier on Saturday, 11 of the 14 governorship aspirants of APC in Anambra had claimed that the June 26 primary in the state did not hold.\nAdvertisementSpeaking on the development on Monday in an interview with Channels TV, Ngige alleged that the outcome of the primary announced by the Ogun governor was a “total fabrication”.\nWhen confronted that the outcome of the primary was announced by the Ogun governor, he said: “That is a total fabrication."
  },
  {
    "headline": "'It's unlawful' -- PDP cautions Matawalle against defecting to APC",
    "summarized_story": "The Peoples Democratic Party (PDP) has cautioned Bello Matawalle, governor of Zamfara, against defecting to the All Progressives Congress (APC).\nThe PDP warned Matawalle against the decision, adding that his position as governor will become vacant if he defects to the APC.\nAdvertisement“The Peoples Democratic Party (PDP) is watching developments in Zamfara state as they concern reports of plans by the state governor, Bello Matawalle, to cross over to the All Progressives Congress (APC),” the PDP said.\nAdvertisement“The decision is in line with the provision of Section 29 (2)(b) of the PDP Constitution 2017 (as amended).\nAll party leaders, critical stakeholders and teeming members of our party in Zamfara state should, by this, be guided accordingly,” Ologbondiya added."
  },
  {
    "headline": "'It's unlawful' -- PDP cautions Matawalle against defecting to APC",
    "summarized_story": "The Peoples Democratic Party (PDP) has cautioned Bello Matawalle, governor of Zamfara, against defecting to the All Progressives Congress (APC).\nThe PDP warned Matawalle against the decision, adding that his position as governor will become vacant if he defects to the APC.\nAdvertisement“The Peoples Democratic Party (PDP) is watching developments in Zamfara state as they concern reports of plans by the state governor, Bello Matawalle, to cross over to the All Progressives Congress (APC),” the PDP said.\nAdvertisement“The decision is in line with the provision of Section 29 (2)(b) of the PDP Constitution 2017 (as amended).\nAll party leaders, critical stakeholders and teeming members of our party in Zamfara state should, by this, be guided accordingly,” Ologbondiya added."
  },
  {
    "headline": "NPHCDA: Nigeria has highest COVID vaccination rate in Africa",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) says Nigeria has the highest COVID-19 vaccination rate in Africa.\nAdvertisementFaisal Shuaib, executive director of NPHCDA, stated this at the media briefing of the presidential steering committee (PSC) on COVID-19 in Abuja on Monday.\nAccording to Shuaib, an average of 87,000 people are being vaccinated daily in Nigeria.\nAdvertisementHe said with the figure, Nigeria has surpassed Egypt, South Africa, Ghana, and Senegal in its vaccination rate in the continent.\n“Based on these data and comparative information from other countries, Nigeria continues to have the highest vaccination rates in Africa with approximately 87,000 people being vaccinated daily."
  },
  {
    "headline": "Jiji acquires Cars45 as it expands beyond its classifieds model",
    "summarized_story": "Africa’s leading classified marketplace Jiji has acquired Cars45, Nigeria’s leading automotive trading platform.\nHowever, we’re primarily interested in deals like Cars45, where we bring our leadership positions from classifieds and acquire very close business models that give us exposure to the transactional marketplace.\nIt will also give Jiji an upper hand in consolidating its position as the classifieds marketplace leader.\nThe acquisition of Cars45 will help reduce this risk, as it offers a different car buying and selling experience via a transactional marketplace model.\nUnlike a classifieds marketplace where checks are inadequately carried out, transactional models employed by platforms like Cars45 ensure quality checks and detailed reports on a car’s condition with various databases."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Nigeria’s slowing inflation leaves investors little to cheer",
    "summarized_story": "For the first time in two years, Nigeria’s inflation rate slowed for the second successive month in May.\nThe slowdown however does not provide much relief to fixed income-investors reeling from a negative real return.\nWhile the slowdown is good news for investors as it tends to increase real return on investment, the decline in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s urea production gains global recognition on Dangote’s influence",
    "summarized_story": "With the coming on stream of Dangote Fertilizer Limited, global urea capacity is poised to see considerable growth over the coming years.\nThis could move from 222.96 million tons per annum (mtpa) in 2020 to 305.92 mtpa in 2030, registering a total growth of 37 percent, according to a Global Data report.\n“Major capacity additions will be from two planned plants Dangote Group Lekki Urea Plant 1 and Dangote Group Lekki Urea Plant 2 with a capacity of 1.50 million tons each by 2030,” it added.\nDangote Fertilizer plant has however placed Nigeria in the third position among other countries, like Iran and India that will lead in global urea capacity growth by 2030.\nThe Dangote Fertilizer complex consists of Ammonia and Urea plants."
  },
  {
    "headline": "Explainer: What it costs to make a national passport",
    "summarized_story": "Ever wondered why it costs so much to get a national passport not just in Nigeria but across the world, even though the product is 98 percent paper component?\nPassports around the world cost different amounts, depending on which country one lives in, but grant freedom to travel throughout the world.\nFirst, some passports are…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki approves upward review of duty allowance for Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the immediate increase of Duty Tour Allowance (DTA) for workers in the state, across board.\nThe Edo State Head of Service, Anthony Okungbowa Esq., disclosed this during a meeting with Permanent Secretaries, Heads of Ministries, Departments and Agencies (MDAs) and Directors in the Public Service, held at the Government House, Benin City.\nOkungbowa reassured that the Governor Obaseki-led administration remains committed to sustaining reforms and programs aimed at improving the lives of Edo people.\nIn their response, the various Heads of Ministries and Extra Ministerial Departments, including the Auditor General of the State, Mr. B.E.\nAigbe, hailed the governor for his administration’s commitment to the welfare of workers in the state, pledging their support."
  },
  {
    "headline": "Obaseki targets top spot in Africa’s tech market – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has restated his government’s plan to place the state on the top spot of emerging technology markets in Africa.\n“We are grateful for the assistance given to the state in tackling human trafficking, which has been a burden on us.\nWe have made considerable progress that has led to taming the tide of human trafficking and discouraging our youths from taking dangerous journeys abroad.\n“Your cooperation in the investigation and prosecution of offenders of human trafficking is encouraging, especially working with the state’s task force.\nEarlier, the deputy British high commissioner said, “I am happy to be in Edo State."
  },
  {
    "headline": "Obaseki expands EdoBEST programme to capture secondary schools, tertiary institutions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, expanded the Edo Basic Education Sector Transformation (EdoBEST) programme to capture secondary schools and tertiary institutions in the state.\nObaseki, at the inauguration of EdoBEST 2.0, at the Government House, in Benin City, said the expansion became necessary to ensure that secondary schools and tertiary institutions in the state benefit from the gains in digital teaching recorded in primary schools through the EdoBEST programme, which was inaugurated in 2018.\nAccording to him, “As far as we are concerned in the state, the EdoBEST programme is one of our greatest achievements.\nSo, today we are going to unveil the EdoBEST 2.0, as a way to ensure that the gains of learning at the basic education level is sustained after the first six years.\nEarlier, in her welcome address, a pupil of Iguodala Primary School, Stephanie Osewengie, commended Governor Obaseki for improving the standard of education in Edo State, especially the basic education."
  },
  {
    "headline": "Edo First Lady hosts reception for couple left stranded by Marriage Court Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State First Lady, Mrs. Betsy Obaseki, at the weekend, organised a wedding reception for Mr. and Mrs. Abel Eromosele Ugiagbe, the couple whose marriage ceremony was disrupted by the absence of the Registrar of the Federal Marriage Registry, in Benin City, Edo State.\nMrs. Obaseki said her decision to host the reception for the couple was to ease the pain they went through following the disappointment on their wedding day, adding that the compassionate nature of Mr. Abel Eromosele Ugiagbe who felt bad that the registrar lost his job drew her closer to the couple.\nShe noted, “After I confirmed the report as true, I called my friend and wife of the Minister for Interior, Mrs. Aregbesola who briefed her husband about the development.\nThe Minister apologized to the couple.\nOsaigbovo Iyoha, congratulated the couple on the success of their wedding despite the disappointment they experienced over the failure of the Registrar of the Federal Marriage to show up for the marriage."
  },
  {
    "headline": "Join APC, lose your seat, PDP warns Gov Matawalle",
    "summarized_story": "The Peoples Democratic Party (PDP) has cautioned the Zamfara State Governor, Bello Matawalle, against defecting from the party to the All Progressives Congress (APC), saying he risks losing his seat.\nShould Mr Matawalle finally join the APC, he would be the third PDP governor to join the APC in the past seven months.\nThe Peoples Democratic Party (PDP) is watching developments in Zamfara state as they concern reports of plans by the state governor, Bello Matawalle, to cross over to the All Progressives Congress (APC).\nThe PDP hopes that Bello Matawalle as well as members of the National and State Assembly from Zamfara state will take caution.\nThe decision is in line with the provision of Section 29 (2)(b) of the PDP Constitution 2017 (as amended)."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Federal Govt Loses N5bn Revenue To importers Through Wrong Declarations",
    "summarized_story": "The development has led to the huge revenue loss by the federal government through evasion duty payment with the support of Custom officers to the detriment of the nation’s economy and local investors.\nCode 7210.4100.00 and 7210.4910.00 for corrugated roofing sheets in a ship with the name, AMIX ELEGANCE, which arrived at Apapa Port in Lagos late last month.\nOur question is that, are there no competent custom officers who can differentiate between raw materials and finished products?\nIn addition, are there nobody to inspect the ship at the point of loading to ascertain the items as contained in the manifests?\nLtd, Kinshimo Enterprises, Metalberg Manufacturing, Panda Industries fze and Steel Line Industries."
  },
  {
    "headline": "Federal Govt Loses N5bn Revenue To importers Through Wrong Declarations",
    "summarized_story": "The development has led to the huge revenue loss by the federal government through evasion duty payment with the support of Custom officers to the detriment of the nation’s economy and local investors.\nCode 7210.4100.00 and 7210.4910.00 for corrugated roofing sheets in a ship with the name, AMIX ELEGANCE, which arrived at Apapa Port in Lagos late last month.\nOur question is that, are there no competent custom officers who can differentiate between raw materials and finished products?\nIn addition, are there nobody to inspect the ship at the point of loading to ascertain the items as contained in the manifests?\nLtd, Kinshimo Enterprises, Metalberg Manufacturing, Panda Industries fze and Steel Line Industries."
  },
  {
    "headline": "Nigeria’s First Ivy League School Opens In Abuja",
    "summarized_story": "The Aretean, Nigeria’s first Ivy League College is set to begin academic activities in Abuja with a Summer Camp on July 5.\nThe school runs a British/Nigeria academic curriculum and leadership courses “that expose the students to a complete circle of training and development.”The college with a world-class hostel facility has qualified teaching and non-teaching staff, including renowned British and African scholars.\nAddressing selected journalists in Abuja ahead of the official opening of the College, the Proprietress, Uloma Nwosu-Rochas, said the idea of the school was to bring back culture to the educational system, “where it is not just about education but character and culture.”According to her, “the Aretean is set to breed a whole new generation of leaders by reinforcing the need for responsibility, character and intelligence.”She disclosed that the school is affiliating with some renowned Colleges in the UK and will be carrying out exchange programmes.\nAlso while visiting the College, former Liberian President, Helen Johnson-Sirleaf, described it as an impactful initiative that will produce a complete African child that will provide leadership which will propel the continent to global reckoning.\nThe first African female President noted further that education is about the only tool that can liberate and lift up Africa, adding that the idea of impacting leadership skills in students at early years will ensure the emergence of great leaders that can compete with their contemporaries across the world."
  },
  {
    "headline": "Nigeria’s First Ivy League School Opens In Abuja",
    "summarized_story": "The Aretean, Nigeria’s first Ivy League College is set to begin academic activities in Abuja with a Summer Camp on July 5.\nThe school runs a British/Nigeria academic curriculum and leadership courses “that expose the students to a complete circle of training and development.”The college with a world-class hostel facility has qualified teaching and non-teaching staff, including renowned British and African scholars.\nAddressing selected journalists in Abuja ahead of the official opening of the College, the Proprietress, Uloma Nwosu-Rochas, said the idea of the school was to bring back culture to the educational system, “where it is not just about education but character and culture.”According to her, “the Aretean is set to breed a whole new generation of leaders by reinforcing the need for responsibility, character and intelligence.”She disclosed that the school is affiliating with some renowned Colleges in the UK and will be carrying out exchange programmes.\nAlso while visiting the College, former Liberian President, Helen Johnson-Sirleaf, described it as an impactful initiative that will produce a complete African child that will provide leadership which will propel the continent to global reckoning.\nThe first African female President noted further that education is about the only tool that can liberate and lift up Africa, adding that the idea of impacting leadership skills in students at early years will ensure the emergence of great leaders that can compete with their contemporaries across the world."
  },
  {
    "headline": "Police Parade Suspects Who Stole N23m Cash At Borno Secretariat",
    "summarized_story": "The Borno State Police Command has paraded five suspects, who confessed to stealing N23million cash from a parked vehicle at the Musa Usman Secretariat in Maiduguri, the state capital.\n“The suspects were trailed and arrested by crack operatives at different cities namely Maiduguri, Jos, Kano and Jalingo in Taraba State.\n“They equally confessed to carrying out these dastardly acts in Kano, Abuja, Sokoto, Zamfara, Jigawa, Jos, Yola, Damaturu and Jalingo.\n“Exhibit Recovered: 1005kg of dried leaves suspected to be Cannabis Sativa.\nAll suspects will be charged to court at the conclusion of investigations,” Okon added."
  },
  {
    "headline": "Alleged N24.6m Fraud: EFCC Arraigns Benue University Hospital Chairman, Others",
    "summarized_story": "They allegedly obtained the said sum from the Benue State University Teaching Hospital under the guise of purchasing a Toyota Landcruiser Prado 2018 Model which they never did.\nThe offence is contrary to Section 8(a) of the Advance Fee Fraud and Other Fraud Related Offences Act, 2006 and punishable under section 1(3) of the same Act.\nHowever, counsel to the 1st defendant: S. O. Vekuwu moved a motion for the bail of his client on self-recognizance.\nHe informed the Court that his client had been on administrative bail offered by the EFCC.\nJustice Dogo, after listening counsel, admitted the defendants to bail in the sum of N10million each with one surety in like sum."
  },
  {
    "headline": "Alleged N24.6m Fraud: EFCC Arraigns Benue University Hospital Chairman, Others",
    "summarized_story": "They allegedly obtained the said sum from the Benue State University Teaching Hospital under the guise of purchasing a Toyota Landcruiser Prado 2018 Model which they never did.\nThe offence is contrary to Section 8(a) of the Advance Fee Fraud and Other Fraud Related Offences Act, 2006 and punishable under section 1(3) of the same Act.\nHowever, counsel to the 1st defendant: S. O. Vekuwu moved a motion for the bail of his client on self-recognizance.\nHe informed the Court that his client had been on administrative bail offered by the EFCC.\nJustice Dogo, after listening counsel, admitted the defendants to bail in the sum of N10million each with one surety in like sum."
  },
  {
    "headline": "BET Awards: Fans celebrate Burna Boy for three consecutive wins",
    "summarized_story": "Grammy award-winning singer, Damini Ogulu, popularly known as Burna Boy, has won the award for Best International Act at the 2021 BET Awards show, making it his third consecutive win.\nBurna Boy had won the Best International Act category at BET Awards in 2019 and 2020.\nA tweep, @opresii, wrote, “Burna Boy won BET Best International Act Africa for the 3rd time in a row last night.\nA true African Giant.”Another tweep @joeyakan, said, “Congratulations to Burna Boy for his third straight win of the BET Best International Act award.\nDope artist.”(sic)A Twitter user, @pengmanmodel tweeted, “Burna Boy dey try!"
  },
  {
    "headline": "BET Awards: Fans celebrate Burna Boy for three consecutive wins",
    "summarized_story": "Grammy award-winning singer, Damini Ogulu, popularly known as Burna Boy, has won the award for Best International Act at the 2021 BET Awards show, making it his third consecutive win.\nBurna Boy had won the Best International Act category at BET Awards in 2019 and 2020.\nA tweep, @opresii, wrote, “Burna Boy won BET Best International Act Africa for the 3rd time in a row last night.\nA true African Giant.”Another tweep @joeyakan, said, “Congratulations to Burna Boy for his third straight win of the BET Best International Act award.\nDope artist.”(sic)A Twitter user, @pengmanmodel tweeted, “Burna Boy dey try!"
  },
  {
    "headline": "PDP threatens Matawalle: We shall meet in court",
    "summarized_story": "By AbankulaThe Peoples Democratic Party resorted to threats and blackmail on Monday in an effort to stop Governor Bello Matawalle of Zamfara from defecting to the All Progressives Congress tomorrow..\nThe National Working Committee warned Matawalle that he will lose his seat upon defection.\nThe NWC also dissolved its executive in Zamfara State, since it appears members are switching to the APC, with Matawalle.\nNWC’s position on Matawalle was hypocritical as the party openly welcomed Governor Godwin Obaseki, then an APC governor to the party.\nThe party also did not threaten court actions against Dave Umahi of Ebonyi and Ben Ayade of Cross River, who dumped the party for APC earlier."
  },
  {
    "headline": "Seven deadly robbers, two drug traffickers nabbed in Borno",
    "summarized_story": "By Yakubu UbaThe Borno State Police Command on Monday paraded nine persons suspected for robbery and drug trafficking.\nOkon said the police recovered one black Golf Saloon vehicle with registration number ASU 230 MU, two POS machines and other accessories from the suspects.\nIn a separate operation, Okon said the police also arrested five members of a criminal syndicate that specialized in trailing and stealing from bank customers.\n“The suspects were trailed and arrested by a crack team of operatives at different cities namely; Maiduguri, Jos, Kano and Jalingo, in Taraba State.\n“They equally confessed to carrying out similar dastardly acts in Kano, Abuja, Sokoto, Zamfara, Jigawa, Jos, Yola, Damaturu and Jalingo,” Okon said."
  },
  {
    "headline": "Five top Sokoto govt officials in N553.9m Pension scandal, docked by EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Monday, arraigned five senior officials of the Sokoto State Primary Education Staff Pension Board before the Sokoto State High Court, on a 27-count charge bordering on alleged conspiracy, forgery, criminal breach of trust and misappropriation of the sum of N553,985,624.10.\nThey were arraigned before Justice Muhammad Muhammad.\nThe defendants include the Director of Finance and Supply, Hassana Moyi; Secretary, Abubakar Aliyu; Deputy director, Halliru Ahmed; Accountant, Kabiru Ahmed and Dahiru Muhammad Isa, Cashier.\nConsequently, the prosecution counsel, S. H Sa’ad, prayed the court to fix a trial date and order accelerated hearing of the matter.\nBut he denied receiving the money, and also disowned the signature on the voucher."
  },
  {
    "headline": "I Regret Killing Him, Please Forgive Me – Chidinma Begs Mr Ataga’s Family",
    "summarized_story": "Chidinma Ojukwu, a 21-year-old University of Lagos Mass Communication student who confessed to stabbing Super TV’s Chief Executive Officer, Usifo Ataga, to death, has expressed regret and appealed for her life to be spared.\nOn June 13, Super TV’s CEO was reported missing in Banana Island by friends and family who were unable to locate him.\nAfter all attempts to contact Usifo Ataga proved impossible, his wife and children in Abuja became even more concerned.\nDuring interrogation, Chidinma admitted to stabbing Ataga several times because he insisted on having sex with her, which she refused.\nShe asked for mercy from the Ataga family in her interview with Punch."
  },
  {
    "headline": "Ex-Nigerian Leader Who Oversaw Biafran War, Gowon Leads Prayer Against Insecurity, Others In Nigeria",
    "summarized_story": "Gowon made the statement at the Calvary Life Assembly in Nomansland, Kano, during a one-day prayer rally to seek God’s intervention.\n“Our gathering in Kano today is an expression of our love and faith in our country Nigeria for God to hear our prayer and heal the land.\n“We are bringing before our Lord the myriads of our problems: insecurity, banditry, murders, political, economic and social problems.\nLord, heal our nation and heal us individually and collectively,” Gowon, who is the chairman and convener of Nigeria Prays, said.\nAs Head of State, Gowon presided over the controversial Nigerian Civil War in 1967."
  },
  {
    "headline": "Many Feared Dead As Explosion Rocks Benue Community (Photos)",
    "summarized_story": "A fuel tanker explosion in the Amoke village of Apa Local Government Area in Benue State is said to have killed dozens of people.\nAccording to News Direct, the event occurred on Monday morning when a vehicle transporting petroleum product caught fire in the region.\nHe said the incident caused panic in the area and brought commercial activity to a halt.\nWhile verifying the event to newsmen, Yakubu Mohammed, the Corps Commander of the Federal Road Safety Commission (FRSC) in Benue State, stated only three people were killed.\nHe added that the fire was extinguished after many hours and that there was no Fire Department stationed near the incident."
  },
  {
    "headline": "CBN To Release 50,000 MT Of Maize To Farmers",
    "summarized_story": "Under the Anchor Borrowers’ Programme, the Central Bank of Nigeria has approved the transfer of 50,000 metric tonnes of maize from the strategic maize reserve to 12 key producers.\nAccording to the CBN, the third such transfer of maize to enterprises will lower the price of grain in the market by limiting the actions of middlemen who are hoarding the goods and creating artificial scarcity.\nA statement issued by the apex bank on Monday read, “The Central Bank of Nigeria, in its bid to moderate and control the prices of maize in the Nigerian market, has approved the release of 50,000 metric tonnes of maize to 12 major producers, from strategic maize reserve under the Anchor Borrowers’ Programme.\nHe also promised that Nigerian farmers will keep the prices of their crops reasonable.\nIt will be noted that earlier this month, the CBN cooperated with the Rice Farmers Association of Nigeria to give 27,000 metric tonnes of rice paddy directly to millers throughout the country in an effort to reduce rising food costs in the Nigerian market."
  },
  {
    "headline": "Shinkafi, ciyamomin APGA 14 da na mazaɓu 147 sun bar APGA zuwa APC a Zamfara",
    "summarized_story": ""
  },
  {
    "headline": "Sun harbe mai juna-biyu sun yi garkuwa da mijinta a Kwara",
    "summarized_story": ""
  },
  {
    "headline": "IPMAN ta musanta shirin tafiya yajin aiki",
    "summarized_story": ""
  },
  {
    "headline": "Gobe Talata Matawalle zai yi bikin komawa APC",
    "summarized_story": ""
  },
  {
    "headline": "Zamfara: PDP cautions Matawalle, NASS, SHoA members against defection -NigPilot",
    "summarized_story": "The national leadership of the Peoples Democratic Party, PDP, has warned Governor Bello Matawalle of Zamafara State and all lawmakers from the state against defection to the All Progressives Congress, APC.\nOlogbondiyan declared that there is no division in the PDP to warrant defection of any of their lawmakers.\nThe PDP expressed hope that Governor Matawalle as well as members of the National and State Assembly from Zamfara state will take caution.\nMeanwhile, the National Working Committee (NWC) of the party has approved the dissolution of the Zamfara State Executive of the party.\nThe decision is in line with the provision of Section 29 (2)(b) of the PDP Constitution 2017 (as amended)."
  },
  {
    "headline": "Nigerian Navy conducts clearance operation in Baga -NigPilot",
    "summarized_story": "The Special Boat Service personnel of the Naval Base Lake Chad (NBLC) in conjunction with personnel of the 403 Special Force Amphibious Brigade and Civilian Joint Task Force (CJTF) have conducted a clearance/ recovery operation at Baga, in Borno State.\nDirector Naval Information, Commodore Suleman Dahun in a statement said the operation was led by the Commander NBLC, Commodore Alexander Bingel.\nAccording to the statement, “The operation, which lasted for 4 days covered Federal College of Freshwater Fisheries Technology (FCFFT), Doro Baga, Tangon guava, Kwatan gaba, and Kwatan kuyet , was successfully executed and resulted in the recovery of a box of 40mm Automatic Grenade Launcher (AGL) balls”.\nWhile appreciating the combat vigor and resilience of the troops, Commander NBLC, Commodore Bingel commended the troops for their discipline, courage, doggedness, and cooperation towards the success of the operation.\nThe Naval Spokesperson said that the troops, not swayed by the success of the operation, projected further to ensure no elements of ISWAP terrorists were left within the area."
  },
  {
    "headline": "Senegalese Armed Forces seeks defence cooperation with Nigeria -NigPilot",
    "summarized_story": "The Senegalese Armed Forces are seeking enhanced Defence Cooperation with Nigeria to tackle insurgency and terrorism in the West African sub-region.\nHe outlined various opportunities that abound in the Armed Forces Military training Institutions in Nigeria, which he assured that are available for Senegalese candidates to buy into for enhanced combat efficiency.\nWhile sharing his experience as ECOMOG Commander 15 Brigade with the Inspector General of the Senegalese Armed Forces who coincidentally participated in the regional operational combat in Liberia, the Minister indicated the readiness of the Nigerian Armed Forces in giving support towards raising the standard of the Senegalese Armed Forces Staff College when called upon to render such service.\nGeneral Niang, therefore, sought for enhanced existing Military cooperation with Nigeria in the efforts of the Senegalese Armed Forces to fully professionalise.\nHe thanked the Minister of Defence for the audience and assured him of continuous cooperation of the Armed Forces of Senegal with the Nigerian Counterpart in the areas deemed necessary bilaterally."
  },
  {
    "headline": "Senate uncovers illegal payment of N38bn as salaries by NSITF",
    "summarized_story": "The discovery of illegal payment of salaries was contained in the 2018 report of the Auditor General for the Federation, AuGF submitted to the committee, chaired by Senator Mathew Urhoghide (PDP Edo South) after it queried the agency.\nThe query reads: “Audit observed that the Fund (NSITF) had been implementing a salary structure that is not approved by the National Salaries, Income and Wages Commission.\nHowever, when the committee looked at the letter from the commission on the illegal, it was observed that the letter was written five years after the commission started paying the salaries.\nThe panel further discovered in the letter from the commission that an objection was raised about the payment of unapproved salaries by it.\n“The (management of the) Fund is, therefore, advised to arrange a meeting of the fund, it’s supervising ministry and this Commission to rectify these anomalies before the next promotion exercise.”The Senate panel, thereafter, sustained the AuGF’s query of illegal payment of salaries by the NSTIF."
  },
  {
    "headline": "Osinbajo Blames Corruption For Poor Contract Negotiations In Nigeria",
    "summarized_story": "Emperor Simon, AbujaVice-President Yemi Osinbajo on Monday blamed corruption and lack of transparency, among other factors, for poor contract negotiations in Nigeria.\nThe Vice President made the comment while addressing a two-day capacity building workshop for negotiators.\nThe workshop, organised by the Independent Corrupt Practices and Other Related Offences Commission (ICPC) in Abuja, seeks to help Nigeria improve its terms of engagement with the rest of the world as part of efforts to stem illicit financial flows.\nVice-President Osinbajo cited the P&ID case and the Strategic Alliance Contract case where Nigeria is at risk of losing billions of dollars due to poor and shrewd negotiations of the contracts.\nHe called for proper negotiation by Nigeria in the ongoing discussion on climate change which he says should put into consideration Nigeria’s peculiar economic situation and needs of the citizens."
  },
  {
    "headline": "CJN Swears-In 18 Court Of Appeal Judges",
    "summarized_story": "The Chief Justice of Nigeria, Ibrahim Tanko Muhammad on Monday swore in 18 judges to the Court of Appeal.\nAddressing the newly-sworn judges, Justice Tanko asked the judges to conduct their affairs within the ambit of the law and the oath of office administered on them.\nHe reminded them that all eyes were on them and that they should avoid temptations, as their integrity was key.\nAccording to the CJN, there is nothing that is done in secret that will not see the light of day.\nHe said the judges must give a good conduct of themselves, be fair and just, to justify their elevation to the position of Court of Appeal judges“Many high profile cases will definitely come to you on appeal,” the Chief Judge said."
  },
  {
    "headline": "INEC Commences Online Registration For Voters",
    "summarized_story": "The Independent National Electoral Commission (INEC) has commenced the online continuous voter registration exercise where intending voters can register before they complete the process at a designated centre.\nOn the INEC portal new voters, as of Monday, can pre-register while those who have registered in the past can access the platform to review their voter registration status.\nSome of the features on the portal includes the ability to update personal information or transfer voter registration to another polling unit.\nRegistered voters can also request for replacement of damaged or defaced Permanent Voters’ Cards (PVC) on the portal.\nAt the INEC offices, which they can visit from July 19, they will be requested to provide fingerprints to complete the registration."
  },
  {
    "headline": "Mining: Governor Ishaku Calls For Constitution Review",
    "summarized_story": "Taraba state Governor Darius Ishaku has called for constitutional review as it concerns mining rights.\nMining is currently mostly under the Federal Government’s control under the law, but the Governor believes the exclusivity is worrisome and should be reviewed to promote development of the sector.\nAccording to him, Governors across the country have proffered solutions to the Federal government in order to have a win-win situation, but the Federal Government has paid deaf ears to their suggestions.\nThe Governor made the comment while inaugurating the Governing Council of the Taraba State College of Agriculture at the Government House in Jalingo on Saturday.\nThe exclusivity of mining to the Federal Government is one of those things that people who are calling for the review of the constitution, among the several."
  },
  {
    "headline": "One Killed As Students Protest Over Tuition Fee Increase In Kaduna",
    "summarized_story": "A student of the College of Education, Gidan Waya in Jemaa Local Government Area of Kaduna State, has been shot and killed following a protest that turned violent in the school.\nThe students were said to have embarked on a protest on Monday over the increase of tuition fees by the management of the institution.\nConfirming the incident, the spokesman of the Kaduna State police command, Mohammed Jalige, said the protesters blocked the convoy of a military sector Commander, injuring him and one other person.\nMeanwhile, the Kaduna State Government says it is awaiting full reports on the protest by students of the State College of Education, Gidan Waya.\nAruwan however, said the government is awaiting briefings to enable it to understand the circumstances surrounding the unfortunate violent incidence in Gidan Waya."
  },
  {
    "headline": "Kaduna announces fourth cohort of Kashim Ibrahim fellowship",
    "summarized_story": "Remarks by Malam Nasir El-Rufai, Governor of Kaduna State, at the announcement of the fourth Cohort of the Kashim Ibrahim Fellowship; held at Sir Kashim Ibrahim House, on Monday, 28th June 2021The Kashim Ibrahim Fellowship is fulfilling our aspirations as a platform for building leadership capacity and public service orientation in our young people.\nThe third cohort of the Kashim Ibrahim Fellowship will shortly be graduating, after which the fourth cohort that has just been unveiled will resume for their 12-month programme.\nAdvertisementMembers of the fourth cohort that has just been unveiled can be proud of themselves.\nAnd we initiated the Kashim Ibrahim Fellowship to help widen the pool of young persons whose leadership ability we can help develop and nurture.\nI wish to thank all the members of the Governing Board for an excellent job in running the Kashim Ibrahim Fellowship."
  },
  {
    "headline": "House of Reps northern caucus promises to back PIB passage",
    "summarized_story": "The Northern caucus of the House of Representatives on Monday rose from a retreat with a resolve to support the passage of the Petroleum industry bill.\nThe retreat of the House of Reps Northern Caucus also advocated for the development of frontier basins across the country in order to expand the region’s revenue base.\nThe Northern legislators also emphasized the PIB in its present form has a good fiscal framework.\nThe Secretary to the Government, Boss Mustapha of the Federation, Boss Mustapha, seeks a PIB that will put the nation on the path of economic recovery.\nFormer Minister of Agriculture, Audu Ogbeh, however called on the Northern legislators to be vigilant so as not to support a restructured Nigeria that will not be favourable to the North."
  },
  {
    "headline": "We Are Committed To Improving Girl Child Education – Sultan of Sokoto",
    "summarized_story": "The Sultan of Sokoto says he is committed to promoting and supporting girl-child education until the desired height is achieved.\nThe Sultan spoke in his palace in Sokoto when a delegation of the UNICEF from both Abuja, Kano and Sokoto paid him a courtesy visit.\nAdvertisementThe Sultan says the people of Sokoto will miss the UNICEF Chief of Field Office Sokoto Mohameden Fall who will be leaving Sokoto as he retires from service.\nSultan described Mr. Fall as a friend who they had good working relationship with while carrying out his responsibility in Sokoto.\nChief, Field Coordination Services and Chief of UNICEF Field Office Kano; Ms. Raganai Matema, Health Manger, Sokoto Field Office; Paula, Health Section Abuja and Mr Samuel, Kaalu the new UNICEF Information Officer:"
  },
  {
    "headline": "Nigeria: Two Soldiers Killed as Troops Neutralise 12 Suspected Terrorists in Northeast Borno",
    "summarized_story": "Nigeria’s military says its troops have killed 12 suspected Boko Haram and Islamic State West Africa Province members during a gun duel in Borno State, the epicentre of insurgency in the West African country.\nThe military said the gunfight was in conjunction with the Air Component of Operation Hadin Kai.\nHe added that a Gun Truck, one Self Propelled Gun-9, one Dushika Gun and one mounted QJC Machine Gun, one Light Machine Gun and five AK 47 Rifles were recovered from the terrorists.\nThe troops gallantly captured one Gun Truck, one Self Propelled Gun-9, one Dushika Gun and one mounted QJC Machine Gun.\nOther items captured are one Light Machine Gun and five AK 47 Rifles."
  },
  {
    "headline": "Increased ‘Brutal Crackdown’ on Protesters in Zambia, Amnesty Says",
    "summarized_story": "Amnesty International has expressed concern over Zambia’s deteriorating human rights record ahead of the 12 August election.\nAccording to the rights group, the past five years have seen “an increasingly brutal crackdown on human rights, characterised by brazen attacks on any form of dissent”, the organisation’s director for East and South Africa, Deprose Muchena, said.\nAmnesty says the last five years – under President Edgar Lungu – have been marked by media censorship, use of “excessive force” by the police, arrests and detention, which have created fear.\nAmnesty also said a 15-year-old boy was arrested and charged in March last year after he allegedly criticised President Lungu on Facebook.\n“Such impunity is now entrenched in Zambia,” Amnesty says, while calling for the authorities to respect human rights ahead and after the August elections."
  },
  {
    "headline": "Nigeria’s Chief Justice Swears in 18 Court of Appeal Justices",
    "summarized_story": "The Chief Justice of Nigeria, Justice Tanko Muhammad on Monday swore in 18 new judges that were recently elevated to the Court of Appeal.\nThe new justices of the Court of Appeal are:1.\nMuhammad Sirajo (Plateau),3.\nMeanwhile, Justice Goodluck a Christian while taking her oath of office, said “so help me Allah” instead of the official “so help me God”.\nShe was however asked by the CJN to return to the microphone and take the oath in the name of God, which she did."
  },
  {
    "headline": "Special Report: Makoko Book Distribution Drive",
    "summarized_story": "Books for Africa, a seasoned American donor agency that ships books to Africa has partnered up with the Giveback group and Child to Child foundation to distribute books to underserved sections of the society.\nThe book distribution drive kicked off in Makoko, an informal settlement across the 3rd Mainland Bridge located on the coast of mainland Lagos.\nArise correspondent, Seyitan Atigarin has the details."
  },
  {
    "headline": "Niger Delta Militants Threaten To Cripple Nigeria’s Economy-Trending with Ojy Okpe",
    "summarized_story": "Nigeria’s Grammy Award Winner, Damini Ebunoluwa Ogulu, professionally Known as “Burna Boy” has made history as the first musician to win the BET Best International Act Award three consecutive times.\nPresident Muhammadu Buhari over the weekend responded to a Militant Group Known as the “Niger Delta Avengers”, which threatened to attack oil facilities in the south-south region, in a bid to cripple the economy.\nOver the weekend, President Muhammadu Buhari admitted that the war against illicit drugs in the country was more deadly than the fight against insurgency and banditry.\nClose friends of Matt Hancock former U.K. health secretary have revealed that he is in love with Gina Coladangelo, the woman he was filmed kissing in his office on May 6th."
  }
]