[
  {
    "headline": "Nigerians will experience multi-dimensional suffering with subsidy removal – PFN",
    "summarized_story": "The Pentecostal Fellowship of Nigeria has told the Federal Government that removing fuel subsidy will worsen the suffering of majority of Nigerians who are already impoverished.\nThe President of PFN, Bishop Wale Oke, urged the government to shelve the proposed policy in order not to worsen people’s hardship and trigger crisis in the country.\nOke made the call in a statement made available to journalists in Ibadan, Oyo State capital, on Sunday.\nThe cleric said prices of foodstuffs and other daily needs were going out of reach of the people, noting that if the proposed subsidy removal was implemented, it would worsen the situation.\n“Again, the planned introduction of N5,000 for 40 million poor Nigerians is to create a cesspool of corruption."
  },
  {
    "headline": "Fund to spend N1.85bn on training of policemen",
    "summarized_story": "The Nigeria Police Trust Fund has proposed to spend N1.85bn on training of policemen on protest response strategy, human rights and crime scene protection.\nThe NPF is also get specialised operational vehicles worth N5,852,211,368, patrol vehicles worth N5,170,800,000, ‘other operational vehicles’ worth N3,984,000,000, and utility vehicles/staff welfare buses worth N1,400,000,000.\nAn IGP Conference Centre will also be constructed by the NPTF at the cost of N1bn, with the construction of a modern armoury gulping another N1bn.\nThe NPTF is to spend N1,022,564,000 on ‘procurement and upgrade of police band instrument and accessories.’The Fund proposes to generate revenue totalling N65,905,252,467 and spend same amount in 2022.\nUnder the N480m allocated to Miscellaneous, refreshment and meals will gulp N22.7m; honorarium and sitting allowance, N54m; and welfare packages to take N90.5m."
  },
  {
    "headline": "Brain drain: We’re exporting our best doctors, says NMA president",
    "summarized_story": "The President of the Nigerian Medical Association, Prof Innocent Uja, has likened the way medical practitioners leave Nigeria to practise abroad to sitting on a time bomb.\nThis is just as the Joint Health Sector Union advised the government to improve working conditions for health workers in the country.\nHe said, “The issue of brain drain in health sector should not be taken lightly because it is like sitting on a time bomb.\n“The best thing is to understand the factors responsible for brain drain in health sector and stop them before they become monsters,” Uja said.\n“The issue of brain drain is not just about the physicians; it also has to do with health workers."
  },
  {
    "headline": "Leading companies outperform economy growth rate",
    "summarized_story": "READ ALSO:Access Bank, SME.NG, others partner to roll out female entrepreneurs productThis indicates faster growth rate compared to the Year-on-Year, YoY, economy (GDP) growth rate of 4.03 per cent reported by the National Bureau of Statistics, NBS, for the third quarter of 2021.\nThe sector accounted for 34.8 per cent of the combined companies’ earnings.\nSome of the growths in earnings by listed companies were inflation aided due to increase in prices of their products.\nI am not surprised that GDP grew, remember we are in expansionary budget which are the root to growth economy.\nOn the GDP growth, he said: “The latest GDP figure is quite inspiring to say the least given the tough economic periods witnessed in the past."
  },
  {
    "headline": "Ikoyi building collapse: Akpabio visits Tinubu, condoles Lagos State Government",
    "summarized_story": "By Chris OchayiABUJA: The Minister of Niger Delta Affairs, Senator Godswill Akpabio, has visited the National Leader of All Progressives Congress, APC, Asiwaju Ahmed Tinubu to condoled with him and the Lagos State Government over the unfortunate incident building collapse in the state recently.\nAkpabio, during the visit also thanked God almighty for the successful medical trip of the former governor of Lagos State and APC leader.\nAccording to him,” let me condole with His Excellency and former governor of Lagos State and the leader of our great party, over the recent building collapse in the state, where several Nigerians lost their lives.\nMay the souls of those who lost their lives find repose in God.”” Let me also specially, welcome back our Leader, Asiwaju Ahmed Tinubu, from his successful medical trip abroad.\nI pray to God to grant him total healing and good health in abundance in Jesus’ name, Amen,” he stated."
  },
  {
    "headline": "Desist from illegal migration, NGO urges youths",
    "summarized_story": "An NGO, Re-educating Africans on the Risks and Dangers of Unplanned Journey Abroad (RARDUJA), has urged Nigerian youths to desist from illegal migration.\nHe said that although, the organisation encouraged legal migration, it still believed that greener pastures could be found in the country.\nDuru advised youths to embrace skills acquisition and entrepreneurship rather than exposing themselves to the risks associated with illegal migration.\nThe RARDUJA boss commended Nigerians in the Diaspora who travelled through legal means and urged them to join the crusade against illegal migration.\nLearn a trade and practise in Nigeria, because the pains associated with illegal migration are better imagined than experienced,” he said."
  },
  {
    "headline": "Investigation shows ‘Omicron’ has increased risk of reinfection- WHO",
    "summarized_story": "By Joseph ErunkeABUJA-PRELIMINARY evidence suggests that the new COVID-19 variant, B.1.1.529, named ‘Omicron’,by the World Health Organisation, WHO,has an increased risk of reinfection.\nPreliminary evidence suggests an increased risk of reinfection with this variant, as compared to other VOCs,”WHO had said in a statement, classifying Omicron (B.1.1.529): SARS-CoV-2 Variant of Concern,VOC,”WHO said.\n” The TAG-VE was convened on 26 November 2021 to assess the SARS-CoV-2 variant: B.1.1.529,”the agency explained.\nIn recent weeks, infections have increased steeply, coinciding with the detection of B.1.1.529 variant.\n“For reference, WHO has working definitions for SARS-CoV-2 Variant of Interest (VOI) and Variant of Concern (VOC)."
  },
  {
    "headline": "CBN defends naira with $2.1bn, suffers marginal depreciation",
    "summarized_story": "By Babajide KomolafeThe Central Bank of Nigeria, CBN, in a bid to defend the naira, injected $2.1 billion into the Investors and Exporters (I&E) window, in the seven months to July this year (7mths-2021).\nThis represents a 238 per cent increase when compared with the $621.1 million injected into the I&E window in the corresponding period of 2020 (7mths-2020).\nAs a result of the increased CBN intervention, the naira was relatively stable during the 7mths-2021 period.\nThe naira also depreciated last week by 5.7 per cent in the parallel market as the exchange rate rose to N565.50 per dollar from N535 per dollar the previous week.\nAnalysts at Cowry Assets Management Limited, projected that the naira will depreciate further following the continued decline in the nation’s external reserves."
  },
  {
    "headline": "Bayelsa: Gunmen kill 3, abduct 7 oil workers in fresh attack",
    "summarized_story": "Gunmen suspected to be sea pirates, in the early hours of Sunday attacked two oil installations, killing three and abducting seven oil workers in Bayelsa.\nSources close to the affected oilfields said the gunmen reportedly shot dead two staff of the Nigerian Agip Oil Company and a personnel of the Nigerian Security and Civil Defence Corps (NSCDC).\nAccording to the sources, in the ambush that occurred at Ogbokiri-Akassa in Brass Local Government area, six oil workers allegedly doing maintenance jobs close to their platform were kidnapped and whisked away.\nIt was further gathered that the Agip oil workers and their security personnel came under attack at about 6am while working close to a manifold in the deep swamp.\n“Yes, our officers were ambushed and attacked by some unknown pirates while on their lawful duty of providing protection to some Agip oil workers close to Obama manifold in Okoroma community of Nembe Local Government."
  },
  {
    "headline": "BREAKING: Gunmen attacking Jos Custodial Centre trapped",
    "summarized_story": "Unknown gunmen who invaded a Medium Security Custodial Centre in Jos the Plateau State capital have been trapped by security operatives who are currently at the prison premises.\nA statement by the spokesman of the Nigeria Correctional Service NCoS, CC Francis Enobore, said the gunmen have been trapped following a heavy fire power of security operatives who immediately cordoned the yard.\nThe statement reads; “The Medium Security Custodial Centre in Jos, Plateau State came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\n“Reinforcement from the response squad of the Service has also been mobilised to the center.\n“The situation is presently under control as the attackers firing power is being subdued by superior fire from a combined team of security agencies."
  },
  {
    "headline": "Keep your blood money – Garba Shehu reacts as Omokri challenges him to spend weekend in Bama and get $50k",
    "summarized_story": "Garba Shehu, Senior Special Assistant to President Muhammadu Buhari on Media and Publicity has tackled the former presidential aide, Reno Omokri for challenging him to spend weekend in Bama Local Government Area of Borno State and get $50k.\nDAILY POST reports that following a recent claim by Mr Garba, stating that “Buhari deserves credit for tackling insecurity”, Omokri, a socio-political activist had challenged him to spend a weekend in Bama LG alone without security and get $50k.\nReno said, “Yesterday, Garba Shehu renewed his claim that “Buhari deserves credit for tackling insecurity”.\nSpend a weekend alone, without security, in Bama, and I will pay him $50k.\nThe post reads, “My message to anyone who made money using Leah Sharibu’s sad ordeal, and they are flaunting it remains unchanged: This is blood money."
  },
  {
    "headline": "Expedite action on abandoned Imo roads this dry season – Group tells Uzodinma",
    "summarized_story": "The umbrella body of online media practitioners in Imo State, under the aegis of Media Online Practitioners Association of Nigeria (MOPAN) on Sunday called on the state government led by Sen. Hope Uzodinma, to urgently mobilize contractors handling some of the abandoned road projects in the state, to return back to site this dry season.\nThe group said, “The poor condition of some of these roads, particularly within the state capital, such as MCC – Uratta Road, Umuguma – World Bank Road, 2nd phase of Naze – Ihiagwa Road etc and many others across the 27 local government areas of the state is unacceptable.”MOPAN stated this in a release signed by the Chairman of the group, Innocent Onyeukwu made available to DAILY POST in Owerri, Imo State capital“We believe the dry season provides ample opportunity for these roads to be fixed, to enable Imolites, especially those returning for the Yuletide, to have a memorable stay at home.”They said a state riddled with poor roads network is bound to witness stunted growth in almost all sectors of the economy, low investors and crippling businesses.\nThe group said this is why it is imperative that adequate measures are taken by the State government to address the deplorable, sorry and pitiable state of some of our roads, which has given rise to daily sufferings of the people who ply these bad roads on a daily basis.\n“Based on the foregoing, we appeal to the state government to faithfully implement its 3R mantra by embarking on reconstruction of our roads for the overall benefit of our people.”"
  },
  {
    "headline": "Nigerians may soon start looking for COVID-19 vaccine with money – Monarch warns",
    "summarized_story": "The Emir of Dutse, Nuhu Muhammad Sanusi, warned that Nigerians may soon start looking for COVID-19 vaccine with money and could not get it.\nThe Emir stated this at the official flag-off of mass COVID-19 vacation exercise in Kiyawa Local Government, Jigawa State.\nRepresented by the emirate’s senior councilor Basiru Muhammad Sanusi (Galadima of Dutse), the Emir urged Nigerians to troop out in enmasse and avail themselves for the vaccine.\nThe Emir, therefore, directed all his district heads and religious leaders to champion of COVID-19 vaccination exercise to achieve the set target.\nHe noted that failure to do so now, the defaulter may use their money to look for the vaccine and could not get it."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "UBA lights up Lagos ahead of Yuletide",
    "summarized_story": "By Taofik Salako and Collins NwezeUnited Bank for Africa (UBA) has held a light-up ceremony at its Foundation Gardens in Marina, Lagos.\nThe garden lights were activated by UBA’s Group Managing Director Kennedy Uzoka with other key management workers and some customers of the bank.\nUzoka, who is also the Chairman of the UBA Foundation, noted that giving back was the main tenet of UBA Foundation.\nSo, for us, these lights symbolise hope for the future and all the goodness it will bring into people’s lives.\nUBA Foundation Chief Executive Officer Mrs. Bola Atta said the light-up ceremony goes beyond the Marina and adorning the streets with beautiful colours."
  },
  {
    "headline": "Nigeria to benefit from $4.7tr digital services exportation",
    "summarized_story": "The National Information Technology Development Agency (NITDA) and the Nigerian Export Promotion Council (NEPC) have formed an alliance to enable Nigeria benefit from the yearly $4.7 trillion exportation of digital services.\nA statement by NITDA’s Corporate Affairs Department, headed by Hajiya Hadiza Umar, said the alliance was in line with the Digital Innovation and Entrepreneurship Pillar of the agency’s 2021-2024 Strategic Roadmap and Action Plan.\nAwolowo said the partnership has provided about N150 million support grant to innovation hubs in three geopolitical zones of the country.\nHe said about N300 million in grants had been provided to support start-ups exporting and have the potential to export services in the Entertainment Tech, FinTech, EduTech and LogisticsTech sectors.\n“We are also providing support to drive advocacy to ensure that Nigerian Start-up Bill is passed by the end of the year,” Awolowo said."
  },
  {
    "headline": "82 Kuje students showcase STEM innovations",
    "summarized_story": "Eighty-two pupils of The KNOSK N100-A-Day Charity Secondary School in Kuje Community – a suburb in the Federal Capital Territory have displayed their innovations in Science, Technology, Engineering and Mathematics (STEM).\nAccording to her, part of the training is to expose the students to skills of the future when they leave school.\n“This term, we try to focus on girls in Science, Technology, Engineering and Mathematics (STEM).\nWe got students from six groups led by girls to design solutions to problems in the Kuje locality using science and technology.\nExecutive Director of YDI, Kingsley Bangwell said the goal is to provide students from low-income homes get access to education."
  },
  {
    "headline": "540 benefit from foundation’s free surgeries",
    "summarized_story": "The Sani Bello Foundation has operated on 540 people suffering from fibroid, appendicitis, goitre, lumps, hernia, hydrocele, thyroid, gynaecological disorders and eye diseases.\nThe medical outreach which is in its 8th edition was done to commemorate the 79th birthday of the founder, Colonel Sani Bello (rtd).\nIn a chat with reporters in Kontagora, the Head of the medical team, Dr Toth Joseph Dogo said this year’s medical outreach, 460 general surgeries for fibroid, gynaecological disorders and other ailments were carried out, adding that there were 86 eye surgeries.\n“We are glad that this edition of the surgical festival has been successful.\nHe said the surgical festival which is done twice a year is the heartbeat of the Founder who is determined to put smiles on the face of the masses."
  },
  {
    "headline": "Breaking: Jos Correctional Centre under heavy attack",
    "summarized_story": "From Gyang Bere, JosThere is palpable tension in Jos, the capital of Plateau State on following heavy gunshots and attack on the Jos Correctional Centre by suspected gunmen.\nIt was learned that the gunmen suspected to be Boko Haram invaded the Correctional Centre at about 5:30pm on Sunday.\nIt was gathered that prison officers on duty who could not withstand the firing power of the gunmen, abandoned their duty post and escaped for their lives.\nThe road leading to the Police Headquarters, Jos and the Correctional Centre Jos was deserted immediately and shops around the area hurriedly close.\nEfforts to get the Pubic Relation Office of the Correctional Centre speak proof abortive as his line was witch off."
  },
  {
    "headline": "Onaiyekan raises concern over increasing number of out-of-school children",
    "summarized_story": "From Okwe Obi, AbujaEmeritus Archbishop of the Catholic Archdiocese of Abuja, John Cardinal Onaiyekan, has expressed concern over the increasing number of out-of-school children milling the streets.\nHe said, “this question of abandoned children is not new.\nIt has been in the world almost from time immemorial just that nowadays, in this age and year 2021, there ought not to be any more children abandoned.\n“It’s not only the children of the rich people who deserve to be alive, the children of the poor also have a future.\nOf course, they are not the only ones that are looking after abandoned youths and children, but they specialise in this because of their founder Don Bosco who spent most of his time looking after abandoned children."
  },
  {
    "headline": "IPOB blasts Gumi for comparing it to bandits",
    "summarized_story": "From Stanley Uzoaru,OwerriThe Indigenous People of Biafra (IPOB) has taken a swipe at the Islamic cleric, Sheik Ahmad Gumi for comparing it to bandits recently pronounced as a terrorists group by an Abuja court.\nPointing out similarities between the two groups,Powerful said “In case Gumi has forgotten, Fulani bandits and herdsmen are already designated the fourth deadliest terror organisation in the world.\n“It’s only in Nigeria that Gumi and his likes will liken IPOB to a terror group that it is not.\n“Can the mischievous Gumi be honest to tell the world if IPOB has kidnapped anybody at any time and demanded ransom for him to liken us with bandits?\nSheikh Gumi, tell us your friend, and we will tell you who you are!"
  },
  {
    "headline": "Insecurity: Zamfara govt lifts ban on telecom shutdown",
    "summarized_story": "From Tunde Omolehin, SokotoGovernor Bello Matawalle of Zamfara state has announced the suspension on telecommunications in the state beginning from Monday, 29th November, 2021.\nThis was contained in a statement by Zailani Bappa,Special Adviser to the governor on Public Enlightenment, Media and Communications.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe statement quoted the Governor as saying, the decision to suspend was informed by an encouraging report of peace attained in the state, saying the bandits have taken the desired toll meant by the measure.\n“I want to announce today that we have taken a decision to lift the ban on telecommunications in the state."
  },
  {
    "headline": "APC governors move to hijack presidential ticket",
    "summarized_story": "From Romanus Ugwu, AbujaThe cold war raging in the All Progressives Congress (APC), especially between the APC progressive governors and the Presidency over zoning of the party’s positions and the 2023 presidential ticket deepened at the weekend.\n“The governors are hell-bent on one of them emerging as the party’s standard bearer for the 2023 presidential poll and they are not bulging on it.\nThey have taken their resolutions to Mr President, including the appeal that he endorses the plans for one of them to pick the presidential ticket of the party.\nThat must be the reason the North-central has been tactically endorsed to produce the party’s national chairmanship position.\n“With this arrangement, it is therefore easy to conclude that the North has also conceded the presidential ticket to the South for now."
  },
  {
    "headline": "Breaking: Sporadic Gunshots Heard Near Jos Prison",
    "summarized_story": "Seriki Adinoyi in JosSporadic gunshots have been reported near the Jos Correctional centre.\nSources close to the area said the heavy gunshots which started at about 5:45pm on Sunday continued intermittently into the night.\nAs at the time of this report the Police have cordoned off the roads leading to the prison area, where the state Police headquarters and the DSS are also located.\nEfforts to reach officials of the Jos Correctional Center for comments failed.\n*This is a developing story…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "New COVID-19 Strain: Concerns Mount over Planned Visit of Ramaphosa to Nigeria",
    "summarized_story": "This development has prompted the ban of travellers from Southern African countries by the 27-member European Union (EU), and the United States, Britain, Canada, Israel, Saudi Arabia, Singapore, and UAE.\nCanada also banned travellers from seven African countries – Botswana, Eswatini, Lesotho, Mozambique, Namibia, South Africa, and Zimbabwe – over concerns about the variant.\nRamaphosa’s planned visit has raised concerns in Nigeria following the new strain of COVID-19.\nIs Nigeria going to receive the South African President and other officials when other countries are banning travellers from South Africa?\nHowever, only a few Nigerian firms are operating in South Africa."
  },
  {
    "headline": "In a Tribute to De Klerk, Gusau Highlights Nigeria’s Role to End Apartheid Regime",
    "summarized_story": "“On 2nd February 1990, while we were still working underground with their security officials, President de Klerk took the world by surprise.\nGusau said de Klerk’s historic speech had led to far-reaching political reforms and had also marked the beginning of the end of the apartheid regime in South Africa.\nWhen I sounded them out about whether they would like to visit South Africa, they were excited.\nI discussed the idea with South African officials, and it was agreed that they could undertake a visit.\n“In April 1992, President de Klerk undertook a three-day State Visit to Nigeria at the invitation of President Babangida."
  },
  {
    "headline": "CBN Set to Establish Int’l Financial Centre at Eko Atlantic City",
    "summarized_story": "According to him, most of the funds were invested in low-yielding assets relative to high-yielding opportunities in Nigeria.\nSecond, continued implementation of our intervention efforts would need to be undertaken to sustain the recovery efforts and stimulate further growth of the economy.\n“Through the pandemic, we are aware that our policy responses are often more effective when we work with the private sector.\nEmefiele also said efforts would be made to support firms geared towards producing goods for the export market.\nInfracorp is expected to raise over N15 trillion to support investment in critical infrastructure in Nigeria."
  },
  {
    "headline": "Again, Police, PSC Set to Clash over Recruitment of 10,000 Constables",
    "summarized_story": "But the Inspector General of Police (IG), Usman Alkali Baba, at the weekend called for applications from suitably qualified applicants for the 2021 recruitment exercise.\nThe 2020 recruitment exercise, however, ran into troubled waters when the police insisted that it had the mandate to recruit constables.\nBut the PSC had stood its ground, also insisting that it was constitutionally empowered to conduct recruitment for the police.\nThe retired IG said the 2020 recruitment exercise which was suspended midway was the third edition after the successful 2018 and 2019 exercises.\nBut the police high command at the weekend called for applications from suitably qualified applicants for the 2021 recruitment exercise."
  },
  {
    "headline": "EXCLUSIVE: Jail Break: Police Authorities Order People To Vacate Barracks Near Jos Prison Amid Fears Of Planned Attack, Attempt To Free Detained Fulani Bandits",
    "summarized_story": "The division has about six of the Fulani and there is panic those who attacked the Jos prison earlier will also attack the division to free their people.\nThey had planned on attacking a police barracks too.”Earlier, the Controller of Corrections (Public Relations Officer) at the Jos prison, Francis Enobore, while speaking for the Controller-General of Corrections on Sunday evening, confirmed the attack.\nHe added that gunmen who attacked the prison had been trapped inside the facility.\nHe also said the gunmen engaged the security personnel in the prison in a gun battle before breaking into the yard.\nIt was gathered that the gunmen set all the prisoners at the facility free during the attack."
  },
  {
    "headline": "EXCLUSIVE: Jail Break: Police Authorities Order People To Vacate Barracks Near Jos Prison Amid Fears Of Planned Attack, Attempt To Free Detained Fulani Bandits",
    "summarized_story": "The division has about six of the Fulani and there is panic those who attacked the Jos prison earlier will also attack the division to free their people.\nThey had planned on attacking a police barracks too.”Earlier, the Controller of Corrections (Public Relations Officer) at the Jos prison, Francis Enobore, while speaking for the Controller-General of Corrections on Sunday evening, confirmed the attack.\nHe added that gunmen who attacked the prison had been trapped inside the facility.\nHe also said the gunmen engaged the security personnel in the prison in a gun battle before breaking into the yard.\nIt was gathered that the gunmen set all the prisoners at the facility free during the attack."
  },
  {
    "headline": "BREAKING: Gunmen Trapped Inside Jos Prison After Attack On Facility –Spokesperson",
    "summarized_story": "Some gunmen who attacked the Medium Security Custodial Centre in Jos, Plateau State have been trapped inside the prison facility.\nHe also said the gunmen engaged the security personnel in the prison in a gun battle before breaking into the yard.\nHe said, “The Medium Security Custodial Centre in Jos, Plateau State came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\nSee Also Breaking News BREAKING: Panic As Gunmen Attack Jos PrisonHowever, the number of casualties or injured persons cannot be ascertained yet.\nThe facility known as Abolongo correctional facility was attacked by the gunmen on the evening of Friday, October 22."
  },
  {
    "headline": "BREAKING: Gunmen Trapped Inside Jos Prison After Attack On Facility –Spokesperson",
    "summarized_story": "Some gunmen who attacked the Medium Security Custodial Centre in Jos, Plateau State have been trapped inside the prison facility.\nHe also said the gunmen engaged the security personnel in the prison in a gun battle before breaking into the yard.\nHe said, “The Medium Security Custodial Centre in Jos, Plateau State came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\nSee Also Breaking News BREAKING: Panic As Gunmen Attack Jos PrisonHowever, the number of casualties or injured persons cannot be ascertained yet.\nThe facility known as Abolongo correctional facility was attacked by the gunmen on the evening of Friday, October 22."
  },
  {
    "headline": "BREAKING: Gunmen Trapped Inside Jos Prison After Attack On Facility –Spokesperson",
    "summarized_story": "Some gunmen who attacked the Medium Security Custodial Centre in Jos, Plateau State have been trapped inside the prison facility.\nHe also said the gunmen engaged the security personnel in the prison in a gun battle before breaking into the yard.\nHe said, “The Medium Security Custodial Centre in Jos, Plateau State came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\nSee Also Breaking News BREAKING: Panic As Gunmen Attack Jos PrisonHowever, the number of casualties or injured persons cannot be ascertained yet.\nThe facility known as Abolongo correctional facility was attacked by the gunmen on the evening of Friday, October 22."
  },
  {
    "headline": "Keyamo: Lagos #EndSARS panel was illegal... states can't probe military, police",
    "summarized_story": "Festus Keyamo, minister of state for labour and employment, says the Lagos judicial panel on police brutality was “illegal and a waste of time”.\nThe minister said the Lagos state government, which set up the judicial panel, lacks the power to probe the conduct of police and military officers.\nAll lawyers who are listening to me should go back and read to the Tribunal of Inquiry Act of Lagos state.\nIt is defined to mean somebody within the public service of the Lagos state or the local government as the case may be.\nLagos state cannot be in control, cannot legislate too regarding police matters and military matters."
  },
  {
    "headline": "Keyamo: Lagos #EndSARS panel was illegal... states can't probe military, police",
    "summarized_story": "Festus Keyamo, minister of state for labour and employment, says the Lagos judicial panel on police brutality was “illegal and a waste of time”.\nThe minister said the Lagos state government, which set up the judicial panel, lacks the power to probe the conduct of police and military officers.\nAll lawyers who are listening to me should go back and read to the Tribunal of Inquiry Act of Lagos state.\nIt is defined to mean somebody within the public service of the Lagos state or the local government as the case may be.\nLagos state cannot be in control, cannot legislate too regarding police matters and military matters."
  },
  {
    "headline": "Gunmen kill two police officers in Anambra, burn their bodies",
    "summarized_story": "Two police officers have been reportedly killed following an attack by gunmen in Anambra state.\nAdvertisementIn a statement on Sunday, Ikenga Tochukwu, Anambra command spokesperson, said the slain officers were travelling with their colleagues when they were ambushed by the gunmen.\nHe said the bodies of the slain officers were burnt by the gunmen, while one officer is still missing.\nAdvertisement“In the attack, two police officers were killed and their bodies were burnt while one of the officers is still missing,” Tochukwu said.\nA month after, gunmen set ablaze the Ajali divisional police headquarters in Orumba north LGA of the state."
  },
  {
    "headline": "Gunmen kill two police officers in Anambra, burn their bodies",
    "summarized_story": "Two police officers have been reportedly killed following an attack by gunmen in Anambra state.\nAdvertisementIn a statement on Sunday, Ikenga Tochukwu, Anambra command spokesperson, said the slain officers were travelling with their colleagues when they were ambushed by the gunmen.\nHe said the bodies of the slain officers were burnt by the gunmen, while one officer is still missing.\nAdvertisement“In the attack, two police officers were killed and their bodies were burnt while one of the officers is still missing,” Tochukwu said.\nA month after, gunmen set ablaze the Ajali divisional police headquarters in Orumba north LGA of the state."
  },
  {
    "headline": "Indonesia bans travels from Nigeria over Omicron COVID-19 variant",
    "summarized_story": "The Indonesian government says it will ban travellers from Nigeria and seven other African countries over concerns about the spread of the Omicron COVID-19 variant.\nTravellers who have been to South Africa, Botswana, Namibia, Zimbabwe, Lesotho, Mozambique, Eswatini, or Nigeria for the past 14 days are affected.\nPandjaitan also disclosed that travellers entering the country will have to quarantine for seven days compared to three days earlier announced.\nThe World Health Organisation (WHO) had named it ‘Omicron’ and classified it as a variant of concern.\nAdvertisementHere is what you need to know about the Omicron variant."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "Nigerian fintech startup, FairMoney, hosts its first “Investor Conference”",
    "summarized_story": "Laurin Hainy, CEO and Co-Founder of FairMoneyAs of October 2021, Africa: The Big Deal reported that 57% of the amounts raised which was slightly above $1.6 billion has gone to fintech startups.\nOne such fintech is FairMoney, a digital bank that currently offers lending services in Nigeria, India, and France.\nL – R: Oluwatomide Oluwole, Finance Manager, FairMoney; Henry Obiekea, VP CapitalMarkets, FairMoney; Yaw Mante, Head, Finance – FairMoney and James Edeh, Head,Compliance, FairMoney, at the FairMoney investor’s conference.\nThey need to be able to pay, they need to be able to save, they need to be able to invest.\nThere was also a panel session on the role of fintech startups in financial inclusion in Nigeria."
  },
  {
    "headline": "Nigeria’s ranking on NFTs, Asilimia’s $2m funding, OnePipe’s $3.5m seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Nigerians and NFTsAsilimia’s $2m fundingOnePipe’s $3.5m seedNigeria’s NFT rankingA new report by Finders.com shows that 13.7% of Nigerian Internet users own non-fungible tokens (NFTs).\nThe report was based on a survey conducted on 1,205 Nigerian Internet users.\nThe survey also went on to estimate that Nigeria’s NFT ownership rate could reach 35% as 21.7% of the surveyed Internet users, plan to own NFTs.\nCan 1,205 Internet users out of 101.72 million tell the true story about NFTs in Nigeria?\nOnePipe’s $3.5m seedOnePipe teamNigerian fintech API, OnePipe, has closed a $3.5 million seed, co-led by Atlantica Ventures, Tribe Capital and V&R Associates."
  },
  {
    "headline": "APC to hold National Convention February 5, Presidential primaries third quarter of 2022",
    "summarized_story": "The All Progressives Congress (APC) has said its National Convention will now hold on February 5, 2022.\nBusinessDay also gathered that the ruling party may retain the Caretaker Committee to conduct the presidential primaries in the third quarter of 2022.\nAPC members also disclosed that President MuhammaduBuhari had wanted the convention to hold on Decenber 28, 2022, but was persuaded by APC governors to yield to February 5, 2022 date.\nIt had earlier been reported that top leaders of APC had earlier agreed to hold the convention on any of the weekends between the first and third week of February 2022.\nFebruary 5, 2022 is the date marked for the APC Convention,” Chieftain of party added."
  },
  {
    "headline": "2023 elections: Nigeria back to pre-1999 era",
    "summarized_story": "For him, Nigeria is in a more precarious situation now than in the pre-1999 election era; a development, according to him, makes nonsense of the 22 years of democratic rule.\nHe accused the ruling class of plunging more Nigerians today into the abyss of poverty than was the case in 1998 before the elections in 1999.\nToday, the sing song in society is that Nigeria has never had it so bad.\n“Politics is all struggles for political power among interests and so, no interest will want to easily relinquish power or allow power shift.\nThe political drama of the pre and post 1993 era was part of what paved the way for a South-West president in 1999."
  },
  {
    "headline": "Should you be worried about Omicron, new covid variant?",
    "summarized_story": "Should you be worried about Omicron, new covid variant?\nNews of the variant prompted countries to announce new travel restrictions on Friday and sent drug makers scrambling to see if their COVID-19 vaccines remain protective.\nThese countries introducing ban on flights include the UK which said Saturday that two cases of Omicron have been found there.\nThe World Health Organization on Friday classified the B.1.1.529 variant, or Omicron, as a SARS-CoV-2 “variant of concern,” saying it may spread more quickly than other forms of coronavirus.\nBut the biggest question remains whether protection from COVID-19 vaccines – nearly 8 billion doses have been administered globally – will hold up."
  },
  {
    "headline": "Obaseki urges measures to check population growth – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for urgent measures to check Nigeria’s population growth.\nIf we do not do something about controlling our population growth, there will be a huge gap between our capacity to narrow the growth rate and our development.\n“Yes, we could turn the 200 million-plus people we have today into a huge economic asset if we manage that growth.\nWe just commenced a 30-year planning process.\nWhile working on the national population census, we also have to commence our own census with our planning process,” Obaseki said."
  },
  {
    "headline": "Obaseki commissions 5,400mt per annum cashew factory, tasks youths to embrace opportunities in agribusiness – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… factory to be supported by over 2000 smallholder farmersBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has tasked youths to embrace opportunities in the agriculture value chain by deploying innovative ideas to initiate and develop agribusiness projects.\nObaseki made the submission after commissioning a 5,400mt per annum cashew processing factory, along PZ Road in Benin City, the Edo State capital.\n“Thirdly, my administration will continue to encourage more investments in Edo State as investment does well here because it is a state of the progressives.\nI would like to work with you to build capacity and encourage farmers to grow cash crops as you will give them a price for their produce.\nWe are proud of what you are doing here in the state, as we encourage more young people to be enterprising."
  },
  {
    "headline": "Obaseki seeks stakeholders’ collaboration to sustain education reforms in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has called for collaboration of the National Mathematical Centre and other stakeholders to sustain gains recorded in the state’s education sector through the Edo Basic Education Sector Transformation (EdoBEST) programmes.\nHe made the call during a courtesy visit by the Director/Chief Executive, National Mathematical Centre, Prof.\nHe said, “The saving grace for our country is education and not just sending children to school but having basic, qualitative and foundational education.\nBoth literacy and mathematical skills have to be emphasized at that level.”Obaseki noted that in Edo State, “We have made some significant steps in terms of strengthening foundational education through our EdoBEST programme.\nOn his part, the Director/Chief Executive, National Mathematical Centre, Prof."
  },
  {
    "headline": "THE 3,906 INMATES STILL ON THE RUN AND AREGBESOLA – Nigerian Observer",
    "summarized_story": "Rauf Aregbesola, Minister of Interior has ambition plans for the upgrade and rehabilitation of correctional facilities across the states to prevent future jailbreaks.\nAregbesola said the project was part of projects initiated by the federal government to reform the correctional service.\n“It is designed for inmates awaiting trial, a petty, medium and maximum security facility,” the minister said.\nRECENTLY, the Minister of Interior, Mr. Rauf Aregbesola, made a statement over the frightening attack on correctional centres across the country.\nThere have been at least eight jailbreaks in the last one year, and a large proportion of the inmates remain on the run."
  },
  {
    "headline": "Bandits trapped inside Jos prison after attack on facility – Spokesperson",
    "summarized_story": "Bandits who attacked the Medium Security Custodial Centre in Jos, Plateau State on Sunday evening have been trapped inside the facility.\nThe Controller of Corrections, Public Relations Officer, Francis Enobore, speaking for the Controller-General of Corrections on Sunday evening confirmed the attack.\nHe said the gunmen engaged the security personnel in the prison in a gun battle before breaking into the yard, addeding that the gunmen have been trapped in the facility.\n“The Medium Security Custodial Centre in Jos, Plateau State came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons,” he said.\n“Reinforcement from the response squad of the Service has also been mobilised to the centre."
  },
  {
    "headline": "Charity Maduka, wife of Coscharis Group founder, Cosmas Maduka is dead",
    "summarized_story": "Wife of Nigerian billionaire businessman and Chairman of the Coscharis Group, Cosmas Maduka, Mrs. Charity Maduka, has died.\nMrs Maduka died on Sunday afternoon after suffering a stroke family sources said.\nThe late Mrs Maduka until her death was the Vice-president of the Coscharis Group, a position she had held since its inception as the co-owner of the company.\nCosmas and Charity got married in 1977.\nThe union is blessed with three sons; Cosmas Jr Maduka, Jonathan Maduka, Peter K. Maduka and a daughter, Charity Ngozi MadukaFacebook Notice for EU!"
  },
  {
    "headline": "Police arrest Immigration Officer over invasion of Justice Odili’s home",
    "summarized_story": "With the arrest of the officer, total number of suspects in Police net are now 15 and there are indications they will be arraigned in court this week.\nForce Public Relations Officer, CP Frank Mba who confirmed the arrest said, “It is true.\nOthers expected to be arraigned alongside the immigration officer include a journalist, banker, lawyer, a fake policeman and seven others.\nThe home of Justice Odili on Imo River Crescent in the Maitama area of Abuja was raided on October 29, 2021, by some men claiming to be members of the Joint Panel Recovery unit of the Federal Ministry of Justice.\nAccording to the Spokesperson, the CP Mba said the suspects conspired to raid the residence of Justice Odili following information that the Supreme Court Justice was keeping a large sum of money in foreign currencies."
  },
  {
    "headline": "First Bank partners Junior Achievement Nigeria to host NCOY 2021",
    "summarized_story": "First Bank of Nigeria Limited has partnered with Junior Achievement Nigeria (JAN) to host its annual flagship event, the National Company of the Year competition (NCOY), which convenes winners of the JA Company Regional Competitions across Nigeria to compete for the National Company of the Year Award.\nThe 2021 edition of the NCOY competition will be held virtually via Zoom meetings at 10am on Saturday, 27th November 2021.\nThe 2021 National Company of the Year Program will also feature SPARK Competition.\nSPARK as an initiative of First Bank of Nigeria Limited, is an acronym for Start Performing Acts of Random Kindness.\nOur commitment to fostering entrepreneurial development amongst youths is mainly the driving force behind our support of the National Company of the Year (NCOY) and Africa Company of the Year (ACOY) competitions in past 11 years”."
  },
  {
    "headline": "Jos Custodial Centre Attack: Gunmen Trapped Inside Facility",
    "summarized_story": "Gunmen who attacked the Medium Security Custodial Centre in Jos, Plateau State on Sunday evening are said to be currently trapped in the compound after security agents cordoned off the area when they were mobilised to assist security agents at the custodial centre.\nAccording to a press release by director of press and public relations of corrections, Francis Enobore, the armed men with sophisticated weapons, stormed the Correctional Centre at about 1720hrs on Sunday, November 28, 2021.\nThey engaged the armed squad at the centre in a gun duel.\n“Although they gained entrance to the yard, they are however trapped within as men from sister security services were immediately mobilised to assist the armed guards to cordon the perimeter wall and the entire area.\n“Reinforcement from the response squad of the Service has also been mobilised to the center."
  },
  {
    "headline": "Jos Custodial Centre Attack: Gunmen Trapped Inside Facility",
    "summarized_story": "Gunmen who attacked the Medium Security Custodial Centre in Jos, Plateau State on Sunday evening are said to be currently trapped in the compound after security agents cordoned off the area when they were mobilised to assist security agents at the custodial centre.\nAccording to a press release by director of press and public relations of corrections, Francis Enobore, the armed men with sophisticated weapons, stormed the Correctional Centre at about 1720hrs on Sunday, November 28, 2021.\nThey engaged the armed squad at the centre in a gun duel.\n“Although they gained entrance to the yard, they are however trapped within as men from sister security services were immediately mobilised to assist the armed guards to cordon the perimeter wall and the entire area.\n“Reinforcement from the response squad of the Service has also been mobilised to the center."
  },
  {
    "headline": "N19.3bn Saga: Northern Youths Seek Independent Investigation",
    "summarized_story": "The Northern Youths Movement (NYM) has demanded for an independent probe of the controversies over the alleged N19.33billion Kogi State salary bailout fund, which the Economic and Financial Crimes Commission (EFCC) claimed it recovered and returned to the Central Bank of Nigeria (CBN).\nRecall that the EFCC had said that it returned the N19.33billion allegedly kept by the Kogi State government in a fixed deposit account domiciled in Sterling Bank for the purpose of yielding, to the CBN.\nHowever, the Kogi State government, which insisted that it did not open or create the said account with Sterling Bank, demanded from the EFCC, an apology and retraction of the commission’s allegations.\nADVERTISEMENTThe NYM wondered why no one has been put on trial if truly the EFCC’s claim on the alleged N19.33billion Kogi State bailout fund was true.\nThe youths added that salient questions as to where is the mandate letter from the Kogi State Government to open account number 0073572696 with Sterling Bank and who operated the account needed to be answered."
  },
  {
    "headline": "N19.3bn Saga: Northern Youths Seek Independent Investigation",
    "summarized_story": "The Northern Youths Movement (NYM) has demanded for an independent probe of the controversies over the alleged N19.33billion Kogi State salary bailout fund, which the Economic and Financial Crimes Commission (EFCC) claimed it recovered and returned to the Central Bank of Nigeria (CBN).\nRecall that the EFCC had said that it returned the N19.33billion allegedly kept by the Kogi State government in a fixed deposit account domiciled in Sterling Bank for the purpose of yielding, to the CBN.\nHowever, the Kogi State government, which insisted that it did not open or create the said account with Sterling Bank, demanded from the EFCC, an apology and retraction of the commission’s allegations.\nADVERTISEMENTThe NYM wondered why no one has been put on trial if truly the EFCC’s claim on the alleged N19.33billion Kogi State bailout fund was true.\nThe youths added that salient questions as to where is the mandate letter from the Kogi State Government to open account number 0073572696 with Sterling Bank and who operated the account needed to be answered."
  },
  {
    "headline": "FUDMA Honours Prof Gwarzo, Names Varsity Road After Him",
    "summarized_story": "The Federal University of Dutsin-Ma (FUDMA), Katsina State, has honoured the President and Founder of Maryam Abacha American University of Niger (MAAUN), Prof. Adamu Abubakar Gwarzo, by naming the main road to the University after him.\nExplaining the purpose of naming the main road to the University after Prof. Gwarzo, Alhaji Uba Ahmad Nana, the Pro-Chancellor and chairman of Governing Council of FUDMA, said they named the road after Prof. Gwarzo for his selfless service to the University and humanity at large.\nHe said; “This road has been named after you for your selfless service to humanity, for your generosity, for being philanthropist, not only for FUDMA but for humanity at large.\nYou have been very supportive of Federal University Dutsin-Ma.\nMay Allah bless you and I will continue collaborating with the University of Dutsin-Ma."
  },
  {
    "headline": "Anambra community battles police over killing of 20-year-old lady",
    "summarized_story": "The shooting to death of Miss Chidimma Ezeanochie, 20, of Umudansu Village, Azia Community in Ihiala Local Government Area of Anambra has generated arguments between the Police and the Community.\nThe petition is entitled: “Gruesome murder of Miss Chidimma Ezeanochie by policemen of Special Unit deployed from Awka to Orsumoghu on Nov. 25, 2021’’.\nThe community described the murder as gruesome, wicked and totally unacceptable to it and demanded for justice from the police hierarchy.\nAccording to the petition, Chidimma and her brother were shot at close range by a team member of the Special Unit from inside an armoured vehicle.\nReacting to the petition, however, the police in Anambra condoled with the family of Miss Chidimma, but exonerated themselves from her murder."
  },
  {
    "headline": "Anambra community battles police over killing of 20-year-old lady",
    "summarized_story": "The shooting to death of Miss Chidimma Ezeanochie, 20, of Umudansu Village, Azia Community in Ihiala Local Government Area of Anambra has generated arguments between the Police and the Community.\nThe petition is entitled: “Gruesome murder of Miss Chidimma Ezeanochie by policemen of Special Unit deployed from Awka to Orsumoghu on Nov. 25, 2021’’.\nThe community described the murder as gruesome, wicked and totally unacceptable to it and demanded for justice from the police hierarchy.\nAccording to the petition, Chidimma and her brother were shot at close range by a team member of the Special Unit from inside an armoured vehicle.\nReacting to the petition, however, the police in Anambra condoled with the family of Miss Chidimma, but exonerated themselves from her murder."
  },
  {
    "headline": "PFN warns FG: Subsidy removal will worsen Nigerians’ suffering",
    "summarized_story": "The Pentecostal Fellowship of Nigeria has told the Federal Government that removing fuel subsidy will worsen the suffering of the majority of Nigerians who are already impoverished.\nThe President of PFN, Bishop Wale Oke, urged the government to shelve the proposed policy in order not to worsen the hardship and trigger crisis in the country.\nOke said this in a statement issued on Sunday on the proposed subsidy removal.\nThe cleric said prices of foodstuffs and other daily needs were increasingly going out of reach of the people, noting that if the proposed subsidy removal was effected, it would exacerbate the hardship of the people of the nation.\n“Again, the planned introduction of N5,000 for 40 million poor Nigerians is to create a cesspool of corruption."
  },
  {
    "headline": "PFN warns FG: Subsidy removal will worsen Nigerians’ suffering",
    "summarized_story": "The Pentecostal Fellowship of Nigeria has told the Federal Government that removing fuel subsidy will worsen the suffering of the majority of Nigerians who are already impoverished.\nThe President of PFN, Bishop Wale Oke, urged the government to shelve the proposed policy in order not to worsen the hardship and trigger crisis in the country.\nOke said this in a statement issued on Sunday on the proposed subsidy removal.\nThe cleric said prices of foodstuffs and other daily needs were increasingly going out of reach of the people, noting that if the proposed subsidy removal was effected, it would exacerbate the hardship of the people of the nation.\n“Again, the planned introduction of N5,000 for 40 million poor Nigerians is to create a cesspool of corruption."
  },
  {
    "headline": "Breaking: Omicron COVID variant in Nigeria, 2 travellers detected in Canada",
    "summarized_story": "Ontario’s Ministry of Health has confirmed two cases of the Omicron COVID-19 variant, in two individuals with recent travel from Nigeria.\nThe two travellers have been isolated, according to a statement by Ontario ministry of health.\nThis should send alarm signals to Nigerian health authorities that the Omicron COVID-19 variant is already in the country.\n“Today, the province of Ontario has confirmed two cases of the Omicron variant of COVID-19 in Ottawa, both of which were reported in individuals with recent travel from Nigeria”, the ministry said.\nThe World Health Organisation labelled the Omicron COVID-19 variant, a variant of concern."
  },
  {
    "headline": "Tallen advocates castration as punishment for incest",
    "summarized_story": "By Ikenna OsuohaMrs Pauline Tallen, Minister of Women Affairs has recommended castration as punishment for fathers who sleep with their daughters an offense commonly referred to as incest in Nigeria.\nTallen made the recommendation at a news conference in commemoration of 16 days of Activism against Gender Based Violence (GBV) in Abuja on Sunday.\nShe described incest as the worst form of gender based violence, which required stringent punishment as castration.\n“Incest is the worst form of gender based violence and I advocate castration as punishment for offenders.\n‘Let us name and shame the perpetrators of incest because it is the worst,” she said."
  },
  {
    "headline": "Bandits Release 10 Of 13 Kidnapped Zaria LG Staff",
    "summarized_story": "The Kaduna State Police Command has announced the release of 10 of the 13 Zaria Local Government Council personnel who were kidnapped.\nThe LG staff regained their freedom on Saturday, according to the PPRO, ASP Mohammed Jalige.\nAccording to a relative of one of the rescued LG workers, a ransom of N40 million was paid before the robbers released the ten LG workers.\nThe kidnappers agreed to release the last three provided three motorcycles were made available to them, according to him.\nThe Local Government Council is prepared to supply the three motorcycles so that the remaining three LG employees can be discharged, according to journalists."
  },
  {
    "headline": "BREAKING: Gunmen Trapped Inside Jos Custodial Centre",
    "summarized_story": "Gunmen who stormed the Jos Medium Security Custodial Centre in Plateau state on Sunday evening were reported stranded within the facility due to security officials’ overwhelming firepower, who cordoned off the yard immediately.\nCC Francis Enobore, spokesman for the Nigeria Correctional Service NCoS, revealed this in a statement made Sunday night in Abuja.\nThe statement reads; “The Medium Security Custodial Centre in Jos, Plateau State came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\n“Reinforcement from the response squad of the Service has also been mobilised to the center.\n“The situation is presently under control as the attackers firing power is being subdued by superior fire from a combined team of security agencies."
  },
  {
    "headline": "BREAKING: Gunmen Attack Jos Correctional Centre",
    "summarized_story": "Opeyemi Damilare aka Mario is a writer who loves to share and inform the masses with contents relating to their beliefs, lifestyle and entertainment.\nStudying Computer Science at Tai Solarin University of Education.\nWhenever I’m not writing, I play the drums or read."
  },
  {
    "headline": "BREAKING: Petrol Tanker Overturns, Explodes In Ogun",
    "summarized_story": "On Sunday, a tanker carrying Premium Motor Spirit, also known as gasoline, exploded in Abeokuta, the capital of Ogun State.\nThe tanker overturned around 04.45 a.m. while on its way inbound Rounder from Oju-Irin, Lafenwa, Abeokuta, according to our correspondent.\nTransloading was underway, according to Akinbiyi, who urged the general public, particularly those living or traveling near the axis, to be calm and cooperative.\nAs of the time of reporting this article, it was not immediately clear if there had been any casualties.\nMeanwhile, motorists traveling inward on the Rounder axis from Lafenwa are advised to take the Olomore and Oke-Ata axes as alternate routes."
  },
  {
    "headline": "Jail breakers trapped in Jos Custodial Centre – Official",
    "summarized_story": "The Plateau state Medium Security Custodial Centre Jos Sunday came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\nPolice Public Relations Officer (PPRO) in Kaduna state, ASP Muhammed Jalige, said this on behalf of the Commissioner of Police Abdullahi Mudasiru.\nHe urged other members of the public to assist security operatives with prompt information as he assures them of absolute confidentiality while acting on the intel.\nHowever, the PPRO declined comment on whether ransom was paid to secure the release the abducted staff.\nHe added that the kidnappers did not release three of the abducted staff because some conditions for the release was N40m and three brand new motorcycles."
  },
  {
    "headline": "COVID-19 Omicron: WHO cautions on travel bans targeting Africa, rising concerns over spread in UK, EU countries",
    "summarized_story": "Putting in place travel bans that target Africa attacks global solidarity, the World Health Organisation (WHO) has said through its regional director for Africa, Matshidiso Moeti.\n“With the Omicron variant now detected in several regions of the world, putting in place travel bans that target Africa attacks global solidarity.\n“While investigations continue into the Omicron variant, WHO recommends countries to take a risk-based and scientific approach and put in place measures which can limit its possible spread.\nFlight bans have been imposed on southern African countries, but so far only two have detected the new variant.\nTravel restrictionsPREMIUM TIMES reported how countries moved to restrict travels from southern African countries following the emergence of the new variant."
  },
  {
    "headline": "Breaking: 4 killed, 12 injured as buses, trailer crash in Anambra",
    "summarized_story": "At least four persons died in a crash involving two buses and one trailer along Ihiala-Onitsha road by Ihiala police station in Ihiala Local Government Area of Anambra State.\nEyewitness told Blueprint that 12 persons equally sustained injuries in the crash which occured around 3pm on Sunday.\nAccording to the Sector Commander, Federal Road Safety Commission (FRSC), Anambra State Command, Mr Adeoye Irelewuyi, affected vehicles were Nissan caravan bus with registration number AAH-836-ZV; Nissan caravan bus with registration number number AWK-278-YD; and a mac trailer with no registration number.\nHe said, “Probable cause of crash was as a result of excessive speeding and brake failure.\nFree vehicular movements has been restored by FRSC rescue team, police and the military men.”"
  },
  {
    "headline": "Breaking: Chelsea cage Manchester United in Premier League clash",
    "summarized_story": "The much-talked about Premier League clash between Chelsea and Manchester United has ended in a 1-1 draw.\nJorginho’s goal for Chelsea cancelled the opener scored by United’s Sancho in the 50th minute inside Stamford bridge on Sunday evening.\nDetails loading…"
  },
  {
    "headline": "Breaking: Many scamper for safety as gunmen attack another correctional centre",
    "summarized_story": "Residents on Sunday afternoon witnessed heavy gunfire as gunmen attacked Jos correctional facility.\nThough, authorities are yet to confirm the latest development, eyewitness said the shootout lasted for sometimes which made people to scamper for safety.\nIn recent times, there have successful attacks on the various prison facilities in parts of the country with many inmates still at large.\nEarlier this year, four inmates reportedly escaped from Jos Correctional centre.\nDetails loading…"
  },
  {
    "headline": "FG ‘Monitoring’ New COVID-19 Variant Omicron, Advises Nigerians To Get Vaccinated",
    "summarized_story": "The Nigeria Centre for Disease Control on Sunday said it was monitoring emerging evidence on the new COVID-19 variant, Omicron, which was first recently identified in Southern Africa.\nThe new variant “is considered highly transmissible” and has already triggered a new wave of travel restrictions targeted at countries in Southern Africa.\n“Avoid travel to countries where there is a surge in COVID-19 cases or reported cases of the Omicron variant,” the NCDC said.\n“Therefore we appeal to business owners, religious leaders, and people in authority to take responsibility by ensuring people in their premises wear masks and adhere to physical distancing.\n“We must do all we can to protect ourselves and our country.”"
  },
  {
    "headline": "#EndSARS Panel Was Illegal – Keyamo",
    "summarized_story": "﻿The Minister of State for Labour and Employment, and a Senior Advocate of Nigeria, Festus Keyamo, has faulted the judicial panel of inquiry set up to investigate cases of police brutality and SARS-related abuses across the country.\nResponding to a question about the position of the government specifically regarding a leaked report by the Lagos judicial panel, the human rights lawyer described the panel as illegal.\n“For me, that panel was an illegal panel”.\nRELATED:#EndSARS Panel: Sanwo-Olu Sets Up Four-Member Committee For White Paper Report#EndSARS Panel Report A Waste Of Time, Taxpayers Money – Lai MohammedWhile the report has yet to be officially released, days later, the panel submitted its findings to Governor Babajide Sanwo-Olu.\nThe Nigerian army had, however, denied shooting live rounds at protesters, telling the judicial panel that only blanks were used."
  },
  {
    "headline": "[UPDATED] Gunmen Attack Jos Correctional Centre",
    "summarized_story": "Gunmen have attacked the Jos Correctional Centre in Plateau State.\nEmerging reports, however, suggest that security operatives have been able to repel the attack, although the identity of the assailants is yet to be verified.\nMilitary Information Officer for Operation Safe Haven, Major Ishaku confirmed this to Channels Television on Sunday evening.\nIshaku explained that personnel of the joint task force at the facility fought to curtail the attackers.\nThe spokesman did not reveal if there were any casualties and if any arrests have been made."
  },
  {
    "headline": "#EndSARS Report: SERAP Sues Buhari, Seeks Arrest Of Indicted Security Personnel",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has asked the Federal High Court in Abuja to compel President Muhammadu Buhari to ensure the arrest of security operatives involved in the shooting of peaceful #EndSARS protesters at the Lekki tollgate, and police brutality cases.\n“The safety of protesters in Nigeria remains as precarious as ever, and impunity for crimes against them is growing.\nJoined in the suit as Respondent is the Minister of Justice and Attorney General of the Federation, Mr Abubakar Malami, SAN.\n“The remedies must be accessible and effective remedies and take into account the special vulnerability of certain categories of person.\nThe leaked report is said to have indicted some soldiers and police officers for “the shooting of protesters, leading to grievous injuries and deaths."
  },
  {
    "headline": "PCRs Detect Omicron, Studies Under Way For Other Tests, Says WHO",
    "summarized_story": "While PCR tests can detect infection with Omicron, studies are looking to whether the Covid-19 variant of concern has any impact on other test types, the WHO said Sunday.\n“The widely-used PCR tests continue to detect infection, including infection with Omicron, as we have seen with other variants,” the World Health Organization said in an update on what is known so far about the new variant.\n“Studies are ongoing to determine whether there is any impact on other types of tests, including rapid antigen detection tests.”The WHO on Friday declared Omicron, first detected earlier this month in southern Africa, to be a variant of concern.\nThe classification put Omicron into the most troubling category of Covid-19 variants, along with the globally dominant Delta, and its weaker rivals Alpha, Beta and Gamma.\n“WHO is coordinating with a large number of researchers around the world to better understand Omicron,” it said."
  },
  {
    "headline": "Zamfara PDP Ward congresses In Progress across 147 Wards -",
    "summarized_story": "The people’s Democratic Party (PDP) in Zamfara ward congress is in progressThe congress is taking place simultaneously across the one hundred and forty Seven wards in the stateThe congress is to allow members of the party at the ward level to elect Officers of their choice that will will steer the ship of the party for the next four yearsAddressing newsmen shortly before the commencement of the congress in Gusau, Caretaker Committee Chairman of the Party in Zamfara Bala Mande says the party will conduct free and fair congressHe assured members of the party’s readiness to continue to practice Internally DemocraticTVC NEWS Monitored the congress of five wards in Gusau and embers were seen conducting their self in a peaceful mannerSabon Gari, Mayana, Madawaki, Tudun Wada and Galadima wards are conducting their Congresses at the GAPP Jenery in Gusau, the zamfara state CapitalA six man Appeal, Electoral and Screening, committee from the National Headquarters of the party led by Sunday Dogo are on ground to monitor the processOfficials of the Independent National Electoral Commission INCE and Security agencies are also present at the venueThe People’s Democratic Party in Zamfara says it has becomes necessary for the party to conduct it wards Congresses today to avoid clash with the All Progressive Congress which had it’s State Congress Saturday."
  },
  {
    "headline": "NANS rejects proposed subsidy removal, payment of N5000 to 4om Nigerians -",
    "summarized_story": "The National Association of Nigerian students has rejected the proposed subsidy removal of the federal government and payment of five thousand naira to 40 million poor Nigerians as transportation grant.\nThe students body threatened to shut down the country should the federal government fail to suspend its plans.\nAddressing journalists at a press conference in Abuja, they described the transportation grant as another window of corruption and excessive spending by the government."
  },
  {
    "headline": "Ondo Assembly Suspends Ifedore council Chairman",
    "summarized_story": "The Ondo State House of Assembly has suspended the Chairman of Ifedore local government of Ondo State, Hon Alex Oladimeji from office for three months for alleged gross misconducts.\nThe assembly gave announced his suspension despite a court order restraining it.\nThe embatlled Chairman had on Wednesday dragged the state House of Assembly, the Speaker and the Clerk before the State High Court to restrain them from carrying any suspension or impeachment against him under any guise.\nReacting to his suspension, the council chairman said the lawmakers’ decision was illegal."
  },
  {
    "headline": "Appeal Committee Begins Sitting In Gusau, Insist No Faction In Zamfara APC -",
    "summarized_story": "The All Progressive Congress APC appeal Committee on Zamfara ward and local government congresses says it has not received petition from any quata after five days of it’s sitting in Gusau, the state CapitalThe Committee also says the party is one and United in the state and has no FactionSecretary of the Committee set up by the National Headquarters of the APC Barr.\nSuleiman Usman Elegwu at a press conference says the Committee is committed to doing justice to it’s mandateThe Press Conference took place at the state party’s Secretariate of the Matawalle’s led FactionBarr.\nElegwu says the main objective of the committee is to receive complain from aggrieved members of the party regarding the just concluded ward and local government Congresses should there be anyThe five man APC appeal Committee led by its chairman Hamman Komo says it is yet to receive complain from any quata after five days of it’s sitting in GusauThe Committee also promises to be fair in the discharge of it’s responsibilitiesGovernor Bello Matawalle and Senator Kabiru Marafa’s Factions had conducted pararell congresses during the ward and local government congresses in the stateAPC Ward Congress in Zamfara held on Saturday 13th November while the Local Government congress held on Saturday 20th and the state Congress is expected to hold this Saturday 27th NovemberThe congresses has afforded members to elect officers of their choice that will steer the ship of the party at all levels in the next four yearsThe Governor Bello Matawalle’s led Faction and that of Senator Kabiru Marafa’s Faction has been at loggerhead since the Defection of Governor Bello from the PDP to the ruling APC in July this yearThe five man APC appeal Committee which is holding it’s sitting at the Headquarters of the Matawalle’s led Faction of the party is expected to complete it’s assignment before the State Congress of the party slated for Saturday, November 27thThe Committee also recognizes the Matawalle’s led Faction secretariate as the authentic in the state."
  },
  {
    "headline": "Virgil Abloh, Artistic Director for Louis Vuitton and Off-White Founder, Dies of Cancer at 41",
    "summarized_story": "Louis Vuitton artistic director and Off-White founder Virgil Abloh died Sunday of cancer, according to a tweet by luxury group LVMH.\n“LVMH, Louis Vuitton and Off White are devastated to announce the passing of Virgil Abloh on Sunday, November 28th, of cancer, which he had been battling privately for several years,” the tweet read.\n“We are devastated to announce the passing of our beloved Virgil Abloh, a fiercely devoted father, husband, son, brother, and friend.\nHe is survived by his loving wife Shannon Abloh, his children Lowe Abloh and Grey Abloh, his sister Edwina Abloh, his parents Nee and Eunice Abloh, and numerous dear friends and colleagues,” the post read.\n“For over two years, Virgil valiantly battled a rare, aggressive form of cancer, cardiac angiosarcoma."
  },
  {
    "headline": "Nigeria: NDLEA Intercepts 12,385kg of ‘Loud’ Cannabis on Lagos Waterways",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) at the weekend intercepted 12,385 kilogrammes of loud cannabis from getting into Lagos, the commercial capital of the country.\nAccording to a statement by the spokesman of NDLEA, Femi Babafemi, loud cannabis is a strong variant of the illicit weed imported from a neighbouring country (which name was not revealed) and smuggled into Lagos through the waterways.\nHe said those arrested are Abdulkadri Zakari, 24; Ka’abu Sausu, 45 and Lawrence Adie, 27.\nHe said other suspects arrested in Delta State on Thursday 25th November for dealing in meth, cannabis, cocaine, and heroin are Ifeanyi Odibe, Uche Onwurah, and Justice Obika.\nHe also charged them to always strive to record greater feats until the drug supply and drug demand reduction targets of the agency are fully achieved."
  },
  {
    "headline": "Sudan Military Says Several Soldiers Killed in Ethiopian Attack",
    "summarized_story": "Sudan’s military says several Sudanese soldiers were killed in an attack by Ethiopian forces in a disputed border region.\nBut the attack left “several killed” among Sudanese forces, it said, without giving a death toll.\nThe Reuters news agency, citing military sources, said at least six soldiers had been killed in the attack.\nAl-Fashaqa is a border zone long cultivated by Ethiopian farmers but claimed by Sudan.\nThe zone, which also borders Ethiopia’s troubled Tigray region, has seen sporadic deadly clashes between the two sides over the past years, but escalated last year."
  },
  {
    "headline": "Nigerian Celebrities Simi and Chigul Expose Sexism in Music and Nollywood",
    "summarized_story": "Nigerian celebrities have recently opened up publicly about the sexism they have faced after multi-award winning singer Simi spearheaded the #NobodyLikeWoman trend on Instagram.\nAs a famous artist in Africa and beyond, Simi said it summed up the sexism she had faced within her own industry of Afro music.\nNollywood actress Chioma Omeruah – famously known as Chigul – has witnessed similar struggles and believes the problem is cultural.\nBoth Chigul and Simi agree that the laws in Nigeria need to be tougher on those who discriminate against or attack women.\nHowever, Simi believes the fight for women’s rights in Africa cannot be compared with efforts in the West."
  },
  {
    "headline": "South Africa ‘Punished’ for Detecting New Omicron Variant",
    "summarized_story": "South Africa has complained it is being punished – instead of applauded – for discovering Omicron, a concerning new variant of Covid-19.\nHundreds of passengers arriving in the Netherlands from South Africa are being tested for the new variant.\nThe new Omicron variant was first reported to the WHO from South Africa on 24 November.\nThe bans were “akin to punishing South Africa for its advanced genomic sequencing and the ability to detect new variants quicker”.\nUS officials said foreigners would be blocked from travelling from South Africa, Botswana, Zimbabwe, Namibia, Lesotho, Eswatini, Mozambique and Malawi, mirroring earlier moves taken by the EU."
  }
]