[
  {
    "headline": "Full list: LASU drops, UNILAG rises in World University Rankings 2022",
    "summarized_story": "The University of Ibadan maintained its top spot in the 2022 Times Higher Education World University Rankings.\nOn its part, the Lagos State University dropped to sixth in Nigeria behind Covenant University, University of Ilorin, University of Nigeria, and Obafemi Awolowo University, Ile-Ife.\nThis is according to the 2022 Times Higher Education World University Rankings released in September 2021.\nThe Times Higher Education World University Rankings 2022 include more than 1,600 universities across 99 countries and territories, making them the largest and most diverse university rankings to date.\nAlthough only six universities feature in the Times Higher Education World University Rankings, the country is home to almost 130 institutions."
  },
  {
    "headline": "Pictorial: Lagos govt to restore Kudirat Abiola memorial cenotaph",
    "summarized_story": "The Lagos State government is set to restore and preserve the Kudirat Abiola Memorial Cenotaph located along Mobolaji Johnson Way, beside 7-Up Plant in Oregon, Ikeja.\nThis was approved by the state governor, Mr. Babajide Sanwo-Olu.\nThe Museum and Monuments Department of the State Ministry of Tourism, Arts and Culture had inspected the cenotaph on September 1, 2021, to ascertain the level of work done so far.\nThe monument was erected and commissioned in the year 2000 by Lagos State Government.\nRead AlsoKudirat Abiola, a democracy activist married to the late Chief Moshood Kashimawo Olawale Abiola, was killed on June 4, 1996."
  },
  {
    "headline": "Police arrest 3 suspects for allegedly diverting company’s goods worth N4.7m",
    "summarized_story": "The Police Command in Ogun on Sunday, said they have arrested three suspects for allegedly diverting a company’s goods, worth N4.7 million.\n“The suspects were arrested following a report made at Agbara Divisional Headquarters on Aug. 29, by one Oluwatosin Ayodeji.\nREAD ALSO: Police kill two notorious cultists in Rivers“The complainant, reported that Oyetunde, a driver to the company, loaded goods worth N4.7 million, to be delivered to a customer in Lagos but allegedly absconded with the goods and truck since Aug. 24.\nHe said his confession led the policemen to the shops of the two receivers, Oluwaseun and Ogbu, where parts of the stolen goods were recovered and the two duo arrested.\nMeanwhile, the Commissioner of Police in the state, CP Edward Ajogun, had ordered full investigations into the case, to recover the remaining stolen goods, and prosecute the suspects."
  },
  {
    "headline": "Yahaya Bello condemns Olajide Sowore’s killing, commiserates with family",
    "summarized_story": "Governor Yahaya Bello of Kogi has condemned the killing of Mr Olajide Sowore, younger brother to former Presidential candidate, Mr Omoyele Sowore.\nOlajide was killed on Saturday in Okada, Edo.\nThe governor in a condolences message signed by his Chief Press Secretary, Mr Muhammed Onogwu, commiserated with the Sowore family, stating that the death of Olajide was indeed a painful one.\nThe governor said the 50-year-old Olajide Sowore, a student of Pharmacy at the Igbinedion University, Okada, was making such remarkable feat at that age, hence served as an inspiration and example of a determined individual.\nHe prayed for God to give the family the fortitude to bear the loss, urging security operatives not to leave any stone unturned to unravel those behind such act of callousness."
  },
  {
    "headline": "Gunmen abduct Dodo of Wawa in Niger",
    "summarized_story": "By Wole Mosadomi, MINNAThe District Head of Wawa in Borgu Local Government Area of Niger State, Alhaji Mahmud Ahmed Aliyu, has been kidnapped.\nThe traditional ruler called “Dodo of Wawa” was abducted by unknown gunmen from his palace on Saturday night around 10pm.\nThey took Dodo of Wawa to an unknown destination.\nWawa town is a border town to Benin Republic.\nThe District Head was installed as Dodo Wawa in 2010."
  },
  {
    "headline": "NDLEA intercepts drugged candies from UK, nabs 22-year-old NYSC importer",
    "summarized_story": "**Seizes Cookies, Cocaine going to Dubai, Saudi Arabia; 500kg seized in 8 statesBy: Kingsley Omonobi – Abuja.\nOperatives of the National Drug Law Enforcement Agency have arrested a 22-year-old Youth Corps Member, Arnold Maniru in Abuja for importing 4 kilograms of drugged candies from the United Kingdom.\nAlso, National Drug Law Enforcement Agency, NDLEA operatives in Lagos intercepted another set of cookies laced with drugs going to the United Arab Emirates.\n“A controlled delivery of the parcel, which contains the candies laced with Arizona, a strong variant of cannabis and some liquid, was subsequently carried out”.\nCuriously, Caleb is on court bail, for two earlier charges filed against him by the state command of the NDLEA."
  },
  {
    "headline": "Troops burst drug syndicate in Plateau; seize 320 blocks of cannabis, arrest 60-yr-old ex-Police officer",
    "summarized_story": "Troops of Operation Safe Haven (OPSH) on Saturday burst a drug syndicate in Plateau State and recovered 320 blocks of Indian hemp worth 9.5 million naira concealed in a Toyota Camry car with registration number Abuja ABC 214 HV.\nThe suspects and items recovered have been handed over to the National Drug Law Enforcement Agency, Plateau State command for further investigation.\nWhile commending troops for their vigilance, Commander OPSH, Major General Ibrahim Ali reiterated the determination of his command to flush out criminal elements on the Plateau and environs.\nHe said OPSH will not rest on its oars until criminals and their collaborators are annihilated.\nHe equally urged law-abiding citizens to continue to support security agencies with credible information on criminal activities."
  },
  {
    "headline": "Shakeup as INEC redeploys five RECs, four directors",
    "summarized_story": "The Independent National Electoral Commission, INEC, on Sunday announced the deployment of five state Resident Electoral Commissioners (RECs).\nINEC National Commissioner and Chairman, Information and Voter Education Committee, Mr Festus Okoye, made this known in a statement on Sunday.\nProf. AbdulGaniyu Raji, redeployed from Ogun to Osun State; and Zamfara REC, Dr Asmau Sani Maikudi, redeployed to Kaduna State.\nOkoye said that the INEC Director (Voter Education and Publicity), Mr Nick Dazang, had proceeded on terminal leave and the handing/taking over activities would be completed by Monday September 13.\nMr Yakubu Duku, Director in the Electoral Operations Department, proceeds to Niger as the substantive Administrative Secretary.”"
  },
  {
    "headline": "Shingles may result from poorly treated chicken pox – Physician",
    "summarized_story": "A physician, Dr Olakunle Omoteemi, has revealed that one of the causes of shingles may be connected to chicken pox infection whose virus remained dormant in the body after healing.\nAccording to Dr Omoteemi, the virus, Varicella Zoster, which is responsible for chicken pox infection remains in the human body and may reactivate to cause the painful rash known as shingles or Herpes Zoster.\nHe advised Nigerians who are yet to be vaccinated against chicken pox to do so because it is a contagious disease which hibernates to later resurface as shingles.\n“A chickenpox vaccine in childhood or a shingles vaccine as an adult can minimise the risk of developing shingles.\nHe also counselled against the use of herbal remedies in the treatment of chicken pox adding that medical research has shown that shingles is caused by viruses that remain recluse for years before it comes back to life again."
  },
  {
    "headline": "Imo flooding: Group blames ex-gov, Okorocha’s technical errors",
    "summarized_story": "A group of Imo youths under the auspices of Global Association of Concerned Imo Youth (GACIY) on Sunday blamed the former governor of the state, Rochas Okorocha, for massive floods that submerged houses in some parts of the state.\n“The recent flooding witnessed in some parts of Owerri was therefore as a result of ongoing construction works, which the Government is addressing urgently.\nGovernment has also commenced another round of de-silting the drainage and would soon address the menace of flooding in Akwakuma and other areas.\n“Imo people, we need not see the challenge of flooding as a political problem.\nAnd the flooding we see today in some parts of Owerri, we shall see them no more.”"
  },
  {
    "headline": "Biafra, Yoruba nation: Unserious people agitation for breakup – Oyetola blasts Nnamdi Kanu, Igboho",
    "summarized_story": "The Osun State Governor, Gboyega Oyetola, on Sunday criticized those agitating for Yoruba nation and Biafra Republic.\nOyetola said those agitation for secession are “unserious” people.\nFeaturing on the News Agency of Nigeria, NAN, Forum, Oyetola harped on Nigeria’s unity.\n“Give the states more support, and I believe we should look at the issue of revenue allocation.\nWe should allow the states to have more funds to develop some of the things they have,” Oyetola said."
  },
  {
    "headline": "Suspected bandits abduct traditional ruler in Niger",
    "summarized_story": "The Dodo of Wawa, Dr. Mahmud Ahmed Aliyu of Borgu in New Bussa Local Government Area of Niger State has been allegedly abducted by armed bandits.\nThe traditional ruler was kidnapped in his palace at about 10 pm Saturday night, DAILY POST gathered.\nOur correspondent learnt that the gunmen stormed the area and went straight to the royal father’s palace, shooting into the air to scare people away before whisking him away.\n” They arrived on motorcycles at 10 pm yesterday and shooting into the air that threw the whole palace and the area into panic.\nHe stated that a Police tactical team have been dispatched to search and rescue the traditional ruler as well as arrest the hoodlums."
  },
  {
    "headline": "Onitiri urges caution over IPOB, ESN crisis",
    "summarized_story": "Renowned socio-political activists and critic, Chief Adesunbo Onitiri has impressed on the Presidency the need to tread softly over the festering crisis involving the former and IPOB, ESN.\nSpeaking in Lagos yesterday Onitiri said this admonition is imperative, so as not to be misconstrued by Nigerians and international community as a clampdown on the Igbo people.\nOnitiri explained that no Nigerian would accept any tribe to stockpile arms or declare war against the nation.\nADVERTISEMENT“The Boko Haram, bandits and terrorists have clearly overwhelmed our military.\nAny government that cannot protect lives and properties of its citizens has no business to remain in power,” he alleged."
  },
  {
    "headline": "Triller announces new specially-curated playlist for Africans",
    "summarized_story": "Triller has announced the launch of Pan-African and localised country playlists specifically curated for fans in Africa.\nThree other Pan African playlists bring a more genre-specific experience.\nSimilarly, Amapiano features all of the rising stars from this South African-born genre as well as a burgeoning number of Amapiano genre collabs from across the continent.\nThis is the place to discover Drill/Rap made in Africa by Africans – from Ghana to Nigeria and down to South Africa.\nA Gospel playlist features in the lineup for Nigeria too, where it joins the Lamba and New Wave playlists."
  },
  {
    "headline": "I had only 25 pounds when I released Ijoya in Nigeria – Weird MC",
    "summarized_story": "Rapper Weird MC has revealed how she came back home with just 25 pounds to release her hit song ‘Ijoya’ in 2006.\nWeird MC recently shared reasons to take a risk on an Instagram live.\n“But Ahbu will go and come and at that point, I knew there was something spiritual, so I prayed, there were times that I wept, I’m human.\nI was determined, it was the same Ahbu who now came back.”She further disclosed how God used Ahbu’s ventures wife to get her a marketing deal.\nIt topped all audio and video charts for eight straight weeks and was No 1 on MTV Base."
  },
  {
    "headline": "PDP crisis deepens as Secondus, Wike differ on peace terms",
    "summarized_story": "While he is willing to withdraw court case, Wike must show concrete commitment to peace by withdrawing the court case against him (Secondus) too.\nConsequently, the Mark committee may meet with Secondus and members of the National Working Committee (NWC) tomorrow or Tuesday.\nThe source said: “The governor listed his terms which he felt will help resolve the PDP crisis and pave the way for a smooth, free and fair national convention.\nIt was similarly gathered that Mark panel members will meet with NWC members between Monday and Tuesday.\nSecondus on Wednesday expressed willingness for an out-of-court resolution of the crisis that led to his suspension from office."
  },
  {
    "headline": "Shake up in INEC, 5 RECs, 4 directors redeployed",
    "summarized_story": "Others are; Bayelsa State REC, Dr Cyril Omorogbe, who takes up his new role in Cross River State, Dr Emannuel Alex Hart will proceed to Bayelsa State as the REC from his former Cross River office, while Zamfara State REC, Dr Asmau Sani Maikudi, has been redeployed to Kaduna State.\nTitled ‘redeployment of five RECs and four Directors, the statement read: “INEC has redeployed five RECs.\nIn the new postings, the REC, Osun State, Olusegun Agbaje, has been redeployed to Ogun State.\nThe REC, Zamfara State, Dr Asmau Sani Maikudi, has also been redeployed to Kaduna State.\n“Similarly, the Director (Voter Education and Publicity), Nick Dazang, has proceeded on terminal leave."
  },
  {
    "headline": "Niger: District head of Wawa abducted, bandits demand N100 million ransom",
    "summarized_story": "The Dodo of Wawa, as the District Head is popularly referred to, was abducted by the heavily armed men from his palace on Saturday night.\nThe Wawa town where the district head was abducted is about two kilometres from the 221 Wawa Military Cantonment in Borgu.\nAccording to eyewitnesses, the gunmen took the district head through the Kainji National Park and headed towards the Benin Republic border.\nThe Dodo of Wawa is reputedly the richest district head in Borgu Emirate, with a doctorate degree in Environmental Science from Malaysia.\nAlhaji Aliyu is the fifth district head to be abducted in the state by gunmen in the last six months."
  },
  {
    "headline": "Terrorism: Deal with bandits now, Northern govs’ wives tell husbands",
    "summarized_story": "She, however, called on relevant authorities to permanently nip the scourge in bud to allow children get sound education.\nOn short-term basis, it is what the state governments are already doing especially in Kaduna and Zamfara states.\nMeanwhile, I believe the government is doing all it can to see that these bandits are defeated once and for all.\n“And I believe that the President and all the people involved to do the right thing are doing the right thing.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NCC shuts down telecoms service in Zamfara",
    "summarized_story": "By Chinenye Anuforo (Lagos) and Adanna Nnamani (Abuja)Nigerian Communications Commission (NCC) has directed all telecommunications providers to shut down services in Zamfara State.\nIn line with this requirement, NCC directed the operators “to shut down all sites in Zamfara State and any site(s) in neighbouring states that could provide telecommunications service in Zamfara State,” stressing that site shutdown would last for two weeks in the first instance.\nWhile the directive was specific about Zamfara State, the reference to any other facilities in any site(s) in neighbouring states that could provide telecommunications service in Zamfara State, meant that other states sharing boundaries with the state would be affected by the shutdown.\nThis decision is coming six months after the Federal Government declared Zamfara State a ‘no-fly zone’ and banned all mining activities in the state.\nNorthwestern Zamfara shares boundaries with Sokoto, Kebbi, Niger, Kaduna, and Katsina State, home state of the president."
  },
  {
    "headline": "Guber poll: Zoning tears Southeast apart",
    "summarized_story": "“So, because of this thing that happened then, I don’t think there is anything like zoning in Enugu State.\nIn 1999, when Chimaroke Nnamani from Enugu East, Victor Nduka Agu from Enugu West and Gbazueagu (Nweke Gbazueagu), also from Enugu West contested, there was no zoning.\nIn 2007, it was Okey Ezea from Enugu North versus Sullivan Chime and Ugochukwu Agballah from Enugu West.\nIn 2011, it was Okey Ezea from Enugu North and then incumbent, Sullivan Chime from Enugu West.\nAs leader of the party in the state, Governor Ikpeazu came out strongly to douse the rising tension."
  },
  {
    "headline": "Just In: District Head Kidnapped in Niger",
    "summarized_story": "By Laleye DipoThe District Head of Wawa in the Borgu emirate of Niger state Alhaji Mahmud Ahmed Aliyu has been kidnapped.\nThe District Head popularly called the Dodo of Wawa was abducted by unknown gunmen from his palace on Saturday night.\nIt was gathered that the heavily armed gunmen stormed the district Head palace at about 10pm and started shooting sporadically causing panic within the palace and the entire community.\nA source said the gunmen took Alhaji Aliyu through the Kainji National Park, towards Benin Republic.\nWhen contacted, Police Public Relations Officer Niger State Police Command DSP Wasiu Abiodun confirmed the incident."
  },
  {
    "headline": "Parallel Congresses Hit APC in Lagos, Oyo, Sokoto, A’Ibom, Ogun, Others",
    "summarized_story": "Two factions of the APC also held parallel congresses in some local government areas in Oyo State.\nIn Sokoto State, THISDAY gathered that two LG executives emerged from the parallel congresses held.\nOn the eve of yesterday’s congresses, the seven-man congress committee led by Mr. Wale Ohu had cautioned the APC members in the state against holding parallel congresses.\nThe two APC factions in Lagos State also held parallel local government congresses across the 245 wards of the 20 local government areas of the state.\nIn Bayelsa State, a faction of the party held congresses despite a court order that restrained the party from holding congresses in the state."
  },
  {
    "headline": "Govs Caution FG over Payment of $418m Paris Club Refund to Six Consultants",
    "summarized_story": "The governors argued that the said payment is already an issue of litigation.\nAccording to the senior lawyer, the governors on August 3, 2021, got wind of the federal government’s move to effect the payment.\n“The Minister of Finance is said to have directed the Director-General, Debt Management Office (DMO) to issue Promissory Notes in favour of the Consultants.\nHe explained that the consultants relied on judgments of the Federal High Court which are presently being challenged by the 36 governors in several actions in various courts.\n“The nation is already going through economic adversity and every dollar is needed to be channelled to people-oriented projects."
  },
  {
    "headline": "Kaduna LG Polls: El-Rufai Loses Polling Unit to PDP",
    "summarized_story": "By John Shiklam in KadunaKaduna state governor, Mallam Nasir El-Rufai, lost his polling unit to the opposition Peoples Democratic Party (PDP) in Saturday’s Local government elections .\n“We will allow the people of Kaduna state to elect who they want, we do not have to win everywhere.\nOur correspondence who visited some polling units in Kaduna South and Kaduna North LGAs, noted the general apathy among residents.\nIn Gidan Hakimi, Kakuri polling unit, Kaduna South LGA, both the agents of the APC and the PDP, confirmed that people did not come out to vote.\nAlso at the Abubakar Kigo LEA Primary School polling unit, Kaduna North LGA, election officials were idle as people did not turn out."
  },
  {
    "headline": "Marwa Recommends Drug Test Before Marriage",
    "summarized_story": "Michael Olugbode in AbujaChairman/Chief Executive of the National Drug Law Enforcement Agency (NDLEA), Brig.-Gen. Mohamed Buba Marwa has emphasised the need for pre-marital drug tests as a key factor to a stable home.\nMarwa’s wife, who is the chief host of the conference, Mrs Munirat Marwa also emphasised the need for drug test before marriage, warning that drugs are destroying many marriages, families and communities.\nAt the conference, Marwa said substance use “has been known not only to destroy marriages but equally lead to health problems, morbidity, injuries, violence, and death.\nIn her remarks, Marwa urged youths preparing for wedding to take drug test as part of their preparations, adding that there is a difference between wedding and marriage.\n“It is therefore important we pay attention to preparing for the marriage and one of such ways is through pre-marital counselling and drug test."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "Gunmen abduct traditional ruler in Niger",
    "summarized_story": "Gunmen have abducted Mahmud Aliyu, the Dodo of Wawa, a traditional ruler in New Bussa, headquarters of Borgu LGA of Niger state.\nAdvertisementThe traditional ruler was reportedly abducted from his palace on Saturday.\nWasiu Abiodun, police spokesperson in Niger, confirmed the incident to TheCable on Sunday.\nIn a related development, bandits have killed 15 persons in Magami village, Shiroro LGA of Niger.\nWhile scores of others are still missing – probably killed too.”Kokki said the residents of Magami have fled to Kuta, the headquarters of Shiroro LGA, for safety."
  },
  {
    "headline": "Gunmen abduct traditional ruler in Niger",
    "summarized_story": "Gunmen have abducted Mahmud Aliyu, the Dodo of Wawa, a traditional ruler in New Bussa, headquarters of Borgu LGA of Niger state.\nAdvertisementThe traditional ruler was reportedly abducted from his palace on Saturday.\nWasiu Abiodun, police spokesperson in Niger, confirmed the incident to TheCable on Sunday.\nIn a related development, bandits have killed 15 persons in Magami village, Shiroro LGA of Niger.\nWhile scores of others are still missing – probably killed too.”Kokki said the residents of Magami have fled to Kuta, the headquarters of Shiroro LGA, for safety."
  },
  {
    "headline": "Oyetola: My disagreement with Aregbesola exaggerated -- he's my brother",
    "summarized_story": "Adegboyega Oyetola, governor of Osun state, says his disagreement with his predecessor, Rauf Aregbesola, was exaggerated.\nThe governor said he has no personal disagreement with Aregbesola, minister of interior, whom he described as a brother and well-wisher.\n“Let me say this, Ogbeni and I are brothers, yes, we can have little disagreements; these are not unexpected,” Oyetola said.\n“Like I mentioned, policies are supposed to be reviewed from time to time.\nWell, I have said it that he is my brother and I believe he will want to ensure my success."
  },
  {
    "headline": "Oyetola: My disagreement with Aregbesola exaggerated -- he's my brother",
    "summarized_story": "Adegboyega Oyetola, governor of Osun state, says his disagreement with his predecessor, Rauf Aregbesola, was exaggerated.\nThe governor said he has no personal disagreement with Aregbesola, minister of interior, whom he described as a brother and well-wisher.\n“Let me say this, Ogbeni and I are brothers, yes, we can have little disagreements; these are not unexpected,” Oyetola said.\n“Like I mentioned, policies are supposed to be reviewed from time to time.\nWell, I have said it that he is my brother and I believe he will want to ensure my success."
  },
  {
    "headline": "Grazing reserves: FG should stop creating problems for governors, says Falana",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), has asked President Muhammadu Buhari to allow state governments to handle open grazing matters.\nAdvertisementAs a way to curb farmer-herder clashes, some states have banned open grazing.\nBut in August, the president approved the review of 368 grazing reserves across 25 states in the country.\nToday, the governors of Kaduna, Zamfara and Katsina states have banned the interstate movement of cattle.\nWhich is a ban on open grazing."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Why Nigeria’s 2021 broadband penetration may not beat 2020 peak",
    "summarized_story": "Twenty-twenty was the year Nigeria saw the most growth in broadband penetration and by December of every year since 2018, the numbers have closed higher than what it began with in January.\nThis is likely not going to repeat in 2021.\nThe Nigerian Communications Commission (NCC) the regulator that compiles the report on broadband penetration…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Sept 1 deadline on anti-open grazing law: Bureaucracy or lack of political will?",
    "summarized_story": "About eight states- Ekiti, Ondo, Abia, Oyo, Delta, Enugu, Bayelsa, and Rivers- have enacted laws banning open grazing.\nThere is nothing on ground to indicate that anti-open grazing law is underway in Cross River, Ebonyi, Imo and Anambra states.\nThe Anambra State government had consistently said it had no plan to enact anti-open grazing law in the state because of “the cordial relationship with herders” in the state.\nUzodimma was reported to have said that there was no law forbidding open grazing by cattle rearers in Imo State.\n“Almost all the governors are buying into the idea that open grazing is no more feasible in this modern time."
  },
  {
    "headline": "Why Nigerian politicians dread leaving office",
    "summarized_story": "Although Mamman has since denied he collapsed, saying he had been ill and had been receiving treatment before the sack was announced, it has been discovered that Nigerian politicians degenerate very fast a soon as they leave office.\nIt has also been discovered that a number of them do not enjoy sound health immediately they leave office, despite the money and property they have acquired while in office.\nTo career politicians, politics is seen as an end in itself and not a means to an end.\n“Again, most Nigerian politicians do not have a second address.\nSo, they are always thinking what would happen if they leave office."
  },
  {
    "headline": "Need for President Buhari to provide crude oil for Edo modular refinery – Nigerian Observer",
    "summarized_story": "I am appealing to President Buhari to provide crude oil to Edo modular refinery since NNPC cannot perform its function.\nEdo modular refinery needs crude before it becomes an abandon project because NNPC cannot give it crude oil to refine.\nMy special appeal to President Buhari is to give crude oil to Edo modular refinery at Ologbo to start its operation.\nIf President Buhari can give Edo modular refinery now, Edo Modular refinery will increase crude oil production from 6,000 barrels per day (bpd) to 60,000 bpd.\nEdo modular refinery has been waiting since July, 2021 to commence operation and NNPC has refused to supply crude oil to Edo modular refinery."
  },
  {
    "headline": "How man butchered motorcycle operator, steals bike – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUgo-N’urokorionmwon — One Abubakar Bello has butchered to death a 29-year old commercial motorcyclist, Usman Mohammed from Niger state around Owe Community in Orhionmwon local area of Edo state and took away his bike.\n“them dey stay together and work together for Ugo here and na the labourer work the Usman (deceased) take gather money to buy the bike wen Bello thief.\n“na job him be wan dey ready go before Bello deceive am say make him carry am go Agbor.\nThe source confirmed the police arrested Anthony following Bello’s confession that he sent him to commit the dastardly act.\n“we still dey wait for State CID to send signal to the station to release am for us."
  },
  {
    "headline": "UTME: Obaseki commends Aidelogie’s performance as best in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended the performance of Ehizogie Jeffrey Aidelogie, who emerged as the best candidate in the state in the Unified Tertiary Matriculation Examination (UTME), organised by the Joint Admission and Matriculation Board (JAMB).\nAidelogie also ranks among the first ten highest scorers in the 2021 UTME which held across the country.\nObaseki commended Aidelogie when he received him in his office at the Government House, Benin City, the Edo State Capital.\nWe are investing at the very foundational stage of education with the Edo Basic Education Sector Transformation (EdoBEST) programme.\nEarlier, Ehizogie Jeffrey Aidelogie, who scored 347 in the exam, ascribed the success to hard work and support from his teacher, classmates and his parents."
  },
  {
    "headline": "JARA stores new outlet launch set for Sept. 8 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Nigeria’s leading discount retail outlet, JARA stores, will on Wednesday, September 8, launch its new store in BDPA Estate, Ugbowo, Benin City, to members of the public, promising an exciting shopping experience for residents in Benin metropolis.\nThe new store is the second outlet to open in Benin City, after the first outlet opened to the public in 2020.\nJARA stores is being operated in Benin City through a Memorandum of Understanding (MoU) between the Edo Development and Property Agency (EDPA) and the EDLP Nigeria Limited.\nA representative of JARA stores, Ayo Bademosi, in a statement, said the opening of the store has been fixed for Wednesday, September 8, 2021.\nAccording to her, “We are officially commissioning the new outlet at BDPA Estate in Ugbowo, Benin City, on September 8, 2021."
  },
  {
    "headline": "INEC redeploys five RECs, four directors",
    "summarized_story": "ADVERTISEMENTThe Independent National Electoral Commission (INEC) has redeployed five state Resident Electoral Commissioners (RECs).\nINEC disclosed this in a statement on Sunday in Abuja by Festus Okoye, its National Commissioner and Chairman, Information and Voter Education Committee.\nMr Okoye said that those affected include Olusegun Agbaje, who was redeployed from Osun to Ogun and AbdulGaniy Raji, who was redeployed from Ogun to Osun.\nMr Okoye said that the INEC Director (Voter Education and Publicity), Nick Dazang, had proceeded on terminal leave.\nMr Okoye said that the redeployments were part of the commission’s routine administrative postings."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "APC L.G Congress: Osun Deputy Gov. Alabi, Oyebamiji, others express satisfaction with conduct in state",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State deputy governor, Mr Benedict Alabi, members of the National Committee on Local Government Congress, among others, have expressed satisfaction with the peaceful conduct of Saturday’s All Progressives Congress (APC) Local Government Congress in the state, noting that there was no parallel congress anywhere.\nOyebamiji also expressed satisfaction on the conduct of the national delegation under the chairmanship of Hon.\nCommittee Express SatisfactionSimilarly, members of the National Committee on Local Government Congress of the party expressed satisfaction over the peaceful conduct of the party’s members in the State.\nGbenga Elegbeleye, lauded the peaceful conduct of the party loyalists, describing it as commendable and worthwhile.\nAs you all know, the party’s members have reposed confidence in you and you must justify this and you must not disappoint them,” Oyetola added."
  },
  {
    "headline": "Tokyo Paralympics: Ugwunwa takes javelin gold to bring Nigeria’s medal haul to 10",
    "summarized_story": "Nigeria’s Flora Ugwunwa has won gold for Nigeria in the women’s F54 javelin event at the Tokyo Paralympics, to bring the country’s medal haul to 10, two less than it managed in Rio 2016.\nUzbekistan’s Nurkhon Kurbanova took the silver medal as Yang Liwan of China finished with bronze.\nSimilarly, Lauritta Onye won bronze in the women’s F40 shot put event, falling short of retaining her gold medal from Rio.\nOverall, Nigeria finished Tokyo Paralympics with 10 medals from three events.\nAthletics brought the second-largest haul — one gold and two bronze; while table tennis added just a bronze medal."
  },
  {
    "headline": "NIPC’s profit rises by 1,632% to N2.32 billion in 2020",
    "summarized_story": "The Nigerian Investment Promotion Council (NIPC) has reported 1,632% rise in profit to N2.32 billion for the 2020 financial year, compared to the N134.16 million recorded in the corresponding period of 2019.\nThe agency’s total expenditure hit a three year low of N1.51 billion during the period under review, compared to the N2.04 billion (2018 FY) and N2.2 billion (2019 FY).\nHighlights:Gross Income grew by 62% Year-on-Year from N2.37 billion recorded in FY 2019 to N3.83 billion in the period under review.\nEstablishment costs declined by 70% Year-on-Year, from N104.7 million in FY 2019 to N31.78 million during the period under review.\nSurplus surged by 1,632% Year-on-Year, from N134.16 million in FY 2019 to N2.32 billion in the period under review."
  },
  {
    "headline": "EFCC says Lekki, Lagos now headquarters of internet fraud",
    "summarized_story": "Nigeria’s anti graft agency, the Economic and Financial Crimes Commission (EFCC), has said that Lekki, the fast-developing upper middle-class area of the Lagos metropolis, is emerging as the new hub of Internet scammers.\n“Between April and June 2021, the Advance Fee Fraud and Cyber Crime Sections of the Lagos Command recorded a total of 402 internet-related fraud arrests,” the commission said.\nIkorodu and Alagbado on the Lagos Mainland make up the remainder.\n“Analysis of the data from the Cybercrime Section further shows that the dominant form of Internet crime is dating scam/online dating scam/romance scam.\n“A total of $12,512.49 was recovered from the e-wallet accounts of four suspects within the period,” Uwujaren said"
  },
  {
    "headline": "Frank Faults Submission Of NDDC Forensic Audit Report To AGF",
    "summarized_story": "A former deputy national publicity secretary of the All Progressives Congress (APC), Comrade Timi Frank, on Sunday, condemned the submission of the forensic audit report on the Niger Delta Development Commission (NDDC) to the Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN).\nRecall that the report was received from Akpabio on Thursday last week by Malami, reportedly on behalf of the President.\nADVERTISEMENTFrank in a statement in Abuja said: “Why should Malami receive a report of a committee he did not constitute?\nMalami and Akpabio are both ministers under Buhari.\n“If this macabre drama between Akpabio and Malami was not orchestrated to undermine Buhari, then what was it meant to achieve?"
  },
  {
    "headline": "Frank Faults Submission Of NDDC Forensic Audit Report To AGF",
    "summarized_story": "A former deputy national publicity secretary of the All Progressives Congress (APC), Comrade Timi Frank, on Sunday, condemned the submission of the forensic audit report on the Niger Delta Development Commission (NDDC) to the Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN).\nRecall that the report was received from Akpabio on Thursday last week by Malami, reportedly on behalf of the President.\nADVERTISEMENTFrank in a statement in Abuja said: “Why should Malami receive a report of a committee he did not constitute?\nMalami and Akpabio are both ministers under Buhari.\n“If this macabre drama between Akpabio and Malami was not orchestrated to undermine Buhari, then what was it meant to achieve?"
  },
  {
    "headline": "Gov Bello Condemns Sowore’s Brother’s Killing",
    "summarized_story": "Kogi State governor, Yahaya Bello, has condemned the killing of Mr Olajide Sowore, younger brother of former presidential candidate, Mr Omoyele Sowore, who was killed on Saturday in Okada, Edo State.\nThe governor in a condolence message signed by his Chief Press Secretary, Muhammed Onogwu, commiserated with the Sowore family, stating that the death of the younger Sowore was indeed a painful one.\nGovernor Bello said the evil men who carried out such an act of cowardice on a harmless citizen must be fetched out and brought to book, adding that no life should be lost in such a barbaric manner.\nADVERTISEMENTWhile he prayed for God to give the family the fortitude to bear the loss, the governor tasked security operatives not to leave any stone unturned to unravel those behind such act of callousness"
  },
  {
    "headline": "Gov Bello Condemns Sowore’s Brother’s Killing",
    "summarized_story": "Kogi State governor, Yahaya Bello, has condemned the killing of Mr Olajide Sowore, younger brother of former presidential candidate, Mr Omoyele Sowore, who was killed on Saturday in Okada, Edo State.\nThe governor in a condolence message signed by his Chief Press Secretary, Muhammed Onogwu, commiserated with the Sowore family, stating that the death of the younger Sowore was indeed a painful one.\nGovernor Bello said the evil men who carried out such an act of cowardice on a harmless citizen must be fetched out and brought to book, adding that no life should be lost in such a barbaric manner.\nADVERTISEMENTWhile he prayed for God to give the family the fortitude to bear the loss, the governor tasked security operatives not to leave any stone unturned to unravel those behind such act of callousness"
  },
  {
    "headline": "JUST-IN: Gunmen Kidnap Traditional Ruler In Niger",
    "summarized_story": "The Dodo of Wawa, Dr Mahmud Ahmed Aliyu, was Saturday night kidnapped by unknown gunmen.\nIt was learnt that the traditional ruler was abducted from his palace in Wawa, a suburb of New Bussa, the headquarters of Borgu local government areaDetails later…"
  },
  {
    "headline": "BBNaija 6: Why I can’t date Pere, Queen likes attacking me—Maria",
    "summarized_story": "He was always in my space, so if it was a strategy, I would have been the one going to him.\nI don’t have to clarify anything with Pere anymore because we already had that conversation in the house.\nWhen I came out, I saw some video clips of what he said, not just the rumours going round.\nWhy would I want to continue to be his friend?”She also stated vehemently that there was no form of intimacy between her and Pere.\nIf anybody didn’t, they had the option of turning off their TV sets.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BBNaija 6: Why I can’t date Pere, Queen likes attacking me—Maria",
    "summarized_story": "He was always in my space, so if it was a strategy, I would have been the one going to him.\nI don’t have to clarify anything with Pere anymore because we already had that conversation in the house.\nWhen I came out, I saw some video clips of what he said, not just the rumours going round.\nWhy would I want to continue to be his friend?”She also stated vehemently that there was no form of intimacy between her and Pere.\nIf anybody didn’t, they had the option of turning off their TV sets.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "CAN condemns bandits’ release of kidnapped Baptist pupils in batches",
    "summarized_story": "The Christian Association of Nigeria has faulted the release of pupils of Bethel Baptist School in Kaduna in batches by bandits, saying that was not what they bargained with the pupils’ parents.\nHayab said, “We are not in a position to decide what bandits should do because the activities of bandits are illegal.\nWhat Nigerians simply want today is we want to see our government putting bandits on the run.\n“The school and parents have never negotiated for our children to be released in batches but we wanted them at once.\nJust as the bandits took the 121 students same day, we expected that they will return them at the same time."
  },
  {
    "headline": "CAN condemns bandits’ release of kidnapped Baptist pupils in batches",
    "summarized_story": "The Christian Association of Nigeria has faulted the release of pupils of Bethel Baptist School in Kaduna in batches by bandits, saying that was not what they bargained with the pupils’ parents.\nHayab said, “We are not in a position to decide what bandits should do because the activities of bandits are illegal.\nWhat Nigerians simply want today is we want to see our government putting bandits on the run.\n“The school and parents have never negotiated for our children to be released in batches but we wanted them at once.\nJust as the bandits took the 121 students same day, we expected that they will return them at the same time."
  },
  {
    "headline": "SERAP to ICC: Hold Buhari, Matawalle liable for school abductions",
    "summarized_story": "The persistent failure of Nigerian authorities at both the federal and state levels to end school abductions amounts to crimes against humanity within the jurisdiction of the International Criminal Court (ICC).\nSocio-Economic Rights and Accountability Project (SERAP) made this submission in a petition to the ICC on Saturday.\nIt was the first time that an organisation has asked the ICC to hold accountable President Buhari, Governor Bello Matawalle, other governors and security agencies for failing to protect schoolchildren from bandits.\nA. Khan, ICC prosecutor, the organization urges him “to investigate the growing cases of abduction of students in several parts of Northern Nigeria.\nSome 13 million Nigerian children are out of school nationwide."
  },
  {
    "headline": "Bandits abduct Niger monarch Mahmud Ahmed",
    "summarized_story": "Suspected bandits have abducted Niger monarch, the Dodo of Wawa, Dr. Mahmud Ahmed in his palace on Saturday night.\nThe traditional ruler was abducted around 10 p.m after gunmen stormed the community, shot sporadically and went straight to his place for him.\nThey stormed the community in their numbers on motorcycles and picked the monarch in front of his wife.\nThe state Police Command Public Relations Officer, DSP Wasiu Abiodun, confirmed the incident; adding that the Police were already on the bandits’ trail to rescue the district head.\nAliyu is said to be the 16th Dodo of Wawa and a PhD holder in Environmental Science from a Malaysian university ."
  },
  {
    "headline": "Oyetola Blasts Nnamdi Kanu And Igboho Says Biafra, Yoruba Nation Unserious People Agitation For Breakup",
    "summarized_story": "Gboyega Oyetola, the governor of Osun State, slammed those pushing for a Yoruba nation and a Biafra Republic on Sunday.\nOyetola said those agitation for secession are “unserious” people.\nFeaturing on the News Agency of Nigeria, NAN, Forum, Oyetola harped on Nigeria’s unity.\n“I believe in devolution of power to the states, let the states have more power to do most of the things they have been doing.\nWe should allow the states to have more funds to develop some of the things they have,” Oyetola said."
  },
  {
    "headline": "Blood Of Slain Sowore’s Brother, Olajide, Others’ Is On The Neck Buhari Government—Afenifere",
    "summarized_story": "Afenifere, a Yoruba socio-cultural organization, has condemned the assassination of Olajide Sowore, the younger brother of Omoyele Sowore, a human rights campaigner.\nOlajide was murdered in cold blood by gunmen suspected to be Fulani herdsmen on Saturday on the Lagos-Benin Expressway, Okada area of Edo State.\nBefore his death, he was a student of Igbinedion University, Okada, where he was studying Pharmacy.\nHe also condemned the refusal of the President Muhammadu Buhari-led government to embrace lasting solutions postulated by men and women of goodwill.\n“The blood of Olajide unfortunately further adds to those of the hundreds of thousands of Nigerians, killed by the pampered herdsmen."
  },
  {
    "headline": "Kaduna LG Election: Nine-Year-Old Boy Killed By Stray Bullet In Makarfi",
    "summarized_story": "During the council election on Saturday, a 9-year-old Zainab Bala Umar was murdered by a stray bullet at the Fadamar Gwanki voting unit of Gwanki ward in Makarfi Local Government Area of Kaduna State.\nAccording to an eyewitness, he explained that their action triggered tension and one of them immediately called the Army.\nHe said the Army upon arrival, started shooting, resulting to the death of the victim, Zainab.\nAccording to the source, the area is a stronghold of PDP, thereby leading to the political tension.\nThe source added that Zainab’s father is a younger brother to the Village head of Gwanki."
  },
  {
    "headline": "Obaseki Commences Action On Death Of Sowore’s Brother",
    "summarized_story": "Godwin Obaseki, the Governor of Edo State, has expressed his condolences to Omoyele Sowore, the Publisher of Sahara Reporters, on the loss of his brother, Olajide Sowore.\nNEWS DIRECT had reported earlier that Sowore’s brother was shot dead in the Okada area of Edo State.\nBefore his death, Sowore was a student of Pharmacy at the Igbinedion University, Okada, Edo State.\nPart of the statement read: “I commiserate with the Sowore family and the Publisher of Sahara Reporters, Omoyele Sowore, over the death of his brother, Olajide Sowore.\nObaseki condoled with the Sowore’s family on behalf of the people and Government of Edo state and prayed that God grants them the fortitude to bear the irreparable loss."
  },
  {
    "headline": "Breaking: Gunmen invade palace, abduct traditional ruler in Niger",
    "summarized_story": "Gunmen have reportedly abducted the Wawa of Wawa, a traditional ruler in Borgu local government area of Niger state, Dr Mahmud Ahmed Alivu from his palace.\nThe traditional ruler was reportedly kidnapped at about 9.30pm on Saturday night.\nHe was said to have been whisked away amidst spontaneous shooting by the gunmen dressed in military uniforms into the Kainji National park.\nIt was learnt that the gunmen stormed the palace riding in motorcycles while shooting to scare away people.\nEfforts to reach the Police Public Relations Officer (PPRO) DSP Abiodun Wasiu were not successful before filing this report."
  },
  {
    "headline": "APC LG congress produces 3 factions in Enugu, parallel leadership emerge in Lagos, Ogun, Kwara",
    "summarized_story": "The local government congress of the All Progressives Congress (APC) in Enugu state on Saturday produced three different leadership structures in all 17 council area of the state.\nIt then means that three factions of the party now exist in the state.\nThe creation of a third faction came as a surprise after it appeared like various interests in the party had closed ranks few weeks ago before the ward congress that produced two factions.\nOn Saturday, during the conduct of their local government congress, the party split further into three factions.\nAlso, different factions held parallel local government elections in Kwara, Lagos and Ogun states."
  },
  {
    "headline": "Breaking: Operation Safe Haven troops burst drug syndicates, recover N9.5m worth of Indian hemp (PICTURES)",
    "summarized_story": "Troops of Operation SAFE HAVEN (OPSH) on Saturday September 4, 2021 bursted drug syndicate and recovered 320 blocks of Indian hemp worth N9.5 million concealed in a Toyota Camry car with registration number Abuja ABC 214 HV.\nInformation Officer of OPSH, Major Ishaku Takwa, made the disclosure in a press release.\n“They alleged that they were contracted to convey the illicit substance from Ondo state to Yola, Adamawa state,” he said.\nThe suspects and items recovered have been handed over to the National Drug Law Enforcement Agency, Plateau state command for further investigation.\nHe equally urged law abiding citizens to continue to support security agencies with credible information on criminal activities."
  },
  {
    "headline": "JAMB withdraws 2021 UTME result of 19year-old candidate over forgery – NigPilot",
    "summarized_story": "The 19 year old candidate who claimed that JAMB has been altering his results since 2019 was also handed over to Nigeria Police for investigation.\nOloyede accused the candidate of result tempering, adding that he will be handed over to the police for investigation and subsequently prosecuted.\nBecause this boy has accused JAMB, we are going to withhold his result until the investigation is concluded.\nEarlier, John had said: The result I have been receiving is not the result I am entitled to.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Abuja Police arrest 2 adolescent kidnappers – Nigpilot",
    "summarized_story": "Federal Capital Territory FCT Police Command Abuja has arrested two adolescent kidnappers operating along Kwali area Council of the City.\nPublic Relations Officer of the Command in a statement on Thursday in Abuja, said the Command arrested one Musa Mukailu 18 years and one Damina Wali 17 years all male suspected to be kidnappers along Kwali axis of the FCT.\nAdding that they met their waterloo while trying to kidnap two women along kwali axis of the FCT.\nEffort is in place to arrest other members of the syndicate.”Stressing that the Command pledges its undeterred resolve to ensure lives and properties of residents within the FCT are protected.\nAnd urged the FCT residents to report all suspicious movements,"
  },
  {
    "headline": "Buhari has recovered about N1trn stolen funds, assets since 2015 – APC group – NigPilot",
    "summarized_story": "As part of its anti-corruption drive, the administration of President Muhammadu Buhari has recovered about a trillion Naira worth of stolen funds and assets since assuming office in 2015, Nigerian Pilot has gathered.\nThis is according to APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress, APC.\nThe group noted that under President Buhari’s watch the Federal Government has prioritized the recovery and return of stolen assets belonging to the Nigerian people.\nLukman, APC-LAC said all final forfeitures are being deployed for use in the Government’s special Infrastructure and Social Investment Programmes, or put into the annual Budget.\nIt added that the most recent Abacha and Ibori Loots were transferred to the Nigeria Sovereign Investment Authority (NSIA), for transparent management under the Presidential Infrastructure Development Fund (PIDF)."
  },
  {
    "headline": "President replaced, not sacked Minister -Adesina. ~ Says national service is to God and humanity – NigPilot",
    "summarized_story": "Special Adviser to the President on Media and Publicity, Femi Adesina has said President Muhammad Buhari did not sack, but replaced ministers of Agriculture and Rural Development, Alhaji Mohammed Nanono and his Power counterpart, Saleh Mamman, saying national service is to God and humanity.\nSpeaking in an interview with Channels TV on Sunrise Daily yesterday, Adesina said contrary to media and public views, the president only called to thank the replaced ministers for their services but never sacked them.\n“The president never said their performances were weak but said he had called them personally to thank them for their services to the country and needed to move on to replace them.\n“The president must have had reasons for dropping the two ministers but he never said their performances were weak,” he emphasised.\nHe reassured Nigerians of President Muhammadu Buhari’s commitment towards the yearnings of the current challenges, saying that the president is resolute on tackling all issues headlong to secure the future of the country."
  },
  {
    "headline": "Gunmen Kidnap Wife, Children Of Katsina Lawmaker",
    "summarized_story": "Bandits have reportedly kidnapped the wife and two children of the lawmaker representing Bakori Constituency in the Katsina State House of Assembly, Dr. Ibrahim Kurami.\nThe bandits, according to a resident, stormed the country house of the lawmaker located at Kurami village in Bakori Local Government of Area of the state at about 9:00 pm on Saturday after the Muslim night prayers.\nThe resident who pleaded anonymity, explained that on arrival, the hoodlums first shot at a member of the First Aid Group of Islam who they met at the entrance.\nThe victim who sustained injuries from the gunshots was later rushed to a medical facility for treatment.\nAt the time of the incident, the lawmaker was away, participating in the All Progressives Congress (APC) Local Government Congress in his council."
  },
  {
    "headline": "Nigeria Records Highest COVID-19 Cases In Two Weeks",
    "summarized_story": "Nigeria has recorded 964 more COVID-19 cases, the highest number of infections in two weeks.\nAccording to data from the agency, Nigeria reported 1064 infections on August 21, making Saturday’s cases the highest in fourteen days.\nThe new COVID-19 infections were confirmed in 20 states including the Federal Capital Territory (FCT), Abuja.\nLagos, the nation’s COVID-19 hotbed, had the highest number of infected persons for the day under review – 456 – followed by Ondo with 180 more cases.\nBut 2,544 have died from COVID-19 complications since the disease was confirmed in Nigeria last year February."
  },
  {
    "headline": "#EndSARS: Lagos Govt, LCC Ask Panel To Strike Out Protest Coordinator’s Testimony",
    "summarized_story": "One of the Coordinators of the #EndSARS protests, Serah Ibrahim again failed to show up for her cross-examination on Saturday at the Lagos State judicial panel on restitution for victims of SARS-related abuses and other matters.\nThis prompted the lawyers representing the Lagos State Government, the Lekki Concession Company, LCC and the Police to ask the panel to strike out her previous testimony.\nThey premised their application on her continued absence at the proceedings of the panel.\nAs she played the videos, she explained to the panel that soldiers shot at the harmless protesters and even took away some of the dead bodies.\nThe Senior Advocate’s application was supported by Counsel to the LLC, Rotimi Seriki and Counsel to the Police, Joseph Eboseremen."
  },
  {
    "headline": "Despite Challenges, Trajectory Of Nigeria Is Good – Boss Mustapha",
    "summarized_story": "Despite the current challenges facing Nigeria, the Secretary to the Government of the Federation, Boss Mustapha, is optimistic that the nation’s trajectory is good.\nAddressing journalists on Thursday in Abuja, Mustapha asked the citizens to be hopeful of a better Nigeria.\nThe SGF added that the power of the tongue lies in the tongue, advising Nigerians against speaking ill of the country.\nOn the COVID-19 pandemic, Mustapha said the global pandemic has exposed the weakness of the system of advanced countries.\nThis comes a day after President Muhammadu Buhari felicitated with him on his 65th birthday, describing the SGF as a dedicated public servant."
  },
  {
    "headline": "NYSC Member Nabbed As NDLEA Intercepts Drugged Candies From UK",
    "summarized_story": "A 22-year-old youth corps member, Arnold Maniru has been arrested in Abuja for allegedly importing four kilograms of drugged candies from the United Kingdom.\nThis is according to a statement by the spokesman of the National Drug Law Enforcement Agency (NDLEA), Femi Babafemi.\nA controlled delivery of the parcel, which contains the candies laced with Arizona, a strong variant of cannabis and some liquid, was subsequently carried out.\n“Curiously, Caleb is on court bail, for two earlier charges filed against him by the state command of the NDLEA.\nThe personnel was arrested on Friday 3rd September, following the testimony of his supplier who had earlier been apprehended."
  },
  {
    "headline": "Gov. Bello commends hitch-free LG Congress, says Kogi a model of peaceful politics",
    "summarized_story": "Governor of Kogi State, Yahaya Bello has commended Saturday’s hitch-free Local Government congresses which witnessed the election of leaders of the All Progressive Congress across the twenty-one LG areas of the state.\nFollowing the conclusion of the largely peaceful exercise, the governor issued a press statement on Saturday through his Chief Press Secretary, Muhammed Onogwu, noting that Kogi state has since become a perfect symbol of peaceful politics in Nigeria.\nGovernor Bello said the local government Congress just like the recently held ward congresses adopted a consensus system in selecting the leaders at all levels putting in consideration, the choice and the will of the party members hence there were largely reports of fanfare in all the local government.\nWhile thanking the party members for their continued cooperation in sustaining a peaceful, united and strong political party in the state, he noted that since his leadership the APC has continued to wax stronger and have conquered unprecedented terrain while it also recorded geometric increase in its numbers.\nThe party leader urged the elected Executives to ensure that they justified the confidence reposed in them while they strived to maintain peaceful co-existence in the party to enable the party to become more desirable to many others"
  },
  {
    "headline": "INEC redeploys five RECs, four Directors",
    "summarized_story": "The REC of Osun State, Mr. Olusegun Agbaje has been redeployed to Ogun State under the new postings.\nSimultaneously, his Ogun State counterpart, Prof. AbdulGaniy Olayinka Raji, would take over as REC, Osun State.\nMr. Nick Dazang, the Director of Voter Education and Publicity, has also taken a leave of absence.\nAs a result, Mr. Victor Ayodele Aluko has been reallocated from Director (Administration) to Director (Voter Education and Publicity), and Mr. Mikah Thabbal Lakumna has been reassigned from Director (Administration) to Director (Administration) (Security).\nThe redeployments are part of the Commission’s routine administrative postings, according to Festus Okoye, National Commissioner and Chairman, Information and Voter Education Committee."
  },
  {
    "headline": "Governor Bello condemns murder of Olajide Sowore, condoles with family",
    "summarized_story": "Governor of Kogi state, Yahaya Bello, has condemned the assassination of Mr. Olajide Sowore, the younger brother of former Presidential candidate Mr. Omoyele Sowore, who was murdered on Saturday in Okada, Edo state.\nIn a condolence message signed by his Chief Press Secretary, Muhammed Onogwu, the Governor expressed his sympathies to the Sowore family, noting that Mr. Olajide Sowore’s loss was a painful one.\nGovernor Bello stated that evil men who commit such a cowardly act on a defenseless civilian must be apprehended and prosecuted, and that no life should be lost in such a barbaric manner.\nWhile expressing his condolences to the deceased’s immediate family, the Governor stated that the 50-year-old, Mr. Olajide Sowore, who was a student of Pharmacy at Igbinedion University, Okada, was taking such remarkable steps at such a young age that he served as an inspiration and an example of a determined individual.\nWhile praying to God to give the family the strength to suffer the loss, the governor directed security forces to leave no stone unturned in their pursuit of those responsible for such heinous deeds."
  },
  {
    "headline": "Kaduna LGA Polls: APC loses Gov. El-Rufai's polling unit to PDP -",
    "summarized_story": "The People’s Democratic Party has emerged winner of the chairmanship and councillorship seats in Ungwar Sarki polling unit, where Governor Nasir El-rufai cast his vote in Kaduna North Local Government Area on Saturday.\nThe Presiding Officer of the Unit, Muhammad Sani, who announced the results said the APC polled 62 votes in the chairmanship election, while the PDP scored 86 votes out of the 159 votes cast.\nIn the councillorship election, APC also polled 53 votes, while PDP gathered 100 votes out of 162 total votes cast.\nThe overall result of the Kaduna North Local Government is still being collatedGovernor Nasir El-rufai had earlier reiterated his administration commitment to conducting free, fair and credible local government elections not minding whose ox is gored."
  },
  {
    "headline": "Nigeria Governors Caution FG over Payment of $418m Paris Club Refund to Six Consultants",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) has cautioned the Central Bank of Nigeria (CBN) and the federal government against going ahead with the planned payment of the sum of $418 million to some individuals and organisations for the roles they played in the Paris Club refund received by the federal government.\nThe governors argued that the said payment is already an issue of litigation.\nAccording to the senior lawyer, the governors on August 3, 2021, got wind of the federal government’s move to effect the payment.\nHe noted that the governors learnt that some consultants/contractors alleged that they were retained by some states and had done some work for the states and local governments in Nigeria about the Paris Club refund.\n“The Minister of Finance is said to have directed the Director-General, Debt Management Office (DMO) to issue Promissory Notes in favour of the Consultants."
  },
  {
    "headline": "Nigeria: Parallel Congresses Hit APC in Lagos, Oyo, Sokoto, A’Ibom, Ogun, Others",
    "summarized_story": "Two factions of the APC also held parallel congresses in some local government areas in Oyo State.\nIn Sokoto State, THISDAY gathered that two LG executives emerged from the parallel congresses held.\nOn the eve of yesterday’s congresses, the seven-man congress committee led by Mr. Wale Ohu had cautioned the APC members in the state against holding parallel congresses.\nIn Kwara State, the APC faction, which is loyal to Governor AbdulRahman AbdulRazaq adopted consensus for its local government congresses of the party.\nIn Bayelsa State, a faction of the party held congresses despite a court order that restrained the party from holding congresses in the state."
  },
  {
    "headline": "Nigeria: Embattled PDP National Chairman Secondus Asks Appeal Court to Affirm His Four-year Tenure",
    "summarized_story": "The embattled National Chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, has asked the Abuja Division of the Court of Appeal to affirm that his four-year tenure ends on December 9, 2021.\nHe also asked the appellate court to quash the orders of the two high courts that restrained him as the national chairman of the party.\nIn obedience to the Rivers State High Court order, Secondus abdicated his office and handed over to his deputy, Mr. Yemi AkinwonmiHowever, his supporters went to a Kebbi State High Court, which issued an interim order directing him to resume office, pending the determination of the substantive suit.\nTo ensure that he returns to his desk and also remains in office until the end of his tenure, Secondus has asked the appellate court to affirm that his four-year tenure will end on December 9, 2021.\nIn the appeal filed by his lawyer, Mr. Emeka Etiaba (SAN), the PDP chairman is challenging the order of the Degema High Court in Rivers State and the Calabar High Court in Cross River State."
  },
  {
    "headline": "US Tally Misses Hundreds Left in Afghanistan, Rescue Groups Say – Arise News",
    "summarized_story": "Veteran-led rescue groups say the Biden administration’s estimate that no more than 200 U.S. citizens were left behind in Afghanistan is too low and also overlooks hundreds of other people they consider to be equally American: permanent legal residents with green cards.\nSome groups say they continue to be contacted by American citizens in Afghanistan who did not register with the U.S. Embassy before it closed and by others not included in previous counts because they expressed misgivings about leaving loved ones behind.\nYet the administration says it does not have an estimate on the number of such permanent residents who are in Afghanistan and desperately trying to escape Taliban rule.\n“That’s not right.”Stung by the U.S. military’s chaotic and deadly retreat, President Biden has promised that evacuation efforts will continue for the 100 to 200 American citizens who want to leave, most of whom he said are dual citizens.\nAnd Secretary of State Antony Blinken has said that extends to green card holders and Afghans who supported the U.S. government during the 20-year war."
  },
  {
    "headline": "Taliban, Opposition Fight for Afghan Holdout Province as Top US General Warns of Civil War",
    "summarized_story": "Taliban and opposition forces battled on Saturday to control the Panjshir Valley north of Kabul, the last Afghan province holding out against the militant group, as the top U.S. general warned of a “civil war” if the Islamists failed to consolidate power.\nTaliban spokesman Bilal Karimi said the districts of Khinj and Unabah had been taken, giving Taliban forces control of four of the province’s seven districts.\n“The Mujahideen (Taliban fighters) are advancing toward the centre (of the province),” he said on Twitter.\nTaliban spokesman Bilal Karimi said the districts of Khinj and Unabah had been taken, giving Taliban forces control of four of the province’s seven districts.\n“The Mujahideen (Taliban fighters) are advancing toward the centre (of the province),” he said on Twitter."
  }
]