[
  {
    "headline": "Na’Allah’s son strangled, bandits kill two in Kaduna, three travellers rescued",
    "summarized_story": "Godwin Isenyo, KadunaBandits have killed three persons, including a pilot in separate attacks in the Kaduna North and Kajuru local government areas of Kaduna State.\nOn the Kajuru attack, it was gathered that the bandits invaded the Makoro Iri village and killed two persons.\nThe commissioner also said troops of the Operation Safe Haven rescued travellers along the Gidan Waya-Godogodo Road in the Jema’a Local Government Area of the state.\nHe gave the names of the rescued travellers as Jibril Salisu, Happy Sunday and Ruth Dauda.\nThe commissioner said, “Security agencies have reported to the Kaduna State Government that two persons were killed by bandits in Makoro Iri village of the Kajuru LGA."
  },
  {
    "headline": "Osun CP relocates to Modakeke as gunmen kill two farmers",
    "summarized_story": "The Osun State Police Command, on Sunday, said it had arrested two suspects in connection with the attack on and killing of some farmers in Alapata village, Modakeke.\nThe latest killings came barely nine days after five farmers were murdered along the Toro Road, Modakeke, by yet-to-identified assailants.\nA community leader in Modakeke, Femi Eluyinka, explained that the assailants abducted five indigenes of the town from their farms in Alapata village on Saturday.\nEluyinka stated, “One of those abducted later escaped and ran to town to inform us.\nAlapata village is after Toro village."
  },
  {
    "headline": "Breast milk of mothers who receive COVID-19 jabs contains potent antibodies — Study",
    "summarized_story": "“Think of breast milk as a toolbox full of all the different tools that help prepare the infant for life.\nHe said breast milk allows nursing mothers to provide infants with “passive immunity”.\nThe research team sampled the mothers’ breast milk and blood three times: before vaccination, after the first dose, and after the second dose.\nWith that in mind, the research team is continuing to explore how breast milk containing COVID-19 antibodies gained through vaccination protects babies who consume it.\n“We would like to know if infants who consume breast milk containing these antibodies develop their own protection against COVID-19,” Larkin said."
  },
  {
    "headline": "NAFDAC seeks stiffer penalty for food, drug, cosmetics counterfeiters",
    "summarized_story": "… Begs NASS to pass Counterfeit Medical Product BillBy Chioma ObinnaThe National Agency for Food, Drug Administration and Control NAFDAC, weekend called for stiffer punishment for food, cosmetics and drug counterfeiters as a deterrent to intending counterfeiters.\nShe asserted that the dangerous business would be made unattractive if it carries the maximum penalty for the offenders.\nShe said: “NAFDAC has resolved to go after those who engage in the circulation of counterfeited and expired medicines, cosmetics, and spurious food products in the country until they are apprehended and made to face the wrath of the law.\n“The agency will not rest on its oars until those merchants of death desist from the nefarious activities following the destruction of seized unwholesome products worth over N5b in five months.\n“The Agency destroyed unwholesome medicines, expired processed food items and cosmetics worth N1, 429,580,683.00 in Awka, the capital city of Anambra State in March for South-South and Southeast operations."
  },
  {
    "headline": "Apapa-Oshodi Gridlock: Lagos traffic c’ttee chair, Fayinka, men abandon enforcement",
    "summarized_story": "On the Apapa Oshodi-Apapa Expressway, truck drivers occupied the road from Fatgbems Filling Station up to Trinity, inward Tin-can Island Port.\nThe chaotic traffic situation along Apapa-Oshodi Expressway returned, yesterday, as truck drivers parked indiscriminately on the road subjecting motorists and other road users to untold hardship.\nMen of the state traffic committee and Lagos State Traffic Management Authority, LASTMA, practically abandoned their duty posts.\nThe enforcement was unofficially communicated to motorists and other road users last Tuesday with many road users expressing shock and inconveniences being experienced as a result of One-Way enforcement.\nOlasoju, in a statement, explained that in addition to the meeting, other concerned government agencies would be reached for possible reversal of the one-way enforcement."
  },
  {
    "headline": "Buhari’s govt will crush perpetrators of recent killings in Plateau — Presidency",
    "summarized_story": "–Begs warring communities to give peace a chanceBy Johnbosco AgbakwuruThe Presidency last night threatened that the government of President Muhammadu Buhari was moving ahead with force to crush the perpetrators of the recent incidents of unrest in Plateau State.\nThis is as the President has pleaded to the people of Jos the Plateau State capital and other warring communities.to give peace a chance.\nThe statement read in part: “But to achieve success, our communities must unite against these horrific attacks.\nYet, in reality, there are no religious connotations at all when the primate purpose of these acts is to extract money.\nYet mistakenly, and because the lobbyists for IPOB have duped them, some misguided foreign media and politicians believe it so."
  },
  {
    "headline": "Why we’re excited over Petroleum Industry Act — PENGASSAN",
    "summarized_story": "By Victor Ahiuma-YoungPetroleum and Natural Gas Senior Staff Association of Nigeria, PENGASSAN, has said oil workers are excited by the Petroleum Industry Act, PIA, recently signed into law by President Muhammad Buhari, saying it has ended the uncertainty in the sector among other benefits.\nAccording to him, “The Petroleum Industry Bill, PIB that was before the National Assembly for so many years created a lot of confusion in the industry because nobody knew what the rule of engagement would be.\n“With the signing of the bill, the most fundamental advantage is that it has stopped the uncertainty in the industry.\nAnother important provision is the environmental remediation fund and environmental remediation plan.\n“Before now our old laws, the Petroleum Act of 1959, did not make any provision relating to gas."
  },
  {
    "headline": "Confirmed: Na’Allah’s son tied, strangled in Kaduna",
    "summarized_story": "The Kaduna State Police Command has confirmed the killing of Abdulkarim Bala Na’Allah, son of Sen. Bala Na’Allah.\nThe incident was confirmed by Police Public Relations Officer, ASP Mohammed Jalige.\nNarrating how the deceased was murdered, Garba Mohammed, Special Adviser to Sen. Na Allah, told NAN that late Abdulkarim was tied in his room and strangled while the assailants escaped with his vehicle.\nMohammed said the remains of the deceased had been buried on Sunday evening at Unguwan Sarki Cemetery in Kaduna.\nHe said the father of the deceased is not in the country."
  },
  {
    "headline": "S/East govs ready to fight ‘devilish, foolish’ IPOB sit-at-home order – Umahi",
    "summarized_story": "The Chairman of the South East Governors Forum and Governor of Ebonyi State, Chief David Umahi, on Sunday said the governors of the zone are prepared to fight against the IPOB sit-at-home order, describing it as devilish and foolish.\nUmahi made this known while addressing members of the All Progressive Congress, APC, stakeholders emergency meeting that took place at the ecumenical centre, Abakaliki, the Ebonyi State capital.\nSouth east region is gradually being destroyed by IPOB sit-at-home.\nA lot of federal agencies have placed Ebonyi state on red alert.\n“Southeast is under red alert as a result of IPOB sit-at-home and it is out of foolishness."
  },
  {
    "headline": "Killings: Plateau NASS caucus must voice out burdens of their people – Kaze",
    "summarized_story": "A former member of the House of Representatives from Plateau State, Hon.\nBitrus Kaze, has challenged the Plateau caucus in the National Assembly to collectively voice out the burdens of the people, saying “the efficacy of mere condemnations is waning considering the endless killings”.\nEach man must become the CinC, the Director of State Security Services, the GOC, the IG and STF Commander of his household.\n“For once, Honourable Members of Plateau House of Assembly (PLHA) have dutifully and constituted them into a very formidable voice for our people’s collective burden.\nAccording to him, “The ability of the PLHA to conquer their primordial sentiments and speak for the Plateau cause with one voice, throws a direct challenge for the Plateau Caucus in the National Assembly Abuja to collectively voice out the burdens of Plateau."
  },
  {
    "headline": "Zamfara: Police warn criminals, reiterate readiness to enforce Matawalle’s directives",
    "summarized_story": "The Zamfara State Police Command has said that the new security measures put in place by Governor Bello Mohammed Matawalle Is not political but to reduce banditry in the state.\nAddressing newsmen at the state police command, the Commissioner of Police, Mr Ayuba Elkanah, said that the police and other security agencies are very much prepared to ensure full compliance.\n“The Executive Governor of Zamfara State, Hon.\nBello Mohammed Matawalle’s determination to stem the tide of activities of criminal elements abide by about seven proactive security measures,” he said.\n“I want to use this opportunity to inform the good people of Zamfara State that the Police in collaboration with other security agencies are fully ready and have since commenced action to ensure full compliance of the directives."
  },
  {
    "headline": "Shehu Sani reacts as bandits kill Senator Na’Allah’s son",
    "summarized_story": "Former Senator, Shehu Sani has reacted to the death of Abdukkarim Bala Na’Allah, who was killed at his Malali (GRA) residence in Kaduna North Local Government Area on Sunday.\nDAILY POST had reported that Abdukkarim Bala Na’Allah, son of Senator Bala Na’Allah, was killed by suspected bandits.\nSpecial Adviser to Senator Na Allah, Garba Mohammed, who confirmed the incident, said the hoodlums entered the house through the ceiling.\nReacting, Sani in a post via his Twitter account on Sunday evening said Captain Abdulkarim Bala‘s death is an unfortunate one.\n“The news of the killing of Captain Abdulkarim Bala Ibn Na’Allah the son of Senator Bala Na’Allah in Malali GRA Kaduna is tragic and unfortunate."
  },
  {
    "headline": "NGE annual conference to hold October 21, 22",
    "summarized_story": "The Nigerian Guild of Editors (NGE) has announced October 21 and 22 as the dates for its 17th annual All Nigerian Editors’ Conference (ANEC) in Abuja.\nThe guild, in a joint statement on Sunday by its President Mustapha Isah and Secretary General Iyobosa Uwugiaren, said the theme of the conference is: Media In Times of Crisis: Resolving Conflict, Achieving Consensus.\nADVERTISEMENTThe NGE said the scheduling of the annual conference was among the decisions it reached at a meeting of its Standing Committee last week in Dutse, the Jigawa State capital.\nThe guild added that it also took some positions on various issues, after extensive deliberations."
  },
  {
    "headline": "Ezekwesili is Yale Varsity’s senior fellow",
    "summarized_story": "Former Education Minister, Dr. Obiageli Ezekwesili, and five other global figures have joined the Yale Jackson School of Global Affairs as senior fellows.\nWelcoming the new fellows in a statement yesterday, the President of Yale University, Peter Salovey, also welcomed the school’s 19 returning fellows.\nThe statement said: “This year’s senior fellows include Obiageli Ezekwesili (Nigeria), Staffan de Mistura (Italy & Sweden), Jessica Faieta (Ecuador), Anne W. Patterson, David Brooks, and Jessica Seddon (United States).\n“Jackson’s senior fellows are leading practitioners in various fields of international affairs, and will spend a year or semester at Yale, teaching post-graduate courses and mentoring students.\nYale Jackson School of Global Affairs applies evidence-based scholarship to challenges of maximum global importance, such as climate change, war and peace, ethnic conflict, inequality, and migration."
  },
  {
    "headline": "Ohanaeze warns Uzodimma against backing out of anti-open grazing agreement",
    "summarized_story": "Ohanaeze Ndigbo Worldwide has warned Imo State governor, Senator Hope Uzodimma, on the dangers of withdrawing from the ban on open grazing initiated by the Forum of Southern Governors.\nBut Uzodimma during the week reportedly declared that there is no law forbidding open grazing by cattle rearers in the state.\n“I don’t have any law in Imo State for anti-grazing.\nBut what we have done is that we are regulating grazing activities in Imo State under a partnership between our farmers and herders.\nAccording to Chief Onitri, the directive would cause an avoidable clash between the President and the state governors."
  },
  {
    "headline": "Aregbesola will ensure my success, says Oyetola",
    "summarized_story": "Governor Adegboyega Oyetola of Osun State has warned against insinuations that there is bickering between him and his predecessor, Minister of Interior, Rauf Aregbesola.\nHe noted that he served Aregbesola for eight years, ensuring the success of his administration between 2010 to 2018 and he will surely see to his (Oyetola) success as the governor.\n“Well, those people, I’m not too sure that the people that have been saying that, are saying his mind.\nI believe he is my brother and I believe at any point in time he wants my success because I worked very hard for eight years for his own success as well.\n“If people are saying that (they won’t support me) I’m not too sure they are telling the story from his own heart."
  },
  {
    "headline": "Kalu commiserates with Senator Bala Na’Allah over son, Abdulkarim’s death",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has condoled with the Senator representing Kebbi South Senatorial district, Bala Na’ Allah, who lost is eldest son, Abdulkarim.\nThe 36-year old was reported to have been tied and strangled by unidentified assailants, who forcefully gained access to the deceased’s residence in Kaduna.\nHe said, “I received with pain the news of the tragic death of eldest son of Senator Bala Na’Allah, Abdulkarim.\nKalu prayed to Allah to grant the late pilot Al- Jannah Firdaus and give the deceased’s family the fortitude to bear the sad loss.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Southern govs open grazing ban: One voice, divided action",
    "summarized_story": "All of us know what our people have suffered in terms of this open grazing.\nToday, all Nigerians have come to accept the reality that open grazing is no longer fashionable.\n“It is important to emphasize that our law against open grazing of cows is still operational.\nDeltaIn a twist difficult to understand, Delta State, where the decision to ban open grazing in southern Nigeria was taken, is yet to pass requisite law.\nHe said: “From my own perspective, the governors have just been using that issue of open grazing as political gimmick."
  },
  {
    "headline": "My father has been sleeping with me for over 7 years, teenager tells police",
    "summarized_story": "“I could no longer bear it and there was nobody I could tell this to because he always threatened to kill me if I exposed his action.\nThis made me run away from the house till I was invited by the police to come to the station.”The suspect, Akinsowon, who denied the allegation said: “It was her mother that cooked up the story against me just to tarnish my image in the society because she is no longer staying with me as my wife.\nI never slept with my daughter.” The State Police Public Relations Officer (PPRO), Funmi Odunlami, confirmed the arrest of the schoolteacher and said investigation into the matter had commenced.\nShe assured that the command would get to the root of the matter."
  },
  {
    "headline": "2023: Let’s work together, Tambuwal begs PDP members",
    "summarized_story": "The PDP has recently been embroiled in crisis as its leaders battle for supremacy ahead of the party’s national convention to elect a new leadership.\nHowever, on Thursday, a Kebbi State High Court, in Birnin Kebbi, issued an order asking Secondus to resume his functions as national chairman.\nIn another twist, a Federal High Court in Calabar, Cross River State, on Friday, restrained the PDP chairman from presiding over yesterday’s NEC meeting.\n“ Meanwhile, the PDP has said its national convention scheduled for October 30-31, will hold in the Federal Capital Territory (FCT), Abuja.\nThe PDP National Publicity Secretary, Kola Ologbondiyan, disclosed this, yesterday, while briefing journalists on the outcome of the 92nd meeting National Executive Committee (NEC) of the party."
  },
  {
    "headline": "Men run after me because of my plus-size – Mary John, actress",
    "summarized_story": "By Rita OkoyeBeautiful plus-size actress-cum-social media influencer, Mary John, has opened up on her sojourn in Nollywood, her love life, unique selling points and other issues.\nAs a plus size TV star, what are the issues you encounter on and off set?\nWhat are the main difficulties people of plus size encounter?\nIn Nollywood, Funke Akindele because she’s a strong woman with a funny character.\nI am a plus size model, an interior decorator and social media influencer."
  },
  {
    "headline": "Breaking: Bandits Kill Senator Na’Allah’s Son, Two Others in Kaduna",
    "summarized_story": "By John Shiklam in KadunaThree people, including the first son of Senator Bala Na’Allah, who represents Kebbi South senatorial district, have been killed in separate attacks by bandits in Kaduna.\nThe senator’s son, Abdukkarim Na’Allah, said to be a pilot, was said to have been killed on Sunday by gunmen at his residence at Malali GRA in Kaduna metropolis.\nAn aide to Senator Na’Allah, Garba Mohammed, confirmed the killing of the senator’s son but did not give details of how the incident occurred.\nTwo other persons were killed by bandits in an attack on Makoro Iri village of Kajuru Local Government Area.\nThe commissioner also said three commuters were rescued by security forces along the Gidan Waya- Godogodo road, Jama’a Local Government Area."
  },
  {
    "headline": "Secondus Absent as PDP NEC Approves October Convention",
    "summarized_story": "A Rivers State High Court had restrained Secondus from parading himself as the National Chairman of the party.\nSecondus had obtained a Kebbi High Court order to return to his desk as national chairman last Thursday following an earlier injunction obtained against him from a Rivers State High Court.\nBriefing journalists after yesterday’s NEC meeting, the National Publicity Secretary of the party, Mr. Kola Ologbondiyan, said, “NEC has resolved that Abuja will be the venue of the PDP National Elective Convention slated for October 31, 2021.\n“Media office of Prince Uche Secondus wishes to correct erroneous news circulating that he has stepped down as the National Chairman of the PDP.\n“Prince Secondus by his unavoidable absence at the party’s NEC meeting on Saturday was merely obeying an interim order from Cross River State High Court."
  },
  {
    "headline": "Nigeria Still Africa’s Biggest Economy after South Africa Rebased GDP",
    "summarized_story": "*South Africa’s GDP now $370bn, Nigeria’s $432bnGboyega AkinsanmiNigeria has maintained her position as Africa’s biggest economy after South Africa released the report of its rebased Gross Domestic Product (GDP) that pushed the latter’s economy up by 11 per cent, an analysis of a new report by Statistics South Africa (SSA), has revealed.\nThe rebasing of South Africa’s GDP coincided with the release of Nigeria’s latest GDP report, which showed a 5.01 per cent growth in the second quarter of 2021.\n“In terms of purchasing power parity (PPP), the World Bank currently ranks South Africa as the third biggest economy on the continent after Egypt and Nigeria.\nThe rebasing of South Africa’s GDP coincided with the release of Nigeria’s latest GDP report, which showed a 5.01 per cent growth in the second quarter of 2021.\nNigeria and South Africa are the two biggest economies in Africa."
  },
  {
    "headline": "THISDAY Disowns Fake Edition of Its Digital Newspaper",
    "summarized_story": "In a statement signed by the Managing Director of the newspaper, Mr. Eniola Bello, titled: ‘Fake Digital Edition of THISDAY Friday, 27 August 2021 in Circulation on Social Media,’ the media house described the purveyors of the cloned version as unscrupulous.\n“The attention of the management of THISDAY has been drawn to a fake version of our digital edition making the rounds on some social media platforms with the headline: ‘Shocking: Uzodinma declares Free Marriage Between Fulani Settlers and Imo Ladies’.\n“This fake version of our digital edition is being circulated on WhatsApp, Facebook, and other social media platforms.\nMeanwhile, Imo State Governor, Uzodimma, has also disowned the purported report on the cloned publication.\nThe statement advised the public to disregard the cloned publication as coming from depraved minds and enemies of the people and the society."
  },
  {
    "headline": "NNPC Spends N541.65bn on Petrol Subsidy in Six Months",
    "summarized_story": "Emmanuel Addeh in AbujaThe Nigerian National Petroleum Corporation (NNPC) expended N541.65 billion subsidy on petrol between February and July this year, a document detailing the national oil company’s presentation to the Federation Account Allocation Committee (FAAC) for August 2021, has shown.\nOn Friday, THISDAY reported that the corporation was again set to deduct about N215.3 billion from its contribution to next month’s joint federation account, being a combination of N175 billion subsidy sum and N40 billion Joint Venture (JV) cost recovery.\nThe data showed that NNPC paid N67.280 billion to the joint account in July, an improvement on the N47.162 billion in June, with the succeeding month’s payment being about N20 billion higher than that of June.\nTwo months ago, the NNPC told the nation that Nigeria was losing about 42 million litres of petrol to the activities of smugglers across the country’s borders, increasing Nigeria’s estimated daily consumption of 60 million litres to 103 million litres and worsening the subsidy payment regime.\nA THISDAY check-in July showed that the NNPC’s payment to the federation account had declined by over 63 per cent in the first five months of 2021."
  },
  {
    "headline": "VIDEO: How We Depend On Dirty, Contaminated Stream Water To Survive—Kwara Community Resident",
    "summarized_story": "Residents of Eka Kuso in Kpada District of the Patigi Local Government Area of Kwara State have narrated how they fetch and drink from dirty streams.\nA video obtained by SaharaReporters shows the various areas where residents fetch water from are dirty, bushy and mashy.\nWe don’t use to feel okay during that time, right from morning, around six o’clock, they will fetch water and wait till like ten o’clock so it can settle down,” a villager was heard saying.\nThe primary cause of cholera is the ingestion of contaminated food and water, majorly fuelled by the lack of water and sanitation hygiene (WASH) infrastructures.\nWater Aid says 60 million people in Nigeria lack access to clean water."
  },
  {
    "headline": "VIDEO: How We Depend On Dirty, Contaminated Stream Water To Survive—Kwara Community Resident",
    "summarized_story": "Residents of Eka Kuso in Kpada District of the Patigi Local Government Area of Kwara State have narrated how they fetch and drink from dirty streams.\nA video obtained by SaharaReporters shows the various areas where residents fetch water from are dirty, bushy and mashy.\nWe don’t use to feel okay during that time, right from morning, around six o’clock, they will fetch water and wait till like ten o’clock so it can settle down,” a villager was heard saying.\nThe primary cause of cholera is the ingestion of contaminated food and water, majorly fuelled by the lack of water and sanitation hygiene (WASH) infrastructures.\nWater Aid says 60 million people in Nigeria lack access to clean water."
  },
  {
    "headline": "VIDEO: How We Depend On Dirty, Contaminated Stream Water To Survive—Kwara Community Resident",
    "summarized_story": "Residents of Eka Kuso in Kpada District of the Patigi Local Government Area of Kwara State have narrated how they fetch and drink from dirty streams.\nA video obtained by SaharaReporters shows the various areas where residents fetch water from are dirty, bushy and mashy.\nWe don’t use to feel okay during that time, right from morning, around six o’clock, they will fetch water and wait till like ten o’clock so it can settle down,” a villager was heard saying.\nThe primary cause of cholera is the ingestion of contaminated food and water, majorly fuelled by the lack of water and sanitation hygiene (WASH) infrastructures.\nWater Aid says 60 million people in Nigeria lack access to clean water."
  },
  {
    "headline": "BREAKING: Bandits Kill Ruling All Progressives Congress Senator’s First Son",
    "summarized_story": "Some unknown gunmen, believed to be bandits, have killed Abdulkarim Bala Na Allah, son of Senator Bala Na Allah, an All Progressives Congress (APC) chieftain in Kaduna state.\nSaharaReporters gathered that Abdulkarim, a pilot was killed on Sunday at his residence around Umar Gwandu Road.\nHe was the eldest son of the Senator representing Kebbi South Senatorial District in the National Assembly.\nThe eldest son of Senator Bala IBN Na Allah.\n“He was strangled to death by his assailants at his residence at Umar Gwandu Road, off Gwanja Road in Kaduna."
  },
  {
    "headline": "BREAKING: Bandits Kill Ruling All Progressives Congress Senator’s First Son",
    "summarized_story": "Some unknown gunmen, believed to be bandits, have killed Abdulkarim Bala Na Allah, son of Senator Bala Na Allah, an All Progressives Congress (APC) chieftain in Kaduna state.\nSaharaReporters gathered that Abdulkarim, a pilot was killed on Sunday at his residence around Umar Gwandu Road.\nHe was the eldest son of the Senator representing Kebbi South Senatorial District in the National Assembly.\nThe eldest son of Senator Bala IBN Na Allah.\n“He was strangled to death by his assailants at his residence at Umar Gwandu Road, off Gwanja Road in Kaduna."
  },
  {
    "headline": "Insecurity: Buhari appeals for peace, vows to 'crush perpetrators' of Plateau attacks",
    "summarized_story": "President Muhammadu Buhari says his administration will ensure that all persons found culpable regarding the recent attacks in Plateau will be brought to justice.\nAs a result of the attacks in Jos in particular, some state governments have evacuated their indigenes from Plateau.\nIn a statement issued on Sunday by Garba Shehu, presidential spokesman, Buhari appealed to Nigerians to embrace peace, and unite against violence.\n“It is important both for Nigerians and the international community to appreciate that there are a multitude of factors attendant to these troubles.\nYet mistakenly, and because the lobbyists for IPOB have duped them, some misguided foreign media and politicians believe so."
  },
  {
    "headline": "Insecurity: Buhari appeals for peace, vows to 'crush perpetrators' of Plateau attacks",
    "summarized_story": "President Muhammadu Buhari says his administration will ensure that all persons found culpable regarding the recent attacks in Plateau will be brought to justice.\nAs a result of the attacks in Jos in particular, some state governments have evacuated their indigenes from Plateau.\nIn a statement issued on Sunday by Garba Shehu, presidential spokesman, Buhari appealed to Nigerians to embrace peace, and unite against violence.\n“It is important both for Nigerians and the international community to appreciate that there are a multitude of factors attendant to these troubles.\nYet mistakenly, and because the lobbyists for IPOB have duped them, some misguided foreign media and politicians believe so."
  },
  {
    "headline": "Na'Allah's son 'murdered' in Kaduna",
    "summarized_story": "Abdulkarim, son of Bala Na’Allah, senator representing Kebbi south, has been found dead in his home in Kaduna.\nAdvertisementThe younger Na’Allah was said to have been murdered on Sunday at his residence in Malali GRA in Kaduna metropolis.\nSamuel Aruwan, Kaduna commissioner for internal security and home affairs, also confirmed the development in a statement issued on Sunday evening.\nAdvertisement“The Kaduna State Government has been informed by security agencies that the remains of one Captain Abdulkarim Ibn Na’Allah were found in his Kaduna home,” Aruwan said.\n“The rescued travelers’ vehicle, a Peugeot 307, was also recovered."
  },
  {
    "headline": "Na'Allah's son 'murdered' in Kaduna",
    "summarized_story": "Abdulkarim, son of Bala Na’Allah, senator representing Kebbi south, has been found dead in his home in Kaduna.\nAdvertisementThe younger Na’Allah was said to have been murdered on Sunday at his residence in Malali GRA in Kaduna metropolis.\nSamuel Aruwan, Kaduna commissioner for internal security and home affairs, also confirmed the development in a statement issued on Sunday evening.\nAdvertisement“The Kaduna State Government has been informed by security agencies that the remains of one Captain Abdulkarim Ibn Na’Allah were found in his Kaduna home,” Aruwan said.\n“The rescued travelers’ vehicle, a Peugeot 307, was also recovered."
  },
  {
    "headline": "'Nobody will escape' -- Lalong vows to deal with perpetrators of Plateau attacks",
    "summarized_story": "Simon Lalong, governor of Plateau, says the perpetrators of attacks in the state will be brought to book.\nAdvertisementNAN quoted Lalong as saying this when the governor visited Yelwa Zangam community in Jos north LGA, on Sunday.\nPlateau has recorded a number of attacks over the past three weeks.\nOn his part, Sunday Bonu, president of the Anaguta Development Association, said a police station in the area will forestall attacks on the community.\nThe governor also conducted an assessment tour of the damaged bridge and other affected areas in the community."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How customer loyalty is helping Nigerian fintech apps through regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nGet the best African tech newsletters in your inboxBeyond offering financial products with attractive investment returns, the startups have invested in building a customer trust and loyalty bank.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Obaseki charges parents, other stakeholders on protection of school’s infrastructure – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has charged students, parents and other stakeholders to protect infrastructures in state-owned schools in their communities.\nObaseki reassured that the government will sustain investment in school infrastructure across the state, ensuring a conducive learning environment for students in the state.\nThe change was made possible through the support of Nigeria Union of Teachers (NUT), teachers and parents.\n“We have succeeded because we have decided to gather our limited resources to improve infrastructure in our schools.\nWe have built more than 204 classrooms while renovating over 9,000 others, as it is now comfortable for our children."
  },
  {
    "headline": "Ize-Iyamu, others hail Obaseki, as Edo Christian community turn out en masses for COVID-19 vaccination – Nigerian Observer",
    "summarized_story": "A member of the state COVID-19 Response team and Health Educator, Edo State Primary Healthcare Development Agency (ESPHDA), Irene Uabor, monitored the exercise across various churches in Benin City.\nSome churches visited include Central Baptist Church King’s Square; St. Paul Catholic Church, Airport Road; Church of God Mission Int., Off Sapele Road; St. Peter Catholic Church Ugbor; The Redeemed Christian Church of God, Benoni, and Family Intercessory Ministries Int., Ekenwan Road, amongst others.\nI have continued to encourage my friends to come out and get vaccinated.”Ize-Iyamu continued: “I urge Edo citizens to seize the opportunity created by the Edo State Government and get vaccinated.\nWe took vaccines while growing up, there is no issue with vaccination against the COVID-19 pandemic.\nI am fully vaccinated; I have taken my two doses and we have over 60 percent of parishioners here already vaccinated."
  },
  {
    "headline": "Obaseki, FRSC parley to check road accidents in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government will work with the Federal Road Safety Corp (FRSC), to reduce road accidents across the 18 Local Government Areas of the state.\nHe said this during a courtesy visit by the FRSC Zonal Commanding Officer, Zone 5 Headquarters, Assistant Corp Marshal Andrew Kumapayi, at the Government House, in Benin City.\nHe said: “We will continue to work hard to improve our road networks.\nWe get very worried when we see ghastly road accidents arising from road users.”The governor continued: “We want to assure you that we take the lives of citizens very seriously.\n“The traffic flow to the east, north and south makes Edo one of the busiest states in terms of vehicular movement."
  },
  {
    "headline": "Ex-President Jonathan, Akpabio Pay Homage To Olu of Warri, Describe Him As Young And Dynamic – Nigerian Observer",
    "summarized_story": "Ex-President Jonathan, Akpabio Pay Homage To Olu of Warri, Describe Him As Young And DynamicShare FacebookTwitterStumbleuponLinkedInPinterestWarri – Former president of the Federal Republic of Nigeria, Goodluck Ebele Jonathan has described the newly crowned Olu of Warri, Ogiame Atuwase III, as young, dynamic and a pride of the Niger Delta people.\nThe ex-president in company of HRH King Amalate Turner, Obanema of Opume-Ogbia, Bayelsa state came to pay homage to the Olu at his Palace in Warri, Warri South Council Area of Delta state.\nWhile congratulating the new Olu, ex-president Jonathan said,“I was to come for the coronation.\nWe are pleased we have a dynamic king in the Niger Delta.\nThe Olu of Warri was crowned a week ago as the 21st Olu of Warri in Ode-Itsekiri, the ancestral home of the Itsekiris at an elaborate ceremony."
  },
  {
    "headline": "Confusion as Eko Disco denies plan to hike electricity tariff",
    "summarized_story": "ADVERTISEMENTThere is confusion among stakeholders in the power sector following the furore generated by the conflicting information put out about a resolution by the Nigerian Electricity Regulatory Commission (NERC) on tariff hike.\nA document marked 023/EKEDP/GMCLR/0025/2021, dated August 25, 2021 and signed by the General Manager, Loss Reduction, Eko Electricity Distribution Company (EKEDC), Olumide Anthony-Jerome, had announced the Disco’s decision to raise tariffs.\n“For metered customers with internal vending arrangements, we urge you to adjust the rates accordingly to reflect the new tariff increase as released by NERC,” the memo, purportedly issued by Eko Disco, read.\nREAD ALSO:Last September, a tariff hike plan was implemented amidst controversies and rejection by members of the organised labour.\nIt remains unclear whether an increase would be recorded in electricity tariff in September."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Zenith Bank defies headwinds, grows profit 3% YoY to N117bn in H1 2021",
    "summarized_story": "The Group also recorded a 9% growth in non-interest income from NGN116 billion in June 2020 to NGN127 billion in June 2021.\nThe Group’s retail journey continues to deliver positive results as retail deposits grew by NGN38.2 billion from NGN1.72 trillion to NGN1.76 trillion year-to-date (YTD).\nSavings balances grew marginally by 2% YTD to close at NGN1.18 trillion from NGN1.16 trillion as at December 2020.\nTotal assets grew marginally to NGN8.52 trillion as at 30 June 2021 from NGN8.48 trillion recorded as at 31 December 2020.\nThe Bank continues to distinguish itself in the Nigerian financial services industry through superior service offerings, unique customer experience and sound financial indices."
  },
  {
    "headline": "Dangote, Ooni, Oshiomole visit Ogun Gov, Abiodun over father’s demise",
    "summarized_story": "The trio and some other dignitaries were in the State to commiserate with the governor over the death of his father, Pa Emmanuel Abiodun.\nSpeaking during the visit, Oba Ogunwusi admonished Nigerians to endeavour to live a life of service in order to be remembered after their demise.\nIn his remarks, Dangote noted that the deceased used his profession to touch many lives in the country, adding that people across the country would continue to remember Pa Abiodun for his good work.\nAlso speaking, the Chief Executive Officer, Adron Homes, Adetola King, observed that Pa Abiodun was passionate in inculcating the right values into his students, many of whom have become eminent personalities in the society.\nResponding, Governor Abiodun, charged all to be mindful of their last days on earth by doing things that would make people to remember them when they die."
  },
  {
    "headline": "Osun @30: We are determined to revitalize economy, ensure state works for all – Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Mr. Gboyega Oyetola, has reiterated his administration’s resolve to revitalize the state’s economy and put it in a pedestal of progress and prosperity for all indigenes.\nAnd we remain resolute in our determined quest to revitalize our economy and nurture a society that truly works for the good of all Osun citizens home and abroad”.\nProfessor Oyeweso noted that the founding fathers played significant roles in the task towards the creation of Osun state hence the need to always involved them in the celebration of the state.\nHe noted that Osun state is a relatively peaceful state in the country and must sustain the peace, saying that no development could take place in an atmosphere of rancour and acrimony.\nIn his remark, chairman of Nigeria Union of Journalists, Osun state Council, Comrade Wasiu Ajadosu, said the programme was organized with the aim of examining 30-year sojourn of the state and project into the future."
  },
  {
    "headline": "NNPC spends N541.65bn on fuel subsidy in six months",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) spent N541.65 billion subsidy on fuel subsidy between February and July this year.\nThis is according to a document detailing the national oil company’s presentation to the Federation Account Allocation Committee (FAAC) for August 2021.\nIt more than doubled to N126.298 billion in May, markedly reduced to N164.337 billion in June, and further came down to N103.286 billion in July.\nThe corporation is also set to deduct about N215.3 billion from its contribution to next month’s joint federation account, being a combination of N175 billion subsidy sum and N40 billion Joint Venture (JV) cost recovery.\nThe data showed that NNPC paid N67.280 billion to the joint account in July, an improvement on the N47.162 billion in June, with the succeeding month’s payment being about N20 billion higher than that of June."
  },
  {
    "headline": "NGE To Government: Be More Proactive, Creative In Security Management",
    "summarized_story": "By CHIKA CHIMEZIE…Fixes All Editors Conference on security for OctoberThe Nigerian Guild of Editors (NGE) has described the recent compromise of the security at the the Nigerian Defence Academy in Afaka, Kaduna State, by gunmen as a worrisome dimension to insecurity in the country.\nWe commend the intervention of the Nigeria Press Organisation in protecting the freedom of press in the country,’’ the Guild stated.\nThe NGE expressed appreciation to the government and people of Jigawa State for the conducive environment provided during its Standing Committee Meeting in Dutse.\nMeanwhile, the editors said that this year’s All Nigerian Editors Conference (ANAC), the largest gathering of Nigerian editors and owners of newspapers, magazines, radio/television stations and online newspapers in Nigeria will hold at the Nigerian Air Force Conference Centre (NAF) in Abuja between October 21 and 22.\nAlso expected at the two-day conference are top security officers in the country, chief executive officers in the private sector, state governors, lawmakers, academics and others."
  },
  {
    "headline": "NGE To Government: Be More Proactive, Creative In Security Management",
    "summarized_story": "By CHIKA CHIMEZIE…Fixes All Editors Conference on security for OctoberThe Nigerian Guild of Editors (NGE) has described the recent compromise of the security at the the Nigerian Defence Academy in Afaka, Kaduna State, by gunmen as a worrisome dimension to insecurity in the country.\nWe commend the intervention of the Nigeria Press Organisation in protecting the freedom of press in the country,’’ the Guild stated.\nThe NGE expressed appreciation to the government and people of Jigawa State for the conducive environment provided during its Standing Committee Meeting in Dutse.\nMeanwhile, the editors said that this year’s All Nigerian Editors Conference (ANAC), the largest gathering of Nigerian editors and owners of newspapers, magazines, radio/television stations and online newspapers in Nigeria will hold at the Nigerian Air Force Conference Centre (NAF) in Abuja between October 21 and 22.\nAlso expected at the two-day conference are top security officers in the country, chief executive officers in the private sector, state governors, lawmakers, academics and others."
  },
  {
    "headline": "JMK, Sammie, Maria evicted from BBNaija show",
    "summarized_story": "JMK, Sammie and Maria have been evicted from the ongoing 2021 edition of the Big Brother Naija reality TV show tagged Shine Ya Eye.\nThe eviction of JMK was after she was nominated for eviction alongside Sammie, Pere, Maria and Queen.\nJMK was introduced into the show on August 8 alongside Kayvee, Michael and Queen shortly after Yerins, Niyi and Beatrice.\nJMK’s profileFull name: Jumoke Zainab AdedoyinA 23-year-old law graduate from Kwara State, JMK has aspirations of becoming a certified member of the Nigerian Bar.\nShe went into the BBNaija show with the belief that it will help build her brand and position her to advance further in her career."
  },
  {
    "headline": "Bandits kill Senator Na’Allah’s son, two others in Kaduna",
    "summarized_story": "Bandits kill Senator Na’Allah’s son, two others in KadunaBandits kill Senator Na’Allah’s son, two others in KadunaSome bandits in separate attacks have killed three persons, including a pilot, in two local government areas of Kaduna North and Kajuru, Kaduna State.\nThe pilot, Captain Abdukkarim Bala Na’Allah, said to be the eldest son of Senator Bala Na’Allah, was killed by the hoodlums in his Malali (GRA) residence in Kaduna North Local Government Area on Sunday.\nSenator Na’Allah represents Kebbi South Senatorial seat in the Senate and was the Deputy Majority leader in the Eighth Senate.\nAn aide to Senator Na’Allah, Malam Garba Mohammed, confirmed the killing of the trained pilot.\n“Suspected Kaduna Bandits Kill Captain Abdulkarim Bala Na Allah, the first Son of Senator Bala Na’Allah, in his Malali GRA Residence Kaduna today,” said a statement trending on social media."
  },
  {
    "headline": "Oyedepo releases curses on Fulani vagabonds",
    "summarized_story": "Bishop David Oyedepo of the Winners Chapel rained curses on those he called the Fulani vagabonds, making life impossible for local people.\nHe released the curses at the first service of his church on Sunday at the Faith Tabernacle, Canaanland Ota, Ogun state.\n“The Fulani vagabonds are making life impossible for local people and the government claims not to know”, Oyedepo said“Many destinies have been unsettled by the unsettlement in the nation”, he added before delivering the curses.\n“You can tell how many destinies have been unsettled by the unsettlement of this Nation: Fulani Vagabonds making life impossible for local people and do they claim not to know?\n“And the Church became mute; they cut the neck of a Church leader in this kind of AGE."
  },
  {
    "headline": "3000 Boko Haram fighters surrender to Nigeria, 900 to Cameroon",
    "summarized_story": "By Yakubu Uba/MaiduguriA total of 3,900 Boko Haram terrorists have surrendered in recent days, Governor Babagana Zulum made this known Sunday.\nHe said 3,000 insurgents surrendered to Nigerian authorities, while, 900 surrendered to Cameroon.\n“There are also under aged children and others conscripted by the insurgents,” Zulum explained.\nZulum said the forum should reach a common ground on how to handle the situation for lasting peace in the state.\nIt also asked the North East Development Commission to be involved in all aspects of rehabilitation and reintegration of surrendered Boko Haram into the mainstream society."
  },
  {
    "headline": "PHOTOS: The house where Kebbi Senator’s son was murdered",
    "summarized_story": "Senator Bala Na Allah’s eldest son, Captain Abdulkarim Bala Na Allah, was found dead in his bedroom at Malali in Kaduna on Sunday.\nThe 36-year-old pilot, who married recently, was strangled while the assailants escaped with his vehicle and personal belongings.\nBelow are pictures of the late captain’s residence.\nPhoto credit: Lami Sadiq"
  },
  {
    "headline": "[BREAKING] Doctors’ Strike: FG Dares NMA, Rejects 21-day Ultimatum",
    "summarized_story": "The Nigeria Medical Association’s 21-day ultimatum to the Federal Government, according to the Ministry of Labour and Employment, is in direct conflict with the Memorandum of Understanding agreed on August 21, 2021.\nBut reacting to the threat in a statement titled, ‘Labour ministry to NMA: Your 21-day ultimatum in collision with our MoU,’ the government argued that the NMA’s position was at variance with the timeline stated in the Memorandum of Agreement.\nIt said, “First is that the NMA communique in Benin which issued a 21-day ultimatum is at variance with the timeline in article II, Vii, Vii and X of the MOA.\nTill now, Both NARD/ Postgraduate Medical College are yet to submit the validated application for the eligible doctors missed out in 2020 to enable this payment.\nThe NMA is yet to do this, yet issuing a fresh ultimatum."
  },
  {
    "headline": "BREAKING: Bandits Kill Senator Na’Allah’s Son, Two Others In Kaduna",
    "summarized_story": "Three people, including a pilot, were killed by bandits in two local government areas of Kaduna North and Kajuru, Kaduna State, in separate incidents.\nA statement trending on social media read,“Suspected Kaduna Bandits Kill Captain Abdulkarim Bala Na Allah, the first Son of Senator Bala Na Allah in his Malali GRA Residence Kaduna today,”Meanwhile, in the Kajuru assault, it was reported that bandits attacked the Makoro Iri Village in Kajuru Local Government Area, killing two people.\nThe Commissioner further stated that Operation Safe Haven troops rescued travelers along the Gidan Waya-Godogodo road in the state’s Jema’a LGA.\nJibril Salisu, Happy Sunday, and Ruth Dauda were the identities of the rescued travelers, according to him.\nThe Commissioner said, “Security agencies have reported to the Kaduna State Government that two persons were killed by bandits in Makoro Iri village of Kajuru LGA."
  },
  {
    "headline": "Blast Heard In Afghan’s Capital Kabul",
    "summarized_story": "AFP journalists reported a huge explosion in Kabul, Afghanistan’s capital, on Sunday, only hours after US officials warned of the likelihood of a terror assault.\nAccording to AFP, it was a missile that “initial information reveals damaged a house,” according to a security officer from the recently dissolved government.\nDetails will be provided later…AFP"
  },
  {
    "headline": "Breaking: Maria, Sammie evicted from BBNaija season 6 ‘Shine Ya Eye’ show",
    "summarized_story": "Controversial housemate has been evicted from the big brother Naija season six Shine Ya Eye reality show.\nSammie and JMK were others evicted this Sunday night.\nPere, Queen, and Maria were also nominated for eviction earlier this week.\nMaria’s eviction comes as a shock to many of her fans."
  },
  {
    "headline": "Breaking: JMK evicted from BBNaija season 6 show",
    "summarized_story": "JMK has been evicted from the 2021 BBnaija reality TV Show titled ‘Shine Ya Eye’.\nShe is the sixth housemate to be evicted in this season.\nAs usual, the eviction was hosted by the media personality, Ebuka Obi-Uchendu.\nEarlier this week, Sammie, JMK, Pere, Maria and Queen were within the week nominated for eviction."
  },
  {
    "headline": "Breaking: Bandits invade Kaduna, kill Senator’s son",
    "summarized_story": "Some gunmen suspected to be bandits on Sunday reportedly killed Captain Abdukkarim Bala Na’Allah, son of a serving Senator Senator Bala Na’Allah.\nSenator Na’Allah represents Kebbi South Senatorial seat in the Senate and was the Deputy Majority leader in the Eighth Senate.\nAn aide to Senator Na’Allah, Malam Garba Mohammed, confirmed the killing of the trained pilot in a statement trending on social media.\n“Suspected Kaduna Bandits Kill Captain Abdulkarim Bala Na Allah, the first Son of Senator Bala Na’Allah, in his Malali GRA Residence Kaduna today,” he said.\nThe bandit also killed two persons, including in two local government areas of Kaduna North and Kajuru, Kaduna state."
  },
  {
    "headline": "It’s time to defend ourselves – Christian Youths -NigPilot",
    "summarized_story": "Youth Wing Christian Association of Nigeria YOWICAN, condemned in strong terms the mindless mass killing of Christians and Plateau State citizens, especially on Wednesday morning by bandits in Jos North Local Government Area of Plateau State.\nBelusochukwu Enwere, lamented that governments at both state and federal levels have woefully failed to put an end to the mindless attacks, killings and destruction of property.\nEnwere , while reacting to the ongoing destruction of lives and property in the state urged Christians and indeed Nigerians to defend themselves.\n“I condemn in totality the gruesome killings of over 35 Plateau citizens especially Christians on 25th August 2021 in midnight attack where houses and churches were burnt including a primary school in Kunga of Zangam.\n“Christians youth across the country and indeed Nigerians should defend themselves against killers before we are all consumed."
  },
  {
    "headline": "Access Bank, Xploits Consulting organize free testing, vaccination for Hepatitis",
    "summarized_story": "In a concerted effort to curb its menace and create awareness of the dangers of the Hepatitis variants in the country so as to reduce mortality and infection rates, Access Bank Plc in collaboration with Xploits Consulting Ltd has organized free testing and vaccination for Hepatitis which is believed to be a nightmare in the country.\nThe exercise was conducted in four area councils of Kuje, Bwari, Gwagwalada and Kwali in the FCT.\nHe added that its treatment required a 3 dose treatment from 0 to 6 months.\nAlso Dr Tayo Taiwo, Principal Partner Xploits Consulting ltd Abuja said the medical outreach program was set out to screen and vaccinate at least 160 people against Hepatitis virus in four area council in the FCTThe medical outreach was facilitated by Xploits Consulting ltd with support from Access Bank Plc as part of its community support program.\nIn appreciation a Pastor of Family Worship Centre, Gwagwalada, Emmanuel Danladi appreciated the efforts of the organizers while praying for the growth of Access Bank and Xploits Consulting Ltd for making the test and vaccination available and free of charge."
  },
  {
    "headline": "NSA denies any rift with Amnesty Office -NigPilot",
    "summarized_story": "Office of the National Security Adviser on Sunday denied any rift with Amnesty Office over tenure elongation.\nThe Head of Strategic Communication, Office of the National Security Adviser, ZM Usman in a statement called on Stakeholders and Amnesty beneficiaries to continue to support ongoing reforms of the Programme.\nThe statement noted that the Office of the National Security Adviser and the Interim Administrator of the Presidential Amnesty Programme are not on war path over tenure extension.\nThe NSA reiterated its call on the Amnesty beneficiaries to continue to support the ongoing reform of the Programme.\nThe statement concluded that “For the avoidance of doubt, the Interim Administrator of the Presidential Amnesty Programme enjoys the full support and confidence of the National Security Adviser”."
  },
  {
    "headline": "UTC Remodelling shop Owners association, Traders urge FCT minister’s prompt Action",
    "summarized_story": "In a joint meeting held with the Abuja Markets Management Limited, the association “demanded proof that the Abuja Investments Company Limited are the owners of the complex.” Despite promises made by Abuja Markets Management Limited to get answers from its parent body, nothing has been heard of to date.\nIt’s on this premise we resolved to offer the following prayers to the Minister of FCT for his prompt intervention.\n“This presupposes that every Shop Owner would be offered the first right of refusal over any new allocation.\n“Further to our earlier oral and written representation to the Abuja Metropolitan Management Council that was mandated by the Permanent Secretary to investigate the circumstances surrounding threats by the Abuja Investments Company Limited.\nAll Shop Owners have been consistent in their payment of Ground Rent to the Abuja Investments Company Limited; and Service Charge to the Abuja Markets Management Limited from January; 2009 till date."
  },
  {
    "headline": "[UPDATE] FG Rejects 21-Day Ultimatum Issued By NMA",
    "summarized_story": "The Ministry of Labour and Employment has rejected the 21-day ultimatum given to the Federal Government by the Nigeria Medical Association saying it is in direct collision with the Memorandum of Understanding signed on August 21.\nRead Also: NMA Issues FG 21-Day Ultimatum To Resolve Industrial Disputes With NARD, OthersThis ultimatum was part of the resolutions reached during its National Executive Council (NEC) meeting, held in Benin City last week.\nNMA’s ultimatum is the latest in the lingering tussle between the Nigerian government and NARD which has gone on strike since July 31.\nBut the NMA has thrown its weight behind the striking doctors and other health workers.\n“The Nigerian Medical Association fully supports all her affiliates in their efforts to improve the healthcare delivery in Nigeria and the welfare of her members,” it assured."
  },
  {
    "headline": "Nigeria Records 53 More COVID-19 Deaths In 24 Hours",
    "summarized_story": "Nigeria has recorded 53 deaths from COVID-19 in the past 24 hours.\nThe Nigeria Centre for Disease Control (NCDC) announced this on Saturday night, adding that new cases were confirmed in 16 states and the Federal Capital Territory (FCT).\nThe additional COVID-19 related deaths increased the country’s fatality figure to 2,361.\nBut 8,232 were discharged on Saturday, the highest number of cases discharged since the advent of the third wave of the pandemic.\nSo far, Nigeria’s total COVID-19 cases stand at 190,983 infections."
  },
  {
    "headline": "SERAP Sues FG, Seeks Details Of ‘Payment Of ₦729bn To Poor Nigerians’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has sued the Federal Government, asking for details of the ₦729bn payment to 24.3m poor Nigerians across the country.\nSERAP Deputy Director, Kolawole Oluwadare, disclosed this in a statement issued on Sunday, adding that the suit with the number FHC/L/CS/853/2021 was filed at the Federal High Court in Lagos.\nThe suit followed the group’s Freedom of Information (FoI) request to the Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar-Farouk.\nREAD ALSO: Nigerians ‘Will Miss Him’: Buhari Mourns Sir Victor UwaifoIt is asking the minister to disclose “the details of beneficiaries and selection criteria, as well as the payment plan [which] would promote transparency and accountability, and remove the risks of mismanagement and diversion of public funds”.\n“Providing support and assistance to poor Nigerians is a human rights obligation but the programme to spend five percent of the 2021 budget, which is mostly based on deficit and borrowing, requires anti-corruption safeguards to ensure the payments go directly to the intended beneficiaries, and that public funds are not mismanaged or diverted,” the statement added."
  },
  {
    "headline": "Legendary Musician Sir Victor Uwaifo Is Dead",
    "summarized_story": "Veteran musician Victor Uwaifo has died at the age of 80.\nREAD ALSO: Veteran Nollywood Actor, Victor Olaotan, Is DeadHe won many musical awards both nationally and internationally.\nBuhari mournsMeanwhile, President Muhammadu Buhari has condoled with the family and friends of the legendary musician.\n“President Muhammadu Buhari condoles with family, friends and associates of legendary musician and multi-talented artiste, Sir Victor Uwaifo, who passed on Saturday, leaving a legacy of successes in many areas of life, including academia and administration,” the statement said.\n“President Buhari prays for the soul of the departed musician, writer, sculptor, musical instrument inventor and university lecturer, knowing the entire country, particularly the music industry, will sorely miss him.”"
  },
  {
    "headline": "US Carries Out Air Strike To Stop Car Bomb In Kabul",
    "summarized_story": "A Taliban spokesman confirmed the incident, saying a car bomb destined for the airport had been destroyed — and that a possible second strike had hit a nearby house.\nHe has been living there from the very beginning,” said Taliban spokesman Zabihullah Mujahid.\nBiden traveled Sunday to an air force base in Delaware to attend the somber ritual transfer of their remains.\nUS Secretary of State Antony Blinken said Sunday that some 300 Americans still in Afghanistan were seeking to leave the country.\nThe US embassy in Kabul later released a warning of credible threats at specific areas of the airport, including access gates."
  },
  {
    "headline": "Nigerian Senator’s Pilot Son Murdered in Northwest Kaduna State",
    "summarized_story": "The eldest son of a Nigerian Senator, Captain Abdulkarim Bala Na Allah, has been found dead in his bedroom at Malali in northern Kaduna state.\nReports suggest that the 36-year-old pilot, who married recently, was tied and strangled while the assailants escaped with his vehicle and personal belongings.\nHe said a neighbour’s security guard had noticed the gate of the deceased home opened and raised the alarm which led to the discovery of the remains of the pilot.\nLocal media reports that Senator Na Allah, who is presently not in the country, has three sons who are all pilots.\nThe Kaduna State Police Command is yet to react to the murder."
  },
  {
    "headline": "Brazilian Wife of Greek Ambassador Jailed 31 Years Over His Murder",
    "summarized_story": "A Brazilian woman has been sentenced to 31 years in prison for conspiring the murder of her husband, the former Greek ambassador to Brazil.\nIn 2016, Kyriakos Amiridis’ charred remains were found in the boot of a burnt-out car in Rio de Janeiro.\nHis wife Françoise de Souza Oliveira had been having an affair with a military police officer, Sergio Gomes.\nMr Gomes later admitted to killing the ambassador at the behest of his lover, and he has been jailed for 22 years.\nThe burnt-out car was found the next day under a flyover, with the ambassador’s body inside."
  },
  {
    "headline": "Biden Travels to Air Base to Honour Troops Killed in Afghanistan",
    "summarized_story": "U.S. President Joe Biden arrived at Dover Air Force Base on Sunday to honor members of the military killed in a suicide bomb attack during the evacuation of civilians from Afghanistan last week.\nAn Islamic State suicide bombing on Thursday killed scores of Afghans and 13 American troops who were guarding Kabul’s airport amid an airlift that has evacuated about 114,400 people in the past two weeks.\nAfter arriving at the base in Delaware, Biden and his wife, Jill, met with the families of service members killed in the attack.\nThey watched as flag-draped cases carrying 11 service members’ remains were loaded into vans.\nThe remains of two more service members will be transferred in an event not covered by media at the request of their families."
  },
  {
    "headline": "Lagos to Begin Administration of AstraZeneca Covid Vaccine August 30",
    "summarized_story": "The Lagos State Government says it will resume the administration of the second dose of the AstraZeneca COVID-19 vaccine on August 30.\nThe vaccination will be for 20 days, from August 30 to September 24, NAN quotes Ogunbanwo as saying in a statement.\nHe said that only persons who had received the first jab of the vaccine during the first phase of the AstraZeneca vaccination exercise in the state were eligible for the exercise.\nThe director advised eligible persons to present their vaccination cards between 9 a.m. to 3 p.m. at the vaccination sites to get vaccinated.\nHe warned against mixing one brand of vaccine with another brand, saying it was not allowed."
  },
  {
    "headline": "US Drone Strikes ISIS-K Vehicle Packed With Explosives in Kabul",
    "summarized_story": "military forces conducted a self-defense unmanned over-the-horizon airstrike today on a vehicle in Kabul, eliminating an imminent ISIS-K threat to Hamad Karzai International airport,” U.S. Central Command spokesman Navy Capt.\nThe latest strike follows a Friday drone strike that killed two high-profile ISIS-K members believed to be involved in planning attacks against U.S. forces in Kabul.\nThe White House said Sunday that the president and first lady will meet with the families of the fallen and observe a dignified transfer of the remains at Dover Air Force Base.\nA dignified transfer is a solemn process in which the remains of fallen service members are carried from an aircraft to an awaiting vehicle.\nA dignified transfer is conducted for every U.S. service member killed in action."
  }
]