[
  {
    "headline": "JUST IN: Ondo Amotekun arrests suspected masterminds of Owo massacre",
    "summarized_story": "Ondo State Governor Rotimi Akeredolu at the scene of the church attackThe Ondo State Security Network Agency, codenamed “Amotekun Corps” has confirmed that some suspects have been arrested in connection with the terrorist attack on St. Francis Catholic Church, Owo.\nThe suspected terrorist invaded the church on June 5, killing no fewer than 40 people and injuring many other worshippers.\nThe state Commander of Amotekun, Adetunji Adeleye, on Thursday, said some suspects had been arrested in connection with the killing.\nHe however did not give the actual figure of the suspects arrested but expressed assurance that all the attackers of the worship center would be apprehended.\nDetails later…"
  },
  {
    "headline": "Probe Supreme Court Justices corruption allegations against CJN, HURIWA urges NJC, CCT",
    "summarized_story": "The PUNCH had reported that Justices of the Supreme Court had, in a joint petition, accused the CJN of corruption, maladministration and incompetence.\nHowever, Muhammad denied the allegations and described the petition of the Justices as “dancing naked at the market square”.\nHURIWA, however, said an intervention by the Body Of Benchers would mend the broken fences between the Justices and the CJN.\nThe statement reads in part, “The NJC, the CCT and the National must swiftly probe the Chief Justice of Nigeria, Tanko Muhammad.\nThe corruption allegations levelled against him are too weighty to be ignored considering the fact that these are allegations from Supreme Court justices."
  },
  {
    "headline": "BREAKING: UK police charge two Nigerians for alleged organ harvesting plan",
    "summarized_story": "The United Kingdom Metropolitan Police have formally charged two Nigerians with conspiracy to facilitate travel of another person for organ harvesting.\nThe suspects were arrested and charged over their plan to bring a child into the country to allegedly harvest the said child’s organs.\nThe two arrested suspects were identified as Beatrice Nwanneka Ekweremadu, 55, and Ike Ekweremadu, 60, from Nigeria.\nThey are charged with conspiracy to harvest organs, The Guardian UK reports.\nAccording to the report, the charges involve arranging or facilitating travel of another person with a view to exploitation, namely organ harvesting, the Met said in a statement."
  },
  {
    "headline": "Campus gas emission, fire outbreak: Our story – Caritas University",
    "summarized_story": "By Dirisu YakubuThe management of the Caritas University Enugu campus have said the gas flaring and fire outbreak that lasted for 21 days in a section on its premises did not affect any live or property in the school and it’s environs.\n“The next day as we continued to make contact with relevant agencies, that was when fire erupted from the gas emission.\nThat was when we intensified our calls to the Governor, other relevant agencies to inform them that their was problem at hand.\n“They all responded, the Governor came visiting with all the relevant agencies and we held series of meeting on how to put off the fire.\n“A look at the well as inspected by the relevant agencies it was so dry that no gas was found inside it."
  },
  {
    "headline": "Maritime Criminality/Oil Theft: Navy foils criminal’s attempt to steal N2.7bn crude products",
    "summarized_story": "Similarly, NNS Soroh in Bayelsa State intercepted a wooden boat laden with about60,000 litres of suspected illegally refined AGO.\n“Additionally, one wooden boat laden with unspecified quantity of suspected stolen crude oil was discovered and handled appropriately.\nFurthermore, 5 suspects and a wooden boat laden with about 70,000litres of suspected illegally refined AGO were apprehended under Kiama bridge.\nThe site had 4 metal storage tanks filled with about 250,000litres suspected illegally refined AGO.\n“The vehicles were discovered to be carrying a total of 84 x 25 litre jerry cans containing illegally refined AGO."
  },
  {
    "headline": "PHOTOS: Fire guts commercial bus being chased by LASTMA in Lagos",
    "summarized_story": "By David RoyalIt was a sad day in Lagos, as an 18-seater yellow bus heading towards the Maryland area of the state was engulfed by fire.\nThe incident occurred on Thursday, June 22, at the popular Obanikoro bus stop, very close to Awoof fast food.\nIt is not clear exactly how many people were on the bus, but witnesses said there were passengers who ran out of the bus immediately after they noticed the fire.\nIt was, however, gathered that the LASTMA operatives also destroyed properties and wounded some eyewitnesses and okada riders who attempted to stop them from running away.\nIt was also gathered that before other drivers and passersby could rally round to put out the fire, the bus was already burnt completely beyond recognition."
  },
  {
    "headline": "2023: Why Peter Obi, Gov Bala Muhammed visited Wike in Rivers",
    "summarized_story": "Obi had met with Wike on Wednesday behind closed doors at his private residence in Port Harcourt.\nBut, in a statement via his verified Twitter handle on Thursday, Obi said he had visited the Governor to discuss vital national issues.\nThe statement reads, “Earlier today, I visited Port Harcourt, to confer with H.E.\n@GovWike on vital issues of national interest.”Meanwhile, aside from Obi, Governor Bala Mohammed of Bauchi State had also visited Wike in Port Harcourt.\nRecall Wike had lost the PDP presidential ticket to Atiku Abubakar, while fingering his counterpart southern governors within the PDP of betrayal."
  },
  {
    "headline": "Ikpeazu resolves rift between IEA, host community",
    "summarized_story": "Abia state Governor, Okezie Ikpeazu, on Wednesday resolved the rift between the management of premium soap and detergent manufacturers, International Equitable Association (IEA) and their host community, Umuokeyibe Umungasi, Aba, thereby paving way for the resumption of production activities at the hitherto moribund factory of the industrial giants.\nHe directed the management of IEA to ensure that they abide by the terms of settlement including ensuring that youths of the community were gainfully employed at management and other levels within the organization.\nIEA which commenced operations in 1954 manufactures popular detergent and soap brands such as Truck soap, Appolos detergent.\nPalmolive soap among others, before the ownership crises that led to the closure of the company in 2009.\nThe meeting which was held in Governor’s Lodge, Aba, was also attended by the state commissioner for Trade and Investment, Chief John Okiyi Kalu and other top government officials."
  },
  {
    "headline": "BREAKING: Ike Ekweremadu, wife arrested for organ harvesting in London",
    "summarized_story": "A Nigerian, Ike Ekweremadu, and his wife, Beatrice Nwanneka Ekweremadu, have been arrested by the United Kingdom for organ harvesting.\nThe Police said that they have been remanded in custody and will appear at Uxbridge Magistrates’ Court today.\n“Beatrice Nwanneka Ekweremadu, 55 (10.9.66) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting,” the statement reads.\n“Ike Ekweremadu, 60 (12.05.62) of Nigeria is charged with conspiracy to arrange/facilitate the travel of another person with a view to exploitation, namely organ harvesting.\n“As criminal proceedings are now under way we will not be providing further details.”"
  },
  {
    "headline": "NMA confirms kidnap of medical doctor in Kogi",
    "summarized_story": "The Nigeria Medical Association (NMA) has confirmed the kidnapping of one of its members, Dr Rukayat Musa, in Kogi State.\nA statement jointly signed by the State Chairman, Dr Abubakar Alhassan; and Secretary, Dr Udebuani Chimezie, said Dr Musa was forcefully taken away by the kidnappers on 21st June 2022 along Geregu-Ajaokuta stretch of Geregu Ajaokuta- Lokoja road while returning from an official assignment at Anyigba in Kogi State.\nAccording to the statement, Dr Rukayat Musa works with the National Health Insurance Scheme (NHIS) office in Lokoja.\nThe association, however, calls on the Government and all security agencies to work very hard towards her early and safe return.\nDAILY POST had earlier reported that gunmen suspected to be kidnappers on Tuesday abducted seven people, including a doctor and a lawyer."
  },
  {
    "headline": "Owo massacre: Amotekun arrests suspects in connection with attack",
    "summarized_story": "The Commander of the Ondo State Security Network, otherwise known as Amotekun, Akogun Adetunji Adeleye, has revealed that some of the suspects involved in the June 5 terror attack at Saint Francis Catholic Church, Owo, have been apprehended.\nThe Amotekun Commander disclosed this while parading 71 suspected criminals at the command’s headquarters on Thursday.\nAdeleye, who did not give the actual figure of the suspects arrested in connection with the attack, assured that all those involved in the attack would be tracked down.\nHe noted that investigation is ongoing and that the perpetrators of the terror attack in Owo will never go unpunished.\n“A number of people have been arrested concerning the Owo issue as well as some equipment."
  },
  {
    "headline": "Drama as human rights lawyer attends Supreme Court proceedings in traditional worshippers’ attire [Photos]",
    "summarized_story": "There was mild drama at the Supreme Court, Abuja, on Thursday as a Lagos-based human rights lawyer, Malcom Omoirhobo caused a stir in the courtroom when he appeared in the full traditional attire of an “Olokun priest” to attend court proceedings.\nIt would be recalled that the Supreme Court had on Friday given approval to female Muslim students to wear hijab to school in Lagos State.\nThe lawyer who gained entry into the court was barefooted with feathers attached to his wig.\nThe court proceedings were abruptly stopped when the presiding justice suddenly announced that they would be going for a short break.\nMalcom who addressed journalists said, “I am very grateful to the Supreme Court just last week Friday they made a very resounding decision that promotes Section 38 of the constitution."
  },
  {
    "headline": "IGP, Chief Of Army Staff asked to resign over killings in Benue, others",
    "summarized_story": "The Coalition of Southern and Middle Belt Youth Leaders Assembly, COSMBYLA, has asked the Inspector-General of Police, IGP, Usman Alkali Baba and the Chief of Army Staff, Lt Gen Farouk Yahaya, to resign over the inability to tackle the killing of unsuspecting citizens of Benue State and other parts of the country.\nA statement by the President-General of the coalition, Goodluck Ibem, condemned the killing of 16 timber traders at Udei and Yelwata communities in Guma Local Government Area of Benue State by suspected Fulani terrorists.\nReacting, the coalition tackled President Muhammadu Buhari for failing to accept his failure and resign as a Nigerian leader.\nHuman lives are sacrosanct and it is an unpardonable sin for anyone to play politics with precious human lives,” it said.\nThe series of killings still going on in Benue state shows that Operation Whirl Stroke is not living up to expectations and they should be held accountable for the various killings."
  },
  {
    "headline": "Gunmen kill monarch, CDC chair as eight perish in Bayelsa boat accident The Nation Newspaper",
    "summarized_story": "Community sources claimed the monarch and the CDC chairman were initially abducted on Sunday but by Monday, news filtered into the community that they had been killed.\nIt was learnt the murder of Kolibo and Samuel was not unconnected with chieftaincy tussle in the community.\nSpokesman for Bayelsa State Police Command, Asinim Butswat, a Superintendent of Police, confirmed the murder of the two community leaders.\nRead Also: Gunmen kidnap former Ekiti Chief pharmacistButswat said: “Chief Francis Kolibo and Oburu Samuel were killed by suspected gunmen at Ikarama community, Yenagoa LGA.\nBayelsa chairman of the Maritime Workers Union of Nigeria (MWUN), Ipigansi Ogoniba, who confirmed latest accident, said that it involved a local boat and a speedboat."
  },
  {
    "headline": "BREAKING: UK Police detain Ekweremadu, wife The Nation Newspaper",
    "summarized_story": "The Specialist Crime Team of the Metropolitan Police in London has detained a former Senate Deputy President Dr. Ike Ekweremadu and his wife, Beatrice.\nAccording to Sky News, the two suspects were arrested for alleged conspiracy to harvest the organs of a child.\nThe media organisation reported: “Two people have been charged with conspiring to bring a child to the UK in order to harvest organs, the Metropolitan Police said.\n“Beatrice Nwanneka Ekweremadu, 55, and Ike Ekweremadu, 60, have been remanded in custody and will appear at Uxbridge Magistrates’ Court today.\n“Charges were brought against the pair, who are from Nigeria, following an investigation by the Metropolitan Police’s Specialist Crime team."
  },
  {
    "headline": "BREAKING: Suspected Owo terror killers arrested The Nation Newspaper",
    "summarized_story": "The Ondo State Security Network Agency codenamed Amotekun Corps said it has arrested some persons involved in the attack of St Francis Catholic Church, Owo, Owo local government area.\nIt said it also recovered some weapons and vehicle used to perpetrate the terror act.\nAbout 40 persons were killed in the attack with 70 others injured in the attack carried out on June 5 at St Francis Catholic Church, Owo.\nDetails Shortly…"
  },
  {
    "headline": "JUST IN: Abducted Plateau monarch regains freedom The Nation Newspaper",
    "summarized_story": "The District Head of Panyam in Mangu local government area of Plateau State, His Royal Highness, Aminu Derwan, who was abducted in his palace on Monday by gunmen has regained freedom.\nPalace sources told The Nation on Thursday that the traditional ruler was released around 11:45 pm on Wednesday to the waiting arms of his family who had been negotiating for his release.\nThe source further stated Dewan arrived his palace in Panyam amidst jubilation by his subjects and other chiefs on Thursday morning.\nThe Nation also gathered the kidnappers who demanded for N150 million ransom reduced it to N10 million on Wednesday morning.\nDerman was the third monarch kidnapped in the local government in recent time causing apprehension and tension in the area."
  },
  {
    "headline": "Lagos police arrest three robbery suspects, recover loot The Nation Newspaper",
    "summarized_story": "The Lagos State Police Command has arrested three suspected traffic robbers, Usman Mohammed, Azeez Adeleke and Solomon Odiya, in Ikeja.\nThe spokesperson for the Command, SP Benjamin Hundeyin, confirmed the arrest in a statement in Lagos.\nHundeyin said that the suspects were arrested at about 8:00 p.m. on June 19, at Mobolaji Johnson Road, Ikeja.\n“The suspects were arrested by officers of Alausa Division of the Command following a distress call received by the police about an ongoing robbery attack at Ikeja.\n“Items recovered from the suspects include one Tecno mobile phone, one dagger and N5,400,” he said."
  },
  {
    "headline": "Afghanistan: Villagers bury dead, dig for survivors after quake kills 1,000",
    "summarized_story": "(AP)Villagers rushed to bury the dead Thursday and dug by hand through the rubble of their homes in search of survivors of a powerful earthquake in eastern Afghanistan that killed at least 1,000 people.\nThe Taliban and the international community that fled their takeover struggled to bring help to the disaster’s victims.\nThe takeover led to a cutoff of vital international financing, and most of the world has shunned the Taliban government.\nBiden on Wednesday ordered the U.S. international aid agency and its partners to “assess” options for helping the victims, a White House statement said.\nThe death toll reported by Bakhtar was equal to that of a quake in 2002 in northern Afghanistan."
  },
  {
    "headline": "European Union leaders set to grant Ukraine candidate status",
    "summarized_story": "(AP)European Union leaders on Thursday are set to make Ukraine a candidate for joining the 27-nation bloc, a first step in a long and unpredictable journey toward full membership that could take many years to navigate.\nAccording to several diplomats who spoke on condition of anonymity before a leaders’ summit in Brussels, Ukraine will receive the unanimous approval required for candidate status and the launch of eligibility negotiations.\nPresident Volodymyr Zelenskyy said he spoke with 11 EU leaders on Wednesday, following calls with nine the day before.\nTo help countries with candidate status, the bloc can provide technical and financial assistance throughout negotiations, but can also decide to revoke the status if the required reforms aren’t implemented.\n“But I am convinced that it is precisely the (post-war) reconstruction of Ukraine that will provide opportunities to take important steps forward.”Leaders will also debate Thursday a recommendation for the European Commission to grant Moldova — a tiny, non-NATO country that borders Ukraine — EU candidate status."
  },
  {
    "headline": "BREAKING: FG reverses Nigeria’s ban from Basketball events",
    "summarized_story": "President Muhammadu Buhari has approved the immediate return of Nigeria to international basketball competitions.\nThis was announced on Thursday by the Permanent Secretary, Federal Ministry of Youth and Sports Development, Ismaila Abubakar, at a press briefing in Abuja.\nAbubakar said: “The letter appealed to the Minister to use his good offices to approach President Buhari for the reversal of the 2-year withdrawal of Nigeria from international basketball competitions.\n“Failure to do this, as with any constitutionally bound sovereign nation, will attract sanctions.\nThere was first a country before any organization or federation that bears the Nigerian name, colours and flag us representing Nigeria."
  },
  {
    "headline": "Why we’ll embark on strike-NUT",
    "summarized_story": "From Adanna Nnamani, AbujaFollowing the dismissal of 2,357 teachers by Governor Nasir el-Rufai’ in Kaduna State recently, the national leadership of the Nigerian Union of Teachers (NUT) has threaten to embark on strike if the action is not reversed immediately.\nRemember that because of the competency test issue, we went to court.\n““He was not dismissed then for failure to write the competency test.\n“The intention clearly is to intimidate the NUT President and embarrass the Teachers in Nigeria.\nThis like other anti labour and people policies of the Kaduna State Government has failed on arrival."
  },
  {
    "headline": "Gunmen kidnap retired chief pharmacist in Ekiti",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiGunmen on Wednesday evening, kidnapped a retired Chief Pharmacist with the Ekiti Ministry of Health, Mr Israel Bamisaye.\nThe incident was said to have happened along his farm located between Ero Dam and the Ekiti State farm settlement located at Orin Ekiti, Ido/Osi Local Government Area of the state.\nThe source said: “The seven gunmen had earlier attacked one man identified as Ojo within the vicinity of the farm where Bamisaye was kidnapped.\n“The man was asked about the whereabouts of the white men working at the farm settlement, but he replied that he didn’t know where they were.\nBut the Commander , Ekiti State Amotekun Corps, Brig Gen Joe Akomolafe, confirmed the incident."
  },
  {
    "headline": "Don’t Sell Your Votes, Oyetola Begs Electorate – THISDAYLIVE",
    "summarized_story": "Yinka Kolawole in OsogboOsun State Governor, Gboyega Oyetola, has urged the people of the state to shun the act of selling their votes to politicians whom he said have been boasting to induce electorate with ‘dollars and pounds’.\nThe governor, who said the APC was not for ‘fire for fire’, said they were to uphold a good democratic system.\nIf they bring the money collect it but don’t vote for them.\nOsun State should not be used as a test of governance with all the challenges facing the state.\n“There will be adequate security for Osun State governorship election, so don’t be intimidated by anyone."
  },
  {
    "headline": "Lagos Launches Floating Clinic for Emergency, Outreach Services – THISDAYLIVE",
    "summarized_story": "The Lagos State Government has launched a ‘Floating Clinic Boat’ for swift medical interventions along inland waterways and riverine communities as part of efforts to enhance access to prompt, qualitative and efficient healthcare services across Lagos.\nUnveiling the floating clinic after inspection, the Permanent Secretary, Lagos State Ministry of Health, Dr. Olusegun Ogboye, explained that innovation was introduced to help provide first aid, medical emergency care and basic healthcare services at accident scenes on the inland waterways and riverine communities in Lagos State.\nAccording to him, residents in riverine communities can access the services of the floating clinic through the Lagos State Emergency Services numbers, saying “Once you contact the emergency numbers, the clinic will be deployed.\nIf there is a call about an emergency on the waterways, remote and riverine areas, the emergency process will be activated,” he said.\nGovernor, recognising this, directed that medical services be taken to these areas as part of the mandate to achieve universal health coverage."
  },
  {
    "headline": "NAHCON Condoles with Sokoto over Bandits’ Attack on Hajj Pilgrims – THISDAYLIVE",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Chairman National Hajj Commission of Nigeria (NAHCON) Alhaji Zikrullah Kunle Hassan has sent a condolence letter to the government and people of Sokoto State over bandits’ attack on pilgrims from Isa local government.\nThe pilgrims were said to be travelling to Sokoto on Monday for take-off to Saudi Arabia for the 2022 Hajj before they were attacked.\nThe condolence was contained in a statement issued yesterday by NAHCON spokes person, Fatima Sanda Usara.\nHe also cautioned other states of the federation to reinforce security around pilgrims’ camps and their movements.\nHe reminded state chief executives that safety of the pilgrims and their escorts are their primary responsibilities consequently it should be taken with extra dedication."
  },
  {
    "headline": "Man, 50, Jailed for Raping Four-year-old in Ekiti – THISDAYLIVE",
    "summarized_story": "Victor Ogunje in Ado EkitiAn Ekiti State High Court sitting in Ado Ekiti has sentenced a 50- year old man, Mr. Usman Tajudeen, to life imprisonment for raping a four- year old minor.\nUsman was arraigned before Justice Lekan Ogunmoye on one count charge of rape, contrary to Section 31 (2) of the child’s Right Law, Cap.C7 Laws of Ekiti State, 2012.\nWhen I inquired from her, she said it was Usman that put his something to where I was urinating.\nThe matter was reported at Ikere Ekiti Police Station.”To prove his case, the Prosecutor, K.S.\nAdeyemo, called five witnesses and tendered defendant’s statement, victim’s statement and medical report as exhibits."
  },
  {
    "headline": "FRSC Inaugurates Dangote Truck Driving School – THISDAYLIVE",
    "summarized_story": "Dangote Cement Plc yesterday launched the Dangote Articulated Truck Driving School in a move to inculcate safe driving culture in its drivers so as to stem the tide of road crashes.\nThe opening of the school in partnership with the Federal Road Safety Commission (FRSC), the company management reasoned that that would also make the drivers become better road users.\nThe new academy for truck drivers, according to the Corps Marshal, is a significant step forward that will benefit not only the Dangote Group but Nigeria in general.\nThe country’s road safety chief hailed President and Chief Executive of the Dangote Group, Alhaji Aliko Dangote, for taking ‘a big step’ towards reducing truck Road accidents.\nYusuf, said NBTE would partner the Dangote Cement Plc for a successful accreditation and takeoff of the new school."
  },
  {
    "headline": "Ekweremadu, wife arrested for bringing child to UK for organ harvesting",
    "summarized_story": "Ike Ekweremadu, former deputy senate president, and his wife, Beatrice, have been arrested and charged to court for bringing a child to the UK for organ harvesting.\nConfirming the arrests in a statement, the metropolitan police said the pair were charged to court on Thursday following an investigation by the police’ specialist crime team.\nThe police added that the investigation was launched after detectives were alerted to potential offences under modern slavery legislation in May 2022.\n“Beatrice Nwanneka Ekweremadu, 55 (10.9.66) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting,” the statement reads.\nAdvertisement“Ike Ekweremadu, 60 (12.05.62) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting."
  },
  {
    "headline": "Ekweremadu, wife arrested for bringing child to UK for organ harvesting",
    "summarized_story": "Ike Ekweremadu, former deputy senate president, and his wife, Beatrice, have been arrested and charged to court for bringing a child to the UK for organ harvesting.\nConfirming the arrests in a statement, the metropolitan police said the pair were charged to court on Thursday following an investigation by the police’ specialist crime team.\nThe police added that the investigation was launched after detectives were alerted to potential offences under modern slavery legislation in May 2022.\n“Beatrice Nwanneka Ekweremadu, 55 (10.9.66) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting,” the statement reads.\nAdvertisement“Ike Ekweremadu, 60 (12.05.62) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting."
  },
  {
    "headline": "Nigeria makes U-turn, returns basketball to int’l competitions",
    "summarized_story": "The Federal Government of Nigeria has reversed its decision to withdraw the national teams from participating in international basketball competitions.\nThe reversal was announced in a statement by Ismaila Abubakar, permanent secretary of the ministry of youth and sports development, on Thursday in Abuja.\nOn May 12, Sunday Dare, minister of youth and sports development, announced President Muhammadu Buhari’s directive to withdraw Nigeria from all international basketball competitions for the next two years.\n“Intervention by concerned stakeholders, former Nigerian international basketball players and well-meaning Nigerians to seek for solutions to the issues that triggered the decision.\nThe letter appealed to the Minister to use his good offices to approach President Buhari for the reversal of the 2-year withdrawal of Nigeria from International basketball competitions."
  },
  {
    "headline": "Nigeria makes U-turn, returns basketball to int’l competitions",
    "summarized_story": "The Federal Government of Nigeria has reversed its decision to withdraw the national teams from participating in international basketball competitions.\nThe reversal was announced in a statement by Ismaila Abubakar, permanent secretary of the ministry of youth and sports development, on Thursday in Abuja.\nOn May 12, Sunday Dare, minister of youth and sports development, announced President Muhammadu Buhari’s directive to withdraw Nigeria from all international basketball competitions for the next two years.\n“Intervention by concerned stakeholders, former Nigerian international basketball players and well-meaning Nigerians to seek for solutions to the issues that triggered the decision.\nThe letter appealed to the Minister to use his good offices to approach President Buhari for the reversal of the 2-year withdrawal of Nigeria from International basketball competitions."
  },
  {
    "headline": "Rep makes U-turn, says INEC didn’t extend deadline for voter registration by 60 days",
    "summarized_story": "Aisha Dukku, chairperson of the house of representatives committee on electoral matters, says the Independent National Electoral Commission (INEC) didn’t promise to extend voter registration by 60 days.\nAccording to Dukku, the electoral umpire has several activities on its timetable ahead of the 2023 general election which makes it not viable to extend the deadline by 60 days.\nThe house of representatives had asked INEC to extend the deadline by 60 days, following the June 30 closing date set by the electoral body.\nSpeaking on the floor of the house earlier on Wednesday, Dukku had said INEC agreed to extend the deadline.\nHowever, whatever happens, they cannot be able to open the registration for the next 60 days because of the activities lined up before the general election,” she said."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kune, the controversial Kenyan foodtech startup, has shut down",
    "summarized_story": "Kune, a Kenyan food tech startup that delivered ready-to-eat meals at affordable prices, is closing down today, the company’s founder and CEO Robin Reecht announced.\nThe announcement comes just 4 months after the startup began its commercial operations at established meal centers around Nairobi.\nAround that time, Kune leadership also declared its intentions to raise $3.5 million in its second round of funding.\nBut while Kune was well-liked by its customers, the startup’s journey wasn’t without its fair share of controversy.\nAddressing Kune’s investors, he said, “Not only did you invest in Kune but you gave us your time, brain-width, connections, and emotional support."
  },
  {
    "headline": "These founders are helping companies make decisions with data",
    "summarized_story": "It wasn’t their first time venturing into business together; only the previous year they’d tried building an aggregator to curate data from various African countries which multinational companies could use.\nRutakangwa understands why these costly business errors occur: the data the multinational companies rely on—often collected by market research firms—is assumed African countries to be monolithic and did not provide companies with enough detail with which to make market expansion decisions.\nSo, Rutakangwa and Sewankambo employed regular local consumers, called “mappers”, to collect the data from shops and households.\nWhen a mapper submits the data, Rwazi verifies the information by checking that the shop or household’s geocoordinates matches the mapper’s current location.\nBut Rutakangwa saw things differently: in principle, mapping data for hospitals and pharmacies was the same as mapping for beverage and liquor companies."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Throwing eggs at the glass ceiling",
    "summarized_story": "Rather than the never-ending conferences and TEDx talks, women in leadership positions can make conscious efforts to hire and train young women as mentees.\nYoung women can be Personal aides, legislative aides, advisers, assistants, and executives at different political parties, political communicators, etc.\nLike every career path, public service is a path that one should grow in.\nSuch steady growth will give the woman confidence, skills, public service experience and the right network to support her ambition.\nMaybe, just then, the eggs we have been throwing will eventually break the glass ceiling."
  },
  {
    "headline": "Anxiety as fuel scarcity lingers in Abuja",
    "summarized_story": "By the way, the above scenario is said to be playing out in some other parts of the country where fuel scarcity continues to exist.\nSadly enough, it is not only at gas stations that queues are witnessed as a result of the scarcity.\nNaturally, the petrol shortage has afforded agents like “Black Marketers” the opportunity of cashing out big from their illegal brisk business.\nInvestigations carried out reveal the current fuel crisis in Abuja is about the third in its series to be recorded this year.\nWhile calling on the government to encourage use of alternative fuels like Compressed Natural Gas (CNG) and Liquefied Petroleum Gas (LPG), Adamu canvassed petroleum consumption reduction programmes to include investments in light rail transit."
  },
  {
    "headline": "Nollywood production house Nemsia Films announces the first commissioned slate deal with Amazon Prime Video",
    "summarized_story": "Nollywood production house Nemsia Films has closed the first exclusive slate deal for three commissioned feature films with Amazon Prime Video, having already produced a successful repertoire of world-class content such as God Calling, Before 30, and Journey of an African Colony.\n“We are very excited to collaborate with Nemsia Films on this pioneering slate deal, which will complement our growing lineup of local Nollywood content for Prime Video customers,” said Ayanna Lonian, director of Content Acquisition and head of Worldwide Major Studio Licensing Strategy, Prime Video.\nAlong with Nemsia’s commissioning deal, Prime Video has previously announced exclusive licensing agreements with leading Nigerian production studios, including Inkblot Studios and Anthill Studios, which highlights a commitment by Prime Video to deliver Nigerian and African film to a global audience of more than 200 million Prime members.\nCustomers can stream or download and enjoy anytime, anywhere via the Prime Video app on mobile, tablet, Smart TVs, game consoles, or online at PrimeVideo.com.\nAll available to watch as part of a Prime Video membership, which is available in more than 240 countries and territories worldwide."
  },
  {
    "headline": "How Nigerian firms can retain tech talents",
    "summarized_story": "In a recent statement, Abubakar Suleiman, the chief executive officer of Sterling Bank referred to the exit of these tech talents as a “great resignation”.\nBusinessDay reached out to experts in the tech ecosystem who outlined various ways businesses in Nigeria can retain talents.\nMuhammad Habib, a software engineer explained that the government have a crucial role to play in keeping tech talents from leaving the country.\n“Unethical behaviour at work has to stop if businesses really want to retain tech talents.\n“Everyone knows very few Nigerian companies can afford to compete with what people are paid on freelancing platforms."
  },
  {
    "headline": "Eaton to deepen collaboration with Microsoft on grid-interactive UPS technology",
    "summarized_story": "Eaton, an intelligent power management company, said it will expand its collaboration with Microsoft to accelerate applications of its energy-aware uninterruptible power system UPS technology in key segments worldwide.\nThe expansion is a component of a new strategic framework contract between Eaton and Microsoft intended to meet significant industry trends like digital transformation, sustainability, and the energy transition.\nAccording to Craig McDonnell, senior vice-president and general manager of the energy transition and digital division at Eaton, said: “A grid-interactive UPS helps decarbonize energy at grid level which means that its sustainability benefit extends beyond the data center.\nThis changes the game in terms of energy management within the data center’s overall environmental impact profile.”The primary function of a UPS is to provide backup power protection for mission-critical applications and facilities and to protect them from grid outages or power quality issues.\nThrough close collaboration over several years, Eaton and Microsoft have added digital capabilities to the UPS, which allows it to be used as a distributed energy resource (DER) to support grids with high levels of variable renewable energy generation."
  },
  {
    "headline": "Obaseki hails citizens’ support for improved security in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…charges elites on selflessness, community devtBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended citizens of the state for their sustained collaboration and support for the state government’s efforts at ensuring improved security.\nObaseki, who noted that his administration has institutionalised intelligence-driven community policing architecture, said the support of residents has contributed to the success recorded in ridding the state of crime and criminals.\nThe foundation was set up by a former Inspector General of Police (IGP), Solomon Arase, who celebrated his 66th birthday.\nCommending the philanthropic gesture of former Inspector General of Police, Arase, the governor said, “We thank you for your support and leadership.\nI am glad you are now in the vanguard of pushing for citizens’ policing in the country,” he added."
  },
  {
    "headline": "Obaseki approves N1.87bn for construction of military operating base in Ehor, extension of Ossiomo Power to more public facilities, others – Nigerian Observer",
    "summarized_story": "Obaseki approves N1.87bn for construction of military operating base in Ehor, extension of Ossiomo Power to more public facilities, othersShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the sum of N1.87bn for the construction of a forward operating base for the Nigerian Army, in Ehor, Uhunmwode Local Government Area and other projects in the state.\nThe Edo State Commissioner for Orientation and Communication, Andrew Emwanta, disclosed this while briefing journalists after the weekly Executive Council (EXCO) meeting chaired by Governor Obaseki, at the Government House, Benin City.\n“The second memo was for the construction of the forward operating base of the Nigerian Army, in Ehor, Uhunmwode local council.\nThis is part of the Edo State Government’s support to the Nigerian Army to stem the problem of insecurity in that axis.\nThe EXCO approved the construction of that forward operating base for N646 million."
  },
  {
    "headline": "Obaseki assures business-friendly reforms, hails SaroAfrica for investment in Edo – Nigerian Observer",
    "summarized_story": "Obaseki further hailed SaroAfrica Group of Companies for the Integrated Agricultural Project, the oil palm initiative and other investments in the state.\nObaseki said, “We must thank the SaroAfrica Group for believing in the Edo State Government and working with us.\n“We have the market and the people producing beverages will like to locate close to the sources of raw materials.\n“It’s important to create the right political and security environment for more investment to come.\nThis is the basis to engage more with the private sector as the government doesn’t have much money to fund all projects."
  },
  {
    "headline": "N40,000 Minimum Wage In Edo: Kudos To Governor Obaseki – Nigerian Observer",
    "summarized_story": "In the same vein, Governor Godwin Obaseki also judiciously approved the harmonisation of Pensioners’ take home, to cushion their pain and lack in the midst of current economic free fall across the country.\nIn other words, Minimum wage, depending on the prevailing inflationary trend, has the potential value to affect productivity, income inequality, economic growth, self-improvement and employee retention.\nIt is therefore imperative to generally appreciate the patience and understanding of labour in this regard, as well as the general cohesive policy of Edo State Government being collectively harnessed for a better and harmonious Edo State Civil Service.\nTo this end therefore, it is important to appreciate, commend and give Governor Godwin Obaseki enormous kudos for his thought-visibility in the increase of the new Minimum Wage in Edo State.\nSpecifically, the basic essence of minimum wage for workers and labour is to be able to provide sufficient food, shelter and other basic necessities for self and family."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Amotekun arrests terrorists who killed 40 worshippers at Owo Catholic Church",
    "summarized_story": "Ondo State commander of Amotekun, a state security outfit, Chief Àdetunji Adeleye, has said the suspected killers of worshippers at St Francis Catholic Church in Owo, Ondo state have been arrested.\nAdeleye disclosed this in Akure the state capital, that the vehicle and of some weapons used by the suspected killers have been recovered by the security outfit.\nAccording to him, “we have arrested a number of those who perpetrated evil at the St Francis Catholic Church in Owo.\n“We have also recovered the vehicle they used last after the deadly operation.\n”We have successfully recovered the vehicle and will soon arrest all the killers.”"
  },
  {
    "headline": "Over 1,000 killed in Afghanistan earthquake, as rescuers battle to reach survivors",
    "summarized_story": "An 5.9 magnitude earthquake that hit predawn Wednesday, has killed not less 1,000 people in Afghanistan, while efforts are being intensified to reach survivors.\nRescue and relief teams are struggling to reach survivors of the deadly event that hit Afghanistan’s remote southeast.\nThe eastern Paktika province, home to some of the country’s most impoverished farmers and cattle herders, was the worst hit, several officials from the Taliban government said.\nThe earthquake was the worst natural disaster to hit the nation since a landslide in 2014 killed 2,000 people in the northeastern Badakhshan province, Bloomberg reported.\nThe Taliban takeover of the government has led to the drying up of international aid that made up more than 40% of Afghanistan’s gross domestic product."
  },
  {
    "headline": "Shell insists its Nigeria asset sale not affected by court judgement",
    "summarized_story": "Bamidele Odugbesan, spokesman for Shell in Nigeria, said the June 16 Supreme Court ruling was in response to an appeal launched by Shell against a contempt ruling linked to the dispute with the Niger Delta community.\n“The Supreme Court ruling on 16 June was with respect to the contempt proceedings and not related to (the) onshore portfolio review,” Odugbesan said.\nShell has invited bids for its onshore assets.\nEighty-eight communities in Rivers state were awarded $1.95 billion compensation for an oil spill they blamed on Shell and which damaged their farms and waterways.\nThe company, the most significant international oil major operating in Nigeria, has faced a string of court cases in the past over oil spills."
  },
  {
    "headline": "Nigerian govt lifts ban on international basketball competitions",
    "summarized_story": "The federal government of Nigeria lifted a ban it slammed on the country’s basketball teams from participating in all international competitions.\nAbubakar said the decision is based on a letter of appeal from the Nigeria Basketball Federation (NBBF), signed by Mr Musa Kida.\nAccording to him, the intervention by concerned stakeholders, former Nigerian international basketball players and well-meaning Nigerians to seek solutions to the issues triggered the decision.\nRecall that President Muhammadu Buhari had in May approved the withdrawal of Nigeria from all international basketball competitions.\nThe decision had led to FIBA suspending Nigeria’s female basketball team, D’Tigress from participating in this year’s female basketball world cup."
  },
  {
    "headline": "Rep reverses self, says INEC didn’t extend deadline for voter registration by 60 days",
    "summarized_story": "Chairperson of the house of representatives committee on electoral matters, Aisha Dukku, has made a U-turn, saying that the Independent National Electoral Commission (INEC) didn’t promise to extend voter registration by 60 days.\nAccording to Dukku, the electoral umpire has several activities on its timetable ahead of the 2023 general election which makes it difficult to extend the deadline by 60 days.\nThe house of representatives had asked INEC to extend the deadline by 60 days, following the June 30 closing date set by the electoral body.\nSpeaking on the floor of the house earlier on Wednesday, Dukku had said INEC agreed to extend the deadline.\n“Part of what INEC told the house through the committee on electoral matters is that they are going to look at our request."
  },
  {
    "headline": "Senatorial Seats: Falana Faults APC For Submitting Lawan, Akpabio’s Names To INEC",
    "summarized_story": "The senate president and Akpabio, a former minister of Niger Delta Affairs, had contested the APC presidential ticket but lost.\nWhile the APC had fixed May 27 for senatorial primaries, the party’s presidential primary held from June 6 to June 8.\nTo that extent, any primary of a political party not monitored by officials of INEC is illegal.\n“Contrary to the view credited to Mr. Haruna, the powers of INEC have gone beyond “merely to monitor” party primaries.\nAdvertisement“This means that section 29(1) thereof has imposed a duty on political parties to ensure that the candidates whose names are submitted to INEC have emerged from valid primaries."
  },
  {
    "headline": "Senatorial Seats: Falana Faults APC For Submitting Lawan, Akpabio’s Names To INEC",
    "summarized_story": "The senate president and Akpabio, a former minister of Niger Delta Affairs, had contested the APC presidential ticket but lost.\nWhile the APC had fixed May 27 for senatorial primaries, the party’s presidential primary held from June 6 to June 8.\nTo that extent, any primary of a political party not monitored by officials of INEC is illegal.\n“Contrary to the view credited to Mr. Haruna, the powers of INEC have gone beyond “merely to monitor” party primaries.\nAdvertisement“This means that section 29(1) thereof has imposed a duty on political parties to ensure that the candidates whose names are submitted to INEC have emerged from valid primaries."
  },
  {
    "headline": "Nigeria’s Ex-Deputy Senate President, Wife To Be Charged For Organ Harvesting In UK",
    "summarized_story": "The immediate-past Deputy Senate President, Senator Ike Ekweremadu, and his wife, Mrs Beatrice Nwanneka Ekweremadu, have been arrested by the Metropolitan Police in UK for alleged conspiring to arrange to bring a child to the UK to harvest organs.\nEkweremadu, 60, and Beatrice, 55, both from Nigeria have been remanded in custody and will appear at Uxbridge Magistrates’ Court later on Thursday.\nThey are both charged with conspiracy to arrange or facilitate travel of another person with a view to exploitation, namely organ harvesting.\nOrgan harvesting involves removing parts of the body, often for commercial gain and against the victim’s will.\nThe Cambridge University-educated lawyer added that the victims have their ‘bodies mutilated’ and are ‘roasted like suya [shish kebabs]’."
  },
  {
    "headline": "Nigeria’s Ex-Deputy Senate President, Wife To Be Charged For Organ Harvesting In UK",
    "summarized_story": "The immediate-past Deputy Senate President, Senator Ike Ekweremadu, and his wife, Mrs Beatrice Nwanneka Ekweremadu, have been arrested by the Metropolitan Police in UK for alleged conspiring to arrange to bring a child to the UK to harvest organs.\nEkweremadu, 60, and Beatrice, 55, both from Nigeria have been remanded in custody and will appear at Uxbridge Magistrates’ Court later on Thursday.\nThey are both charged with conspiracy to arrange or facilitate travel of another person with a view to exploitation, namely organ harvesting.\nOrgan harvesting involves removing parts of the body, often for commercial gain and against the victim’s will.\nThe Cambridge University-educated lawyer added that the victims have their ‘bodies mutilated’ and are ‘roasted like suya [shish kebabs]’."
  },
  {
    "headline": "Dunamis Church Holds Prayers Against Insecurity At Deliverance Crusade",
    "summarized_story": "The call was made by the Senior Pastor of Dunamis International Gospel Centre, Dr. Paul Enenche, at the just-concluded National Healing and Deliverance Crusade, which held in Abuja.\nAccording to the cleric, the crusade was organised to seek God’s intervention for Nigeria, especially as the country prepares for the 2023 general elections.\nThat is the current situation of our nation Nigeria.\nThe letter, which moved many to tears, exposed the horrific and terrible things kidnap victims go through in capacity.\n“In the letter, she revealed horrible things kidnap victims go through on a daily basis."
  },
  {
    "headline": "Ekweremadu, wife arrested in UK over 'plot to harvest child organs'",
    "summarized_story": "Former Senate Deputy President Dr. Ike Ekweremadu and his wife, Beatrice, have been arrested and detained by police in the United Kingdom.\nThe Nigerian politician and his wife were accused of conspiring to bring a child to the UK in order to harvest organs.\nThe police said an investigation was launched after detectives were alerted to potential offenses under modern slavery legislation in May 2022.\nEkweremadu and his wife will now appear at Uxbridge Magistrates’ Court today.\nAccording to Sky News, the child has now been safeguarded."
  },
  {
    "headline": "Ondo Amotekun arrests suspected masterminds of Owo massacre",
    "summarized_story": "The Ondo State Security Network Agency codenamed “Amotekun Corps” have confirmed the arrest of some suspects in connection with the June 5 massacre at St. Francis Catholic Church, Owo.\nThe state Commander of Amotekun, Adetunji Adeleye confirmed the development on Thursday while parading 71 suspected criminals before newsmen.\nHe said: “We have recovered the last vehicle they used in the operation and we have made some arrests.\nWe have recovered some vital things which we are working on.”However, Adeleye did not give the actual figure of the suspects arrested but assured that all the attackers will be arrested.\nHe said: “We are not stopping until we get to the root of this and I assure you that the perpetrators and their sponsors will be brought to book.’’"
  },
  {
    "headline": "Yoruba actor, Baba Atoli is dead",
    "summarized_story": "Yoruba actor, Olaniyi Raji, also known as Baba Atoli, is dead.\nThe death of the veteran actor was announced by his colleague, Foluke Daramola in a post on Instagram on Thursday.\nDaramola shared the deceased photo with the caption: “Sad we lost Baba Atoli.\nSuch a shame.”Friends and family of Baba Atoli also took to social media to mourn him.\nBefore his death, Baba Atoli begged for financial support following an illness."
  },
  {
    "headline": "BREAKING: UK police charge two Nigerians for alleged organ harvesting plan",
    "summarized_story": "The United Kingdom Metropolitan Police have formally charged two Nigerians with conspiracy to facilitate travel of another person for organ harvesting.\nThe suspects were arrested and charged over their plan to bring a child into the country to allegedly harvest the said child’s organs.\nThe two arrested suspects were identified as Beatrice Nwanneka Ekweremadu, 55, and Ike Ekweremadu, 60, from Nigeria.\nThey are charged with conspiracy to harvest organs, according to The Guardian UK.\nAccording to The Guardian report, the charges involve arranging or facilitating travel of another person with a view to exploitation, namely organ harvesting, the Met said in a statement."
  },
  {
    "headline": "BREAKING: Owo massacre: Amotekun arrests suspects in connection with attack",
    "summarized_story": "The Commander of the Ondo State Security Network, otherwise known as Amotekun, Akogun Adetunji Adeleye, has revealed that some of the suspects involved in the June 5 terror attack at Saint Francis Catholic Church, Owo, have been apprehended.\nThe Amotekun Commander disclosed this while parading 71 suspected criminals at the command’s headquarters on Thursday.\nAdeleye, who did not give the actual figure of the suspects arrested in connection with the attack, assured that all those involved in the attack would be tracked down.\nHe noted that investigation is ongoing and that the perpetrators of the terror attack in Owo will never go unpunished.\n“A number of people have been arrested concerning the Owo issue as well as some equipment."
  },
  {
    "headline": "2023: Why I visited Wike – Peter Obi",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP) has given reason he paid a visit to Governor Nyesom Wike of Rivers State.\nObi visited the former presidential aspirant of the Peoples Democratic Party (PDP) at his private residence in Port Harcourt on Wednesday.\nWhile details of the meeting remains sketchy, the former Anambra State Governor, hours later, took to his official Twitter handle to give a hint on why he met Wike.\nHe disclosed that he met with Wike to discuss vital national issues.\nHis tweet read: “Earlier, I visited Port Harcourt, to confer with H.E."
  },
  {
    "headline": "Breaking: UK police arrest Ekweremadu, wife",
    "summarized_story": "The Specialist Crime Team of the Metropolitan Police in London has detained a former Senate Deputy President Dr. Ike Ekweremadu and his wife, Beatrice.\nAccording to Sky News, the two suspects were arrested for alleged conspiracy to harvest the organs of a child.\nThe media organisation reported: “Two people have been charged with conspiring to bring a child to the UK in order to harvest organs, the Metropolitan Police said.\n“Beatrice Nwanneka Ekweremadu, 55, and Ike Ekweremadu, 60, have been remanded in custody and will appear at Uxbridge Magistrates’ Court today.\n“Charges were brought against the pair, who are from Nigeria, following an investigation by the Metropolitan Police’s Specialist Crime team."
  },
  {
    "headline": "Breaking: Suspected killers of Owo Catholic church worshippers arrested",
    "summarized_story": "The Ondo State Security Network Agency has revealed that some persons involved in the attack of St Francis Catholic Church, Owo, in Owo local government area have been arrested.\nCommander of the agency codenamed Amotekun Corps Chief Adetunji Adeleye who disclosed this in Akure on Thursday said, “We have arrested a number of those who perpetrated evil at the St Francis Catholic Church in Owo.“We have also recovered the vehicle they used last after the deadly operation.\nWe have also recovered some of their weapons.\n”They came on motorcycles and hijacked a Golf vehicle.\nWe have successfully recovered the vehicle and will soon arrest all the killers.”Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Human rights lawyer storms Supreme Court, stirs drama over hijab",
    "summarized_story": "A Human rights lawyer and activist, Chief Malcolm Omirhobo, Thursday, caused a mild drama at the Supreme Court during a proceeding.\nThe Delta State-born human rights advocate appeared in an unusual atire when he matched his lawyer robe with other traditional apparels.\nThough peaceful in his protest all through the sitting, the activist temporarily disrupted the proceedings as all eyes were on him.\nThe lawyer told Blueprint during an interview that his dressing was against the backdrop of the recent verdict of the Supreme Court which legalised the wearing of hijab to schools and public places in Nigeria.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Access Bank to reward customers in South-South, South-East",
    "summarized_story": "Kehinde Ibrahim, LagosACCESS Bank Plc has said it would be rewarding its customers in the South-South and South-East regions with millions of naira and other attractive consolation prizes in its DiamondXtra regional draw.\nSpeaking to newsmen at the bank’s head office in Lagos recently, Group Head, Consumer Banking, Access Bank Plc, Adaeze Ume, explained that the motivation behind the regional draws in the new season of the reward scheme is the need to transform the lives of more Nigerians across the country.\nIn her words, “To deliver on our promise to continually reward our customers for their loyalty and continued savings with our bank, we have decided to take the DiamondXtra reward scheme draws even closer to them.\nWe intend to reward 38 lucky customers in the South-South, South- East region with juicy cash and consolation prizes in the LIVE draw taking place on the 29th of June 2022 in Owerri, Imo State.\n“We continue to evolve and reflect on the various offers within the DiamondXtra reward programme, and engage our customers on what they would prefer to have as a reward."
  },
  {
    "headline": "CFI, others win prizes at NCRIB maiden tennis competition",
    "summarized_story": "Kehinde Ibrahim, LagosTHE Commissioner for Insurance and Chief Executive Officer of the National Insurance Commission (NAICOM) Mr. Olorundare Sunday Thomas has been declared overall winner of the Nigerian Council of Registered Insurance Brokers (NCRIB) maiden tennis competition in Veteran categoryThe Competition held at the weekend at Lagos Lawn Tennis Club, Lagos.\nThe two days competition which was well attended by members of the Lagos Lawn Tennis Club, students of both Secondary and tertiary institutions and insurance industry became a platform for stakeholders to drum the beats of insurance importance to sport lovers.\nOur intention is to indirectly enforce, not only the government’s highlighted insurance policies, but all insurance products without compulsion.\nYou will recall that few days ago, we embarked on Insurance Awareness Walk from Moleye to Adekunle end of Lagos Third Mainland Bridge, where we shared flyers that narrate what insurance stands for.\nBefore the end of the year, we have plan to take the awareness walk campaign to market places, government circles."
  },
  {
    "headline": "PenCom kicks off online verification for MDAs’ retirees",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Pension Commission (PenCom) has started its online verification and enrolment for prospective retirees and retirees of Federal Government Treasury Funded Ministries, Departments and Agencies (MDAs), the Director-General, Mrs. Aisha Dahir-Umar has said.\nAnnouncing this, Mrs. Dahir-Umar, called on prospective retirees to ensure that they undergo the compulsory Data Recapture Exercise (DRE).\nShe stated that the exercise was aimed at validating the accrued pension liabilities of government for the retirees.\nShe said: “The accrued right is a component of the Retirement Savings Account (RSA) of the employee to be accessed upon retirement.\nHowever, following the experience of the COVID-19 pandemic in 2020, which restricted the movement of persons, PenCom designed and developed an online Enrolment Application with the capabilities to register, verify and enrol the prospective retirees."
  },
  {
    "headline": "NCDMB to set minimum benchmark for women in oil, gas sector",
    "summarized_story": "…to begin disbursement of $40m Women FundPalma IleyeNigerian Content Development and Monitoring Board, NCDMB, has announced plans to set a minimum percentage of females that must be included in any Human Capacity Development, HCD, programme or initiative that it will approve for the Nigerian Oil and Gas Industry.\nSimbi Kesiye Wabote, stated this at the 2nd Nigerian Women in Oil and Gas Conference.\nHe noted that women make up 48 percent of the global labour force, but they only account for 22 percent of the labour force in the oil and gas sector.\nThe Minister harped on the need to be deliberate in getting more girls into Science Technology Engineering and Mathematics, STEM, which was a pathway to careers in the oil and gas industry.\nHe also advised women in the Nigerian Oil and Gas industry to work together towards increasing participation of fellow women in the industry by engendering growth, building capacities and capabilities, identifying opportunities, mentoring and coaching."
  },
  {
    "headline": "Buhari: directed action to bring back kidnapped railway passengers home alive",
    "summarized_story": "Naomi DouglasPresident Muhammadu Buhari has directed increased efforts through kinetic and non-kinetic means to bring the case of the kidnapped railway passengers in Kaduna State to a closure.\nThe Senior Special Assistant to the President on Media and Publicity, Malam Garba Shehu, announced the president’s directive yesterday in a statement titled “President Buhari Directs Urgency in Dealing with Kidnapped Railway Passengers’ Case”.\nPassengers were abducted when bandits attacked a train plying Abuja-Kaduna route on March 28, 2022.\nShehu said upon the President’s approval, the government had continued on the two-lane approach, kinetic and non-kinetic, to secure the passengers’ safe release.\n“The setback notwithstanding, the Government is not leaving any stone unturned in the efforts to bring all of the hostages back."
  },
  {
    "headline": "FG Reverses Ban On International Basketball",
    "summarized_story": "The Federal Government has rescinded its decision to suspend Nigeria’s basketball teams from all international competitions.\nThe Permanent Secretary Ministry of Youth and Sports Development Ismaila Abubakar disclosed this at a news conference in Abuja on Thursday.\nHe said the latest decision is based on a letter of appeal from the Nigeria Basketball Federation (NBBF), signed by Mister Musa Kida.\n“In securing this approval, of note is the caution that the laws of Nigeria cannot be subjugated to any other law, and every Nigerian entity must respect Nigerian laws and authority governing various sectors.\nBefore the reversal of the ban, FIBA had replaced the D’Tigress with Mali ahead of the FIBA Women’s World Cup to be held later in the year."
  },
  {
    "headline": "Amotekun Corps Arrest Persons In Connection With Owo Church Attack",
    "summarized_story": "The Amotekun Corps in Ondo State have arrested a number of persons in connection with the massacre of worshippers at St. Francis Catholic Church, Owo, Ondo State.\nAdeleye, however, did not give the actual figure of the suspects arrested, but the corps leader was optimistic that everyone who was involved in the Owo Attack would be brought to book.\nWhen contacted for confirmations, the Ondo State Police Command through its spokesperson, SP Funmilayo Odunlami, said the force is not aware of such and arrest.\nNevertheless, it is expected that the Amotekun Corps would hand the suspects over to the police for further investigations and onward prosecution.\nLet us show them that Nigerians will continue to cherish what we share while respecting each other’s differences."
  },
  {
    "headline": "Why I Visited Governor Wike – Peter Obi",
    "summarized_story": "The presidential candidate of the Labour Party (LP) Peter Obi says his visit to Governor Nyesom Wike of Rivers State was for the duo to discuss vital national issues.\nObi visited the former presidential aspirant of the Peoples Democratic Party (PDP) at his private residence in Port Harcourt on Wednesday.\nWhile details of the meeting were sketchy, the former Anambra State Governor, hours later, took to his official Twitter handle to give a hint on why he visited Wike.\n“Earlier today, I visited Port Harcourt, to confer with H.E.\n-PO pic.twitter.com/aWM8QzntL6 — Peter Obi (@PeterObi) June 22, 2022Obi was not the only person who visited Wike on that day."
  },
  {
    "headline": "APC Nat’l Chairman Worried By Defection Of Party’s Federal Lawmakers",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC) Abdullahi Adamu has expressed concern over the wave of defections of federal lawmakers in the party to opposition parties.\nHe said this on Wednesday after a closed-door meeting with party members at the National Assembly.\nSenator Adamu admitted that while the party is worried about the gale of defections, nothing can be done about it.\nAdamu’s comment came a day after two Senators from the party defected to the Peoples Democratic Party (PDP).\nThe senators are Ahmed Keita representing Katsina north and Senator Francis Alimikhena representing Edo North."
  },
  {
    "headline": "Senate Probes Shell Over Joint Venture Breach, Seeks $200m Refund To FG",
    "summarized_story": "The Senate has constituted an Ad-Hoc Committee to investigate Shell Petroleum Development Company (SPDC) over non-compliance with the Petroleum Act and breach of the Joint Venture Agreement entered into with the Federal Government.\nThe Ad-Hoc committee has been mandated to probe the Oil Mining Lease granted to SPDC between 1959 to 1989, and 1989 to 2019 under the SPDC/NNPC Joint Venture agreement.\nAccordingly, the Upper chamber is demanding a refund of $200 million to the federal government of what was paid by SPDC, including penalties and interests under the said lease agreements.\nThe Upper Chamber agreed on these resolutions on Thursday after it considered a motion sponsored by Senator George Sekibo.\nHe observed that doing so constitutes an illegal extension of the oil mining Lease by 10 years in the first instance, instead of the prescribed term of 20 year and led to the Federal government losing revenue from fees, taxes, rents and royalties."
  },
  {
    "headline": "Benue Youth Alliance urges APC Guber aspirants to resolve differences -",
    "summarized_story": "Benue Youth Alliances have called on all the Gubernatorial aspirants of the All Progressives Congress to resolve their differences and provide a consensus candidate.\nThey made the call after a rally on major roads in the state capital of Benue, Makurdi.\nThis rally is coming up weeks after the State chapter of the All Progressives Congress party produced Reverend father Hyacinth Alia as the winner of the gubernatorial primary re-election.\nMeanwhile, Some gubernatorial aspirants rejects the party’s re-election result, leading to the uncertainty of people understanding the party’s current conclusion.\nThe Benue Youth Alliances led by Owoicho Onyilo calls on the state party to assist gubernatorial candidates settle with one accepted candidate, as the delay may lead to breakouts."
  },
  {
    "headline": "2023: Get PVCs, ensure your votes count, scholars advise Nigerians -",
    "summarized_story": "The Abeokuta branch of the National Association of Seadogs has urged Nigerians to obtain their Permanent Voter Cards and ensure they troop out on election days to vote and monitor the ballots to prevent cultists and political thugs from hijacking ballot boxes from polling units.\nThe Acting President of the branch, Adeyemi Omitogun, gave this advice during the organisation’s Public Lecture on “Gangsterism, Hooliganism & Cultism in Nigeria : Role of the Family,” held at Gbonogun, Abeokuta.\nHe also admonished citizens to bury the idea of “votes don’t count,” which, according to him, will only embolden bad politicians to continue to manipulate electoral process.\nHe listed hooliganism, gangsterism, bad economy and poor parenting as part of reasons why cultism is increasing among youths in the country.\nHe pointed out economic sustainability and family role as major factors that could reduce the ills of cultism and gangsterism in the society, noting that parents are expected to inculcate morals in their children."
  },
  {
    "headline": "Benue Youth call on APC aspirants to agree on Consensus candidate -",
    "summarized_story": "Benue Youth Alliances have called on all the Gubernatorial candidate of the All Progressives Congress to resolve among themselves in providing a consensus candidate.\nThey made the call after a rally on major roads in the state capital of Benue, Makurdi.\nThis rally is coming up weeks after the State chapter of the All Progressives Congress party produced Reverend father Hyacinth Alia as the winner of the gubernatorial primary re-election.\nMeanwhile, Some gubernatorial aspirants rejects the party’s re-election result, leading to the uncertainty of people understanding the party’s current conclusion.\nThe Benue Youth Alliances led by Owoicho Onyilo calls on the state party to assist gubernatorial candidates settle with one accepted candidate, as the delay may lead to breakouts."
  },
  {
    "headline": "INEC says it has not extended ongoing Voter registration Exercise -",
    "summarized_story": "The Independent National Electoral Commission, INEC, says it has not extended the ongoing Continuous Voter Registration exercise.\nThe Commission describes as untrue, reports in a section of the media, claiming it extended the exercise by 60 days.\nINEC National Commissioner in charge of Public Affairs, Festus Okoye, says the Commission is abiding by the order of the court which directed it not to stop the exercise on the 30th of June .\nThe House had in a motion last week, urged INEC to extend the CVR by 60 days.\nBut this announcement by the Election Management body has now put paid to the agitation for the extension of the Continous Voter Registration."
  },
  {
    "headline": "Ike Ekweremadu, Wife Arrested for Bringing Child to UK for Organ Harvesting",
    "summarized_story": "Ike Ekweremadu and his wife, Beatrice, have been arrested and charged for bringing a child to the UK for organ harvesting according to the Guardian UK.\nIt is not certain if those arrested are Nigeria’s former deputy senate president and his wife, but the description given by the UK police fits into their profile.\nThe police added that the investigation was launched after detectives were alerted to potential offences under modern slavery legislation in May 2022.\n“Beatrice Nwanneka Ekweremadu, 55 (10.9.66) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting,” the statement reads.\n“Ike Ekweremadu, 60 (12.05.62) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting."
  },
  {
    "headline": "Germany Triggers Gas Alarm Stage, Accuses Russia of ‘Economic Attack’",
    "summarized_story": "Lower gas flows sparked warnings this week that Germany could fall into recession if Russia supplies halted altogether.\nRussia has denied the gas supply reductions were premeditated, with state supplier Gazprom (GAZP.MM) blaming a delay in return of serviced equipment caused by Western sanctions.\nIn addition, a gas auction model will be launched this summer to encourage industrial gas consumers to save gas.\nThe government activates the second “alarm stage” of a three-stage emergency plan when it sees a high risk of long-term supply shortages.\nRussian gas flows to Europe via Nord Stream 1 and through Ukraine were stable on Thursday, while reverse flows on the Yamal pipeline edged up, operator data showed."
  },
  {
    "headline": "Nigeria: INEC Has Powers to Reject Lawan and Akpabio, Says Falana",
    "summarized_story": "While Akpabio later stepped down, Lawan lost to Senator Bola Tinubu, who won the party’s ticket.\nTo that extent, any primary of a political party not monitored by officials of INEC is illegal.\n“Contrary to the views credited to Mr. Haruna, the powers of INEC have gone beyond ‘merely to monitor’ party primaries.\n“With respect, the statement that INEC does not have power to reject names of persons submitted by political parties that did not emerge from valid primaries is grossly misleading.\nIn fact, the embarrassing statement amounts to abdication of statutory duty under the above quoted provision of the Electoral Act aimed at sanitising the process of nomination of candidates for national elections in Nigeria.”"
  },
  {
    "headline": "Nigeria: 22 More APC Senators Planning to Defect to PDP, Fani-Kayode Warns",
    "summarized_story": "Except there is a quick intervention, 22 All Progressives Congress senators might leave the party soon for the PDP, a chieftain of the APC and former Minister of Aviation, Femi Fani-Kayode, alerted.\nIn a post on his verified Twitter handle, on Wednesday, Fani-Kayode claimed the senators were threatening to defect to the PDP, because they had been denied the tickets to return to the Senate.\nFani-Kayode claimed the Senate President, Ahmad Lawan, and National Secretary of the party, Iyiola Omisore, and himself had started to engaged with some of the senators.\nAduda: PDP May Soon Form Majority in SenateMeanwhile the new Senate Minority Leader, Philip Aduda, boasted that PDP might soon form the majority in the Senate, with the number of senators defecting to his party.\nAduda said, “Make no mistake about it, grassroots politics is different from Internet politics."
  },
  {
    "headline": "APC Chair Adamu Meets Senators, Worried By Gale of Defections",
    "summarized_story": "National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, met with senators elected on the platform of the ruling party behind closed doors, on Wednesday in Abuja.\nSpeaking with journalists after the meeting with the APC caucus in the senate, Adamu said the party was worried by the gale of defections among senators.\nHe however, said it was a usual occurrence in election periods and not peculiar to the ruling party.\nSpeaking after addressing the senators, Adamu said, “The meeting with the senators was most fruitful.\nThe senator said, “The national chairman said the essence of his meeting with us was to find out the reasons APC senators were defecting."
  }
]