[
  {
    "headline": "FG reopens Idiroko, three other land borders",
    "summarized_story": "The Federal Government on Friday approved the reopening of four additional land borders shut in August 2019 as part of efforts to curtail smuggling and boost local production of rice.\nA circular released by the Nigeria Customs Service, signed by Deputy Comptroller-General E. I. Edorhe, on behalf of the Comptroller-General of Customs, Hameed Ali, listed the borders as Idiroko border post in Ogun State, Jibiya border post in Katsina State, Kamba border post in Kebbi State and Ikom border post in Cross River State.\nThe circular titled, ‘Re-opening of four additional Nigerian border posts’ sighted by Saturday PUNCH read, “Sequel to the Presidential directive dated December 16, 2020, granting approval for phased reopening of land borders namely; Mfum, Seme, Illela and Maigatari borders across the country, I am directed to inform you that four additional borders listed below have been approved for re-opening.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "BREAKING: Truck accident traps motorists on Lagos-Ibadan expressway",
    "summarized_story": "A truck accident on the Lagos-Ibadan expressway has barred motorists travelling outward Lagos.\nThe truck fell across the Kara axis of the road, forcing a column of oncoming vehicles to a standstill.\nA frustrated driver who gave his name only as Kingsley said the accident occurred at 11:20pm.\nHe said, “We are trapped and there is no movement as you can see.\nAlso, the accident has worsened vehicular movements on the Berger end of the expressway, including the Oba Ogunji road, Ogba, as of 12:03am."
  },
  {
    "headline": "Dino Melaye’s multi-millionnaira campaign headquarters",
    "summarized_story": "Former lawmaker representing Kabba/Ijumu Federal Constituency in the 2015 senatorial election, Senator Dino Melaye, has erected a state of the art edifice in Kabba, Kogi State which will serve as his campaign headquarters.\nThe building which is located in the highbrow area of Kabba town, is furnished and political activities have since resumed therein.\nThe unveiling of the multi-million edifice was however greeted with mixed reactions.\nWhile some indigenes are happy that Melaye has commenced his electioneering campaign, others questioned the impact he made while he was a senator in the state.\nThough the former lawmaker may have suffered a setback in 2019 as a gubernatorial candidate, he is however determined to have a landslide victory come 2023."
  },
  {
    "headline": "Jonathan pays tribute to Kenya’s ex-president Mwai Kibaki",
    "summarized_story": "Former President Dr Goodluck Ebele Jonathan has commiserated with the Government and people of the Republic of Kenya over the death of former President Mwai Kibaki who died at the age of 90.\nIn a condolence message, Dr Jonathan described the late Kibaki as a distinguished African statesman and leader who was humble and reform-minded.\nKibaki who served as the third President of Kenya was a distinguished African statesman and reform-minded leader who stood out for his humility, low profile and gentlemanly disposition to governance.\n“He was a brilliant technocrat who earned tremendous respect of the Kenyan people because of his track record while serving his country in different capacities as a scholar, parliamentarian, cabinet minister and president.\n“He left a legacy of strong economic growth and impressive infrastructure, especially with his exemplary grassroots development projects.”"
  },
  {
    "headline": "2023: Tambuwal appoints Senator Tunde Ogbeha as Presidential Campaign Chairman",
    "summarized_story": "Frontline presidential aspirant under the People’s Democratic Party, PDP, and presidential hopeful Governor Aminu Tambuwal has appointed Senator Tunde Ogbeha as the Chairman of his Presidential Campaign.\nSenator Ogbeha is expected to deploy his vast experience in administration, public policy and politics to the Campaign and will chair meetings of the Tambuwal Campaign Council.\nSenator Tunde Ogbeha is a retired general from Kogi State Nigeria who was administrator of Akwa Ibom State and then of Bendel State during the military rule of General Ibrahim Babangida.\nAfter the return to democracy in 1999 he was the elected senator representing the Kogi West constituency of Kogi State from May 1999 to May 2007.\nTunde Ogbeha who had earlier served as an Ambassador is an alumnus of the National Institute of Policy and Strategic Studies in Kuru."
  },
  {
    "headline": "Consensus drive failed, we’re not part of any agreement — Tambuwal Campaign Organization",
    "summarized_story": "The Tambuwal Campaign Organization (TCO) has dismissed reports that a Northern consensus candidate has been picked.\nIn a statement signed by Nicholas Msheliza, the Director of Organization and Mobilization for TCO, it said the report that Saraki emerged the consensus candidate of the North was incorrect and false.\nBala Muhammad of Bauchi state have emerged as consensus candidates from amongst the four of us announced at a meeting in Minna, Niger state.\nAs a result, therefore, the outcome of the Minna meeting has no consequence or any implication on the aspiration of Gov.\nMembers of the public should be reminded that what was canvassed for was a consensus candidate and not a consensus candidate."
  },
  {
    "headline": "Suspected herdsmen behead Ondo farmer",
    "summarized_story": "Dayo Johnson AkureFear has gripped residents of Ago panu Community in Owo council area of Ondo state, following the gruesome murder and the beheading of a farmer, Unaha Enesi, by suspected herdsmen.\nAn eyewitness account said that a search party was organised by his family members after they waiting for him to return to the house after the days of farming.\n” But, unfortunately, the search party only discovered his lifeless body in a pool of blood with his head cut off.\nSpeaking on the ugly incident, a friend of the deceased, who is also a farmer, Ibrahim Adeiza described him as “a hardworking young man, an easy-going man who never quarrels with anyone.\nHis gruesome murder, according to Adeiza has raised serious fear among the people living in the community."
  },
  {
    "headline": "BREAKING: Fresh bomb explosion rocks Jalingo",
    "summarized_story": "Suspected Improvised Explosive Ordinance Devices (IEODs) has again exploded on Friday at Nukkai, in Jalingo, the capital of Taraba State.\nThe incident, DAILY POST gathered, occurred at a drinking joint in Nukkai, which is located along Jalingo/Wukari road.\nThe suspect, as gathered by our correspondent, was said to have arrived the venue with a polythene bag which he dropped and took to his heels.\nConfirming the report, the state Police Public Relations Officer (PPRO), Usman Abdullahi, said the explosive was detonated behind the old Catholic church located in Nukkai area of the state.\nThe development came barely three days after bomb blasts rocked Iware community of Ardo-Kola, where scores were killed and several others injured."
  },
  {
    "headline": "War: Russia finally gives reason for invasion of Ukraine",
    "summarized_story": "Russia has for the first time given the reason for invading Ukraine.\nRussia said that the goal of its invasion war with Ukraine is to take “full control” over the southern Region of the country as well as the eastern Donbas region.\nMaj. Gen. Rustam Minnekaev, who’s the acting commander of Russia’s Central Military District, on Friday announced that Russia was fighting to establish a land corridor through Ukrainian territory connecting Russia to Crimea, the peninsula it annexed in 2014.\n“Since the beginning of the second phase of the special operation, which began literally two days ago, one of the tasks of the Russian army is to establish full control over Donbas and southern Ukraine.\nRussia in recent weeks withdrew its forces in northern Ukraine after a failure to take Kyiv."
  },
  {
    "headline": "Proliferation, excesses of vigilante groups could worsen Nigeria’s insecurity – ICG",
    "summarized_story": "The International Crisis Group (ICG) has warned that the proliferation and excesses of vigilante organisations could aggravate Nigeria’s security challenges if unchecked.\nThe global conflict research and prevention organization observes that in recent years, Nigeria has seen a proliferation of vigilante groups fighting crime and protecting the public.\nThe report acknowledged vigilante groups are filling important security gaps, endearing many citizens and state officials to them.\nTo discourage groups and communities from forming more vigilante groups, Crisis Group urged the Nigerian government to quickly rebuild confidence among the populace.\nCrisis Group called on the federal and state governments to jointly develop a framework of regulations for better supervision of existing vigilante groups."
  },
  {
    "headline": "ipNX visits NCC, commends Commission for efficient regulatory services",
    "summarized_story": "Key members of the top echelon of the Management of ipNX, a licensee of the Nigerian Communications Commission (NCC), were at the Commission yesterday for a courtesy visit.\nAror also informed the management of NCC about some of its Corporate Social Responsibility (CSR) programmes.\nThe NCC Executive Commissioner also said the courageous deregulation and liberalisation of the telecom sector by the Federal Government in the year 2000 was a masterstroke.\n“So we are delighted about your interest in expanding broadband infrastructure”, Adewolu said to underscore the importance and contribution of broadband infrastructure to human survival at the peak of the COVID-19 pandemic.\nAror, was accompanied on the visit to the Commission by the Group Executive Director, Commercials, ipNX, Bimpe Olaleye; Divisional CEO, ipNX Infrastructure Division, Uche Nnakenyi; and Tunde Olorunyomi, Financial Controller, ipNX."
  },
  {
    "headline": "NURTW appoints Lagos caretaker committee after MC Oluomo’s removal",
    "summarized_story": "The National Union of Road Transport Workers (NURTW) has appointed a Caretaker Committee for the Lagos State chapter.\nBaruwa said the nine-man committee will oversee and coordinate operations of the union across the state.\nThe NURTW removed Musiliu Akinsanya popularly known as MC Oluomo in March.\nThe Lagos government later appointed him as Parks Management Committee Chairman.\nA former Assistant Inspector General of Police, Hakeem Odumosu, named the Liaison Officer between the government and the committee."
  },
  {
    "headline": "Why Osinachi didn’t divorce husband, by brother",
    "summarized_story": "A brother of late gospel singer, Osinachi Nwachukwu, Chiemerie, has said that the late singer refused to divorce her husband, Peter Nwachukwu because her followers might perceive her negatively if she quit the relationship.\nChiemerie accused Nwachukwu of killing the singer slowly.\nSpeaking with newsmen, Chiemerie said: “I knew Osinachi very well.\n“She was just hiding all these things so people will not talk about her and say she is divorced.\nThe gospel singer gave up the ghost on April 8."
  },
  {
    "headline": "How prices of food increased in March",
    "summarized_story": "The National Bureau of Statistics (NBS) has explained how the prices of food items rose in March 2022.\nIt noted on month-on-month basis, this increased by 1.69 percent from N497.54 in February 2022.\nThe document said the average price of Bread Sliced 500g increased on year-on-year basis by 34.98 percent from N331.76 in March 2021 to N447.80 in March 2022.\nNBS noted that *On month-on-month basis, the average price of this item increased by 2.23 percent in March 2022.\n“On month-on-month basis, it increased from N393.08 in February 2022 to N409.96 in March 2022 indicating 4.29 percent growth."
  },
  {
    "headline": "Resign if you are a man, Wike dares Umahi",
    "summarized_story": "Rivers Governor Nyesom Wike has attacked his Ebonyi counterpart, Dave Umahi again for defecting to the All Progressives Congress (APC).\nWike advised the Peoples Democratic Party (PDP) to scrutinise its aspirants for 2023 election to avert the mistake of handing its tickets to persons who would later join another party.\nWike expressed optimism that a day of reckoning awaited Umahi and those who defected from the PDP to the APC.\nPDP had sleepless night, PDP won election, and you took the mandate of our people and go to another party.\nFormer Gombe Governor Ibrahim Hassan Dankwambo, told the delegates that Wike has the requisite experience to provide good governance."
  },
  {
    "headline": "Only death will stop me from contesting 2023 presidency",
    "summarized_story": "Rivers Governor Nyesom Wike has said only death will stop him from contesting the 2023 presidential election.\nWike said he would not step down for any consensus candidate, saying consensus should be done with equity, fairness and justice.\nIf the consensus they want to do is to gang up against one or two persons, why will I join such consensus?\nI went there to look for delegates and nobody should tell me how to look for delegates.\n“I don’t know while people will be worried that I went to look for delegates without passing through the governor."
  },
  {
    "headline": "UPDATED: I won't declare for 2023 now but...",
    "summarized_story": "Despite months of speculations, former President Goodluck Jonathan on Friday kept his supporters guessing about his next line of action over calls on him to contest the 2023 presidential election.\nHe however said the whole “political process is ongoing”, telling told them to watch out for him.\nI cannot tell you I’m declaring, that the political process is ongoing.\nLeaders of the placard-carrying supporters took turns to persuade the former President to return to office in 2023, promising to see to his victory.\nSome of the placards read: “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; “Goodluck we love you” among many others."
  },
  {
    "headline": "Lagos tanker fire: ‘How we escaped death’",
    "summarized_story": "By Lawrence EnyoghasuAjegunle, a community on the outskirts of Lagos was thrown into mourning in the early hours of yesterday when a tanker carrying 45,000 litres of premium motor spirit (PMS) fell along the Lagos-Abeokuta Expressway.\nIt was gathered that when it fell close to the buffer zone, the content flowed into the drainage towards the boundary of the Lagos and Ogun states.\nLagos State Fire Service handled it from the Lagos end while Ogun State Fire Service did from their own end.\nThe colour of the container shop was red but the heavy smoke coming from the fire turned it into black.\nDifferent and contradictory accounts exist as to the cause of the first and second phases of the fire outbreak."
  },
  {
    "headline": "2023: Give me more time, I’m still consulting, Jonathan begs supporters",
    "summarized_story": "While persuading him to declare for the 2023 presidential poll, the supporters took turns to ask him to return to office in 2023, promising to work for his victory at the polls.\nThey carried placards with various inscriptions like ‘Goodluck Jonathan, you must run;’ ‘We need you to restore Nigeria, among others.\nSo, we will continue to encourage you to get involved in the political process, and as long as many youths get involved in the political process, we will be able to get the government that we want.\nThe political process is ongoing.\nOnly recently, some groups like the Nigerian Young Professionals in Diaspora (NYPD), gave Jonathan one week ultimatum to declare for 2023 Presidential race or risked litigation."
  },
  {
    "headline": "2023: Ohanaeze begins screening of Igbo presidential aspirants next week",
    "summarized_story": "From Magnus Eze and Geoffrey Anyanwu, EnuguAhead of political parties’ primaries for the 2023 general elections, Ohanaeze Ndigbo Worldwide has disclosed that it would next week commence screening for a consensus aspirant to be supported for the Presidency from the South East.\nOgbonnia said Ohanaeze would not allow its sons and daughters take suicidal actions in the primaries of the political parties by fielding several aspirants.\nGiving indications on the plans and efforts of Ohanaeze Ndigbo in actualizing a President of Igbo origin next year, Ogbonnia said: “By next week we will begin to look into the issue of consensus.\nOhanaeze, he said, was waiting for the aspirants to conclude buying forms so that they would be able to know who the actual aspirants are and the political parties they intend to pursue their ambition.\n“It is for this reason that I call on all political parties in the country, to zone the Presidency to the South East,” he counselled."
  },
  {
    "headline": "N100m, N40m for presidential forms: APC, PDP under fire",
    "summarized_story": "The APC has put the cost of its nomination and expression of interest forms for presidential and governorship aspirants at N100million and N50 million respectively.\nThe PDP on the other hand has put a N40 million price tag and N21 million for the presidential and governorship nomination and expression of interest forms respectively.\nThose aspiring for senatorial and federal legislative positions will pay N3.5 million and N2.5 million respectively for the expression of interest and nomination forms.\nNational Publicity Secretary of Afenifere, Jare Ajayi said only dishonest politicians can afford the high cost of nomination and expression of interest forms of both the APC and the PDP.\nAlso speaking, the Southern Kaduna People’s Union (SOKAPU) described the move by the APC and PDP as outrageous and undemocratic."
  },
  {
    "headline": "2023: Bala Mohammed, Saraki emerge PDP Northern consensus candidates",
    "summarized_story": "From John Adams MinnaBauchi State governor, Bala Mohammed and former Senate President, Bukola Saraki have been picked as the northern consensus candidates of the Peoples Democratic Party (PDP).\nThis was the outcome of the meeting of the PDP Northern Elders with former President, General Ibrahim Babangida on Friday in Minna, the state capital.\nThe northern PDP Elders led by Professor Ango Abdullahi were in Minna where they had a closed door meeting with the former General which lasted several hours.\nThe recommendation of the PDP Northern Elders was handed to journalists by Professor Ango Abdullahi at the Uphill Residence of Babangida in Minna.\nThe outcome of that consultation was as follows: seven votes for Aminu Waziri, 10 votes for Bala Mohammed, 10 votes for Bukola Saraki and five votes for Mohammed Hayatu-deen."
  },
  {
    "headline": "Northern PDP Consensus Arrangement Collapses, Tambuwal Pulls out, Set for Primary",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State has pulled out of the drive by the northern Peoples Democratic Party to produce consensus candidate for the 2023 presidential election.\nThis came just as news emerged that former Senate President Bukola Saraki and Bauchi State Governor Bala Mohammed had emerged PDP consensus candidates for the North.\nA statement by the Tambuwal Campaign Organization (TCO) Friday said the team met on Wednesday at Bauchi Governor’s Lodge in Abuja for a review and unanimously agreed that the consensus arrangement was not working.\nThe statement read: The attention of Tambuwal Campaign Organization (TCO) has been drawn to a news item that former Senate President, Bukola Saraki and Gov.\n“Members of the public should be reminded that what was canvassed for was a consensus candidate and not consensus candidates."
  },
  {
    "headline": "Buhari: Military Not Doing Enough to End Insecurity Despite Logistics Provided",
    "summarized_story": "Buhari frowned on the fact that his previous directives to the military to end insecurity in the country had not yielded much results.\nMonguno said there was no way the president would be happy, when people were being killed on a daily basis.\nThe NSA added that the president was of the belief that enough was not being done by the security agencies, despite the logistics being provided.\n“A lot of lives are being lost, the president is not happy about this situation, he’s made it very clear.\nHe condemned the recent spate of attacks on police officers, facilities and other police operational assets across the country."
  },
  {
    "headline": "APC Women Leader: N100m Presidential Form Meant to Shut Out Unserious Aspirants",
    "summarized_story": "Edu said the APC National Working Committee (NWC) had consciously fixed the rate as part of a mechanism to ensure only serious aspirants were on the ballot.\nShe stated, “For all we care, N1.5 million for a House of Assembly nomination form is fair to the general population.\nIn fact, all those buying the N100 million and N50 million nomination forms should be investigated for fraud.”He further stressed, “We, the PDP, are different.\nThe APC had fixed N30 million for the ‘expression of interest form’ and N70 million for the ‘nomination form’, making a total of N100 million.\nThe N100m is also over 100 per cent of the N40 million fixed by the same APC for the 2018, presidential nomination form."
  },
  {
    "headline": "INEC Proposes One Million Staff Deployment for 2023 Elections",
    "summarized_story": "At the same time, the National Security Adviser, Major-General Babagana Munguno, has assured INEC and Nigerians in general of adequate protections during the elections.\n“Let me also reassure those who registered between January and March 2022 as well as those who are doing so until the end of the exercise that their PVCs will be ready for collection long before the 2023 General Election.\nWe want to assure all registered voters that PVCs issued by the Commission remain valid for all elections.\nHis words: “They build on the successes of the preceding plans, especially, in the planning and conduct of the 2019 General Election as well as off-cycle and bye-elections.\nINEC plays a critical role but the Commission alone cannot deliver the elections we all desire."
  },
  {
    "headline": "Aisha Buhari Hosts Presidential Aspirants to Ramadan Iftar Saturday",
    "summarized_story": "This is a standard operational protocol in the Villa when you are having either of the three occupants of the Presidency.\n“Whether the president is having an event or the Vice President is having an event or the First Lady is having an event, because outsiders will come.\nThat’s the security and standard protocol.\n“That does not apply to the Vice President.\nHow can you expect that to apply to the Vice President or even to ministers”, he said."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Ports Authority Managing Director, Koko Bought £1.75Million Mansion In London While ‘Serving As Amaechi’s Bank Account Officer’",
    "summarized_story": "SaharaReporters gathered that the Kebbi state-born banker was the Zenith Bank accounts officer to Rivers state government when Rotimi Amaechi was governor.\n“During his term as governor of Rivers State, Amaechi routinely broke his own procurement laws and awarded contracts involving large sums of money to many questionable causes and invisible services.\nUsing several personal and corporate proxies, hundreds of billions of Rivers State taxpayers' monies were simply siphoned off the state’s coffers by his cronies.\nAs a reward for continued cooperation and connivance for such corrupt deals, Mr. Amaechi recently ensured the promotion of Mr. Bello-Koko to the post of CEO of the NPA.\nThe same individual received N430 million in cash payments from the same bank a few weeks later."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Ports Authority Managing Director, Koko Bought £1.75Million Mansion In London While ‘Serving As Amaechi’s Bank Account Officer’",
    "summarized_story": "SaharaReporters gathered that the Kebbi state-born banker was the Zenith Bank accounts officer to Rivers state government when Rotimi Amaechi was governor.\n“During his term as governor of Rivers State, Amaechi routinely broke his own procurement laws and awarded contracts involving large sums of money to many questionable causes and invisible services.\nUsing several personal and corporate proxies, hundreds of billions of Rivers State taxpayers' monies were simply siphoned off the state’s coffers by his cronies.\nAs a reward for continued cooperation and connivance for such corrupt deals, Mr. Amaechi recently ensured the promotion of Mr. Bello-Koko to the post of CEO of the NPA.\nThe same individual received N430 million in cash payments from the same bank a few weeks later."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Ports Authority Managing Director, Koko Bought £1.75Million Mansion In London While ‘Serving As Amaechi’s Bank Account Officer’",
    "summarized_story": "SaharaReporters gathered that the Kebbi state-born banker was the Zenith Bank accounts officer to Rivers state government when Rotimi Amaechi was governor.\n“During his term as governor of Rivers State, Amaechi routinely broke his own procurement laws and awarded contracts involving large sums of money to many questionable causes and invisible services.\nUsing several personal and corporate proxies, hundreds of billions of Rivers State taxpayers' monies were simply siphoned off the state’s coffers by his cronies.\nAs a reward for continued cooperation and connivance for such corrupt deals, Mr. Amaechi recently ensured the promotion of Mr. Bello-Koko to the post of CEO of the NPA.\nThe same individual received N430 million in cash payments from the same bank a few weeks later."
  },
  {
    "headline": "BREAKING: At Least 9 Injured As Another Explosion Rocks Taraba",
    "summarized_story": "Another deadly explosion has rocked Jalingo, the Taraba State capital in Northeast Nigeria, days after six persons were killed in a similar explosion.\nIt is not known whether there were fatalities, but nine persons were said to have been rushed to a hospital.\nThe Taraba State Police command has confirmed the incident through its spokesperson, DSP Usman Abdullahi.\nHe said, \"Yes, there was an explosion around Nukkai awhile ago.\nI'm on my way to the scene, we learnt about nine people injured in the explosion have been taken to the hospital.\""
  },
  {
    "headline": "BREAKING: At Least 9 Injured As Another Explosion Rocks Taraba",
    "summarized_story": "Another deadly explosion has rocked Jalingo, the Taraba State capital in Northeast Nigeria, days after six persons were killed in a similar explosion.\nIt is not known whether there were fatalities, but nine persons were said to have been rushed to a hospital.\nThe Taraba State Police command has confirmed the incident through its spokesperson, DSP Usman Abdullahi.\nHe said, \"Yes, there was an explosion around Nukkai awhile ago.\nI'm on my way to the scene, we learnt about nine people injured in the explosion have been taken to the hospital.\""
  },
  {
    "headline": "2023: Tambuwal kicks as Saraki, Bala Mohammed emerge as PDP ‘northern consensus candidates’",
    "summarized_story": "Bala Mohammed, governor of Bauchi, and former Senate President Bukola Saraki have reportedly been selected as the “consensus candidates” to represent the northern region in the race for the Peoples Democratic Party (PDP) presidential ticket.\nThe outcome of that consultation was as follows: 7 votes for candidate (A) Aminu Waziri; 10 votes for candidate (B) Bala Muhd; 10 votes for candidate (C) A-B Saraki; 5 votes for candidate (D) M Hayatu-deen,” the report reads.\n“For the purpose of this exercise, it is hereby resolved that Gov Bala Mohammed from the North East and former Senate President Bukola Saraki from the North Central be presented as the northern consensus candidates for the moment.\n“The attention of Tambuwal Campaign Organisation (TCO) has been drawn to a news item that former Senate President, Bukola Saraki and Gov.\n“Members of the public should be reminded that what was canvassed for was a consensus candidate and not consensus candidates."
  },
  {
    "headline": "2023: Tambuwal kicks as Saraki, Bala Mohammed emerge as PDP ‘northern consensus candidates’",
    "summarized_story": "Bala Mohammed, governor of Bauchi, and former Senate President Bukola Saraki have reportedly been selected as the “consensus candidates” to represent the northern region in the race for the Peoples Democratic Party (PDP) presidential ticket.\nThe outcome of that consultation was as follows: 7 votes for candidate (A) Aminu Waziri; 10 votes for candidate (B) Bala Muhd; 10 votes for candidate (C) A-B Saraki; 5 votes for candidate (D) M Hayatu-deen,” the report reads.\n“For the purpose of this exercise, it is hereby resolved that Gov Bala Mohammed from the North East and former Senate President Bukola Saraki from the North Central be presented as the northern consensus candidates for the moment.\n“The attention of Tambuwal Campaign Organisation (TCO) has been drawn to a news item that former Senate President, Bukola Saraki and Gov.\n“Members of the public should be reminded that what was canvassed for was a consensus candidate and not consensus candidates."
  },
  {
    "headline": "Buhari approves reopening of four more land borders",
    "summarized_story": "The Nigeria Customs Service (NCS) says President Muhammadu Buhari has approved the reopening of four more land borders.\nThe borders are Idiroko in Ogun, Jibiya in Katsina, Kamba in Kebbi and Ikom in Cross River.\nIn August 2019, Nigeria closed its land borders over the proliferation of illegal importation of drugs, small arms and agricultural products into Nigeria from neighbouring West African countries.\nIn 2020, the president ordered the reopening of borders in Seme in Lagos, Illela in Sokoto, Maigatari in Jigawa, and Mfum in Cross River.\nEdorhe, deputy comptroller-general of the NCS, the agency said the reopening of the borders followed the earlier directive by President Muhammadu Buhari on December, 16, 2020."
  },
  {
    "headline": "Buhari approves reopening of four more land borders",
    "summarized_story": "The Nigeria Customs Service (NCS) says President Muhammadu Buhari has approved the reopening of four more land borders.\nThe borders are Idiroko in Ogun, Jibiya in Katsina, Kamba in Kebbi and Ikom in Cross River.\nIn August 2019, Nigeria closed its land borders over the proliferation of illegal importation of drugs, small arms and agricultural products into Nigeria from neighbouring West African countries.\nIn 2020, the president ordered the reopening of borders in Seme in Lagos, Illela in Sokoto, Maigatari in Jigawa, and Mfum in Cross River.\nEdorhe, deputy comptroller-general of the NCS, the agency said the reopening of the borders followed the earlier directive by President Muhammadu Buhari on December, 16, 2020."
  },
  {
    "headline": "Express Entry: Applications for permanent residence in Canada to resume in July",
    "summarized_story": "The Canadian government says it will soon resume its Express Entry draws for immigrants.\nThe ‘Express Entry’ programme is a points-based system through which skilled workers in Canada and abroad are invited to apply for permanent residency if they meet certain thresholds in work experience, education and language skills.\nDue to COVID-related restrictions and delays, Canada halted Express Entry draws — the procedure that chooses qualified applications from a pool of interested skilled workers.\nThis will ensure that all permanent residence applications will be finalized before applicants will need to apply to extend their temporary status again.\nTo support family reunification, immediate family members who are outside Canada and who were included in a principal applicant’s permanent residence application will be eligible for their own open work permit."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "What you need to know as Google’s Equiano cable lands In Nigeria",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "Naira gains after Emefiele insists on managed float FX regime",
    "summarized_story": "Nigeria’s currency on Friday gained 0.28 percent against the dollar at the official market, a day after Godwin Emefiele, governor of the Central Bank of Nigeria insisted on a managed float exchange rate regime.\nMost currency dealers who participated in the auction maintained bids between N410.00 (low) and N444.00 (high) per dollar.\nOn the CBN’s website, the exchange rate stood at N416.08/$ as at April 21, 2022, while at the parallel market, naira exchanged with the dollar at N587 on Friday.\nAfrica’ largest economy’s gross official reserves declined by $317m (-0.8%) month/month to $39.5 billion in March 2022.\nForeign exchange reserves have been under pressure following Nigeria’s low crude oil output, which has been exacerbated by oil theft and pipeline vandalisation."
  },
  {
    "headline": "Chinelo, doctor slain in Kaduna train attack, laid to rest",
    "summarized_story": "Twenty-nine-year-old Chinelo Megafu lost her life in the terror attack on a Kaduna-bound train from Abuja on March 28, 2022.\n“Here we gather at this service, conducting her funeral because some bandits decided to attack the train she boarded.\nRead also: Train attack: Victims’ families lament neglect by government“If these were foreign armies ravaging our land, do we really have an army to defend us?” he asked.\nI have also forgiven the country that enabled all these to happen.”“Frankly, the past three weeks have been quite traumatic.\nNow ruminating over some things, I just discovered that Chinelo had a way of becoming first in many areas."
  },
  {
    "headline": "Nigeria to meet daily crude output quota in two weeks – Finance Minister",
    "summarized_story": "Nigeria, Africa’s largest oil producer, is expected to reach its daily crude production quota in about two weeks as authorities reopen wells that had to be closed to keep criminals at bay, Zainab Ahmed, the country’s Finance Minister, has said during an interview with Bloomberg TV.\nAccording to the minister, Africa’s largest oil producer will meet its quota of producing 1.6 million barrels of crude per day (mbpd) in two weeks, despite producing 20 per cent less than capacity for months.\nFurthermore, it recorded a 24000 b/d decrease in oil output to 1.35 million bpd in March, down from 1.38 million bpd the previous month, according to a secondary source.\nOPEC monitors its oil output using secondary sources, but it also publishes a table of figures submitted by its member countries.\nRead also: Nigeria’s external reserves dip in Q1 2022 amidst spike in crude oil prices“Crude oil output increased mainly in Saudi Arabia, Kuwait and the UAE, while production in Libya, Nigeria and Congo declined,” the report noted."
  },
  {
    "headline": "Obaseki, police partner to tackle land grabbing, others in Edo – Nigerian Observer",
    "summarized_story": "Obaseki disclosed this when he received the new Edo Commissioner of Police, Abutu Yaro.\nHe said, “I thank the IGP for deploying two police special squads to Edo State.\nThis squad will deal with community issues and issues of land grabbing.\n“We are dealing with the issue of land grabbing squarely as it is impeding development in Edo State.\nWe must have a peaceful election; both pre and post-electioneering activities must be peaceful in Edo State."
  },
  {
    "headline": "Obaseki identifies tourism sector as critical to nation’s economic diversification – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge when he declared open the Edo State Tourism Key Stakeholders Workshop, at the John Odigie-Oyegun Staff Training Centre, in Benin City.\nWe have had to depend on hydro-carbon assets, oil and gas for the last 40 years to drive our economy.\nAnd one unique asset that we have as a state is tourism.\nEdo is strategically located and traffic must flow through the state and we must utilize it effectively to generate revenue for the state.\nTourism must begin at home; it’s local, and we must have strong tourism that is locally based to attract international tourists into the state."
  },
  {
    "headline": "‘Obaseki, a superlative performer, champion of Edo’s industrial revolution’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestConvener of the pro-development group, Esan Agenda, Mr. Akhere Obozele, has described the Edo State Governor, Mr. Godwin Obaseki as a superlative performer, hailing his strides in infrastructure and industrial revolution in the state.\nThe group noted that despite the paucity of funds facing states, Edo under the leadership of Governor Obaseki has become a huge construction site with several projects to improve the livelihood of Edo people and ensure economic prosperity for the state.\n“Apart from his commitment towards an infrastructural and industrial revolution in Edo State, one other area Governor Obaseki has hugely invested in is agriculture.\nThis has helped address food security as well as created thousands of jobs for citizens,” he noted.\nAkhere said, “Obaseki is a superlative performer with the interest of the majority of Edo people at heart."
  },
  {
    "headline": "Obaseki’s industrial reforms: Duport refinery to boost petrol, kerosene, CNG production in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Managing Director of Duport Midstream Company Limited, Dr. Akintoye Akindele, has said the Duport Energy Park will boost the production of naphtha, diesel, kerosene, CNG, LPG and LNG in the state, in furtherance of the state government’s industrialization drive.\nSimbi Kesiye Wabote, to the energy park complex in Egbokor, in Edo State.\nThe Duport Energy Park is the second refinery project in Edo State after the Edo Modular Refinery in Ologbo, which is a 6600bpd facility established through a joint venture between the Edo Refinery and Petrochemical Limited and AIPCC Energy Limited.\nWabote, on his part, said Duport Energy Park is the first integrated energy park in Nigeria, with a 2,500 barrels refinery, CNG Gas processing plant, 10 megawatts power plant, and a data centre.\nA member of the Board of Directors of the Duport Energy Park, Dr. Olatutu Sholeye, expressed delight at the work done, adding that it had created employment opportunities and built capacities among the teeming youth in the community."
  },
  {
    "headline": "Buhari approves reopening of Idiroko, Ikom, two other land borders",
    "summarized_story": "Muhammadu Buhari, Nigeria’s president, has ordered the immediate reopening of Idiroko border in Ogun State, Ikom border in Cross River, and two additional land borders.\nThe additional border posts reopened are Jibia (Katsina State) and Kamba (Kebbi State).\nPresident Buhari had in December 2020 opened the Seme, Mfun borders in the Southwest, Ilela and Maigatari borders in the Northwest.\nDeputy Comptroller-General of Customs, EI Edorhe, disclosed this in a circular on Friday issued behalf of the Comptroller General of Customs.\n“Consequently, all Customs formations and JBPTy are to take note and ensure that proper manning takes place in compliance with extant operational guidelines.”"
  },
  {
    "headline": "Court sacks ex-Speaker Yakubu Dogara from House of Reps",
    "summarized_story": "A Federal High Court in Abuja has sacked former speaker of the house of representatives, Yakubu Dogara, from the green chamber of the national assembly.\nThe court ordered the lawmaker on Friday, to vacate his seat as a member representing Dass, Tafawa Balewa and Bogoro Federal Constituency of Bauchi State.\nThe News Agency of Nigeria (NAN) reports that the PDP and one of its members in Bauchi State had, in a suit marked: FHC/ABJ/CS/1060/20, sued Dogara, the speaker of the House of Representatives.\nNAN on April 11, reported that the judgments, in the two separate suits filed against Dogara, were stalled due to the FHC’s Easter vacation.\nThe lawmakers comprise two House of Representatives members and 18 state House of Assembly members"
  },
  {
    "headline": "Killings in Anambra: Police declare 12 wanted",
    "summarized_story": "Nigeria’s police force, has declared 12 persons wanted in connection with the killing of mourners attending a burial ceremony at Isu-Aniocha, Awka South of Anambra State.\nThe suspects, according to a statement from the force headquarters, are also wanted in connection with armed robbery and several other criminal activities in the area.\nThe statement said, “The Nigeria Police Force hereby declare wanted the following twelve (12) persons in connection with a case of conspiracy, murder, armed robbery, act of terrorism, kidnapping, cultism and unlawful possession of firearms, house breaking, burglary, malicious damage, and conduct likely to cause breach of public peace in Isu-Aniocha, Awka North LGA of Anambra State, Nigeria;i. Edward Okoye (aka Stone) vii.\nChukwujekwu Okoye“The Police had earlier secured a court order to declare wanted the suspects, all male of Igbo extraction with ages ranging from 25 years to 55 years old, natives of Isu-Aniocha, Awka North LGA of Anambra State with heights between 1.5m to 1.7m.\n“The suspects equally attacked and brutalized some mobile police officers detailed to restore calm to the community."
  },
  {
    "headline": "2023: Sanwo-Olu asks all appointees with political ambition to resign",
    "summarized_story": "Lagos State governor, Babajide Sanwo-Olu, has directed all members of the state executive council and political appointees who are delegates to the state House of Assembly, House of Representatives, Senate, governorship and presidential primaries and those seeking elective offices to resign.\nThe governor gave the directive in a circular by the state Head of Service, Hakeem Muri-Okunola, dated April 14.\n“It includes those who are holdings positions in the party as well as public servants who may wish to engage in partisan political activities or may seek elective offices.\n“Accordingly, all persons seeking elective offices are required to put in their letters of resignation.\n“Further to the above, civil servants are required to comply with standard procedure as provided in the Public Service Rules, (2015).”"
  },
  {
    "headline": "Dangote Refinery Will Be Ready Before End Of PMB’s Tenure – Aliko Dangote – Leadership News",
    "summarized_story": "Chairman of the Dangote Group, Alhaji Aliko Dangote, yesterday assured that the Dangote Refinery would be ready for commissioning before President Muhammadu Buhari leaves office in 2023.\nBuhari also commended the Dangote Group for extending investments to other African countries, while highlighting the vision behind the refinery.\nChairman, I must specially commend you and your board for the development of the Dangote Refinery and Petrochemical Complex.\nAlhaji Dangote said the board looked forward to the return of President Buhari to commission the oil refineries and petrochemicals project which will transform the Nigerian economy.\nThe leader of the Dangote Group said with more investments in agriculture and oil and gas sectors more impact would be made on the economy."
  },
  {
    "headline": "2023: Osinbajo Visits Olubadan, Seeks Blessings On Presidential Ambition",
    "summarized_story": "Vice-President, Yemi Osinbajo on Friday visited Olubadan of Ibadanland, Oba Lekan Balogun, Alli Okunmade II at his Alalere residence to seek the traditional ruler’s blessings to succeed his boss, President Muhammadu Buhari come 2023 when the tenure of current administration expires.\nThe Vice-President had earlier told Kabiyesi and his Council members that he came to pay homage to the Olubadan and sought his blessings on his desire to take over from PMB come 2023 after they might have completed the current tenure.\n“Nigeria needs all who are willing to serve to attain her potential.\nFlanked by his members of Olubadan-in-Council, his Olori, Olufunmilayo and Sen. Kola Balogun, the monarch’s brother, Oba Balogun said “As we watch ourselves, God watches us as well and in most cases, what we think of ourselves are the same with what God thinks of us.\nI don’t want to be tempted to talk politics and I can spend hours praying for you, but just let me hand you over to the almighty Allah to take total control and be with you and your entourage”, Oba Balogun added."
  },
  {
    "headline": "2023: IBB’s PDP Consensus Committee Rules Out North West",
    "summarized_story": "The North West has been ruled out of the forthcoming Peoples Democratic Party (PDP) presidential primary contest by a committee on consensus candidate set up by former military president General Ibrahim Babangida (rtd).\nIt was gathered yesterday from a source close to the former leader in Minna that the committee in its report to IBB limited it to the North Central and North East for a likely new political order that is likely to shape the 2023 general elections.\nIt was learnt that the reason advanced was that for cohesion in the North, it is better any slot at presidential level for the North should be limited to the two zones.\n“They recognised the fact that the incumbent president is from North West and if the North must retain the presidency, it is fair that the North Central or North East should take it,” the source said.\nThe source also hinted that the chairman of the Nigerian Governors Forum (NGF) Dr Kayode Fayemi and Niger State Governor Alhaji Abubakar Sani Bello also held a meeting with IBB shortly before the PDP aspirants and Ango Abdullahi came in."
  },
  {
    "headline": "Federal Govt Re-opens Idiroko, Jibiya, Other Major Land Borders, After 2 Years",
    "summarized_story": "BY YUSUF BABALOLA, LagosAfter over two years of shutting the land borders due to influx of smuggling of foreign parboiled rice, frozen poultry and imported used cars, also known as Tokunbo, the federal government approved the re-opening of Idiroko, Jibiya, Kamba and Ikom borders.\nIn December 2020, the Federal Executive Council (FEC) announced the immediate re-opening of the country’s four major land borders; Seme, Illela, Maigatari and Mfun.\nThe circular said; “Sequel to the presidential directive dated 16th December, 2020 granting approval for phased reopening of land borders namely, Mfum, Seme, Illela and Maigatari borders across the country, I am directed to inform you that four additional borders stated below have been approved for re-opening.\nADVERTISEMENT“The borders are, Idiroko border post, Ogun State (South-West Zone); Jibiya border post, Katsina State (North-West Zone; Kamba border post, Kebbi State (North-West Zone) and ikom border post, Cross River State (South-South Zone).\n“Consequently, all customs formations and JBPTs are to take note and ensure that proper manning takes place in compliance with extant operational guidelines."
  },
  {
    "headline": "2023: Who Emerges Lagos PDP Governorship Flagbearer?",
    "summarized_story": "This has created disillusion among party members and as such they don’t have confidence in such candidates and they are not prepared to go out and campaign for such candidates.\nHis interest to govern Lagos State has been constant and his desire to run has never waned.\nOut of his commitment to the growth of the party, he was elected the Lagos State chairman of the party, but he did not enjoy his tenure as his administration was subjected to litigation .\nHis tenure was truncated by a court ruling that recognised Adegbola Dominic as the party chairman.\nAdediran (Jandor)He is a journalist by training, he worked with Lagos State Television LTV 8 before he set up his own television station Core media."
  },
  {
    "headline": "Dangote: My Lagos refinery will be ready before Buhari leaves office",
    "summarized_story": "Africa’s richest man Aliko Dangote said on Friday his 650,000 barrel per day oil refinery is expected to be commissioned before the close of President Muhammadu Buhari’s presidential term, which ends May next year.\nThe refinery is being built at a cost of $19 billion in Lagos and has been delayed by several years, increasing the cost from Dangote’s earlier estimates of $12-$14 billion.\n“By the grace of God, Mr President will come and commission (refinery) before the end of his term,” Dangote said in response to a question after a meeting with Buhari at the presidential villa in Abuja.\nA Dangote executive said this month the refinery would start production by the fourth quarter of 2022.\nThe government sees the refinery as a solution to ending Nigeria’s reliance on imports for most refined petroleum products even though Nigeria is Africa’s biggest oil producer and exporter."
  },
  {
    "headline": "Seyi Shay and partner welcome first child",
    "summarized_story": "Nigerian singer, Deborah Oluwaseyi Joshua, professionally known as Seyi Shay, has announced the birth of her first child.\nShe announced the arrival of the baby on Friday with a picture of herself heavily pregnant with the caption; “The Eagle has landed”.\nShay had earlier revealed the gender of her newborn, a girl.\nIn a recent interview with Blanck magazine, Shay said “I’m grateful for how far I’ve come, and I know I’m still on a journey.\n“So, if this is just the middle, I’m grateful for the journey and looking forward to the future."
  },
  {
    "headline": "BREAKING: : Goodluck Jonathan Finally Speaks",
    "summarized_story": "After chanting and screening his name for minutes, Ex-President Goodluck Jonathan, Friday came out to receive protesters who stormed his Abuja office.\nRecall that some pro-Jonathan protesters stormed his office, demanding he contest in the forthcoming presidential election.\nWe are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.\nResponding to them, Jonathan asked Nigerian youths to show greater interest in the nation’s political process.\nThe political process is ongoing just watch out."
  },
  {
    "headline": "How Five Students Organised Sexual Game During Dubai Trip – Chrisland Narrates",
    "summarized_story": "While the Lagos State Government and the state Police Command continue to investigate sexual actions involving five Chrisland school pupils in Dubai, United Arab Emirate (UAE), the school’s management has revealed that the act occurred during their last trip to the Arab country.\nThe pupils committed the actions in a room on the 11th floor after their lecturers ordered them to sleep early so they wouldn’t miss their early morning flight back to Nigeria, according to the management.\nAfter ensuring that all pupils were in their assigned rooms, the teachers proceeded to their rooms to sleep for a bit before continuing their all-night surveillance to guarantee that there were no gaps throughout their week-long stay in Dubai, according to the report.\nAccording to the management, the students left their rooms and gathered at the spot for the sexual game during the time when the teachers went into their rooms and returned to their nighttime routine.\nAs previously stated, the school assigned three children to a room in the hotel during the trip, with female students being assigned to the fourth level and male students being sent to the eleventh floor."
  },
  {
    "headline": "BREAKING: Women, Youths March For Jonathan’s Return In 2023",
    "summarized_story": "On Friday morning, a group of women and youths marched to demand the return of former President Goodluck Jonathan in 2023.\nThey arrived in four buses and invaded Jonathan’s Taraba Close, Maitama office to make their case.\nThey carried placards with various inscriptions pleading with the former President to resign.\nSome of the placards read: “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; “Goodluck we love you” among many others."
  },
  {
    "headline": "Ogoni Cleanup May Not Be Completed Under Buhari – FG",
    "summarized_story": "The Federal Government announced in Abuja on Wednesday that the Ogoni Cleanup Project would not be finished in the time remaining under the current administration.\nAfter a meeting with the President, Major General Muhammadu Buhari (retd.)\n“They are phased projects; we do not envisage that we can finish the entire project within the lifetime of this government.\n“There is nothing miraculous about our approach to the cleanup operations; it is going to be a very pragmatic, practicable and quick-win solution.\n“However, they are phased projects, we do not envisage that we can finish the entire project within the lifetime of this government."
  },
  {
    "headline": "Fashola Inaúgurates FMBN Board, Executive Management Team",
    "summarized_story": "By Mathew Dadiya, AbujaThe Minister of Works and Housing, Babatunde Raji Fashola has officially inaugurated the newly appointed members of the Federal Mortgage Bank of Nigeria (FMBN) Board and Executive Management Team.\nFashola urged the new oard and executive management team to work within the conceptual framework of FMBN as a specialized banking institution that was established to deliver on a specialized job of driving affordable housing for Nigerians nationwide; Group Head, Corporate Communications ofFMBN, Lawal Isa K/Sauri stated.\nHe also advised the Board and Management to promptly engage with the Central Bank of Nigeria (CBN) and ensure FMBN’s compliance with regulatory stipulations for operating as a Bank.\nFurthermore, the minister expressed appreciation to the immediate past Board and Executive Management Team for their service saying their efforts cannot be forgotten.\nIn his response, the new FMBN Managing Director/Chief Executive, Madu Hamman on behalf of the Board members and Executive Management Team, thanked President Muhammadu Buhari for the privilege and opportunity to serve the nation."
  },
  {
    "headline": "World Bank tells Nigeria to drop fuel subsidy",
    "summarized_story": "By Emmanuel ObisuePresident of the World Bank Group, David Malpass has asked the Federal Government to have a rethink on its policy on fuel subsidy, stating that the huge amount being expended on the policy could be channeled into other critical sectors.\nMalpass noted this on Wednesday at a media briefing at the ongoing World Bank/International Monetary Fund Spring Meetings in Washington DC, United States.\nIt would be recalled that the Nigerian Senate last week approved N4 trillion for petrol subsidy in 2022.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nThe World Bank had in November 2021 warned Nigeria not to delay any further in removing the fuel subsidy which had been described as a major drain and waste on the economy."
  },
  {
    "headline": "Naira depreciates, sells at N419.50 to dollar",
    "summarized_story": "Agency reportThe Naira exchanged at N419.50 to the dollar at the Investors and Exporters window on Thursday.\nThis represents 0.28 per cent depreciation, compared to N418.33 to the dollar recorded on Wednesday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.50.\nThe Naira sold for as low as N410 to the dollar within the day’s trading.\nA total of $124.85 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "ONU inducted into ASURI hall of fame",
    "summarized_story": "By Eunice OrikeThe Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, has made history as he became the first inductee into the hall of fame of the Academic Staff Union of Research Institutes ASURI.\nThis historical event took place at the sensitisation workshop of the staff of FMSTI on the full implementation of the Presidential Executive Order 05 yesterday in Abuja.\nThe Minister enunciated that the essence of the Executive Order 5, is to ensure that Nigeria acquires technologies that will help in positioning the nation towards self-sufficiency.\nHe said, “The Executive Order is revolutionary as it is a contribution of the Ministry towards transforming the nation to the level of greatness ordained by God”.\nThe National Coordinator of the Strategy implementation task office of the Presidential Executive Order No."
  },
  {
    "headline": "Okowa says Delta Agro-Industrial Park to be ready Nov 2022",
    "summarized_story": "By Anastacia Eluwa, AsabaGovernor Ifeanyi Okowa of Delta State on Thursday, said the Agro-Industrial Park being executed by his administration at Aboh-Ogwashi, Aniocha South Local Government Area, would be ready for inauguration in November, 2022.\n“Let me appreciate the level of cooperation we have had with the Ogwashi-Uku community because they gave us over 180 hectares of land for the Agro-Industrial Park.\n“The contractor has promised to deliver the project towards the end of November which means if they start the road project now, they will still have time during the break in August and in the later part of October to finish with the road project,” Okowa said.\n“The park is a community of its own where you have various agro-processing industries co-sharing common facilities for agro-indstrialisation in the state,” he stated.\nHe said that the state government was working with the Federal Ministry of Trade and Investment to designate the park as an Export Processing Zone."
  },
  {
    "headline": "At Least Five Injured As Explosion Rocks Taraba Again",
    "summarized_story": "An explosion has occurred in Jalingo the Taraba State capital, leaving at least five persons injured.\nAlthough no life was lost in the explosion, some of the victims are reported to have lost consciousness.\nHe added that some of the children around who saw the suspected suicide bomber could not speak, until after the explosion.\nHowever, intelligence reports revealed earlier that suspected suicide bombers will attack any of the drinking joints in Kasuwan Bera, Nukkai, Mayo Dasa or mile six market.\nWhile six persons were confirmed dead, at least 19 others were said to have been injured."
  },
  {
    "headline": "2023 Presidency: Osinbajo Visits Olubadan, Receives Royal Blessings",
    "summarized_story": "Vice President, Professor Yemi Osinbajo on Friday, visited the Olubadan of Ibadan, Senator Lekan Balogun to officially inform him of his presidential ambition.\nThe monarch, in turn, offered his blessings to the Vice President saying: “I conclude my contribution to you by handing you over to Allah, let him protect you”.\nDuring the meeting, he said he was confident that the past seven years as VP have prepared him for a higher purpose.\nOsinbajo formally declared his intention to run for President in 2023 on April 11.\nHis declaration brought an end to months of speculation over his interest in the 2023 presidential race and widens the pool of candidates for the position."
  },
  {
    "headline": "Price Of Cooking Gas Soars By 83.62% In One Year – NBS",
    "summarized_story": "The National Bureau of Statistics (NBS) on Friday disclosed in its report that the average retail price of cooking gas increased by 83.62 per cent from N2057.71 in March 2021.\nThe March 2022 report also revealed the average price for refilling a 5kg Cylinder of Liquefied Petroleum Gas (Cooking Gas) stood at N3778.30 in March 2022 from N3708.58 recorded in February 2022 showing an increase of 1.88 per cent month-on-month.\nAccording to state profile analysis, the highest average price for refilling a 5kg Cylinder of Liquefied Petroleum Gas (Cooking Gas) was recorded in Ekiti with N4200.00, followed by Niger with N4163.33 and Imo with N4150.00.\nMeanwhile, Adamawa recorded the lowest average price with N2604.01 followed by Yobe and Kano recording N2740.00 and N300.00 respectively.\nSimilarly, the average retail price of a 12.5kg Cylinder of Liquefied Petroleum Gas (Cooking Gas) by zones showed that the average retail price was highest in the South-West with N7892.40 followed by the North-Central and North-Westwith N7657.22 and N7533.91 respectively."
  },
  {
    "headline": "Teenager Killed, Shops Razed As Petrol Tanker Explodes In Lagos",
    "summarized_story": "A teenager has been killed after a tanker ladened with Premium Motor Spirit (PMS), also known as petrol exploded along the Lagos – Abeokuta Expressway.\nThe National Emergency Management Agency (NEMA) confirmed the incident on Friday, saying it occurred at about 2:06am.\nIt explained that the tanker was conveying 45,000 litres of petrol before it crashed and spilled its content on the road.\nThe incident occurred at the Ajegunle Bus-Stop of Alagbado (a border community) axis of the highway, causing gridlock as residents ran for safety.\nThe agency, however, regretted that a 15-year-old boy identified as Oluwatobi Lawal, died in the incident while the inferno consumed 42 makeshift shops."
  },
  {
    "headline": "2023 Presidency: PDP Northern Elders Endorse Saraki, Bala Mohammed",
    "summarized_story": "﻿Northern elders of the Peoples Democratic Party (PDP) have endorsed Bauchi State Governor, Bala Mohammed and Former Senate President, Bukola Saraki as the consensus candidates of the party.\nGiving the recommendation of the Northern Elders to Journalists at the Uphill Residence of Babangida, Chairman of the Northern Elders Forum (NEF), Professor Ango Abdullahi, said that the two aspirants have been urged to work together to make allowance for further consultations to come up with one consensus candidate.\nThe outcome of that consultation was as follows: Seven votes for Aminu Waziri, 10 votes for Bala Mohammed, 10 votes for Bukola Saraki and five votes for Mohammed Hayatu-deen.\n“One of the elders deferred his votes on grounds of continuing consultations with traditional rulers and other major stakeholders.\nWe are happy that after due process and due consultation, involving the PDP Northern Elders Forum, I and Saraki have been chosen as Northern consensus candidates."
  },
  {
    "headline": "INEC suspends CVR in parts of Imo, Anambra, Kaduna States",
    "summarized_story": "The Independent National Electoral Commission has suspended the continuous voters registration exercise in parts of Imo, Anambra, and Kaduna States due to the spate of insecurity and attacks on its field officers.\nChairman of INEC, Mahood Yakubu also disclosed that security agencies have enough time to address the challenges before the 2023 elections.\nProfessor Yakubu spoke during a meeting with resident electoral commissioners in Abuja, where he disclosed that the voters registration exercise has been suspended in 54 centers in imo, 42 centers in Anambra, as well as the registration centers in jemaa, kaura, and large areas of Birnin Gwari and Giwa local government areas in Kaduna state.\nProfessor Mahmood Yakubu also directed all registered political parties to submit copies of membership register to the commission, in compliance with the new Electoral Act 2022, before their primary elections."
  },
  {
    "headline": "Osinbajo pays courtesy visit to Olubadan, meets Oyo APC stakeholders -",
    "summarized_story": "Vice President, Professor Yemi Osinbajo earlier today paid a courtesy visit to the Olubadan of Ibadan Land.\nHe also engaged with Stakeholders of the Oyo State All Progressives Congress chapter in Ibadan, Oyo State"
  },
  {
    "headline": "2023: Yiaga Africa condemns exorbitant fees for party's nomination Forms",
    "summarized_story": "A civil society organisation (CSO), Yiaga Africa, has expressed concern over the exorbitant cost of nomination forms of political parties for the 2023 general elections.\nAccording to Yiaga Africa, the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections was a huge disservice to teeming women, youth and persons with disabilities (PWDs), who nurse the ambition to run for elective offices in next year’s general elections.\nRead the full statement below:Yiaga Africa notes with utmost concern the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections.\nWe note that this is a huge disservice to teeming women, youth and persons with disabilities (PWDs) who nurse the ambition to run for elective office in next year’s general elections.\nWe welcome the concessions made by some political parties to women, youth and PWDs and call for a further downward review of the cost of nomination forms to allow for an inclusive process without discrimination to any group or demography of the society."
  },
  {
    "headline": "Fmr Slovak PM, Róbert Fico, allies charged with organised crime",
    "summarized_story": "Former three-time Prime Minister Róbert Fico and former Interior Minister Róbert Kaliák, who have dominated Slovakian politics for the past 15 years, were on Wednesday charged with organised crime offenses.\nFico, who is still a member of parliament for the opposition Smer party, cannot be arrested without the legislature’s permission.\nFico was accused of being the leader of a “criminal organization” that includes former police director Tibor Gapár and Slovak oligarch Norbert Bodor, according to the indictment.\nHe stood for president in 2014, while serving his second term as Prime Minister of Slovakia, but was defeated by Kiska by nearly 20 percentage points.\nFico accused Kiska of “making his money from usury on impoverished people,” “misusing his charity for political goals,” and having “close ties to Scientology” during an exceptionally acrimonious campaign."
  },
  {
    "headline": "El-Rufai Should Keep Mum Says Monguno + Aisha Invites Presidential Aspirants- Trending With Ojy Okpe",
    "summarized_story": "Babagana Monguno, reacted to the statement made by Kaduna State Governor Nasir El-Rufai in which he alleged that the camps and phone numbers of bandits are known by the security agencies stating that intelligence operations of security agencies against bandits are not for public consumption.\nIn another development, First Lady Aisha Buhari has come under fire on social media for inviting All Presidential aspirants from various political parties to an Iftar dinner at the State House Conference Centre.\nFinally, in the United States a video showing boxing legend Mike Tyson throwing a flurry of punches at a fellow passenger on a jet blue flight from San Francisco to Florida leaving the man with a bloody forehead has gone viral."
  },
  {
    "headline": "Russian General Says Moscow Aims to Capture Southern Ukraine",
    "summarized_story": "A Russian general declared on Friday that Moscow wants to seize all of southern and eastern Ukraine, far wider war aims than it had acknowledged as it presses on with a new offensive after its campaign to capture the capital Kyiv collapsed last month.\nIn Kharkiv city, Russian shellfire hit the main Barabashovo market.\nIn Geneva, the United Nations human rights office said there was growing evidence of Russian war crimes in Ukraine, including indiscriminate shelling and summary executions, that had caused many civilian casualities.\nHe said Russian speakers there were oppressed, the same justification Moscow has given for its interventions in Ukraine since 2014, which Western countries call a baseless pretext.\nThe United States authorized another $800 million in military aid for Ukraine on Thursday, including heavy artillery and drones."
  },
  {
    "headline": "UN: Russian Actions in Ukraine ‘May Amount to War Crimes’",
    "summarized_story": "The United Nations on Friday accused Russia of taking action in Ukraine “that may amount to war crimes”, including indiscriminate bombing that killed civilians and destroyed schools and hospitals.\n“Russian armed forces have indiscriminately shelled and bombed populated areas, killing civilians and wrecking hospitals, schools and other civilian infrastructure, actions that may amount to war crimes,” said Ravina Shamdasani, spokesperson for the UN’s Office of the High Commissioner for Human Rights.\nDetails later…"
  },
  {
    "headline": "N100m Presidential Form Meant to Shut Out Unserious Aspirants, APC Women Leader Says",
    "summarized_story": "Edu said the APC National Working Committee (NWC) had consciously fixed the rate as part of a mechanism to ensure only serious aspirants were on the ballot.\nShe stated, “For all we care, N1.5 million for a House of Assembly nomination form is fair to the general population.\nIn fact, all those buying the N100 million and N50 million nomination forms should be investigated for fraud.”He further stressed, “We, the PDP, are different.\nThe APC had fixed N30 million for the ‘expression of interest form’ and N70 million for the ‘nomination form’, making a total of N100 million.\nThe N100m is also over 100 per cent of the N40 million fixed by the same APC for the 2018, presidential nomination form."
  },
  {
    "headline": "Nigeria’s Military Not Doing Enough to End Insecurity Despite Logistics Provided, Buhari Says",
    "summarized_story": "In a clear indictment, a disappointed President Muhammadu Buhari, on Thursday, told the security agencies that they were not doing enough to end the security challenges in the country, despite enormous logistics provided by his administration.\nBuhari frowned on the fact that his previous directives to the military to end insecurity in the country had not yielded much results.\nMonguno said there was no way the president would be happy, when people were being killed on a daily basis.\nThe NSA added that the president was of the belief that enough was not being done by the security agencies, despite the logistics being provided.\nHe condemned the recent spate of attacks on police officers, facilities and other police operational assets across the country."
  }
]