[
  {
    "headline": "AMCON reports 1,000 chronic debtors owing N3.96tn to N’Assembly",
    "summarized_story": "The Asset Management Corporation of Nigeria said on Friday that it had submitted a list of its top 1,000 debtors to the National Assembly as part of the strategy to intensify its debt recovery drive.\nA top source told Saturday PUNCH that the 1,000 debtors were responsible for 90 per cent of the total debt of N4.4tn, translating to N3.9tn.\nThe source said, “The 1,000 debtors are those responsible for the big-ticket debts.\nThe President, Major General Muhammadu Buhari (retd), had on Thursday signed into law the Asset Management Corporation of Nigeria (Amendment) Act, amending the AMCON Act No.4, 2010.\nWhile presenting the list, Kuru said, “To enable AMCON to succeed in its national call to duty, AMCON solicits the continued support of this distinguished committee."
  },
  {
    "headline": "Kamala Harris becomes first woman to hold presidential powers in US history",
    "summarized_story": "United States Vice President Kamala Harris will become the first woman to hold presidential powers in the history of the country.\nWhite House press secretary Jen Psaki announced on Friday.\nPresident Joe Biden will temporarily transfer powers to his VP to go for a routine colonoscopy at Reed Media Center.\nPresidential power has been transferred to the vice president before during the tenure of President George Bush.\nHowever, this time, presidential power will be transferred to a female vice president."
  },
  {
    "headline": "Buhari to Igbo Leaders: I’ll consider your demand for Nnamdi Kanu’s release, but…",
    "summarized_story": "*Says demand runs contrary to separation of powerBy Johnbosco Agbakwuru, ABUJAPresident Muhammadu Buhari, on Friday, told some Igbo leaders that met him to demand for the unconditional release of the leader of the Indigenous people of Biafra, IPOB, Mazi Nnamdi Kanu, that the demand was heavy for him.\nHowever, the President assured his guests that he will consider their demand.\nThe IPOB leader, Mazi Kanu, is currently standing trial at the Federal High Court, Abuja.\nHe told the 93-year-old statesman and his entourage that the demand they made was an extremely difficult demand on him as leader of the country.\nPresident Buhari, in a statement issued by his Special Adviser on Media and Publicity, Chief Femi Adesina, said though the demand was heavy, he will consider it."
  },
  {
    "headline": "Breaking: Gunmen kidnap ex-Imo deputy governor’s father",
    "summarized_story": "By Chinonso AlozieThe 89-year-old Father of the former Deputy Governor of Imo State, Prince Eze Madumere and Traditional Ruler of Ezi – Mbieri Autonomous Community in Mbaitoli Local government area of Imo State, HRH, Eze Henry Madumere on Friday was kidnapped by unknown gunmen in the state.\nWhen Vanguard contacted the former Deputy governor Eze Madumere he confirmed the incident and said the kidnappers have contacted the family.\nHowever, he did not tell Vanguard the details of the demands of the kidnappers before his father could be released.\nTo this extent, tension has enveloped Imo state following the kidnap of the father of the former deputy governor, the people of Mbaitoli have been in confusion about the whereabouts of the father of the deputy governor just as many have entered into prayer and fasting for the release of the victim.\nWhen Vanguard has called the Imo State Police Public Relations Officer, PPRO, Micheal Abattam, he did not pick his phone."
  },
  {
    "headline": "EFCC confirms return of N19.3bn Kogi salary bailout fund to CBN",
    "summarized_story": "33 billion Kogi state salary bailout funds, recovered by the Commission, to the Central Bank of Nigeria (CBN).\nThe News Agency of Nigeria (NAN) reports that the money was meant for the payment of Kogi state workers, but was allegedly domiciled in an interest-yielding account with Sterling Bank plc.\nNAN also reports that the EFCC has withdrawn its suit seeking the forfeiture of the N20 billion bailout funds granted to the Kogi state government by Sterling Bank.\n“The court directed the unfreezing of the Kogi state salary bail-out account to enable Sterling Bank to remit the balance in the account to the CBN.\n0073572696 domiciled in Sterling Bank, with the name of Kogi State Salary Bailout Account."
  },
  {
    "headline": "NAFDAC evacuates 20 truckloads of N3bn fake drugs; importer on the run",
    "summarized_story": "Prof Mojisola AdeyeyeBy Gabriel Olawale, LAGOSThe National Agency for Food and Drug Administration and Control, NAFDAC, has raided two warehouses in Lagos State, containing over N3 billion worth of fake drugs and unwholesome processed foods.\n“The banned and falsified drugs in the warehouses owned by one Chuka, who is still at large, is estimated to be worth over N3 billion.\n“Over 20 truckloads of the offensive products were evacuated from the two locations.\nInvestigation also revealed that the fake drugs were imported from China.\n“The Agency has also observed that some fake and counterfeit products are brought into the country through a system known as ‘Groupage’."
  },
  {
    "headline": "Unemployment: Cooperative society set to empower 15 million women in poultry farming",
    "summarized_story": "…Flags off women nurturing birds for wealth empowerment programBy Dirisu Yakubu & Fortune Eromosele, ABUJAAs part of its contributions to reducing unemployment among young Nigerians especially women, the National Agricultural Mechanization Cooperative Society, NAMCS, Thursday, said it is ready to empower 15 million women in poultry farming.\nPresident of NAMCS, Dr Aliyu Waziri, made the disclosure to newsmen in Abuja at the inauguration of National Agricultural Mechanization Officers, NAMCS, FCT-chapter.\n“In mechanized farming, we have a target to empower 15 million people in Nigeria in poultry.\n“This program is strategically designed to take advantage of the opportunities that is available in the poultry business value chain, to create job opportunities for our women.\nIt is basically to empower women,” he added."
  },
  {
    "headline": "Lawan advises Nigerian leaders to emulate Goodluck Jonathan",
    "summarized_story": "Senate President, Ahmad Lawan has urged Nigerian leaders to emulate former President Goodluck Jonathan.\nThe Yobe Senator urged politicians to be honest, selfless and continue to work for the unity of the country.\nLawan spoke on Friday at the Goodluck Jonathan Foundation’s policy dialogue themed: “Democracy and unity of state.’’The lawmaker stressed the need for office holders to be open to the people and in their dealings.\n“When political leaders allow for suspicion between and among themselves, those at the grassroots will behave the same way,’’ he said.\nLawan described Jonathan as a leader that believed in the oneness , progress and development of Nigeria and Africa."
  },
  {
    "headline": "Senate transmits electoral bill to executive for assent",
    "summarized_story": "The electoral act amendment bill which was passed into law by both chambers of the National Assembly has been transmitted to the executive for assent.\nThe Senior Special Assistant to the President on National Assembly matters (Senate), Senator Babajide Omoworare, confirmed this in a statement on Friday, which was made available to journalists in Abuja.\nOmorare, citing relevant sections of the 1999 Constitution as amended, said the bill was transmitted on Friday in anticipation that it would be signed by President Muhammadu Buhari.\nA2 LFN 2004, the National Assembly has transmitted the Electoral Bill 2021 to Mr. President today Friday November 19, 2021.”The harmonised version has placed on the Independent National Electoral Commission (INEC) the sole power to determine the mode of transmission of results.\nThe clause in the amended act that empowers INEC to transmit election results electronically was contained in clause 52 (2) of the Electoral Act."
  },
  {
    "headline": "Panic in Imo as gunmen kidnap former Deputy Governor’s father",
    "summarized_story": "HRH, Eze Madumere, the father of former Deputy Governor of Imo State, Prince Eze Madumere, has been kidnapped by unknown gunmen.\nThe monarch was said to have been kidnapped at Iho Community in Ikeduru Local Government Area of the state.\nThis incident was said to have sent panic and fear across the local government and entire state.\nConfirming the incident Prince Eze Madumere, the former Deputy Governor of the state, disclosed that his father’s abductors have contacted the family.\nThe Police Public Relations Officer, (PPRO) Michael Abattam, when contacted also confirmed the incident and stressed that they have put machinery in place so as to arrest the culprits."
  },
  {
    "headline": "Ogun-born lawyer gives Abiodun 7 days to release End SARS panel report",
    "summarized_story": "Ogun-born lawyer, Festus Ogun has asked Governor Dapo Abiodun to release the report of the Judicial (End SARS) Panel of Investigation into Police Brutality and Extrajudicial Killings.\nRelying on the Freedom of Information Act, 2011, the legal practitioner, in a November 18, 2021 letter, gave Abiodun a one-week ultimatum to make the findings and recommendations public.\nOgun recalled that the panel chaired by Justice Solomon Olugbemi submitted its report on July 9, 2021 for the implementation and necessary actions.\nThe TakeItBack Movement Legal Adviser reminded Abiodun that Nigerians are interested in the outcome of proceedings at the panel.\n“We won’t allow the process of getting justice shrouded in secrecy”, Ogun vowed."
  },
  {
    "headline": "Gov. Ugwuanyi lists achievements in business investment, ICT innovation, Start-Ups Eco-system",
    "summarized_story": "Fulfilled by the remarkable feats his administration has recorded in business investment development, ICT innovation and creativity, start-ups, product acceleration and wealth creation for Enugu State youth, among others, Governor Ifeanyi Ugwuanyi, yesterday, said the state government has continued to play its leading role as a business and investment enabler.\nSpeaking during the ground-breaking of the Godfrey Okoye (GO) University-European Business Park, Centre for Practical Skills and Start-Ups, Gov.\nUgwuanyi revealed: “Our administration, mindful of the rapidly changing world order, organized the first-ever Enugu State Investment Summit in 2016 (Oganiru Enugu) wherein we opened up Enugu State to investors and showcased the investment opportunities in the state”.\n“We have also established two Enugu State Tech Hubs and Youth Innovation Centres (Enugu and Obollo Afor) to infuse technology knowledge and skills in our youths thereby supporting creativity, innovation, start-ups, product acceleration and wealth creation for them.\nHe assured them of the favourable Tech Eco-system of Enugu and a friendly business environment."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "The continuing debate on national rebirth",
    "summarized_story": "Fayemi accurately noted that Zik‘s book, Renascent Africa, published in 1937 was path-breaking as it gave intellectual impetus to the Pan-Africanist movement.\nThrough his works, he was able to mobilize the people of Africa in the struggle for economic and political freedom.\nFayemi believes that the best way to go is dialogue, especially in a heterogeneous and complex country like Nigeria.\nFor him, restructuring the country offers the best solution to the problems that have continued to assail Nigeria‘s efforts at nation building.\nRestructuring Nigeria, I believe, will help us to overcome the underlying factors that feed into the clamour for secession and self-determination."
  },
  {
    "headline": "Invasions , diplomacy and New World Order",
    "summarized_story": "It is plain bloody red and that is no exaggeration as I shall show carefully today with some vivid illustrations .\nFirst the Belarus- Poland border stand of has shown that migration can be weaponised in international relations amongst nations with conflicting interests or at dispute with each other .\nOn the Belarus- Poland migrants issue it is Belarus allowing migrants from Iraq , Syria and the Middle East access maliciously through its territory to Poland in retaliation for sanctions against Belarus by the EU for rigging the last Belarus presidential elections and suppressing protests and opposition violently .\nFrance has a fighting force in the Sahel because it believes Islamic terrorism is being hatched and exported to EU and France from there .\nWe should team up with the French in combatting Islamic terrorism both within and without the Sahel in Nigeria."
  },
  {
    "headline": "JUST IN: Railway workers suspend strike",
    "summarized_story": "Striking railway workers under the aegis of the Nigerian Union of Railway Workers (NUR) and the Senior Staff Association (SSA) NRC Branch have called off their strike.\nThe workers, who embarked on a 3-day warning strike on Thursday morning, called off the action after some series of agreements with the Federal Ministry of Transportation (FMOT) and the NRC management.\nIn a communique on Friday and co-signed by the President General of the SSA, Comrade Aliyu Mainasara; President General of the NUR, Comrade Innocent Ajiji and Director, Admin/HR of the NRC, Dr. Mrs. Monsurat Omotayo, the workers announced the setting up of a committee to review the standard condition of service of all railway workers.\nAccording to the communiqué: “The following are the resolutions made between the NRC, NUR and SSA, NRC Branch on Friday, 19th of November, 2021:“A committee has been set up with immediate effect on the review of the standard condition of service with timeline lasting to the 31st day of January 2022;- Advertisement -“It has been agreed that the personal data on deceased workers be collected for processing for immediate payment as every worker is already covered by the group life assurance scheme;“It has been agreed that all the train crews be given insurance cover as the train passengers and the goods in transit;“Enhanced salary regime has been taken up as a priority by the NRC Board and FMoT with a view to securing approval for implementation in the earliest time possible;“It has been agreed that no member of staff shall be victimized as a result of his/her participation in the 3-day industrial action of November 2021;“By this communique and foregoing resolutions, the 3-day warning strike action is hereby suspended.\nTherefore, workers are hereby directed to resume work with immediate effect.”"
  },
  {
    "headline": "EFCC returns alleged hidden N19.3b Kogi salary bail out cash to CBN",
    "summarized_story": "The Economic and Financial Crimes Commission(EFCC) said it has returned alleged hidden N19, 333,333,333.36bn Kogi salary bail out cash to the Central Bank of Nigeria (CBN).\nIt said the CBN has acknowledged the receipt of the sum in the Kogi State Salary Bail-out account domiciled in a new generation bank.\nIt said the recovery and the deposit of the cash with CBN have cleared all doubts on the operation of the commission on the hidden cash.\nA fact-sheet released by the Head of Media and Publicity of EFCC, Mr. Wilson Uwujaren insisted that there was such an account despite denial by the Kogi State Government.\n0073572696 domiciled with the name Kogi State Salary Bailout Account."
  },
  {
    "headline": "Seven killed, five injured as bandits invade Benue community",
    "summarized_story": "From Rose Ejembi MakurdiBlood flowed on Thursday evening at Tor Donga in Katsina-Ala Local Government area of Benue State after some gunmen reportedly stormed the area and killed seven people while also leaving five others injured.\nAmong the deceased were four members of the recently formed Benue Community Volunteer Guards as well as three other locals while a Catholic priest was reported injured.\n“Bandits came to Tor Donga yesterday evening and killed seven persons.\nThey killed Volunteer Guards members, injured two of them, then they killed some other persons too on their way as they shot sporadically.\n“Five injured persons are in the hospital, including a Reverend Father from Mbatseer who was going to Tor Donga."
  },
  {
    "headline": "BREAKING: Gunmen abduct Imo ex-Deputy Governor’s father",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen has abducted the father of the former Deputy Governor of Imo State and Traditional Ruler of Ezi – Mbieri Autonomous Community in Mbaitoli Local government area of Imo State, Eze Henry Madumere.\nThe monarch, father to Eze Madumere was reportedly abducted by some hoodlums around Iho Community in Ikeduru local government area of the State today.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe hoodlums were said to have forced the traditional ruler out from his vehicle and drove him to an unknown destination, shooting sporadically as they escape from the scene.\nHRH, Eze Madumere was a renowned businessman, Contractor and a member of Nigerian Independence Choir."
  },
  {
    "headline": "I will consider Kanu’s release, Buhari assures Igbo leaders",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nAccording to a statement by Special Adviser on Media and Publicity, Femi Adesina, Buhari stressed that request runs contrary to the doctrine of separation of powers between the Executive and Judiciary.\nThe President told the 93-year-old statesman: “You’ve made an extremely difficult demand on me as leader of this country.\nIn the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\nI will consider it.”Stressing his policy of non-interference with the Judiciary, President Buhari said when Kanu jumped bail, got arrested and brought back to the country, “I said the best thing was to subject him to the system."
  },
  {
    "headline": "Katsina: Bandits find alternative to GSM network blockage",
    "summarized_story": "From Agaju Madugba, KatsinaBandits operating in parts of Katsina State have reportedly resorted to the use of radio frequency walkie-talkie trans-receivers as alternative to the current blockage of GSM telecommunication network in the affected areas.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“A recent and most worrisome move by the criminals is the observed acquisition of Radio Frequency Walkie-Talkie Trans-Receivers which they have started using.\n“Banditry cases for the same period were 97 incidents for July/August 2021 with 130 deaths and 57 persons injured.\n“From September tho date, 244 suspects have been arrested, 33 under investigation and 80 under prosecution,” he said."
  },
  {
    "headline": "EndSARS panel report: Buhari awaits states’ pronouncements",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has finally spoken on ENDSARS report, where the Lagos panel in its findings said security operatives “killed unarmed protesters” who had gathered at the Lekki toll gate.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“We at the federal have to wait for the steps taken by the states, and we have to allow the system to work.\n“It’s helping us to stabilise the situation in the North East, and we’ve made a lot of progress since 2015.\n“That is why the youths defy the Sahara Desert and the Mediterranean to attempt emigrating to Europe."
  },
  {
    "headline": "N’Assembly Transmits Electoral Act (Amendment) Bill to Buhari for Assent",
    "summarized_story": "Deji Elumoye in AbujaThe National Assembly has transmitted the 2021 Electoral Act (Amendment) Bill it passed this month to President Muhammadu Buhari for his assent.\nA2 LFN 2004, the National Assembly has transmitted the Electoral Bill 2021 to Mr. President today Friday, November 19, 2021”.\nChairman of the Senate Committee on INEC, Senator Kabiru Gaya, had earlierbhinted that the National Assembly will this week transmit the electoral act amendment bill 2021 to President Muhammadu Buhari for his assent.\nOn whether the Electoral Act Amendment Bill had been transmitted to the President and when it would be done, Gbajabiamila said: “It’s on the way.\nGbajabiamila gave the assurance that the President would soon sign the Electoral Act Amendment Bill into law."
  },
  {
    "headline": "Kamala Harris to be First Woman to Hold US Presidential Power as Biden Undergoes Colonoscopy",
    "summarized_story": "US President Joe Biden will transfer power briefly to Vice President Kamala Harris on Friday while he is under anesthesia for a routine colonoscopy, making her the first woman to hold presidential power in U.S. history.\nBiden is undergoing his annual physical at the Walter Reed military hospital outside of Washington.\nHarris is the first woman to serve as vice president of the United States; no woman has ever been president in the country’s nearly 250-year history.\nPresidential power has been transferred to the vice president before, when President George W. Bush had colonoscopies in 2002 and 2007.\nThe Republican visited Walter Reed in 2019 for an undisclosed reason that a former press secretary, Stephanie Grisham, later revealed was for a colonoscopy."
  },
  {
    "headline": "News in Photographs: Buhari Meets Igbo Leaders",
    "summarized_story": "President Muhammadu Buhari Friday met with Igbo leaders at the State House, Abuja.\nIgbo leaders at the meeting include Dr Chukwuemeka Ezeife, Bishop Sunday Onuoha, Mr. Tagbo Amaechi, Chief Goddy Uwazurike and Chief Mbazulike Amaechi.\nAlso in attendance were ministers from the South East, including Minister of Science, Technology and Innovation Ogbonnaya Onu, Minister of Labour and Employment Chris Ngige, Minister of Foreign Affairs Geoffrey Onyeama and Minister of State for Education Chukwuemeka Nwajuiba.\nOther top government officials at the meeting include Chief of Staff Prof. Ibrahim Gambari and National Security Adviser, Maj. Gen. Babagana Monguno (rtd).\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Blinken’s Visit to Nigeria in Photographs",
    "summarized_story": "The United States Secretary of State, Antony Blinken arrived Abuja Thursday on the second leg of his first official visit to Africa.\nBlinken visited President Muhammadu Buhari and Vice President Yemi Osinbajo at the State House, and also met with Foreign Affairs Minister, Geoffrey Onyeama.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: We Won’t Preempt States over Decisions on #EndSARS",
    "summarized_story": "However, counsel to the Lagos State government on the #EndSARS panel, Mr. Abiodun Owonikoko (SAN), has rejected the findings of the panel, which were leaked on Monday.\nMeanwhile, sources close to Alausa, the seat of the Lagos State government, said the government spent N800 million to fund the #EndSARS inquiry, which lasted 13 months.\n“The United States and others work with Nigeria toward eliminating a wild polio virus, supporting vaccination campaigns, aiding surveillance to detect and isolate cases.\nHe also expressed the United States’ displeasure at the turn of events in Sudan, saying, “Let me just say one brief word about yesterday’s events in Sudan.\n“All manner of allegations have been heaped upon panel members, some of who have been called unprintable names."
  },
  {
    "headline": "EXCLUSIVE: Police Demand N60,000 To Track Phone Numbers Of Bandits Threatening To Attack Adamawa Community If N30million Is Not Paid",
    "summarized_story": "Operatives of the Adamawa State Police Command have requested payment of N60, 000 from leaders of the Fa'a Gaya community in the Hong Local Government Area of the state to track the mobile phone numbers of bandits threatening the community.\nAfterwards, he said, the police asked that the community elders pay the sum of N60,000 to enable them to track the phone numbers used by the bandits to threaten the community, to apprehend them.\n“The bandits sent threats to the community yet the police couldn't track them instead they're harassing community leaders over nothing.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\n”When we checked the mobile phone number, the one that was used to call the elders of Fa'a Gaya, the above mobile number is not registered."
  },
  {
    "headline": "EXCLUSIVE: Police Demand N60,000 To Track Phone Numbers Of Bandits Threatening To Attack Adamawa Community If N30million Is Not Paid",
    "summarized_story": "Operatives of the Adamawa State Police Command have requested payment of N60, 000 from leaders of the Fa'a Gaya community in the Hong Local Government Area of the state to track the mobile phone numbers of bandits threatening the community.\nAfterwards, he said, the police asked that the community elders pay the sum of N60,000 to enable them to track the phone numbers used by the bandits to threaten the community, to apprehend them.\n“The bandits sent threats to the community yet the police couldn't track them instead they're harassing community leaders over nothing.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\n”When we checked the mobile phone number, the one that was used to call the elders of Fa'a Gaya, the above mobile number is not registered."
  },
  {
    "headline": "EXCLUSIVE: Ex-Navy Director On Wanted List For N2billion Fraud Dares Anti-graft Agency, EFCC, Reopens Sealed Hotels",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has reopened his two hotels sealed by the anti-graft agency.\nThe anti-graft agency placed the red inscriptions, ‘EFCC Under Investigation’ all over the hotels.\nSee Also Exclusive EXCLUSIVE: Anti-graft Agency, EFCC Seals Two Hotels, Buildings, Bakery Owned By Ex-Navy Director On Wanted List For N2billion Fraud“After EFCC marked Rtd Tahir Yusuf’s hotels in Kaduna and Sokoto, guess what he did, he asked his people to wipe and clean the EFCC markings.\nHe had fled Nigeria to Dubai, UAE in 2018 after he was accused of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts."
  },
  {
    "headline": "EXCLUSIVE: Ex-Navy Director On Wanted List For N2billion Fraud Dares Anti-graft Agency, EFCC, Reopens Sealed Hotels",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has reopened his two hotels sealed by the anti-graft agency.\nThe anti-graft agency placed the red inscriptions, ‘EFCC Under Investigation’ all over the hotels.\nSee Also Exclusive EXCLUSIVE: Anti-graft Agency, EFCC Seals Two Hotels, Buildings, Bakery Owned By Ex-Navy Director On Wanted List For N2billion Fraud“After EFCC marked Rtd Tahir Yusuf’s hotels in Kaduna and Sokoto, guess what he did, he asked his people to wipe and clean the EFCC markings.\nHe had fled Nigeria to Dubai, UAE in 2018 after he was accused of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts."
  },
  {
    "headline": "No Body Part Of Deceased OAU Student Is Missing — Hilton Hotel Owner, Adedoyin Speaks From Cell, Claims Innocence",
    "summarized_story": "SaharaReporters had learnt that it was noticed that Oludare was missing when his wife could not reach him on the phone.\nFollowing a police investigation, money paid by Oludare for lodging was traced to Adesola, who worked in the hotel.\nA source told SaharaReporters that the owner of the hotel, who also owns Oduduwa University, and other workers initially denied that Oludare was at the hotel.\nMeanwhile, the victim's body was discovered after some suspects, including workers at the hotel were arrested by the police.\n“I was only informed that something like that happened at the Hilton Hotel when police started searching for Timothy."
  },
  {
    "headline": "High demand delaying issuance of visitor visas in Nigeria, says UK",
    "summarized_story": "The British High Commission says the high demand for standard UK visitor visas has been responsible for the delay in processing.\nIt, however, said extremely compelling circumstances may be considered for expediting specific cases.\n“Due to extremely high demand, standard UK visitor visas are taking significantly longer than usual to be processed,” the commission said.\n“Where there are extremely compassionate or compelling circumstances (for example, a medical emergency) we may consider expediting specific cases.\n“If your request is exceptionally urgent, you can contact UK Visas and Immigration for help."
  },
  {
    "headline": "High demand delaying issuance of visitor visas in Nigeria, says UK",
    "summarized_story": "The British High Commission says the high demand for standard UK visitor visas has been responsible for the delay in processing.\nIt, however, said extremely compelling circumstances may be considered for expediting specific cases.\n“Due to extremely high demand, standard UK visitor visas are taking significantly longer than usual to be processed,” the commission said.\n“Where there are extremely compassionate or compelling circumstances (for example, a medical emergency) we may consider expediting specific cases.\n“If your request is exceptionally urgent, you can contact UK Visas and Immigration for help."
  },
  {
    "headline": "Naira falls by 2.8% to N545/$1 at parallel market",
    "summarized_story": "The naira, on Friday, depreciated against the dollar at the parallel section of the foreign exchange market.\nAdvertisementBureaux De Change (BDC) operators in Lagos told TheCable on Friday that the naira exchanged for N545 per dollar at the street market.\nA parallel market (street market) is characterised by non-compliant behaviour with an institutional set of rules.\nAdvertisementAt the close of the market on Friday, figures from the FMDQ OTC Securities Exchange, a platform that oversees official foreign-exchange trading in Nigeria, also showed that the local currency fell at the official market by 0.2 percent to N414.40/$1.\nThe Central Bank of Nigeria (CBN) has said that the parallel market is not a true reflection of the naira."
  },
  {
    "headline": "Naira falls by 2.8% to N545/$1 at parallel market",
    "summarized_story": "The naira, on Friday, depreciated against the dollar at the parallel section of the foreign exchange market.\nAdvertisementBureaux De Change (BDC) operators in Lagos told TheCable on Friday that the naira exchanged for N545 per dollar at the street market.\nA parallel market (street market) is characterised by non-compliant behaviour with an institutional set of rules.\nAdvertisementAt the close of the market on Friday, figures from the FMDQ OTC Securities Exchange, a platform that oversees official foreign-exchange trading in Nigeria, also showed that the local currency fell at the official market by 0.2 percent to N414.40/$1.\nThe Central Bank of Nigeria (CBN) has said that the parallel market is not a true reflection of the naira."
  },
  {
    "headline": "National assembly transmits electoral bill to Buhari for assent",
    "summarized_story": "The national assembly has transmitted the electoral act amendment bill to President Muhammadu Buhari for assent.\nAdvertisementBabajide Omoworare, senior special assistant to the president on national assembly (senate), disclosed this in a statement on Friday.\nA2 LFN 2004, the National Assembly has transmitted the Electoral Bill 2021 to Mr. President today Friday November 19, 2021,” Omoworare said.\nLast week, both chambers of the national assembly approved the conference committee report on the bill.\nAdvertisementIn the conference committee report, both chambers of the national assembly empowered the Independent National Electoral Commission (INEC) to determine the best mode to transmit election results."
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "Shuttlers raises $1.6 million to expand to Nigerian cities",
    "summarized_story": "Shuttlers, a logistics startup out of Lagos, Nigeria, has raised $1.6 million in seed funding to expand into African countries.\nWith its new raise, Shuttlers intends to try its wheels in more Nigerian cities before expanding beyond the borders of the country into other African countries.\nShuttling Lagos’ transportation systemIn 2016, Damilola Olokesusi founded Shuttlers to tackle the inefficient transportation system in Lagos, Africa’s most populous city.\nWith over 100 buses and 300 bus stops in Lagos, Shuttlers also claims to have recorded over 2 million trips since its inception in 2013.\n“Our mission at Shuttlers is to transform the way people commute around the world, by building a global partner network and connecting communities of shuttlers like we are presently doing in Lagos, Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Early Access: Interview with Mr Eazi; artiste, tech bro, investor",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\n“I think Mr Eazi is a laid back musician.\nThe Nigeria-born musician later relocated to Ghana for his undergraduate studies before starting his music career in London.\nHe believes Africa is experiencing its best years in the global music industry, with many of its music genres being embraced globally.\nMotivation and obsessionOluwatosin Ajibade (Mr Eazi)."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "The Kredi Money story, Ozow’s $48m Series B, and blockchain skills with Bitmama",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:The Kredi Money storyOzow’s $48m Series BGetting blockchain skills with BitmamaThe Kredi Money storyKredi Money Co-founders, Afolabi Abimbola and Samuel OrjiFintech remains one of the biggest movers in Nigeria’s startup ecosystem.\nAdvertisementAnother fintech startup, Kredi Money, has joined the Nigerian fintech space combining several fintech offerings into one.\nEmmanuel Paul has that answer and more here: Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services.\nOzow’s $48m Series BThomas Pays, CEO and Co-Founder of OzowSouth African fintech startup, Ozow has closed a $48 million Series B to ease online payments for South Africans.\n: According to 101 Blockchains, the need for blockchain talent is fueled by the advantages of blockchain, such as security, transparency, and traceability."
  },
  {
    "headline": "African countries lose $5bn annually to dollar convertibility",
    "summarized_story": "African countries with 42 different currencies are losing $5 billion annually, as the cost of currency convertibility, Wamkele Mene, Secretary-General of the African Continental Free Trade Area (AfCFTA) Secretariat, said on Friday in Durban, South Africa.\n“We know that there will be countries that as a result of elimination of tariffs, they will suffer short term revenue losses.\nFor many countries on the continent, tariffs or duties are a source of revenue.\nThat is why the AfCFTA exists to make sure that we move away from that reliance,” Mene said further.\nHe said for the continent to create an internal market for African products, it must begin to manufacture value-added goods and deepen their regional value chains."
  },
  {
    "headline": "Real estate emerges world’s most popular store of wealth",
    "summarized_story": "Countries store over 60% of wealth in real estateTwo-thirds of global net worth is stored in real estate and only about 20 percent in other fixed assets, according to consulting firm, McKinsey.\n“This shows investors’ confidence in the Nigeria real estate sector as a subsector of the economy which thrives despite the current inflation and devaluation of the naira,” Freeman Osonuga, Real Estate Investor, Advisor and Best-Selling Author, says.\nReal asset with highest investment globallyWith 67 percent share of the global real asset investment, real estate ranks the top on the list, according to McKinsey.\nType of real estate with most investment globallyThe residential sub-sector of the global real estate market has the most investment by value, as analysed from the McKinsey’s report.\nAccording to the data, land/residential real estate accounted for 51 percent of the global real estate investment in 2020, higher than the 49 percent that was reported for the non-residential arm of the property market."
  },
  {
    "headline": "Mo Abudu’s business becomes Harvard case study",
    "summarized_story": "For the first time in history, a case study about a female African media entrepreneur titled: ‘The Harvard Business School – EbonyLife Case Study,’ will be taught at Harvard Business School (HBS) to over 1,000 MBA students.\nCase study A chronicles the journey of EbonyLife Media from inception to December 2020, while case study B provides a summary of what has occurred between January and October 2021.\nHaving read case study A, the students will have to consider the choices told in the HBS case study abstract and give their analysis.\nShe oversees the EbonyLife Group, which includes all EbonyLife Media assets and EbonyLife Place, Nigeria’s first luxury entertainment resort.\nShe has spoken at the Wharton School of Business, Cambridge University Judge School of Business, NYU, Oxford University and Harvard University."
  },
  {
    "headline": "Buhari to Igbo Leaders: Your demand for Nnamdi Kanu’s release is heavy, I’ll consider it – Nigerian Observer",
    "summarized_story": "Buhari to Igbo Leaders: Your demand for Nnamdi Kanu’s release is heavy, I’ll consider itShare FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says unconditional release of Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra (IPOB), currently standing trial, runs contrary to the doctrine of separation of powers between the Executive and Judiciary.\n” In the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\n” God has spared you, and given you a clear head at this age, with very sharp memory.\n”Let him make his case in court, instead of giving very negative impressions of the country from outside.\nHe concluded: “I don’t want to leave this planet without peace returning to my country."
  },
  {
    "headline": "2021 Edo trade fair offers free dispute resolution services for participants — official – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The 2021 Edo Trade fair officially got underway on Friday, with the commencement of free dispute resolution services that would run for the duration of the fair.\nOmo-Ojeonu said that the free dispute resolution was a measure to encourage Micro, Small and Medium Enterprises (MSMEs) to resolve disputes that had been affecting their businesses.\nSimilarly, Omo-Ojeonu said that the trade fair was to help individuals and organizations maximize outputs by combining expertise and resources together.\n“We are assuring you that this year’s trade fair will provide avenues for you to break new grounds in business.\nOye said that innovation was necessary to keep SMEs in business, especially in a post-COVID 19 era."
  },
  {
    "headline": "Freedom of religion: U.S position vindicates Buhari-BMO – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Buhari Media Organisation (BMO) has described the United States Government’s decision to remove Nigeria from the list of countries without religious freedom as a vindication for President Muhammadu Buhari’s administration.\nThe group said in a statement signed by its Chairman Niyi Akinsiju and Secretary Cassidy Madueke, that what the US Department of State did was to leverage on its vantage position to sift facts from fictional tales of state-sponsored persecution of Christians.\n“We join millions of well-meaning Nigerians to commend US President Joe Biden’s administration for doing its due diligence on allegations in 2020 that made the previous Donald Trump administration add Nigeria to the list of countries believed to be willfully violating religious freedom.\n“This is a landmark move in the face of the recent spate of lobbying by individuals and groups, with some form of bias against President Buhari, to further their needless opposition to the administration.\n“We know that a number of them have made and continue to make all sorts of unverifiable claims which suggest that the President has been encouraging persecution of Christians."
  },
  {
    "headline": "Senate President urges politicians to be honest, work for unity – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Senate President, Ahmad Lawan, on Friday in Abuja urged politicians to be honest, selfless and to continue to work for the unity of the country.\nHe described Jonathan as a leader that believed in the unity, progress and development of not just Nigeria, but of the entire African continent.\nHe stressed that Jonathan had been demonstrating the belief even after he left office as Nigeria’s president.\nHe said that Jonathan had demonstrated that Nigeria could be great if the political class decided to be selfless and honest.\n“We can achieve that if we continue to have this kind of leadership; whether in office or out of office."
  },
  {
    "headline": "Seven girls die in Jigawa boat mishap",
    "summarized_story": "Seven girls have been confirmed dead in a boat accident that happened in Jigawa State Thursday night.\nLocal sources who spoke to BBC Hausa as monitored by PREMIUM TIMES said the accident occurred while the boat was ferrying the women back from Gasanya to Gafasa.\nGafasa is in Kafin Hausa local government area while Gasanya is under Auyo LGA, both in Jigawa State.\n“12 people were inside the boat during the accident in the river between Auyo and Kafin Hausa local government areas.\nSeven of the girls died while five were rescued,” he said."
  },
  {
    "headline": "Request for Nnamdi Kanu’s release difficult, but I’ll consider it – Buhari tells Igbo leaders",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has said the request an unconditional release of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), which he described as “heavy,” will be difficult to consider, but he would nonetheless, consider it.\nThe President, according to a statement issued by his spokesman, Femi Adesina, told the 93-year-old statesman that: “You’ve made an extremely difficult demand on me as leader of this country.\nIn the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\nGod has spared you, and given you a clear head at this age, with very sharp memory.\nLet him make his case in court, instead of giving very negative impressions of the country from outside."
  },
  {
    "headline": "US has delivered 7.6m doses of Covid-19 vaccines to Nigeria, helping to fund treatment of 1.5m HIV patients – Blinken",
    "summarized_story": "The secretary of state who is on official visit to Nigeria, noted that Nigeria touches the United States every day through the amazing power of its diaspora.\nThe United States and others worked with Nigeria toward eliminating wild polio virus, supporting vaccination campaigns, aiding surveillance to detect and isolate cases.\n“There are various areas that we cooperate with the United States in.\nI mean, a lot of Nigerians are asking how we can ease the regime of visa applications to the United States embassies.\nAnd our president, President Muhammadu Buhari, met of course in Glasgow during the COP26 with President Biden."
  },
  {
    "headline": "Sanwo-Olu says Lagos needs $15bn to build sufficient infrastructure",
    "summarized_story": "Governor of Lagos State, Mr. Babajide Sanwo-Olu has said the state the state will need about $15 billion over the next five years for infrastructure.\nThe governor called on investors to optimise the advantages of the opportunities in Lagos State toward the goal of developing a 21st Century economy as projected by his administration.\nIt is such strategic partnerships that account for Lagos being by far the leading recipient of local and foreign direct investments in Nigeria.\n“As a low-lying aquatic city with over 22 million citizens, confined to the smallest landmass in Nigeria, Lagos is especially vulnerable to all the challenges of a sprawling, densely populated, climate challenged, fast-growing Megacity.\nI would like to ask you all, to please spread the word; Lagos State is open and ready for investment, innovation, and collaboration.”Facebook Notice for EU!"
  },
  {
    "headline": "Nigeria’s GDP grows by 4.03% in Q3, 2021",
    "summarized_story": "Nigeria’s Gross Domestic Product (GDP) grew by 4.03 percent in the third quarter (Q3) of 2021, compared with the 5.\nIn nominal terms, aggregate GDP increased to N45.11 trillion in the period under review, compared with the N39.12 trillion recorded in Q2 and N39.09 trillion in Q3 2020.\nThe economy was largely driven by the non-oil sector which accounted for 92.51per cent of GDP, while the oil sector contributed 7.49 per cent to growth in Q3.\nAlso, trade contributed 14.93 per cent to GDP, lower than the 16.66 per cent recorded in Q2.\n“There was serious base effects affecting the figure because Q3 2020 recorded negative rate while Q2 2020 recorded negative rate."
  },
  {
    "headline": "20 Activists Selected For Speak Up, Stand Out Programme",
    "summarized_story": "Twenty selected activists from Abuja, the nation’s capital city, Lagos and Enugu States are in a conference for the Speak Up, Stand Out (SUSO) programme in Abuja.\nThis is what the Speak Up, Stand Out (SUSO) programme wants to change.\nWith 20 activists selected across Abuja, Enugu and Lagos, the programme will support them working with 500 advocates across 20 communities in the three states for 12 months.\nIn addition, these 20 young activists will work with 25 young Advocates in their communities for 12 months to create solutions to problems affecting young people around the identified four thematic areas.\nThe Speak Up, Stand Out program is to aid collaboration between young people and decision-makers to address pertinent issues affecting young people."
  },
  {
    "headline": "20 Activists Selected For Speak Up, Stand Out Programme",
    "summarized_story": "Twenty selected activists from Abuja, the nation’s capital city, Lagos and Enugu States are in a conference for the Speak Up, Stand Out (SUSO) programme in Abuja.\nThis is what the Speak Up, Stand Out (SUSO) programme wants to change.\nWith 20 activists selected across Abuja, Enugu and Lagos, the programme will support them working with 500 advocates across 20 communities in the three states for 12 months.\nIn addition, these 20 young activists will work with 25 young Advocates in their communities for 12 months to create solutions to problems affecting young people around the identified four thematic areas.\nThe Speak Up, Stand Out program is to aid collaboration between young people and decision-makers to address pertinent issues affecting young people."
  },
  {
    "headline": "JUST-IN: NASS Transmits Electoral Bill 2021 To Buhari For Assent",
    "summarized_story": "The National Assembly has transmitted the Electoral Act 2010 (Amendment) Bill 2021 to President Muhammadu Buhari for assent.\nLEADERSHIP recall that in the last few days after the passage of the Bill by both chambers of the National Assembly, there were arguments over a provision for direct primaries by political parties in the new electoral law.\nGovernors of the Federation were said to be against the direct primaries provision in the new law, made by members of the National Assembly against the delegate system of producing party flag bearers.\nA terse statement by the Senior Special Assistant to the President on National Assembly Matters (Senate), Senator Babajide Omoworare, on Friday evening said the Bill was transmitted earlier on Friday.\nA2 LFN 2004, the National Assembly has transmitted the Electoral Bill 2021 to Mr. President today Friday November 19, 2021,” Omoworare stated."
  },
  {
    "headline": "JUST-IN: NASS Transmits Electoral Bill 2021 To Buhari For Assent",
    "summarized_story": "The National Assembly has transmitted the Electoral Act 2010 (Amendment) Bill 2021 to President Muhammadu Buhari for assent.\nLEADERSHIP recall that in the last few days after the passage of the Bill by both chambers of the National Assembly, there were arguments over a provision for direct primaries by political parties in the new electoral law.\nGovernors of the Federation were said to be against the direct primaries provision in the new law, made by members of the National Assembly against the delegate system of producing party flag bearers.\nA terse statement by the Senior Special Assistant to the President on National Assembly Matters (Senate), Senator Babajide Omoworare, on Friday evening said the Bill was transmitted earlier on Friday.\nA2 LFN 2004, the National Assembly has transmitted the Electoral Bill 2021 to Mr. President today Friday November 19, 2021,” Omoworare stated."
  },
  {
    "headline": "Lawan Urges Political Class To Continue Engagement For Nigeria’s Betterment",
    "summarized_story": "The President of the Senate, Ahmad Lawan, on Friday, urged the Nigerian political class to continue to engage to make the country a better place.\nYou believe in the unity of this country and what can be more testifying is your engagement outside office.\nWhat you are doing, Your Excellency, is to show example of what our leaders can do outside office after their service.\nIt can be great if the political class decides to be selfless, decides to be honest.\nYou are helping Nigeria democracy to grow by the day,” Lawan said."
  },
  {
    "headline": "Worker sues Tesla in US, alleges ‘rampant’ sex harassment",
    "summarized_story": "A Tesla factory worker in California has sued the electric car maker, alleging women are subjected to rampant sexual harassment at the facility and that managers have not taken action despite her complaints.\nThe Fremont plant in the San Francisco Bay area has been involved in other controversies, including a lawsuit alleging racism and a battle over Covid-19 restrictions.\n“Although Tesla publicly claims that it fosters a safe and respectful environment for its workers, the truth is that for years Tesla has subjected women working in its Fremont plant to nightmarish conditions of rampant sexual harassment,” the suit claims.\nBarraza alleges one of her colleagues, for example, snuck up behind her before placing his leg between her thighs.\nBarraza, 38, said she complained several times to supervisors and to a human resources representative, but no action was taken to her knowledge."
  },
  {
    "headline": "Worker sues Tesla in US, alleges ‘rampant’ sex harassment",
    "summarized_story": "A Tesla factory worker in California has sued the electric car maker, alleging women are subjected to rampant sexual harassment at the facility and that managers have not taken action despite her complaints.\nThe Fremont plant in the San Francisco Bay area has been involved in other controversies, including a lawsuit alleging racism and a battle over Covid-19 restrictions.\n“Although Tesla publicly claims that it fosters a safe and respectful environment for its workers, the truth is that for years Tesla has subjected women working in its Fremont plant to nightmarish conditions of rampant sexual harassment,” the suit claims.\nBarraza alleges one of her colleagues, for example, snuck up behind her before placing his leg between her thighs.\nBarraza, 38, said she complained several times to supervisors and to a human resources representative, but no action was taken to her knowledge."
  },
  {
    "headline": "NYSC warns: Graduates yet to take COVID-19 vaccine won’t be allowed into camp",
    "summarized_story": "NYSC warns: Graduates yet to take COVID-19 vaccine won’t be allowed into campNYSC warns: Graduates yet to take COVID-19 vaccine won’t be allowed into campGraduates who have not taken COVID-19 vaccine jabs would not be allowed into its offices and orientation camps for the 2021 Batch C, Stream II, orientation course slated to begin on November 24, the National Youth Service Corps said on Friday.\nThe NYSC Director, Press and Public Relations, Adenike Adeyemi, said this during a press briefing in Abuja.\nAccording to her, the new policy was to establish the health status of prospective corps members before they are registered for the mandatory national service.\nAdeyemi said, “Sequel to the recent announcement of the Presidential Steering Committee on COVID-19, prospective corps members are to note that effective December 2 2021, they will be required to show evidence of COVID-19 vaccination before they are allowed access into offices and orientation camps.\nAdeyemi also warned that qualified graduates who failed to make themselves available for the one-year national service would be prosecuted in line with the provisions of Section 13 sub-section 1(a) and (b) of the NYSC Act."
  },
  {
    "headline": "NYSC warns: Graduates yet to take COVID-19 vaccine won’t be allowed into camp",
    "summarized_story": "NYSC warns: Graduates yet to take COVID-19 vaccine won’t be allowed into campNYSC warns: Graduates yet to take COVID-19 vaccine won’t be allowed into campGraduates who have not taken COVID-19 vaccine jabs would not be allowed into its offices and orientation camps for the 2021 Batch C, Stream II, orientation course slated to begin on November 24, the National Youth Service Corps said on Friday.\nThe NYSC Director, Press and Public Relations, Adenike Adeyemi, said this during a press briefing in Abuja.\nAccording to her, the new policy was to establish the health status of prospective corps members before they are registered for the mandatory national service.\nAdeyemi said, “Sequel to the recent announcement of the Presidential Steering Committee on COVID-19, prospective corps members are to note that effective December 2 2021, they will be required to show evidence of COVID-19 vaccination before they are allowed access into offices and orientation camps.\nAdeyemi also warned that qualified graduates who failed to make themselves available for the one-year national service would be prosecuted in line with the provisions of Section 13 sub-section 1(a) and (b) of the NYSC Act."
  },
  {
    "headline": "BREAKING: EFCC Returns N19.3bn Kogi Salary Bailout ‘Hidden’ In Sterling Bank To CBN.",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has acknowledged receipt of N19,333,333,333 from the Kogi Salary Bailout Account ‘hidden’ at Sterling Bank, according to the Central Bank of Nigeria (CBN).\nUwujaren said the development puts to rest “the campaign of misinformation and unconscionable denials by the Kogi State Government that no fund was recovered from its bailout account”.\nThe CBN in a letter with ref: DFD/DIR/CON/EXT/01/099 informed EFCC Chairman (EFCC) Abdulrasheed Bawa that it had received the money.\nThe commission earlier told the court that Sterling Bank, where the account was domiciled, acknowledged the existence of the said account housing N19,333,333,333.\n0073572696 domiciled in Sterling Bank with the name Kogi State Salary Bailout Account”."
  },
  {
    "headline": "BREAKING: Hidden N19.3bn Kogi salary bail-out funds returned to CBN",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says it has returned the sum of N19.3 billion salary bail-out funds hidden by the Kogi State government to the Central Bank of Nigeria (CBN).\nThis was contained in a statement signed and released on Friday by Wilson Uwujaren, Head, Media and Publicity of the anti-graft agency.\n“This effectively puts to rest the campaign of misinformation and unconscionable denials by the Kogi State Government that no fund was recovered from its bail out account.\nNo: CR:3000/EFCC/LS/CMU/REC-STE/VOL.4/047 on the above subject and wish to confirm the details of the receipt of the amount as stated below: Bank: Sterling Bank Plc; Amount: N19, 333, 333,333.36; Date of receipt: 04 November, 2021”.\n0073572696 domiciled in Sterling Bank, Plc with the name Kogi State Salary Bailout Account."
  },
  {
    "headline": "How PDP Presidential candidate will emerge, by Wike, Fintiri",
    "summarized_story": "Rivers Governor, Nyesom Wike, and his Adamawa counterpart, Ahmadu Fintiri, have reflected on the type of presidential candidate the Peoples Democratic Party (PDP) needs to take over power in 2023.\nWhile Wike was concerned about how and when the candidate would emerge, Fintiri dwelled on the character and qualities of the candidate, saying he was not in support of zoning.\nWike and his entourage were in Yola to appreciate Fintiri, who was the Chairman of the PDP Convention Planning Committee for successfully conducting the exercise.\nWike said stakeholders in the party would at the right time collectively decide the presidential candidate.\nThe Rivers Governor commended Fintiri and members of the PDP convention planning committee for making the party proud by conducting a transparent and rancour-free convention."
  },
  {
    "headline": "BREAKING: I Will Consider Releasing Nnamdi Kanu — Buhari Assures Southeast Leaders",
    "summarized_story": "Nnamdi Kanu’s unconditional release, according to President Muhammadu Buhari, would violate the principles of separation of powers between the Executive and the Judiciary.\nBuhari made the commitment when he met with a group of Highly Respected Igbo Greats at State House in Abuja, led by First Republic lawmaker and Minister of Aviation, Chief Mbazulike Amaechi.\nChief Amaechi claimed he had spoken with Nnamdi Kanu twice before, and the latter had withdrawn directives for civil disobedience.\nBuhari said, “You’ve made an extremely difficult demand on me as leader of this country.\nLet him make his case in court, instead of giving very negative impressions of the country from the outside."
  },
  {
    "headline": "Breaking: 3 days after, NRC workers call off warning strike",
    "summarized_story": "After meeting with the Ministry of Transport and the management of the Nigerian Railway Corporation (NRC), workers of the corporation have called off their three-day warning strike.\nAlready, train services are have resume across the country.\nThe meeting that eventually led to the call off was held in Abuja.\nThis was disclosed in a Communique issued by the union on Friday.\nDetails coming…"
  },
  {
    "headline": "2023: Can Ayu-led PDP provide needed opposition?",
    "summarized_story": "The suspension of the PDP National Chairman Prince Uche Secondus by a Rivers State High Court led to a series of legal tussles.\nThe PDP National Consensus Convention produced former Senate President, Iyorchia Ayu, as the national chairman; former Deputy Governor Oyo state, Taofeek Arapaja, as deputy national chairman (South), while former governorship candidate of Yobe state, Umar Damagum, emerged deputy national chairman (North).\nSimilarly, Senator Samuel Anyanwu was elected national secretary; Setoji Kosheodo as deputy national secretary; Ahmed Mohammed as national treasurer; and Ndubisi David as deputy national treasurer.\nOther are: Stella Effah-Attoe elected as national woman leader; Hajara Wanka as deputy national woman leader; Muhammed Suleiman as national youth leader; Timothy Osadolor as deputy national youth leader; Kamaldeen Ajibade as national legal adviser; Okechukwu Osuoha as deputy national legal adviser; Okechuckwu Daniel as national auditor; and Abdulrahman Mohammed as deputy national auditor.\nOn the said of the majority party members or a few party governors who finance them and the party?"
  },
  {
    "headline": "With telecoms shutdown: Bandits now use walkie talkie in Katsina – SSG",
    "summarized_story": "Amidst continued shutdown of telecoms services in Katsina state, bandits have resorted to use of Radio Frequency Walkie Talkie Transceivers, Secretary to the State Government (SSG) Mustapha Inuwa has said.\nAt the parley were Commissioner of Police in the state, Sanusi Buba and the Special Adviser to the Governor on Security, Muhammad Ibrahim Katsina.\nThere were also outcries from some stakeholders who believed the shutdown had worsened the security situation of the people.\nFor instance, the state legislature recently tasked the Masari administration to up its game, saying the telecoms shutdown had left the people at the mercy of the bandits.\nSSG speaks in the contrarySpeaking to the contrary, however, SSG Inuwa said the telecoms ban had achieved the desired results in the state."
  },
  {
    "headline": "Buhari Hosts Igbo Leaders, Promises To Consider Nnamdi Kanu’s Release",
    "summarized_story": "President Muhammadu Buhari has promised to consider the request for the release of Nnamdi Kanu after meeting with a group of leaders from the South East under the aegis of Highly Respected Igbo Greats.\n“You’ve made an extremely difficult demand on me as leader of this country,” the President was quoted as saying in a statement by his media adviser, Femi Adesina.\n“In the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\n“Let him make his case in court, instead of giving very negative impressions of the country from outside.\nHe was initially detained and arraigned in court, but he fled the country in 2017 after he was granted bail for medical reasons."
  },
  {
    "headline": "Railway Workers Suspend Three-Day Warning Strike",
    "summarized_story": "Railway workers have suspended their three-day warning strike which was earlier declared to demand improved welfare.\nThe workers announced the suspension on Friday, a day after they had commenced the strike and shut down passenger and cargo train services of the Nigerian Railway Corporation (NRC).\nIn Abuja the nation’s capital, prior to calling off the strike, workers in Idu had locked the station and displayed various placards in protest.\nAggrieved workers were also seen at the Mobolaji Johnson Train Station in Ebute-Metta in Lagos, with placards, lamenting poor welfare and poor salary.\nTrain service at the Professor Wole Soyinka railway station in Abeokuta, Ogun State capital was equally paralysed because of the industrial action."
  },
  {
    "headline": "It Is Time To Start Treating Africa As Major Geopolitical Player – U.S.",
    "summarized_story": "﻿The United States government believes now is the time for major geopolitical players across the world to start treating Africa as one of them.\nU.S. Secretary of State, Mr Antony Blinken, stated this on Friday while addressing members of the Economic Community of West African States (ECOWAS) in Abuja.\n“United States firmly believes that it is time to start treating Africa as a subject in geopolitics, and structure it as a major geopolitical player it has become – the facts speak for themselves,” he said.\nUnited States knows that in most of the challenges and opportunities we face, Africa will make a difference.\n“My own country is struggling with threats to democracy and the solutions to those threats will come as much from Africa as from anywhere.”"
  },
  {
    "headline": "Stray Bullets Hit Civilians As Military Push Back Terrorists In Borno",
    "summarized_story": "Three civilians were hit by stray bullets on Friday morning as the Nigerian Armed Forces tackled ISWAP fighters during an attack on Damboa local government of Borno state.\nThe insurgents stormed Damboa through Kalla, a small village close to a military base at about 6 am for a surprise attack.\nThe three civilians affected were hit by stray bullets during the encounter, as confirmed by a villager.\n“Normalcy has been restored in Damboa town and we are going for prayers, I will confirm the condition of those hit by stray bullets after the Jumaat prayers.\n“In the following offensive, troops engaged the terrorists with high volume of fire, forcing them to withdraw in disarray."
  },
  {
    "headline": "NASS Transmits Electoral Bill To Buhari For Assent",
    "summarized_story": "The National Assembly has transmitted the Electoral Bill 2021 to President Muhammadu Buhari for assent.\nThe Senior Special Adviser to the President on the National Assembly Senator, Babajide Omoworare, disclosed this in a statement on Friday.\nHe said this is in pursuance of Section 58 (3) of the 1999 Constitution of the Federal Republic of Nigeria as amended and the Acts Authentication Act 2004.\nRead Also: NASS Passes Electoral Act Amendment Bill, Approves Electronic Transmission Of ResultsThe National Assembly had last week completed work on the amendment of the Electoral Act bill which grants the Independent National Electoral Commission (INEC) powers to deploy electronic transmission of election results.\nNASS and indeed many Nigerians are hoping President Buhari will give his assent to the electoral act amendment bill in time to ensure INEC prepares well ahead for the 2023 general elections."
  },
  {
    "headline": "Gunmen kill seven in Benue community",
    "summarized_story": "7 Persons have been confirmed killed by gunmen in an attack at Tor-Togan town on Thursday night.\nThe chairman of Katsina Ala local government area Hon.Alfled Atera confirmed the incident.\nTor Tongo is a farming community on the Katsina Ala -Takum federal highway in Benue north east senatorial zone .\nAtera disclosed that those killed were mostly members of the Community Volunteer Guards (CVG).\nHe alleged that the gunmen are L gang members of a militia leader called Azonto."
  },
  {
    "headline": "Igbo leaders' demand for Kanu's release is heavy\", I will consider it",
    "summarized_story": "The president said: “You’ve made an extremely difficult demand on me as leader of this country.\nIn the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\nGod has spared you, and given you a clear head at this age, with very sharp memory.\nLet him make his case in court, instead of giving very negative impressions of the country from outside.\nI feel it’s even a favour to give him that opportunity.”The President condoled with Chief Amaechi, who recently buried his wife, praying that her soul would rest in peace."
  },
  {
    "headline": "President Buhari promises to consider Igbo's demand for Kanu's release -",
    "summarized_story": "An unconditional release of Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra (IPOB), currently standing trial, runs contrary to the doctrine of separation of powers between the Executive and Judiciary, President Muhammadu Buhari has said.\nIn the last six years, since I became President, nobody would say I have confronted or interfered in the work of the Judiciary.\nI will consider it.”Stressing his policy of non-interference with the Judiciary, President Buhari said when Kanu jumped bail, got arrested and brought back to the country, “I said the best thing was to subject him to the system.\nLet him make his case in court, instead of giving very negative impressions of the country from outside.\nI feel it’s even a favour to give him that opportunity.”The President condoled with Chief Amaechi, who recently buried his wife, praying that her soul would rest in peace."
  },
  {
    "headline": "Photos: APC National leader, Bola Tinubu arrives Kano to condole with Dangote family",
    "summarized_story": "The national leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has arrived in Kano to condole with the Dangote family over the death of Sani.\nLate Sani was the younger brother of the Africa’s richest man and chairman of the Dangote group, Aliko Dangote.\nThe former Lagos arrived the Kano international Airport alongside Kano state governor, Abdullahi Ganduje and other members of the state executive council."
  },
  {
    "headline": "We Will Ensure Justice Is Done Concerning Itunu Babalola – Abike Dabiri-Erewa",
    "summarized_story": "Following the death of Ms Becky Paul, a Nigerian citizen also known as Itunu Babalola, at a military hospital in Abidjan, Cote d’Ivoire, at the weekend, Nigerians have been demanding for an investigation into her death.\nMs Paul had been sentenced to 10 years imprisonment in Cote d’Ivoire for alleged human trafficking which she insisted before her demise she did not commit.\nHer ordeal started after she accused an Ivorian of a robbery at her residence and insisted on filing a case against him.\nHowever, the accused, who happens to be related to an Ivorian policeman, had asked her to drop the case but she insisted on getting justice.\nAbike Dabire Erewa, Chairperson of the Nigeriansin Diaspora Commission, discusses what the Nigerian government is doing to get justice for the late Ms. Paul and compensation for the family that she left behind."
  },
  {
    "headline": "Kanu’s Alleged Maltreatment In DSS Custody – Trending W/Ojy Okpe",
    "summarized_story": "Fashion label Fendi began trending on Twitter after Ifeanyi Ejiofor, counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, raised the alarm on Thursday that the separatist leader has not been allowed to change clothes since he was arrested and detained in the custody of the Department of States Services.\nThe minister of information and culture, Lai Mohammed’s comments on media freedom has generated reactions on social media.\nThe minister while speaking at the ongoing 41st United Nations Educational, Scientific and Cultural Organization conference in Paris, on Thursday, said that Nigeria is completely different from how it is being perceived internationally and that he is yet to see any country that is more liberal than Nigeria in granting access to information by the media, even among the developed countries.\nMeanwhile, news of maltreatment of Nigerians by Indian authorities has been making headlines all year.\nOn Thursday a new video emerged, showing Nigerians protesting in front of the Nigeria High Commission in New Delhi against police brutality, they began by singing the national anthem."
  },
  {
    "headline": "Belarus Moves Migrants and Refugees Away from Polish Border",
    "summarized_story": "Belarusian state media reports that migrants and refugees were moved into a heated warehouse not far from the border.\nThousands of refugees and migrants have tried to reach the European Union via Belarus since the summer.\nBelarusian state-run media reported on Thursday that many asylum seekers had moved into a heated warehouse not far from the border, emptying out a makeshift camp.\nAid groups have said at least 11 asylum seekers and refugees have died on both sides of the border since the crisis began earlier this year.\nAlongside Poland, fellow eastern EU member states Latvia and Lithuania have refused to accept asylum seekers and refugees aiming to enter the bloc via Belarus."
  },
  {
    "headline": "Dutch Football Quincy Promes Star Charged with Attempted Manslaughter",
    "summarized_story": "Dutch footballer Quincy Promes will be prosecuted for attempted manslaughter and assault over the stabbing of a family member last year.\nDutch national broadcaster NOS said Promes stabbed a relative just below the kneecap in front of several witnesses after an argument escalated into a scuffle.\nIn February this year, the footballer transferred to Russian Premier League club Spartak Moscow in a deal worth a reported €8.3m (£6.9m; $9.4m).\nHe has scored seven goals in 50 appearances for the Dutch national team since his debut in 2014.\nIn October this year, Dutch national coach Louis van Gaal said he wouldn’t select Promes for the team while until the criminal case against him was ongoing."
  },
  {
    "headline": "Austria to Go into Full Lockdown on Monday as Covid Surges",
    "summarized_story": "Days after Austria imposed a lockdown on the unvaccinated, it has announced a full national Covid-19 lockdown starting on Monday.\nHe was responding to record cases numbers and one of the lowest vaccination levels in Western Europe.\n“We don’t want a fifth wave,” said Mr Schallenberg after meeting the governors of Austria’s nine provinces at a resort in western Austria.\nSlovak Prime Minister Eduard Heger announced that what he called a lockdown for the unvaccinated would start on Monday, and the Czech government is also limiting access to a variety of services.\nGerman leaders have agreed to introduce restrictions for unvaccinated people in areas with high Covid hospital admissions that would affect 12 of Germany’s 16 states."
  }
]