[
  {
    "headline": "UEFA Champions League: Fixtures, players to look out for this week",
    "summarized_story": "The UEFA Champions League is back and by the end of Matchday 3 every team will have faced the three opponents in their section once.\nDouble century incomingIt is a rare occurrence to witness a player making his 100th appearance in UEFA club competition but two in one game?\nHowever, the weight of history is heavy on their shoulders – the Eagles have not beaten the German giants in any of their ten meetings in UEFA club competition.\nThe closest they came was in the 2015/16 quarter-final second leg where Thomas Müller helped his side draw 2-2 and progress.\nOminously for Jorge Jesus’ men, Müller needs one goal to become the eighth man to reach 50 in the Champions League."
  },
  {
    "headline": "Eid-el-Maulud: Pray for Nigeria’s well-being, Fintiri urges Muslims",
    "summarized_story": "Governor of Adamawa State, Ahmadu Fintiri, has urged Muslims to pray for Nigeria’s well-being as they observe Eid-el-Maulud, which marks the birthday of the Holy Prophet Mohammed.\nThis was contained in a statement titled, ‘𝐆𝐨𝐯𝐞𝐫𝐧𝐨𝐫 𝐅𝐢𝐧𝐭𝐢𝐫𝐢 𝐅𝐞𝐥𝐢𝐜𝐢𝐭𝐚𝐭𝐞𝐬 𝐖𝐢𝐭𝐡 𝐌𝐮𝐬𝐥𝐢𝐦𝐬 𝐎𝐧 𝐄𝐢𝐝-𝐞𝐥-𝐌𝐚𝐮𝐥𝐮𝐝: 𝐂𝐚𝐥𝐥𝐬 𝐅𝐨𝐫 𝐏𝐫𝐚𝐲𝐞𝐫𝐬’, released by the Press Secretary to the Governor, Humwashi Wonosikou.\nThe Governor charged Muslims to pray for the continued well being of the State and the nation in general.\nAccording to the statement, the Governor noted that leaders and citizens should give their all in the overall interest of Nigeria, despite the challenges facing the nation.\nThe statement partly read, “While wishing the Muslim Ummah a happy Maulud Nabiyya celebration, Governor Ahmadu Umaru Fintiri noted that the challenges facing the nation would better be confronted if such qualities were embibed by all."
  },
  {
    "headline": "RTEAN rebrands with induction of 8 former SUG leaders of LASU ― Officials",
    "summarized_story": "The Road Transport Employers Association of Nigeria (RTEAN) has inducted eight former students’ union leaders of the Lagos State University (LASU) into its body, as part of a rebranding effort of the association.\nThe induction took place during the inauguration of the LASU chapter of the association.\nIt lauded the association’s National President, Alhaji Musa Mohammed, for his efforts in ensuring that the association was sanitised at all times.\n“We want to commend the national president of the union for cleansing the system and giving student leaders, room to direct the affairs of chapels of the association.\nThe News Agency of Nigeria (NAN) reports that the inducted students’ union leaders were; Nurudeen Eniafe, Akamo Babatunde, Samuel Olalere, Macarthy Olatunji, Ayomide Bakare, Oladele Omotayo, Isaiah Kuku and Osho Oladele."
  },
  {
    "headline": "Eid-el-Maulud: Ugwuanyi calls for renewed faith in God, prayers",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State has felicitated with the Muslim faithful on this year’s commemoration of Eid-el-Maulud, calling on all Nigerians to renew their faith in God and intensify prayers for the country to surmount its challenges.\nIn his goodwill message, Gov.\nUgwuanyi urged Muslims and indeed all Nigerians to remain committed to the core values of the nation’s founding fathers so that the concerted efforts at sustaining the peace, unity and progress of the country will be fully actualized.\nREAD ALSO: Ugwuanyi promises full responsibility of welfare of only surviving child of deceased familyThe governor pointed out that the significance of Eid-el-Maulud anchored on love, sacrifice, obedience, tolerance and charity, as exemplified by the deeds and teachings of Holy Prophet Muhammad, is germane to the peaceful co-existence, unity and prosperity of Nigeria.\nUgwuanyi therefore wished all Nigerians a peaceful celebration as well as the guidance and blessings of the Almighty God."
  },
  {
    "headline": "Editors’ Conference on Security: Olorunyomi, Fashola, Monguno, Irabor, Kyari, govs confirm attendance",
    "summarized_story": "Other state governors expected at the event include Oluwarotimi Odunayo Akeredolu, (Ondo); Adegboyega Oyetola, and others.\nOther promoters are Nigeria Deposit Insurance Company (NDIC), Federal Inland Revenue Service (FIRS), and the Yobe State government.\n“A doyen of the media, Mr Ray Ekpu, would chair the opening session with Fashola and others, including President, Nigeria Union of Journalists (NUJ), Mr Chris Isiguzo, and foreign ambassadors giving goodwill messages.\n“The conference is to be rounded off in the evening with the induction of new fellows and members of the Guild,” the statement said.\nOver 300 editors and media owners – from print, broadcast stations, and online newspapers have registered for this year’s conference."
  },
  {
    "headline": "Goronyo Killings: Army Chief, Yahaya storms Sokoto, charges troops to redouble efforts against bandits",
    "summarized_story": "He commended Governor Tambuwal for his continuous support to the NA and urged him not to relent on his effort.\nHe commended the officers and soldiers of the Division for their commitment and urged them to redouble their efforts in the fight against banditry.\nThe COAS also visited the Sultan of Sokoto, His Eminence, Alhaji Dr Muhammad Sa’ad Abubakar, the III.\nHis Eminence, Alhaji Muhammad Sa’ad Abubakar assured the COAS of his continuous support to enable him to succeed in his mandate.\nThe COAS later visited frontline troops deployed at forwarding Operation Base Sabon Birnin and Isa, both in Sokoto state, to assess the security situation, following recent bandits’ attack on the communities."
  },
  {
    "headline": "Why price of cooking gas is rising — NPRA boss",
    "summarized_story": "Minister of State, Petroleum Resources, Timipre SylvaBy Obas Esiedesa, ABUJAMr. Farouk Ahmed, the Chief Executive Officer of Nigerian Midstream and Downstream Petroleum Regulatory Authority, NPRA, has attributed the rising cost of cooking gas to poor investment into the gas sector over the years.\nAhmed said this, on Monday, during his inauguration as CEO of NPRA, where Mr. Gbenga Komolafe was also inaugurated as the CEO of the Upstream Regulatory Commission.\nOn his part, Mr. Ahmed disclosed that the NPRA would urgently work with stakeholders to tackle the challenge of rising price of cooking gas.\nAhmed attributed the hike in price to poor investment into the gas sector over the years, saying with the abundance of gas, Nigeria should not struggle with gas supply.\nThe Minister said government expected exponential growth in the industry with the coming of the Petroleum Industry Act, PIA."
  },
  {
    "headline": "EndSARS: Falz gives new directive for procession at Lekki toll gate",
    "summarized_story": "Popular Nigerian rapper, Folarin Falana, popularly known as Fal,z has directed Nigerians to come out and participate in the #EndSARS Memorial Car Procession taking place on 20th October 2021.\nFalz, on his Instagram page, said there will be no protest but a procession of Nigerians through the Lekki tollgate in order to remember those who lost their lives on 20th October 2020 during the #EndSARS protest.\nHis post read: “We will never ever forget that Innocent Nigerian citizens waved flags and sang till they were shot at, injured, and killed.\n“We must never forget we are rolling up in cars tomorrow to drive through the tollgate.\nWe know their way, so a procession of cars is the safest option to minimize police harassment.”Falz assured those participating of safety in their cars."
  },
  {
    "headline": "Eid-el-Maulud: Live in peace, love – PDP chieftain urges Muslims",
    "summarized_story": "A chieftain of the Peoples Democratic Party (PDP) in Kaduna State, Mallam Mohammed Idris, on Tuesday urged Muslims in the state to live according to the preaching of the Islamic religionMallam Mohammed, who was the local government chairman in Giwa Local Government Area of Kaduna State in 2015, and member, Kaduna State House of Assembly in 2018, noted that it is only when Muslims obey the dictate and teaching of prophet Mohammed, will there be peace, love for mankind.\nAccording to him, “The pretenders of Islam will not inherit the His kingdom.\nIf there is love, there will be no kidnapping, payment of ransom and killings as it happens in the state today.”Mohammed, in a statement on Tuesday to mark the Eid-el-Maulud celebrations in Kaduna, felicitated Muslims on the occasion of the commemoration of the birth of Holy Prophet Mohammad.\nHe further urged all Muslims in the state to join Nigerians to reflect deeply on the role they could play individually and collectively to build a nation they would be proud of.\nHe equally appealed to residents of the state to always embrace dialogue in settling differences and reject attempts by unpatriotic individuals or groups to incite unrest which was always counter-productive."
  },
  {
    "headline": "EndSARS: Seek strict adherence to democratic ideals – LCCI urges leaders",
    "summarized_story": "The Lagos Chamber of Commerce and Industry (LCCI) has urged leaders in sub-Saharan Africa to embrace the rule of law and democratic ideals to forestall political unrest.\nShe spoke against the backdrop of the one-year anniversary of #EndSARS protests which impacted negatively on businesses across the country.\nAlmona added that bad governance, a forceful takeover of government and extended stay in office might continue to instigate violent protests that disrupt business operations.\nThis figure, Almona said, was equivalent to 11.6 percent of the world’s economic activity or $1,942 per person.\n“In 2020, the world witnessed almost 15,000 violent protests and riots."
  },
  {
    "headline": "Striking SSANU workers denied access to Taraba varsity facilities",
    "summarized_story": "The wrangling in the Taraba State University has taken a different dimension as the striking non-academic staff was denied access to the school facilities.\nAmong the numerous injustice they alleged are being meted out on them by both the school management and the state government include selective payment of both promotion arrears and others.\nDisplaying various inscriptions in placards, they asked the school authorities to cease running the institution as a private university.\nVisibly dejected by the “ill attitudes” of the school management to the members, Williams said “as you can see, we are under a tree.\nBoth the school registrar, Professor Joseph Bibino, and the school spokesperson, Mallam Sanusi Sa’ad, declined comment on the matter."
  },
  {
    "headline": "Troops neutralise 20 terrorists in Borno",
    "summarized_story": "Troops of the Joint Task Force, North East Operation Hadin Kai (OPHK), have eliminated 20 Boko Haram/Islamic State of West Africa Province (ISWAP) terrorists at Chabbal area in Jere Local Government Area of Borno.\nMusa said that the terrorists mounted several gun trucks in coordinated attack through the agrarian community at about 7:00 pm and started shooting sporadically.\nHe said that the troops who were on alert about the movement of the terrorists repelled the attack, killing 16 terrorists in the encounter.\n“Four more terrorists wounded during the gunfight were discovered dead this morning, which brings the total number of those killed to 20,” he added.\nWhile commending the troops for their gallantry, Musa urged them to sustain the tempo to ensure the total elimination of the terrorists."
  },
  {
    "headline": "Nigeria glad US is back on climate change agenda—Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo says Nigeria was delighted that the US was fully back on the global climate change agenda.\nThe vice president said the move was a commendable restoration of the US government’s support for the Paris Agreement.\n“We are happy that the US is fully on board with climate change and back to the table on this issue.\nI think one has to commend the drive that this US administration has put behind climate change”, Osinbajo said.\nFour years ago, President Donald Trump’s administration had announced US withdrawal from the Paris Agreement on climate change."
  },
  {
    "headline": "Cross: I had genuine feelings for Saskay, Angel",
    "summarized_story": "BBNaija Shine ya Eye party rocker Cross has revealed that he had genuine and true feelings for Saskay and Angel while in the House.\nCross admitted developing true feelings for the two female ex-housemates at a different time of the show.\n“There was a time I had more than cruise but true feelings with Saskay and Angel.\n“So, I pretty much-developed feelings for both of them at different times while in the House.”- Advertisement -Cross further described Saskay and Angel as two different people with amazing personalities.\nWhitemoney won the show and claimed the N90million grand prize for the sixth edition of the reality TV show tagged Shine Ya Eye."
  },
  {
    "headline": "Only time will tell if I will end up with Angel – Cross",
    "summarized_story": "Only time will tell if I will end up with Angel – CrossBBNaija Shine Ya Eye finalist, Cross has opened up on his relationship with fellow finalist, Angel in an exclusive chat with The Nation Newspaper.\n29-year-old Cross said only time will tell if he will end up in a romantic relationship with Angel or not citing distractions and other life variables as determinant factors.\n“I can’t really tell you how much of that now because that house was limited.\nIf we had stayed longer than a year, maybe, maybe not.\n“I don’t know if we will go further than being just friends but now we are outside and there are many distractions."
  },
  {
    "headline": "Full list of amended charge FG filed against Nnamdi Kanu",
    "summarized_story": "C77, Laws of the Federation of Nigeria, 2004.\n*Count Three- Advertisement -That you Nnamdi Kanu, male adult of Afaraukwu lbeku Umahia North Local Government Area of Abia State between the month of March and April 2015 imported into Nigeria and kept in Ubulusiuzor in Ihiala Local Government Area of Anambra state within the jurisdiction of this Honourable Court , a Radio transmitter known as TRAM 50L concealed in a container of used household which you declared as used household items and you thereby committed an offence contrary to Section 47 (2) of the Criminal Code of Act ,Cap C45, Laws of the Federation of Nigeria, 2004.\n*Count four- Advertisement -That you Nnamdi Kanu, male, adult.\nof Afaraukwu iIbeku, Umuahia North Local Government Area of Abia State in London, United Kingdom between 2018 and 2021 Radio Biafra monitored in Enugu, Enugu State and FCT, Abuja within the jurisdiction of this Honourable Court, professed to be a member of Indigenous People of Biafra (IPOB), a proscribed organisation in Nigeria and you thereby committed an offence punishable under Section 16 Terrorism Prevention Amendment Act, 2013.\n*Count sixThat you Nnamdi Kanu, male, adult, of Afaraukwu Ibeku, Umuahia North Local Government Area of Abia Stale on the 16thh of May, 2021, in London, United Kingdom within the jurisdiction of this Honourable Court did commit an act in furtherance of an act of terrorism by making a broadcast that “In 2 weeks’ time, what will happen will shake the world, people will die, the whole world will stand still, mark my word” and you thereby committed an offence contrary to and punishable under Section 1 (2) (b) of the Terrorism Prevention Amendment Act, 2013."
  },
  {
    "headline": "Gunmen kill 30 in Sokoto market",
    "summarized_story": "From Tunde Omolehin SokotoSuspected armed bandits reportedly carried out twin attacks on Onion markets in Goronyo and Isa Local Government Areas (LGAs) of Sokoto State, on Sunday.\nSources in the village said the assailants attacked the market in large numbers and started shooting sporadically leading to the death of several people.\nTwenty persons were also killed by suspected bandits at Ungwan Lalle market of Sabon Birni local government area of Sokoto state.\nThe Sokoto state government had earlier ordered the closure of markets in the Eastern Senatorial District of the state as a measure to fight the rising insecurity brewing in the state.\nThe state governor, Aminu Waziri Tambuwal, while receiving the Chief of Army Staff, Lt. General Faruk Yahya, during a courtesy visit, yesterday, confirmed the attack on Goronyo market."
  },
  {
    "headline": "Marwa advocates drug test for politicians, students, others",
    "summarized_story": "By Cecilia OlogunagbaChairman of the National Drug Law Enforcement Agency (NDLEA), Brig.-Gen. Buba Marwa (retd), has recommended integrity drug tests as a requirement for all politicians seeking public office and public office holders.\nMarwa told the News Agency of Nigeria (NAN) in New York that the idea behind the call for the test “is to reduce the prevalence of drug abuse” in the country.\nThe test will help us know those that need help early enough before it gets worse.\n“Since in Nigeria we go for genotype test, we do HIV test before marriage, voluntarily, why can’t we add drug test in the list, so that it will further propel reduction in the prevalence?\nHe said the NDLEA had been partnering relevant agencies in its fight against drug abuse, urging parents to rise up to the challenge of sensitising their children against the danger of drug abuse."
  },
  {
    "headline": "AfreximBank loans to Nigeria rise to $5.5bn",
    "summarized_story": "By Chinwendu ObienyiTotal loan approvals to Nigeria from Afreximbank has now risen to N5.5billion representing 26.8 per cent of its African portfolio.\nThis was even as it gave approval to $1.89billion in the last eight 8 months.\nThe Executive Vice President, Corporate Governance and Legal Services at Afreximbank, Dr George Elombi, disclosed this during the intra-African Trade Fair 2021 official Nigeria high level roadshow which held in Lagos on Monday.\nHe noted that Afreximbank being the organiser of the Intra-African Trade Fair in Durban, has supported and facilitated trade and investments in Nigeria through its array of financial and non-financial instruments.\n“From January to August 2021, total loan approvals for Nigeria were in excess of $1.89 billion and at the end of August 2021, the bank’s total loans exposure to Nigeria was $5.5 billion, representing 26.8 per cent share of the bank’s total loans and advances.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Olorunyomi, Fashola, Monguno, Irabor, Kyari for editors’ security confab",
    "summarized_story": "Other promoters are Nigeria Deposit Insurance Company (NDIC), Federal Inland Revenue Service (FIRS) and the Yobe State government.\nOlorunyomi, an accomplished internationally acclaimed investigative journalist and journalism teacher, would give the keynote address that would be discussed by security chiefs, including Monguno; Irabor; Director-General, Department of State Services (DSS), Mr. Yusuf Bichi and the Inspector-General of Police, Mr. Usman Baba.\n“A doyen of the media, Mr. Ray Ekpu, would chair the opening session with Fashola and others, including President, Nigeria Union of Journalists (NUJ), Mr. Chris Isiguzo, and foreign ambassadors giving goodwill messages.\nNoted broadcaster, Ms. Kadaria Ahmed, would chair the session’’, the statement added.\nOver 300 editors and media owners – from print, broadcast stations and online newspapers have registered for this year conference."
  },
  {
    "headline": "Eid-Ul-Maulud: Buhari lists gains of combating insecurity",
    "summarized_story": "In a message to mark the Eid-ul-Maulud celebration issued by Garba Shehu, presidency spokesman, Buhari said it was time the media revised the prefixes “rising insecurity” with “declining insecurity” as security agencies were effectively responding to the challenges across the country.\n“The reality of declining insecurity should replace the inaccurate narrative of rising insecurity in the country.\nIn a goodwill message to Nigerians especially Muslims, he admonished the muslim community to uphold the exemplary life of Prophet Muhammad.\nHe specifically urged the Muslims and other religious groups to intensify prayers for needed reforms for a better Nigeria.\n•Ekweremadu: Be brother’s keeperFormer deputy senate president, Ike Ekweremadu (PDP-Enugu), urged Nigerians to close ranks and be their brother’s keeper to move the nation forward."
  },
  {
    "headline": "Buhari, Obasanjo, Jonathan, Akinyemi Mourn Powell, Commiserate with US Govt",
    "summarized_story": "In a statement by his Special Assistant on Media, Kehinde Akinyemi, Obasanjo said, “General Powell’s tenure in office marked a significant departure from the traditional relations between Africa and the United States.\n“He was Secretary of State under the administration of President George W. Bush, Jnr, part of the time I was President of Nigeria.\nHis articulation of the Powell Doctrine gave the United States, and the world at large, a new paradigm for engaging in military action with honour and decorum.\nAkinyemi said he had argued then that there could be circumstances when only overwhelming force could win a war (a sort of Colin Powell doctrine).\nBoth Arise Magazine and the Africa Rising Festival, ultimately gave rise to the fast rising television station of global standard, Arise News Channel."
  },
  {
    "headline": "Bandits Massacre 40 in Sokoto Market, Buhari Declares Total War",
    "summarized_story": "But in Kaduna State, security forces reportedly killed 10 bandits in Kwanan Bataru, Giwa Local Government Area.\nHe argued that the reality of declining insecurity should replace the inaccurate narrative of rising insecurity in the country.\nOne of the sheds used by the bandits to hold hostages was burnt.”Bandits Attack Sokoto Sunday Market, Kill 40No fewer than 40 people were killed as suspected bandits attacked a market in Goronyo Local Government Area of Sokoto State.\nSuspected bandits also killed 20 persons at Ungwan Lalle market, in Sabon Birni Local government Area of Sokoto State.\nThe Sokoto State government had earlier ordered the closure of markets in the Eastern Senatorial District of the state as a measure to fight the rising insecurity in the state."
  },
  {
    "headline": "Upstream Commission, Midstream/Downstream Authority Formally Begin Operations",
    "summarized_story": "The development signaled the official winding up of three agencies which they succeeded as prescribed by the Petroleum Industry Act (PIA).\nHe explained that after a rigorous screening process and the issuance of letters of appointment to the new chief executives, both regulatory agencies have now taken off with competent leadership.\nIt also repeals the DPR Act, the Petroleum Inspectorate Act and the Petroleum Equalisation Act and the PPPRA Act.\nThe authority has staffing coming from the defunct PEF, PPPRA and the DPR and of course the commission staff will come from the DPR.\nThis will lead to industrialisation, job creation and our main focus is to attract investment in gas."
  },
  {
    "headline": "Colin Powell, Former US Secretary of State, Dies of Covid Complications",
    "summarized_story": "By Michael Olugbode in Abuja with Agency reportCOVID-19 took one of its greatest casualties with the death of former US Secretary of State Colin Powell who according to his family died aged 84 of the pandemic complications.\nPowell was a former top military officer who rose to become the first African-American secretary of state in 2001 under Republican George W Bush.\nA statement from the family said: “We have lost a remarkable and loving husband, father, grandfather and a great American.\nThe statement said that Powell had been fully vaccinated against COVID-19.\nIt’s painful now,” Mr Powell told ABC News in 2005."
  },
  {
    "headline": "WSJ: How Nigerian Military Bought Back Anti-aircraft Gun from Kidnapping Gang",
    "summarized_story": "The report alleged that kidnapping gangs that encamped in Nigeria’s Rugu forest had seized the anti-aircraft gun during a clash with a military unit.\nWSJ further alleged that over several months, the militant leader had agreed to part with the truck-mounted 12.7 millimetre anti-aircraft gun in exchange for the ransom.\nThe Nigerian Police last month said they arrested three suspects in the kidnapping of students from Bethel Baptist School in Kaduna State.\nThe Nigerian military opened a new offensive last month, bombarding forest encampments with airstrikes from US-delivered jet fighters.\nEventually, WSJ said, the bandits strapped the antiaircraft gun across two motorbikes and began to wheel it out of the camp."
  },
  {
    "headline": "Oyo Governor Splashes Millions Of Naira On Cars For Party Leaders Amidst Plot To Impeach His Deputy",
    "summarized_story": "He also used the occasion to urge other governors in the country to emulate the uniqueness of Governor Makinde.\nSee Also Exclusive EXCLUSIVE: Plot To Impeach Oyo Deputy Governor Advances, Governor Makinde To Discuss Move With Oyo Lawmakers In Ghana“In their various reactions, the duo of Hon.\nJust last weekend, a petrol station and bakery belonging to the Deputy Governor were vandalised in Ibadan.\nHe hails from Igboho, one of the numerous towns in Okeogun, the second-largest geo-political zone in Oyo State, after Ibadan, the state capital.\n“Governor Makinde initially wanted to fulfil his promise but was soon misled by the likes of Alleluyah and co."
  },
  {
    "headline": "Oyo Governor Splashes Millions Of Naira On Cars For Party Leaders Amidst Plot To Impeach His Deputy",
    "summarized_story": "He also used the occasion to urge other governors in the country to emulate the uniqueness of Governor Makinde.\nSee Also Exclusive EXCLUSIVE: Plot To Impeach Oyo Deputy Governor Advances, Governor Makinde To Discuss Move With Oyo Lawmakers In Ghana“In their various reactions, the duo of Hon.\nJust last weekend, a petrol station and bakery belonging to the Deputy Governor were vandalised in Ibadan.\nHe hails from Igboho, one of the numerous towns in Okeogun, the second-largest geo-political zone in Oyo State, after Ibadan, the state capital.\n“Governor Makinde initially wanted to fulfil his promise but was soon misled by the likes of Alleluyah and co."
  },
  {
    "headline": "BREAKING: Nigerian Government Files Seven-Count Amended Charge Against IPOB Leader, Nnamdi Kanu",
    "summarized_story": "The Nigerian government has filed a seven-count amended charge against the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, three days to his appearance in court.\nNnamdi KanuThe IPOB leader will be re-arraigned before trial Justice Binta Nyako on Thursday.\nSaharaReporters had on October 15 reported that Ifeanyi Ejiofor, the lead counsel to Kanu, stated that he (Kanu) enjoined IPOB followers to proceed on a fast ahead of his trial on October 21.\nHence, no plausible excuse will be available to them not to produce Onyendu Mazi Nnamdi Kanu in court come Thursday, the 21st Day of October 2021.\n“Our Client - Onyendu Mazi Nnamdi Kanu urges millions of his followers and supporters to continue to conduct themselves and carry on within the ambit of the laws, as you all have always done."
  },
  {
    "headline": "BREAKING: Nigerian Government Files Seven-Count Amended Charge Against IPOB Leader, Nnamdi Kanu",
    "summarized_story": "The Nigerian government has filed a seven-count amended charge against the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, three days to his appearance in court.\nNnamdi KanuThe IPOB leader will be re-arraigned before trial Justice Binta Nyako on Thursday.\nSaharaReporters had on October 15 reported that Ifeanyi Ejiofor, the lead counsel to Kanu, stated that he (Kanu) enjoined IPOB followers to proceed on a fast ahead of his trial on October 21.\nHence, no plausible excuse will be available to them not to produce Onyendu Mazi Nnamdi Kanu in court come Thursday, the 21st Day of October 2021.\n“Our Client - Onyendu Mazi Nnamdi Kanu urges millions of his followers and supporters to continue to conduct themselves and carry on within the ambit of the laws, as you all have always done."
  },
  {
    "headline": "Lagos Panel Ends Sitting Two Days To #EndSARS Memorial Protest",
    "summarized_story": "The Lagos State judicial panel probing cases of human rights abuses by officials of the Special Anti-Robbery Squad and other related matters in the state has ended its sitting.\nThe panel, which ought to have ended its sitting on Tuesday, October 19, 2021, had its final sitting on Monday due to the public holiday scheduled for tomorrow.\nIt was earlier reported that the panel awarded N148.2million as compensation to 23 more petitioners as it wound down proceedings after sitting for a year since the inauguration on October 19, 2020.\nDuring the Lekki shooting, Justice Doris Okuwobi (rtd) said though evidence had been concluded on the matter, the panel was yet to write out its final decision.\nShe assured the petitioners that the panel would ensure justice in the matter."
  },
  {
    "headline": "Like PiggyVest, The Elevation Church denies investing N500m in Imagine Global",
    "summarized_story": "The Elevation Church (TEC), a non-denominational Christian ministry, says it did not invest in Imagine Global Solutions Limited, a lending company.\nReports had alleged that one Bamise Ajetumobi and Elizabeth Ajetunmobi, his wife, founders of Imagine Global, fled with billions of naira belonging to their investors.\nAdvertisementSimilarly, PiggyVest, an online savings platform, was linked to Imagine Global — but the company swiftly denied the reports.\nThey emphasised that the church has no business interest or any investment whatsoever in Imagine Global.\nThe Elevation Church has no such investment, whatsoever.”"
  },
  {
    "headline": "Like PiggyVest, The Elevation Church denies investing N500m in Imagine Global",
    "summarized_story": "The Elevation Church (TEC), a non-denominational Christian ministry, says it did not invest in Imagine Global Solutions Limited, a lending company.\nReports had alleged that one Bamise Ajetumobi and Elizabeth Ajetunmobi, his wife, founders of Imagine Global, fled with billions of naira belonging to their investors.\nAdvertisementSimilarly, PiggyVest, an online savings platform, was linked to Imagine Global — but the company swiftly denied the reports.\nThey emphasised that the church has no business interest or any investment whatsoever in Imagine Global.\nThe Elevation Church has no such investment, whatsoever.”"
  },
  {
    "headline": "NCC warns subscribers: Don't link your SIM cards to another person's NIN",
    "summarized_story": "The Nigerian Communications Commission (NCC) has warned Nigerians not to link their National Identification Numbers (NINs) to another person’s Subscriber Identity Module (SIM) cards.\nSpeaking during the radio programme focused on ‘the Benefits of NIN-SIM Integration’, Efosa Idehen, NCC’s director, consumer affairs bureau, said telecom consumers should not allow another use their NINs to register on another person’s SIM.\nIdehen said compliance would protect the owner of the NIN from any liabilities or negative consequences arising from the use of another person’s SIM.\nAdvertisementThe statement added that Efosa was joined in the studio by NCC’s director, public affairs, Ikechukwu Adinde, represented by Omoniyi Ibietan, assistant Director in the department and Nnenna Ukoha, deputy director, projects department of NCC.\nThe NCC said the deadline for NIN-SIM integration is still October 31, 2021."
  },
  {
    "headline": "NCC warns subscribers: Don't link your SIM cards to another person's NIN",
    "summarized_story": "The Nigerian Communications Commission (NCC) has warned Nigerians not to link their National Identification Numbers (NINs) to another person’s Subscriber Identity Module (SIM) cards.\nSpeaking during the radio programme focused on ‘the Benefits of NIN-SIM Integration’, Efosa Idehen, NCC’s director, consumer affairs bureau, said telecom consumers should not allow another use their NINs to register on another person’s SIM.\nIdehen said compliance would protect the owner of the NIN from any liabilities or negative consequences arising from the use of another person’s SIM.\nAdvertisementThe statement added that Efosa was joined in the studio by NCC’s director, public affairs, Ikechukwu Adinde, represented by Omoniyi Ibietan, assistant Director in the department and Nnenna Ukoha, deputy director, projects department of NCC.\nThe NCC said the deadline for NIN-SIM integration is still October 31, 2021."
  },
  {
    "headline": "DPR, PEF, PPPRA scrapped as FG inaugurates two regulatory agencies",
    "summarized_story": "The federal government has scrapped the Department of Petroleum Resources (DPR), Petroleum Products Pricing Regulatory Agency (PPPRA) and the Petroleum Equalisation Fund (PEF).\nAdvertisementAs specified by the Petroleum Industry Act (PIA), two regulatory agencies are to perform the duties of the defunct DPR, PPPRA and PEF.\nThe new agencies are the Nigerian Upstream Regulatory Commission (NURC) and the Nigerian Downstream and Midstream Petroleum Regulatory Authority (NMDPRA).\n“And, of course, the law specifically repeals the DPR Act, the Petroleum Inspectorate Act, the Petroleum Equalisation Fund Act and the PPPRA Act.\nIt is very clear that those agencies do not exist anymore.”AdvertisementThe minister disclosed that staff rationalisation is ongoing, explaining that NMDPRA staff would come from the defunct PEF, PPPRA and DPR, while NURC staff will come from DPR."
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "“We weren’t motivated to become a unicorn”: Wave’s West Africa head reflects on startup’s rapid growth",
    "summarized_story": "Coura: In the early days, we were just a bunch of people who were passionate about building a better mobile money service.\nIn those early days, we had so many iterations and did many pilot tests before we actually launched our mobile money service.\nSecondly, we’ve seen high user adoption thanks to our simple, easy-to-use, and highly adapted mobile money product.\nThey are pro-innovation and pro-technology and were willing to support us in our mission to transform mobile money for the better.\nCoura: Africa’s mobile money market is gigantic!"
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "Why Nigerian neobank, Sparkle, preferred local investors in $3.1m funding",
    "summarized_story": "Sparkle, a mobile-based digital bank that provides a combination of financial, lifestyle, and business support services to Nigerians, on Thursday, announced a $3.1 million seed fundraise from entirely Nigerian investors.\nThe latest funding brings Sparkle’s total investment secured to $5.1 million, having previously raised $2 million in pre-seed from friends and family.\n“They all understand the real need for a digital-first platform such as Sparkle.”Get the best African tech newsletters in your inboxIt’s not common in the Nigerian tech ecosystem that a funding round of such value comprises only local investors.\nAccording to Dozie, the Sparkle team was “very deliberate” about having an all-Nigerian round as it always felt that having a selection of strategic local investors would be beneficial to the startup’s growth.\nWe wanted to make sure our investors really understood the market before committing to this round,” he told TechCabal."
  },
  {
    "headline": "Eid-El-Maulud: Obaseki harps on tolerance, peaceful coexistence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I join our Muslim brothers and sisters in Edo State in celebrating the birth of Prophet Mohammed (S.A.W.)\nThe Eid-El-Maulud celebration offers us the opportunity to ponder on the importance of peaceful coexistence and tolerance.\nThe spirit of the Eid-El-Maulud celebration should guide us in working together and with a common drive to build strong coalitions that will entrench development and progress in our state.\nI reassure the Muslim faithful that our administration remains committed to ensuring the welfare and peaceful co-existence of all residents.\nGodwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo, APOI, other stakeholders validate guidelines to drive investment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To sustain a friendly business environment and capital inflows, the Edo State Government has engaged Africa Palm Oil Initiative (APOI), Proforest and other stakeholders to develop and validate the Free Prior Informed Consent (FPIC) guidelines so as to improve investors’ confidence.\n“The law would boost the confidence of investors and communities to ensure that they know what it requires to secure investment in the state,” he noted.\n“When the document is passed into law, investors would now have the confidence to come in knowing exactly what to do to stake their investment.\nThe FPIC law will also let them know the role of government and what it will do to back their investment in terms of profitability as no investors will be able to cut corners when it comes to investment in Edo State.\n“We really want to have a situation where the communities, local and state governments will work in harmony, as stipulated in the FPIC documents.”..."
  },
  {
    "headline": "Edo police mobilize 3,000 personnel for Eid-Maulud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Edo Police Command has said that it had deployed over 3,000 personnel to provide adequate security for lives and property before, during and after today’s Eid-El Maulud in the state.\nThe command assured that security had been beefed up around mosques and event centres across Edo State.\nThis was made known in a press release signed by the command Public Relations Officer SP Kontongs Bello and made available to journalists in Benin City.\nThe statement wishes Muslim faithful a happy Eid-El Maulud, it however enjoined them to celebrate within the armpit of the law and relevant COVID-19 protocols.\nIt however urged anyone in distress to call Edo State Police Command Control Room through the following numbers: 08037646272, 08123827225, 08056776365 and 08077773721."
  },
  {
    "headline": "World Food Day: Obaseki urges innovation to tackle food security, assures more support for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for innovations to tackle all challenges threatening food sufficiency, ensuring farmers and other stakeholders in the agricultural value chain increase agricultural productivity and achieve food security.\nObaseki gave the charge in commemoration of World Food Day, marked yearly by the Food and Agriculture Organisation (FAO), and other organs of the United Nations (UN).\nSpeaking on the theme of this year’s World Food Day, ‘Our actions are our future’, Obaseki called on everyone to be a food hero contributing to the transformation of agri-food systems and ensuring enough food for the global population.\nA similar intervention programme was undertaken in Warrake Community, Owan East Local Government Area on a 500ha farmland.\n“In Usugbenu, Ugboha and Sobe communities in Esan Central, Esan Southeast and Owan West, respectively, we empowered 1,500 farmers on the production of maize."
  },
  {
    "headline": "How bandits negotiated multi-million naira ransom for release of Zamfara monarch",
    "summarized_story": "Armed bandits collected a multi-million naira ransom before they released the Emir of Bungudu in Zamfara State, Hassan Attahiru, family sources have said.\nThe bandits successfully negotiated the ransom with emirate officials despite the shutdown of telecommunications in the state.\n“Then, communication between the ransom bearer and the bandits broke with the bandits’ phone numbers no longer accessible, so the ransom bearer returned to Kaduna with the money.\n“When the ransom bearer moved further into the forest, he was asked to park his motorcycle at a certain place.\nN20 million not enoughThe source said after collecting N20 million from the ransom bearer, the kidnappers refused to release the monarch, demanding more money."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Maulud Nabbiy: Balogun Musulumi, Oyebamiji Felicitate With Muslim Ummah",
    "summarized_story": "By Sunday Oguntuyi OsogboAs Muslims all over the world celebrate the birth of the Holy Prophet Muhammad (SAW) otherwise known as Maulud Nabbiy, the Balogun Musulumi of Irewole/Ayedaade/Isokan Federal Constituency, Alhaji Bola Oyebamiji, has urged Muslims to embrace peace and unity at all times.\nAlhaji Oyebamiji who is also the Osun Commissioner for Finance gave the advice in a message of felicitation to the Muslim Ummah on the occasion of the celebration of the birth of the Holy Prophet.\nHe urged Muslims in Irewole/Ayedaade/Isokan Federal Constituency to imbibe the selfless spirit and tolerance of the Holy Prophet in their daily affairs and leave in peace with one another to create a better society.\n“This is what he lived for and it was manifest in his daily teachings.\nThe best way to celebrate his birthday is to display what he stood for, which is love, tolerance and harmony, he stated.”"
  },
  {
    "headline": "Oxford University appoints Kingsley Moghalu Academic Visitor",
    "summarized_story": "The University of Oxford, United Kingdom has appointed Prof. Kingsley Moghalu, a former Deputy Governor of the Central Bank of Nigeria and a presidential candidate of the Young Progressive Party in the 2019 presidential election, as an Academic Visitor.\nAs an academic visitor, Moghalu would deliver lectures on political economy, lead a seminar on the Nigerian economy, and complete work on two forthcoming books.\nMoghalu was a Professor of Practice in International Business and Public Policy at The Fletcher School at Tufts University, USA.\ndegree at the University of Nigeria, Nsukka, an M.A.\nat The Fletcher School at Tufts University, and a Ph.D. in International Relations at the London School of Economics, and is the author of four published books."
  },
  {
    "headline": "Nigerian Govt Takes Delivery Of Final Batch Of Tucano Jets From U.S.",
    "summarized_story": "Nigeria’s Federal Government says it has taken delivery of the final batch of the 12 A-29 Super Tucano fighter jets expected from the United States.\n“All the 12 Super Tucano fighter jets have been received.\nAs at this morning, all the 12 were here and they have been deployed to the North-East.\n“We can see that the Tucano jets are actually game changer.\n“Most of the successes we’ve recorded in recent time is because of the acquisition of the new platforms, not limited to the super Tucano,’’ he said."
  },
  {
    "headline": "Nigerian says its soldiers killed eight ISWAP/Boko Haram terrorists in Borno",
    "summarized_story": "At least eight terrorists of the Islamic State West Africa (ISWAP) and Boko Haram have been killed in an encounter with troops of Operation Hadin Kai, Nigeria’s counter terrorism operation in Borno State, North-east.\nArmy spokesperson, Brig Gen. Onyema Nwachukwu, who disclosed this in a statement on Monday, said the eight terrorists died during two different operations.\nThe first incident took place on Monday at the Forward Operating Base (FOB) Wulgo, Borno state.\nThe second took place around 151 Battalion location where their gun truck ran over a Vehicle Improvised Explosive Device.\n“In another development, four ISWAP/BHTs terrorists have met their waterloo same date, around 151 Battalion location."
  },
  {
    "headline": "Nigeria Lauds US Govt’s U-Turn On Climate Change",
    "summarized_story": "Nigeria is glad that the Biden administration is fully back on board the Climate Change global agenda, in a commendable restoration of the US government’s support for the Paris Agreement, according to Vice President Yemi Osinbajo (SAN).\nIn a statement by Osinbajo’s media aide, Laolu Akande, Prof. Osinbajo said: “we are happy that the US is fully on board with climate change and back to the table on this issue.\nI think one has to commend the drive that this US administration has put behind climate change.”Recall that four years ago, the Trump administration had announced the US withdrawal from the Paris Agreement on climate change mitigation issues.\nBut on assumption to power earlier this year, the Biden administration announced the restoration of America’s commitment to the Paris Agreement.\nRegarding the Democracy Summit President Joe Biden would be hosting later in the year, the VP stated that Nigeria looks forward to participating at the summit."
  },
  {
    "headline": "Nigeria Lauds US Govt’s U-Turn On Climate Change",
    "summarized_story": "Nigeria is glad that the Biden administration is fully back on board the Climate Change global agenda, in a commendable restoration of the US government’s support for the Paris Agreement, according to Vice President Yemi Osinbajo (SAN).\nIn a statement by Osinbajo’s media aide, Laolu Akande, Prof. Osinbajo said: “we are happy that the US is fully on board with climate change and back to the table on this issue.\nI think one has to commend the drive that this US administration has put behind climate change.”Recall that four years ago, the Trump administration had announced the US withdrawal from the Paris Agreement on climate change mitigation issues.\nBut on assumption to power earlier this year, the Biden administration announced the restoration of America’s commitment to the Paris Agreement.\nRegarding the Democracy Summit President Joe Biden would be hosting later in the year, the VP stated that Nigeria looks forward to participating at the summit."
  },
  {
    "headline": "Rights Abuse: El-Zakzaky Slams N2bn Suit On AGF, DSS",
    "summarized_story": "Leader of the Islamic Movement of Nigeria, Sheikh Ibraheem El-Zakzaky, has filed a suit against the Department of State Services (DSS) and the attorney-general of the federation and minister of Justice, wherein he is demanding the sum of N2 billion as general and exemplary damages.\nSpecifically, El-Zakzaky sued the AGF and DSS over the refusal of the federal government to release his international passports.\nThe fundamental rights enforcement suit was filed at the Federal High Court Abuja, by El-Zakzaky’s lawyer, Femi Falana.\nMore so, the plaintiff is praying the court to grant a perpetual injunction restraining the respondents from further violating his rights.\nADVERTISEMENTThe Shiites’ leader wants the court to declare that the refusal of the DSS and the AGF to allow him to travel abroad for medical treatment constituted a threat to his life as guaranteed by Section 33 of the 1999 Constitution as amended."
  },
  {
    "headline": "Rights Abuse: El-Zakzaky Slams N2bn Suit On AGF, DSS",
    "summarized_story": "Leader of the Islamic Movement of Nigeria, Sheikh Ibraheem El-Zakzaky, has filed a suit against the Department of State Services (DSS) and the attorney-general of the federation and minister of Justice, wherein he is demanding the sum of N2 billion as general and exemplary damages.\nSpecifically, El-Zakzaky sued the AGF and DSS over the refusal of the federal government to release his international passports.\nThe fundamental rights enforcement suit was filed at the Federal High Court Abuja, by El-Zakzaky’s lawyer, Femi Falana.\nMore so, the plaintiff is praying the court to grant a perpetual injunction restraining the respondents from further violating his rights.\nADVERTISEMENTThe Shiites’ leader wants the court to declare that the refusal of the DSS and the AGF to allow him to travel abroad for medical treatment constituted a threat to his life as guaranteed by Section 33 of the 1999 Constitution as amended."
  },
  {
    "headline": "Court Resumes Nnamdi Kanu’s Trial October 21",
    "summarized_story": "Federal High Court, Abuja has issued a trial notice for the October 21 prosecution of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, in the treasonable felony charges brought against him by the federal government.\nThe trial notice entitled “Federal Republic of Nigeria Versus Nnamdi Kanu” was marked FHC/ABJ/CR/383/15 and served on Kanu’s lawyer, Mr Ifeanyi Ejiofor and that of the federal government Mr Shuaib Labaran.\n“Parties desirous to enforce the attendance of witnesses should apply at once to the court to issue one or more summonses for the attendance of the witnesses required.\n“It is indispensable that the application should be made so as to allow time for reasonable notice to the witnesses required.\nADVERTISEMENT“The court may refuse to enforce the attendance of a witness unless such sum has been fixed and deposited in the court."
  },
  {
    "headline": "Pandora Papers: Nigerian judge, Stella Ogene secretly acquires London property with undeclared offshore company",
    "summarized_story": "In 2009, Mrs Ogene decided to venture into the London property market.\nTo acquire the property without being detected, Mrs Ogene hid behind a company tucked away offshore.\nWhen first contacted by telephone, Mrs Ogene made a flat denial of her link with the shell company, Assete Media Limited.\nThe London propertyHaving perfected the incorporation of a shell company in Seychelles, Mrs Ogene then entered the London property market.\nA judge as a lawbreakerIn incorporating Assete Media, apparently to secretly own a London property, Mrs Ogene tried to hide from law enforcers."
  },
  {
    "headline": "Pandora Papers: Nigerian judge, Stella Ogene secretly acquires London property with undeclared offshore company",
    "summarized_story": "In 2009, Mrs Ogene decided to venture into the London property market.\nTo acquire the property without being detected, Mrs Ogene hid behind a company tucked away offshore.\nWhen first contacted by telephone, Mrs Ogene made a flat denial of her link with the shell company, Assete Media Limited.\nThe London propertyHaving perfected the incorporation of a shell company in Seychelles, Mrs Ogene then entered the London property market.\nA judge as a lawbreakerIn incorporating Assete Media, apparently to secretly own a London property, Mrs Ogene tried to hide from law enforcers."
  },
  {
    "headline": "Alleged $8.4m Fraud Trial: Again, Fred Ajudua’s Lawyer Seeks Adjournment – Daylight",
    "summarized_story": "Ajudua allegedly defrauded a former Chief of Army Staff, Ishaya Bamaiyi, of $8.4m, while they both were in Kirikiri Prison, Lagos in 2004 for different offences.\nAt the resumed sitting today, the prosecution counsel, S.K.\n“From the records of the court, it appears the defence counsel has little or no time for this case.\nThe first prosecution witness has been in the witness box since November 6, 2018; and up until now, he hasn’t finished giving his evidence.\n“It is not proper that the defence counsel has to be the one fixing dates for this case”, he further submitted."
  },
  {
    "headline": "Alleged $8.4m Fraud Trial: Again, Fred Ajudua’s Lawyer Seeks Adjournment – Daylight",
    "summarized_story": "Ajudua allegedly defrauded a former Chief of Army Staff, Ishaya Bamaiyi, of $8.4m, while they both were in Kirikiri Prison, Lagos in 2004 for different offences.\nAt the resumed sitting today, the prosecution counsel, S.K.\n“From the records of the court, it appears the defence counsel has little or no time for this case.\nThe first prosecution witness has been in the witness box since November 6, 2018; and up until now, he hasn’t finished giving his evidence.\n“It is not proper that the defence counsel has to be the one fixing dates for this case”, he further submitted."
  },
  {
    "headline": "BREAKING: 1 Dead, 2 Rescued, 3 Trapped As Two-storey Building Collapses in Lagos [ PHOTOS]",
    "summarized_story": "A two-Storey building has collapsed in the Ikorodu area of Lagos State, News Direct can report.\nAccording to NEMA officials, one person has been confirmed dead while two persons have been rescued.\nThe official added that three other persons are currently trapped under the remains of the collapsed building.\nNEMA could not ascertain if anyone is dead as at press time.\nMeanwhile, rescue operation is ongoing as Labsca, NEMA, Police DMU, and LASEMA are already searching for the trapped peopleSee Photos Below"
  },
  {
    "headline": "Nigerian, Cameroonian Troops Eliminate Boko Haram-ISWAP Fighters As IED Kills Others",
    "summarized_story": "Four Boko Haram/ISWAP members have been killed by Nigerian forces from the Joint Task Force, North East Operation HADIN KAI (OPHK) and Cameroonian Defense Force.\nThe soldiers stopped an attempted attack on the military base, according to Brigadier General Onyema Nwachukwu, Director Army Public Relations.\nAfter the terrorists retreated, troops pursued them and killed three of them.\n“The terrorists were burnt beyond recognition, as their truck mounted with Anti Aircraft Guns ran over an Improvised Explosive Device (IED)”, Nwachukwu added.\nTroops are conducting further exploitation of the general area to clear surviving terrorists."
  },
  {
    "headline": "Goronyo Killings: No Hiding Place, Be Ready For Destruction — Buhari Sends Stern Warning To Bandits",
    "summarized_story": "President Muhammadu Buhari said in a stern warning to bandits, “The clock of your ultimate destruction is ticking as you will no longer have a place to hide.”Buhari said this in response to bandits killing over 30 persons in Goronyo, Sokoto State, on Sunday.\nGarba Shehu, the President’s Senior Special Assistant on Media and Publicity, said this in a statement on Monday.\nPresident Buhari said that “the days of the bandits are indeed numbered because the military capabilities of our forces are being boosted by the acquisition and deployment of advanced equipment.”According to him, “the bandits are living in the fool’s paradise of invincibility, but reality will soon dawn on them harder than ever before.”President Buhari added that “the bandits are currently under desperate pressure because of the intense and sustained air and ground operations against them in their hideouts by our security forces.\n“The cowardly attacks on innocent people by the bandits show a rearguard action of criminals under pressure.\nBut they will have no place to hide and our gallant security forces will not relent in the current offensive to defeat these callous enemies of humanity,” the President emphasized."
  },
  {
    "headline": "Buhari Govt Amend Charges Against Nnamdi Kanu Ahead Of Thursday Trial — Lawyer",
    "summarized_story": "The accusations against pro-Biafra activist Nnamdi Kanu have been revised by President Muhammadu Buhari’s government.\nIfeanyi Ejiofor, Kanu’s lead counsel, revealed this in a statement signed and published last night after a regular visit to Kanu.\nAlloy Ejimakor, had a very fruitful visitation to Onyendu Mazi Nnamdi Kanu.\n“Onyendu Mazi Nnamdi Kanu is in good spirit, awaiting his auspicious outing on Thursday, the 21st Day of October, 2021.\nThe Indigenous People of Biafra (IPOB) leader will appear before Justice Nyako to resume his treason trial."
  },
  {
    "headline": "VIDEO: Moment Congress committee chairman, Kolawole Babatunde, announced winners as APC elects new leaders in Abia",
    "summarized_story": ""
  },
  {
    "headline": "Flying Officers Cup 2021: Remaining quarterfinal matches moved as Royal Queens, Naija Ratels bow out, Osun Babes, FC Robo advance to semi-final (PICTURES)",
    "summarized_story": "Two remaining quarterfinal matches of the ongoing Flying Officer’s Cup involving four Nigeria Women Football League (NWFL) premiership sides – Edo Queens, Sunshine Queens, Confluence Queens and Nasarawa Amazons have been moved to Wednesday October 20, 2021.\nOn Monday, premiership sides – Osun Babes and FC Robo Queens qualified for the semi final of competition after recording victories over Royal Queens FC and Naija Ratels FC in the first two quarter final games.\nThe Omoluabi Queens as Osun Babes is fondly called edged Royal Queens FC 2-0 in the first quarter final match.\nFC Robo Queens also replicated Osun Babes score line with a 2-0 triumph over Naija Ratels FC in the second quarter final game.\n|Monday, 18th Of October (Quarter Final Results)|Royal Queens 0 Osun Babes 2FC Robo Queens 2 Naija Ratels 0."
  },
  {
    "headline": "In Abia, Kolawale dismisses parallel Congress as new APC chair assures inclusive leadership (PICTURES)",
    "summarized_story": "The Chairman of the National committee for All Progressives Congress (APC) Congress in Abia State, Hon.\nKolawole Babatunde, has described a parallel congress conducted by a faction of the party as “mere picnic”.\nThe party constitution is very clear that there should be no parallel congress anywhere.\n“APC Abia State stands today at the threshold of a historic breakthrough that had eluded her since 2014.\nWith today’s Congress so peacefully conducted by the National Committee, we are set to rebuild APC in Abia State."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Access Bank, Xploits Consulting celebrate girl child, donate school items in FCT -NigPilot",
    "summarized_story": "In a concerted effort to ensure a better life for the girl child in the country, Access Bank Plc in partnership with Xploits Consulting Ltd has donated learning materials and sanitary items to girls in some schools around the Federal Capital Territory, FCT, to celebrate the International Day of the Girl Child.\nThe project which was titled #keep the girl child in school, reached out to a total of 150 girls.\nFifty girls from each school namely: Junior Secondary School, Gwarimpa, Abuja,Junior Secondary School, Kwali Central, Kwali and Government Secondary School, Giri, Gwagwalada benefited from the project.\nSpeaking further she said the project was supported by Access bank as part of the bank’s corporate social responsibility, CSR, where funds and resources are channeled into impacting people’s lives positively.\nAppreciating the gesture, the principal GSS, Giri, Gwagwalada, Mr. Emmanuel Agbebaku on behalf of the other principals thanked Xploits Consulting and Access Bank Plc for the gifts."
  },
  {
    "headline": "Air Peace gets second safety performance award in three months -NigPilot",
    "summarized_story": "THE West and Central Africa’s largest carrier, Air Peace, has been recognized with the Distinguished Safety Performance Award by the Federal Airports Authority of Nigeria (FAAN).\nThe Spokesperson of the airline, Mr. Stanley Olisa disclosed this in a statement on Friday.\nOlisa said that the award was presented by the Kaduna Airport Manager and Chairperson, Airport Safety Committee, Kaduna International Airport, Mrs. Amina Ozi-Salami, in recognition of Air Peace’s consistent commitment to safety with records of zero accident/serious incidents at the Kaduna International Airport.\nOlisa, expressed gratitude to the airport authorities for the award, adding that it further accentuates the airline’s unwavering stance on 100 percent safety compliance in line with established global standards.\nIn August this year, Air Peace was also conferred with the Gold Standard Safety Award by the National Association of Aircraft and Pilots Engineers (NAAPE), for its safety record and safety system performance as well as outstanding investment in brand new aircraft and equipment."
  },
  {
    "headline": "FG opens more potentials in mining sector as alternative revenue sources -NigPilot",
    "summarized_story": "In line with the diversification agenda of the present administration, more potentials are being opened as alternative sources of revenue generation for the country.\nSpeaking during the foundation laying ceremony of the Gold Souk in Kumbotso Local Government Area in Kano State, Minister of Mines and Steel Development, Arc.\nOlamilekan Adegbite stated that this could not have come at a better time than now.\nHe also disclosed that the event has offered a golden opportunity to highlight the efforts of the present administration to open some of the potentials available in the mining sector to serve as an alternative revenue source.\nSpeaking also at the event, the Governor of Kano State, His Excellency, Dr. Abdullahi Umar Ganduje, said that Kano State was one of the economic commercial centers in Nigeria, the most populous state in the Federation, and historically the center of commerce in the Nation."
  },
  {
    "headline": "Mining is all about data – Adegbite -NigPilot",
    "summarized_story": "Olamilekan Adegbite has disclosed that the knowledge of data of mineral deposits in the country is what makes exploration easier which invariably attracts investment in the Mining and Mineral Sector, generates foreign exchange, and creates employment for the teeming youths, adding that exploration creates wealth along the mineral value chains.\nAdegbite made the disclosure in his office in Abuja recently, at the presentation ceremony of the Committee Preliminary Report on the National Integrated Mineral Exploration Project, NIMEP, led by its Chairman, Dr. Addulrazaq Garuba.\nReceiving the report, which he described as a very good and laudable project, Adegbite explained that NIMEP was designed to provide geosciences data needed for integrated mineral exploration in Nigeria.\nEarlier, the Director-General, Nigerian Geological Survey Agency, NGSA, and Chairman of the Committee on NIMEP, Dr. Abdulrazaq Garuba maintained that NIMEP project faced several challenges such as insecurity, ranging from kidnapping to banditry.\nHe listed other challenges faced by the project as interference by Local Government Areas, community restiveness, amongst others."
  },
  {
    "headline": "Nigerians Celebrate Eid-ul-Maulud",
    "summarized_story": "Nigerians, especially the Muslim faithful in various parts of the country, are joining their counterparts across the world to celebrate this year’s Eid-ul- Maulud.\nAs the people celebrate, President Muhammadu Buhari, the leadership of the National Assembly, and governors in various states asked Nigerians to continue to live in peace with one another.\nIn his goodwill message on the eve of the celebration, the President congratulated the Muslims in the country, as well as Nigerians of all faiths.\nPresident Buhari also reassured the people of their security, saying the military, police, and intelligence agencies have improved their operations to effectively respond to the challenges in the nation.\nAregbesola, who believes that doing so will guarantee peace and security in the country, asked the people to refrain from violence, lawlessness, and other acts of criminality."
  },
  {
    "headline": "Eid-ul-Maulud: Buhari Congratulates Muslims, Says Govt Making Progress In Securing Nigeria",
    "summarized_story": "President Muhammadu Buhari has congratulated the Muslims in the country, Nigerians of all faiths, and the followers of Islam all over the world on the occasion of the Maulud-Un-Nabiyy.\n“Time has come to revise the prefixes rising insecurity with declining insecurity,” the statement said.\nHe stated that the “reality of declining insecurity” should replace the narrative of rising insecurity in the country.\n“While there is work to do, the men and women in uniform who are helping the nation to achieve this goal, desire our collective appreciation and encouragement to do even more,” President Buhari added.\n“The whole country and its mass communications systems have a duty in this regard.”The President concluded his message by appealing to road users to drive with care and avoid needless accidents."
  },
  {
    "headline": "Goronyo Attack: Bandits Killed 43 People – Sokoto Govt",
    "summarized_story": "Forty-three people have been confirmed killed in the wake of the attack by bandits on Goronyo township in Goronyo Local Government Area of Sokoto State.\nI was not categorical about the figure,” he was quoted as saying in a statement by his media adviser, Muhammad Bello.\n“We just finished a meeting with some stakeholders and I have confirmed that we lost 43 people, unfortunately to that incident.\nAccording to the President, bandits are living in the fool’s paradise of invincibility, but reality will soon dawn on them harder than ever before.\n“The cowardly attacks on innocent people by the bandits show a rear-guard action of criminals under pressure,” President Buhari added."
  },
  {
    "headline": "#EndSars Protests: Lagos Panel Concludes Sitting, Awards N410m To 70 Victims",
    "summarized_story": "The Lagos State Judicial Panel on restitution for victims of SARS-related abuses and other matters has held its valedictory sitting after 131 proceedings.\nThey include Michael Owoicho – N10 million, Fatai Ogunseye (late) – N10 million, Adeola Mukaila – N700,000, Stella Edegwa – N500,000, Akapo Adekunle – N10 million, Mustapha Ramot – N10 million, Kufre Jackson – N5 million, Ikechukwu Iloamuzor (late) – N10 million, Segun Adekoya (unlawful arrest by the police) – N1 million, Yusuf Omole – N10 million, and Segun Ishola (injuries sustained from gunshot) – N5 million.\nOthers are Mr and Mrs Julius Adeogun – N10 million, Okoronkwo Sylvester (late) – N10 million, Titi Agnes – N10 million, Prince Akaba – N500,000, Chukwudera Uba – N4 million, Seun Bamgbose – N10 million, Abayomi Likinyo – N4 million, James Arebha – N4 million, Juliana Adeoti – N1 million, Adaeze Samson – N2.5 million, Yemi Abdulkareem – N10 million, and Gabriel Ayedungbe – 10 million.\nJustice Okuwobi also revealed that the panel has concluded its investigations into the shooting at the Lekki tollgate – one of the venues of the #EndSARS protests in Lagos.\nThe panel assured petitioners that its recommendations would include compensation to victims of the Lekki tollgate incident if any was identified."
  },
  {
    "headline": "Mideast Economy Recovering But Social Unrest On The Rise, Says IMF",
    "summarized_story": "The Middle East and North Africa are on track to economic recovery, but rising social unrest and unemployment are threatening to hinder “progress”, the International Monetary Fund said Tuesday.\nBut with rapid vaccination campaigns, particularly in the Gulf nations, the IMF predicted that GDP growth would rise to 4.1 percent this year, a slight upgrade of 0.1 percent from the last projection in April.\nThe IMF said this month that while prospects for oil-exporting economies improved with higher oil prices, low-income and crisis-hit countries are witnessing “fragile” recoveries.\nIt warned of “a rise in social unrest” in 2021 that “could pick up further due to repeated infection waves, dire economic conditions, high unemployment and food prices”.\nThis rise exceeds that seen during the global financial crisis and the 2014-15 oil price shock, the IMF said."
  },
  {
    "headline": "Security operatives raid bandits camps in Kaduna",
    "summarized_story": "A joint team of security operatives has killed at least 10 suspected bandits during a raid on bandits camp in Giwa Local Government Area of the stateOne of the bandits camps was razed by the troops while some bandits escaped with gunshot injuriesA statement issued on Monday by the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan said the troops encountered the bandits who were heavily armed around Kwanan Bataru in Fatima community and engaged them in a fire exchangeItems recovered from the bandits include motorcycles, one revolver, mobile phones, torchlights and some charms.\nA kidnap victim was also rescued by the troopsMeanwhile, the Kaduna State government has appealed to residents of Fatika general area to report to security agencies anyone found with bullet wounds seeking medical attention."
  },
  {
    "headline": "Updated: Death toll in Goronyo market attack rises to 43",
    "summarized_story": "The death toll in the attack on Goronyo market that took placeB on Sunday by suspected bandits has risen to forty three .\nSokoto state Governor, Aminu Tambuwal gave the figures after meeting with major Stakeholders from the affected community.\nThe governor said details were not handy earlier when he gave the number of casualties as over thirty.\nGovernor Tambuwal said a meeting with all major stakeholders in the local government area is ongoing to find a lasting solution to the security challenges in the area.\nTwo deadly attacks have taken place at Ungwan Lalle market and now Goronyo market after the members of the outlawed volunteer Vigilantes group also known as Yan Sakai attacked and killed nine fulanis herdsmen at Mammande market in Gwadabawa local government area."
  },
  {
    "headline": "Lagos EndSARS panel awards N148.2m as compensation to 23 more petitioners -",
    "summarized_story": "The Judicial Panel of Inquiry on Police Brutality and other related matters in Lagos State has awarded 148.2 million naira as compensation to 23 more petitioners as it winds down proceedings after sitting for a year since inauguration on October 19, 2020.\n262 million had previously been awarded to 47 petitioners before now.\nThat makes it 410 million naira awarded so farOn the Lekki shooting, Justice Doris Okuwobi (rtd) said though evidence has been concluded on the matter, the panel was yet to write out its final decision.\nShe assured the petitioners that the panel would do justice in the matter"
  },
  {
    "headline": "Eid-ul-Maulud: Gov. Ugwuanyi felicitates with Muslims",
    "summarized_story": "Enugu state Governor Ifeanyi Ugwuanyi has felicitated with the Muslim faithful on this year Eid-ul-Maulud in commemoration of the birth of the Holy Prophet Muhammad.\nHe called on all Nigerians to renew their faith in God and intensify prayers for the country to surmount its challenges.\nIn his goodwill message, Gov.\nUgwuanyi urged Muslims and indeed all Nigerians to remain committed to the core values of the nation’s founding fathers so that the concerted efforts at sustaining the peace, unity and progress of the country will be fully actualized.\nHe therefore wished all Nigerians a peaceful celebration as well as the guidance and blessings of the Almighty God."
  },
  {
    "headline": "Trump Files Lawsuit to Keep January 6 Documents from Congress",
    "summarized_story": "In a federal lawsuit, Trump said the committee’s August request was “almost limitless in scope,” and sought many records that weren’t connected to the siege.\n“There’s a long history of the White House accommodating congressional investigative requests when the public interest outweighs other concerns,” Thompson and Cheney said.\nBannon was a private citizen when he spoke to Trump ahead of the attack, the committee said, and Trump has not asserted any such executive privilege claims to the panel itself.\nIn a letter obtained by The Associated Press, the White House also worked to undercut Bannon’s argument.\nIt is unclear whether a fourth former White House aide, Dan Scavino, will comply."
  },
  {
    "headline": "Taliban Says Afghan Girls Will Return to Secondary Schools Soon",
    "summarized_story": "Afghanistan’s Ministry of Interior Affairs has said girls will be allowed to return to secondary schools soon.\n“From my understanding and information, in a very short time all the universities and schools will be reopened and all the girls and women will return to school and their teaching jobs,” he said.\nFollowing the Taliban’s takeover of Afghanistan, teenage girls were told to stay home from school until a “safe learning environment” could be established.\nBut boys in all grades and girls of primary age were told to return to school.\nKhosti “indicated that it was imminent that girls in secondary schools and their female teachers would be returning very soon,” said Al Jazeera’s Stefanie Dekker, reporting from Kabul."
  },
  {
    "headline": "Tigray: Ethiopian Government Admits Mekelle Airstrike",
    "summarized_story": "But media controlled by the Tigray People’s Liberation Front (TPLF) said three civilians had been killed.\nMekelle is an Ethiopian city,” government spokesman Legesse Tulu asked.\nThe Ethiopian army took control of most of the northern region of Tigray in November 2020, after TPLF forces seized a military base.\nIn June 2021, the rebels recaptured Tigray in a surprise attack, and then moved into parts of neighbouring regions like Amhara.\nEthiopia has declared the TPLF a terrorist organisation, but the TPLF insists that it is the legitimate government in Tigray."
  },
  {
    "headline": "Nigeria: Bandits Massacre 40 in Sokoto Market, Buhari Declares Total War",
    "summarized_story": "Nigeria President Muhammadu Buhari on Monday declared total war on bandits wreaking havoc in parts of the country, saying their days are numbered.\nBut in Kaduna State, security forces reportedly killed 10 bandits in Kwanan Bataru, Giwa Local Government Area.\nOn this auspicious occasion, I wish you all the blessings of today.”No fewer than 40 people were killed as suspected bandits attacked a market in Goronyo Local Government Area of Sokoto State.\nSuspected bandits also killed 20 persons at Ungwan Lalle market, in Sabon Birni Local government Area of Sokoto State.\nThe Sokoto State government had earlier ordered the closure of markets in the Eastern Senatorial District of the state as a measure to fight the rising insecurity in the state."
  },
  {
    "headline": "Buhari, Obasanjo, Jonathan, Akinyemi Mourn Powell, Commiserate with US Government",
    "summarized_story": "Nigeria President Muhammadu Buhari and former Presidents Olusegun Obasanjo and Goodluck Jonathan, have extended the sympathy of the Nigerian government to the United States President, Joe Biden, and the people of America over the demise of a former US Secretary of State, General Colin Powell.\nIn a statement by his Special Assistant on Media, Kehinde Akinyemi, Obasanjo said, “General Powell’s tenure in office marked a significant departure from the traditional relations between Africa and the United States.\n“He was Secretary of State under the administration of President George W. Bush, Jnr, part of the time I was President of Nigeria.\nHis articulation of the Powell Doctrine gave the United States, and the world at large, a new paradigm for engaging in military action with honour and decorum.\nAkinyemi said he had argued then that there could be circumstances when only overwhelming force could win a war (a sort of Colin Powell doctrine)."
  }
]