[
  {
    "headline": "2023: APC govs, senators draw battle line over Ahmed Lawan",
    "summarized_story": "Lawan was drafted into the race at the eleventh hour by some bigwigs in the party, who were initially backing an aspirant from the South-South.\nIf they won’t get return tickets, they have also vowed to give their delegates to Lawan.\n“The genesis of the matter is the new Electoral Act which has reduced the influence of state governors on party delegates,” he said.\nParty concludes screening of govs, senatorial candidatesThe APC has also concluded screening of 145 governorship aspirants and 351 senatorial aspirants.\nThe screening of 1,197 aspirants for the House of Representatives was still ongoing as of press time Sunday evening."
  },
  {
    "headline": "Don’t cover up Deborah’s killing, punish perpetrators, Northern CAN tells govt",
    "summarized_story": "By Luminous Jannamike, AbujaThe Christian Association of Nigeria (19 Northern States and Abuja) has called on federal and state authorities not to cover up the killing of a young Christian student, Deborah Samuel, who was gruesomely murdered in Sokoto last week, under disturbing circumstances.\nNorthern CAN’s Publicity Secretary, Chaplain Jechonia Gilbert, made the call in a statement issued in Abuja on Sunday and made available to our correspondent.\nJechonia said Northern CAN believes that Nigeria is a country governed by the rule of law and order.\n“The umbrella organisation of all Christians in Northern Nigeria condemn this gruesome and barbaric murder of Deborah in the strongest terms possible.\n“Northern CAN prays for the immediate family and indeed the church of late Deborah Samuel not to lose hope in God’s ability to avenge the killers of their daughter."
  },
  {
    "headline": "Nigerian, US Universities to get Joint Degree Programs",
    "summarized_story": "…As US moves to forge academic partnerships with Nigerian universities.\nNo fewer than 30 Vice Chancellors of Nigerian universities were this week among deliberators at the inaugural Higher Education Conference, designed by the U.S. government in a bid to support initiatives that promote access to quality education and strengthen human capital for inclusive economic growth and development in Nigeria.\nFor the 2-day Landmark event, the U.S. Consulate General in Lagos mobilized key stakeholders to build long-term partnerships between U.S. and Nigerian institutions of higher education.\nBringing U.S. and Nigerian universities closer together, exploring future partnerships and discussing ideas for joint degrees with American experts, were great outcomes of the higher education conference,” he said.\nNo fewer than 31 Nigerian universities are already affiliated with the U.S. Mission on the Fulbright program,which provides opportunities for Nigerian university students and faculty members to engage in collaborative research in U.S. institutions across various academic fields."
  },
  {
    "headline": "Protest rocks PDP over FCT primary",
    "summarized_story": "John Alechenu, AbujaSupporters of the Peoples Democratic Party, PDP, in the Federal Capital Territory, stormed the National Headquarters, in Abuja, on Monday to protest an alleged plot to deny Prince Taribo Williams access to delegates.\nSpokesman for the protesters, MR. Henry Edward, who spoke to reporters during the protest said a Senatorial aspirant (name withheld), was trying to muscle everyone else out of the race by denying them access to delegates.\nEdward said, “Against the party’s believe in fairness, equity and justice; the party at the state level has placed an embargo on the 62 political wards and the six area councils of the FCT prohibiting party executives and delegates from having any interface with Prince Taribo Williams.\nAs we speak right now, statutory delegates.”He threatened that the aspirant and his supporters would be left with no option but to seek redress in court if the National Working Committee does not intervene."
  },
  {
    "headline": "BREAKING: Anambra boils as gunmen attack 3 locations",
    "summarized_story": "By Vincent UjumaduGunmen have attacked three locations in Anambra state.\nThe areas include: Ogidi headquarters of Idemili North local government area, Military checkpoint at the highbrow 3-3 Housing Estate in Onitsha and Eke Oko in Aguata local government area.\nAlso in the early hours of today, a section of Idemili North local government area headquarters, Ogidi was set ablaze by unknown arsonists.\nAlso on Sunday night, gunmen attacked military men and engaged them in a shoot out at 3-3 Estate, Nkwelle Ezunaka, near the city of Onitsha.\nA resident of the Estate said: “Yesterday night at housing estate gate, unknown gunmen attacked the military men securing us."
  },
  {
    "headline": "FG to defy court order on $60m cargo tracking contract award",
    "summarized_story": "Indications have emerged that the Federal Government may defy an order by a Federal High Court barring parties from taking further steps in relation to the award of the disputed $60million International Cargo Tracking Note (ICTN) contract initiated by the immediate past Minister of Transportation, Rotimi Amaechi.\nA Federal High Court in Abuja had earlier issued an order restraining the former Minister from taking any further step on the contract award pending the resolution of a suit instituted against him and some others in respect of the contract.\nHowever, a memo prepared by the Federal Ministry of Transportation indicated that issue of the contract will be tabled before the weekly Federal Executive Council, FEC, meeting slated for this Wednesday for possible approval and award.\nCASER had, in the suit marked: FHC/ABJ/CS/1587/2021, accused Amaechi of among others, manipulating the contract award process in favour of two local and inexperienced firms – Medtech Scientific Limited and Rozi International Nigeria Limited, who are also defendants in the case.\nFollowing the complaint by Mustapha, Justice Donatus Okorowo elected to first deal with the issue of alleged contempt and ordered parties to file necessary processes."
  },
  {
    "headline": "Deborah Samuel: DSS told to arrest Sheikh Abubakar Jibril immediately over Bishop Kukah",
    "summarized_story": "Rampaging hoodlums on Saturday vandalised at least two parishes presided over by Bishop Kukah and it took the swift response of security operatives to stop any attack on Kukah’s personal residence.\nRioters had on Thursday stoned and burnt a 200-level Home Economics student of the Shehu Shagari College of Education in Sokoto, Deborah Yakubu, for alleged blasphemy of Prophet Muhammad (SAW).\n“Jibril, in a trending video, erroneously accused Bishop Kukah of motivating Deborah to commit alleged blasphemy and that he should stop or else he will be dealt with.\nThe inflammatory cleric (Jibril) then asked if they know his (Kukah’s) house and the listeners shouted, ‘Yes we do’.\nHe is inciting them to attack Bishop Kukah."
  },
  {
    "headline": "BREAKING: Electoral Act: Supreme Court fixes May 19 for Buhari’s suit against National Assembly",
    "summarized_story": "The Supreme Court on Monday invited President Muhammadu Buhari to appear before it on Thursday, May 19 for a hearing in a suit he instituted against the National Assembly challenging Section 84 (12) of the 2022 Electoral Act.\nAlso invited to be in court on the same day are the National Assembly and its leadership to defend various constitutional breaches raised against them by the Presidency.\nA hearing notice issued by the apex court and sighted by our correspondent indicated that the invitation of President Buhari was served on him through his private lawyer, Prince Lateef Olasunkanmi Fagbemi.\nBy implications, Fagbemi, a Senior Advocate of Nigeria SAN, is to profer arguments against the National Assembly on the invalidity and unconstitutionality of Section 84 (12) of the new Electoral Act.\nAt the time of this report, DAILY POST could not ascertain the legal practitioner that will stand for the National Assembly to justify the inclusion of the contentious section in the new Electoral Act."
  },
  {
    "headline": "You can’t win elections in Nigeria with ‘clear eye’ – Pastor Ibiyeomie",
    "summarized_story": "Founder of Salvation Ministry, Pastor David Ibiyeomie has alleged that some Nigerian politicians indulge in many evil acts, including rituals, just to win elections.\nWhile calling on Christians vying for elective positions to seek God, the popular pastor claimed that even the best candidates win elections without spiritual forces.\nHe said, “Can you play politics and win in today’s Nigeria, I don’t know of other countries though, but can you win politics with a clear eye?\nEven if you are the best candidate, you can’t win.\n“You can have all the good English, it’s only you and your wife that will vote."
  },
  {
    "headline": "Your plans to join NATO grave mistake – Russia warns Finland, Sweden",
    "summarized_story": "Russia has reacted angrily to the plans by Finland and Sweden to join the North Atlantic Treaty Organization (NATO).\nThe intergovernmental military alliance already has 30 member states – 28 in Europe, the United States, and Canada.\nOn Monday, Moscow warned that the admission of the two countries would be a grave mistake.\nRyabkov added that military tensions with the two Scandinavian nations would increase.\nMore European countries are seeking NATO membership due to Russia’s invasion of Ukraine."
  },
  {
    "headline": "Gunmen burn EEDC, council hqtrs, court, raze 32 vehicles in Anambra",
    "summarized_story": "Gunmen on Monday set ablaze Idemili North Local Government secretariat and a Magistrate Court in Ogidi, Anambra State.\nThe gunmen also burnt the District office of the Enugu Electricity Distribution Company PLC (EEDC) in the area.\nVideos and pictures circulating online showed that the the entire buildings were reduced to rubbles with the vehicles burnt beyond repair.\nHe said about 32 utility and operational vehicles, including other assets and equipment within the premises were razed by the hoodlums.\nAlso, gunmen on Sunday night night allegedly engaged military men in a shoot out at 3-3 estate, Nkwelle Ezunaka, near Onitsha."
  },
  {
    "headline": "Atiku, Wike, Saraki, others battle for 3,700 delegates",
    "summarized_story": "No fewer than 3,700 delegates will determine the fate of the 15 presidential aspirants in the Peoples Democratic Party (PDP).\nA source, who spoke in confidence said: “The battle line is drawn, especially in 15 states with 100 delegates and above.\nAlthough Adamawa Governor Umaru Fintiri is from the same state as Atiku, Wike has been lobbying him for support.\n“To curtail the influence of Wike, some governors have queued behind Saraki, namely Duoye Diri (Bayelsa), Darius Ishaku (Taraba) and Ifeanyi Okowa (Delta).\nOthers are Tambuwal, Wike, Mohammed, Emmanuel and banker and economist, Mohammed Hayatu-Deen."
  },
  {
    "headline": "#JusticeForDave: Nigerians demand justice for sound engineer ‘set ablaze’ over N100 in Lagos",
    "summarized_story": "Nigerians have taken to social media to demand justice over a sound engineer, David Imoh, 38, set ablaze at Lekki.\nThey were said to have beaten the sound engineer and his friends who came to intervene with sticks, clubs and other dangerous instruments.\nDavid used to be the sound engineer of my band before he moved to another one.\nThis Justice for Dave won’t be here if he was helped in the first place.”@lordesszzetta tweeted: Dave was not a yahoo boy.\nDave was a legit young hardworking sound engineer that was set on fire & killed by a mob for no just reason in front of the venue of his show on Admiralty road."
  },
  {
    "headline": "JUST IN: Supreme Court to hear suit by Buhari, Malami Thursday",
    "summarized_story": "The Supreme Court has scheduled hearing for May 19 in the suit by President Muhammadu Buhari and the Attorney General of the Federation) AGF) and Minister of Justice, Abubakar Malami.\nThe scheduling is not only reflected in the court’s case list for the week but The Nation learnt that parties have since been served hearing notices.\nThe suit filed on April 29, 2022, marked: SC/CV/504/2022 has the National Assembly listed as the sole defendant.\nThe plaintiffs are contending among others, that the said section of the Electoral Act 2022 is in conflict with constitutional provisions.\nBuhari and Malami added that the same Constitution has equally “the qualifying factors for election into the office of President, Vice President."
  },
  {
    "headline": "Confusion among Kaduna APC delegates as El-Rufai presents Amaechi as Buhari’s benefactor",
    "summarized_story": "A presidential aspirant, Chibuike Rotimi Amaechi, yesterday visited Kaduna State Governor Nasir El-Rufai and delegates in the state to the All Progressives Congress (APC) national convention, to canvass for support.\nThere was confusion among the delegates yesterday, as the governor described Amaechi as President Muhammadu Buhari’s loyalist and confidant.\nBut I always say Kaduna delegates are different.”The governor, as he did during Tinubu’s visit, however, asked the delegates what their answer to Amaechi would be.\n“Many people contesting election always say delegates will hardly make heaven, because they don’t keep to promise.\nBut I always say Kaduna delegates are different."
  },
  {
    "headline": "Tension, fears in Borno over alleged fresh blasphemy",
    "summarized_story": "Her comment triggered sharp reactions as someone volunteered the lady’s location and house with a warning to get her.\nThe threat by some people to give her Deborah treatment made security agents to evacuate her and her family late Saturday.\nThis was contained in another statement from the spokesperson of the scheme in Sokoto State, Malam Sani Idris.\nChairman, Northern Governors Forum and Plateau State Governor, Simon Lalong in a statement said the governors were concerned about the development which is clearly an extra-judicial measure of addressing perceived infraction.\nCAN believe that life is sacred and must never be taken by another unless as directed by the State."
  },
  {
    "headline": "The Sun gets new board of directors",
    "summarized_story": "The Board of Directors of The Sun Publishing Limited has been reconstituted, with Barr Neya Uzor-Kalu as chairman.\nOther members of the board are Onuoha Ukeh (Managing); Mr. Mike Awoyinfa, Mr. Iyke Ekeoma, Alhaji Kabiru Mohammed Shuaibu, mni, Mrs. Olufunmilayo Goka, Mr. Abayomi Fatusin and Engr.\nMr. Awoyinfa, pioneer Managing Director/Editor-in-Chief of The Sun Publishing Limited, was on the former board.\nObinna Kalu holds a Bachelor of Laws Degree (LL.B) from Abia State University, obtained in 1999.\nKalu joined The Sun Publishing Limited as General Counsel in 2013 and currently heads the Company’s Legal Department."
  },
  {
    "headline": "2023: Osinbajo, Mohammed, Saraki woo Jigawa, S’East, Kogi delegates",
    "summarized_story": "Osinbajo, who interacted with stakeholders and delegates in Dutse, Jigawa State insisted that the country deserves the best.\nHe told Ebonyi and Enugu delegates that he would run an all-inclusive government and implored them to support him to clinch the PDP presidential ticket.\nResponding to questions from newsmen after a meeting with delegates in Kogi State, he said he has the solutions to all the problems confronting the nation.\nThe former minister of works made the plea to individual delegates via a voice note he sent to all delegates of the senatorial district.\nHe believed he can win the primary with votes from the delegates and go on to win the general election."
  },
  {
    "headline": "Those fueling ethnic, religious war in S/West ‘ll regret it , Gani Adams warns",
    "summarized_story": "By Lukman OlabiyiAare Onakakanfo of Yorubaland, Iba Gani Adams, has warned those fanning the ember of war saying it is capable of fueling ethics and religious war in Nigeria.\nHe insisted that the South West would resist any attempt that could trigger crisis and disturb the peace in the region.\nIn a statement by his media aide, Adams said the culprits should be apprehended and made to face the wrath of the law.\nHe condemned the act in its totality, maintaining that such could also jeopardise the fragile unity of the nation.\n“We are in the midst of a full-blown crisis in Nigeria and unless something urgent is done, this may lead to a complete anarchy."
  },
  {
    "headline": "Court halts sharing of derivation funds to oil producing states",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Accountant General of the Federation to immediately halt the distribution of more than N1 trillion due to oil producing states, pending the determination of the suit before it.\nThe court presided over by Justice A R. Mohammed, in an interim injunction, held that the distribution of the derivation funds without the indices of the Revenue, Mobilisation, Allocation and Fiscal Commission (RMAFC) was injurious to the applicant, which is the Imo State Government.\nThe Imo state attorney general had, in a suit No FHC/ABJ/CE/415/2022, against RMAFC and others, challenged the distribution of the said funds without unambiguous indices by RMAFC as provided by the Nigerian Constitution.\nIn his submission before the court, counsel to the Imo State government, Chief Olusola Oke, argued on the need to protect his client, pending the determination of the suit.\nAfter granting the ex parte order, Justice Mohammed ordered Imo state to join other oil producing states as respondents to the suit."
  },
  {
    "headline": "Northern Governors, Gumi Condemn Murder of Deborah, Appeal for Calm",
    "summarized_story": "In its own reaction, the umbrella organisation of all Christians in Northern Nigeria at the weekend condemned what it described as gruesome and barbaric murder of Deborah.\nAbubakar came under fire for a statement he made via his Twitter handle, defending the killing of Deborah.\nHe maintained that Nigeria was not an Islamic state, adding that Muslims in the country have agreement with people of other faiths to live together peacefully.\n“Even after killing Deborah the miscreants continued to destroy people’s properties, burning of church facilities, and going from house to house intimidating peaceful Christians.\nIt also called on the federal and Sokoto State governments to rise up to the occasion by doing the needful, saying the world is watching."
  },
  {
    "headline": "Adesina Meets Mamman Daura, Intensifies Lobby of Buhari’s Circle",
    "summarized_story": "A source told THISDAY that the meeting held behind closed doors as Adesina continues to lobby of Buhari’s circle.\nBeyond Mamman Daura, he is also reaching out to Buhari’s relatives in Niger Republic, to see if they can convince Buhari to back him,” the source who pleaded to remain anonymous added.\nTHISDAY had reported last week that some African leaders have mounted pressure on Buhari to anoint Adesina, as the presidential candidate of the APC in the 2023 general election.\nTo this end, former President Olusegun Obasanjo, is said to have given Adesina his full backing.\nLast week, a coalition made up of 28 groups bought the form for Adesina worth N100 million."
  },
  {
    "headline": "FG: TotalEnergies Has Invested Almost $30bn in Nigeria within Eight Years",
    "summarized_story": "Wabote said TotalEnergies had invested immensely in Nigeria and deserved commendation for remaining consistent in investing in the country’s oil sector.\nWabote stated, “Total has invested so much in Nigeria since the last 60 years.\nTerraz expressed excitement at the opportunities that abounded in Nigeria, and indicated the intention of TotalEnergies to expand into the Nigerian electricity sector.\nSangster said TotalEnergies was proud to be the second largest oil and gas producer in Nigeria, contributing 20 per cent of Nigeria’s oil production.\nSangster added that the partnership between TotalEnergies and Nigeria had been a very successful one, pointing out, however, that the journey has not always been smooth."
  },
  {
    "headline": "Now Official, NFF Appoints Jose Peseiro as Head Coach of Super Eagles",
    "summarized_story": "Duro IkhazuagbeIt is now official that Portuguese gaffer, José Vitor dos Santos Peseiro, 62, has been appointed as the new Head Coach of the Super Eagles.\nOn Sunday, the Director of Communication of the NFF, Ademola Olajire, announced in a statement that Peseiro is the preferred choice amongst the five coaches interviewed for the job.\n“The appointment (of Peseiro) is with immediate effect, subject to the signing of agreed terms between the NFF and Mr Peseiro,” the official statement from the NFF announced.\nPeseiro played as a striker in his days and has wide and varied experience coaching top clubs and national teams across four different continents, namely Europe, Asia, Africa and South America.\nThe NFF also announced that former Nigeria international forward, Finidi George, will now be the First Assistant to Peseiro, with Salisu Yusuf now to be the Second Assistant, as well as Head Coach of the CHAN and U23 national teams."
  },
  {
    "headline": "To Avert Major Religious Riots, Tambuwal Declares Curfew as Protests Rock Sokoto",
    "summarized_story": "Following the protests in Sokoto, Governor Nasir-el-Rufai of Kaduna State has banned any form of religious protest across the state.\nThe declaration of the curfew in Sokoto followed the protests that greeted the condemnation of the killing by the Sultan of Sokoto, Alhaji Muhammad Sa’ad Abubakar III.\nThe protesters set a car ablaze around St. Mary Catholic Church and destroyed properties in the church.\nTo avert major religious riots, Tambuwal therefore declared a 24-hour curfew within the metropolis.\nTunga Magaiya youths had insisted that Sokoto State Government should have been responsible for her burial."
  },
  {
    "headline": "Commercial Motorcyclists Beat, Burn Sound Engineer To Death In Lagos Due To Disagreement Over N100 Balance",
    "summarized_story": "Nigeria Nigeria Nigeria https://t.co/qfoxlRQGGb.\"\nTo cut the long story short, try were beaten to a pulp and the sound engineer lost his life right there.\n\"As if that was not enough, the sound engineer was burnt right there on the road.\nGoing on at admiralty way lekki phase 1.\nHe was the sound engineer in my church."
  },
  {
    "headline": "Commercial Motorcyclists Beat, Burn Sound Engineer To Death In Lagos Due To Disagreement Over N100 Balance",
    "summarized_story": "Nigeria Nigeria Nigeria https://t.co/qfoxlRQGGb.\"\nTo cut the long story short, try were beaten to a pulp and the sound engineer lost his life right there.\n\"As if that was not enough, the sound engineer was burnt right there on the road.\nGoing on at admiralty way lekki phase 1.\nHe was the sound engineer in my church."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "BREAKING: FCT Ministry Demolishes Multi-Million Naira Mansion Belonging To Tonto Dikeh's Ex-lover, Kpokpogri In Abuja",
    "summarized_story": "A multi-million naira mansion belonging to Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has been demolished by the Federal Capital Territory Administration (FCTA) in Abuja.\nSpeaking with SaharaReporters, the owner of the building, Kpokpogri and ex-lover of Dikeh, expressed shock saying he was not pre-informed by the officials about the demolition which he described as illegal.\n\"I don't have any issue with anybody that will warrant the wicked and illegal destruction of my house this morning without any pre-notice from the FCT ministry.\nBecause, my house is seated on a rock and an attraction of everybody; so everybody wants to have my house.\"\nPrince Joseph Kpokpogri has been having a serious battle with his estranged lover, Dikeh, resulting to series of arrest, legal actions and counter-arrest and actions."
  },
  {
    "headline": "Hoodlums Burn Electricity Distribution Company Building, 32 Vehicles In Anambra",
    "summarized_story": "Suspected hoodlums have burnt the Ogidi District of Enugu Electricity Distribution Company PLC (EEDC) in Anambra State.\nThe hoodlums burnt down all the operational vehicles of the distribution power company in what was gathered as an early morning raid on the station.\nAccording to Ezeh, about 32 utility and operational vehicles, along with other assets and equipment within the premises were burnt by the assailants.\nEzeh lamented that efforts made to reach the Anambra State Fire Service at the time to quickly put out the fire did not yield any positive result.\nHe said, \"It later took the intervention of the Honourable Commissioner for Utilities, Anambra State, Engr."
  },
  {
    "headline": "JUST IN: Nigeria’s inflation rate hits eight-month high at 16.82%",
    "summarized_story": "The consumer price index, which measures the rate of increase in the price of goods and services, climbed to 16.82 per cent in April 2022 on the back of surging food and gas prices.\nWith the development, it means that the headline inflation rate slowed down in April when compared to the same month in the previous year.\nThe National Bureau of Statistics (NBS) said this in its Consumer Price Index (CPI) report for April 2022, released on Monday.\nThe figure represents the highest rate recorded since August 2021 which is 0.9% points higher than the 15.92% recorded in the previous month (March 2022).\n“Similarly, the urban inflation rate increased to 17.35% (year-on-year) in April 2022 from 18.68% recorded in April 2021, while the rural inflation rate increased to 16.32% in April 2022 from 17.57% in April 2021.”"
  },
  {
    "headline": "JUST IN: Nigeria’s inflation rate hits eight-month high at 16.82%",
    "summarized_story": "The consumer price index, which measures the rate of increase in the price of goods and services, climbed to 16.82 per cent in April 2022 on the back of surging food and gas prices.\nWith the development, it means that the headline inflation rate slowed down in April when compared to the same month in the previous year.\nThe National Bureau of Statistics (NBS) said this in its Consumer Price Index (CPI) report for April 2022, released on Monday.\nThe figure represents the highest rate recorded since August 2021 which is 0.9% points higher than the 15.92% recorded in the previous month (March 2022).\n“Similarly, the urban inflation rate increased to 17.35% (year-on-year) in April 2022 from 18.68% recorded in April 2021, while the rural inflation rate increased to 16.32% in April 2022 from 17.57% in April 2021.”"
  },
  {
    "headline": "I was a devout Muslim... Quran doesn't condone killings, says Tunde Bakare",
    "summarized_story": "Tunde Bakare, serving overseer of The Citadel Global Community Church, formerly known as the Latter Rain Assembly, has condemned the killing of Deborah Samuel.\nIn a statement on Monday, Bakare said as a former Muslim he had read Quran from “cover to cover” and nowhere in the holy book justifies killings.\nMy deep condolences go to the family of Deborah Samuel and I pray that we all find in God the comfort and fortitude to bear this great loss.\n“I also appeal to the good people of Sokoto State to remember the tolerance and hospitality that they have always been known for.\nAs a child, I lived in Sokoto State."
  },
  {
    "headline": "I was a devout Muslim... Quran doesn't condone killings, says Tunde Bakare",
    "summarized_story": "Tunde Bakare, serving overseer of The Citadel Global Community Church, formerly known as the Latter Rain Assembly, has condemned the killing of Deborah Samuel.\nIn a statement on Monday, Bakare said as a former Muslim he had read Quran from “cover to cover” and nowhere in the holy book justifies killings.\nMy deep condolences go to the family of Deborah Samuel and I pray that we all find in God the comfort and fortitude to bear this great loss.\n“I also appeal to the good people of Sokoto State to remember the tolerance and hospitality that they have always been known for.\nAs a child, I lived in Sokoto State."
  },
  {
    "headline": "Airline operators announce flight disruption over scarcity of aviation fuel",
    "summarized_story": "Nigerian airlines, under the aegis of Airline Operators of Nigeria (AON), say there will be disruption of scheduled flight operations over the growing scarcity of aviation fuel popular as Jet-Al.\nObiora Okonkwo, chairman, United Nigeria airline and spokesperson of AON, said this in a public notice issued on Monday.\n“The Airline Operators of Nigeria wish to alert the public of impending disruptions to scheduled flight operations of members of the association.\nThis development is being forced on members by the growing scarcity of aviation fuel popular as Jet-Al,” the statement reads.\nAllen Onyema, vice-president of AON, had said the rising cost and fuel scarcity can be addressed if airliners are allowed to purchase aviation fuel directly."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Google unveils first smartwatch, new phones, virtual cards and more",
    "summarized_story": "Google also announced updates to several of its most popular tools including Maps, Google Translate and its core search product.\nGoogle search which started from only text queries has over the years added the option to use voice and picture queries options.\nGoogle maps’ new immersive view for cities comes off as a challenger to Apple’s 3D mode map view.\nVirtual cardsSource: GoogleGoogle is rolling out virtual credit cards to help protect users’ financial information while they’re shopping online.\nThese virtual cards are typically used for one-time purchases, but users will also be able to use these cards for subscriptions."
  },
  {
    "headline": "New crypto rules",
    "summarized_story": "That is when the highly anticipated Techpoint Africa Blockchain Summit will take place.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than five days!\nCentral African Bank warns Central Africa RepublicRemember that the Central African Republic (CAR) announced its plan to adopt Bitcoin as a reference currency in April 2022.\nNow, the Banking Commission of Central Africa (COBAC) is cracking down on Bitcoin transactions, issuing a reminder of its crypto ban on Friday, May 13, 2022.\nIt also warned that its decision could be at odds with the region’s France-backed currency, the Central African Franc (CFA)."
  },
  {
    "headline": "Nigeria’s Central Bank edges close to eNaira use case with much-needed upgrade",
    "summarized_story": "Share this article:Nigeria’s central bank digital currency (CBDC), eNaira, will get an update that will allow it to perform more functions such as bill payment and USSD access.\n“Fundamentally, there were faults that would not have allowed the eNaira to achieve its full potential.”There were issues with setting up the eNaira Speed Wallet application at launch.\nOnly 1.3% had completed a transaction with the eNaira Wallet, while 34.4% were indifferent about the CBDC project.\nHow eNaira USSD could workWhile there’s little detail on how the eNaira will work with USSD, we can make educated guesses on how the service will work based on our understanding of the eNaira and USSD protocols in Nigeria.\nAccording to the CBN, the first tier of Speed Wallet users can set up a wallet without a Bank Verification Number (BVN)."
  },
  {
    "headline": "Interswitch raises $110m",
    "summarized_story": "Perhaps now’s a good time to ask how many fintech startups you know do not provide lending and payment options in Nigeria.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, has partnered with YC to give an account of its activities in Africa since 2009.\nThe fintech company is well known for its Point-of-Sale terminals and online consumer payment platforms like Quickteller and Verve.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than nine days!\nPolygon is sponsoring 50 free tickets to Techpoint Africa Blockchain Summit (TABS), holding on May 21, 2022."
  },
  {
    "headline": "Binance Hosts Nigerian Idol Street Edition On Nigerian University Campuses",
    "summarized_story": "Earlier in the year, Binance announced its sponsorship of the Nigerian Idol, continuing its mission to drive mainstream crypto adoption in Africa.\nFor the street edition, the blockchain giant hosted entertainment competitions in university campuses across Nigeria including Lagos State University, Rivers State University of Technology, Institute of Management Technology and Igbenidion University.\nThe street edition featured musical performances with judges ranking contestants based on their creativity, the strength of voice and stage performances, mirroring the Nigerian Idol show.\nWatch the first video snippet of the Binance Nigerian Idol street edition, as well as great commentary from the participants HERE.\nFor more information, visit: https://www.binance.comBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Cybersecurity Advisory Firm for 2021; Infoprive, the leading Cybersecurity services provider and trusted advisor in Sub-Sahara Africa, wins the Prestigious MEA Business Award for “Best Cybersecurity A",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Ossiomo Power Company wins BusinessDay Next Bulls Award 2022",
    "summarized_story": "The company’s power lines were powered in 2020 and it has since grown its market share substantially as a result of its competitive tariff, reliable power supply with an average performance of 97.5% or 22 hours per day and 100 percent metering.\nAigbogun said the Next Bulls award follows an informal, proprietary survey carried out on 500 respondents, which comprise equity analysts, retail and institutional investors, financial journalists, sectoral experts, professionals and millennials.\nHe added that 75 respondents identified Ossiomo Power and Infrastructure Company Ltd as a company whose stock they would like to own in their dream equity portfolio for long-term holding if the choice was limited to only 10 companies.\nThe respondents affirmed that they would invest in the company’s initial public offering (IPO) if it ever approached the market.\nAigbogun noted that in making the decision, the Awards Review Committee was guided by the achievements of Ossiomo Power and Infrastructure Limited, which include its “track record as an independent power company dedicated to providing power to the Benin Industrial and Enterprise Park as well as several local communities in Edo State."
  },
  {
    "headline": "Obaseki blames rise in drug abuse on ASUU strike …Appeals to FG, union to resolve industrial action – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has blamed the increasing rate of drug abuse in the state on the lingering strike action by the Academic Staff Union of Universities (ASUU).\nAddressing journalists after the state’s security council meeting at Government House in Benin City, he said drug abuse is the second biggest security threat in the state.\nThe security meeting was attended by representatives of various security agencies in the state.\nObaseki noted, “Drug abuse ranks among the top two of serious security concerns in our state.\nIn his response, Edo State Commissioner of Police, Mr. Abutu Yaro, said that the facts speak for itself, noting that Edo is safer now than before."
  },
  {
    "headline": "2023 Presidency: Nigeria needs bold, business-conscious president – Saraki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFormer Senate President Bukola Saraki says Nigeria must get it right by voting him as the next president of the country in the 2023 general elections.\n“We need somebody who can unite Nigeria, who the youths and the old, North and South can be comfortable with.\nSaraki added that the country needed a president that was business-friendly and understood the private sector and able to change the country’s mono-economy status.\n“We need somebody that can bridge the gap between the young and the old.\nWe need somebody that can create jobs and shore up employment and that can only be done through agriculture, through non-reliance on oil."
  },
  {
    "headline": "STAKEHOLDERS STEP UP FIGHT AGAINST LASSA IN EKPOMA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Stakeholders in Esan West Local Government Area of Edo State have adopted aggressive approaches to fighting Lassa fever disease in the local government.\nEsan West Local Government currently ranks highest in the current outbreak of Lassa fever in Edo State, in terms of number of confirmed cases of the disease.\nAuthorities of Esan West Local Government Council are currently embarking on aggressive environmental sanitation and deratisation of the various communities to eliminate rats.\nThe council, in collaboration with Civil Society groups, such as Josemaria Escriva Foundation, Concerned Ekpoma Eminent Stakeholders Forum and others, are currently embarking on massive sensitization campaign to boost awareness about the disease.\nHe explained that his administration was similarly fighting the dreaded lassa fever disease through massive sensitization campaign to increase awareness about the disease, through collaboration with civil society groups."
  },
  {
    "headline": "JUST IN: Nigeria’s inflation hits 8-month high, up to 16.82% in April 2022",
    "summarized_story": "Nigeria’s consumer price index (CPI) which measures the rate of inflation, increased to 16.82% in April 2022, an 8-month high.\nThis is according to the recently released Consumer Price Index report, released by the National Bureau of Statistics (NBS).\nThe CPI rose by 16.82% year-on-year in April 2022, which is 0.9% points higher than the 15.92% recorded in the previous month (March 2022).\nOn a month-on-month basis, the headline index increased by 1.76% in April 2022, compared to 1.74% increase recorded in the previous month.\nSimilarly, the urban inflation rate increased to 17.35 percent (year-on-year) in April 2022 from 18.68% recorded in April 2021, while the rural inflation rate increased to 16.32% in April 2022 from 17.57% in April 2021."
  },
  {
    "headline": "Seplat Energy announces retirement of A.B.C Orjiako from company’s board",
    "summarized_story": "Indigenous energy firm, Seplat Energy Plc, has announced the retirement of Dr. A.B.C Orjiako from the board of the company after the Annual General Meeting (AGM) scheduled to be held on May 18, 2022.\nThe statement said the outgoing Chairman is actively discussing how he may support Seplat Energy Plc with specific and important external stakeholder engagements he is currently involved in, which will continue after he stands down.\nThe disclosure also stated that no contractual agreement has been made yet, however the contractual role to be performed by Dr. Orjiako will not conflict with the role of the incoming Independent Non-Executive Chairman.\n“To clarify, no contract has been finalised yet and the contractual role to be performed by Dr Orjiako, will not be in conflict with the role of the incoming Independent Non-Executive Chairman”.\n“If a contract is eventually reached, the Company will fully disclose the terms upon signature in compliance with regulatory obligations.”"
  },
  {
    "headline": "Deborah: No part of the Qur’an justifies killing – Tunde Bakare",
    "summarized_story": "The serving overseer of the Citadel Global Community Church, Pastor Tunde Bakare, has condemned the killing of Deborah Samuel, a 200-level student of Shehu Shagari College of Education, Sokoto, murdered over alleged blasphemy.\nIn the statement was titled, ‘Tunde Bakare condemns the Killing of Deborah Samuel, appeals to our common humanity, calls for unity,’ the pastor urged Nigerians to learn live with one another in peace.\nHe said, “It was with deep distress that I received the news of the gruesome killing of Deborah Samuel in Shehu Shagari College of Education, in Sokoto State.\nMy deep condolences go to the family of Deborah Samuel and I pray that we all find in God the comfort and fortitude to bear this great loss.\n“The horrifyingly wicked killing of Deborah Samuel is a wake-up call for us as a nation to once again reflect on our common humanity and reject every form of savagery."
  },
  {
    "headline": "Gunmen invade Anambra community, burn down court, LGA, EEDC offices",
    "summarized_story": "Some unknown gunmen, early Monday morning, invaded Ogidi community in Idemili local government of Anambra State and destroyed property worth millions.\nAnambra State police command has confirmed the incident.\nDSP Tochukwu Ikenga, Public Relations Officer (PPRO) Anambra State Police Command, confirmed the incident in a telephone interview with the News Agency of Nigeria (NAN) on Monday in Awka.\nIkenga said combined response by security operatives and the natives helped to repel the criminals.\n“As we speak, security operatives are still over the incident, and we have put the place under control."
  },
  {
    "headline": "Osasu Walks Down The Aisle With Heartthrob, Nate",
    "summarized_story": "Osasumwen Igbinedion recently walked the down the aisle with her heartthrob, Nathaniel Joshua Ogwuche.\nOsasumwen and Nathaniel were joined in holy matrimony at New Estate Baptist Church, Gudu in the Federal Capital Territory (FCT), Abuja.\nApril 16, 2022 witnessed a love-filled atmosphere for Osasu and Nate, as their families, friends and acquaintances gathered to bear witnessto the solemnization of their love.\nThe highpoint of the event came when the officiating minister pronounced them husband and wife with these words: “These are no longer two but one.\nWhat therefore God has joined together, let no man put asunder."
  },
  {
    "headline": "The Age of Social Media: Friend or Foe?",
    "summarized_story": "but now thanks to the explosion of technology, especially social media, information even about strangers in another continent is now available at the click of a button.\nToday’s society fortunately and unfortunately is largely dependent on social media, not just for information gathering but for socialising, exploring, learning, bullying, intimidation, exposure and more.\nWhile social media is generally about creating wholesome personal influences to immense extents, we are here to see if it’s truly a friend or foe.\nThe older generation see social media as a friendly foe of sorts: friendly, because it allows a wider reach; foe, because clothing these days is suddenly barely even recognised as strips of clothing.\nSocial media helps in tourism promotion and in focusing on best practices for interacting with consumers."
  },
  {
    "headline": "Babu Ranar Komawa Yajin Aikin Malaman Jami’o’i A Nijeriya —ASUU",
    "summarized_story": ""
  },
  {
    "headline": "Batanci Ga Ma’aiki: Gwamnatin Sakkwato Ta Sassauta Dokar Kulle A Fadin Jihar",
    "summarized_story": ""
  },
  {
    "headline": "APC primary: El-Rufai and his unholy game with presidential aspirants",
    "summarized_story": "He is like a political prostitute playing games with APC Presidential aspirants.\nHe is certainly enjoying the game with the party’s delegates from Kaduna State.\nIn that visit four days ago, El-Rufai openly endorsed the aspiration of Tinubu to become president.\nThe Kaduna delegates gave their support after El-Rufai, said he would only rally round any candidate supported by the delegates.\nEl-Rufai and Kaduna delegates dumped Tinubu and pledged to give their votes to Amaechi at the primaries of the party scheduled for end of the month."
  },
  {
    "headline": "Fani-Kayode's money laundering trial stalls again",
    "summarized_story": "The money laundering trial before a Federal High Court in Lagos involving former Minister of Aviation, Femi Fani-Kayode stalls again on Monday.\nThe case which was listed for cross-examination on Monday, could not proceed because of the absence of the trial Judge, Justice Osiagor, said to be on another official assignment.\nEFCC had preferred a 17-count charge bordering on N4.6 billion money laundering against the defendants before a former judge, Justice Mohammed Aikawa.\nThe trial has since begun in the case while witnesses are still being led in evidence before the court.\nThe anti-graft agency said the offense contravened the provisions of sections 15 (3) (4), 16 (2) (b), and 16 (5) of the Money laundering (prohibition) (Amendment) Act, 2012."
  },
  {
    "headline": "National Hospital speaks on Osinachi singing ‘Ekwueme’ in mortuary at night, autopsy report",
    "summarized_story": "The National Hospital in Abuja on Monday dismissed claims that the corpse of popular gospel singer, Osinachi Nwachukwu was singing ‘Ekwueme’ while in the mortuary.\nDr Tayo Haastrup, the spokesman of National Hospital, said there was no proof that Osinachi’s body was singing in the morgue.\nSpeaking with DAILY POST, Haastrup said somebody dead couldn’t be singing while in the morgue.\nFollowing her death, her corpse was deposited in the National Hospital mortuary.\nReports had it that mortuary attendants alleged that Osinachi’s corpse was singing her hit track, Ekwueme, in the middle of the night."
  },
  {
    "headline": "Gunmen reportedly engage military in all-night shootout in Onitsha",
    "summarized_story": "Unidentified gunmen, on Sunday night, allegedly engaged military men in a shoot out at 3-3 Estate, Nkwelle Ezunaka, near Onitsha.\nIt was gathered that the shootout started after the unidentified riffle wielding men took the battle to the door step of the military, in a spot, where they are stationed, within the Estate.\nYesterday night at housing Estate gate, unknown gunmen attacked the military men securing us.\nMy Estate was hot from 10pm – 12am last night.\nIt was learnt that the gunmen also visited the Government Reserved Area (GRA) in Onitsha, where they also shot intermittently."
  },
  {
    "headline": "BREAKING: Arsonists Burn Down LG Secretariat, Magistrate Court In Anambra",
    "summarized_story": "The Idemili North Local Government secretariat and a Magistrate Court in Ogidi were both set on fire by suspected arsonists.\nAccording to sources, the arsonists entered the secretariat on Sunday night to continue the act, destroying all files and property in the secretariat, including the secretariat building.\nThe entire buildings were reduced to rubbles, and vehicles parked within the Local Government secretariat were also burned to ashes, according to videos and photos circulating online.\nThe State Police Command has also acknowledged the incident, blaming it on unknown arsonists.\nDSP Toochukwu Ikenga, the spokesperson of the State Police Command said: “Yes, the incident was confirmed, and our men were there to restore normalcy."
  },
  {
    "headline": "Stop Issuing Death Threats, Islamic Group Cautions Muslims As Another Nigerian Christian Student Is Accused Of Blasphemy",
    "summarized_story": "Naomi Goni, a woman accused of insulting Prophet Muhammad, is at the center of the case (SAW).\nProfessor Ishaq Akintola, the Director of MURIC, issued a statement on Sunday urging the Borno State government to intervene in the problem.\nThe lady in the eye of the storm is Naomi Goni, a student of Ramat Polytechnic, Maiduguri.\nThat is why Muslims of Borno State must allow the police to handle the case of Naomi Goni.\n“We, therefore, appeal to Borno Muslims to stop issuing death threats."
  },
  {
    "headline": "Breaking: Again, Anambra boils as gunmen invade estate, attack Military officers",
    "summarized_story": "Many residents of 3-3 estate at Nkwelle Ezunaka, Oyi Local Government Area of Anambra state, were feared wounded on Sunday night as unknown gunmen engaged the military in a gun duel.\nA military source told Blueprint that the gun duel which lasted for about three hours started around 10pm on Sunday, and led to death of a civilian by stray bullets.\nAccording to the source who preferred anonymity, the unidentified civilian was killed by the road side, even though neither the officers nor the unknown gunmen recorded casualty before they fled.\nThe resident further claimed that the hoodlums had drove to the military check-point in the estate and continuously shot at them, adding, ” Yesterday night.\nMy estate was hot from 10pm – 12am last night.”Blueprint also gathered the gunmen after escaping from the military ran to the Government Reserved Area (GRA) at Onitsha, where they also shot intermittently."
  },
  {
    "headline": "Organisers reveal how to participate in Big Brother Naija Season 7 audition",
    "summarized_story": "Big Brother Naija season 7 has officially commenced with the announcement of its auditions.\nThe organisers made this known via it’s official Twitter handle on Sunday.\n“#BBNaija Season 7 auditions are officially open, are you the next Efe, Miracle, Mercy, Laycon or Whitemoney?\nThe procedureLog on to the audition website by clicking on this link and follow the instructions.\nUpload a three-minute video explaining why you should be chosen including who you are, how you grew up, likes, dislikes, and unique things about you."
  },
  {
    "headline": "Pictures: Gunmen kill suspected police officer, raze another LG headquarters, court in Anambra",
    "summarized_story": "Gunmen, Sunday, launched attacks at different locations in Anambra state, setting ablaze Idemili North Local Government Secretariat and a Magistrate court located at Ogidi.\nAt Oko, sources revealed that the man shot dead at the market was riding on motorcycle when he was accosted by the gunmen around 6pm.\nHowever, when contacted, the Police Public Relations Officer, Anambra state command, Tochukwu Ikenga, a Deputy Superintendent of Police (DSP), described those who set a local government area ablaze as arsonists, but added that normalcy had been restored to the area.\nIkenga, however, disclosed that the man shot dead was not a police officer, even though the force has commenced an investigation to unravel his identity as well as to arrest the perpetrators of the dastardly act.\n“The Anambra State police operatives on 15/5/2022 have recovered a lifeless body in an NPF T-shirt found along Oko expressway."
  },
  {
    "headline": "TCN reconstructs vandalized transmission tower in Uyo",
    "summarized_story": "… Set to energise transmission line soonBy Onu OkorieTransmission Company of Nigeria TCN has disclossed that the reconstruction works on the vandalized transmission Tower Number 104 on Odukpani – Ikot Ekpene 330kV double-circuit transmission line in Akwa Ibom has been completed, while work is ongoing to fortify other towers minimally vandalized along the same line route, to enable the restringing and tensioning of the 330kV DC transmission line, before it is energized.\nThe Executive Director, Transmission Service Provider (TSP) at TCN, Engr.\nAdewumi, who briefed newsmen at the site, said the tower has been reconstructed and work has reached an advanced stage after three weeks, even with difficulties posed by the terrain.\nAdewumi appealed to the public to help TCN in the fight against the vandalism of power infrastructure, saying that such acts are detrimental to Nigerians and the expansion of power infrastructure in Nigeria.\nHe also assured residents of Cross River State and parts of Akwa Ibom State that the company was fast-tracking the completion and restoration process."
  },
  {
    "headline": "Mastercard Foundation subsidized loans will break barriers to MSMEs productivity in Nigeria – Mrs Edu",
    "summarized_story": "By Onu OkorieThe Managing Director, First City Monument Bank FCMB, Yemisi Edun has described the Mastercard Foundation subsidized loans to 100,000 Micro, Small, and Medium Enterprises MSMEs as a purpose-driven intervention that would further help break the barriers that limit MSMEs’ productivity and overall success in Nigeria.\nThe program, which is part of the Mastercard Foundation’s Young Africa Works strategy in Nigeria, aims to sustainably move Nigerian youth out of poverty.\nThe remaining 30 percent will be deployed to meet the funding needs of youth-owned enterprises and businesses run by vulnerable members within Nigeria.\nShe said, “The past few years have been very challenging for individuals, households, and businesses in Nigeria.\n“We are proud to partner with the Mastercard Foundation to rebuild businesses, drive recovery, and stimulate economic growth by providing the much-needed support to Nigerians to engage in productive activities."
  },
  {
    "headline": "ABCON unveils roadmap on ‘save naira’ campaign",
    "summarized_story": "By Kehinde Ibrahim, LagosAssociation of Bureaux De Change Operators of Nigeria (ABCON) has developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nThe ABCON National Executive Council said the move to save the naira was agreed by the body at the conclusion of its meeting in Lagos, where it unveiled strategies for save the local currency, bridge the exchange rate gaps and curb volatility in the forex market.\nThe naira exchanges at N596 to dollar at the parallel market and N415.83 to dollar at the official market creating a rate gap of N180.17 per dollar.\nGwadabe insisted that now is the time to break the current industry monopoly that puts the remittances market in the hands of few players depriving others from tapping into the plan.\nThe ABCON can also be recognized as self-regulatory organization to enable it operate effectively and sanction erring members,” he stated."
  },
  {
    "headline": "Nigeria set to become destination for medical tourism, reverse brain drain – Mohammed",
    "summarized_story": "By Palma IleyeMinister of Information and Culture, Alhaji Lai Mohammed, has said that with the establishment of world class healthcare facilities in Nigeria, the country was set to become a destination for medical tourism, in addition to reversing the brain drain in the health sector.\nMohammed who spoke after a media tour of Duchess International Hospital in Lagos, said the world class healthcare facilities springing up in Nigeria will also curb medical tourism abroad, conserve foreign reserves and create jobs.\n“Today, we are here at the Duchess International Hospital.\nThe Minister said the Federal Government, through the Central Bank of Nigeria and the Bank of Industry, provided financial support for Duchess International Hospital, as part of its intervention in the health sector.\n“With that, we can conserve our foreign reserves, earn foreign exchange for the country, create jobs, reverse brain drain, become a destination for medical tourists and also ensure affordable and standard healthcare for Nigerians,” he said."
  },
  {
    "headline": "Halo financial services launches into Nigeria Fintech space",
    "summarized_story": "By Kehinde Ibrahim, LagosHALO Financial Services Ltd, a fintech start-up has launched with an innovative approach to help Nigerians manage and grow their money.\nSpeaking at a media round table to introduce the company, the Chief Executive Officer and co-founder, Chidimma Onyeokoro disclosed that Halo enables communities to provide financial services to their members.\nCommunity members are able to leverage the strength of their union for better financial returns.\nBy focusing on communities, Halo will be able to scale faster.\nThis allows us to offer a full spectrum of financial services from basic banking to sophisticated investments."
  },
  {
    "headline": "Buhari, Malami Ask Supreme Court To Interpret Section 84(12) Of Electoral Act",
    "summarized_story": "President Muhammadu Buhari and the Attorney-General of the Federation (AGF) and the Minister of Justice, Abubakar Malami, have filed a suit at the Supreme Court, seeking an interpretation of Section 84(12) of the Electoral Amendment Act 2022.\nIn the suit filed on April 29, the President and AGF, who are the plaintiffs, listed the National Assembly as the sole defendant.\nThey are seeking an order of the apex court to strike out the section of the Electoral Act, saying it is inconsistent with the nation’s Constitution.\nThe National Assembly, in its counter-affidavit, filed by its lawyer, Kayode Ajulo, said the Supreme Court cannot be invoked to amend the provision of any law validity made by lawmakers in the exercise of their legislative powers as granted by the Constitution.\nThey argued that the 1999 Constitution, as amended gave the National Assembly the power to make laws for good governance in Nigeria."
  },
  {
    "headline": "Electoral Act: NASS Counters Buhari, Malami On Section 84(12) At Supreme Court",
    "summarized_story": "The National Assembly has countered a suit filed by President Muhammadu Buhari and the Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, on the controversial Section 84(12) of the Electoral Amendment Act 2022.\nWhile the President and minister asked the Supreme Court to interpret the provision of the section of the law, the lawmakers opposed the request to strike it out.\nTheir position was contained in a counter-affidavit filed by the counsel to the National Assembly, Kayode Ajulo, on Monday at the apex court in Abuja.\nAccording to them, the 1999 Constitution as amended gives the National Assembly the power to make laws for good governance in Nigeria.\nREAD ALSO: Buhari, Malami Ask Supreme Court To Interpret Section 84(12) Of Electoral ActBesides seeking interpretation of the contentious section, the President and the minister, in the suit filed on April 29, sought an order of the apex court to strike out the section of the Electoral Act."
  },
  {
    "headline": "Electoral Act: Court Shifts Hearing In PDP’s Suit Against Buhari Till May 24",
    "summarized_story": "The Federal High Court in Abuja has fixed May 24 for the definite hearing in a suit instituted against President Muhammadu Buhari by the Peoples Democratic Party (PDP) on Section 84 (11) and (12) of the Electoral Act 2022.\nOn his own, he raised the issue on the ground that the PDP’s suit bothered on the same section of the law in which a higher court had made a pronouncement that would bind on the lower court.\nBut Oladipupo Okpeseyi, who is the counsel to President Buhari and Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, disagreed with the PDP’s lawyer.\nHe insisted that there was no difference between the suit filed at the court in Umuahia, the Abia State capital, and that of the PDP, saying both cases were on the same section.\nThe PDP had filed a suit against President Buhari at the court, praying for an order of interim injunction restraining him and other defendants from refusing to implement the duly signed Section 84 (12) of the Electoral Act."
  },
  {
    "headline": "Women Affairs Minister, Tallen Withdraws From Senatorial Race",
    "summarized_story": "The Minister of Women Affairs, Pauline Tallen, has announced her withdrawal from the senatorial race ahead of the general elections in 2023.\nMy appointment as the Minister of Women Affairs is indicative of this progress and I cannot lose sight of this opportunity.\nI remain resolute as I continue to relish the opportunity to serve Nigerian women in my capacity as Minister of Women Affairs under the able leadership of President Muhammadu Buhari, GCFR.\nIt will, therefore, be a breach to resign office at this time since this was not done ahead of the stipulated timeline.\nK. Tallen OFR, KSGHonourable MinisterFederal Ministry of Women Affairs"
  },
  {
    "headline": "Indonesia Tourist Bus Crash Kills 14",
    "summarized_story": "At least 14 people were killed and more than a dozen others injured when a bus carrying domestic tourists crashed into an advertising sign in Indonesia’s East Java province early on Monday, police said.\nEarlier, a spokesman for the East Java police blamed the crash on driver error.\nDeadly traffic accidents are common in Indonesia, where vehicles are often old or poorly maintained and road rules are routinely ignored.\nLast month, 16 people were killed when a truck carrying miners crashed into a cliff in West Papua province, police said.\nIn February, 13 people died and dozens more were injured after a tour bus carrying factory workers to a popular beach holiday tipped over and crashed on Java island, according to police."
  },
  {
    "headline": "Finland to apply for Nato membership",
    "summarized_story": "Finland government announced on Sunday that the country will apply for Nato membership.\nMr Niinisto called it a “historic day” for Finland and declared that “a new era is beginning.”Sweden is expected to decide whether or not to apply to Nato in the coming days.\nNato Deputy Secretary General Mircea Geoana stated on Sunday that “Finland and Sweden are already the military alliance’s closest partners.” While Nato Secretary General Jens Stoltenberg recovered from Covid-19, he presided over meetings in Berlin.\nhttps://www.tvcnews.tv/2022/05/uk-set-to-relocate-50-migrants-to-rwanda/Mr Niinisto called it a “historic day” for Finland and declared that “a new era is beginning.”Sweden is expected to decide whether or not to apply to Nato in the coming days.\nNato Deputy Secretary General Mircea Geoana stated on Sunday that “Finland and Sweden are already the military alliance’s closest partners.” While Nato Secretary General Jens Stoltenberg recovered from Covid-19, he presided over meetings in Berlin."
  },
  {
    "headline": "APC inaugurates screening committee ahead party's primaries",
    "summarized_story": "The National Working Committee of the All Progressives Congress has inaugurated its screening committee ahead of the party’s primaries scheduled for 30th of May.The party set up various panels for its two-day screening of 1,693 aspirants.\nThe development was disclosed by the APC National Organising Secretary, Sulaiman Argungu, shortly after the inauguration of chairmen and secretaries of the screening committees.\nHe also disclosed that the party has a set of guidelines in the aspirant assessment and verification forms that will be given to each committee for the screening.\nThe Electoral umpire also says it is ready to monitor political parties’ primary election ahead of the next election and dateline is non-Negotiable.\nHe stated that candidates should send UTMERESULT to 55019 using the same phone number used to register for the examination."
  },
  {
    "headline": "APC Screening for NASS, Governorship candidates Starts in Abuja -",
    "summarized_story": "The All Progressives Congress.APC, has inaugurated the screening committees for its House of Representatives, Senate and Governorship aspirants.\nThe committees were inagurated on Saturday and have since commnced work.https://www.tvcnews.tv/purplegold/post.php?post=197134&action=edit#The screening exercise for each of the three committees has since commenced at various designated centres in Abuja.\nA statement by the National Organising Secretary of the APC, Sulaiman Muhammad Argungu, in Abuja indicated Chairmen and Secretaries of the committees will be inaugurated by noon while the screening exercise will begin immediately at various centres.\nAspirants for the House of Representatives will be screened at Zeus Paradise Hotel, Mabushi, in Abuja while Senatorial and governorship aspirants will have their exercise carried out at Fraser Suites, within the Central Business District, Abuja.\nThe publication of the screening exercise is expected to be released on Sunday."
  },
  {
    "headline": "Why I deleted tweet condemning murder of Sokoto student",
    "summarized_story": "The People’s Democratic Party’s Presidential Hopeful, and former Vice President, Atiku Abubakar says the directive to pull down the reaction to the killing of Sokoto College student, Deborah Samuel should not be misconstrued for condoning religious intolerance.\nThe former vice president said he has been loud on religious issues that tend to divide NigeriansMr. Abubakar spoke, this Friday when he visited Governor Godwin Obaseki in continuation of his effort to woo delegates ahead of the PDP presidential primaries"
  },
  {
    "headline": "Ukraine Forces Reach Border Near Kharkiv as Russians Fall Back",
    "summarized_story": "Ukrainian troops counter-attacking against Russian forces in the country’s northeast have pushed them back from the city of Kharkiv and advanced as far as the border with Russia, Ukrainian officials said on Monday.\nFighting was reported near Kharkiv, Ukraine’s second-largest city, on Monday in what interior ministry adviser Vadym Denisenko said was “our counter-offensive”.\nKharkiv, lying about 30 miles (50 km) from the border with Russia, had endured weeks of heavy bombardments from Russian artillery.\nSince mid-April, Russian forces have focused much of their firepower on trying to capture the Donbas.\nUkraine’s military also acknowledged setbacks, saying Russian forces “continue to advance” in several areas in the Donbas region."
  },
  {
    "headline": "TotalEnergies Invests Almost $30bn in Nigeria Within Eight Years, Government Says",
    "summarized_story": "Nigeria’s federal government has disclosed that French oil major, TotalEnergies EP Nigeria Limited, has invested almost $30 billion in Nigeria’s oil and gas sector within the space of eight years.\nWabote said TotalEnergies had invested immensely in Nigeria and deserved commendation for remaining consistent in investing in the country’s oil sector.\nTerraz expressed excitement at the opportunities that abounded in Nigeria, and indicated the intention of TotalEnergies to expand into the Nigerian electricity sector.\nSangster said TotalEnergies was proud to be the second largest oil and gas producer in Nigeria, contributing 20 per cent of Nigeria’s oil production.\nSangster added that the partnership between TotalEnergies and Nigeria had been a very successful one, pointing out, however, that the journey has not always been smooth."
  },
  {
    "headline": "AfDB President Adesina Meets Mamman Daura, Intensifies Lobby of Buhari’s Circle",
    "summarized_story": "A source told THISDAY that the meeting held behind closed doors as Adesina continues to lobby of Buhari’s circle.\nTo this end, former President Olusegun Obasanjo, is said to have given Adesina his full backing.\nLast week, a coalition made up of 28 groups bought the form for Adesina worth N100 million.\nA friend of the AfDB President said Adesina has concluded plan to take an unpaid leave from the bank if he gets the party’s ticket, to enable him campaign around the country.\nOnyebuchi Ezigbo in Abuja, Chinedu Eze in Lagos, Seriki Adinoyi in Jos, John Shiklam in Kaduna, Segun Awofadeji in Gombe"
  },
  {
    "headline": "Nigeria: Northern Governors, Sheikh Gumi Condemn Murder of Deborah, Appeal for Calm",
    "summarized_story": "In its own reaction, the umbrella organisation of all Christians in Northern Nigeria at the weekend condemned what it described as gruesome and barbaric murder of Deborah.\nAbubakar came under fire for a statement he made via his Twitter handle, defending the killing of Deborah.\nHe maintained that Nigeria was not an Islamic state, adding that Muslims in the country have agreement with people of other faiths to live together peacefully.\n“Even after killing Deborah the miscreants continued to destroy people’s properties, burning of church facilities, and going from house to house intimidating peaceful Christians.\nIt also called on the federal and Sokoto State governments to rise up to the occasion by doing the needful, saying the world is watching."
  },
  {
    "headline": "Ahead of Primaries, Politicians Buy up Abuja Filling Stations’ Fuel, Hotels Fully Booked for Delegates",
    "summarized_story": "Amid fuel scarcity that has gripped the nation’s capital in the past week, it has emerged that top politicians of political parties procured fuel in most petrol stations in Abuja ahead of their primaries.\nMany Abuja hotels have also been fully booked on Saturday, including smaller hotels on the outskirts.\nTHISDAY checks showed that some presidential hopefuls paid for fuel in most petrol stations.\nA source told THISDAY that one top politician paid for fuel in eight filling stations for the benefit of his delegates.\n“You are seeing long queues everywhere because the politicians involved have purchased fuel in most of the petrol stations,” stated the source."
  }
]