[
  {
    "headline": "Edo Assembly: Obaseki meets 162 PDP aspirants, advocates reduction",
    "summarized_story": "The Edo State Governor, Godwin Obaseki, on Wednesday, met with no fewer than 162 Peoples Democratic Party aspirants for the state House of Assembly alongside party leaders and other Edo PDP officials, at the Government House, Benin City.\nThe way we go about this primary election is very important.\nAfter the primary election, we have nine months to prepare and campaign and the journey will not be easy or cheap.\nWe should work in unity to win the forthcoming EDHA election in 2023.\nOn his part, Edo PDP Chairman, Tony Aziegbemi disclosed that 164 aspirants bought the EDHA forms, while 162 persons returned their forms and were screened and cleared to contest the primary election."
  },
  {
    "headline": "2023: I’ll serve Nigeria with all my heart, Osinbajo pledges",
    "summarized_story": "Vice President Yemi Osinbajo, Wednesday in Taraba, said if given the opportunity to lead the country, he would serve with all his heart.\nThis is according to a statement signed on Wednesday by the Senior Special Assistant to the Vice President on Media and Publicity, Laolu Akande, titled ‘If given opportunity to be president, I’ll serve with all my heart—Osinbajo’.\nAccording to Osinbajo, “My reason for aspiring for the office of the President of Nigeria is to serve the Nigerian people.\n“God has given us an opportunity to serve, and that opportunity is one that we must treasure and thank God for.\nAlso at the palace, Governor Ahmadu Fintiri welcomed the Vice President to the State, saying “we pray that God will answer your heart’s desires."
  },
  {
    "headline": "Foundation Gives $420,000 Scholarship AwardsTo 7 Greensprings Students Over STEM Performance",
    "summarized_story": "GreenspringsConrad Foundation, the organizer of Conrad Challenge, has revealed the scholars of this year’s competition, and seven students from Greensprings School, Lekki made the list of global students awarded $60,000 each to study at Clarkson University, USA.\nThe seven students, who were fused into two teams, received the scholarship for their superb STEM projects on smart home security and anti-phishing web browser.\nIn addition to the scholarship, the Foundation also accorded the award of the Most Resilient Team to one of the two teams that represented the school.\nHe said, “We presented two teams (7 students) for this year’s challenge, and they emerged finalists.\n“Olufela Bakare, Oluwatamilore Akinsete, Mueed Muse-Ariyoh, and Esomchukwu Onyiuke are members of the second team called Team MAGMA."
  },
  {
    "headline": "We can’t fold our hands, watch Nigerians killed, kidnapped under APC, says Bauchi Gov",
    "summarized_story": "Says ‘vote PDP, Insecurity Will Vanish In Nigeria’By Ibrahim Hassan-WuyoGovernor Bala Mohammed of Bauchi State has said that they cannot fold their hands and watch innocent citizens being killed and kidnapped every day without doing the needful.\nHe, therefore, called on Nigerians to come out en masse to sack the ruling All Progressives Party, APC, at the national level so as to end insecurity in the country.\nGovernor Mohammed, who is also a Presidential aspirant of the People’s Democratic Party, PDP, said insecurity in the country will definitely vanish as soon as PDP takes over power in 2023.\nSpeaking on the forthcoming presidential convention of his party, he said, “don’t forget we led this country for sixteen years.\nHis words: “Senator Makarfi is one of our leaders who has touched my life and he is somebody, I respect so much."
  },
  {
    "headline": "Our intervention is geared towards addressing affordability, access to prescription drugs — mPharma boss",
    "summarized_story": "Speaking during a virtual launch of its impact report attended by the former Minister of Health, Ghana, Mr. Alex Segbefia, representing the former President of Ghana, H.E.\nRockson disclosed that the company’s intervention was geared towards addressing the issues of affordability and access to prescription drugs caused by excessive margins charged by the various stakeholders along the drug supply chain.\n“We needed a solution to remedy the challenge of availability, accessibility, and affordability of drugs to provide value to patients.\nBy “reviving” these pharmacies, we did not only expand our pharmacy network but, most importantly, increased access to affordable drugs.\nJohn Dramani, congratulated mPharma on promoting good health for all Africans while declaring the launch of the impact report."
  },
  {
    "headline": "2023: PDP shifts dates for LG congress, SHOA, NASS, Governorship primaries",
    "summarized_story": "The National Working Committee (NWC) of the Peoples Democratic Party (PDP), has updated the party’s timetable and schedule of activities for the 2023 general elections.\nThe party disclosed this in a statement by its National Publicity Secretary, Debo Ologunagba, in Abuja on Wednesday.\nAccording to Ologunagba, the Local Government Area (LGA) Congress to elect one National Delegate per LGA and one Person With Disability in the 774 Local Government Areas, holds on Tuesday, May 10.\nHe also said that the State House of Assembly (State Constituency Congress), according to the updated timetable, will hold on Wednesday, May 18, while House of Representatives Primaries will hold on Friday, May 20.\nHe added that the Senatorial District Primaries has also been fixed for Saturday, May 21, and the Governorship Primaries for Monday, May 23."
  },
  {
    "headline": "UN reiterates support for Nigeria in peace building",
    "summarized_story": "UN Secretary-General António GuterresThe UN Secretary-General, Antonio Guterres, on Wednesday reaffirmed the organisation’s commitment to supporting Nigeria for the good of the citizenry.\nGuterres said this at the wreath-laying ceremony in Abuja on the sideline of his two-day official visit to Nigeria.\nTallen commended Guterres support for women and children, adding that he was a man with a large heart, committed to promote the wellbeing of Nigerian women and children.\nMeanwhile, Dr Betty Edu, National Women Leader of the All Progressives Congress (APC), said that they they attended the meeting to advocate rights of Nigerian women participation in politics.\n“Today the message was clear that for Nigeria to achieve SDGs, it is important for political parties to support the country achieve SDG and its policies."
  },
  {
    "headline": "ASUU strike: Amaechi, Wike don’t value education – Nigerians lament",
    "summarized_story": "The numbers of presidential aspirants have continued to increase daily while ASUU and the government fail to reach truce.\nOthers are Adams Oshiomhole, former Governor of Edo State; Kayode Fayemi, Ekiti State Governor; Godswill Akpabio, Minister of Niger Delta, and Chris Ngige, Minister of Labour and Employment.\nHere are some reactions gathered by DAILY POST from Twitter;@Arekunmi “ None of these aspirants has even used “ending the ASUU strike card” in their declaration campaigns.\nWhen this is all over, they will find a way to defend this mediocrity.”@Aniefiokdebest “The multiple declaration for the 2023 presidency by politicians has turned the exercise to a child play.\nFor goodness sake, how can individuals who cannot solve common ASUU strike, pay workers salary, implement the N30,00 minimum wage be declaring for president?"
  },
  {
    "headline": "ASUU strike: FG’s failure to meet lecturers’ demands, sign of misplaced misplaced priorities – UniUyo Don",
    "summarized_story": "A lecturer at University of Uyo and the Akwa Ibom State University, Dr. Clement Obadimu, has attributed the failure of the federal government to meet the demands of the Academic Staff Union of Universities, ASUU, to misplaced priorities.\nObadimu, who stated this on Wednesday during an interaction with journalists, regretted that FG has placed certain things above ASUU’s problems.\nObadie, a lecturer in the department of Institute of Safety, Health, Security and Environmental Studies on voluntary services, said the ASUU demands were not beyond the scope of the federal government.\nI am not speaking for ASUU, I am not a member of ASUU because I teach on voluntary services, but the government should be able to solve ASUU problems.\nI know abroad that private individuals normally come together to salvage such a situation like that.”"
  },
  {
    "headline": "My mother’s dream for Nigeria will soon be fulfilled – MKO’s daughter",
    "summarized_story": "Hafsat Abiola-Costello, the daughter of late MKO Abiola, has stated that the dream of her mother, late Kudirat Abiola, for a better Nigeria would soon be actualized.\nAccording to Abiola-Costello, her mother’s dream was for Nigerian women to have bountiful opportunities like their male counterparts.\nAbiola-Costello, who is the Director-General of the Yahaya Bello Presidential Campaign Organisation, stated this on Wednesday in Akure, the Ondo State capital.\nShe maintained that Nigerian women need someone who will give them voice, adding a Yahaya Bello presidency will uplift them beyond their expectations.\n“I am so happy that Nigerian women have decided, for once, to take their destinies in their hands."
  },
  {
    "headline": "Police take action as pastor collects money from members to take them to ‘heaven’",
    "summarized_story": "The Ekiti State Police Command on Wednesday said that it has investigated a cleric of Christ High Commission Ministry, Pastor Noah Abraham, for allegedly collecting money from members of his church on a promise to take them to heaven after rapture in Araromi Ugbeshi-Ekiti, Ekiti State.\n“Based on an intelligence report received by the Command on 25/04/2022 concerning the religious activity, the Area Commander, Omuo-Oke led a team of detectives to the church camp at Araromi Ugbeshi-Ekiti.\nThe pastor was subsequently invited to the station for interrogation.\n“Meanwhile, Pastor Noah Ade Abraham, after thorough investigation, was arraigned accordingly.\n“The Command pledges to closely monitor any suspicious activity by any person or group of persons across the State to ensure that the lives and properties of innocent citizens are totally protected,” the statement said."
  },
  {
    "headline": "Sanwo-Olu warns youths against sleeping with dogs",
    "summarized_story": "The wife of Lagos State Governor, Ibijoke Sanwo-Olu, has warned Nigerian youths against committing bestiality.\nSanwo-Olu said this on Wednesday at a special Eid-El-Fitr celebration at Lagos House, Alausa, Ikeja to mark the end of Ramadan.\nThe media space has been filled with viral reports, videos of ladies allegedly sleeping with dogs for money.\nSome reports cited ladies in Lekki area of Lagos state as culprits.\nSanwo-Olu advised parents and guardians to watch their wards and intrude into their privacy to keep them on the right path."
  },
  {
    "headline": "Ex-convict jailed seven years for stealing in Ekiti",
    "summarized_story": "Ex-convict jailed seven years for stealing in EkitiAn Ado-Ekiti Magistrates’ Court yesterday sentenced a 26-year-old man, Femi Ayelegun, to seven years imprisonment for stealing a N45,000 phone from a car.\n“In view of this, the defendant is sentenced to seven years imprisonment as provided for by Section 302 (1) (b) of the Criminal Code, Laws of Ekiti State, 2021,” she ruled.\nSodiq Adeniyi, told the court that the convict committed the offence sometime in 2021 at Okuta-Gbokuta-Lori Area in Ado-Ekiti.\nAdeniyi said the convict stole a phone valued at N45,000 inside a Nissan Almera car with registration number KLE 71 AA, belonging to one Mr Olumide Omoyajowo.\n“He has been imprisoned three times in the past, therefore, I urge the court to give him the punishment he deserves,” the prosecutor told the court."
  },
  {
    "headline": "Ogun governor’s suspended aide pleads guilty to $350,000 fraud in US",
    "summarized_story": "Abidemi Rufai, the suspended aide of Ogun State Governor Dapo Abiodun, has pleaded guilty in a United States district court in Tacoma to wire fraud and aggravated identity theft.\nRufai was also said to have submitted fraudulent pandemic unemployment claims in at least 17 other states including Hawaii, Wyoming, Massachusetts, Montana, New York, and Pennsylvania.\n“Between 2017 and 2020, Rufai attempted to obtain more than $1.7 million in IRS tax refunds by submitting 675 false claims.\n“Rufai’s efforts to enrich himself with false disaster claims did not start with COVID-19.\nIn September and October 2017, he submitted 49 disaster relief claims connected to Hurricane Harvey and Hurricane Irma."
  },
  {
    "headline": "Soldiers kill IPOB suspects in Abia",
    "summarized_story": "Soldiers of 14 Brigade Army Headquarters, Ohafia, Abia State, have reportedly killed gunmen suspected to be members of the Indigenous People of Biafra (IPOB).\nThe number of the IPOB suspects killed was, however, disputed.\nThe Nation learnt that the IPOB members marched through popular streets and markets yesterday, warning traders and residents of dire consequences if they disobeyed IPOB’s sit-at-home order today and Friday.\nThe sit-at-home order was announced by gun-wielding men dressed in black.\nA source at the 14 Brigade said that members of the proscribed group had a face-off with soldiers that led to the gunfight."
  },
  {
    "headline": "Niger NLC laments over cost of farm inputs",
    "summarized_story": "The Niger State chapter of the Nigeria Labour Congress (NLC) has lamented the escalation in the market prices of farming inputs.\nThis, it said has left the farmers struggling to cope with farming activities.\nWhile drawing the attention of the state government to the plights of the farmers, the organised labour stressed the need for the Niger State Government to provide subsidised farm inputs for the farmers across the state to guarantee a bumper harvest.\nAt the celebration of the International Workers’ Day held at the Idris Legbo Kutigi Conference Centre in Minna, the State NLC Chairman, Comrade Yakubu Garba said farmers can no longer cope with the escalation of the market price of farming inputs such as fertilisers, insecticides and seedlings, among others.\nGarba stated that agriculture is the most critical sector of the state’s economy due to the large population that depends on farming."
  },
  {
    "headline": "Law School students to Lalong: pay our seven years’ bursary",
    "summarized_story": "The Plateau State Law School Students’ Association (PLALAWSA) has appealed to Governor Simon Lalong to pay their seven years backlog of bursaries.\n“What Lalong may not know is that it was former Governor Jonah Jang, who remodelled and increased the law school bursary.\nJang is not a lawyer, yet he did that to encourage law students in their quest for knowledge.\n“The late Tsenba had to sell his rice farm, just to raise money so that Governor Lalong could go to the law school.\n“Surprisingly, after benefitting from the bursary scheme, Governor Lalong has refused to pay his juniors, some of whom are still struggling to complete the law school programme,” he lamented."
  },
  {
    "headline": "The Sun awards: Frank Edoho is host, Teni to thrill audience",
    "summarized_story": "Popular television host and filmmaker, Frank Edoho, of “Who Wants to be a Millionaire” fame, will be at the centre stage during the celebration of The Sun Awards 2021 on Saturday, May 7, 2021.\nAlso, celebrated Nigerian-America singer, songwriter and entertainer, Teniola Apata, pop-ularly known as Teni, will thrill audience at the award ceremony.\nTwenty-six Nige-rians, including Senate President, Ahmad Lawan, five governors and others, will receive various awards.\nEdoho, unarguable one of the most admired television game show host in Africa, will compere the award ceremony, in style and panache.\nHis broadcasting career started at the Cross River State Broadcasting Corporation, where he worked as a presenter."
  },
  {
    "headline": "$1.53bn Lekki Deep Seaport to wrest Nigeria’s lost cargoes from Ghana, Togo, others –FG – The Sun Nigeria",
    "summarized_story": "By Steve Agbota and Charity NwakauduFederal Government on Wednesday said that with the complete development of the Lekki Deep Seaport, Nigeria will wrest lost cargoes from Togo, Ghana and Côte d’Ivoire.\n“We have just concluded a tour of the Lekki Deep Sea Port here at the Lagos Free Zone, located some 65 kilometres east of Lagos.\n“You have seen for yourselves, the Lekki Deep Sea Port, a Build, Own, Operate and Transfer concern, is a massive project, a game changer and a pace setter.\nIt is the deepest sea port in Nigeria and West Africa, and that in itself is a unique advantage.\n“With this port, Nigeria will become a transshipment hub and the revenue we are currently losing to our neighboring countries will come here."
  },
  {
    "headline": "UN mobilising $321m to support Nigeria’s terrorism fight, combat humanitarian crisis –Guterres",
    "summarized_story": "From Juliana Taiwo-Obalonye, Abuja and Oluseye Ojo, Ibadan and Chukwudi NwejeThe United Nations is mobilising $321 million to support Nigeria’s ant-insurgency war and address humanitarian crisis in the North East.\nThe Secretary General, Antonio Guterres, made the disclosure when he briefed State House Correspondents after he met with President Muhammadu Buahri, yesterday.\nMeanwhile, UN Secretary General, has been urged to act decisively to rescue Nigeria from sliding into war.\n“Before war breaks out in Nigeria with the humanitarian crisis this portends for the entire West African subregion and even beyond, please act decisively.\n“Speak with octogenarian Reuben Fasoranti, erstwhile leader of Afenifere, whose daughter was murdered in her prime by Fulani herdsmen."
  },
  {
    "headline": "Anambra: APGA screens 130 Assembly aspirants, rejects 14",
    "summarized_story": "From Obinna Odogwu, AwkaThe All Progressives Grand Alliance (APGA) has screened a total of 130 House of Assembly aspirants in Anambra State ahead of its primary slated for May 24.\nOut of the 130 aspirants screened at the party’s secretariat in Awka, the state capital, 116 were cleared to contest the primary, while 14 were rejected.\nSecretary of the screening committee, Carol Dike-Okoroafor, who signed the result of the screening, however, failed to give reasons for the disqualification of the 14 aspirants by the committee.\nOne of the cleared aspirants, Gozie Obijekwu, for Idemili South state constituency, told Daily Sun that he was in the race to give his people quality representation in the House.\nHe said he has the ideas on the right legislation that would bring developments and economic growth to the state and particularly for the people of Idemili South."
  },
  {
    "headline": "Roll out of 5G services to commence August –NCC",
    "summarized_story": "By Chinenye Anuforo and Adanna Nnamani, (Abuja)The Nigerian Communications Commission (NCC) has disclosed that the rollout of Fifth Generation (5G) Spectrum services are expected to commence from August 24, 2022.\nIn the same vein, the Commission has confirmed issuance of the final letters of award of the 5G spectrum licences to MTN and Mafab Communications, winners of the 3.5 gigahertz (GHz) spectrum auction conducted in December 2021.\nIn line with the terms and conditions of the 5G licence, the licensees are expected to commence rollout of 5G services, effective from August 24, 2022.\n“The 5G network, when deployed, will bring a lot of benefits and opportunities that will engender accelerated growth and smart living in the country.\n“Subsequently, the Commission, on February 24, 2022, confirmed the full payment of $273.6 million each by the two spectrum winners, in addition to spectrum assignment fee paid by MTN, for the 5G spectrum licence."
  },
  {
    "headline": "Buhari Meets UN Scribe, Guterres, at Aso Villa",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari Wednesday met with the Secretary General of the United Nations (UN), Antonio Guterres, at the State House, Abuja.\nThe president received the UN chief and his team at the forecourt of the Presidential Villa at about 3.03pm.\nAfter a brief welcome ceremony, President Buhari led Guterres to his office where they had a meeting before returning to brief the media.\nAt the briefing, President Buhari stressed the importance of the visit at a time the world’s attention is focused on the Russia-Ukraine war.\nIn his remark, Guterres said his visit was in solidarity with victims of terrorism."
  },
  {
    "headline": "2023: Jigawa Gov, Badaru, Joins Presidential Race",
    "summarized_story": "Ibrahim Shuaibu in DutseJigawa State Governor Muhammad Badaru Abubakar has declared interest in contesting the 2023 presidential election on the platform of the All Progressives Congress (APC).\nKila said: “It is true that Governor Badaru has travelled to Abuja to secure nomination form for the 2023 presidential election.”He explained that his principal has the necessary wherewithal to lead the country to the promised land.\nTHISDAY gathered that on Tuesday evening, the governor informed the party’s stakeholders of his ambition to contest for the presidency.\nGovernor Badaru informed the gathering that he will seek for the blessing of President Buhari before purchasing the form.\nThe governor has since left the state capital, Dutse, for Abuja to obtain the form ahead of the presidential primary elections of the party."
  },
  {
    "headline": "UN Scribe, Guterres: The Borno I Found Today is One of Hope",
    "summarized_story": "Michael OlugbodeSecretary-General of United Nations, Antonio Guterres, yesterday, said Borno State, the hotbed of Boko Haram, has begun to wear a new look and new hope.\n“This is not the Borno that I found today.\nThe Borno I found today is a Borno of hope.\nI am grateful to all those from the international community that have supported the people of Borno with humanitarian assistance.\nWhile expressing delight with the achievements of Borno State Governor, Prof. Babagana Zulum, the UN Secretary-General said: “So, I will be your advocate, Mr."
  },
  {
    "headline": "Akeredolu to Buhari: It’s Southerners’ Turn to Produce Next President",
    "summarized_story": "Akeredolu insisted that it was the turn of the southern part of the country to produce the next president.\nBut Akeredolu, in a statement he personally signed, stressed the need for the president and the APC leadership to ensure that the southern part of the country produced the next president.\nAkeredolu maintained that it was the turn of the southern part of the country to produce the next president, and the APC leadership should have no difficulty in making a pronouncement on the issue.\nThe governor stated, “We must not keep our party men and women guessing on the position of the leadership of the party.\nThis country belongs to all of us.”The elder statesman said the treatment meted out to former President Goodluck Jonathan by the north remained unacceptable."
  },
  {
    "headline": "NDLEA: Ukatu, Billionaire Drug Baron, Imported N22bn Worth of Tramadol in One Month",
    "summarized_story": "Michael OlugbodeThe National Drug Law Enforcement Agency (NDLEA) has alleged that a billionaire drug baron, Chief Afam Ukatu, imported into Nigeria two containers containing 1,284 cartons of tramadol, with the market value of over N22 billion, in October 2019.\nNDLEA said in a statement yesterday that its on-going investigation of Ukatu had uncovered the importation of the banned drug.\nHe further said Ukatu owned pharmaceutical and plastic manufacturing companies, which he used as a cover to import illicit drugs into Nigeria.\nHe said the financial instruments suspected to be counterfeits were discovered last Wednesday at the NAHCO export shed of the Lagos airport during cargo examination of some consignments meant for exportation to the UK on a cargo flight.\nBabafemi also disclosed that a breakdown of the cheques showed they had monetary values of $287, 623.31; $1,456,300 and €1,297,800."
  },
  {
    "headline": "PHOTONEWS: Nigeria’s Corrupt Attorney-General, Malami’s Ongoing Rice Mill Construction Worth N5billion Located In Kalgo, Kebbi State Amid Allegations Of Fraud, Sale Of Justice",
    "summarized_story": "PHOTONEWS: Nigeria's Corruption-riddled Attorney-General Malami Launches New Hotel Few Days After Being Exposed For Distributing Multi-billion Naira Vehicles As Bribes To @OfficialAPCNg Party Officials In Kebbi | Sahara Reporters https://t.co/80sIGWSYl4 pic.twitter.com/IcOeUZ9xqZ"
  },
  {
    "headline": "PHOTONEWS: Nigeria’s Corrupt Attorney-General, Malami’s Ongoing Rice Mill Construction Worth N5billion Located In Kalgo, Kebbi State Amid Allegations Of Fraud, Sale Of Justice",
    "summarized_story": "PHOTONEWS: Nigeria's Corruption-riddled Attorney-General Malami Launches New Hotel Few Days After Being Exposed For Distributing Multi-billion Naira Vehicles As Bribes To @OfficialAPCNg Party Officials In Kebbi | Sahara Reporters https://t.co/80sIGWSYl4 pic.twitter.com/IcOeUZ9xqZ"
  },
  {
    "headline": "PHOTONEWS: Nigeria’s Corrupt Attorney-General, Malami’s Ongoing Rice Mill Construction Worth N5billion Located In Kalgo, Kebbi State Amid Allegations Of Fraud, Sale Of Justice",
    "summarized_story": "PHOTONEWS: Nigeria's Corruption-riddled Attorney-General Malami Launches New Hotel Few Days After Being Exposed For Distributing Multi-billion Naira Vehicles As Bribes To @OfficialAPCNg Party Officials In Kebbi | Sahara Reporters https://t.co/80sIGWSYl4 pic.twitter.com/IcOeUZ9xqZ"
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Attorney-General, Malami Opens Multi-billion Naira Hotel Few Days After Distributing Exotic Vehicles To APC Supporters",
    "summarized_story": "Nigeria's Minister of Justice and Attorney-General of the Federation (AGF), Abubakar Malami, has opened a new hotel, “The Azbir” in Birnin Kebbi, Kebbi State.\nThe hotel is another addition to the numerous multi-billion naira properties owned by the minister.\nThis is coming a few days after the minister distributed over 100 exotic cars to ruling All Progressives Congress members ahead of the party’s governorship primary in Kebbi State.\nMalami had last Thursday declared interest in the Kebbi State governorship race.\nMalami also built a N3billion multipurpose event centre in Kebbi State named Azbir Arena for his son in Kebbi."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Attorney-General, Malami Opens Multi-billion Naira Hotel Few Days After Distributing Exotic Vehicles To APC Supporters",
    "summarized_story": "Nigeria's Minister of Justice and Attorney-General of the Federation (AGF), Abubakar Malami, has opened a new hotel, “The Azbir” in Birnin Kebbi, Kebbi State.\nThe hotel is another addition to the numerous multi-billion naira properties owned by the minister.\nThis is coming a few days after the minister distributed over 100 exotic cars to ruling All Progressives Congress members ahead of the party’s governorship primary in Kebbi State.\nMalami had last Thursday declared interest in the Kebbi State governorship race.\nMalami also built a N3billion multipurpose event centre in Kebbi State named Azbir Arena for his son in Kebbi."
  },
  {
    "headline": "ASUU strike: It’s sad that we're talking about elections when schools are closed, says Peter Obi",
    "summarized_story": "Peter Obi, former Anambra governor and presidential hopeful on the platform of the Peoples Democratic Party (PDP), says it is sad that federal universities are on strike while politicians are campaigning for the 2023 elections.\nIt is intolerable that schools are closed and we are campaigning and we are even talking about elections.\nObi said if he is elected to rule the country, he will make primary and secondary education free, but not for tertiary level.\nAdvertisement“I won’t make tertiary education free.\nPrimary and secondary will be free, but we must find a way to fund tertiary education,” he said."
  },
  {
    "headline": "ASUU strike: It’s sad that we're talking about elections when schools are closed, says Peter Obi",
    "summarized_story": "Peter Obi, former Anambra governor and presidential hopeful on the platform of the Peoples Democratic Party (PDP), says it is sad that federal universities are on strike while politicians are campaigning for the 2023 elections.\nIt is intolerable that schools are closed and we are campaigning and we are even talking about elections.\nObi said if he is elected to rule the country, he will make primary and secondary education free, but not for tertiary level.\nAdvertisement“I won’t make tertiary education free.\nPrimary and secondary will be free, but we must find a way to fund tertiary education,” he said."
  },
  {
    "headline": "'I won't let Nigeria sink' -- Akpabio joins presidential race",
    "summarized_story": "Godswill Akpabio, minister of Niger Delta affairs, has declared his intention to run for president on the platform of the All Progressives Congress (APC).\nHe announced his intention on Wednesday at an event held at the Ikot Ekpene stadium in Uyo, the Akwa Ibom capital.\nAkpabio said he is determined not to let Nigeria sink because the “deep well of experiences” he gathered in service has prepared him for the presidential position.\n“You have heard a lot of declarations but this one is uncommon,” Akpabio said.\nI am determined not to let our nation sink but drink from the deep well of experiences I have from service."
  },
  {
    "headline": "'I won't let Nigeria sink' -- Akpabio joins presidential race",
    "summarized_story": "Godswill Akpabio, minister of Niger Delta affairs, has declared his intention to run for president on the platform of the All Progressives Congress (APC).\nHe announced his intention on Wednesday at an event held at the Ikot Ekpene stadium in Uyo, the Akwa Ibom capital.\nAkpabio said he is determined not to let Nigeria sink because the “deep well of experiences” he gathered in service has prepared him for the presidential position.\n“You have heard a lot of declarations but this one is uncommon,” Akpabio said.\nI am determined not to let our nation sink but drink from the deep well of experiences I have from service."
  },
  {
    "headline": "US raises interest rates by 50 points -- the biggest hike in two decades",
    "summarized_story": "The United States Federal Reserve (Fed) has raised its interest rate by 50 basic points — the biggest hike since 2000 — in an effort to curb rising inflation.\nThe bank’s federal open market committee (FOMC) unanimously voted to increase the benchmark rate by a half percentage point on Wednesday.\nAdvertisement“The committee seeks to achieve maximum employment and inflation at the rate of two per cent over the longer run.\n“In assessing the appropriate stance of monetary policy, the committee will continue to monitor the implications of incoming information for the economic outlook.\nThe committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the committee’s goals."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Don’t miss the May edition of Techpoint Africa Pitch Friday",
    "summarized_story": "Share this article:For the third straight month, Techpoint Africa will be hosting entrepreneurs and startup enthusiasts at Techpoint Pitch Friday.\nIf you didn’t know what Pitch Friday is, here’s a reminder: Techpoint Pitch Friday provides early-stage founders and aspiring entrepreneurs with a platform to share their business ideas or businesses.\nPitch Friday holds once a month, and admission is free.\nFor the May edition, the date is Friday, May 13, 2022, by 5 pm.\nI’m confident this is an event you would not want to miss, so register here."
  },
  {
    "headline": "Report: The impact of Y Combinator in Africa over the years",
    "summarized_story": "The California-based startup accelerator founded in 2005 has become a prominent force in the global startup ecosystem.\nIt won’t be an overstatement to consider it the mecca for African startups.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, partnered with YC to give an account of YC’s activities in Africa since 2009.\nThis collaboration has produced Y Combinator in Africa: A report about African startups that have gone through Y Combinator’s Accelerator Programme.\nThe report examines the distribution of YC-backed African startups using various criteria."
  },
  {
    "headline": "Meta needs to get over TikTok",
    "summarized_story": "AdvertisementI understand that this may be a source of frustration for the Meta team, but wasn’t it just last month that Instagram said it would stop recommending TikTok videos to the users?\nWell, today, I’ll be discussing:Twitter is testing Twitter CircleFacebook to shut down its podcast platformTwitter is testing Twitter CirclePhoto by Claudio Schwarz | @purzlbaum on UnsplashYesterday, Tuesday, May 3, 2022, Twitter announced a limited test for Twitter Circle.\nWhat’s Twitter Circle?\nEven though Communities also hide tweets — an attempt to prevent “context collapse” —Twitter Circle differs because Communities are tied to specific discussions.\n😂😂 And even if you can’t create a Twitter Circle, you can see tweets from users who can, as long as you’re in their Circle."
  },
  {
    "headline": "Five ways Mushe is transforming the Digital Banking space",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Offering real-world applications, financial education and a strong community, Mushe is the one-stop-shop for cypto.\nXMU is interoperable across fiat and crypto, the Mushe Wallet is seamlessly integrated, and users can trade and transfer with Mushe Swap.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration : https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Five Cryptocurrencies That Everyone Should Have In Their Portfolio",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:According to data from Coingecko, there are over 16,000 cryptocurrencies in circulation.\nThe five cryptos are:Ethereum (ETH) XRP (XRP) Gala Games (GALA) Chiliz (CHZ) FIREPIN Token (FRPN)Let’s take a look at why we think these five cryptos will be good additions to your portfolio.\nAs the Metaverse gains traction, expect to see the early adoption tokens such as Gala Games (GALA) see significant price increases.\nFind Out More Here:Join Presale: https://presale.firepin.io/registerWebsite: https://firepin.io/Telegram: https://t.me/FIREPINOFFICIALTwitter: https://twitter.com/FIREPIN_ioBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Obaseki meets 162 PDP aspirants for Edo House of Assembly, warns against money-bag politics, bitterness – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe governor met with the aspirants alongside party leaders and other Edo PDP officials, at the Government House, Benin City.\nThe way we go about this primary election is very important.\nAfter the primary election, we have nine months to prepare and campaign and the journey will not be easy or cheap.\nWe should work in unity to win the forthcoming EDHA election in 2023.\nOn his part, Edo PDP Chairman, Tony Aziegbemi disclosed that 164 aspirants bought the EDHA forms, while 162 persons returned their forms and were screened and cleared to contest the primary election."
  },
  {
    "headline": "PDP primaries: Edo High Court refuses to grant ex-parte order against Ayu, Obaseki, others – Nigerian Observer",
    "summarized_story": "The action was instituted by one Mr. Eghe Adun, an old PDP member believed to be loyal to the South-South Vice Chairman of the PDP, Chief Dan Orbih.\nListed as defendants in the case with suit number HAB/46/2022 are the Peoples Democratic Party, Senator Iyorchia Ayu, Dr Tony Aziegbemi and His Excellency, Godwin Obaseki.\nThe court, sitting in Abudu, refused to countenance the ex-parte application, but deferred hearing in the matter to the 12th of May, 2022.\nOmoregie Ogbeide-Ihama, member representing Oredo in the House of Representatives sponsored a similar suit at the Federal High Court Abuja, with suit number FHC/ABJ/CS/ 598/2022.\nThey are seeking to restrain the PDP, Dr. Iyorchia Ayu, Senator Sam Anyanwu, Hon."
  },
  {
    "headline": "Flush Out Quacks, Shaibu Urges Society of Engineers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Deputy Governor, Rt.Hon.\nComrade Philip Shaibu, has appealed to the Nigerian Society of Engineers((NSE),to monitor the activities of its members and flush out quacks from the engineering profession as a panacea to checkmate incessant building collapse in the country.\nThe Deputy Governor made the appeal, when he played host to members of the Nigerian Society of Engineers, Benin branch, at the Government House, Benin City.\nEarlier in his address, the Chairman,Nigerian Society of Engineers, Benin Branch,Engr.\nOmoregie Ehigie Armstrong, stated that, they were in Government House, to inform the Deputy Governor of their up coming Founders Day celebration."
  },
  {
    "headline": "Shaibu Tasks Youths on Actualization of Set Goals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Deputy Governor, Rt.Hon.\nComrade Philip Shaibu, has called on Nigerian youths to take advantage of the numerous opportunities created by government to better their lives.\nThe Deputy Governor made the call in Fugar, the administrative headquarters of Etsako Central Local Government, during a civic reception in honour of Engr.\nAccording to Shaibu:” Edo State Government is committed to ensuring that youths are given their pride of place in the scheme of things.\nIn his address,the celebrant, Edo State Commissioner for Environment and Sustainability, Engr."
  },
  {
    "headline": "2023: Ogbonnaya Onu to announce presidential bid on Friday",
    "summarized_story": "Ogbonnaya Onu, minister of science and technology, is set to declare his intention to run for president under platform of the All Progressives Congress (APC) ahead of the 2023 elections.\nOnu will join a growing list of aspirants that have already declared their intention to run for president under the ruling party’s platform.\nOn Wednesday, Godswill Akpabio, minister of Niger Delta affairs; Kayode Fayemi, governor of Ekiti and Adams Oshiomhole, a former governor of Edo; all formally declared their interest to run for president.\nOther presidential hopefuls on the platform of the APC include Rotimi Amaechi, minister of transportation; Bola Tinubu, former Lagos governor; Vice-President Yemi Osinbajo; Dave Umahi, governor of Ebonyi; Rochas Okorocha, former governor of Imo; Yahaya Bello, governor of Kogi, and Chukwuemeka Nwajiuba, minister of state for education.\nChris Ngige, minister of labour and employment, has also announced his presidential ambition, while Jigawa State governor, Mohammed Badaru Abubakar, is said to have also joined to presidential race and had purchased APC’s N100 million nomination forms."
  },
  {
    "headline": "MTN, Airtel, others justify planned 40% hike in call, data tariffs",
    "summarized_story": "Telecom providers in Nigeria under the aegis of Association of Licensed Telecommunications Operators of Nigeria (ALTON) has justified their decision to increase data and call tariffs by 40 percent.\nAccording to them, the rising cost of operation in the country prompted its request for an increment in the cost of services offered by its members.\nThe request if granted, will lead to about a 40% increase in the cost of calls, data, and SMS.\n“With respect to voice an SMS cost, ALTON respectfully requests the commission to consider a mark-up approach to address the upward price adjustment desirable for the industry.\nExcerpts from the report, are attached and marked ‘Annexure 2’ to provide a further illustration,” it added"
  },
  {
    "headline": "BREAKING: Atedo Peterside joins SDP ahead of 2023",
    "summarized_story": "Mr. Atedo Peterside, founder and president of Anap Foundation and Anap Jets, has joined the Social Democratic Party (SDP) ahead of the 2023 general elections.\nPeterside, who is also the founder of Stanbic IBTC Bank; Co-Chair of Agenda 2050 Steering Committee and convener of GoNigeria, noted that he took the decision because it was necessary for everyone to get involved in politics.\n“After deep reflection, I decided to join the Social Democratic Party (SDP).\nMy main reasons for backing them are listed on flyer below.\nIt is important for all adults to join a political party of their choice,” he wrote via his twitter handle."
  },
  {
    "headline": "Nigerian pastor sentenced to life in prison for defiling friend’s twin daughters",
    "summarized_story": "Michael Oliseh, a 54-year-old pastor, has been sentenced to life in prison by an Ikeja Domestic Violence and Sexual Offences Court in Lagos State, for defiling his friend’s 12-year-old twin daughters.\nJustice Abiola Soladoye who delivered the judgment on on Wednesday, described Oliseh, the assistant Pastor of the Anointed Chosen Vessel Ministry in Okota, Lagos, as a “serial rapist” who took turns defiling his friend’s daughters.\nThe judge sentenced Oliseh to life imprisonment on the two-count charge bordering on defilement.\n“What a disloyal and untrustworthy pastor, who shamelessly and audaciously had sexual intercourse with his friend’s children who were entrusted in his care.\nNAN reports that the prosecution said the offences violated Section 137 of the Criminal Laws of Lagos State, 2015."
  },
  {
    "headline": "IPOB Denies Beheading Military Couple In Imo",
    "summarized_story": "The outlawed separatist group, Indigenous People of Biafra (IPOB), has reacted to the beheading of a military couple in Imo State, denying involvement in the murder.\nIPOB in a statement on Wednesday signed by its spokesperson, Emma Powerful, disclosed that the group has no hand in the killing.\nThe statement reads; “Our attention is drawn to the laughable and fallacious statement credited to the Nigeria Army that IPOB is responsible for the killing of a couple on transit in Imo State after their marriage ceremony.\n“We, therefore, wish to place on record that IPOB has no hands in the said atrocity which is an abominable act in Igbo tradition.\n“These agents of death some of whom we have made their identities public severally are behind the killings of these soldiers, not IPOB or ESN operatives.”"
  },
  {
    "headline": "2023: Jonathan Presidency Will Stabilise Nigeria – MOSIEND",
    "summarized_story": "The Movement for the Survival of Izon Ethnic Nationality in the Niger Delta (MOSIEND), has described former President Goodluck Jonathan as the only leader that can stabilise Nigeria if re-elected President in 2023.\nThis is as it said that giving the presidential ticket to Jonathan was the biggest card to continue the All Progressives Congress (APC)-led federal government beyond 2023.\nMOSIEND national president, Kennedy Tonjo West, disclosed this in a statement made available to LEADERSHIP in Port Harcourt, the Rivers State capital on Wednesday.\n“Dr Goodluck Jonathan stands tall with unmatched track record.\n“Of cause Jonathan’s competence to handle Nigeria problems more effectively and efficiently is not in doubt."
  },
  {
    "headline": "Borno: Again, Terrorists Kill 8 In Chibok Community",
    "summarized_story": "At least eight villagers have been killed and a military base set ablaze when Islamic State West Africa Province (ISWAP) terrorists attacked a remote village in Chibok local government area of Borno State.\nLEADERSHIP gathered that the terrorists stormed the Kautikari village in their numbers at about 7pm Tuesday night and started shooting sporadically.\nAccording to a source, the corpses of the victims were recovered from bushes while two persons were burnt.\nThe Vigilante source said, “We have recovered eight lifeless bodies from the scene of yesterday’s attack on our village (Kautikari), many are still unaccounted for as they are still missing.\nThe Borno State governor, Prof. Babagana Umara Zulum, had recently decried the increasing presence of ISWAP terrorists in the southern part of the state where Chibok is located as well as northern part of Borno."
  },
  {
    "headline": "Borno: Again, Terrorists Kill 8 In Chibok Community",
    "summarized_story": "At least eight villagers have been killed and a military base set ablaze when Islamic State West Africa Province (ISWAP) terrorists attacked a remote village in Chibok local government area of Borno State.\nLEADERSHIP gathered that the terrorists stormed the Kautikari village in their numbers at about 7pm Tuesday night and started shooting sporadically.\nAccording to a source, the corpses of the victims were recovered from bushes while two persons were burnt.\nThe Vigilante source said, “We have recovered eight lifeless bodies from the scene of yesterday’s attack on our village (Kautikari), many are still unaccounted for as they are still missing.\nThe Borno State governor, Prof. Babagana Umara Zulum, had recently decried the increasing presence of ISWAP terrorists in the southern part of the state where Chibok is located as well as northern part of Borno."
  },
  {
    "headline": "900 Captives Rescued As Troops Kill Top Terrorist Commander, Others",
    "summarized_story": "Troops of the Nigerian Army have rescued no fewer than 900 captives during an extreme intrusion into the insurgents’ enclaves in Sambisa Forest, North-East, killing a top Boko Haram/ISWAP terrorist, Adamu Ngulde, and 23 other terrorists, top military sources said.\nAccording to an intelligence report obtained by a Counter Insurgency Expert and Security Analyst in the Lake Chad, Zagazola Makama, through military sources, the camps included those at Mantari, Gapchari, Ngalmari, Malumbori, Kyautari, Malmatari, Kanari, Kajimari, Ngauramari and Yusufari, among others.\nHe had said, “We have moved on beyond Gwoza to Sambisa clearing the entire general area.\nWe have started ‘Operation Desert Sanity’ while the Multi-National Joint Task Force (MNJTF) is conducting ‘Operation Lake Sanity’.\n“Normally, when you strike here, they run to either Niger, Chad or one of those countries."
  },
  {
    "headline": "Madrid in great comeback, edge out City, to meet Liverpool in final",
    "summarized_story": "Real Madrid came from behind to stun Manchester City on Wednesday to book a place in the Champions League final to meet Liverpool.\nRodrygo struck two late goals to drag the match into extra-time and Karim Benzema scored a crucial penalty to give Madrid a 3-1 victory at home and 6-5 on aggregate.\nMadrid needed to score to cancel out City’s one-goal advantage coming into the match.\nA minute later on added time, Rodrygo struck again to drag the game into extra-time.\nHe won the battle of wills and sent an unstoppable penalty past Ederson into the bottom right corner."
  },
  {
    "headline": "Texas pastor Paul Moten drags Kanye West to court",
    "summarized_story": "A Texas minister David Paul Moten is suing Kanye West, saying the rapper, producer and entrepreneur used a recording of one of his sermons without permission in the song “Come to Life.”Dallas County, Texas, pastor David Paul Moten sued West, his label Universal Music Group (UMG.AS), and its subsidiaries Def Jam Recordings and the West-founded G.O.O.D.\nThe copyright infringement lawsuit says at least two sections of “Come to Life” feature excerpts from Moten’s sermon.\nUMG and an attorney for Moten did not immediately respond to requests for comment on the lawsuit.\nWest, who legally changed his name to Ye last year, could not immediately be reached for comment.\nMoten claims samples from his sermon comprise over 20% of “Come to Life,” which appeared on West’s hit album “Donda” last year."
  },
  {
    "headline": "Tinubu Reacts To Growing Number Of APC Presidential Aspirants, Says ‘The More The Merrier’",
    "summarized_story": "The former Lagos state governor said this after meeting with President Muhammadu Buhari on Tuesday at the presidential villa, Abuja.\nTinubu, who met with the president at his official residence, said the trend is in the best interest of the country.\nThe more they come, the more challenging it becomes for you to think deeply, focus on issues and be ready to serve Nigeria,” he said.\nThe aspirants include Vice-President Yemi Osinbajo; Bola Tinubu, former Lagos governor; Rotimi Amaechi, minister of transportation; Dave Umahi, Ebonyi state governor; Rochas Okorocha, former governor of Imo; Yahaya Bello, governor of Kogi state; Emeka Nwajiuba, minister of state for education.\nOthers are Adams Oshiomhole, former governor of Edo; Kayode Fayemi, Ekiti state governor; Godswill Akpabio, minister of Niger Delta, and Chris Ngige, minister of labor and employment."
  },
  {
    "headline": "Nigerian Lady Found Dead In A Hotel In Ebonyi State With Priv#te Part Allegedly Missing (Photos)",
    "summarized_story": "A Nigerian lady has been reportedly killed inside a hotel.\nThe lady identified as Mirabel Ezinne was found dead in a hotel in Ebonyi state with her priv#te part allegedly missing.\nMirabel was said to have been found dead on Monday, May 2, 2022, a day after she arrived the hotel located at G-Hostel Junction, Abakaliki, the state capital, with a yet-to-be-identified client.\nAn eyewitness claimed she was found with her two hands and legs tied.\nSee posts by some social media users who claimed to have known her below:Credit: Tori News"
  },
  {
    "headline": "BREAKING: Jack-Rich Declares For Presidency",
    "summarized_story": "All Progressives Congress (APC) chieftain Mr. Tein Jack-Rich has joined the presidential race.\nA group, ‘The Jack-Rich Patriot,’ said it has embarked on the mobilisation of delegates ahead of the primary.\nThe campaign group called on delegates to put sentiments apart and elect Jack-Rich to provide a new leadership that would turn around the country.\nAccording to the group, the aspirant and Chairman of Belemaoil Producing Limited, Jack-Rich is well prepared for the job of president because of his accomplishments in the private sector and high level training and management.\nAbdullahi said: “If we are serious as a nation in search of genuine renewal in all ramifications, the most qualified among the lot in the presidential race is Jack-Rich."
  },
  {
    "headline": "Ex-Info minister, Nweke Jnr, cleared for Enugu gov race",
    "summarized_story": "In a statement made available to The News Direct on Wednesday, it was gathered that Nweke was formally cleared to run for the office of the Enugu State Governor.\nNweke, in his declarative statement in April 2022, had said that if he emerged governor, his administration would transform Enugu State into a foreign industrial hub.\nIt was gathered that the party statement further listed other aspirants that were cleared to include; Umeadi Peter Nnanna Chukwudi (Presidential screening), Udensi Chikwendu Ukaobasi (Governorship screening – Abia State), Ijioma Nwokoro Ijioma (Abia), Ibe Gregory Ikechukwu (Abia), Waya Joseph (Benue), Akaa Priscilla Denen (Benue), Odoh Benard Ifeanyi (Ebonyi), Ozoemena Obi Donatus Madubuike (Enugu), Nnamani Emeka (Enugu), Udeh Donatus Ofobuikem (Enugu), Ombugaku Mathew Avre (Nasarawa State).\nNweke served as Chief of Staff to former Governor Chimaroke Nnamani.\nHe was later appointed the Minister of Youth, Minister of Information, and later the Minister of Information and Communications, during the second term of President Olusegun Obasanjo between 2003–and 2007."
  },
  {
    "headline": "Breaking: Real Madrid subdue Manchester City in spectacular comeback fashion, set up UEFA Champions League final vs Liverpool",
    "summarized_story": "Manchester City missed out on a place in the Champions League final in the cruellest of fashion as they collapsed to a 3-1 defeat to Real Madrid at the Bernabeu.\nBut two stoppage-time goals from Los Blancos substitute Rodrygo took the tie to extra time.\nReal Madrid had all the momentum at that point and they won a penalty in the opening minutes of extra time after Karim Benzema was tripped up by Ruben Dias.\nCarlo Ancelotti’s men, who have made a name for themselves as comeback kings this season, will meet Liverpool in the showpiece final in Paris on May 28.\nMeanwhile, City will be wondering how on earth they threw this one away as their wait for a first European crown goes on."
  },
  {
    "headline": "Breaking: Another Nollywood star is dead",
    "summarized_story": "A prominent Nollywood actor David Osagie has passed on.\nThe popular Nollywood was known for acting “King roles” in the Nigerian film industry.\nOsagie was said to have died on Tuesday, May 3, 2022.\nColleagues of the veteran Nollywood actor, who took to social media network, Instagram to share the sad news of his demise, said he was on set on Tuesday, May 3, only for them to hear of his death early Wednesday morning.\nShare this: TwitterFacebook"
  },
  {
    "headline": "Akeredolu, Opeyemi to APC: Return presidency to South, douse raging restiveness",
    "summarized_story": "Ondo state Governor Oluwarotimi Akeredolu has called on the leadership of the All Progressives Congress (APC) to zone the presidential position to the southern part of the country.\n“The leadership of the party ensured that the principle of rotational representation guided its decision at the just-concluded convention,” he said.\nHe said the party executive committee had fixed a fee for the purchase of the nomination form for the office.\n“The party leadership should have no difficulty in making pronouncement on this very important issue, just as it has fixed various fees for the purchase of forms.\n“We must not keep our party men and women guessing on the position of the leadership of the party."
  },
  {
    "headline": "Edo State NLC tasks FG on improving job creation",
    "summarized_story": "He made the call yesterday during the 2022 Workers’ Day in Benin City, Edo State.\nMeanwhile, the Edo State Governor, Godwin Obaseki, has approved N40,000 as new minimum wage for workers in the state, in commemoration of this year’s Workers’ Day.\nIt will be immoral and mindless of us to continue to pretend we do not know our workers are suffering.\n“The government of Edo has now decided to review the minimum wage for Edo workers from N30,000 to N40,000.\nUndoubtedly, Edo is the first state since the current outbreak of coronavirus to take this initiative."
  },
  {
    "headline": "2021: FCMB records N1.57trn deposit",
    "summarized_story": "By Onu OkorieFirst City Monument Bank FCMB Group Plc has recorded a Total deposit increase by 1.21 per cent to N1.57 trillion from N1.1.55 trillion in the previous year.\nis on the path of growth overcoming two economic recession as the lender’s profit hit a seven year high and an inch to equaling 2015 highs.\nThe uptick in profit was buoyed by an improvement in interest income as FCMB created risk assets and loans while a benign yield environment strengthened income from treasury yields.\nInterest income on loans and advances increased by 39.87 percent to N46.69 billion in March 2022.\nNet interest income, the difference between the revenue generated from a bank’s interest-bearing assets and the expenses associated with paying its interest-bearing liabilities, was up 52.59 percent to N18.54 billion as at March 2021."
  },
  {
    "headline": "Ogbeifun seeks financial support for seafarers to build capacity for employment",
    "summarized_story": "By Naomi DourglasChairman of Startz Investment Company and former president of Ship Owners Association of Nigeria (SOAN) Engr.\nGreg Ogbeifun has tasked the Federal Government to help Nigerian ship owners with necessary financial support to enable them to build the capacity for seafarers through employment.\n‘He also explained that, the Secretary-General of MOWCA had confirmed to him that the Managing Director of the RMDB has been appointed.\nSo, hopefully, in two or three months, we will have a functional maritime bank with some funds that operators begin to look forward to”.\nOgbeifun stated that the RMDB will serve as a succor to ship owners who find it difficult to access the Cabotage Vessel Financing Fund (CVFF)."
  },
  {
    "headline": "2021: MTN Nigeria Plc rewards shareholders with N13.12bn as dividends",
    "summarized_story": "Also Board representatives re-elected are Mr Rhidwaan Gasant and Mrs lfueko Omoigui-Okauru.\nAs at the end of March 2022, we had approximately 10.7 million active users and 166k active MoMo agents,” MTN Nigeria CEO, Karl Toriola, said.\nMTN Nigeria was recently granted final approval for a Payment Service Bank (PSB) by the Central Bank of Nigeria (CBN).\n“Having established a significant foundation of registered agent network, we are now focusing on scaling the active base.\nWe have expanded our agent services to include card withdrawal services by deploying point of sales (POS) terminals to the agent network."
  },
  {
    "headline": "P+ Measurement wins awards in PR, industry influencer relations",
    "summarized_story": "By Kehinde Ibrahim LagosP+ MEASUREMENT Services, Nigeria’s foremost Independent Public Relations measurement and evaluation agency have attained double laurels at this year’s Industry Awards where it clinched the Leader in PR Measurement & Industry Influencer Awards (Public Relations), for its quality offerings that surpass clients’ expectations and leading position in the sector.\nThe awards come on the heels of the company’s rebranding business strategy with a new logo, website, and office to deepen penetration and maintain its dominant position in the industry it operates, with over 47 brands and 17 Public Relations agencies in Africa’s largest economy.\nAccording to him, the award-winning and innovative organisation, with cutting-edge solutions has dictated the pace of the Public Relations measurement and evaluation services with its distinctive approach to ensuring that clients’ objectives are achieved.\nIts measurement and evaluation report are in-depth, robust, and flexible to accommodate valid metrics that brands desire to see reflected in their customised reports, and also based on the AMEC Standard by the Barcelona Principle 3.0.\nAlso, as part of its efficient services, the measurement and evaluation company introduced “Get-Reports,” a novel product that allows the purchase of PR performance audit reports in key sectors including the 22 Commercial Nigerian Banks PR Performance Audit Report, Top Nigerian Insurance PR Performance Audit Report, Top Nigerian Digital Banks PR Performance Audit Report, and Top Online Streaming Services PR Performance Audit Report."
  },
  {
    "headline": "Buhari Receives UN Secretary-General At State House",
    "summarized_story": "President Muhammadu Buhari on Wednesday received the United Nations Secretary-General Antonio Guterres at the State House in Abuja.\nBuhari also believes that the visit underscores the assurance that the world is with Nigeria.\nEarlier in the day, he visited the UN House in Abuja alongside some top officials and diplomats of the agency.\nThe UN chief had arrived in Nigeria on Tuesday and also visited Borno State where he proposed the reintegration of repentant terrorists.\nThe UN scribe is also expected to perform the wreath-laying ceremony in honour of the August 26, 2011, suicide bomb attack victims."
  },
  {
    "headline": "Fayemi Officially Joins 2023 Presidential Race",
    "summarized_story": "﻿The Governor of Ekiti State and former Minister of Mines and Steel, Kayode Fayemi has declared his intention to run for the seat of the President of the Federal Republic of Nigeria.\nThis governor stated this on Wednesday unveiling his agenda for the country.\nHe said, after consideration of where the nation is, he believes his entry into the race will rebirth a new Nigeria.\n‘After careful consideration of where we are as a nation…I believe that my entry into the race will offer Nigerians the opportunity to examine competing visions for national rebirth,” Fayemi said.\nThe former Minister said the decision to run was not one he took lightly but had made several consultations before arriving making his intentions known."
  },
  {
    "headline": "Group Protests At PDP Secretariat, Demands Zoning Of Presidency To South",
    "summarized_story": "Protesters on Wednesday converged on the national secretariat of the Peoples Democratic Party (PDP) in Abuja, barricading the entrance as they demanded that the presidential ticket of the party be zoned to the south.\nThe protesters displayed placards carrying inscriptions such as “promote unity, shift power to the south” “save democracy, shift power to the south” and the likes.\nThe group is basing their demand on the ground that the north has enjoyed the presidency for two terms.\nThe exercise, which happened behind closed doors last Friday, was headed by the former Senate President David Mark.\nIn attendance was the Rivers State Governor Nyesom Wike; former Senate President Anyim Pius Anyim; former Vice President Atiku Abubakar; former Senate President Bukola Saraki; former Anambra State Governor Peter Obi, amongst other aspirants."
  },
  {
    "headline": "Reps Pass Four Bills To Aid Fight Against Terrorism, Corruption",
    "summarized_story": "The House of Representatives has passed a bill for an Act to proscribe ransom for kidnap victims.\nThe executive bills were speedily passed through the 1st, 2nd and 3rd reading after lawmakers convened an emergency session on Wednesday.\nThe first bill is to repeal the Terrorism (Prevention) Act, 2011 and Terrorism (Prevention) (Amendment) Act, 2013, and enact the Terrorism (Prohibition and Prevention) Bill, 2022 to provide for an effective, unified, and comprehensive legal, regulatory and institutional framework for the detection, prevention, prohibition, prosecution and punishment of acts of terrorism, terrorism financing, proliferation and financing of the proliferation of weapons of mass destruction in Nigeria.\nThe last bill is for an Act to Repeal the Public Complaints Commission Act, Cap.\nP37, Laws of the Federation of Nigeria, 2004 and Enact the Public Complaints Commission Bill, 2022 for the establishment of the Public Complaints Commission."
  },
  {
    "headline": "Come Back Kings Real Madrid Beat Man City, Reach Champions League Final",
    "summarized_story": "Karim Benzema scored an extra-time penalty as Real Madrid came from behind to beat Manchester City 3-1 in the second leg and set up a Champions League final against Liverpool.\nCity appeared to be heading to a second successive final when Riyad Mahrez put them two goals ahead in the tie with 17 minutes left, but Rodrygo struck twice in the 90th and 91st minutes to force extra time.\nBenzema nervelessly slotted home his 15th goal of this season’s Champions League from the spot after he was fouled by Ruben Dias, sending the 13-time European champions through 6-5 on aggregate to the final in Paris on May 28."
  },
  {
    "headline": "Women in mega rally for Yahaya Bello in Akure, say we're not interested in zoning -",
    "summarized_story": "The women, who defied the heavy rain, on Wednesday morning, took to the streets, chanting solidarity songs and carrying various placards with inscriptions such as “Yahaya Bello, the best man for the job”, “We’re not interested in zoning, this is one Nigeria”, and “Yahaya Bello, hero of women inclusion”, among others.\nThe leader of the South-West market movement for Yahaya Bello, Deputy National President, Market Women Association of Nigeria, Princess Nike Aroloye, said the women of Nigeria were already looking beyond the primaries of the two parties.\n“We already see the ticket with Yahaya Bello.\nYahaya Bello is the one we will support.\n“Seeing this huge honest crowd, I am confident that Yahaya Bello’s good deeds, belief in women, and giant strides in a women-filled government, have earned him the trust of Nigerian women."
  },
  {
    "headline": "Breaking News: APC Extends sale of Nomination forms to May 10 -",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) on Monday extended the Party’s Sale of Expression of Interest and Nomination Forms for the 2023 General Elections to Tuesday, May 10, 2022.\nIn a revised timetable issued by the APC National Organising Secretary, H.E.\nSulaiman Muhammad Argungu, the last day for Submission of completed forms and accompanying documents is now set for Wednesday, 11th May, 2022."
  },
  {
    "headline": "President Buhari expresses happiness over international support against Terrorists -",
    "summarized_story": "God is a God of justice, so you cannot kill people and say God is great.\nPresident Buhari told the UN scribe that the government had started a gradual, but steady process of resettlement and reintegration where citizens get encouraged to return to their farms, businesses and other pursuits in life.\nThe President thanked the Secretary General for the maiden visit to Nigeria.\nGuterres said the United Nations had called for an additional 351 million dollars as part of the overall 1.1 billion dollars for the humanitarian response plan for Nigeria.\nThe UN Scribe said discussions with President Buhari also touched on laying groundwork to ensure peaceful and democratic elections next year – and the full participation of Nigeria’s women and young people."
  },
  {
    "headline": "President Buhari expresses shock, condoles with families of Army couple beheaded by IPOB",
    "summarized_story": "President Muhammadu Buhari has expressed deep condolences on behalf of the government and the entire nation to the Nigerian Army and the families of Master Warrant Officer Audu Linus and his partner, Private Gloria Mathew, who were beheaded on Saturday after being shot by the terrorist group, the Indigenous People of Biafra, IPOB, according to the Nigerian Army.\nBuhari expressed shock and condemned the murderers’ brutality, as well as similar acts of violence against law enforcement officers, describing it as alien to all cultures and civilizations.\nThe bodies were treated inhumanely and gleefully posted on social media platforms.\nIn a statement released on Wednesday, President Buhari urged all leaders – local, regional, and national – to “speak with one voice, to demonstrate that the entire country is united in its opposition to this cruel and barbaric act of violence.”He directed the military authorities and other security agencies to do their utmost in apprehending the perpetrators of these barbaric acts and bring them to justice.\n“Our thoughts and prayers are with the families of this sad and tragic incident,” the President added."
  },
  {
    "headline": "Heartbreak for Man City as Real Madrid’s Late Comeback Sets Up Champions League Final with Liverpool",
    "summarized_story": "Manchester City have been knocked out of the Champions League by Real Madrid after conceding two goals in the dying seconds of the game.\nRelatedStories No Content AvailableBut in the final seconds of normal time, Brazilian Rodrygo set up a grandstand finish cutting the aggregate deficit to 5-4.\nReal will now face Liverpool in the final at the Stade de France in Paris on 28 May.\nThe final was originally scheduled to take place at the Krestovsky Stadium (Gazprom Arena) in Saint Petersburg, Russia.\nThis will be the third time that the Stade de France has hosted the Champions League final, following the 2000 and 2006 events."
  },
  {
    "headline": "Why I Want to Become FCT Senator – Mrs Dayo Benjamins",
    "summarized_story": ""
  },
  {
    "headline": "Wike Supports IPOB Agitations + EFCC Quizzes Malami’s Aides – Trending With Ojy Okpe",
    "summarized_story": "The Nigerian Army has described the gruesome murder of two soldiers as a witch-hunt on soldiers.\nTwo soldiers Master Warrant Officer Audu Linus and private Gloria Matthew who travelled to their home town in Imo state to formalize their wedding were alledgely beheaded by members of the indigenous people of Biafra and it’s armed affiliate, the Eastern Security Network.\nIn the meantime the governor of Rivers State Nyesome Wike on Tuesday said that he supports the agitation of the Indigenous People of Biafra but is against the violent activities linked to the group.\nIn another development, reactions have trailed the donation of several operational vehicles to Workers at a foundation, established by Abubakar Malami the attorney-general of the federation which are said to be used to support their activities.\nFurthermore, some senior officials of the justice ministry and several aides of Attorney General of the Federation and Minister of Justice Abubakar Malami have been quizzed by the Economic and Financial Crimes Commission over suspicion of corruption in the compilation of the presidential pardon list."
  },
  {
    "headline": "EU Targets Russian Oil, Banks as Moscow’s Ally Belarus Stages Army Drills",
    "summarized_story": "The EU has yet to target Russian natural gas, used to heat homes and generate electricity across the bloc.\nHis comments came after the ministry said it had disabled six railway stations in Ukraine used to supply Ukrainian forces with Western-made arms in the country’s east.\nThe ministry also said it had hit 40 Ukrainian military targets, including four depots storing ammunition and artillery weapons.\nRussian forces turned their heaviest firepower on Ukraine’s east and south after failing to take Kyiv, the capital, in the opening weeks of the war.\nThe governor of the eastern Luhansk region, Serhiy Haidai, said two civilians had been killed and two wounded in the past 24 hours, adding that Russian forces had shelled residential areas 34 times."
  },
  {
    "headline": "North Korea Launches Ballistic Missile in 14th Test This Year",
    "summarized_story": "North Korea fired a ballistic missile Wednesday, Seoul said, a week after Kim Jong Un vowed to boost Pyongyang’s nuclear arsenal and just days before the South inaugurates a new, hawkish president.\nNorth Korea fired the ballistic missile at 12:03 pm (0303 GMT), Seoul’s Joint Chiefs of Staff said, likely from the Sunan Airfield near Pyongyang, the site of previous recent ICBM tests.\nRepeated negotiations aimed at convincing Kim to give up his nuclear weapons have come to nothing.\nUS President Joe Biden is due to visit South Korea later this month to meet with Yoon.\nIt is “virtually impossible” for the Security Council to sanction North Korea — which has supported Russia’s attack on Ukraine — due to Moscow’s veto power, said Cheong Seong-chang of the Center for North Korea Studies at the Sejong Institute."
  }
]