[
  {
    "headline": "NSITF targets massive job creation with new structure",
    "summarized_story": "The acting Managing Director/Chief Executive, Nigeria Social Insurance Trust Fund, Dr Kelly Nwagha, has said that its 18-storey building, when completed, will create jobs and improve economic and commercial activities.\nNwagha stated this on Saturday when the agency handed over documents for the commencement of the building project to the new contractor, Old English Consolidated Limited.\nIn a statement, he explained that the construction of the structure, located along the Lagos international route linking Nigeria and the ECOWAS region commenced about 39 years ago.\nHe added that when completed, it would be put into effective use for employees and employers all over the federation.\nNwagha also said people in the community were sure of getting jobs, both the formal and informal types."
  },
  {
    "headline": "Buhari’s refusal to assent to S’East development bill worrying –Ex-senator",
    "summarized_story": "A former Senate Committee Chairman on Ethics, Privileges and Petitions, Senator Samuel Anyanwu, has said the continued refusal of the President, Major General Muhammadu Buhari (retd), to assent to the South-East Development Commission bill which has been passed by the Senate is causing worry.\nHe also advocated an additional state for the South-East region, adding that marginalisation of the zone was unacceptable.\nThe ex-lawmaker said, “It is very obvious that this bill was passed by the National Assembly, but the continued denial of presidential assent is causing problems and contributing to regional unrest.\nOtherwise, the spate of agitations and calls for secession would have been lowered to its barest minimum.\nTherefore, there is an urgent need to give assent to this bill for immediate take-off."
  },
  {
    "headline": "Buhari assures brighter future for Nigerian youths",
    "summarized_story": "Kindly Share This Story:President Muhammadu Buhari has assured a brighter future for youths across the country.\nAccording to the President, the present administration has given chance for young ones to hold key political posts, contrary to past tenures.\nThe traditional ruler charged Nigerian leaders to prioritise youths’ future and create good ideas that would benefit them, saying this would pave the way for a better Nigeria.\nHe also stated that youths remained the pillars of tomorrow and once the foundation is weak, there is danger for the future.\nHe urged youths to work hard for better life, saying that the awardees were identified due to their outstanding successes in their careers."
  },
  {
    "headline": "Social crusader, Eholor congratulates Gov Obaseki over victory at Supreme Court",
    "summarized_story": "Kindly Share This Story:Urges him to grant Edo Judiciary independenceBy Gabriel Ewepu – AbujaA Social Crusader and Founder of One Love Foundation, OLF, Patriot Patrick Eholor, Friday, congratulated the Governor of Edo State, Godwin Obaseki, over his victory at the Supreme Court.\nEholor who described Obaseki’s victory as resounding also urged him to grant the Edo State judiciary independence.\nThe Supreme Court on Friday struck out the appeal filed by the All Progressive Congress, APC, and its candidate, Pastor Osagie Ize-Iyamu, against the outcome of the September 19, 2020 governorship election, which returned Godwin Obaseki of the Peoples Democratic Party, PDP, as Governor of Edo State, for lacking in merit.\nHe said: “I want to congratulate the Governor of Edo State, Godwin Obaseki, for a resounding victory at the Supreme Court.\nI also want to remind him that the judiciary in Edo State has to be independent, have its autonomy."
  },
  {
    "headline": "Menstrual Hygiene Day: WaterAid joins experts to give new definition of menstrual health",
    "summarized_story": "Although, it is hoped having a new definition will provide a common language, harmonise approaches and unite efforts to support the range of menstrual needs.\n“Sadly, the shame and stigma around periods prevents women and girls from engaging in conversations around their periods.\nIt is a situation that is further fostering inequality and affecting the health of millions of women and girls.\nQuoting the Regional Programme Manager, South Asia, WaterAid, Senior Author, Thérèse Mahon, said: “By defining menstrual health holistically, we aim to bring together stakeholders and help ensure menstrual needs are prioritised by all responsible.\n“Large-scale investment is needed to improve menstrual health as well as water and sanitation provision but co-ordination is needed across sectors."
  },
  {
    "headline": "El-Rufai appeals for better preparations against pandemics",
    "summarized_story": "The governor said that ‘’the imperative for us as governments is to prepare for the eventuality’’ adding that Kaduna state has been preparing for it.\nAccording to the governor, the theme of the lecture, which is ‘’Northern Nigeria Economy After the Covid-19 Pandemic’’ is very appropriate.\n‘’‘’Sir Ahmadu Bello, without any doubt, the greatest leader that Northern Nigeria has ever had.\n‘’Every day in the Northern States Governors’ Forum, we ask ourselves what will Sardauna do when faced with a problem.\nAlmost 60 years after his death, late Sir Ahmadu Bello is still the gold standard of governance, good politics, and sound management,’’ he said."
  },
  {
    "headline": "Umuahia on fire as gunmen attack state CID, immigration office",
    "summarized_story": "Kindly Share This Story:…’Keke’ operator feared deadBy Steve Oko, Ugochukwu AlaribeThe Abia State Police Criminal Investigation Department has been reportedly set ablaze by unkown gunmen.\nThis is as the Nigeria Immigration Services State headquarters at Ubakala also reportedly came under attack by yet-to- be identified armed men.\nThe casualty figure is not yet clear but a police source told our Correspondent that one tricycle operator was hit by stray bullet.\nReports say heavy gunfire was coming from the location of the Port Harcourt expressway where the NIS office is located.\nThe source also confirmed that a tricycle operator was hit by stray bullet but was silent on the casualty figures of either sides."
  },
  {
    "headline": "Gov Ikpeazu hints on developing new strategies to tackle insecurity in Abia",
    "summarized_story": "The Governor of Abia State, Dr Okezie Ikpeazu says his administration is fine-tuning the existing Abia State Vigilante Law to complement efforts of the Abia State Homeland Security in readiness for deployment to strategic security operations.\nIkpeazu reiterated his firm commitment to implementing workable and responsive recommendations for improved security in the state.\n“The ongoing exercise of flushing out criminals from our forests will be steady until the state gets rid of criminal elements from across our bushes and forests in Abia”.\nThe Abia Governor pointed out that remarkable success has been made in the efforts towards deploying ICT in the fight against crime through the Abia CPAMS Initiative conceptualized to take records of criminals through the use of Apps on internet-enabled phones.\nGeneral Ihejirika while assuring that Abia State has a formidable security council comprising of all security agencies in the state comprising of highly qualified and competent senior law enforcement officials, noted that Abia is sure of improving its security architecture through the roundtable discussions christened Abia security summit."
  },
  {
    "headline": "Itsekiri group threatens to shut down oil installations in Niger Delta, issues FG 14 days ultimatum",
    "summarized_story": "The Itsekiri Liberation Group has issued a fourteen days ultimatum to the federal government demanding the appointment and inauguration of a substantive Board for the Niger Delta Development Commission, NDDC.\nThe group insisted that all NDDC projects within the Itsekiri domain must be fully funded by the federal government.\n“In the recent past, the Federal Government have completely neglected the Itsekiri people in the scheme of things in the Niger-Delta Development Commission (NDDC).\n“The Federal government should with immediate effect appoint, confirm and Inaugurate a substantive Board for the NDDC within 14 days.\nWe were shocked to see NDDC engage over 200 indigenous people of the Niger Delta without a single Itsekiri man or woman, this is the gross neglect of the Itsekiri people."
  },
  {
    "headline": "Human rights activists launch movement against insecurity, kidnapping [PHOTOS]",
    "summarized_story": "Human rights activists in Ibadan, Oyo State on Saturday began a campaign against the rising insecurity, unemployment, poverty and other social problems confronting the country.\nThe human rights crusaders noted that the level of insecurity occasioned by kidnappings, killings and attacks on innocent citizens were alarming.\n“We are also convinced that all the capitalist ruling elites and their parties lack the programmes, policies and perspectives that may solve the socioeconomic problems confronting ordinary people.\n“The peaceful protest of Monday, 31st May is to commence the campaign against insecurity, poverty and other socioeconomic problems ravaging Nigeria at this present time.\n“Our understanding is that pervasive poverty is, primarily, at the root of pervasive insecurity."
  },
  {
    "headline": "Kaduna govt confirms attack on travelers on Abuja-Kaduna road by bandits",
    "summarized_story": "The Kaduna State Government has confirmed that travellers were attacked by bandits on the Abuja-Kaduna highway on Friday.\nDAILY POST had reported that former Senator Shehu Sani, raised alarm over the abduction of people along the Kaduna-Abuja road.\nThe former lawmaker who took to his Twitter account on Friday evening to raise the alarm said the bandits blocked the expressway.\n“Furthermore, besides the Honda vehicle, the following five citizens hidden in the forest appeared with their driver who confirmed they were complete having escaped in the commotion.\nThe public will be briefed as soon as the Government of Kaduna State receives operational feedback,” the statement said."
  },
  {
    "headline": "“I fight my battles myself, I don’t go to my husband”",
    "summarized_story": "Senator representing Lagos Central and former First Lady of Lagos State, Remi Tinubu has said she fights her own battle and does not report anyone to her husband, Bola Tinubu.\nSpeaking during an interview on TVC, Remi said she fights her own battles when she knows she is right without telling her husband.\nRemi claimed she keeps some battles away from her husband because he will sometimes tell her she is wrong or try to convince her not to do certain things.\n“I don’t know why but when you have a husband who tells you, ‘you are wrong when you are right, in your own view, I don’t think you will keep going to him for anything.\n“So, I do my own fight when I have to, especially in what I believe in,” she said."
  },
  {
    "headline": "NSCDC arrests man, 60, over alleged rape, assault of minor",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC), Kwara Command, have arrested a 60-year-old man, Jerimiah Oyedoki of Ileloja compound, Kiama, for allegedly having canal knowledge of a 9-year-old girl.\nA statement for the command’s PRO, Mr Babawale Afolabi, issued to newsmen on Saturday noted that the case was reported at its Divisional Headquarters, Kiama on Friday.\n”On Friday, May 28, around 5:30p.m., Jerimiah Oyedokun of Ileloja compound, Kiama, was caught in the act by the parents of the nine year-old, of same area.\nHe has confessed to the crime, while the minor has been taken to the General Hospital, Kiama, for proper medical attention.\n”The case is now at the state headquarters for further prosecution and the suspect will be charged to court after investigation,” Afolabi said."
  },
  {
    "headline": "Video: Greenfield varsity student speaks after release",
    "summarized_story": ""
  },
  {
    "headline": "Video: Parents of freed Greenfield varsity students lament govt’s alleged inaction",
    "summarized_story": ""
  },
  {
    "headline": "Napoli: Luciano Spalletti named as Gennaro Gattuso’s successor",
    "summarized_story": "Napoli have appointed former Roma and Inter Milan manager Luciano Spalletti to succeed Gennaro Gattuso.\nGattuso left Napoli after finishing fifth in Serie A and failing to qualify for next season’s Champions League.\nItalian Spalletti, 62, returns to management for the first time since he was sacked by Inter in 2019.\nADVERTISEMENT“Welcome, Luciano – we’ll do great work together,” said Napoli president Aurelio de Laurentiis.\nIt is the latest managerial change in the Italian top flight this week as Juventus reappointed former boss Massimiliano Allegri to replace Andrea Pirlo, while Antonio Conte left Inter Milan after winning the title and is set to be replaced by former Lazio boss Simone Inzaghi."
  },
  {
    "headline": "Gunmen launch fresh attacks on Imo, Abia, Anambra",
    "summarized_story": "From Okey Sampson (Umuahia) and Stanley Uzoaru (Owerri)Gunmen yesterday went on rampage in Umuahia, Abia State and Njaba Local Government Area of Imo State, burning police stations and courts.\nIn Abia, the attack by unknown gunmen on police formations took a dangerous dimension yesterday as the hoodlums attacked the Abia Police Command Criminal Investigation Department (SCID) in Umuagu, Umuahia.\nIn Imo, the gunmen razed the Atta Divisional Police headquarters under construction in the Njaba Local Government Area.\nThe Imo State Police Public Relations Officer, Bala Elkana, also confirmed the attack in a statement.\nAccording to sources, the gunmen stormed the area and opened fire on the soldiers who were on a roadblock."
  },
  {
    "headline": "Buhari, Osinbajo receive second jab of COVID-19 vaccine",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari yesterday received his second jab of AstraZeneca vaccine against the COVID-19.\nRecall that the President Buhari and Vice President Yemi Osinbajo had taken their first jabs of the vaccine during a ceremony in March.\nVice President Osinbajo, also received his second dose of the COVID-19 vaccine at his Aguda House residence.\nThe Chief Nursing Officer at the State House Clinic, Esther Tukur, administered the jab was on the vice-president.\nThe State House Vaccination team also included Chief Medical Physician Dr. Nicholas Audiffren and Dr, Abiodun Adelowo."
  },
  {
    "headline": "BREAKING: 14 Greenfield students regain freedom",
    "summarized_story": "Fourteen students of Greenfield University in Kaduna State who were recently abducted by suspected bandits have regain freedom.\nThey were released on Saturday afternoon at a location along the Kaduna- Abuja highway.\nThe Chairman of the Parents Forum, Markus Zarmai and few others were expected to receive the students at the drop-off location.\nAlthough, the government and police authorities are yet to confirm the development, the parents of the abducted students said that they paid ransom, in addition to providing eight new motorcycles to the kidnappers before they agreed to release their children.\nDetails soon…"
  },
  {
    "headline": "I might act nude if paid in foreign currency –Jessica Fabulous",
    "summarized_story": "Beautiful fast rising actress cum model, Jessica Fabulous, is a Nollywood greenhorn, but she’s ready to carve a place for herself in the make-believe world.\n“That’s why I am looking for that man that will give me the freedom to express myself and pursue my career.\nHe must also be a rich man but not necessarily as old as Regina Daniels’ husband.\nSpeaking further, Fabulous, who features in Elina, a new movie that hit cinemas last Friday, hints at the only condition that will make her act nude.\nHowever, if the money is right, I might give it a second thought, especially if it’s in foreign currency.”"
  },
  {
    "headline": "Kalu salutes, tasks new Chief of Army Staff",
    "summarized_story": "While congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with a passion for professionalism and national development.\nThe former governor urged the new Army Chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigeria Army has continually played a noble role in nation building.\nHe said: “I felicitate the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "After 40 Days in Captivity, 14 Abducted Kaduna Varsity Students Regain Freedom",
    "summarized_story": "*3 still in captivityBy John Shiklam in KadunaFourteen of the remaining 17 abducted students of the Greenfield University, Kaduna have been released after 40 days in captivity.\nOn April 18, 2021, bandits invaded the university, which is located along the dreaded Kaduna- Abuja road, at about 8:30pm and abducted 23 students.\nSpokesman of the Kaduna state police command, Mohammad Jalige, confirmed the release of the 14 students when contacted on telephone.\n“Yes, 14 of the students of the Greenfield University were released from captivity this evening (Saturday), remaining three of them still in captivity”, Jalige said.\nThe last batch of 27 of the students were released about two weeks ago after spending 56 days in captivity."
  },
  {
    "headline": "Six Years After, President Presents Achievements",
    "summarized_story": "Other efforts under this category include the establishment in 2020 of the Presidential Infrastructure Development Fund (PIDF), with more than $1 billion in funding so far.\nOn road projects, the statement listed the PIDF, the investment of over a billion dollars on three flagship projects: Lagos-Ibadan expressway, Second Niger Bridge and Abuja-Kaduna-Zaria-Kano expressway.\nThe Buhari administration, according to the statement, has done well in boosting the capacity of the nation’s ports.\nIn the power sector, Adesina listed President Buhari’s effort to include the implementation of Energising Education Programme, which involves taking clean and reliable energy (Solar and Gas) to Federal Universities and Teaching Hospitals across the country.\nThe achievements also included the Policy, Regulatory and Funding Support for the establishment of Modular Refineries across the Niger Delta."
  },
  {
    "headline": "FG Defends Choice of Farouk Yahaya as Chief of Army Staff",
    "summarized_story": "Critics also argued that the office of Army Chief had been restricted to Northerners in the six years Buhari has spent so far as President and that the President ought to have shifted a bit by picking the new Army Chief from among Southern Generals in the Army, so as to give the rest of the country a sense of belonging.\n“With the appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary.\nYahaya is from Sokoto State and he was a member of the 37th Regular Course of the Nigerian Defence Academy.\nYahaya ResumesMeanwhile, General Yahaya formally resumed duty as the nation’s Chief of Army Staff yesterday.\n“General Yahaya later held a brief meeting with principal staff officers after observing a minute silence in honour of former COAS, late General Ibrahim Attahiru and 10 others."
  },
  {
    "headline": "EFCC Estimates Value of Diezani’s Jewelry at N14.4bn",
    "summarized_story": "•Explains delay in disposing assetsAdedayo Akinwale in AbujaThe Economic and Financial Crimes Commission (EFCC) yesterday revealed that the estimated value in Naira of jewelry seized from former petroleum minister, Diezani Alison-Madueke is N14.4 billion.\nThe EFCC boss said though they got the forfeiture order for assets recovered from the former Petroleum Minister in 2019, they were yet to be auctioned.\nHe stated: “The estimated value of Diezani Allison’s jewelry in naira is N14.4 billion.\nThe estimated value of houses for the former Minister of Petroleum, Diezani Allison is worth $80 million”.\n“This is to ensure that assets that are not only recovered by the EFCC but the entirety of the recovery agencies assets are disposed of.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Alleged Certificate Forgery: Obaseki Wins again",
    "summarized_story": "Chuks Okocha, Alex Enumah in Abuja and Adibe Emenyonu in Benin CityThe Supreme Court yesterday dismissed the appeal of the All Progressives Congress (APC) on the alleged certificate forgery against Edo State Governor, Mr. Godwin Obaseki.\nThe court in addition awarded a cost of N1 million in favour of Obaseki.\nThe trial court had on January 9 this year dismissed the alleged certificate forgery suit against Obaseki, on grounds that the party failed to substantiate its claim of forgery.\nBut not satisfied APC approached the Appeal Court to challenge the judgment of the lower court.\nToday’s judgement has reinforced this saying due to the celebration all over Edo State and other parts of the World."
  },
  {
    "headline": "10 Dead As Boko Haram Attacks Troops In Borno",
    "summarized_story": "Boko Haram fighters on Friday attacked the Operation Hadan Kai troops’ location in Rann in the Kala Balge Local Government Area of Borno State, with 10 of them shot dead during a fierce gun battle.\nThis was hours into the resumption of the new Chief of Army Staff, Maj Gen Farouk Yahaya, at the Nigerian Army Headquarters, Abuja.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "10 Dead As Boko Haram Attacks Troops In Borno",
    "summarized_story": "Boko Haram fighters on Friday attacked the Operation Hadan Kai troops’ location in Rann in the Kala Balge Local Government Area of Borno State, with 10 of them shot dead during a fierce gun battle.\nThis was hours into the resumption of the new Chief of Army Staff, Maj Gen Farouk Yahaya, at the Nigerian Army Headquarters, Abuja.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "IPOB Sit-At-Home Order Flops In Anambra, Paralyses Activities In Imo",
    "summarized_story": "The sit-at-home order to mark Biafran independence by the Indigenous People of Biafra did not hold water in parts of Awka, the Anambra State capital, as people went about their normal businesses on Saturday.\nMeanwhile, in Owerri Imo State, the sit-at-home paralysed economic and social activities as residents remained indoors, fearing for possible clashes between IPOB members and the security agencies.\nIPOB leader, Nnamdi Kanu, declared the sit-at-home.\nAn Awka resident, Mr Mike Uche, said that he heard about the sit-at-home order but stated that nobody was observing it.\nMeanwhile, developments on Saturday in Owerri revealed that residents of the state deserted markets and streets of the state capital for safety."
  },
  {
    "headline": "Greenfield abduction: We paid bandits N180m to release our children, says parent",
    "summarized_story": "One of the parents of the abducted students of Greenfield University, Kaduna says N180 million was paid to bandits before their children were released.\nAdvertisementOn Saturday, fourteen of the abducted students regained their freedom.\nThe students were abducted on April 20 when bandits attacked the institution.\nThe bandits subsequently killed five of the students and threatened to kill the others if a ransom was not paid, while one of the students was later released.\nN180 million, that is what they collected from us, from parents, without the help of the government,” a father lamented."
  },
  {
    "headline": "Greenfield abduction: We paid bandits N180m to release our children, says parent",
    "summarized_story": "One of the parents of the abducted students of Greenfield University, Kaduna says N180 million was paid to bandits before their children were released.\nAdvertisementOn Saturday, fourteen of the abducted students regained their freedom.\nThe students were abducted on April 20 when bandits attacked the institution.\nThe bandits subsequently killed five of the students and threatened to kill the others if a ransom was not paid, while one of the students was later released.\nN180 million, that is what they collected from us, from parents, without the help of the government,” a father lamented."
  },
  {
    "headline": "Panic as gunmen attack yet another police station in Abia",
    "summarized_story": "The was pandemonium on Saturday when gunmen set ablaze the police criminal investigation department in Umuahia, Abia state capital.\nAdvertisementGodfrey Ogbonna, police public relations officer in the state, confirmed the incident to NAN.\nAccording to NAN, there was a commotion when the news of the police station attack filtered to the area.\nThe attack is coming on the same day the sit-at-home order issued by the proscribed Indigenous People of Biafra (IPOB) took effect.\nThe incident is the fourth police station attack in Abia state in May alone."
  },
  {
    "headline": "Panic as gunmen attack yet another police station in Abia",
    "summarized_story": "The was pandemonium on Saturday when gunmen set ablaze the police criminal investigation department in Umuahia, Abia state capital.\nAdvertisementGodfrey Ogbonna, police public relations officer in the state, confirmed the incident to NAN.\nAccording to NAN, there was a commotion when the news of the police station attack filtered to the area.\nThe attack is coming on the same day the sit-at-home order issued by the proscribed Indigenous People of Biafra (IPOB) took effect.\nThe incident is the fourth police station attack in Abia state in May alone."
  },
  {
    "headline": "Chelsea defeat Man City to win second Champions League title",
    "summarized_story": "Chelsea won the Champions League title for the second time in their history after defeating Manchester City 1-0 on Saturday.\nAdvertisementHaving won two consecutive matches against Pep Guardiola’s side, Thomas Tuchel’s boys now have a hat-trick of wins against the Cityzens this season.\nManchester City, however, woke up and began some foray down their left flank in the 29th minute.\nChelsea were able to contain City in the second half to ensure Havertz’s goal was enough to lay claim to the 2020/21 UEFA Champions League title.\nThey won the Europa League in 2013 and 2019 while they also emerged winners of the Cup Winners Cups in 1971 and 1998."
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Nigeria dithers as world’s largest oil region turns hydrogen hub",
    "summarized_story": "The biggest oil-exporting region in the world, the Middle East, has set its sights on becoming a major clean energy exporter of green hydrogen, a message Africa’s biggest oil-producing country is yet to come to terms with.\nWhile Nigeria remained passive despite having a variety of resources to produce hydrogen, the largest oil producers in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "How insecurity blights gains of Nigeria’s 22-year democracy",
    "summarized_story": "These issues have been sorted before independence, before the military came and that was why we had the 1963 Constitution.\nI think Nigeria is far from getting solutions to our insecurity challenge until presidency gets serious and accepts the reality,” Ujah said.\nWhat worries many observers is the inability of Nigeria to seek help from foreign partners who have successfully addressed their insecurity challenges.\nFor Alabo, the Federal Government is insincere with the fight against insecurity, especially with insurgence and bandits in the north.\nFor now, the only solution to our problem is foreign help because our security is compromised; they are eating from the problem, hence foreign assistance."
  },
  {
    "headline": "Reps minority group says Nigeria becoming a failed state",
    "summarized_story": "The house of representative minority group has asked President Muhammadu Buhari to “buckle up” in addressing the challenges confronting the country.\nIn a statement Friday to mark the sixth anniversary of the present administration, Ndudi Elumelu, minority leader of the lower chamber, tackled the All Progressives Congress (APC) over “economic crisis and avoidable acrimony”.\n“The caucus holds that with its failure to check worsening insecurity and mass killing of citizens; its intrinsic corruption, mismanagement of our national economy, as well as the unrelenting assault on our national diversity, the APC administration at the center has failed on all fronts in the last six years,” the statement reads.\n“Failure of the government to address escalated insecurity challenges has crippled the agricultural sector and disorganised commercial activities, leading to imminent food crisis with cost of food and other necessities of life skyrocketing beyond the reach of Nigerians,” the lawmakers said.\n“As representatives of the people, the minority caucus is worried that our nation is heading towards a failed state."
  },
  {
    "headline": "Resource Mobilisation Key in Promoting AYSRH Advocacy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMembers of Advocacy Core Groups (ACGs) and Media Forum were on May 5 trained on key components ofResource Mobilisation.\nTaking participants on Introduction to Resource Mobilisation, with sub-topics on Resource Mobilisation and Organization Functions, sources and truths of resource mobilisation,Dr Emonena Bernard, pointed out that the delivery of services and products by an organization depends on a continual process of resource Mobilisation and supported by new business development by the organisation.\nHe listed resource Mobilisation sources to include members contribution, sale of goods and services for user fees, foundation contributions, government contracts, grants, national and international donors, amongst others.\n“Successful Resource Mobilisation requires a lot of work and takes a lot of time.\nHighpoint of the training was the distribution of a sample of an Organization Resource Mobilisation Plan, 2021-2023 to participants, and it included Projected Resource Needs for FP/AYSRH, 2021 to 2023, a three-year planning map."
  },
  {
    "headline": "Children’s day: Edo SUBEB to achieve global standard literacy, numeracy skill- chairman – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAUCHI : Dr. Joan Oviawe, the Executive Chairman, Edo State Universal Basic Education Board (SUBEB) said that the state is committed to achieve global standard literacy and numeracy skill in all Edo children.\nShe disclosed that the board had launched a campaign to make every child in the state a “Reading Champion”.\nThe Edo SUBEB chairman, said children are leaders of tommorrow and must be given special care and protection from parents, teachers and other members of the family.\n“Children’s day celebration also remind us about the rights of children which should be of general application to all children.\n“Our aim is that every Edo child should be able to read in primary one and urged parents to encourage their children on the reading culture."
  },
  {
    "headline": "The Nigerian OBSERVER @ 53: Challenges And Opportunities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Bendel Newspapers Company Limited (BNCL), publishers of the Observer Titles celebrates her 53 years of existence today.\nMr Aloba later became the pioneer General Manager of The Nigerian OBSERVER.\nToday, The Nigerian OBSERVER remains the longest surviving government owned newspaper in the country after series of re-launching and re-designing to meet industry standard.\nThe government of Delta State, on its part, set up Delta Printing Press on August 8, 1994 to produce a state owned newspaper.\nNevertheless, The OBSERVER Newspapers thrived in the face of challenges and competitions from privately owned newspapers, to emerge as the longest surviving government owned newspaper in the country."
  },
  {
    "headline": "The Buhari Administration @ 6: Presidency lists achievements – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Presidency says the Muhammadu Buhari administration is recording giant strides, enough to make Nigerians proud.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Kidnapped Greenfield University students freed",
    "summarized_story": "ADVERTISEMENTThe remaining 14 abducted students of Greenfield University were freed on Saturday after 40 days in captivity.\nTwo other persons who were kidnapped alongside the students are also said to have been freed.\nThe students were abducted from the private university in Kaduna State on April 20 after bandits invaded their hostels.\nFive of the abducted students were later killed by the bandits.\nIt is not clear if government officials were involved in the negotiations that led to the students being freed."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari happy Greenfield University students are home, safe – Presidency",
    "summarized_story": "OBINNA EZUGWUThe presidency has said President Muhammadu Buhari is relieved that the Greenfield University students freed on Saturday are now home safe, at the end of a 40-day ordeal.\nA statement by the presidency posted via its twitter handle @NGRPresident, also said Buhari condoles with the families of the students and staff that were killed by the abductors.\nThe remaining 14 abducted students and staff of the Kaduna based university were released earlier on Saturday at a location along the Kaduna- Abuja highway.\nOn April 23, the remains of three of the abducted students were found in Kwanan Bature village, a location close to the university.\nThe Kaduna State Government and the Federal Government have discouraged ransom payments to bandits."
  },
  {
    "headline": "Osun APC youth leaders rally support for Oyetola, dissociate from party ‘splinter group’",
    "summarized_story": "While staying clear from the party’so splinter group called “The Osun Progressive,” the youth leaders also declared their support for the APC caretaker chairman, Prince Gboyega Famodun saying they were pleased with his eadership style.\nThe meeting held on Friday, at the APC party Secretariat, Osogbo, had in attendance the, State Youth Leader, Senatorial Youth leaders, as well as all the local governments youth leaders and their assistants across the three Senatorial districts.\nAremo further explained that they endorsed Governor Oyetola to pilot the affairs of the state beyond 2022, owing to his performance which he described unprecedented.\nHe noted that despite the meagre resources, Oyetola had transformed the state beyond the expectations of the people of the state.\n“Governor Gboyega Oyetola has done tremendously well."
  },
  {
    "headline": "Governor Oyetola and the Chinese fable, by Charles Adeyemi",
    "summarized_story": "Governor Oyetola has not only fulfill his promise of paying full salaries, he has went further to approve minimum wage for all levels of Osun workforce, isn’t this a miracle?\nAt the end of their fact finding mission accross the country which includes but not limited to evaluation of Budget Preparation process, budget performance process, public procurement process, financial accounting process, auditing process and even revenue collection process.\nAnother project that played a key role in osun fiscal governance is SLOGOR (State and Local Governance Reform Project).\nGovernor Oyetola has repositioned the fiscal governance of osun than before.\nOsun couldn’t have Achieve so much with so little if not for financial mastery and prudence of the Governor."
  },
  {
    "headline": "Just In: Supreme Court dismisses Ize-Iyamu’s forgery suit against Obaseki",
    "summarized_story": "The apex court in a judgement delivered by Justice Emmanuel Agim held that the appellants failed to prove its case beyond a reasonable doubt, NAN reported.\n“This court agrees with the lower courts completely, that the appellants did not meet sufficient requirement to prove their case”.\nThe Supreme Court, therefore, awarded a cost of one million naira in favour of Governor Obaseki.\nThe appeal court in Abuja had dismissed the suit challenging Obaseki’s certificates on March 18.\nThe Appeal Court further held that Mohammed’s verdict was without ambiguity and that the APC did not prove its case."
  },
  {
    "headline": "Panic In Umuahia After Attack On State CID",
    "summarized_story": "Panic has gripped Umuahia, the Abia State capital following reports of attack on the State Police Criminal Investigation Department (CID), along Uzuakoli road, by unknown gunmen.\nSporadic gunshots were heard from Ugwunchara area down to the police facility, which have sent the residents running for cover even as traffic gridlocks along the major roads have left many stranded.\nLEADERSHIP efforts to speak with the state’s command public relations officer (PPRO), Superintendent Geoffrey Ogbonna, on his mobile phone as at press time proved unsuccessful."
  },
  {
    "headline": "Panic In Umuahia After Attack On State CID",
    "summarized_story": "Panic has gripped Umuahia, the Abia State capital following reports of attack on the State Police Criminal Investigation Department (CID), along Uzuakoli road, by unknown gunmen.\nSporadic gunshots were heard from Ugwunchara area down to the police facility, which have sent the residents running for cover even as traffic gridlocks along the major roads have left many stranded.\nLEADERSHIP efforts to speak with the state’s command public relations officer (PPRO), Superintendent Geoffrey Ogbonna, on his mobile phone as at press time proved unsuccessful."
  },
  {
    "headline": "May 29: Only MKO Abiola Recognised Among Many Who Fought For Democracy – Shehu Sani",
    "summarized_story": "A human rights activist and former Senator representing Kaduna Central in the 8th Assembly, Shehu Sani, has said that only the presumed winner of June 12, 1993 presidential election, late Chief MKO Abiola, has been officially recognised among the army of Nigerians who fought for democracy in Nigeria.\nLEADERSHIP reports that Democracy Day, which was previously celebrated on May 29 to commemorate the return of democracy, has been moved to June 12 in honour of the Late MKO Abiola.\nIt would be recalled that Sani was a leading figure in the struggle for the restoration of democracy in Nigeria.\nHe was released from life imprisonment when democracy was restored in 1999.\nThe former federal lawmaker wrote: “Apart from the late Chief MKO, the Nigerian state never recognized and appreciated the galant young men and women, activists, journalists, workers and academics who fought the military for twenty years and restored democracy in Nigeria.”"
  },
  {
    "headline": "May 29: Only MKO Abiola Recognised Among Many Who Fought For Democracy – Shehu Sani",
    "summarized_story": "A human rights activist and former Senator representing Kaduna Central in the 8th Assembly, Shehu Sani, has said that only the presumed winner of June 12, 1993 presidential election, late Chief MKO Abiola, has been officially recognised among the army of Nigerians who fought for democracy in Nigeria.\nLEADERSHIP reports that Democracy Day, which was previously celebrated on May 29 to commemorate the return of democracy, has been moved to June 12 in honour of the Late MKO Abiola.\nIt would be recalled that Sani was a leading figure in the struggle for the restoration of democracy in Nigeria.\nHe was released from life imprisonment when democracy was restored in 1999.\nThe former federal lawmaker wrote: “Apart from the late Chief MKO, the Nigerian state never recognized and appreciated the galant young men and women, activists, journalists, workers and academics who fought the military for twenty years and restored democracy in Nigeria.”"
  },
  {
    "headline": "Governance Cost: Sacking Workers Not Long-term Solution – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said sacking of public servants may not be a long-term solution to reducing the high cost of governance in the country.\nAccording to him in a statement by his media aide, Laolu Akande, despite the fact that the country has a large public service, there are still huge shortages of manpower.\nResponding to a question on the cost of running the public service, the Vice President said the focus should be “on people being in the right place in the public service.\nWe have a large public service but you still have huge shortages in, for example, health and education sectors.\nExplaining circumstances where government may need to intervene directly, including in human capital development, the Vice President said, “direct state (government) intervention is crucial."
  },
  {
    "headline": "Police arrest 4 over illegal possession of pistol, ammunition —",
    "summarized_story": "Police in Kogi have arrested four suspects for illegal possession of arms and ammunition.\nThe statement signed by the command’s Spokesman, DSP William Aya, said that the suspects were arrested at about 5 p.m. on May 28 during a stop-and-search operation on Iyamoye/Kabba road.\nHe gave the names of the suspects as Yahaya Yakubu, 53, Ojo Dada, 20, Mohammed Okehi, 31, and Saliu Jimoh, 45.\nHe listed items recovered from them to include one locally made pistol with two live cartridges, one red colour Bajaj motorcycle with registration number Ondo QC 778 and one red colour TVS with registration number Ondo AKR 181 WK ,respectively.\nThe spokesman said the suspects would be charged to court as soon as investigation was concluded."
  },
  {
    "headline": "Kwara Gov. invites anti-corruption body to complete social audit on Ilesha...",
    "summarized_story": "AbdulRahman AbdulRazaq of Kwara has invited Elites Network for Sustainable Development (ENetSuD) to complete the Social Audit of Ilesha Baruba-Gwanara road construction project.\nElites Network for Sustainable Development (ENetSuD) is an Anti-Corruption Civil Society Organisation known in Kwara for its #FollowKwaraMoney project.\nThis is contained in a statement issued on Saturday in Ilorin by the Anti-Corruption body’s Chairman, Media and Publicity Committee, Mr Saeed Tijjani.\nThe statement said the governor communicated his invitation to ENetSuD on Saturday (May 29, 2021) through the office of his Senior Special Assistant (SSA) on Monitoring and Evaluation, Mr Mohammed Oyawoye, who is also the Focal Person to the Governor on Social Audit.\n“I am directed to inform you to complete the Social Audit Exercise of Ilesha Baruba-Gwanara road construction."
  },
  {
    "headline": "Army vows to make Nigeria safe as 6,400 regular recruits pass-out —",
    "summarized_story": "The Nigeria Army has restated its commitment to tackling numerous security challenges in various parts of the country.\nMaj.-Gen. Danjumma Ali-Keffi, General Officer Commanding 1 Division Nigeria Army Kaduna made the remarks during the passing out of 80 regular recruit intake at the Depot Nigeria Army Zaria on Saturday.\nHe noted that since its establishment in 1924, Depot Nigeria Army has the mandate of transforming able-bodied civilians into soldiers to meet the manpower requirement of the Nigeria Army.\n“It is noteworthy that as you pass out today, the strength of Nigeria army has been enhanced by 6,400 able-bodied men and women.\nHe added that the Depot has been able to evolve innovative ways of improving the standard of training in the Nigeria Army."
  },
  {
    "headline": "Panic in Ebonyi over sit-at-home order by IPOB — Daily Times Nigeria",
    "summarized_story": "Residents of Abakaliki, Ebonyi capital have been thrown into fear over the sit-at-home order by the proscribed Indigenous People of Biafra known as IPOB.\nThe News Agency of Nigeria (NAN) recalls that the Leader of IPOB, Nnamdi Kanu, had called on the five Eastern states to stock food items ahead of the order.\nSome security personnel were already patrolling major streets in the state capital in order to maintain peace and order in the area.\nShops and markets were opened for business but residents in the state were still buying food items over fear of what may happen.\nI have no choice than to come and buy some food items,” Eze said."
  },
  {
    "headline": "Large turnout of voters in Lagos APC primary",
    "summarized_story": "APC members on Saturday besieged the 10 voting centres in Badagry, waiting to vote in the primary election to select one out of the four aspirants contesting the seat of the council.\nA NAN correspondent who monitored activities in Badagry reports that voters besieged different designated centres as early as 8am waiting for officials that will conduct the primary.\nThe primary election centres visited by the NAN correspondent includes Gbenapon Primary School where Babatunde Hunpe, a member of the House of Representatives, will cast his vote; Anserudeen Primary School, where Dr Sunny Ajose, the Lagos State Deputy Chairman of APC, is expected to vote.\nCommenting on the lateness, Representative Hunpe said the election officials were attacked by hoodlums on their way to Badagry.\nMeanwhile, accreditation and voting exercise are yet to start in most voting centres in Badagry as of 12noon."
  },
  {
    "headline": "Large turnout of voters in Lagos APC primary",
    "summarized_story": "APC members on Saturday besieged the 10 voting centres in Badagry, waiting to vote in the primary election to select one out of the four aspirants contesting the seat of the council.\nA NAN correspondent who monitored activities in Badagry reports that voters besieged different designated centres as early as 8am waiting for officials that will conduct the primary.\nThe primary election centres visited by the NAN correspondent includes Gbenapon Primary School where Babatunde Hunpe, a member of the House of Representatives, will cast his vote; Anserudeen Primary School, where Dr Sunny Ajose, the Lagos State Deputy Chairman of APC, is expected to vote.\nCommenting on the lateness, Representative Hunpe said the election officials were attacked by hoodlums on their way to Badagry.\nMeanwhile, accreditation and voting exercise are yet to start in most voting centres in Badagry as of 12noon."
  },
  {
    "headline": "FG killing Polytechnic education in Nigeria – ASUP",
    "summarized_story": "The national leadership of the Academic Staff Union of Polytechnics, ASUP, yesterday accused the Federal and State Governments of deliberately killing and undermining Nigeria by wilfully designing and implementing bad policies in their institutions.\nThis was disclosed yesterday by the National President of ASUP, Comrade Anderson Ezeibe, who was flanked by ASUP Federal Polytechnic Oko branch, Chairman Comrade Onyebuchi Igbokwe and other national and Oko branch leaders, at a press briefing held at Federal Polytechnic, Oko, Aguata Local Government Area Anambra State.\n“Of course, like you know, 36 new Federal Polytechnics were established in the recent past in addition to the two established about three years ago.\n“We are asking for only N19 billion out of a total N823 billion that Federal Government earlier agreed since 2018, with the union, to be injected into the polytechnics education Nation wide.\n“Our members across all the Federal Polytechnics are owed for ten months arrears."
  },
  {
    "headline": "FG killing Polytechnic education in Nigeria – ASUP",
    "summarized_story": "The national leadership of the Academic Staff Union of Polytechnics, ASUP, yesterday accused the Federal and State Governments of deliberately killing and undermining Nigeria by wilfully designing and implementing bad policies in their institutions.\nThis was disclosed yesterday by the National President of ASUP, Comrade Anderson Ezeibe, who was flanked by ASUP Federal Polytechnic Oko branch, Chairman Comrade Onyebuchi Igbokwe and other national and Oko branch leaders, at a press briefing held at Federal Polytechnic, Oko, Aguata Local Government Area Anambra State.\n“Of course, like you know, 36 new Federal Polytechnics were established in the recent past in addition to the two established about three years ago.\n“We are asking for only N19 billion out of a total N823 billion that Federal Government earlier agreed since 2018, with the union, to be injected into the polytechnics education Nation wide.\n“Our members across all the Federal Polytechnics are owed for ten months arrears."
  },
  {
    "headline": "Buhari reacts to release of 14 abducted Greenfield University students",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari has reacted to the release of 14 students of Greenfield University, Kaduna after staying in captivity for 40 days.\nThe students were released on Saturday after huge ransoms have been paid.\nBuhari, in a statement on the official twitter handle of the presidency late Saturday night said he is relieved that the Greenfield University students freed on Saturday were now home safe, at the end of a 40-day ordeal.\n“Once again, the President condoles with the families of the students and staff that were killed by the abductors.\nBuhari assured that kidnapping and all other forms of criminality would continue to be met with zero tolerance by security agents."
  },
  {
    "headline": "Brazilians stage nationwide protests against Bolsonaro",
    "summarized_story": "Organized by leftist political parties, unions and student associations, Saturday’s protests in the capital Brasilia and in Rio de Janeiro were peaceful.\nBut in the northeastern city of Recife, police threw tear gas and shot rubber bullets.\nIn Sao Paulo, Brazil’s largest city, thousands of mask-wearing people blocked one of the largest city’s avenues.\nOne large balloon depicted Bolsonaro as a vampire.\nSome protests, like the one in Rio, included images of former leftist president Luis Inacio Lula da Silva wearing the presidential sash."
  },
  {
    "headline": "Breaking: Chelsea lift Champions League trophy after downing City",
    "summarized_story": "By Kazeem UgbodagaChelsea have won the Champions League trophy for the second time after beating Manchester City 1-0 on Saturday in Portugal.\nChelsea opened scoring on 42 minutes through Kai Havertz in an explosive final.\nHavertz ran on to a clever pass from Mason Mount and found himself one-on-one with the keeper.\nAn inch-perfect cross into the box found Phil Foden who rose for a header, but sent the ball well over the bar on 28 minutes.\nOn 60 minutes, City’s players appealed for a penalty after it appeared there was a handball by Reece James inside the box, but the referee ordered play on."
  },
  {
    "headline": "BREAKING: Chelsea Defeat Man City To Win 2020/21 Champions League",
    "summarized_story": "Chelsea won the Champions League this season after defeating Manchester City 1-0 in the final on Saturday.\nIn the first half, Kai Havertz scored the game-winning goal, latching on to Mason Mount’s through ball and around Ederson to tap home.\nThe Blues have won the trophy twice before, the first time in 2012 when they defeated Bayern Munich on penalties.\nIt is, however, the first time Thomas Tuchel has won it after losing in the final last year to Bayern Munich.\nThe wait for Pep Guardiola, who has won it twice with Barcelona, continues."
  },
  {
    "headline": "BREAKING: Again, Gunmen Set Ablaze Imo Police Station, High Court",
    "summarized_story": "On Saturday, unknown armed persons burned down the Atta Divisional Police Headquarters in Imo State’s Njaba Local Government Area.\nThe armed men also razed the Atta Magistrate and High Courts and destroyed the community’s health center, according to reports.\nThe building was reportedly razed between 1 and 2 a.m. by armed men.\nThe armed men invaded the hamlet after the people had gone to bed, according to the community’s crown prince, Remigiius Azike.\nHe said that the residence of the community’s president-general, Chijioke Duruonyeokwu, was set ablaze by unknown individuals only a week ago, killing his wife."
  },
  {
    "headline": "President Buhari Receives Second Dose Of COVID-19 Vaccine",
    "summarized_story": "The AstraZeneca COVID-19 vaccination was given to President Muhammadu Buhari for the second time.\nBashir Ahmed, the President’s Assistant on New Media, announced this on his Twitter account on Saturday.\nThe immunization, according to the post, took place on Saturday in the presidential house in Abuja.\n“Today, President @MBuhari received the second dose of the AstraZeneca/Oxford COVID–19 Vaccine, in his official residence, at the State House, Abuja.\nRecall that in March, Buhari had received the first dose of the vaccine alongside Vice-President, Yemi Osinbajo."
  },
  {
    "headline": "Breaking: Midfield marshal, N’Golo Kante, is player of Manchester vs Chelsea Champions League final match",
    "summarized_story": "Chelsea midfield commander, N’Golo Kanté, has been named player of the match for the 2021 UEFA Champions League final after helping his team defeat Manchester City 1-0 in Porto.\nThe latest defeat is third in barely two months against Manchester City.\nThe French international was a consistently solid presence in the Blues midfield, harrying his City counterparts and thwarting attacks with shrewdinterceptions.\nLikewise named player of the match in both of Chelsea’s semi-final contests with Real Madrid, Kanté also put in a crucial tackle on Kevin De Bruyne early in the second half and looked to carry the ball forward whenever possible.\nHe wins trophies, pure and simple, and his engine is just incredible."
  },
  {
    "headline": "Pictures: How Chelsea won, celebrated 2021 UEFA Champions League",
    "summarized_story": "NextBreaking: Chelsea ‘s Mendy now first African goalkeeper to win UEFA Champions League"
  },
  {
    "headline": "Breaking: In barely 2 months, Chelsea beat Manchester City 3 times, crowned Champions League winners again",
    "summarized_story": ""
  },
  {
    "headline": "Stolen Artefacts: ARAN commends FG’s recovery efforts -NigPilot",
    "summarized_story": "Rescuers Association of Nigeria, (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nHe said with the renewed calls for the repatriation of all looted Nigeria artifacts , with passion and commitment of the Minister, there is hope that “most stolen riches of the country will find its way back.”Recall that the Federal Government launched campaign for the repatriation of looted artefacts from the country in 2019 which yielded fruitfully with spate of return of stolen Nigerian antiquities from around the world.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral."
  },
  {
    "headline": "FG reiterates commitment to effective waste management system -NigPilot",
    "summarized_story": "Minister for Environment, Dr Muhammad Mahmoud Abubakar has said that the Federal Government is committed to an effective waste management system in Nigeria.\nThe Minister stated this at the 3rd International Waste Summit 2021, organised by the Waste Management Society of Nigeria, WAMASON, held in Port Harcourt, Rivers State.\nAbubakar noted that the Federal Government is seeking greater partnership with professional bodies like WAMASON on useful ideas on effective waste management in the country.\nHe stressed that youths could benefit through all the stages of waste management, from sorting, storage, transporting to treatment.\nIn achieving an effective waste management system, the Minister stated that the federal government will continue to develop policies to ensure that actions towards waste management are profitable."
  },
  {
    "headline": "NAPTIP DG calls for implementation of policies for protection of children",
    "summarized_story": "Director-General of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, Imaan Sulaiman – Ibrahim has called for the strengthening of policies, programs, and legal instruments that will further enhance the protection of Children in the Country.\nThe NAPTIP boss said “I join millions of Nigerians across the globe in wishing our children a Happy Children’s Day.\nQuite a large number of Nigerian children have fallen victims of illicit commercial activities which include human trafficking, sexual exploitation domestic servitude, and street begging.\n“It is therefore imperative that parents work closely with NAPTIP and other law Enforcement Agencies in ensuring that perpetrators of evil acts towards our children are reported in order to ensure that such perpetrators are brought to book.\n“NAPTIP on its part shall continue to work assiduously towards the protection of our children,” she said."
  },
  {
    "headline": "Children’s Day: UNICEF calls for protection of child rights -NigPilot",
    "summarized_story": "Commemorating the event of the Children’s Day, the United Nations Children’s Fund, UNICEF, has advocated the need to reinforce protection mechanisms for children especially at a challenging moment for child rights in the country and the world, with the COVID-19 pandemic threatening gains made for children’s development.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis – in Nigeria and around the world.\n“On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls is sexually abused.\n“Nigerian children are resilient, talented and aspire to do great things."
  },
  {
    "headline": "14 Abducted Greenfield University Students, Staff Released",
    "summarized_story": "﻿Chimezie Enyiocha, KadunaSome 14 abducted students and staff of Greenfield University in Kaduna State have been released, Channels Television can report.\nOn April 23, the remains of three of the abducted students were found in Kwanan Bature village, a location close to the university.\nIn a statement on May 5, President Muhammadu Buhari appealed for “the release of the students of the Greenfield University.”Parents, Police Face-OffThe students release comes 40 days after they were abducted.\nThe released hostages comprised of students and staff of Greenfield University, the statement said.\n“Governor Nasir El-Rufai welcomed the news of the students’ release, and conveyed solace and encouragement to them following their harrowing ordeal."
  },
  {
    "headline": "Gunmen Set Ablaze Courts, Police Station In Imo Community",
    "summarized_story": "Eyitope Kuteyi, OwerriGunmen have razed down a magistrate court, high court and a divisional police station in Atta community, Njaba local government area of Imo State.\nThe attack was accompanied by long hours of sporadic gunshots in the community, generating panic among residents.\nCommunity members said they noticed that the courts and police station had been set ablaze on Saturday morning.\nMajor streets in Owerri, the Imo State capital, recorded very low vehicular and human movement, as of Saturday morning.\nMarkets and businesses have also been mostly shut as Imo state residents fear an outbreak of violence."
  },
  {
    "headline": "Buhari Takes Second Dose Of COVID-19 Vaccine",
    "summarized_story": "﻿President Muhammadu Buhari has received his second dose of the AstraZeneca COVID-19 vaccine.\nThe second dose is being administered exactly 12 weeks after the first shot was taken on March 6.\nPresident Buhari after taking the COVID-19 vaccine told journalists that Nigeria is not doing badly relative to other developed countries like India and the United States.\n– COVID-19 Vaccination In Nigeria –A total of 3.94 million doses of AstraZeneca/Oxford vaccine were shipped into Nigeria on Tuesday, March 2, 2021.\nPresident Buhari and Vice-President Yemi Osinbajo received the AstraZeneca vaccine, a day after the Federal Government launched the vaccination exercise in the country."
  },
  {
    "headline": "Troops Eliminate 10 Boko Haram Terrorists, Repel Attack On Rann",
    "summarized_story": "Barely hours after the newly appointed Chief Of Army Staff (COAS) Major General Faruk Yahaya assumed office, troops of the Nigerian Army repelled an attack by Boko Haram terrorists in Rann, Borno State, killing 10 of the terrorists in the process.\nAccording to a statement signed on Saturday by Army spokesperson, Brigadier General, Mohammed Yerima, the terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\nThe new COAS, Faruk Yahaya, on Friday assumed duty at the Army headquarters in Abuja.\nHe was appointed by President Muhammad Buhari on Thursday, making him the 22nd Chief of Army Staff in the country.\nUntil his appointment, the new army chief was the Theatre Commander of Operation Hadin Kai, the counter-insurgency operation in the North-East."
  },
  {
    "headline": "Gunmen Raze Down Police Facility In Abia",
    "summarized_story": "A facility occupied by the Abia State Police Criminal Investigation Department (CID) in Umuagu, Umuahia, has been razed down by unknown gunmen.\nSome suspects detained in the facility were also released.\nThis is the latest in a series of attacks targeted at government facilities in Abia state and in the south-east region generally.\nThe region is home to a secession movement championed by the Indigenous People of Biafra (IPOB), which has been proscribed by a Nigerian court.\nIPOB, which is seeking to create a Biafra nation, has ordered a sit-at-home directive on Sunday in respect of south-easterners which died in Nigeria’s deadly civil war."
  },
  {
    "headline": "House will act speedily on Security summit report – Gbajabiamila",
    "summarized_story": "Speaker Femi Gbajabiamila says the report of the security summit organized by the House of Representatives will be ready for presentation to President Muhammadu Buhari soon.\nThe Speaker, in a remark on Saturday at the end of the summit, said the quality of inputs and presentations received by various stakeholders was unprecedented.\nThe Speaker expressed appreciation and thanked all those who contributed to the summit, saying Nigerians have shown that they could come together for a common good."
  },
  {
    "headline": "Police confirm attack on its facilities, Courts in Imo",
    "summarized_story": "The Imo State Police command has confirmed an attack on the High court, Magistrate court and a police station at Attah in Njaba local government area.\nIn a statement by the command’s public relations officer Elkana Bala the Command received a distress call that at the early hours of Saturday that some hoodlums mobilised in large number, stormed the premises of the High/Magistrate Court Attah and set it on fire.\nThey also damaged a building that was constructed by the community intended to be used as Police Station in the Area.\nThe statement further state upon the receipt of the complaint, Police Special Forces were deployed to the scene to restore peace and order.\nThe state Commissioner of Police Abutu Yaro, has ordered a full investigation into the incident and directed that no stone should be left unturned until the perpetrators of such heinous crime are apprehended and made to face the full weight of the law."
  },
  {
    "headline": "Champions League: Havertz Goal Lifts Chelsea Over City as Londoners Secure Second Trophy",
    "summarized_story": "Chelsea have won the Champions League for the second time in their history as a Kai Havertz goal was enough to see off Manchester City 1-0 at the Estadio do Dragao in Porto on Saturday.\nThe match marked the London side’s first appearance in a final since their dramatic 2012 triumph over Bayern Munich in Munich, and third overall.\nBut it was City whose back-line was split open three minutes later.\nFrom a goal kick, Ben Chilwell played on Mason Mount who found a streaking Kai Havertz racing into a massive gap between City defenders.\nAnd despite seven minutes of added on time and Phil Foden going close, Pep Guardiola and City were left to rue an opportunity missed, as Chelsea celebrated their triumph."
  },
  {
    "headline": "Historic: Brentford Promoted to Premier League for First Time After Win Over Swansea",
    "summarized_story": "Brentford will play in the Premier League for the first time next season after beating Swansea City 2-0 in the Championship play-off final.\nIvan Toney’s penalty put them on the road to the top flight before Emiliano Marcondes’ crisp far-post finish.\nThomas Frank’s team will play at the highest level for the first time since 1946-47 having eased past a Swansea side who finished with 10 men.\nVictory could be worth about £178 million to the west London club.\nThe Bees were beaten in last season’s second-tier play-off final by Fulham, who ran out 2-1 winners after extra time."
  },
  {
    "headline": "Goodluck Jonathan to Brief Extraordinary ECOWAS Summit on Mali Crisis – Arise News",
    "summarized_story": "Mr Jonathan is ECOWAS Special Envoy and Mediator for Mali.\n“In line with the ECOWAS Protocol on Democracy and Good Governance, the President of the Republic, H.E.\nNana Addo Dankwa Akufo-Addo, in his capacity as Chair of the ECOWAS Authority of Heads of State and Government, following due consultations with his peers decided to convene this Extraordinary Summit,” the statement read.\n“May I indicate that the convening of the Extraordinary Session demonstrates the unwavering commitment of the President of the Republic towards addressing the political situation in Mali.\n“It would be recalled that barely a week after his assumption of office as Chair of the ECOWAS Authority, H.E."
  },
  {
    "headline": "Nigeria: After 40 Days in Captivity, 14 Abducted Kaduna Varsity Students Regain Freedom",
    "summarized_story": "Fourteen of the 17 remaining abducted students of the Greenfield University, in Nigeria:s northwestern Kaduna State have been released after 40 days in captivity.\nOn April 18, 2021, bandits invaded the university which is located along the dreaded Kaduna- Abuja road, at about 8:30pm and abducted 23 students.\nSpokesman of the Kaduna state police command, Mohammad Jalige, confirmed the release of the 14 students when contacted on telephone.\n“Yes, 14 of the students of the Greenfield University were released from captivity this evening (Saturday), remaining three of them still in captivity,”Jalige said.\nJalingo had disclosed during the interview the families of the abducted students paid N55 million."
  },
  {
    "headline": "Adegboruwa, Ubani Share Thoughts on Splitting Kaduna Into Two",
    "summarized_story": "Senior lawyer and human rights activist Ebun Adegboruwa, and Executive Director Fix Politics, Anthony Ubani, both joined the Newsnight crew to dissect burning national issues, including constitutional amendment and Kaduna’s quest to split into two states.\nWatch this informative video."
  }
]