[
  {
    "headline": "Borno GM jailed 28 years for N86m contract fraud",
    "summarized_story": "A Borno State High Court, sitting in Maiduguri, has sentenced a civil servant, Ma’aji Arfo, to 28 years imprisonment for engaging in an N86.1 million contract fraud.\nArfo, who was sentenced to jail by Justice Haruna Mshellia, of Borno State High Court 3, was the General Manager of the state-owned Maiduguri Flour Mills Limited, where he committed the fraud.\nHe was charged on a six-count by the Independent Corrupt Practices and Other Related Offences Commission for offences bordering on abuse of office and conferring undue advantage on himself.\nOne of the counts on which he was convicted revealed that he awarded multiple contracts to Falkwat Multilinks Limited, a private company where he was a director, to supply diesel and maize to Maiduguri Flour Mills.\nThe court further heard how Arfo, while being a public servant, awarded several contracts between 2016 and 2017 to his private company to supply maize to Maiduguri Flour Mills Limited."
  },
  {
    "headline": "Tukur deserves commendation for Nigeria’s debt forgiveness – Buhari",
    "summarized_story": "), has said elder statesman, Alhaji Bamanga Tukur, deserves commendation for the role he played in securing debt relief for Nigeria a few years ago.\nTukur, who once served as Managing Director of the Nigerian Ports Authority, was also a one-time National Chairman of the Peoples Democratic Party.\n“Prior to that, many poor African countries were using a large portion of their little resources to service debt obligations.\n“The benefits of debt cancellation were that many African countries were then able to free up resources which they previously channeled into debt servicing and deployed them into socio-economic and infrastructural projects.\n“To my mind, much credit has not yet been given to the role played by Alhaji Bamanga Tukur in the process."
  },
  {
    "headline": "National convention has clarified our status – Ekiti PDP chair",
    "summarized_story": "THE acting Chairman, Peoples Democratic Party, Ekiti State chapter, Lanre Omolase, said on Thursday that the party’s State Executive Committee participation in the just concluded PDP National Convention had put to rest the controversy surrounding its status.\nThe PDP in Ekiti State has been having issues following the parallel congresses at the ward, local government and state levels.\nA statement from the PDP State Publicity Secretary, Raphael Adeyanju, titled, ‘Ekiti PDP chair sues for peace’, quoted Omolase to have said, “The National Convention has ratified the ward, local government and state congresses that produced the present Ekiti State PDP executives.\n“As the highest ruling organ of the party, the decision of the convention is final and binding on all members of the party.\n“We urge all aggrieved members of the PDP to come to a roundtable to resolve our differences in the interest of our great party and Ekiti State."
  },
  {
    "headline": "Ugwuanyi at Nza Street accident scene, visits survivors at hospital, takes care of medical expenses",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State, on receiving news of the unfortunate accident this evening at Nza Street, Independence Layout, Enugu, involving a truck vehicle and Tricycles (KEKE), immediately visited the scene of the incident for needful intervention.\nUgwuanyi, who was accompanied by his deputy, Hon.\nMrs. Cecilia Ezeilo, thereafter proceeded to Posh Hospital, New Haven, Enugu, to empathize with the survivors and ensure that they receive adequate medical attention.\nHe therefore pledged to pay all medical bills of the accident victims and consequently made sufficient funds available with the hospital management to ensure the patients were properly treated without any hindrance.\nHe condoled with the families of victims who lost their lives in the accident and thanked those who rescued the survivors and brought them to the hospital for being Good Samaritans."
  },
  {
    "headline": "ANAMBRA DECIDES: 35 youth associations endorse Nwankwo, AAC candidate",
    "summarized_story": "TWO days to the Anambra State Governorship election, 35 youth associations, yesterday endorsed Dr. Chidozie Nwankwo, the African Action Congress, AAC, candidate.\nThe endorsement took at the Events Centre of Nobles Hotels, Awka, on the heels of the royal endorsement by Traditional Rulers from Anambra Central Senatorial Zone.\nThey asked the candidate to remember the youths when he comes into office and make them critical partners in his administration.\nHe said that they support Dr. Nwankwo because of his over 30 years involvement in the creation and sustenance of successful and thriving industries with global standards and practice.\nNwachukwu said that the Youths of Anambra State want Dr. Nwankwo to change the entire narratives in the state and urged him to use his integrity, resourcefulness and wide Trade and Business contacts to reposition Anambra State and make it great again."
  },
  {
    "headline": "EFCC releases Obi Cubana, to face court trial",
    "summarized_story": "By Soni Daniel – AbujaTop businessman, Obinna Iyiegbu aka Obi Cabana, on Thursday night left the headquarters of the Economic and Financial Crimes Commission after spending three nights with investigators who grilled him on alleged tax fraud, currency abuse and money laundering.\nSpokesman for the EFCC, Wilson Uwujaren, confirmed late on Thursday that Cubana had been released from its custody.\nIt was not clear what the businessman finally did to meet the conditions of his release.\nBut there are indications that the businessman would be summoned in future to defend himself in court over issues bordering on currency abuse, tax fraud and money laundering based on what a top source called ‘verified business transactions’.\nIt will also be recalled that Obi Cubana came to the spotlight following the flamboyant burial he and his followers staged for his late mother earlier this year."
  },
  {
    "headline": "Anambra Election: Army denies alleged escort of fake voters",
    "summarized_story": "“The mischief makers, using the social media, shared a video alleging that soldiers were escorting buses filled with fake voters into Anambra State.\n“Even though such despicable propaganda images can easily be punctured by any keen observer, however for the sake of posterity, we wish to state without any equivocation, that no soldier of the Nigerian Army indulged in escort of fake voters into Anambra State.\n“Contrary to the misleading information, the buses in question were conveying INEC permanent and adhoc staff for the election tasks in Anambra State.\n“We will remain apolitical and very professional in deeds and conduct for the growth and development of democracy in Nigeria.\n“We also encourage the political gladiators to refrain from dragging the Nigerian Army and indeed the Armed Forces of Nigeria into the murky waters of politics."
  },
  {
    "headline": "N22.1bn Earned Allowance: Varsity non-teaching staff threaten to shut down labs, research centres",
    "summarized_story": "According to Nwokoma, the 25 percent allocated to the non teaching staff unions should be clearly allocated to each union on the basis of signed FGN/ University based unions 2009 agreement.\nNAAT equally decried the spate of abduction within the University system, describing Tuesday’s kidnapping of six persons at University of Abuja as unfortunate.\nIt also condemned the spate of building collapse in the country, insisting that government should ensure that all agencies must adhere to building regulations.\nNAAT is calling on relevant agencies of government at all levels to ensure adherence of all building projects with the building regulations”.\nOn vaccination, he said, “Our position on compulsory vaccination for our workers is that we are of the view that it is very wrong for the government to say that vaccination should be compulsory."
  },
  {
    "headline": "EFCC finally releases Obi Cubana after 3 days in detention",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has finally released billionaire businessman, Obinna Iyiegbu, popularly known as Obi Cubana.\nDAILY POST recalls that the Anambra-born club owner was arrested and taken to the headquarters of the anti-graft agency, Jabi, Abuja, on Monday, following allegations of money laundering and tax fraud.\nThe popular socialite was, however, released on Thursday evening after he had spent three days in detention undergoing interrogations.\nAccording to the spokesman of the commission, Wilson Uwujaren, who confirmed the release to reporters on Thursday night, Cubana was allowed to go after the crack detectives of the commission completed their questioning."
  },
  {
    "headline": "Anambra election: Nigerian Army not political – Gen Nwachukwu",
    "summarized_story": "Ahead of Saturday’s election, the Nigerian Army (NA) has declared that the military unit remains apolitical.\nDirector of Public Relations, Brigadier General Onyema Nwachukwu made the clarification in a statement Thursday night.\nNwachukwu accused mischief makers of sharing a video on social media, alleging that soldiers were escorting buses filled with fake voters into Anambra State.\nWe urge the general public to please disregard the report, as it is clearly a misinformation.\nThe Army vowed to continue to operate along these lines to ensure that peace and security reign in the country."
  },
  {
    "headline": "Sit-at-home: Ohanaeze hails IPOB’s decision",
    "summarized_story": "Apex Igbo socio-cultural organization, Ohanaeze Ndigbo has commenced the Indigenous People of Biafra, IPOB, for cancelling the sit-at-home earlier scheduled to take effect from tomorrow, November 5 to November 10, 2021.\nhttps://dailypost.ng/2021/11/04/ipob-cancels-one-week-sit-at-home-urges-anambra-people-to-vote-on-saturday/Reacting, the Ohanaeze Ndigbo Youth Council Worldwide, OYC, hailed the IPOB for once again heeding the voice of reason.\n“We are delighted over the cheering news that the IPOB has cancelled the one-week sit-at-home, which we earlier said would be of great consequence on the entire Igboland.\n“At this point, we re-echo our appeal to our people to go out en-mass and cast their ballot for their preferred candidate in the Anambra guber election,” Okwu said.\nAnambra election: IPOB’s plans to frustrate poll must be resisted – Northern elders"
  },
  {
    "headline": "Don’t play politics with education – Govt warned",
    "summarized_story": "Government at all levels in the country have been warned against playing politics with education in Nigeria.\nHe noted that the country’s education sector has been negatively impacted by worsened social upheaval and economic instability.\n“The challenges in the education sector in the country have been worsened by social upheaval and economic instability.\nAccording to Malumfashi, the education sector in Nigeria was faced with various national challenges, including low quality of education, indiscipline, politics, poor parenting and guidance, among others.\n“The sector is faced with various national challenges which include low quality of education, indiscipline, politics, poor parenting and guidance, lack of infrastructure, unstable curriculum and calendar, unwillingness to study education, poor funding and poor governance of education,” he said."
  },
  {
    "headline": "Projects: Gov. Ugwuanyi reiterates his administration’s commitment to completion of projects",
    "summarized_story": "Ugwuanyi who on arrival inspected the ongoing massive construction works at the T-junction flyover bridge, Nike Lake Road, with the Speaker of the State House of Assembly, Rt.\nAlex Ugwu, among others, pointed out that his administration has executed numerous road projects within the council area totaling 66km.\n“Our administration shall continue to prioritize those projects that ameliorate the living standard of our people and stimulate economic growth.\nUgwu, and the project Contractor, Chief Dr. Donald Ekete, who are all indigenes of Enugu East LGA, thanked Gov.\nUgwuanyi for his special interventions and numerous projects his administration has executed in the council area, reassuring him of the people’s prayers and support."
  },
  {
    "headline": "BREAKING: Body of Osibona, developer of collapsed Ikoyi building recovered",
    "summarized_story": "Rescuers on Thursday night retrieved and identified the remains of Femi Osibona, developer of the collapsed 21-storey Ikoyi building from the rubbles.\nThe Nation gathered that his body was discovered before 7pm and identified by officials of the Ministry of Physical Planning before it was evacuated in an ambulance.\n- Advertisement -At the time of this report, no official announcement has been made in that regard but bystanders and artisans informed reporters on the development as the body bag was being moved to the ambulance.\nSources also confirmed to The Nation that Osibona’s remains have been recovered.\nDetails shortly…"
  },
  {
    "headline": "2022 census: FCTA pledges support for NPC",
    "summarized_story": "Federal Capital Territory Minister, Malam Muhammad Bello, has pledged the support of FCT administration toward the success of the 2022 national census exercise.\nThe minister gave the pledge when he received a delegation from National Population Commission (NPC), led by its Executive Chairman, Malam Nasir Kwarra, on a visit to FCTA, on Thursday in Abuja.\n- Advertisement -He said that the FCT administration was very conscious and also appreciative of the work of NPC, especially because of the rising population growth in the FCT.\nAccording to him, FCT administration will require accurate data for the purpose of matching physical expansion with the rising population.\nEarlier, NPC executive chairman had solicited for the support of FCTA for the success of the 2022 national census."
  },
  {
    "headline": "Ikoyi building tragedy: Sanwo-Olu declares 3-day mourning",
    "summarized_story": "Lagos State Governor, Mr Babajide Sanwo-Olu, has declared three days of mourning over the collapsed Ikoyi building, which occurred on Monday.\nHe said that all flags were to be flown at half-mast in public and private buildings and official engagements cancelled during the mourning period.\n- Advertisement -The governor said that the mourning would begin on Friday and end on Sunday.\nREAD ALSO: Panel of Inquiry for collapsed Ikoyi building inaguarated”The Lagos State Government, once again, commiserates with all those who lost their loved ones in the unfortunate incident,” he said.\nSanwo-Olu had visited the site thrice to encourage the rescuers and console relations of those believed to have been trapped under debris of the 21-storey building."
  },
  {
    "headline": "IPOB cancels sit-at-home order over Anambra Gov poll",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has cancelled its sit-at-home order in the southeast.\nThe proscribed group had threatened to lock down the region from November 5 to protest the detention of its leader, Nnamdi Kanu.\nEmma Powerful, IPOB’s spokesperson, on Thursday, said the sit-at-home order has been cancelled to allow people in Anambra to participate in the governorship election on Saturday.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\nNigeria government must give us date for Biafra referendum to decide where we want to belong.”"
  },
  {
    "headline": "Ikoyi building collapse: Death toll rises to 32 as governor inaugurates 6-man tribunal",
    "summarized_story": "By Lukman Olabiyi, LagosLagos State Governor Babajide Sanwo-Olu on Thursday signed an executive order giving legal backing to a tribunal of inquiry set up to probe the collapse of a 21-storey building on Gerard Road, Ikoyi.\nThe panel members were sworn in at the Five Cowries Boat Terminal of the Lagos State Water Authority (LASWA) on Falomo Road, Ikoyi.\nGovernor Sanwo-Olu, who was at the site of the collapsed building on Wednesday, had vowed that the state government would not leave any stone unturned in investigating circumstances surrounding the collapse of the building.\nThe governor, who left the venue for the collapsed building site on Gerrard Road, met and interacted with all the first responders to enable him to assess the extent of the rescue operation ongoing.\nGovernor Sanwo-Olu said the bodies of the dead would as from Friday be ready for release to their families for burial, as autopsies are being concluded."
  },
  {
    "headline": "anambra-poll-ipob-cancels-1-week-sit-at-home",
    "summarized_story": "The Indigenous People of Biafra (IPOB), has cancelled its one week sit-at-home order across the South East.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\nMeanwhile, Kenya has confirmed in court that the IPOB leader did not undergo extradition proceedings in the country.\nA statement by Nnamdi Kanu’s younger brother, Kingsley said: “On 2nd November 2021, the government of Kenya filed its defence to the suit I had earlier filed in Kenya on behalf of my brother, Mazi Nnamdi Kanu.\nOur immediate goal is to secure the unconditional release of Mazi Nnamdi Kanu from detention.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "South East govs to IPOB: We’ll meet FG on Kanu",
    "summarized_story": "The South East Governors Forum said: “We are confident that through our mediation, that of religious leaders, Ohanaeze Ndigbo and traditional rulers, IPOB will see reasons to call off all sit-at-home orders, including the recent one of 5th to 10th November, 2021.\n“We as South East Governors are committed to political solutions over the present situation in South East and this will be achieved faster if all the illegal sit-at-home orders and violence by the various state agitators are stopped in South East.”In a statement today, the South East Governors Forum said it was also engaging the various group declaring sit-at-home in the South East to stop all forms of violence and illegalities in South East and allow South East leaders to address all issues raised by them.\nThe statement signed by chairman of the South East Governors Forum and Ebonyi State governor, David Umahi, said: “We are however working with security agencies, our local security and our leaders to protect the lives of our people and to address all issues raised.\nWe are aware of the various illegal orders of sit-at-home by different groups of state agitators for our people of South East to sit at home every Monday and from 5th to 10th November 2021.”The group said it has identified spokespersons of some of these groups and have been engaging them to stop all forms of violence and illegalities in South East and allow South East leaders to address all issues raised by them.\nWhile applauding Ohanaeze Ndigbo for a good job done through various committees towards addressing all issues raised Igbo youths in the various South East States, the governors also thanked religious leaders, Conference of Bishops and Archbishops of South East, the traditional institutions of South East and Christian Association of Nigeria of South East for their interventions and mediations on this matter."
  },
  {
    "headline": "Lagos: Riot in Ipaja following police killing of Keke rider over N100 bribe",
    "summarized_story": "The Keke riders threw stones and other weapons at the police patrol team, commandeering the road as they protested the killing of their colleague.\nThe policemen, who opened fire to scare off the rioting Keke riders, reportedly called for reinforcement from other police formations, who came to their rescue.\nA witness who is also a Keke rider told Daily Sun that the violent incident occurred Thursday morning.\nAfter the police, we will settle Lagos State Traffic Management Agency (LATSMA), Road Safety, Vehicle Inspection Officers, and motor touts.\nThe government should come to our aide and save us from untimely death and extortion.’Another witness told Daily Sun that three people died in the riot."
  },
  {
    "headline": "Breaking: Anambra guber: INEC begins distribution of sensitive materials to 21 LGAs",
    "summarized_story": "From Obinna Odogwu, AwkaThe Independent National Electoral Commission (INEC) has commenced the distribution of sensitive materials for next Saturday’s governorship election in Anambra to the 21 Local Government Areas of the state.\nThe INEC team, led by the National Commissioner and Chairman, Information, Voter Education and Publicity Committee of the commission, Festus Okoye, are currently in the premises of the Central Bank of Nigeria (CBN) distributing the materials to the LGAs.\nMore details shortly…"
  },
  {
    "headline": "Breaking: Body of Collapsed High-rise Building Developer, Femi Osibona, Recovered",
    "summarized_story": "Kingsley Nwezeh and Nume EkegheThe body of Mr. Femi Osibona, the developer of the collapsed Ikoyi High-rise building, has been recovered, according to Arise TV.\nReports monitored on Arise TV said two reliable sources confirmed that Osibona’s body had been found and identified.\nThe 21-storey building on Gerrard Road in Ikoyi, Lagos collapsed on Monday, claiming over thirty lives, while several people are still believed to be trapped in the rubble.\nNine survivors had been rescued so far.\nMore details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "INEC: We’ll Ensure Only Eligible Voters Determine Next Anambra Governor",
    "summarized_story": "Yakubu, speaking at a stakeholders’ meeting, said some of the sensitive materials had been secured at the Anambra State branch of the Central Bank of Nigeria (CBN) in Awka.\nI am glad to report that all the BVAS required for the election on Saturday have been configured and delivered to Anambra State.\n“An additional 1,112 polling units were established in Anambra State in addition to the existing 4,608 locations.\nUnderstandably, the voters have also been cautious.”Yakubu explained that out of the 5,720 polling units in the state, 86 (1.5%) had no voters.\nAccording to him, “No one is allowed to wear any cloth, emblem or colour signifying any political party to the polling units."
  },
  {
    "headline": "Building Collapse: Sanwo-Olu Sets Up Six-man Probe Panel as Death Toll Rises",
    "summarized_story": "Sanwo-Olu disclosed this yesterday as he named members of the probe panel at the site of the incident.\nA source said, “The dead body of the PA (Personal Assistant) to the owner of the collapsed Lagos building has been recovered.\nMembers of the probe panel announced by Sanwo-Olu comprised a professional builder, town planner, structural engineer, and legal practitioners – all from the private sector.\nAlready, General Manager of the Lagos State Building Control Agency (LASBCA), Arc.\nThe panel members have been given clear terms of reference and we are giving them a 30-day assignment to tell us what has gone wrong at the site."
  },
  {
    "headline": "ARISE Fashion Week Heads to Dubai World Expo",
    "summarized_story": "Vanessa Obioha and Dike OnwuamaezeAfrica’s most dominant and dazzling runway platform, Arise Fashion Week, is heading to Dubai in December.\nIn collaboration with the Nigerian Pavilion at Expo2020 Dubai and the Federal Ministry of Industry Trade and Investment, the platform would be showcasing the best of African fashion designers and music at the expo in Dubai.\nAlso, Grammy-award winning singer Wizkid would be providing musical entertainment and long-term partner of Arise Fashion Week, Naomi Campbell would be making an appearance alongside other global celebrities.\nSince its return, Arise Fashion Week has been at the forefront of promoting and celebrating the next generation of African fashion designers.\nGovernor, Central Bank of Nigeria (CBN), Godwin Emefiele, who graced the occasion in 2020, had acknowledged the potential of the Nigerian fashion industry during his speech."
  },
  {
    "headline": "Upstream Commission Seeks to Tackle Bureaucracies Causing High Oil Production Cost",
    "summarized_story": "He said as a business enabler, the upstream commission would operate and regulate with best industry practices and would continue to remain very transparent.\nHe urged the OPTS to support the commission in ensuring that key upstream development projects were started.\n“It is only when staff are happy that we can talk of improving our crude oil production quota, which is presently below what we should be producing.\n“Any crisis can further harm the low daily oil production in Nigeria and worsen the nation’s federally generated oil revenue,” Komolafe argued.\n“So, what we have done is by extension to improve the nation’s revenue by increasing crude oil production from the current level of 1.4 mbbls/d to 2.4 mbbls/d,” he added."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's 60-year-old Accountant-General Idris Set To Wed 16-year-old Girl As Fourth Wife On Friday",
    "summarized_story": "It shows the Accountant General is just after that small girl to take advantage of her youthful age.\nHe replied that it’s a small world which confirmed the wedding was true,” a top family source had confided in SaharaReporters.\nThe family source added that the Accountant-General had bribed some media organisations they contacted for help and their request to expose his atrocities was, therefore, turned down.\n“There was no investigation just because he is the Accountant General of the Federation.\nThe shareholdings of both firms indicate a spread of Idris family members on the official board."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's 60-year-old Accountant-General Idris Set To Wed 16-year-old Girl As Fourth Wife On Friday",
    "summarized_story": "It shows the Accountant General is just after that small girl to take advantage of her youthful age.\nHe replied that it’s a small world which confirmed the wedding was true,” a top family source had confided in SaharaReporters.\nThe family source added that the Accountant-General had bribed some media organisations they contacted for help and their request to expose his atrocities was, therefore, turned down.\n“There was no investigation just because he is the Accountant General of the Federation.\nThe shareholdings of both firms indicate a spread of Idris family members on the official board."
  },
  {
    "headline": "BREAKING: Owner Of Collapsed Lagos Building, Osibona, Discovered Dead, Removed From Rubble",
    "summarized_story": "The Chief Executive Officer of Fourscore Homes Limited, Femi Osibona, has been confirmed dead.\nThe body of Osibona, who is the owner of the 21-storey building that collapsed in Ikoyi, was discovered among others during the rescue operation on Thursday.\nThere have been concerns over the whereabouts of Osibona, Wale Bob-Oseni, his friend, and others trapped in the building.\nOn Tuesday, Nifemi, the personal assistant to Osibona, was confirmed dead.\nOn Monday, the building located on Gerrard Road, Ikoyi, Lagos collapsed with a yet-to-be-ascertained number of persons still trapped beneath the rubble."
  },
  {
    "headline": "BREAKING: Owner Of Collapsed Lagos Building, Osibona, Discovered Dead, Removed From Rubble",
    "summarized_story": "The Chief Executive Officer of Fourscore Homes Limited, Femi Osibona, has been confirmed dead.\nThe body of Osibona, who is the owner of the 21-storey building that collapsed in Ikoyi, was discovered among others during the rescue operation on Thursday.\nThere have been concerns over the whereabouts of Osibona, Wale Bob-Oseni, his friend, and others trapped in the building.\nOn Tuesday, Nifemi, the personal assistant to Osibona, was confirmed dead.\nOn Monday, the building located on Gerrard Road, Ikoyi, Lagos collapsed with a yet-to-be-ascertained number of persons still trapped beneath the rubble."
  },
  {
    "headline": "Socialite, Obi Cubana Released By Anti-graft Agency, EFCC After Three Days",
    "summarized_story": "Popular socialite and businessman, Obinna Iyiegbu, aka Obi Cubana, has been released.\nThis comes three days after he was detained by the Economic and Financial Crimes Commission over alleged money laundering and tax evasion.\nObi CubanaThe Anambra-born club owner was reportedly arrested on Monday afternoon and was granted administrative bail on Tuesday.\nMeanwhile, on Thursday evening, Cubana was released from the EFCC custody, according to Punch.\nThe Cubana Group Chairman had been taken to the Abuja headquarters of the anti-graft agency on Monday afternoon regarding alleged offences bordering on alleged money laundering and tax fraud."
  },
  {
    "headline": "Mohammed Abacha admits in court: I used a different name to acquire OPL 245 (transcript)",
    "summarized_story": "Mohammed Abacha admitted before the FCT high court sitting on Thursday that he used a different name — Mohammed Sani — to register Malabu Oil and Gas Ltd, the company that was awarded the controversial OPL 245 in 1998.\nSanga: Tell the court your full nameAbacha: Mohammed Sani Abacha, also known as Mohammed SaniAdvertisementSanga: What do you do for a living?\nAbacha: Mohammed Sani and Mohammed Sani AbachaErokoro: What is the name on your international passport.\nAbacha: It was Mohammed Sani and now Mohammed Sani AbachaErokoro: In what year did it change to Mohammed Sani AbachaAbacha: I can’t remember.\nAbacha: Sani Abacha."
  },
  {
    "headline": "Mohammed Abacha admits in court: I used a different name to acquire OPL 245 (transcript)",
    "summarized_story": "Mohammed Abacha admitted before the FCT high court sitting on Thursday that he used a different name — Mohammed Sani — to register Malabu Oil and Gas Ltd, the company that was awarded the controversial OPL 245 in 1998.\nSanga: Tell the court your full nameAbacha: Mohammed Sani Abacha, also known as Mohammed SaniAdvertisementSanga: What do you do for a living?\nAbacha: Mohammed Sani and Mohammed Sani AbachaErokoro: What is the name on your international passport.\nAbacha: It was Mohammed Sani and now Mohammed Sani AbachaErokoro: In what year did it change to Mohammed Sani AbachaAbacha: I can’t remember.\nAbacha: Sani Abacha."
  },
  {
    "headline": "Body of Femi Osibona, Fourscore Homes owner, recovered from collapsed building",
    "summarized_story": "Femi Osibona, owner of Fourscore Homes, the company in charge of the 21-storey building that collapsed in Lagos, has been found dead.\nAdvertisementAn official of the National Emergency Management Agency (NEMA), who confirmed the development to TheCable at the site, said rescue workers recovered Osibona’s body on Thursday evening.\nOn Thursday night, there were several security operatives on ground as the ministry of health conveyed his body away from the site.\nThe building, one of a group of three under construction, collapsed on Monday afternoon.\nAdvertisementThere is still no official figure of how many people were in the building when the structure caved in."
  },
  {
    "headline": "Body of Femi Osibona, Fourscore Homes owner, recovered from collapsed building",
    "summarized_story": "Femi Osibona, owner of Fourscore Homes, the company in charge of the 21-storey building that collapsed in Lagos, has been found dead.\nAdvertisementAn official of the National Emergency Management Agency (NEMA), who confirmed the development to TheCable at the site, said rescue workers recovered Osibona’s body on Thursday evening.\nOn Thursday night, there were several security operatives on ground as the ministry of health conveyed his body away from the site.\nThe building, one of a group of three under construction, collapsed on Monday afternoon.\nAdvertisementThere is still no official figure of how many people were in the building when the structure caved in."
  },
  {
    "headline": "For Anambra guber poll, IPOB cancels sit-at-home order",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has cancelled its sit-at-home order in the south-east.\nEmma Powerful, IPOB’s spokesperson, on Thursday, said the sit-at-home order has been cancelled to allow people in Anambra to participate in the governorship election on Saturday.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\n“IPOB leadership is only interested in our referendum and peaceful agitation for self determination, and cannot by under any guise be seen to be interfering with any electoral process.\nIPOB doesn’t expect anybody to observe, monitor or enforce the suspended order, otherwise such action will be considered a rebellion to the highest leadership of our global movement."
  },
  {
    "headline": "A surge in African fintech's intra-continental expansion to target SMEs",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango/birdSupport for small businesses keen to trade across the continent’s single market is being eyed as a potentially lucrative market by more and more African fintech startups.\nSurge in intra-continental expansionIn the last month alone, a number of startups have either raised growth funds, acquired another player present in regional markets within the same vertical, or tapped top talent in the telecoms industry.\nTheir intention appears to be the targeting of small industries and traders seeking cross-border opportunities in new African markets.\nThe program comes barely a month after Tala raised 145 million dollars in equity, hinting that part of the growth funds would go toward supporting its geographical expansion.\nUntil recently, a lack of local knowledge and access to trade and market information has been linked to low trade volumes and value."
  },
  {
    "headline": "African founders lead Payhippo’s $3m seed investment",
    "summarized_story": "There’s a new exciting trend in the African tech ecosystem: African founders backing fellow founders especially in pre-seed and seed funding, which is an indication that the African tech ecosystem is maturing.\nCapital is a lifeline of businessThere are over 40 million small and medium businesses (SMEs) in Nigeria.\nBut only a few of these businesses have access to capital, mostly due to heavy collateral requirements and long time of loan processing.\nFounded by Zach Bijesse, CEO, Chioma Okotcha, COO, and Uche Nnadi, CTO, Payhippo provides small businesses with short-term working capital with average loan amounts of $1300.\n“Access to credit is a critical necessity for small businesses to manage their daily challenges."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from world’s most valuable crypto exchange",
    "summarized_story": "The investment was led by FTX, the most valuable crypto derivatives exchange company owned by the youngest billionaire in the world, Sam Bankman-Fried.\nWith a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "Nigeria’s E-Settlement acquires Côte d’Ivoire’s QuickCash to increase financial inclusion across Africa",
    "summarized_story": "E-Settlement (E-SL), a Nigerian fintech group of companies, has acquired QuickCash, an Ivorian electronic payment and money transfer company, to expand and boost last-mile access to financial services in Francophone African countries like Côte d’Ivoire, Burkina Faso, Niger, Togo and more.\n“QuickCash is deepening access for agricultural-dominated areas, rural populations, the underbanked and unbanked: the disproportionately financially excluded.\n“At E-SL, we want to empower all by accelerating access to payments, financial services, and jobs.\nPatricia Zoundi Yao, CEO at QuickCash believes that E-SL has the “right vision and deep expertise” to drive QuickCash’s geographic expansion and next stage of growth.\n“E-SL is a leading payment services provider with a strong position in Nigeria’s fintech ecosystem."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "NFTs and music, Egypt’s money rain, Payhippo’s $3m seed, and Opibus’s $7.5m funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Music and blockchainFunding rounds in EgyptPayhippo’s $3m seedOpibus’s $7.5m fundingNFTs and musicThe NFT market keeps growing.\nSource: SuppliedNigerian fintech startup, Payhippo, has closed a $3 million seed funding round.\nThe company produces heavy-duty electric vehicles (EVs) such as buses and trucks by converting petrol and diesel-based vehicles into electric, reducing cost and, in a way recycling older vehicles.\nOpibus has been manufacturing EVs since 2017, intending to make electric vehicles affordable in Africa.\nHowever, we still have the likes of Jet Motor Company that announced a $9 million funding in 2020, Siltech, and Ampersand playing in the space."
  },
  {
    "headline": "Blockchain meets music: How music label owner promotes artistes and sells their music as NFTs",
    "summarized_story": "But music NFTs are gaining some wind too.\nThe song was minted on Rocki, an NFT music platform on Binance Smart Chain (BSC).\nNFTs are transforming the music businessHector believes NFTs are going to be a big part of the music business in a few years.\nWhy buy music NFTs?\nHe’s currently creating a crypto token and, at the same time, building a blockchain metaverse where crypto and NFTs reign supreme."
  },
  {
    "headline": "MallforAfrica shuts down, Affiong Williams’ ReelFruit, Chipper Cash’s extension round, Violence against journalists",
    "summarized_story": "For Affiong Williams, Founder and CEO of agritech startup, ReelFruit, starting a fruit processing business in Nigeria with no template to draw from was a bold move.\nThe extension round was led by crypto exchange platform, FTX with SVB Capital, Deciens Capital, Ribbit Capital, Bezos Expeditions, One Way Ventures, and Tribe Capital participating.\nCurrently serving seven African countries, Chipper Cash was founded in 2018 by Sam Serunjogi and Maijid Moujaled to facilitate cross border payment in Africa.\nThis is where Chipper Cash has found a sweet spot.\nSerunjogi reveals that Chipper Cash offers remittances at “considerably cheaper” prices than other competitors."
  },
  {
    "headline": "COP 26: Nigeria’s coal deposit gets 2030 final development deadline",
    "summarized_story": "At least, 23 countries have made new commitments to phase out coal power, including five of the world’s top 20 coal power-using countries.\nWith the developments from COP 26, Nigeria’s vast coal resources may not only be untapped, the country will get nothing from abandoning it.\nIn a new ‘Global Coal to Clean Power Transition Statement,’ countries also committed to scaling up clean power and ensuring a just transition away from coal.\nCOP 26 has set a new gold standard on the Paris Alignment of international public finance and sends a clear signal for private investors to follow.\nIn separate announcements, major emerging economies today took significant steps to move from coal to clean power."
  },
  {
    "headline": "Collapsed building: Experts’ views",
    "summarized_story": "As rescue operations continue with more survivors and dead bodies being pulled out from the rubbles of the collapsed 21-storey building in Ikoyi, Lagos, experts have faulted Lagos State government on regulatory compliance in the state’s building sector.\nThe experts described the otherwise ambitious collapse building as bad construction with serious engineering issues.\nThe pillars were too weak which explains why the building collapsed like a pack of cards with the deckings (slaps) falling on one another as if it were controlled demolition.\nRead Also: More evidence shows Ikoyi collapsed building developer flouted permit“Financiers are going to be a lot more cautious and will be asking a lot of questions on developers’ antecedents before committing funds to a project.\nMeanwhile, fresh facts have emerged on the collapsed building that are not only big slap on the regulatory authority, but also a dent on the integrity of the developer and the building industry in Nigeria in general and Lagos State in particular."
  },
  {
    "headline": "MTN eyes more cash with N90bn bond, shares sale",
    "summarized_story": "As it eyes expansion in infrastructure deployment in Nigeria in the next three years and debt refinancing, MTN Nigeria is intensifying activities around growing its cash reserve.\nThe nearly N90 billion bond is the second tranche of the N200 billion bond issuance programme by MTN Nigeria.\nThe process to sell shares will be done by way of a bookbuild to institutional investors and a fixed price to retail investors.\nThe offer opened in November with a bookbuild to institutional investors, after which a fixed price will be announced for retail investors.\nA spokesperson for Chapel Hill Denham said on Thursday the price for the retail investors would be reflective of the market."
  },
  {
    "headline": "Obaseki offers automatic employment to best graduating students of Edo University – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has offered automatic employment to the best graduating students of the Edo State University, Uzairue.\nObaseki announced this during the third convocation ceremony of the varsity in Uzairue, Etsako West Local Government Area (LGA) of Edo State.\nAccording to him, “Those exceptional students who have obtained one university prize or the other should note that you have automatic employment into Edo civil service.\n“I want to appreciate the management of the institution for keeping to the vision of our government to build a world-class university in Edo.\n“For the graduands, I urge you to continue to be good ambassadors of Edo State University, Uzairue."
  },
  {
    "headline": "Edo taskforce intensifies enforcement of traffic laws, arrests offenders – Nigerian Observer",
    "summarized_story": "The team conducted the enforcement at Sapele Road, Santana Market, Ring Road, Mission Road, New Benin, Upper Mission Extension, and Aduwawa, amongst others.\nOloriegbe said over 10 vehicles were impounded on the first day of the enforcement exercise, warning road users against violating the state’s traffic rules.\nAccording to him, “This is a general sensitization exercise on traffic management across the Benin metropolis and it’s a multi-agency collaboration.\nWe are collaborating with the police, Edo State Security Network, and other security outfits in the state to keep the roads safe, especially as we approach the Christmas period.\nHe continued: “We are not arresting traffic offenders because of money but because of safety and to ensure that people obey the law, especially as we approach Christmas."
  },
  {
    "headline": "Enugu NSCDC deploys 350 personnel, 15 vehicles for Anambra guber poll – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEnugu – The Nigeria Security and Civil Defence Corps (NSCDC), Enugu State Command, says it is deploying no fewer than 350 personnel for the forthcoming Anambra governorship election.\nThe News Agency of Nigeria (NAN) reports that the Anambra gubernatorial poll will hold on Saturday, Nov. 6 under INEC’s supervision.\nManuel said that the command was also deploying 15 operational vehicles to ensure hitch-free movement of its personnel while carrying out their election duty in Anambra.\n“The NSCDC is determined to see a hitch-free and peaceful election just as the Federal and Anambra Governments are determined also”.\n“The commandant had given the command’s contingent all logistics and moral support to ensure a hitch-free election duty and for them to do the command proud in Anambra,” he added."
  },
  {
    "headline": "EFCC opens money laundering trial of ex-governor’s aide’s wife – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestYenagoa – The Economic and Financial Crimes Commission, on Wednesday, opened its case in the money laundering case it instituted against Mrs Beauty Apere at the Federal High Court Yenagoa.\nThe absence of EFCC’s star witness on Oct 20 had stalled the N200-million money laundering suit against Mr Embelakpo Apere, and his wife, Beauty, in separate cases before the court.\nAt the resumed trial, the prosecution witness, Mr Timothy Owoeye, an official of the EFCC, in his evidence, said that the Commission collaborated with several banks and regulatory agencies during its investigation.\nHe told the court that the Commission acted on a Suspicious Transactions Report (STR) from the Nigerian Financial Intelligence Unit (NFIU) to investigate the defendant.\nThe trial judge, Justice Isa Ndahen, adjourned the case until Nov. 4 for ruling on the admissibility of the documents tendered in evidence by the EFCC."
  },
  {
    "headline": "Court jails civil servant seven years for N86.1 million fraud",
    "summarized_story": "The Borno State High Court in Maiduguri, has sentenced a civil servant, Ma’aji Arfo, to seven years imprison for engaging in an N86.1 million contract fraud.\nMr Arfo was the General Manager of the State-owned Maiduguri Flour Mills Limited, where he committed the fraud.\nCounsel for ICPC, Anas Kolo, while arguing the case, told the court that the convict in October 2015, awarded a N4.9 million contract to Falkwat Multilinks Limited to supply 40,000 litres of diesel to the flour mills.\nThe court further heard how Mr Arfo, while being a public servant, awarded several contracts between 2016 and 2017 to his private company, Falkwat Multilinks Limited, to supply maize to Maiduguri Flour Mills Limited.\nHe was convicted of an offence of approving the payment of N16 million to Falkwat Multilinks to supply 217.45 metric tonnes of maize."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anambra election: IPOB cancels sit-at-home, asks people to vote",
    "summarized_story": "The Indigenous People of Biafra (IPOB), has suspended a one week sit-at-home order it threatened to issue, starting from November 4, if its leader, Mazi Nnamdi Kanu is not released.\nSpokesman for the group, Emma Powerful, on Thursday, said the sit-at-home order has been cancelled to allow people in Anambra to participate in the governorship election on Saturday.\n“The people of Anambra State should go out en masse and peacefully exercise their franchise come 6th November, 20121, and accordingly, choose a leader of their choice and should not be intimidated by anybody, group of persons or security agents,” he said.\nFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Abiodun: We’ve eliminated favouritism in Ogun civil service",
    "summarized_story": "He equally noted that the model his administration adopted has helped in identifying top performing civil servants who are indeed deserving to be permanent secretaries.\nAbiodun stated this shortly after he was decorated as the Grand Patron of the Association of Retired Heads of Service and Permanent Secretaries, held in Abeokuta, Ogun state capital.\n“Since when we assumed office, we’ve put different policies in place to ensure that the Ogun State civil service is known to be that which merit is placed above anything else.\nTo that extent, we introduced different reforms to assure and guarantee that favouritism does not have a role to play in the appointment of permanent secretaries.\n“Consequently, the model that we have since adopted has helped us in identifying top performing civil servants who are indeed deserving to be permanent secretaries."
  },
  {
    "headline": "Criminals have hijacked IPOB agitation – Southeast governors cry out",
    "summarized_story": "Dave Umahi, thanked the federal government and the Independent National Electoral Commission (INEC) for their efforts in ensuring that Saturday’s Anambra State governorship election holds.\n“We thank our religious leaders, Conference of Bishops and Archbishops of South East, the traditional institutions of South East and Christian Association of Nigeria of South East for their interventions and mediations on this matter.\n“We are aware that the insecurity in South East has gone beyond IPOB.\n“We thank Federal Government of Nigeria and Independent National Electoral Commission (INEC) for their determination to hold Anambra election on 6th November, 2021.\nWe as South East Governors are committed to political solutions over the present situation in South East and this will be achieved faster if all the illegal sit-at-home orders and violence by the various state agitators are stopped in South East."
  },
  {
    "headline": "MTN to sell 575m shares in Nigeria unit through public offer",
    "summarized_story": "OBINNA EZUGWUTelecom giant, MTN, says it plans to proceed with a public offer to sell up to 575 million shares in its Nigeria business.\nThe company noted that the separation of fintech and fibre assets was on track.\nMTN, which along with Vodacom Group Ltd (VODJ.J) controls over 70% of the South African mobile market in terms of subscribers, said the offer to sell shares in MTN Nigeria will open this month with a bookbuild to institutional investors, after which a fixed price will be announced for retail investors.\nMTN’s core profit jumped 24.1% in the three months to September on robust demand for data and digital financial services.\nIt added 0.2 million subscribers during the quarter, taking the total to 271.9 million, Reuters reported."
  },
  {
    "headline": "NASS Tackles Amaechi Over $1.3bn Kano-Maradi Rail Project",
    "summarized_story": "The National Assembly, on Thursday, tackled the Minister of Transportation, Chibuike Rotimi Amaechi, over plan to construct a standard gauge for Kano-Maradi rail line and a narrow gauge for other rail projects in the country.\nSo if we approve this budget for you, you will go and do Kano-Maradi standard rail line and do a narrow gauge rehabilitation for the South-East.\nThen give me a second approval that will enable me to look for the $14billion to construct standard gauge.\nSo that by the time you finish it, the rail is running while we are looking for money to construct standard gauge.\nWhatever weight of cargo that narrow gauge will carry is the same weight of charge that standard gauge will carry."
  },
  {
    "headline": "NASS Tackles Amaechi Over $1.3bn Kano-Maradi Rail Project",
    "summarized_story": "The National Assembly, on Thursday, tackled the Minister of Transportation, Chibuike Rotimi Amaechi, over plan to construct a standard gauge for Kano-Maradi rail line and a narrow gauge for other rail projects in the country.\nSo if we approve this budget for you, you will go and do Kano-Maradi standard rail line and do a narrow gauge rehabilitation for the South-East.\nThen give me a second approval that will enable me to look for the $14billion to construct standard gauge.\nSo that by the time you finish it, the rail is running while we are looking for money to construct standard gauge.\nWhatever weight of cargo that narrow gauge will carry is the same weight of charge that standard gauge will carry."
  },
  {
    "headline": "Anambra Poll: IPOB Cancels Sit-At-Home, Urges Electorate To Cast Their Votes",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has cancelled the one-week sit-at-home order it earlier declared in the South-East region.\nA statement made available to journalists by the spokesperson of IPOB, Emma Powerful, on Thursday, said the cancellation of the sit-at-home order followed the genuine intervention of thier elders, esteemed traditional institutions/rulers and religious leaders.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\n“IPOB leadership is only interested in our referendum and peaceful agitation for self-determination, and cannot by under any guise be seen to be interfering with any electoral process.\nNo rigging of any kind will be tolerated on the Anambra State governorship election."
  },
  {
    "headline": "Anambra Poll: IPOB Cancels Sit-At-Home, Urges Electorate To Cast Their Votes",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has cancelled the one-week sit-at-home order it earlier declared in the South-East region.\nA statement made available to journalists by the spokesperson of IPOB, Emma Powerful, on Thursday, said the cancellation of the sit-at-home order followed the genuine intervention of thier elders, esteemed traditional institutions/rulers and religious leaders.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\n“IPOB leadership is only interested in our referendum and peaceful agitation for self-determination, and cannot by under any guise be seen to be interfering with any electoral process.\nNo rigging of any kind will be tolerated on the Anambra State governorship election."
  },
  {
    "headline": "Insurgency: 2,295 Teachers Killed, 19,000 Others Displaced In North-East – NEDC",
    "summarized_story": "The managing director, North-East Development Commission (NEDC), Mohammed Alkali, has disclosed that about 2,295 teachers lost their lives while 19,000 others displaced in the over 11 years of Boko Haram insurgency in Borno, Yobe and Adamawa States.\nHe made the disclosures on Thursday while flagging off a five-day basic education workshop for 300 basic education teachers at the Sir Kashim Ibrahim College of Education, in Maiduguri, the Borno State capital.\n“Over 2,295 teachers have been killed and 19,000 others displaced in Borno, Yobe and Adamawa States in the last eleven years.\nHe said as a matter of fact, the North-East region has the lowest literacy rates as well as poorest performance in examinations.\n“The teachers training aims to boost teachers’ capacity in pedagogy, safety and trauma counselling skills amongst others."
  },
  {
    "headline": "South-East govs: Criminals using IPOB’s name to kill innocent citizens",
    "summarized_story": "The South-East Governors’ Forum has said that criminals are using the name of the Indigenous People of Biafra to kill innocent citizens.\nThis was disclosed in a statement issued by the Governor of Ebonyi State and Chairman, South East Governors’ Forum, David Umahi, and made available to newsmen on Thursday.\nCultists, armed robbers and kidnappers have recruited themselves and are using the name of IPOB to be killing innocent citizens.\n“We thank the Federal Government of Nigeria and the Independent National Electoral Commission for their determination to hold the Anambra election on 6th November 2021.\nWe as South East Governors are committed to political solutions over the present situation in South East and this will be achieved faster if all the illegal sit-at-home orders and violence by the various state agitators are stopped in South East."
  },
  {
    "headline": "South-East govs: Criminals using IPOB’s name to kill innocent citizens",
    "summarized_story": "The South-East Governors’ Forum has said that criminals are using the name of the Indigenous People of Biafra to kill innocent citizens.\nThis was disclosed in a statement issued by the Governor of Ebonyi State and Chairman, South East Governors’ Forum, David Umahi, and made available to newsmen on Thursday.\nCultists, armed robbers and kidnappers have recruited themselves and are using the name of IPOB to be killing innocent citizens.\n“We thank the Federal Government of Nigeria and the Independent National Electoral Commission for their determination to hold the Anambra election on 6th November 2021.\nWe as South East Governors are committed to political solutions over the present situation in South East and this will be achieved faster if all the illegal sit-at-home orders and violence by the various state agitators are stopped in South East."
  },
  {
    "headline": "Anambra 2021: IPOB cancels sit-at-home order, urges participation in election",
    "summarized_story": "The Indigenous People of Biafra has cancelled its one-week sit-at-home order it issued across the South-East.\nIPOB said it called off the order after consultations with elders, traditional, and religious leaders from the region.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\n“The people of Anambra State should go out en masse and peacefully exercise their franchise come 6th November 2021 and accordingly, choose a leader of their choice and should not be intimidated by anybody, group of persons or security agents.\nNo rigging of any kind will be tolerated on the Anambra State governorship election."
  },
  {
    "headline": "Anambra 2021: IPOB cancels sit-at-home order, urges participation in election",
    "summarized_story": "The Indigenous People of Biafra has cancelled its one-week sit-at-home order it issued across the South-East.\nIPOB said it called off the order after consultations with elders, traditional, and religious leaders from the region.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\n“The people of Anambra State should go out en masse and peacefully exercise their franchise come 6th November 2021 and accordingly, choose a leader of their choice and should not be intimidated by anybody, group of persons or security agents.\nNo rigging of any kind will be tolerated on the Anambra State governorship election."
  },
  {
    "headline": "OML 11: Ogoni leaders ask Wike to lead talks with FG",
    "summarized_story": "Okafor Ofiebor/Port HarcourtLeaders of Ogoni people of Rivers have asked Governor Nyesom Wike to lead discussion with the Federal Government on on the planned resumption of oil production in OML 11.\nFormer President of the Movement for the Ogoni People (MOSOP), Ledum Mitee, revealed this to journalists after a closed door meeting held at Government House, Port Harcourt on Thursday with Governor Wike.\nHe said the meeting with Governor Wike was sequel to the meeting a delegation of Ogoni leaders had with President Muhammadu Buhari a couple of weeks ago in Abuja.\nHe added that the Ogoni delegation to Abuja discussed a number of issues and it was important to brief Governor Wike on those issues.\nA prominent Ogoni women leader, Chief Priscilla Vikue said her people are united and will not allow anyone pass through back door to take Ogoni oil."
  },
  {
    "headline": "Ade-Ojo: \"I Didn't Sell Collapsed Building Land to Osinbajo\"",
    "summarized_story": "Chief Michael Ade- Ojo, founder of Elizade Motors and Elizade University, Ilara Mokin, Ondo State, has denied selling the land of the Ikoyi collapsed building to Vice President Yemi Osinbajo.\nIn a statement he personally signed yesterday, he said he owns the land adjacent to the property on Gerald Road but debunked the report by an online medium (Saharareporters) that he sold the land where the collapsed property was built.\nHe added that although he owns the next property to the crumbled building, he has no intention of selling it.\nSee his statement below:"
  },
  {
    "headline": "Goodluck Jonathan Foundation appoints Prof Olukoshi to its board",
    "summarized_story": "The Goodluck Jonathan Foundation (GJF) has appointed Professor Adebayo Olukoshi, a renowned academic and international development expert, as a member of its board.\nThe Executive Director and Secretary of the Goodluck Jonathan Foundation Board, Ms Ann Iyonu said: “The Goodluck Jonathan Foundation is pleased to welcome Prof. Adebayor Olukoshi as a member of our board.\nHe joins the Foundation with over 35 years of experience in governance and academics.\n“He will work with other reputable individuals drawn from different backgrounds and nationalities within and outside Africa to provide policy direction to the Foundation’s programmes and policies.”Others on the board of the Goodluck Jonathan Foundation are H.E Dr. Goodluck Ebele Jonathan, President, Federal Republic of Nigeria (2010-2015) Founder and Chair of the Board of the Goodluck Jonathan Foundation.\nRecently, the Foundation lost one of its board members, Innocent Chukwuma, therefore requiring that the board be strengthened with more appointments."
  },
  {
    "headline": "Wande Coal returns with visuals to new hit single 'Come my way'",
    "summarized_story": "By Harrison IyohaBarely a week after releasing the audio of the hit single ‘Come My Way’, Afropop, Afrobeats, R&B superstar, Wande Coal has released correspondingly befitting visuals to this highly engaging tune.\nAfrica’s number one vocalist and one of the best voices in the industry today, Wande is clearly that sauce that everyone needs to make their songs better.\nThe ‘Come My Way’ video follows the singer around unconventional corners and interesting places with meta moments where the camera focuses on captivating the brilliance of Wande in sound and movement as he traipses around in a sequence of enviable, made-to-measure looks by Deangelictouchstylist.\nThe mingling of video art, projections, and high fashion neatly distills Wande’s eccentric style into a vivid blend of photography, nature, with no extras, just the black diamond in his natural element.\nWatch the riveting video of ‘Come My Way’ here and on all digital platforms"
  },
  {
    "headline": "Lagos PMO begins working tour of agencies",
    "summarized_story": "The Lagos State Parastatals Monitoring Office (PMO) has begun a working visit to various parastatals and agencies.\nHe described Parastatals as the servicing ends of the government, which could be likened to foot soldiers in a military formation.\nIn the same vein, the Permanent Secretary of PMO, Mrs. Toyin Oke-Osanyintolu applauded Ms. Deola Adepoju, the Director of Women Development Centre, and others at the helms in the various parastatals for their diligence and dedication.\nAyantayo and Oke-Osayintolu, alongside other management staff of the PMO, also visited Lagos State Scholarship Board (LSSB) and Lagos State Examinations Board (LSEB) on Tuesday.\nOther agencies visited include Radio Lagos/Eko FM, Traffic Radio, Lagos Television, LASRRA."
  },
  {
    "headline": "BREAKING: IPOB Calls Off One-Week Sit-At-Home Order, Urges Anambra Residents To Vote On Saturday",
    "summarized_story": "IPOB, the Indigenous People of Biafra, has called off its one-week sit-at-home order in the Southeast.\nFollowing meetings with elders, traditional, and religious leaders from the Southeast, the order was canceled, according to IPOB.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home.\nNo rigging of any kind will be tolerated on the Anambra State governorship election.\n“We wish to thank Biafrans, IPOB members worldwide, friends of Biafra and lovers of freedom for their continued support for our dogged struggle for independence,” IPOB said."
  },
  {
    "headline": "BREAKING: Owner of Ikoyi Collapsed Building, Femi Osibona, Is Dead [VIDEO]",
    "summarized_story": "Femi Osibona, the owner of the collapsed 21-storey building is dead, News Direct can report.\nPopular journalist, Dele Momodu, confirmed Mr. Osibona’s death via his Instagram page on Thursday evening.\nVIDEO: The moment Femi Osibona's body was taken away from collapsed building site pic.twitter.com/NZDQJrtAxE — TheCable (@thecableng) November 4, 2021The late Osibona owns the popular Fourscore Homes, a Lagos-based real estate firm located along Gerrard Road, collapsed on Monday afternoon.\nEarlier, the dead body of Mr Osibona’s PA (Personal Assistant), Nifemi, was recovered from the rubbles.\nNot less than 36 people have so far been confirmed dead since the building collapsed."
  },
  {
    "headline": "Lagos Building Collapse: I Need To See My 17-year-old Son’s Body – Dead Or Alive – Father",
    "summarized_story": "The enraged father explained that his son, along with his coworkers, was at the construction site with the boss when the structure fell.\nThe bereft father pleaded with the state authorities to step up rescue efforts so he could learn if his son was dead or alive.\nI have seen the picture of his boss, he’s dead.\nI want to see my son to know if he’s dead or alive, I am not looking for justice, I just want to see my son to know if he’s dead or alive.\nNine people were rescued alive from the rubble of the collapsed building by emergency personnel."
  },
  {
    "headline": "[BREAKING] Ikoyi Building Collapse: Death Toll Rises To 38",
    "summarized_story": "The death toll in the 21-storey building that collapsed on Monday on Gerrard Road, in the Ikoyi area of Lagos State, has increased to 38.\nThe building crumbled around 2pm when workers were on the site.\nNews Direct had reported that many people were trapped in the rubble, including the Managing Director, Fourscore Heights Limited, Mr Femi Osibona, who owned the building.\nThe South-West Coordinator of the National Emergency Management Agency, Ibrahim Farinloye, on Thursday confirmed the number while adding that nine people which included one female and eight males were rescued alive."
  },
  {
    "headline": "Sit-at-home: At last, South-east govs break silence, reveals next line of action on Nnamdi Kanu",
    "summarized_story": "They said the meeting would also address the pockets of violence in the region and the sit-at-home orders issued by different groups of agitators.\n“We thank our religious leaders, Conference of Bishops and Archbishops of South East, the traditional institutions of South East and Christian Association of Nigeria of South East for their interventions and mediations on this matter.\nHe said: “President Muhammadu Buhari’s meeting with South East leaders during his visit in Owerri was highly commended and indeed a good and strategic step towards reconciliation and reassuring to Igbo.\n“For avoidance of doubt, the name Nigeria is derived from one of the biggest rivers in Africa- River Nigeria.\nI want to point out the fact that Nigeria flag is flying everywhere in Igbo land,” the statement said.”"
  },
  {
    "headline": "Tension as gunmen abduct 11 persons in Abuja, environ within 5 days",
    "summarized_story": "“While Sambisa forest is several kilometers away from Abuja, Kaure is only two hours drive to Abuja,” the governor further added.\nAnd to further ease their operations, sources told Blueprint the security personnel manning the gate was tied by the hoodlums.\nAlso, another anonymous student said students living within and outside the school premises now lived in fear, as cultists now attack students and others around.\nIn a chat with our reporters, Asake Muftau who resides in Jikowyi, an Abuja suburb, said: “We woke up to gridlock on Wednesday and we were told that some people are plotting to attack Abuja.\n“In my opinion, our security personnel need to change their tactics."
  },
  {
    "headline": "Breaking: Femi Osibona’s body, owner of collapsed 21-storey building recovered",
    "summarized_story": "The remains of the CEO Fourscore Heights, Femi Osibona, developer of the collapsed 21-storey building has been recovered.\nA combined team of emergency responders recovered the body which has been taken to a morgue on Thursday.\nBlueprint gathered that the lifeless body of Osibona, was recovered, Thursday, after painstaking efforts from emergency responders.\nTalking about the casualties of the collapsed building, one of the survivors said there were about 100 people in the building at the time it caved in.\nNine out of about 38 bodies evacuated from the rubble were injured."
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "East-West Road has gulped N359bn- Akpabio -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has disclosed that over N359billion has so far been expended on the 657km dual carriage East-West Road stretching from Calabar in Cross River State, to Effurun in Delta State since it was initiated in 2006.\nAkpabio said bearing in mind the objectives of President Muhammadu Buhari on the completion of ongoing projects, the Niger Delta Ministry was considering raising funds from other sources to ensure the completion of section I-IV of the road before the end 2023.\nThe minister made this statement during the Ministry’s 2021 Budget Performance Review and 2022 Proposed Budget Consideration to the House of Representative Committee on Niger Delta Affairs on Tuesday in Abuja.\nSpeaking earlier, during the budget presentation the Chairman House of Representative Committee on Ministry of Niger Delta Affairs Hon.\nEssien Ekpeyong, assured that the Legislature is committed to the security of lives and investment in the Niger Delta region and for economic and social activities to strive."
  },
  {
    "headline": "Anambra Governorship Candidates Sign Peace Accord",
    "summarized_story": "﻿Candidates in the imminent Anambra governorship election on Thursday signed a peace accord in Awka, the state captial.\nChairman of the Independent National Electoral Commission (INEC), Professor Mahmood Yakubu, was present at the ceremony, which was facilitated by the National Peace Committee.\nAnambra, as in much of the South-East, has witnessed several ‘gunmen’ attacks, casting doubts on the safety of the elections.\nBut the Federal Government has beefed up security in the state, pledging a free and fair poll.\nOn Tuesday, Senate minority leader, Enyinnaya Abaribe urged voters to show up at the polls, noting that the elections will be safe."
  },
  {
    "headline": "Ikoyi Building Collapse: Lagos Govt, NEMA Differ On Casualty Figure",
    "summarized_story": "The Lagos State Government and the National Emergency Management Agency (NEMA) have differed on the casualties recorded from the Ikoyi building collapse as rescue efforts continue.\nGovernor Babajide Sanwo-Olu of Lagos State, who visited the scene on Thursday, noted that 32 bodies have been recovered from the building collapse.\nRead Also: Ikoyi Building Collapse: Sanwo-Olu Inaugurates Tribunal Of Inquiry‘A Horrific Tragedy’; Fashola Sympathises With Victims Of Ikoyi Building Collapse‘Only 19 Names’Amid continued rescue efforts, families and relatives are hanging around the collapsed structure in the high-brow area of Lagos State, waiting for news about their loved ones trapped in the building.\n“As I speak here, there are only 19 names of missing persons that have been registered.\nThe building, which was under construction, collapsed on Monday with an unconfirmed number of persons feared trapped."
  },
  {
    "headline": "Anambra Election: IGP Orders Restriction Of Vehicular Movement",
    "summarized_story": "Ahead of Saturday’s governorship election in Anambra, the Inspector General of Police, Usman Alkali Baba, has ordered the restriction of vehicular movement in the state.\nThe IGP in a statement issued on Thursday said the restriction is part of measures aimed at protecting the sanctity of the electoral process on November 6.\nAccording to the statement, there would be no movement of vehicles in and out of Anambra State from 11:59 pm on Friday, November 5 to 11:59 pm on Saturday, November 6.\nREAD ALSO: Anambra Guber Poll: US Threatens Visa Ban On Electoral Offenders“The IGP noted that the restriction order has become necessary following pointers from the Election Security Threats Assessments conducted by the Force which indicate a high likelihood of infiltration by criminally-minded individuals to Anambra State, before, during and after the polls,” the statement read.\nBaba enjoined citizens particularly motorists and travellers who may want to use the routes within Anambra State during the period of the restrictions to seek alternative routes and see the inconveniences as part of sacrifices toward the collective sustenance of our democracy."
  },
  {
    "headline": "Gunmen Kill Seven, Injure Several Others In Adamawa",
    "summarized_story": "Seven persons have been killed with several others injured during an attack by gunmen on the Negga community in the Numan Local Government Area of Adamawa State.\nSources told Channels Television that heavily armed assailants stormed Negga between 11 pm and 12 midnight and started shooting sporadically.\nNegga, a community in Bolki ward, of Numan local government area of Adamawa, is a border community between Adamawa and Taraba and had suffered a series of attacks for years now.\nDeputy Speaker and member representing Numan constituency, Pwamwakeno Mackondo who confirmed the attack said his constituency lost seven persons, while seven others sustained injuries.\nHe asked the military operatives in the area to protect the people from these incessant attacks by suspected herdsmen."
  },
  {
    "headline": "[VIDEO]: Anambra Gubernatorial Candidates In Last-Ditch Attempt To Woo Electorates",
    "summarized_story": "﻿In a final attempt to woo electorates, some candidates in the race for the Anambra State Governorship elections have given their final words of promise ahead of the November 6 polls.\nSome of them include the candidate of the Peoples Democratic Party, Valentine Ozigbo; Social Democratic Party, Obinna Ozoh; Accord Party, Godwin Maduka; All Progressives Grand Alliance (APGA) Charles Soludo; and the Young Progressives Party (YPP) Ifeanyi Ubah.\nFrom improved infrastructure to boosting the state’s capacity to attract investors, the candidates who appeared on Channels Television’s Politics Today on Thursday, gave electorates a glimpse of what they would do if elected as the next governor come November 6.\nRead Also: Anambra Governorship Candidates Sign Peace AccordThe candidates had earlier in the day, signed a peace accord in Awka, the state capital."
  },
  {
    "headline": "Police reaffirm readiness to ensure peaceful Anambra Governorship Poll -",
    "summarized_story": "The Nigerian Police Force have reaffirmed the readiness of the country’s lead security agencies to ensure the November 6 Anambra state governorship election is peaceful, credible and violent free.\nThe Deputy Inspector of Police Zaki Ahmed gave the assurance at a media parley with journalists in Awka, said the personnel will be professional enough to ensure the exercise is is Hitch free.\nThe police DIG announced the shut of the state by 12 midnight on Friday night, said the police and other security Agencies are committed to ensure the election is Peaceful.\nOn Wednesday, the chairman of the Independent National Electoral Commission, Mahmood Yakubu at an expanded Stakeholders meeting in Awka, reaffirmed the commitment of the commission to go ahead of the November 6 Anambra state governorship election, despite several threats from different quarters to halt the exercise."
  },
  {
    "headline": "Sanwo-Olu inaugurates Six-Man Panel to investigate Ikoyi building collapse -",
    "summarized_story": "Lagos State governor, Babajide Sanwo-Olu, has inaugurated a six-man Independent Panel to investigate all issues surrounding the Ikoyi building collapse and to forestall future occurrences.\nThe six-man panel is led by the former Lagos Commissioner for Physical planning and the President of Nigeria Institute of Town Planners (NITP), Toyin Ayinde.\nThe Inquiry team has 30 days to submit report."
  },
  {
    "headline": "IPOB denies calling for election boycott, closure of hotels in Anambra",
    "summarized_story": "The Indigenous people of Biafra IPOB has said it did not at any time issue any order or call for the boycott of Anambra election contrary to misconceptions in certain quarters noting that it has nothing to do with the election.\nIn a statement, IPOB’S Media and Publicity Secretary, Emma Powerful said nobody should link the group with the election.\nAccording to him, the priority of IPOB is to ensure the unconditional release of it’s Leader, Nnamdi Kanu who it alleged has been illegally detained by Nigeria Government.\nThe group maintained that if by November 4 those who abducted, renditioned and illegally detained their leader fail to release him unconditionally, it’s members shall embark on civil disobedience of one week sit-at-home beginning from November 5 to November 10"
  },
  {
    "headline": "Governor Bello presents N198bn as 2022 budget to Niger Assembly -",
    "summarized_story": "Niger state governor Abubakar Sani Bello has presented the 2022 budget estimate of 198 billion to the State house of assembly.\nThis is 44 billion naira higher than what was presented for the year 2021.\nGovernor Bello said the budget is themed Budget of Consolidated Development and will focus on ameliorating insecurity, completion of on going projects, prudent management of resources and diversification of IGR in the state.\nOut of the budget estimate, 124.8 billion was earmarked for capital expenditure representing 62.9% of the budget."
  },
  {
    "headline": "Sanwo Olu Says No Manifest to Account for Ikoyi Collapse – Trending With Ojy Okpe",
    "summarized_story": "26 year old Onyinye Enekwe a graduate of the Nnamdi Azikwe University, is another victim still buried under the rubble.\nHe and some of his colleagues were on duty when the building collapsed on Monday afternoon.\nLagos state Governor Babajide Sanwo Olu while visiting the Building site revealed that there is no manifest to ascertain the number of people that were at the site.\nAfrica’s dominant runway platform, the ARISE FASHION WEEK, will this year showcase at the DUBAI WORLD EXPO 2020 on December 3.\nThemed Made in Nigeria, Conquering the World, it will be held in collaboration with Nigeria’s Ministry of Industry, Trade and Investment."
  },
  {
    "headline": "Britain First Country to Approve Merck’s Covid-19 Antiviral Pill",
    "summarized_story": "Britain on Thursday became the first country in the world to approve a potentially game-changing COVID-19 antiviral pill jointly developed by U.S.-based Merck and Ridgeback Biotherapeutics, in a boost to the fight against the pandemic.\nThe green light is the first for an oral antiviral treatment for COVID-19 and comes ahead of potential U.S. regulatory clearance.\nPRESSURESThe speedy approval in Britain, which was also the first Western country to approve a COVID-19 vaccine, comes as it struggles to tame soaring infections.\nPfizer last month began a large study of its oral antiviral drug for the prevention of COVID-19 in people exposed to the coronavirus.\nAntibody cocktails like those from Regeneron and Eli Lilly have also been approved for non-hospitalised COVID-19 patients, but have to be given intravenously."
  },
  {
    "headline": "Nigerian Banks to Reject Old £20, £50 Notes From December 31",
    "summarized_story": "Nigerian banks have issued a notification that they would start rejecting old £20, £50 Notes after fixing December 31 as deadline for customers to deposit their notes.\nIn a directive statement issued by banks, customers have been warned that banks will no longer accept the old notes at the end of this year.\nThe old paper £20 (with features of Adam Smith), and the old paper £50 (with features of Mathew Boulton and Engineer James Watt) until the published withdrawal date of September 30, 2022, as announced by the Bank of England“The Bank of England has announced the withdrawal of paper 20 euros and 50 euros notes after September 30, 2022.\nA year’s notice has been provided to customers and the global banking community, Fidelity bank, disclosed in an email to customers on Wednesday.\n“Thus, we advise you to use or deposit your paper GBP notes into your Fidelity Bank domiciliary account by December 31, 2021, to avoid a loss in the value of your money.”Omotayo Araoye"
  },
  {
    "headline": "Shell Energy Nigeria Launches to Expand Natural Gas Sales",
    "summarized_story": "Shell, a global energy company, has announced a new business line in Nigeria to expand natural gas marketing and sales to meet the rapidly growing energy needs of wholesale customers and provide more and cleaner energy solutions in the country.\nThe new business will draw on the capabilities and experience of Shell Energy, a leading global provider of reliable, integrated and innovative energy solutions from a portfolio of natural gas, power and environmental products.\nBuilding on the success of Shell Nigeria Gas, Shell Energy Nigeria, aims to deliver competitive and reliable energy for power generation and industrial users and to develop gas distribution to serve people in new regions.\nShell Energy Nigeria’s gas solutions are designed to partner with other sources of energy – including renewables – to provide competitively priced and flexible energy, while helping the country to transition to a lower carbon energy system.\nCountry Chair of Shell companies in Nigeria, Osagie Okunbor, said, “Shell Energy Nigeria demonstrates our ongoing commitment to powering progress by providing more and cleaner energy solutions in the country."
  },
  {
    "headline": "Nigeria’s External Reserves Hit $41.83bn in October But Sustainability Concerns Remain",
    "summarized_story": "As of October 29, 2021, Nigeria’s external reserves have risen to $41.\nHe admitted that the surge in external reserves was due to the recent Eurobonds issuance the country made.\nMohamed Abu Basha, head of macroeconomy – EFG Hermes, had predicted that Nigeria’s foreign reserves would cross the USD40bn mark after reserves were boosted in August with the USD3.3bn SDR allocation, providing a significant liquidity lift to the country’s foreign reserve position.\nOil prices remain high, supported by tight supply even as demand has rebounded stronger than anticipated.\nAccording to OPEC data obtained from secondary sources, Nigeria’s oil output (excluding condensates) was up 12 percent m/m to about.45mbpd in September."
  }
]