[
  {
    "headline": "Pastors said I was possessed, collected lots of money from my parents –Activist living with schizophrenia",
    "summarized_story": "Explaining what schizophrenia is, Adegbaju said, “Schizophrenia is a chronic debilitating disorder that severely impairs day to day functioning of an individual.\nPastors said I was occultic, needed to pay to be deliveredBeing an only child, Onwuzuruike’s parents were agitated and desperate to find a solution to their child’s mental health problem.\nShe disclosed that her parents started seeking healing from religious places.\nAfter two months of religious misadventure, Onwuzuruike was finally diagnosed accurately with schizophrenia in one of the eight government neuropsychiatric hospitals in Nigeria.\nShe said, “I would say if you have a mental health struggle like this, don’t be scared of sharing it with people."
  },
  {
    "headline": "Pastors said I was possessed, collected lots of money from my parents –Activist living with schizophrenia",
    "summarized_story": "Explaining what schizophrenia is, Adegbaju said, “Schizophrenia is a chronic debilitating disorder that severely impairs day to day functioning of an individual.\nPastors said I was occultic, needed to pay to be deliveredBeing an only child, Onwuzuruike’s parents were agitated and desperate to find a solution to their child’s mental health problem.\nShe disclosed that her parents started seeking healing from religious places.\nAfter two months of religious misadventure, Onwuzuruike was finally diagnosed accurately with schizophrenia in one of the eight government neuropsychiatric hospitals in Nigeria.\nShe said, “I would say if you have a mental health struggle like this, don’t be scared of sharing it with people."
  },
  {
    "headline": "Late detection of endometriosis may reduce success of fertility treatment –Study",
    "summarized_story": "Angela OnwuzooA new Australian study has found that delayed and undiagnosed endometriosis may affect the success rate of fertility treatment among women trying to conceive.\nResearchers from the University of Queensland in the study found that women diagnosed with endometriosis late were four times more likely to do a lot of fertility treatment cycles, sometimes up to 36 cycles before success.\nAccording to the researchers in the study published in ScienceDaily, diagnosing endometriosis before starting fertility treatment has a lot of benefits.\n“In our national study of 1,322 women, 35 per cent of participants had endometriosis and one-third of those weren’t diagnosed until after they started their fertility treatment.\n“It is highly advantageous to diagnose endometriosis before starting fertility treatment and to adjust the treatment accordingly."
  },
  {
    "headline": "Late detection of endometriosis may reduce success of fertility treatment –Study",
    "summarized_story": "Angela OnwuzooA new Australian study has found that delayed and undiagnosed endometriosis may affect the success rate of fertility treatment among women trying to conceive.\nResearchers from the University of Queensland in the study found that women diagnosed with endometriosis late were four times more likely to do a lot of fertility treatment cycles, sometimes up to 36 cycles before success.\nAccording to the researchers in the study published in ScienceDaily, diagnosing endometriosis before starting fertility treatment has a lot of benefits.\n“In our national study of 1,322 women, 35 per cent of participants had endometriosis and one-third of those weren’t diagnosed until after they started their fertility treatment.\n“It is highly advantageous to diagnose endometriosis before starting fertility treatment and to adjust the treatment accordingly."
  },
  {
    "headline": "FG approves new maize variety, Tela Maize for cultivation in Nigeria",
    "summarized_story": "The Director-General, National Biosafety Management Agency, NBMA, Dr Rufus Ebegba, stated this while presenting the TELA Maize approval certificate to Executive Director, IAR, Prof. Ishiyaku Mohammed.\n“This permit authorises the permit holder and persons covered by the permit to commercialise the TELA Maize genetically modified for drought tolerance and insect resistance,” he said.\nThe University Don said, “It is really inspiring for IAR to secure NBMA approval for the commercial release of the drought-tolerant and insect-resistant Maize (TELA MAIZE).\nWith TELA Maize, farmers in Nigeria will have relief from frequent constant chemical sprays which affect their health.\nThe Project builds on gains from a decade of excellent breeding work to develop conventional climate-smart drought tolerant maize known as Drought TEGO varieties."
  },
  {
    "headline": "Electoral Act: Saraki Appeals to NASS Members on Direct Primaries",
    "summarized_story": "“Even if the big parties have the funds and facilities to organise direct primaries nationwide, how about the smaller parties?\nThe direct primaries option will also put pressure on the Independent National Electoral Commission (INEC) whose officials must monitor all the primaries.\n“The direct primaries provision may work for us in the future but not now that we are not prepared for it as the primaries may hold next June.\nThe time for adequate and necessary preparations towards direct primaries is even not there.\n“From my experience, this issue of direct primaries was raised in the Eighth National Assembly when we passed the Electoral Act (amendment) Bill."
  },
  {
    "headline": "In conversations with Tobi Adegboyega, Obi Cubana urges youths not to give up",
    "summarized_story": "Anambra born businessman and Chairman, Cubana group, Obinna Iyiegbu are popularly known as Obi Cubana have urged Nigerian youths not to give up saying the government should not also be held completely liable for what is going on in the country.\nHe noted that choosing to be positive about life is the best way to grow and be their best version.\nThe philanthropist and entertainer said this while giving his Independence Day message when quizzed by a Pastor at SPAC Nation, Tobi Adegboyega, during his visit to the clergyman in London.\nAccording to Obi Cubana, “there is hope, things will not be like this forever, and then we also will not hold the government 100 per cent accountable for what is going on.\nWe rule in every aspect of these, so there is hope.”Speaking on the success of the Cubana brand, he noted that from inception, their belief has been hinged on integrity, hard work and focus."
  },
  {
    "headline": "APGA, APC Merger best strategy to win Anambra guber election- Chieftain",
    "summarized_story": "Mr Osita Okechukwu, a chieftain of All Progressives Congress (APC) has once again reminded the leadership of All Progressives Grand Alliance (APGA) of the imperatives of striking a merger with APC, in the Zikist Model strategy, to win the Nov. 6, governorship poll.\nREAD ALSO:Obiano seeks NCAA approval to open Anambra Airport“It is for this reason that I wish to appeal once more to APGA leaders to explore a Zikist Model merger with APC for a guaranteed seamless victory in the Nov. 6 polls.\n” In saying this, I know for sure that APC can win without APGA, but would enjoy seamless victory with a Zikist Model merger,” he stated.\n“So, as I said two months ago, the suggestion flows from the prism of pragmatic Zikist political model, which joins us with APGA.\nAnybody who watched Obiano in the State House, Aso Rock, closely will notice palpable panic."
  },
  {
    "headline": "Obiano seeks NCAA approval to open Anambra Airport",
    "summarized_story": "Governor Willie Obiano of Anambra says he is seeking approval of the Nigeria Civil Aviation Authority (NCAA) to open the state’s cargo and passengers Airport for operations on Oct. 21.\nObiano disclosed this at a news conference after a tour of the airport and the International Conference Centre in Umueri and Awka respectively on Sunday.\nHe said that the airport was completed in 15 months and that if the regulating authority approved the request, the project would be inaugurated on Oct. 21.\nThe governor said that the airport had the longest runway in Africa, with the best fire fighting equipment and tallest control tower in Nigeria.\nHe said that the projects would put Anambra on the pedestal of economic prosperity."
  },
  {
    "headline": "Your fighter jets will be used to collapse Nigeria – Mbaka warns Buhari",
    "summarized_story": "Ejike Mbaka, has warned President Muhammadu Buhari that the fighter jets he is purchasing will be used to destroy the country.\nThe cleric stated this during a sermon at his church on Sunday.\nAccording to Mbaka, Buhari should rather focus on building more industries“The jets you are buying are going to be used to collapse Nigeria.\n“Please, the first person to meet President Buhari after this message, should tell him that all these jets he is buying will be used to destroy Nigeria.\n“God told me to tell him that,” he said."
  },
  {
    "headline": "Agitations: Nigeria will succeed, anything else senseless – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo says anything that is not towards the advancement of Nigeria’s unity is senseless.\nThe VP spoke at a session with Nigerian High Commission officials in London at the Abuja House, the High Commissioner’s residence.\nThis is the Nigeria that will succeed, anything else doesn’t make sense”, he said.\nHe noted that anybody who critically looks at how Nigeria operates will recognize the people are better off in the current system.\n“How does a country with all the potentials and everything that we have, think that the best way is to break up?”, Osinbajo quipped."
  },
  {
    "headline": "How Nigeria can overcome its present challenges – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said that the only way Nigeria can overcome its present challenges is when Nigerians unite as one people.\nI think we are in the best possible position to solve these problems,” Osinbajo added.\nIn addition, the Vice President spoke about the popularity and credibility of President Muhammadu Buhari, identifying it as a crucial factor in galvanizing the entire system in resolving the challenges.\nOsinbajo said: “the President is possibly the most popular Nigerian politician that we have ever had in generations.\n“We need that level of credibility to be able to solve problems in our country."
  },
  {
    "headline": "Yahaya Bello mourns Jukun’s paramount ruler, Shekarau Angyu, Kuvyo II",
    "summarized_story": "Kogi State Governor, Yahaya Bello has mourned the demise of the paramount ruler of the Jukun race and Chairman, Taraba State Council of Traditional Rulers, His Majesty, Dr. Shekarau Angyu, Kuvyo II (CON), who passed away on Sunday at the age of 84.\nThe governor’s message was conveyed in a press statement signed on Sunday by his Chief Press Secretary, Muhammed Onogwu, where he described the death of the late king as a loss to the nation.\nThe Governor similarly extended his condolences to the family of the late royal father noting that he lived a fulfilled life serving his people in the long years of his reign on the throne.\nWhile he prayed for God to grant the deceased eternal repose, he prayed also for God to grant the bereaved the fortitude to bear the loss.\nHis death was announced on Sunday in a press statement signed by the SA Media to Aku-Uka, Jolly Agbu Massa-IBB, where he noted that final traditional rites would be announced in due course."
  },
  {
    "headline": "Buni mourns ex-House of Reps member, Zanna Laisu",
    "summarized_story": "Yobe State Governor, Mai Mala Buni, has expressed sadness at the death of a former member of the House of Representatives, Alhaji Zanna Laisu, who died on Sunday 10th October 2021.\nGov Buni, in a statement via his spokesman, Mamman Mohammed, said: “It is with total submission to the will of Allah (SWT) that we receive the sad news of the death of Alhaji Zanna Laisu, a grassroots politician who spent most of his life serving his people”.\nBuni prayed to Allah to forgive his shortcomings and grant him aljannatu firdaus.\n“May Allah admit late Zanna Laisu in Aljannatur Firdausi and grant his family, relations, and associates the fortitude to bear the irreparable loss”, Gov.\nat the House of Representatives."
  },
  {
    "headline": "2022 Budget: FG sets aside N327bn to pay MDAs electricity bills",
    "summarized_story": "From Isaac Anumihe, AbujaFederal Government has set aside a total of N327 billion in the 2022 Budget to offset the electricity tariff shortfall incurred by the Ministries Departments and Agencies (MDAs) who are not paying electricity bills.\nWhile N27 billion goes to the MDAs, N300 billion would be used to settle other tariff indebtedness which the distribution companies (DisCos) incurred because of their inefficiency.\nWe provided another N27 billion for the MDAs electricity use.\nHowever, going forward, the government has put a mechanism in place to make it difficult for MDAs to incur electricity bills and not pay for it.\nSo, instead of us receiving from the DisCos from this budget, there is a provision in this budget to pay money to the DisCos."
  },
  {
    "headline": "Presidency to spend N2.5bn on sewage, internet, salary, others in 2022",
    "summarized_story": "From Uche Usim, AbujaPresident Muhammadu Buhari has proposed to spend N2,490,658,599 on state house clinic, salary, sewage, electricity charges and internet access in 2022.\nA breakdown of the aforementioned budget shows that the chunk of it, N1,346,707,871 goes to salary payment.\nState house clinic is expected to gulp N687,425,876, while N35,418,735 is for sewage charges.\nN354,000,000 will be spent on electricity charges and N67,106,117 on internet access.\n“The 2022 budget is also the first in our history, where MDAs were clearly advised on gender responsive budgeting."
  },
  {
    "headline": "Anti-Open grazing law: Herders defiant, dare Southern govs",
    "summarized_story": "With the exception of just a few, several Southern states have enacted laws against open grazing.\nDespite the existence of the 2018 law, herders have continued to clash with farmers in some parts of the state.\nOSUNHerdsmen in Osun State are not fully obeying the anti-open grazing law signed by Governor Adegboyega Oyetola, Sunday Sun has gathered.\n“We don’t have any problem in Osun with or without anti-open grazing law.\nWilliam Jonah Eteng, had disclosed that the state was one of the earliest to pass law against open grazing."
  },
  {
    "headline": "Tension, fear as killers spread blood in Southeast",
    "summarized_story": "There have been killings in Onicha Igboeze in the last three months by gunmen and security agents.\nHowever, police in the state accused the pro-Biafra group, IPOB, of masterminding the killing while enforcing its sit-at-home order in the area.\nThe family source who pleaded anonymity said: “That day at about 6:00a.m our brother was attacked and killed alongside seven other persons.\nAs gunmen continue to spread sorrow in the Southeast, the people of the region are living in fear and uncertainty.\nOn the same day, three naval personnel on duty at Awkuzu, Oyi LGA were attacked and killed."
  },
  {
    "headline": "My experience dating a Casanova –Chinenye Nweke (Supernova), musician – The Sun Nigeria",
    "summarized_story": "By Rita OkoyeWell-endowed songstress, Chinenye Joy Nweke a.k.a Supernova, doesn’t mince words.\nMy name is Chinenye Joy Nweke popularly known as Supernova.\nWhich audience does your music look to capture?\nI have the passion for music; I’m also here for the money because I love money as an Igbo girl.\nBut I’m grateful for the crew I’m working with."
  },
  {
    "headline": "PDP Chair: Northern Caucus Considers Consensus as Mark, Lamido Shoot Ahead",
    "summarized_story": "The Governor Ifeanyi Ugwuanyi-led zoning committee of the PDP had zoned the positions of the National Chairman; Deputy National Chairman (North); Deputy National Secretary; Deputy Publicity Secretary; Deputy Financial Secretary; National Organising and Mobilisation Secretary; National Legal Adviser; Youth Leader; Treasurer; and Deputy Auditor to the North.\nFollowing the disagreement over the selection of the national chairman by the northern leaders, the Northern PDP caucus had on Thursday night set up a 20-man search and screening committee.\nWhile the South-west will get the National Secretary and National Women Leader, the South-east will produce the National Publicity Secretary, National Financial Secretary, and Deputy National Secretary.\nAccording to the zoning arrangement, the Deputy National Chairman and National Auditor will emerge from the South-south.\nAlso, a former National Secretary of the PDP and former Governor of Osun State, Prince Olagunsoye Oyinlola may return as the national secretary."
  },
  {
    "headline": "Again, Buhari Vows to Eliminate Insurgents, Bandits, Kidnappers",
    "summarized_story": "These assets will be deployed to accelerate the fight against insecurity in all parts of the country,” he explained.\nPresident Buhari noted that security had assumed priority in governance and public policy in the international scheme of affairs.\n“It is therefore not surprising that the Academy has earned a reputation as an outstanding military Academy in Africa.\nThe Theatre Commander of Operation Hadin Kai, therefore, urged officers and soldiers to discharge their duties diligently without fear, favour, or affection.\nDiscipline Bedrock of Nigerian Army, Says COASMeanwhile, the COAS, Yahaya, has said that discipline remained the bedrock of the Nigerian Army in the discharge of its constitutional roles."
  },
  {
    "headline": "Osinbajo: Defunding Gas Projects Unhelpful to Developing Countries",
    "summarized_story": "Osinbajo spoke on defunding of gas projects in his presentations at the High-Level UN events on the Energy Transition plan in Africa with a special focus on Nigeria ahead of the UN Climate Change Conference (COP26) summit in London.\nAt the meeting, Osinbajo warned that the moves to defund gas projects would not help the whole enterprise, which required gas, especially on putting it on the grid.\nHe opined that the ultimate goal of the global energy transition should be to achieve reliable net-zero-energy systems to power prosperous, inclusive economies.\nHis words: “Limiting the development of gas projects poses dire challenges for African nations, while making an insignificant dent in global emissions.\nThe vice president also had an interaction with the academic community at Imperial College followed by meetings of the Global Energy Alliance and presentations on Nigeria Energy Transition Plan and Nigeria’s Integrated Energy Plan."
  },
  {
    "headline": "Nigeria Withholds Assent as 136 Countries Ratify 15% Corporate Tax",
    "summarized_story": "Gboyega AkinsanmiAt least 136 members of the Organisation for Economic Cooperation and Development (OECD) and G-20 Nations at the weekend agreed to a 15 per cent corporate tax rate effective from 2023, though Nigeria withheld its assent.\nAs shown on the website of OECD, BEPS refers to tax planning strategies used by multinational enterprises that exploit gaps and mismatches in tax rules to avoid paying tax.\nWith a huge loss in revenue, 136 countries and jurisdictions are collaborating on the implementation of 15 measures to tackle tax avoidance, improve the coherence of international tax rules and ensure a more transparent tax environment.\nThe new minimum tax rate will apply to companies with revenue above €750 million and is estimated to generate around $150 billion in additional global tax revenues annually.\n“Further benefits will also arise from the stabilisation of the international tax system and the increased tax certainty for taxpayers and tax administrations,” the signatories said."
  },
  {
    "headline": "Okowa, Uzodimma, Kalu Congratulate Isiguzo on Re-election as NUJ President",
    "summarized_story": "Omo-Julius Onabu in AsabaDelta State Governor, Dr. Ifeanyi Okowa, his Imo State counterpart and Senator Hope Uzodimma and Chief Whip of the Senate, Senator Orji Uzor Kalu, have congratulated Mr. Chris Isiguzo on his re-election as the President of Nigeria Union of Journalists (NUJ).\nIn a statement by his Chief Press Secretary, Mr Olisa Ifeajika, in Asaba, Okowa lauded the union’s delegates for re-electing Isiguzo for a second term.\nHe remarked that Isiguzo, who was first elected president of the union in 2018 at Abeokuta, had not only stabilised the NUJ, but had also brought a lot of candour to NUJ leadership.\nAlso, Kalu in a statement in Abuja, congratulated Isiguzo, praising members of NUJ for ensuring successful conference.\nHe expressed optimism in the capacity of the re-elected President to continue to steer the affairs of the media body in the right direction."
  },
  {
    "headline": "2022 Budget: Loan-Borrowing Buhari Presidency To Spend N13billion On Presidential Jets, N2.3billion On Foreign, Local Trips",
    "summarized_story": "President Muhammadu Buhari will spend a total of N2,309,066,788 on foreign and local trips in 2022.\nThe figure is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe President is also expected to spend a total of N12.5 billion on the Presidential Air Fleet in 2022.\nAbout N1.6 billion is provided for the purchase of vehicles and spares.\nAbout N180,089,000 is provided for purchase of tyres for bulletproof vehicles, plain cars, CCU vehicles, platform trucks, jeeps, ambulances and other utility and operational vehicles."
  },
  {
    "headline": "2022 Budget: Loan-Borrowing Buhari Presidency To Spend N13billion On Presidential Jets, N2.3billion On Foreign, Local Trips",
    "summarized_story": "President Muhammadu Buhari will spend a total of N2,309,066,788 on foreign and local trips in 2022.\nThe figure is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe President is also expected to spend a total of N12.5 billion on the Presidential Air Fleet in 2022.\nAbout N1.6 billion is provided for the purchase of vehicles and spares.\nAbout N180,089,000 is provided for purchase of tyres for bulletproof vehicles, plain cars, CCU vehicles, platform trucks, jeeps, ambulances and other utility and operational vehicles."
  },
  {
    "headline": "How Buhari's Attorney General, Malami Conspired With Adoke Against Nigeria’s Interest In Over $1billion Malabu Oil Scam",
    "summarized_story": "Fresh moves by Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) to thwart the prosecution of suspects in the Malabu oil scam, including one of his predecessors, Mohammed Adoke have been uncovered.\nThe Malabu oil scandal involved the transfer of over $1 billion by Shell and ENI through the Nigerian government to accounts controlled by a former Nigerian Petroleum Minister, Dan Etete.\nOther defendants include Abubakar, Rasky Gbinigie, and four companies- Malabu Oil and Gas Limited, Nigeria Agip Exploration Limited, Shell Nigeria Ultra Deep Limited, and Shell Nigeria Exploration Production Company Limited.\nMost Nigerians don’t know there is a conspiracy that was arched in the Maitama private office of Malami between Malami, Turaki, and Adoke.\nThe Italian court which indicted Adoke of receiving bribes in the deal must also be monitoring developments,” the source said."
  },
  {
    "headline": "How Buhari's Attorney General, Malami Conspired With Adoke Against Nigeria’s Interest In Over $1billion Malabu Oil Scam",
    "summarized_story": "Fresh moves by Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) to thwart the prosecution of suspects in the Malabu oil scam, including one of his predecessors, Mohammed Adoke have been uncovered.\nThe Malabu oil scandal involved the transfer of over $1 billion by Shell and ENI through the Nigerian government to accounts controlled by a former Nigerian Petroleum Minister, Dan Etete.\nOther defendants include Abubakar, Rasky Gbinigie, and four companies- Malabu Oil and Gas Limited, Nigeria Agip Exploration Limited, Shell Nigeria Ultra Deep Limited, and Shell Nigeria Exploration Production Company Limited.\nMost Nigerians don’t know there is a conspiracy that was arched in the Maitama private office of Malami between Malami, Turaki, and Adoke.\nThe Italian court which indicted Adoke of receiving bribes in the deal must also be monitoring developments,” the source said."
  },
  {
    "headline": "How Buhari's Attorney General, Malami Conspired With Adoke Against Nigeria’s Interest In Over $1billion Malabu Oil Scam",
    "summarized_story": "Fresh moves by Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) to thwart the prosecution of suspects in the Malabu oil scam, including one of his predecessors, Mohammed Adoke have been uncovered.\nThe Malabu oil scandal involved the transfer of over $1 billion by Shell and ENI through the Nigerian government to accounts controlled by a former Nigerian Petroleum Minister, Dan Etete.\nOther defendants include Abubakar, Rasky Gbinigie, and four companies- Malabu Oil and Gas Limited, Nigeria Agip Exploration Limited, Shell Nigeria Ultra Deep Limited, and Shell Nigeria Exploration Production Company Limited.\nMost Nigerians don’t know there is a conspiracy that was arched in the Maitama private office of Malami between Malami, Turaki, and Adoke.\nThe Italian court which indicted Adoke of receiving bribes in the deal must also be monitoring developments,” the source said."
  },
  {
    "headline": "Bakare wants 1999 constitution 'discarded', says 'it's glorified death certificate'",
    "summarized_story": "Tunde Bakare, serving overseer of the Citadel Global Community Church, says the 1999 constitution is a “glorified death certificate”.\nAdvertisementThe national assembly is currently in the process of amending the 1999 constitution and has concluded zonal public hearings on it.\nSpeaking at the church service on Sunday, Bakare said the constitution should be replaced if the country wants to achieve greatness.\n“I am persuaded, as are many fellow compatriots within and outside the shores of Nigeria, that the 1999 constitution, whether as amended or to be further amended by the national assembly, is nothing more than a glorified death certificate,” he said.\nTear down this inhibiting concoction of a constitution; tear it down so that we can build a truly great nation."
  },
  {
    "headline": "Bakare wants 1999 constitution 'discarded', says 'it's glorified death certificate'",
    "summarized_story": "Tunde Bakare, serving overseer of the Citadel Global Community Church, says the 1999 constitution is a “glorified death certificate”.\nAdvertisementThe national assembly is currently in the process of amending the 1999 constitution and has concluded zonal public hearings on it.\nSpeaking at the church service on Sunday, Bakare said the constitution should be replaced if the country wants to achieve greatness.\n“I am persuaded, as are many fellow compatriots within and outside the shores of Nigeria, that the 1999 constitution, whether as amended or to be further amended by the national assembly, is nothing more than a glorified death certificate,” he said.\nTear down this inhibiting concoction of a constitution; tear it down so that we can build a truly great nation."
  },
  {
    "headline": "Ribadu: Social media contributing to ethnic, religious divisions -- FG should take action",
    "summarized_story": "Nuhu Ribadu, pioneer chairman of the Economic and Financial Crimes Commission (EFCC), says social media is “partly responsible” for the country’s problems.\nAdvertisementAccording to NAN, Ribadu spoke on Sunday, while reacting to social media reports that he accused government officials of sponsoring banditry in the country.\nSpeaking at a media briefing in Abuja, the former EFCC chairman said social media promotes fake news, which creates religious and ethnic divisions in the country.\nAs private citizens, we have limited capacity to take action; government has to.”Ribadu also said social media companies must intensify the fight against fake news.\n“I am a victim, and I don’t know why people are doing it."
  },
  {
    "headline": "Ribadu: Social media contributing to ethnic, religious divisions -- FG should take action",
    "summarized_story": "Nuhu Ribadu, pioneer chairman of the Economic and Financial Crimes Commission (EFCC), says social media is “partly responsible” for the country’s problems.\nAdvertisementAccording to NAN, Ribadu spoke on Sunday, while reacting to social media reports that he accused government officials of sponsoring banditry in the country.\nSpeaking at a media briefing in Abuja, the former EFCC chairman said social media promotes fake news, which creates religious and ethnic divisions in the country.\nAs private citizens, we have limited capacity to take action; government has to.”Ribadu also said social media companies must intensify the fight against fake news.\n“I am a victim, and I don’t know why people are doing it."
  },
  {
    "headline": "Osinbajo: No region better off on its own -- we're strong as one nation",
    "summarized_story": "Vice-President Yemi Osinbajo says Nigeria is better off as one nation, as regions in the country won’t be in positions of advantage if they decide to stand on their own.\nOsinbajo, who said Nigeria has better chances in the international community as one nation, expressed optimism that the challenges affecting the country can be overcome.\nAdvertisement“Yorubas are not better off on their own; Igbos are not better off on their own; the North is not better off on its own.\nWe are better off as one nation; that is why we are strong and that is why we can face the world.\n“We need that level of credibility to be able to solve problems in our country."
  },
  {
    "headline": "Aggregators are enabling independent voices in Kenya’s controlled news circuit",
    "summarized_story": "Data-driven digital media is taking the place of print in Kenya.\nEmerging to take the place of rifling through the morning newspaper are scrollable, swipeable news aggregators that have the potential to change Kenya’s media landscape.\nThe Standard Group comes in second, with three spin-offs: The Standard, The Standard on Saturday, and The Standard on Sunday.\nMuch like other aggregators, like Google News and Flipboard, Opera News’ AI crawls the internet for content.\nAs Kenya’s 2022 elections draw near, content moderation will become harder than ever and the nation’s news aggregators will have to rise to the challenge."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "Google launches $50m equity-based investment fund for African startups",
    "summarized_story": "At the first-ever Google for Africa event, held virtually on Wednesday, Google announced the launch of a 50 million-dollar Africa Investment Fund, through which it plans to invest in African startups.\nSelected companies will be provided with access to Google’s employees, network and technologies, to help them build products.\nTargeted at early- to growth-stage startups, the new investment fund is equity-based, marking a significant shift in Google’s approach to investing in African startups.\nMeanwhile, the Google Black Founders Fund will invest in black-led startups in Africa by providing cash awards and hands-on support.\nGet the best African tech newsletters in your inbox“In the last year, we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Sub-Saharan Africa, said in an official statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "Nabsolute’s SpinHeard for artists, Uber’s latest expansion, and Klasha’s $2.4m seed",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Nabsolute’s SpinHeardUber’s expansionKlasha’s $2.4m seedNabsolute’s SpinHeard aims to help independent artistsVictor Okpala, Founder of Nabsolute.\nAdvertisementThis is what Nabsolute Media, a media communications and marketing agency based in Nigeria, is looking to do for independent artists with its recently launched platform, SpinHeard.\nUS-based technology company, Uber, known primarily for its ride-hailing service, has announced an expansion into Ibadan and Port Harcourt.\nKlasha’s $2.4m seed round will be used to bolster cross-border payments infrastructureJessica Anuna, Klasha’s FounderFirst, the news: Klasha, a US-based, Africa-focused cross-border payments startup, has announced raising $2.4m in seed investment.\nNotable eCommerce platforms like WooCommerce and OpenCart have integrated Klasha’s plugins, with the startup also having an official partnership with BigCommerce."
  },
  {
    "headline": "Nabsolute wants to give independent artistes affordable exposure with SpinHeard",
    "summarized_story": "Advertisement“And that is a fee that a lot of independent artistes cannot afford,” Okpala explains, “This group makes up a large percentage of the industry.\nAccording to Okpala, SpinHeard comes with incentives for these curators, especially to simplify their jobs.\nFor starters, SpinHeard will help independent artistes upload their content to the popular video-sharing app, Triller and get promoted for free, of course, after content vetting.\nThis would expose these independent artistes to the perks the company already offers clients it runs comms for — in terms of push notifications, banner support, and other home page features.\nDespite the success recorded with Nabsolute, Okpala doesn’t expect SpinHeard to be a walk in the park."
  },
  {
    "headline": "eNaira dilemma: speed or transparency, Google’s $1b investment and Chari’s $5m seed raise",
    "summarized_story": "But, here’s the thing, a private blockchain means there’s no room for transparency.\nWhat would a private blockchain entail for the eNaira?\nClick here: eNaira: How much control does a private blockchain give the CBN?\nGoogle plans to launch the Africa Investment Fund to invest $50 million in African startups.\nOur Senior Reporter, Emmanuel Paul, gives a detailed analysis on the subsea Internet cable here: With its massive subsea Internet cable, Google says it’s playing the long game in AfricaChari closes $5m seedChari Co-Founder."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "Currency MarketFor most of the trading session last week the Naira depreciated at the I & E FX window, which continued at the end of the week.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N415/$1 threshold in the NAFEX window.\nFGN bond and Eurobond MarketThe FGN bond market started the previous week on a bullish note, however, the bullish sentiment was not sustained throughout the week.\nThe overall average benchmark yields closed at 8.13% at the close of trading at the end of the week.\nSectoral performance across sectors tracked was positive last week as the NGX Banking was the highest gainer for the previous week with +4.53%."
  },
  {
    "headline": "2023: How PDP chairmanship zoning to North fires up presidency zoning discourse",
    "summarized_story": "“There is no such thing as a President from Southern Nigeria or a President from Northern Nigeria.\nThere is only one fact, a president from Nigeria, for Nigeria and by Nigerians,” he said.\nIn this way, the North will still remain the determinant of who succeeds President Buhari in 2023.\nThe decision of the PDP to zone the national chairmanship position to the North zone has continued to generate debate in the polity in the last few days.\nBut the way I am seeing it, the PDP may not zone the presidency to the South East in 2023,” Okorie had said."
  },
  {
    "headline": "Desperate moment in South East",
    "summarized_story": "He said: “Let us say that what is going on in the South East is something that we cannot just comprehend properly.\nIPOB set up the ESN to check the activities of herdsmen in the South East and it was also hijacked.\n“What is good for other states, is good for the South East, it doesn’t matter whom God enthrones.\nLet the South East be properly integrated into the affairs of this nation.\nKunle Okunade, political analyst, said that the South East could be responding to the marginalisation in the current administration of Muhammadu Buhari."
  },
  {
    "headline": "Obaseki felicitates with Lady Eghobamien at 80 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has joined family members and well-wishers to celebrate Lady Amenaghawon Eghobamien, on her 80th birthday.\nSpeaking at an event held in Benin City to celebrate Lady Eghobamien’s 80th birthday, Obaseki said, “We are here to celebrate mama as she is a branch of the Ogbeide-Oyo family.\nHer late husband, Alfred Eghobamien was a special uncle and we all know the contributions he made for the development of the society and also to our government.\n“We are privileged to celebrate mama at 80 as a family.\nWe pray she continues to be with us for many more years to come in good health,” he added."
  },
  {
    "headline": "Edo Innovates gets Board of Directors, with Asemota as chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has inaugurated a Board of Directors for Edo Innovates, to drive the next phase of development of the state’s innovation hub to launch and support careers in technology and innovation in the state.\nThe board is chaired by the Founder and Chief Executive Officer (CEO) of Swifta Systems and Services, Mr. Victor Asemota, with Hub Manager of Edo Innovates, Mr. Asemota Izoduwa Precious as Secretary.\nAccording to the governor, “Edo Innovates is an initiative of the Edo State Government with an objective to leverage skills development and investment promotion in tech for job creation.\nHe noted that the key purpose of the Edo Innovates Board of Directors is to serve as the overarching layer in the governance structure of Edo Innovates, providing strategic policy guidance, strengthening the governance structure to re-assure existing and new stakeholders and support the government’s objectives of a thriving hub.\nFor example, online work and micro-work are global work opportunities that could be made available to the youth of Edo State,” Obaseki noted."
  },
  {
    "headline": "Obaseki approves 2021 promotions for Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has approved 2021 promotions for workers in the state’s civil and public service.\nThe approval was disclosed in a letter dated September 28, 2021 and signed by the Functioning Permanent Secretary, Directorate of Establishment, Training and Manpower Services, Mrs. F.A.O Edwards on behalf of the Edo State Head of Service, Anthony Okungbowa Esq.\nShe explained that the approval is in line with the government’s commitment to the welfare of the workers in order to improve efficiency, productivity and optimal service delivery.\nThe letter with Reference Number TM.701/VOL.11/101, directed all Ministries and Extra-Ministerial Departments “to forward the list of all eligible officers on grade level 07 to 16 who are due to be promoted in the year 2021 to the Office of the Head of Service for necessary action.”The government also directed that “the Name, Rank, Grade Level, Date of Birth, Date of Confirmation, Date of Present Appointment and Retirement of the Officers should be forwarded to the Office of the Head of Service.”The circular, which is directed to be treated as extremely urgent, was sent to the Office of the Secretary to the State Government, Head of Service, All Honourable Commissioners, Permanent Secretaries, and All Heads of Extra Ministerial Departments.\n“All Accounting Officers are to with immediate effect ensure strict compliance with this directive,” the letter read."
  },
  {
    "headline": "UNIJOS, National Film Institute and War of Regularisation – Nigerian Observer",
    "summarized_story": "I got an SMS from a number saying I had been admitted to study Film at the National Film Institute, Jos.\nOn the surface, it’s because I’m yet to have my original JAMB admission letter, but, deep down, there’s more to this than meets the eye.\nI got admission to study film at the National Film Institute, Jos in 2015.\nFrom November 2nd, 2020 up till now, I still haven’t received my original JAMB admission letter.\nBut what is the struggle for printing admission letter really all about?"
  },
  {
    "headline": "Ribadu blames most of country’s challenges on fake news, social media",
    "summarized_story": "Nuhu Ribadu, a former chairman of the Economic and Financial Crimes Commits (EFCC), has blamed most of the country’s challenges on fake news peddled by social media.\nHe, therefore, called on owners of social media to do something to protect innocent people from suffering unjustly because of lies told against them on their platforms.\nHe added that a combination of government, established media outfits and social media companies could do something to address the situation.\nhad great regards for the print media and established television stations which he noted had refused to be part of peddling fake news like most social media.\nAccording to him, social media is doing a lot of damage to the people and nation."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Bakare launches N4N Movement, says there’ll be change of govt in 2023",
    "summarized_story": "..says 1999 constitution glorified death certificatePastor Tunde Bakare, the Overseer of the Citadel Global Community Church, has announced the inauguration of Nigeria for Nigerians (N4N) Movement.\nHe said that the N4N Movement was inaugurated because “it is time for Nigerians to take back their nation;” adding, “There will be a change of government in 2023.”In March 2018, Bakare had also announced his plan to form a political movement to champion the restructuring of Nigeria.\nWe have only three points on our agenda — restructuring, restructuring and restructuring.\n“Therefore, our Distinct Nationhood Agenda, DNA, is simple, it is RUN — Restructuring For United Nigeria – this is what I’m set to advance.\n“I’m running and leading a movement called the New Nigeria Progressives Movement."
  },
  {
    "headline": "12.5kg cooking gas could increase to N10, 000 by December – Marketers",
    "summarized_story": "Marketers of Liquefied Petroleum Gas, otherwise known as cooking gas, have warned that the 12.5kg of cooking gas, which currently sells for about N8, 000 might increase to N10, 000 before December if the current crisis in the sector is not addressed.\nEssien noted that the Federal Government needed to review the recently introduced import charges and Value Added Tax or else, the price of cooking gas may as well get to N10, 000 for a 12.5kg cylinder.\n“Today (Saturday), the price has risen to N7, 500 and N8, 000.\nThe skyrocketing price of gas is our fear and what we are trying to avoid.\nEarly in the year a 20-metric ton of gas was selling for below N5m but today, the same tonnage sells for N10.2m."
  },
  {
    "headline": "2023: APC recognizes group pushing for Osinbajo presidency",
    "summarized_story": "Nigeria’s ruling party, the All Progressive Congress (APC), has officially recognized the Progressive Consolidation Group (PCG), a pressure group mobilising support for the presidential ambition of Vice President Yemi Osinbajo.\nThe group in a statement on Sunday in Abuja, said it recently received a “Letter of Recognition as Support Group” from the national APC.\nBala Gide, leader of the Progressive Civil Society Group (PCSG), one of the sub-groups spawned by the PCG, said the approval justifies the optimism towards the realisation of an Osinbajo presidency in 2023.\nThe group said an Osinbajo presidency meant that “Committed party members and other patriotic citizens would remain even more assured under an offshoot of the Buhari/Osinbajo Presidency headed by Prof. Osinbajo.”The PCG said its objective was “towards building a more formidable APC and a better Nigeria where the ideals espoused by both President Buhari and Prof. Osinbajo can be wholly sustained."
  },
  {
    "headline": "Again, Buhari Proposes N5.23bn To Renovate Aso Rock Villa",
    "summarized_story": "In the 2021 proposal, N4,854,381,299 was set aside for annual routine maintenance of mechanical/electrical installations in the Villa, Daily Trust reported.\nAccording to the estimate, the ongoing phased replacement of vehicles and spares will cost N1.6bn compared to the N436m set aside for a similar purpose in the 2021 proposal.\nLast year, N116,194,297 was set aside for a similar purpose.\nStaff salaries will gulp N898.1m while N40.1m will be spent on local and international travels by officials of the ministry.\nThe federal government also set aside N1.6bn to refund Bayelsa and Kebbi governments for the construction of airports at their respective states."
  },
  {
    "headline": "We Are Not Pampering Bandits – FG",
    "summarized_story": "Minister of information and culture, Alhaji Lai Mohammed, has declared that the allegation of the federal government pampering bandits and being hard on secessionists such as the proscribed Indigenous People of Biafra (IPOB) has no basis.\nThe truth of the matter is that the federal government does not make a distinction between terrorists and bandits.\nAs far as the federal government is concerned, they are all criminals and they are treated the same way,” he said.\nThe distance from Maiduguri to Bama is about 78 kilometres, but no single vehicle is on the way.\nAnd when we went in 2015, you couldn’t travel more than a few kilometres outside Maiduguri metropolis,” he said."
  },
  {
    "headline": "We Are Not Pampering Bandits – FG",
    "summarized_story": "Minister of information and culture, Alhaji Lai Mohammed, has declared that the allegation of the federal government pampering bandits and being hard on secessionists such as the proscribed Indigenous People of Biafra (IPOB) has no basis.\nThe truth of the matter is that the federal government does not make a distinction between terrorists and bandits.\nAs far as the federal government is concerned, they are all criminals and they are treated the same way,” he said.\nThe distance from Maiduguri to Bama is about 78 kilometres, but no single vehicle is on the way.\nAnd when we went in 2015, you couldn’t travel more than a few kilometres outside Maiduguri metropolis,” he said."
  },
  {
    "headline": "Gov Ishaku Mourns As Aku Uka Of Wukari Dies At 84",
    "summarized_story": "Governor Darius Ishaku of Taraba State has expressed shock over the demise of the paramount ruler of the Jukun people, the Aku Uka of Wukari, Dr. Shekarau Angyu Masa Ibi, who until his death was the chairman of Taraba State Council of Chiefs.\nShekarau Angyu, who died at the age of 84 years, successfully ruled as the Aku Uka for 45 years before his death on Sunday.\nMeanwhile, Governor Ishaku has expressed shock and sadness on the passing of the revered traditional ruler.\nIshaku described the late Aku Uka as a foremost traditional ruler whose reign of 45 years brought peace, unity and prosperity to Wukari, Taraba State and the entire ancient Kwararafa Kingdom.\nHe described the reign of the late Aku Uka as a period of self discovery by the Jukun people, of their strategic place in history and role in the promotion of modern civilisation in Nigeria and beyond."
  },
  {
    "headline": "Gov Ishaku Mourns As Aku Uka Of Wukari Dies At 84",
    "summarized_story": "Governor Darius Ishaku of Taraba State has expressed shock over the demise of the paramount ruler of the Jukun people, the Aku Uka of Wukari, Dr. Shekarau Angyu Masa Ibi, who until his death was the chairman of Taraba State Council of Chiefs.\nShekarau Angyu, who died at the age of 84 years, successfully ruled as the Aku Uka for 45 years before his death on Sunday.\nMeanwhile, Governor Ishaku has expressed shock and sadness on the passing of the revered traditional ruler.\nIshaku described the late Aku Uka as a foremost traditional ruler whose reign of 45 years brought peace, unity and prosperity to Wukari, Taraba State and the entire ancient Kwararafa Kingdom.\nHe described the reign of the late Aku Uka as a period of self discovery by the Jukun people, of their strategic place in history and role in the promotion of modern civilisation in Nigeria and beyond."
  },
  {
    "headline": "NDLEA Raids Drug Hideouts, Arrests 110 Suspects",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), have raided different drug hideouts across the country and arrested no fewer than 110 suspected drug dealers.\nThe suspects were arrested in nine states across the country when their hideouts were raided, dismantled and assorted illicit substances seized, the NDLEA said.\n“No fewer than 17 suspects arrested by men of the 149 Battalion (Rear), Nigerian Army Cantonment, Ojo, were also transfered to the Agency for further investigation.\nSeized from the suspects are different quantities of Cocaine, Heroin, Tramadol, Methamphetamine, Diazepam, Cannabis and other psychoactive substances.\n“In Kano, one Shamsuddeen Muhammad was arrested with 21.6kg cannabis, well concealed inside empty cartons, while in Oyo state, no fewer than 12 persons were arrested at drug joints raided and dismantled across the state."
  },
  {
    "headline": "IPOB: Obiano’s ‘confession’ has vindicated us over killings",
    "summarized_story": "The Indigenous People of Biafra (IPOB) said it has been vindicated by the Anambra Governor Willie Obiano’s allegation that some of his fellow Southeast Governors were sponsoring the attacks.\nBut in a statement by its Media and Publicity Secretary, Emma Powerful, IPOB said politicians and traitors bent on implicating IPOB were the ones masterminding the killings in collaboration with security agents.\n“Now we have been vindicated by the recent confession by Governor Willie Obiano of Anambra State on why he did not attend the meeting of South-East governors in Enugu.\nHe accused his fellow governors and politicians of masterminding the killings in his state for political gains.\n“Now, our question to all those still pointing accusing fingers at IPOB and Eastern Security Network operatives for the killings in Anambra is: How many of the South-East Governors are IPOB members?"
  },
  {
    "headline": "IPOB: Obiano’s ‘confession’ has vindicated us over killings",
    "summarized_story": "The Indigenous People of Biafra (IPOB) said it has been vindicated by the Anambra Governor Willie Obiano’s allegation that some of his fellow Southeast Governors were sponsoring the attacks.\nBut in a statement by its Media and Publicity Secretary, Emma Powerful, IPOB said politicians and traitors bent on implicating IPOB were the ones masterminding the killings in collaboration with security agents.\n“Now we have been vindicated by the recent confession by Governor Willie Obiano of Anambra State on why he did not attend the meeting of South-East governors in Enugu.\nHe accused his fellow governors and politicians of masterminding the killings in his state for political gains.\n“Now, our question to all those still pointing accusing fingers at IPOB and Eastern Security Network operatives for the killings in Anambra is: How many of the South-East Governors are IPOB members?"
  },
  {
    "headline": "Tinubu reunites with associates, as Sanwo-Olu hosts APC leader",
    "summarized_story": "At 2:45pm, the former Lagos State Governor was received by Sanwo-Olu in company of his Deputy, Dr. Obafemi Hamzat, and Chief of Staff, Mr. Tayo Ayinde.\nFemi Gbajabiamila, and Speaker of the Lagos State House of Assembly, Rt.\nThe APC National Leader said the prayer event was an emotional one for him, saying he was overwhelmed by good wishes from Nigerians while he was away.\nThe Speaker wondered why a “simple knee surgery” became a national issue, but the solidarity shown towards Tinubu across ethnic divides indicated the APC National Leader is an enigma.\nOthers who spoke glowingly about the APC National Leader included the lawmaker representing Lagos West in the Senate, Sen. Olamilekan Adeola, and GAC chairman, Prince Tajudeen Olusi."
  },
  {
    "headline": "World Cup Qualifiers: Super Eagles beat CAR 2-0",
    "summarized_story": "The Super Eagles of Nigeria made good their promise to bounce back from a shocking 1-0 loss to the Central African Republic, CAR by beating the Wild Beasts 2-0 on Sunday in Douala, Cameroon in a 2022 FIFA World Cup qualifying match.\nGoals from Leon Balogun and Victor Osimhen ensured that they remained in pole position to win the group and qualify for the second round with only two games remaining.\nNigeria started the game with intent and before long had the opponent pinned to their own half of the pitch, a clear statement of seeking revenge over the reverse fixture last Thursday.\nThe match also saw Super Eagles captain, Ahmed Musa reach the 100 caps milestone and he now joins fellow centurions, Joseph Yobo and Vincent Enyeama in that exclusive club.\nNigeria now has 9 points from four matches and will next play Liberia away on the 11th of November before finishing at home against Cape Verde on November 14th."
  },
  {
    "headline": "What Buhari must do to avoid failure as president",
    "summarized_story": "Fiery preacher and founder, The Citadel Global Community Church, Pastor Tunde Bakare on Sunday said President Muhammadu Buhari will become a failed president if he refused to tear down the 1999 constitution before leaving office.\nHe urged Buhari to stop passing the buck to the National Assembly in giving the nation a brand new constitution before leaving office in 2023.\n“I say to President Muhammadu Buhari: Mr President, stop passing the buck to the National Assembly.\nTear down this inhibiting concoction of a constitution; tear it down so we can build a truly great nation!\nThis can be achieved by a pragmatic approach to restructuring Nigeria, rather than by mere zoning of the presidency,” he said."
  },
  {
    "headline": "Falana to FG: Recover $62bn lost to Shell, others now or face legal action",
    "summarized_story": "Human rights lawyer, Femi Falana has told the Federal Government to recover the $62 billion lost to six international oil exploring and exploitation companies now or face redress in court.\nFalana, in a letter written to the Attorney General and Minister of Justice, Abubakar Malawi, on behalf of Prof. Omotoye Olorode and Jaye Gaskia of the People’s Alternative Political Movement, said the move was for the Federal Government to Comply with Judgment of the Supreme Court of Nigeria in suit No SC.\n964/2016 between Akwa Ibom & Two Others v Attorney-General of the Federation’.\nFalana said his clients had instructed him to remind Malami that the Federal Government had not enforced the judgment of the Supreme Court of Nigeria delivered on October 20, 2018.\nAccording to him, “in the said judgment, the apex court had directed the Federal Government to immediately take steps to recover all revenues lost to oil-exploring and exploiting companies due to wrong profit-sharing formula since August 2003."
  },
  {
    "headline": "BREAKING: APC Leader, Tinubu Finally Speaks On His Health Issues [Video]",
    "summarized_story": "The National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu on Sunday said only God that can take his life since He is the only that also gives life.\nHe also thanked God for sparing his life till the moment and seeing him through the medical trip.\nTinubu said despite his medical trip he cannot praise God better than any of those present at the ceremony and all those who prayed that he should return home safe and sound.\nDisclosing that it was a day of joy for him, he prayed for the organizers the welcome back ceremony and that God will grant them their heart desires.\nFemi Gbajabiamila, said they are ready to work more and already working to ensure his mandate in 2023."
  },
  {
    "headline": "HURIWA Reacts To Soldiers’ Murder, Burning Of Palace, Houses By Military In Imo",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has called for an independent investigation into who is to blame for the alleged killing of two soldiers, as well as the invasion by armed military personnel and subsequent burning down of the palace of the traditional ruler of Izombe community in Oguta Local Government Area of Imo.\nMr James Imo, a community leader from Umuokwu village, told HURIWA that around 50 houses had been burned down.\nIt criticized what it called the enraged adolescents’ callous behavior in reportedly murdering the uniformed personnel, saying that the cruel criminal crime of killing law enforcement officers is despicable and reprehensible.\nAccording to the rights group, the medieval trend of invasion and arson by enraged soldiers is completely unlawful and tantamount to terrorism.\nMartina Okwor, the traditional ruler’s wife, who was also allegedly beaten by officers who invaded the traditional ruler’s home in Umakashi, Nsukka, said the incident happened around 10 p.m. on Thursday."
  },
  {
    "headline": "BREAKING: Alleged ESN Operatives Inform Anambra Community Of Planned Attack",
    "summarized_story": "Persons claiming to be operatives of the Eastern Security Network (ESN), the militant arm of the separatist group Indigenous People of Biafra (IPOB), have written to the Ukwulu Community in Anambra State’s Dunukofia LGA, warning them of planned attacks.\nAccording to a source, residents of the community awoke on Sunday morning to a notice posted on a portion of the community telling them not to participate in the group’s sit-at-home activity.\nA notice pasted on a part of the community, by persons alleged to be ESN operatives, read: “Respect yourself Ukwulu about sit-at-home, to avoid crying had I known.\nDAILY POST is however not certain if the notice emanated from the ESN.\nAttempts to reach the spokesperson of IPOB, Mr Emma Powerful, were not successful as at the time of writing this report."
  },
  {
    "headline": "Breaking: Renowned Nigerian Pastor Kicks-Off Massive Campaign Ahead of 2023",
    "summarized_story": "Ahead of the 2023 presidential election, Pastor Tunde Bakare, the serving overseer of the Citadel Global Community Church (CGCG) has commenced a serious campaign on behalf of Nigerians.\nAnnouncing the campaign on Sunday, October 10, which he tagged Nigeria for Nigerians (N4N) Movement, the fiery Christian cleric stated that it is time for citizens to take back their country.\nAs reported by Vanguard, the pastor declared prophetically that come 2023, there will be a change in the country’s government.\nHis words: “This state of the nation broadcast may be the last I will deliver in this auditorium.\n“The Nigeria for Nigerians, N4N movement has been launched because it is time for Nigerians to take back their nation."
  },
  {
    "headline": "Breaking: Fuel scarcity averted as NUPENG calls off proposed strike",
    "summarized_story": "The Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) on Sunday evening has called off its proposed strike.\nNUPENG’s President, Comrade William Akporeha, and the General Secretary, ComradeAfolabi Olawale revealed this in a press statement.\nPart of the statement reads: “The leadership of the Nigeria Union of Petroleum and Natural Gas Workers hereby announced the suspension of the intended withdrawal of the services of Petroleum Tanker Drivers earlier scheduled to commence midnight of Sunday, 10th October 2021 following the understanding reached with the Union by the management of NNPC at a meeting held in Ibadan, Oyo State, today, 10th October 2021 and the expected outcome of the follow up meeting that is scheduled to hold on Tuesday, 12, October 2021 in Abuja as contained in the communique issued today.\n“The suspension of our planned action is predicated on our belief that the understanding reached with the government today as well as at meeting of Tuesday 12th, October 2021 will be fulfilled to the letters.\n“We wish to clearly made it known to all well meaning Nigerians that have variously appealed to us on these issues that our plan was not intended to inflict further pains on Nigerians but to ensure observance of minimum safety on our highways for the good of lives and properties.”"
  },
  {
    "headline": "Pictures: Naija Ratels, Ghana Police Ladies end Flying Officer’s Cup opener goalless",
    "summarized_story": "Naija Ratels started their 2021 Flying Officers Cup campaign with a goalless draw against Ghana Police Ladies at the Area 10 Sports Complex on Sunday evening.\nNaija Ratels FC missed three good chances in the first 19 minutes of the game, Agama and Adugbe being the biggest culprit.\nGhana Police Ladies FC came out in the second half to upset the host but Doris Ohia briliantly saved Naija Ratels from conceding.\nThere was a scary moment for the host in the 69th minute as Ghana Police Ladies FC saw their effort hitting the cross bar.\nNaija Ratels FC will face Royal Queens FC of Warri in their next game on tuesday while Ghana Police Ladies FC square up with Honey Badgers FC on October 13."
  },
  {
    "headline": "Breaking: Leon Balogun, Victor Osimhen to the rescue as Super Eagles avenge FIFA World Cup qualifier vs CAR in Douala",
    "summarized_story": "Defender Leon Balogun and striker Victor Osimhen were on scoresheet on Sunday to ensure that Super Eagles defeated their Central African Republic (CAR) in Douala Cameroon.\nWhile Balogun scored in the 29th minute, Osimhen blasted the net just before the first half ended.\nDetails loading…"
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Access Bank, Xploits Consulting donate food, school items to orphanages in FCT -NigPilot",
    "summarized_story": "In continued efforts to bring succor to orphans across the FCT, Access Bank Plc and Xploits Consulting Ltd , have donated food and school items to some orphanages as part of their projects to ensure that they have a better life.\nSome of the orphanages captured in the project and visited include Daughters of Charity Orphanage, Bwari, Destined Children’s Orphanage, Kado Estate, Abuja, Best Life Orphanage, Gwagwalada, Al’ansar Orphanage, Kuje in the FCT.\nSpeaking at the handing over of the items, Director, Communications, Xploits Consulting Ltd, Mrs, Grace Taiwo said that the presentation of the items were part of Access Bank Plc’s Corporate Social Responsibility, CSR adding that the bank’s commitment was largely focused around the United Nations Sustainable Develop Goals.\nTaiwo assured that her organisation with support from Access Bank Plc will continue to invest in the lives of Nigerians especially in areas of education, health, gender equality, arts.\nShe listed some of the items donated to include food items, toiletries and stationeries."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "Gunmen Attack Adamawa Police Station, Kidnap Two",
    "summarized_story": "Gunmen suspected to be kidnappers have attacked Ngurore Police Station in Yola South Local Government Area of Adamawa, police authorities say.\nThey also attacked a house in the area, abducting a woman identified as Hauwa Umaru and her daughter in the early hours of Sunday.\nPolice Public Relations Officer in the state, Sulaiman Ngurore, confirmed the attack to Channels Television via a statement.\nHe said the gunmen stormed the station at about 2 a.m. on Sunday, but no casualty was recorded.\nThis is even as the Head of the Police Intervention Team, Babagana Abubakar, was already on the ground to coordinate police investigative operations and rescue responses."
  },
  {
    "headline": "Zamfara Residents Hold Prayer Over Lingering Insecurity",
    "summarized_story": "﻿Residents of Zamfara State on Sunday gathered to pray for God’s intervention over the continuous bandit attacks and abductions in the state.\nThey have also urged the Federal Government to provide adequate equipment for security personnel fighting the war against banditry and other crimes in the state.\nRead Also: Bandits Kill 26 In Deadly Attack On Zamfara StateThe incident was the third attack on schools in Zamfara this year – coming after that of Jangebe and Bakura.\nThe Nigerian Communications Commission (NCC) on September 3 directed telecommunications providers in the state to shut down their services.\n“The pervading security situation in Zamfara has necessitated an immediate shutdown of all telecommunications services in the state from today, September 3, 2021."
  },
  {
    "headline": "Improving Security Remains Our Priority – Buhari",
    "summarized_story": "President Muhammadu Buhari on Saturday said improving security, the economy and fighting corruption are still the core priorities of his administration, six years after the triad of promises first won him the presidential election.\n“As you are all aware, our beloved nation Nigeria is facing many security challenges at this period.\n“These assets will be deployed to accelerate the fight against insecurity in all parts of the country.”President Buhari noted that security had assumed priority in governance and public policy in international scheme of affairs.\nIt is therefore not surprising that the Academy has earned a reputation as an outstanding military Academy in Africa.\n“The contemporary security environment has been described as violent, uncertain, complex and ambiguous."
  },
  {
    "headline": "2023 Elections: APC, PDP Have Led Nigeria Astray For 21 Years – Jega",
    "summarized_story": "﻿Ahead of the 2023 general elections, a former Chairman of the Independent National Electoral Commission (INEC), Professor Attahiru Jega, said the All Progressives Congress (APC) and the Peoples Democratic Party (PDP) have led Nigeria astray for the past 21 years.\n“The current two dominant parties – APC and the PDP – with their quality recruitment and leadership selection processes who have shared power and have tended to lead Nigeria astray in the past 21 years are becoming incapable of directing Nigerian political and governance processes in the right direction,” he said on Saturday.\nHe said the constitutional provision that prohibits the use of technology is a hindrance to electronic voting, asking the lawmakers to remove the legal encumbrance for electronic voting to be possible in the 2023 elections.\n“Many Nigerians who are in support of electronic voting are blaming INEC for saying it cannot use electronic voting.\nThey have forgotten that there is a legal provision that says electronic voting is prohibited.”"
  },
  {
    "headline": "2023 Presidency: Tinubu, Osinbajo Can Clearly Defeat PDP Candidate – Bwala",
    "summarized_story": "﻿A member of the All Progressives Congress, Daniel Bwala, has said that if both Vice President Yemi Osinbajo and former Governor of Lagos State, Bola Tinubu, decide to run for the presidency in 2023, they have all it takes to defeat their counterparts from the Peoples Democratic Party.\nMr Bwala who was a guest on Channels TV’s Sunday Politics, said this while analysing the party’s preparedness alongside that of their opponents ahead of the elections.\n“These two candidates you’ve mentioned, each of them can clearly defeat any candidate that comes out of the PDP except if the candidate is Atiku Abubakar,” he said.\nWhile neither of them has clearly come out to state their intentions to run, there are talks that they may emerge as possible candidates.\nRead Also: [2023] Zoning Is Not The Solution To Nigeria’s Problems, Says AtikuMeanwhile, according to Mr Bwala, internal stability is one of the advantages the APC has on its side."
  },
  {
    "headline": "NDLEA intercepts Australia-bound Meth in soles of ladies’ shoes, body cream, arrests 110 dealers in raids across 9 states",
    "summarized_story": "At least 16 individuals were arrested in Lagos on Thursday after police raided known drug joints in Maza Maza, Alakija, Festac town, Amuwo Odofin, Oluti, Isheri roundabout, and Igando.\nSeven others were equally arrested in different locations in Lekki area of the state.\nIn Kwara, no fewer than 38 suspects were arrested and 29.585kg assorted drugs including Cocaine, Meth, Tramadol, Diazepam and others recovered from them across seven drug joints in Lafiagi.\nIn Rivers, at least three persons were arrested from drug joints in Oyigbo and Kara oil mill area of the state on Saturday 9th October.\nHe urged them, as well as their colleagues in other commands, to stay tenacious in their fight against the narco-syndicates."
  },
  {
    "headline": "At least 18 dead after two buses collide along Iseyin-Moniya road in Oyo",
    "summarized_story": "Eighteen people have reportedly died after two buses collided along the Iseyin-Moniya road in Oyo state.\nThe accident which occurred close to Kraal market near Iseyin town on Saturday was as a result of a head-on collision at a sharp bend along the road.\nThe Sector Commander of the Federal Road Safety Commission (FRSC) in Oyo state, Uche Chukwura, stated she had not yet been informed about the incident.\nShe informed newsmen that the delay in notifying might be due to MTN’s network outage on Saturday.\nChukwura, stated that she will share information as soon as it becomes available."
  },
  {
    "headline": "NUPENG to commence nationwide strike tomorrow",
    "summarized_story": "The National Union of Petroleum and Natural Gas Workers (NUPENG) has announced that its Petroleum Tanker Drivers (PTD) would commence strike tomorrow, Monday over the poor condition of the country’s highways, among other concerns.\nMr. Aboyeji stated that the union’s tanker drivers will cease operations across the country.\n“We are going on nationwide strike because of the deplorable and shameful state of our highways.\n“The list of the highway (sic) are endless and the tanker drivers have been going through harrowing situation while rendering selfless national service.\nMr. Aboyeji said the union had given notice to the government “to put all these in order to avert the nationwide strike on Monday.”“We know that the present administration would not do anything until we start the nationwide strike,” he said."
  },
  {
    "headline": "Sokoto Government Confirms Attack On Village, Market 20 Killed, 34 injured -",
    "summarized_story": "Sokoto state government has confirmed the attacked on Ungwan Lalle market located in Sabon Birni local government where over twenty persons were killed by suspected armed bandits.\nThe state commissioner for Carriers and Security Matters, Garba Moyi confirmed the attack in an interview with to newsmen .\nHe expressed sadness over the attack and described as unfortunate and avoidable if only the traders have obeyed the state government directives that ban opening of all rural markets in the eastern part of the state as measures to curtail banditry.\nAccording to the commissioner, a taskforce comprising security agents, local government chairmen and representatives of district heads in each of the affected local government area to ensure compliance.\nSources said over thirty persons are receiving treatment at various medical centre across the state while relative of missing persons are still looking for their lives ones."
  },
  {
    "headline": "Facebook Unveils New Controls for Kids Using Its Platforms",
    "summarized_story": "The Menlo Park, California-based Facebook is also planning to introduce new controls for adults of teens on an optional basis so that parents or guardians can supervise what their teens are doing online.\nThese initiatives come after Facebook announced late last month that it was pausing work on its Instagram for Kids project.\n“We are constantly iterating in order to improve our products,” Clegg told Dana Bash on “State of the Union” Sunday.\nHe noted Facebook needs to show exactly how they would implement it and offer research that shows these tools are effective.\nHe said he also believes that Facebook should cancel its Instagram project for kids."
  },
  {
    "headline": "Taliban Says US Will Provide Humanitarian Aid to Afghanistan",
    "summarized_story": "The US has agreed to provide humanitarian aid to a desperately poor Afghanistan on the brink of an economic disaster, while refusing to give political recognition to the country’s new Taliban rulers, the Taliban said Sunday.\nThe Taliban said the talks held in Doha, Qatar, “went well,” with Washington freeing up humanitarian aid to Afghanistan after agreeing not to link such assistance to formal recognition of the Taliban.\nOn Saturday, however, the Taliban ruled out cooperation with Washington on containing the increasingly active Islamic State group in Afghanistan.\n“We are able to tackle Daesh independently,” Shaheen said when asked whether the Taliban would work with the U.S. to contain the Islamic State affiliate.\nDuring the meeting, U.S. officials were expected to press the Taliban to allow Americans and others to leave Afghanistan."
  },
  {
    "headline": "Pope Meets Colombian Nun Freed in Mail after Four Years as Captive",
    "summarized_story": "Pope Francis on Sunday met a Colombian nun who was freed on Saturday by jihadist in Mali after more than four years as a hostage.\nA Vatican spokesman said Gloria Cecilia Narváez, after travelling to Rome, met the Pope before the celebration of a Mass.\nThe nun was taken hostage in 2017 while working as a missionary in Koutiala, east of Mali’s capital Bamako.\nIt is not clear whether a ransom was paid to secure her release.\nThe office of Mali’s president said the nun’s release had come after more than four-and-a-half years of “combined effort of several intelligences services”."
  },
  {
    "headline": "Nigeria: NDLEA Dismantles Drug Joints in Nine States, Arrests 110 Dealers",
    "summarized_story": "No fewer than 110 drug dealers were arrested in a raid on hideouts in nine states across the country in the past one week.\nHe said in Lagos, notorious drug joints in Maza Maza, Alakija, Festac town, Amuwo Odofin, Oluti, Isheri roundabout, and Igando were raided on Thursday 7th October, 2021, when at least 16 suspects were arrested.\nThe arrested suspects, according to him, include: Lucky Elibe; Abdullahi Jabir; Amos Kalli; Nweke ThankGod; Tukwosi Arowolu; Odinaka Oramu; Jeremiah Ishaya; Maxwell John; Usman Garba; Christian Okibe; Mba Peter; Sarah Offiri; Wasiu Adeniji; Bode Olaitan; Yetunde Ahmed; and Abdullahi Jibril.\nHe said seven others were also arrested in different locations in Lekki area of the state.\nBabafemi revealed that no fewer than 17 suspects arrested by men of the 149 Battalion (Rear), Nigerian Army Cantonment, Ojo, were also transfered to the agency for further investigation."
  },
  {
    "headline": "Super Eagles Bounce Back, Beat CAR 2-0 in Douala to Avenge Shock Home Loss",
    "summarized_story": "Nigeria’s Super Eagles responded to their shocking home defeat last Thursday to beat Central African Republic 2-0 in Douala, and go top of Group C of the FIFA World Cup, Qatar 2022 qualifiers on Sunday.\nIn Douala, Cameroon, the Eagles scored twice in the opening half at Japoma Stadium to cement their Group C top spot, beating Central African Republic 2-0.\nAfter receiving a last minute shocker at home in Lagos last Thursday, the Super Eagles wanted to make amends and maintain top spot, which they achieved in Douala, where Central African Republic play their home games.\nVictor Osimhen doubled the Super Eagles’ lead in the first half injury time to ease the pressure on coach Gernot Rohr men.\nNigeria raised their tally to 9 points, five more than Central African Republic and Cape Verde, who faces Liberia (3 points) later on Sunday."
  }
]