[
  {
    "headline": "Researchers find shorter treatment for HPV-linked oral cancer",
    "summarized_story": "Amarachi OkehResearchers at Mayo Clinic have found a shorter and more effective treatment for HPV-associated oropharynx cancer.\nAccording to the clinic, this new treatment leads to excellent disease control and has fewer side effects, compared to standard treatment.\nThe initial clinical trial demonstrated that well-selected patients could have excellent disease control with much lower toxicity using the new treatment.\nHe also noted that many of the side effects from the treatment are directly linked to the amount of radiation used for treatment.\n“Our findings suggest that in select patients with HPV-associated oropharynx a shorter course treatment, compared to the standard of care, yields a similar result,” The radiation oncologist said."
  },
  {
    "headline": "Researchers find shorter treatment for HPV-linked oral cancer",
    "summarized_story": "Amarachi OkehResearchers at Mayo Clinic have found a shorter and more effective treatment for HPV-associated oropharynx cancer.\nAccording to the clinic, this new treatment leads to excellent disease control and has fewer side effects, compared to standard treatment.\nThe initial clinical trial demonstrated that well-selected patients could have excellent disease control with much lower toxicity using the new treatment.\nHe also noted that many of the side effects from the treatment are directly linked to the amount of radiation used for treatment.\n“Our findings suggest that in select patients with HPV-associated oropharynx a shorter course treatment, compared to the standard of care, yields a similar result,” The radiation oncologist said."
  },
  {
    "headline": "Afe Babalola hails ABUAD as varsity performs first kidney transplant",
    "summarized_story": "Abiodun NejoThe Founder, Afe Babalola University, Ado Ekiti, Aare Afe Babalola, on Wednesday thumbed up the university’s multi-system hospital for the various exploits it had been doing since its establishment, saying it had come to end outward medical tourism in Nigeria.\nBabalola, who spoke against the backdrop of the first kidney transplant in the hospital, said, “This is a milestone for ABUAD, but I am not surprised because we have quality equipment and well-trained and experienced personnel.\nBabalola and Oguntola spoke in a statement by ABUAD Director of Corporate Affairs, Tunde Olofintila, titled ‘ABUAD MSH successfully performs first kidney transplant’.\nOguntola said, “The transplant was done simultaneously on Wednesday, October 13, using a dedicated twin-transplant theatre right here in this hospital, thus making it the first successful kidney transplant in Ekiti/Ondo axis of the country.\nHe advised people with kidney problems to make their way to ABUAD hospital."
  },
  {
    "headline": "Afe Babalola hails ABUAD as varsity performs first kidney transplant",
    "summarized_story": "Abiodun NejoThe Founder, Afe Babalola University, Ado Ekiti, Aare Afe Babalola, on Wednesday thumbed up the university’s multi-system hospital for the various exploits it had been doing since its establishment, saying it had come to end outward medical tourism in Nigeria.\nBabalola, who spoke against the backdrop of the first kidney transplant in the hospital, said, “This is a milestone for ABUAD, but I am not surprised because we have quality equipment and well-trained and experienced personnel.\nBabalola and Oguntola spoke in a statement by ABUAD Director of Corporate Affairs, Tunde Olofintila, titled ‘ABUAD MSH successfully performs first kidney transplant’.\nOguntola said, “The transplant was done simultaneously on Wednesday, October 13, using a dedicated twin-transplant theatre right here in this hospital, thus making it the first successful kidney transplant in Ekiti/Ondo axis of the country.\nHe advised people with kidney problems to make their way to ABUAD hospital."
  },
  {
    "headline": "Tobacco industry interfering with public health policies, CAPPA raises the alarm",
    "summarized_story": "Adepeju Adeogun, Finance Control Officer, Nigeria Tobacco Control Allaince, NTCA; Akinbode Oluwafemi, Executive Director, and Philip Jakpor, Director of Programmes, both of Corporate Accountability and Public Participation Africa, CAPPA, unveiling “Nigeria Tobacco Industry Interference Index 2021” in Lagos on Thursday.\nBy Agbonkhese ObohThe Corporate Accountability and Public Participation Africa, CAPPA, has said the tobacco industry was interfering with governments’ health policies thereby endangering regulatory efforts in clear contravention of the National Tobacco Control Act, 2015, and the National Tobacco Control Regulations, 2019.\nAccording to Oluwafemi, the report, initiated by the Southeast Asia Tobacco Control Alliaces, SEATCA, forms part of the global Global Tobacco Industry Interference Index.\nHe said in contraventions of the relevant Act and Regulation, states and federal government officials interact with the tobacco industry without making the details of the meeting public.\nAnd, CAPPA said, there’s nothing normal about the tobacco industry, therefore their socially-responsible activities should be de-normalised as they are a form of tobacco promotion."
  },
  {
    "headline": "Reps committed to legislative agenda that will promote manufacturing ― Gbajabiamila",
    "summarized_story": "The Speaker, House of Representatives, Mr Femi Gbajabiamila, has pledged the commitment of the House to drive a legislative agenda that will promote the country’s manufacturing sector.\nGbajabiamila made the pledge at a dinner organised by the Manufacturers Association of Nigeria (MAN) to mark the association’s 50th anniversary on Wednesday in Abuja.\nRepresented by Rep. Aliyu Magaji, the speaker said that a productive manufacturing sector remained the catalyst for the growth of any country’s economy.\nEarlier, the President of MAN, Mr Mansur Ahmed, said that the revival of the manufacturing sector was critical in moving Nigeria forward.\nAccording to him, there is need for policies that will inspire the confidence of investors and ensure that the manufacturing sector becomes more competitive."
  },
  {
    "headline": "Energy transition must be done in collaborative manner – ABC Orjiako",
    "summarized_story": "OrjiakoIn recognition that one of the biggest challenges in energy transition is the continuous discordant tunes across the world, Dr. ABC Orjiako, Chairman, Seplat Energy Plc, has said that the best in the project can only be achieved in a collaborative manner leveraging technology and innovation.\nHis words: “We must develop a coordinated and coherent approach to energy transition with the specific needs of several geographies in consideration”.\nWhile responding to Seplat Energy’s timeline for energy transition and how he sees this happening, Orjiako said: “I think one of the biggest challenges in energy transition is the continuous discordant tunes that are being sung across the world.\nThe recent bull market experienced in the commodities market particularly with oil and gas is due in part to the uncoordinated planning of the pace of Energy Transition.\nThe bull market is not isolated and oil prices will experience volatility in the long term.’’According to him, the current energy transition is also driven by politics, climate activism and policies whereas in my view the energy transition should be driven by technology and innovation in a coordinated manner by all players."
  },
  {
    "headline": "AfDB backs Nigeria’s moves on gas as transitional fuel",
    "summarized_story": "By Peter EgwuatuAfrican Development Bank, AfDB has backed Nigeria’s advocacy to halt plans to defund gas projects, just as the global community moves towards the 2050 net-zero emissions target under the United Nations Climate Change agenda.\nNigeria has been on the forefront of an international advocacy questioning the planned defunding of gas projects as one of the moves towards achieving net-zero emissions.\nREAD ALSO:Police arrests suspected ritualists with human head in OyoLaolu Akande, Senior Special Assistant to the President on Media & Publicity Office of the Vice President disclosed this in statement made available to Vanguard on Wednesday, saying : “ Now, the continent-wide Africa Development Bank, AfDB, has thrown its weight behind the clamour during a meeting last week between Nigeria’s Vice President, Prof. Yemi Osinbajo, and a delegation of the bank.\nSo also did a team of US experts recently in a widely published article.\n“You clearly stated that gas must be seen to be a transitional fuel for Africa, which is a position that our bank also supports because we do understand that Africa needs to increase its energy access, and you can’t increase energy access without utilizing some of the resources and energy sources that we have.’’"
  },
  {
    "headline": "Why FG’s recording capital expenditure-revenue mismatch – Finance Minister",
    "summarized_story": "The Minister of Finance Budget and National Planning, Zainab Ahmed, who stated this, added that that Nigeria’s debt instruments have remained attractive to both local and international investors because the country does not default in repayment.\nOn how impactful, she said, ‘‘If you see the kind of infrastructure that is being deployed you will see it physically.\nWhen you build a road and the travel time of traveler reduces, that is time saved and money in the pockets of people.\nIt is also evident in the quality of roads where you have less accident and those are lives saved.\nSo, there are so many impacts that you cannot count them in terms of monetarily terms but in terms of improving quality of peoples’ lives and easy of doing business."
  },
  {
    "headline": "TETFund boss blames poor funding for crisis in education sector",
    "summarized_story": "The Executive Secretary, Tertiary Education Trust Fund (TETFund), Suleiman Bogoro, has decried the crisis in the education sector, insisting it stems from poor financing.\nHe made the remarks at the 13th Thematic meeting of the TETFund Research and Development Standing Committee, RDSC, on Education held virtually recently.\nBogoro said the crisis in the sector cuts across all levels from primary through secondary and tertiary levels of learning and is mainly the result of poor funding for education.\n“The most vibrant economies are so because they have allowed education to dictate the way forward through qualitative research, to make a difference.\nThe TETFund boss lauded the Federal Government for steps to professionalize teaching and introduce special allowances for teachers, among other incentives."
  },
  {
    "headline": "Biafra: Court sets date for Nnamdi Kanu’s fundamental rights suit against Buhari govt",
    "summarized_story": "The High Court sitting in Abia State has set a date for the suit by pro-Biafra agitator, Nnamdi Kanu challenging his rearrest and rendition by the Nigerian government.\nThe court set 2nd November 2021 for hearing of the pending suit.\nKanu’s Special Counsel, Aloy Ejimakor, disclosed this in a statement he signed and issued on Thursday.\nEjimakor disclosed that the Nigerian government is expected to move their extant application for extension of time to file their defense to the suit.\nThe statement reads: “For the information of the general public, Mazi Nnamdi Kanu’s Fundamental Rights suit pending before the High Court of Abia State has been assigned and set down for hearing on 2nd November, 2021."
  },
  {
    "headline": "Ganduje presents N196.3bn 2022 budget to House of Assembly",
    "summarized_story": "The Kano State Governor, Umar Abdullahi Ganduje, has presented to the State House of Assembly a total Budget of N196.3 billion for the 2022 fiscal year.\nThe budget tagged, “Budget of Consolidation And Prosperity”, has a capital expenditure of N107.5 billion while recurrent expenditure is N88.2 Billions.\nSimilarly, the budget has a total expected revenue of N49.508 billion which is lower by N40.5 billion to that of 2021, while education takes 26 percent of the total budget at N51.6 billion.\nGovernor Ganduje hinted that the 2021 revenue collection performance stood at 77 percent while spendings performance was 71 percent.\nHamisu Chidari, commended the government for consolidating on the 2021 budget despite the Coronavirus pandemic."
  },
  {
    "headline": "Kaduna communal clash: Again, peace commission meets stakeholders",
    "summarized_story": "The Kaduna Peace Commission on Thursday again met with stakeholders from Chawai Chiefdom in Kauru Local Government Area of the state, with the aim to proffer solutions to the recurring communal clashes in the area.\n“This is a continuation of the dialogue the Peace Commission has been facilitating within the Chawai Chiefdom.\nAlso, Yakubu Baido, the Southern Kaduna Zonal Youth leader of Miyetti Allah, commended the commission for the initiative to convene the meeting and called for peace in the Chiefdom.\nNAN reports that on Aug. 7, the commission met stakeholders from Chawai Chiefdom to further proffer solutions to the recurring communal clashes in the area.\nSouthern Kaduna communities sign peace deal"
  },
  {
    "headline": "Lawmaker condemns impeachment of Plateau Speaker",
    "summarized_story": "The lawmaker representing Rukuba/Irigwe constituency in the Plateau State House of Assembly, Musa Agah, has described the impeachment of the Speaker of the State House of Assembly, Abok Ayuba, by eight members as “the height of illegality”.\nDAILY POST recalls that there was confusion at the Plateau State House of Assembly early Thursday following the removal of Abok.\nAbok Ayuba is a first-term lawmaker who represents Jos East state constituency in the Plateau State House of Assembly.\nThe former Speaker, Abok Ayuba was immediately replaced by the lawmaker representing Pengana constituency, Yakubu Sanda of the All Progressives Congress (APC).\nAbok Ayuba: EFCC petition that nailed impeached Plateau Speaker"
  },
  {
    "headline": "Kogi Assembly okays over N30bn supplementary budget for 2021",
    "summarized_story": "The Kogi House of Assembly has approved a supplementary budget of N30.014 billion for the state government to meet the developmental needs of the state.\nRead Also: Flood overtakes Kogi Assembly quarters- Advertisement -NAN reports that Gov.\nYahaya Bello on Aug. 25 forwarded the supplementary budget bill to the State House of Assembly for approval.\n- Advertisement -Approval of the supplementary budget, according to the governor, would enable the government to meet the developmental needs.\nThe Supplementary Budget brings the total revised budget for 2021 fiscal year to over N160 billion."
  },
  {
    "headline": "VIDEO: President Buhari arrives for prayer in Medinah",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Treat rain water before use – Expert",
    "summarized_story": "Eletta made the call on Thursday, in a paper he presented at the institution’s 204th Inaugural Lecture titled: “Bad yet Good: Rummaging and Combatting for future Water and Land Security”.\nAccording to him, rainwater is considered to be the source of the purest form of water.\n- Advertisement -He said, “rainwater samples collected from corrugated iron sheets from different locations in Ilorin, were analysed to determine the influence of the age of corrugated iron roofs on the quality of water used harvested.\nEletta noted that this condition was reported to have led to an increase in microbial pollution of the water and the ability to erode roofing sheets.\nHe added that depending on the age and type of roofing materials in place, heavy metals have been reported to increase in water collected from aged galvanised iron roofing sheets."
  },
  {
    "headline": "Some Nigerians have taken over role of God, says Buhari",
    "summarized_story": "President Muhammadu Buhari on Thursday said a good number of Nigerians have taken over the role of God by failing to put their faith in Him regarding the crisis in the country.\n“However, in actual fact, a good number of Nigerians have taken over the role of God by failing to place their trust in Him and placing it entirely on themselves and other men.\nAs such we begin to ask God, where are you?\nAbioye, who is the Presiding Bishop, Living Faith Church, Goshen City, Abuja, said however the people need to turn away from evil and turn to God as faith goes with integrity.\nHe urged that despite everything, the nation must remain committed to the will of God."
  },
  {
    "headline": "Breaking: Security takes over Plateau Assembly as 8 APC lawmakers plot to impeach Speaker",
    "summarized_story": "From Gyang Bere, JosTension mount at the Plateau State House of Assembly as six Lawmakers the under the All Progressives Congress (APC) out of the 24 members of the House make move to impeach the Speaker, Rt.\nThe security stormed the Assembly Complex as early as 5am on Thursday and block entrance into the House after APC members led by the Majority Leader, Daniel Nanlong and the Deputy Speaker, Saleh Yipmong into the Assembly complex.\nDaily Sun gathered that the six members who attempted to impeach the Speaker on Wednesday night were allegedly recruited more members with the aid of security operatives to carry out their mission.\nDalyop Fom said there is no how 8 out of the 24 members of the House can impeach Speaker of the House.\nHe noted that 8 members of the House storm the House of Assembly as early as 5am with the aid of security personnel with the aim of impeaching the Speaker, Hon."
  },
  {
    "headline": "FG to spend N1.35trn on petrol subsidy –NNPC",
    "summarized_story": "According to Kyari, the open price of petrol has risen to N256 per litre, while the retail price is pegged at N162 per litre.\nUsing the higher band of N150 billion monthly subsidy payouts, it implies that the federal government has spent N1.35 trillion on petrol between January and September this year.\nLabour has threatened to ground the country if petrol price rises above the current level as it would worsen the woes of already distressed Nigerians.\nMeanwhile, the Petroleum Products Marketing Company (PPMC) has said the full deregulation of the petroleum downstream sector will save Nigeria N12 trillion in four years.\nSimilarly, Mr. Adeyemi Adetunji, Group Executive Director, Downstream, Nigerian National Petroleum Corporation (NNPC), maintained that prices of petroleum products would be determined by free market under the PIA."
  },
  {
    "headline": "FEC gives NNPC nod to fix 21 federal roads at N621.2bn",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council (FEC) has granted the Nigerian National Petroleum Corporation (NNPC) approval to take over the reconstruction of 21 federal roads across the country.\n007 of 2019 cited as the Companies Income Tax (Road Infrastructure Development and Refurbishment Investment Tax Credit Scheme) Order, 2019 (“EO7 of 2019” or “the Scheme”) signed by President Muhammadu Buhari.\nHe said nine of them are in North Central, three in North East, two in North West, two in South East, three in South-South, and two in South West.\n“The second memorandum relates to the road infrastructure tax credit scheme.\nNine of those 21 roads are in North Central, particularly Niger State, three in the North East, two in the North West, two in the South East."
  },
  {
    "headline": "Early reviews of eNaira app unsatisfactory despite 200,000 wallet downloads",
    "summarized_story": "Despite the massive interest in the Central Bank of Nigeria (CBN)’s eNaira initiative in which over 200,000 wallets were downloaded in 24 hours, early reviews of the app indicate frustrations among Nigerians with some stating that the CBN should have thoroughly done a better investigation before launching the app.\nHowever, with over 2,596 app reviews, the app has an assigned rating of just 1.8 stars for Android users and 2.9 stars with 81 rating on the Apple Store.\nA user, Colorado Akpan, stated that the interface is okay but the error messages were too much.\nIn response, the CBN said, “Good day Akpan, Please note that the system will unlock you after 30 minutes.\nWe apologise for the difficulties you experienced while registering with us."
  },
  {
    "headline": "Gunmen kill 6, raze houses in Kogi",
    "summarized_story": "The Police Command in Kogi State has confirmed that six people were killed with some houses burnt by unknown gunmen in a Monday morning attack on Bagana community of Omala Local Government in the State.\nThe Commissioner of Police in Kogi, Idrisu Dabban, confirmed the incident to newsmen after a visit to the area.\nThe Commissioner of Police also assured that necessary measures would be taken to forestall resurgence of the clashes in the local government.\nThe attackers were said to have gone straight to the palace of a traditional ruler, Chief Anyebe Salifu, whose stool was classified as third class only a fortnight ago.\nA reliable source said the attackers, who were possibly linked to a clan, opposed the ascendancy of the traditional ruler and had planned to disrupt his coronation."
  },
  {
    "headline": "A’Ibom Govt Berates ‘Elderly-witch Syndrome’ in Society",
    "summarized_story": "By Okon BasseyAkwa Ibom State Government has expressed concern over the rising ‘elderly-witch’ syndrome in the society, with the aged abandoned and tagged witches by the younger generation.\nThe state Governor, Udom Emmanuel, who made the observation, strongly condemned the dubious act of some unscrupulous members of the society dubbing the elderly as witches, thereby denying them the welfare and care they rightly deserve.\nHe said: “It is disheartening to see some children dub their aged parents as witches.\nRepresented by his deputy, Mr. Moses Ekpo, the governor chided the ill-will children and youngsters, who have failed in their responsibilities to fend for their aged parents and the elderly around them.\nHe congratulated Essien on his 80th birthday, describing him as one of those strong pillars behind the birth of Akwa Ibom State and the progenitor of the Akwa Ibom Elderly Citizens Assembly, a group that has championed the cause of the elderly in the society."
  },
  {
    "headline": "124 Years after, Cambridge University Hands over Benin Bronze Cockerel to Nigeria",
    "summarized_story": "London-based Daily Mail reported that the sculpture of a cockerel was one of hundreds of Benin Bronzes pillaged from the Kingdom of Benin, in Nigeria.\nThe college’s Legacy of Slavery Working Party concluded in 2019 that the cockerel “belongs with the current Oba at the Court of Benin”.\n“For the cockerel, I must give credit to our young students at Cambridge University.\nThe British Museum had spoken about “opportunities for sharing and displaying” items from its collection in Nigeria, but had never said it would transfer ownership.\nThe Oba of Benin is head of the historic Eweka dynasty of the Benin Empire based in Benin City in modern-day Nigeria."
  },
  {
    "headline": "NNPC to Reconstruct 21 Critical Federal Roads, Projects to Gulp N621.2bn",
    "summarized_story": "This is just as the NNPC has said deregulation of petroleum sector would enable the country save the N12 trillion being spent on subsidy payment in the next four years.\nAccording to him, the intervention by the NNPC was a strategic move under the federal government’s Road Infrastructure and Refreshment Tax Credit Scheme.\nFashola further explained that the second memorandum had to do with the road infrastructure tax credit scheme.\nSo NNPC has identified 21 roads that it wants to deploy.\nAccording to him, the “NNPC sought and council has approved today that NNPC deployed tax resources to 21 roads covering the total distance of 1,804.6 kilometers across the six geopolitical zones."
  },
  {
    "headline": "Senate: INEC Free to Transmit Anambra Governorship Election Results Electronically",
    "summarized_story": "•Despite IPOB threat, poll will hold, says commissionerDeji Elumoye in Abuja, Emma Okonji and Nosa AlekhuogieThe Senate has told the Independent National Electoral Commission (INEC) that it is at liberty to transmit electronically the results of the November 6 governorship election in Anambra State.\nChairman of the Senate Committee on INEC, Senator Kabiru Gaya, said yesterday in Abuja that the electoral umpire was free to transmit the governorship election results electronically if it so desired.\nThe senate INEC committee chairman said, “It is left for INEC to decide whether it will transfer the election results in Anambra or not.\nHe said he was confident that the same members of IPOB would also change their minds, since high level negotiations had begun to dissuade IPOB members of their current position.\nReacting to the recent defection of party members from APGA to other political parties in Anambra State, Adinuba said the defection would not in anyway affect the unity and strength of APGA in Anambra State."
  },
  {
    "headline": "News in Photographs: Osinbajo Chairs FEC Meeting",
    "summarized_story": "By Deji ElumoyeThe weekly Federal Executive Council (FEC) meeting is holding at the State House, Abuja with Vice-President Yemi Osinbajo presiding.\nThe virtual meeting is holding at the conference room of the First Lady’s office with Osinbajo standing in for President Muhammadu Buhari who is attending the 5th Edition of Future Investment Initiative Summit holding in Riyadh, Saudi Arabia.\nAmong those physically attending the meeting are the Secretary to Government of the Federation, Boss Mustapha; Ministers of Information and Culture, Lai Mohammed; Attorney General of the Federation and Minister of Justice, Abubakar Malami; Finance, Budget and National Planning, Zaineb Ahmed; Works and Housing, Babatunde Fashola; Aviation, Hadi Sirika; and Power, Abubakar Aliyu.\nOther ministers, as well as the Head of the Civil Service of the Federation, Folashade Yemi-Esan, are attending virtually from their various offices in Abuja.\nSee ImagesShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Igboho's Witch Doctor Arrested By Nigeria's Secret Police, DSS 3 Months Ago, His Whereabouts Unknown— Mother",
    "summarized_story": "The aggrieved mother said since her son was arrested three months ago by men perceived to be from the office of the DSS, no one has heard from him.\nShe, however, expressed surprise that he could be arrested simply because he is a herbalist 'spiritually strengthening' Sunday Igboho.\nSpeaking on Dada's disappearance, Aderonke Apalara, the sister-in-law said officers in mufti arrested Arifanlajogun.\nHe, however, advised the family to report the incident at the police station nearest to them.\nAlso, the DSS office in Ekiti stated that it could not comment on the issue but advised the family to reach out to the DSS office in Abuja."
  },
  {
    "headline": "Igboho's Witch Doctor Arrested By Nigeria's Secret Police, DSS 3 Months Ago, His Whereabouts Unknown— Mother",
    "summarized_story": "The aggrieved mother said since her son was arrested three months ago by men perceived to be from the office of the DSS, no one has heard from him.\nShe, however, expressed surprise that he could be arrested simply because he is a herbalist 'spiritually strengthening' Sunday Igboho.\nSpeaking on Dada's disappearance, Aderonke Apalara, the sister-in-law said officers in mufti arrested Arifanlajogun.\nHe, however, advised the family to report the incident at the police station nearest to them.\nAlso, the DSS office in Ekiti stated that it could not comment on the issue but advised the family to reach out to the DSS office in Abuja."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "Sources: Gunmen ask troops to vacate Plateau community ahead of planned attack",
    "summarized_story": "Gunmen have asked troops of the Nigerian army to vacate their post around a village in Miango, Bassa LGA, Plateau state.\nAdvertisementA company of soldiers was recently deployed to the area, following reported attacks on the villagers by gunmen.\n“Just a few days ago, the villagers brought a note from the attackers, asking the troops to leave that location so that they could attack.\nAdvertisementOne of the leaders of the attackers, sources said, was invited for a dialogue when some farmers were killed on their farmlands.\n“We made a call through, and an agreement was reached that they won’t attack the villagers again."
  },
  {
    "headline": "Sources: Gunmen ask troops to vacate Plateau community ahead of planned attack",
    "summarized_story": "Gunmen have asked troops of the Nigerian army to vacate their post around a village in Miango, Bassa LGA, Plateau state.\nAdvertisementA company of soldiers was recently deployed to the area, following reported attacks on the villagers by gunmen.\n“Just a few days ago, the villagers brought a note from the attackers, asking the troops to leave that location so that they could attack.\nAdvertisementOne of the leaders of the attackers, sources said, was invited for a dialogue when some farmers were killed on their farmlands.\n“We made a call through, and an agreement was reached that they won’t attack the villagers again."
  },
  {
    "headline": "INEC: Anambra guber poll more expensive than Edo, Ondo",
    "summarized_story": "The Independent National Electoral Commission (INEC) says the amount expended on the rehabilitation of its burnt office and materials is the reason for the high cost of the Anambra gubernatorial election.\nAdvertisementOn May 23, gunmen burnt the commission’s office in Awka, Anambra state, and also destroyed some sensitive and non-sensitive materials.\nAdvertisementHe said the electoral commission had to replace 326 generating sets, rebuild the facility where electoral materials are stored, and also replaced non-sensitive materials.\nAlthough he was unable to disclose the amount expended on the Anambra election, he said it is costlier than the Edo and Ondo gubernatorial elections.\n“We also had to rebuild our stores, where we normally store non-sensitive materials."
  },
  {
    "headline": "INEC: Anambra guber poll more expensive than Edo, Ondo",
    "summarized_story": "The Independent National Electoral Commission (INEC) says the amount expended on the rehabilitation of its burnt office and materials is the reason for the high cost of the Anambra gubernatorial election.\nAdvertisementOn May 23, gunmen burnt the commission’s office in Awka, Anambra state, and also destroyed some sensitive and non-sensitive materials.\nAdvertisementHe said the electoral commission had to replace 326 generating sets, rebuild the facility where electoral materials are stored, and also replaced non-sensitive materials.\nAlthough he was unable to disclose the amount expended on the Anambra election, he said it is costlier than the Edo and Ondo gubernatorial elections.\n“We also had to rebuild our stores, where we normally store non-sensitive materials."
  },
  {
    "headline": "'22bn scam': Court bars banks from releasing funds to Imagine Global founders",
    "summarized_story": "A federal high court in sitting at Osborne, Ikoyi, has restrained about 21 commercial banks in Nigeria from releasing funds to Imagine Global Holding Company Limited, Imagine Global Solutions Limited and its owners, Bamise and Elizabeth Ajetunmobi, over an alleged N22 billion scam.\nAdvertisementThe banks are Guaranty Trust Bank, Access Bank, Citi Bank Nigeria, Ecobank Nigeria, Fidelity Bank, First Bank, First City Monument Bank, Globus Bank, Heritage Bank, Jaiz Bank, Keystone Bank, Polaris Bank, Providus Bank, Stanbic IBTC Bank, Standard Chartered Bank, Sterling Bank, Union Bank, United Bank For Africa, Unity Bank, Wema Bank and Zenith Bank.\nAccording to the motion, the N11,795 billion was the outstanding investments and returns accruing to the claimants/applicants from the defendants.\nAccording to a statement on its website, Imagine Global Solutions Limited (Imagine Lenders) claimed that it is licensed and duly registered to operate as a microfinance institution in Nigeria.\nA claim TheCable found to be misleading as the company was not listed among licenced microfinance institutions by the Central Bank of Nigeria (CBN)."
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "Building a food supply operating system: the Vendease story",
    "summarized_story": "There are a lot of fragmented moving parts in running procurement for businesses in Africa, especially small food businesses.\nFood businesses are mostly vulnerable to substandard goods, fluctuating pricing system, expensive middlemen, wastage of productive time while restocking, and unreliable logistics.\nThey all vented and, as usual, discussed the problem for a while, asking what if they could do something to help small food businesses like this to scale.\nPivoting into a more sustainable systemThe initial idea was simple: enable food businesses to get their regular supply at the quality and price they wanted.\nVendease doesn’t just allow food businesses place orders for food supplies and track them; they can also manage inventory, track expenses and gain access to credit facilities."
  },
  {
    "headline": "Africa eShop, DHL’s online retail service, is shutting down this month",
    "summarized_story": "After two years of operation, DHL Africa is shutting down its pan-African online retail platform, e-Shop, at the end of the month.\nSorry for any inconvenience this may have caused,” a message on the Africa eShop website reads.\nTechCabal reached out to DHL Africa for answers but has yet to receive a response at the time of publication.\n— DHL Africa (@DHLAfrica) October 21, 2021A white-labeled productWhile the Africa eShop appears to be a standalone e-commerce platform owned by DHL, that isn’t the case.\nBeing a white-labeled product, DHL’s Africa eShop website and offerings are very similar to that of MallforAfrica."
  },
  {
    "headline": "How Koa is helping Kenyans build and manage wealth",
    "summarized_story": "After doing that for a while, she joined MEST Africa.\nAfter leaving MEST Africa, the duo forayed into different businesses but kept in touch and would always meet up whenever they were in the same city.\nSo, Koa is killing two birds with one stone by holding its users’ money in a money market through a partnership with Britam, an asset manager in the Kenyan market.\nOn Koa, users earn up to 10% interest on their money annually, depending on market conditions.\nSo are Koa users aware that their money is being invested in a money market?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Monday November 1, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Stitch’s Nigeria expansion, Africa’s military coups, RecoMed’s $1.5m funding, and Union45’s $3m seed",
    "summarized_story": "Source: Supplied,South African API fintech startup, Stitch has today announced its expansion into Nigeria and a $2M seed extension, with investment from Future Africa and Norrsken Foundation, among others.\nStitch announced an initial $4 million seed in February when it came out of stealth.\nThe startup launched officially in February 2021 with an API that provides software companies with identity verification tools and access to users’ financial data.\nWhile fintech startups still get a significant chunk of African funding, healthtech startups seem to be attracting some serious cash.\nApply hereCall for climate-focused startups: Africa ClimAccelerator Applications open."
  },
  {
    "headline": "Naira’s digitisation via the eNaira: Beyond financial inclusion",
    "summarized_story": "Share this article:Introduction: Naira’s digitisation (the eNaira)A very recent accomplishment of the Central Bank of Nigeria (CBN) is the issuance of the new Central Bank Digital Currency (CBDC), the eNaira.\nConsequently, financial institutions have the responsibility to onboard their customers and integrate the eNaira wallet feature into their digital banking channels.\nIt is hoped that the design model behind the eNaira can permit coordination amongst peers once mCBDCs models become operational.\nAs already stated, the DLT solution for cross-border and FX funds transfer has huge potentials for simplifying cross-border payment with great savings on time and money.\nConclusionNigeria has taken another bold step towards trade finance digitisation by introducing the eNaira; however, the journey has just begun."
  },
  {
    "headline": "Relocation of Central Hospital: Obaseki committed to providing quality healthcare for all Edo residents – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has reiterated its commitment to the provision of quality healthcare services to Edo people, noting that ongoing reforms in the health sector is aimed at redesigning the healthcare system, making the state a medical hub.\nAddressing journalists in Benin City, in response to the recent media attacks by the Edo State Chapter of the All Progressives Congress (APC) on the planned structural reforms to be carried out by the Edo State Government within the premises of the Edo Central Hospital, Edo State Commissioner for Communication and Orientation, Hon.\nAndrew Adaze Emwanta JP, said the healthcare sector under the Governor Godwin Obaseki-led administration has received a tremendous boost within the last five years.\nOn September 19 last year, Edo people gave the Governor a mandate under the Making Edo Great again (MEGA) Manifesto to develop Edo State.\nSo, there is no retreat or surrender on the developmental mandate freely given by Edo people to our beloved Governor, for which the health sector is not an exception.”..."
  },
  {
    "headline": "FoEN Sensitizes COP26 Delegates On Climate Change Liabilities, Payments – Nigerian Observer",
    "summarized_story": "Reiterating this point, he said,“According to the Intergovernmental Panel on Climate Change report, climate change impact will continue to be on the rise and with growing intensity hence the need for urgency.\nFirstly, the pledge to mobilizing US$100 billion annually by 2020-2025 as funds to addressing climate change actions stands at about 30% and is nowhere near its mark.\nDeveloping countries should redouble their stand to demand for a fair, just, and equitable energy transition and the climate finance to address climate change.\nAccording to a recent study, the world’s leading polluters have racked up a US$10 trillion carbon debt for carbon dioxide emissions since 1990.\nFurther, the impact of climate change and Covid-19 pandemic and their impacts on escalating the debt service burden on African states is horrendous."
  },
  {
    "headline": "Obaseki urges innovations to conserve, safeguard audio-visual heritage – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge in commemoration of the World Day for Audiovisual Heritage, marked every October 27 by the United Nations Scientific, Educational and Cultural Organisation (UNESCO), and other sister organisations.\nThe governor, who restated the need to conserve and safeguard valuable audiovisual resources for future generations, reassured that the museum project in the state will serve as a critical institution to preserve the audio-visual heritage of Edo people.\nConserving this heritage and ensuring it remains accessible to the public and future generations is a vital goal for all memory institutions, as well as the public at large.\n“The World Day for Audiovisual Heritage (WDAH) provides an occasion to raise general awareness of the need to take urgent measures and to acknowledge the importance of audiovisual documents.\nIt serves as an opportunity for member states to evaluate their performance with respect to implementing the 2015 Recommendation Concerning the Preservation of, and Access to, Documentary Heritage, Including in Digital Form.”..."
  },
  {
    "headline": "Obaseki felicitates with Dan Orbih at 60 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has congratulated Chief Dan Orbih, on his 60th birthday.\nThe governor, in a statement, wished Orbih many more years of celebration in good health and happiness, praying that God grants him wisdom and grace to continue to serve our great nation, Nigeria.\nObaseki noted, “On behalf of the government and people of Edo State, I congratulate you, Chief Dan Osi Orbih as you join the sexagenarians.\nI wish you many more years of impactful service to our dear country.”..."
  },
  {
    "headline": "West African journalists, activists CSOs storm Abuja, brainstorm on fake news challenges",
    "summarized_story": "Some journalists, activists and civil society organisations across the West African region are currently in Abuja to discuss and proffer solutions to the menace of fake news and mis/disinformation gaining a foothold in their countries.\nFake news is currently a major challenge in Nigeria and other nations in Africa, especially with the increasing access to social media and the emergence of ‘citizen journalists’.\n“The creation of a network of media and governance oriented CSOs working on these issues, that will continue to share best practices and learnings.\nSait Matty Jaw, Executive Director, Center for Research and Policy Development (CRPD), The Gambia; Yeama Sarah Thompson, Initiatives for Media Development (IMdev), Sierra Leone; Fiacre Kakpo, Togo First, Togo and Deji Abdulwahab, News Agency of Nigeria.\nThere will also be country presentations tagged: Context, Experiences and Responses to Fake News, where participants will discuss country-specific experiences on tackling fake news."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Transcorp Plc generates N32.33bn revenue in Q3, 2021",
    "summarized_story": "Transcorp Plc, generated N32.33 billion revenue in the third quarter of 2021, ended September 30, an a increase of 66.44 percent from the corresponding quarter of 2020.\n(+85.87% YoY)Net Finance Cost of N4.11 billion was recorded.\n(-16.55% YoY)Profit before tax of N7.08 billion was recorded during the period.\nProfit for the period stood at N6.96billion (+619.54%)Total assets during the period stood at N355.55 billion.\n(+17.35 Bn YtD)Earnings per share of 9.66 kobo Vs –0.63 kobo YoY."
  },
  {
    "headline": "CAP Plc declares N3.41bn revenue in Q3 2021",
    "summarized_story": "CAP Plc has declared N3.41bn in its unaudited third quarter 2021 financial results ended 30th of September 2021, a increase of 36.46 percent from the corresponding quarter of 2020.\nFurther highlights of the results are as follows:Cost of sales stood at N2.45 billion.\n(-51.84% YoY)Profit before tax of N153.14 million was recorded during the period.\nProfit for the period stood at N104.14million (-67.48%)Total assets during the period stood at N10.33 billion.\n(+1.81 Bn YtD)Earnings per share of 13 kobo Vs 46 kobo YoY."
  },
  {
    "headline": "NNPC gets FEC’s approval to spend N621.2bn on 21 federal roads",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has gotten the nod of Federal Executive Council (FEC), to construct 21 federal roads across the six-geopolitical zones of the country.\nAccording to the minister, it was a strategic intervention under the Federal Government Road Infrastructure and Refreshment Tax Credit Scheme.\n“The second memorandum relates to the road infrastructure tax credit scheme.\nSo NNPC has identified 21 roads that it wants to deploy.\n“Out of those 21 roads, nine are in North Central, particularly Niger state."
  },
  {
    "headline": "FBN Holdings says Hassan-Odukale is its single-largest shareholder",
    "summarized_story": "FBN Holdings Plc, the holding company of First Bank Nigeria Limited, has said Mr. Tunde Hassan-Odukale as the single-largest shareholder.\nThe company made the disclosure In response to the Nigerian Exchange Limited (NGX) which has instructed it to issue an announcement providing additional information on the shareholding status of Mr Hassan-Odukale and his related parties, FBN Holdings.\n“The first part of the shareholding classification (4.16%), are shares held directly and indirectly by Mr. Tunde Hassan-Odukale.\nThe second part of the shareholding classification (1.20%), are shares ascribed to Mr. Tunde Hassan-Odukale due to his influence and having significant control,” FBNH said in the letter signed by the company secretary, Seye Kosoko.\nThe bank therefore noted that Mr Hassan-Odukale holds a total 5.36 per cent shares while Mr Olufemi Otedola holds 1,808,551,625 shares representing 5.04 per cent, thus affirmed that Mr Hassan-Odukale is the single-largest shareholde"
  },
  {
    "headline": "Tensed Atmosphere In Rivers As Appeal Court Decides On PDP Convention Today",
    "summarized_story": "Tensed atmosphere pervades Port Harcourt, Rivers State capital on Thursday as the Court of Appeal is set to decide on the legality or otherwise of this Saturday’s national convention of the Peoples Democratic Party (PDP).\nAlso, there is tight security within and around the premises of the Court of Appeal in Port Harcourt.\nThe Court of Appeal is located along Moscow Road in the Old GRA of Port Harcourt, and it shares same fence with the Rivers State Police Command headquarters.\nSeveral PDP chieftains from across the 23 local government areas of the state, including the Chief of Staff, Government House, Hon.\nADVERTISEMENTA panel of three justices of the Court of Appeal, led by Hon."
  },
  {
    "headline": "Tensed Atmosphere In Rivers As Appeal Court Decides On PDP Convention Today",
    "summarized_story": "Tensed atmosphere pervades Port Harcourt, Rivers State capital on Thursday as the Court of Appeal is set to decide on the legality or otherwise of this Saturday’s national convention of the Peoples Democratic Party (PDP).\nAlso, there is tight security within and around the premises of the Court of Appeal in Port Harcourt.\nThe Court of Appeal is located along Moscow Road in the Old GRA of Port Harcourt, and it shares same fence with the Rivers State Police Command headquarters.\nSeveral PDP chieftains from across the 23 local government areas of the state, including the Chief of Staff, Government House, Hon.\nADVERTISEMENTA panel of three justices of the Court of Appeal, led by Hon."
  },
  {
    "headline": "2 Firms Lift Health Services In Nigeria",
    "summarized_story": "Two health outfits, GE Healthcare and Duchess International Hospital, have pulled resources together to provide better healthcare services for Nigerians.\nTo make the partnership work, GE Healthcare, has delivered and installed equipment in Duchess International Hospital to improve healthcare services in Nigeria.\nGeneral manager of GE Healthcare in Sub-Saharan Africa, Eyong Ebai, said, “Over the years, GE Healthcare has been supportive with providing standard healthcare infrastructure in Nigeria.\nThe Chairman of the Duchess Hospital Board of Directors, Dr Adeyemi Onabowale said the commissioning of the hospital has raised the bar for health care standards in Nigeria, where the best in hospital care will be delivered together with world-class hospitality service.\nAll services at the Duchess International Hospital are supported by four specialised in-house pharmacies,” he added."
  },
  {
    "headline": "2 Firms Lift Health Services In Nigeria",
    "summarized_story": "Two health outfits, GE Healthcare and Duchess International Hospital, have pulled resources together to provide better healthcare services for Nigerians.\nTo make the partnership work, GE Healthcare, has delivered and installed equipment in Duchess International Hospital to improve healthcare services in Nigeria.\nGeneral manager of GE Healthcare in Sub-Saharan Africa, Eyong Ebai, said, “Over the years, GE Healthcare has been supportive with providing standard healthcare infrastructure in Nigeria.\nThe Chairman of the Duchess Hospital Board of Directors, Dr Adeyemi Onabowale said the commissioning of the hospital has raised the bar for health care standards in Nigeria, where the best in hospital care will be delivered together with world-class hospitality service.\nAll services at the Duchess International Hospital are supported by four specialised in-house pharmacies,” he added."
  },
  {
    "headline": "Congress: No Petition, Complaint Received In Niger APC, Says Appeal C’ttee Chair",
    "summarized_story": "The chairman of the State Congress Appeal Committee in Niger state, Chief Ray Morphy, has said that his committee did not recieve petition or complaint regarding the recently conducted state congress of the ruling All Progressives Congress (APC) in Niger state.\nThe national secretariat of APC had set up appeal panel for each state to hear the grievances of aggrieved party members over the recently conducted congresses.\nIn a statement released to newsmen Wednesday in Abuja, Chief Morphy said: “From ward congresses through local government, up to state level, the APC congresses in Niger were splendid.\n“As the chairman of the Appeal Committee for the three levels of Congress, I can confirm that we received no petition or complaint.\n“Our sittings as an Appeal Committee was also in the open."
  },
  {
    "headline": "Buhari prays for everlasting peace in Nigeria",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari continues his visit to Saudi Arabia with a brief stopover at Madinah where he observed his evening prayers and engaged in intense prayers, along with his entourage for the return of peace and security all over Nigeria and the world at large.\nPresident Buhari and the delegation prayed for the well-being of the nation and its people and for the full restoration of peace and security in Nigerian and around the globe.\nPrayers for the economy, ravaged by the pandemic to fully recover for the benefit of the nation and its people were also offered.\nThe President will later on in the evening proceed to Makkah for the performance of the Umrah (lesser Hajj).\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari prays for everlasting peace in Nigeria",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari continues his visit to Saudi Arabia with a brief stopover at Madinah where he observed his evening prayers and engaged in intense prayers, along with his entourage for the return of peace and security all over Nigeria and the world at large.\nPresident Buhari and the delegation prayed for the well-being of the nation and its people and for the full restoration of peace and security in Nigerian and around the globe.\nPrayers for the economy, ravaged by the pandemic to fully recover for the benefit of the nation and its people were also offered.\nThe President will later on in the evening proceed to Makkah for the performance of the Umrah (lesser Hajj).\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "COVID-19: Sanwo-Olu launches mass vaccination programme, targets four million Lagosians before year end",
    "summarized_story": "By GBENGA ADEOLA‘Fourth Wave of Pandemic Imminent’There is possibility of the fourth wave of Coronavirus (COVID-19) as the Yuletide approaches, Lagos State Government declared on Wednesday.\nGovernor Babajide Sanwo-Olu, however, launched a mass vaccination campaign as part of the strategies to stave off re-emergence of the viral infection.\nThe objective is aimed at vaccinating four million residents in Lagos before the end of the year.\nThe Governor believed the mass vaccination campaign would help bolster the State’s response to the emerging threat posed by the pandemic.\n4 million Lagosians Vaccinated Against COVID-19’ to target the full vaccination of 4 million Lagos residents before the end of December 2021."
  },
  {
    "headline": "COVID-19: Sanwo-Olu launches mass vaccination programme, targets four million Lagosians before year end",
    "summarized_story": "By GBENGA ADEOLA‘Fourth Wave of Pandemic Imminent’There is possibility of the fourth wave of Coronavirus (COVID-19) as the Yuletide approaches, Lagos State Government declared on Wednesday.\nGovernor Babajide Sanwo-Olu, however, launched a mass vaccination campaign as part of the strategies to stave off re-emergence of the viral infection.\nThe objective is aimed at vaccinating four million residents in Lagos before the end of the year.\nThe Governor believed the mass vaccination campaign would help bolster the State’s response to the emerging threat posed by the pandemic.\n4 million Lagosians Vaccinated Against COVID-19’ to target the full vaccination of 4 million Lagos residents before the end of December 2021."
  },
  {
    "headline": "Osinbajo: Nigeria’s Population Grows By 5 Million Annually",
    "summarized_story": "“So, there are huge revolutionary changes that need to be made and I believe that they are entirely possible.\nThe construction sector went down by almost 40 per cent, and has returned to a much more modest positive,” Prof. Osinbajo explained.\nMy take is that this country is one that is waiting to happen and it will happen.\n“I believe very strongly that this country affords us the opportunity and the space to be able to achieve great things.\n“It is important to note that basic education – primary and secondary education are under the control of the states."
  },
  {
    "headline": "Tinubu Is Capable Of Leading Nigeria — South-West Governors",
    "summarized_story": "He said the governors in the region believe in the leadership of the former Lagos State governor.\nAkeredolu explained that they decided to pay the APC National Leader a visit after the South-West Governors’ Forum meeting, which took place earlier in Lagos.\nSpeaking with newsmen after the visit, he said: “We held the Southwest Governors’ Forum meeting.\n“He is not only the leader of the Southwest but also the National leader of the APC in Nigeria.\n“But we in the Southwest first lay claim to him as our leader,” Governor Akeredolu said."
  },
  {
    "headline": "Oyo jailbreak: Correctional Service releases names, photos of escapees",
    "summarized_story": "The Nigerian Correctional Service, on Wednesday, released the names and images of 122 inmates who escaped from the Abolongo Custodial Centre in Oyo State.\nThe inmates had escaped the correctional centre on Friday, October 22, 2021, after unidentified gunmen attacked the facility.\nThe Federal Government had enlisted the help of Interpol in recapturing the fleeing inmates when the Minister of Interior, Rauf Aregbesola visited the facility after the incident.\nAs of Monday, October 24, 463 inmates had been recaptured with more than 300 still at large.\nHowever, it is unclear if the names and images released are the remaining inmates who are still at large."
  },
  {
    "headline": "E-Naira Removed From Google Play Store After Series Of Complaints, Poor Rating",
    "summarized_story": "The E-Naira speed wallet has disappeared from the Google Play Store barely 48 hours after its launch.\nThe digital currency has two applications, which are eNaira speed wallet and eNaira merchant wallet.\nHowever, the eNaira merchant wallet, which is designed for businesses, is still running and has over 10,000 downloads on the Google Play Store made available to Android users.\nChecks on the Apple App Store showed that the eNaira speed wallet was still active but had been upgraded.\nTo access the eNaira, users have to download the ‘speed wallet’, which allows them to conduct transactions with speed and ease."
  },
  {
    "headline": "Breaking: Plateau assembly impeaches speaker, Sanda takes over",
    "summarized_story": "The Plateau State House of Assemby Speaker, Abok Nuhu Ayuba, has been impeached in the early hours of Thursday.\nThe house immediately elected Hon.\nYakubu Sanda as the new speaker.\nDetails loading…"
  },
  {
    "headline": "Amidst outcry, FEC okays N621bn NNPC fund to fix 21 roads, Niger tops with 9 projects",
    "summarized_story": "007 of 2019 cited as the Companies Income Tax (Road Infrastructure Development and Refurbishment Investment Tax Credit Scheme) Order, 2019.\nSo NNPC has identified 21 roads that it wants to deploy.\n“So, NNPC has sought and council has approved today that NNPC deployed tax resources to 21 roads covering the total distance of 1,804.6 kilometers across the six geopolitical zones.\n“Out of those 21 roads, nine are in North-central, particularly Niger state.\n“So, as I said, it is a total of 21 roads."
  },
  {
    "headline": "Anxiety as survey reveals N200% bread price hike December",
    "summarized_story": "Prices of bread in Enugu state may rise by 200 per cent before the end of the year, a survey by the News Agency of Nigeria (NAN) has revealed.\nAlready, price of bread has doubled since August through to October 2021, forcing the product out of reach of many families and lovers of bread.\nA survey conducted by NAN Wednesday in Enugu showed the price may likely jump further in November and December, if not controlled.\nA baker, Mr. Peter Ohajiuba said he was tired of the bread business due to the uncontrollable costs associated with it.\nHe added that if nothing was done before October ending, the unit price of bread would double."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Embracing NYSC trust fund will complement federal government’s efforts at lifting 100 million Nigerians out of poverty – CSO -NigPilot",
    "summarized_story": "An indigenous Civil Society Organisation, The Abuja Grassroots Advocacy Projects has drummed support for the establishment of a Trust Fund for the NYSC.\nAccording to the Abuja Grassroots, the establishment of the fund will effectively complement the Federal Government’s efforts in moving 100 million Nigerians out of poverty.\nHe also commended the Scheme for providing a platform that would engender a greater appreciation of the imperative for the NYSC Trust Fund and generate ideas that would Facilitate its actualization.\nAccording to him, resolutions reached after the Symposium had the capacity to change the narratives of not only the NYSC Scheme but the teeming youths.\nHe called on the NYSC Management to sustain and expand the scope of advocacy for the establishment of the fund."
  },
  {
    "headline": "Onyema urges FG to review salaries of NCAA staff -NigPilot",
    "summarized_story": "Chief Executive Officer/Chairman of Air Peace, Allen Onyema, has called on the Federal Government to upwardly review the salaries of staff of Nigerian Civil Aviation Authority, NCAA.\nThe Air Peace boss made the call at the 2021 Brazil-Nigeria Aviation and Defence Trade Forum 2021 organized by the Embassy of Brazil recently in Abuja.\nHe stated that the agency is not able to poach top talents in the industry because its salary structure leaves much to be desired, adding that the Federal Government should remove the NCAA from the civil service salary structure.\n“Their salaries should be upwardly reviewed to match the airlines’ salary structure, as nobody wants to go there to work but they (current staff) are doing their best, which is very commendable.\nThis is a patriotic call,” a statement made available by Spokesman of the Airline, Stanley Olisa, quoted Onyema as saying."
  },
  {
    "headline": "NYSC boss urges Corps Members to embrace Martial Arts training -NigPilot",
    "summarized_story": "“Dear patriotic Corps Members, the NYSC in the last few years recorded a paradigm shift in the Orientation Course content, aligning it with the prevailing security and economic realities.\nThe prevailing security threat which is a global issue, as well as the shrinkage of white-collar jobs made this phenomenal change germane and very compelling.\n“This shift witnessed the introduction of Martial Arts training into the course content so as to equip Corps Members with basic self-defense skills.\n“In an attempt to stem this tide, the Scheme introduced Skill Acquisition and Entrepreneurship Development programme into the Orientation Course content.\nHe advised the Corps Members to utilise the skill acquisition and other programmes maximally in order to contribute to the nation building."
  },
  {
    "headline": "Insecurity: Over 12m children traumatised, afraid of going to school- Buhari -NigPilot",
    "summarized_story": "President Muhammadu Buhari has said more than 12 million children are currently children traumatized and afraid of going to school especially girl child.\nRepresented by his Chief of Staff, Agboola Ibrahim Gambari, Buhari shared a report released by S.B Morgen which revealed that a total of 1,462 learners and education personnel were abducted between 1st December 2019and September 2021 in school-related abductions as well as home and community-related abductions of Learners and teachers.\n” It is no longer news that at will, bandits, kidnappers, and terrorists invade oureducational facilities to abduct the learners in large numbers.\nSome places that have been hit by this menace include Chibok, Dapchi, Buni Yadi, Afaka, kagora, and Jangebein Borno, Yobe, Kaduna, Niger and Zamfara states respectively.\n” It is disheartening tonote that even when the abducted students have released the trauma of the incidences remain long in their minds hence the plan to have teachers trained on psycho-social support,” he said."
  },
  {
    "headline": "Lawmakers Impeach Plateau House Of Assemby Speaker",
    "summarized_story": "The Speaker of the Plateau State House of Assembly, Nuhu Abok, has been impeached by eight members of the legislative arm of the government.\nThe member representing Pengana Constituency, Yakubu Sanda, was named as the new Speaker.\nHe was removed in the early hours of Thursday by the lawmakers from the ruling All Progressives Congress (APC) who were escorted into the chambers amidst tight security.\nREAD ALSO: FG Cannot Start Paris Club Deduction Now, Says FayemiPoliticians Fuelling Crisis In Plateau, Says Governor LalongMembers of the opposition Peoples Democratic Party (PDP) were, however, prevented from entering the Assembly complex.\nIn the meantime, the House of Assembly premises and adjoining roads have been taken over by security personnel."
  },
  {
    "headline": "Senate Moves To Increase Daily Cost Of Feeding Prisoners",
    "summarized_story": "﻿The Senate Committee on Interior has moved to increase the daily feeding cost of inmates in Nigerian correctional facilities.\nREAD ALSO: NDLEA Considers Six Standard Rehab Centres To Tackle Drug AddictionThe committee members, therefore, expressed concern about the welfare of inmates specifically, their feeding.\nIn response, the Comptroller General of NCS said that the current N450 feeding cost for each of the prisoners on daily basis has been increased to N750 as proposed in the 2022 budget estimates.\nNot satisfied, the Committee Chairman, Senator Kashim Shettima and members of the committee frowned at the N750 daily feeding cost.\nThe committee also stressed the need for renovation of correctional centres across the country to reduce incessant cases of jailbreak."
  },
  {
    "headline": "Cambridge University Returns Looted Benin Bronze Artefact ‘Okukor’ To Nigeria",
    "summarized_story": "Nigeria has received a Benin bronze artefact from the University of Cambridge, more than a hundred years after it was taken from the country.\nTijani, who spoke during the ceremony to hand over the treasure, stated that it was the first time a UK institution would give back a Benin bronze.\nThe bronze was taken from the kingdom of Benin — now part of Nigeria — in 1897 when Britain had a foothold on the African continent.\nCambridge’s Jesus College removed the cockerel from public display in 2016 after a campaign by students arguing it was a symbol of Britain’s colonial past.\nTijani is expected to travel to Scotland to receive another Benin bronze from the University of Aberdeen on Thursday."
  },
  {
    "headline": "NNPC To Reconstruct 21 Federal Roads At N621.23bn – FEC",
    "summarized_story": "The Federal Executive Council (FEC) has approved the reconstruction of 21 roads covering a total distance of 1,804.6 kilometres across the six geo-political zones.\nThese projects are to be undertaken by the Nigerian National Petroleum Corporation (NNPC) through the deployment of its own tax liabilities.\n“So, NNPC has identified 21 roads that it wants to deploy.\nNNPC has sought and the council has approved today that NNPC deploys tax resources to 21 roads, covering a total distance of 1,804.6 kilometres across the six geopolitical zones.\n“Out of those 21 roads, nine are in North Central, particularly Niger state."
  },
  {
    "headline": "Saudi Arabia Visit: Buhari Prays For Peace In Nigeria",
    "summarized_story": "President Muhammadu Buhari has continued his visit to Saudi Arabia with a brief stopover at Madinah where he engaged in prayers, alongside his entourage for peace and security in Nigeria and the world at large.\nThe Senior Special Assistant to the President on Media and Publicity, Garba Shehu said this in a statement on Wednesday.\nPrayers for the economy, ravaged by the pandemic to fully recover for the benefit of the nation and its people were also offered,” he added.\nThe President will later proceed to Makkah for the performance of the Umrah (lesser Hajj).\nBuhai is in Saudi Arabia for the Future Investment Initiative Institute conference focused on the theme, “Invest in Humanity.”"
  },
  {
    "headline": "FEC approves NNPC's request to construct 21 roads across 6 geo-political zones",
    "summarized_story": "The federal executive council has approved a request of the Nigeria National petroleum corporation to deploy tax resources for the construction of twenty one roads across the country.\nThe federal government believes this will put an end to issues of financing road construction that often prolongs the execution of construction contracts in the country.\nThis is in accordance with executive order 7 road infrastructure tax credit scheme signed by president Buhari that allows private sector operators to identify infrastructure such as roads which they would construct using their tax remittance.\nThe minister of Works and housing Babatunde Raji Fashola disclosed that this is a strategic intervention by the government that will also take off the burden of funding major road projects from the national budget.\nThe federal executive council also approved the request of the ministry of power for the procurement and supply of two transformers to the transmission company of Nigeria."
  },
  {
    "headline": "Money laundering allegations: Forensic witness presents 51,933-page analysis of Naira Marley's iPhone",
    "summarized_story": "The prosecution on Wednesday, displayed before a Federal High Court Lagos, virtual projection of a Compact Disc (CD) with a 51,933-page analysis of the iPhone of musician Azeez Fashola a.k.a Naira Marley.\nThe court had accordingly, granted him bail in the sum of two million naira, with two sureties in like sum.\nThe trial suffered a setback at the start of the second prosecution witness’ evidence due to the covid-19 lockdown in 2020 and the judiciary workers strike.\nFielding questions from the defense counsel, the witness confirmed to the court that he had confined his analysis within the compass of his forensic reports.\nhe told the court that the defendant provided the password to the investigating operatives who consequently, transmitted same to him for his analysis."
  },
  {
    "headline": "Suspected bandits kill seven, cart away over two thousand livestock in Zamfara community",
    "summarized_story": "Suspected armed bandits have killed seven persons and rustled over two thousand livestock in Zamfara state.\nThe gunmen also burgled shops, carted away food stuff and other valuables belonging to the localsThe Community affected is Yanbuki village in Zurmi local government area of the stateTVC NEWS gathered that the gunmen stormed the village in their numbers Tuesday night and opened fire on the locals, causing many to receive varying degrees of injury.\nHundreds of cows and over a thousand, five hundred sheep, among other animals, were rustled.\nCommunities in Zurmi local government have suffered attacks by gunmen in recent timesThis is the second time since the shutdown of telecommunication services and the ongoing onslaught against bandits that gunmen are invading Yanbuki Village.\nAttempts to contact the Zamfara police command for comment were unsuccessful since the command’s spokeswoman, Shehu Mohammed, was not responding to phone calls."
  },
  {
    "headline": "Oyo FOMWAN Condoles Aare Musulumi over Death of Wife -",
    "summarized_story": "The Federation of Muslim Women’s Associations in Nigeria, FOMWAN Oyo State chapter has commiserated the Aare Musulumi of Yorubaland, Edo and Delta Alhaji Daud Akinola, popularly called De-Damak over the death of one of his wives, Alhaja Alimat Funke Akinola.\nIn a condolence message issued in Ibadan, the Oyo FOMWAN Amirah, Alhaja (Dr) B.B Oloso described the death as painful and shocking.\n” The news of the death of Alhaja Alimat Funke Akinola, the wife of the Aare Musulumi of Yorubaland, Edo and Delta came to everyone this morning as a surprise.\nThe entire members of FOMWAN sympathize with Aare on this loss and could imagine the grief in his entire family at the moment .\nOyo FOMWAN Amirah used the medium to beseech Allah to uphold the entire family of the Aare Musulumi and give them the piety to bear the irreplaceable loss."
  },
  {
    "headline": "France Seizes British Trawler in Post-Brexit Row Over Fishing Rights",
    "summarized_story": "France seized a British trawler fishing in its territorial waters without a licence on Thursday and issued a warning to a second vessel in a dispute over access to fishing grounds after Brexit.\nMARITIME GENDARMESFrench maritime gendarmes made multiple checks on fishing vessels off the northern French port of Le Havre overnight, the Maritime Ministry said, as France steps up surveillance during negotiations.\nThe Marine Traffic app showed a British fishing vessel named Cornelis Gert Jan tied up in the port of Le Havre.\nThe French maritime patrol vessel Atos was moored behind it.\nBoth vessels set course for Le Havre at around 2000 CET (1800 GMT)."
  },
  {
    "headline": "Top US General Confirms ‘Very Concerning’ Chinese Hypersonic Weapons Test",
    "summarized_story": "The Pentagon has been at pains to avoid direct confirmation of the Chinese test this summer, first reported by the Financial Times, even as President Joe Biden and other officials have expressed general concerns about Chinese hypersonic weapons development.\n“What we saw was a very significant event of a test of a hypersonic weapon system.\nNuclear arms experts say China’s weapons test appeared to be designed to evade U.S. defenses in two ways.\nChina’s foreign ministry denied a weapons test.\nThe United States and Russia have both tested hypersonic weapons."
  },
  {
    "headline": "Barcelona Sack Koeman as Head Coach, Offer Role to Xavi",
    "summarized_story": "Barcelona have sacked Ronald Koeman as head coach following Wednesday’s defeat at Rayo Vallecano, while Goal can confirm the role has now been offered to club legend Xavi.\nThe loss left Barcelona in ninth place in the La Liga table, having won just four of their opening 10 league games.\n“FC Barcelona has dismissed Ronald Koeman tonight as coach of the first team,” a statement released by the club said.\nKoeman saw his side struggle in his first season in charge, but did manage to bring home one piece of silverware in the form of the Copa del Rey.\nThis offseason saw the club go through a major period of turmoil as its dire financial situation saw club legend Lionel Messi depart as a free agent after Barca were unable to re-sign him."
  },
  {
    "headline": "Gun Not Thoroughly Checked Before Alec Baldwin Fired Fatal Shot",
    "summarized_story": "Dave Halls, the film’s assistant director, handed the gun to Baldwin, telling the actor it was “cold” or safe.\n“He advised he should have checked all of them, but didn’t,” Halls told police, according to the affidavit.\nMendoza said the gun used by Baldwin was an Italian-made Pietta Long Colt revolver.\nBaldwin, 63, serves as a co-producer of “Rust,” a Western film set in 1880s Kansas.\nMendoza said Baldwin, Halls and Gutierrez all are cooperating with the investigation."
  },
  {
    "headline": "First Bank: Hassan-Odukale, Otedola Own 5.36% and 5.07%, Adenuga, Otudeko May Have Undisclosed Shares – Arise News",
    "summarized_story": "The holding company put Hassan-Odukale’s shareholding at 5.36 per cent and that of Otedola at 5.07 per cent.\nFBN Holdings disclosed this in response to enquiry by the Nigerian Exchange Limited (NGX).\nHowever, THISDAY checks revealed that the Chairman of Globacom, Chief Mike Adenuga and the Chairman of Honeywell Group, Oba Otudeko, might have some undisclosed shares.\nThis, it stated implied that Hassan-Odukale has total shareholdings (Direct and indirect) of 1,923,512,099 or 5.36 per cent in FBN Holdings.\nOn the other hand, it revealed that Otedola has 1,818,551,625 or 5.07per cent total shareholding (Direct and Indirect) in the financial institution."
  }
]