[
  {
    "headline": "Abba Kyari: NDLEA reveals more details on drug deal",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA, has revealed more details about the drug deal allegedly involving a suspended Deputy Commissioner of Police, Abba Kyari.\nIn a statement by its Director, Media & Advocacy, Femi Babafemi, the agency revealed what the Kyari told the NDLEA undercover officer.\nIn the statement titled, ’25kg cocaine probe: We Won’t Shield Anyone –NDLEA’, Babafemi disclosed how the “Abba Kyari-led gang” operates at airports.\nThe NDLEA spokesperson faulted the police claim that NDLEA received the drug dealers at the airport.\nYes, he will reveal those that are conveying it further, get snapshots of theirs without their knowledge and send to us (Abba Kyari’s team)."
  },
  {
    "headline": "Abba Kyari: Our officers not involved in 25kg cocaine deal, says NDLEA",
    "summarized_story": "The National Drug Law Enforcement Agency, on Wednesday, said that it has no reason to shield anyone who may be indicted in the course of the ongoing investigation of a 25kg cocaine deal involving a gang headed by DCP Abba Kyari.\nYou understand; one of the informants accompanied the goods to Ethiopia, one of the informants that give us information.\n“From Addis, it will be given to those to proceed further with it, he will get their snapshots without their knowledge.\nYes, he will reveal those that are conveying it further, get snapshots of theirs without their knowledge and send them to us (Abba Kyari’s team).\nSo, automatically my team will just be waiting, they will just see you and arrest you.”Responding to the question by NDLEA officers on whether his boys are usually stationed inside or outside the airport, Abba Kyari, Babafemi said, responded, “Yes, yes, some are outside while some are inside."
  },
  {
    "headline": "BREAKING: ECOWAS court dismisses FG’s application against SERAP’s suit",
    "summarized_story": "The ECOWAS Court has dismissed the application by the Federal Government seeking to stop the judgment in the Twitter ban case.\nThe court said the application is frivolous and lacking in merit.\nThe case is now adjourned to 10 May 2022 for judgment.\nDetails coming.\nVanguard News"
  },
  {
    "headline": "There are others like Abba Kyari in Police Force ― AIG Iwar (rtd)",
    "summarized_story": "A retired Assistant Inspector General of Police, AIG Austin Iwar has said that the arrest of Abba Kyari over the drug bust shows that there are many more Abba Kyaris in the Nigerian Police force system and there may be other officers committing even worse crimes.\nContinuing he said, “The NPF has legal and constitutional backing to carry out investigations on crime including drugs.\n“And for NDLEA to properly prosecute DCP Abba Kyari, in this drugs crime, the officer must be dismissed from the Nigerian Police force.\n“The Police is supposed to be like the Board of Directors that sits and supervises but that is non-existent.\nSo officers are left with little alternative than to scout for funds for doing the job”."
  },
  {
    "headline": "BREAKING: APC faction protests against Osun CP, demands his redeployment",
    "summarized_story": "Shina Abubakar, OsogboMembers of the All Progressives Congress, APC, loyal to Ogbeni Rauf Aregbesola, The Minister of Interior, on Wednesday protested against the alleged incessant arrest of its members by the police in the state.\nThe faction, led by the Chairman, Rasaq Salinsile protested to the state command headquarters, demanding the redeployment of the police Commissioner, Olawale Olokode.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "Butchers decry low patronage at Jos Abattoir",
    "summarized_story": "Mr. Samson Okafor, chairman, Butchers Association at the Jos Abattoir , has decried low patronage by buyers while blaming it on the current financial challenges facing Nigerians.\nOkafor, who disclosed this in an interview with the News Agency of Nigeria (NAN) on Wednesday in Jos, said the financial challenges were affecting butchers and their business.\nHe lamented that in the past, butchers slaughtered 200 cows daily, excluding goats, but due to the current economic crunch, they hardly slaughtered up to 30 cows daily.\nOkafor further revealed that the abattoir was confronted with the challenge of insecurity due to the absence of perimeter fencing.\nThe chairman further decried the insufficient supply of potable water at the abattoir."
  },
  {
    "headline": "NPA, IMO collaborates on port data exchange initiative",
    "summarized_story": "By Godwin OritseTHE Nigerian Ports Authority, NPA, and the International Maritime Organization, IMO, are currently working out modalities for an electronic port data exchange programme aimed at developing an efficient Port Community System, PCS.\nThe Managing Director of NPA Mohammed Bello Koko has commended the existing synergy between NPA and the IMO especially for the support towards the electronic data exchange in Nigerian Ports.\nREAD ALSO:Why we’re amending assets declaration act to include all bank employees, spouse, children- RepsThis will ensure that Nigerian Ports benefit from effective operational country-wide PCS to enhance the economy of the country.\nThis series identify the opportunity and challenges for developing a national PCS in Nigeria.\nMore than 60 senior management participants from Nigerian Ports Authority NPA, Nigerian Maritime Administration and Safety Agency, NIMASA, Nigeria Customs Service, NCS, Nigerian Immigration Service, NIS, Health Services, Agricultural Services, Ministry of Transportation, as well as port terminal operators, shipping companies, ship agents, importers and exporters participated."
  },
  {
    "headline": "Fayemi congratulates new Olubadan",
    "summarized_story": "Ekiti State Governor, Dr. Kayode Fayemi has congratulated the newly appointed 42nd Olubadan, Senator Lekan Balogun, on his emergence as the monarch of Ibadanland.\nThe Governor, in a statement by his Chief Press Secretary, Yinka Oyebode, said the appointment and ascension of Senator Balogun marks the beginning of a new era in Ibadanland.\nDr Fayemi described Senator Balogun’s ascension as a reward for his patience over the years climbing the ladder after being enlisted into the chieftaincy line in 1986 as a Mogaji to reach the peak as the Olubadan 36 years later.\nThe Governor noted that the new traditional ruler’s experience in the corporate world, administration, politics and the traditional institution had prepared him for the new royal duties he is assuming.\nDr. Fayemi prayed to God to grant the new Olubadan the wisdom needed to oversee the affairs of the city as the king and custodian of the people’s culture, tradition and history."
  },
  {
    "headline": "Osun guber: Police vow to deal with anyone disrupting peace",
    "summarized_story": "The Osun Police Command has vowed to use all legitimate means to avert any form of protest under any guise, especially during this electioneering period in the state.\nThe state’s Commissioner of Police, Wale Olokode, on Tuesday, said the command has intel that some groups of people are planning to embark on protest in the state.\n“War-mongers, troublemakers, persons, group or groups intending or planning to cause, create or execute any act of violence before, during and after the primary/gubernatorial elections should, in their own interest, leave the state quietly and peacefully.\n“They should not allow themselves to be used by any vicious politicians to cause a crisis in the State as the command will not tolerate any kind of thuggery, gangsterism and hooliganism.\n“Though all allegations and counter-allegations are not unexpected, it is pertinent to state clearly here, that the police is apolitical, and we will discharge our duties without bias or favour to any person or persons regardless of their political affiliation,” the statement read."
  },
  {
    "headline": "EFCC, ICPC probing top civil servants over alleged fraud",
    "summarized_story": "Some officials of the union told this medium that the officials are being investigated by the two anti-graft agencies over fraud and money laundering.\nIt was also revealed that some top senior principal officials of the union have been invited by both EFCC and ICPC.\nThe sources added that the treasurer of the union, Comrade Rahad Maigari had earlier appeared before ICPC and is still under probe.\nThe secretary-general of the union, Comrade Alade Bashir Lawal, had before now been probed by the ICPC and the EFCC.\n“The Congress of Senior Civil Servants of Nigeria commend the ICPC and the EFCC for the probing of the billionaire workers’ union."
  },
  {
    "headline": "Plateau govt charges PCRC on unity to successfully curb crime",
    "summarized_story": "The Plateau State Government has called on members of the Police Community Relations Committee (PCRC) in the state to remain united in their task of ensuring security in their various communities.\nThe call was made by the Commissioner for Environment, Mr Usman Idi, during an emergency congress meeting in Jos, the state capital.\nHe urged the members to continue bridging the socio-psychological gap between the police and the public.\nAlso speaking, the Assistant Secretary, PCRC Area Command, Mr John Maren, commended the leadership of the chairman.\nHe said that since his assumption of duty as the chairman, the PCRC in the state had witnessed unity and progress."
  },
  {
    "headline": "How NSCDC operatives battered, threatened to kill me in Osun – Journalist",
    "summarized_story": "Toba Adedeji, a journalist has narrated his ordeal in the hands of operatives of the Nigeria Security and Civil Defence Corps (NSCDC) in Osun State.\nThe Nigeria Union of Journalists, Osun State Council, has condemned the incident.\nThe Osun NSCDC Command Public Relations Officer, Atanda Olabisi while speaking with DAILY POST on phone, said the attack was a misunderstanding between the personnel of the NSCDC and the journalist.\nShe also disclosed that the command had already apologised to the Osun NUJ council and to Toba Adedeji since he is a known journalist in the command.\nShe stated that the Osun NSCDC Commandant, Emmanuel Ocheja was on top of the matter and a public statement will be issued soon."
  },
  {
    "headline": "Abba Kyari’s case with NDLEA may hinder extradition to US — Lawyer",
    "summarized_story": "A Lagos-based lawyer and human rights activist, Festus Ogun, has explained why suspended Deputy Police Commissioner Abba Kyari’s case with the National Drug Law Enforcement Agency (NDLEA) may hinder his extradition to the United States of America.\nHe stated if the agency decides to prosecute Kyari for his alleged involvement in the Brazil-Ethopia-Nigeria drugs ring and deal to compromise 25 kilogram of cocaine in the custody of the NDLEA, then his extradition might be stalled.\n“While it is desirable that the NDLEA gets to the root of this drug cartel matter involving Abba Kyari by ensuring that those found wanting after thorough investigation are charged before a competent court of record, such an action will only succeed in hindering and frustrating his (Kyari’s) extradition.\n“The law remains that no individual can be successfully extradited from Nigeria to any other country if a criminal proceeding, different from the fugitive’s extradition’s crime, is pending in a Nigerian court.\n“In any case, the Honourable Attorney-General can play a huge role in ensuring that substantial justice is done in both matters."
  },
  {
    "headline": "BREAKING: Many feared killed as gunmen invade Abia cattle market",
    "summarized_story": "Gunmen on Tuesday night reportedly killed several persons during an invasion of the newly constructed Abia cattle market in Omumauzor in Ukwa West local area of Abia State.\n- Advertisement -The Nation gathered the midnight attack kept the villagers apprehensive.\nIt was gathered that security operatives have taken over the area to maintain peace.\nDetails Shortly…"
  },
  {
    "headline": "Petrol scarcity worsens as Ex-depot price hits N165/ litre",
    "summarized_story": "Petrol scarcity may not abate any soon as the ex-depot price has exceeded N165 per litre instead of the official N158.5 per litre at the private depots, The Nation learnt.\n“Normally private depots are supposed to be selling their products at official rate.\nRead Also: Lamentation as fuel scarcity bites harderAhmed was worried that Nigerians are suffering due to acute shortage of petrol.\nOn contaminated petrol, Maigandi revealed that his members have been directed to take an inventory of the toxic fuel.\n“The NNPC and the regulatory agencies should intervene so that the depots sell at the government stipulated rates."
  },
  {
    "headline": "Aregbesola’s thugs fired gunshots without provocation, say Police",
    "summarized_story": "Also, the Osun State Government condemned the shooting, warning that any unruly action by any individual, no matter highly placed, will be checked legally.\n“Unknown hoodlums attacked the convoy of the former Governor of Osun State and Minister of Interior Ogbeni Rauf Aregbesola about 6:40pm around Old Garage Area in Osogbo, the state capital.\nMost of his aides as a minister are not from Osun State.\nHe will never succeed with his personal agendas in Osun State.\n“Therefore, it is God and Osun people that will determine Oyetola’s fate, not an individual trying to play God.”"
  },
  {
    "headline": "Beggar arrested with N500,000, $100 in Abuja",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) Social Development Secretariat (SDS) has arrested a 48-year-old beggar, Hadiza Ibrahim with N500,000 and 100 dollars.\nMalam Sani Amar, Director, Social Welfare Services of the secretariat, confirmed the arrest yesterday, in Abuja.\nAmar said, “Ibrahim was apprehended on Feb. 9 with other beggars on Adetokunbo Ademola Crescent in Wuse II.\n“But she is here with N500,000 plus 100 dollar notes which is N57,000 equivalent yet not investing it and still pretending to be poor beggar who has nothing to eat.\nThe beggar told NAN that she had been begging on the street of Abuja for the past 10 years."
  },
  {
    "headline": "How Abba Kyari’s team was contacted by drug cartel from Ethiopia – NDLEA",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has disclosed how the team headed by the detained Deputy Commissioner of Police, Abba Kyari, was contacted by the drug cartel from Addis Ababa in a deal involving the 25 kg cocaine.\nThe anti-drug agency has said it has no reason to shield anyone who may be indicated in the course of the ongoing investigation of the drug scandal.\nYou understand; one of the informants accompanied the goods to Ethiopia, one of the informants that give us information.\n“From Addis it will be given to those to proceed further with it, he will get their snapshots without their knowledge.\nYes, he will reveal those that are conveying it further, get snapshots of theirs without their knowledge and send to us (Abba Kyari’s team)."
  },
  {
    "headline": "Buhari seeks fresh N2.557trn for fuel subsidy",
    "summarized_story": "From Fred Itua and Ndubuisi Orji, AbujaPresident Muhammadu Buhari has forwarded a proposal for the amendment of the 2022 Appropriation Act to the National Assembly.\nBuhari in the letter said it was imperative to remove all capital projects that were replicated in the 2022 Appropriation Act, Lawan said.\nThe letter read: “As I indicated at the signing of the 2022 Appropriation Act, I forward herewith the Proposals for amendment of the 2022 Appropriation Act (as detailed in Schedules I-V), for the kind consideration and approval by the Senate.\nI therefore request the National Assembly to make the above amendments without increasing the budget deficit.\n“However, following the suspension of the PMS subsidy removal, the 2022 Budget Framework has been revised to fully provide for PMS subsidy."
  },
  {
    "headline": "Fuel scarcity bites harder in Abuja, grounds vehicular movements",
    "summarized_story": "Most commuters were forced to abandon their vehicles on the road in frustration.\nThose from Karshi, Orozo,, Jikwoyi axis were completely cut off from the city centre as fuel queues in the areas spilled onto both sides of the Karshi-Nyanya expressway stopping vehicular traffic.\nThe queues forced the traffic gridlock to stretch down the roads for kilometres.\nA trip from Jikwoyi to Kugbo along the Nyanya-Keffi expressway, which usually cost N200 shot up to about N1,000.\nSome vehicle owners said they had to spend the night at the filling stations before they were able to buy fuel."
  },
  {
    "headline": "Drug saga: NDLEA grills Abba Kyari, others",
    "summarized_story": "From Godwin Tsa, AbujaDetained Deputy Commissioner of Police and suspended Intelligence Response Team (IRT) Commander, Abba Kyari (DCP), is currently undergoing interrogation by operatives of the National Drug Law Enforcement Agency (NDLEA), over his involvement in the Brazil-Ethiopia- Nigeria drugs ring and deal to compromise 25 kilograms of cocaine in the custody of NDLEA.\nKyari was arrested on Monday by the police after he was declared wanted by the NDLEA over the alleged drug deal.\nAccording to competent sources at the NDLEA, the grilling exercise, which is in line with lawful practices, will last till today.\nThe agency has equally extended its investigation to officials allegedly linked to the bust drug deal as requested by the Inspector General of Police, Akali Baba.\nThe agency said it believes strongly that DCP Kyari was a member of a drug cartel that operated the Brazil-Ethiopia-Nigeria illicit drug pipeline, and he needed to answer questions that crop up in an ongoing drug case in which he is the principal actor."
  },
  {
    "headline": "Bad fuel: Buhari never ordered Sylva to query NMDPRA head –Sources",
    "summarized_story": "The source said “nothing of such ever happened.”Nigerians can now work and earn dollars DAILY from home.\nA national daily had credited an unnamed source in the presidency with the claim that President Buhari, who doubles as Minister of Petroleum, directed the Minister of State, Timipre Sylva, to issue a query to the NMDPRA boss.\nBut the presidency source, yesterday, told State House Correspondents there was no directive to issue a query.\n“Forget the story of any query being issued.\nYes, Mr. President is unhappy with what happened, but he didn’t direct that a query be issued."
  },
  {
    "headline": "Massive Oil Theft, High Pipeline Repairs Cost, Bleeding Nigeria’s Economy",
    "summarized_story": "A THISDAY analysis showed that at a projected 1.86 million barrels per day in 2021, the country recorded nearly 200 million barrels’ crude deficit, out of a possible 700 million barrels yearly, in the first 11 months of the year.\nKomolafe attributed the underperformance to mostly oil theft, sabotage, vandalism, as well as technical issues, including ruptures associated with the assets.\nIn a period of 10 years, he stated, an analysis by NEITI put losses to oil theft at $41.9 billion, about $4.1 billion per year.\nIn all, the government appears helpless, despite attempts in the past to reduce the incidence of vandalism and oil theft.\nSince this year, Wike has repeatedly accused the Nigeria Police and Nigeria Security and Civil Defence Corps (NSCDC) of connivance."
  },
  {
    "headline": "Buhari Accuses National Assembly of Inserting N887bn into 2022 budget",
    "summarized_story": "This was just as the president has asked the National Assembly to amend the 2022 Appropriation Act passed by the National Assembly in December, 2021.\nBuhari in the letter, he also said it was imperative to remove all capital projects that were replicated in the 2022 Appropriation Act.\n“It is therefore necessary to transfer the National Assembly’s expenditures totaling N16.59 billion in the Service Wide Vote to National Assembly Statutory Transfer provision (see Schedule l).\nHe said: “Following the suspension of the petrol subsidy removal, the 2022 Budget Framework has been revised to fully provide for PMS subsidy.\n“Therefore, the amount available to fund the federal budget is projected to decline by N969.09 billion.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Inflation Drops to 15.60%",
    "summarized_story": "The 0.87 per cent decline indicated that the headline inflation rate slowed down in January when compared to the same month in the previous year.\nHowever, month-on-month, the headline index slowed to 1.47 per cent in January, representing 0.34 per cent points moderation compared to1.82 per cent recorded in December 2021.\nOn month-on-month, the core sub-index increased by 1.25 percent in January, down by 0.13 per cent when compared with 1.12 per cent recorded in December.\nThis is 0.17 per cent points higher than 13.16 per cent recorded in December.\nThe urban inflation slowed to 16.17 per cent year-on-year in January 2022 from 17.03 per cent recorded in January 2021, while rural inflation rate also moderated to 15.06 per cent in January from 15.92 per cent in January 2021."
  },
  {
    "headline": "Buhari Transmits 2022 Supplementary Budget to House",
    "summarized_story": "Udora Orizu in AbujaPresident Muhammad Buhari has transmitted the 2022 Supplementary Budget to the House of Representatives for consideration and approval.\nThough Buhari signed the 2022 budget into law in December 2021, he raised reservations about some of its contents, particularly the ‘worrisome changes’ made by the lawmakers.\nThe lawmakers had approved a total expenditure of N17.1 trillion against the N16.3 trillion proposed by the president in October.\nThe six page letter, was read by the Speaker, Hon.\nFemi Gbajabiamila, at the commencement of plenary, Tuesday."
  },
  {
    "headline": "Subsidy: Buhari Transmits N3trn Supplementary Budget to National Assembly",
    "summarized_story": "Seeks review of Finance ActSunday Aborisade, AbujaPresident Muhammadu Buhari, on Tuesday, transmitted a supplementary budget of N3trn to the National Assembly for consideration and passage.\nThe amount included N2.557trn meant to provide subsidy on petroleum products from June to December 2022.\nThis is contained in a letter from the President and read on the floor at plenary by the Senate President, Ahmad Lawan.\nBuhari also requested the federal parliament to review the Finance Act 2021.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, EFCC, Immigration Service Place Nigerian Navy Ex-Director On Watch List Over N2billion Fraud",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has again been placed on the watch list of the Nigeria Immigration Service.\n“He is now on our watch list again, the EFCC requested the NIS to place him on watch list and inform it anytime he is travelling out of the country from any of the international airports and other points of entry and exit,” a senior immigration officer told SaharaReporters.\nThe EFCC had accused Yusuf of stealing N2billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nThe EFCC and National Intelligence Agency also asked the Nigeria Immigration Service and Interpol to place him on a watch list and have him arrested at the point of entry or exit."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, EFCC, Immigration Service Place Nigerian Navy Ex-Director On Watch List Over N2billion Fraud",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has again been placed on the watch list of the Nigeria Immigration Service.\n“He is now on our watch list again, the EFCC requested the NIS to place him on watch list and inform it anytime he is travelling out of the country from any of the international airports and other points of entry and exit,” a senior immigration officer told SaharaReporters.\nThe EFCC had accused Yusuf of stealing N2billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nThe EFCC and National Intelligence Agency also asked the Nigeria Immigration Service and Interpol to place him on a watch list and have him arrested at the point of entry or exit."
  },
  {
    "headline": "How Ogun Police Spokesperson Protects Alleged Fraudulent Car Dealer, Detains, Parades Victim",
    "summarized_story": "Sokunbi Damilola, an Abeokuta-based aluminium fabricator, has narrated how Mohammed Seedu, a car dealer, allegedly influenced the Ogun State Police Command to detain him and his friends after defrauding him of N3million.\nPolice Public Relations Officer, DSP Abimbola OyeyemiHe said he met Seedu in September 2021, after one of his church members, who is also a police officer, introduced him as a reliable car dealer.\n“On September 8, 2021, I journeyed to Coutonu, Benin Republic, with the dealer to get my car.\nOn February 13, 2022, Damilola got a hint from his friends that the dealer was in a car wash around Olomore, Ogun State.\nWhen Oyeyemi, the Ogun police spokesperson, was contacted, he said he was in a meeting."
  },
  {
    "headline": "How Ogun Police Spokesperson Protects Alleged Fraudulent Car Dealer, Detains, Parades Victim",
    "summarized_story": "Sokunbi Damilola, an Abeokuta-based aluminium fabricator, has narrated how Mohammed Seedu, a car dealer, allegedly influenced the Ogun State Police Command to detain him and his friends after defrauding him of N3million.\nPolice Public Relations Officer, DSP Abimbola OyeyemiHe said he met Seedu in September 2021, after one of his church members, who is also a police officer, introduced him as a reliable car dealer.\n“On September 8, 2021, I journeyed to Coutonu, Benin Republic, with the dealer to get my car.\nOn February 13, 2022, Damilola got a hint from his friends that the dealer was in a car wash around Olomore, Ogun State.\nWhen Oyeyemi, the Ogun police spokesperson, was contacted, he said he was in a meeting."
  },
  {
    "headline": "My Baby Boy Was Only Eight Days In School When The Authorities Flogged Him To Death — Delta Woman Demands Justice",
    "summarized_story": "Gift Ohanazeze, mother of the 19-month-old pupil of Arise and Shine Nursery and Primary School, Asaba, Delta State, who was reportedly flogged to death has called for justice for her son.\nSpeaking with SaharaReporters on Wednesday, the young woman explained that she had barely enrolled her son in the school before the sad incident occurred.\nMeanwhile, an autopsy will be carried out on the corpse of the little boy today (Wednesday) to ascertain the cause of his death, the mother said.\nThe day I went to meet the school boss that they flogged my child; she told me that my baby was disturbing the school, she said do I know the gravity of my son's offence?\nSaharaReporters had earlier reported that the baby, a pupil of Arise and Shine Nursery and Primary School, Asaba, Delta State, was given 31 strokes of the cane for playing with water and getting wet."
  },
  {
    "headline": "NDLEA to police: Drug cartel was working with DCP Kyari's men -- not our officers",
    "summarized_story": "The National Drug Enforcement Agency (NDLEA) says it will not spare anyone found complicit in the 25kg cocaine deal allegedly involving Abba Kyari, suspended deputy commissioner of police.\nOn Monday, the anti-drug agency, in a press briefing, declared Kyari wanted over alleged links with an international drug cartel.\nFemi Babalola, spokesperson of the NDLEA, narrated how Kyari and the Intelligence Response Team (IRT) arrested some drug traffickers who arrived in the country from Ethiopia with 25kg of cocaine.\nAdvertisementReacting to the allegation, the police, in a statement, said they arrested Kyari and four officers for “tampering with narcotic exhibits and unprofessional infractions”.\nThe police said investigation revealed that the international drug cartel involved in the case has “strong ties” with some NDLEA officers at Enugu Airport and asked the anti-drug agency to investigate its officers."
  },
  {
    "headline": "NDLEA to police: Drug cartel was working with DCP Kyari's men -- not our officers",
    "summarized_story": "The National Drug Enforcement Agency (NDLEA) says it will not spare anyone found complicit in the 25kg cocaine deal allegedly involving Abba Kyari, suspended deputy commissioner of police.\nOn Monday, the anti-drug agency, in a press briefing, declared Kyari wanted over alleged links with an international drug cartel.\nFemi Babalola, spokesperson of the NDLEA, narrated how Kyari and the Intelligence Response Team (IRT) arrested some drug traffickers who arrived in the country from Ethiopia with 25kg of cocaine.\nAdvertisementReacting to the allegation, the police, in a statement, said they arrested Kyari and four officers for “tampering with narcotic exhibits and unprofessional infractions”.\nThe police said investigation revealed that the international drug cartel involved in the case has “strong ties” with some NDLEA officers at Enugu Airport and asked the anti-drug agency to investigate its officers."
  },
  {
    "headline": "FPI will decline, debt service cost will increase... how US rate hikes may affect Nigeria",
    "summarized_story": "They forecast the central bank will start reducing its balance sheet in June,” the investment bank said in a tweet.\nIn banking, a basis point, the smallest unit of measurement for interest rate equals one-hundredth of 1 percent.\nUS RATE HIKE WILL NOT AFFECT NIGERIA — MPCLast month, the Central Bank of Nigeria (CBN) voted to keep the country’s benchmark interest rate at 11.5 percent.\nWhile an increase in the US interest rate would mean borrowing at a higher cost, he said the Nigerian government cannot afford that at the moment given its limited financial space.\nHe said Nigeria can cushion the impact with clear policies in its interest rate environment and around the non-oil exports."
  },
  {
    "headline": "FPI will decline, debt service cost will increase... how US rate hikes may affect Nigeria",
    "summarized_story": "They forecast the central bank will start reducing its balance sheet in June,” the investment bank said in a tweet.\nIn banking, a basis point, the smallest unit of measurement for interest rate equals one-hundredth of 1 percent.\nUS RATE HIKE WILL NOT AFFECT NIGERIA — MPCLast month, the Central Bank of Nigeria (CBN) voted to keep the country’s benchmark interest rate at 11.5 percent.\nWhile an increase in the US interest rate would mean borrowing at a higher cost, he said the Nigerian government cannot afford that at the moment given its limited financial space.\nHe said Nigeria can cushion the impact with clear policies in its interest rate environment and around the non-oil exports."
  },
  {
    "headline": "MATTERS ARISING: FBI fraud allegation, NDLEA drug-dealing claim — will DCP Kyari be tried in Nigeria or US?",
    "summarized_story": "The FBI secured a court order for Kyari’s extradition and arrest over his alleged involvement in the Hushpuppi fraud.\nAmid the allegation, Usman Baba, the inspector-general of police, set up a panel to probe the allegations against Kyari.\nSome Nigerians have alleged that the NDLEA’s allegation against Kyari is a ploy by the federal government to truncate his extradition.\nArticle 3 states that: “Extradition shall be reciprocally granted for the following crimes or offences:“17.\nKYARI’S ALLEGED DRUG-DEALING OFFENCE IN NIGERIA VIS-A-VIS EXTRADITIONThe Extradition Act states conditions in which an accused person cannot be extradited to the requesting country."
  },
  {
    "headline": "Flutterwave secures $250m Series D with valuation at over $3bn",
    "summarized_story": "Nigeria-based fintech giant Flutterwave has raised $250 million in Series D funding, its single-biggest investment to date, valuing the company at over $3 billion.\nThe investment was led by B Capital Group with participation from new investors Alta Park Capital, Whale Rock Capital, Lux Capital, among others and existing ones, including Glynn Capital, Avenir Growth, Tiger Global, Green Visor Capital, and Salesforce Ventures.\nThe Series D fundraise comes on the back of an impressive run of five years in which Flutterwave has processed over 200 million transactions worth over $16 billion to date across 34 countries in Africa.\nIt also follows a year of rapid growth for the brand which now serves over 900,000 businesses across the globe.\nThis latest fundraising sees its valuation more than triple since its last funding round in March last year."
  },
  {
    "headline": "Is Africa’s tech startup ecosystem set for a debt financing boom?",
    "summarized_story": "Okoudjou’s statement came after the pan-African fintech giant closed a $100 million Series C financing round—split between $70 million equity and $30 million debt.\n“Debt investors usually look for predictable cash flows or transferable assets (such as real estate) to secure their exposures.\nAccording to Ayobamigbe Teriba, an ex-analyst at Ingressive Capital, debt financing is viable to businesses but tricky.\nIt participated in MFS Africa’s $100 million funding round with $30 million debt and has backed many startups in Africa.\nShort-term debt financing can also be accessed if it is backed by inventory; for example, e-commerce retailers and their suppliers."
  },
  {
    "headline": "EU launches €150bn investment in Africa to combat China’s domination",
    "summarized_story": "The European Union has launched a new investment package worth €150 billion ($169.67bn) for Africa to create an alternative to the “unfavourable and opaque Chinese funds”.\nThe European Commission President Ursula von der Leyen announced the investment plan at a news conference in Dakar last week with Senegalese President Macky Sall.\nThis investment is half of the EU’s €300 billion Global Gateway scheme, which was launched in December last year.\nAnd the investment package is a combination of €160 million ($180.9m) in grants and €660 million ($746.6m) in loans over the next two years.\nHow will this play out, will it scale to become a solution or a bigger problem than the one it aims to solve?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game– Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "Local competition for Uber, Wasla raises $9 million, MoneyHash’s pre-seed round",
    "summarized_story": "Today on Techpoint Digest:Local competition for UberWasla’s $9 million raiseMoneyHash’s pre-seed fundingLocal competition for Uber?\nThe startup has announced an investment of $9 million from Contact Financial Holding, a financial services provider in Egypt.\nFollowing the fresh injection of capital, the startup plans to introduce buy now, pay later options and a new online payment option for its users.\nThey’re very technologically advanced, and their adoption of eCommerce is quite good.”MoneyHash’s pre-seed fundingAccepting payments is a significant challenge for businesses across the globe.\nMoneyHash, an Egyptian startup, has raised $3 million in pre-seed funding for this purpose after launching in 2021."
  },
  {
    "headline": "How Healthdart is providing affordable and accessible healthcare in South Africa",
    "summarized_story": "In South Africa, one healthtech startup is helping South Africans access drugs and health advice using their phones.\nMission-driven entrepreneurshipIn the early 2000s, South Africa had an HIV crisis on its hands.\nBringing primary health care closer to the peopleHealthdart co-founders, L-R, Yauvan Hansraj (CTO), Njabulo Skhosana (CEO), and Tshwanelo Matsane (CPO).\nSource: HealthdartMost plans to improve healthcare in Africa are focused on secondary care, with primary healthcare often an afterthought.\nAdvertisementHis reply corresponds to a 2020 report from the Independent Communications Authority of South Africa (ICASA) that claims that the smartphone penetration in South Africa stands at ~91%."
  },
  {
    "headline": "The economics of 5G deployment in Nigeria",
    "summarized_story": "Compared to 4G and 5G networks, the speeds of these networks are exceptionally slow.\nTheir attractiveness, however, pales in comparison to the speeds of 4G and 5G networks.\nInstability in the FX marketThe 5G operators in Nigeria would face a big cost hurdle while trying to navigate the foreign exchange market in Nigeria.\nThe telecom industry in Nigeria depends heavily on foreign equipment manufacturers and imported technical expertise for the deployment and maintenance of networks.\nNigeria would need to work with lawmakers to come up with legal frameworks to guide service delivery in the new 5G era."
  },
  {
    "headline": "The economics of 5G deployment in Nigeria",
    "summarized_story": "Compared to 4G and 5G networks, the speeds of these networks are exceptionally slow.\nTheir attractiveness, however, pales in comparison to the speeds of 4G and 5G networks.\nInstability in the FX marketThe 5G operators in Nigeria would face a big cost hurdle while trying to navigate the foreign exchange market in Nigeria.\nThe telecom industry in Nigeria depends heavily on foreign equipment manufacturers and imported technical expertise for the deployment and maintenance of networks.\nNigeria would need to work with lawmakers to come up with legal frameworks to guide service delivery in the new 5G era."
  },
  {
    "headline": "Five policy steps to fast-track 5G roll-out in Nigeria",
    "summarized_story": "While the President’s enthusiasm for 5G may be a welcome development for operators, the reality of the commercialisation of 5G technology in Nigeria depends more on the policies enabling its deployment.\nThere should be a subsidy from the government for 5G deployment.\nEase of sharing network agreementsDue to the enormous CAPEX and OPEX burden of network deployment on operators, network sharing has become a strategy aimed at reducing the cost weight.\nAnd this is not limited to just the 5G network as operators have used this method for previous generations.\nA prominent example of a network sharing agreement is the one between Orange Belgium and Proximus in July 2019."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "SEC Says it’s Engaging Other Agencies to Curb Ponzi Schemes",
    "summarized_story": "The Securities and Exchange Commission (SEC), has disclosed that it is engaging the National Orientation Agency as well as regulators of public agencies to curb the activities of illegal financial operators.\n“The upsurge of these Schemes has undermined the reputation of the capital market and dampened investors’ confidence, among other things.\nYuguda said while the SEC, in collaboration with other regulators in the financial sector, strives to clamp down on merchants of fake news and Ponzi Schemes, investors also have a huge role to play.\n“The SEC, as the apex regulator of the Nigerian capital market recognizes the effect fake news can have on the market, as it can significantly impact prices in the capital market.\nThe capital market requires such fact-checkers to mitigate measures from fraudsters in the field of information-based securities fraud” He stated."
  },
  {
    "headline": "Adeoti hails Aregbesola as architect of progressive politics in Osun",
    "summarized_story": "By Sunday Oguntuyi, OsogboOne of the governorship aspirants on the platform of the All Progressives Congress (APC) in Osun State, Alhaji Moshood Adeoti, has said progressive politics in the state was near-dead before the arrival of the Minister of Interior, Ogbeni Rauf Aregbesola in 2004, stressing that he is the architect of progressive politics in the state.\nAdeoti noted that Aregbesola resuscitated progressive politics after the People Democratic Party had taken over the state.\nHe noted that Aregbesola committed his life and resources to the resuscitation, maintenance and development of the progressive politics before, during and after he became the governoship candidate of the Action Congress (AC).\nAccording to Adeoti, Aregbesola does not deserve the humiliation and betrayal being experienced in the hands of Governor Adegboyega Oyetola and his followers.\nHe said: “Ogbeni Rauf Aregbesola resuscitated progressive politics in Osun."
  },
  {
    "headline": "Osun 2022: Am still in the governorship race – Dele Adeleke",
    "summarized_story": "By Sunday Oguntuyi, OsogboA governorship aspirant on the platform of People’s Democratic Party (PDP) in Osun State, Mr. Bamidele Adeleke, has debunked rumor making the round that he has stepped down from the race.\nAdeleke, in a media chat with newsmen, said he’s still very much in the race, and that nothing can discourage him from pursuing his aspirationHe enjoined his teeming supporters and delegates to ignore and disregard the rumour making the round that he has stepped down for aanother aspirant.\n“The general public, members of our great party, and most importantly the delegates should therefore disregard this latest antics of the drowning camp,” he noted."
  },
  {
    "headline": "Buhari confirms Bello-Koko as NPA substantive MD",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has approved the appointment of Mr. Mohammed Bello-Koko as the substantive Managing Director for the Nigerian Ports Authority (NPA).\nPrior to this appointment, Mr. Koko was the Executive Director, Finance & Administration of the Authority.\nA press statement by the Ministry of Transportation dated February, 15th, 2022 and signed by Eric Ojiekwe, the Director, Press and Public Relations of the Ministry, said the appointment takes immediate effect.\nBuhari’s confirmation has put an end to speculations that the suspended NPA MD, Hadiza Bala Usman might be on her way back to the agency"
  },
  {
    "headline": "Federal Govt Recommits To Effective Power Supply",
    "summarized_story": "The minister of Power, Mr Abubakar Aliyu, has reaffirmed the federal government’s commitment to ensure that Nigerians have an effective power supply through renewable energy.\nMrs Margaret Oyinboade, senior information officer, Ministry of Power, made this known in a statement in Abuja on Monday.\nSpeaking earlier, the German deputy ambassador to Nigeria, Martin Huth, commended the efforts of the Federal Government in the power sector.\nHe also affirmed the German government’s commitment to continue supporting the Ministry of Power.\nADVERTISEMENTHe also conveyed an invitation to the minister to attend a conference of energy transition dialogue in Germany, slated for the end of March."
  },
  {
    "headline": "NiMet Predicts Normal Annual Rainfall In 2022",
    "summarized_story": "The Nigerian Meteorological Agency, NiMet, has predicted normal annual rainfall in its seasonal rainfall prediction for 2022.\nMaking the presentation in Abuja yesterday, the minister of Aviation, Hadi Sirika said the prediction indicates that the annual rainfall amount is expected to be normal in most parts of the country.\n“The annual rainfall amount is expected to range from 390 mm in the North to over 2790 mm in the South.\nAnnual rainfall amount ranging from 390 mm to 790 mm is anticipated in some parts of Borno, Yobe, Jigawa, Katsina and Sokoto states.\nNoteworthy, are areas around Kwara, Oyo, Lagos, Nasarawa, Benue, Bayelsa, and Rivers which are likely to experience shorter than normal length of growing season."
  },
  {
    "headline": "Wike’s Fight Against Illegal Refining Not Politically-motivated – APC Chieftain",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) in Rivers State, Hon Innocent Ajaelu, has declared that the fight against illegal refining of petroleum products by Governor Nyesom Ezenwo Wike-led administration in the state was not politically-motivated.\nHe said, “It is a blatant lie that the fight against illegal refining in Rivers State is politically motivated.\nHow will you say that Wike is using the fight against soot to lure people into PDP?\nSecondly, the fight against soot is the fight everybody should be involved in.\nADVERTISEMENT“That fight against soot is apolitical fight."
  },
  {
    "headline": "Wike’s Fight Against Illegal Refining Not Politically-motivated – APC Chieftain",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) in Rivers State, Hon Innocent Ajaelu, has declared that the fight against illegal refining of petroleum products by Governor Nyesom Ezenwo Wike-led administration in the state was not politically-motivated.\nHe said, “It is a blatant lie that the fight against illegal refining in Rivers State is politically motivated.\nHow will you say that Wike is using the fight against soot to lure people into PDP?\nSecondly, the fight against soot is the fight everybody should be involved in.\nADVERTISEMENT“That fight against soot is apolitical fight."
  },
  {
    "headline": "Sylva Defends Rating Of Governor Diri",
    "summarized_story": "Minister of state for petroleum resources, Chief Timipre Sylva has explained reasons for his controversial appraisal of the administration of Governor Douye Diri in Bayelsa State.\nHe declared that his appraisal of the two years of the present administration was an honest, genuine and intellectual analysis of governance in Bayelsa State.\nAs a Bayelsan, a former governor, a major stakeholder of the state, Sylva has the right, like everyone else, to comment, analyse and proffer solutions to aspects of governance in the state that can be improved upon”.\nSylva also sited an infectious Disease Hospital in the state through the Ministry of Petroleum Resources and one of its agency, the NNPC.\nThere will be more of such interviews and more acts of patriotism and critical appraisal from Sylva,” he said."
  },
  {
    "headline": "APC leaders plot Aregbesola's downfall in Akande's house",
    "summarized_story": "Chief Bisi Akande hosted leaders of the All Progressives Congress in the Ila Federal Constituency, Osun, on Tuesday to strategize on how to defeat Rauf Aregbesola and his anointed candidate Alhaji Moshood Adeoti in Saturday’s governorship primary.\nAregbesola had on Monday parted ways with his once-upon-a-time mentor, Bola Ahmed Tinubu for endorsing Governor Gboyega Oyetola for second-term.\nHowever, APC leaders who met at Akande’s residence in Ila on Tuesday threw their weights behind Osun State Governor, Adegboyega Oyetola.\nThe Deputy Speaker of the Osun House of Assembly, Femi Popoola, who read the communique at the meeting, said party members had endorsed Oyetola for a second term.\nPopoola said the party leaders of APC at the Federal Constituency agreed to work for Oyetola’s re-election come July 16th, 2022."
  },
  {
    "headline": "NSCDC, hunters partner to curb vandalism in Zamfara",
    "summarized_story": "By Ibrahim G. AhmadThe Nigeria Security and Civil Defence Corps (NSCDC) is to collaborate with the Nigerian Hunters’ Council (NHC) in the fight against vandalism and other criminal elements in Zamfara.\nThe Zamfara Commandant of the Corps, Athanasius Sparks, made this known while receiving the Leadership of the NHC Zamfara Chapter led by Alhaji Suleiman Lawali in Gusau on Tuesday.\nThe commandant lauded the council in some places where banditry and brigandage have taken a centre stage and urged them to replicate the same gallantry in Zamfara.\nEarlier, Lawali commended the NSCDC for the fight against vandals and other criminals in the state.\nLawali solicited for support and encouragement from the corps."
  },
  {
    "headline": "2023: Ango Abdullahi Leads Northern Elders To Obasanjo, Says Things Not Good Enough",
    "summarized_story": "The Convener of the Northern Elders Forum (NEF), Prof. Ango Abdullahi, has led some northern elders to meet with former President Olusegun in Abeokuta, the Ogun State capital.\nAbdullahi and his team met Obasanjo behind closed doors on Tuesday evening to discuss issues affecting the nation, especially as it goes into the 2023 general election.\nSpeaking after the two-hour meeting, Abdullahi disclosed that the country needed good tidings from the 2023 elections, hence the need to strategize.\nWe compared some notes and we agreed on some grounds.”While saying Obasanjo was on the same page with the northern elders on issues raised, the professor retorted, “Yes.\nThings are not good enough and as we head for 2023, we hope to be strategising for the good of the nation.”"
  },
  {
    "headline": "Abba Kyari: NDLEA Reveals How Informants, Greed Exposed Drug Cartel",
    "summarized_story": "New details have surfaced about how informants alerted suspended DCP Abba Kyari and his crew about the 25kg of cocaine from Brazil, and how greed revealed the criminal deal.\nNegotiations between the informants and Kyari and his crew had broken down.\nThe informants who uncovered the drug gang were unable to agree on a 60:40 split of the drug proceeds, with 60 percent going to Kyari and his boys and 40 percent going to the informants.\nYou understand; one of the informants accompanied the goods to Ethiopia, one of the informants that give us information.\nYes, he will reveal those that are conveying it further, get snapshots of theirs without their knowledge and send to us (Abba Kyari’s team)."
  },
  {
    "headline": "JUST IN: Many Feared Killed As Gunmen Invade Abia Cattle Market",
    "summarized_story": "JUST IN: Many Feared Killed As Gunmen Invade Abia Cattle MarketGunmen on Tuesday night reportedly killed several persons during an invasion of the newly constructed Abia cattle market in Omumauzor in Ukwa West local area of Abia State.\nThe Nation gathered the midnight attack kept the villagers apprehensive.\nIt was gathered that security operatives have taken over the area to maintain peace.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Cocaine Bust: NDLEA Reveals Abba Kyari’s Statements After Police Claim",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has provided more details in the 25kg cocaine bust involving suspended police DCP Abba Kyari.\nThe police had claimed that NDLEA officers at the Enugu airport were working for the cartel and the smuggler who entered from Addis Ababa.\nOn Wednesday, the spokesman said Kyari’s team contact with the cartel and how their ring works had been established.\nYou understand; one of the informants accompanied the goods to Ethiopia, one of the informants that give us information.\nYes, he will reveal those that are conveying it further, get snapshots of theirs without their knowledge and send to us (Kyari’s team)."
  },
  {
    "headline": "INEC to resolve BVAS challenges before Ekiti, Osun polls – Yakubu",
    "summarized_story": "Yakubu also said party primaries for the Osun governorship election would begin today 16th February and end on 12th March 2022 while that of Ekiti was concluded 29th January 2022.\n“In view of the forthcoming elections, the Commission has decided to devolve the CVR exercise to Ward level in both Ekiti and Osun States to enable more citizens register.\nOther issue of discussion at the meeting, according to INEC chairman, was “the balanced distribution of voters to polling units nationwide.\nLast year, the commission achieved the historic feat of expanding voter access to polling units nationwide.\n“We will review and improve its functionality for biometric accreditation of voters in the forthcoming bye-elections and off-season Governorship elections before the 2023 General Election."
  },
  {
    "headline": "At N700 per litre, Nigerians groan over biting fuel scarcity",
    "summarized_story": "The lingering scarcity of the Premium Motor Spirit (PMS) otherwise known as petrol in parts of the country bites harder Tuesday as Nigerians now pay between N600 and N700 for a litre of fuel.\nA female university teacher who simply gave her name as Sandra lamented the plight of Nigerians since the fuel scarcity returned.\nEjike, who spoke in Pidgin English, said the 5 hours lost at the filling station would have yielded some dividends for him.\nAn attendant at Mobil filling station opposite Living Faith Church in Jikwoyi, told Blueprint that they were expecting two trucks of petrol tomorrow (Wednesday).\nOne of them, Oluwole Kadiri, a civil servant, said, “more than any other thing, these drivers have further aggravated the crisis occasioned by the fuel scarcity."
  },
  {
    "headline": "Osun APC crisis: Aregbesola slams Tinubu, Akande (VIDEO)",
    "summarized_story": "The Minister of Interior and former Governor of Osun state, Ogbeni Rauf Aregbesola, has publicly slammed 2023 presidential aspirant, Asiwaju Bola Tinubu and former governor of Osun state, Bisi Akande.\nSpeaking on Monday, in Ijebu Jesa area of Osun State while addressing members of the All Progressives Congress ahead of Saturday’s governorship primary election in the state, the former governor accused APC National Leader, Bola Tinubu of betraying him even though he trusted him and was also loyal to him.\nInsisting that politics of godfatherism and enthronement by treacherous leaders who equate themselves to the status of a god should be stamped out, he accused APC National Leader, Bola Tinubu of betraying him even though he trusted him and was also loyal to him.\nWatch the video below…"
  },
  {
    "headline": "Cocaine Deal: How Drug Mules Contacted Abba Kyari’s Team, NDLEA Shares More Details",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has shared details of how drug mules contacted a suspended police officer, Abba Kyari’s team.\nThe details were revealed in a statement by the NDLEA spokesman, Femi Babafemi on Wednesday, days after the 25kg cocaine deal involving Kyari made headlines.\nYou understand; one of the informants accompanied the goods to Ethiopia, one of the informants that give us information.\nYes, he will reveal those that are conveying it further, get snapshots of theirs without their knowledge and send them to us (Abba Kyari’s team).\nThe NDLEA spokesman assured that the agency will not deviate from an evidence-based investigation that will spare nobody found complicit."
  },
  {
    "headline": "We Have One Billion Litres Of Petrol To Tackle Supply Gap – NNPC",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has assured that the organisation has enough petrol to address the supply gap in the country, saying there are one billion litres of the product in stock.\n“As of today, NNPC has over One (1) billion Litres of certified PMS stock that is safe for use in vehicles and machinery,” he said.\nAccording to him, the NNPC is also expecting about 2.3 billion litres of petrol in the country by month-end.\nTo ensure seamless access to petrol, the NNPC also directed its depots and outlets to begin 24 hours operations.\n“In order to accelerate PMS distribution across the country, NNPC limited has commenced 24 hours operations at its depots and retail outlets nationwide,” he said."
  },
  {
    "headline": "Father Alleges ‘Massive Cover Up’ In Sylvester Oromoni’s Death",
    "summarized_story": "The father of the late Dowen College Student, Sylvester Oromoni (Snr) has testified at the coroner’s inquest about the circumstances surrounding his son’s controversial death, alleging a massive cover-up.\n“We have seen a lot of videos on social media and you said eloquently that there is a massive cover-up in this case.\nIn response, Oromoni said: “There is a massive cover-up and it is clearly stated in the police report.\nUnder cross-examination from Godwin Omoaka (SAN), counsel to one of the suspected Dowen Students, Oromoni also testified that he was not present when his son disclosed that he was given a substance to drink.\nHe encouraged the media to be accurate in its reportage and reiterated his determination to unravel what actually transpired in the case."
  },
  {
    "headline": "Suspected ISWAP Landmine Kills Six Locals In Borno",
    "summarized_story": "Six persons died on Monday with several others injured after suspected members of the Islamic State of West African Province (ISWAP) planted Improvised Explosive Devices along Gamboru-Ngala road in the Ngala Local Government Area of Borno state.\nSpeaking with Channels Television on Tuesday, a humanitarian worker said the first incident involved a commercial pickup vehicle in which three persons died at the spot.\nThe source said another IED killed two members of the local vigilantes who arrived at the scene to offer assistance for the injured victims.\nThe Gamboru-to-Maiduguri highway is a strategic 140-kilometre (87-mile) trade route in the region, and provides an important link with neighbouring Cameroon.\nThe 12-year insurgency in Nigeria has killed more thousands of people since 2009 and displaced many from their homes."
  },
  {
    "headline": "UK Launches ‘British High Commissioner For A Day’ Competition In Nigeria",
    "summarized_story": "The British High Commission in Nigeria is offering young women in Nigeria aged between 18 to 23 the opportunity to be High Commissioner for a day with the launch of its ‘British High Commissioner For A Day’ competition.\n“The competition winner will be given an opportunity to work-shadow the British High Commissioner for a day and will gain some insights into what it is like to be a leader,” the statement read in part.\nThe theme of this year’s International Women’s Day is “equality today for a sustainable tomorrow”.\n“I am delighted to launch the British High Commissioner for a Day competition.\nImproving gender equality and empowering women is one of our top priorities at the British High Commission,” British High Commissioner to Nigeria, Catriona Laing said."
  },
  {
    "headline": "Just In: Reps probe cause(s) of petrol scarcity",
    "summarized_story": "The House of Representatives has launched an investigation into the cause(s) of petrol scarcity across the country.\nThe importation of adulterated Premium Motor Spirits into the country has caused scarcity of the product across the with a litre sold between N250 and N300 in many places.\nAdvertisementMeanwhile, members of the house of representatives will vote on clause by clause amendment to 1999 Constitution on Wednesday.\nAlso, President Muhammadu Buhari has translitted the 2022 Supplementary Budget to House of representatives for consideration."
  },
  {
    "headline": "Zamfara CJ inaugurates 7-man committee to investigate deputy Gov -",
    "summarized_story": "Zamfara State Chief Judge, Kulu Aliyu has Inaugurated a seven man committee to Investigate allegations against the State Deputy Governor Mahdi Aliyu Gusau.\nThe Committee is chaired by retired Justice Halidu Tanko Soba.\nAdvertisementShe adds that the Committee members are of unquestionable integrity and not been members of any public service, legislative Houses or political party.\nThis Development is coming five days after the Zamfara state House of Assembly request the state chief judge to Set up a Committee to Investigate Deputy Governor Mahdi Aliyu Gusau.\nAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of gross misconduct, abuse of office among other thingsAdvertisementIt is coming amidst move by the Zamfara State House of Assembly to Impeach the Mahdi Aliyu as the state Deputy GovernorAdvertisementA federal high court in Abuja had in November last year restrained the Zamfara State House of Assembly from from any move to impeach the deputy Governor."
  },
  {
    "headline": "Nigeria's problem needs immediate change in leadership",
    "summarized_story": "Presidential aspirant on the platform of the opposition People’s Democratic Party, Sam Ohuabunwa visited former military President Ibrahim Babangida in his hilltop residence in Minna, Niger State.\nSpeaking to journalists after the closed door meeting he said Nigeria’s problem needs immediate change in leadership.\nAdvertisementThis is why Mazi Sam Ohuabunwa is visiting former president Ibrahim Badamosi Babangida.\nThe state party chairman Tanko Beji while receiving the aspirant at the party secretariat pledged his support noting that the chapter is ready to support all aspirants to give them equal opportunities.\nAdvertisementWith so many people indicating interest to represent the party at the polls getting a nod from the stalwarts is becomes paramount for aspirants."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Russian Olympian Valieva Had Three Heart Drugs in Her System: Report",
    "summarized_story": "The drug, commonly used to treat angina, has been prohibited by the World Anti-Doping Agency since 2014 for its potential to enhance blood flow and aid endurance.\nIn 2019, the US Anti-Doping Agency suspended track coach Alberto Salazar for four years — later extended to a lifetime ban — for improperly using substances including L-carnitine.\nThe World Anti-Doping Agency has announced that it is investigating the entourage surrounding Valieva.\nThe panel rejected appeals by WADA, the International Olympic Committee and the International Skating Union to reinstate a suspension that was originally levied but then removed by Russian anti-doping authorities.\nHowever, the IOC has announced that no medals will be distributed to any athletes if Valieva reaches the podium."
  },
  {
    "headline": "Senator Basiru Speaks on Tinubu, Aregbesola Feud, Says No Faction in Osun APC",
    "summarized_story": "Senator Basiru joins ARISE News to speak on the ongoing feud between Asiwaju Tinubu and Rauf Aregbesola, and its impact on the Osun state governorship elections."
  },
  {
    "headline": "UK Inflation Hits Nearly 30-Year High of 5.5%",
    "summarized_story": "The annual rate of consumer price inflation rose to 5.5% in January, the highest since March 1992, the Office for National Statistics said on Wednesday, above expectations from economists in a Reuters poll for it to hold at December’s 5.4%.\nThe BoE has already raised interest rates twice since December – lifting rates to 0.5% from 0.1% – and financial markets expect a further rate rise to 0.75% or 1% on March 17 after the BoE’s next meeting.\nThe British central bank does not expect inflation to return to its 2% target until early in 2024, although most economists think inflation will fall faster.\nHigher energy prices have been the biggest single factor lifting British inflation so far, although global pandemic-related supply-chain problems have raised the price of many other goods too.\nU.S. consumer price inflation hit a 40-year high of 7.5% in January, while inflation in the euro zone was 5.1%, the highest since the European single currency’s creation."
  },
  {
    "headline": "Ukraine Tensions: West Skeptical of Russian Overtures",
    "summarized_story": "Russia made two overtures to ease tensions around Ukraine — reporting a pullback of troops near its neighbor and welcoming talks with the West.\nThose moves led to dire warnings from Washington, London and other European capitals that Russia was preparing to roll into Ukraine.\nIt wants the West to keep Ukraine and other former Soviet nations out of NATO, halt weapons deployments near Russian borders and roll back forces from Eastern Europe.\n“No one wants war.”Russian lawmakers urged Putin to recognize rebel-held areas in eastern Ukraine as independent states.\nPutin said the request reflects the Russian public’s sympathy for the suffering of people trapped in the conflict in eastern Ukraine that has killed over 14,000 since 2014."
  },
  {
    "headline": "Nigeria: House Expands Probe into Dirty Fuel, Includes Lingering Petrol Scarcity",
    "summarized_story": "Nigeria’s House of Representatives has mandated its Committee on Petroleum Downstream to include in their investigation, the lingering issue of fuel scarcity.\nThe lawmakers had at the plenary on February 10, while adopting a motion sponsored by the Chief Whip of the House, Hon.\nElumelu said, “I’m coming under this rule for us to discuss the issue of lingering fuel crisis in Nigeria.\nI agree that NNPC said it has enough but it doesn’t seem to tally with their submission that they’ve enough fuel because there’s still some lingering fuel crisis in the whole of Nigeria.\nAdopting the motion, the House observed a minute silence for the late DPO and other police officers who died while serving the nation."
  }
]