[
  {
    "headline": "Yam thief shoots farm owner to death in Osun, suspect arrested",
    "summarized_story": "The suspect had thought the owner of the farmer had gone home as of the time he entered the farm Friday evening.\nBut before he arrived there, the suspect had entered into the farm, and was already digging out yam from a heap, when Sunday arrived.\nOpalola said the deceased was on the farm with his younger brother when Sunday arrived there, and altercation ensued among them.\nThe deceased’s younger brother, on sighting the suspect, accused him of always coming around to steal their produce.\nWe also learnt that the suspect attempted to kill the younger brother of the deceased, but he escaped."
  },
  {
    "headline": "Five vehicles crash in Anambra, two men killed, 11 injured",
    "summarized_story": "A multiple auto crash occurred at the Asaba Park, Upper Iweka by Awka-Onitsha Expressway on Sunday.\nFive vehicles were involved in the crash which was attributed to brake failure.\nAbout 22 people, comprising 13 male adults, seven female adults, one male child and one female child, were involved in the crash.\nThe two male adults were confirmed dead by the doctor on duty.\nHe urged motorists ensure that their vehicles comply to minimal safety standards before driving."
  },
  {
    "headline": "Fans blame Okoye for Eagles defeat",
    "summarized_story": "Fans on Sunday blamed newly signed Watford goalkeeper, Maduka Okoye, for his role in Nigeria’s exit at the ongoing Africa Cup of Nations in Cameroon.\nThe Super Eagles suffered a 1-0 defeat to Tunisia to crash out of the AFCON tournament.\nDisappointed fans immediately took to social media to blame the goalkeeper, who they believed should have done better with Msakni’s shot.\nFine USELESS boy on the pitch.”Lukayo jokingly added, “This is the reason why Okoye could not keep that shot.\nWhy Buhari go collect this jersey, video conference never dey enough.”Nnadi simply wrote, “Okoye too sexy for the shot.”Iam_Sannwalaw added, “Hello make una tell Okoye say I no wan see am for this Nigeria again.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Why Nigeria’s GDP would surpass IMF projection – Afrinvest",
    "summarized_story": "By Peter EgwuatuAnalysts at Afrinvest West Africa) Limited, a Lagos based investment banking firm, have projected that in 2022, Nigerian economy would surpass the prediction by the International Monetary Fund, IMF by 0.2 percentage points despite the Gross Domestic Product, GDP, dynamics in 2021.\nThe firm predicted that Nigerian economy would grow by 2.9 per cent while the IMF predicted 2.7 per cent in 2022.\nREAD ALSo:He’s my number one fan, says policewoman promoted CP same day with husbandThe analysts explained: “Nigerian economy would be driven by continued recovery in non-oil GDP.\nFor the oil sector GDP, we expect the gradual increase in Nigeria’s oil production towards the new cap of 1.83mbpd from the earlier 1.45mbpd, to boost the sector’s performance.\nWe do not expect any switch in the current Foreign Exchange, FX management policy of the CBN.”"
  },
  {
    "headline": "FG should use crude surplus to fund budget deficit — Adedipe",
    "summarized_story": "Chief Consultant at B. Adedipe Associates Limited, Dr. Biodun Adedipe, who took this position last week, noted that government should also be responsible to its insurance needs.\nREAD ALSOAPC: Court strikes out suit challenging Buni led CommitteeSpeaking at a media parley with insurance journalists in Lagos, sponsored by Boof Insurance Brokers Limited and B. Adedipe Associates Limited, Adedipe said: “The price of crude has been favourable to us.\nSpeaking on the insurance sector, Adedipe said: “For the insurance sector to grow, government need also to beresponsible to its insurance obligations which talks about paying premium.\nThere also must be need for flexibility and also ensuring that compulsory insurance is enforced because enforcement had always been an issue.\nAnd when insurance sector is vibrant, it will galvanize businesses and individuals to take risk and that is how economies grow."
  },
  {
    "headline": "Edo LGA Forum lauds Obaseki, carpets NULGE on allocations",
    "summarized_story": "They said that the State government has not deviated from the established process of sharing federal allocation and other sources of revenue to the 18 Councils.\n“At such meetings, there is always a robust debate before decisions are reached and the money distributed accordingly.\n“The State Government does not introduce any extraneous factor in the sharing outside what is permitted by law.\n“We are baffled and cannot explain why the state president of NULGE would single out the Obaseki administration as a culprit, this beats our imagination.\n“Since April 2021 and due to the Obaseki Administration efforts at repositioning the Councils, salaries are regular and efforts are on top gear to settle the backlogs,” the statement declared."
  },
  {
    "headline": "Magado: House of reps probe on Malami, IGP, a witch-hunting venture – Counsel, Shangisha Landlords Ass",
    "summarized_story": "House of Representatives had mandated its committee on Justice, public petition and police to investigate the involvement of the duo.\nCounsel to Shangisha Landlords Association, Deji Fasusi, while reacting to House of Representatives probe and media reports in a statement, yesterday, said it was another card in their bag of tricks to frustrate the due execution of the Judgment of the Supreme Court.\nFor the discerning minds, this latest lame attempt at probe is another card in their bag of tricks to frustrate the due execution of the Judgment of the Supreme Court.\nTheir connivance, backhand dealings and double-speak is legendary.\n“Thus, this attempt at a needless probe is nothing but a witch-hunt and it is a legislative over-reach in all the circumstances."
  },
  {
    "headline": "APC: Court strikes out suit challenging legality of Buni-led CECPC",
    "summarized_story": "The Federal High Court ruling has therefore put to rest issues surrounding the legality of the Buni-led Caretaker Extra-Ordinary Convention Planning Committee.\nA Delta State High Court, had on October 15, 2021, struck out an action filed by Elvis Ayomanor and others, challenging the APC Ward, LGA and State Congresses.\nThe Court held that the action was non-justiciable and incurably incompetent, noting that the substratum of the matter bordered on the internal affairs of the ruling APC.\nWhat we have is an attrition of interests, which is normal in a ruling party that many believe will continue to lead Nigeria beyond 2023.\nPDP is saying there is a problem in APC, and their Governors, Senators and other heavyweights are dumping their party for the ruling APC."
  },
  {
    "headline": "2023: God can pick female president from Living Faith Church – Bishop Oyedepo",
    "summarized_story": "Bishop David Oyedepo of Living Faith Church, on Sunday, said God can pick Nigeria’s next president from his church.\nOyedepo made the remark while noting that God can pick a female president from Living Faith Church.\nAccording to Oyedepo: “And it is important for me to mention to members of the church because another time is here now.\n“Don’t get me wrong, God can pick a president from this church.\nThat President could even be a female.”"
  },
  {
    "headline": "King Kosoko Royal Family, Oloja of Lagos dissociate from Island violence",
    "summarized_story": "King Kosoko Royal Family and Oloja of Lagos say they have no hands in the Lagos Island unrest that erupted on January 19.\nLast week, two days of bloody clashes disrupted activities in Idumota, Kosoko, Oluwole, Martins and Balogun areas.\nA statement by Alhaja Mutiot Ashabi Alli-Balogun (King Kosoko Royal Family) and Prince Abiola Olojo-kosoko, Head of Family (Oloja of Lagos-elect) condemned the violence.\nThe families unequivocally stressed that they played no part in the “Idumota Vs Kosoko” face-off.\nThey said King Kosoko Royal Family is not an organisation but a reputable royal/chieftaincy family in Lagos State and three other West Africa countries."
  },
  {
    "headline": "Youth-based group lauds National Assembly for supporting NYSC Trust Fund Bill",
    "summarized_story": "A youth-based organization that specializes in human rights and good governance, on Sunday, applauded members of the National Assembly for giving overwhelming support to the Bill seeking to established a National Youth Service Corp (NYSC) Trust Fund.\nDAILY POST reported that, a Bill for an Act to establish National Youth Service Corps Trust Fund (NYSCTF) passed second reading in the House of Representatives on Thursday.\nThe Bill which seeks to provide a sustainable source of funds for National Youth Service Corps (NYSC) was sponsored by Rep. Akinfolarin Mayowa (APC-Ondo) at the plenary on Thursday.\nWhen eventually passed, the Bill seeks adequate funding of serving Corps members and as such, save them of endless search for government jobs.\nOgwu, however, urged President Muhammadu Buhari to assent the Bill as soon it leaves the National Assembly."
  },
  {
    "headline": "Oshiomhole clears air on calling Makinde ‘over hyped social media gov’",
    "summarized_story": "Adams Oshiomhole, former National Chairman of the All Progressives Congress, APC, has reacted to tweets disparaging Governor Seyi Makinde of Oyo State.\nOshiomhole denied calling Makinde ‘an over hyped social media governor’.\nThe APC National Chairman described the Twitter handle as fake.\nAccording to the former Comrade governor, the handle is not operated by him or any of his aides.\nThe statement reads: “The attention of Comrade Adams Oshiomhole has been drawn to a series of tweets from a twitter account @A_Oshiomhole commenting on recent national issues."
  },
  {
    "headline": "Insecurity: University of Maiduguri safe for learning – VC tells Nigerians",
    "summarized_story": "The Vice Chancellor of the University of Maiduguri (UNIMAID), Prof. Aliyu Shugaba has said that Borno, particularly the State capital, Maiduguri, is now safe for learning.\nThe Vice Chancellor said this when he featured on the News Agency of Nigeria (NAN) Forum in Abuja, advising prospective students not to entertain fears of insecurity in the State.\nHe said that the security situation in Borno State had improved significantly.\n“I know we have had our share of challenges as a state but the security situation has improved tremendously.\n“For instance we have put up mega halls with 500 to 700 students capacity,” he said."
  },
  {
    "headline": "Conflicting orders: NBA keeps mum on erring lawyers",
    "summarized_story": "Over one month after the National Judicial Council (NJC) decided on three judges involved in granting conflicting orders, the Nigerian Bar Association (NBA) has not decided on the fate of lawyers involved in similar unprofessional conducts.\nBoth committees of the NJC and NBA concluded their assignments about the same period and handed in their reports last November.\nThe judges recommended for punishment are: Justices Okogbule Gbasam (of the Rivers State High Court) and Nusirat Umar (Kebbi State High Court) and the Rivers State (Cross River State High Court).\nOver one month after the NJC made public its disciplinary measures against judges involved in the issuance of conflicting orders, the NBA has failed to move against lawyers involved in the same cases.\nThe NBA has neither taken action nor made public pronouncement on what it did with the report submitted by the Ajibade-led committee."
  },
  {
    "headline": "100m jobs: We’ve created SMEs across Nigeria, says Fed Govt",
    "summarized_story": "The Federal Government has said it had created Small and Medium-sized Enterprises (SMEs) all over the 36 states.\nIt said virtually all the companies in Niger and some other states owe their origin to Federal Government’s incubation programmes.\nThe Federal Government also said many incubatees that started as start-ups have become SMEs through government’s incubation processes.\nMany of the incubatees that started small as micro businesses; today, many of them have become small and medium-sized businesses all over the country.\nThen, we ensure they are all sent to NBTI, where NBTI brings in people as incubatees and pass on the knowledge to them."
  },
  {
    "headline": "Please pray for my health, Olisa Metuh begs Nigerians",
    "summarized_story": "Former National Publicity Secretary of the Peoples Democratic Party (PDP) Olisa Metuh has called on Nigerians to pray for him over his health.\nMetuh, in a terse post on his official Facebook page, accompanied with a photo of him on the hospital bed, said he’s had many surgeries in the last year.\nRead Also: Court admits Olisa Metuh to N250m bail“No matter how angry you’ve been about my outspokeness or outright naked challenge to power back then, please pray for me.\n- Advertisement -“The cankerworm had eaten deeply into my health, it has not been easy and I have only remained whole through the mercies of God.\n“I got some [scary] news from the surgeons today but my faith remains in God Almighty and with your prayers and by His stripes I am healed and would remain whole in Jesus name.”"
  },
  {
    "headline": "How MKO Abiola died, by Abdulsalami",
    "summarized_story": "Former Head of State General Abdulsalami Abubakar has broken his silence on how winner of the June 12, 1993 presidential election late Moshood Kashimawo Abiola died while in detention.\nAbiola died on July 7, 1998 when Abubakar was in power.\nRather, he said he died after falling ill while receiving a delegation from the United States of America.\n- Advertisement -According to him: “Well, I smile because there were lots of allegations here and there that we killed Abiola.\nSo because I had authorized the American team to see him, so the other part of the family were waiting to see him."
  },
  {
    "headline": "2023: Okowa to opposition parties: Don’t waste your time, money",
    "summarized_story": "Delta State governor, Dr Ifeanyi Okowa, has counselled aspirants in other political parties in the state interested in elective office, not to waste their time and money, as the People’s Democratic Party (PDP) will win the 2023 election by a landslide.\nHe assured PDP members in the state of free, fair and transparent primary elections ahead of 2023 general elections.\nOkowa who spoke at a PDP rally in Asaba, yesterday, affirmed that the party remained one united family in the state.\nHe assured that leaders of the party in the state would ensure that primaries for all elective positions were free and credible.\n“We work as a family with the love of God but in the other parties, they are always fighting themselves,” the governor said."
  },
  {
    "headline": "BREAKING: COVID-19 ravaged Tunisia defeats Nigeria 1-0",
    "summarized_story": "The Cathage Eagles of Tunisia has defeated the Super Eagles of Nigeria to qualify for the quarter finals of the African Cup of Nation holding in Cameroun.\nTunisian team caused an upset in the Africa Cup of Nations by beating Nigeria 1-0 in the round of 16.\nThe Super Eagles were one of the favourites to win the tournament, but have crashed out following Youssef Msakni’s strike from outside of the box early in the second half.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nNigeria’s woes were compounded when Everton winger Alex Iwobi was shown a straight red card (after a VAR review) for a dangerous challenge on goalscorer Msakni just five minutes after coming on as a substitute."
  },
  {
    "headline": "BREAKING: Fire razes building in Aba, destroy property worth millions",
    "summarized_story": "From Okey Sampson, UmuahiaA late afternoon inferno has razed a storey building housing lock-up shops along Ngwa road by Emejiaka Street Aba, Abia State.\nReports say the fire which started around 3 pm on Saturday from a clothing shop destroyed property worth millions of Naira.\nIt was gathered that while the inferno was raging, some residents of adjourning buildings who felt the fire might spread to their buildings, started packing out their household belongings, while others scampered for safety.\nResidents resorted to self-help by using buckets to get water from where they could to attempt putting the fire off, as firefighters were nowhere to be found.\nThe boss of Abia Fire Service could not be immediately reached on the incident."
  },
  {
    "headline": "Human trafficking: Edo vigilante rescues 28 victims in Benin",
    "summarized_story": "From Tony Osauzo, BeninA team of local vigilantes has rescued 28 victims of human trafficking in Benin City, the Edo State capital.\nThe state Coordinator, Edo State Community Vigilante Security Network, Oboh Emmanuel Otoide, disclosed this while addressing journalists at the weekend in Benin City.\n“The victims were rescued by our men around 2 am on Tuesday along Akpakpava Road in Benin City.\n“Our preliminary investigations revealed that the victims were being moved from the South East, enroute Edo State, to the South West of the country,” he said.\nHe added that in another operation, officials of the Edo State Community Vigilante Security Network arrested a man who robs people of their personal belongings while pretending to be insane."
  },
  {
    "headline": "Abia North stakeholders commend Kalu for quality representation",
    "summarized_story": "From Okey Sampson, UmuahiaA political pressure group, Abia North Youths Stakeholders for Development (ANYSD) has commended the Chief Whip of the Senate, Senator Orji Uzor Kalu, for his quality representation at the upper chamber of the National Assembly and also reaffirmed its support for his developmental efforts.\nThe non-governmental organisation in a statement signed by its coordinator, Dr. Ijoma Okoro Ijoma, said Senator Kalu has given the senatorial district a voice at the table of national discourse.\nThe group therefore passed a vote of confidence on Kalu and promised to follow his political direction in 2023.\n“Our support for Senator Orji Uzor Kalu is unflinching.\nToday, all the youth stakeholders across Abia North hereby pass a vote of confidence on him."
  },
  {
    "headline": "Ex-agitators beg companies to return to Niger Delta, say days of violence over",
    "summarized_story": "From Femi Folaranmi, YenagoaEx-agitators have pleaded with companies especially oil companies that relocated from the Niger Delta region following spate of insecurity triggered by militancy to return to the region promising uninterrupted peace.\n“Companies that have left the Niger Delta because of insecurity need to return, this is the purpose for sensitization.\nNature pointed out that a major setback to the development of the Niger Delta was the absence of proper coordination among key stakeholders.\nHe said with the right synergy, the Ministry of Niger Delta Affairs, the Niger Delta Development Commission (NDDC), Ministry of Environment, Ministry of Petroleum Resources, the Presidential Amnesty office, could hasten the needed development of the region.\nThe sensitization programme commenced in Bayelsa state with 150 Niger Delta youths in attendance and would be held across the nine states of the region to create adequate awareness."
  },
  {
    "headline": "Nothing will Bring Me Back to Partisan Politics, Obasanjo Tells PDP Leaders",
    "summarized_story": "*Buhari’s administration clueless, piling eternal debts, says AyuJames SowoleFormer President Olusegun Obasanjo yesterday restated his vow not to return to partisan politics.\nObasanjo, 84, made this known when a delegation of the leaders of the Peoples Democratic Party (PDP) led by the National Chairman of the party, Dr. Iyorchia Ayu, visited him at his residence in Abeokuta, Ogun State.\nHowever, after the closed-door meeting, Obasanjo publicly told his guests to bear in mind that he was no longer in partisan politics.\nWhatever I do in my own life, because I became president on the platform of PDP, PDP will continue to be part of the history of my life.\n“Even though you retired from partisan politics, partisan politics will never retire from your blood, because you want the right thing done and since you want the right thing done, for the life you will remain the emeritus member of the PDP."
  },
  {
    "headline": "2023: INEC Warns Political Parties, Aspirants against Early Campaigns",
    "summarized_story": "“Political parties are aware that based on the existing law, the period for campaigning in public has not matured and has not come into force.\nThe INEC commissioner reminded the political parties that the timetable and schedule of activities for the 2023 general election have not been released by the commission.\n“Furthermore, Section 99 of the Electoral Act, 2010 (as amended) prescribes and circumscribes the period of campaigning in public by political parties.\nBased on the existing law, campaigns in public shall commence 90 days before polling day and end 24 hours before that date.\n“However, section 99 of the Act recognises that political parties are not the only operators in the electoral process."
  },
  {
    "headline": "MPC: Analysts Caution against Interest Rate Increase",
    "summarized_story": "Festus AkanbiAs the Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) begins its first meeting for the year 2022, in Abuja tomorrow, economic analysts have advised against hike in the Monetary Policy Rate (MPR) despite the mounting pressure on the apex bank to announce a higher rate.\nIt however insisted that the monetary policy committee may not yield to the temptation of tampering with the current rate.\nThis increases the chances of a tighter monetary policy stance although it is highly unlikely at this time,” the report stated.\nThus, we expect the MPC to maintain the status quo on all monetary policy parameters.\nThe CBN MPC noted that holding stance would allow current recovery in output and decline inflation continue."
  },
  {
    "headline": "I Have No Intention to Vie for APC Chairmanship, Buni Clarifies",
    "summarized_story": "As you know, he is a serving governor, the Executive Governor of Yobe State and comfortably piloting the affairs of the state.\n“But l want to assure you that Governor Buni has not discussed with anyone that he is contesting any position.\nThe presidential aide said this in Ado Ekiti yesterday during an interaction with journalists on the January 27 APC primary to elect its flagbearer.\nAll of us in APC must be able to come together and work to win in June.\nOn the aspirant he is backing in APC for the primary, Ojudu said: “For now, I am not in support of anybody."
  },
  {
    "headline": "Confusion Reigns in APC over Chairmanship, Buni Scheming",
    "summarized_story": "One of the chairmanship aspirants from the zone and the Minister of Special Duties, George Akume, yesterday insisted that the party had zoned the chairmanship to North-central and commended the party’s leadership for doing so.\nMustapha who spoke through his media aide, Dapo Okunbanjo said he remained the frontrunner for the number one party position.\nThe source said: “Buni wants to remain National Chairman; forcing him to organise a National Convention was just a temporary setback.\nThe plan is to declare the National chairmanship position open to the entire North, so that he can contest.\nThis guy wants to conduct the 2023 APC primaries and it will be tough stopping this ambition,” added the source."
  },
  {
    "headline": "BREAKING: Nigeria’s Secret Police, DSS Storms Journalist’s House, Whisk Him Away In Front Of Wife, Children",
    "summarized_story": "Bara Ogidi, a Bayelsa State-based journalist and the publisher of tracknews.ng has been arrested by operatives of the Department of the State Security (DSS).\nSaharaReporters learnt that Ogidi’s arrest on Sunday was in connection with an alleged controversial libel suit involving the Executive Secretary of the Nigerian Content Development and Monitoring Board, Simbi Wabote, and the publisher of the Point Blank News, Jackson Ude.\nA family source said DSS operatives numbering 15, stormed his residence and whisked him away in the presence of his wife and children to an unknown destination.\nMore details are still unfolding on the incident."
  },
  {
    "headline": "BREAKING: Nigeria’s Secret Police, DSS Storms Journalist’s House, Whisk Him Away In Front Of Wife, Children",
    "summarized_story": "Bara Ogidi, a Bayelsa State-based journalist and the publisher of tracknews.ng has been arrested by operatives of the Department of the State Security (DSS).\nSaharaReporters learnt that Ogidi’s arrest on Sunday was in connection with an alleged controversial libel suit involving the Executive Secretary of the Nigerian Content Development and Monitoring Board, Simbi Wabote, and the publisher of the Point Blank News, Jackson Ude.\nA family source said DSS operatives numbering 15, stormed his residence and whisked him away in the presence of his wife and children to an unknown destination.\nMore details are still unfolding on the incident."
  },
  {
    "headline": "BREAKING: Nigeria’s Secret Police, DSS Storms Journalist’s House, Whisk Him Away In Front Of Wife, Children",
    "summarized_story": "Bara Ogidi, a Bayelsa State-based journalist and the publisher of tracknews.ng has been arrested by operatives of the Department of the State Security (DSS).\nSaharaReporters learnt that Ogidi’s arrest on Sunday was in connection with an alleged controversial libel suit involving the Executive Secretary of the Nigerian Content Development and Monitoring Board, Simbi Wabote, and the publisher of the Point Blank News, Jackson Ude.\nA family source said DSS operatives numbering 15, stormed his residence and whisked him away in the presence of his wife and children to an unknown destination.\nMore details are still unfolding on the incident."
  },
  {
    "headline": "COVID-19: Nigeria Records 29 Fresh Infections, Lowest In Two Months",
    "summarized_story": "The Nigeria Centre for Disease Control has said that 29 people tested positive for Coronavirus on Saturday.\nThe figure is the country’s lowest single-day count since November 19, 2021 when 23 cases were reported.\nIn its latest update, NCDC said the positive cases of Coronavirus came from three states.\nNo death figure was recorded from COVID-19 complications, leaving the death toll at 3,124.\nSince the index case in February 2020, a total of 251,959 Coronavirus infections have been confirmed across Nigeria — out of which 22,889 are active cases."
  },
  {
    "headline": "COVID-19: Nigeria Records 29 Fresh Infections, Lowest In Two Months",
    "summarized_story": "The Nigeria Centre for Disease Control has said that 29 people tested positive for Coronavirus on Saturday.\nThe figure is the country’s lowest single-day count since November 19, 2021 when 23 cases were reported.\nIn its latest update, NCDC said the positive cases of Coronavirus came from three states.\nNo death figure was recorded from COVID-19 complications, leaving the death toll at 3,124.\nSince the index case in February 2020, a total of 251,959 Coronavirus infections have been confirmed across Nigeria — out of which 22,889 are active cases."
  },
  {
    "headline": "Player ratings: Disbelief, shock as Carthage Eagles humble Nigeria's Super Eagles",
    "summarized_story": "The Super Eagles of Nigeria suffered a shock 1-0 defeat by COVID-19-stricken Tunisia, exiting the Africa Cup of Nations (AFCON) in the round of 16.\nOla Aina (3/5): The Torino man was the more adventurous of Nigeria’s fullbacks before and after Alex Iwobi’s dismissal.\nHe however showed attacking instinct after Nigeria went down to 10 men but without an end product.\nShould have been the first player substituted but he remained on the pitch until 10 minutes after Nigeria bagged a red card.\nHis last-minute shot went agonisingly inches wide of the far post."
  },
  {
    "headline": "Player ratings: Disbelief, shock as Carthage Eagles humble Nigeria's Super Eagles",
    "summarized_story": "The Super Eagles of Nigeria suffered a shock 1-0 defeat by COVID-19-stricken Tunisia, exiting the Africa Cup of Nations (AFCON) in the round of 16.\nOla Aina (3/5): The Torino man was the more adventurous of Nigeria’s fullbacks before and after Alex Iwobi’s dismissal.\nHe however showed attacking instinct after Nigeria went down to 10 men but without an end product.\nShould have been the first player substituted but he remained on the pitch until 10 minutes after Nigeria bagged a red card.\nHis last-minute shot went agonisingly inches wide of the far post."
  },
  {
    "headline": "Tunisia send Nigeria packing from 2021 AFCON",
    "summarized_story": "Tunisia qualified for the quarter-final of the Africa Cup of Nations (AFCON) after beating Nigeria 1-0 at Ominisports Roumde Adjia Stadium on Sunday.\nThe Carthage Eagles went ahead in the early minutes of the second half, and although they fought hard, the Super Eagles could not muster a comeback.\nTunisia took the lead shortly after the second half got underway.\nSubstitute Alex Iwobi made matters worse for Super Eagles when he was sent off after a dangerous tackle.\nFollowing the sending off, the Super Eagles went close through Samuel Chukwueze, Moses Simon and Sadiq Umar — but their efforts failed to pay off."
  },
  {
    "headline": "Tunisia send Nigeria packing from 2021 AFCON",
    "summarized_story": "Tunisia qualified for the quarter-final of the Africa Cup of Nations (AFCON) after beating Nigeria 1-0 at Ominisports Roumde Adjia Stadium on Sunday.\nThe Carthage Eagles went ahead in the early minutes of the second half, and although they fought hard, the Super Eagles could not muster a comeback.\nTunisia took the lead shortly after the second half got underway.\nSubstitute Alex Iwobi made matters worse for Super Eagles when he was sent off after a dangerous tackle.\nFollowing the sending off, the Super Eagles went close through Samuel Chukwueze, Moses Simon and Sadiq Umar — but their efforts failed to pay off."
  },
  {
    "headline": "Afegbua hits Atiku: Don't be a perpetual presidential aspirant -- you've reached retirement age",
    "summarized_story": "Kassim Afegbua has advised Atiku Abubakar, former vice-president, not to contest the presidency in 2023.\nHe said the Peoples Democratic Party (PDP) must zone its 2023 presidential candidacy to the south, and as such, Atiku should “ditch his quest”.\nAfegbua was the spokesperson of the Atiku Abubakar Presidential Campaign Organisation during the 2019 elections.\nIn a statement on Sunday, Afegbua said Atiku should not make himself a “perpetual candidate” for the presidency.\nIt will be against the run of play and natural justice for any aspirant of Northern extraction to show interest in the 2023 presidential election within the Peoples’ Democratic Party threshold."
  },
  {
    "headline": "Ismael Belkhayat on his way to building Morocco's first unicorn",
    "summarized_story": "For Belkhayat, who has since adopted Ironman as his alias, competing at the sport can be likened to building a business.\nThe next idea came during a trip; Belkhayat had chosen to accompany his wife Sophia Alj, ex-strategy consultant at McKinsey, during a business trip.\nAccording to Belkhayat, Chari currently transacts about $2.5 million monthly.\nBelkhayat the strategistBased on lessons from his previous startups, Belkhayat carved a different operational strategy for Chari, a strategy that rounds up its liability to almost zero.\nEven though Belkhayat is bullish on expanding in many African countries in the coming months, there are countries he won’t go to."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Meet the winners of Techpoint Awards 2021",
    "summarized_story": "Share this article:As part of Techpoint Build 2021, we put out a call, asking the public to nominate outstanding startups in various categories.\nAfter a keenly contested affair, the winners of the Techpoint Awards were announced today during a dinner.\nMost Outstanding Mobility & Logistics Company 2021Mobility and logistics are essential for the movement of goods and humans.\nWinner: FlutterwaveFlutterwave caps off an eventful year as winners, following it up with their unicorn milestone achieved in 2021.\nEditorial Choice AwardsHaving covered startup activities over the last seven years, Techpoint Africa’s editorial team picked the winners in this category."
  },
  {
    "headline": "Ghana’s Worldtech Consult wins Techpoint Build 2021 Pitchstorm 3.0, receives $10,000 prize",
    "summarized_story": "Share this article:Today, January 22, 2022, Techpoint Build 2021 ended in grand style with the Pitchstorm 3.0 winner announcement.\nPitchstorm 3.0 FinalistsThe Ghanaian-founded agritech startup, Worldtech Consult successfully made it through three elimination stages to win a $10,000 non-equity fund, the third winner since the competition started in 2018.\nWorldtech Consult, Pitchstorm 3.0 winnerForcardio and Ugandan-founded Dokitar, that emerged runners-up in the health category also went home with ₦1 million and ₦2 million courtesy 54gene, one of the sponsors of Techpoint Build 2021.\nFollowing a call for exciting tech innovations across West Africa, this edition of Pitchstorm received 149 entries.\nPitchstorm is Techpoint Africa’s annual startup competition, where we learn about new and exciting solutions to Africa’s problems while rewarding the solution providers for their innovative ideas."
  },
  {
    "headline": "Techpoint Build Spotlight: 54Gene is developing world class health technologies for Africa",
    "summarized_story": "Share this article:In recent years, Africa has lagged behind the rest of the world in medical technologies and research.\nJust 3% of African genomic data is represented in global medical research.\nAdvertisementToday’s personality on Techpoint Build Spotlight, Delali Attipoe, COO of 54Gene, takes a little peek at what’s to come in health research.\n54gene’s role in African healthcare is to ensure that disease treatments and therapies for Africans are more suited to their genetic composition because personalized medicine is the future of healthcare.\nWhat makes you excited about Techpoint Build 2021Participating in Techpoint Build not only gives us an opportunity to tell the amazing 54gene story and our impact in healthcare so far but also reinforces our position as a leading technology-based genomics research startup."
  },
  {
    "headline": "PDP’s Obasanjo cancelled debts, but APC’s Buhari puts Nigerians in bondage – Ayu",
    "summarized_story": "whatever I do in my own life because I became president on the platform of PDP.\nPDP will continue to be part of the history of my life.\nIdi Amin came to me and he said ‘my brother, you have an Africa load and it is on your shoulder, I pray God will help you carry the Africa load’.\n“Iyocha, you have PDP load with Nigeria load and it is only God that can help you to carry this load which of course, I believe if God gives you a responsibility, he will also give you the wherewithal to be able to carry that responsibility.\nI think you can answer that, I will not answer for you, but if you ask me, I retired 14 years ago and I remain retired and"
  },
  {
    "headline": "Dangote’s giant Oil Refinery to Begin Production in Third Quarter of 2022",
    "summarized_story": "Nigeria’s giant new Dangote oil refinery will start processing crude in the third quarter of this year and many analysts say it has the potential of being a game-changer for Africa’s largest economy.\nRead also: Nigeria’s oil production declines 78,000 barrels as OPEC pumps moreThe plant will start with a processing capacity of 540,000 barrels a day, Dangote said.\n“Full production can start maybe, by the end of the year or beginning of 2023,” he said.\nThe facility, which will cost an estimated $19 billion to build, has an installed capacity of 650,000 barrels per day.\nIts output will be more than enough to meet Nigeria’s fuel demands and turn Africa’s largest crude producer into an exporter of refined crude."
  },
  {
    "headline": "Wanted! Private sector player as president in 2023",
    "summarized_story": "“Is anything wrong if Manufacturers Association of Nigeria (MAN), Nigeria Economic Summit Group (NESG), Nigeria Employers’ Consultative Association (NECA), and some other private sector players sponsor one of their members?\nHowever, the seeming quality leadership by Ramaphosa is coming from his wealth of experience in the private sector.\nThe likes of Kingsley Moghalu, Sam Ohuabunwa, and others from the private sector, who have proven themselves, should be given a chance,” Umelahi said.\n“Although, the private sector players influence public policies, especially if they play a key role in the emergence of the political office holder.\nYou are talking about leadership; leadership is actually simpler than how complex we make it to be."
  },
  {
    "headline": "Obaseki to swear-in new Perm Secs Tuesday – Nigerian Observer",
    "summarized_story": "Obaseki to swear-in new Perm Secs TuesdayShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki will, on Tuesday, January 25, 2022, swear-in the newly appointed Permanent Secretaries.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the swearing-in will hold at the New Festival Hall in Government House, Benin City, the state capital.\nThe newly appointed Permanent Secretaries include: Peter Aikhoumobhogbe; Iserhienhien Edamwen Efe; Grace Osaro Aihie; Osaro Washington Abbe; Bose J. Igbinobaro; Anelu Julius Osemen; Asemota Osagie Uyi and Gilbert Egwakhide.\nOthers are Asibor Omokhegbele Lucky; Felicia Edwards; Ifueko Alufokhai; Osikhena Omo Ojior and Toritseju Onaiwu."
  },
  {
    "headline": "Edo vigilante rescues 28 victims of human trafficking in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CIY – A team of local vigilantes in Benin City, the Edo State capital, has rescued 28 victims of human trafficking.\nThe State coordinator, Edo State Community Vigilante Security Network, Oboh Emmanuel Otoide, disclosed this while addressing journalists at the weekend in Benin City.\nAccording to him, “The victims were rescued by our men around 2 a.m on Tuesday along Akpakpava Road in Benin City.\nAmong the items recovered from the suspects include ATM cards belonging to victims of his criminal acts.”He said the Edo State Community Vigilante Security Network is working assiduously with other security agencies in the state to secure the state.\nThe coordinator urged residents to report criminal activities to Edo State Community Vigilante Security Network Central Base Control Room through 09153333340 or 09153333341."
  },
  {
    "headline": "250 Solar streetlights: Abudu community commends group – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – Residents of Abudu, administrative headquarters of Orhionmwon local government area of Edo state have expressed appreciation to members of Abudu in Diaspora Group for the installation of 250 solar streetlights in the community.\nAccording to the residents, the solar street lighting is a delight to them as it would enhance night life and boost socioeconomic activities in the community, which has been without power for more than four years.\nThe Odionwere (Head) of the community, Pa Mathew Ehioghae commended the group for the project, saying, “they are on the right part”.\nA resident, Victor Agada however enjoined the donors to ensure the solar streetlights are maintained regularly to stand the test time.\nThe diaspora group is a nonprofit and apolitical association of Abudu indigenes residing in different parts of the world, with the aim to give back to their community."
  },
  {
    "headline": "Herdsmen: Normalcy returns to Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – There was chaos at Abudu, administrative headquarters of Orhionmwon local government area of Edo State on Friday morning, following the killing of a young man on Thursday in the community by suspected herders.\nAn altercation had ensued between the suspected herders and some farmers inside a farming area where the herdsmen also have camps.\n“They (farmers) meet the Fulani people for road inside the bush wen dem wan go find their dog; na dem begin challenge dem (Fulani) to comot for road.\nIt took the police at Abudu divisional headquarters and elders of the community hectic time to calm the youths before normalcy was restored to the area.\nIt was learnt the suspected killer is being detain at the state police headquarters in Benin city."
  },
  {
    "headline": "Osun alleviating poverty through social intervention programmes – Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Gboyega Oyetola has said the various social intervention programmes by his administration is geared towards poverty alleviation in the state.\nOyetola said this during an engagement programme organised by the State’s Civic Engagement Centre on Sunday in Akola village, Oriade Local Government Area.\nOyetola noted that social intervention and safety net programmes was about improving the well-being of every individual in society.\n“While special platform is being provided for the physically challenged to acquire adequate skill acquisition training under our administration’s special needs framework.\n“As a matter of fact, several youths are benefiting and achieving their potentials through different social intervention schemes like Youth Empowerment Scheme (OYES), Youths Employment and Social Support Operation (YESSO), rejuvenation of sporting activities, as well as O’meal catering for our school pupils."
  },
  {
    "headline": "Food Support Scheme: Positive feedback have justified our noble intent – Osun Govt",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State Government on Friday reaffirmed its commitment to sustaining the monthly Food Support Scheme initiated to cushion the effects of the national economic downturn on vulnerable citizens of the state.\nIt further disclosed that over 300,000 vulnerable households had benefited directly while many had also benefitted indirectly since the inauguration of the Scheme.\nThis is even as the government flagged off the 10th edition of the scheme and commenced immediate distribution of the food items to the beneficiaries.\nLekan Badmus, lauded the Governor for placing the scheme on his priority list.\n“As we all know, during the official flag off of this Scheme, Mr."
  },
  {
    "headline": "Nigeria attracts $31.82bn from six countries from in three years",
    "summarized_story": "Figures from the National Bureau of Statistics (NBS) indicate that capital inflows to Nigeria from the United States, United Kingdom, South Africa, United Arab Emirates, the Netherlands, and Mauritius hit $31.82bn in three years.\nAccording to the NBS data, the six countries accounted for 83.32 per cent of the total capital of $38.18bn imported into Nigeria from over 100 countries from January 2019 to September 2021.\nThe capital importation data is obtained from the Central Bank of Nigeria and includes imported physical capital, such as equipment, and financial capital importation, NBS said.\nAccording to the bureau, capital importation comprises three main investment categories, namely foreign direct investment, foreign portfolio investment, and other investments.\nCapital inflow from the six countries declined from $20.09bn in 2019 to $7.94bn in 2020."
  },
  {
    "headline": "IMF proposes $50bn Trust Fund for Nigeria, other developing countries",
    "summarized_story": "The International Monetary Fund (IMF) is proposing a $50 billion trust fund for Nigeria and other low and vulnerable middle-income countries.\nIn a blog post published on Thursday, it explained that the fund was targeted at helping countries in that category to build resilience and sustainability.\n“A proposed $50-billion trust fund could help low-income and vulnerable middle-income countries build resilience to balance of payments shocks and ensure a sustainable recovery,” said the Washington-based institution.\nRecall that Nigeria was allocated about $3.35 billion of the sum, as part of the historic general allocation of SDRs of the IMF.\nThe amount allocated to Nigeria is as a result of the exchange rate of reference which is 0.702283 SDR to a dollar, and Nigeria has 2.4545 billion SDRs as of July 1, 2021."
  },
  {
    "headline": "Ortom Flags Off Benue Aerial Survey",
    "summarized_story": "Benue State Governor Samuel Ortom has flagged-off the digital photography and aerial survey to commence the capturing of the entire land mass in the state and eliminate the issue of duplication of Certificates of Occupancy alongside other land issues.\nThe survey, our correspondent gathered, is part of the Benue Geographic Information Services project initiated by the administration.\nHe said the intention of government was to qualify for the World Bank grant of $5 million.\n“When this project is completed, we have succeeded in computerising the entire land mass in the state and the administration of land will be easy.\nADVERTISEMENTCommending the contractors for a good job, the governor said the intention was to complete the project and put it into use by April or before next Democracy Day celebration."
  },
  {
    "headline": "FCT Elections: Allow Our Votes To Count, Natives Beg INEC",
    "summarized_story": "Ahead of the February 12 Federal Capital Territory (FCT) area council elections, natives of the FCT have appealed to the Independent National Electoral Commission (INEC) to ensure that their votes count in the election.\nThat is why we are appealing to INEC to make sure that our votes count.\n“INEC should not allow selfish politicians to rig the election and thereby put us in another round of suffering again.\nWe need a serious political change in this FCT and we want to achieve that through the coming elections.\n“They should know that selling their votes is selling their birthright for another three years because politicians who buy their votes do not care about their future."
  },
  {
    "headline": "Buhari Can’t Claim Ignorance Of Fuel Subsidy Withdrawal – Labour Veterans",
    "summarized_story": "Former Leaders of the Nigerian Labour Congress (NLC) have faulted comments credited to the senate president, Ahmad Lawan, that President Muhammadu Buhari was not aware of any plan to withdraw fuel subsidy in the country.\nThe labor veterans who said there was no way President Buhari would claim ignorance of the move to remove subsidy, urged the senate president to desist from creating confusion in the country.\nThe former labour leaders who made the remarks yesterday during the Kano state congress meeting of NLC declared that labour would not accept any strategy of the government to withdraw fuel subsidy and increase fuel price.\n“Let the senate president not come and confuse Nigerians the more because we would not make any move to withdraw the subsidy.\nHe said: “Yes, I believe the federal government is spending more than what they claim on subsidy and that is callously irresponsible."
  },
  {
    "headline": "Buhari Can’t Claim Ignorance Of Fuel Subsidy Withdrawal – Labour Veterans",
    "summarized_story": "Former Leaders of the Nigerian Labour Congress (NLC) have faulted comments credited to the senate president, Ahmad Lawan, that President Muhammadu Buhari was not aware of any plan to withdraw fuel subsidy in the country.\nThe labor veterans who said there was no way President Buhari would claim ignorance of the move to remove subsidy, urged the senate president to desist from creating confusion in the country.\nThe former labour leaders who made the remarks yesterday during the Kano state congress meeting of NLC declared that labour would not accept any strategy of the government to withdraw fuel subsidy and increase fuel price.\n“Let the senate president not come and confuse Nigerians the more because we would not make any move to withdraw the subsidy.\nHe said: “Yes, I believe the federal government is spending more than what they claim on subsidy and that is callously irresponsible."
  },
  {
    "headline": "My Husband Was Never Ill Before Death, Says Ex-CNS’s Wife",
    "summarized_story": "Wife of the late former chief of naval staff, Vice Admiral Ishaya Iko Ibrahim, Mrs Grace Ibrahim, said her late husband never fell ill in their 45 years of marriage before he died recently.\nShe said before his death, her husband in his last moments exercised, trying to prove that he was healthy.\nShe said her late husband was a God loving man whom she believes is already with the Lord.\nMrs Ibrahim, who spoke at the wake keep for her husband, said, “We are here to celebrate my husband of 45 years.\nWe didn’t know, neither did my husband know, because the sickness that took him to hospital was the sickness that everyone had around this period."
  },
  {
    "headline": "AFCON: Super Eagles sent home by Tunisia",
    "summarized_story": "The Super Eagles of Nigeria are out of the 2021 Africa Cup of Nations.\nThis is after Tunisia shocked the Super Eagles of Nigeria by scoring two minutes into the second half.\nSuper Eagles had faced a tough challenge in the first half of their encounter against Tunisia at the ongoing Africa Cup of Nations.\nSimon played a major role when the Super Eagles won their group matches against Egypt, Sudan, and Guinea Bissau.\nStruck by many absences, including 12 players testing positive for COVID-19, Tunisia proved tougher for the Super Eagles than expected."
  },
  {
    "headline": "AFCON: Super Eagles sent home by Tunisia",
    "summarized_story": "The Super Eagles of Nigeria are out of the 2021 Africa Cup of Nations.\nThis is after Tunisia shocked the Super Eagles of Nigeria by scoring two minutes into the second half.\nSuper Eagles had faced a tough challenge in the first half of their encounter against Tunisia at the ongoing Africa Cup of Nations.\nSimon played a major role when the Super Eagles won their group matches against Egypt, Sudan, and Guinea Bissau.\nStruck by many absences, including 12 players testing positive for COVID-19, Tunisia proved tougher for the Super Eagles than expected."
  },
  {
    "headline": "APC tackles Wike: Forget politics, fight Port Harcourt soot",
    "summarized_story": "Indeed, government-to-government business is not conducted based on off-the-cuff comments of a governor at functions or events.\nCan the Rivers State Government provide proof of Save Our Souls (SOS) memos initiated by it and addressed to the FG through Federal Ministry of Environment calling for the central government’s intervention on the matter?\n“Truth is that the governor never considered the soot descending on Port Harcourt and environs important enough for 6 years until now.\n“APC will always support any genuine and honest steps taken by all levels of government be it the federal, state and local to stem this very horrendous soot ravaging our people and residents of Rivers State especially Port Harcourt.\nOur only concern is that any attempt to use it for political witch-hunting of opponents will backfire and defeat the purpose."
  },
  {
    "headline": "APC tackles Wike: Forget politics, fight Port Harcourt soot",
    "summarized_story": "Indeed, government-to-government business is not conducted based on off-the-cuff comments of a governor at functions or events.\nCan the Rivers State Government provide proof of Save Our Souls (SOS) memos initiated by it and addressed to the FG through Federal Ministry of Environment calling for the central government’s intervention on the matter?\n“Truth is that the governor never considered the soot descending on Port Harcourt and environs important enough for 6 years until now.\n“APC will always support any genuine and honest steps taken by all levels of government be it the federal, state and local to stem this very horrendous soot ravaging our people and residents of Rivers State especially Port Harcourt.\nOur only concern is that any attempt to use it for political witch-hunting of opponents will backfire and defeat the purpose."
  },
  {
    "headline": "Nigerians React As Super Eagles Crash Out Of AFCON After Buhari’s Call",
    "summarized_story": "Nigerians React As Super Eagles Crash Out Of AFCON After Buhari’s CallOn Sunday, the Nigerian Super Eagles were eliminated from the 2018 African Cup of Nations (AFCON) after losing 1-0 to a COVID-19-ravaged Tunisian team.\nThis comes after President Muhammadu Buhari summoned the Super Eagles and charged them with defeating their adversary.\nThe Super Eagles were the only team in Group D to qualify with a maximum of nine points from the group stage, defeating all of the other teams.\nHowever Nigerians took to social media to pour out their reactions, blaming President Buhari for Super Eagles’ loss.\nSee some reactions below:@_AsiwajuLerry wrote, “Super Eagles used to win or score in the first half until they received a call from President Buhari.”@Oli_Ekun said, “Everything was going so well until Buhari addressed this team."
  },
  {
    "headline": "World Bank Exposes Uzodimma’s Government On Fiscal Performance",
    "summarized_story": "Sometime in 2017, the world apex bank introduced a performance based programme that would make them monitor and rate the fiscal performance of states.\nTo that effect, world bank entered into a mutual agreement with the Federal Government which gave birth to a programme known as The State Fiscal Transparency, Accountability and Sustainability (SFTAS) Programme.\nThe Performance year include;YEAR 1; 1st Jan 2018- 1st Jan 2019YEAR 2; 1st Jan 2019- 1st Jan 2020YEAR 3; 1st Jan 2020- 1st Jan 2021YEAR 4; 1st Jan 2021-1st Jan 2022.\nWhereas from 2019 till 2021 Imo State has met all the performance criteria for Fiscal Performance in Governance and has received the grant of 2m USD twice.\nThis rating by WORLD BANK EXPOSES UZODIMMA’S GOVERNMENT ON FISCAL PERFORMANCE IN GOVERNANCE and further reveals the level of Transparency, Integrity and Prudence at which Hope Uzodimma is managing the resources of the state thus growing her internal revenue base."
  },
  {
    "headline": "BREAKING: Super Eagles Crash Out Of 2021 Africa Cup of Nations",
    "summarized_story": "On Sunday, the Nigerian Super Eagles were eliminated from the 2018 African Cup of Nations (AFCON) after losing 1-0 to a COVID-19-ravaged Tunisian team.\nThis comes a few hours after President Muhammadu Buhari called the Super Eagles, charging them to defeat their opponent.\nThe Super Eagles had qualified as the only team with a maximum of nine points from the group stage, beating all teams in Group D. However, the Eagles couldn’t make it beyond the round of 16.\nBoth teams went into the first-half break without goals.\nUntil Youssef Msakni delivers the single killer goal that sent the Super Eagles out of the competition few minutes into the second half."
  },
  {
    "headline": "AFCON 2021: Buhari In Video Conference With Super Eagles",
    "summarized_story": "President Muhammadu Buhari gave the Super Eagles a pep talk on Sunday before of their African Cup of Nations (AFCON) second round encounter against Tunisia, which is set to take place tonight.\nPresident Buhari urged the Super Eagles to continue making Nigerians happy, not only by winning the second round match, but also by lifting the trophy.\nThe Federal Government is supporting you, and I say thank you to all the technical crew and the players..\nResponding, Coach Eguavoen said; “We are so excited that His Excellency, President Buhari, has come to speak with us this morning.\nOn behalf of the players and the technical crew, I want to say thank you very much sir."
  },
  {
    "headline": "[Breaking] AFCON 2021: Tunisia shock Super Eagles, edge into quarterfinal",
    "summarized_story": "Nigeria’s Super Eagles failed to make it to quarterfinal after losing to spirited Tunisia side 0-1 in the round of 16 of the ongoing Africa Cup of Nations.\nThe loss for the country’s men senior team came on a day President Muhammadu Buhari called, and charged the players to go all out and win more games.\nAhead of the Sunday’s encounter, Super Eagles with one man down against Tunisia had won all their group matches.\nDetails loading…"
  },
  {
    "headline": "Breaking: Eguavoen unveils squad ahead Tunisia AFCON 2021 round of 16 clash, Awoniyi, Aribo return *See full list",
    "summarized_story": "Nigeria’s Super Eagles coach Austin Eguavoen has maintained the initial squad that ensured group stage victories to face Tunisia in the Africa Cup of Nations round of 16 on Sunday night.\nThe match is slated to kickoff 8pm Nigerian time in Garoua Cameroon.\nDetails of the the entire players on the lineup are displayed on the graphic representation above."
  },
  {
    "headline": "Breaking: Moving train crushes truck, tricycle, many feared dead in Kano",
    "summarized_story": "There is anxiety in Kano metropolis after a moving train crushed a Dangote truck loaded with cement and tricycle with passengers on Sunday in Kano.\nMany people are reportedly affected in the incident with rescue workers at the scene.\nThe incident occurred on Obasanjo road in Kano metropolis at 11:30am on Sunday.\nEyewitnesses, who run businesses near the rail-track, said they saw the trailer coming towards the rail line as the train was speeding.\nHe said they attempted to flag down the trailer but the driver didn’t notice."
  },
  {
    "headline": "UPDATED: Nigeria Crash Out Of 2021 AFCON After Loss To Tunisia",
    "summarized_story": "Veteran Youssef Msakni scored to give previously unimpressive Tunisia a shock 1-0 triumph over 10-man Nigeria in Garoua on Sunday in an Africa Cup of Nations last-16 match.\nNigeria started as favourites to reach the quarter-finals having won all three group matches in the northwestern city, with record seven-time champions Egypt among their victims.\nWhile Nigeria were able to choose 12 substitutes, Tunisia could manage only eight due to a coronavirus outbreak in the camp.\nIn a tournament full of surprises, another one arrived just after half-time when Qatar-based Msakni put the one-time Cup of Nations champions ahead.\nNigeria had a chance to level as time ticked away, but Moses Simon sent a free-kick from just outside the box over the crossbar."
  },
  {
    "headline": "Troops Foil Kidnap Attempt In Gusau, Neutralise Bandits",
    "summarized_story": "There was pandemonium in Mareri Community, an outskirt of Gusau as armed bandits again, invaded the community and attempted to kidnap the Managing Director of Zamfara State Transport Authority (Mass Transit) Alhaji Aminu Adamu Papa and his family members.\nA neighbor who pleaded anonymity told Channels Television that the heavily armed bandits invaded the community around 11:30 pm on Saturday night and started shooting sporadically.\nAccording to the source, the bandits went straight to Papa’s house and engaged the security operatives stationed there in a gun duel before overpowering the two policemen and disarming them.\nRead Also: Lawan Calls For Probe Over Killing Of Driver In Yobe“Papa and his four family members were abducted, but thank God that Soldiers and local vigilantes were quickly mobilised, they quickly engaged the bandits with serious gunfire,” the source added.\nHe said the gun battle with the military subsequently forced the bandits to release the abducted family members."
  },
  {
    "headline": "Lawan Calls For Probe Over Killing Of Driver In Yobe",
    "summarized_story": "Senate President Ahmad Lawan, has expressed sadness over the incident at Garin Alkali in Bursari Local Government of Yobe State where a military personnel allegedly shot and killed a driver who was identified as Mohammed Musa.\nThe incident ignited violent protests on Saturday in Gashua, the headquarters of Bade Local Government.\nRead Also: Yobe Govt To Investigate Killing Of Driver By Military, Says Buni“I am deeply saddened by the tragic news at Garin Alkali on Saturday and the violent reactions that followed it.\nThe killing of the innocent driver is wicked and reprehensible.\nThe incident, thereafter, prompted angry youths to block the road as they began to protest the killing."
  },
  {
    "headline": "Goods Worth Millions Destroyed As Fire Guts Ogbe-Ijoh Market In Warri",
    "summarized_story": "Fire gutted the popular Ogbe-Ijoh Market in Warri South Local Government Area of Delta State, destroying several goods worth millions of naira.\nThe market is well known to be one of the biggest fish markets across the country.\nThe Chairman of Warri South Local Government Area, Micheal Tidi, confirmed the incident to Channels Television via a telephone conversation on Sunday.\nHe said the fire which started at about 2 pm on Sunday, was triggered by a mentally-challenged woman who was clearing refuse at the market premises.\nAccording to the Chairman, the fire spread beyond the dry refuse and then onto other shops in the market after the woman began to cook and walked away briefly."
  },
  {
    "headline": "Fear Grips Plateau Community As Gunmen Kill Four In Mining Site",
    "summarized_story": "Palpable fear gripped residents of Dong village, Jos North Local Government Area of Plateau State after gunmen attacked a mining site, killing four persons.\nThe gunmen stormed the mining site on Saturday and shot the workers dead, a situation that forced the State Police Command to deploy more personnel to the troubled community.\nIn a statement issued on Sunday, the Police Public Relations Officer, Gabriel Ubah, said the deployment is to forestall the breakdown of law and order.\nThe police spokesman stated that the command has begun investigations with a view to arresting the perpetrators of the crime.\nUnfortunately, four persons who went to a mining site were killed by yet to be identified gunmen."
  },
  {
    "headline": "I can never return to your party, Obasanjo tells PDP leaders",
    "summarized_story": "Former President, Olusegun Obasanjo has reaffirmed his decisions to stay away from partisan politics and remained a statesman.\nHe made this known while receiving some leaders of the People’s Democratic Party who paid him a visit at his Presidential Library residence in AbeokutaAdvertisementThe delegation which was led by the National Chairman of the party, Iyorchia Ayu, included the PDP Vice Presidential candidate in 2019 and former governor of Anambra State, Peter Obi; Sule Lamido of Jigawa State; Olusegun Mimiko, Liyel Imoke, Donald Duke among others.\nThe former President appreciates them for the visit and said he would always be open for consultation from whoever wants his advice in the interest of Nigeria"
  },
  {
    "headline": "Agege LGA holds security summit, assures residents of safer community -",
    "summarized_story": "The Agege local government area council has held a security summit to address the prevailing security challenges in the area.\nResidents of the ancient community are assured of improved security.\nAdvertisement"
  },
  {
    "headline": "APC national chairmanship: I won't join issues with any aspirant",
    "summarized_story": "A former governor of Zamfara state and one of the aspirant for the Chairmanship position in the All Progressives Congress Party, Abdulaziz Yari, said he will not join issues with any other aspirants for the position.\nAdvertisementMr Shinkafi says Abdulaziz Yari was not captured in the revalidation and registration exercise carried out by the party in Zamfara State.\nReacting to the allegations, Abdulaziz Yari says he’s a duly registered member of the All Progressives Congress Party.\nAdvertisementHe also accused Sani shinkafi of formenting trouble with the APC in the state given his antecedent from the All Progressives Grand Alliance (APGA).\nHe called on the Caretaker Committee to disregard Sani Shinkafi describing him as a “noise maker” and means no good for the party."
  },
  {
    "headline": "Tinubu donates N50m to Niger Govt to fight insecurity",
    "summarized_story": "National Leader of the All Progressives Congress, Asiwaju Bola Tinubu has donated N50 Million to the Niger State Government to tackle insecurity, banditry and other security challenges.\nHe made the donation during a condolence visit to the State governor in Minna on Thursday.\nAdvertisementGovernor Bello recently said more than 200 people have been killed in attacks in over 300 communities in the State this year.\nAdvertisement"
  },
  {
    "headline": "Covid-Hit Tunisia Kick High-Flying Super Eagles Out of AFCON with 1-0 Win",
    "summarized_story": "Tunisia upset 10-man Nigeria to set up a quarter-final tie against Burkina Faso at the Africa Cup of Nations.\nYoussef Msakni beat Super Eagles keeper Maduka Okoye with a long-range effort two minutes into the second half.\nThe West Africans were the only side to win all three group games in Cameroon, but were largely subdued against a side hit by Covid-19.\nNigeria forward Umar Sadiq fired across goal and wide in injury time after Moses Simon had earlier had an effort blocked by Carthage Eagles keeper Bechir Ben Said.\nTunisia, Nations Cup winners in 2004, will face Burkina Faso in the last eight on Saturday, 29 January."
  },
  {
    "headline": "Joe Igbokwe: I Have One Vote and It’s for Asiwaju",
    "summarized_story": "Special Adviser to Lagos State Governor, Joe Igbokwe, addresses issues around APC National Convention and declaration for the presidency by Bola Tinubu"
  },
  {
    "headline": "German Navy Chief Resigns for Saying Putin Deserves Respect",
    "summarized_story": "Germany’s navy chief stepped down on Saturday after drawing criticism for saying Russian President Vladimir Putin deserved respect and that Kyiv would never win back annexed Crimea from Moscow.\n“I have asked Defence Minister Christine Lambrecht to relieve me from my duties with immediate effect,” Vice Admiral Kay-Achim Schoenbach said in a statement.\nIn New Delhi, Schoenbach, speaking in English, said Putin seeks to be treated as an equal by the West.\n“What he (Putin) really wants is respect,” Schoenbach said.\n“And my God, giving someone respect is low cost, even no cost… It is easy to give him the respect he really demands – and probably also deserves,” Schoenbach said, calling Russia an old and important country."
  },
  {
    "headline": "Russia Rejects UK Claim of Trying to Replace Ukraine Leader",
    "summarized_story": "The U.K. government made the claim based on an intelligence assessment, without providing evidence to back it up.\n“The disinformation spread by the British Foreign Office is more evidence that it is the NATO countries, led by the Anglo-Saxons, who are escalating tensions around Ukraine,” Russian Foreign Ministry spokeswoman Maria Zakharova said on the Telegram messaging app Sunday.\nAmid diplomatic efforts to defuse the crisis, U.K. Defense Secretary Ben Wallace is expected to meet Russian Defense Minister Sergei Shoigu for talks in Moscow.\nThe U.S. has mounted an aggressive campaign in recent months to unify its European allies against a new Russian invasion of Ukraine.\nThe White House called the U.K. government assessment “deeply concerning” and said it stands with the duly elected Ukrainian government."
  },
  {
    "headline": "Q/Final Place at Stake as Super Eagles Expect Tough Battle with Covid-Ravaged Tunisia on Sunday",
    "summarized_story": "Nigeria’s manager Augustine Eguavoen says he expects a tough duel between his Super Eagles and the Carthage Eagles of Tunisia in Sunday’s Africa Cup of Nations Round of 16 encounter in Garoua.\nTunisia is a big name in African football and we must acknowledge that, despite the manner in which they reached this stage.\nAt the Al Masry Stadium on 4th February 2006, Obinna Nsofor scored for Nigeria before Karim Haggui levelled for the Cup holders.\nIn 1980, both countries tied 2-2 on aggregate in a Spain 82 World Cup qualifying fixture, with Nigeria proceeding after penalty shootout.\n“We are highly motivated by the performance of the Super Eagles so far at the AFCON here in Cameroon."
  }
]