[
  {
    "headline": "Death of all US leaders not enough to avenge Soleimani killing -Iran",
    "summarized_story": "A senior commander of the Iranian Guards said on Wednesday that the killing of all American leaders would not be enough to avenge the United States assassination of Iran’s Revolutionary Guards’ top commander Qassem Soleimani two years ago.\nRevolutionary Guard Mohammad Pakpour was quoted as saying by Iranian state media, “Martyr Soleimani was such a great character that, if all American leaders are killed, this would still not avenge his assassination.\nThe United States and Iran came close to full-blown conflict in 2020 after Soleimani’s killing in a US drone attack at Baghdad airport and Tehran’s retaliation by attacking US bases in Iraq.\nAlmost a year of indirect talks between Iran and the United States have stalled since March as both Tehran and Washington blame each other for failing to settle remaining issues.\nOne of the unresolved questions was whether the US would remove Iran’s Guards from the terrorist list."
  },
  {
    "headline": "Iniubong Umoren: My son has mental problem, says suspect’s father",
    "summarized_story": "The father of the lead suspect in the murder case of Akwa Ibom job seeker, Iniubong Umoren, Frank Akpan, has denied knowledge of Umoren’s murder.\nThe senior Akpan said his son had a mental health issue (schizophrenia) and was an outpatient at the University of Uyo Teaching Hospital.\nAkpan, a retired Civil Servant, said this while giving evidence in his defense before an Uyo High Court presided over by Hon.\nThe father’s defence is coming after his son, Uduak Frank Akpan, the first accused person, had denied knowing the late Iniubong Umoren or raped her or any other woman since he was born.\nJustice Bassey Nkanang, however, adjourned the case to the 10th and 11th of May, 2022, for the continuation of defense by the third accused person (Mr. Frank Akpan’s daughter)."
  },
  {
    "headline": "2023: My one year in office is enough to bring changes in Nigeria – Anyim",
    "summarized_story": "By Dirisu YakubuFormer Senate President, Pius Anyim has urged the leadership of the Peoples Democratic Party, PDP, to give him the Presidential ticket to contest the 2023 election, promising to turn around the fortunes of the country within a year.\nAnyim who made the pledge shortly after submitting his expression of interest and nomination forms at the party secretariat, Abuja, added that his experience in the corridors of power over the years places him in a vantage position to win the election for PDP.\nAddressing the National Working Committee, Anyim pledged to run a productive government, capable of repositioning the country along the path of peace, progress and prosperity.\nChairman, if within one year of my Presidency, Nigerians don’t see the difference between light and darkness; you can recall me,” he said.\n…Details later"
  },
  {
    "headline": "Why Nigeria is not yet a shipping nation – NLNG, ICS",
    "summarized_story": "By Godwin OritseNigeria’s shipping industry executives have said that Nigeria is not regarded as a shipping nation yet because it is not on the white list of the International Maritime Organization, IMO, amongst other deficiencies.\nSpeaking at the just concluded annual conference of the Shipping Correspondents Association of Nigeria, SCAN, the Fleet Commander of Shipping Management Limited, SML, the shipping arm of the Nigerian Liquefied Natural Gas, NLNG, Capt Yusuf Ambali, said that until Nigeria finds its way into the list, it will not be regarded as a shipping nation.\nAmbali also said Council membership of the IMO is very crucial to any shipping country because decisions and policies that affect global shipping are taken and made at such levels and meetings.\nSpeaking in similar vein, the former Vice President of the Institute of Chartered Shipbrokers, ICS, Mr. Tammy Adu, said that certificates of Nigerian seafarers are not recognized in Ghana.\nAdu also said that until Nigeria gets into IMO White list, it will continue to be denied benefits from the global maritime industry."
  },
  {
    "headline": "Controversy over 19 containers of unknown items missing from Tin-can port",
    "summarized_story": "By Godfrey BivbereA controversy is now brewing around the disappearance of about 19 containers of unknown items destined for a major Lagos based Bonded Terminal from Tin-can Island port from the port.\nVanguard Maritime Reports gathered that the missing consignments must have been “flown out” (moved) out of the port without official clearance by the approving authorities, namely, the Nigeria Customs Service, NCS, the terminal operator, and others.\n“Flying of container” is a term used for a container moved out of the port without payment of duty and approvals.\nA Customs source at Tin-can Island Command told Vanguard that the missing containers are still in the Customs computer system.\nAccording to him, “The freight forwarders who protested at the Bonded Terminal were wrong because they didn’t notify Tin Can Island Customs of their decision to protest."
  },
  {
    "headline": "2023 Presidency: Udom consults Senate, House of Reps PDP causes",
    "summarized_story": "Earlier, Senator Chris Ekpenyong on behalf of Senators from Akwa Ibom, who were all present, eulogized Governor Emmanuel for changing the fortunes of Akwa Ibomites.\n“Before 2015, we in Akwa Ibom could not sleep with our two eyes closed.\nBut Governor Emmanuel restored peace, provided job opportunities and engaged youths in meaningful activities thereby reducing criminal activities and restiveness.\nA former deputy Governor of Ekiti State, Senator Abiodun Olujimi maintained that Governor Emmanuel has been one of the strong pillars behind the success of the PDP.\nUwem Okoko and Maj Gen IsangThe national assembly members from the State included Senator Bassey Albert, Senator Akon Eyakenyi, Hon."
  },
  {
    "headline": "Soludo begins clean up of Okpoko, Onitsha",
    "summarized_story": "By Anayo OkoliONITSHA — KEEPING to one of his inauguration promises, Anambra State Governor, Prof Chukwuma Charles Soludo, has commenced the clean up exercise of Okpoko, a highly populated slum in Ogbaru Local Government Council of the state.\nProf. Soludo had during his electioneering campaign promised to massively clean up the slum and other areas around Onitsha and modernise it; he restated this during his inauguration.\nEfforts of past governors to clean up Okpoko were defied as it was difficult for them to muster the courage to pull down the many houses built on drainages.\nPowerful and rich owners of the houses had always frustrated past efforts to clean up the slum.\nIt is left to see if Soludo would succumb to them this time or move to clean up the slum and make it a better place to be."
  },
  {
    "headline": "BREAKING: Nigeria’s Statistician-General, Simon Harry is dead",
    "summarized_story": "Simon Harry, Nigeria’s Statistician-General has passed away.\nPrior to his appointment, Harry was the Director of NBS Corporate Planning and Technical Coordination.\nHe joined the Federal Office of Statistics as Statistician 11 in 1992 and became the substantive Director of Statistics in 2019.\nHarry contributed to reform initiatives including the transformation of the then Federal Office of Statistics to the NBS.\nThe deceased was part of the team that rejigged the Nigerian Statistical System, resulting in the establishment of State Bureaus of Statistics."
  },
  {
    "headline": "Russia vs Ukraine: UN reveals number of deaths recorded since invasion",
    "summarized_story": "At least 1,892 civilians have been killed and 2,558 injured since the war in Ukraine started in February, amid the Russian invasion.\n“The number of recorded deaths include 478 men, 308 women, 30 girls, 52 boys, 71 children, as well as 953 adults whose sex is yet unknown.\nThe actual casualty figures could be considerably higher because of a delay in reports from some locations, the OHCHR added.\nThese include areas like the besieged southeastern city of Mariupol, where “figures are being further corroborated.”The war between Ukraine and Russia began in February this year.\nRussian President Vladimir Putin had ordered a long-feared invasion of Ukraine due to political differences between both countries."
  },
  {
    "headline": "Varsity Don tasks christains on active involvement in politics",
    "summarized_story": "He added that Christians especially, pastors should sensitize and mobilize their members for the 2023 elections.\nSpeaking during the Convocation lecture for the 6th Matriculation and 5th Convocation of Uma Ukpai School of Theology, Johnson urged some pastors to stop demonizing politics stressing that such has led to poor participation of Christians in politics.\nSpeaking on the theme: “Christian In Politics – The Way Forward: The Christian and The Church Responsibilities”, the University Don said the Church has a stake in governance and called on it to support Christian politicians.\nPart of his text read: “The church must rise to the challenge of political relevance via political participation.\n“The Christian posture as individuals and the church position as a corporate body must align against brazen acts of corruption."
  },
  {
    "headline": "Buhari reacts as terrorists gun down over 100 in Plateau",
    "summarized_story": "President Muhammadu Buhari has reacted to the killing of over 100 residents of Plateau State by a terrorist group, describing the incident as heinous.\nReports earlier emerged that gunmen killed at least 142 persons in fresh attacks on communities in Wase and Kanam Local Government Areas of the state.\nDAILY POST reports that the incident occurred on Sunday in Kukawa, Gyambawu, Dungur, Kyaram, Yelwa, Dadda, Wanka, Shuwaka, Gwammadaji, and Dadin Kowa communities in the local government.\nReacting, the president, in a statement by his spokesman, Garba Shehu said the perpetrators should not be allowed to escape justice.\nPresident Buhari called on residents of the state to ensure that the criminal elements are exposed for proper actions by the security agencies, saying they must not be forgiven."
  },
  {
    "headline": "Why Ede town is experiencing blackout – IBEDC",
    "summarized_story": "The Ibadan Electricity Distribution Company (IBEDC) has disclosed the reasons some communities in Ede and its environs have suffered a shortfall in electricity supply in recent days.\nIn a statement signed by the IBEDC Osun Region and made available by its spokesperson, Kikelomo Owoeye, the IBEDC revealed that the problem was due to a technical problem on the Ede Township and Cottage 11KV feeders.\nIBEDC also explained that it could not resolve the fault and ensure power supply is restored due to the closure of its offices by protesting youths in Ede.\nOn Monday, April 11, 2022, youths under the aegis of Federation of Ede Youths Development Association (FEYDA) had staged a peaceful protest against IBEDC.\nThey also alleged that apart from subjecting the town to darkness, IBEDC personnel still planned the distribution of bills, with estimated tariff around the town, starting from Monday, April 11."
  },
  {
    "headline": "Buhari swears in Commissioners for NPC, ICPC, presides over FEC",
    "summarized_story": "Buhari swears in Commissioners for NPC, ICPC, presides over FECPresident Muhammadu Buhari has sworn-in newly appointed Commissioners of the Independent Corrupt Practices and Other Related Offenses Commission (ICPC) and National Population Commission (NPC).\nThe President performed the brief ceremony just before he presided over the weekly virtual Federal Executive Council (FEC) meeting at the Presidential Villa in Abuja.\nThe commissioners of the NPC are: Chief Benedict Ukpong Effiong (Akwa Ibom); Mrs. Gloria Fateya Izonfo (Bayelsa); Kupchi Patricia Ori Iyanya (Benue); Dr. Haliru Bala (Kebbi) and Dr. Eyitayo Oyekunle Oyetunji (Oyo).\nThe President is chairing the weekly Cabinet meeting at the council chambers of the Presidential Villa.\nOther Ministers and Head of Civil Service of the Federation, Folasade Yemi-Esan, are participating virtually from their respective offices in Abuja."
  },
  {
    "headline": "Gunmen kill Ebonyi businessman one week to wedding",
    "summarized_story": "Gunmen have killed an Ebonyi- based businessman, Issac Nnaemeka Chukwu, a week to his wedding.\nChukwu, who sold provisions, was killed by suspected assassins in Abakaliki, capital of Ebonyi state on Monday night.\nThe deceased, popularly known as Ochudo, hailed from Ikwo Local Government Area of Ebonyi State.\nHe had concluded arrangements for his wedding to his fiance, Favour Chioma, who was with him when the gunmen and killed him.\nThe wedding invitation seen by The Nation shows that the traditional wedding was to take place on April 21 at his fiance’s father’s compound in Amaiyima Ekpelu, in Ikwo local government."
  },
  {
    "headline": "BREAKING: Gunmen kill four policemen, burn station in Anambra",
    "summarized_story": "Gunmen have killed eight persons, including four policemen in Nnewi and Ogbaru local government areas of Anambra State.\nAnambra police spokesman Ikenga Tochukwu told The Nation the Nnewi incident was an accident involving tricycle operators and another vehicle.\nRead Also: Gunmen kill Ebonyi businessman one week to weddingHe confirmed the Ogbaru incident, describing it as unfortunate.\nTochukwu further said the police station at Atani in Ogbaru local government area was not razed but partially torched by the hoodlums.\nAt Atani in Ogbaru local government area, a source said the gunmen shot non-stop and killed some policemen before burning the station."
  },
  {
    "headline": "Five burnt to death as vehicles catch fire in Anambra",
    "summarized_story": "Five burnt to death as vehicles catch fire in AnambraFive persons, including three women, were on Wednesday burnt to death in an accident along Awka-Enugu expressway, Anambra State.\nThe crash, which occurred at Nawfia around 6.30am, involved two vehicles, a Toyota Highlander and Hiace Bus with five persons on board.\nThe Nation gathered that the bus driver was trailing behind the Highlander when he suddenly lost control while on top speed and rammed into the vehicle.\n“According to eyewitness report, the bus driver was on speed, lost control, and rammed into the Highlander from behind, crashed and the both vehicles caught fire.\n“5 people comprising 2male adults and 3 female adults were involved in the crash."
  },
  {
    "headline": "Northern Elders ask Buhari to resign immediately",
    "summarized_story": "The Northern Elders Forum (NEF) has demanded the immediate resignation of President Muhammadu Buhari.\nIt said the President has proved spectacularly incapable of providing security for Nigerians and citizens cannot continue in such condition till May 2023.\nThe Northern Elders noted with dismay killings and assaults on communities have become daily features of all Nigerians just as travelling anywhere is risky and the option of staying put does not make anyone safer.\n“It is now time for President Buhari to seriously consider that option, since his leadership has proved spectacularly incapable of providing security over Nigerians.\nThe northern elder’s spokesperson said that leading Nigeria out of its current state and placing it firmly on the path of rediscovery is not an all-comer affair."
  },
  {
    "headline": "COEASU to FG: Drop your ego, accept UTAS",
    "summarized_story": "From Adanna Nnamani, AbujaThe Colleges of Education Academic Staff Union (COEASU) has called on the Federal Government to drop its ego and accept the University Transparency and Accountability Solution (UTAS) as a payment solution in all tertiary institutions in Nigeria.\nThe union’s President commended the Academic Staff Union of Universities (ASUU) for developing UTAS as an alternative to the controversial IPPIS.\nHe noted that the UTAS, being a home-grown and hack-proof payment system, addresses the union’s concerns on payroll security and the peculiarities of the tertiary education system in general.\nUTAS, being a home-grown and hack-proof payment system, addresses our concerns on payroll security and the peculiarities of the tertiary education system in general.\n“It is against this backdrop that we hereby call on the Federal Government to drop its ego, accept UTAS as a payment solution in all tertiary institutions in Nigeria whose functions and structure are different from the mainstream ministries.” He said."
  },
  {
    "headline": "BREAKING: Unknown gunmen kill four policemen, set police station ablaze in Anambra",
    "summarized_story": "From Jeff Amechi Agbodo, OnitshaSuspected gunmen at early hours of today killed four policemen at Atani police station in Ogbaru local government area of Anambra state.\nThe unknown gunmen who stormed the police station at about 1.am after killing the police officer set part of the station ablaze.\nThe Anambra State Police Public Relations Officer DSP Tochukwu Ikenga who confirm the incident said that quick intervention of police commissioner to the place dislodged the hoodlums.\nHe said that the commissioner of police and other police officers at about 1.3am stormed the place and engaged the hoodlums to flee from the station.\nThe quick intervention of police brought the situation under control because the hoodlums were engaged."
  },
  {
    "headline": "Buhari swears in Commissioners for NPC, ICPC, presides over FEC",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has sworn in as commissioners of the National Population Commission (NPC) and Independent Corrupt Practices and Other Related Offences Commission (ICPC).\nThe swearing in took place shortly before the commencement of the weekly Federal Executive Council meeting at the Presidential Villa Abuja.\nThe commissioners of the ICPC sworn in were Assistant Inspector General of Police, AIG, Olugbenga Adeyanju, rtd (Ekiti State), Senator Anthony Agbo (Ebonyi), Anne Otelafu Odey (Cross River), Alh.\nMeanwhile, the President is chairing the weekly Cabinet meeting at the council chambers of the Presidential Villa.\nOther Ministers and Head of Civil Service of the Federation,Folasade Yemi-Esan, are participating virtually from their respective offices in Abuja."
  },
  {
    "headline": "Shootings in Nnewi as residents scamper for safety",
    "summarized_story": "From David Onwuchekwa, NnewiGunmen numbering over ten reportedly invaded Nnewi, Anambra State on motorbikes with sophisticated weapons shooting as they rode from Traffic Light axis towards the Nnewi Police Area Command, sources said.\nThey said the gunmen were shooting ceaselessly in the air.\nAs at the time of filing this report, it was not clear who the gunmen were.\nReacting, the Police Public Relations Officer (PPRO), Anambra State, Mr Tochukwu Ikenga (DSP) said he knew about little unrest in Nnewi caused by Keke (tricycle) riders whose member was killed by an accident which led to a protest.\nAs for the shootings, the PPRO said the report was still sketchy as at the time of sending this report."
  },
  {
    "headline": "UN expresses anxiety over preparation for 2023 election",
    "summarized_story": "By Emma EmeozorThe United Nations (UN) has expressed anxiety over preparations for the 2023 general elections in Nigeria.\nLeader of the UN delegation and head of Mission, Serge Gakwandi Kubwimana, said the team was in Nigeria to interact with stakeholders and assess the level of preparation for the 2023 general election.\nThis, he said, would enable the UN electoral needs mission to identify areas to provide support to Nigeria.\nHe explained that the UN Electoral Needs Assessment Mission renders technical assistance by strengthening the capacity of relevant organs for the election.\nThis is even as he said Nigeria was quite experienced in electoral matters and had introduced some reforms in the electoral process."
  },
  {
    "headline": "BREAKING: Four Police Personnel Killed as Gunmen Attack Station in Anambra",
    "summarized_story": "David-Chyddy Eleke in AwkaGunmen Wednesday morning attacked a police station in Atani, the headquarters of Ogbaru Local Government Area in Anambra State.\nA source told THISDAY that the men arrived the area at about 1:30am Wednesday, and immediately launched an attack on the police facility.\nDSP Toochukwu Ikenga, the spokesperson of the state police command, told THISDAY in a telephone conversation that the attack happened.\n“The Commissioner of Police, Echeng Echeng, on hearing of the attack, immediately mobilized men of the command from various units to the area.\n“We have commenced intelligence already, and we hope to unravel the persons behind the attack,” Ikenga said."
  },
  {
    "headline": "LCCI Predicts Nigeria’s Debts May Hit N45tn in Q4 2022",
    "summarized_story": "•This year budget now projected to have deficit of N7.35 trillionGilbert EkugbeThe Lagos Chamber of Commerce and Industry (LCCI) has predicted that Nigeria’s total debt stock was expected to hit N45.86 trillion by December 2022.\n“In total, the federal government plans to add N6.3 trillion new debts to the current debt stock, which would push the country’s total debt stock to N45.86 trillion by December 2022,” he added.\nHe added that with the cost of diesel at record levels and persisting poor power supply, businesses had been running on unsustainable costs and producing at uncompetitive prices.\nThe LCCI boss added: “The government should create funding for critical infrastructure and special purpose intervention in the power sector.\nThe InfraCorp will succeed in mobilizsng private sector participation if we can achieve cost-reflective pricing in the power sector,” he said."
  },
  {
    "headline": "Buhari, Senators, Others Flay Plateau Killings, Say Act Heinous, Unforgivable",
    "summarized_story": "Some bloodthirsty terrorists had at the weekend killed 80 persons and abducted 70 others after an invasion of communities in Plateau State.\nTHISDAY had reported that, unfortunately, while terrorists soiled the state in blood and danger, Plateau State Governor, Mr. Simon Lalong, was busy in Abuja holding political meetings with a former Governor of Lagos State, Mr. Bola Tinubu, over the latter’s presidential ambition.\nA statement in Jos by Dadu’ut urged the federal government to expeditiously apprehend the perpetrators of the Plateau killings and bring them to justice.\nHe also urged the residents to cooperate with security agencies to flush out the undesirable elements in the society.\n“Let me tell you, these people have succeeded by recruiting informants, who tell them the movement of security agencies,” Abdullahi added."
  },
  {
    "headline": "President Seeks Senate’s Approval to Raise 2022 Subsidy Payment to N4trn",
    "summarized_story": "Precisely, the president sought the chamber to approve an increase in the estimated provision for PMS subsidy for 2022 by N3.557 trillion, from N442.72 billion to N4.00 trillion.\nThe request for approval to adjust the 2022 fiscal framework, was contained in a letter dated April 5, 2022, read during plenary by the Senate President, Ahmad Lawan.\nAccording to him, the developments were occasioned by spikes in the market price of crude oil, which were a fallout of the Russian-Ukraine war.\n“These developments include spikes in the market price of crude oil, aggravated by the Russian-Ukraine war, significantly lower oil production volume due principally to production shut-ins as a result of massive theft of crude oil between the production platforms and the terminals.\nThe president also sought a reduction in the projected oil production volume by 283,000 barrels per day, from 1.883 million barrels per day to 1.600 million barrels per day."
  },
  {
    "headline": "Breaking: APC National Chairman, Deputy Resign from Senate",
    "summarized_story": "Sunday Aborisade, AbujaThe National Chairman of the All Progressives Congress (APC), Abdullahi Adamu, has resigned from the Senate.\nSimilarly, Senator Abubakar Kyari, representing Borno North Senatorial District, has also resigned from the red chamber.\nAdamu and Kyari announced their resignations in separate letters read by the Senate President, Ahmad Lawan, at plenary Tuesday.\nLawan said the senators explained that their action became necessary following their emergence as National Chairman and Deputy National Chairman (North) of the APC respectively.\nDetails shortly..:Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Appeal Court Upturns High Court Judgement Restricting Human Rights Activist, Sowore To Abuja",
    "summarized_story": "The Court of Appeal sitting in Abuja has upturned the ruling of the Federal High Court confining human rights activist, Omoyele Sowore, to Abuja, the Federal Capital Territory (FCT) since August 2019.\nIn a twist of event, DSS operatives invaded the Federal High Court in Abuja on December 6, 2019 to rearrest him without any court order.\nThe trial judge, Justice Ijeoma Ojukwu, had granted Sowore N100million bail with two sureties who must be residents of Abuja and have landed properties within the Federal Capital Territory.\nSowore was also restricted to the Federal Capital Territory pending the determination of the case.\nThe activist however, approached the Appeal Court over the stringent bail conditions especially his restriction to Abuja."
  },
  {
    "headline": "BREAKING: Appeal Court Upturns High Court Judgement Restricting Human Rights Activist, Sowore To Abuja",
    "summarized_story": "The Court of Appeal sitting in Abuja has upturned the ruling of the Federal High Court confining human rights activist, Omoyele Sowore, to Abuja, the Federal Capital Territory (FCT) since August 2019.\nIn a twist of event, DSS operatives invaded the Federal High Court in Abuja on December 6, 2019 to rearrest him without any court order.\nThe trial judge, Justice Ijeoma Ojukwu, had granted Sowore N100million bail with two sureties who must be residents of Abuja and have landed properties within the Federal Capital Territory.\nSowore was also restricted to the Federal Capital Territory pending the determination of the case.\nThe activist however, approached the Appeal Court over the stringent bail conditions especially his restriction to Abuja."
  },
  {
    "headline": "2023: What We Told Osinbajo About His Presidential Ambition – Senate President, Lawan",
    "summarized_story": "The All Progressives Congress (APC) caucus in the senate has wished Vice-President Yemi Osinbajo good luck in his quest to lead Nigeria.\nOsinbajo formally joined the 2023 presidential race on Monday.\nOn Tuesday, he hosted the legislators to Iftar dinner at his official residence at Aguda House within the Presidential Villa, Abuja.\nThe meeting held behind closed doors but the President of the Senate, Ahmad Lawan who led the APC senators to the Villa told reporters what transpired.\nWhen pressed further, Lawan said: “naturally, the Vice President told us that he has expressed his interest and that he wanted to consult with the Senate APC caucus."
  },
  {
    "headline": "2023: What We Told Osinbajo About His Presidential Ambition – Senate President, Lawan",
    "summarized_story": "The All Progressives Congress (APC) caucus in the senate has wished Vice-President Yemi Osinbajo good luck in his quest to lead Nigeria.\nOsinbajo formally joined the 2023 presidential race on Monday.\nOn Tuesday, he hosted the legislators to Iftar dinner at his official residence at Aguda House within the Presidential Villa, Abuja.\nThe meeting held behind closed doors but the President of the Senate, Ahmad Lawan who led the APC senators to the Villa told reporters what transpired.\nWhen pressed further, Lawan said: “naturally, the Vice President told us that he has expressed his interest and that he wanted to consult with the Senate APC caucus."
  },
  {
    "headline": "2023: What We Told Osinbajo About His Presidential Ambition – Senate President, Lawan",
    "summarized_story": "The All Progressives Congress (APC) caucus in the senate has wished Vice-President Yemi Osinbajo good luck in his quest to lead Nigeria.\nOsinbajo formally joined the 2023 presidential race on Monday.\nOn Tuesday, he hosted the legislators to Iftar dinner at his official residence at Aguda House within the Presidential Villa, Abuja.\nThe meeting held behind closed doors but the President of the Senate, Ahmad Lawan who led the APC senators to the Villa told reporters what transpired.\nWhen pressed further, Lawan said: “naturally, the Vice President told us that he has expressed his interest and that he wanted to consult with the Senate APC caucus."
  },
  {
    "headline": "Simon Harry, statistician-general, dies seven months after appointment",
    "summarized_story": "Simon Harry, the statistician-general of the federation, is deadHe died on Wednesday morning in Abuja.\nHarry was appointed by President Muhammadu Buhari in August 2021 to replace Yemi Kale as statistician-general of the federation to head the National Bureau of Statistics (NBS).\nHarry joined the erstwhile Federal Office of Statistics as statistician 11 in 1992 and rose to the position of director of statistics in 2019.\nBefore his appointment as the statistician-general of the federation.\nHarry was the director of corporate planning and technical coordination, department of the NBS — with almost three decades of statistical experience."
  },
  {
    "headline": "Simon Harry, statistician-general, dies seven months after appointment",
    "summarized_story": "Simon Harry, the statistician-general of the federation, is deadHe died on Wednesday morning in Abuja.\nHarry was appointed by President Muhammadu Buhari in August 2021 to replace Yemi Kale as statistician-general of the federation to head the National Bureau of Statistics (NBS).\nHarry joined the erstwhile Federal Office of Statistics as statistician 11 in 1992 and rose to the position of director of statistics in 2019.\nBefore his appointment as the statistician-general of the federation.\nHarry was the director of corporate planning and technical coordination, department of the NBS — with almost three decades of statistical experience."
  },
  {
    "headline": "Bandits abduct five female students of Zamfara college of health science",
    "summarized_story": "Bandits have abducted five students of the College of Health Science and Technology in Tsafe area of Zamfara state.\nThe students were reportedly abducted in the early hours of Wednesday.\nThe bandits invaded the residence of the students –a private hostel– situated outside the school campus.\nThe students were abducted at the outskirt of the town in their residence,” Shehu said.\nFrom Niger, Kebbi to Kaduna, Zamfara, Plateau, scores of students were abducted despite efforts of the state governments and security agencies to curtail the onslaughts."
  },
  {
    "headline": "Bandits abduct five female students of Zamfara college of health science",
    "summarized_story": "Bandits have abducted five students of the College of Health Science and Technology in Tsafe area of Zamfara state.\nThe students were reportedly abducted in the early hours of Wednesday.\nThe bandits invaded the residence of the students –a private hostel– situated outside the school campus.\nThe students were abducted at the outskirt of the town in their residence,” Shehu said.\nFrom Niger, Kebbi to Kaduna, Zamfara, Plateau, scores of students were abducted despite efforts of the state governments and security agencies to curtail the onslaughts."
  },
  {
    "headline": "Gunmen attack Taraba mosque during prayers, kill district head",
    "summarized_story": "Gunmen have attacked a mosque in Maisamari community in Sardauna LGA, Taraba, killing Abdulkadir Sufiyanu, the district head.\nThe gunmen were said to have shot dead the district head during the Ishai prayers at the mosque, on Monday night.\nAdvertisementSpeaking with TheCable, Usman Abdullahi, Taraba police spokesperson, on Wednesday, said only the district head was killed during the attack, adding that the gunmen came specifically to attack the deceased.\n“Unknown gunmen came, pretended to come from prayer in the mosque and opened fire, killing the district head.”This is not the first time gunmen will attack worshippers in mosques during prayers in Taraba.\nLast Tuesday, gunmen attacked a mosque in Bali Jali village, Bali LGA of Taraba state as worshippers were breaking their fast, abducting many of them."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "MTN Nigeria secures approval to operate Mobile Money Bank",
    "summarized_story": "MTN Nigeria, the Nigerian arm of Africa’s largest telecom, today received final approval from the Central Bank of Nigeria to run a payment service bank.\nWith this approval, MTN Nigeria can provide virtually all the services offered by conventional commercial banks with the exception of granting credit and processing foreign exchange transactions.\nThis announcement follows a previous approval in principle granted in November 2021, to Airtel Africa Plc and MTN Nigeria Communications Plc to operate a payment service bank in the country.\nIn January, MTN revealed that MTN Nigeria’s mobile money service had attracted 9.4 million active users since launching in August 2019.\nThis approval is expected to spur the adoption of mobile money in Nigeria as the use cases increase."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, Yeah, it's Victoria again.\nSo it appears you'll be seeing more of me.\nAnd I'll appreciate your..."
  },
  {
    "headline": "An insight into how Katapult VC invests in African startups",
    "summarized_story": "Katapult Africa is a venture capital firm focused on startups building solutions for agriculture, food, and the climate.\nFounded in 2016 by Norwegian entrepreneur, Tharald Nustad, the firm has invested in 108 startups, including two unicorns – Esusu and Betterfly.\nIn 2018, the firm started investing in African startups and has 17 startups in its portfolio.\nThat went live and brought me into Katapult Africa, which was looking into setting up operations in Africa.\nThe new one is Katapult Africa because we see opportunity on the continent, and we’ve had some success stories along the way."
  },
  {
    "headline": "Flutterwave CEO, Olugbenga Agboola, faces allegations",
    "summarized_story": "First off, click, copy and forward this link to your friends, acquaintances, and family and encourage them to subscribe.\nAccording to the article, which he claims contains the necessary proof to back up his claims, Hundeyin accuses Flutterwave CEO, Olugbenga Agboola, of bullying and committing some crimes.\nAdvertisementHe also said that Olugbenga ‘GB’ Agboola illegally exploited the assets, information, and contacts of Access Bank, where he worked.\nYesterday, though, I read about Nenne Adaora Nwodo, a 25-year-old Microsoft software engineer who is pursuing her six-year-old dream.\nPylon’s $19 million seed fundingAn Egyptian infrastructure management platform for water and electricity companies, Pylon, has raised $19 million in seed funding."
  },
  {
    "headline": "How Microsoft’s Adora Nwodo is living the software engineering dream she had as a 6-year-old",
    "summarized_story": "Share this article:“We are all born differently, but we’re also born differently gifted; so we should learn to give all of ourselves so that we can die empty.” — Adora Nwodo, Software Engineer, Microsoft.\nNenne Adaora Nwodo.\nI’m one of those people who started playing with computers as early as age six.”Nenne Adaora Nwodo.\nSoftware engineer, MicrosoftAdora’s time at UNILAG defined her interest; “I just wanted to build things,” she recalled.\nSoftware engineer, MicrosoftAdora has been drawn to tech for most of her life and was privileged to pursue it early."
  },
  {
    "headline": "Six forces pulling down Nigeria’s economy",
    "summarized_story": "Economists have painted another unsavoury picture of the Nigerian economy and their prognosis isolates six factors that are piling woes on already beleaguered businesses and households, according to a report analysed by BusinessDay.\nNigeria’s oil and gas sector, on the other hand, contracted by 8.1 percent in the same period.\nThe third strong wind pulling down the Nigerian economy, according to the report, is the worsening external position exacerbated by falling foreign investment.\nIn 2021, Nigeria’s trade deficit ballooned to N1.94 trillion, according to the National Bureau of Statistics.\nFourthly, the Nigerian economy is confronted by falling foreign reserves despite rising oil prices, which reached a peak of $139.4 per barrel on March 8, 2022."
  },
  {
    "headline": "Six forces pulling down Nigeria’s economy",
    "summarized_story": "Economists have painted another unsavoury picture of the Nigerian economy and their prognosis isolates six factors that are piling woes on already beleaguered businesses and households, according to a report analysed by BusinessDay.\nNigeria’s oil and gas sector, on the other hand, contracted by 8.1 percent in the same period.\nThe third strong wind pulling down the Nigerian economy, according to the report, is the worsening external position exacerbated by falling foreign investment.\nIn 2021, Nigeria’s trade deficit ballooned to N1.94 trillion, according to the National Bureau of Statistics.\nFourthly, the Nigerian economy is confronted by falling foreign reserves despite rising oil prices, which reached a peak of $139.4 per barrel on March 8, 2022."
  },
  {
    "headline": "How Buhari turned deaf ears when opportunities knocked",
    "summarized_story": "Aloof, kinetically unsociable and inflexibly tribal, Buhari turned deaf ears to the numerous opportunities that could have transformed Nigeria.\nAlmost every sector of the country’s social and political economy under Buhari’s leadership has come under unparalleled internal shocks of ineptitude, intellectual apathy and the beatification of insensitivity.\nBuhari chose an execrable economic management team, and Nigeria’s economy has been on a freefall since then.\nAccording to figures from data consulting firm StatiSense, in 2015, when Buhari came into office, 54.51 million Nigerians were fully employed.\nThis, Nigeria’s political leaders fear."
  },
  {
    "headline": "International Day for Street Children: Obaseki assures inclusion, reforms to protect vulnerable children – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has reiterated its commitment to prioritising the wellbeing of vulnerable persons in Edo State, sustaining reforms in education, the legal system and other social structures to ensure that they are better protected and provided with the opportunity to live life to the fullest.\nThe commissioner said the government has launched the Edo State Protection Policy to protect street children and other vulnerable persons in the state.\n“This celebration is therefore in no way suggestive of celebrating the fact that these children are on the streets, rather it is a reminder to us that these children are ours irrespective of the circumstance.\nGovernor Godwin Obaseki, as well as other stakeholders what these innocent and tender children have to go through in weathering the raging storms of life.\nThey are often denied education, health care and basic human rights."
  },
  {
    "headline": "Senate Okays Bill Seeking to Reduce Extreme Poverty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Senate on Tuesday passed for first reading, a bill to reduce extreme poverty, safeguard vulnerable groups, implement social protection systems and measures in the country, through the establishment of a social welfare service.\nThe proposed legislation is titled, ‘An act to establish the social welfare service to reduce extreme poverty among the vulnerable groups and implement social protection systems and measures in Nigeria and for related matters ( SB.984).\nThe Bill sponsored by the Chief Whip of the Senate, Senator Orji Kalu reveals that the proposed social welfare service will be a department domiciled in the Federal Ministry of Humanitarian Affairs.\nThe bill also seeks to formulate social welfare programs periodically to address the chronic poverty in rural and urban areas and engage in schemes that will elevate poor people from poverty.\nLeader of the Senate, Senator Yahaya Abdullahi introduced the bill to members of the Senate and its short title was read by the Senate clerk and was subsequently passed after it was put to a voice vote by Senate President, Ahmad Lawan."
  },
  {
    "headline": "No resumption until demands are met, ASUU tells FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Academic Staff Union of Universities (ASUU), Abuja zone, yesterday, insisted that there will be no resumption in public Universities until the Federal Government accede to the renegotiated 2009 agreement and the University Transparency and Accountability Solution deployed.\nThis was made known by the Zonal Coordinator, Dr Salawu Lawal, at a press conference at the University of Abuja in Gwagwalada, on Monday.\nAccording to him, the insensitivity of the Federal Government has made it impossible for its members to return to their duty posts.\n“Deploy for use in the Nigerian university system, was the home-grown payment and personnel solution called UTAS developed by ASUU as replacement for the failed IPPIS.\n“As usual, the Federal Government has ignored ASUU’s call for full implementation of that famous agreement and other memoranda signed with the union."
  },
  {
    "headline": "Newly deploy CP assumes duty in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-The recently posted commissioner of police to Edo State CP Abutu Yaro has assumed duty in Benin City.\nHe assumed duty on Monday, April 11, 2022 as the 44th commissioner of police in Edo State.\nThe newly deployed CP succeeded CP Philip Ogbadu who retired from the Nigeria Police Force, last month.\nCP Abutu Yaro pledged to discharge his duty in the state with utmost professionalism.\nPrior to his recent deployment to Edo State, he was the CP Provost Marshal, Force Headquarters, Abuja."
  },
  {
    "headline": "Illegal Detention: Court orders Ebonyi CP, others to pay N4m damages to Ukpai Ibe, Boniface Ama",
    "summarized_story": "A federal high court sitting in Abakaliki, the Ebonyi State capital, has ordered the state commissioner of police, Garba Aliyu, two of his subordinates, as well as the Caretaker Chairman of Amangwu Edda Development Union, Mr. Chima Ekumankama and one Oko Eseni Oko, alias Oko Perry, to pay N2 million each to Messrs Ukpai Ibe and Boniface Ama for detaining them illegally.\nThe judgment followed a suit filed by Ibe and Ama on November, 11, 2021 against the Police commissioner and four others for the violation of their fundamental human rights.\nAfter filling the case for the enforcement of their fundamental human rights, the police again re-arrested Ukpai Ibe in court and attempted to arraign him before a Magistrate Court in Abakaliki on frivolous charges.\nBut delivering a judgement on the suit filed by the two individuals on Monday, the presiding judge of the high court, Justice Fatun Odoi Riman, ordered the police commissioner and the four others to pay N2 million each to them.\nJustice Riman condemned the brutal and inhuman conduct of the police in the matter and granted the request of the plaintiffs’ lawyers for damages and ordered the respondents to pay damages to the tune of N4 million to the plaintiffs."
  },
  {
    "headline": "Easter: Nigerian govt declares Friday, Monday public holidays",
    "summarized_story": "The federal government of Nigeria has declared Friday, April 15 and Monday, April 18, 2022, as public holidays to mark the celebration of Easter.\nRauf Aregbesola, minister of interior, announced this in a statement by the Permanent Secretary of the Ministry, Dr. Shuaib Belgore, on Tuesday.\nWhile urging Christians to emulate the attributes of sacrifice, togetherness, forgiveness, kindness, love, peace and patience, as exemplified by Jesus Christ’s ministry on earth, he asked them to pray for an end to the insecurity bedevilling the country.\nThe Minister, however, assured that the Federal Government would leave no stone unturned to ensure that the recent attacks by undesirable elements on the highways, airport and the railway are timely brought to an end.\nThe statement read in part, “Security is everybody’s business."
  },
  {
    "headline": "No God-fearing citizen will excuse damage done to Nigeria by APC – Momodu",
    "summarized_story": "Dele Momodu, media personality and People’s Democratic Party (PDP) presidential hopeful, has said no God-fearing citizen of Nigeria can excuse the amount of damage done to the country by the All Progressives Congress (APC).\n“Nigeria deserves massive apologies from the APC apparatchiks who should be ashamed of the magnitude of damage they have wreaked on our long-suffering nation.\n“Becoming President of Nigeria should not be about the promotion and elevation of self as a result of previous lengthy political appointments.\n“What Nigeria needs is a fresh leader, someone shorn of all the baggage, misadventure, mishaps and failures of the past.\nI believe that in the same vein, our reinvigorated Party should entrust me with the role of the change catalyst in Nigeria."
  },
  {
    "headline": "Abdullahi Adamu, APC chairman, deputy resign from senate",
    "summarized_story": "The national chairman of the All Progressives Congress (APC), Abdullahi Adamu, has resigned from the senate.\nAdamu, who was the senator representing Nasarawa West, was elected as APC national chairman at the convention of the party that was held on March 26.\nThe ruling party’s deputy national chairman, north, Abubakar Kyari, who was representing Borno North, also resigned his membership of the upper legislative chamber.\nTheir resignations were stated in letters read on the floor of the red chamber by Senate President Ahmad Lawan on Tuesday."
  },
  {
    "headline": "Deploy UTAS In All Tertiary Institutions, COEASU Urges Federal Govt",
    "summarized_story": "The Colleges of Education Academic Staff Union (COEASU) has called on the federal government to drop its ego and accept the University Transparency and Accountability Solution (UTAS) platform as a payment solution in all tertiary institutions in the country.\nCOEASU said such becomes imperative as UTAS takes care of the peculiarities of the institutions including financial autonomy, sabbatical service, and the administration of discipline.\n“IPPIS breaches the establishment integrity of the tertiary institutions system, undermines the statutory functions of the Governing Councils, and opens the payroll up to unilateral manipulations.\n“The payment system also enabled the Federal Government to impose baseless deductions under the guise of a new tax regime shrouded in calculative mysteries at the detriment of our members.\nHe noted that UTAS, being a home-grown and hack-proof payment system, addresses concerns on payroll security and the peculiarities of the tertiary education system in general."
  },
  {
    "headline": "What You Need To Know About Sudden Death",
    "summarized_story": "A sudden death is an unanticipated death.\nThe senior special assistant to the FCT minister, on health, Dr Ejike Orji, identified the things that can lead to sudden collapse and death as mostly metabolic and cardiac, adding that COVID-19 is also contributing.\nThe one that will cause sudden death is if the blood pressure shoots up so high and an artery bursts in the vein, the person can die immediately.\n“The other thing that is causing sudden death recently is COVID 19.\nADVERTISEMENT“The other thing that can cause sudden death is when people have Upper GI bleeding from peptic ulcer and the person did not manage it well and takes a drug that can cause massive bleeding."
  },
  {
    "headline": "BREAKING: Supreme Court Affirms 6-year Jail Term For Ex-pension Director",
    "summarized_story": "The N22.9bn was part of the Police Pension Fund Yusuf admitted before a High Court of the Federal Capital Territory (FCT) to have been misappropriated.\nJustice Abubakar said that the appeal of the former federal pension Director seeking to set aside the six years jail term against him by the appellate court was frivolous, vexatious and devoid of merit.\nADVERTISEMENTYusuf had dragged the Federal Government before the apex court seeking to overturn the six years imprisonment slammed on him by the Court of Appeal.\nIn his appeal lodged with the Supreme Court, he prayed the apex court to set aside his conviction and the order that he should refund N22.9bn.\nHis main grouse was that the Court of Appeal miscarried justice in its judgment."
  },
  {
    "headline": "BREAKING: Supreme Court Affirms 6-year Jail Term For Ex-pension Director",
    "summarized_story": "The N22.9bn was part of the Police Pension Fund Yusuf admitted before a High Court of the Federal Capital Territory (FCT) to have been misappropriated.\nJustice Abubakar said that the appeal of the former federal pension Director seeking to set aside the six years jail term against him by the appellate court was frivolous, vexatious and devoid of merit.\nADVERTISEMENTYusuf had dragged the Federal Government before the apex court seeking to overturn the six years imprisonment slammed on him by the Court of Appeal.\nIn his appeal lodged with the Supreme Court, he prayed the apex court to set aside his conviction and the order that he should refund N22.9bn.\nHis main grouse was that the Court of Appeal miscarried justice in its judgment."
  },
  {
    "headline": "Nigeria’s e-Passport Ranks 99 Best In The World",
    "summarized_story": "Nigeria’s e-Passport has been ranked 99 best out of over 200 countries’ passports in the world, as the passport holders can even visit a number of destinations without visas.\nThis, he said was despite the challenges of COVID-19, which greatly affected the availability of booklets and the passport issuing process.\nCovert agents will soon be going around passport offices to apprehend touts and officials involved in these unwholesome practices.\nADVERTISEMENTSpeaking directly to the Passport Control Officers, Aregbesola told them that, “I need not remind you, that as PCOs, you are the drivers of these reforms in your various Passport Offices.\n“I, therefore, urge you to make these your minimum threshold in the course of your tenure at the various Passport Offices."
  },
  {
    "headline": "BREAKING: Nigeria’s Statistician-General, Simon Harry, is dead",
    "summarized_story": "The federation’s statistician-general, Simon Harry, has died.\nIn August 2021, President Muhammadu Buhari named Harry to succeed Yemi Kale as the federation’s statistician-general and head of the National Bureau of Statistics (NBS).\nOn Wednesday, Sunday Ichedi, the chief of the department of communication and public relations, confirmed the development to our correspondent.\nPrior to his appointment as the Federation’s statistician-general.\nWith nearly three decades of statistical experience, Harry was the director of corporate planning and technical coordination in the NBS department."
  },
  {
    "headline": "BREAKING: Kidnappers Invade Zamfara College, Abduct Four Female Students",
    "summarized_story": "Suspected militants have kidnapped four students from the College of Science and Health Technology in Tsafe, Zamfara State.\nBandits broke into the college and kidnapped the female students.\nAccording to NEWS DIRECT, the kidnappers have already made contact with the victims’ relatives, seeking an undisclosed ransom.\nThe event occurred Tuesday night, when they invaded the campus with sophisticated weapons, according to reports.\nAttempts to contact the State Police spokesman, SP Mohammed Shehu, for confirmation of the news were unsuccessful since his mobile number was unavailable."
  },
  {
    "headline": "BREAKING: Four Officers Killed As Gunmen Attack Police Station In Anambra",
    "summarized_story": "BREAKING: Four Officers Killed As Gunmen Attack Police Station In AnambraGunmen stormed a police station in Atani, the headquarters of Anambra State’s Ogbaru Local Government Area, on Wednesday morning.\nAccording to the DAILY POST, the men arrived in the area around 1:30 a.m. on Wednesday and immediately attacked the police station.\nAccording to the source, four police officers were killed in the incident, including a female officer.\nMeanwhile, the State Police Command has confirmed the attack, confirming our source’s information.\nIn a telephone interview with DAILY POST, DSP Toochukwu Ikenga, the State Police Command’s spokesperson, confirmed the attack."
  },
  {
    "headline": "BREAKING: Nigeria’s Statistician-general dies seven months after appointment",
    "summarized_story": "BREAKING: Nigeria’s Statistician-general dies seven months after appointmentSimon Harry, the statistician-general of the federation, is deadHe died on Wednesday morning in Abuja.\nHarry was appointed by President Muhammadu Buhari in August 2021 to replace Yemi Kale as statistician-general of the federation to head the National Bureau of Statistics (NBS).\nMore to follow…"
  },
  {
    "headline": "2023: Osinbajo, Udom take bids to NASS, Bello rejects zoning, Ortom committee submits report to PDP – Blueprint Newspapers Limited",
    "summarized_story": "In his letter, Vice President Osinbajo said he intended to host the lawmakers to iftar (Muslim’s breaking of fast) at the Banquet Hall of the State House, Abuja.\nIt is proposed that members arrive at 6:30, at the State House Banquet hall.\nPDP receives reportMeanwhile,ahead of the PDP presidential primary election slated for 28th and 29th May 2022, Benue State Governor Samuel Ortom-led zoning committee Tuesday submitted its reports to the party’s National Working Committee (NWC).\nAfter 3 meetings in the last 2 weeks, it was reported that the 37-man zoning committee also recommended that the ticket be open, a claim denied by the committee.\nThe lawmaker said: “Every member of the 37-man zoning committee had ample opportunity to make their submissions."
  },
  {
    "headline": "Russia-Ukraine war: Buhari seeks review of 2022 fiscal framework – Blueprint Newspapers Limited",
    "summarized_story": "The Senate Tuesday received a request from President Muhammadu Buhari seeking approval for adjustments to the 2022 fiscal framework.\nThe request was contained in a letter dated 5th April, 2022, and read during plenary by Senate President Ahmad Ibrahim Lawan.\nHe also sought a reduction in the projected oil production volume by 283,000 barrels per day from 1.883 million barrels per day, to 1.600 million barrels per day.\nGiving a breakdown, he said the net deductions would see a cut by N13.46 billion from N102.78 billion to N89.32 billion for NDDC; NEDC, by N6.30 billion from N48.08 billion to N41.78 billion; UBEC, by N23.16 billion from N112.29 billion to N89.13 billion; Basic Health Care Fund, by N11.58 billion from N56.14 billion to N44.56 billion; and NASENI, by N11.58 billion from N56.14 billion to N44.56 billion.\nAccording to him, the total budget deficit was projected to increase by N965.42 billion to N7.35 trillion, representing 3.99% of GDP."
  },
  {
    "headline": "[Happening now] UEFA Champions League: Samuel Chukwueze’s goal stops Bayern Munich, sends Villarreal to semi-final, Real Madrid vs Chelsea go to extra time",
    "summarized_story": "Nigeria’s Super Eagles Forward Samuel Chukwueze scored the only goal in the second leg of UEFA Champions League quarter-final match between Bayern Munich and Villarreal.\nThat goal has now sent Bayern Munich out of the competition, and moved Villarreal marching into the semi-final.\nThe game ended 1-1, but Villarreal went ahead because both ties ended 2-1 in aggregate.\nAt the moment, Real Madrid vs Chelsea clash has entered extra time after both legs ended in a draw at regulation time.\nDetails loading…"
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Soludo declares Monday, a prayer session to counter IPOB sit-at-home order – NigPilot",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has urged the people of the state to observe a one-day prayer session on Monday, to curb the activities of the gunmen terrorising the state and the South East region in general.\nThe governor said the prayer session slated to hold on Monday, April 4, 2022, at churches and other religious worshipping centres across the state was necessary to counter the evil attached to the Indigenous People of Biafra, IPOB sit-at-home order.\nHe explained that the prayer session would be against those hiding under the IPOB name to cause havoc in the state.\n“I enjoin you to pause and join in fellowship as we seek the face of God.It is expected that the conclusion of the prayer session shall mark the end of Sit At Home in Anambra State” Soludo declared.\n” We shall empower them to become useful to their families, communities, state, region and the society at large."
  },
  {
    "headline": "Bandits Abduct Five College Of Health Science Students In Zamfara State",
    "summarized_story": "Bandits have invaded a residential area in Tsafe town and abducted five students of the College of Health Science and Technology, Tsafe, Zamfara State.\nA source in the area told Channels Television that the students were abducted when heavily armed men stormed their residence outside the school campus.\nHe said the bandits could not gain entrance to the school due to the heavy presence of security personnel.\nThe spokesperson of the command, Muhammed Shehu, said troops have been deployed to trail the bandits and rescue the victims unhurt.\nThe Federal Government had also designated the bandits as terrorists as calls mount for more military actions against the criminals."
  },
  {
    "headline": "Pension Scam: Supreme Court Affirms Six-Year Jail Term For John Yakubu",
    "summarized_story": "The Supreme Court has affirmed the six years imprisonment imposed on a former Federal Director of Pensions, Mister John Yakubu, and also ordered him to refund the sum of N22.9b to the Federal Government.\nThe N22.9b was part of the police pension fund he admitted before a High Court of the Federal Capital Territory (FCT) to have been misappropriated.\nThe apex court held that Yusuf and others engaging in fraudulent practices must be told through court judgments that it is no longer business as usual.\nJustice Abubakar said that the appeal of the former federal pension director seeking to set aside the six years jail term against him was frivolous and devoid of merit.\nYusuf had dragged the Federal Government before the apex court seeking to overturn the six years imprisonment slammed on by the Court of Appeal."
  },
  {
    "headline": "23 Locals Killed In Fresh Attacks On Two Benue Communities",
    "summarized_story": "At least 23 locals have been killed when some persons believed to be herders attacked two communities in Benue State.\nThe attacks occurred on Monday night at Mbadwem and Tiortyu communities in Guma and Tiortyu Local Government Areas respectively, state authorities said.\nNathaniel Ikyur, the Chief Press Secretary to Governor Samuel Ortom of Benue, confirmed the killings in a statement on Tuesday.\n“We are law-abiding citizens; we have cried for help against these invaders, but nothing is forthcoming,” Governor Ortom lamented.\nThe state government, Governor Ortom said, will not shy away from its commitment to providing welfare and security for its people."
  },
  {
    "headline": "Senate Passes Peace Corps Bill Again, Okays Creation Of Hunters Council",
    "summarized_story": "Lawmakers in the Senate have again passed the Nigerian Peace Corps (Establishment) Bill, four years after President Muhammadu Buhari rejected the proposed legislation.\nThey also approved another bill seeking legal backing for the establishment of a council for hunters across the country.\nREAD ALSO: Ndume Reintroduces Peace Corps Bill In SenateDuplicated DutiesThe 8th National Assembly had passed the peace corps bill in 2017 following a lengthy battle between the organisation and the security agencies.\nSenator Ali Ndume, however, reintroduced the bill in the Senate, and it was read for the first in December 2019.\nSenator Tolu Odebiyi, representing Senator Ahmad Kaita, laid and presented the report on the floor of the Senate."
  },
  {
    "headline": "President Buhari Swears In ICPC, NPC Commissioners",
    "summarized_story": "President Muhammadu Buhari has sworn in commissioners for the National Population Commission and the Independent Corrupt Practices and Other Related Offences Commission.\nThe swearing-in took place shortly before the commencement of the weekly Federal Executive Council meeting at the State House in Abuja on Wednesday.\nMeanwhile, the President is chairing the weekly Federal Executive Council (FEC) meeting at the council chambers of the Presidential Villa.\nPhysically present at the meeting are Vice President Yemi Osinbajo; Secretary to the Government of the Federation, Boss Mustapha; Chief of Staff to the President, Prof Ibrahim Gambari; National Security Adviser, Babagana Monguno (rtd).\nOther ministers and the Head of Civil Service of the Federation, Folasade Yemi-Esan, are participating virtually from their respective offices in Abuja."
  },
  {
    "headline": "Reps pass NYSC Trust Fund establishment bill -",
    "summarized_story": "A bill seeking the creation of a Trust Fund for the National Youth Service Corps now awaits the assent of President Muhammadu Buhari.This comes on a day lawmakers lamented the killing of over one hundred citizens by bandits in a border town between Taraba and Plateau statesA minute of silence for the repose of the souls of over one hundred persons said to have been killed by suspected bandits in parts of Taraba and Plateau states.\nThe lawmakers called for more security presence in the affected areas before it degeneratesA bill to prohibit child trafficking and baby factories in the nation’s capital, sponsored by Lagos member, Samuel Adejare, received the support of membersThe House also moved closer to repealing the Nigeria Customs Act for a new law as the legislators adopted the report of its Committee on CustomsA motion for more public sensitisation on registration of births and deaths for proper demographic planning was also unanimously passedAlso at Tuesday plenary, the legislators passed N369.13 billion for the Nigeria Customs Service as 2022 budget."
  },
  {
    "headline": "Plateau Group Endorses Asiwaju Tinubu as Party's Consensus Candidate -",
    "summarized_story": "A group by the name Plateau APC Support group, has lent their voices in support of Asiwaju Bola Ahmed Tinubu’s presidential ambition.\nMembers of the group, mostly youths in their numbers took to the streets of Jos, in a peaceful procession to express their support to the cause.\nThey believe that the coming of Mr. Tinubu as Nigeria’s president is a good Omen, following his numerous contributions to the sustenance of democracy for decades.\nThe leadership of the group briefed journalists after the procession, at the APC Secretariat in Jos, calling on the APC national body to make Asiwaju Bola Tinubu, their Consensus candidate."
  },
  {
    "headline": "Akeredolu orders appointees who have political ambition to resign -",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has ordered Political and Public office holders, who are desirous of contesting or participating as delegates in the 2023 electioneering process, to resign from office.\nAccording to a memo signed on behalf of the governor by the Secretary to the State Government, Princess Oladunni Odu, the appointees, who are aspiring to contest elective offices have till Thursday 14th April to resign.\nThe memo reads “In line with the provisions of section 84(12) of the electoral act 2022, Political and public office holders desirous of participating in electoral process either as contestants for elective positions or as delegates should resign their appointments on or before Thursday 14th April 2022.” the memo reads in part.\n“This is for your information and strict compliance”"
  },
  {
    "headline": "Updated: Why I resigned from Senate",
    "summarized_story": "Senator Abdullahi Adamu, the newly elected chairman of Nigeria’s ruling party, APC, has officially resigned from the Senate.\nIn a letter addressed to the President of the Senate Ahmad Lawan, he says the decision to resign is based on his recent election as the chairman of the APC.\nMr Adamu also commended the Senate President for his style of leadership in the ninth Senate and for being “non-partisan.”In a similar development , Senator Abubakar Kyari, also communicated his decision to resign from the Senate.\nMr Kyari, who represented Borno North in the Senate was elected as the Deputy National Chairman of the APC at the national convention held in March.\nHe thanked his constituents and the Senate for the opportunity to serve as well as the Senate President for his leadership style."
  },
  {
    "headline": "Biden Accuses Russian Troops of Committing Genocide in Ukraine",
    "summarized_story": "US President Joe Biden has accused Russian forces of committing acts of “genocide” in Ukraine.\nHe said Russian President Vladimir Putin was trying to “wipe out the idea” of a Ukrainian identity.\nMr Biden has previously stopped short of references to genocide, instead accusing Moscow of “war crimes”.\nBut Mr Biden insisted on Tuesday night that evidence of genocidal acts by Russian troops was mounting.\nLast month, US officials rowed back on comments President Biden made in Warsaw."
  },
  {
    "headline": "Nigeria Releases 40,000mt of Grains to Combat High Food Prices",
    "summarized_story": "“Like in the Ministry of Agriculture, we have Agro Rangers who sometimes provide some kind of security cover that will make sure food production does not stop.\nFood Crisis Looms, Okonjo-Iweala WarnsMeanwhile, Okonjo-Iweala sounded the warning yon Tuesday during a hybrid media briefing on the WTO Trade Forecast, that took place in Geneva.\n“Low income food deficit countries saw their food bills rise 20 per cent in 2021, an increase of over $120 billion.\nThe problem of high food prices is compounded by high fuel prices.\n“Its impact will be felt around the world, particularly in low-income countries, where food accounts for a large fraction of household spending."
  },
  {
    "headline": "Buhari Condemns Plateau Killings, Says Act Unforgivable as Another 23 Killed in Benue",
    "summarized_story": "Some bloodthirsty terrorists had at the weekend killed 80 persons and abducted 70 others after an invasion of communities in Plateau State.\nA statement in Jos by Dadu’ut urged the federal government to expeditiously apprehend the perpetrators of the Plateau killings and bring them to justice.\nMeanwhile, at least 23 locals were killed on Monday night in Benue State, when suspected armed herders attacked their communities.\nHe also urged the residents to cooperate with security agencies to flush out the undesirable elements in the society.\n“Let me tell you, these people have succeeded by recruiting informants, who tell them the movement of security agencies,” Abdullahi added."
  },
  {
    "headline": "LCCI Predicts Nigeria’s Debts May Hit N45tn in Q4 2022",
    "summarized_story": "The Lagos Chamber of Commerce and Industry (LCCI) has predicted that Nigeria’s total debt stock was expected to hit N45.86 trillion by December 2022.\n“In total, the federal government plans to add N6.3 trillion new debts to the current debt stock, which would push the country’s total debt stock to N45.86 trillion by December 2022,” he added.\nHe added that with the cost of diesel at record levels and persisting poor power supply, businesses had been running on unsustainable costs and producing at uncompetitive prices.\nThe LCCI boss added: “The government should create funding for critical infrastructure and special purpose intervention in the power sector.\nThe InfraCorp will succeed in mobilizsng private sector participation if we can achieve cost-reflective pricing in the power sector,” he said."
  },
  {
    "headline": "Displaced Persons in Nigeria Now 3.3 Million: ECOWAS",
    "summarized_story": "The Economic Community of West African States (ECOWAS) has said that Nigeria now has 3.3 million people displaced by various crisis rocking the nation, even as it revealed that modalities have been adopted that would stop youth from joining jihadists movement in the region.\nIts current 1.2 million displaced population represents a nine-fold increase from 2019.\n“Additionally, violent attacks by Boko Haram in Northeastern Nigeria, have resulted in the displacement of 2.5 million Nigerians, whilst kidnappings, extortion, and organised criminal attacks in the Northwest have displaced an additional 800,000 people.\n“In partnership with the German government, we have established the ECOWAS Fund for Regional Stabilisation and Development in fragile member states.\n“It will support the most vulnerable ofour population, women and youth, to regain control of their means oflivelihood."
  }
]