[
  {
    "headline": "Four Plateau arms dealers nabbed, police recover 54 rifles",
    "summarized_story": "Operatives of the Force Intelligence Bureau Response Team have arrested four notorious arms dealers and recovered 57 AK-47 rifles and a large catchment of ammunition in Jos, Plateau State, and from other locations across the country.\nThe suspects, Hamza Zakari (Hamzo), 20; Abubakar Muhammed (Fancy), 22; Umar Ibrahim, 25; and Muhammed Abdulkarim (Dan-Asabe), 37, all males and residents of Jos, were arrested following credible intelligence on their nefarious activities in Jos and its environs.\nThe police said the suspects – Bello Sani, Venab Puncat, and Yusuf Nahoda – during interrogation, confessed to having purchased one AK-47 rifle and one SMG rifle for N900,000.\nAdejobi said efforts were on to arrest their collaborators and recover the exhibits.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "My ambition is about Nigerians, says Amaechi",
    "summarized_story": "A presidential aspirant on the platform of the All Progressives Congress, Rotimi Amaechi, on Thursday said his presidential ambition was borne out of the need to serve and provide selfless leadership to Nigerians.\nAmaechi, who is the Minister of Transportation, said considering his wealth of experience, he would be a President that would protect the interest of all Nigerians irrespective of tribe or religion.\nHe spoke when he paid a visit to the leadership of the APC in Lagos State.\nHe also visited the state governor, Babajide Sanwo-Olu; and the Oba of Lagos, Oba Rilwan Akiolu.\n“So, because I come with that energy, it separates me from the rest of the candidates who are running with me."
  },
  {
    "headline": "Okowa committed to urbanising Delta communities – Omodon",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has been commended for his drive to urbanise rural communities in the state through massive road and drainage construction.\nState Commissioner for Works (Highways and Urban) Mr. Noel Omodon gave the commendation while speaking to newsmen recently in his office in Asaba.\nHe said that across the nooks and crannies of the state construction work was ongoing geared towards opening up places that were hitherto unreachable.\nHe stressed that the state government’s bridge projects were progressing very well adding that most of them would be completed before the end of the Okowa administration.\nIfeanyi Okowa has distinguished himself in infrastructure delivery including quality roads construction across the state."
  },
  {
    "headline": "Nasir El-Rufai’s succession plan: Who’s the chosen one?",
    "summarized_story": "I have often argued that, compared to Lagos, Kaduna State is more difficult to govern because Kaduna does not have as much resources; is by far larger; is nearly as populated and has the burden of religious and tribal crisis.\nAnd here is the genius of el-Rufai: even his staunchest detractors would agree that the man leaves nothing to chance.\nBut there is one that appears to standout, whom those who have been paying attention are suspecting is The Chosen One: Muhammad Sani Dattijo.\nSimilarly, Dattijo brought to life the Infrastructural and Industrial Master plan for Kaduna—the first of it’s kind for the State.\nHe is the most equipped to inspire a significant departure from the old thinking which is now imperative to trigger rapid development."
  },
  {
    "headline": "Okotie-Eboh supports Marwa’s request for drug integrity test for politicians",
    "summarized_story": "The President of a political pressure group, Itsekiri Development congress (IDC) Prince Emmanuel Okotie-Eboh, has said that he is one hundred percent in support of drugs integrity tests for all politicians seeking political offices in the country.\nOkotie-Eboh who was reacting to the request made by the chairman of the National Drug Law Enforcement Agency (NDLEA) Brig-Gen Buba Marwa (Retd) that the agency be allowed to conduct drugs integrity tests for politicians seeking political offices in the country.\nThe drug integrity test, according to Okotie-Eboh, was necessary because some of these politicians may use the money meant for the development of the people to fester their drug habits.\n“We all know that all drug addicts don’t think straight.\nPolitics is not an all comer thing like what is happening now where everyone want to come out to say the want to be President,” Okotie-Eboh said."
  },
  {
    "headline": "Master Plan: FCTA demolishes 600 structures, warns local chiefs against land allocation",
    "summarized_story": "By Omeiza Ajayi, AbujaThe Federal Capital Territory Administration FCTA, has pulled down down over 600 illegal houses in Zamani village along the Airport Road, warning local chiefs against land allocation to people.\n“The Minister has issued that warning times without number, they have gone against the urban and regional planning laws.\nAll the Chiefs even denied selling lands, they said they never sold land.\n“The Minister has warned severally that the locals should stop selling land and the non indigiens should also stop buying land from them.\nAnd they didn’t tell us that it was an illegal land."
  },
  {
    "headline": "Yul’s dad, Pete Edochie mum as Nigerians dig up old comment on polygamy",
    "summarized_story": "BY DAMILOLA OGUNSAKINNollywood veteran, seasoned administrator and broadcaster, Chief Pete Edochie, also know as Godfather, is considered by many as a ‘Legend’Many Nollywood fans grew up watching Pete Edochie on their TV screen, and he is known for using parables.\nEdochie, who publicly endorsed his son, Yul, for the 2023 Nigerian presidential election was dragged by many after his son announced his second wife.\nPete’s old post condemning polygamy was dug out by Nigerians.\n“Pete edochie wey Dey advise single women no fit advise him son.\nPete Edochie”@SaintDaozzi: “Pete Edochie should come out and say something about his son Yul Edochie."
  },
  {
    "headline": "2023: Most presidential, VP, guber aspirants going to loot – Oba of Benin to Osinbajo",
    "summarized_story": "The comments on the 2023 Nigeria elections made by the Oba of Benin, Omo N’Oba Ewuare II are trending.\nThe monarch, who received Vice President Yemi Osinbajo at his palace, said many aspirants were only seeking positions to amass wealth.\n“I think you are going to give a lot of problems to other contestants.\nThe Oba said most times, “people rushing to be president, vice president or governors, only to go there and loot the treasury, enrich themselves”.\n“We want to stay here in Nigeria, enjoy the good things of life in Nigeria; not in Dubai, not in the United States and others”."
  },
  {
    "headline": "Eid: Police ban campaigns, hailing of politicians at praying arenas in Kwara",
    "summarized_story": "Kwara State Police Command has warned against political campaigns and hailing of political gladiators at praying arenas in the state during the Eid-al-Fitr celebrations.\nOkasanmi said observing prayers at road sides and along the routes to the praying ground will also not be allowed, as restrictions of vehicular movements would be strictly enforced from 0800 hours to the praying ground.\n“To this end, the Command has emplaced a water tight security strategy across the length and breadth of Kwara State.\nThe Commissioner of Police Kwara State Police Command, Tuesday Assayomo, congratulated Muslim faithful on the successful conclusion of this year’s Ramadan fasting.\nHe also advised the good people of Kwara State to enjoy the long holidays with equanimity."
  },
  {
    "headline": "NYSC extends service year for two erring corps members in Yobe",
    "summarized_story": "The National Youth Service Corps (NYSC) in Yobe State, has extended the service year of two corps members, for violating laws of the scheme.\nMrs. Hafsat Yerima, Yobe State Coordinator NYSC, disclosed this on Thursday at the passing out parade of the 2021 Batch ‘A’ stream II Corps Members held at August 27 Stadium, Damaturu.\nMrs. Yerima, however, charged the passing out corps members to exploit their entrepreneurship skills learnt during the orientation course to be self-employed.\n“Happily, some corps members have benefitted from the collaboration”.\nShe lauded the Yobe State Government for all the necessary support and cooperation given to the Scheme."
  },
  {
    "headline": "Russia vs Ukraine war: It would get worse – Buhari warns",
    "summarized_story": "President Muhammadu Buhari has called for greater consideration for humanitarian conditions in the affected areas in the ongoing war in Ukraine.\nBuhari, during an Iftar dinner with members of the Diplomatic Corps, warned that the conflict will get worse, if an immediate resolution is not found.\n‘‘The war has lasted too long, cost so much and hurt too many people, well beyond the immediate theatres,” Buhari said.\n‘‘The United Nations must continue to actively lead the way for engagements that could ultimately unlock peace through diplomacy,’’ he said.\nBuhari called on Muslim faithful to use the solemn and rewarding month of Ramadan to prayers for de-escalation of the Russia-Ukraine conflict and for the return of peace to the world."
  },
  {
    "headline": "Itunu Babalola: FG reveals only way to get justice for Nigerian lady who died in Cote D’Ivoire prison",
    "summarized_story": "The Federal Government says that ‘diplomacy’ is the only way to get justice for Itunu Babalola, a Nigerian lady who died in Cote D’Ivoire prison last year.\nDada said the Federal Government would not rest on its oars “until justice is served in the matter’’.\nRecall that the 24-year-old Itunu from Oyo State reportedly died on Nov. 14 and Nigerians took to social media to express their angst over her death.\nItunu was convicted and sentenced to 20 years in prison which was later reduced to 10 years, but she died two years into her jail term.\n“We appealed against that judgement and it was in that process that this lady took ill and died in custody."
  },
  {
    "headline": "Ronaldo earns Man Utd draw against Chelsea",
    "summarized_story": "Cristiano Ronaldo scored his 17th goal of the season to earn Manchester United a point after David de Gea had frustrated Chelsea with several superb saves.\nThe visitors were thoroughly dominant in the first half at Old Trafford but were unable to find a way past De Gea, who made saves from Kai Havertz and N’Golo Kante.\nBut Chelsea finally broke the deadlock midway through the second half when Marcos Alonso volleyed home from an angle.\nRonaldo could have secured all three points for the hosts but his effort from a difficult angle was saved by Edouard Mendy.\nManchester United are sixth, five points behind Arsenal in fourth but having played two games more."
  },
  {
    "headline": "Soun, Olubadan and now the Alaafin!",
    "summarized_story": "His fitness corroborated his eulogy as one that death cannot kill or one that cannot be captured by diseases.\nAlaafin engraved his name on the pages of history where those who made change possible can never be forgotten.\nHis relentless efforts at peaceful coexistence among Yorubas, Southwest, and Nigeria are conspicuous, visible to the blind, and audible to the deaf.\nThen in January, Oba Olubadan followed suit, and a few months later, the Alaafin joined.\nOlubadan, Soun, and Alaafin have tried their best and left the rest; they should inform Awolowo, Akintola, and others that their children are still at loggerheads for the presidential ticket… Tell Baba Awo that Yorubas are still in caucus; not in unity."
  },
  {
    "headline": "BREAKING: FG declares May 2, 3 public holidays",
    "summarized_story": "The Federal Government has declared Monday 2nd and Tuesday 3rd May, 2022 as public holidays to mark workers day and EIdul-Fitr celebrations.\nThe Minister of Interior, Ogbeni Rauf Aregbesola, made the declaration on behalf of the Federal Government.\nA statement signed by the Permanent Secretary in the Ministry, Dr Shuaib Belgore said Aregbesola commended workers for their hard work, diligence and sacrifice.\nWe are alive because we work and only the dead is incapable of working.”Aregbesola enjoined workers to imbibe the culture of productivity.\nAregbesola called on all Muslims to imbibe and practice the virtues of kindness, love, tolerance, peace, self-denial, sacrifice and good neighbourliness as exemplified by the Holy Prophet Muhammad (Peace be upon Him)."
  },
  {
    "headline": "UPDATED: AGF Malami joins Kebbi Gov race",
    "summarized_story": "The Minister of Justice and Attorney -General of the Federation (AGF) Abubakar Malami (SAN) has joined the 2023 Kebbi Governorship race.\nHe said he accepted calls from the Kebbi people to join the race on the platform of the All Progressives Congress (APC).\nThe Minister made the acceptance in Birnin Kebbi at a gathering session with all APC stakeholders in the State.\nHe said: “People from the State have been pressurising him to contest for the governorship position come 2023.\nBagudu called on the youths to emulate the humility of Malami as a son of Islamic teacher."
  },
  {
    "headline": "2023: Umahi picks APC presidential form",
    "summarized_story": "Ebonyi Governor David Umahi has picked the presidential form of the ruling All Progressive Congress (APC).\nRead Also: Yahaya Bello picks APC presidential nomination formsHe said he will replicate the prudent management of the State’s resources, which enabled him to transform Ebonyi if elected president.\n“With the meager resources at our disposal in Ebonyi State, we were able to transform the state from the dust of the Nation to the Dubai of Nigeria.\nNwaze said: “The Governor of Ebonyi State, and All Progressives Congress Presidential Aspirant Engr David Umahi, has purchased his Expression of Interest and Nomination forms to contest for the office of the President of the Federal Republic of Nigeria”.\nLet all hands be on deck to ensure that Governor David Umahi gets the APC ticket."
  },
  {
    "headline": "2023: Bala Mohammed, Saraki under pressure",
    "summarized_story": "By Wilfred Eya and Noah Ebije, KadunaWith deadline for the primaries of political parties fast approaching, Bauchi State Governor, Bala Mohammed and former Senate president, Bukola Saraki have come under intense pressure as Northern elders intensify efforts to get one of them to step down.\nBoth aspirants emerged as the Northern consensus candidates of the main opposition Peoples Democratic Party (PDP) for the 2023 presidential election.\nHe said the Northern leaders have insisted that either of Mohammed or Saraki must step down for the other to reduce friction during the primary.\nApart from Mohammed, Saraki and Tambuwal, the other candidate in the consensus arrangement was Mohammed Hayatu-Deen, former managing director of African International Bank.\nProfessor Abdullahi, who is the Convener of the Northern Elders Forum (NEF) stated this at his Zaria residence while reacting to the Coalition of Northern Groups (CNG) leadership who paid him a visit."
  },
  {
    "headline": "2023: Tension mounts as PDP screens Atiku, Tambuwal, Obi, 14 others today",
    "summarized_story": "From Ndubuisi Orji, AbujaTension is mounting in the Peoples Democratic Party (PDP) as it finalises plans to screen 17 aspirants who obtained Expression of Interest and Nomination Forms for its May 28/29 presidential convention.\nThe aspirants include former vice president, Atiku Abubakar; former Secretary to Government of the Federation (SGF), Anyim Pius Anyim; former Senate President, Bukola Saraki; former governor of Anambra State, Peter Obi and Sokoto State governor, Aminu Tambuwal.\nDo not miss the Vital Information, it goes off in 2 days!\nParty leaders, especially those who are pro-zoning are concerned that immediately the screening is concluded, discussions on report of the committee may become an academic exercise.\nThe recommendation has not gone done well with stakeholders in the South, with the Southern PDP governors insisting that the ticket must be zoned to the area."
  },
  {
    "headline": "Insecurity threat to Nigeria’s nationhood –Gbajabiamila",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, has said security challenges pose serious threat to the foundations of Nigeria’s nationhood.\nHowever, we cannot do this for as long as our present national security challenges persist.”He, however, said the Nigerian Government had responded to the challenges by increasing funding for the police and the military and recruiting personnel for security agencies, among others.\nThe speaker said upon resumption, the House would do what was required to overcome the difficulties and deliver the dividends of democracy to the people.\nGbajabiamila also said he convened the first Conference of Speakers of African Parliaments (CoSAP), as a platform for continental parliamentary cooperation and coordination aimed at changing the dynamic.\nGbajabiamila said the Nigerian House of Representatives would this year host the inaugural in-person meeting of CoSAP to establish a framework of action."
  },
  {
    "headline": "NYSC sanctions 107 in Kebbi, Plateau, Lagos, Ondo",
    "summarized_story": "He urged the outgoing corps members to remain good ambassadors of the scheme and responsible role models to other youths.\nMeanwhile, 12 corps members posted to Lagos State have had their national service extended for absconding.\nNasarawa State coordinator, National Youth Service Corps NYSC Abdullahi Ahmed Jikamshi confirmed that 1,853 corps members successfully completed their programme while 40 who absconded or absented themselves from service would be sanctioned.\nHowever, three corps members died during the service year.\nGovernor Abdullahi Sule commended the corps members for patriotism, discipline and commitment to national service over the past twelve months."
  },
  {
    "headline": "NYSC sanctions 107 in Kebbi, Plateau, Lagos, Ondo",
    "summarized_story": "He urged the outgoing corps members to remain good ambassadors of the scheme and responsible role models to other youths.\nMeanwhile, 12 corps members posted to Lagos State have had their national service extended for absconding.\nNasarawa State coordinator, National Youth Service Corps NYSC Abdullahi Ahmed Jikamshi confirmed that 1,853 corps members successfully completed their programme while 40 who absconded or absented themselves from service would be sanctioned.\nHowever, three corps members died during the service year.\nGovernor Abdullahi Sule commended the corps members for patriotism, discipline and commitment to national service over the past twelve months."
  },
  {
    "headline": "THISDAY Presents Video Evidence of Wike’s Unreliability: Praising Amaechi, Obaseki Yesterday, Attacking Them Next Day",
    "summarized_story": "The video further showed that the newspaper’s publication of June 23, 2020, with caption: “With a Friend Like Wike, Obaseki Meets His PDP’s Waterloo; Almost,” was not libelous.\nDuring the cross examination, the witness, Igbanoi, argued that the publication by THISDAY did not make Wike’s political associates and friends to shun or abandon him.\nHe was appointed Director General of Obaseki Campaign Organisation despite the publication an indication that the publication clearly did not injure his public perception.\nLast month, the Rivers State High Court sitting in Port Harcourt had also watched video clips tendered by THISDAY.\nThe governor had claimed during his appearance in court that the publication portrayed him as deceitful, untrustworthy person."
  },
  {
    "headline": "Tinubu Joins Political, Business Leaders in S’Arabia for Prayers and Networking",
    "summarized_story": "The latest personality and political heavyweight to join other Nigerian leaders in prayer at a high octane networking, is the former governor of Lagos State and frontline presidential hopeful, Bola Ahmed Tinubu, who was though in Mecca for the Umrah as with others, however, found the atmosphere conducive for political networking, as usual.\nParticularly, this has become a political culture in Lagos State, where Tinubu was governor for eight years and has continued to dominate its politics in the last 23 years.\nIt was not surprising, therefore, that for an avowed kingmaker, who decided to throw his hat into the ring, joining other like-minds for Umrah, both for prayers and political networking, was almost a question of when.\nBut, as usual, such a gathering always affords us the opportunity to critically look at the state of the nation, particularly, now being an election season.\nYes, we’re – all networking and programming for the 2023 elections,” said one of the political leaders, who is also in Saudi for Umrah."
  },
  {
    "headline": "Senate Amends Terrorism Act, in Bid to Stave Off Sanctions",
    "summarized_story": "The passage of the Terrorism (Prevention) Act 2013 (Amendment) Bill, 2022, followed the consideration of a report by the Committee on Judiciary, Human Rights and Legal Matters.\nTwo months ago, the federal government disclosed that it had uncovered 123 companies and 96 other entities linked to terrorism financing.\nThe companies, which were alleged to be conduit for movement of money by terrorists, are yet to be tried by the federal government.\nCurbing terrorism financing has remained a hard nut to crack for the Nigerian government either due to lack of political will or gaps in legislation.\nThe gunmen had ambushed the train heading for Kaduna from the nation’s capital after bombing its rail track."
  },
  {
    "headline": "CIBN Donates 160-seater Lecture Theatre to ATBU",
    "summarized_story": "Segun AwofadejiAs part of its contribution to the development of banking and finance education in the country, the Chartered Institute of Bankers of Nigeria (CIBN) has officially commissioned a newly constructed multi- million Naira 160-seater lecture theatre it bequeathed to Abubakar Tafawa Balewa University (ATBU), Bauchi.\nThe theatre which is fully furnished and equipped with ultra – modern facilities is named ” THE CIBN BANKERS HALL” will serve as the melting pot for the training and development of future ready bankers.\nIn his address during the official commissioning ceremony of the Hall at the Gubi campus of the University, President and Chairman of Council of CIBN,Dr.\nVice Chancellor sir, I want to specifically request that you kindly help to drive the Linkage Programme in this Institution.\nAll students of Banking and Finance department and other related social science disciplines are expected to register as members of the institute, write the professional banking examinations and pay the annual subscription”, he pleaded."
  },
  {
    "headline": "Zenith Sustains Position as Nigeria’s Best Bank for Three Consecutive Years in Global Finance Award",
    "summarized_story": "Nume EkegheZenith Bank Plc has emerged as the Best Bank in Nigeria in the Global Finance Magazine’s Best Banks Awards 2022, retaining the award for a third consecutive year.\nThe bank was among other banks from 36 countries in Africa recognised as the prestigious Global Finance announced its 29th Annual Best Bank Awards Winners.\nThe editors of Global Finance made the selections after extensive consultations with corporate financial executives, bankers and banking consultants, and analysts worldwide.\nGlobal Finance considered factors that ranged from the quantitative objective to the informed subjective in selecting the top banks.\nFounded in 1987, Global Finance regularly selects the top performers among banks and other financial services providers, and the awards have become a trusted standard of excellence for the global financial community."
  },
  {
    "headline": "EXCLUSIVE: Buhari Extends Tenure Of Nigeria Immigration Service Boss, Isah Jere, Despite Attaining Retirement Age",
    "summarized_story": "President Muhammadu Buhari has approved the extension of the tenure of the Acting Controller-General of Nigeria Immigration Service, Isah Idris Jere.\nAn extension of the tenure of Jere as CGI will lay another bad precedent and will kill the morale of officers and men of the Nigeria Immigration Service.\n\"The officers working with NIS should be allowed to get to the pinnacle of their careers by allowing the young to grow instead of bringing officers from retirement to head the Nigeria Immigration Service.\nIn February 2021, Buhari caused public outrage after extending the tenure of the then Inspector General of Police, Mohammed Adamu, for three months after the police boss’ retirement.\nHowever, despite the public outrage, President Buhari refused to replace him, keeping the 67-year-old in that position to date."
  },
  {
    "headline": "EXCLUSIVE: Buhari Extends Tenure Of Nigeria Immigration Service Boss, Isah Jere, Despite Attaining Retirement Age",
    "summarized_story": "President Muhammadu Buhari has approved the extension of the tenure of the Acting Controller-General of Nigeria Immigration Service, Isah Idris Jere.\nAn extension of the tenure of Jere as CGI will lay another bad precedent and will kill the morale of officers and men of the Nigeria Immigration Service.\n\"The officers working with NIS should be allowed to get to the pinnacle of their careers by allowing the young to grow instead of bringing officers from retirement to head the Nigeria Immigration Service.\nIn February 2021, Buhari caused public outrage after extending the tenure of the then Inspector General of Police, Mohammed Adamu, for three months after the police boss’ retirement.\nHowever, despite the public outrage, President Buhari refused to replace him, keeping the 67-year-old in that position to date."
  },
  {
    "headline": "Why Goodluck Jonathan Can't Contest For Nigerian President Again – Lawyer, Falana",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Femi Falana, says former President Goodluck Jonathan cannot seek re-election into the office of the President, according to the constitution.\nPresident Muhammadu Buhari had on June 4, 2018, signed a constitutional amendment that stops a Vice President who completes the term of a President from contesting for the office of the President more than one more time.\nA President’s term can be cut short by reasons of death, resignation, or death to pave the way for the Vice President to complete the term of the departed President.\nFollowing the death of then-President Umaru Yar’Adua on May 5, 2010, Jonathan as the then Vice President, took a new oath of office to complete Yar’Adua’s term as President.\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress (APC) with a view to contesting the 2023 presidential election."
  },
  {
    "headline": "Why Goodluck Jonathan Can't Contest For Nigerian President Again – Lawyer, Falana",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Femi Falana, says former President Goodluck Jonathan cannot seek re-election into the office of the President, according to the constitution.\nPresident Muhammadu Buhari had on June 4, 2018, signed a constitutional amendment that stops a Vice President who completes the term of a President from contesting for the office of the President more than one more time.\nA President’s term can be cut short by reasons of death, resignation, or death to pave the way for the Vice President to complete the term of the departed President.\nFollowing the death of then-President Umaru Yar’Adua on May 5, 2010, Jonathan as the then Vice President, took a new oath of office to complete Yar’Adua’s term as President.\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress (APC) with a view to contesting the 2023 presidential election."
  },
  {
    "headline": "Why Goodluck Jonathan Can't Contest For Nigerian President Again – Lawyer, Falana",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Femi Falana, says former President Goodluck Jonathan cannot seek re-election into the office of the President, according to the constitution.\nPresident Muhammadu Buhari had on June 4, 2018, signed a constitutional amendment that stops a Vice President who completes the term of a President from contesting for the office of the President more than one more time.\nA President’s term can be cut short by reasons of death, resignation, or death to pave the way for the Vice President to complete the term of the departed President.\nFollowing the death of then-President Umaru Yar’Adua on May 5, 2010, Jonathan as the then Vice President, took a new oath of office to complete Yar’Adua’s term as President.\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress (APC) with a view to contesting the 2023 presidential election."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "“All startup founders must be financially literate.” – Olumide Adesina",
    "summarized_story": "Share this article:What do you think of when you hear financial literacy for startups?\nIf you’re like most people, you’re probably wondering why startups have to be financially literate, especially when much of the conversation around financial literacy has been about personal finance.\nAs surprising as it is, even businesses need financial literacy.\nHowever, he pointed out that knowing about financial issues does not equate to financial literacy.\nWith many startups opting for venture capital investments, Adesina observed that founders need to be careful while deciding what kind of investment they accept."
  },
  {
    "headline": "Another NFT hack?",
    "summarized_story": "Billed as the next generation of the web, Web3 focuses on decentralisation using decentralised blockchains.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nAnother NFT phishing schemeOn Monday, April 25, 2022, the Instagram account of the popular NFT collection, Bored Ape Yacht Club (BAYC), was hacked.\nEssentially, the hacker duped victims into handing over control of their wallets by creating a fake advertisement for an upcoming NFT project.\nThe hacker tricked users into clicking a link to “mint” a bogus NFT by sending Ethereum (eth) and, in some cases, an NFT to wrap into a token."
  },
  {
    "headline": "Hacking web3 with web2",
    "summarized_story": "On today’s episode of the Techpoint Africa Podcast, we discussed possible changes following the Digital Services Act, NFT scams, and African agritech inventions.\nWith the law not immediately coming into force, it would be interesting to see how tech companies adapt to these changes.\nIf this fuels your distrust or reluctance to get on the web3 train, Bolu says not to worry, as it was an Instagram account that was hacked.\nRegardless, there will be more attempts as web3 technologies catch on, and it will be interesting to see how it plays out.\nYou can always get today’s episode and previous episodes on your favourite podcasts, including Google Podcasts, Apple Podcasts, and Spotify."
  },
  {
    "headline": "ARM announces the winner of N12M in the Deji Alli ARM Young Talent Award (DAAYTA) 2022",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:ARM has announced the winner of the Deji Alli ARM Young Talent Award (DAAYTA) 2022 programme at the finalists’ pitch event which was held on the 8th of April, 2022.\nDAAYTA 2022 focused on start-ups with a minimum viable product (MVP) and at least one customer.\nL-R: Ina Alogwu, Director Digital Transformation ARM, Sadiq Mohammed, Deputy CEO ARM, DAAYTA 2022 Winner Tunde Adeyemi of D-Olivette Enterprise, Jumoke Ogundare, CEO ARM, Idris Salami, CO-Founder D-Olivette Enterprise, Uche Azubuike DAAYTA Programme Sponsor and Wale Odutola MD ARM Pensions, at the Prize Award ceremony for the winner of DAAYTA 2022.\nThe winner of DAAYTA 2022 Final Pitch, Tunde Adeyemi, CEO of D-Olivette Enterprise, (4th from left), flanked by some other participants of DAAYTA 2022, at the Prize Award ceremony.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "ARTSPLIT is Set to Redefine the African Art Space with Its Maiden Online Lease Auction.",
    "summarized_story": "ARTSPLIT also allows users to participate in a ‘Lease Auction’ on the app to win physical custody of these split artworks for a set period.\nAbout ARTSPLITARTSPLIT Limited is an art trading technology company driven by one common goal: Raising African Art’s global profile by building a diverse community of African art collectors and investors.\nWe are on a mission to introduce art as a currency and make it more accessible to invest, trade and collect African art.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Obaseki approves policy on aging to cater for elderly persons in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has approved the Edo State Policy on Aging to provide social care and protection for senior citizens in the state.\nThe Edo State Commissioner for Orientation and Communication, Andrew Emwanta, who disclosed this to journalists in Benin City, said the policy is part of efforts by the government to uphold the rights and dignity of senior citizens.\nHe said the Governor approved the new policy at the weekly Executive Council (EXCO) meeting, at the Government House, Benin City.\nHe said, “The Executive Council has approved the Edo State Policy on Aging which will provide social care and protection for senior citizens.\nThe Council resolved that the policy should move from being a policy on aging to a policy for senior citizens and the age of senior citizens was put at 65 years and above after careful deliberations."
  },
  {
    "headline": "Obaseki hands over defunct Edo College of Education, urges FG to name institution after Tayo Akpata – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Thursday, handed over the defunct Edo College of Education, Ekiadolor to the Federal Government, imploring the government to rename the citadel of learning after the executive secretary of the defunct Petroleum Trust Fund (PTF) and one-time Commissioner for Education in old Bendel State, Chief Tayo Akpata.\nObaseki handed over the institution to the Minister of Education, Mallam Adamu Adamu, reassuring that his administration will sustain investment in technical and vocational education in the state.\nThe governor said, “The only thing we ask for is that the school be named after one of our visionary commissioners for education, Tayo Akpata, who transformed our education landscape.\n“For us sir, we’re hoping that you will make this school a school of excellence to train teachers in technical subjects.\nSo, this federal college of education, technical, is going to help us in the revolution that we seek to achieve in our educational system in Edo."
  },
  {
    "headline": "Ex-gov’ship Candidate Appeals To EDSG To Tackle Insecurity – Nigerian Observer",
    "summarized_story": "Oboh said it is a known fact that the predominant occupation of the people in Esan land is farming, adding that due to the high level of insecurity in that region, they have ceased to go to their farms.\nShe decried that with the way things are and if not tackled, it may lead to a serious food crisis in that land.\nThe Esans are dying; the unknown herdsmen are killing our farmers.\nI am pleading to the conscience of our state governor, Godwin Obaseki, to use his executive powers to protect our farmers from being slaughtered.\nSecurity agents must be sent to the farm borders before more death and famine cripple our people for good, “she decried."
  },
  {
    "headline": "Obaseki receives wives of Southern Governors, urges collaboration to tackle food security – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…pledges reforms to end violence against women, girls…hosts Udom Emmanuel in BeninThe Edo State Governor, Mr. Godwin Obaseki, on Thursday, received members of the Southern Governors Wife Forum (SGWF), charging them on the need to support efforts at checking food insecurity.\nAddressing members of the Southern Governors Wife Forum, the governor said his government “will continue to demonstrate the political will to support and protect young boys and girls against sexual based violence.\nHe noted, “We don’t play with gender issues in Edo State.\nDespite the divide in our political outlook, you continue to work very closely as if there is no divide.\n“We should put pressure on federal authorities that rather than subsidising petrol, we should move the subsidy to food so that people can eat well."
  },
  {
    "headline": "Armed robbers attack ’empty’ bullion van in Imo",
    "summarized_story": "Armed robbers, on Thursday, attacked a bullion van belonging to a new generation bank along Owerri-Umuahia road.\nA resident who witnessed the incident told TheCable that the empty bullion van was attacked while returning to Owerri, Imo state capital.\nKennedy Iwuala, the resident, said the robbers intercepted the van around Ahiara junction in Ahiazu Mbaise LGA of the state, under the assumption that it was conveying cash.\n“A robbery incident has just occurred at Ogbor Nguru Nwenkwo in Aboh Mbaise local government this afternoon,” TheCable quoted him to have said.\nThe driver of the van was said to have sustained minor injuries and there was no casualty recorded in the robbery incident"
  },
  {
    "headline": "Soldier arrested for working as informant to ISWAP terrorist commits suicide",
    "summarized_story": "Lance Corporal Jibrin, a Nigerian soldier arrested for aiding Islamic State for West African Province (ISWAP), has shot and killed himself.\nJibrin was an instructor with the Nigerian Army battalion in Geidam, Yobe State.\nA military source told BBC Hausa that the soldier was involved in a series of attacks on communities in Yobe State in recent weeks.\nHe was put under surveillance after two separate attacks in Geidam and Gashua towns in Yobe recently.\nMilitary sources said the soldier was tracked by an army intelligence unit and was found in Gashua, some hundreds of kilometres from his duty post, on Tuesday."
  },
  {
    "headline": "Bandits release picture of baby delivered by woman kidnapped in Kaduna train attack",
    "summarized_story": "Bandits, on Thursday, released picture of a baby girl delivered by a pregnant woman kidnapped during an attack on a Kaduna bound train on Monday, March 28.\nThe woman who was eight months pregnant when she was kidnapped alongside others, by the bandits, was reported to have given birth few days ago in the den of the terrorists.\nThe bandits are said to be demanding the release of their commanders in exchange for the kidnapped victims.\nThe picture of the new girl was released, on Wednesday evening, by the terrorist group suspected to be Ansaru, a breakaway group of Boko Haram.\nThough, the identity of the newly born child was not disclosed until Wednesday when the terrorists released the picture of the baby girl."
  },
  {
    "headline": "2023: Give me right of 1st refusal, I already have 11m votest – Atiku to PDP leaders",
    "summarized_story": "Nigeria’s former vice president, Alhaji Atiku Abubakar, has told the national leadership of the People’s Democratic Party (PDP) to give him the right of first refusal for the party’s 2023 presidential ticket.\nAtiku affirmed that he already has 11 million votes in the kitty and therefore requested the PDP to give him the ticket.\nHe described himself as the best candidate, noting that however since this is a democracy, all other aspirants should have the right to face the electorate for the ticket.\nAtiku admonished the NWC to pave the way for the emergence of the best candidate to lead the party to victory in the 2023 general election.\nHe said the ruling All Progressives Congress (APC) has failed in comparative analysis with the PDP’s performance in government"
  },
  {
    "headline": "Insecurity Threatens Foundations Of Nigeria’s Nationhood – Gbajabiamila",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has said that the current security challenges in Nigeria were a threat to the foundations of the country’s nationhood.\n“However we cannot do this for as long as our present national security challenges persist.\nADVERTISEMENT“For me and the House, we understood that the best dividend of democracy is a just society, where individual rights are recognised and respected.\nWhere citizens have the freedom to dream big dreams and the social resources and infrastructure to achieve those dreams.\n“We proposed landmark legislation to reform our public health emergency response system and update our public vaccination protocols."
  },
  {
    "headline": "Eid-el-Fitr: FRSC, NEMA Deploy Personnel On Abuja Routes",
    "summarized_story": "Ahead of the Sallah celebrations, the National Emergency Management Agency (NEMA) Abuja operations office, and the Federal Road Safety Commission (FRSC), have deployed their personnel on roads leading into and out of Abuja, the nation’s capital.\nThe deployment, which was part of the Easter deployment, is billed to cover the Sallah period starting from this weekend.\nSpeaking at the event, NEMA’s head of Abuja operations office, Justin Uwazuruonye, said this was done to ensure the smooth flow of traffic during the festive seasons and complement the efforts of FRSC.\nThe personnel were deployed at Giri – Gwagwalada, Zuba and Airport Roads, including Nyanya-Kugbo down to Mararaba Road.\nSome of the equipment deployed include Mobile Intensive Care Unit (MICU) Ambulances for life support, Rapid Response Van with extricating equipment and experienced personnel."
  },
  {
    "headline": "Eid-el-Fitr: FRSC, NEMA Deploy Personnel On Abuja Routes",
    "summarized_story": "Ahead of the Sallah celebrations, the National Emergency Management Agency (NEMA) Abuja operations office, and the Federal Road Safety Commission (FRSC), have deployed their personnel on roads leading into and out of Abuja, the nation’s capital.\nThe deployment, which was part of the Easter deployment, is billed to cover the Sallah period starting from this weekend.\nSpeaking at the event, NEMA’s head of Abuja operations office, Justin Uwazuruonye, said this was done to ensure the smooth flow of traffic during the festive seasons and complement the efforts of FRSC.\nThe personnel were deployed at Giri – Gwagwalada, Zuba and Airport Roads, including Nyanya-Kugbo down to Mararaba Road.\nSome of the equipment deployed include Mobile Intensive Care Unit (MICU) Ambulances for life support, Rapid Response Van with extricating equipment and experienced personnel."
  },
  {
    "headline": "Ramadan: Wamakko Facilitates Release Of 50 Inmates In Sokoto",
    "summarized_story": "The chairman of the Senate Committee on Defence and deputy chairman, Senate Committee on Anti-Corruption Committee, Senator Aliyu Magatakardan Wamakko, has facilitated the release of 50 inmates from the Sokoto Correctional Center.\nWamakko, representing Sokoto North senatorial district, said the move was a step in his initiative for an annual gesture extended to the beneficiaries during last 10 days of every Ramadan.\nSpeaking, while releasing the inmates, the Welfare Officer of the Sokoto Custodial Centre, ASP Ayyuba Alhassan, commended Senator Wamakko for sustaining the invaluable annual gesture.\nHe explained that out of the 50 freed inmates, six are women while 35 were from the Custodial Centre in Sokoto, and others were from different satellite Custodial Centres across the State .\nHe commended Wamakko for sustaining the annual gesture, and appealed to other wealthy individuals to emulate him."
  },
  {
    "headline": "Ramadan: Wamakko Facilitates Release Of 50 Inmates In Sokoto",
    "summarized_story": "The chairman of the Senate Committee on Defence and deputy chairman, Senate Committee on Anti-Corruption Committee, Senator Aliyu Magatakardan Wamakko, has facilitated the release of 50 inmates from the Sokoto Correctional Center.\nWamakko, representing Sokoto North senatorial district, said the move was a step in his initiative for an annual gesture extended to the beneficiaries during last 10 days of every Ramadan.\nSpeaking, while releasing the inmates, the Welfare Officer of the Sokoto Custodial Centre, ASP Ayyuba Alhassan, commended Senator Wamakko for sustaining the invaluable annual gesture.\nHe explained that out of the 50 freed inmates, six are women while 35 were from the Custodial Centre in Sokoto, and others were from different satellite Custodial Centres across the State .\nHe commended Wamakko for sustaining the annual gesture, and appealed to other wealthy individuals to emulate him."
  },
  {
    "headline": "Use me, I already have 11 million votes: Atiku tells PDP",
    "summarized_story": "A presidential aspirant of the Peoples Democratic Party (PDP), Atiku Abubakar, made a strong pitch for the party’s ticket as he claimed he has 11 million votes already.\nAtiku, a former vice-president said he is the best candidate to win the 2023 presidential election for the party.\n“I urge you to provide the right kind of leadership so that the best candidate can emerge,” he said.\nCommenting on the meeting on his Facebook page, Atiku wrote:“My meeting with the NWC of the PDP was very engaging.\nI affirmed to them that if they are looking for the very best candidate for 2023 presidential, they don’t need to look any further”."
  },
  {
    "headline": "Ronaldo snatches point for United in clash with Chelsea",
    "summarized_story": "Cristiano Ronaldo scored an excellent equaliser to spare Manchester United a third successive English Premier League defeat as they drew 1-1 at home to Chelsea on Thursday.\nIn spite of a dismal first-half showing in which their midfield was routinely cut open, Manchester United somehow made it until the break without conceding.\nChelsea dominated the first half almost from start to finish, with a brief moment of Manchester United pressure culminating in Ronaldo putting a close-range bicycle-kick over.\nOtherwise, Manchester United had to rely on wasteful Chelsea finishing and David de Gea to keep the scoreline level.\nManchester United needed to win all of their final four matches to better the 64 points they managed in 2013/2014."
  },
  {
    "headline": "2023: Osinbajo’s credentials speak for themselves, says Oba of Benin",
    "summarized_story": "2023: Osinbajo’s credentials speak for themselves, says Oba of BeninThe Oba of Benin, Oba Ewuare II, says the credentials of Vice President Yemi Osinbajo speak for themselves.\nThe monarch made this known on Thursday when Osinbajo visited him in his palace in Benin, the Edo State capital, as part of consultations for the VP’s 2023 presidential ambition.\nOba of Benin said, “We got a letter from your office just the day before yesterday (Tuesday) that the Vice President is coming.\nWe don’t need to overflog your credentials, they speak for themselves.\nOthers include former Lagos State governor, Bola Tinubu; Minister of Transportation, Rotimi Amaechi; Minister of State for Education, Emeka Nwajiuba; Minister of Labour and Employment, Chris Ngige; Ebonyi State Governor, Dave Umahi; Kogi State Governor, Yahaya Bello; former Imo State Governor, Rochas Okorocha; former Abia State Governor, Orji Kalu; amongst others."
  },
  {
    "headline": "BREAKING: Unknown gunmen attack bullion van in Imo",
    "summarized_story": "A bullion van vehicle driving from Mbaise to Owerri, on Thursday was attacked by unknown gunmen in Aboh Mbaise Local Government Area of Imo state.\nThe incident happened at about 02:10 pm at Ogbor Nguru, Nwankwo in Aboh Mbaise LGA in the state.\nIt was said that the gunmen were after the bullion van thinking it was loaded and conveying cash.\nThe driver of the bullion van escaped after the van tumbled severally and ran into about four different vehicles packed at the spot where it happened.\n“The driver of the bullion van vehicle was able to escape."
  },
  {
    "headline": "JUST IN: Buhari’s Top Ally Escapes Assassins’ Bullets In Kano",
    "summarized_story": "JUST IN: Buhari’s Top Ally Escapes Assassins’ Bullets In KanoUnknown gunmen suspected to be hired assassins last night attacked the residence of Farouk Adamu Aliyu, a frontline ally of President Muhammadu Buhari in Kano.\nDAILY INDEPENDENT gathered that the attack on the residence of the APC chieftain and former member of the Federal House of Representatives left his security guard injured.\nZuwaira Aliyu, wife to Farouk Adamu Aliyu in her verified Facebook timeline, said: “My husband escaped hired assassins last night in Kano.\nMay Allah continue to protect him and us Ameen.”The police authority in Kano through its local Image maker, SP Abdullahi Haruna Kiyawa confirmed the story."
  },
  {
    "headline": "JUST IN: Pete Edochie Reacts To Son’s Second Marriage, Bans New Wife From His House",
    "summarized_story": "JUST IN: Pete Edochie Reacts To Son’s Second Marriage, Bans New Wife From His HouseVeteran Nollywood actor, Chief Pete Edochie, has broken silence on his son’s, Yul Edochie, extramarital affairs.\nRecall that Yul had on Wednesday announced that he had a second wife with whom he also had a son.\nHe introduced Judy as his second wife, after 17 years of marriage with May.\nPete who spoke Wednesday outrightly declared bjat son’s newly found second wife Judy Austin persona non grata in his household.\nA child that doesn’t listen to his father end up cutting his or her life span short.”Yul, on Wednesday, welcomed a son with his second wife, Judy Austin, who is also a Nigerian actress."
  },
  {
    "headline": "Breaking: High profile football agent is dead",
    "summarized_story": "High-profile football agent Mino Raiola has died at the age of 54 following a battle with lung disease.\nRaiola represented the likes of Paul Pogba, Erling Haaland and Zlatan Ibrahimovic.\nBack in January, Raiola underwent checks in Italy after reports said he was rushed to hospital for surgery.\nGerman newspaper BILD said he was intensive care due to a lung disease, although his spokesperson downplayed the visit, saying: ‘Mino Raiola is undergoing the usual medical examinations that require anesthesia.\nA promising footballer growing up, Raiola took over the reins as the head of HFC Haarlem’s youth team aged just 20 in 1987 before beginning his career as a football agent."
  },
  {
    "headline": "At last, Nollywood legend, Pete Edochie, breaks silence on son’s second wife, issues ultimatum",
    "summarized_story": "As reactions continue to trail Yul Edochie’s announcement of a second wife with his new son, his father and veteran Nollywood actor, Chief Pete Edochie, has given ultimatum.\nPete who spoke Wednesday outrightly banished son’s newly found second wife Judy Austin from entering his household.\nYul set social media on fire recently after he introduced Judy as his second wife, after 17 years of marriage with May.\nThe veteran actor bore his mind on the second wife and son that Yul had outside his knowledge, after having four children from the first wife.\nA child that doesn’t listen to his father end up cutting his or her life span short.”Yul, on Wednesday, welcomed a son with his second wife, Judy Austin, who is also a Nigerian actress."
  },
  {
    "headline": "APC presidential ticket: Yahaya Bello, Nwajiuba pick forms, thief carts away $75,000",
    "summarized_story": "Bello speaksSpeaking to journalists shortly after picking the forms, Governor Bello promised to unite and secure the country.\n“If at the end of seven days after Ramadan, President Goodluck Jonathan remains undecided, we shall most respectfully repeat our visit to his office for a Second meeting with President Goodluck Jonathan.\n“In furtherance of our position, we have written President Goodluck Jonathan a letter to this effect, which was acknowledged and received by his office yesterday, April 26th, 2023.\n“We earnestly hope that President Goodluck Jonathan fully understands that our future depends on his decision.\nAccording to Akumobi, “Goodluck Jonathan is a custodian of freedom of speech; he is a man with good heart."
  },
  {
    "headline": "AIB-N releases interim report on united Airl peace max police Accidents",
    "summarized_story": "By Naomi DouglasAccident Investigation Bureau, Nigeria AIB-N, on Tuesday, released four preliminary reports on serious incidents and accident involving aircraft owned and operated by United Nigeria Airlines Limited, Max Air, Air Peace and the Nigerian Police Air Wing.\nThe preliminary report on the serious incident involving Max Air Boeing 737-300 aircraft, which was parked at the Nnamdi Azikiwe International Airport, Abuja with nationality and registration marks 5N-DAB and was involved in an on-ground collision with Skyway Aviation Handling Co. Plc SAHCO lavatory service truck with fleet number 9/5 on November 21, 2021.\nThe preliminary report on serious incident involving a Boeing 737-300 aircraft owned and operated by Air Peace Limited with nationality and registration marks 5N-BUQ, which occurred after take-off from Sam Mbakwe Airport, Owerri, Nigeria enroute Lagos on November 22, 2021 and finally.\nThe preliminary report on an accident involving a Bell 429 helicopter owned and operated by Nigeria Police Air Wing with Nationality and Registration marks 5N-MDA, which occurred at the Sir Abubakar Tafawa Balewa Airport, Bauchi, Nigeria on January 26, 2022.\nHe explained that the preliminary reports are not final but contained information gathered from witness statements, flight recorders, Health and Usage Monitoring System Hums Data, Flight Data Monitoring FDM data, and preliminary inspection of the accident sites and the wreckages."
  },
  {
    "headline": "MDAs under Ministry of Communication brief new Permanent Secretary",
    "summarized_story": "By Asuelimen OsasuyiAll departments, agencies and unites under the Federal Ministry of Communication/Digital Economy have briefed the newly appointed Permanent Secretary Mr. William Nwankwo Alo about their activities.\nTop official at the ministry told Nigerian Pilot that the Permanent Secretary who assumed office last week needs to meet with all the heads of agencies, departments and unites before hitting the ground running.\nNwankwo Alo, from Ebonyi State was moved from the Police Service Commission to replace Mr. Bitrus Nabasu who retired from service recently.\nNigerian Pilot source said activities at the ministry have been put on hold following the absence of a permanent secretary to give directives since Mr. Bitrus Nabasu went on retirement.\nNow that we a permanent secretary, things will soon begin to work as expected,’’ Our source said."
  },
  {
    "headline": "NDE empowers 235 unemployed persons with enhancement loans in Anambra",
    "summarized_story": "Tony Oraeki, AwkaNo fewer than 235 unemployed persons have benefitted from the dual programmes of Micro Enterprise Enhancement Scheme, MEES, and Start Your Own Business, SYOB, organized by the National Directorate of Employment, NDE, in Anambra state.\nAmong the number of beneficiaries, 228 persons were selected under the MEES group and were empowered with a loan package of #4,560,000 at #20,000 to each person, while 7 persons under SYOB were equally given a total sum of #3,500,000 at the rate of #500,000 per person.\nDisclosing this during the disbursement ceremony yesterday in Awka, the Anambra State Coordinator of NDE, Mrs. Chika Ufelle stated that NDE created this loan scheme to further empower artisans and market women with soft loans in order to enhance their operational capacity under MEES.\n“ It is our strong belief that all the beneficiaries of this loan scheme would judiciously make use of this opportunity to create and enhance their businesses, make more money and employ others.” The Coordinator stated.\nAccording to her, “Another 146 previously trained SADTS and other graduates of agricultural schemes were resettled with a total loan package of #14,600,000 while #100,000 was disbursed to each of the beneficiaries."
  },
  {
    "headline": "OFIs: CBN releases guidance on AML/CFT regulations",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE Central Bank of Nigeria (CBN) has released a guidance note on Anti-Money Laundering (AML) and Combating the Financing of Terrorism (CFT) regulations for Other Financial Institutions (OFIs).\nIn a circular posted on its website, which was signed by the Director, Financial Policy and Regulation Department, Mr. Chibuzo Efobi, the CBN said it developed the guidance note in order “to assist the OFIs in iden-tifying risks associated with money laundering and terrorist financing that will help them in designing effective AML/CFT compliance programme.”The apex bank, however, emphasised that the note “does not constitute secondary regulation or new regulatory requirement.\nIt is intended to assist OFIs to comply with measures contained in the CBN AML/CFT Regulations, 2013 (as amended) and other relevant AML/CFT laws.”It further stated that it does not override any legal or regulatory requirements, adding that “in the event of any discrepancy between the Guidance Note and relevant AML/CFT laws and regulations, the provisions of the latter will apply.” According to the CBN, OFIs should develop and administer AML/CFT programme that is commensurate with their size, complexity of operations and the requirements of extant AML/ CFT Laws and Regulations in the country.\nSpecifically, the apex stated: “OFIs are required to develop an AML/CFT programme, which at the minimum should contain the following: Board and Senior management oversight; Risk Management; Policies and Procedures; Monitoring and Suspicious Transaction Report; Internal Control; Compliance Function and Training."
  },
  {
    "headline": "GTCO records N54.3bn PBT in Q1",
    "summarized_story": "The Group reported profit before tax of ₦54.3billion, representing an increase of 1.1% over ₦53.7billion recorded in the corresponding period March 2021.\nImportantly, our non-banking businesses including Pension Management, Wealth Management and Payments will serve to diversify our earnings capacity as we look to create a model financial services ecosystem for all of Africa.\nGTCO Plc is a fully-fledged financial services group with banking operations across West and East Africa and the United Kingdom as well as non-banking businesses in several key industry segments including Payment, Funds Management and Pension Fund Management.\nWith over 25 million customers and more than 10,000 employees, the Group remains one of the most profitable and best managed financial services companies out of Nigeria.\nIt also retained its position as Africa’s Most Admired Financial Services Brand in the 2021 ranking of The Brand Africa 100: Africa’s Best Brands."
  },
  {
    "headline": "Ochanya: Court Acquits Lecturer Accused Of Rape, Another Jails Wife For Negligence",
    "summarized_story": "Ochanya was admitted to the Federal Medical Centre in Makurdi for two months before she died on October 17, 2018.\nOn October 10, 2019, the Benue State government arraigned 54-year-old Ogbuja before the Makurdi High Court on four counts of rape and Ochanya’s death.\nThe anti-trafficking agency accused Mrs Ogbuja of failing in her duty to protect the deceased from being raped by her husband and son.\nAgreeing with the prosecution, she said “the evidence that Ochanya told the defendant (Mrs Ogbuja) about what was going on, and was not successfully challenged,” proved NAPTIP’s case.\nBut Justice Olajunwo sentenced Mrs Ogbuja to five months imprisonment without an option of a fine, after listening to her lawyer’s plea for clemency."
  },
  {
    "headline": "VIDEO: Why Jonathan Can’t Run For Presidency – Falana",
    "summarized_story": "Human rights lawyer and Senior Advocate of Nigeria, Femi Falana, on Thursday said that former President Goodluck Jonathan cannot run for the 2023 presidential race.\nIn a statement, Falana said Jonathan cannot contest the 2023 presidential election by virtue of Section 137 (3) of the Constitution of the Federal Republic of Nigeria, 1999 (as amended).\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress, APC, to contest the 2023 presidential election,” the statement partly read.\nHaving spent 5 years in office as President, Dr. Jonathan is disqualified from contesting the 2023 presidential election.\nJonathan was elected President of Nigeria in the 2011 election but lost to Muhammadu Buhari in 2015."
  },
  {
    "headline": "2023: Osinbajo Visits Oba Of Benin, Re-Echoes Desire To Serve",
    "summarized_story": "﻿Vice President Yemi Osinbajo on Thursday visited the Oba of Benin, Omo N’Oba Uku Akpolokpolo, Ewuare II where he reiterated his desire to serve the country.\nOsinbajo visited the revered monarch as he continues consultations ahead of the 2023 presidential race.\nThe visit to the palace, the Vice President, explained is to inform the Oba of his intention to run for president in the coming election.\nOn his part, the Oba of Benin said he admires the Vice President’s eloquence, calmness, humility, respect for culture, and fear of God.\nAccording to him, the VP is eminently qualified for the position as he prayed that the voters hear his voice."
  },
  {
    "headline": "Ex-Abia Deputy Speaker Asks Court To Stop PDP Presidential Primary",
    "summarized_story": "A former Deputy Speaker of the Abia State House of Assembly, Cosmas Ndukwe, has approached a Federal High Court in a bid to stop the presidential primary election of the Peoples Democratic Party (PDP) scheduled to hold on May 28.\nHe asked the court sitting in Abuja, the Federal Capital Territory (FCT) to stop the PDP’s presidential primary because the party has not zoned its ticket to the South East.\nThere have been controversy and debates over where the party’s presidential candidate should emerge.\nThis followed the inauguration of the party’s zoning committee by its National Working Committee on March 24 amid calls that the PDP should zone its presidential ticket to the southern region of the country.\nRather, he said the committee would forward its report to the National Executive Committee (NEC) of the party."
  },
  {
    "headline": "‘I Already Have 11 Million Votes’, Atiku Woos PDP NWC For Presidential Ticket",
    "summarized_story": "A presidential aspirant of the Peoples Democratic Party (PDP), Atiku Abubakar, on Thursday wooed members of the party’s National Working Committee, saying he already has 11 million votes.\nAddressing the PDP NWC in Abuja, the former vice president said he is the best candidate to win the 2023 presidential election for the party.\n“I urge you to provide the right kind of leadership so that the best candidate can emerge,” he said.\nThe former vice president declared his intention to run for president last month.\nHe was the PDP presidential candidate in the 2019 general elections."
  },
  {
    "headline": "Stolen money at APC secretariat not for party",
    "summarized_story": "The All Progressives Congress, APC, has cleared the air on the reported missing/stolen $50,000, saying it does not belong to the party nor the secretariat.\n“On Wednesday, April 27, 2022, a sum of $50,000 was reported lost by an individual around the entrance gate of the National Secretariat of the Party.\n“To be clear, the lost money does not belong to the Party.\n“As widely advertised and reported in major news outlets, all purchase of forms are payable to designated bank accounts of the Party.\n“We urge our party members and the general public to disregard any reports or suggestion to the contrary as false and grossly misleading,” the statement said."
  },
  {
    "headline": "Oyo APC set to reconcile, as stakeholders meet to resolve crisis",
    "summarized_story": "The crisis that has rocked the Oyo state chapter of the All Progressives Congress is poised to end as stakeholders in the party met on Thursday to resolve issues.\nThe opposing groups of Isaac Omodewu and Abu Gbadamosi met at a conference organized by Florence Ajimobi, wife of former Oyo State Governor, and agreed to address concerns for the party’s advancement.\nOn his part, the party chairman in the state Isaac Omodewu expressed optimism on the reconciliation plans, adding that he hopes the decisions made would favour both factions.\nIn her own response, wife of the former governor of Oyo state, Florence Ajimobi said it’s a good thing that she is reconciling the party, being part of what her husband tried to achieve before his demise.\nThe Oyo state APC crisis broke out some months ago after some members of the party were alleged to have hijacked the party structure in the state."
  },
  {
    "headline": "APC Presidential aspirant, Nicolas Felix visits party leaders in Edo -",
    "summarized_story": "A Presidential aspirant on the platform of the All Progressives Congress, Nicolas Felix on Thursday visited party leaders in Edo state ahead of his official declaration.\nThe Edo-born politician will on Saturday, April 30, officially declare his intention to contest the 2033 Presidential election.\nThe event is expected to hold in LagosDr Felix said the visit is part of his consultation ahead of the declaration, adding that he chose to start from his home state, Edo."
  },
  {
    "headline": "Obasa, others holds special tawaf for Tinubu in Mecca",
    "summarized_story": "A special Tawaf was held on Thursday, April 28, for Asiwaju Bola Ahmed Tinubu, National Leader of the All Progressives Congress (APC) and top contender for the office of the president.\nTagged ‘Special Tawaf for Asiwaju’, the session commenced by 12 noon and was conducted around Kaabah at the centre of Islam’s most important mosque, the Masjid al-Haram in Mecca, Saudi Arabia.\nThe Tawaf was attended by some Islamic scholars and political leaders from Nigeria, including the Speaker of the Lagos State House of Assembly, Rt.Hon.\nMudashiru Obasa, who said the event was also to thank Allah for the former governor of Lagos ahead of the presidential election.\nMeanwhile, the former Lagos governor and presidential candidate of the All Progressives Congress, Asiwaju Bola Tinubu, has expressed gratitude to the state House of Assembly for the special Tawaf and prayer session the house organized for him in Mecca, Saudi Arabia on Thursday."
  },
  {
    "headline": "Atedo Peterside: It is Slowly Becoming Unfashionable For Youths Not to Have Voters Card",
    "summarized_story": "Entrepreneur & Founder of Stanbic IBTC Bank Plc, Atedo Peterside, speaks with ARISE about his hopes for the upcoming elections & youth participation in shaping the future of Nigeria."
  },
  {
    "headline": "Politicians Should be Tested For Drugs Says NDLEA + Nigerian Extradited To U.S.- Trending With Ojy Okpe",
    "summarized_story": "Mohammed Bawa Marwa, Chairman and Chief Executive of the National Drug Law Enforcement Agency on Wednesday urged political parties to make drug integrity test part of the screening requirement for aspirants seeking to contest political offices in the 2023 elections on their platforms.\nReactions have trailed the bill seeking to prohibit the payment of ransom which passed third reading at the senate on Wednesday.\nThe bill which is an amendment of the Terrorism Prevention Act 2013, according to lawmakers would discourage the rising spate of abductions and improve the security situation in the country.\nIn the meantime, The Zamfara State Government has sacked Two Emirs; the Emir of Zurmi Atiku Abubakar and the Emir of Dansadau Hussaini Umar over their alleged inviolvement in banditry activities in the state.\nFinally, reactions have trailed the extradition of one Adedunmola Gbadegesin by the Economic and Financial Crimes Commission, to the United States over a wire fraud scam worth $148,000"
  },
  {
    "headline": "Nigeria: MTN Spent N3.4tn on Capital Investments, Paid N3.5tn in Taxes and Levies in 21 Years, Says Toriola",
    "summarized_story": "MTN Nigeria said it spent N3.4 trillion on capital investments and paid N3.5 trillion in taxes and levies to Nigeria’s federal government since it commenced operations in the country 21 years ago.\nSpeaking on the MTN Nigeria and PAU MIP initiative, Toriola said the programme would be handled by PAU’s School of Media and Communication (SMC).\n“The six-month, fully funded fellowship for Nigerian media practitioners is designed to support the sustainable development of the nation’s changing media scene.\n“It is open to media practitioners across the spectrum, including print, electronic, online platforms and social media content creators.\nThus, it is only fitting that we support developments in the Nigerian media space with our infrastructure and enable capacity building initiatives to enable innovation in media practice."
  },
  {
    "headline": "Nigeria’s Senate Amends Terrorism Act, Prohibits Payment of Ransom to Kidnappers",
    "summarized_story": "The passage of the Terrorism (Prevention) Act 2013 (Amendment) Bill, 2022, followed the consideration of a report by the Committee on Judiciary, Human Rights and Legal Matters.\nTwo months ago, the federal government disclosed that it had uncovered 123 companies and 96 other entities linked to terrorism financing.\nCurbing terrorism financing has remained a hard nut to crack for the Nigerian government either due to lack of political will or gaps in legislation.\nHe prayed God to touch the hearts of the kidnappers to show mercy on their innocent and vulnerable victims.\nThe gunmen had ambushed the train heading for Kaduna from the nation’s capital after bombing its rail track."
  },
  {
    "headline": "Nigeria: Presidential Hopeful Tinubu Joins Political, Business Leaders in Saudi Arabia for Prayers and Networking",
    "summarized_story": "The latest personality and political heavyweight to join other Nigerian leaders in prayer at a high octane networking, is the former governor of Lagos State and frontline presidential hopeful, Bola Ahmed Tinubu, who was though in Mecca for the Umrah as with others, however, found the atmosphere conducive for political networking, as usual.\nParticularly, this has become a political culture in Lagos State, where Tinubu was governor for eight years and has continued to dominate its politics in the last 23 years.\nIt was not surprising, therefore, that for an avowed kingmaker, who decided to throw his hat into the ring, joining other like-minds for Umrah, both for prayers and political networking, was almost a question of when.\nBut, as usual, such a gathering always affords us the opportunity to critically look at the state of the nation, particularly, now being an election season.\nYes, we’re – all networking and programming for the 2023 elections,” said one of the political leaders, who is also in Saudi for Umrah."
  }
]