[
  {
    "headline": "IYC wants Jonathan’s convoy crash probed, Wike, UNIPORT mourn",
    "summarized_story": "“We are calling on security agencies to rise up to their responsibilities and beef up security around the former President.\nMeanwhile, Rivers State Governor, Nyesom Wike, has expressed gratitude to God for making the former President Jonathan escape unhurt in the crash.\n“I was so elated to hear that President Goodluck Jonathan escaped unhurt.\nThe association’s National President, Ule Williams, in a condolence message on Thursday, thanked God for saving the life of Jonathan.\nWilliams stated, “We give thanks to the Almighty God for saving the life of the former President, Dr Goodluck Jonathan."
  },
  {
    "headline": "OAU extends mid-semester break by 4 weeks",
    "summarized_story": "The management of the Obafemi Awolowo University, Ile-Ife, Osun state, has extended its mid-semester break by four weeks.\nOn March 26, 2022, the management had announced a two-week break for students beginning from Monday, March 28.\nIt read in part, “On March 26, the university management announced a two-week mid-semester break for students beginning from Monday, March 28, 2022.\n“With the full realisation of the import and impact of the industrial actions embarked upon by the various unions within the Nigerian university system, the university management has decided to elongate the mid semester break by four weeks.\n“Students are therefore directed to continue with the mid-semester break for four weeks, beginning from Monday, April 11, 2022.”Copyright PUNCH."
  },
  {
    "headline": "Banditry: How I slept in bush for 19 days to escape from bandits — Pastor Dauda Yosi Kwaki",
    "summarized_story": "fate of wife and children unknown 2 months afterBy Wole Mosadomi, MinnaFOR the past three months, bandits have shifted their onslaught to Shiroro and Munya local government areas of Niger State.\nIn Shiroro Local Government Area, there are15 political wards with many communities, while there are 13 political wards in Munya with many other communities looking for means of sustenance.\nThose who were lucky to escape the onslaught have gory tales of what they passed and still passing through to tell.\nOne of them is Pastor Dauda Yosi Kwaki of Cherubim and Seraphim Movement Church in Mangorata Town in Munya Local Government Area of the state.\nPastor Kwaki spoke with Arewa Voice after escaping massacre by the bandits along with his family of eight."
  },
  {
    "headline": "Birnin Gwari: Seized by terrorists, avoided by natives, emirate risks extinction",
    "summarized_story": "Birnin Gwari has come to denote a centre of terror, fear and agony; not the serenity that it was meant to provide for men and women.\nThey did not bargain for any of these atrocities that now characterise Birnin Gwari.\nThe Emir of Birnin Gwari, Malam Jibril Zubairu Mai Gwari has not relented in calling attention to the worsening insecurity in his domain.\nLamentations over deteriorating security situation in Birnin Gwari continue to grow.\n“Currently the major den of the kidnappers that operate along Birnin-Gwari to Kaduna road is around Falale (Demba) of Buruku forest."
  },
  {
    "headline": "Northern leaders frown at Soyinka’s comment on Omisore, APC",
    "summarized_story": "*OmisorePolitical stakeholders in North-East geo-political zone on Thursday reacted to Wole soyinka comments against the National Secretary of the All Progressives Congress (APC), Senator Iyiola Omisore, saying it was in bad faith.\nThe leaders described Omisore as a man of profound moral rectitude.\nThe leaders in a statement in Damaturu, capital of Yobe State, said influential Yoruba leaders should rise in condemnation of the uncomplimentary remarks on Omisore.\n‘’Senator Omisore is a patriot, a thinker, and a fighter for good causes’’The statement cited Omisore for honesty, industry, and patriotism.\nThe group also praised President Muhammadu Buhari and the esteemed members of the ruling party for electing Omisore the party’s National Secretary."
  },
  {
    "headline": "Convoke national discourse on security –AfBA president",
    "summarized_story": "By Ozioruva AliuBENIN CITY – THE President of African Bar Association (AfBA), Hannibal Uwaifo has called on President Muhammadu Buhari to immediately convoke a national discourse on insecurity in Nigeria as according to him, the people in charge have displayed lack of will and capacity to check insecurity in the country.\n“We need to have a national discourse on it where pertinent questions will be asked.\nIt is a big problem that may spell doom for the country with the way it is escalating everyday.\nOn his inauguration as notary public, Uwaifo said it is a call for more work to the public and the profession.\n“In addition to this, the Chief Justice of Nigeria may direct the Chief Registrar to remove the name of the Notary from the register,” he warned."
  },
  {
    "headline": "NBM, others slam N1 billion law suit against Linda Ikeji",
    "summarized_story": "By Akpokona OmafuaireEFFURUN- THE Neo Black Movement (NBM) of Africa and three others have slammed a N1 billion law suit against Linda Ikeji, a Nigerian foremost micro online blogger for defamation and libel at the Delta State High Court in Effurun Court 2.\nThe suit with number EHC/210/2021 had the Registered Trustees of NBM of Africa, Olorogun Ese Kakor, Olorogun Felix Kupa and Mayor Onyebueke as Claimants with Linda Ikeji as the sole defendant.\nAgbroko added that that his clients’ organization is not known as such.\nAccording to him, “The name of the organization is NBM of Africa, she also called them criminals in the said publication.\nThe matter which is before Honourable Justice Roli Daibo- Harriman of High Court 2, High Court of Justice, Effurun, Delta State came up yesterday but the defendant was absent and no representation by Counsel."
  },
  {
    "headline": "Surgery saga: Court rules Dr Anu, Med Contour have case to answer",
    "summarized_story": "The Federal High Court in Lagos State has rejected the no case submission by Dr. Anuoluwapo Funmilayo Adepoju and Med Contour.\nThe Federal Competition and Consumer Protection Commission (FCCPC) dragged her to court after a complaint of post-body surgery complications.\nOn Thursday, the court ruled that the evidence so far tendered satisfied the elements of the criminal charges pending against the defendant.\nThe court adjourned the case to May 26, 2022 for continuation of trial.\nIrukera called for information or evidence of activities that can assist in ensuring obedience of the law or retribution for disobedience."
  },
  {
    "headline": "Kogi: Police give update on abduction of passengers along Anyigba-Itobe road",
    "summarized_story": "Kogi State Police Command has clarified a report making the rounds that over 15 passengers have been kidnapped on Anyigba-Itobe highway on Wednesday.\nIn a statement by the Police Public Relations Officer, William Ovye Aya on Thursday, said the report was false, explaining that Kogi State Police Command responded to a distress call and chased kidnappers before rescuing 12 of the passengers, while the kidnappers were being trailed inorder to rescue the remaining abducted four passengers.\nThe statement said: “The attention of the Kogi State Police Command has been drawn to the news making the rounds that over 15 Passengers are missing as kidnappers stormed Anyigba-Itobe Highway of Kogi State.\n“Kogi Police Command urges clarification of reports before going to the press to avoid misleading the public.\n“The Commissioner of Police, CP Edward Egbuka, who was on a visiting tour at Kogi East Senatorial Zone, got the information while he was on his way to Ejule, immediately moved to the scene met with the rescued passengers and ordered that they should be moved to Itobe Division for debriefing.”"
  },
  {
    "headline": "Train attack: We won’t rest until we rescue kidnapped passengers",
    "summarized_story": "The Federal Government on Thursday, assured families whose relations are being held hostage by terrorists who attacked a Kaduna-bound train last week that it will do everything within its powers to rescue the victims.\nThe abductors of Kaduna-Abuja train passengers had threatened to kill all the victims if the federal government did not negotiate with them.\nIn a video released on Wednesday, the armed men said the Federal Government knows what they were asking for, as they are not interested in receiving any ransom from the families or relatives of their victims.\nHowever, the Minister of Transportation, Mr. Rotimi Amaechi, during a ministerial press briefing on Thursday in Abuja, said the government will do everything possible to release the abducted victims.\nHe, however, noted that details of the engagement with the security agencies cannot be disclosed at this time so as not to jeopardize the operations."
  },
  {
    "headline": "NYSC DG warns corps members against night journeys, social vices",
    "summarized_story": "The Director-General, National Youth Service Corps (NYSC), Brig.-Gen. Shuaibu Ibrahim, has urged corpS members to avoid embarking on night journeys to reduce the risk of getting involved in auto crashes.\nHe added that corps members should shun social vices such as drug abuse, trafficking, cybercrime and advanced-fee-fraud in their Places of Primary Assignment, PPA.\nIbrahim, who was represented by the Akwa Ibom Coordinator, Mrs Chinyere Ekwe, gave the charge during the closing ceremony of 2022 Batch “A” Stream 2 Corps Members at NYSC Orientation camp, Ikot Itie Udung in Nsit Atai on Thursday.\nThe DG told corps members that when their journey exceeds 6pm they should spend their night at military barracks or any other officially secured location.\nHe said the initiative known as NYSC Group Individual Family Social Health Insurance Programme (GIFSHIP) would help in improving the health of corps members even as he enjoined them to make good use of the opportunity by registering under the Health Care Providers in their service locations."
  },
  {
    "headline": "Some African countries luring multinational companies to relocate – Minister",
    "summarized_story": "Nigeria’s Minister of Industry, Trade and Investment, Otumba Niyi Adebayo, has revealed how some African countries were lobbying multinational companies registered and operating in Nigeria to relocate to such countries.\nThe Minister revealed this on Thursday when he appeared before the House of Representatives Committee on Public Accounts to answer queries raised against his Ministry and Parastatals under him.\nThe Office of the Auditor General of the Federation has queried the ministry of Industry, Investment and Trade and some Parastatals under it over some alleged financial infractions.\nAs worrisome as the development is, Adebayo said, the government was doing all it could to stop such companies from relocating to other African countries.\n“The Ministry of Industry, Trade and Investment had issued some instruments which earned companies tax breaks and tax holidays."
  },
  {
    "headline": "2023: APC declares nomination forms free for women aspirants",
    "summarized_story": "Barely 24 hours after a Federal High Court in Abuja ruled that government must implement the 35 per cent affirmative action for women, the ruling All Progressives Congress (APC) has declared free nomination forms for women aspirants for all elective offices in the 2023 general election.\nThe nomination waiver covers all women aspirants vying for the party’s tickets to contest state and national assemblies, governorship and presidential seats.\nWomen aspirants in the ruling party had hitherto enjoyed a 50 per cent discount for expression of interest and nomination forms.\nAPC National Women Leader, Dr. Betta Edu, spoke yesterday at the party’s national secretariat in Abuja.\nShe urged Nigerian women to come to the ruling party to benefit from the gesture."
  },
  {
    "headline": "JNI queries Fed Govt’s inability to wipe out bandits, terrorists",
    "summarized_story": "The apex Islamic body in the North, Jama’atu Nasril Islam (JNI), under the leadership of the Sultan of Sokoto, Alhaji Muhammadu Sa’ad Abubakar III, has queried Federal Government’s inability to proactively take the battle to terrorists’ hideouts and wipe them off.\nIn its reaction to last week’s terrorists’ attack on the Abuja-Kaduna train, the Islamic body said the essence of government and governance is to protect the five principal cardinal rights of the human race.\nFormer President Olusegun Obasanjo also said the government appeared overwhelmed by the level of insecurity in the land.\nThey urged the Federal Government to take urgent steps to fight the menace to a standstill.\n“We have, however, carefully studied and followed up the unfortunate train blast, especially that another train attack was reported to have occurred on the Lagos-Kano-bound train, near Jaji, Kaduna State, on Thursday, March 31, 2022, which inevitably led to the death of the locomotive operator."
  },
  {
    "headline": "Botched 2014 NIS recruitment: Court convicts ex-Perm Sec Daniel-Nwobia",
    "summarized_story": "A Federal High Court in Abuja has convicted a former Permanent Secretary in the Federal Ministry of Interior, Mrs. Anastasia Daniel-Nwobia, over the botched 2014 recruitment into the Nigerian Immigration Service (NIS).\nJustice Dimgba discharged and acquitted two other defendants in the case – former Interior Minister Abba Moro (now a serving senator) and a Director of Finance in the ministry, Femi Alaiyebami.\nThe EFCC had, in 2016, brought an 11-count charge against Moro, Daniel-Nwobia, Alaiyebami and a firm, Drexel Tech Nigeria Limited, engaged to provide technological backing for the recruitment.\nJustice Dimgba struck out counts 1, 3, 6, 7, 8, 9, and 10 (seven out of the 11 counts) and ordered Moro, Daniel-Nwobia and Alaiyebami to enter defence over counts 2, 4, 5 and 11.\nIn his judgment yesterday, the judge discharged and acquitted the three defendants in counts 2, 5 and 11, but convicted Mrs. Daniel-Nwobia on count 2."
  },
  {
    "headline": "2023: Cross River and the batlle for zoning",
    "summarized_story": "In the Cross River State PDP, there is a freer disposition of aspirators.\nWhat are the permutations for the election of the eventual Cross River State governor in 2023?\nSenator Bassey Otu was defeated twice in 2015 and 2019 by Senator Gershom Bassey, who is the current senator representing the Southern Senatorial District.\nIt will be an electoral skirmish, but Otu does have the chance to be the next Cross River State governor here.\nA Bassey win is vital for the PDP to regain control of the affairs of Cross River State."
  },
  {
    "headline": "I’m waiting for anyone to sue over Omisore, says Soyinka",
    "summarized_story": "The literary icon said he was ready for anyone who might want to challenge him on his position concerning Omisore.\nSounding figurative, Soyinka said: “If the ruling party wants Omisore, they should make him an ambassador, probably to Ukraine.\nThis issue will not go away.”The Nobel laureate indicted the leadership of APC for giving such an exalted position to Omisore.\nSoyinka urged President Muhammadu Buhari to fulfill his electoral promise by reopening the files of unresolved assassinations in the country.\nThe Nobel laureate urged the government to seek international assistance on insecurity rather than go for mercenaries, as suggested by Kaduna State Governor Nasir El-Rufai."
  },
  {
    "headline": "States, LGs to earn more than FG in new revenue formula",
    "summarized_story": "The new adjustments to the revenue allocation formula due to the federating units are contained in a report presented, yesterday, to President Muhammadu Buhari at the Presidential Villa, Abuja, by RMAFC Chairman, Elias Mbam.\nThe president said for the nation to have a lasting review of the present revenue allocation formula, there must first be an agreement on the responsibilities to be carried out by all the tiers of government.\nThe president also thanked Nigerians, especially states and local governments, for making their inputs through the broad stakeholder engagement processes that produced the report.\n“I am aware the present revenue allocation formula has not been reviewed since the last exercise carried out in 1992.\nHe said the leading philosophy behind the proposed review was guided “by the need for distributive justice, equity and fairness as enshrined in relevant sections of the 1999 Constitution (as amended).”"
  },
  {
    "headline": "Bola Ige: I’ll be delighted to go to court –Soyinka",
    "summarized_story": "Ige was assassinated by suspected gunmen at his Bodija, Ibadan, Oyo State, home on December 23, 2001.\nSoyinka lamented the rising insecurity in the country leading to killings, kidnappings and violence in several states.\nSoyinka said a man decaped a respected minister and threw the cap to thugs, noting that such an action led to other actions.\nThe leadership of APC and I am not talking of Buhari alone, do you have to unleash scorpions on our memory?\nI will be delighted to go to court so that we can go into details."
  },
  {
    "headline": "Killings: Bomb terrorists’ enclaves now, Kaduna pastors tell FG",
    "summarized_story": "From Noah Ebije, KadunaSome pastors in Kaduna State, yesterday, took to the streets to protest the spate of killings and kidnappings by terrorists in the state urging the Federal Government to bomb bandits and terrorists in their enclaves out of existence.\nThe protest came against the backdrop of attacks in the state in recent months, especially the killing of innocent civilians Thursday night.\nThe clerics threw their weights behind the state government, saying, security and intelligence agencies should isolate and bomb terrorists’ enclaves.\nThey also appealed to the Federal Government to compensate all victims of bandits attacks, award scholarships to children affected by banditry and also rebuild communities ravaged by attacks.\nThat’s why we have come out to seek for divine intervention concerning the issue of peace and security in Kaduna State and Nigeria at large."
  },
  {
    "headline": "Be fair, firm, Buhari charges APC chair",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, charged the newly-elected chairman of the All Progressives Congress (APC), Abdullahi Adamu, to be fair and firm in all his dealings in his new assignment.\nSenior Special Assistant to the President on Media and Publicity, Garba Shehu, in a statement, said Buhari stated this when he received Adamu, in company with the former acting chairman of the APC caretaker convention committee and Governor of Yobe State, Mai Mala Buni.\nThe president assured he would continue the struggle to entrench democratic principles in politics and the affairs of governance.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nOur policies and programmes aim at nothing but the betterment of the country and its people."
  },
  {
    "headline": "Nigeria loses $1.5bn to oil theft in 3 months –NNPC",
    "summarized_story": "From Ndubuisi Orji, AbujaNigerian National Petroleum Corporation (NNPC) has said the country lost $1.5 billion worth of crude oil, which represents about 250,000 barrels of crude per day, to oil theft between January and March 2022.\nConsequently, Kyari canvassed the establishment of a special court to try cases of oil theft and pipeline vandalism.\nThe GMD, who blamed the drop in the country’s daily crude oil production on the activities of oil thieves and pipeline vandals, said they must be tackled seriously in view of the danger their activities are posing to the economy.\nEven on our most reliable pipeline which is the Forcados pipeline, we still lost about 7000 barrel per day.\n“We know that to sell crude oil in the international market, it is not the business of the ordinary people that you see in these illegal refineries."
  },
  {
    "headline": "Breaking: Gunmen Burn down Soludo’s LGA Secretariat",
    "summarized_story": "David-Chyddy Eleke in AwkaUnidentified men, wielding automatic riffles Thursday evening burnt down Aguata Local Government Area Secretariat at Ekwulobia.\nAguata Local Government Area is the home local government of the governor of Anambra State, Prof Chukwuma Soludo.\nA resident of the Area, who refused to be named said most shops inside the council Secretariat were also burnt, including the main secretariat building, which houses several departments.\n“We are not sure yet if there are casualties, but soldiers are already arresting youths of our community,” the source said.\nMeanwhile, the Anambra State Police command has confirmed the incident, saying that its men are already on ground and have commenced close monitoring of the area."
  },
  {
    "headline": "Breaking: Court Quashes Recruitment Fraud Charges against Abba Moro",
    "summarized_story": "Alex Enumah in AbujaJustice Nnamdi Dimgba of a Federal High Court in Abuja, on Thursday, discharged and acquitted former Minister of Interior, Abba Moro, in an alleged corruption and fraud charge in the botched recruitment exercise by the Nigerian Immigration Service (NIS) in 2014.\nMoro and three others were arraigned on an 11-count charge, bordering on allegations of obtaining money by pretence, procurement fraud and money laundering by the Economic and Financial Crimes Commission (EFCC) in 2016.\nThe others include former Permanent Secretary in the Ministry of Interior, Mrs. Anastasia Daniel-Nwobia, and a Deputy Director in the Ministry, Mr. Femi Alayebami.\nHowever, delivering judgment on Thursday after listening to the defendants’ case, the court exonerated the former minister in the remaining four counts.\nThe court also, in the judgment, found the second defendant guilty in count four of the charge and also discharged the third defendant of charges in counts 2, 4, 5 and 11."
  },
  {
    "headline": "Zenith Shareholders Reap Bumper Harvest as Bank Pays N97.3bn Dividend",
    "summarized_story": "The shareholders gave the approval at the bank’s 31st Annual General Meeting (AGM) held yesterday at Civic Centre, Victoria Island, Lagos.\nSunny Nwosu, expressed the delight of shareholders over the consistent payment of dividends by Zenith Bank, noting that the bank’s shares remain the toast of investors because the bank has never failed to pay dividends to shareholders.\nIts profit before tax also grew by 10 per cent, from N255.9 billion to N280.4 billion in the current year.\nThis further led to a seven per cent increase in net interest income of N320.8 billion in 2021, from N299.7 billion in 2020.\nRetail deposits grew by N146 billion from N1.72 trillion in 2020 to N1.87 trillion in 2021."
  },
  {
    "headline": "THISDAY Projects: With Northern Presidential Candidate, PDP Set to Lose Key Southern States",
    "summarized_story": "So, the party would face an uphill task winning these states even with a northern presidential candidate and the APC fielding a southern candidate.\nA Pan-Niger Delta Forum, (PANDEF), has also expressed its disappointment at the PDP decision, saying it was an awful decision that would have consequences.\nA copy of the recommendation of the zoning committee obtained by THISDAY stated thus: “Zoning, as in our party constitution, is affirmed.\nAlso, it stated that, 35 in every 100 Nigerian that registered to vote in 2019 presidential election, voted.\nHis words: “I am not talking as a zoning committee member or the chairman of zoning committee; I am talking as Samuel Ortom."
  },
  {
    "headline": "Jonathan Escapes Unhurt as Two Aides Die in Abuja Road Accident",
    "summarized_story": "•Ex-president, Atiku mournEmmanuel Addeh andKingsley Nweze in AbujaEx-President Goodluck Jonathan yesterday escaped unhurt in a road accident in Abuja, although the crash left two of his police aides dead and others injured.\nAlthough it wasn’t clear what caused the accident, Jonathan was said to have left Yenagoa, Bayelsa, his home state, for Abuja in the afternoon before the accident which saw a number of the cars in the convoy mangled, happened.\nMeanwhile, a former Vice President of Nigeria, Atiku Abubakar has commiserated with Jonathan over the occurrence, describing the deaths as shocking.\nOn his Twitter handle, Atiku stated that the story of the accident and the loss of two of Jonathan’s aides were heart-wrenching.\n“I console the immediate families of the deceased as well as President Jonathan."
  },
  {
    "headline": "BREAKING: Nigerian High Court Bars Supporters, Activists, Others From Premises For Terrorism Cases With 24 Hours To Nnamdi Kanu’s Hearing",
    "summarized_story": "The Federal High Court on Thursday stated this in a directory referred to as “Practice Directions On Trial of Terrorism Cases” obtained by SaharaReporters.\n“ORDER 11 - DIRECTIONS ON TRIAL PROCEEDINGS - 1.\nPerimeters of the Court; (a) The perimeters of the Court sitting over a terrorism trial shall be secured for the period of the trial for safety of litigants and Court officials.\nDirect that all or any part of the proceedings of the Court shall not be published in any manner; f).\nCoverage of proceedings under these Practice Directions is strictly prohibited, save as may be directed by the Court."
  },
  {
    "headline": "BREAKING: Nigerian High Court Bars Supporters, Activists, Others From Premises For Terrorism Cases With 24 Hours To Nnamdi Kanu’s Hearing",
    "summarized_story": "The Federal High Court on Thursday stated this in a directory referred to as “Practice Directions On Trial of Terrorism Cases” obtained by SaharaReporters.\n“ORDER 11 - DIRECTIONS ON TRIAL PROCEEDINGS - 1.\nPerimeters of the Court; (a) The perimeters of the Court sitting over a terrorism trial shall be secured for the period of the trial for safety of litigants and Court officials.\nDirect that all or any part of the proceedings of the Court shall not be published in any manner; f).\nCoverage of proceedings under these Practice Directions is strictly prohibited, save as may be directed by the Court."
  },
  {
    "headline": "Bola Ige's Murder: I'll Be Delighted To Go To Court To Provide Details — Wole Soyinka",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, says he is willing to be involved in legal proceedings to unravel the killers of a former Attorney-General of the Federation and Minister of Justice, Chief Bola Ige.\nAccording to Soyinka, Omisore's latest appointment and acceptance by Buhari is a major setback in the pursuance of justice in Ige's murder.\nHowever, during the press interaction on Thursday, Soyinka insisted that Omisore should not have been made a secretary of the ruling party.\nI will be delighted to go to court so that we can go into details,\" Soyinka said.\nHuman rights lawyer, Femi Falana, promised to provide legal assistance to Soyinka if a litigation was opened against him."
  },
  {
    "headline": "Bola Ige's Murder: I'll Be Delighted To Go To Court To Provide Details — Wole Soyinka",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, says he is willing to be involved in legal proceedings to unravel the killers of a former Attorney-General of the Federation and Minister of Justice, Chief Bola Ige.\nAccording to Soyinka, Omisore's latest appointment and acceptance by Buhari is a major setback in the pursuance of justice in Ige's murder.\nHowever, during the press interaction on Thursday, Soyinka insisted that Omisore should not have been made a secretary of the ruling party.\nI will be delighted to go to court so that we can go into details,\" Soyinka said.\nHuman rights lawyer, Femi Falana, promised to provide legal assistance to Soyinka if a litigation was opened against him."
  },
  {
    "headline": "Bola Ige's Murder: I'll Be Delighted To Go To Court To Provide Details — Wole Soyinka",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, says he is willing to be involved in legal proceedings to unravel the killers of a former Attorney-General of the Federation and Minister of Justice, Chief Bola Ige.\nAccording to Soyinka, Omisore's latest appointment and acceptance by Buhari is a major setback in the pursuance of justice in Ige's murder.\nHowever, during the press interaction on Thursday, Soyinka insisted that Omisore should not have been made a secretary of the ruling party.\nI will be delighted to go to court so that we can go into details,\" Soyinka said.\nHuman rights lawyer, Femi Falana, promised to provide legal assistance to Soyinka if a litigation was opened against him."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Visa opens its first African innovation Studio in Kenya",
    "summarized_story": "Global payments company Visa has opened a new Innovation Studio in Nairobi, Kenya.\nThis facility will serve the sub-Saharan Africa region and joins a network of innovation centers operated by Visa since 2016, in cities including London, Dubai and Singapore.\nAida Diarra, Senior vice president and head of Visa in Sub-Saharan Africa, said the studio will assist in increasing the Visa market in the region by issuing digital and physical Visa to its clients.\n“As a brand built on technology, Visa has driven the major technology advancements that make electronic payments what they are today.\nThe launch of Visa’s first African innovation studio and others serves as a boost to the African tech ecosystem as it’ll encourage the creation, development, and implementation of novel ideas."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "How to validate your NIN and avoid crowds",
    "summarized_story": "Share this article:Today’s edition of Techpoint Africa Podcast features the Nigerian government following through with two of its threats.\nWe discussed what Nigerians are currently facing as millions of lines have been barred for not linking to NIN.\nFrom our Senior Reporter, Olwanifemi Kolawole getting flogged to NIMC officials abandoning crowds to people looking to gain full control of their SIMs.\nThree banks have flouted that directive and have been slammed with an ₦800 million ($1.9 million) fine.\nYou can catch up on everything we discussed on Apple Podcasts, Google Podcasts, Spotify, or wherever you get your podcasts."
  },
  {
    "headline": "NIN-SIM linkage: Worrying scenes at NIMC office, as Nigerian telcos block defaulting subscribers",
    "summarized_story": "In December 2020, the Nigerian Communications Commission (NCC) ordered all mobile subscribers to link their NINs to their SIM cards.\nHowever, going by the unhappy crowd at NIMC’s office, the prospect of a NIN-SIM linkage could still be a long way off for some people.\nMembers of the Nigeria Security and Civil Defence Corps (NSCDC) were on the ground to disperse the crowd.\nUsing forceful methods for crowd control, the Civil Defence Corps flogged Nigerians in the crowd.\nAn NSCDC member using a whip on Techpoint journalistUnnecessary NIN-SIM linkage crowdsA lady at the scene confirmed that her SIM had been banned from making calls."
  },
  {
    "headline": "₦800m fine for touching crypto",
    "summarized_story": "Today we’re discussing:An ₦800m fine for transacting cryptoeNaira’s ranking among CBDCsBanks get an ₦800m fine for touching cryptoOn February 5, 2021, the Central Bank of Nigeria (CBN) made its stance on cryptocurrencies known when it released a circular, instructing commercial banks not to facilitate crypto-related transactions.\nInterestingly, crypto transactions have continued to thrive via peer-to-peer (p2p) platforms, surpassing volumes recorded before the directive.\nAdvertisementAccording to the news outlet, Access Bank was slammed with a ₦500 million ($1.2 million) fine, Stanbic IBTC was fined ₦200 million ($481,000), while United Bank for Africa (UBA) will pay ₦100 million ($240,000).\nWith this fine, CBN has shown keen interest in keeping crypto off Nigerian streets, but will it work?\nAccording to the PwC Index, the eNaira had done more than 35,000 transactions as of December 2021."
  },
  {
    "headline": "Nigeria fixing refineries while vandals break their pipelines",
    "summarized_story": "The Federal Executive Council had in March last year approved the plan by the Ministry of Petroleum Resources to rehabilitate the Port Harcourt Refinery at the cost of $1.5 billion.\nHowever, the minister’s optimism has not been adjusted for sabotage on crude oil pipelines that will serve in the refineries.\nSimilarly, Eni’s Brass oil pipeline in the northern Niger Delta was heavily impacted, with local security contractors scrambling to deal with an unprecedented number of incidents.\nBoth measures have done little to dent the problem as operators now report industrial-scale theft of crude oil sent into pipelines.\nNigeria’s refineries have a combined refining capacity of 445,000 bpd, located in Warri, Port Harcourt and Kaduna."
  },
  {
    "headline": "Buhari gets new revenue formula",
    "summarized_story": "The Revenue Mobilisation Allocation and Fiscal Commission (RMAFC) on Thursday submitted the new formula to President Muhammadu Buhari, at the Presidential Villa, Abuja.\nUnder the proposed vertical revenue allocation formula, the RMAFC advised 45.17 per cent for the Federal Government, 29.79 per cent for State Governments and 21.04 percent for Local Governments.\nPresident Buhari however, recounted that the Federal Government also made its input into the process of reviewing the vertical revenue allocation formula based on existing constitutional provisions for roles and responsibilities for the different tiers of government.\nThe existing revenue formula indicates a vertical Revenue Allocation Formula of Federal Government 52.68%; State Governments 26.72%; Local Governments 20.60% and Derivation Formula 13%.\nHis words:‘‘I am aware that the present revenue allocation formula has not been reviewed since the last exercise carried out in 1992."
  },
  {
    "headline": "Visa picks Kenya over Nigeria for first African innovation hub",
    "summarized_story": "Visa has opened its first innovation studio in sub-Saharan Africa in Nairobi, Kenya.\nThe studio is the second one by the payment giant in Central Europe, the Middle East, and Africa region.\nto create solutions that will tackle the many pinpoints that consumers face in the financial services sector in Africa.\n“Policies cannot be seen to be creating barriers to innovation,” said Otto Williams, senior vice president and head of partnerships, innovation, and digital solutions for Visa Central and Eastern Europe, Middle East, and Africa.\nPart of the enabling is removing barriers to the things that they need to be successful,” Williams said."
  },
  {
    "headline": "Edo begins process of forest allocation to timber concessionaires – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the process of forest allocation to prospective timber concessionaires in the state as part of efforts to reopen the state’s forest.\nChairman Forestry Commission, Edward Obiaw, in a statement, urged interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors to pick forest allocation application forms at the Edo State Ministry of Environment and Sustainability.\nThe statement reads: “It is hereby announced for the information of the general public that as part of the process to lift the ban on forest exploitation in the state, the Edo State Government is hereby requesting all interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors that application forms for forest allocation are available at the Ministry of Environment and Sustainability, Room 17, Ist Floor, Palm House, Sapele Road, Benin City with a treasury receipt of payment of a non-refundable application fee of N200,000 (Two Hundred Thousand Naira).\n“All completed application forms are to be addressed and submitted to the Chairman, Forestry Commission within two weeks of this announcement.”Recall that the government had announced the prohibition of all forms of timber exploitation from Tuesday 31st August, 2021, following the expiration of the three-year circle of 2018/2021 Forest Allocation in the state.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo community head, motorists calls for speedy completion of road rehabilitation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOza – Motorists and other road users plying the Evbuobanosa-Iru-Oza-Igbanke road in Orhionmwon local government area of Edo state have called on the contracting firm handling ongoing rehabilitation work on the road to speedily complete the project.\nAccording to the traditional head (Odionza) of Oza community, Chief Amadin Idehen, the rehabilitation has been going on smoothly before the construction firm stopped work recently.\n“They started well initially; suddenly they just abandoned the job”, the Odionza told The Nigerian Observer.\nBut, a source who understands the contractual agreements between the federal government and the firm handling the rehabilitation project attributed the stoppage of work to lack of funds.\n“When you award a contract, you first release 25 percent especially on road projects to start work."
  },
  {
    "headline": "Local Govt Autonomy: NULGE seeks traditional Rulers Support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe leadership of the Nigeria Union of Local Government Employees (NULGE) have appealed to traditional rulers to support the bill for the amendment in granting autonomy for local governments across the country.\nThe President, Edo Chapter of NULGE, Mr Lazarus Adorolo, yesterday made the appeal during an advocacy visit to traditional rulers in Akoko Local Government Area of Edo.\nAdorolo said the visit to traditional rulers was to prevail on the members of state house of assembly to vote in favour of the local government autonomy.\n“Your highness, we are here today to present the people’s charter of demand for local government autonomy for continued support of our traditional rulers for this struggle in our overall interest.\nAlso, the Olokpe of Okpe, Oba Idogun Oshizimete, promised to team up with other traditional rulers to prevail on the lawmakers to ensure the passage of the bill."
  },
  {
    "headline": "Eradicating Lassa fever from Edo State – Nigerian Observer",
    "summarized_story": "Comrade Phillip Shaibu flagged-off Lassa fever eradication campaign at Auchi.\nToday, we decided to flag off Lassa fever eradication campaign.\nOver twenty one persons have died of Lassa fever this year.\nLassa fever can also be passed between patients and staff at poorly equipped hospitals where sterilization and protective clothing is not standard.\nThere is a test centre at Irrua Specialist Hospital, Irrua, Edo State University, Uzarue and the Edo State Government is presently planning a healthy to establish a centre at Auchi Central Hospital."
  },
  {
    "headline": "BREAKING: Court dismisses suit seeking to sack Ayade, deputy for joining APC",
    "summarized_story": "An Abuja Federal High Court has dismissed a suit filed by the Peoples Democratic Party (PDP) seeking to sack Ben Ayade Cross River State governor and the deputy governor, Ivara Esu, over their defection to the ruling All Progressive Congress (APC)Justice Taiwo Taiwo, the presiding judge, in his ruling held that the duo could not be sacked from their positions, other than through statutory procedures that were stipulated in sections 180, 188 and 189 of the 1999 Constitution, as amended.\nAccording to the judge, defection to another political party was not stated as one of the grounds for the removal of either a governor or his deputy.\n“The 3rd and 4th Defendant cannot be removed except by Constitutional provision.\n“This court has no power to declare vacant the seat of the 3rd and 4th Defendants”, Justice Taiwo held.\nPDP had in its suit marked FHC/ABJ/CS/975/2021, prayed the court to sack both Ayade and his deputy, contending that the duo, having abandoned the political party that sponsored their re-election, ought"
  },
  {
    "headline": "Buhari says FG to borrow N7.4trn to finance budget deficit",
    "summarized_story": "President Muhammadu Buhari has written to the House of Representatives asking for an increase in the 2022 budget deficit to be financed through borrowing from the domestic market.\nBuhari said this in a letter read by Speaker Femi Gbajabiamila during plenary on Thursday.\nBuhari, in the letter, also requested for the review of the 2022 Medium-Term Expenditure Framework (MTEF) upon which the budget was hinged.\n“The total budget deficit is projected to increase from N965.42 billion to N7.35 trillion representing 3.99 percent of the GDP,” Buhari said.\nThe Speaker thereafter, referred the letter to the House Committee on Finance for further legislative action."
  },
  {
    "headline": "‘I’m sorry’ – Pastor Adeboye’s son, Leke, begs RCCG pastors after calling them ‘goats’",
    "summarized_story": "However, amid the outrage, the pastor’s son, on Thursday, tendered an apology, asking the pastors to forgive his extreme behavior.\nHe noted, however, that has accepted a disciplinary action taken against him in good faith, while pleading that his action be forgiven.\n“I also wish to apologise profusely to the entire leadership and Pastors of our beloved Church who might have been hurt by this statement.\nReacting to such a move, Pastor Leke took to his Instagram account and referred to the RCCG pastors who preached their messages after the G.O.\nNext Thanksgiving Service, just do an altar call, then thanksgiving,” Leke had said."
  },
  {
    "headline": "Buhari receives proposal for new revenue sharing formula from RMAFC",
    "summarized_story": "Muhammadu Buhari, Nigeria’s president, has received a proposal for new revenue sharing formula from the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC).\nThe proposal comes on the heels of the review of the current revenue sharing formula by RMAFC, which commenced in June, last year.\n“I am aware that the present revenue allocation formula has not been reviewed since the last exercise carried out in 1992,” he said.\nThe president said the FG also made its input into the process of reviewing the vertical revenue allocation formula.\nHe added that literature reviews were conducted on revenue allocation formula in Nigeria dating back to the pre-independence period."
  },
  {
    "headline": "Zamafara Gov Buys 260 Assorted Cars For Traditional Rulers",
    "summarized_story": "Governor Bello Matawalle of Zamfara State has distributed 260 assorted cars to all the traditional rulers in the state.\nThe distribution of the cars was done by the Sultan of Sokoto, Alhaji Sa’ad Abubakar III, at the Government House, Gusau, on Wednesday.\nThe Sultan expressed his gratitude to Governor Matawalle for his concern on the welfare of the traditional institutions.\n“I would like to assure you that my administration will continue to work in line with the mission of uplifting the dignity and sanctity of our traditional institutions through all possible means.\n“We are currently rehabilitating and reconstructing some of the palaces of our emirs across the State."
  },
  {
    "headline": "What You Need To Know About Pneumococcal Disease",
    "summarized_story": "Pneumococcal disease is a worldwide disease and it is caused by an organism called the streptococcal pneumonia.\nSerious pneumococcal infections include pneumonia, meningitis and febrile bacteraemia.\nWhile citing WHO report, Adeyeye said about five per cent of all total cases of pneumococcal disease worldwide is said to occur in Nigeria.\nAnother study also showed that the mortality from pneumococcal infection in Nigeria, can be as high as 39 to 51 per cent,“ she said.\n“Streptococcal pneumonia infection is a vaccine preventable disease for children and adult respectively."
  },
  {
    "headline": "FCT Minister Tasks Police On Satellite Towns Security",
    "summarized_story": "Minister of the Federal Capital Territory (FCT), Malam Muhammad Bello, has tasked the Nigeria Police on the need to tighten security in the nation’s capital, especially in the suburbs of the FCT.\n“We have been under a lot of pressure from the citizens, especially those in the surrounding towns in the Area Councils, especially with regards to the spate of kidnappings and some issues of banditry also, which I’m sure you are very much aware of.\nBello, who reiterated the need for synergy among security organisations, said such synergy has been very helpful in keeping the FCT and its residents safe, assuring that the FCTA would work toward providing the Zone 7 headquarters with all the necessary support it requires to function effectively.\nEarlier, the AIG, Zone 7 Police headquarters, Mr. Muhammad Ndatsu Aliyu, had solicited the support of the FCTA, especially in the area of mobility for the effective coverage of the zone and by extension the FCT.\nHe also assured of his preparedness to work in synergy with all security organs of government to secure the zone."
  },
  {
    "headline": "FCT Minister Tasks Police On Satellite Towns Security",
    "summarized_story": "Minister of the Federal Capital Territory (FCT), Malam Muhammad Bello, has tasked the Nigeria Police on the need to tighten security in the nation’s capital, especially in the suburbs of the FCT.\n“We have been under a lot of pressure from the citizens, especially those in the surrounding towns in the Area Councils, especially with regards to the spate of kidnappings and some issues of banditry also, which I’m sure you are very much aware of.\nBello, who reiterated the need for synergy among security organisations, said such synergy has been very helpful in keeping the FCT and its residents safe, assuring that the FCTA would work toward providing the Zone 7 headquarters with all the necessary support it requires to function effectively.\nEarlier, the AIG, Zone 7 Police headquarters, Mr. Muhammad Ndatsu Aliyu, had solicited the support of the FCTA, especially in the area of mobility for the effective coverage of the zone and by extension the FCT.\nHe also assured of his preparedness to work in synergy with all security organs of government to secure the zone."
  },
  {
    "headline": "Insecurity: Kwara Civil Servants Pray For Restoration Of Peace In Nigeria",
    "summarized_story": "Civil servants in Kwara State, on Thursday, offered special prayer for the restoration of peace to the troubled spots in Nigeria.\nAbdulRafiu Ayinla, who was the guest lecturer at the Governor’s Office Mosque Tafsir (Ramadan Lecture), in Ilorin, led the civil servants in offering prayers for the nation and its leaders.\nUstaz Ayinla said the citizens owe those in positions of authority a duty to pray for them for God’s guidance and protection.\nHe posited that if the civil servants perform their duties as stipulated by the laws guiding their employment, the society will be better for it.\nHe reminded them that they were also holding their various positions in trust for the populace, stressing that, “They are not expected to combine their civil service job with any other part-time job.”"
  },
  {
    "headline": "BREAKING: Governor Soludo’s Aguata LG Headquarters Under Heavy Attack",
    "summarized_story": "Arsonists are currently attacking the headquarters of the Aguata Local Government Area in Anambra State, who are thought to be “unknown gunmen” in the South-East.\nCharles Chukwuma Soludo, the freshly sworn-in Governor of the State, is from Aguata.\nThe perpetrators, who are believed to be the same people that assaulted the council’s market, Eke Ekwulobia, set fire to the council’s headquarters on Thursday afternoon.\n“Following the report of the fire incident at the Local Government headquarters, the command has deployed troops to the location and the situation has been brought under control,” DSP Ikenga Tochukwu said when reached.\nIkenga, the spokesman for the Anambra State Police Command, also stated that firefighters have been contacted and are currently battling the blaze."
  },
  {
    "headline": "Former Ekiti Governor, Oni, Others Attacked By Armed Hoodlums During Political Event",
    "summarized_story": "On Wednesday, the convoy of Chief Segun Oni, the Social Democratic Party (SDP) governorship candidate in the June 18 Ekiti governorship election, was ambushed at Efon Alaaye in the state’s Efon Council area.\nOn their way to the town for the former governor’s consultative meetings with SDP members in the council area, members and supporters of the party were attacked with rifles, cutlasses, and other hazardous weapons, according to reports.\nAccording to a source, vehicles were damaged, and numerous members of the SDP party were injured to varied degrees.\n“Shortly after the Efon Local Government members and supporters of the SDP had converged at the venue to wait for the arrival of the party’s governorship candidate, Asiwaju Oni, the thugs started to shoot guns and attacked the SDP supporters with sticks and cutlasses.\nHe said the police were able to ensure there was no breakdown of law and order, adding that an investigation into the incident had begun."
  },
  {
    "headline": "Nnamdi Kanu will be released soon – Amaechi speaks ahead of Friday court ruling",
    "summarized_story": "Mbazulike Amaechi, a First Republic Minister of Aviation, has assured that Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, would soon be released.\nAmaechi gave the assurance while addressing journalists in Onitsha, Anambra State, ahead of Kanu’s court hearing slated for Friday.\nThe former Minister, last year, had led a delegation of Igbo elders to a meeting with President Muhammad Buhari over Kanu’s release.\nHowever, Amaechi said despite Buhari’s assurances of releasing the IPOB leader, Kanu is still in custody.\nAlthough, these agitations have demonstrated that only the release of Kanu will stop the agitations and we are working towards his release.”"
  },
  {
    "headline": "Train Attack: Family Of Abducted Bank Of Agriculture MD, Ali-Hassan Sold Abuja House To Raise N100m Paid As Ransom To Terrorists",
    "summarized_story": "Train Attack: Family Of Abducted Bank Of Agriculture MD, Ali-Hassan Sold Abuja House To Raise N100m Paid As Ransom To TerroristsThe Managing Director of the Bank of Agriculture, Alwan Ali-Hassan was on Wednesday set free by terrorists who attacked a Kaduna-bound train after his family paid N100 million as ransom, SaharaReporters has gathered.\nAli-Hassan and others were abducted last Monday, March 28 by terrorists who bombed the Kaduna-bound train carrying over 362 passengers.\nA source close to the family said Ali-Hassan was released after paying a ransom of N100 million.\nThey collected N100 million, though they initially asked for N200 million.\n“The house was sold for more than N100 million but we are happy he is back with us."
  },
  {
    "headline": "Breaking: Popular betting company, Bet9ja, hacked",
    "summarized_story": "A Nigerian Betting Company, Bet9ja has been hacked.\nThe company confirmed the incident, noting that the entire Bet9ja system has been under attack by Russian Blackcat group who are famous for hacking big companies in the world.\nIn a statement issued by Bet9ja on Thursday, the hackers are reportedly asking for a Ransom but they never accepted their condition.\nThe company stated that their IT team were working tirelessly to restore normal services of the website and further assured customers that their funds are safe.\n“The entire Bet9ja system has been under attack by the Russian Blackcat group who are famous for several attacks to huge companies in the world."
  },
  {
    "headline": "Breaking: Ayade wins, as court dismisses defection application",
    "summarized_story": "Justice Taiwo Taiwo of the Federal High Court Thursday dismissed the application filed by the People Democratic Party (PDP) against Governor Ben Ayade who recently defected to the All Progressives Congress (APC).\nIn a two hour judgment, the court declared that legislators not the court can sack a sitting governorDetails loading…"
  },
  {
    "headline": "Jonathan breaks silence as accident kills 2 security aides",
    "summarized_story": "Former President Goodluck Jonathan has reacted to a ghastly auto crash that claimed the lives of two of his security aides.\nThe ECOWAS envoy was involved in an accident on Wednesday while on his way from the Nnamdi Azikiwe International Airport to his Abuja residence.\nThe former president, however, commiserated with the families of the deceased and prayed God to grant them eternal rest.\n“Two other officers sustained injuries in the accident which involved a car conveying the security men.\n“The office of the former President has offered condolences to the families of the bereaved and the Police High Command."
  },
  {
    "headline": "Social Media Marketing for Franchises is Meant for Women",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Radio Air Time Marketing: A New Strategy for the Economy",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Shop The Best Street Style From Paris Fashion Week Shows",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Style Spy: Fashion Model Goes Casual in Faux Furr and Plaid",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Now Is the Time to Think About Your Small-Business Success",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Court Dismisses Suit To Declare Ayade’s Seat Vacant Over Defection",
    "summarized_story": "The Federal High Court in Abuja on Thursday dismissed a suit seeking to declare vacant the seat of Cross River State Governor Ben Ayade.\nJustice Taiwo Taiwo cited the judgment of the Court of Appeal in Enugu that defection is not a ground for removal from office.\nAyade defected to the All Progressives Congress (APC) in May 2021 from the Peoples Democratic Party (PDP), citing the allure of working with President Muhammadu Buhari.\nWhile a High Court has ruled in favour of the PDP in the Umahi case, other judgments have favoured the incumbents.\nThe High Court ruling in favour of the PDP is currently under appeal."
  },
  {
    "headline": "Elections: Nigerian Youths Not Ready To Take Their Destinies In Their Hands – Soyinka",
    "summarized_story": "﻿Nobel laureate Wole Soyinka has faulted Nigerian youths for their inability to stake a claim in the country’s political arena.\n“The youths of this nation don’t seem to want to take their destiny in their own hands,” he said.\nThis, the literary icon believes, makes it difficult to distinguish between the political parties.\n“Look at the two major parties, there has been such cross over from one rivulet to another, each crossing having its own purpose that it is getting difficult to even distinguish between the two major parties,” Soyinka added.\n“So, very likely, all I would do is take French leave of the elections and just watch the results,” he maintained."
  },
  {
    "headline": "Buhari Writes Reps, Seeks Approval of N4trn As Petrol Subsidy For 2022",
    "summarized_story": "President Muhammadu Buhari is seeking an increase in the provision for petrol subsidy for 2022 from N442 billion to N4 trillion.\nThe Nigerian leader has therefore written to the House of Representatives for a review of the 2022 fiscal framework.\nThe Speaker of the House of Representatives, Femi Gbajamila, read the letter, titled “Submission of the Revised 2022 Fiscal Framework” during plenary on Thursday.\nBuhari in the letter dated April 5, cited the rising market price of crude oil heightened by the Russian-Ukraine war.\n“A reduction in the projected oil production volume by 283,000 barrels per day, from 1.883 million barrels per day to 1.600 million barrels per day,” Buhari’s letter read."
  },
  {
    "headline": "Pastors Protest Killings In Kaduna, Demand Massive Bombing Of Bandits",
    "summarized_story": "﻿A group of pastors under the umbrella of Interfaith Alliance have staged a peaceful protest against the incessant attacks and killings by bandits in Kaduna State.\nThe protesters are asking the Federal Government to step up actions against banditry with the aim of wiping them out.\nThe protest comes days after 10 soldiers were killed and some others injured by bandits proscribed as terrorists who attacked a military base in Birnin-Gwari Local Government Area of the State.\nREAD ALSO: 10 Soldiers Killed As Bandits Attack Military Base In KadunaThe religious leaders marched through the major roads of the Kaduna metropolis with placards of various inscriptions.\nThey appealed to the Federal government to implement the submissions made by Governor Nasir El-Rufai and launch a massive and precise bombing of the bandits inside the forest."
  },
  {
    "headline": "Insecurity: Nigerians Go Out Unsure Of Returning, Soyinka Laments",
    "summarized_story": "Wole Soyinka has lamented the rising level of insecurity in the country, saying many Nigerians go out unsure they would return home safely.\nHe believes the country needs help to tame insecurity.\nSoyinka equally lamented the youths’ inability to take up leadership positions in the political space.\n“The youths of this nation don’t seem to want to take their destiny into their own hands,” he said.\n“Well, they failed to do that and I have a fear that this same thing will happen this year,” the revered poet explained."
  },
  {
    "headline": "PDP promises good governance in Ogun",
    "summarized_story": "People’s Democratic Party in Ogun State has vowed to take over the control of the state from the ruling All Progressives Congress in the 2023 General Election.\nThe party made this known during the public declaration of the Kaduna State Governor’s aide Jimi Lawal held in Ake, Abeokuta.\nParty chieftains noted that the party has capacity to provide good governance towards revamping Ogun State socio economy, political and security architecture."
  },
  {
    "headline": "Governor Akeredolu not hospitalised, says media aide",
    "summarized_story": "The Ondo State Government has described a report published by an online medium that Governor Oluwarotimi Akeredolu, is hospitalized in Germany as wicked and misleading.\nAccording to a statement issued by the Chief Press Secretary to the Governor , Richard Olatunde, the story was fabricated .\nThe statement reads “The news item published on an online medium alleged that the Ondo State Governor , Arakunrin Oluwarotimi Akeredolu, is being hospitalized in Germany , is wicked and misleading.\n“For the records, Governor Akeredolu, alongside other colleagues, left Nigeria for Dubai to attend the largest Annual Investment Meeting in the United Emirates between March 28 and March 31st, 2022.\nHe also transferred power to the deputy Governor, Lucky Aiyedatiwa to perform the functions of his office while he is away."
  },
  {
    "headline": "Zoning crisis threatens PDP, South insists on Presidency",
    "summarized_story": "Nigeria’s main opposition party, the Peoples Democratic Party is faced with crisis over the refusal of the southern and northern elements to agree on zoning, The PUNCH has learnt.\nIt was also learnt that because of the sharp disagreement between the southern and northern leaders, the party was in a dilemma whether to zone the Presidency to the South or not.\n), concluded his eight-year tenure, the North would have spent 11 years in power if the late President Umaru Yar’Adua’s three-year tenure was added.\nThis, they argued, would be short of a total of 13 years spent by former presidents Olusegun Obasanjo and Goodluck Jonathan.\nBut it was learnt that southern leaders insisted that the North had been in power in the country more than the South since independence."
  },
  {
    "headline": "Wife of fmr Anambra gov Willie Obiano picks APGA nomination form for Senate",
    "summarized_story": "The wife of Anambra State’s immediate past governor, Mrs Ebelechukwu Obiano, has picked her expression of interest and nomination forms to compete for the Senate seat of Anambra North District in the 2023 general election.\nThis comes just hours after the former governor’s Chief of Staff, Mr. Primus Odili, stated his intention to compete for the same position.\nObiano announced her desire to her supporters and party faithful in early March at her home in Aguleri, Anambra East Local Government Area.\nChief Paul Iwuala, the state chairman of the APGA in Imo State, was among those who sponsored Mrs Ebelechukwu Obiano’s senatorial ambition and vowed assistance in various capacities.\n“We trust in her capacity to speak for us, protect our interest and that of our region and children, nkea bu nke anyi,” Iwuala said."
  },
  {
    "headline": "Terrorists Allegedly Paid N100M For Bank MD’s Release + Osinbajo’s Campaign – Trending With Ojy Okpe",
    "summarized_story": "Alwan Hassan the acting managing director and chief executive officer of the Bank of Agriculture regained his freedom on Wednesday after he was captured by Terrorists following the attack on the ill-fated Abuja-Kaduna train on March 28th.\nReactions have trailed the gesture of the governor of Zamfara State Bello Matawalle who on Wednesday distributed 260 cars to traditional rulers and also commissioned an ultra-modern headquarters of the state council of Ulama.\nFinally, Supporters Of Vice President Yemi Osinbajo released a video on Wednesday urging him to run for President.\nIn another development, the Governor of Rivers State Nyesom Wike in a video that is now making the rounds on social media told stakeholders of the People’s Democratic Party in Gombe State to vote for him and not to waste their votes on candidates that cannot win the 2023 general election."
  },
  {
    "headline": "Debo Ologunagba: APC Has Failed and Must Be kicked Out",
    "summarized_story": "There is so much happening in the Peoples Democratic Party – the PDP.\nFirst, is the angry reactions, which greeted the recommendations of the zoning committee of the Party, for throwing the party’s 2023 presidential ticket open to all parts of the country.\nMore so, the PDP National Reconciliation and Strategy Committee (NRSC) led by immediate past President of the Senate, Dr Abubakar Bukola Saraki, has submitted the committee’s reports to the party’s National Working Committee (NWC).\nWhile submitting the committee’s reports, Saraki urged the party’s National Working Committee (NWC) to adhere to the principles of equity, justice, fairness, good conscience and inclusiveness in the 2023 general elections.\nFor more clarification on the activities of the PDP, especially contending issues brought before the NWC, we have the national publicity secretary of the PDP, Debo Ologunagba."
  },
  {
    "headline": "Oil Major Shell to Write Off up to $5bn in Assets after Exiting Russia",
    "summarized_story": "Shell has announced that it will write off between $4 and $5 billion in the value of its assets after pulling out of Russia following the country’s unprecedented invasion of Ukraine.\nThursday’s announcement offers a first glimpse at the potential financial impact to Western oil majors of exiting Russia.\nwrite-downs of receivable, expected credit losses, and onerous contracts) relating to Russia activities are expected to be $4 to $5 billion,” Shell said in a statement Thursday.\nShell was forced to apologize on March 8 for buying a heavily discounted consignment of Russian oil two weeks after Russia’s invasion.\nThe company said it would no longer purchase Russian crude oil and would shut its service stations, aviation fuels and lubricants operations in Russia."
  },
  {
    "headline": "Turkey Suspends Trial of Saudi Suspects in Khashoggi Killing",
    "summarized_story": "Turkey also sided with Qatar in a diplomatic dispute that saw Doha boycotted by Bahrain, Egypt, Saudi Arabia and the United Arab Emirates.\nIt was not clear , however, if Saudi Arabia, which has already put some of the defendants on trial behind closed doors, would open a new trial.\nHuman rights advocates had urged Turkey not to transfer the case to Saudi Arabia, arguing that justice for Khashoggi would not be delivered by Saudi courts.\nTurkey, which had vowed to shed light on the brutal killing, began prosecuting the defendants in absentia in 2020 after Saudi Arabia rejected requests for their extradition.\nA Saudi court issued a final verdict in 2020 that sentenced five mid-level officials and operatives to 20-year jail terms."
  },
  {
    "headline": "Ukraine Seeks Arms from NATO as Fight Looms on Eastern Front",
    "summarized_story": "“My agenda is very simple… it’s weapons, weapons and weapons,” Kuleba said as he arrived at NATO headquarters for talks with the military organization’s foreign ministers about Ukraine’s fight to defend itself.\nStill, he NATO Secretary-General Jens Stoltenberg urged member nations to send Ukraine more weapons, and not just defensive arms.\nHe said Russian forces also were carrying out “brutal measures” in the southern Kherson region, which they hold.\nWestern officials warned that similar atrocities were likely to have taken place in other areas occupied by Russian troops.\nRussian forces bombed hospitals, including one where 50 people burned to death, he said."
  }
]