[
  {
    "headline": "Medical tourism: Reps propose seven-year imprisonment, N500m fine for officials",
    "summarized_story": "Sponsored by Sergius Ogun (PDP, Edo), the proposed legislation is titled, ‘A Bill for an Act to amend the National Health Act, 2014; and for related matters’.\nOgun said, “This bill, which seeks to amend the National Health Act, is borne out of a desire to discourage medical treatment abroad at the detriment of our indigenous health institutions.\nThe need to revamp the poor state of the health care sector in Nigeria, among other things, is the reason for introducing this bill.\nThere is paucity of infrastructure, dearth of medical personnel, poor standards and many other challenges that need to be addressed.\nThis will, in turn, lead to the development of the health sector and improved remuneration for medical doctors, thus attracting Nigerian doctors abroad to come back home,” he stated."
  },
  {
    "headline": "Medical tourism: Reps propose seven-year imprisonment, N500m fine for officials",
    "summarized_story": "Sponsored by Sergius Ogun (PDP, Edo), the proposed legislation is titled, ‘A Bill for an Act to amend the National Health Act, 2014; and for related matters’.\nOgun said, “This bill, which seeks to amend the National Health Act, is borne out of a desire to discourage medical treatment abroad at the detriment of our indigenous health institutions.\nThe need to revamp the poor state of the health care sector in Nigeria, among other things, is the reason for introducing this bill.\nThere is paucity of infrastructure, dearth of medical personnel, poor standards and many other challenges that need to be addressed.\nThis will, in turn, lead to the development of the health sector and improved remuneration for medical doctors, thus attracting Nigerian doctors abroad to come back home,” he stated."
  },
  {
    "headline": "Africa on track to control COVID-19 pandemic in 2022, says WHO",
    "summarized_story": "Lara AdejoroThe World Health Organisation says that if current trends continue, the continent can control the COVID-19 pandemic in 2022.\nWHO Regional Director for Africa, Dr. Matshidiso Moeti said over the past two years, the African continent has gotten smarter, faster, and better at responding to each new surge in cases of COVID-19.\n“Although COVID-19 will be with us for the long-term, there is light at the end of the tunnel.\n“Since the start of the pandemic, the continent’s capacity to manage COVID-19 cases has gradually improved, with the increased availability of trained health workers, oxygen and other medical supplies.\n“WHO has also helped increase the number of oxygen production plants in Africa from 68 to 115 – a 60 percent rise – through supporting the repair, maintenance, and procurement of new oxygen plants."
  },
  {
    "headline": "Africa on track to control COVID-19 pandemic in 2022, says WHO",
    "summarized_story": "Lara AdejoroThe World Health Organisation says that if current trends continue, the continent can control the COVID-19 pandemic in 2022.\nWHO Regional Director for Africa, Dr. Matshidiso Moeti said over the past two years, the African continent has gotten smarter, faster, and better at responding to each new surge in cases of COVID-19.\n“Although COVID-19 will be with us for the long-term, there is light at the end of the tunnel.\n“Since the start of the pandemic, the continent’s capacity to manage COVID-19 cases has gradually improved, with the increased availability of trained health workers, oxygen and other medical supplies.\n“WHO has also helped increase the number of oxygen production plants in Africa from 68 to 115 – a 60 percent rise – through supporting the repair, maintenance, and procurement of new oxygen plants."
  },
  {
    "headline": "Kanu’s change of clothes: DSS violating court order – IPOB Legal team",
    "summarized_story": "By Chinonso AlozieThe legal team of the Indigenous People of Biafra, IPOB, on Friday raised an alarm that the operatives of the Department of State Service, DSS, has allegedly refused the IPOB leader in the DSS detention facility to change his clothes despite subsisting court order mandating that Kanu should be allowed to change his clothes.\nThe IPOB lead counsel, Ifeanyi Ejiofor, stated this to newsmen in Owerri, after they had visited Kanu, at the DSS, Last Thursday.\nEjiofor who described it as an obvious violation of court order also hinted that they had protested against such treatment.\nIn his argument, the legal expert, said: “Extensive interaction was held with him on mainly legal issues, as well as other engaging related matters.\nThough, for reasons we were not told, the officials of the DSS rejected for the umpteenth time, the change of clothes brought to him."
  },
  {
    "headline": "JUST IN: Gunmen assassinate Kaduna govt official",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Director of Operations of the Kaduna Geographic Information Service (KADGIS), Malam Dauda has been assassinated.\nThe senior Kaduna government official was killed on Friday morning.\nThe Police Public Relations Officer (PPRO) in the state, ASP Mohammed Jalige is yet to respond to inquiry on the development.\nWe feel they just did that to make it look like an attack.”“We have been facing various security breaches in the community”.\n“He was our neighbour in Barakallahu community in Igabi Local Government Area of the state."
  },
  {
    "headline": "N2trn debt: Contractors give NDDC 5-day ultimatum",
    "summarized_story": "By Henry Umoru – AbujaA group of indigenous contractors have given the Niger Delta Development Commission, NDDC, five days ultimatum to pay the N2 trillion debt owed them.\nThe contractors also vowed to organise protest simultaneously across the nine states of the Niger Delta and the Federal Capital Territory, FCT, if their demands are not met.\nThe contractors and other stakeholders also urged President Muhammadu Buhari to prevail on NDDC management to pay for services rendered creditably.\nALSO READ: S’Court voids Buhari’s Executive Order 10, declares it illegalThe statement read, “Due to intervention by some critical stakeholders from various sectors, the protesting Contractors and Consultants of the NDDC have decided to suspend the protest at the NDDC gate temporarily.\n“The Niger Delta Indigenous Contractors will continue to request the NDDC to pay for services rendered creditably as competent and performing Contractors of the NDDC, while frowning at situation where Contractors will not be mobilized by the NDDC to execute projects, a situation where the Contractors will borrow money from banks at high interest rates to execute projects yet will be owed for five years and more without payment."
  },
  {
    "headline": "Diri vows to link more communities in Bayelsa",
    "summarized_story": "By Samuel Oyadongha & Emem Idio – YenogoaGovernor Douye Diri of Bayelsa State has promised that his administration will construct more roads to link communities in the state.\nDiri said: “Today is a historic day for Igbedi community, KOLGA and the state.\nWhile other communities have been accessible by road, Igbedi was looking for this day and God has brought it to pass.\nWe pray for more money and we will construct more roads to link our communities.\nALSO READ: S’Court voids Buhari’s Executive Order 10, declares it illegal“Let me also appreciate the Igbedi community."
  },
  {
    "headline": "NMRDS threatens to sue NIPOST over N200m debt",
    "summarized_story": "By Emmanuel ElebekeThe National Mail Route Delivery Service (NMRDS) has threatened to drag the Nigerian Postal Service (NIPOST) to court over an alleged N200 million debt it owed its members in the last eight months.\nIn a petition to the Minister of Communication and Digital Economy, Prof Isa Pantami, signed by counsel to the operators, Wole Abidakun, the group urged the minister to compel NIPOST, to compel NIPOST to clear the debt within the next seven days or face a legal battle.\nREAD ALSO:Reps summons NPA boss over $195m Deep Blue contractAbidakun, in the petition, claimed that tax deductions effected on operators’ accounts for the past five years by NIPOST have not been remitted to the Federal Inland Revenue Service (FIRS), which he noted, had hindered the operators from accessing their tax clearance over the years.\nThe petition stated that for this reason, the operators cannot bid for other jobs in other organisations leading to extreme hardship on the means of survival of NMRDS members.\nThe petition, which was also copied to the postmaster general of NIPOST, Dr Ismail Adebayo Adewusi, added that “Ordinarily, our clients would have proceeded to explore other legal options available to them, but to show goodwill, our clients demand a meeting with you within seven days of your receipt of this letter to sort out issues amicably and maintain the cordial relationship that exists between your organisation and our clients."
  },
  {
    "headline": "Why we’re acquiring uncompleted, undeveloped properties – Rivers govt",
    "summarized_story": "The Rivers State Government has explained why it is acquiring undeveloped and uncompleted properties at the Government Residential Area (GRA).\nThe commissioner also said the State Executive Council has approved the latest move by the state government.\nAccording to him “leaving those plots overgrown with grasses have defaced the urban renewal programme which the state government is implementing.\n“And so, council had approved that all those undeveloped plots and uncompleted buildings in Old GRA and New GRA be acquired.\n“And again, Council also approved that those reallocated these plots cannot resell these properties to anybody and if they do, Rivers State Government will revoke such allocation,” he said."
  },
  {
    "headline": "Petitions, bureaucracy stalling Bakassi deep sea port, superhighway – Ayade",
    "summarized_story": "Governor Benedict Ayade of Cross River State has disclosed that hundreds of petitions and unnecessary federal bureaucracy stalled the commencement of his signature projects, the superhighway and Bakassi deep seaport.\nSpeaking in Calabar, the governor said the Federal Government had given its nod for the cost-intensive projects to take off.\n“There were also too many petitions by Cross River people and others as well as legal cases as a result.\nHe said he conceived the two projects as a way of enabling the northern states to be linked to the Atlantic Ocean with the Superhighway as the evacuation corridor for their goods in the Bakassi deep sea port.\nAnd Bakassi port would have come in handy to solve the problem where container traffic would have been redirected but politics and bureaucracy stalled it,” he said."
  },
  {
    "headline": "Borno Gov, Zulum star in Buhari’s administration – Presidency",
    "summarized_story": "The presidency has described Borno State Governor, Prof. Babagana Umara Zulum, as the star of President Muhammadu Buhari’s administration.\nThe presidential spokesman also hailed the Borno governor on infrastructures put up by his administration despite the security challenges in the state.\nHe said, “Governor Zulum is sure doing great things in Borno State, in terms of human and infrastructural development.\nA 25 years development plan and 10 years strategic transformation initiatives have been formulated.\n“Gov Zulum is a star of this administration, and of this generation."
  },
  {
    "headline": "Cold war era: Buhari calls for lasting peace in North, South Korea",
    "summarized_story": "President Muhammadu Buhari on Friday disclosed that Nigeria would support efforts to bring peaceful resolution and reconciliation on the Korean peninsula.\nAccording to Buhari, the Korean situation as defined by its history in the Asia-Pacific region that remained divided since the cold war era.\nHe said, ”The Nigerian Government encourages and supports every effort to promote understanding and a commitment to peace among the governments and people of both Koreas.\n”We have enjoyed cordial relations with both Koreas in trade and commerce, education, cultural exchange, and technology transfer.\n”And so, when it comes to what needs to be done to ensure lasting peace on the peninsula, we’re happy to be part of it.”"
  },
  {
    "headline": "KASTLEA orders marshals to stop mounting road block in Kaduna",
    "summarized_story": "The Kaduna State Traffic Law Enforcement Agency (KASTLEA) on Friday ordered its marshals to stop mounting roadblocks across the state.\nDAILY POST recalls that before now, some marshals of the agency mounted road blocks in order to checkmate commercial vehicles and motorists who disobey traffic rules and regulations.\nA bus driver was reportedly killed by the road marshal during an argument between them.\nIt was alleged that the driver was beaten with a stick during the argument and later died in the hospital.\nASP Mohammed Jalige, Kaduna Police Public Relations Officer, was quoted as saying that the Commissioner of Police (CP), Mudasiru Abdullahi, had ordered the arrest of the marshals during the altercation."
  },
  {
    "headline": "Scarcity: Fuel supply improving in Lagos",
    "summarized_story": "Availability of Premium Motor Spirit (PMS), also known as petrol, is improving in Lagos State, after days of scarcity of the product, the News Agency of Nigeria (NAN), reports.\nMr Mike Osatuyi, National Operations Controller, Independent Petroleum Marketers Association of Nigeria (IPMAN), confirmed that some of the stations had received supply of on-spec products.\nSo we should be experiencing more improved fuel supply this weekend,” Osatuyi said.\nOsatuyi said the importation of sub-standard petrol was an embarrassment to the government and to Nigerians, and such should never be allowed to reoccur.\nAhmed also disclosed that loading was going on at depots in Apapa and Ijegun-Egba, Lagos, which would help close the supply gap created by the withdrawal of the sub-standard petrol from the market."
  },
  {
    "headline": "Ondo Prophetess docked for alleged murder",
    "summarized_story": "The General Overseer of the All Saints Development Church of Christ, Igbara-Oke, Ifedore local government, Prophetess Serah Abuloye, has been docked for alleged murder of a member of her church.\nAbuloye was alleged to have killed and dumped 37- year- old Adefunke Aselogbon in a bush behind her church on January 6, 2022.\nThe 49- year-old Prophetess was remanded by an Akure Magistrates’ Court over alleged murder of a church member.\nPolice Prosecutor, Obalasa Ajiboye, informed the court that the defendant committed the offence at about 4.00am along Isarun Road, Igbara-oke in the Ondo State Magisterial District.\n1, Laws of Ondo State of Nigeria, 2006."
  },
  {
    "headline": "‘NADECO Bishop’ Adebiyi dies at 78",
    "summarized_story": "The Rt Rev Peter Adebiyi, popularly known as ‘NADECO Bishop’ for his opposition to military rule in the 80s and 90s, is dead.\nA statement by Adeboye Adebiyi informed that the cleric retired from the Lagos West Diocese of the Anglican Communion in 2013 at 70.\nIn 1999, Bishop Peter Awelewa Adebiyi was translated to the See of the Diocese of Lagos West.\nThe former lecturer joined progressive forces to battle the military in the post-June 12 annulment years, earning him the ‘NADECO Bishop’ tag.\nHis wife Caroline Adebiyi died a few years ago."
  },
  {
    "headline": "BREAKING: Supreme Court declares Executive Order 10 unconstitutional",
    "summarized_story": "The Supreme Court has declared as unlawful and unconstitutional the Executive Order 10 (EO10) issued by President Muhammadu Buhari on the funding of State Judiciary and Legislature.\nIn a split decision on Friday, majority of the court’s seven-member panel agreed that the President exceeded his constitutional powers in issuing the EO10.\nSix out of the seven members of the panel proceeded to void and set aside the EO10.\n- Advertisement -All the seven members agreed that the States were not entitled to be refunded all they have spent before now to maintain those courts.\nThe judgment was on the suit filed by the 36 States against the FG on the funding of the Judiciary and the constitutionality of the EO10."
  },
  {
    "headline": "Three die, one injured on Lagos-Ibadan expressway predawn accident",
    "summarized_story": "Three persons have died and another injured in predawn multiple accidents on Lagos-Ibadan expressway.\nConfirming the multiple crash, the Federal Road Safety Corps(FRSC), Ogun State Sector Command, said the remains of the dead were taken to Idera Hospital morgue, Sagamu.\n“A total of 09 persons were involved in the crash and all male adult, 01 person was injured, 03 persons were recorded dead from the crash and others unhurt.\n“The suspected cause of the multiple crash was speed which led to loss of control on the part of one of the vehicles.\n“The injured victim refused to be taken to hospital for medical attention."
  },
  {
    "headline": "Breaking: Judicial Autonomy: Supreme Court declares Buhari’s Executive Order 10 unconstitutional",
    "summarized_story": "From Godwin Tsa, AbujaThe Supreme Court in a split decision of six out seven Jsutices declared as unlawful and unconstitutional the Executive Order 10 (EO10) issued by President Muhammadu Buhari on the funding of State Judiciary and Legislature.\nThe majority judgment declared that the President exceeded his constitutional powers in issuing the EO10.\nAccording to the seven members of the panel, it was not the responsibility of the Federal Government to fund the capital and recurrent expenditures of the superior courts created for States under Section six of the Constitution.\nMeanwhile, all the seven members agreed that the States were not entitled to be refunded all they have spent before now to maintain those courts.\nThe judgment was on the suit filed by the 36 States against the FG on the funding of the Judiciary and the constitutionality of the EO10"
  },
  {
    "headline": "Electoral bill: Buhari in dilemma, consults Malami, others",
    "summarized_story": "Meanwhile, the Transition Monitoring Group, (TMG), National Consultative Front (NCFront) and Middle Belt Forum (MBF), yesterday, expressed worry over President Buhari’s delay to assent to the Electoral Act Amendment Bill.\nHe said: “President Buhari is just telling us that he doesn’t care about the country and doesn’t care about anybody.\nAlso, the House of Representatives has said that there was no selfish interest in the Electoral Act Amendment Bill passed by the National Assembly, recently.\nHe said the National Assembly will not lobby the Presidency to assent to the electoral act amendment bill, as that would amount to interfering with the function of the executive.\nThat they want the electoral act amendment bill, as submitted, having incorporated the direct, indirect and consensus."
  },
  {
    "headline": "Importers of bad fuel must face the law – Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, ordered that those responsible for the importation and distribution of the off-spec petrol into the country must be held accountable.\nThe president stated this in a statement by his Senior Special Assistant on Media and Publicity, Garba Shehu.\nHe said those involved must “be held accountable for substandard services and or products sold by them.”100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\n“The president directed that in line with the law, service providers must make full disclosure of relevant information with respect to the consumption of their products and that dissatisfied consumers are entitled to a proper redress of their complaints.”"
  },
  {
    "headline": "2023: Northerners want presidency zoned to South, says Middle Belt Forum",
    "summarized_story": "By Chinelo ObogoMiddle Belt Forum (MBF) has claimed that despite opposition from prominent groups like the Arewa Consultative Forum (ACF) and Northern Elders’ Forum (NEF), many northerners are in support of zoning the presidency to the South in 2023.\nSpeaking on Arise TV, MBF National President, Bitrus Pogu, said despite eight years of northern presidency, insecurity persists and bandits are still unleashing mayhem on many states.\nThose of us in the Middle Belt see the northern presidency now as one which is full of sentiments and nepotism and with people who call the insurgents, ‘our boys’, rather than regard them as a menace.\n“Those of us who are advocating the presidency to move to the South feel we have had eight years of northern presidency and it has not augured well for Nigeria.\nWe need a southern president who will deal with the bandit problem as a Nigerian problem and not as ‘our boys’ problem,” he said."
  },
  {
    "headline": "Train crushes cargo truck at Apapa Port",
    "summarized_story": "By Steve AgbotaEconomic activities inside the Lagos Port complex, Apapa were, yesterday, stalled as a container laden train crushed a cargo laden truck exiting the seaport.\nAn eyewitness told Daily Sun that the accident was as a result of poor control of traffic at the level crossing inside the Lagos Port complex.\n“The train gave signal that it was approaching the level crossing and while the truck was waiting for the train to exit, someone signalled to the truck driver to start coming since the train had not started moving.\n“The driver came down, opened the closed barricade and started moving, by that time, the moving train was already too close.\nThe truck head had already escaped, but the body of the truck with the two containers on it was rammed to the wall of ENL along the 1.6 kilometre port access road."
  },
  {
    "headline": "Buhari Talks Tough, Says Suppliers of Substandard Fuel would be Held Accountable",
    "summarized_story": "The withdrawal of the fuel is behind the recent petrol scarcity that has caused long fuel queues in some towns and cities across Nigeria.\nIn a statement by his spokesman, Mallam Garba Shehu, Buhari said the protection of consumer interests was the priority of his administration.\nThe consortium stated that NNPC was aware of the refusal of Brittania-U to cooperate with other members by way of making information available when needed.\nFurther, the consortium stated that Brittania-U vehemently refused to execute the Consortium Agreement with the other consortium members – Emadeb/Hyde/Ay Maikifi- saying it became surprising and frustrating to everyone.\n“Based on the substantial evidence provided to NNPC and several declarations by Brittania-U to NNPC, Brittania-U is therefore solely liable for the supply of the PMS via MT Torm Hilde."
  },
  {
    "headline": "IMF: Nigeria’s Debt Sustainability at Risk, Cause for Concern",
    "summarized_story": "Nume EkegheThe International Monetary Fund (IMF) has said Nigeria’s debt sustainability is at risk and causes a great deal of concern and unease in the long-term.\nRahman noted that the increase in public debt had grown rapidly in 10 years and was approaching a time when the country would spend all its income on servicing debts.\nRahman explained, “But what we should remember here and the things that make Nigeria’s debt sustainability at risk are the following: we have seen a rapid rise in public debt in the last 10 years or so and this is being driven by fiscal deficits.\nAnd there are a couple of other points that we should remember; which is that Nigeria’s debt carrying capacity is very low.\nSo that makes Nigeria quite vulnerable.”Rahman said going forward, IMF projected for Nigeria a continuous increase in public debt."
  },
  {
    "headline": "CBN Eyes $200bn from Fresh Non-oil Export Initiative",
    "summarized_story": "He added that the initiative was a product of consultation with the banking community.\nHe, however, explained that the new non-oil export initiative would have five key anchors namely value-adding exports facility; Non-oil commodities’ expansion facility; Non-oil FX rebate scheme; Dedicated non-oil export terminal as well as Biannual non-oil export summit.\n“Fund people who want to generate export proceeds, when those export proceeds come, we would fund them at five per cent for you and they would earn rebate and that’s how we can help you.\n“Then, when these proceeds come, sell them to your customers that want $100 million or $200 million.\nThat you will continue to come to central bank to give you dollar, we would stop it."
  },
  {
    "headline": "2022 Committee Mobilising Nigerians for Quality Leadership",
    "summarized_story": "•Building consensus for country’s rebirthEmmanuel AddehThe 2022 Committee has resolved to mobilise Nigerians across party lines and social strata for quality leadership of the country at all levels as the elections to choose new leaders in 2023 draw near.\nThe meeting, which held from February 4 to 6 under the aegis of “The 2022 Committee”, the conveners pointed out, remained non- partisan.\nThey said the retreat to chart a new consensus for national rebirth was attended by 14 incumbent governors, 13 former governors, and three former senate presidents.\n“The 2022 Committee” conveners stated, “Whilst the 2022 committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction.\nBut the coordinators of the meeting stated that although all the 100 leading lights of the 2022 committee had the capacity for national leadership, it should not be linked to the politics of 2023."
  },
  {
    "headline": "Adulterated Fuel: Kyari Names MRS, Emadeb-consortium, Oando, Duke Oil as Culprits",
    "summarized_story": "But the NNPC GMD’s explanation ran contrary to an earlier press statement released by MRS, where the company denied culpability.\nThe petroleum products delivered are usually equivalent in value to the crude oil received from NNPC subject to the general terms and conditions as advised.\nAccording to him, as soon as the vessels complete discharging and start pushing products to oil marketers, the fuel queues in Lagos should fully disappear by Friday.\nOther attendees at the meeting included top officials of NNPC, Major Oil Marketers Association of Nigeria (MOMAN), and members of the Depots and Petroleum Products Marketers Association of Nigeria (DAPPMAN).\nNARTO had threatened to stop haulage of petroleum products across the country over the hike in the price of diesel to N430 per litre and other operational challenges."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "Bandits Ask Katsina Community To Contribute N30 Million As Compensation Over Death Of Leader Killed By Military Jet",
    "summarized_story": "Residents of Tashar Biri Village in Yatumaki of Dan Musa Local Government Area have been asked by bandits to pay N30 million or risk ferocious attacks.\nAirstrikes executed recently by the Nigerian Air Force (NAF) aircraft in Katsina State killed Dankarami.\nIt was gathered that he met his waterloo when he visited one Sabira, a teenage girl he had forcibly married in Tashar Biri village.\nFollowing his death, his boys demanded that the community must provide Sabira and her mother and pay N30 million, or risk being attacked.\nMost residents have fled the village after they got a hint that the leader of the bandits, one Mai Lore, would raid the community and kill everyone."
  },
  {
    "headline": "Bandits Ask Katsina Community To Contribute N30 Million As Compensation Over Death Of Leader Killed By Military Jet",
    "summarized_story": "Residents of Tashar Biri Village in Yatumaki of Dan Musa Local Government Area have been asked by bandits to pay N30 million or risk ferocious attacks.\nAirstrikes executed recently by the Nigerian Air Force (NAF) aircraft in Katsina State killed Dankarami.\nIt was gathered that he met his waterloo when he visited one Sabira, a teenage girl he had forcibly married in Tashar Biri village.\nFollowing his death, his boys demanded that the community must provide Sabira and her mother and pay N30 million, or risk being attacked.\nMost residents have fled the village after they got a hint that the leader of the bandits, one Mai Lore, would raid the community and kill everyone."
  },
  {
    "headline": "Supreme Court Dismisses Suit Demanding Nigerian Government’s Funding Of State Courts",
    "summarized_story": "The Supreme Court, on Friday, ruled that it is not the responsibility of the Nigerian government to provide funding for state judiciaries.\nThis is even as the court dismissed a suit filed by the Attorney-Generals of the 36 states of the federation which argued that the federal government’s responsibility is to fund capital and recurrent expenditures of state high courts, Sharia court of appeal and customary court of appeal.\nFile PhotoBut the Supreme Court in its split-decision of four justices against three held that the responsibility of funding state courts lies squarely with the state governments.\nIn the lead judgement prepared by Musa Dattijo, but read by Centus Nweze, the Supreme Court held that Presidential Executive Order 10 issued in 2020 to shore up the financial independence of state judiciaries and legislatures is “unconstitutional”."
  },
  {
    "headline": "'FG not responsible for funding state judiciary' -- supreme court nullifies executive order",
    "summarized_story": "The supreme court has ruled that it is not the responsibility of the federal government to fund the capital and recurrent expenditure of state judiciary.\nAll 36 states through their attorneys-general had in a suit filed before the apex court on September 17, 2020, argued that it is the federal government’s responsibility to fund capital and recurrent expenditure of state high courts, sharia court of appeal and customary court of appeal.\nAccording to them, section 81(3) of the 1999 constitution, makes provision for the funding of the courts.\nAdvertisementThe states had also requested a refund of N66 billion spent on funding their judiciary.\nConsequently, regarding the issue of funding and reimbursement of expenses and budgetary provisions, the state governments will continue to fund the state courts."
  },
  {
    "headline": "'FG not responsible for funding state judiciary' -- supreme court nullifies executive order",
    "summarized_story": "The supreme court has ruled that it is not the responsibility of the federal government to fund the capital and recurrent expenditure of state judiciary.\nAll 36 states through their attorneys-general had in a suit filed before the apex court on September 17, 2020, argued that it is the federal government’s responsibility to fund capital and recurrent expenditure of state high courts, sharia court of appeal and customary court of appeal.\nAccording to them, section 81(3) of the 1999 constitution, makes provision for the funding of the courts.\nAdvertisementThe states had also requested a refund of N66 billion spent on funding their judiciary.\nConsequently, regarding the issue of funding and reimbursement of expenses and budgetary provisions, the state governments will continue to fund the state courts."
  },
  {
    "headline": "This is Cynthia Okafor — UI’s best-graduating student in Pharmacy",
    "summarized_story": "A lady identified as Cynthia Okafor has emerged as the best graduating student of the Faculty of Pharmacy at the University of Ibadan (UI).\nAdvertisementThe Pharmacy graduate scored a cumulative grade point average (CGPA) of 6.9 out of 7.0.\nShe shared pictures of herself in her convocation gown and her name on the honoree list.\nThe lady also shared the awards she received from the school after graduating.\nAdvertisement“Faculty of Pharmacy, the University of Ibadan with a CGPA of 6.9 out of 7.0 & distinctions in 5 out of the 6 departments in the Faculty,” she wrote on Wednesday."
  },
  {
    "headline": "This is Cynthia Okafor — UI’s best-graduating student in Pharmacy",
    "summarized_story": "A lady identified as Cynthia Okafor has emerged as the best graduating student of the Faculty of Pharmacy at the University of Ibadan (UI).\nAdvertisementThe Pharmacy graduate scored a cumulative grade point average (CGPA) of 6.9 out of 7.0.\nShe shared pictures of herself in her convocation gown and her name on the honoree list.\nThe lady also shared the awards she received from the school after graduating.\nAdvertisement“Faculty of Pharmacy, the University of Ibadan with a CGPA of 6.9 out of 7.0 & distinctions in 5 out of the 6 departments in the Faculty,” she wrote on Wednesday."
  },
  {
    "headline": "Supreme court nullifies executive order empowering FG to deduct from state funds",
    "summarized_story": "The supreme court has nullified President Muhammadu Buhari’s executive order 10.\nBuhari, on May 22, signed the order granting financial autonomy to the legislature and the judiciary in the 36 states of the federation.\nThe order empowers the accountant-general of the federation to deduct funds for the state legislature and the judiciary from the federation allocations to the states.\nHowever, all the 36 states through their attorneys-general filed a suit on September 17, 2020, contending the constitutionality of the executive order.\nAdvertisementThe plaintiffs said with the executive order, the federal government’s responsibility of funding capital and recurrent expenditures of state high courts, sharia court of appeal and customary court of appeal has been pushed to the state governments."
  },
  {
    "headline": "Nigerian bourse wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "Inside Bolt’s plans for Africa after raising mega funding",
    "summarized_story": "To understand Bolt’s overarching plans for Africa, its second-largest market after Europe, TechCabal spoke with its Africa Regional Director, Paddy Partridge.\n“At the moment, across Africa, women make up a very small share of our driver base.\nBut that hasn’t happened because, according to Patridge, South Africa and Kenya have the highest share of female drivers—which is an essential metric in rolling out the feature.\n“It was most feasible to get the category off the ground in South Africa.\nWe wanted to test what kind of traction the category could get, and South Africa is the most suitable pilot test."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Is it possible to reduce or eradicate fraud in Africa?",
    "summarized_story": "To fight this, the company which claims to specialise in fighting fraud in Africa has recently raised a €20 million (~$23m) Series A to help them improve their game in fighting fraud.\nYes, you read that correctly; over $12 million will be invested in combating mobile fraud in Africa.\nWhile I’m interested in how the company intends to accomplish this, there’s also an indigenous company in Nigeria, Stellas digital bank planning to combat fraud.\nSide bar: Is it possible that the rise of startups focused on combating fraud will help achieve its purpose in Africa?\nTo know how, please, read: Stellas digital bank launches, plans to fix major loophole for fintech fraud in Nigeria."
  },
  {
    "headline": "Stellas digital bank launches with ‘Ghost Mode’ to fix major fintech fraud loophole in Nigeria",
    "summarized_story": "However, fraud remains the bane of both digital banks, and traditional banks alike.\nFor the newly launched Stellas digital bank, it plans to guard against one major loophole.\nToday, the company is launching a digital bank to “offer banking services with ease”.\nBasically, Stellas plans to protect user identities when making transactions, to guard against identity theft and ensure privacy and security.\nIn a space graced by the likes of Kuda, Sparkle, Fairmoney, and Carbon, Nigeria’s digital banking space look set to be exciting."
  },
  {
    "headline": "Rising to the challenge with the all-new Redmi Note 11 series",
    "summarized_story": "Xiaomi launched the Redmi Note 11 series for Nigerian markets on Wednesday, February 9th, 2022, carrying on the legacy of the Redmi Note series with three all-new devices – Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11.\nMoreover, the Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11’s 2MP depth camera allows you to create a natural bokeh effect for your portrait shots.\nAdvertisementThe Redmi Note 11 Pro and Redmi Note 11S rise to the challenge with an advanced octa-core MediaTek Helio G96 processor and up to 8GB of RAM.\nMarket availabilityThe Redmi Note 11 Pro and Redmi Note 11S are available in three configurations: 6GB+64GB, 6GB+128GB, and 8GB+128GB.\nMoreover, the Redmi Note 11 Pro will be available in early March, 2022, while the Redmi Note 11S and Redmi Note 11 are now available."
  },
  {
    "headline": "NNPC, marketers trade blames over dirty petrol",
    "summarized_story": "Kyari said NNPC investigation revealed the presence of methanol in four petrol cargoes imported through the Direct-Sale-Direct-Purchase (DSDP) suppliers including the consortium MRS, Emadeb Consortium, Oando Consortium, and Duke Oil.\nWhat is even more confusing is that Brittania-U claimed it purchased the contaminated petrol from Duke Oil, which is NNPC’s oil trading subsidiary.\nWe immediately informed NNPC, NMDPRA, and MOMAN and it was confirmed that other members had similar experiences,” the MRS said.\nSuspicion of misdeeds immediately swirled around them following BusinessDay’s revelation that the scarcity of the products was borne out of contamination or dirty petrol.\nThey say the current system whereby the NNPC contracts out petrol importation to selected friends in an opaque system that must end."
  },
  {
    "headline": "What Abuja council elections mean for APC, PDP",
    "summarized_story": "Basically, the exercise is to elect chairmen into the six Area Councils of Abaji, Abuja Municipal Area Council (AMAC), Bwari, Gwagwalada, Kuje, and Kwali, and councillors for the 62 wards that made up the territory.\nThus, for either the APC or PDP to win or lose the Saturday’s area councils election may imply acceptability or rejection of each of the parties.\nBut for the FCT Area Council polls, APC took the day having won five out of the six chairmanship with many councillor-ship seats while the PDP got one chairmanship (Kuje Council) and a handful of councillors.\nRead also: APC, PDP, others sign peace accord for FCT area council electionBoth the governors-dominated APC and PDP campaign councils are already in Abuja, perfecting plans and campaigning for the victory of their parties on Saturday.\nAdaji said the opposition PDP was only shedding tears of defeat ahead of the Saturday council election, adding that the PDP was always known for raising false alarms."
  },
  {
    "headline": "CBN plans to drive $200bn non-oil exports",
    "summarized_story": "The Central Bank of Nigeria (CBN) and Bankers’ Committee on Thursday launched the “RT200 FX Programme,” an initiative that would drive some projected annual earnings of up to $200 billion from non-oil exports over the next three to five years.\nGodwin Emefiele, the CBN governor, who announced the programme after the Bankers’ Committee meeting in Abuja, said it would be anchored on five pillars, including Value-Adding Exports Facility; Non-Oil Commodities Expansion Facility; Non-Oil FX Rebate Scheme; Dedicated Non-Oil Export Terminal, and Biannual Non-Oil Export Summit.\nHe also mentioned plans to halt dollar sales to the banks before the end of the year as the programme fully picks up.\n“If we are to reach our goal of $200 billion in non-oil exports, then we can neither ignore nor wish away this problem.\nBut to drive the programme, the CBN will host the first Biannual Non-Oil Export Summit, during the first week of April this year."
  },
  {
    "headline": "Obaseki mourns passing of Comrade Ogbeide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Comrade Osarunmwense Ogbeide, who passed on January 25, 2022.\n“A kind, compassionate and loving gentleman, he was a good father, who loved deeply and warmed the hearts of friends and family around him.\n“Osarunmwense was good-natured and made sacrifices for the benefit of others, a trait which endeared him to all.\n“He will be remembered for his large heart, affable nature and commitment to his family.\n“I commiserate with the Ogbeide family, friends and associates of the deceased and pray that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Kidnappers Rape Lawyer, Collect N12Million Ransom – Nigerian Observer",
    "summarized_story": "The lawyer, who was attached to a law firm for her National Youth Service Corps scheme was released with four other victims after payment of N12million ransom.\nAmid a staccato of gunshots, the victims were kidnapped by bandits at Ehor area of the Benin-Ekpoma-Auchi-Abuja Road.\nThey were traveling from Warri, Delta State to Sabongida Ora High Court in Edo State with their driver, when they were abducted.\nThe lady, who cannot be mentioned, was assisting senior solicitors in the conduct of legal matters as a youth corps member.\nAccording to official records, there have been more than 400 cases of reported kidnappings in Southwest Nigeria in the past three years."
  },
  {
    "headline": "Work for Edo’s devt, Obaseki charges new Commissioners, Special Adviser – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… warns against indiscipline in Edo PDPBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in eight new Commissioners and a Special Adviser with a charge to ensure effective service delivery to Edo people.\nThe Commissioners, who were sworn in include, Chris Nehikhare, Omololu Ojehomon, Afishetu Braimoh, and Stephen Idehenre.\nOur party, the PDP, is the party in power and wouldn’t condone opposition within the party.\nWe can’t tolerate indiscipline and disloyalty to the party.\nWe have been patient enough and want to know who the real opposition is and can’t tolerate disloyalty within the party."
  },
  {
    "headline": "ASSASSINATION: Unknown Gunmen In Army Uniform Shot Dead Owner of Osofem Oil And Gas company, Escaped With His Car At Ifo Area, Ogun State – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The owner of Osofem Oil and Gas company, Mr. Olowufemi James has been shot dead by unknown gunmen dressed in Army uniform at Ifo area of Ogun State last Sunday.\nThe father of three, it was learnt was about going home on Sunday January 6, after the sales for the day when the gunmen stormed the petrol station and ordered everyone to remained where they are or they would be killed.\n“He was chased down from his car and they demanded for his car key which he declined.\nI am also begging the State Governor Prince Dapo Abiodun to assist me because my husband was killed in his prime.\nWe are suspecting the manager and the security officer of the petrol station, because since the incident occurred will couldn’t found the two of them after the incident."
  },
  {
    "headline": "Osun APC Igbimo Agba Describes Sule Alao’s death as a rude shock",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Osun All Progressives Congress, (APC) apex body, Igbimo Agba has described the sudden death of one of its chieftains, Alhaji Suleiman Alao as a rude shock and a sad loss to the progressive family in the state.\nThis was contained in a condolence message issued and signed by its chairman , Engr.\nSola Akinwumi, copies of which were made available to newsmen in Osogbo on Thursday.\nThe state apex APC body said Osun and indeed Nigeria, has lost a rare and reliable politician whose impact would be greatly missed.\n“The above body under its Chairman registers her sock and devastating position of heart on the untimely passage of one of us– Chief Alh Sule Aderibigbe Alao after a brief illness,” the statement said."
  },
  {
    "headline": "Supreme court nullifies executive order empowering FG to deduct from state funds",
    "summarized_story": "Nigeria’s Supreme Court has nullified President Muhammadu Buhari’s executive order 10, which he had signed on on May 22, granting financial autonomy to the legislature and the judiciary in the 36 states of the federation.\nThe order empowers the accountant-general of the federation to deduct funds for the state legislature and the judiciary from the federation allocations to the states.\nHowever, all the 36 states through their attorneys-general filed a suit on September 17, 2020, contending the constitutionality of the executive order.\nThe plaintiffs said with the executive order, the federal government’s responsibility of funding capital and recurrent expenditures of state high courts, sharia court of appeal and customary court of appeal has been pushed to the state governments.\nSix out of the seven members of the panel proceeded to void and set aside the EO10."
  },
  {
    "headline": "Union Bank celebrates JAN as Junior Achievement Worldwide Gets Nobel Peace Prize Nomination",
    "summarized_story": "Union Bank of Nigeria celebrates with Junior Achievement Nigeria (JAN) – a member of the global Junior Achievement Worldwide network – following the announcement of the nomination of JA Worldwide for the 2022 Nobel Peace Prize.\nJunior Achievement Worldwide is a non-profit economic education organisation that impacts over 10 million students through a global network of 590,000 volunteers and teachers in 115 countries.\nThe Nigerian chapter, JAN has since its inception in 1999, impacted over one million students in over 20,000 classrooms nationwide.\nThis is in line with the Bank’s efforts to drive sustainable impact for young people in Nigeria.\nJA Worldwide is honored to receive this nomination and will continue our work to enable all young people to have the skills and mindset to build thriving communities."
  },
  {
    "headline": "Gunmen kill five police officers, others in Enugu, Ibadan",
    "summarized_story": "Not less than five police officers were on Thursday killed by gunmen in separate incidents in Enugu and Ibadan, Oyo State.\nIn Enugu gunmen attacked a checkpoint in Enugu South LGA, killing three officers.\nThe gunmen were said to have shot sporadically in the area after killing the officers.\nCommissioner of Police Ngozi Onadeko, who visited the scene of the crime, confirmed that the slain officers were shot in the neck.\nMrs Onadeko also said that the officers killed one of the robbers but the corpse was taken away by the robbery gang."
  },
  {
    "headline": "FCT Election: Minister Tasks Voters On Peaceful Conduct",
    "summarized_story": "Minister of Federal Capital Territory (FCT), Malam Muhammad Bello, has called for peaceful participation of residents in tomorrow’s area council elections.\nThe minister, in a message to FCT residents on the polls, said since the return to democracy in 1999, the FCT area council elections have been held unfailingly every three years, leading to the entrenchment of an enduring democratic culture in the nation’s capital.\nHe therefore called on the voters to maintain this enviable tradition by abiding with extant rules and regulations on the polls.\n“Because, after the election, we must all return to being brothers and sisters bound by the love for country and the desire to see her grow.\n“I, therefore, call on residents and contestants to use the Council polls to truly demonstrate the unity of all Nigerians, regardless of ethnic, religious or political affiliations” the minister added."
  },
  {
    "headline": "Fire Did Not Affect Essential Documents – FMBN",
    "summarized_story": "Federal Mortgage Bank of Nigeria (FMBN) has said the fire incident at its corporate head office in Abuja yesterday was promptly contained and there was no damage to its vital documents.\nThe fire was said to have started at 11pm on Wednesday, the cause of which is yet unknown.\nFire Guts FMBN Headquarters In AbujaADVERTISEMENT“The damage to the building is being assessed by a combined team from the FCT Fire Service, insurance companies and in-house experts.\n“There is also no damage to the essential documents of our office,” he said.\nADVERTISEMENT"
  },
  {
    "headline": "Ikoyi Collapsed Building Probe Committee Submits Report",
    "summarized_story": "Chairman of Council for the Regulation of Engineering in Nigeria (COREN) Special Investigation Panel (SIP), George Okonoma and his team have submitted the report on the 1st November 2021, 21-storey Ikoyi building collapse in Lagos to the president of COREN, Engr.\nOkonoma presented the report and recommendations to the council’s president at COREN’s headquarters yesterday in Abuja.\nHe said report was meant for COREN president and the government to study before making it available to public.\n“One to see what went wrong and apply the right way to correct ourselves and to sanction erring practitioners for negligence.\n“If the report shows that any engineer was involved in the building collapse and has diffracted the practice he or she will definitely be sanctioned by COREN,” he said."
  },
  {
    "headline": "Ikoyi Collapsed Building Probe Committee Submits Report",
    "summarized_story": "Chairman of Council for the Regulation of Engineering in Nigeria (COREN) Special Investigation Panel (SIP), George Okonoma and his team have submitted the report on the 1st November 2021, 21-storey Ikoyi building collapse in Lagos to the president of COREN, Engr.\nOkonoma presented the report and recommendations to the council’s president at COREN’s headquarters yesterday in Abuja.\nHe said report was meant for COREN president and the government to study before making it available to public.\n“One to see what went wrong and apply the right way to correct ourselves and to sanction erring practitioners for negligence.\n“If the report shows that any engineer was involved in the building collapse and has diffracted the practice he or she will definitely be sanctioned by COREN,” he said."
  },
  {
    "headline": "NOTAP Tasks Nigerian Researchers On Commercialisation Of Goods",
    "summarized_story": "National Office for Technology Acquisition and Promotion (NOTAP) has urged Nigerian researchers to concentrate more on researches that have the potentials and capacity to translate into commercialisable goods and services for economic sustainability of the country.\nHe said it was expensive to undertake a research that will metamorphous into tangible products and service, hence the need to increase research funding.\nADVERTISEMENTThe NOTAP boss said that what makes the developed countries tick was the quality of R&D results emanating from their knowledge establishments.\nHe said that technologies were products of research and researches were undertaken by the knowledge institutions therefore, Nigerian universities and polytechnics needed an orientation towards problem solving research.\nThe DG said the reason for the initiative was to tailor the minds of Nigerian researchers towards problem solving research instead of engaging in convention research for the purposes of career progression."
  },
  {
    "headline": "BREAKING: Gunmen Kill KADGIS Director In Kaduna",
    "summarized_story": "About five gunmen in the early hours of Friday morning assassinated the Director of Operations, Kaduna Geographic Information Service (KADGIS), Malam Dauda.\nSources disclosed that the killers breached the security of the victim’s house located in Barakallahu community in Igabi Local Government Area of the state, went inside the room and shot him dead.\nIt was also revealed that the killers only killed the director and left immediately without touching any valuables like cars and other valuables.\nThe killers also attacked a nearby community, though no death or injury was recorded during the attack.\nPolice Public Relations Officer, ASP Muhammad Jalige, did not respond to text messages and calls to his phone as at the time of filling this report."
  },
  {
    "headline": "JUST IN: Ex-Anglican Bishop, Adebiyi, Is Dead",
    "summarized_story": "JUST IN: Ex-Anglican Bishop, Adebiyi, Is DeadPeter Adebiyi, the former Bishop of the Anglican Diocese of Lagos-West, has died.\nAdebiyi, who was born in 1943, died in the early hours of Friday.\nHe served as the diocese’s bishop from 1999 to 2013, when he retired.\nBishop Olusola Odedeji, his successor, confirmed his death in a message to the diocese’s members on Friday morning.\nIt is sad and heartbreaking to announce the home-call of our patriarch and hero, Papa Peter Awelewa Adebiyi, a few hours ago."
  },
  {
    "headline": "BREAKING: SSS Arrests Media Activist, Arogundade, At Lagos Airport",
    "summarized_story": "Mr Lanre Arogundade, Executive Director of the International Press Institute in Lagos and former President of the National Association of Nigerian Students, has been arrested by State Security Service officers.\nOn Thursday, Arogundade was apprehended at the Murtala Muhammed International Airport.\n“In fact, Mr Arogundade conducted himself as a law-abiding citizen of Nigeria throughout his stay in The Gambia.\nEven though the State Security Service said that Mr Arogundade has no right to enter Nigeria, he has not been sent back to the Gambia or any other country that might have been adopted for him.\nSince the harassment of Mr Arogundade cannot be justified, we are compelled to demand his immediate and unconditional release from the illegal custody of the State Security Service.”"
  },
  {
    "headline": "UPDATE: Armed Robbers Attack Bullion Van, Kill 3 Policemen, Four Others In Ibadan (VIDEO)",
    "summarized_story": "ARMED robbers have attacked a bullion van transporting money to a bank at Idi-Ape in Ibadan North East Local Government area of Oyo state, killing three police officers and four others.\nVanguard reports that the armed robbers, who were said to have dressed in police uniform, trailed the van to Idi-Ape and, tried unsuccessfully to intercept the bullion van at the area.\nEyewitnesses, however, told Vanguard that the robbers allegedly fired several shots at the escort van in a bid to intercept the van and cart away the money.\nIt was further learnt that the police command launched a manhunt for the fleeing robbers, with the assurance that they would be arrested.\nWatch video below:VIDEO: Gunmen rob, demobilise bullion van in Ibadan pic.twitter.com/Cw1zconDF2 — The Nation Nigeria (@TheNationNews) February 10, 2022More details shortly…."
  },
  {
    "headline": "Listing benefits of MeFirst Account for teenagers",
    "summarized_story": "Benefits of Teenage Bank AccountApart from teaching about working, saving, and growing one’s money, Teenage Bank account promotes a strong sense of self-accountability.\nFirstBank’s MeFirst AccountThe First Bank of Nigeria Limited created Mefirst Account to encourage the right savings culture among children.\nMeFirst account is designed for teenagers between the ages of 13 and 17.\nMeFirst account holders can select from five exciting card design options that suites their trendy style.\nThe account maintains Zero account opening balance with Automatic transition to XploreFirst Account when the teenager attains the age of 18 years."
  },
  {
    "headline": "Breaking: Buhari ‘s Executive Order 10 unconstitutional, Supreme court declares",
    "summarized_story": "The Supreme Court Friday in Abuja, declared as unlawful and unconstitutional the Executive Order 10 (EO10) issued by President Muhammadu Buhari.\nBlueprint reports that the Order 10 which borders on the funding of State Judiciary and Legislature became a controversial debate a few months back and consequently triggered a face-off between the central and State Governors in the country.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Watch what Uzodimma, Okorocha did when they finally met",
    "summarized_story": "Former governor of Imo State, Rochas Okorocha, ancd the incumbent governor, Hope Uzodinma, settled their long time rift with a warm hug in an event in Abuja.\nThe two politicians met on Thursday, in an event organised by the Yobe state government to raise funds for the state education."
  },
  {
    "headline": "UPDATED: Supreme Court Declares Executive Order 10 Unlawful, Dismisses Governors’ N66bn Suit",
    "summarized_story": "The Supreme Court has declared as unlawful and unconstitutional, Executive Order 10 (EO10) on the funding of State Judiciary and Legislature.\nSix of the seven members of the panel proceeded to void and set aside the EO10 issued by President Muhammadu Buhari.\nThe apex court also dismissed the N66 billion suit filed by the state governors against the Federal Government.\nThe 36 states governors had in the suit sought an order of the court to compel the Federal Government to take up funding of capital projects for State High Courts, Sharia Court of Appeal, and Customary Court of Appeal.\nThis move was, however, rejected by the state governors who demanded the immediate dissolution of the Presidential Implementation Committee and challenged the EO10 at the apex court."
  },
  {
    "headline": "10 Killed, Several Injured In Katsina Trailer Accident",
    "summarized_story": "At least 10 people have been killed in a road crash involving a trailer in Katsina State, said the Federal Road Safety Corps (FRSC).\nThe spokesman for the FRSC Command in Katsina, Abubakakar Usman, confirmed the incident to Channels Television on Friday.\nThe trailer loaded with 18 passengers and an unspecified number of cattle was said to have lost control and crashed on Thursday night at Gora village in Malumfashi Local Government Area of the state.\nREAD ALSO: Lion Cub Rescued In Abuja, Suspected Traffickers ArrestedUsman, while giving an account of the incident, said an investigation conducted by the FRSC rescue team revealed that the driver was sleeping while the long vehicle was on motion, leading to the accident.\nEyewitnesses also said the trailer was headed to Warri in Delta State from Dankama town in Katsina Local Government Area before it crashed."
  },
  {
    "headline": "CBN To Stop Sale Of Forex To Banks By Year End",
    "summarized_story": "The Central Bank of Nigeria has revealed that it would stop the sale of foreign exchange to banks by the end of the year.\nCBN Governor, Godwin Emefiele, said the banks must begin to source their forex from export proceeds.\n“It is coming to an end before or by the end of this year.\nWe will tell them don’t come to the Central Bank for foreign exchange again go and generate your export proceeds.\n“When those export proceeds come, we will fund them at 5% for you and they will earn rebait."
  },
  {
    "headline": "Two Policemen Shot Dead As Robbers Attack Bullion Van In Ibadan",
    "summarized_story": "Two policemen have been shot dead as armed robbers attacked a bullion van at the Iwo Road area of Ibadan, Oyo State.\nThe attack which happened on Thursday, left people scampering for safety as the exchange of gunshots between the robbers and security agents attached to the bullion van lasted for some minutes.\nCommuters were forced to abandon their cars in the middle of the road as security operatives struggled to repel the attack.\nShe, however, said that one of the robbers was also shot dead during the attack but the robbers made away with his body.\nWhile describing the attack as a coordinated one, Onadeko said all exit points in Ibadan have been placed on red alert."
  },
  {
    "headline": "West Ham Under Pressure To Drop Zouma As They Battle For Top Four",
    "summarized_story": "West Ham manager David Moyes is in the spotlight ahead of his side’s trip to Leicester on Sunday, with the build-up overshadowed by the fallout from a video showing defender Kurt Zouma physically abusing his cat.\nThe Hammers have upset the odds to lead Arsenal, Manchester United and Tottenham in the battle for a place in next season’s Champions League.\nMoyes’ decision to play Zouma on Tuesday has been fiercely criticised by prominent sporting and political figures.\n– Man Utd stumble –Manchester United and Tottenham also have to bounce back from poor midweek results that cost them ground in the race for the top four.\nFixtures (all times GMT)SaturdayManchester United v Southampton (1230), Brentford v Crystal Palace, Everton v Leeds, Watford v Brighton (all 1500), Norwich v Manchester City (1730)SundayBurnley v Liverpool, Newcastle v Aston Villa, Tottenham v Wolves (all 1400), Leicester v West Ham (1630)"
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Zamfara Assembly orders Chief judge to set up panel to investigate deputy Gov. -",
    "summarized_story": "The Zamfara State House of Assembly has directed the state Chief Justice to set up investigative panel on the alleged gross misconduct leveled against the state Deputy Governor Mahdi Aliyu Gusau.\nThe House during it’s 120 Plenary unanimously agreed that the Deputy Governor be investigated for breaching Sections 190 and 193 (1), (2) (a)(b)(c) of the Constitution of the Federal Republic of Nigeria.\nAdvertisementThis Development is coming barely twenty four hours after the House served all members with Notice of Impeachment of the Deputy GovernorEighteen out of the twenty two members of the House voted for in favour of the motionAdvertisementThe only PDP Lawmaker representing Zurmi East Salihu Usman was also not present at the plenaryThe Zamfara assembly is accusing the deputy of abuse of office, saying he has breached sections 190 and 193 (1), (2) (a)(b)(c) of the ConstitutionAdvertisementThe Zamfara State House of Assembly had on Monday through the Secretary to the state government served the deputy Governor an impeachment noticeA federal high court in Abuja had in November last year restrained the Zamfara Assembly from any move to impeach the deputy GovernorAdvertisementThe crisis between the Zamfara Assembly and deputy Governor started a few weeks after the formal Defection of Governor Bello Matawalle from the People’s Democratic Party to the ruling APC.\nAdvertisement"
  },
  {
    "headline": "Bagudu swears-in 21 LG chairmen, asks them to develop grassroot potential -",
    "summarized_story": "The newly elected chairmen and vice chairmen of the twenty one local government areas of Kebbi state have been advised to pay attention to the economic potential and other opportunities in their various domain.\nKebbi state governor, Atiku Bagudu gave the advised shortly after the elected council officials took their oath of office at a ceremony held at Birnin Kebbi.\nAdvertisementHe says the council executives should also be interested in how those economic potential can be developed and explore for the benefit of the nation and their immediate environment.\nThe governor said, with the oath of office administered on them, partisanship should be kept aside and work for the entirety of the people of the local government irrespective of political party affiliation.\nAdvertisementThe twenty one council chairmen and their vice chairmen are all of the All Progressives Congress APC and sixteen of the twenty and fifty five councillors elected across the twenty one.local government, sixteen of them are women."
  },
  {
    "headline": "Ahead of 2023 Elections, Buhari Warns Foreign Diplomats About Meddling in Nigeria’s Internal Politics",
    "summarized_story": "For the umpteenth time, President Muhammadu Buhari has warned foreign diplomats against meddling in the internal politics of Nigeria as the nation prepares for the 2023 general elections.\nThis was the second time in five months that the president would be asking diplomats to steer clear of nation’s local politics.\nBuhari urged the Ambassadors to build lasting friendships in the course of performing their duties that will go beyond assignments in Nigeria.\nBuhari assured of partnership and mutual cooperation in canvassing more Foreign Direct Investments (FDI) in healthcare system, education, infrastructure, local manufacturing, pharmaceuticals, agribusiness and transportation.\nKrejc said the envoys would work for the development of Nigeria, through strengthening of mutual and beneficial relations with their countries."
  },
  {
    "headline": "Buhari Still Consulting on Electoral Bill, Aide Says",
    "summarized_story": "The Senior Special Assistant to President Muhammadu Buhari, on National Assembly Matters (Senate), Senator Babajide Omoworare, on Thursday said his principal had yet to sign the 2010 Electoral Act (Amendment) Bill 2022 because he was still consulting with stakeholders and legal experts on the issue.\nThey spoke at a Policy Dialogue programme, organised by the National Institute for Legislative and Democratic Studies (NILDS).\nHe said, “A very crucial consultation is going on between Mr. President, the Attorney General and other critical stakeholders on content of the bill for the required assent.\nMalami had during an interview on Channels Television hinted that President Muhammadu Buhari may withhold assent, if the bill was considered to have proposals based on personal interests.\nHe added that if the nation was serious about advancing democracy, then people should stop playing to the gallery and do what the public interest says."
  },
  {
    "headline": "Nigeria’s Oil Production Rises by 202,000bpd",
    "summarized_story": "According to the OPEC’s Monthly Oil Market Report (MOMR) for January released on Thursday, the country struggled to pump 1.399 million bpd out of the total allocation, quoting primary sources.\nRelatedStories No Content AvailableThis was in contrast to December 2021, when it pumped 1.197 million barrels per day and November when it was only able to produce 1.275 million bpd.\nEven top producer, Saudi Arabia, failed to deliver its 110,000 bpd monthly increase, raising its oil production in January by 54,000 bpd to 9.999 million, below its 10.122 million bpd quota for January per the OPEC+ deal.\nDespite tightening oil market, OPEC and its allies, OPEC+ has continued to add a measured 400,000 barrels per day increase in production to the market.\nIt left its demand outlook for global oil demand growth unchanged, while signalling optimism about prospective increases in transport fuel consumption."
  },
  {
    "headline": "CBN Eyes $200bn from Fresh Non-Oil Exports",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, on Thursday announced a new programme to stimulate the country’s non-oil exports and achieve $200 billion repatriation of proceeds between three to five years.\nEmefiele said the scheme, code-named, “Race to $200 billion in FX Repatriation (RT200 FX Programme),” which takes immediate effect, consists of a set of policies, plans and programmes for non-oil exports which would help the country attain its goal of $200 billion in FX repatriation, exclusively from non-oil exports transactions over the next three to five years.\nHe, however, explained that the new non-oil export initiative would have five key anchors namely value-adding exports facility; Non-oil commodities’ expansion facility; Non-oil FX rebate scheme; Dedicated non-oil export terminal as well as Biannual non-oil export summit.\n“Fund people who want to generate export proceeds, when those export proceeds come, we would fund them at five per cent for you and they would earn rebate and that’s how we can help you.\nThat you will continue to come to central bank to give you dollar, we would stop it."
  },
  {
    "headline": "Nigeria’s Debt Sustainability at Risk, Cause for Concern, IMF Says",
    "summarized_story": "The International Monetary Fund (IMF) has said Nigeria’s debt sustainability is at risk and causes a great deal of concern and unease in the long-term.\nRahman noted that the increase in public debt had grown rapidly in 10 years and was approaching a time when the country would spend all its income on servicing debts.\nRahman explained, “But what we should remember here and the things that make Nigeria’s debt sustainability at risk are the following: we have seen a rapid rise in public debt in the last 10 years or so and this is being driven by fiscal deficits.\nAnd there are a couple of other points that we should remember; which is that Nigeria’s debt carrying capacity is very low.\nSo that makes Nigeria quite vulnerable.”Rahman said going forward, IMF projected for Nigeria a continuous increase in public debt."
  }
]