[
  {
    "headline": "Bleached spots in underwear sign of healthy vagina, physician tells women",
    "summarized_story": "Amarachi OkehA health expert, Dr. Toluwani Binutu, says women should not be worried about the bleached spot that appears on their underwear, noting that stained underwear is a sign of a healthy vagina.\nSpeaking via his Instagram handle, @tolubinutu, the UK-based health expert said it is normal that a woman’s vaginal discharge bleaches her underwear.\nHe said, “Sometimes women get worried when they notice their underwear has bleached spots on them.\nThe Health Shot article explained that “a healthy vagina has a natural pH value between 3.8 and 4.5, which means it is largely acidic.\n“The vagina has good bacteria called lactobacilli which keep your vagina healthy by maintaining optimum acidity levels and preventing bad bacteria from causing infection."
  },
  {
    "headline": "Bleached spots in underwear sign of healthy vagina, physician tells women",
    "summarized_story": "Amarachi OkehA health expert, Dr. Toluwani Binutu, says women should not be worried about the bleached spot that appears on their underwear, noting that stained underwear is a sign of a healthy vagina.\nSpeaking via his Instagram handle, @tolubinutu, the UK-based health expert said it is normal that a woman’s vaginal discharge bleaches her underwear.\nHe said, “Sometimes women get worried when they notice their underwear has bleached spots on them.\nThe Health Shot article explained that “a healthy vagina has a natural pH value between 3.8 and 4.5, which means it is largely acidic.\n“The vagina has good bacteria called lactobacilli which keep your vagina healthy by maintaining optimum acidity levels and preventing bad bacteria from causing infection."
  },
  {
    "headline": "Make COVID-19 drugs, vaccines available to everyone, WHO chief urges global leaders",
    "summarized_story": "Oluwatobiloba JaiyeolaThe Director-General of the World Health Organisation, Dr. Tedros Adhanom Ghebreyesus, has urged all leaders around the world to step up efforts to make COVID-19 tests, treatments and vaccines available to all populations.\nThe global health agency boss made the call during a press conference organised on Tuesday by the WHO.\n“There needs to be increased geographical scope on the licensing Pfizer signed with the Medicines Patent Pool, an UN-backed public health organisation.\n“At the Global Summit on COVID-19, leaders must agree to end the stalemate at World Trade Organisation on the temporary waiver of intellectual property on COVID-19 tools.\n“Long COVID is devastating and debilitating for individuals, both young and old, communities and economies."
  },
  {
    "headline": "Make COVID-19 drugs, vaccines available to everyone, WHO chief urges global leaders",
    "summarized_story": "Oluwatobiloba JaiyeolaThe Director-General of the World Health Organisation, Dr. Tedros Adhanom Ghebreyesus, has urged all leaders around the world to step up efforts to make COVID-19 tests, treatments and vaccines available to all populations.\nThe global health agency boss made the call during a press conference organised on Tuesday by the WHO.\n“There needs to be increased geographical scope on the licensing Pfizer signed with the Medicines Patent Pool, an UN-backed public health organisation.\n“At the Global Summit on COVID-19, leaders must agree to end the stalemate at World Trade Organisation on the temporary waiver of intellectual property on COVID-19 tools.\n“Long COVID is devastating and debilitating for individuals, both young and old, communities and economies."
  },
  {
    "headline": "2023: Female Professor picks NRM Presidential Nomination Form",
    "summarized_story": "Edo women group wants automatic ticket for female aspirants By Johnbosco Agbakwuru—Vows to give APC, PDP a run for their money-A Canadian-based Professor of Education, Benedicta Egbo, yesterday joined the presidential contest as she picked the Expression of Interest and Nomination Forms of National Rescue Movement, NRM, in Abuja.\nThe erudite Professor and author of many books was accompanied to the NRM secretariat by her husband.\nYou can take me out of Nigeria but you can’t take Nigeria out of me.\nI will give others (PDP and APC) a run for their money.\nShe also promised to tackle the issue of unemployment which said is presently at an alarming rate in the country."
  },
  {
    "headline": "Edo government ready to partner groups for empowerment, development",
    "summarized_story": "Governor Godwin ObasekiBy Ozioruva AliuBENIN CITY – EDO state government on Thursday said it was ready to partner groups and non governmental organisations to develop the state and empower its indigenes for the better.\nThe Governor of the state, Godwin Obaseki stated this at an empowerment programme orgnanised by Erina Help and Care Foundation (EHCF) to train and equip selected individuals through groups that would be trained and then empowered to stand on their own.\n“This present administration is poised to continue to create jobs, enable productive wealth, provide a safe environment for citizens and investments and provide affordable housing.\n“You don’t have to be a big man or in government to make an impact.\nMy mother showed us how to give and you know children learn from what they see."
  },
  {
    "headline": "University unions turned down FG plea to re-open schools",
    "summarized_story": "However, the unions refused to back down from continuing the strike saying that there was nothing on ground from the government side to warrant that.\nSo, we are hopeful that by next weekend, the unions will see a conclusion of that area”.\nHe said that something needs to be done urgently to reopen the institutions and to prevent students from protesting on the streets.\nHe said that most of the contents of the 2020 Memoradum of Action were based on the federal government sponsored NEEDS assessment on all federal universities in 2013.\nHe said that the Jonathan-led administration commenced the Implementation with release of the first tranche of N200 billion in 2014."
  },
  {
    "headline": "Police, widow of killed tricycle operator trade words over his death",
    "summarized_story": "While Okonkwo’s widow, Ebere, alleged that the police killed her husband in detention, the police command, although not admitting that Okonkwo was killed, linked the death of the two policemen to a gang he belonged to.\nSobbing uncontrollably yesterday, Ebere said her husband was paraded a week ago by the state police command and detained, only to die shortly after.\n“He was paraded alongside other suspects by the Commissioner of Police, Echeng Echeng at the Command Headquarters in Awka.\nTwo Police officers who were in the vicinity were killed and their weapons, two AK 47 rifles, carted away.\n“The leader of the gang, one Uchenna Nwobu a.k.a Anali was killed, while the other gang member was arrested”."
  },
  {
    "headline": "EFCC nabs YahooYahoo Academy owner, 16 ‘trainees’ in Abuja",
    "summarized_story": "Soni Daniel, AbujaOperatives of the Abuja Zonal Command of the Economic and Financial Crimes Commission have arrested one Afolabi Samad, owner of a Yahoo Yahoo Academy in Abuja.\nThe 24-year-old was arrested in a sting operation on Thursday alongside 16 of his students.\nThe youngsters between the ages of 18 and 27 years, were arrested at their hideout located in Peace Court Estate, Lokogoma, a suburb of Abuja.\nThe owner of the alleged ‘Academy’ reportedly rented the 3-bedroom flat for N3 million to impact the tricks of cyber-frauds on his apprentices for undisclosed fees.\nA statement by EFCC spokesman Wilson Uwujaren said suspects would be charged to court as soon as investigations are concluded."
  },
  {
    "headline": "Deborah Samuel: Cancel lawyers’ conference in Sokoto – Adegboruwa to NBA",
    "summarized_story": "Vocal legal practitioner, Ebun-Olu Adegboruwa, has condemned the gruesome murder of Deborah Samuel.\nThe 200 level student of Shehu Shagari College of Education in Sokoto State was burnt alive on Thursday.\nAdegboruwa advised the Nigerian Bar Association – Section on Public Interest and Development Law (NBA-SPIDEL) to cancel its conference to be held in Sokoto.\n“It is barbaric and lawyers should not be seen to be dancing on her grave in that State”, the Senior Advocate of Nigeria (SAN) said.\nNBA-SPIDEL Publicity Secretary, Godfrey Echeho had announced Muiz Banire (SAN) as the Planning Committee Chairman; Sam Amadi is the vice."
  },
  {
    "headline": "Deborah Samuel: Ezekwesili, Aisha react to killing of student over blasphemy",
    "summarized_story": "A former Minister of Education, Dr Obiageli Ezekwesili and popular sociopolitical activist, Aisha Yesufu, has condemned the killing of a christian student in Sokoto State, identified as Deborah Samuel.\nDAILY POST had reported that Deborah was lynched by some male Muslim students and burnt, for allegedly insulting Prophet Mohammed.\nThe Prophet (SAW) went to visit a man that usually insult & pour debris on him when the man was ill Nigeria keeps producing serial killers!\n”They fight for God and leave their fight to God!\nWe cannot keep producing serial killers who are also begetting new sets of serial killers.”"
  },
  {
    "headline": "Whistleblowing: Make public what recovered looted funds are used for – CSOs to FG",
    "summarized_story": "Civil Society Organisations, CSOs, and officials in the Ministries, Departments and Government Agencies, MDAs, have urged the Federal Government and other policy makers to ensure that all recoveries of looted funds and what they were used for are made public by publishing them on whistleblower portal/website.\nThese were contained in a communique issued at the end of the three day conference with the theme”Implementation of the Whistle Blower Policy in Nigeria:Issues, Challenges, and Way Forward.”The participants called for adequate protection for whistle blowers in the country,and urged the National Assembly to expedite action on the passage of the whistle blower bill into law.\nThey, however, recommended that States should consider the creation of a Whistle Blowing Units in the respective states to handle Whistle Blowing issues and that the prosecution of corrupt individuals be concluded in time and made public”.\nThe participants, however, commended the Federal Ministry of Finance, Budget and National Planning for organizing the Zonal Conference which they described as apt and timely.\nThey also commended the Akwa State Government in particular and the South-South States in general for their support in making the Conference a huge success."
  },
  {
    "headline": "2023: Emefiele may discard presidential ambition after meeting Buhari – Presidency source",
    "summarized_story": "President Muhammadu Buhari on Thursday in Abuja met behind closed doors with the Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele.\nThe agenda of the meeting between the president and Emefiele could not be ascertained as at the time of filing this report.\nNAN, however, gathered that the CBN governor might have updated the president on the ongoing debate about his resignation or continued stay in office.\nThe source, which preferred not to be named, told NAN that the CBN governor had finally decided to concentrate on his official job of safeguarding and transforming the nation’s economy.\nSome farmers associations in the country had raised N100 million to purchase APC Presidential Expression of Interest and Nomination forms for Emefiele, ahead of the party’s primary on May 31."
  },
  {
    "headline": "‘Why Ebonyi Assembly approved N10bn fresh loan for Umahi – Commissioner, Orji",
    "summarized_story": "Ebonyi State Government through the Commissioner for Information and State Orientation, Mr. Uchenna Orji, on Thursday, revealed the reason the state House of Assembly approved N10bn for Governor David Umahi.\nOrji made this known while speaking with newsmen in Abakaliki, shortly after the State Executive Council meeting.\nHe said, “This loan is N10bn, which we are working with UBA to secure.\nHe said: “Executive Order on indiscriminate pasting of papers, posters, banners, and erection of billboards within the state was signed by His Excellency the Governor in EXCO.\nThe EXCO noted that the Executive Order is a good omen that will enhance the status of the State as having one of the neatest capital cities in Nigeria.”"
  },
  {
    "headline": "AFC backs African economy with $2 billion facility",
    "summarized_story": "A two billion dollar facility has been launched by the Africa Finance Corporation (AFC) to boost economic recovery and resilience in Africa.\nThe move, announced yesterday in Abuja at the ‘AFC Live Infrastructure Solutions Summit’, was in response to the economic challenges created by the twin catastrophe of COVID-19 pandemic and the raging conflict between Russia and Ukraine.\nThe AFC plans to commit $1 billion funding of the facility and raise the balance through the corporation’s network of international partners and investors.\nThe benefiting institutions are expected to leverage AFC’s access to global funding to receive financing at competitive rates.\nOver the last 15 years, the AFC also established an independent asset management arm – AFC Capital Partners – with plans to raise $2 billion to fund climate adaptation infrastructure projects in the continent."
  },
  {
    "headline": "Emefiele meets Buhari as SGF clarifies quit order",
    "summarized_story": "Wednesday’s presidential directive has put paid to any doubt on whether appointees eyeing political offices should exit.\nSecretary to the Government of the Federation (SGF) Boss Mustapha, clarified the resignation directive by the President in a circular dated May 11.\nThey stated, in a supporting affidavit, that they had obtained expression of interest forms to contest in the APC primaries.\nAccording to the plaintiffs, unless the defendants are restrained, APC and INEC will prevent them from participating in the primaries.\nCNPP, ZLP hail Buhari on resignation directiveThe Conference of Nigeria Political Parties (CNPP) and the National Chairman of Zenith Labour Party (ZLP) Chief Dan Nwanyanwu praised President Buhari for issuing the resignation directive."
  },
  {
    "headline": "El-Rufai, Kaduna delegates pledge support for Tinubu",
    "summarized_story": "The presidential aspiration of All Progressives Congress (APC) Asiwaju Bola Tinubu got a boost yesterday in Kaduna where Governor Nasir El-Rufai and delegates in the state pledged their support.\nIn a voice vote administered by the governor, the delegates predicated their support on Tinubu being “the first aspirant to come to us”.\nThe former Lagos State Governor described himself as the most qualified of all the presidential aspirants across the political parties.\nThe aspirant urged the delegates and APC leaders to support the fight to ensure that APC maintains its ruling status at the federal and state levels.\n“You are the first presidential aspirant to come to Kaduna."
  },
  {
    "headline": "Suspected Yahoo Boys re-arraigned over ‘N14.7m fraud’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) yesterday re-arraigned two men, Adeyemi Oluwaseun and Suleiman Yusuf Obhakume, for alleged conspiracy, identity theft, cyberstalking and N14,749,000.00 fraud.\nJustice Obiozor was soon after transferred to another division of the court, following which the case was re-assigned.\nJustice Ringim ordered the defendants to continue with the bail terms earlier granted them by Justice Obiozor.\nThey were also accused of using Ishola’s name to fraudulently obtain N14.749 million from First Marina Trust Limited.\nThe EFCC also accused the defendants of, on 17, 2016, hacking Ishola’s altered email address and that of Ohamuo Chimezie, using the computer system(s} from “[email protected] to [email protected] and [email protected] to [email protected] with the intention that the email will be acted upon as genuine."
  },
  {
    "headline": "Diesel hike: Enugu govt increases waste evacuation contracts’ budget",
    "summarized_story": "Committed to ensuring that the enviable sanitary condition of Enugu city is restored, the Enugu State government has upwardly reviewed the terms of waste evacuation contracts with the waste disposal contractors in the state to ensure optimum hygienic condition of the city.\nA statement by the Special Adviser to the Governor on Information, Steve Oruruo, said the review was approved to compensate the contractors for the high operating cost occasioned by spike in cost of diesel, vehicle maintenance and labour, among others.\nIt was also to improve the capacity of the waste evacuation contractors to render top-notch service.\nWhile frowning at the declining state of the cleanliness of Enugu city, the state government consequently charged the waste evacuation contractors to urgently reverse the undesirable trend and restore the hitherto enviable sanitary condition of the city.\nIt assured the people of the state that a huge improvement in the cleanliness of the city will be witnessed shortly."
  },
  {
    "headline": "Protesing students block highways in Ife, Nsukka",
    "summarized_story": "The students who barricaded major roads in Ile-Ife carried placards with inscriptions such as “Fund Education Now,” and “Education is not a Scam” among others.\nConverging under the aegis of the Fund Education Coalition, the students blocked major roads and obstructed vehicular movement for hours chanting anti-government songs and observing prayers on major highways.\nOne of the protesters, Olugbade Mojeed, said the strike had forced some students to engage in vices.\nMeanwhile, President Muhammadu Buhari has again appealed to ASUU to consider the plight of students and call off the three-month old strike.\nHe explained that the strike had a negative effect on the students, the institutions, communities and the economy."
  },
  {
    "headline": "2023: I’m not a betrayal, Kalu replies Clark",
    "summarized_story": "From Fred Itua, AbujaChief Whip of the Senate, Orji Uzor Kalu, has replied a Niger Delta leader, Edwin Clark, saying the did not betray the South East.\nElder statesman, Chief Edwin Clark had accused Kalu of betraying the Igbo cause by dropping his presidential ambition and supporting Senate President, Ahmed Lawan.\nKalu said: “I have great respect for Chief Edwin Clark.\n“What did you say or do when all the aspirants from South South and South West were buying forms to run against South Easterners who have always supported them.\n“I know some people want us to keep quiet and then allow other Southerners take turn of South East."
  },
  {
    "headline": "INEC to partner EFCC to check campaign finance",
    "summarized_story": "From Okwe Obi, AbujaThe Independent National Electoral Commission (INEC), Prof. Mahmood Yakubu, yesterday, disclosed that the commission would partner the Economic and Financial Crimes Commission (INEC) to checkmate campaign finance by political parties.\nIt is true that we are working with the EFCC to see what we can do in the area of campaign finance.\nThe electoral umpire dispelled fear that university lecturers would boycott the plebiscite as a result of the ongoing strike by Academic Union of University (ASUU).\nAnd the position of the union had not changed.”He said INEC would consider the relocation of election materials from the Central Bank of Nigeria (CBN).\nI want to assure you that we we will not jeopardise the conduct of the election by creating a misconception situation in the process.”"
  },
  {
    "headline": "233 LGAs in 32 states to be heavily flooded, FG warns – The Sun Nigeria",
    "summarized_story": "From Charity Nwakaudu, AbujaThe Federal Governmrnt has warned Nigerians to get prepared as 233 local government areas in 32 states including the Federal Capital Territory would experience heavy flooding this year.\nHe added that flash and urban flooding would be experienced in urban cities centres across the country.\n“The breakdown of the 2022 AFO shows that 233 local Government Areas in 32 states of the Federation and FCT fall within the highly probable risk areas, while 212 Local government areas in 35 states including FCT fall within the moderately flood risk areas.\n“The summary of the year’s AFO predicts coastal flooding for Rivers, Bayelsa, Cross River, Delta Edo, Lagos , Ogun and Ondo.\n“Flash and urban flood are expected in uban cities centres across the country."
  },
  {
    "headline": "Supreme Court: Justice Mary Odili bows out",
    "summarized_story": "From Godwin Tsa, AbujaDisturbed by the state of affairs, Justice Mary Peter-Odili of the Supreme Court, yesteray, joined in the call for the restructuring of the country.\nHe described retired Justice Odili as a true image of a renowned jurist and African heroin.\nChief Justice of Nigeria, Justice Ibrahim Tanko Muhammad, also showered encomiums on the retired justice, describing her as an epitome of jurisprudential finesse, an insuperable lioness with an irresponsible voice in the temple of Justice.\nJustice Odili was appointed a Justice of the Supreme Court on June 23, 2011, and was later conferred with National Honour Commander Federal Republic, CFR.\nShe is married to a former Governor of Rivers State, Peter Odili, and their marriage is blessed with children."
  },
  {
    "headline": "Terror Group, Islamic State Releases Video Showing Execution Of 20 Nigerian Christians To ‘Avenge Killing Of Leaders In Middle East’",
    "summarized_story": "The Islamic State of Iraq and Syria (ISIS) has published a video that shows the execution of about 20 Christian civilians in northeast Nigeria’s Borno State, BBC reports.\nOne of the masked militants who spoke in Hausa language during the execution said it was to avenge the killing of the group’s leaders in the Middle East earlier in 2022.\nThe video was published on an IS-linked news outlet and shows three groups of captives in civilian clothes.\nThe IS militants operate in the Lake Chad region under the name Islamic State West Africa Province (ISWAP), along with another Islamist militant group, Boko Haram.\nThis caused a major shift in Nigeria’s conflict, though Islamic State in West Africa Province or ISWAP has recently emerged as the dominant force in the more than decade-long Islamist insurgency in the country’s northeast."
  },
  {
    "headline": "Terror Group, Islamic State Releases Video Showing Execution Of 20 Nigerian Christians To ‘Avenge Killing Of Leaders In Middle East’",
    "summarized_story": "The Islamic State of Iraq and Syria (ISIS) has published a video that shows the execution of about 20 Christian civilians in northeast Nigeria’s Borno State, BBC reports.\nOne of the masked militants who spoke in Hausa language during the execution said it was to avenge the killing of the group’s leaders in the Middle East earlier in 2022.\nThe video was published on an IS-linked news outlet and shows three groups of captives in civilian clothes.\nThe IS militants operate in the Lake Chad region under the name Islamic State West Africa Province (ISWAP), along with another Islamist militant group, Boko Haram.\nThis caused a major shift in Nigeria’s conflict, though Islamic State in West Africa Province or ISWAP has recently emerged as the dominant force in the more than decade-long Islamist insurgency in the country’s northeast."
  },
  {
    "headline": "Jonathan Finally Joins Ruling APC In Bayelsa Ward, Set To Recontest For President",
    "summarized_story": "President Goodluck Jonathan has formally defected to the ruling All Progressives Congress (APC) in a bid to recontest for President in 2023.\nThis comes hours after disowning a nomination form purportedly procured for him by a northern group.\nJonathan lost to the incumbent, President Muhammadu Buhari in 2015 as a member of the Peoples Democratic Party (PDP).\nAccording to the source, some of the African leaders told Jonathan that Nigeria was passing through challenging times and in need of \"a unifier like Jonathan at this time’’.\n“And upon purchasing the form, Jonathan alerted Buhari."
  },
  {
    "headline": "Jonathan Finally Joins Ruling APC In Bayelsa Ward, Set To Recontest For President",
    "summarized_story": "President Goodluck Jonathan has formally defected to the ruling All Progressives Congress (APC) in a bid to recontest for President in 2023.\nThis comes hours after disowning a nomination form purportedly procured for him by a northern group.\nJonathan lost to the incumbent, President Muhammadu Buhari in 2015 as a member of the Peoples Democratic Party (PDP).\nAccording to the source, some of the African leaders told Jonathan that Nigeria was passing through challenging times and in need of \"a unifier like Jonathan at this time’’.\n“And upon purchasing the form, Jonathan alerted Buhari."
  },
  {
    "headline": "Nigerian Government Must Punish Killers Of Sokoto Female Student – Bishop Kukah Demands Justice",
    "summarized_story": "Nigerian Government Must Punish Killers Of Sokoto Female Student – Bishop Kukah Demands JusticeThe Catholic Bishop of the Diocese of Sokoto, Matthew Kukah, on Thursday, described as criminal, the gruesome murder of Deborah Yakubu, a 200-level Home Economics student of the Shehu Shagari College of Education in Sokoto State.\nMatthew KukahKukah in a statement urged the authorities at all levels to fish out the perpetrators and ensure justice is served on the matter.\nThe female student was mauled, killed and burnt on Thursday by a mob of Muslim youths who accused her of blasphemy against Prophet Muhammad.\nThe police in Sokoto said two suspects had been taken into custody in connection with the student’s killing.\nReacting in a statement, Kukah said the perpetrators no matter their motive must be punished."
  },
  {
    "headline": "FG launches mobile app for sending crime alerts to security agencies",
    "summarized_story": "The federal government has launched the Nigeria internal security and public safety alerts system (NISPSAS) mobile application for sending alerts to security agencies.\nAccording to a statement on Thursday, Rauf Aregbesola, the minister of interior, inaugurated the app at the ministry’s headquarters.\nThe minister said many attacks would have been foiled if the security agencies had been notified in real time, adding that this prompted the development of a platform that the public can use to communicate with security agencies.\n“One noticeable lacuna is information and timely alert of the security agencies to incidents of crimes, breach of security, and natural disasters before they happen or while they are going on.\n“The initiative is in line with President Muhammadu Buhari’s administration’s policy of making the security of lives and property of Nigerians a priority."
  },
  {
    "headline": "FG launches mobile app for sending crime alerts to security agencies",
    "summarized_story": "The federal government has launched the Nigeria internal security and public safety alerts system (NISPSAS) mobile application for sending alerts to security agencies.\nAccording to a statement on Thursday, Rauf Aregbesola, the minister of interior, inaugurated the app at the ministry’s headquarters.\nThe minister said many attacks would have been foiled if the security agencies had been notified in real time, adding that this prompted the development of a platform that the public can use to communicate with security agencies.\n“One noticeable lacuna is information and timely alert of the security agencies to incidents of crimes, breach of security, and natural disasters before they happen or while they are going on.\n“The initiative is in line with President Muhammadu Buhari’s administration’s policy of making the security of lives and property of Nigerians a priority."
  },
  {
    "headline": "Femi Adesina: ASUU strike won't destroy Buhari's legacy... it's an endemic issue",
    "summarized_story": "Femi Adesina, presidential spokesperson, says the strike embarked upon by the Academic Staff Union of Universities (ASUU) will not destroy the “legacy” of President Muhammadu Buhari.\nASUU has been on strike since February 14 over the non-implementation of an agreement reached with the federal government in 2020 — on Monday, the strike was extended for another 12 weeks.\nOn Thursday, Buhari appealed to the union to consider the plight of students and call off the ongoing strike.\nSpeaking in an interview with Channels Television, Adesina said the issue of ASUU strike in the country is an “endemic” matter, which started many years ago, adding that the federal government is committed to ensuring resolutions of the areas of concern.\n“Last week, I saw something on Facebook that alhaji Shehu Shagari was appealing to ASUU to go back to class."
  },
  {
    "headline": "Femi Adesina: ASUU strike won't destroy Buhari's legacy... it's an endemic issue",
    "summarized_story": "Femi Adesina, presidential spokesperson, says the strike embarked upon by the Academic Staff Union of Universities (ASUU) will not destroy the “legacy” of President Muhammadu Buhari.\nASUU has been on strike since February 14 over the non-implementation of an agreement reached with the federal government in 2020 — on Monday, the strike was extended for another 12 weeks.\nOn Thursday, Buhari appealed to the union to consider the plight of students and call off the ongoing strike.\nSpeaking in an interview with Channels Television, Adesina said the issue of ASUU strike in the country is an “endemic” matter, which started many years ago, adding that the federal government is committed to ensuring resolutions of the areas of concern.\n“Last week, I saw something on Facebook that alhaji Shehu Shagari was appealing to ASUU to go back to class."
  },
  {
    "headline": "INEC: Why we may consider options outside CBN for storing 2023 election materials",
    "summarized_story": "The Independent National Electoral Commission (INEC) says it is working on the likelihood that there would be need for alternatives for storing sensitive election materials outside the Central Bank of Nigeria (CBN).\nMahmood Yakubu, INEC chairman, said this on Thursday at a meeting with media organisations on preparations for the 2023 elections.\nYakubu was responding to a question on the implication of Godwin Emefiele, CBN governor, expressing interest in contesting the presidency.\nThere have been concerns over Emefiele’s bid, including issues around the fact that sensitive election materials are usually kept in the CBN.\nThere is a case in court and we have been invited to state our own side of the story."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Interswitch, Africa’s second unicorn, raises $110 million",
    "summarized_story": "The digital payment company is Africa’s second unicorn, and its latest investment will help it to scale digital payment services across the continent.\nFounded in 2002, Interswitch disrupted Nigeria’s cash-driven economy by introducing electronic payments and switching services.\nInterswitch’s last funding round was in 2019 when VISA acquired a 20% stake, valued at $200 million, and helped it become Africa’s second unicorn.\nToday, at a $1 billion valuation, Interswitch is touted as one of Africa’s biggest electronic payments and infrastructure companies.\nThis investment by LeapFrog affirms the formidable talent at Interswitch, and how well-placed it is to seize the significant opportunity in Africa’s evolving digital payments landscape.”Share this article"
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "Does Nigeria have too many fintech startups? What the numbers say",
    "summarized_story": "Share this article:There are at least 150 fintech startups in Nigeria, depending on who you ask.\nStatista reports that there were 144 fintech startups as of 2021 and a 2020 McKinsey report puts the number of standalone fintech startups at over 200.\nConsequently, it is not unusual to hear comments on the proliferation of fintech startups in the country, which begs the question, are there too many fintech startups in Nigeria?\nWhile the United States has 8,775 fintech startups for its 334.6 million people, the United Kingdom has 1,600 fintech startups serving 68.5 million people.\nLooking at the numbers, one could say that we need at least 1,000 more fintech startups in the country."
  },
  {
    "headline": "How do you create connections?",
    "summarized_story": "Also, Chimgozirim discussed this in today’s episode of the Techpoint Africa Podcast.\nIf you don’t recall that, I believe you should remember the report Intelligence by Techpoint, Techpoint Africa’s data and research arm, issued last Wednesday.\n🧐The report shows the breakdown of the $1.3 billion raised by YC-backed African startups — with 51 from Nigeria — details of featured startups, and other information.\nThis time, Emmanuel wants us to consider how YC is changing the game for African startups.\nThe company intends to collaborate with numerous regulatory agencies to create a world-class data security framework for Africa."
  },
  {
    "headline": "[PODCAST] Fintech bonanza",
    "summarized_story": "In today’s edition of the Techpoint Africa Podcast, we decided to weigh in on the debate about Africa having too many fintech startups.\nStill, on fintech, we talk about why buy now pay later (BNPL) services could be bad for young people.\nIt was a fintech podcast as we closed the discussion with the new developments on eNaira.\nFrom paying bills to USSD enabled transactions, we discuss the upsides and downsides of the eNaira upgrade.\nYou can catch all these insightful discussions on the Techpoint Africa Podcast available on all Podcast platforms, including Spotify, Apple Podcasts, and Google Podcasts."
  },
  {
    "headline": "MARA Raises $23M to Build Africa’s Portal to the Crypto Economy",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nMARA Chain – a layer-1 blockchain, powered by the native MARA token, that gives savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nThe MARA Chain will launch later in 2022, giving savvy developers a place to build decentralized applications that will help shape the future of the African crypto economy.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "5 Organisations providing ‘Tech’ and ICT solutions for SMEs in Nigeria",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nSMEDANSmall and Medium enterprise development agency of Nigeria commonly known as SMEDAN, organizes e-business and empowerment training for young entrepreneurs across Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "FG meets ASUU today",
    "summarized_story": "The federal government has finally decided to meet with the Academic Staff Union of Universities (ASUU) and other related bodies to find a way over the lingering industrial action.\nIbrahim Gambari, the chief of staff to the president, and Chris Ngige, the minister for labour and employment are set to meet with the leaders of the striking ASUU today at the Banquet Hall of the Presidential Villa, Abuja.\nBesides, according to one of the chapter leaders of ASUU, the meeting includes members of the Non-Academic Staff Union of Educational and Associated Institutions (NASU) and other registered trade unions in Nigerian universities.\nRead also: ASUU strike: Nigerians not moved by Chukwuemeka Nwajiuba’s resignationMeanwhile, the Senior Staff Association of Nigerian Universities (SSANU) and the Non-Academic Staff Union of Universities and Allied Educational Institutions (NASU) joined some weeks after ASUU commenced its strike.\n“Unfortunately, the government has kept mute and remains indifferent to the demands of the JAC of NASU and SSANU."
  },
  {
    "headline": "‘There will be news soon’, Emefiele says after meeting Buhari",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), Thursday met President Muhammadu Buhari behind closed doors, at the Presidential Villa Abuja and revealed that “there will be news soon”, from him.\nWhen reminded that the international community was anxious about his planned involvement in politics, he responded that he is “ having fun”.\nAt the hearing of the matter on Thursday, both INEC and AGF were in court in line with the court’s order.\nBefore proceeding with the case of the CBN Governor, two lawyers stood up to announce appearances for their clients.\nSpecifically, he argued that by virtue of being a public servant he cannot be barred from participating in the political primaries of political parties by Section 84 (12) of the Electoral Act, 2022."
  },
  {
    "headline": "April inflation seen rising on food, diesel price hikes",
    "summarized_story": "Ahead of the release of the consumer price index report by the National Bureau of Statistics (NBS), analysts have said the inflation rate for April will be higher than the previous month.\nAll the analysts polled by BusinessDay expect inflation rate to inch up as a result of continued rise in food and diesel prices.\nNigeria’s inflation rate rose to 15.92 percent in March 2022, which represented a 0.22 percentage point increase from the 15.7 percent recorded in February 2022, data from the NBS show.\nAyodele Akinwunmi, relationship manager, corporate banking at FSDH Merchant Bank Limited, said inflation rate would likely increase from the current level.\nThe CBN, being the only institution vested with the responsibility to maintain price stability, must address this inflationary tendency,” Adenikinju said."
  },
  {
    "headline": "Obaseki intensifies ongoing construction of Edo agric hub – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government will sustain investment in the agriculture sector in a renewed effort to attain food sufficiency, drive job creation and improve livelihoods.\nThe governor, who spoke to journalists in Benin City, said his government has intensified ongoing construction of the Edo Agricultural Development Hub, reassuring timely completion of the projectThe Edo State Commissioner for Agriculture and Food Security, Mr. Stephen Idehenre, who spoke on behalf of the governor, said the government has also completed the construction of an input warehouse to support agricultural production at the Edo Agricultural Development Hub.\nHe noted that the ongoing construction work on the Edo Agricultural Development Hub comprises administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others.\n“We have also established a Mechanization Hub, and purchased tractors and Harvesters to boost agricultural production and reduce drudgery.”“In addition to these programmes, we are making progress with the construction of the Edo Agricultural Development Hub.\nThe hub will house the administrative building (Ministry, ADP and Donor Project offices), state-of-the-art agricultural processing factory, farm mechanization hub, pig and poultry production prototype buildings, and produce/soil laboratory, among others,” he added."
  },
  {
    "headline": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti election – Nigerian Observer",
    "summarized_story": "Continuous Voters Registration to end soon- INEC …as CSOs charge INEC to do more to improve on the conduct of Ekiti electionShare FacebookTwitterStumbleuponLinkedInPinterestChairman of the Independent National Electoral Commission, INEC, Prof. Mahmood Yakubu has said the on-going continous voters registration exercise nationwide will be ending soon.\nAccording to the chairman, the ongoing Continuous Voter Registration (CVR) exercise will be ending on the 30th June 2022.\nThese Regulations and Guidelines, together with the Constitution and the Electoral Act, constitute the electoral legal framework that govern the conduct of elections.\n“There are many progressive provisions of the Electoral Act 2022 which require clear understanding to guide implementation.\n“Section 54(2) of the Electoral Act makes provision for assistive materials for Persons with Disabilities (PWDs)."
  },
  {
    "headline": "Gov Obaseki committed to special, inclusive education – Edo SUBEB – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Stakeholders in the special education sector have chatted a roadmap with a view to making education available and accessable to every child irrespective of their disability and location in Edo state.\n“His Excellency is absolutely committed to special and inclusive education”, Salami said while describing the workshop as “timely”.\nExecutive Director of NAPVID, Barr Melody Omosah expressed appreciation to the governor for his administration’s partnership with the organization.\nAccording to Omosah, inclusive education is the core of inclusive governance hence NAPVID is working closely with the state government to ensure the mainstreaming of appreciable numbers of persons with disabilities into the public service is achieved.\n“I want to thank Mr governor for the partnership and we are over confident that this will be sustained throughout his term."
  },
  {
    "headline": "Ossiomo Power Company alerts on forceful shut down of gas facility by NGMC – Nigerian Observer",
    "summarized_story": "Ossiomo Power Company alerts on forceful shut down of gas facility by NGMCShare FacebookTwitterStumbleuponLinkedInPinterestOssiomo Power Company has reported a forceful shut down of its gas facility by the Nigeria Gas Marketing Company (NGMC), a subsidiary of the Nigerian National Petroleum Company (NNPC).\nA statement signed by Adeyinka Ladejobi on behalf of the company said the situation has been escalated to the right quarters in order to resolve the matter.\nAccording to him, “We apologize for this unannounced outage.\nThis outage is as a result of a forceful shut down of our gas plant by NGMC without any notice.\n“The situation has been escalated accordingly and we shall keep you posted."
  },
  {
    "headline": "Abia 2023: London-based ICT expert, Ubani joins race for Bende federal constituency",
    "summarized_story": "Theophilus Ubani, who also extends his professional practices to Nigeria and Dubai has joined the race for Bende Federal constituency seat.\nHe is in the race to replace Chief Ben Kalu , who is currently occupying the Bende federal constituency seat and only completing his first tenure at the National Assembly.\nSome stakeholders from Bende federal constituency demonstrated their preference for Ubani when they turned out in their large numbers to witness the purchase of his Expression of Interest and Nomination Forms in Abuja.\nBut Eleer Egu advised Ben Kalu “to seek promotion” to the Senate since the Abia North seat is open for contest.\nThe leader of Bende major stakeholders therefore called on the constituents to support Ubani to achieve total victory at the polls and look then forward to more effective representation come 2023"
  },
  {
    "headline": "2023: Abia royal fathers ask parties to zone guber tickets to Isuikwuato district",
    "summarized_story": "The royal fathers made their position known in a statement titled: “The position and demand of Isuikwuato District in the Abia equation, come 2023”.\nThey lamented that the marginalization of the Isuikwuato district ( comprising Isuikwuato and Umunneochi local governments), represented by the letter ‘I’ in the acronym from which Abia is coined, remains an aberration in Abia politics.\nThe royal fathers, therefore, called on all political parties in Abia to give their governorship tickets to candidates from Isuikwuato district in the spirit of equity, fair play and ‘be your brother’s keeper’ ethos of Igbo cosmology.\nTo make way for the resolution of the power equation, the traditional rulers demanded that “all political parties should zone their gubernatorial positions to the Isuikwuato District of Abia North Senatorial zone in the 2023 governorship election”.\nThis is our time and chance to produce the Governor of God’s Own State 2023,” the royal fathers stated"
  },
  {
    "headline": "Alleged Blasphemy: Police nab suspects over murder of female student in Sokoto",
    "summarized_story": "The Sokoto State police command says it has arrested suspects in connection with the brutal murder of Deborah Samuel, a female student of Shehu Shagari College of Education in the state over alleged blasphemy.\nGiving an update on the development, the Sokoto police spokesman, ASP Sanusi Abubakar, said two of Deborah’s attackers have been arrested, while others are being traced.\n“The school has been closed down by the school authority, and policemen were deployed to give tight security coverage.\n“The Commissioner of Police, Sokoto State Command, CP Kamaldeen kola Okunlola fdc,mnim is appealing to members of the public to go about their lawful activities and should not panic as the situation is under control.\nMeanwhile, the suspects in the viral video on Twitter were spotted and will be nailed soon.”"
  },
  {
    "headline": "EndSARS: Oyetola presents cheques of N53.3m to victims of police brutality in Osun",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Gtate governor, Adegboyega Oyetola on Thursday presented cheques of N53.3 million to 13 victims of police brutality in the state.\nRecall that Governor Oyetola, in compliance with the directive of the federal government, constituted a judicial panel of inquiry to address issues of police brutality in the aftermath of the EndSARS protest in 2020.\nThe presentation of the cheques to the victims was a fulfilment of the financial component of the recommendations of the panel.\n“Today’s event is a further testament to the commitment of our Administration to peace, and the rule of law.\nEarlier in his remarks, the Chairman of the Panel, Justice Akin David Oladimeji extolled Governor Oyetola for deeming it fit to compensate the victims inspite the lean purse of the State."
  },
  {
    "headline": "Productivity Award, Moral Burden To Do More For Nigeria, Govt – SGF",
    "summarized_story": "The Secretary to the Government of the Federation, Boss Mustapha, has said the special Award for COVID-19 conferred on him was a moral burden to do more for the nation and government.\nHe was conferred with the awardat the 19th National Productivity Day and the conferment of the National Productivity Order of Merit Award (NPOM) at the Presidential Villa in Abuja on Thursday.\n“You know, my award is within the category of the Special Award for COVID-19.\nHe called on the government to support pharmaceutical manufacturers to improve access to foreign exchange.\n“If there is a special intervention that the government can do, for local manufacturers particularly, pharmaceutical manufacturers that are improving access to medicines for the ordinary Nigerians."
  },
  {
    "headline": "JUST-IN: Nigerian Female Pilot, 11 Others Die In Plane Crash",
    "summarized_story": "A Nigerian female pilot, Adzuayi Ewuga, has died in a plane crash in Central Cameroon.\nThe late pilot is the second daughter of Senator Solomon Ewuga, a stalwart of the Peoples Democratic Party (PDP) in Nasarawa State and former Minister of State for FCT.\nThe pilot reportedly died with 11 others on board a mini-aircraft belonging to Caverton Aviation Cameroon, when air traffic services lost radio contact, causing the plane to crash.\nCaverton Aviation Cameroon is a subsidiary of Caverton Offshore Support Group based in Lagos, Nigeria, which also controls Caverton Helicopters.\nThe Nigerian sister-carrier also operates a single DHC-6-400 complementing various helicopters providing support for the country’s oil and gas industry."
  },
  {
    "headline": "Navy Donates Boats, Other Equipment To NDLEA’s Marine Wing",
    "summarized_story": "The Nigeria Navy (NN) has donated boats and other operational equipment to the Marine wing of the National Drug Law Enforcement Agency (NDLEA).\nSpeaking at the handover ceremony of the two epenal boats and equipment, the chairman/chief executive of the NDLEA, Brig.\n“We have come to a point where security organisations can longer afford to work in silos.\nIllicit drug trafficking, as a transnational organised crime, requires the deployment of intelligence and close-knit collaboration with key stakeholders like the Nigerian Navy and other security organisations.\nHe expressed appreciation to the Nigerian Navy under the leadership of Vice Admiral Awwal Zubairu Gambo, adding that “I would like to close with the words of Helen Keller: ‘Alone we can do so little."
  },
  {
    "headline": "Navy Donates Boats, Other Equipment To NDLEA’s Marine Wing",
    "summarized_story": "The Nigeria Navy (NN) has donated boats and other operational equipment to the Marine wing of the National Drug Law Enforcement Agency (NDLEA).\nSpeaking at the handover ceremony of the two epenal boats and equipment, the chairman/chief executive of the NDLEA, Brig.\n“We have come to a point where security organisations can longer afford to work in silos.\nIllicit drug trafficking, as a transnational organised crime, requires the deployment of intelligence and close-knit collaboration with key stakeholders like the Nigerian Navy and other security organisations.\nHe expressed appreciation to the Nigerian Navy under the leadership of Vice Admiral Awwal Zubairu Gambo, adding that “I would like to close with the words of Helen Keller: ‘Alone we can do so little."
  },
  {
    "headline": "2023: I Will Be President For All, Says Saraki",
    "summarized_story": "Former Senate President, Dr. Bukola Saraki, has said that if elected in 2023 as the President of Nigeria, he will be President for all, saying he represents a Nigerian identity that is truly diverse, inclusive, and truly Nigerian.\nSaraki disclosed this on Thursday in Abuja during a Breakfast and Media Session titled, “Why I Am Running for President”, organised by Saraki Support Group.\nHe noted that he will be the bridge between the young and the old.\nSaraki said he will also be the bridge between the private sector and the public sector.\nOn his part, the chairman, Saraki Campaign Council, Prof. Iyorwuese Hagher, described the immediate-past Senate President as “a real change maker”, saying if elected as President in 2023, he will restore stability in Nigeria."
  },
  {
    "headline": "Alleged Blasphemy: Police Nab Suspects Over Killing Female College Student In Sokoto",
    "summarized_story": "Two students have been arrested by the police after a female student of the Shehu Shagari College of Education in Sokoto was killed for alleged blasphemy.\nAccording to a statement made by Sanusi Abubakar, Police Public Relations Officer, on behalf of Kamaldeen Kola Okunlola, Commissioner of Police, Sokoto State Command.\n“Students forcefully removed the victim from the security room where she was hidden by the school authorities, killed her and burnt the building.\n“The Commissioner of Police, Sokoto State Command, CP Kamaldeen Kola Okunlola is appealing to members of the public to go about their lawful activities and should not panic as the situation is under control.\n“Meanwhile, the suspects in the viral video on Twitter were spotted and will be nailed soon,” the statement added."
  },
  {
    "headline": "EndSars: Osun govt compensates Police brutality victims, presents cheques of N53,290,000.00",
    "summarized_story": "The Government of Osun on Thursday presented cheques of N53,290,000.00 as compensation to victims of police brutality in the State.\nThe State Governor, Adegboyega Oyetola, affirmed that the motive was a deliberate quest to redress the wrongs of yesterday and set the State on the path of true healing.\nGovernor Oyetola, in compliance with the directive of the Federal Government, constituted the Judicial Panel of Inquiry against Police Brutality, Human Rights Violations and Related Extra Judicial Killings.\nJustice Oladimeji-led Judicial Panel of Inquiry against Police Brutality, Human Rights Violations and Related Extra Judicial Killings for their impeccable services to the State”, he said.\nEarlier in his remarks, the Chairman of the Panel, Justice Akin David Oladimeji, extolled Governor Oyetola for deeming it fit to compensate the victims despite the lean purse of the State."
  },
  {
    "headline": "Mushe (XMU) and Fantom (FTM): Why Analysts Say You Should Buy and Hold",
    "summarized_story": "Analysts have recommended buying and holding two crypto tokens, Mushe (XMU) and Fantom (FTM), and here’s why.\nBoth Fantom and Mushe can quickly and efficiently process thousands of transactions within seconds while scaling to thousands of nodes in no time.\nInvestors will find Mushe and Fantom easier to invest in because of their compatibility with different platforms.\nAccording to analysts, Mushe and Fantom have all the right features that will keep their tokens useful and valuable for the foreseeable future.\nThose interested in purchasing Mushe tokens are encouraged to sign up to receive more information at www.mushe.worldLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Telegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_World"
  },
  {
    "headline": "Tears flow as veteran actor, Gbenga Richards reportedly dies",
    "summarized_story": "Popular Nollywood actor, Gbenga Richards has reportedly died.\nAccording to reports, the veteran thespian died on Thursday after battling with an illness, which is at the moment yet to be ascertained, for a long time.\nLast year, some of his colleagues had appealed to the public to help donate funds to help save the actor who was battling with an illness.\nThe veteran actor is well known for his actions scenes and had contributed greatly to the growth and advancement of Nollywood.\nFemi Adewale, a popular media personality and Tv Director broke the sad news of his friend’s passing on his social media page."
  },
  {
    "headline": "Ƙasar Sin na tallafa wa gina “ganuwar bishiyoyi a Afirka”",
    "summarized_story": ""
  },
  {
    "headline": "NATO—Makamin neman babakere a duniya",
    "summarized_story": ""
  },
  {
    "headline": "Duniya na buƙatar haɗin gwiwar daƙile manyan matsalolin da bil Adama ke fama da su",
    "summarized_story": ""
  },
  {
    "headline": "Buhari ya roƙi ASUU ta janye yajin aikinta",
    "summarized_story": ""
  },
  {
    "headline": "Female Student Killed, Burnt In Sokoto Over Alleged Blasphemy",
    "summarized_story": "A female student of the Shehu Shagari College of Education has been killed and burnt in Sokoto by irate youths.\nAccording to the police, Deborah Samuel, a level-two student, was accused of making a social media post that blasphemed the holy prophet Muhammad (SAW).\nThe police said the students forcefully removed the victim from the security room where she was hidden by the school authorities, killed her and burnt the building.\nVideos on social media show men stoning and flogging a motionless body draped in red attire.\nThe police also vowed that the suspects in the viral video on Twitter were spotted and will be nailed soon."
  },
  {
    "headline": "2023: ‘I Am Having Fun’ – Emefiele Laughs Off Anxiety Over Presidential Ambition",
    "summarized_story": "﻿The Governor of the Central Bank of Nigeria, Godwin Emefiele, on Thursday laughed off the anxiety associated with his presidential ambition ahead of the 2023 general elections, saying he is having fun.\nREAD ALSO: SGF Directs Emefiele, Heads Of Agencies, Others With Political Ambition To ResignCondemnations had trailed his move to contest in the 2023 presidential election on the All Progressives Congress (APC) while presiding over the apex bank.\nAdamant about his presidential ambition, he approached the Federal High Court in Abuja on Monday.\nMeanwhile, the Secretary to the Government of the Federation (SGF), Boss Mustapha, has directed the Central Bank Governor, Godwin Emefiele, ambassadors, heads of agencies, and other government appointees with political ambition to step down.\nIn a circular issued on Wednesday, the directive affected the CBN Governor who is among the heads of extra-ministerial departments."
  },
  {
    "headline": "Consider Students’ Plight And Call Off Strike, Buhari Appeals To ASUU",
    "summarized_story": "President Muhammadu Buhari has appealed to the Academic Staff Union of Universities (ASUU) to consider the plight of students and call off its ongoing strike.\nHe made the appeal at the 19th National productivity day and conferment of the National Productivity Order of Merit award held on Thursday.\nBuhari’s appeal came two days after the union extended its industrial action, accusing the government of unwillingness to address its demands.\nDuring Thursday’s event at the State House, President Buhari conferred the 2019/2020 awards on 37 individuals and 11 organizations.\nREAD ALSO: Buhari Orders FEC Members With Political Ambitions To ResignSo far, three-hundred and eighty-two individuals and 97 organizations have been awarded since the ceremony began in February 1991."
  },
  {
    "headline": "SGF Directs Emefiele, Heads Of Agencies, Others With Political Ambition To Resign",
    "summarized_story": "The Secretary to the Government of the Federation (SGF), Boss Mustapha, has directed the Central Bank Governor, Godwin Emefiele, ambassadors, heads of agencies, and other government appointees with political ambition to step down.\nIn a circular issued on Wednesday, the directive affected the CBN Governor who is among the heads of extra-ministerial departments.\nThe SGF noted that those affected should hand over to the most senior persons next to them.\nNine ministers, who are seeking political offices, both at the federal and state levels, were affected.\nMinister of State for Education, Emeka Nwajiuba, was the first to resign, hours after the President’s directive."
  },
  {
    "headline": "Spurs Crush 10-Man Arsenal To Keep Top-Four Bid Alive",
    "summarized_story": "Harry Kane scored twice as Tottenham beat 10-man Arsenal 3-0 on Thursday with a north London derby masterclass that kept alive their hopes of finishing in the Premier League’s top four.\nBut Kane tormented Arsenal once again as the Tottenham striker opened the scoring with a controversial penalty.\nBut their victory in arguably the biggest north London derby since Arsenal won the league at White Hart Lane in 2004 ensured that miracle could still come true.\nArsenal surrounded Tierney to complain angrily, but Kane stepped up to send Aaron Ramsdale the wrong way with a nerveless spot-kick.\nRamsdale made fine saves from Emerson Royal and Kane to stop Arsenal being completely humiliated, but the damage had already been done."
  },
  {
    "headline": "Alleged Blasphemy: Police arrests two in connection with death of female student in Sokoto",
    "summarized_story": "Sokoto state Police command said two persons have been arrested in connection to the killing of a student of Shehu Shagari college of Education, Sokoto over allegation of blasphemy.\nAccording to the Command’s public relations officer, ASP Sanusi Abubakar, an investigation has begun to determine the root cause of the violence.\nAccording to the police, the students banded together with miscreants and barricaded the Sokoto/Jega road.\nThe Commissioner of Police, Sokoto State Command, Kamaldeen kola Okunlola, has urged members of the public to continue with their lawful activities and not to panic because the situation is under control.\nMeanwhile, the suspects in the viral Twitter video have been identified and will be apprehended soon."
  },
  {
    "headline": "Photos: Gambari leads as FG reopens negotiation with ASUU",
    "summarized_story": "The Chief of Staff to President Muhammadu Buhari, Ibrahim Gambari, has appealed to striking university workers to shelve their industrial actions while negotiations continue.\nIn his opening remarks at the resumed talks with striking university teachers, the Presidential Aide said it is regrettable that academic calendar can no longer be predicted in public universities.\nCo-chair at the meeting, the Sultan of Sokoto, also pleaded with the university workers to return to their desks so that the students can be meaningfully engaged, especially ahead of the 2023 elections.\nHe fears idle hands may be used by desperate politicians to forment crisis ahead the elections.\nBoth men agreed it would be dangerous to allow students remain idle for another three months."
  },
  {
    "headline": "Eyewitnesses refute Israeli claims of 'lack of clarity' in Aljazeera reporters' death",
    "summarized_story": "Shireen Abu Akleh, a Palestinian-American journalist and Aljazeera reporter, was given an official funeral on Thursday at the Palestinian Authority’s headquarters in Ramallah.\nShireen Abu Akleh was killed by Israeli forces on Wednesday while covering an Israeli military raid in the Jenin refugee camp.\nShatha Hanayshah, a young Palestinian journalist based in Jenin, was with Abu Akleh when she was shot.\nThis is when the journalists were fired at from the south, where the IOF were situated,” it said.\nThe UN condemned Shireen Abu Akleh’s murder on Wednesday, saying it was “appalled” by her death and calling for “an independent, transparent investigation into her death.”"
  },
  {
    "headline": "NCC,FIRS inaugurate joint c'mittee to boost telecoms revenue",
    "summarized_story": "The Nigerian Communications Commission (NCC) and the Federal Inland Revenue Service (FIRS) have stepped up their collaboration by forming a Joint Committee comprised of senior and management staff from both agencies to implement inter-agency strategies aimed at increasing national revenues in the telecommunications sector.\nAdeleke Adewolu, Executive Commissioner, Stakeholder Management at the NCC, inaugurated the 17-member committee on behalf of the Commission’s Executive Vice Chairman, Prof. Umar Danbatta, and the Executive Chairman of the FIRS, Mr. Muhammad Nami, on Tuesday, May 10, 2022, at the NCC’s Board Room in Abuja.\nDr. Dick Irri, who led the FIRS delegation to the inauguration, also advised the Committee to take the assignments seriously.\nThe decision to establish the Committee was one of the major outcomes of a meeting between the FIRS and the NCC on March 8, 2022, convened at the request of the Honourable Minister of Communications and Digital Economy, Prof. Isa Ali Pantami, to discuss the FIRS’s request for data and documents from the telecoms industry in order to increase national revenues from the sector.\nThe inauguration is a significant accomplishment because it strengthens the strategic partnership between the two government agencies in achieving their statutory goals."
  },
  {
    "headline": "‘Having Fun’: CBN Governor Emefiele Meets Buhari, Says Critics Can ‘Have Heart Attack’ Over Alleged Presidential Bid",
    "summarized_story": "Central Bank of Nigeria Governor Godwin Emefiele on Thursday met with President Muhammadu Buhari at the State House, Abuja.\nThe meeting, held behind closed-doors, was barely 24 hours after the President asked all political appointees seeking elective positions to resign by Monday, May 16, 2022.\nAccording to him: “Let them have heart attack, its good to have heart attack.\nHe submitted that Constitutional provisions stipulated that he can only resign his appointment as Governor of CBN 30 days to the presidential election which he is interested in contesting.\nNo.SGF/OP/l/S.3/Xll/173, a copy which was sighted by THISDAY, was issued by the Secretary to the Government of the Federation, Mr Boss Mustapha."
  },
  {
    "headline": "Buhari’s Resignation Order – Trending With Ojy Okpe",
    "summarized_story": ""
  },
  {
    "headline": "Finland Seeks NATO Membership ‘Without Delay’",
    "summarized_story": "The decision by the two Nordic countries to abandon the neutrality they maintained throughout the Cold War would be one of the biggest shifts in European security in decades.\nThey are the two biggest EU countries that had stayed out of NATO, and Finland’s 1,300-km (800-mile) border will more than double the frontier between the U.S.-led alliance and Russia, putting NATO guards a few hours’ drive from the northern outskirts of St Petersburg.\n“Finland must apply for NATO membership without delay,” President Sauli Niinisto and Prime Minister Sanna Marin said in a joint statement in Helsinki.\n“We hope that the national steps still needed to make this decision will be taken rapidly within the next few days.”Five diplomats and officials told Reuters that NATO allies expect both countries to be granted membership quickly, paving the way for increased troop presence in the Nordic region to defend them during a one-year ratification period.\nThe announcement came even as Russia’s war in Ukraine was hitting another turning point, with Ukrainian forces driving Russian troops out of the region around the second largest city Kharkiv, their fastest advance since forcing Russia to withdraw from the capital and northeast more than a month ago."
  },
  {
    "headline": "Nigeria Insists on Right to Produce Head of West African Gas Authority",
    "summarized_story": "RelatedStories No Content AvailableNigeria’s federal government has insisted that it wasn’t in breach of any part of the treaty setting up the West African Gas Pipeline Authority (WAGPA) by the selection of a Nigerian to head the organisation.\nWAGPA is an international institution established by the treaty on the West African Gas Pipeline (WAGP) Project signed by the Heads of States of the Republics of Benin, Ghana, Nigeria and Togo.\nHe called for the understanding of member nations, urging them to stick to the rules setting up the body.\n“ But if section 4(2) of Article IV of the Treaty is to the effect that Nigeria is qualified, then, there need not to be further objection against what section 4(2) of Article IV of the Treaty plainly stated,” he argued.\nShe affirmed that she was aware of the sentiments that over-regulation could bring discouragement and be counterproductive , but said that the regulations fashioned out for WAGP Project were amendable where they become counterproductive."
  },
  {
    "headline": "Former Nigeria President Jonathan Appointed to Board of European Council on Africa, Middle East",
    "summarized_story": "RelatedStories No Content AvailableNigeria’s former President, Dr. Goodluck Ebele Jonathan has been appointed to the international advisory board of the European Corporate Council on Africa and the Middle East (ECAM Council).\nOther members of the Advisory board are: Tony Blair, former British Prime Minister, José Manuel Barroso, former President of the European Commission, Nayef Falah Al-Hajraf, Secretary General GCC Gulf Cooperation Council and Amani Abou-Zeid, Commissioner for Infrastructure and Energy at the African Union Commission (AUC).\nIt quoted a letter from ECAM Council to the Office of Jonathan informing him of the appointment to have stated: “For your information, the Chairman of ECAM Council Dr. Kamel Ghribi is well acquainted with Dr. Goodluck Ebele Jonathan.\nEvery year in Italy, ECAM Council hosts a summit, in cooperation with The European House – Ambrosetti.\nFrancis Sardauna in Katsina"
  }
]