[
  {
    "headline": "Road worthiness: Lagos reviews process, introduces booking system",
    "summarized_story": "Following the assessment of the ‘No Vehicle Inspection, No Road Worthiness Certificate’ Policy which commenced in January 2022, the Lagos State Government has introduced a Booking System to stem the surge recorded at some vehicle inspection centres.\nExplaining the amendment made on the procedure of receiving a Roadworthiness Certificate in the State, the Commissioner for Transportation, Dr. Frederic Oladeinde, stated that the vehicle inspection will now be based on scheduled appointments.\nThe commissioner affirmed that public transport owners are not left behind in the new policy regime as some have had their vehicles already checked.\n“Vehicle Inspection Officers are also engaging other commercial drivers at various motor parks for vehicle checks to further reduce convergence of vehicles at the inspection test centres,” he said.\nHe also stated that the State Government is ramping up consultation with private partners with vehicle inspection facilities to increase the present existing 27 centres spread across the State, with five more mobile test centres already on the way."
  },
  {
    "headline": "Buhari condoles with Murray-Bruce family over mother’s demise",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has extended heartfelt condolences to the Murray-Bruce family on the passing of their mother and matriarch, Margaret Murray-Bruce, aged 95.\nBuhari’s condolence message is contained in a statement signed on Wednesday by his Senior Special Assistant on Media and Publicity, Garba Shehu, titled ‘President Buhari condoles with Murray-Bruce family on mother’s death’.\n“The President urges Ben Murray-Bruce, Founder Silverbird Group, Francis Murray-Bruce, and Guy Murray-Bruce, President, Silverbird Group and Chairman, Independent Broadcasters Association of Nigeria and other members of the Murray-Bruce family to find inspiration from Mama’s legacy, particularly her example of decency and always looking out for the best in others.”Buhari, therefore, prayed for the repose of the soul of the departed and comfort for the loved ones that mourn.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Importers raise alarm over private jetties operating illegally as container terminals",
    "summarized_story": "The President of the association, Godwin Onyekazi, said some private jetties operating on the Kirikiri channel and oil service facilities now engage in handling containers.\n“Only port operators, concessioned by the Federal Government through NPA can engage in container handling operations.\n“The jetties in question are now illegally operating as container terminals.\nWho licensed the jetties as container terminals?\nCan you then imagine what will be happening in jetties that do not have strong regulatory and security mechanisms?"
  },
  {
    "headline": "Confession against Prophet Jeremiah Fufeyin of Mercyland fake, says Aide",
    "summarized_story": "Spokesperson for Christ Mercyland Church in Warri, Delta State, Moses Akpotiti has described as false allegations by some Pastors that they help fake miracles for the Founder of the church, Billionaire prophet, Jeremiah Fufeyin.\nAkpotiti, in a statement, said the founder of Christ Mercyland church in Warri has been dragged by some pastors in a libelous confession by another pastor of a church in Warri.\nHe said the pastor, the principal suspect, who is behind the plot is currently being investigated by the Nigerian Police and asked to produce the others over character assassination and blackmail against Prophet Jeremiah Fufeyin of Mercyland.”Akpotiti told journalists in the statement that yet another pastor, names withheld, had allegedly connived with the principal suspect to instigate the public and blackmail Fufeyin.\nHe said, “There were indications that the third pastor had been referred to as a son by the principal suspect during his last birthday when former sent him birthday wishes on Facebook.”Akpotiti insisted that “Prophet Fufeyin would not be distracted by blackmailers who have been working hard to tarnish his good name.”He added that “the prophet would not succumb to publicity and would continue to fulfil the mandate of God on earth while supporting the public in every way possible.” The third pastor could not be reached as at press time.\nVANGUARD NEWS NIGERIA"
  },
  {
    "headline": "NASU, SSANU suspend strike in Okpara varsity",
    "summarized_story": "…Want FG to clear air over ministry in charge of universities of agricultureBy Steve OkoFull academic activities have resumed at the Michael Okpara University of Agriculture Umudike, MOUAU, as members of the Non-Academic Staff Union, NASU; and Senior Staff Association of Nigeria Universities, SSANU of the university ended their one-week warning strike.\nA staff who pleaded anonymity lamented that the non-constitution of the Governing Council of the university had affected workers’ welfare especially the ratification of promotions since 2019.\n“This inefficiency or neglect on the part of the Federal Government has put MOUAU into disarray”, the staff lamented.\nHe appealed to the federal government to quickly reconstitute the governing council, and to put paid to the needless squabble between over which federal ministry that is in charge of universities of agriculture.\nThe staff commended the Professor Maduebibisi Ofo Iwe -led management team for its efforts to keep the university on the right pedestrian despite the daunting challenges."
  },
  {
    "headline": "I won’t be surprised if Buhari fails to sign amended electoral bill – Ohuabunwa",
    "summarized_story": "By Steve OkoSenator Mao Ohuabunwa has said that he would not be surprised if President Muhammadu Buhari, declines his assent to the amended Electoral Bill transmitted to him Monday by the National Assembly.\nOhuabunwa stated this while fielding questions from newsmen after his consultation with Peoples Democratic Party, PDP, stakeholders from Arochukwu/Ohafia federal consituency at the Ohafia Council headquarters.\n” It’s not about Mao Ohuabunwa; it’s all about Arochukwu/Ohafia federal constituency which I was privileged to be the first representative.\nFormer member, Ohafia State constituency, Hon.\nOnyema Agbai; PDP State Publicity Secretary, Love Ezema; among others."
  },
  {
    "headline": "Solid Minerals: Why we’re collaborating with Indian mining company – Asuquo",
    "summarized_story": "By Gabriel EwepuAS Federal Government woos investors into the minerals and mining sector, the Director General and Chief Executive, National Metallurgical Development Centre, NMDC, Prof Linus Asuquo, said collaboration with the an Indian mining company, Diamond Aggregate Mining Limited is to boost foreign exchange for Nigeria.\nHe also expressed optimism that with productive collaborations with reliable foreign investors the expected dramatic improvement in the sector will happen and that would boost the nation’s foreign exchange earnings.\nHowever, he said the Centre does not collaborate with companies that are exploitative rather synergize with corporate organizations of high pedigree and whose collaboration is symbiotic.\nHowever, he urged the Indian firm to go through due process to get the required documents that would certify it for mining operations by the Nigerian government through the Mining Cadastre Office, MCO, in order to operate legally including exporting solid minerals.\nEarlier, explaining their choice of NMDC for collaboration, the consultant to the Indian firm, Engr Marcus Oche, said that the partnership was borne out of years of research on the activities and viability of the Centre in terms of minerals research and development."
  },
  {
    "headline": "Banditry: North gets respite only when Buhari visits – Shehu Sani",
    "summarized_story": "DAILY POST reports that parts of the region, mostly Kaduna and Niger states, have continued to boil following attacks on communities by the assailants.\nRecall that the Kaduna State Government yesterday said bandits killed a total number of 1,192 and abducted 3,348 people in the state in 2021.\nAccording to the commissioner, the Southern Kaduna Senatorial District recorded 406 deaths following the activities of the armed bandits in the area.\nSenator Shehu Sani stated this in a tweet on his official Twitter handle on Wednesday.\nHe said, “Bandits continue to kill in Kaduna, Niger and other states in the North West; the only time respite comes is whenever the president visits”."
  },
  {
    "headline": "Insecurity: Oyo Governor, Makinde meets Abiodun in Ogun",
    "summarized_story": "Governor Seyi Makinde of Oyo State and his Ogun State counterpart, Governor Dapo Abiodun, met in Abeokuta over the rising spate of kidnapping, robbery and other security challenges affecting the states.\nMakinde arrived at the Presidential Lodge, Ibara Housing Estate, Abeokuta, where he was received by Abiodun and other top government functionaries around 11 am.\nThe two governors thereafter went into a meeting to discuss the need for an Ogun-Oyo joint security arrangement.\nAs they both meet to deliberate on critical security issues that affect the two states, it is expected that a Memorandum of Understanding (MoU) would be signed to secure the Ogun-Oyo corridors and frontiers."
  },
  {
    "headline": "‘Stop mocking leprosy victims’ – PHIN blasts Oyedepo for threatening pastors’ critics",
    "summarized_story": "The Purple Hope Initiative Nigeria (PHIN) has decried a comment by Living Faith Church Founder, Bishop David Oyedepo.\nThe body told Oyedepo that leprosy, also known as Hansen’s disease, is not what should be used as a threat or curse.\n“More than 200,000 people are diagnosed with Hansen’s disease each year, and there are believed to be more than two million individuals affected by Hansen’s disease who are undiagnosed and untreated.\n“Hansen’s disease is caused by bacteria and is curable with an antibiotic regimen called multi-drug therapy.\n“People who have experienced Hansen’s disease deserve to live dignified and respectable lives."
  },
  {
    "headline": "Unknown gunmen raid ASUU chairman’s house in Zamfara, kidnap six",
    "summarized_story": "Some yet-to-be identified gunmen have attacked the residence of Mr Abdurrahman Adamu, Chairman of the Federal University of Gusau chapter, Academic Staff Union of Universities, ASUU.\nDAILY POST learnt that the incident, which occurred on Wednesday morning, led to the abduction of at least six persons, including Adamu’s neighbour.\nThe gunmen, who invaded the chairman’s home in Damba Quarters, an outskirt of Gusau, the Zamfara State capital, were reportedly shooting sporadically before whisking the victims away to an unknown destination.\nIt was gathered that the ASUU Chairman did not sleep in his house on Tuesday night when the assailants raided the apartment.\nEfforts by DAILY POST to reach the Zamfara State Police Public Relations Officer, Muhammed Shehu for comment were unsuccessful as of press time."
  },
  {
    "headline": "Securing Nigeria duty of all tiers of government – Oyo Senator, Balogun",
    "summarized_story": "A member of the National Assembly, Dr Kola Balogun, has said that it is the duty of all tiers of government to protect the lives and property of all citizens in the country.\nBalogun, who represents Oyo South Senatorial District, made this disclosure while speaking in Igboora, in Ibarapa Central Local Government Area of the state on Tuesday.\nOur correspondent recalls that Nigeria has been battling with various cases of kidnapping, terrorism and Boko Haram insurgency for the past few years.\nBalogun, while addressing the audience, said that it is the duty of all the three tiers of government, federal, state and local government to provide security for all the citizens.\n“Securing Nigeria is a duty of all tiers of government."
  },
  {
    "headline": "Dakup wins APC ticket for Pankshin South bye-election",
    "summarized_story": "Ezra Dakup has emerged winner of the All Progressives Congress (APC) primary for Pankshin South constituency bye-election into Plateau Assembly.\nThe election was held at the Pankshin South Constituency zonal office Longkat in a peaceful atmosphere.\nThe Commissioner also called on people of Pankshin South to come out on February 26 to support the candidate of the party to emerge victoriously.\nChairman of Pankshin Local Government Council, Audu Kak’mena described the exercise as peaceful and called on people of the area to continue to support the administration of Governor Simon Lalong to enable him to succeed.\nAPC Chairman Pankshin Local Government Area, Tanimu Shikmut commended the maturity exhibited by the delegates and the party faithful expressing optimism that the party will emerge victorious during the secondary elections."
  },
  {
    "headline": "Anambra: Appeal Court reserves judgment in appeals by Andy Uba, APC",
    "summarized_story": "The Court of Appeal in Abuja has reserved judgment in two appeals seeking to set aside the December 20, 2021 judgment of the Federal High Court, Abuja voiding Andy Uba’s participation in the last governorship election in Anambra State as the candidate of the All Progressives Congress (APC).\nMagaji, while adopting the appellant’s briefs, prayed the court to allow the appeal and set aside the earlier judgment by the Federal High Court, Abuja.\nLawyer to Moghalu, Chris Uche (SAN) also adopted the first respondent’s brief and prayed the court to dismiss the appeal and uphold the judgment of the Federal High Court.\nIn the second appeal, marked: CA/A/CV/36/2022 filed by Uba, appellant’s lawyer, Abdullahi Aliyu urged the court to allow the appeal and reject their earlier judgment of the Federal High Court, Abuja.\nHe also urged the court to uphold the earlier judgment by the Federal High Court."
  },
  {
    "headline": "I am frantically praying for a daughter-in-law, says Kiddwaya’s mom",
    "summarized_story": "Susan Waya, the mother of Ex-Big Brother Naija season 5 Lockdown star, Terseer Waya, popularly known as Kiddwaya has said she needs a daughter-in-law.\nThe billionaire mother, who shared the post to celebrate her first son Tersoo Terry Waya Jr, who is Kiddwaya’s elder brother, said Tersoo will turn 31 on February 4th.\n- Advertisement -She added that she needs to see her daughter-in-law because she and her husband, Terry Waya, are ageing gracefully.\nNow am frantically praying 4 a daughter in law…@terrywaya parents growing old gracefully…,” Susan posted.\nAlongside her post, Susan attached a video of herself, making a selfie video with Kidd’s older brother and her first child, Tersoo."
  },
  {
    "headline": "BREAKING: Court denies jurisdiction on suit by Aregbesola’s loyalists",
    "summarized_story": "Justice Emmanuel Ayoola said the suit brought before the court was strictly party affairs, which the court lacks jurisdiction on the matter.\nHe said: “The claims of the plaintiffs are to draw the court to the internal affairs of the party which is not enshrined in the constitution.\nRead Also: Heavy security as Court rules over suit challenging Osun APC congress“Supreme Court has said court can’t interfere with the internal issue of the party unless it falls under Section 87(9) of the Electoral Act.\n- Advertisement -“The plaintiffs are not qualified to be called aspirants in the said congress.\nThe case of the suit of covered by the law and can’t be adjudicated by the court.”Details shortly…"
  },
  {
    "headline": "Two die as fuel tanker explodes on Lagos-Ibadan expressway",
    "summarized_story": "The multiple accidents, which occurred around 6.05a.m, involved Mack truck, Howo Sino truck, a mini truck and Bajaj motorcycle – with all of them having no registration numbers.\nOperatives of the Federal Road Safety Corps(FRSC) and Fire Service were seen battling to contain the fire, rescue victims and clear road obstructions.\nSuperintendent Route Commander Florence Okpe, who is the FRSC Public Education Officer for Sector Commander, Ogun Sector Command, Umar Ahmed, attributed the likely cause of the multiple crashes to speed on the part of one of the trucks.\nThe Federal Road Safety Corps (FRSC), Ogun State sector Command attributed the likely cause of the accident to road obstruction and speed.\nShe explained that the injured victims were taken to General hospital Isara while the female corpse was deposited at FOS Ipara."
  },
  {
    "headline": "Sylva Doubts Nigeria’s Petrol Consumption Figures, Says Numbers Crazy, Opaque",
    "summarized_story": "•Elumelu raises concerns over $4bn oil theft, insists its national disgraceJames Emejo and Emmanuel Addeh in AbujaThe Minister of Petroleum Resources, Mr Timipre Sylva, yesterday expressed doubts over Nigeria’s daily petrol consumption figures, describing them as crazy and opaque.\nI mean, when they tell you 90 million litres a day, I mean, they’re crazy figures.\n“We continue to interrogate these figures because we all know that there is a problem here, it’s opaque .\n“I know when people say the figures are… I mean, we agree that the figures are all opaque.\nBut we should just sit down and interrogate that subsidy, subsidy price and see what we are paying for it and what’s in the landing costs."
  },
  {
    "headline": "Attempted Coup in Guinea-Bissau Sends Jitters Across Africa",
    "summarized_story": "It was also learnt that Sissoco Embalo held an extraordinary cabinet meeting at around 10 a.m., entering the building with a heavy security detail.\nThe West Africa region has been mired by military take-over in the last 18 months with military take over in Mali, Guinea and Burkina Faso.\nGuinea-Bissau is not new to coup d’etat as for decades, there has been history of nine coups or attempted coups since independence from Portugal in 1974.\nThe ECOWAS Monitoring Group (ECOMOG) which some analysts are calling for, was a West African multilateral armed force established by the sub-regional body.\nECOMOG had been described as the first credible attempt at a regional security initiative in Africa.. Its establishment was spearheaded by Nigeria’s then military President, Ibrahim Babangida."
  },
  {
    "headline": "To Stem HIV Tide, Buhari Launches N62bn Trust Fund to Fight Disease",
    "summarized_story": "The fund would also help to place more people living with the Human Immunodeficiency Virus (HIV) on treatment annually.\nChief Launcher and Chairman/Chief Executive Officer of Dangote Group, Alhaji Aliko Dangote, promised strong support for the private sector-led fund.\nSpeaking at the launch of the HIV Trust Fund of Nigeria (HTFN), Buhari pledged that his administration would continue to prioritise health interventions to address killer diseases and public health emergencies.\nWe have continued to make good our commitment of placing more people living with HIV on treatment annually using national resources.\nHe said within the last three years, the agency had identified and placed on treatment an additional 900,000 persons living with HIV, bringing the total number of Nigerians on HIV treatment to 1.7 million."
  },
  {
    "headline": "FG Approves Resumption of Emirates Flight Operations to Nigeria",
    "summarized_story": "The federal government has given approval for Dubai-based Emirates Airlines to resume flight operations to Nigeria anytime, just as Air Peace has indicated that it would resume operations to Dubai from March 1, 2022.\nThis was contained in a letter written by the Nigerian Civil Aviation Authority (NCAA) and addressed to His Excellency, Saif Mohammed Al Suwaid, Director General, UAE General Civil Aviation Authority dated February 1, 2022 with reference: NCAA/DG/CCAA/20/16/119.\nThe letter stated, “Nigerian Civil Aviation Authority extends its compliments to the General Civil Aviation Authority of United Arab Emirates.\n“Consequently, Emirates Airlines can resume scheduled passenger flight operations to Nigeria at its convenience.\nEarlier, Nigeria and UAE had settled impasse occasioned by disagreement over conduct of COVID-19 tests, and later disagreement over flight slots."
  },
  {
    "headline": "MTN’s Public Offer Oversubscribed by 139.47%",
    "summarized_story": "Emma OkonjiThe Series 1 offer for sale of 575 million shares held by the MTN Group in MTN Nigeria (the Offer) to Nigerian investors, which held last December, has been successfully completed and was oversubscribed by 139.47 per cent, which is an additional 82.25 million MTN Nigeria shares.\nThe oversubscription raised the initial number of shares sold from 575 million to a total of 661.25 million shares.\nThe Offer was implemented by way of a bookbuild to qualified institutional investors and a fixed price offer of N169.00 per share to retail investors.\nFollowing the successful completion of the Offer, MTN Group’s shareholding in MTN Nigeria reduced by 3.25 percentage points, from 78.83 per cent to 75.58 per cent.\nIn all, 661.25 million MTN Nigeria shares were allotted."
  },
  {
    "headline": "EXCLUSIVE: How Akwa Ibom Governor Spent Tax Payers’ Money To Get Endorsement For ‘Anointed Successor’",
    "summarized_story": "Following the controversial unveiling of Pastor Umo Eno as the \"preferred successor\" by the Akwa Ibom State Governor, Udom Emmanuel, there is currently disquiet in the state as more facts emerged on how the endorsement deal was brokered and sealed.\nA member of the House of Representatives and governorship aspirant, Luke Onofiok, had reportedly stormed out of the meeting, denouncing the endorsement.\nSee Also Politics Anger In Akwa Ibom As Governor Emmanuel ‘Anoints’ Preferred SuccessorIt was gathered that the governor allegedly also financially induced former Governor Attah to lead the move for the controversial endorsement.\n“The former governor accepted the offer and agreed to lead the delegation to the meeting,” another source said.\nSaharaReporters had on September 24, 2021 reported how the governor also lavished tax payers’ money on the thanksgiving service in honour of Eno as his candidate in the 2023 general election."
  },
  {
    "headline": "EXCLUSIVE: How Akwa Ibom Governor Spent Tax Payers’ Money To Get Endorsement For ‘Anointed Successor’",
    "summarized_story": "Following the controversial unveiling of Pastor Umo Eno as the \"preferred successor\" by the Akwa Ibom State Governor, Udom Emmanuel, there is currently disquiet in the state as more facts emerged on how the endorsement deal was brokered and sealed.\nA member of the House of Representatives and governorship aspirant, Luke Onofiok, had reportedly stormed out of the meeting, denouncing the endorsement.\nSee Also Politics Anger In Akwa Ibom As Governor Emmanuel ‘Anoints’ Preferred SuccessorIt was gathered that the governor allegedly also financially induced former Governor Attah to lead the move for the controversial endorsement.\n“The former governor accepted the offer and agreed to lead the delegation to the meeting,” another source said.\nSaharaReporters had on September 24, 2021 reported how the governor also lavished tax payers’ money on the thanksgiving service in honour of Eno as his candidate in the 2023 general election."
  },
  {
    "headline": "EXCLUSIVE: How Akwa Ibom Governor Spent Tax Payers’ Money To Get Endorsement For ‘Anointed Successor’",
    "summarized_story": "Following the controversial unveiling of Pastor Umo Eno as the \"preferred successor\" by the Akwa Ibom State Governor, Udom Emmanuel, there is currently disquiet in the state as more facts emerged on how the endorsement deal was brokered and sealed.\nA member of the House of Representatives and governorship aspirant, Luke Onofiok, had reportedly stormed out of the meeting, denouncing the endorsement.\nSee Also Politics Anger In Akwa Ibom As Governor Emmanuel ‘Anoints’ Preferred SuccessorIt was gathered that the governor allegedly also financially induced former Governor Attah to lead the move for the controversial endorsement.\n“The former governor accepted the offer and agreed to lead the delegation to the meeting,” another source said.\nSaharaReporters had on September 24, 2021 reported how the governor also lavished tax payers’ money on the thanksgiving service in honour of Eno as his candidate in the 2023 general election."
  },
  {
    "headline": "BREAKING: Fear Of Another Coup As Heavy Gunfire Is Reported Near Guinea-Bissau Government Palace",
    "summarized_story": "Heavy gunfire was heard on Tuesday in the capital of Guinea-Bissau near a government compound, where a cabinet meeting was being held, a Reuters reporter said.\nA security source with contacts inside the building said people had been hit by the gunfire.\nAlso, a coup d'état was launched in Burkina Faso on January 23, 2022.\nGunfire erupted in front of the presidential residence in the Burkinabé capital, Ouagadougou and several military barracks around the city.\nSoldiers were reported to have seized control of the military base in the capital."
  },
  {
    "headline": "BREAKING: Fear Of Another Coup As Heavy Gunfire Is Reported Near Guinea-Bissau Government Palace",
    "summarized_story": "Heavy gunfire was heard on Tuesday in the capital of Guinea-Bissau near a government compound, where a cabinet meeting was being held, a Reuters reporter said.\nA security source with contacts inside the building said people had been hit by the gunfire.\nAlso, a coup d'état was launched in Burkina Faso on January 23, 2022.\nGunfire erupted in front of the presidential residence in the Burkinabé capital, Ouagadougou and several military barracks around the city.\nSoldiers were reported to have seized control of the military base in the capital."
  },
  {
    "headline": "Sylva: Nigeria’s daily petrol consumption figures are crazy... we need to end subsidy",
    "summarized_story": "Timipre Sylva, the minister of petroleum resources, says Nigeria needs to move away from the petrol subsidy regime to end its ‘opaqueness’.\nSylva added that Nigeria’s daily petrol consumption figures are ‘crazy’.\nAdvertisementReacting to her comment, Sylva noted that the figures fixed for Nigeria’s fuel consumption are inflated.\n“But we should just sit down and interrogate that subsidy, subsidy price and see what we are paying for it and what’s in the landing costs,” Sylva said.\nSo, it is agreed that no refinery in the world can survive in a subsidy regime.”"
  },
  {
    "headline": "Sylva: Nigeria’s daily petrol consumption figures are crazy... we need to end subsidy",
    "summarized_story": "Timipre Sylva, the minister of petroleum resources, says Nigeria needs to move away from the petrol subsidy regime to end its ‘opaqueness’.\nSylva added that Nigeria’s daily petrol consumption figures are ‘crazy’.\nAdvertisementReacting to her comment, Sylva noted that the figures fixed for Nigeria’s fuel consumption are inflated.\n“But we should just sit down and interrogate that subsidy, subsidy price and see what we are paying for it and what’s in the landing costs,” Sylva said.\nSo, it is agreed that no refinery in the world can survive in a subsidy regime.”"
  },
  {
    "headline": "All retail investors 'will get their MTN shares' on Feb 18",
    "summarized_story": "All 126,720 retail investors who bought from the December 2021 public offer of MTN shares will get their share on February 18, 2021, TheCable has learnt.\nIn December 2021, MTN had promised one free share for every 20 shares bought — with maximum free shares of 250 per investor.\nThe company has disclosed that those free shares will not be allotted to investors until January 31, 2023 — after one year of holding, as said in the terms of the public offer.\n“The promotional offer ‘1 free share for every 20 purchased’ (subject to a maximum of 250 shares) will be allotted to investors who hold their shares for 12 months till January 31, 2023,” PrimaryOffer said in a mail to investors.\nAdvertisementTheCable also learnt that those who bought the MTN shares in December are also eligible to dividends for the 2021 fiscal year."
  },
  {
    "headline": "All retail investors 'will get their MTN shares' on Feb 18",
    "summarized_story": "All 126,720 retail investors who bought from the December 2021 public offer of MTN shares will get their share on February 18, 2021, TheCable has learnt.\nIn December 2021, MTN had promised one free share for every 20 shares bought — with maximum free shares of 250 per investor.\nThe company has disclosed that those free shares will not be allotted to investors until January 31, 2023 — after one year of holding, as said in the terms of the public offer.\n“The promotional offer ‘1 free share for every 20 purchased’ (subject to a maximum of 250 shares) will be allotted to investors who hold their shares for 12 months till January 31, 2023,” PrimaryOffer said in a mail to investors.\nAdvertisementTheCable also learnt that those who bought the MTN shares in December are also eligible to dividends for the 2021 fiscal year."
  },
  {
    "headline": "MAN IN THE NEWS: Okorocha, the captain of 'iberiberism', juggles presidential bid and fraud charges",
    "summarized_story": "“How much is Imo state government money?\nImo state is really owing me because I never collected my security votes.\nIn fact, since his departure from the Imo state government house, controversy has trailed him like an ants stalk sugar.\nERECTING OF STATUESAdvertisementTowards the twilight of his tenure as the governor of Imo state, Okorocha embarked on a spree of statue erections to “preserve history which is dying in Africa”.\nDon’t allow yourself to be deceived by anybody who doesn’t know how to make wealth,” the former Imo governor said."
  },
  {
    "headline": "Oui Capital backed these early-stage African startups in 2021",
    "summarized_story": "South Africa-based Akiba Digital, is a financial technology company building alternative credit scoring infrastructure to enable SMEs who cannot be scored by credit bureaus access credit, which is a $200 million-plus problem on the African continent.\nNdovu teamQuabbly is a no-code enterprise software company with operations in Lagos, Nigeria, Quabbly enables businesses to create and manage databases through process automation.\nHerconomy is a financial technology company that leverages the strength of its community to empower women and improve financial inclusion.\nHerconomy teamClane, a financial technology company enables merchants to accept payments with their mobile phones, and provides consumers with a unified mobile payments app linked to their bank accounts.\nOui Capital is on a mission to provide early-stage capital and mentorship to startups in Africa."
  },
  {
    "headline": "Nestcoin raises $6.5m pre-seed to deepen crypto and Web3 adoption in Africa",
    "summarized_story": "Last year alone, crypto startups raised over $27 billion in venture capital in 2021 —slightly higher than the past 10 years combined.\nAnd just last month, despite a dip in the price of cryptocurrencies, American VC, Andreessen Horowitz’s crypto arm launched a $2.2 billion fund, one of its biggest efforts to fund crypto startups.\nOn a mission to further deepen crypto adoption in Africa is Nigerian crypto startup Nestcoin which is building out Web3 products.\nLast year, it launched Breach, a media arm to simplify complex crypto topics to a global audience.\nOther institutional investors include MSA Capital, 4DX Ventures, Raba Capital, Goat.vc, Old Fashion Research, CMT Digital, Electric Capital, Social Capital, CoinFund, gumi Cryptos Capital, DeFi Alliance, among others."
  },
  {
    "headline": "Tiger Global and Greycroft lead $15m Series A round in Nigeria’s Bamboo",
    "summarized_story": "We plan to add other products and tools that offer greater access and make global investing simpler from Africa,” Bassey said.\nFor instance, nearly 75% of Bamboo users have never traded stocks before.\nIn 2021, repeat depositors made up 85% of deposits on the platform, an indication that Bamboo users are rapidly gaining confidence in trading US stocks.\nBut with the US equities market experiencing its worst January in well over a decade—since 2009—how are Bamboo users reacting to the downturn?\n“Even though they are new to stock investing, Bamboo users tend to handle their emotions like more seasoned investors,” Bassey said."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Untapped Global wants to fund African startups using data from IoT devices",
    "summarized_story": "That realisation led him to start Untapped Global in 2020.\nFlexClub is one of Untapped Global’s portfolio companiesUsing data from IoT devices, a company backed by Untapped Global could give Taiwo a tricycle for commercial transportation.\nUntapped Global invests in these companies and, in return, receives a percentage of the business’ revenue.\nWhile Untapped Global has been funding startups for barely two years, Chu lists FlexClub, Paga, and Asaak as some of their biggest successes.\nMost investors in Africa invest in various industries, but Chu says Untapped Global is focused on mobility, water infrastructure, and energy."
  },
  {
    "headline": "Training African tech talent, improving digital lending, simplifying blockchain, and better logistics for East Africa",
    "summarized_story": "The U.S Bureau of Labor Statistics estimates that the demand for software engineers will grow 22% between 2020 to 2030.\nArmed with this knowledge, AltSchool Africa is building a pipeline for entry-level talent in Africa.\nAfter a stint as CEO of Bundle — another crypto startup — Yele Bademosi teamed up with Taiwo Orilogbon (CTO) to build Nestcoin.\nAlready, the startup has launched Breach, a media platform simplifying crypto and blockchain concepts which Bademosi reveals currently has 6,000 newsletter subscribers.\nThe round had Better Tomorrow Ventures, Dynamo Ventures, Rackhouse Venture Capital, Flexport Inc, Knuru Capital, Launch Africa Ventures, Uncovered Fund as some of its investors."
  },
  {
    "headline": "With products like Originate and Decide, Indicina is enabling lenders give millions of Africans loans using alternative data",
    "summarized_story": "Indicina uses a data-driven approach to help lending institutions provide credit underwriting at scale.\nAccording to Johnson, “Indicina does not have a balance sheet or compete on lending.\nWe offer API-driven software to digitise the lending business.\nHow do you expand consumer credit to under-/unbanked populations in a prudent manner while shortening time-to-decision?\n“A thriving consumer credit industry is a powerful catalyst for economic inclusion on the continent."
  },
  {
    "headline": "Africa’s economic rebound from pandemic lies in trade, investment",
    "summarized_story": "Africa cannot continue to maintain the ideology that the winner takes all to repair trade in the continent.\nCountries need a mindset shift; also, blockchain is creating a level playing ground for all players in African trade, especially MSMEs,” he said.\nKubyane said too much bureaucracy interferes with African international trade, which affects the process and discourages participation.\nCountries need a mindset shift; also, blockchain is creating a level playing ground for all players in African trade, especially MSMEs,” he said.\nThe World Bank is of the view that increased investment in human capital translates to higher economic prosperity."
  },
  {
    "headline": "How zoning may disrupt 2023 electoral process",
    "summarized_story": "Depending on how Nigeria’s major political parties decide on their choice of presidential candidates, observers say the polity could be heated up as the issue of zoning has been a sensitive and contentious one that could disrupt the 2023 electoral process.\nThey had argued that rather than zoning the ticket, competence should be given priority in the choice of the presidential candidate.\nThey argue that to save the country from crisis, political parties and politicians must allow the South-East to produce the country’s president in 2023.\n“So, it is only the South-East and, for the interest of equity, it is appropriate that the region gets the president slot in 2023.\nIn the meantime, it is apparent the two major parties are playing a hide-and-seek game on each other in terms of where their presidential ticket would be zoned."
  },
  {
    "headline": "Lack of options confines PFAs to fixed income assets",
    "summarized_story": "The lack of investible assets to deploy growing pension funds has confined Pension Fund Administrators (PFAs) to allocate a substantial proportion of their funds to fixed income securities month-on-month/year-on-year.\nNational Pension Commission’s (PenCom) monthly report of October 2021 shows that out of N13.2 trillion in Assets Under Management by the PFAs 71.2 percent is in fixed income securities.\nAnalysts at FBNQuest Capital say the asset allocation of Nigerian pension funds has generally been biased toward government debt.\nFGN bonds accounted for over 60 percent of PFAs’ asset allocation,” according to FBNQuest.\nOguche Agudah, CEO of PenOp, states that local pension funds have expressed a desire to increase their allocation to PE and more impactful investments."
  },
  {
    "headline": "Obaseki harps on bye-laws to improve traffic mgt, as EDSTMA trains over 1,200 drivers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government will introduce bye-laws and other measures to check recklessness among drivers.\nThe governor disclosed this after inspecting facilities of the Edo State Traffic Control and Management Agency (EDSTMA), including the Drivers Training Academy and Manpower Development Centre.\nWe are working very hard with experts on what to do to ease traffic congestion in the state.\nThe leading causes of traffic congestion are unwholesome practices among drivers, particularly commercial drivers and people who refuse to obey traffic signs.\nThe Managing Director, EDSTMA, Mr. Dennis Oloriegbe, said that the agency has trained over 1,200 drivers, comprising drivers apprehended for serious traffic offences and others within the civil service at the academy."
  },
  {
    "headline": "Obaseki, FG in talks over kick-off of academic activities at Ekiadolor Federal College of Education – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… says govt won’t be blackmailed by ex-staff of defunct COEBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured the National Commission for Colleges of Education (NCCE) of the state government’s support for the kick-off of academic activities at the Federal College of Education in Ekiadolor.\nObaseki, who noted that workers of the defunct Edo State College of Education, Ekiadolor, are not owed salaries or any entitlements, said the government will not give in to blackmails by the dissident staff of the former state-owned college of education.\n“We are trying to retool the educational system of this country and Edo State.\n“They are claiming what they didn’t work for because we have set up our own state college of education.\nWe’ve gone round the site of the college and discovered a lot of good things and we must appreciate your efforts.”."
  },
  {
    "headline": "Edo advances on smart waste mgt technology to tackle trash problems in communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Erosion and Watershed Management Project (NEWMAP) in Edo State has intensified the deployment of its newly launched smart waste management technology to address the waste crisis across the 18 local government areas in the state.\nThe mobile application, according to the Coordinator of Edo NEWMAP, Dr. Tom Obaseki, is aimed at curbing indiscriminate waste disposal, especially plastic, aluminum, and other non-degradable materials.\nThe project is rallying and sensitizing stakeholders and Community Interest Groups (CIGs) on the usage of the smart plastic waste recycling scheme to tackle trash problems in the state.\nAccording to Obaseki, “The Edo NEWMAP has continued to explore more efficient effective means to solve the problem of flood and erosion across Edo communities.\n“On the back of this, we recently launched a plastic redemption application to assist in dealing with the threat posed by plastic waste clogging stormwater drains and natural moats across communities in Edo State."
  },
  {
    "headline": "Edo to set up investment desks in Lagos, Abuja, Nigerian embassies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has unveiled plans to set up investment desks in Lagos and Abuja as well as Nigerian embassies overseas to attract investments to the state’s industrial, agriculture, retail, tourism and power sectors.\nAccording to him, “We have to set up investment desks in Lagos and Abuja.\nThis will increase visibility of the opportunities for investment in our state.\n“The state has a 40MW power facility for investors in the industrial park provided by Ossiomo Power.\n“We want to create the investment desk so that we can advertise the opportunities available in the state to investors and get them to come and invest in our state,” he added."
  },
  {
    "headline": "UNICEF Calls For Immediate Release Of Kidnapped Children In North-East",
    "summarized_story": "The United Nations Children’s Fund (UNICEF) has called for the immediate release of all conflict-affected children held in captivity across the North-East region of Nigeria.\nIn a statement made available to journalists in Abuja, the United Nations agency also welcomed the release of four girls abducted by armed groups in Borno State.\nAbout 173 of the Chibok girls are still missing.\n“UNICEF is very relieved for the released girls and their families,’’ added Peter Hawkins, UNICEF representative in Nigeria.\nIn the North-East, more than 1,000 children have been abducted since 2014, with at least 100 still missing or unaccounted for."
  },
  {
    "headline": "Buhari Launches N62bn HIV Trust Fund",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja launched a N62billion Trust Fund to help Nigeria end AIDS as a public health threat and place more people living with HIV on treatment annually.\nWe have continued to make good our commitment of placing more people living with HIV on treatment annually using national resources.\nPresident Buhari noted that Nigeria’s purposeful partnership with the private sector in the response to COVID-19 pandemic had provided a readily available financing solution to leverage on to sustain the HIV response.\nHe also expressed delight with the attendance in person of notable global key players in HIV response and from the private sector at the event and the pledges made.\nHe said within the last 3 years, the agency has identified and placed on treatment an additional 900,000 persons living with HIV, bringing the total number of Nigerians on HIV treatment to 1.7 million."
  },
  {
    "headline": "APC Chair: Akume Has No Corruption Case To Answer – Contact C’ttee",
    "summarized_story": "“The fact of the matter remains that, Distinguished Senator George Akume has no running battle with any anti-corruption agency.\nADVERTISEMENT“Over the span of more than 23 years, Senator George Akume has never been invited for questioning by any corruption agency.\n“If elected the next National Chairman of APC, Senator George Akume commits to respecting the Nigerian and APC Constitutions as well as all party organs and officials.\nThe statement said: “There is the endorsement of Senator George Akume by the Northern APC National Front as signed by its Convener and spokesperson, Mallam Ayuba Hassan.\n“We wish to emphasise that when elected APC National Chairman, Senator George Akume will uphold the party’s constitution as well as respect its organs and officials.”"
  },
  {
    "headline": "APC Chair: Akume Has No Corruption Case To Answer – Contact C’ttee",
    "summarized_story": "“The fact of the matter remains that, Distinguished Senator George Akume has no running battle with any anti-corruption agency.\nADVERTISEMENT“Over the span of more than 23 years, Senator George Akume has never been invited for questioning by any corruption agency.\n“If elected the next National Chairman of APC, Senator George Akume commits to respecting the Nigerian and APC Constitutions as well as all party organs and officials.\nThe statement said: “There is the endorsement of Senator George Akume by the Northern APC National Front as signed by its Convener and spokesperson, Mallam Ayuba Hassan.\n“We wish to emphasise that when elected APC National Chairman, Senator George Akume will uphold the party’s constitution as well as respect its organs and officials.”"
  },
  {
    "headline": "Why I Divorced Atiku – Ex-Wife Jennifer",
    "summarized_story": "One of the wives of former Vice President Atiku Abubakar, Jennifer (Jamila) Douglas, has confirmed her divorce to the former vice president Atiku Abubakar even she explained reasons for the action.\nAtiku was the presidential candidate of the Peoples Democratic Party (PDP) in the 2019 general election.\nIn a statement obtained by LEADERSHIP on Tuesday, Jennifer explained that she didn’t ask for divorce because the ex-VP married a new wife.\nADVERTISEMENT“That His Excellency married a new wife was never the cause of our problem as many have said.\nShe also claimed that Atiku has requested to collect an asset previously given to her, adding that the property in Dubai is a subject of litigation."
  },
  {
    "headline": "Three days to deadline, APC yet to inform INEC of convention",
    "summarized_story": "Three days to deadline, APC yet to inform INEC of conventionThree days to deadline, APC yet to inform INEC of conventionThree days to the deadline, the All Progressives Congress has still not notified the Independent National Electoral Commission of its intention to hold its national convention which comes up on February 26, 2021.\nThe Electoral Act mandates all political parties to notify INEC of any planned convention at least 21 days before the event.\nWith the party’s convention expected to come up on February 26, the APC has till February 5 to submit its notification.\nWe are not aware of any inauguration of APC executive – Ogun, Kwara policeAlso, Ogun State Police command says it has not been informed on the proposed inauguration of state executive council by the APC scheduled for Thursday (tomorrow).\nHe said, “The state police command has not been informed of any activity or inauguration of the APC executive committee."
  },
  {
    "headline": "Three days to deadline, APC yet to inform INEC of convention",
    "summarized_story": "Three days to deadline, APC yet to inform INEC of conventionThree days to deadline, APC yet to inform INEC of conventionThree days to the deadline, the All Progressives Congress has still not notified the Independent National Electoral Commission of its intention to hold its national convention which comes up on February 26, 2021.\nThe Electoral Act mandates all political parties to notify INEC of any planned convention at least 21 days before the event.\nWith the party’s convention expected to come up on February 26, the APC has till February 5 to submit its notification.\nWe are not aware of any inauguration of APC executive – Ogun, Kwara policeAlso, Ogun State Police command says it has not been informed on the proposed inauguration of state executive council by the APC scheduled for Thursday (tomorrow).\nHe said, “The state police command has not been informed of any activity or inauguration of the APC executive committee."
  },
  {
    "headline": "Another two killed as fuel tanker explodes on Lagos-Ibadan expressway",
    "summarized_story": "Another two killed as fuel tanker explodes on Lagos-Ibadan expresswayAnother two killed as fuel tanker explodes on Lagos-Ibadan expresswayTwo persons have died in the early hours of Wednesday while six others escaped unhurt when a tanker laden with Premium Motor Spirit exploded in front of CDK Company located a few kilometres away from Sagamu interchange along Lagos – Ibadan expressway.\nThe multiple accidents, which occurred around 6.05a.m, involved Mack truck, Howo Sino truck, a mini truck and Bajaj motorcycle – with all of them having no registration numbers.\nSuperintendent Route Commander Florence Okpe, who is the FRSC Public Education Officer for Sector Commander, Ogun Sector Command, Umar Ahmed, attributed the likely cause of the multiple crashes to speed on the part of one of the trucks.\nThe Federal Road Safety Corps (FRSC), Ogun State sector Command attributed the likely cause of the accident to road obstruction and speed.\nShe explained that the injured victims were taken to General hospital Isara while the female corpse was deposited at FOS Ipara."
  },
  {
    "headline": "Another two killed as fuel tanker explodes on Lagos-Ibadan expressway",
    "summarized_story": "Another two killed as fuel tanker explodes on Lagos-Ibadan expresswayAnother two killed as fuel tanker explodes on Lagos-Ibadan expresswayTwo persons have died in the early hours of Wednesday while six others escaped unhurt when a tanker laden with Premium Motor Spirit exploded in front of CDK Company located a few kilometres away from Sagamu interchange along Lagos – Ibadan expressway.\nThe multiple accidents, which occurred around 6.05a.m, involved Mack truck, Howo Sino truck, a mini truck and Bajaj motorcycle – with all of them having no registration numbers.\nSuperintendent Route Commander Florence Okpe, who is the FRSC Public Education Officer for Sector Commander, Ogun Sector Command, Umar Ahmed, attributed the likely cause of the multiple crashes to speed on the part of one of the trucks.\nThe Federal Road Safety Corps (FRSC), Ogun State sector Command attributed the likely cause of the accident to road obstruction and speed.\nShe explained that the injured victims were taken to General hospital Isara while the female corpse was deposited at FOS Ipara."
  },
  {
    "headline": "Gov. Emmanuel to NUGA 2022 LOC: I’m Committed To Sports Development",
    "summarized_story": "Akwa Ibom State Governor, Mr Udom Emmanuel has reiterated his commitment towards development of young talents in sports to fly the colours of Nigeria in major competitions in the World.\n“You have invited us for the opening ceremony on 16th of March this year, we will try.\nProf. Ogundipe commended the Governor for transforming the state and described him as a worthy ambassador of the Institution.\nThe highpoint of the event was the presentation of the torch of unity for the 2022 NUGA to the Governor by the delegation.\nAbout 10,000 athletes from 80 universities in the country will take part in the 26th edition of the National University Games."
  },
  {
    "headline": "BREAKING: Court Denies Jurisdiction On Suit By 2,517 Aregbesola’s Loyalist To Invalidate Osun APC Ward Congress",
    "summarized_story": "A Federal High Court sitting in Osogbo on Wednesday denied jurisdiction to entertain the case instituted by 2,517 aggrieved members of All Progressives Congress (APC) loyal to Minister of Interior, Rauf Aregbesola to invalidate ward congress held on July 31st 2021.\nThe presiding Judge, Justice Emmanuel Ayoola while giving his ruling said, the suit brought before the court was strictly party affairs which the court lacks jurisdiction on the matter.\nHe said, “The claims of the plaintiffs is to draw the court to the internal affairs of the party which is not enshrined in the constitution.\n“Supreme Court has said court can’t interfere with the internal issue of party, unless it falls under Section 87(9) of the Electoral Act.\nThe case of the plf isn’t covered by the law an can’t be adjudicated by the court.”"
  },
  {
    "headline": "JUST IN Federal Government Set To Arraign Nnamdi Kanu’s Co-Accused On Terrorism Charges",
    "summarized_story": "JUST IN Federal Government Set To Arraign Nnamdi Kanu’s Co-Accused On Terrorism ChargesThe four co-defendants of Nnamdi Kanu are scheduled to be arraigned on terrorism charges by the Federal Government on Wednesday morning.\nThe arraignment is scheduled for the Federal High Court in Abuja, before Justice Binta Nyako.\nAt the time of this report, the four defendants Bright Chimezie, Chidiebere Onwudike, Benjamin Maduagwu and David Nwaurusi are already seated in the court room.\nMeanwhile, both Justice Nyako and counsel to the Federal Government, Mr Shuaib Magaji Labaran are yet to arrive the court.\nCounsel to the defendants, led by Ifeanyi Ejiofor have arrived and are waiting for commencement of proceedings."
  },
  {
    "headline": "Gombe APC Crisis Worsens As Special Adviser, Others Resign",
    "summarized_story": "The resignation of Bappa and Gwamna is coming on the heel of the defection of Dr. Ahmed Gana to the opposition Peoples Democratic Party (PDP) two days ago.\nBappa, in her letter dated February 1st 2022 to the Governor, said the resignation was with immediate effect.\nGombe business mogul and APC stalwart Dr. Jamil Gwamna also resigned from the party.\nIn his letter of resignation addressed to Jekadafari ward APC Chairman, Dr Gwamna said his decision to resign from the APC was after wide consultations with his family, political associates and supporters.\nConfirming the resignation letter through a telephone interview, Gwamna’s media consultant Dahiru Hassan Kera, said the letter was authentic."
  },
  {
    "headline": "2023: Lamido backs Tambuwal for President as Sokoto governor storms Jigawa, begins consultations (PICTURES)",
    "summarized_story": "Former Jigawa state Governor, Alhaji Sule Lamido, has appealed to political stakeholders across the country to avoid the issue of zoning as a criterion for leadership selection in 2023.\nA press statement by Muhammad Bello, Special Adviser Media and Publicity to governor Tambuwal revealed that Lamido made the call on Tuesday when he received Governor Tambuwal and his entourage who visited him in his Bamaina country home in Birnin Kudu local government area of Jigawa state.\nIn his remarks, former governor of Sokoto state, Alhaji Attahiru Dalhatu Bafarawa, who expressed gratitude to Lamido for the warm reception accorded them, said the visit was not political but consultative.\nGovernor Tambuwal was accompanied during the visit by the deputy governor of Zamfara state, Barrister Mahdi Aliyu Gusau, former deputy governor of Sokoto state, Alhaji Mukhtar Shagari, former minister for power, Engr.\nBello Suleiman, and former chairman of the PDP, Alhaji Bello Muhammad."
  },
  {
    "headline": "El-Rufai cries out to Buhari: Give us North West Theatre Command to tackle terrorists",
    "summarized_story": "Kaduna state Governor Nasir el-Rufai has appealed to President Muhammadu Buhari to create a theatre command in the North West region to tackle banditry, noting that nine people were kidnapped daily in Kaduna state on the average.\n“The report presented today shows that in 2021, an average of 9 persons were kidnapped daily across Kaduna state, mostly in the Kaduna Central senatorial district.\n“Kaduna state government appeals to the Federal Government to create a Theatre Command similar to the situation in the North-East to confront the insurgency that has clearly emerged in five states of the North-West and Niger state with continuous and contiguous forest ranges.\nAbout 544 residents of Kaduna Central zone sustained injury within 2021, while Kaduna South zone recorded 253 and Kaduna North zone recorded 94.\nChairperson Shiroro local government area, Suleiman Chukuba, had earlier confirmed the incident to Premium Times but said he could not confirm the number of casualties."
  },
  {
    "headline": "Arms proliferation, hard drugs, others threat to FCT polls – INEC",
    "summarized_story": "INEC Chairman Professor Mahmood Yakubu stated this at a meeting of the Inter-agency Consultative Committee on Election Security (ICCES) in Abuja.\nHe noted that the period earmarked in the timetable and schedule of activities for party primaries ended three days ago on 29th January 2022.\nHe said the commission’s report on parties’ primaries did not show any indication of the BP party holding a primary election.\n“All 18 political parties served notices for their party primaries to elect their candidates for the election and invited the commission to monitor them.\n“Consequently, we do not expect the party to nominate a candidate for the Ekiti state governorship election."
  },
  {
    "headline": "Lawson Alade wins APC ticket for Akure South/ North Federal Constituency by-election -",
    "summarized_story": "Mayorkun Lawson Alade has been declared winner of All progressives Congress primary election for Akure South/Akure North Federal constituency by-election.\nThe chairman of the 7 man primaries committee who is the outgoing deputy governor of Anambra State Nkem Okeke said the committee did a thorough job and was transparent in its dealings.\nAdvertisementThe winner of the primary Mayorkun Lawson Alade scored 305 votes to beat seven other aspirantsThe first runner up Omowunmi Olatunji-Owovoriole had 196 VotesAdvertisementThe Independent National Electoral Commission had fixed the bye election for February 26.\nThe seat became vacant following the death of Adedayo Omolafe of the Peoples Democratic Party"
  },
  {
    "headline": "I will declare my presidential ambition in due time",
    "summarized_story": "Former Vice President, Atiku Abubakar paid a courtesy call on governor Abubakar Sani Bello at the government house in Minna.\nSpeaking to journalists after a closed door meeting with the governor he said he will declare his presidential ambition in due time.\nAdvertisementHe also empathised with the governor over the issue recent banditry attack noting that the security situation in the state calls for urgent attention."
  },
  {
    "headline": "Photos: Ondo APC holds primary for Akure South/Akure North by-election -",
    "summarized_story": "The All Progressive Congress primary for the Akure South/Akure North federal Constituency by-election is about to commence.\nSee pictures below.\nAdvertisement"
  },
  {
    "headline": "Tambuwal accepts call to commence consultation on Presidency bid -",
    "summarized_story": "Sokoto state Governor, Aminu Tambuwal has accepted call from leaders and stakeholders of the People’s Democratic Party PDP to commence a nationwide consultation on his for his presidential bid.\nLeaders and supporters of the party in the state in a stakeholders meeting called on the governor to initiate the process of consultation for the presidential bid.\nAdvertisementWhile making his intention known, the Governor said he has never taken any major political steps without consulting with political leaders and stakeholders.\nThe former lawmaker said he has accepted the call to initiate the process of consultation to contest for the president of the country.\nAdvertisement"
  },
  {
    "headline": "RISE.TV HEADLINES 02-02-22",
    "summarized_story": ""
  },
  {
    "headline": "Many Dead In Guinea Bissau Coup Attempt But Calm Restored, President Says",
    "summarized_story": "The president of Guinea-Bissau has said he survived a coup attempt after being under heavy gunfire for five hours.\nGunfire erupted near government buildings on Tuesday in the capital of the West African nation, where the president was attending a cabinet meeting.\nOne of the poorest countries in the world, the former Portuguese colony has seen nine coups or attempted coups since 1980.\nWest African regional leaders described the incident as a coup attempt and urged troops to return to barracks.\nEcowas has issued sanctions against Mali and Burkina Faso but they haven’t stopped the wave of coups in the region."
  },
  {
    "headline": "Report: Hunger Crisis Looms in Nigeria’s ‘Food Basket’ Amid Conflict",
    "summarized_story": "“Sometimes we manage to eat once (a day),” says Mohammed, who has three children, aged five and younger.\n“We are heading to a food crisis,” Benue state Gov.\nAcross northern Nigeria, at least 13 million are now facing hunger amid a lean season, according to the U.N. World Food Program.\nAbout 3,000 people who have fled the violence in Benue state are now living at a camp in Guma local government area.\n“If there is security for these farmers, we’ll continue to retain our position as the food basket of the nation,” he said."
  },
  {
    "headline": "Nigeria: Central Bank Chief Emefiele Inaugurates N15bn Rice Mill in Kano",
    "summarized_story": "Governor of Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, on Tuesday inaugurated the ultra-modern 420 metric tons per day capacity rice milling factory in Kano State.\nHe urged rice mills owners to be involved in paddy production for sustainable supply through partnership with the Rice Farmers Association of Nigeria (RIFAN).\nGanduje revealed that the new rice mill would assist in creating jobs and boost the economic status of people in the state.\nChairman, Gerawa Rice Mill, Alhaji Isa Gerawa, thanked the CBN for supporting him to establish the factory at the cost of N15 billion.\nGerawa said the rice-milling factory would go a long way in reducing unemployment and ensuring food security in the country."
  },
  {
    "headline": "Attempted Coup in Guinea-Bissau Sends Jitters Across Africa",
    "summarized_story": "There was apprehension in Bissau, the capital of Guinea-Bissau and across Africa on Tuesday over a possible military take-over as sporadic gunshots were heard near a compound where the nation’s President Umaro Sissoco Embalo was presiding over a cabinet meeting.\nThe West Africa region has been mired by military take-over in the last 18 months with military take over in Mali, Guinea and Burkina Faso.\nGuinea-Bissau is not new to coup d’etat as for decades, there has been history of nine coups or attempted coups since independence from Portugal in 1974.\nThe ECOWAS Monitoring Group (ECOMOG) which some analysts are calling for, was a West African multilateral armed force established by the sub-regional body.\nECOMOG had been described as the first credible attempt at a regional security initiative in Africa.. Its establishment was spearheaded by Nigeria’s then military President, Ibrahim Babangida."
  }
]