[
  {
    "headline": "Senate drops CCT chair’s assault case as judge goes to court",
    "summarized_story": "The Senate, President of the Senate, Ahmad Lawan; the committee and the Minister of Justice and Attorney-General of the Federation, Abubakar Malami (SAN), were joined in the suit.\nRamnap dismissed the originating summons from Federal High Court Abuja, which was forwarded to the committee by counsel fo the accused, as mere court processes.\nThe lawyer said, “The document before this committee, as read out by the chairman, is not an order from any court but a mere court process served on the Senate.\nWere it to be a valid order from a court of competent jurisdiction, the Senate may back out.\nHe added, “This is a clear case of circumventing the constitutional powers of the Senate after submitting himself to us for investigation and begged for time to study the allegations made against him."
  },
  {
    "headline": "Plateau cholera outbreak spreads, cases hit 1,315",
    "summarized_story": "Plateau State has recorded a new outbreak of cholera in the Langtang South Local Government Area, bringing the total of LGAs affected by the disease to 14.\nThe Commissioner for Health, Dr Nimkong Lar, on Tuesday added that the death toll had moved to 24 from 21 recorded last week.\nHe also said the total number of cases had risen to 1,315 from the 1,144 recorded last week while 1,279 patients had been discharged from the hospitals.\nThe commissioner said, “Since the outbreak in May this year, there were 13 councils that were previously affected by the disease as of last week.\n“But with a new infection recorded in Lantang South LGA, we are now left with only three LGAs i – Pankshin, Mikang and Kanke – which have not recorded any infection out of the 17 LGAs in the state."
  },
  {
    "headline": "Cybercrime: Court sends Unilorin, KWASU, Kwara Poly students to Jail",
    "summarized_story": "The two other convicts are Alimi Abiodun and Idowu Rasaq Olarewaju, who are students of the Kwara State University University, KWASU, Malete and Kwara State Polytechnic, Ilorin, respectively were convicted by the same charges.\nThe three convicts, who were arraigned on separate charges pleaded guilty to the charge preferred against them.\nConsequently, Abdulbashit Opeyemi was sentenced to six months imprisonment, which shall be suspended for one year.\nIn sentencing Abiodun, the judge gave him three months imprisonment on count one and one year imprisonment on count two, which shall be suspended for one year.\nFor Rasaq Olanrewaju, Justice Abdulgafar sentenced him to six months imprisonment , which shall be suspended for six months."
  },
  {
    "headline": "Soldiers shut Imo timber market as marketers stage protest",
    "summarized_story": "By Chinonso AlozieTimber Marketers in Orlu Local Government Area of Imo State, Tuesday protested the shutting down of their market by Soldiers.\nThe timber marketers were seen protesting along Owerri-Orlu road when they discovered that the road leading to the market has been barricaded by soldiers.\nSome of the protesting timber traders who spoke to newsmen in Orlu, said they were demading for the soldiers to open the road block for them to start their business.\nAccording to them, “We came in on Tuesday morning, to start business and we saw that the road leading to our shops have been closed and we are asking why is our shops closed and nobody is talking to us and why should the military blocked the road.\nWe want them to open the road so that we can begin our business that is why we are protesting.”However, when Vanguard inquired to know from the timber traders they said: “On Monday, we got a report that those who attacked Omuma in Oru East local government area came from the Timber market, and are members of Eastern Security Network, ESN, and that the security operatives have been investigating the issues.”“We have also been told that is because that we obeyed the sit-at-home order on the day Nnamdi Kanu appeared in court that is while they have closed down the timber market.”When contacted the 34 Artillery Bridgade Command Obinze, Army Public Relations Officer, PRO, Babatunde Zubiru, he did not pick his call to react to the allegation that Army shut down the market."
  },
  {
    "headline": "23-year-old man kills lover, rapes her corpse in Edo",
    "summarized_story": "He was said to have hit the lady with a plank and had carnal knowledge of her thereafter.\nHe was earlier accused of hitting the head of her 13 years old boy and then pounced on the woman, thinking the son was dead.\nConfirming the incident on Tuesday, Police Public Relations Officer, Edo State Command, Kontongs Bello, said the suspect would be charged to court once investigations are concluded.\nThe incident happened in Darlington Ogbeifun Street, off Ogbekan Village Road, Ugbor in Oredo Local Government Area.\n“She had a lover, who is a bricklayer, that was coming to see her and people around here know them."
  },
  {
    "headline": "Council elections: APC chieftain writes Tinubu over crisis in Alimosho",
    "summarized_story": "He gave the advice in a letter written to APC Lagos Secretariat and the party National Leader Bola Tinubu respectively.\n“After the general elections in 2019 in which Alimosho displayed a total failure of votes cast, contrary to what we were known for, the National Leader of our great party publicly tagged Alimosho APC, a failure – the video is everywhere.\n“As part of our resolutions, the party agreed that there should be decentralisation of party leadership, freedom to contest elections, and independence of elected officials.\nHe added; “We later heard that our National Leader (Tinubu) had instructed that all first-term Chairmen across the State should go back for their second terms.\n“The next wonder of the world was that our candidate for that office in Igando-Ikotun LCDA, Hon."
  },
  {
    "headline": "Sanwo-Olu swears-in newly elected 57 council chairmen",
    "summarized_story": "The Lagos State Governor, Mr Babajide Sanwo-Olu, on Tuesday swore-in the 57 newly elected Local Government and Local Government Development Council chairmen and vice chairmen in the state.\nSanwo-Olu said that the new council bosses had a responsibility to ensure that they do not let the people down in any way or form.\n”Also, ensure that you surpass the legacies and the expectations of the people who have very enthusiastically elected you,” he said.\n”It is our responsibility and our burden as leaders they have elected to live up to their expectations.\n”On behalf of the whole newly sworn-in chairmen, we will not disappoint you and I promise again that we will key into the T.H.E.M.E.S agenda of Mr Governor."
  },
  {
    "headline": "What Sunday Igboho told court during hearing in Benin Republic",
    "summarized_story": "Salami said Igboho told the judge that he was put on a watchlist by the Nigerian government for fighting against killer herdsmen.\nHe told the judge that the Nigerian government was after him, because he was defending the Yoruba race against killer Fulani herdsmen.\n“He was asked when he got to Benin Republic, how he got in and how long it took him.\nHe said he breached Benin rules and he should be investigated.”Igboho appeared in court last Thursday and Monday.\nThe activist was arrested alongside his wife, Ropo, on Monday, July 19, 2021, at the Cadjèhoun Airport in Cotonou, Republic of Benin on their way to Germany."
  },
  {
    "headline": "Sunday Igboho: Islamic group attacks Afenifere for comparing Yoruba activist to Prophet Muhammed, Moses",
    "summarized_story": "The Muslim Rights Concern, MURIC, has asked the leading Yoruba social-political organisation, Afenifere, to tender an unreserved apology for comparing popular activist, Sunday Igboho, to Prophet Muhammad (SAW).\nAfenifere had recently compared the activist’s current travail in Benin Republic to that of Prophet Muhammad in Madinah.\n“Yoruba socio-cultural group, Afenifere, has compared Sunday Adeyemo, a.k.a.\nIgboho, to Prophet Muhammad.\nHe is currently being prosecuted by the Government of Benin Republic for obtaining fake passport with which he tried to travel to Germany."
  },
  {
    "headline": "Igbo Assembly frowns at delay strategy in Kanu’s trial, slams southeast govs on insecurity",
    "summarized_story": "The Assembly also expressed its disappointment over the inability of South-East Governors to end the perilous security situation in the zone.\nIt further lamented that South-East governors have failed to protect Igbos, adding that under this cataclysm, Igbo welfare and well-being are threatened.\nAccording to the group, “As a potentate, the police chief dictates Igbo security.\nIt sounds like a prescription for Fulani hegemony for Igbos to rely on the South-East governors’ security outfit, Ebubeagu.\nThe IPOB leader, through his counsel, Aloy Ejimakor, petitioned the African Commission on Human and Peoples Rights over his rearrest."
  },
  {
    "headline": "Buhari govt vs Nnamdi Kanu: UK offers assistance to IPOB leader",
    "summarized_story": "The British High Commissioner to Nigeria, Catriona Laing, has reacted to the ongoing travail of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB.\nLaing disclosed that the British Commission has offered consular assistance to embattled Kanu.\nThe British High Commissioner spoke while appearing on Arise Television, on Tuesday.\nLaing said: ”On Nnamdi Kanu, all I would say is that we are on record of saying that we can offer consular assistance to British nationals as requested.\nWhat we have said on record is that we would do all we can and we do offer consular assistance and in this case we have offered consular assistance to Nnamdi Kanu.”Kanu was recently rearrested and repatriated from an unspecified African country."
  },
  {
    "headline": "Death toll rises to 479 as Cholera spreads to 18 more states",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Tuesday, said a total of 479 people have been killed in the current outbreak of Cholera in the country.\nAccording to the report, a total of 19,305 suspected cases have been recorded since January 2021.\nNCDC also noted in the report that the disease has spread to 18 states and the Federal Capital Territory FCT, Abuja.\nOf all suspected cases, 52% are males and 48% are females,” the report read.\nFresh cholera outbreak kills 7 in FCT"
  },
  {
    "headline": "Govt won’t gag media, says minister",
    "summarized_story": "By Adekunle Jimoh, IlorinThe Federal Government has said it does not have the intention to gag the media and stifle the freedom of speech.\nIt assured that President Muhammadu Buhari would continue to provide the enabling environment for a robust media practice in Nigeria.\nMohammed said the phenomenon of fake news and hate speeches, which has dominated the social media space, is detrimental to the nation’s peace, security and national cohesion.\nThe minister said no responsible government would allow enemies of its country to use the media as a tool for destabilisation.\n“The other dimension of the theme of this conference is the role of the media in fostering national cohesion."
  },
  {
    "headline": "‘Atiku eligible to vie for presidency’",
    "summarized_story": "Agency ReporterThe Adamawa State government on Tuesday told a Federal High Court in Abuja that former Vice-President Atiku Abukakar is eligible to vie for the office of the president.\nAccording to him, this matter cannot be effectively and conclusively determined unless the Attorney General of Adamawa State is joined as a party.\n“This is a public interest Suit and can best be defended by the Adamawa State Government through its Chief Law Officer, the Attorney General of Adamawa State.\n“The government and people of Adamawa State have a greater interest in this suit than the 4th respondent (AGF).\nIn a preliminary objection be jointly filed with the PDP, Atiku, maintained that he is “a bona fide citizen of the Federal Republic of Nigeria”."
  },
  {
    "headline": "Nigeria needs new constitution to progress, says Afe Babalola",
    "summarized_story": "Our ReporterLegal icon, Aare Afe Babalola (SAN), has advised Nigerians to stop recycling those he called “same failed leaders” to enable the country have meaningful development.\nBabalola said Nigeria would attain laudable heights only when there is a new, people’s constitution ahead of the general election in 2023.\nOtherwise, we will be recycling the same failed leaders that have brought Nigeria to where it is today,” he said.\nThe eminent lawyer picked holes in the 1999 Constitution, saying it is the major problem of the nation.\nTo resolve the various crises across the country, the legal icon asked those who wish Nigeria to remain an indivisible entity to replace the 1999 Constitution with a truly Federal constitution and a parliamentary system of government."
  },
  {
    "headline": "Latest Nigeria News, Nigerian Newspapers, Politics",
    "summarized_story": "Agency ReporterRivers State Waste Management Agency (RIWAMA) has expressed concern over possible build-up of waste, following truncated operations of contractors by protesters on Eleme/Onne axis of the East/West road.\nThe News Agency of Nigeria (NAN) recalled that vehicular movements were on Monday obstructed by a group of youths from Eleme Local Government on a peaceful protest.\nADVERTISEMENTObuah said some trucks heading for the dump sites could not continue their duties, as they were delayed for hours.\nThe RIWAMA head promised that the agency would prioritise environmental sanitation, as authorised by the Governor Nyesom Wike administration.\nThe deplorable Eleme-Onne road, besides connecting communities within the state, adjoined neighbouring Akwa-Ibom State as well as the Eleme Petrochemical industry, Indorama, and Onne seaport."
  },
  {
    "headline": "Kanu’s arrest won’t stop Biafra agitation –ASETU",
    "summarized_story": "From Magnus Eze and Geoffrey Anyanwu, EnuguAssociation South East Town Unions (ASETU), yesterday, said those controlling the levers of power in Nigeria have failed to understand how they enable, facilitate and sponsor Biafra agitations in the South East.\nOnly the South East!\nAnd I believe the Igbo presidency will drive in equity and justice for all.\n“Igbo presidency in 2023 is an agitation laced with equity, justice and good conscience.\nI am highly optimistic that the Igbo presidency will re-write the Nigerian history for good."
  },
  {
    "headline": "IPOB: Heavy security as FG fails to produce Kanu in court",
    "summarized_story": "When the matter was called by 11.10am, the IPOB leader, who is in the custody of the Department of State Security Service (DSS), was absent in court.\nIn addition, some members of IPOB were arrested by security operatives outside the court premises.\n“This is no fiat from the Chief Judge of the Federal High Court for this court to continue with the trial of the defendant.\nEarlier, Ifeanyi Ejiofor, leading counsel for Nnamdi Kanu, had told the court that the DSS denied him and relatives of Kanu the opportunity to see him.\nSome of the arrested IPOB members chanted solidarity songs and demanded Kanu’s freedom."
  },
  {
    "headline": "Igboho’s prosecution gives credence to allegations of Fulani agenda, Afenifere tells FG",
    "summarized_story": "Some kings and Yoruba communities in Benin Republic that mobilised heavily in support of Igboho also got applause from Afenifere for ensuring that an Oduduwa son, Igboho, does not suffer unjustly.\n“We recall that Moses had to be taken away from the prying eyes of Pharaoh and his agents in Egypt.\n“By its conduct, government is giving people reasons to believe the allegation that it is pursuing a Fulanisation agenda.\n•Gani Adams rallies 10 Benin Republic monarchs Meanwhile, Gani Adams, Aare Ona Kakanfo of Yorubaland, said he has rallied 10 Benin Republic monarchs to facilitate the release the agitator.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Buhari signs N982.7bn 2021 Supplementary Appropriation Bill into law",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, Monday, in Abuja signed a supplementary budget of N982,729,695,343 into law.\nThe statement said the President had at an earlier date, signed the Orthopedic Hospitals Management Board (Amendment) Act, 2021.\nHe said: “The President has assented the Supplementary Appropriation Bill, so now it’s Supplementary Appropriation Act, since it has been assented by Mr. President.\nOf course, you know, the Supplementary Appropriation Bill was submitted to the National Assembly and they made an expeditious consideration of the bill and was passed and transmitted in record time and Mr. President has today assented to that bill.\nMr. President, having assented to the bill, you’ll find that molecular laboratories, about 10 of them, will be established nationwide."
  },
  {
    "headline": "Adesina promises economic diplomacy in Togo",
    "summarized_story": "Nigeria’s Ambassador to Togo, Debo Adesina, has promised to pursue economic diplomacy as well as strengthen partnership in trade and economic development during his tour of duty.\nSpeaking while presenting his letter of Credence to Togolese President, Faure Essozimma, Adesina said in accordance with the mandate given to him by President Muhammadu Buhari, “we would seek to expand the frontiers of our trade relations and economic cooperation.\nOur borders are lines of convenience, not barriers to our unity and collective progress,” he said.\nThe ambassador said Nigeria and Togo were strong allies and strategic partners, emphasizing: “We have a long history of togetherness.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Buhari, Other World Leaders to Raise $5bn for Education",
    "summarized_story": "Michael Olugbode in AbujaPresident Muhammadu Buhari and other world leaders are to raise $5 billion to support the education sector in about 90 countries where 80 per cent of the world’s out-of-school children live.\nBuhari, presently in London with senior officials of his government to attend the Global Education Summit holding in the European country, will along with the other leaders seek to raise the fund from donors across the globe.\nThe UK and Kenya are to jointly host the meeting, tagged Global Partnership for Education (GPE).\nThe summit will be urging world leaders to invest in education and improve access for girls.\nIt added, “Over the past 10 years in Nigeria, bilateral UK support has improved education systems for 11 state governments, reaching over eight million children."
  },
  {
    "headline": "Buhari Signs N982.7bn Supplementary Appropriation Bill into Law",
    "summarized_story": "•Targets adequate provision of security, medical infrastructure•Votes fund for construction of 10 molecular laboratories nationwideDeji Elumoye in AbujaPresident Muhammadu Buhari yesterday signed the 2021 Supplementary Appropriation Bill of N982, 729,695,343 into law.\nThe bill was sent to the National Assembly for approval last month after its approval by the Federal Executive Council (FEC).\nShedding more light on the Appropriation Act after the signing ceremony, El-Yakub said, “The president has assented the Supplementary Appropriation Bill, so now it’s Supplementary Appropriation Act, since it has been assented by Mr. President.\n“Of course, you know, the Supplementary Appropriation Bill was submitted to the National Assembly and they made an expeditious consideration of the bill and it was passed and transmitted in record time and Mr. President has today assented to that bill.\nMr. President, having assented to the bill, you’ll find that molecular laboratories, about 10 of them, will be established nationwide."
  },
  {
    "headline": "Alleged Treasonable Felony: Court Declines to Try Kanu in Absentia",
    "summarized_story": "Kanu and three others were standing trial for alleged treasonable felony and five other charges.\nInterjecting, Nyako said the court could not do anything without the presence of Kanu in court.\nWhile the annual vacation of the Federal High Court commenced Monday July 26, it was however noted that Nyako was not one of the vacation judges.\nNyako stated that if the prosecution was able to get a fiat from the Chief Judge of the Federal High Court, the court could reschedule the date for next hearing.\nBefore the day’s proceedings, security personnel comprising DSS and Police completely took over the premises of the Federal High Court in Abuja."
  },
  {
    "headline": "IG Approves Posting, Redeployment of Newly Promoted AIGs",
    "summarized_story": "*Ex-FCT police chief, Ciroma, moved to Zone 7Kingsley Nwezeh in AbujaThe Inspector-General of Police, Mr Usman Baba, Tuesday ordered the posting and redeployment of the 24 newly promoted Assistant Inspectors-General of Police (AIGs).\nOthers are AIG SPU FHQ Abuja, Zaki M. Ahmed , AIG Zone 4, Makurdi, Mustapha Dandaura; AIG CTU FHQ Abuja, AIG Dansuki D. Galadanchi.\nOthers include AIG Adebola Longe, AIG DOPS FHQ Abuja; AIG Musa Adze, Investment FHQ; AIG Philip Sule Maku, AIG DICT FHQ Abuja; AIG Usman Gonna, AIG Zone 6, Calabar; AIG Adamu Usman assigned headship of Police Cooperative.\nOthers affected by the exercise are AIG Maigana Sani, AIG FCID Annex Kaduna; AIG Adamu Madaki, AIG Zone 12 Bauchi; AIG John Ogbonnaya, AIG Maritime, Lagos; AIG Ede Ekpeji, AIG Zone 8, Lokoja; AIG Mohammed Bageda will oversee Armament, Force Headquarters.\nIt said the posting and the redeployment of the senior police officers is with immediate effect."
  },
  {
    "headline": "IG Approves Posting, Redeployment of Newly Promoted AIGs",
    "summarized_story": "*Ex-FCT police chief, Ciroma, moved to Zone 7Kingsley Nwezeh in AbujaThe Inspector-General of Police, Mr Usman Baba, Tuesday ordered the posting and redeployment of the 24 newly promoted Assistant Inspectors-General of Police (AIGs).\nOthers are AIG SPU FHQ Abuja, Zaki M. Ahmed , AIG Zone 4, Makurdi, Mustapha Dandaura; AIG CTU FHQ Abuja, AIG Dansuki D. Galadanchi.\nOthers include AIG Adebola Longe, AIG DOPS FHQ Abuja; AIG Musa Adze, Investment FHQ; AIG Philip Sule Maku, AIG DICT FHQ Abuja; AIG Usman Gonna, AIG Zone 6, Calabar; AIG Adamu Usman assigned headship of Police Cooperative.\nOthers affected by the exercise are AIG Maigana Sani, AIG FCID Annex Kaduna; AIG Adamu Madaki, AIG Zone 12 Bauchi; AIG John Ogbonnaya, AIG Maritime, Lagos; AIG Ede Ekpeji, AIG Zone 8, Lokoja; AIG Mohammed Bageda will oversee Armament, Force Headquarters.\nIt said the posting and the redeployment of the senior police officers is with immediate effect."
  },
  {
    "headline": "Presidential Villa Staff Forced To Take Oath Of Secrecy After SaharaReporters Exposed Buhari’s ‘Secret’ Visit To UK",
    "summarized_story": "Staff members at the State House in Abuja have taken an oath of secrecy and warned that disclosing confidential information without authorisation will attract penalties under public service rules.\nThis comes a few days after SaharaReporters exclusively reported how President Muhammadu Buhari secretly planned to visit the United Kingdom to avoid rampage or any \"embarrassing protest\" against him.\n“President Buhari is leaving for the UK tomorrow or Saturday for a 4-day programme.\nEmbarrassed by the report, Permanent Secretary, State House, Tijjani Umar on Tuesday warned that disclosing confidential information by Aso Villa staff without authorisation will attract penalties under public service rules.\nRecall that the late former President, Umar Yar’Adua also forced State House staff members to swear to an oath of secrecy after SaharaReporters reported that the number one citizen was critically ill."
  },
  {
    "headline": "Presidential Villa Staff Forced To Take Oath Of Secrecy After SaharaReporters Exposed Buhari’s ‘Secret’ Visit To UK",
    "summarized_story": "Staff members at the State House in Abuja have taken an oath of secrecy and warned that disclosing confidential information without authorisation will attract penalties under public service rules.\nThis comes a few days after SaharaReporters exclusively reported how President Muhammadu Buhari secretly planned to visit the United Kingdom to avoid rampage or any \"embarrassing protest\" against him.\n“President Buhari is leaving for the UK tomorrow or Saturday for a 4-day programme.\nEmbarrassed by the report, Permanent Secretary, State House, Tijjani Umar on Tuesday warned that disclosing confidential information by Aso Villa staff without authorisation will attract penalties under public service rules.\nRecall that the late former President, Umar Yar’Adua also forced State House staff members to swear to an oath of secrecy after SaharaReporters reported that the number one citizen was critically ill."
  },
  {
    "headline": "Presidential Villa Staff Forced To Take Oath Of Secrecy After SaharaReporters Exposed Buhari’s ‘Secret’ Visit To UK",
    "summarized_story": "Staff members at the State House in Abuja have taken an oath of secrecy and warned that disclosing confidential information without authorisation will attract penalties under public service rules.\nThis comes a few days after SaharaReporters exclusively reported how President Muhammadu Buhari secretly planned to visit the United Kingdom to avoid rampage or any \"embarrassing protest\" against him.\n“President Buhari is leaving for the UK tomorrow or Saturday for a 4-day programme.\nEmbarrassed by the report, Permanent Secretary, State House, Tijjani Umar on Tuesday warned that disclosing confidential information by Aso Villa staff without authorisation will attract penalties under public service rules.\nRecall that the late former President, Umar Yar’Adua also forced State House staff members to swear to an oath of secrecy after SaharaReporters reported that the number one citizen was critically ill."
  },
  {
    "headline": "BREAKING: Buhari Presidency Orders State House Workers To Take Oath of Secrecy, Threatens Stiff Penalties",
    "summarized_story": "The Permanent Secretary, State House, Tijjani Umar on Tuesday in Abuja asked staff members to take oaths of secrecy while threatening whoever is found guilty of leaking inside information with stiff penalties.\nHe said staff members who disclose confidential information without authorisation will face penalties under the public service rules.\nFile PhotoThe Permanent Secretary stated this at the administration of Oath of Secrecy and Declaration of Secrecy to 42 staff members of the State House, POLITICS NIGERIA reports.\nAccording to the Umar, the oaths were administered to staff members who handle classified documents.\nThe Permanent Secretary noted that even though there had not been any breach, thr exercise will be continuous."
  },
  {
    "headline": "BREAKING: Buhari Presidency Orders State House Workers To Take Oath of Secrecy, Threatens Stiff Penalties",
    "summarized_story": "The Permanent Secretary, State House, Tijjani Umar on Tuesday in Abuja asked staff members to take oaths of secrecy while threatening whoever is found guilty of leaking inside information with stiff penalties.\nHe said staff members who disclose confidential information without authorisation will face penalties under the public service rules.\nFile PhotoThe Permanent Secretary stated this at the administration of Oath of Secrecy and Declaration of Secrecy to 42 staff members of the State House, POLITICS NIGERIA reports.\nAccording to the Umar, the oaths were administered to staff members who handle classified documents.\nThe Permanent Secretary noted that even though there had not been any breach, thr exercise will be continuous."
  },
  {
    "headline": "Femi Adesina: Between now and 2023, there'll be more confusion in PDP",
    "summarized_story": "Femi Adesina, presidential spokesperson, says there will be more depletions and confusion in the ranks of the Peoples Democratic Party ahead of the 2023 elections.\nThe presidential spokesperson argued that during the PDP administration at the federal level, the party conducted some of its meetings at the presidential villa.\nThe presidential spokesperson noted that the massive infrastructure will make PDP governors see that they have been “backing the wrong horse”.\nWhen I say massive, I mean massive,” he added.\n“A lot of PDP governors will say, yes, we are backing the wrong horse, we are coming to APC."
  },
  {
    "headline": "Femi Adesina: Between now and 2023, there'll be more confusion in PDP",
    "summarized_story": "Femi Adesina, presidential spokesperson, says there will be more depletions and confusion in the ranks of the Peoples Democratic Party ahead of the 2023 elections.\nThe presidential spokesperson argued that during the PDP administration at the federal level, the party conducted some of its meetings at the presidential villa.\nThe presidential spokesperson noted that the massive infrastructure will make PDP governors see that they have been “backing the wrong horse”.\nWhen I say massive, I mean massive,” he added.\n“A lot of PDP governors will say, yes, we are backing the wrong horse, we are coming to APC."
  },
  {
    "headline": "Lagos LG poll: APC loses 2 of 377 councillorship seats to PDP, YPP",
    "summarized_story": "The All Progressives Congress (APC) has lost 2 out of the 377 councillorship seats in last Saturday’s Lagos LGA elections.\nAdvertisementAccording to the results announced by the Lagos State Independent Electoral Commission, the Peoples Democratic Party (PDP) won Ward G, Yaba LCDA, while the Young Progressive Party (YPP) became victorious in Ward D of Orile-Agege LCDA.\nMeanwhile, the ruling party won the chairmanship seats in all the 20 LGAs and 37 LCDAs in the state.\nAdeshola Thomas, the PDP Councillor-elect and Omotunde Abdul-Kareem, the YPP Councillor-elect were presented the Certificates of Return at the LASIEC headquarters in Sabo, Yaba, on Tuesday.\n“During the election, out of the 18 polling units in my ward, my challengers allegedly took two ballot boxes away."
  },
  {
    "headline": "Lagos LG poll: APC loses 2 of 377 councillorship seats to PDP, YPP",
    "summarized_story": "The All Progressives Congress (APC) has lost 2 out of the 377 councillorship seats in last Saturday’s Lagos LGA elections.\nAdvertisementAccording to the results announced by the Lagos State Independent Electoral Commission, the Peoples Democratic Party (PDP) won Ward G, Yaba LCDA, while the Young Progressive Party (YPP) became victorious in Ward D of Orile-Agege LCDA.\nMeanwhile, the ruling party won the chairmanship seats in all the 20 LGAs and 37 LCDAs in the state.\nAdeshola Thomas, the PDP Councillor-elect and Omotunde Abdul-Kareem, the YPP Councillor-elect were presented the Certificates of Return at the LASIEC headquarters in Sabo, Yaba, on Tuesday.\n“During the election, out of the 18 polling units in my ward, my challengers allegedly took two ballot boxes away."
  },
  {
    "headline": "Soldiers shut Imo market, ask traders to stay away 'until Biafra is achieved'",
    "summarized_story": "Some soldiers on Tuesday stopped traders at the timber and building material market in Orlu, Imo state, from opening for business.\n“They prevented people from opening their shades, mainly timber market and building material,” he said.\nAdvertisementThe soldiers were said to have asked the traders to “stay at home until Biafra Republic is attained” before they can resume their trading activities.\nWhen contacted on the development, Mike Abatem, police spokesperson in Imo, said he cannot speak on the matter.\nBabatunde Zubiruo, spokesperson, 34 artillery brigade command in Imo, abruptly ended a telephone conversation with TheCable after the issue was raised."
  },
  {
    "headline": "South Africa’s Yoco raises $83m to extend digital payments to 1 million SMEs",
    "summarized_story": "It also plans to expand beyond South Africa as the demand for digital payments among African small businesses grows.\nToday, the company offers a wide array of financial services including online and in-store payments, business software, and capital to small business merchants.\n“Our expertise and efforts centre around driving financial inclusion and lowering the barriers of entry for our customers (small businesses),” Maphai said.\nThis, he explained, is because there are over 6 million small businesses in South Africa and well over 100 million across the MENA region that still transact only in cash.\nTo seize the opportunity, Yoco plans to deepen its operations in South Africa in addition to a pan-African expansion goal."
  },
  {
    "headline": "From MIT to MDaaS: Meet the couple solving Nigeria’s medical diagnostics problem",
    "summarized_story": "Coming from a medical background, he used the opportunity to create a solution for a problem he had firsthand experience with: Lack of access to quality medical equipment in Nigerian hospitals.\n“My father is a medical doctor who has run a hospital in a small town in Nigeria for over 35 years, and I witnessed the issues he faced accessing medical equipment.\nBut, like Oluwasoga, she also saw the challenges doctors faced operating with limited resources amid other inefficiencies in the medical equipment space.\n“We initially provided refurbished medical equipment sales, leasing, and servicing to small and medium hospitals.\nBut even as MDaaS services are priced low, some patients in low-income communities still cannot pay, Oluwasoga said."
  },
  {
    "headline": "This US-based early-stage fund wants to invest $5m in African startups",
    "summarized_story": "In the first half of this year, investments in African startups have risen back to pre-covid levels.\nOne of such players is Expert DOJO, a US-based early-stage fund that has decided to commit up to $5m to invest in African startups this year.\nSetting itself apart from other global accelerators, Expert DOJO has assembled an entire Africa-dedicated team plus cross-functional experts and Entrepreneurs in Residence (EIRs).\nStarNews Mobile, a mobile video network for Africa, is one of the first African startups Expert DOJO invested in.\nVictoria Mehran, an Investment associate at Expert Dojo explained this saying, “We’re committed to supporting them for life."
  },
  {
    "headline": "The Next Wave: Scale is hard to find in Africa",
    "summarized_story": "The top 4% No standard definitions exist for what scale is for fintech in Africa.\nHere are five key numbers from the report: Out of 716 fintech companies pooled across Africa, only 37 have achieved scale.\nOn average, it takes 12 years for a African fintech company to scale; only 5 startups have managed to scale within 5 years of operations.\nOne interesting takeaway is that “infrastructure” fintech companies are likely to scale in Africa.\n– Alexander Onukwue, Staff writer, TechCabal Share this newsletter Share Share Sign up for The Next Waveby TechCabal Sign me up"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Egyptian grocery delivery startup, GoodsMart raises $3.6 million for country-wide expansion",
    "summarized_story": "Share this article:Egyptian grocery delivery startup, GoodsMart has announced a $3.6 million raise led by Sawari Ventures.\n“The demand for online grocery delivery has been exponentially increasing.\n; listening to them was and will always be the secret recipe.”Grocery delivery startups have received great attention since the outbreak of the coronavirus pandemic.\nHowever, the bulk of the funding received by grocery delivery startups have been in Europe and America.\nStartups like GoodsMart and Appetito, another Egyptian grocery delivery company, are ensuring that Africa is not left behind."
  },
  {
    "headline": "South African fintech, Yoco, secures $83m Series C to strengthen market presence",
    "summarized_story": "Share this article:Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has announced an $83 million Series C today.\nOther investors include Breyer Capital, 4DX Ventures, Orange Ventures, Velocity Capital Fintech Ventures, and Quona Capital.\nThis Series C is after a $3 million Series A in 2017 and a $16 million Series B raised in 2018, bringing the company’s summate value to $102 million.\nYoco wants to strengthen its presence by hiring 200 members to the team to work remotely and in their physical offices currently available in South Africa and Amsterdam.\nSmall and Medium Enterprises (SMEs) in South Africa contribute one-third of the GDP."
  },
  {
    "headline": "How to apply for SME Clinic ₦100,000 Small Business Grant",
    "summarized_story": "Share this article:As a small business owner in a pandemic-ridden world, finding ways to adapt your business to the new normal — social distance, remote work, and tech adoption, among others — is important if your business will survive.\nThis is all the more important in Nigeria given the peculiarities of the SME space, one of which is funding.\nThis is why at SME Clinic 2021, seasoned entrepreneurs will be teaching SMEs how to sustain their businesses using technology, with training including bookkeeping and managing your online business.\nThis year, in conjunction with First Bank of Nigeria — the official banking partner for the SME Clinic 2021 Grant — we will give 5 SMEs ₦100,000 each.\nYou must attend SME Clinic 2021 physically (if you have not registered, do so here)."
  },
  {
    "headline": "Naira may hit new low as CBN halts dollar sales to BDCs",
    "summarized_story": "Naira may hit new low as CBN halts dollar sales to BDCsThe foreign exchange (FX) market and stakeholders were thrown into shock as the Central Bank of Nigeria (CBN) on Tuesday discontinued the sale of FX to Bureau De Change (BDC) operators, a development that may see the naira hit a new low against the dollar.\nGodwin Emefiele, governor, CBN, announced this after the two-day Monetary…"
  },
  {
    "headline": "Can 2020 Tokyo Olympics still be a revenue boom?",
    "summarized_story": "After weeks of speculations and fears of Covid 19, the much talked about games, the rescheduled 2020 Tokyo Olympic Games officially kicked off last Friday, July 23 in Japan.\nCalling off the Tokyo Olympics comes with huge financial implications.\nCancelling the 2020 Tokyo Olympics could cost the IOC $3 billion-$4 billion in lost broadcast rights income.\nRelief for organizers and advertisersDespite some fears, the Tokyo Olympic Games promises to be a revenue generator.\nBig brands have spent over $1 billion on ads on the Tokyo Olympics, which is ongoing in empty arenas as the pandemic lingers."
  },
  {
    "headline": "Here are market reactions as CBN halts dollar sales to BDCs",
    "summarized_story": "In an announcement after the July MPC meeting, Nigeria’s central bank governor, Godwin Emefiele, announced that the CBN bank will no longer sell foreign exchange to bureau de change operators (BDCs).\nThe governor said that that the central bank sells about $110 million to BDCs every week.\nWith this move, the CBN seeks to reign in speculative demand for foreign exchange and take on the challenge of meeting all genuine demand.\nGovernor Emefiele noted that the CBN is the only central bank in the world that sells foreign exchange to BDCs.\nThe move is coming in late July when demand for foreign exchange for personal travel and school fees is typically high."
  },
  {
    "headline": "IPC Decries DSS Accreditation Of Ten (10) Media Organisations To Cover Nnamdi Kanu’s Trial – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The International Press Centre (IPC), Lagos – Nigeria has condemned the decision of the Department of State Services to accredit ten media organisations to cover the trial of the leader of the Indigenous People of Biafra (IPOB) today, Monday July 26th, 2021.\nAccording to Department of State Services (DSS), the newspapers accredited include Daily Post, Premium Times, Thisday, The Nation, The Herald, and Daily Independent while the Nigerian Television Authority (NTA), Channels Television, Africa Independent Television and Television Continental (TVC) were picked from the broadcast media sector.\nIn a statement signed by IPC’s Program Officer/Safety Desk Officer, Melody Lawal, IPC is of the firm opinion that the Department of State Service (DSS) has no constitutional right to accredit journalists to cover the trial of Nnamdi Kanu or any other suspect for that matter based on the provisions of the National Security Agencies Act.\nIPC is amazed and concerned about this development which has no precedent anywhere in the worldThe trial of Nnamdi Kanu is a matter of public interest and accrediting some media outlets to cover it violates press freedom and the right of the public to know."
  },
  {
    "headline": "Politics Is Now Business Venture, Says 2023 APC Presidential Aspirant – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Politicking in Nigeria presently has become business venture, according to the All Progressives Congress (APC) 2023 Presidential Aspirant, Professor Godspower Osaretin Ikuobase.\n“Politicking presently in Nigeria is unfortunate, it is seeing as business venture as against service to the nation.\n“For us to get its right politically, we must elect people of integrity, intelligence and energy.\nWe need proper planning, core nationalist, a detribalised Nigerians to take the country into political eldorado.\n“I am coming to implement the true spirit of the APC which is politics for the grassroots, from the grassroots and by the grassroots."
  },
  {
    "headline": "Edo residents laud Obaseki for ongoing construction of Textile Mill Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENNIN CITY – Edo residents have hailed Governor Godwin Obaseki for the ongoing reconstruction of Textile Mill Road in Egor Local Government Area of the state, noting that the project, on completion, will further open up the area to more economic activities.\nA transporter who plies the route, Mr. Philip Asekevwe, while hailing the governor, charged him on the completion of other sections of the road.\nAccording to him, “We appreciate the governor for the reconstruction of the road.\nOn his part, a landlord in the area, Mr. James Ekuase, also commended the governor for remembering the people in his administration’s massive infrastructural development.\nWe thank God for this present administration of Governor Godwin Obaseki that has come to help us out.”..."
  },
  {
    "headline": "Obaseki sustaining investment in agric to grow Edo’s economy, create jobs, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said it is leveraging on the huge investments, as well as the systematic reforms and programmes by the Governor Godwin Obaseki-led administration in the agricultural sector to boost the state’s economy, tackle food insecurity and create wealth for Edo citizens.\nThe Functioning Permanent Secretary, Edo State Ministry of Agriculture and Natural Resources, Mr. Peter Aikhuomobhogbe, stated this during a virtual engagement session with Edo indigenes in the Diaspora with the theme, “National Diaspora Day: Investment meeting with the Diaspora.”Aikhuomobhogbe noted that the state was driving economic growth by stimulating investments in agriculture and allied industries to ensure it becomes self-sufficient in food production and to diversify its revenue base.\nAccording to him, “Agriculture and allied industries have always been considered by the Edo State Government as an important sector for diversification and to build an economy that can generate inclusive growth and create jobs.\n“Edo State Oil Palm Programme to remove critical risk in the oil palm sector, through solving the biggest hindrances to plantation development, by making land available and encouraging sustainable production and ensuring global competitiveness.\n“We also launched the Independent Farmers’ Initiative to mitigate the adverse impacts of the COVID-19 crisis and lay the ground for a robust recovery.”“Investments at the upstream link of the value chain have also been attracted to facilitate domestic off-take and increased production,” he added."
  },
  {
    "headline": "Eid el-Kabir: FRSC records 108 accidents, arrests 6,055 offenders",
    "summarized_story": "The Federal Road Safety Corps (FRSC) says it recorded 108 accidents during the 2020 ‘Eid el-Kabir special operations’ nationwide.\nThe Corps Public Education Officer, Assistant Corps Marshal, Bisi Kazeem, said this in a statement on Tuesday in Abuja.\nThis he said was to intensify efforts in clamping down on aggressive drivers whose recklessness often contribute to road traffic crashes.\nMr Kazeem quoted the Corps Marshal, FRSC, Boboye Oyeyemi, as saying that the Corps now had a wider coverage due to the establishment of more FRSC commands.\nThe News Agency of Nigeria (NAN) reports that the corps marshal had earlier directed that the 2021 Sallah special patrol operations should be made to cover 45 corridors."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anambra 2021: Ozigbo meets PDP governors, unveils development agenda",
    "summarized_story": "Mr. Valentine Ozigbo, candidate of the People’s Democratic Party (PDP) for the upcoming Anambra State governorship election billed for November 6, at the weekend, met with governors the party to discuss his plans for the state.\nOzigbo who addressed the governors at their forum in Bauchi, said it was an incredibly enlightening and enriching session.\nThe PDP candidate described the party’s the best performing governors in Nigeria, noting that they are leaders who are delivering credible, evidence-based governance to their people without propaganda.\n“I was honoured to join them as the PDP Governorship candidate for the November elections in Anambra.\nTo this end, an important meeting of PDP leaders and stakeholders in Anambra holds this week."
  },
  {
    "headline": "MPC retains benchmark interest rate at 11.5%, keeps other parameters constant",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN), has voted unanimously to retain the Monetary Policy Rate (MPR) at 11.5%, and other parameters constant.\nThis was disclosed by the CBN Governor, Godwin Emefiele while reading the communique at the end of the MPC meeting on Tuesday.\nHighlights of the Committee’s decision:MPR retained at 11.50%The asymmetric corridor of +100/-700 basis points around the MPRCRR was retained at 27.5%While Liquidity Ratio was also kept at 30%The committee expressed confidence that banks are doing the right thing in managing the country’s economic situation by increasing access to credit to the real sectors of the economy.\nThe committee also encouraged the banks to continue to use their existing administration to mop up excess liquidity from the economy"
  },
  {
    "headline": "Emefiele confirms plan to unveil digital currency in October, says its a noble idea",
    "summarized_story": "OBINNA EZUGWUGovernor of Nigeria’s Central Bank, Godwin Emefiele, has said the apex bank plans to unveil its digital currency, E-Naira as part of its digital economy push.\nEmefiele, however, said that the ban on digital currencies like Bitcoin would remain in place.\nHe emphasized that digital currencies are not regulated and therefore, poses huge risks.\nEmefiele said the instruction given to commercial banks not to facilitate digital currency trade will remain in place, but that individuals who wish to trade can do so at their own risk.\nHe said the bank will be happy with people who make money through digital currency, but will laugh at those who lose money because it has sufficiently warned against the trade."
  },
  {
    "headline": "BREAKING: CBN stops sale of foreign exchange to BDC operators",
    "summarized_story": "OBINNA EZUGWUThe Central Bank of Nigeria (CBN), has announced immediate suspension of sale of foreign exchange to bureau de change operators in the country.\nGodwin Emefiele, governor of the apex bank who announced the decision in a communique issued after the month’s Monetary Policy Meeting on Tuesday, said the sale of forex will not be made through commercial banks.\nEmefiele accused BDC operators of undermining the country’s foreign exchange policy.\nThe CBN governor also announced that all monetary policy parameters will remain the same.\nMore later…"
  },
  {
    "headline": "Messy Marriage Breakup Tale Trails New GTB MD, Miriam Olusanya",
    "summarized_story": "Miriam Olusanya, the newly appointed first female Managing Director of one of Nigeria’s leading banks, GTB, is currently enmeshed in a messy tale.\nAccording to the tale which is gradually gaining traction, her marriage to Abiodun Olusanya just crashed.\nAnd to compound her woes, one of the reasons being alleged is not palatable.\nWe learnt that her fed up husband, Abiodun, had on January 23, 2020 filed a petition for the dissolution of their marriage before a Chicago court in the United States of America.\nMore on the matter… TheyesngShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Messy Marriage Breakup Tale Trails New GTB MD, Miriam Olusanya",
    "summarized_story": "Miriam Olusanya, the newly appointed first female Managing Director of one of Nigeria’s leading banks, GTB, is currently enmeshed in a messy tale.\nAccording to the tale which is gradually gaining traction, her marriage to Abiodun Olusanya just crashed.\nAnd to compound her woes, one of the reasons being alleged is not palatable.\nWe learnt that her fed up husband, Abiodun, had on January 23, 2020 filed a petition for the dissolution of their marriage before a Chicago court in the United States of America.\nMore on the matter… TheyesngShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Opinion: Zuma’s Controversial Sentence – By SAM KARGBO – Daylight",
    "summarized_story": "Religion, relationships and inner peace are better definers of their well-being than the Rule of Law or economic prosperity.\nConvicting and sentencing Jacob Zuma is meant to sell the Rule of Law as a prized commodity in South Africa.\nWas the importance of the Rule of Law not exaggerated in the context of the jailing of Zuma?\nIn a word, the South African Constitutional Court put into use a constitutional symbolic sovereign power without the sanction of the owners of the ultimate sovereign power.\nPerhaps the South African Constitutional Court has a lot to learn from the restraint, patient and cautious Supreme Court of Nigeria."
  },
  {
    "headline": "Opinion: Zuma’s Controversial Sentence – By SAM KARGBO – Daylight",
    "summarized_story": "Religion, relationships and inner peace are better definers of their well-being than the Rule of Law or economic prosperity.\nConvicting and sentencing Jacob Zuma is meant to sell the Rule of Law as a prized commodity in South Africa.\nWas the importance of the Rule of Law not exaggerated in the context of the jailing of Zuma?\nIn a word, the South African Constitutional Court put into use a constitutional symbolic sovereign power without the sanction of the owners of the ultimate sovereign power.\nPerhaps the South African Constitutional Court has a lot to learn from the restraint, patient and cautious Supreme Court of Nigeria."
  },
  {
    "headline": "Judgment Day for El-Zakzaky, wife today, detained since 2015",
    "summarized_story": "<El-Zakzaky and wife Zeenah: detained by Buhari’s govt since December 2015[/caption]strong>By AbankulaLeader of the Islamic Movement in Nigeria, Sheikh Ibraheem Zakzaky, who has been in detention since December 2015 will know his fate today.\nKaduna State High Court presided over by Justice Gideon Kurada would give judgment in his case, along with his wife Zeenah.\nPresident Media Forum of the Islamic Movement, Ibraheem Musa, disclosed the judgment day in a press statement he issued to newsmen on Tuesday.\nIf that happens, then the Sheikh and his wife will be set free since their arrest and detention in December, 2015.\nAlso in 2016 a federal high court in Abuja restored the fundamental human rights of the embattled Sheikh and his wife and set him free."
  },
  {
    "headline": "Zamfara Police break silence on abduction of 60 travellers",
    "summarized_story": "The Zamfara State Police Command on Wednesday denounced purported report of abduction of 60 travellers by armed bandits on Sokoto-Gusau road.\nA statement issued by the command’s spokesman, SP Muhammad Shehu, however, confirmed that 11 travellers were abducted and not 60 as being reported.\nShehu said the attention of the Zamfara State Police Command had been drawn to a story trending on social and some conventional media that armed bandits blocked Sokoto – Gusau road and abducted 60 people travelling from Sokoto to Abuja.\n“The operatives embarked on search and rescue operation in the surrounding bushes with a view to rescuing the kidnapped victims.\nIn view of this, the command enjoins members of the public to discountenance the purported abduction of 60 persons,” Shehu added."
  },
  {
    "headline": "NNPC bribes: Glencore staff Stimler pleads guilty in U.S.",
    "summarized_story": "Agency ReportsA scheme of graft in NNPC involving Anthony Stimler, a former U.K.-based trader for Glencore Plc has put the trader in trouble with U.S. Justice Department.\nStimler pleaded guilty on Monday in New York over what U.S. prosecutors called his role in a scheme to bribe officials in Nigeria in exchange for favourable contracts from the NNPC.\nU.K. and Swiss authorities have also been examining possible corruption involving Glencore, and various governments have investigated other large oil traders.\nIn March, former Glencore oil trader Emilio Jose Heredia Collado pleaded guilty in San Francisco to manipulating a key oil price benchmark.\nThe case is U.S. v. Stimler, U.S. District Court, Southern District of New York, No."
  },
  {
    "headline": "Death Toll Rises To 479 As Cholera Spreads To 18 More States",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Tuesday, said a total of 479 people have been killed in the current outbreak of Cholera in the country.\nAccording to the report, a total of 19,305 suspected cases have been recorded since January 2021.\nNCDC also noted in the report that the disease has spread to 18 states and the Federal Capital Territory FCT, Abuja.\nThe states were listed as Delta, Zamfara, Gombe, Bayelsa, Kogi, Sokoto, Bauchi, Kano, Benue and Kaduna.\nOf all suspected cases, 52% are males and 48% are females,” the report read."
  },
  {
    "headline": "BREAKING: 47 Lagos Yoruba Nation Protesters Freed From Detention",
    "summarized_story": "Forty-seven of the 48 protesters detained by Nigerian police during the Yoruba Nation Rally on July 3, 2021, in Lagos State, have been released.\nThe Yoruba Nation agitators arrested in the state were granted bail on July 19 by a magistrate court in Yaba, Lagos State.\nMr. Maxwell Adeleye, the Communications Manager for Ilana Omo Oodua, the umbrella body of Yoruba Self-Determination Groups, acknowledged their release.\n“This is to inform the general public that 47 out of the 48 protesters arrested by the Nigerian Police during the Yoruba Nation Rally held July 3rd, 2021 have been released from detention after meeting their bail conditions,” Adeleye said.\nThe Ogboni leader (traditionalist) Bakare was charged by the Lagos State Police Command with the murder of Jumoke Oyeleke, a salesgirl who was allegedly murdered by a stray bullet during a protest in the state."
  },
  {
    "headline": "CBN Stops Forex Sales To Bureau De Change Operators, Retains Lending Rate",
    "summarized_story": "The Central Bank of Nigeria has stopped the sales of forex to the Bureau De Change operators in the country with immediate effect.\nThe CBN Governor, Godwin Emefiele, disclosed this after the Monetary Policy Committee two-day meeting in Abuja on Tuesday.\nThe MPC also retained the Monetary Policy Rate at 11.5 per cent at the end of the meeting.\nAnnouncing the committee’s decision, Emefiele said, “The MPC made the decision to hold all parameters constant.\n“The Central Bank will henceforth discontinue the sale of forex to Bureau de Change operators,” Emefiele said."
  },
  {
    "headline": "What Sunday Igboho Told Judge In Benin Republic – Lawyer",
    "summarized_story": "In an interview on Tuesday, his lead counsel, Ibrahim Salami, stated that Igboho told the judge that the Nigerian government had placed him on a watchlist for battling against killer herdsmen.\nIn an interview with BBC Yoruba, Salami said that Igboho is facing new allegations related to illegal migration, suspicious collusion with immigration agents, and an attempt to incite public disorder.\nIgboho and his wife, Ropo, were arrested on Monday, July 19, 2021, at the Cadjèhoun Airport in Cotonou, Republic of Benin, while traveling to Germany, according to the PUNCH.\nWhen quizzed by the judge, the lawyer quoted Igboho as saying, “Igboho explained that what was said about him are false.\nHe told the judge that the Nigerian government was after him because he was defending the Yoruba race against killer Fulani herdsmen."
  },
  {
    "headline": "Breaking: Yoruba nation agitators released from Police detention in Lagos",
    "summarized_story": "Forty-seven protesters arrested by the Nigerian Police during the Yoruba Nation Rally held July 3, 2021, in Lagos State have been released from detention.\nThe remaining person is still detained by the police after allegedly killing someone during one of their protest, 47 otherswere released after meeting their bail conditions.\nA Magistrates’ Court in Yaba, Lagos State had on July 19 granted bail to the Yoruba Nation agitators arrested in the state.\nAmong those released are Olasunkanmi Tanimola; Kabiru Lawanson; Chinemerem Emmanuel; Rasaki Musibau; Lukman Olalade; Olasanmi Oladipupo; Bashiru Shittu; Taofeek Abdusalam; Olamilekan Abata; Abdullahi Sikiru; Tosin Adeleye; Babatunde Lawal.\nOthers include Abiodun Taiwo, Adagunodo Babatunde, Oluwafemi Adeleye, Oloye Taiwo, Saheed Kareem, Adebayo Waheed, Akinbode Sunday, Lawal Akeem, Samuel Ire, Ogundile Dare."
  },
  {
    "headline": "Kidnappers demand N100m ransom on 80-year-old first class monarch in Kaduna",
    "summarized_story": "Barely 24 hours after kidnapping the paramount ruler of Jaba Chiefdom, Kpop Ham, Jonathan Gyet Maude, in Jaba local government area of Kaduna state, his abductors have demanded N100 million as ransom for his release.\nA close family source on the condition of anonymity said the kidnappers made the demand on Tuesday through a telephone call with a family member of the embattled first class traditional ruler.\nThe monarch is beleived to be the oldest traditional ruler across Northern Nigeria.\nHe was abducted on Monday at about 2 p.m by gunmen suspected to be kidnappers while working on his farm located at Gitata community on Kaduna state border with Nasarawa state.\nBut the source said the kidnappers allowed the driver and the guard to leave while kidnapping the monarch."
  },
  {
    "headline": "Breaking: For attempting to bite opponent, Tokyo Olympics organisers disqualify boxer",
    "summarized_story": "Moroccan heavyweight boxer Youness Baalla attempted to bite David Nyika’s ear during his defeat to the New Zealander at the Tokyo Olympics on Tuesday.\nThe 22-year-old was subsequently disqualified for unsportsmanlike behaviour, although he was already out of the Games anyway following his unanimous-points loss in the round-of-16 bout.\nA Tokyo 2020 statement called Baalla’s actions “intolerable”, saying that he “very clearly intended to bite the ear/face of his opponent in the third round of the bout”.\nFootage shows Baalla trying to bite Nyika’s right ear as the two boxers hold each other."
  },
  {
    "headline": "ECOWAS Parliament decries multiple challenges in West Africa -NigPilot",
    "summarized_story": "The Community Parliament of the Economic Community of West African States has decried the multiple economic and socio-political challenges bedeviling the sub-region.\nSpeaker of Ghanaian Parliament, Rt Hon Alban Bagbin expressed this misgiving at the official opening of the delocalized meeting of ECOWAS Joint Committee on Political Affairs, Peace, Security and Africa Peer Review Mechanism (APRM), Legal Affairs and Human Rights, and Telecommunications and Information Technology.\nHe said: “As you may all be aware, the Sub-region is confronted with various challenges such as drug trafficking, child trafficking, proliferation of and trafficking in small arms, organised crime, money laundering and terrorism.\nCybercrime and the insecurity in the maritime space in the Gulf of Guinea, are issues that require immediate attention.\nHe added that ICT does offer new opportunities to better manage conflicts and build peace especially at the local levels of our societies."
  },
  {
    "headline": "Nigeria Pilgrimage to Jordan‘ll strengthen bilateral relations-Pam",
    "summarized_story": "Executive Secretary of the Nigeria Christian Pilgrim Commission, Rev Yakubu Pam has said the recently introduced Pilgrimage to Jordan would help to strengthen bilateral relations between the two countries.\nPam disclosed this in Amman, Jordan, recently while addressing the first batch of Pilgrims who arrived in the Kingdom of Jordan today to begin their Pilgrimage exercise.\nHe urged Nigerian Pilgrims to demonstrate the virtues of our Lord Jesus Christ while in the Holy Land.\nHe enjoined the Pilgrims to see their Pilgrimage to Jordan as a revival that would turn their spiritual life around.\nHe urged them to cooperate with the Pilgrimage leaders to ensure a hitch free Pilgrimage exercise."
  },
  {
    "headline": "Wushishi solicits support of staff to reposition NECO -NigPilot",
    "summarized_story": "Registrar/Chief Executive, National Examinations Council, NECO, Prof. Ibrahim Dantani Wushishi has promised to reposition NECO to become a credible and internationally acclaimed examination body, urging staff to give their best in order to actualize his mission.\nWushishi made the promise on Monday while officially taking over the affairs of the Council from the Former Acting Registrar, Mr. Ebikibina John Ogborodi.\nHe solicited for the support of the management and staff to enable him actualise his vision for the Council.\nThe Registrar who thanked President Muhammadu Buhari for deeming him fit to be appointed as NECO Registrar, pledged to work closely with the Federal Ministry of Education and NECO Governing Board.\nIt could be recalled that Prof. Wushishi was on 12th July, 2021 appointed as the substantive Registrar of NECO by President Muhammadu Buhari."
  },
  {
    "headline": "Nigerian Varsities to get N900m, Poly N800m support fund- TETFUND -NigPilot",
    "summarized_story": "Tertiary Education Trust Fund, TETFUND, on Tuesday revealed intervention funds set aside to aid Nigerian higher institutions to improve infrastructure and meet up with global standards.\nAnnouncing this in Abuja at the Federal University of Petroleum Resources, FUPRE, Effurun Roundtable Meeting, Chairman Board of Trustees, TETFUND, Kashim Ibrahim, disclosed that Universities, Polytechnic and Colleges of Education will receive N900m, N800m, and N700m respectively.\nHe also disclosed that FUPRE will receive an N3bn intervention fund to support “Infrastructure, Scholarships, Research” and other pressing needs.\nIn the past this would be considered a luxury, but with the advent of Covid-19, it is now a necessity,” he added.\n“The Nigerian experience has largely been a case of exclusive funding of public universities by the federal government which in the light of contemporary reality, is no longer sustainable."
  },
  {
    "headline": "CBN Bans Sale Of Foreign Exchange To BDC Operators",
    "summarized_story": "The Central Bank of Nigeria (CBN) has announced an end to the weekly allocation and sale of foreign exchange to Bureau De Change (BDC) operators in the country.\nEmefiele added, “In particular, we have noted with disappointment and great concerns that our Bureau De Change operators have abandoned the original objective of their establishment which was to serve retail end users who need $5,000 or less.\n“Instead, they have become (illegal) wholesale dealers in foreign exchange to the tune of millions of dollars per transaction.”﻿He accused the BDC operators of facilitating grafts, illicit financial flows, and money laundering in the country.\nAccording to the CBN chief, the nation’s financial regulator will not hesitate to sanction any bank operating in the country found to be collaborating with BDC operators to facilitate illegal forex dealings.\nHe also accused international organisations, development finance organisations, and embassies of patronising BDC operators to fund local operations contravening Nigeria’s foreign exchange regulations."
  },
  {
    "headline": "Presidency Issues Oath Of Secrecy To Staff",
    "summarized_story": "The Presidency on Tuesday issued an oath of secrecy to staff, warning them against divulging state secrets to the public.\nState House Permanent Secretary, Tijjani Umar who issued the warning noted that alerting staff of the penalties that accrue to a breach of classified documents without authorization, has become fundamental, particularly to retired staff.\nAdministering an oath of secrecy to 42 staff at the State House, he disclosed that there has been no record of any breach of information yet, neither is there anticipation of any, but the exercise will continue to put civil servants in check.\nUnder the Official Secrets Act, 1962, the Director of Special Services Department, Office of the Government of the Federation, Tukur Yahaya, explained to the staff that underwent the sensitization program, that the safety and security of government information, documents and facilities is critical to guarantee continuous delivery of national service.\n“That’s the reason we decided to do the needful by administering the Oath of Secrecy, highlighting the importance of letting them know what information they are managing and the consequences of the breach of such information.”SEE THE FULL STATEMENT BELOW:"
  },
  {
    "headline": "Why President Buhari Travels To The UK For Medicals – Femi Adesina",
    "summarized_story": "Femi Adesina, the Special Adviser to President Muhammadu Buhari on Media and Publicity, has defended his Principal over his frequent medical tour to the United Kingdom.\nPresident Buhari had on Monday departed Nigeria for the UK to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\nHe explained that the Constitution empowers Vice President Yemi Osinbajo to act as President if President Buhari is not back to the country within 21 days.\nOn the out-of-school children, Adesina who noted that there is a reduction of the situation said President Buhari would brief participants of the development in the country.\nOn the five-year commitment to the funding of education, Adesina stressed that his principal would make pronouncements on that."
  },
  {
    "headline": "Passengers Who Abscond From Quarantine Risk Prosecution, FG Warns",
    "summarized_story": "The Federal Government has vowed to sanction returning passengers who abscond from quarantine facilities, including possible prosecution of such individuals.\nAddressing a news conference in Abuja, the Minister of Health, Dr Osagie Ehanire, believed such persons constitute a major risk to the country’s health system.\nHe added, “I entreat all persons to comply with our port health staff or risk facing sanctions, including prosecution.\n“Johnson & Johnson vaccine, which is a one-dose vaccine, will be advantageous for our context with weak Civil Registration Vital Statistics (CRVS) and a nomadic population.\n“We expect to take delivery of these vaccines within this third quarter with the Johnson & Johnson expected this August,” Osagie hinted."
  },
  {
    "headline": "Alleged Sexual Assault: Victim Testifies Behind Closed Doors Against Baba Ijesha",
    "summarized_story": "The alleged victim (name withheld), gave her testimony behind closed doors because of the law protecting minors from undue public exposure.\nREAD ALSO: Alleged Sexual Assault: Court Admits Video Evidence Against Baba IjeshaShe also denied that she set up her child to be molested by her colleague.\nWhen asked if she sought professional help for the child, Princess said she sought spiritual help instead.\nPrincess also testified that the victim was again molested in her house by a neighbour.\nThe actor was arraigned before the court by the Lagos State government on a six-count charge of indecent treatment of a child, defilement of a Child, sexual assault by penetration, attempted sexual assault by penetration and sexual assault."
  },
  {
    "headline": "FOMWAN warns against comparing Sunday Igboho to Prophets",
    "summarized_story": "This is just as the Association insisted that it was wrong for anyone to compare his travel to Benin Republic to Allah’s ordained migration of Prophet Muhammad from Mecca to Medina.\nThe warning was contained in a statement issued and signed in Ibadan by the Oyo State Amirah of FOMWAN, Alhaja (Dr) B.B Oloso.\n” Most of Allah’s Messengers if not all emigrated at one time or the other.\nHowever, the migration of Prophet Muhammad differed from other Prophets because it was the beginning of the establishment of full Islamic practice by the early Muslims.\nAt Medina, Prophet Muhammad established the best nation ever raised and from there Islam was embraced by many nations and tribes."
  },
  {
    "headline": "PGF DG, Salihu Lukman, urges APC leaders to admit challenges of governance",
    "summarized_story": "He asked “The question is, to what extent did the APC and its governments meet or are meeting the expectations of Nigerians?\nWhat are the challenges and how is the APC and its governments responding to these challenges?\n“The fundamental issue is the question of the extent to which APC leaders and members are responding to challenges.\nThe good thing is that, in APC, leaders are not in denial of the challenges.\n“It is painful that with all the initiatives of APC governments, especially Federal Government under President Buhari, the claim of any failure can be made."
  },
  {
    "headline": "Zamfara Deputy Gov., Commissioner Of Police Shun Assembly Invitation",
    "summarized_story": "Zamfara state Deputy Governor Mahdi Aliyu Gusau has shun the invitation by the state House of Assembly over alleged official misconduct leveled against himThe Deputy Governor is expected to appear before the House in person to explain the reasons behind organizing political rally on his return to the state Capital few days after the formal Defection governor Bello Matawalle alongside other top government functionaries to the ruling APCThe Zamfara State House of Assembly is Accussing the Deputy Governor for organizing the rally at the time the state is mourning the death of fifty six persons killed by armed Bandits in Maradun Local government areaThe House had on Wednesday 14th july 2021 invited the Deputy governor to appear before it in person on the 27th JulyThe House had also summoned the state commissioner of Police Hussaini Rabi’u to furnish the House on why the police allowed the state Deputy Governor to hold the rally.\nAdvertisementThe Zamfara State Deputy Governor Barrister Mahdi Aliyu Gusau has not replied the House since he was served the InvitationA press statement signed by the Spokesperson of the House Mustapha Kaura says the Zamfara state House of Assembly has extended the invitation with forty eight hours to 29th July enable the Deputy Governor appear before it.\nA Federal High Court in Abuja had last week ordered the Zamfara state House of Assembly to Suspend any move of impeachment against the state Deputy Governor Mahdi Aliyu Gusau."
  },
  {
    "headline": "Tokyo 2020: Simone Biles Pulls Out of Gymnastics Team Final, Wants to ‘Focus on Mental Health’",
    "summarized_story": "Four-time Olympic gold medallist Simone Biles has pulled out of the women’s gymnastics team final saying she “have to focus on my mental health”.\n24 year-old Biles scored 13.766 – her lowest Olympic vault score – before withdrawing from the event.\n“I have to focus on my mental health.\nI just think mental health is more prevalent in sports right now.\nThe 30-time Olympic and World Championship medallist needs four podium finishes in Tokyo to become the most decorated gymnast – male or female – in history."
  },
  {
    "headline": "‘Deep-seated Sociopathy’: Ayiri Emami Needs to Rediscover Himself, Says Amaju Pinnick",
    "summarized_story": "Nigeria Football Federation President Amaju Pinnick was on The Morning Show to bring the public up to speed on the forthcoming coronation of the Olu of Warri-designate, Prince Tsola Emiko.\nA son-of-the-soil, Pinnick offered some advice to Ayiri Emami, who is contesting the forthcoming coronation.\nWatch the video for more…"
  },
  {
    "headline": "Nigeria to Reopen San Francisco Consulate 32 Years After",
    "summarized_story": "The Nigerian government has expressed its readiness to reopen the consulate in San Francisco, United States.\nAduda said the plan to re-open the mission, which was shut down in 1989, is now at “an advanced stage“.\nThe permanent secretary said the consulate had adopted cultural diplomacy through the show to sell the good image of Nigeria to the world.\nThe consulate had on Saturday organised a cultural show, with the theme “Nigeria: Our Community, Cultures and Unity’’, to showcase Nigeria’s festivals, dances, and fashions, among others.\nAduda, who was at the event, said the consulate had promoted Nigeria’s culture in a way that people would be able be to buy-in."
  },
  {
    "headline": "Nigeria’s Central Bank Bans Sale of Forex to BDCs",
    "summarized_story": "The Central Bank of Nigeria (CBN) has banned sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country accusing them of illegal forex trading.\nGovernor of the Nigerian apex bank Godwin Emefiele stated this on Tuesday at the end of the monetary policy committee meeting in Abuja, the Nigerian capital.\n“Several international organisations, embassies patronise BDC through illegal forex dealer to fund their institutions,” he added.\nThis is not the first time the CBN has placed a ban on the sale of forex to BDCs.\nIn 2016, the apex bank announced the discontinuation of the sale of forex to BDC operators – a decision that was made to curb the dubious acts of the BDC operators."
  },
  {
    "headline": "CBN Retains Lending Rate at 11.5%",
    "summarized_story": "The Central Bank of Nigeria (CBN) has retained the monetary policy rate (MPR) at 11.5 percent.\nThe decision was announced on Tuesday by the Central Bank of Nigeria governor, Godwin Emefiele, after the committee’s two-day meeting at its headquarters in Abuja.\nIt should be noted that the last monetary policy committee meeting, the members as well voted to retain MPR at 11.5 percent – the rate it had been since September 2020.\nCommittee thus decided by a unanimous vote to retain monetary policy rate at 11.5%”.\nIt also voted to retain cash reserve ratio at 27.5% and retain liquidity ratio at 30%.”The action of the CBN monetary policy committee is in line with the recommendation of the IMF."
  }
]