[
  {
    "headline": "Over 15 people missing after ship sinks in Liberia",
    "summarized_story": "Between 15 and 17 people are missing after a vessel sank off the coast of southeastern Liberia, the West African state’s government and coastguard said Sunday.\nSearch and rescue operations are ongoing, a coastguard official said at a news conference in the capital Monrovia.\nHe added that some people had been rescued on Saturday night as the ship was sinking.\nLiberian daily FrontPage Africa reported on Saturday night that 21 people were aboard the vessel and a rescue operation began after it sent out a distress call.\nLiberia is a poor nation of 4.8 million people that is still recovering after back-to-back civil wars from 1989 to 2003 and the West African 2014-16 Ebola pandemic, which killed 4,800 people in the country."
  },
  {
    "headline": "COVID-19: FG asks northern govs, emirs to suspend Dubar activities",
    "summarized_story": "The Presidential Steering Committee on COVID-19 has asked northern governors and emirs to suspend Durbar activities to prevent the spread of coronavirus.\nDurbar is a common event in Northern cities and communities with colourful parades of the emirs and their entourage on horses.\nMustapha said the recommendation followed the confirmation of the Delta Variant of COVID-19 and the rising number of infections and hospitalisation in the country.\nPart of the statement read, “These steps are critical as we begin to see worrisome early signs of increasing cases in Nigeria.\n“The PSC therefore recommends the following preventive measures for a safe Eid-el-Kabir celebration:a) Decentralisation of Eid Prayer to neighbourhood Friday Prayer Mosques (outdoor);b) Suspension of Durbar activities; andc) Observation of limitations on all Indoor gatherings."
  },
  {
    "headline": "Withdraw order on reporting of terrorist attacks within 24hrs or…, SERAP tells FG",
    "summarized_story": "By Olasunkanmi AkoniSocio-Economic Rights and Accountability Project, SERAP, has asked President Muhammadu Buhari to urgently instruct Minister of Information and Culture, Mr Lai Mohammed, and the National Broadcasting Commission, NBC, to withdraw within 24 hours the directive containing a sweeping gag order banning journalists and broadcast stations from reporting details of terrorist attacks and victims across the country.\nRecall that NBC had in a letter dated 7 July.\n7, 2021 issued a directive asking journalists, television, and radio stations in Nigeria to stop “glamourising and giving too many details on the nefarious activities of terrorists and kidnappers” during their daily newspaper reviews.\nNBC called for ‘caution’ by broadcasters while reporting security challenges in the country.\nNational security is a necessary and integral part of the right to security guaranteed to each person individually.”Vanguard News Nigeria"
  },
  {
    "headline": "Lagos govt pays LG, SUBEB staff deceased’s families N364.9M",
    "summarized_story": "By Olasunkanmi AkoniLagos State Government has disbursed N364,982,210.39 only through the presentation of insurance benefits to the first batch of beneficiaries of deceased staff of Local Government and State Universal Basic Education Board, SUBEB.\nThe Commissioner, who was represented by the Permanent Secretary, Mrs Morenike Sanyaolu,, stated that the payment of insurance benefits was one of several welfare packages of the state government for its workforce.\nChairman of SUBEB, Wahab Alawiye King represented by Mrs Adenike Odusanya, said that the presentation was meant to honour the departed souls who had worked tirelessly to make Lagos State a better place for the living.\nKing affirmed that the presentation of insurance benefits to the beneficiaries of the deceased further demonstrated the State Government’s resolve to pay all entitlements and dues to its staff.\nOn behalf of others Etobro, promised that they would all use the payment for the dependants’ welfare and progress in life."
  },
  {
    "headline": "Wolves forward Raul Jimenez makes anticipated return after long injury spell",
    "summarized_story": "Raul Jimenez was handed his long-awaited return for Wolves as the Mexico forward started in Saturday’s friendly against Crewe Alexandra.\nJimenez has been out of action since he sustained a fractured skull in a clash of heads with Arsenal’s David Luiz in November.\nThe 30-year-old former Benfica striker returned to full training in May, six months after undergoing surgery for what Wolves described as a “major traumatic brain injury and skull fracture”.\nJimenez has been a sensation for Wolves since their promotion to the Premier League, netting 30 top-flight goals across his first two full seasons at the club.\nHe had scored four goals in 2020-21 prior to his injury at Emirates Stadium, with Jimenez’s absence dealing a big blow to Nuno Espirito Santo’s team last term."
  },
  {
    "headline": "Unemployment Cut: Lagos, German firm, partner on Job creation interventions",
    "summarized_story": "By Olasunkanmi AkoniLagos State Government and her German partner, GIZ firm have sealed arrangements for an intervention targeted at scaling up the skill development capacity of youths in the state.\nAccording to him: “There is a consensus on the need to tackle unemployment, especially amongst the youth in Lagos state, activities by different stakeholders in both private and public sectors, are currently fragmented.\n“To drive initiatives around job creation, it is critical to developing a system that provides accurate and reliable data on the current job status of residents of Lagos state.\nA platform where multiple stakeholders can collaboratively synergize their information, expertise, and activities towards achieving the common goal – job creation and employment.\n“We would like to develop and implement, enforcing policies for sustainable advancement in the relevant areas; which is the creation of jobs, special creation of decent jobs."
  },
  {
    "headline": "Electoral Act: We’re killing this country — Ozekhome tackles NASS",
    "summarized_story": "By Joseph Erunke, AbujaHUMAN rights activists and constitutional lawyer, Chief Mike Ozekhome, has berated the National Assembly over the passage of the Electoral Act Amendment that forbids the electronic transmission of results.\nThe renowned lawyer while faulting the lawmakers for their action, noted that they have murdered democracy in the country.\nSpeaking, Saturday, in Abuja while delivering a special lecture at the 2021 graduation ceremony/prize-giving ceremony of the Pace setters’ School, Abuja, Chief Ozekhome regretted that the concept of democracy was no longer in practice in the country.\nDescribing the action of both chambers of the legislature as a national tragedy, he regretted that the ruling class was never considered the interest of Nigeria and its people at heart.\n“The national tragedy in the last two days at the National Assembly is for the sole interest of politicians in order to rig election."
  },
  {
    "headline": "Leave our land, protesting Delta women tell Fulani herdsmen",
    "summarized_story": "Hundreds of women from Okpara Inland and Orhoakpor communities in Ethiope-East Local Government Area of Delta State have staged a peaceful protest over the deadly activities of Fulani herdsmen and their cows on their farmlands and communities.\nThe women, who bore branches of leaves, chanted solidarity songs as they asked the Fulani herdsmen to vacate their lands, stressing that their activities are unbearable.\nIn a chat with newsmen, one of the women simply identified as Mrs. Patience U., noted that they had complained to some chiefs but they were not given listening ears.\nAccording to her, the fulani herdsmen and their cows destroy their crops.\nMrs. Patience said they have been deprived of their farm businesses as a result of the deadly and abominable activities of the herdsmen."
  },
  {
    "headline": "I warned Nigerians in 2015 about this 'evil' govt",
    "summarized_story": "Bishop David Oyedepo, President and founder of the Living Faith Church Worldwide, has described President Muhammadu Buhari’s administration as evil filled with wilderness.\nOyedepo who was speaking on the power of prophecy, said he warned Nigerians in 2015 prior to President Buhari’s victory, stressing that some fellows were angered by his prophecy until they are now faced with the reality.\n“Some fellows were upset with me when I was talking against this evil government.\n“I told this Nation, you are heading for trouble: 2015.\n“When a Prophet speaks, he speaks the heart of God”."
  },
  {
    "headline": "IGP charges Abuja woman for allegedly blackmailing ex-Imo Gov, Ohakim",
    "summarized_story": "The Inspector-General of Police, IGP, has charged an Abuja-based woman, Mrs Chinyere Amuchiena Igwegbe, for allegedly blackmailing and supplying false information against a former Governor of Imo State, Dr Ikedi Ohakim.\nIn a petition to the IGP, Mrs Igwegbe had accused Ohakim of conspiracy, criminal intimidation, defamation of character, attempted kidnapping and threat to her life.\nThe police however claimed that the allegations were unsubstantiated during their investigation and that they were aimed at blackmailing her victims.\nIgwegbe, among other false information, alleged that Ohakim alongside Okpareke threatened to release a nude photograph of her to the general public through social media.\nAGF, IGP in power tussle over trial of Ex-Imo Gov, Ohakim"
  },
  {
    "headline": "Bishop Oyedepo states position on partisan politics, joining political party",
    "summarized_story": "The President and Founder of the Living Faith Church Worldwide, also known as Winners Chapel Worldwide, Bishop David Oyedepo has revealed that he would “never” join any political party to contest for any political position in his life.\nAccording to Oyedepo, God has placed him above all political positions in the country, including the presidency.\nHe said, “Will I ever be in a political party in my life?\n“I knew God has positioned me far above all nations even when I was not above a town or a street.\nTB Joshua: I can’t be friends with all ministers of God – Oyedepo"
  },
  {
    "headline": "Eid el-Kabir: Be security conscious, police warn Jigawa residents",
    "summarized_story": "The Nigeria Police Force has warned the general public to be conscious and report any suspicious movement to the nearest police station or other security agencies for immediate action.\nPolice Commissioner in Jigawa State, CP Usman Sule Gomna made the warning in a press statement issued to DAILY POST in Dutse, the Jigawa State capital.\nHe said the command will collaborate with other security agencies and all critical stakeholders to ensure that the celebration is peaceful and hitch-free.\nHe assured that the Jigawa State Police Command will continue to perform its statutory responsibility of protection of lives and properties of citizens in the state before, during and after the celebration.\nThe CP however extended his warm greetings to all Muslim faithful and other citizens in the state as they celebrate Eid el-Kabir."
  },
  {
    "headline": "NDLEA arrests Anambra drug kingpin, recovers 548,000 Tramadol tablets",
    "summarized_story": "By Nicholas Kalu, AbujaThe National Drug law Enforcement Agency (NDLEA) has arrested a major illicit drug kingpin in Anambra, Okeke Chijioke.\nBabafemi said Okeke’s arrest on Saturday, July 10, 2021, followed credible intelligence and surveillance, which confirmed he stocked his warehouse with the illicit drug.\n“The drug was equally labeled 100mg pain reliever on its packs to avoid scrutiny, while laboratory tests confirmed it’s a 225mg drug.\nADVERTISEMENT“In a related development, a notorious interstate drug dealer, Godiya Linus, based in Taraba but supplies narcotics to dealers in Adamawa has been arrested in Numan area of the state.\n“A drug dealer, Mohammed Ali had earlier been arrested on 10th July with 1.150kg of diazepam in Numan."
  },
  {
    "headline": "Ooni installs Kolade as Iyalaje Oodua",
    "summarized_story": "By Toba Adedeji, OsogboOoni of Ife Oba Adeyeye Ogunwusi has installed a socialite, businesswoman and philanthropist Dr Toyin Kolade as Iyalaje of Oodua.\nThe installation took place at the weekend at the Palace of the traditional ruler.\nADVERTISEMENTThe monarch urged her to work more for the promotion of Yoruba culture and tradition.\nKolade described her installation as a divine call to duty.\nShe also called for cooperation that would enhance trade and commerce among the people of the race."
  },
  {
    "headline": "Viral Lagos amputee hawker buys N17.5m house",
    "summarized_story": "By Alao AbiodunThe worst seems to be over for the Oshodi, Lagos amputee water hawker, Mary Daniel.\nShe acquired a house at Igando, a surburb of Lagos from the N25 million raised for her when her story went viral.\nThe building came at a cost of N17.5 millionand will serve as her residence and ‘pure water’ factory.\nShe was well known in Oshodi where she used to hawk ‘pure water’ in traffic.\nThe story moved many Nigerians and the Lagos State Government to raise N25 million for her rehabilitation."
  },
  {
    "headline": "Special squad commissions command office in Ogun",
    "summarized_story": "THE Special Tactical Squad (STS), team of the Nigerian police, attached to the Inspector General of Police to tackle high profile criminal activities of armed robberies, kidnappings, banditry and other heinous crimes yesterday commissioned its command office in Aiyetoro, Ogun State.\nSpeaking at the event, Commander IGP-STS Abuja, Deputy Commissioner of Police (DCP) Kollo Yusuf, who was represented by ACP Akinlolu Okunola Esq, said: “It’s the passion of the IGP, to stem the tide of criminality in our country and has deployed the best hands to ensure that such activities are subdued to the barest minimum within the ambit of the law of the land.\n“I call on our Royal fathers and our responsible community leaders and residents to continue the collaborative engagements in ensuring that communities are rid of criminal elements.\nADVERTISEMENT“We should know that policemen are not extraterrestrial agents who will know everything, we should therefore endeavour to give our men adequate information necessary to carry out the responsibility of protecting our communities and nation as a whole.” He said.\nDCP Kallo continued by asking for the full cooperation of dwellers of Aiyetoro/Itele with Superintendent of Police ‘Toyin Omosebi who has been doing a great job in sustaining the security of not only this community but every assignment given to her."
  },
  {
    "headline": "BREAKING: COVID-19 3rd wave: FG puts Lagos, FCT, five other states on red alert",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has put six States and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against a third wave of the COVID-19 pandemic.\nThis follows the confirmation of the Delta Variant of COVID-19 and the rising number of infections and hospitalization in the country.\nAccording to a statement by Secretary to the Government of the Federation/Chairman Presidential Steering Committee on COVID-19, Boss Mustapha, the states are Lagos, Oyo, Rivers, Kaduna, Kano, Plateau and the FCT.\nMustapha stressed that ‘these steps are critical as we begin to see worrisome early signs of increasing cases in Nigeria.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "I don’t regret my love with my ex-boyfriend in BBNaija –Mercy Eke",
    "summarized_story": "By Agatha EmeadiBig Brother Naija star, Mercy Eke, has continued to shine as a sought-after brand ambassador after winning the BBNaija Reality Show (Pepper Them edition) in 2019.\nAs a sought-after brand ambassador, have you rejected any endorsement since you came out of the House?\nBut recently, Payporte unveiled me as their brand ambassador because we agreed on terms and conditions and I promise to represent them well.\nAs a fashion brand ambassador, tell us about the things you like to wear?\nMy fashion brand, M&M Luxury, which is a fashion brand that everyone can afford to be up there."
  },
  {
    "headline": "BIM-MASSOB to UN: There won’t be peace in Nigeria until you recognise Biafra",
    "summarized_story": "From George Onyejiuwa, OwerriLeader of BIM-MASSOB, Chief Ralph Uwazuruike has told the United Nations that there would be no peace in Nigeria until the sovereign state of Biafra is duly recognised by the world body.\nBut in 1976, immediately after the Biafra-Nigeria civil war, the military government of Nigeria promulgated the Decree of 1976 which invested all lands in Nigeria to the state governors.\nSo, all the 36 governors are owners of the lands in Nigeria and the Federal Government owns the capital territory, Abuja.\nBut because of his position as the president of Nigeria and a Hausa/Fulani man, he wants to enforce it against our will.\n“In Biafra land, which is in the Southern Nigeria, our lands are blessed with crude oil deposits, and fertile."
  },
  {
    "headline": "For The Records: Igbo still surrounded by lingering pain of defeat –Bianca Ojukwu",
    "summarized_story": "This decision was so craftly implemented to neutralize an entire generation of Igbo officers and edge out the Igbo from ever rising within the Army.\nFifty years on, the Igbo remain structurally disadvantaged in the Nigeria Armed Forces as well as inadequately represented.\nWhether this program has achieved its lofty objectives in terms of integration of ethnic groupings or not, has been subject to controversy.\nThe admission guidelines in unity secondary schools and tertiary institutions prescribed certain cutoff marks state to state.\nThe Igbo have become a people denied the cure for the ravages of a war which ended with a ‘No victor, No vanquished’ slogan, but yet a people surrounded by the lingering pain of defeat…."
  },
  {
    "headline": "Ngige to IPOB: I’ve no hands in re-arrest of your leader",
    "summarized_story": "From Adanna Nnamani, AbujaMinister of Labour and Employment, Senator Chris Ngige, has warned the Indigenous Peoples of Biafra (IPOB) to stop linking him to the re-arrest of its leader, Nnamdi Kanu.\nSo, this so-called IPOB intelligence Unit-M Branch report is nothing but massive tissues of lies from the pit of hell, as it concerns the Minister.\n“Firstly, Ngige did not at any time pay a visit to the British High Commissioner to Nigeria, to discuss the affairs of IPOB.\nDuring this ‘chance encounter’, there was never a time the affairs of the proscribed IPOB came up.\nHe is a patriot and firm believer in a united and indivisible Nigeria based on justice, equity and fair play."
  },
  {
    "headline": "CORE Demands Release Of Five #BuhariMustGo Protesters, Nnamdi Kanu",
    "summarized_story": "The Coalition for Revolution (CORE) has asked the Department of State Services (DSS) to release the five youths that were arrested for wearing #BuhariMustGo branded shirts.\nCORE, in a statement on Saturday by Baba Aye and Gbenga Komolafe, Co-conveners of the movement, also condemned the arrest of Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu.\nThe regime's lies about the extent of that dastardly demonstration of state terrorism have been torn aside at the Lagos State panel.\n“Evidence of the killing of at least 98 people has been presented to the Lagos State panel, with autopsy reports backing these.\nConsequently, the Lagos panel intends to wind up proceedings by 19 July, despite tons of unresolved cases before it."
  },
  {
    "headline": "CORE Demands Release Of Five #BuhariMustGo Protesters, Nnamdi Kanu",
    "summarized_story": "The Coalition for Revolution (CORE) has asked the Department of State Services (DSS) to release the five youths that were arrested for wearing #BuhariMustGo branded shirts.\nCORE, in a statement on Saturday by Baba Aye and Gbenga Komolafe, Co-conveners of the movement, also condemned the arrest of Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu.\nThe regime's lies about the extent of that dastardly demonstration of state terrorism have been torn aside at the Lagos State panel.\n“Evidence of the killing of at least 98 people has been presented to the Lagos State panel, with autopsy reports backing these.\nConsequently, the Lagos panel intends to wind up proceedings by 19 July, despite tons of unresolved cases before it."
  },
  {
    "headline": "BREAKING: Suspected Fulani Herdsmen In ‘Custom Uniform’ Currently Attacking Oyo Community, Igangan",
    "summarized_story": "Igangan, a southern Oyo town that shot to prominence amid Yoruba-Fulani tensions early this year, is currently under attack again, SaharaReporters has gathered.\nA source said the gunmen, who disguised in custom uniform, stormed the town on Friday night, shooting sporadically.\n“Igangan is under attack presently, the attackers wore a custom uniform to deceive the villagers,” he said.\nThe latest attack is coming a few weeks after over 20 people were killed when gunmen suspected to be Fulani herders attacked the community.\nSunday Adeyemo, popularly known as Sunday Igboho, had in February issued an eviction notice to herders in the area, after blaming them for insecurity in the area."
  },
  {
    "headline": "BREAKING: Suspected Fulani Herdsmen In ‘Custom Uniform’ Currently Attacking Oyo Community, Igangan",
    "summarized_story": "Igangan, a southern Oyo town that shot to prominence amid Yoruba-Fulani tensions early this year, is currently under attack again, SaharaReporters has gathered.\nA source said the gunmen, who disguised in custom uniform, stormed the town on Friday night, shooting sporadically.\n“Igangan is under attack presently, the attackers wore a custom uniform to deceive the villagers,” he said.\nThe latest attack is coming a few weeks after over 20 people were killed when gunmen suspected to be Fulani herders attacked the community.\nSunday Adeyemo, popularly known as Sunday Igboho, had in February issued an eviction notice to herders in the area, after blaming them for insecurity in the area."
  },
  {
    "headline": "BREAKING: Suspected Fulani Herdsmen In ‘Custom Uniform’ Currently Attacking Oyo Community, Igangan",
    "summarized_story": "Igangan, a southern Oyo town that shot to prominence amid Yoruba-Fulani tensions early this year, is currently under attack again, SaharaReporters has gathered.\nA source said the gunmen, who disguised in custom uniform, stormed the town on Friday night, shooting sporadically.\n“Igangan is under attack presently, the attackers wore a custom uniform to deceive the villagers,” he said.\nThe latest attack is coming a few weeks after over 20 people were killed when gunmen suspected to be Fulani herders attacked the community.\nSunday Adeyemo, popularly known as Sunday Igboho, had in February issued an eviction notice to herders in the area, after blaming them for insecurity in the area."
  },
  {
    "headline": "Ex-CPC chairman: There was agreement Tinubu would become president after Buhari",
    "summarized_story": "Rufai Hanga, pioneer national chairman of the Congress for Progressive Change (CPC), says there was an agreement that Bola Tinubu, former Lagos governor, would take over from President Muhammadu Buhari when he completes his second term in office in 2023.\nAdvertisementCPC was Buhari’s party before the merger with ACN and ANPP gave rise to the All Progressives Congress (APC).\nThe former federal lawmaker said Tinubu did not leave the APC after Buhari’s first term because of the purported agreement.\nThere was an implied agreement.\n“There was an implied agreement that he would take over."
  },
  {
    "headline": "Ex-CPC chairman: There was agreement Tinubu would become president after Buhari",
    "summarized_story": "Rufai Hanga, pioneer national chairman of the Congress for Progressive Change (CPC), says there was an agreement that Bola Tinubu, former Lagos governor, would take over from President Muhammadu Buhari when he completes his second term in office in 2023.\nAdvertisementCPC was Buhari’s party before the merger with ACN and ANPP gave rise to the All Progressives Congress (APC).\nThe former federal lawmaker said Tinubu did not leave the APC after Buhari’s first term because of the purported agreement.\nThere was an implied agreement.\n“There was an implied agreement that he would take over."
  },
  {
    "headline": "Dare me and get treatment you deserve, Matawalle warns deputy",
    "summarized_story": "Bello Matawalle, governor of Zamfara state, says he will not tolerate any disrespect or insubordination from Mahdi Aliyu, his deputy.\nWhile Zamfara lawmakers at both the state and federal level left with Matawalle, Aliyu remained in the PDP.\nThe deputy governor later held a political rally to reaffirm his loyalty to the PDP.\n“As governor of the state, I promised to work together with the deputy governor irrespective of our political affiliations.\n“The deputy governor should have notified me of whatever he planned to do."
  },
  {
    "headline": "Dare me and get treatment you deserve, Matawalle warns deputy",
    "summarized_story": "Bello Matawalle, governor of Zamfara state, says he will not tolerate any disrespect or insubordination from Mahdi Aliyu, his deputy.\nWhile Zamfara lawmakers at both the state and federal level left with Matawalle, Aliyu remained in the PDP.\nThe deputy governor later held a political rally to reaffirm his loyalty to the PDP.\n“As governor of the state, I promised to work together with the deputy governor irrespective of our political affiliations.\n“The deputy governor should have notified me of whatever he planned to do."
  },
  {
    "headline": "COVID-19 third wave: FG puts six states, FCT on red alert",
    "summarized_story": "The Presidential Steering Committee on COVID-19 (PSC) has placed six states and the federal capital territory (FCT) on red alert amid fears of a third wave of the pandemic.\n“The states are: Lagos, Oyo, Rivers, Kaduna, Kano, Plateau and the FCT,” the statement reads.\n“The PSC, however, warns that all States of the Federation should heighten their state of preparedness and continue to enforce all protocols put in place, given the renowned greater ease of spread of the Delta variant.\nThese steps are critical as we begin to see worrisome early signs of increasing cases in Nigeria.\nAdvertisement“Nigerians and all Residents are reminded to stay safe, always.”"
  },
  {
    "headline": "Apple’s new MagSafe battery pack just made power banks cool again",
    "summarized_story": "Well, I wonder what they’d say when they see Apple’s new MagSafe Battery Pack.\nThe MagSafe Battery pack sports a battery capacity of 1460mAh at 7.62V.\nCompared to other magsafe power banks, like Anker’s PowerCore Magnetic 5K Wireless with its 5000mAh battery, Apple’ new battery pack just doesn’t cut it.\nAccording to Apple Insider, the MagSafe Battery Pack might fully charge an iPhone 12 or iPhone 12 Pro with little issue.\nIf you charge your iPhone and MagSafe Battery Pack at the same time, your iPhone might charge to 80% or higher before your MagSafe Battery Pack begins charging."
  },
  {
    "headline": "Why food-on-demand can be Gokada’s ticket to super app stardom",
    "summarized_story": "But in its boldest step since it was founded in January 2018 by Fahim Saleh, Gokada now identifies as a super app.\nGokada’s super app is entering the market at a time when Lagos residents are consuming ₦5 trillion ($12 billion) worth of food annually.\nSo why a super app?\nLike Grab in Singapor and Gozem in francophone Africa, Gokada’s super app journey started with transportation | Graphic by Boluwatife Sanso/TC InsightsBut as Yinka Adegoke explained in this insightful piece, apps become super by offering essential services within large markets.\nPerfecting this cycle also means paying attention to renowned global food delivery services like Doordash, Grubhub, UberEats and Deliveroo."
  },
  {
    "headline": "Westa.Solar sets its sights on West Africa after debut in Nigeria",
    "summarized_story": "Westa.Solar was recently launched as a joint venture between Oolu Solar, a solar home systems provider and RP Global, a renewable energy investment company.\nThe new company offers solar systems that range from 50kW to 5MW and has commenced operations in Nigeria.\nThe plant at Petrichor represents a perfect start to life for Westa.Solar, a company that has its sights set on the larger West African market.\n“This is the first of what we hope will be many solar power projects for C&I companies,” Akinboye said.\nOver the next five to ten years, the company aims to become the leading commercial and industrial renewable energy provider in the region."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Smileys, hearts, sad eyes and the rise of a new digital language",
    "summarized_story": "While technology has reduced physical communication, it has also helped us keep in touch where actual meetings are impossible.\nApparently, World Emoji Day is a big deal.\nIntriguingly, World Emoji Day is celebrated on July 17 because Apple’s iOS calendar emoji have the same date.\nSurprisingly, the smiling face emoji symbolises dismissiveness to Chinese people rather than happiness.\n“Although we feel the same things, the way we express them may differ across cultures.”This year’s World Emoji Day promises the release of emoji 14.0."
  },
  {
    "headline": "Nigeria’s PayTV antitrust laws, AIfluence’s $1m seed round, PoS business in Nigeria",
    "summarized_story": "Good day,Today, I’m discussing:Proposed antitrust laws for Nigeria’s PayTV servicesAIfluence’s $1m seed roundPoS business in NigeriaProposed antitrust laws for Nigeria’s PayTV servicesDStv dish.\nThe laws will keep PayTV services in check, regulate their prices, and reduce the possibility of any provider monopolising the market.\nAdvertisementIn Nigeria, the satellite TV sector is dominated by MultiChoice — the South African company that owns DStv and GOtv — and Chinese-owned StarTimes.\nRecall last week, we reported that Nigeria’s Federal Inland Revenue Service (FIRS) directed commercial banks to freeze MultiChoice Nigeria Limited and MultiChoice Africa’s accounts to recover ₦1.8 trillion in taxes from the companies.\nAlso, per Statista, the number of PoS payments increased significantly from 34 million in 2015 to 438.6 million in 2019."
  },
  {
    "headline": "Twitter’s disappearing posts feature, Fleets, fails to catch user attention",
    "summarized_story": "Microblogging platform, Twitter, on Wednesday, July 14, 2021, announced that its disappearing posts feature, Fleets, will no longer be available on the platform.\nLaunched on August 17, 2020, Fleet was Twitter’s way of getting those who don’t tweet regularly to do so.\nSocial media and disappearing postsDisappearing posts was first seen on Snapchat with its introduction of Stories in October 2013.\nStatista also reveals that daily WhatsApp status users were up to 500 million in Q1 2019.\nWith no available data on other platforms’ disappearing posts feature usage, could this mean we’ll see more apps scrap it?"
  },
  {
    "headline": "Covid-19: FG places six States on red alert",
    "summarized_story": "The Presidential Steering Committee on COVID-19 has placed six states on red alert, following the rising cases of infections of the Delta Variant of the coronavirus.\nMustapha revealed that there has been a rising number of infections since the confirmation of the Delta Variant of COVID-19.\nRead Also: Covid-19 Delta variant: The time to act is now!\nAccording to the statement “The Presidential Steering Committee on COVID- 19 (PSC), has put six States and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against a third wave of the pandemic.\nOgun state has 10, Oyo 8, Rivers 8, while Ekiti and the Federal Capital Territory FCT have 4 new infections each."
  },
  {
    "headline": "Worsening insecurity exposes Nigeria’s weak governance strategy",
    "summarized_story": "Fingers are pointing to weak governance strategy as a major drawback at confronting the monster.\nLast week, the leadership of the House, led by Speaker Femi Gbajabiamila submitted the Report to President Muhammadu Buhari for possible implementation.\nStan-Labo decried the worsening insecurity, lamenting that “We are losing Nigerians on a daily basis.\nIn recent times, the security situation has deteriorated and assumed a frightening proportion.\nAccording to him, “I think it is glaring that President Buhari and his people are confused; where in the world is this sort of killings and atrocities going on."
  },
  {
    "headline": "Electronic voting: Without card reader people will just sit down and write names – Yerima",
    "summarized_story": "Therefore, as far as I am concerned, my constitution both party and national, has not barred me from contesting for Presidency.\nPeople will just sit down and write names and say we have so, so number of people.\nAs far as I am concerned one day we are going to go for electronic voting.\nDo you have the knowledge of APC Constitution?\nThe APC Constitution is very clear, President is leader of APC in Nigeria and every Governor is the leader of APC in his State."
  },
  {
    "headline": "Edo-GIS has attracted investment in agric, real estate, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the ease and convenience in processing title documents for landed property has opened the state for economic growth and attracted several investors.\nManaging Director, Edo State Geographic Information Service Agency (EdoGIS), Arch.\nFrank Evbuomwan, disclosed this in a chat with journalists in Benin City, Edo State.\nAccording to Evbuomwan,“For the first time in the history of the State, prospective investors have confidence in land registration in the state.\nFurthermore, several private investors in hospitality and real estate business have come to EdoGIS and found a simplified and faster process of getting government titles for their lands."
  },
  {
    "headline": "Edo reiterates commitment to sports devt, makes case for handball leagues in states – Nigerian Observer",
    "summarized_story": "Philip Shaibu, has advocated for the establishment of state handball leagues across Nigeria in a bid to make handball a major sport in Nigeria.\nAccording to the deputy governor, “We need the Handball Federation to make it mandatory for all states in Nigeria to have handball leagues.\nWe should have a state handball league.\n“In the past, you cannot qualify to play in the National League, until you qualify from the state league.\nOcheho said that the competition has exposed a lot of talents to the Federation, assuring that the future of handball in Nigeria is bright."
  },
  {
    "headline": "Obaseki launches new campaign to improve sanitation, end open defecation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday in Benin City, launched the “Clean Nigeria: Use the Toilet” campaign to drive sustainable sanitation and end open defecation across the 18 local government areas of the state by 2025.\nObaseki, who was represented by the Edo Head of Service, Mr. Anthony Okungbowa, said the campaign will raise awareness and get more stakeholders involved in ensuring a serene, cleaner and safer Edo.\nIn his remarks, the Minister of Water Resources, Suleiman Adamu, implored the people of Edo to own and drive the campaign in their respective communities to help eradicate open defecation.\nAdamu, who was represented by the Director, Water Quality and Sanitation, Mr. Emmanuel Awe, said the practice of open defecation which has a huge negative impact, especially on women and girls, could be stopped with everyone’s collective efforts.\nEarlier in her welcome address, Mrs. Mercy Omoregie, the General Manager Small Town and Rural Water Supply and Sanitation Agency (STRUWASSA), said it is saddening to see Edo identified among states with the prevalence of open defecation practice in Nigeria."
  },
  {
    "headline": "Edo e-procurement portal goes live, as govt reassures of transparency, accountability in process – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has launched an electronic public procurement system to ensure a transparent and accountable process in its public procurements.\nIdogun noted that Edo State has taken a bold step towards a better, transparent and accountable system in its public procurement process as the launch will guarantee a fair and seamless process.\nEdo is the second State to go live in the Federation as regards leveraging technology in public procurement.\nThis system will help the state have a transparent process without bias and not allowing manipulation due to human interference.\nHe is a dynamic personality; he is not looking at Edo State today but looking at Edo State in the future."
  },
  {
    "headline": "COVID-19 3rd Wave: Nigerian govt places six states, FCT on red alert",
    "summarized_story": "The affected states, which are spread across four of the country’s six geopolitical zones of South-west, South-south, North-West and North-central are Lagos, Oyo, Rivers, Kaduna, Kano, Plateau and the nation’s capital, FCT.\nOn eid prayerThe committee recommends the decentralisation of the eid prayer on the day of the festival.\nIt said rather than allowing large gatherings at community central prayer grounds, outside of the neighbourhood mosques where Friday prayers are usually said should be used for the eid prayer.\nThe event’s potential to attract large numbers of participants which may be difficult to control is said to have informed the committee’s recommendation.\nFCT to shut parksMeanwhile, the Abuja management has issued guidelines ahead of the Eid-el-Kabir celebrations, announcing the closure of recreation centres within the FCT throughout the festive period."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Vanguard Awards: Emefiele, Sanwo-Olu, Amaechi, others receive accolades",
    "summarized_story": "Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele; Lagos State Governor, Mr Babajide Sanwo-Olu; his Borno State counterpart, Professor Babagana Zulum; and business tycoon and philanthropist, Mr. Femi Otedola, among others, received accolades for their understanding accomplishments at the Vanguard Personality of the Year Award held at Eko Hotels, Lagos State on Saturday night.\nCBN under Mr. Emefiele had shown transparency, which had helped to stabilise the economy through interventions in the real sector of the economy.\nThe 2019 Vanguard Governor of the Year Award went to Dr Kayode Fayemi (Ekiti), Arakunrin Rotimi Akeredolu (Ondo), Malam Nasir el-Rufai (Kaduna) and Dr Okezie Ikpeazu (Abia).\nRotimi Amaechi (2019 Public Sector Icon of the Year).\nBode Olajumoke; elder statesman and politician, Alhaji Tanko Yakassai; administrator and philanthropist, Alhaji Mamman Daura; academic, Professor Adenike Grange; and educationist, Chief Winifred Awosika."
  },
  {
    "headline": "FG will take possession of repatriated Benin artefacts – Lai Mohammed",
    "summarized_story": "Nigeria’s minister of information and culture, Alhaji Lai Mohammed, has said the federal government will take possession of the repatriated Benin artefacts, but will take into cognizance the culture that produced the art works.\nRecall that the German government said it would return the 1,130 looted Benin bronzes to Nigeria in 2022.\nIn 1897, the Benin kingdom, which was well-known for its rich cultural heritage and artefacts, was invaded by British soldiers, in what is now known as the Benin invasion of 1897.\nSince the process of repatriation began, the Benin palace and the Edo government have been at loggerheads over who will house the historical and precious artefacts.\nAccording to him, the repatriated bronzes are not the property of the Edo state government but that of the Benin kingdom."
  },
  {
    "headline": "Nigeria’s inflation rate down to 17.75% in June – NBS",
    "summarized_story": "Nigeria’s inflation rate fell slightly from 17.93 per cent in May to 17.75 per cent in June, according to latest Consumer Price Index report for June released by the National Bureau of Statistics (NBS).\nThis represents 0.18 per cent fall in the inflation rate.\nPart of the report read, “The consumer price index which measures inflation (rate of change in the increase in prices) increased by 17.75 per cent (year-on-year) in June 2021.\nThe urban inflation rate increased by 18.35 per cent (year-on-year) in June 2021 from 18.51 per cent recorded in May 2021, while the rural inflation rate increased by 17.16 per cent in June 2021 from 17.36 per cent in May 2021.\nThis is higher than 16.09 per cent reported in May 2021, while the corresponding rural inflation rate in June 2021 was 15.36 per cent compared to 14.94 per cent recorded in May 2021"
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Kaduna Lawmaker Faults NBC On Directive To TV, Radio Stations",
    "summarized_story": "The member representing Chikun/Kajuru Federal Constituency, Rt.\nHon Yakubu Umar Barde, has described as strange, a directive by the National Broadcasting Commission (NBC) to television and radio stations in Nigeria not to divulge “details” of the activities of bandits, terrorists and kidnappers in their reports.\nKidnappings have continued unabated, just yesterday, two young men were killed by bandits in Kagurdna Village, Kakau Ward in Chikun local government.\n“Who would have told the world our stories or which platform would I have used to let the world know the predicaments of my people?\nADVERTISEMENT“As an elected representative, I have used the media to give suggestions on possible solutions to this menace by advocating the use of technology and seeking foreign assistance for our security agencies."
  },
  {
    "headline": "Kaduna Lawmaker Faults NBC On Directive To TV, Radio Stations",
    "summarized_story": "The member representing Chikun/Kajuru Federal Constituency, Rt.\nHon Yakubu Umar Barde, has described as strange, a directive by the National Broadcasting Commission (NBC) to television and radio stations in Nigeria not to divulge “details” of the activities of bandits, terrorists and kidnappers in their reports.\nKidnappings have continued unabated, just yesterday, two young men were killed by bandits in Kagurdna Village, Kakau Ward in Chikun local government.\n“Who would have told the world our stories or which platform would I have used to let the world know the predicaments of my people?\nADVERTISEMENT“As an elected representative, I have used the media to give suggestions on possible solutions to this menace by advocating the use of technology and seeking foreign assistance for our security agencies."
  },
  {
    "headline": "I Remain PDP Candidate For Anambra Governorship—Ozigbo",
    "summarized_story": "A factional candidate of the Peoples Democratic Party (PDP) in the November 6 Anambra State gubernatorial election, Valentine Ozigbo, has said he remained the PDP candidate despite the exclusion of his name from the list of candidates recently released by INEC for the poll.\n“It is on record that the PDP had the most credible party primary ahead of the November 6 Anambra State governorship election,” the statement said.\nADVERTISEMENT“The development, in which aspirants congratulate the elected candidate, is novel in Anambra party politics.\nIt attests to the acceptability of the candidacy of Valentine Ozigbo and the transparency of the process from which he emerged.\n“We confirm that the PDP has forwarded only the name of Mr Valentine Ozigbo as its candidate for the election to INEC."
  },
  {
    "headline": "I Remain PDP Candidate For Anambra Governorship—Ozigbo",
    "summarized_story": "A factional candidate of the Peoples Democratic Party (PDP) in the November 6 Anambra State gubernatorial election, Valentine Ozigbo, has said he remained the PDP candidate despite the exclusion of his name from the list of candidates recently released by INEC for the poll.\n“It is on record that the PDP had the most credible party primary ahead of the November 6 Anambra State governorship election,” the statement said.\nADVERTISEMENT“The development, in which aspirants congratulate the elected candidate, is novel in Anambra party politics.\nIt attests to the acceptability of the candidacy of Valentine Ozigbo and the transparency of the process from which he emerged.\n“We confirm that the PDP has forwarded only the name of Mr Valentine Ozigbo as its candidate for the election to INEC."
  },
  {
    "headline": "FG Must Review Revocation Of Atala Oil Field – Ijaw Youths",
    "summarized_story": "Ijaw Youths, under the umbrella of Ijaw Youths Council worldwide have asked federal government to reconsider the revocation and re-award of Atala Oil Marginal Field (OML 46), which license was revoked by the government through Department of Petroleum Resources (DPR) in April 2020.\nAccording to the Ijaw Youths, Bayelsa State, which has kept faith with federal government in sustaining peace and security of the region deserves the ‘right of first refusal’ in the decision to re-award the Atala Oil Marginal Field (OML 46).\nGovernor Diri had, on Wednesday reacted to the issue publicly for the first time amid the controversy it had generated in recent times, expressing shock over federal government’s revocation of the oil field.\nHe said the marginal oil field remained the state’s prized asset to which it was sentimentally attached and urged the federal government to reconsider its decision on the matter.\nADVERTISEMENTAccording to Ebilade, the state government who is rightful owner of the Atala Oil Marginal Field (OML 46) should have been granted the right of first refusal before it’s revoked and re-awarded."
  },
  {
    "headline": "Tokyo: Our athletes can spring surprises – Amuneke",
    "summarized_story": "Gold medallist in the football event of the Atlanta ‘96 Olympics and former Super Eagles assistant coach Emmanuel Amuneke said any of Team Nigeria athletes at the Tokyo 2020 Olympics can spring a surprise and win a medal for the country.\nIn a chat with our correspondent, Amuneke said the U-23 team, which won gold for Nigeria in 1996, were not given any chance, but they shocked the world to emerge victorious.\n“Our chances are bright, the good thing is that apart from football, we have other athletes that are going to participate in the Olympics.\nIn 1996, nobody expected that Nigeria would win the football gold medal, this was also the same with Chioma Ajunwa, who also won a gold medal.\nSo, there’s hope and there’s a possibility, but it all depends on the level of preparation and the level of confidence,” Amuneke told SUNDAY PUNCH."
  },
  {
    "headline": "Tokyo: Our athletes can spring surprises – Amuneke",
    "summarized_story": "Gold medallist in the football event of the Atlanta ‘96 Olympics and former Super Eagles assistant coach Emmanuel Amuneke said any of Team Nigeria athletes at the Tokyo 2020 Olympics can spring a surprise and win a medal for the country.\nIn a chat with our correspondent, Amuneke said the U-23 team, which won gold for Nigeria in 1996, were not given any chance, but they shocked the world to emerge victorious.\n“Our chances are bright, the good thing is that apart from football, we have other athletes that are going to participate in the Olympics.\nIn 1996, nobody expected that Nigeria would win the football gold medal, this was also the same with Chioma Ajunwa, who also won a gold medal.\nSo, there’s hope and there’s a possibility, but it all depends on the level of preparation and the level of confidence,” Amuneke told SUNDAY PUNCH."
  },
  {
    "headline": "DSS keeps mum over alleged arrest, detention of three Israelis in Anambra",
    "summarized_story": "The Department of State Services (DSS) kept mum up till yesterday evening over the alleged arrest and detention of three Israeli filmmakers by its operatives in Anambra State on July 9.\nThe Israelis were in Nigeria to film “We Were Never Lost,” a documentary exploring Jewish communities in African countries such as Kenya, Madagascar, Uganda and Nigeria.\nIn their statement, the families explained that the filmmakers had brought gifts for the communities hosting them.\nThe filmmaking crew acts as a guest visiting the country and its various communities – there are no political overtones.\nHe is a patriot and firm believer in a united and indivisible Nigeria based on Justice, Equity and Fair-play."
  },
  {
    "headline": "DSS keeps mum over alleged arrest, detention of three Israelis in Anambra",
    "summarized_story": "The Department of State Services (DSS) kept mum up till yesterday evening over the alleged arrest and detention of three Israeli filmmakers by its operatives in Anambra State on July 9.\nThe Israelis were in Nigeria to film “We Were Never Lost,” a documentary exploring Jewish communities in African countries such as Kenya, Madagascar, Uganda and Nigeria.\nIn their statement, the families explained that the filmmakers had brought gifts for the communities hosting them.\nThe filmmaking crew acts as a guest visiting the country and its various communities – there are no political overtones.\nHe is a patriot and firm believer in a united and indivisible Nigeria based on Justice, Equity and Fair-play."
  },
  {
    "headline": "Customs men responsible for Igangan attack",
    "summarized_story": "By David AdeoyeOyo State Government said men of the Nigeria Customs Service raided Igangan and other parts of Ibarapa areas of the state on Friday night, not herdsmen.\nThe team, accompanied by the traditional rulers and community leaders, visited scene of the incident at Igangan, Ayete, Tapa, and Igbo-Ora.\nThe Customs also confirmed that it was its men that were erroneously described as herdsmen.\nFederal Operations Unit Customs Public Relations Officer Theophilus Duniya said three of its officials and a soldier were injured in a shootout with the smugglers.\n“Eight trucks carrying contraband foreign parboiled rice were spotted by the injured Customs Officials, who are operatives of the Zone A, Federal Operations Unit, whose drivers and armed accompanying passengers launched an attack on the officers."
  },
  {
    "headline": "Pope Francis makes first public appearance after surgery",
    "summarized_story": "By Muhaimin OlowoporokuPope Francis has made his first public appearance on Sunday since returning to the Vatican mid-week after an 11-day stay at a hospital.\nThe 84-year-old pope had part of his colon removed in an operation on July 4 the first time that Francis has faced a significant health concern during his eight-year papacy.\nWhile speaking, the pontiff told well-wishers to take a break and switch off from the stress of modern life.\nLet us learn how to take a break, to turn off the mobile phone,” Pope Francis said in his weekly address from a window overlooking St. Peter’s Square.\nPope Francis also called for an end to the recent public unrest in South Africa and called for peace and dialogue in Cuba."
  },
  {
    "headline": "NCDC: COVID-19 still a menace, new cases recorded",
    "summarized_story": "By AbankulaNigeria Centre for Disease Control (NCDC) has warned Nigerians against a false belief that they are no longer endangered by COVID-19.\nNCDC boss, Dr Chikwe Ihekweazu gave the warning on Saturday in Abuja on a day that 123 cases were reported.\nHe sounded the warning at a webinar for members of the National Youth Service Corps (NYSC) 2021 Batch B.\nOn Saturday, the NCDC reported 123 new cases of COVID-19 with Lagos registering 70 of the.\nAkwa Ibom reported 18 cases for two days, while Ogun logged 10."
  },
  {
    "headline": "Women Take Over Nigerian Banks: Story of Fidelity, FCMB, GTB, Others",
    "summarized_story": "NNEKA ONYEALI-IKPE, FIDELITY BANKNneka Onyeali-Ikpe was appointed as managing director/chief executive officer, Fidelity Bank on January 1, 2021.\nLike Ms Nneka, she is also the first ever female director to lead GTB in its 31-year years of existence.\nShe has two decades experience, working in Allstates Trust Bank, Zenith Bank, Inland Bank Plc, Oceanic Bank Plc and Ecobank Nigeria Limited.\nIRETI SAMUEL-OGBU, CITIBANKAfter 36 years of operating in Nigeria, Citibank Nigeria Limited appointed a female director in September 2020.\nTOMI SOMEFUN, UNITY BANKTomi Somefun was appointed as MD/CEO of Unity Bank Plc in August 2015 with over 35 years post qualification experience."
  },
  {
    "headline": "SERAP Gives Buhari-led Government 24 Hours To Withdraw NBC Order On Reporting Of Terrorist Attacks In Open Letter",
    "summarized_story": "Read the following statement:We would be grateful if the repressive directive is withdrawn within 24 hours of the receipt and/or publication of this letter.\nSuch words and phrases may function to interpret legitimate reporting by broadcast stations, journalists, and other Nigerians as unlawful.\nConversely, imposing impermissible restrictions on broadcast stations, journalists and other Nigerians undermine the security that builds a healthy and vibrant society.\nThe NBC directive to broadcast stations fails to meet the requirements of legality, necessity, and proportionality.\nThe NBC directive may also create an environment that unduly deters and penalizes broadcast stations and journalists, and the reporting of government wrongdoing more generally."
  },
  {
    "headline": "Bishop Oyedepo speaks on joining political party, states position on politics",
    "summarized_story": "The President and Founder of the Living Faith Church Worldwide, also known as Winners Chapel Worldwide, Bishop David Oyedepo has revealed that he would “never” join any political party to contest for any political position in his life.\nAccording to Oyedepo, God has placed him above all political positions in the country, including the presidency.\nHe revealed that he got the revelation from God even before his wealth emerged.\nHe said, “Will I ever be in a political party in my life?\n“I knew God has positioned me far above all nations even when I was not above a town or a street."
  },
  {
    "headline": "Dapo Abiodun Renames TASCE After Awujale",
    "summarized_story": "On Saturday, Ogun State Governor Dapo Abiodun announced that the Tai Solarin College of Education, Omu-Ijebu, will be renamed Sikiru Adetona College of Science, Education, and Technology.\nAccording to Abiodun, he opted to rename the institution after the Awujale of Ijebuland, whose efforts improved science and technology education instruction and research in the state.\nThe governor, who spoke at the APC’s campaign for the next council election in Odogbolu town, Odogbolu Local Government Area, said education had played a significant part in the state’s progress.\nYou can all see that the political temperature of Ogun State is so low, there is rest of mind.\nAbiodun revealed that 56 projects had been completed in Odogbolu, noting that the Ala-Omu and Idowa-Ibefun roads had just been approved for building."
  },
  {
    "headline": "Pictures: Taekwondo athlete, Elizabeth Anyanacho, in first training session at Kisarazu Japan days to Olympics battle",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: In Tokyo, Elizabeth Anyanacho, officials receive Taekwondo brand new gears, kits for Olympics",
    "summarized_story": "Taekwondo star Elizabeth Anyanacho alongside Olympian Chika Chukwumerije and Secretary General Kabir Yusuf on Friday recieved and unveiled brand new gears and kits from South Korea.\nBranded by Motor company, Olympian to be Anyanacho currently at her training camp in Japan later wore and displayed the wears.\nAn excited Anyanacho while expressing her feeling said, “Yea, it looks good.\nI can’t wait to train and get ready for the contest.”"
  },
  {
    "headline": "Subsidy saga: Govt’s stance, citizens’ dilemma",
    "summarized_story": "Alas, it was not too long before the government reverted to status quo with the NNPC once again funding subsidy.\nThe actual consumption of petroleum products in Nigeria is also not ascertained to determine the amount of subsidy the Nigeria government pays to importers.\n“The NNPC refineries have been running below capacity for over 20 years and the government has not done anything about it.\n“The petroleum products directly impact the daily living of Nigerians and removal of subsidy without commensurate cushion will increase the hardship in the country,” he said.\nRegrettably, the Nigerian State is complicit and remains the number one stumbling block to finding solutions to the subsidy saga."
  },
  {
    "headline": "2023 Elections and the PDP big decision -NigPilot",
    "summarized_story": "Therefore, invariably this is the year of PDP and her horde of members to decide; a big decision indeed.\nThe stuff of this big decision in the forthcoming PDP National Convention will either make or mar the PDP.\nThe future of PDP lies in the new restructuring, new zoning realignments, and the eventual big decision.\nThis tussle led to fission of interest in PDP, whereby the northern PDP governors pitted ferociously against President Jonathan.\nThe second is the zone where PDP has more PDP governors, the third is the governorship experience of aspirants, and the fourth will be the Age of an aspirant."
  },
  {
    "headline": "2023 Elections and the PDP big decision -NigPilot",
    "summarized_story": "Therefore, invariably this is the year of PDP and her horde of members to decide; a big decision indeed.\nThe stuff of this big decision in the forthcoming PDP National Convention will either make or mar the PDP.\nThe future of PDP lies in the new restructuring, new zoning realignments, and the eventual big decision.\nThis tussle led to fission of interest in PDP, whereby the northern PDP governors pitted ferociously against President Jonathan.\nThe second is the zone where PDP has more PDP governors, the third is the governorship experience of aspirants, and the fourth will be the Age of an aspirant."
  },
  {
    "headline": "Danbaba emerges as new Senate Deputy Minority Whip -NigPilot",
    "summarized_story": "Senator Ibrahim Danbaba representing Sokoto South Senatorial District on the platform of the People’s Democratic Party, PDP, has emerged as the new Deputy Minority Whip of the Senate.\nDanbaba replaces Senator Sahabi Ya’u (Zamfara North) who on July 21, 2021, defected from the opposition PDP to the ruling All Progressives Congress, APC.\nAccording to Ya’u, his decision to resign his membership of the PDP was necessitated by the endemic crisis that engulfed the Zamfara State chapter of the party which led the national body to dissolve the state exco of the party.\nConsequently, Danbaba’s nomination as the new Deputy Minority Whip was conveyed in a letter by the national body of the PDP and read yesterday by the Senate President, Dr. Ahmad Lawan during plenary.\nThe letter which was signed by the National Secretary, Senator Ibrahim Umar Tsauri reads: “As Mr. President is aware of the very unfortunate defection of the former Deputy Senate Minority Whip, Distinguished Senator Sahabi Ya’u Kaura from the Peoples’ Democratic Party to the All Progressives Congress (APC), the leadership of PDP studied and reviewed the unfortunate development."
  },
  {
    "headline": "Danbaba emerges as new Senate Deputy Minority Whip -NigPilot",
    "summarized_story": "Senator Ibrahim Danbaba representing Sokoto South Senatorial District on the platform of the People’s Democratic Party, PDP, has emerged as the new Deputy Minority Whip of the Senate.\nDanbaba replaces Senator Sahabi Ya’u (Zamfara North) who on July 21, 2021, defected from the opposition PDP to the ruling All Progressives Congress, APC.\nAccording to Ya’u, his decision to resign his membership of the PDP was necessitated by the endemic crisis that engulfed the Zamfara State chapter of the party which led the national body to dissolve the state exco of the party.\nConsequently, Danbaba’s nomination as the new Deputy Minority Whip was conveyed in a letter by the national body of the PDP and read yesterday by the Senate President, Dr. Ahmad Lawan during plenary.\nThe letter which was signed by the National Secretary, Senator Ibrahim Umar Tsauri reads: “As Mr. President is aware of the very unfortunate defection of the former Deputy Senate Minority Whip, Distinguished Senator Sahabi Ya’u Kaura from the Peoples’ Democratic Party to the All Progressives Congress (APC), the leadership of PDP studied and reviewed the unfortunate development."
  },
  {
    "headline": "D’Tigers will make Africa proud at Tokyo Olympics —Mike Brown -NigPilot",
    "summarized_story": "… We’re battle-ready- OkaforD’TIGERS of Nigeria Head Coach, Mike Brown has hinted that the team wants to represent Africa the best way they can at the Tokyo Olympics even D’Tigers star, Jahlil Okafor also boasted that he is optimistic about the chances of the team succeeding in Tokyo.\nAccording to Okafor, the team will work hard to maintain their high standards during the Games.\nReacting after the massive win against Argentina, Jahlil Okafor, said the team is riding on confidence and ready to compete against any team.\nThe D’Tigers defeated world giants the United States and Argentina in a preparatory game for the Olympics, which is expected to start on 23rd July.\nOkafor scored 15points and had 7rebounds on his debut for Nigeria against Nigeria on a night that D’Tigers defeated the number four ranked team 94-71pts."
  },
  {
    "headline": "We Have Capacity For Electronic Transmission In Remote Areas – INEC",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) on Saturday suggested it has the capacity to transmit election results electronically from remote areas across the country.\nLawmakers in both chambers of the National Assembly had been at loggerheads over electronic transmission of results earlier in the week.\nThe House was thrown into disarray on Thursday as members debated section 52(2) of the electoral amendment act bill, which deals with electronic transmission.\nAccording to the lawmakers opposed to sacrosanct electronic transmission of results, some parts of the country do not have the required network coverage.\n“We have uploaded results from very remote areas, even from areas where you have to use human carriers to access,” he said."
  },
  {
    "headline": "FG To Take Possession Of Returning Benin Bronzes – Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Lai Mohammed, on Saturday said the Federal Government will be responsible for taking possession of the 1,130 Benin bronzes to be returned by Germany.\n“The Federal Government is aware of the widely reported controversy on who will take possession of the Benin bronzes when they are returned from Germany,” Mr Mohammed said on Saturday at a press conference in Lagos.\nThe return of the bronzes, looted by Britain from Benin-city in the 19th century, had recently generated some controversy in Edo State.\n“We agreed to have a definite timeline for the repatriation of the artefacts because Nigeria is tired of an indefinite timeline,” he said.\n“We made our Germany counterparts realise that Nigeria is averse to attaching preconditions to repatriating the Benin bronzes."
  },
  {
    "headline": "Panic As Gunmen Injure Customs Officers, Soldier In Igangan Community",
    "summarized_story": "While residents claim that the attack was carried out by armed herdsmen, the Nigeria Customs in a statement on Saturday said they were smugglers.\nAccording to the Nigeria Customs, three officers and a soldier were injured during the attack carried out which was carried out on Friday night.\n“The injured Customs Officers who are operatives of the Zone A, Federal Operations Unit, sighted eight trucks carrying smuggled foreign parboiled rice whose drivers and armed accompanying passengers launched an attack on the officers.\nThe statement added that an investigation has been launched to arrest and prosecute the attackers and the attacked customs officers and a soldier, including one that was shot in the head, are receiving treatment.\nAt least 11 people were killed after gunmen attacked the community earlier in June."
  },
  {
    "headline": "#EndSARS: Again, Lagos Panel Gets Three-Month Extension",
    "summarized_story": "The tenure of the Lagos State Judicial Panel on Restitution for Victims of SARS Related Abuses and other matters has again been extended for another three months.\nThe Chairman of the panel, Justice Doris Okuwobi stated this while hearing petitions on Friday.\nRecall that the Lagos State judicial panel was inaugurated by Governor Babajide Sanwo-Olu of Lagos State on October 27, 2020.\nThe initial six months sitting of the Lagos panel expired on April 27, 2021, and the panel was granted a three-month tenure extension which is supposed to expire on Monday, July 19 but as of June 29, the panel had sat for 97 days and only heard 126 petitions out of the 235 petitions it received.\nAt Friday’s sitting, the panel heard eleven petitions."
  },
  {
    "headline": "How Can You Become A Space Tourist?",
    "summarized_story": "Virgin Galactic uses a massive carrier plane, which takes off from a horizontal runway then drops a rocket-powered spaceplane.\nSpace Hero, an upcoming show, says it plans to send the winner of a competition to the International Space Station (ISS) in 2023.\nDespite the promise of spectacular views, the balloon ascends only 19 miles — far from the boundary of space, and weightlessness.\nElon Musk’s company is also getting into the space tourism game, but its plans involve journeys that are far longer.\nThe mission, named Ax-1, is being organized by the company Axiom Space, which has signed up for three other future flights with SpaceX."
  },
  {
    "headline": "Governor Akeredolu bags Vanguard’s ‘Governor Of The Year Award’",
    "summarized_story": "Ondo State Governor, Arakunrin Oluwarotimi Akeredolu, SAN, on Saturday, bagged the ‘Governor of the Year’ Award.\nGovernor Akeredolu received the award from Vanguard Newspaper at the Vanguard Personality Award 2021, which was held at the Convention Centre, Eko Hotel & Suites, Victoria Island, Lagos.\nAdvertisementGovernor Akeredolu was accompanied by his wife, Arabinrin Betty Anyanwu-Akeredolu and the deputy Governor, Hon.\nWale Akinterinwa, Special Adviser to the Governor on Multilateral and Inter-Governmental Affairs, Mrs Bunmi Ademosun, Special Adviser to the Governor on Rural and Community Development, Hon.\nAdvertisementAccording to the Vanguard Newspaper, the award was given in honor of Governor Akeredolu’s monumental achievements in Ondo state’s infrastructure development."
  },
  {
    "headline": "Covid-19 Third Wave : PSC puts six states and the FCT on red alert",
    "summarized_story": "Six states and the Federal Capital Territory have been placed on red alert by the Presidential Steering Committee.\nThe measure was adopted after the confirmation of the Delta variant of Covid -19, as well as the escalating incidence of infections and hospitalizations across the country, according to a statement signed by the committee’s chairman, Boss Mustapha.\nIn addition to the Nation’s Capital, the Six states are Lagos, Oyo, Rivers, Kaduna, Kano and Plateau State.\nThe Presidential Steering Committee urged all state governments and religious leaders to be mindful of the potential for wider spread of the virus during large gatherings while felicitating with the Muslim faithful on the occasion of Eid-el-Kabir.\nThe committee also warned all State of the federation to heighten their state of preparedness and continue to enforce all protocols put in place, given the renowned greater ease of Spread of the Delta variant."
  },
  {
    "headline": "Community leaders insist invaders of Ibarapa were men of the Nigeria Customs",
    "summarized_story": "The Oyo State Government has said that contrary to the widely circulated report that unknown gunmen had, again, attacked Igangan and other parts of Ibarapa on Friday, community leaders have declared that the invaders were men of the Nigeria Customs Service.\nPolitical and traditional leaders of Ibarapa axis described the evening raid on the Igboora and other communities in Ibarapa by men of the Nigeria Customs Service as unnecessary and not well-thought-out.\nThe leaders condemned the act, saying that the Customs Service troubled the peace of the area when its men stormed Ibarapa land and shot sporadically.\nAccording to him, the raid left so much turmoil in our communities as the Customs men came, shooting sporadically.\nThe Nigeria Customs Service had earlier claimed that the attack was carried out by some armed smugglers."
  },
  {
    "headline": "Amid Dispute Between Oba of Benin and Edo Governor, FG to ‘Take Possession’ of Repatriated Benin Artefacts",
    "summarized_story": "The remarks on the heels of the controversy between the Oba of Benin Ewuare II and the Governor of Edo State Mr Godwin Obaseki over who should take possession of the artefacts.\n“Gentlemen, the Federal Government is aware of the widely-reported controversy on who will take possession of the Benin Bronzes when they are returned from Germany.\nHe said the antiquities consisted of two important Benin Bronzes and an exquisite Ife Bronze head.\n– In March 2021, the University of Aberdeen in Scotland agreed to return a Benin Bronze from its collections.\n– The University of Cambridge in the United Kingdom has also agreed to return a disputed Benin artefact."
  },
  {
    "headline": "‘The Town Has Been Destroyed’: Germany Deals with Aftermath of Worst Natural Disaster in 60 Years",
    "summarized_story": "“The town has been destroyed, everything really, streets and houses,” Brandt told Al Jazeera.\nIn Germany, at least 133 people have died, making it the worst natural disaster to hit the country in almost 60 years.\nIn nearby Blessem, the waters filled a gravel quarry, triggering a landslide that collapsed several houses and a historic castle.\nThe disaster has once again forced climate to the front of the political agenda just months before federal elections.\nBut for now campaigning has been suspended and politicians are focused on assisting the victims and mourning the dead."
  },
  {
    "headline": "Martine Moïse, Wife of Slain President, Returns to Haiti",
    "summarized_story": "Martine Moïse, the wife of Haiti’s assassinated president who was injured in the July 7 attack at their private home, returned to the Caribbean nation on Saturday following her release from a Miami hospital.\nShe was greeted by Interim Prime Minister Claude Joseph and other officials.\nJoseph has been leading Haiti with the backing of police and the military despite the fact that Moïse had announced his replacement a day before the president was killed.\nA U.N. spokesman declined comment except to say that the U.N. is part of the group that issued the statement.\nOn July 11, a delegation of representatives from the U.S. Department of Justice, Department of Homeland Security, Department of State, and National Security Council traveled to Haiti."
  },
  {
    "headline": "Europe Flooding Toll Over 180 as Rescuers Dig Deeper",
    "summarized_story": "The death toll from flooding in Western Europe climbed above 180 on Sunday after rescue workers dug deeper into debris left by receding waters.\nPolice put the toll from the hard-hit Ahrweiler area of western Germany’s Rhineland-Palatinate state at 110 and said they feared the number may still rise.\nIn neighboring North Rhine-Westphalia state, Germany’s most populous, 45 people were confirmed dead, including four firefighters.\nChancellor Angela Merkel was due to visit Schuld, a village near Ahrweiler that was devastated by the flooding, later Sunday.\nThere was flooding Saturday night in the German-Czech border area, across the country from where last week’s floods hit, and in Germany’s southeastern corner and over the border in Austria."
  },
  {
    "headline": "Nigeria: Lagos, 5 Other States, Federal Capital on Red Alert Over Third Covid Wave",
    "summarized_story": "Nigeria’s federal government has put six states and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against the third wave of Covid-19.\nIn addition to the FCT, the six states are Lagos, Oyo, Rivers, Kaduna, Kano and Plateau.\nThe Chairman, PSC, who also doubles as the Secretary to the Government of the Federation, Mr Boss Mustapha, signed the statement.\nHe said the steps were critical as there were worrisome early signs of increasing cases in the country.\nIt reminded Nigerians and all residents to ensure they stay safe at all time."
  }
]