[
  {
    "headline": "Catholic group condemns killings, wants Ishaku to resettle IDPs",
    "summarized_story": "The St. Augustine Tiv Catholic Community in Jalingo diocese on Sunday condemned the rising insecurity in the country, especially the recent killings in Jos, Benue and other parts of the country.\nThe Catholic community which express deep worry that the country was being turned into a killing field called on the President, Major Gen. Muhammadu Buhari (retd.\nWhile lamenting the killings, mass abduction of innocent school children and other forms of criminality across the nation, the Catholic community called on Nigerian leaders to urgently address the issues before the country gets to a point of no return.\n“Most families in the central zone of the State have lost their sources of livelihood and have been denied access to their farmlands since 2014.\n“The crisis in Southern Taraba in 2019 through 2020 have equally forced people into internally displaced persons (IDPs) camps without any hope of when to return to their ancestral land."
  },
  {
    "headline": "Police rescue kidnapped student, arrest six suspects in Kwara",
    "summarized_story": "The Police Command in Kwara says it has rescued the abducted Kwara State University student, Khadijat Isiaq, and arrested six suspects.\nThis is contained in a statement issued by the command’s Police Public Relation Officer, SP Okasanmi Ajayi, on Saturday in Ilorin.\nAjayi said that the victim, a 300 Level female student of Mass Communication, KWASU, Malete, was kidnapped on August 23, at Okoru Village, near Malete at about 9.30pm.\nAccording to him, operation conducted in rescuing the abducted student was in accordance with the support of the Inspector-General of Police, IGP Usman Alkali Baba.\nAjayi said that assorted weapons used in the kidnap were recovered from the suspects."
  },
  {
    "headline": "Welcome back! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "You have successfully logged out! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "Yusuf’s colourful marriage marks Buhari, Osinbajo’s major engagements",
    "summarized_story": "President Muhammadu Buhari commenced the week under review on a joyful mood as he attended a luncheon organised for Yusuf and Zahra Buhari.\nLalong said President Buhari pledged that support would be given to victims of the violent clashes in the state.\nAlso Vice-President Yemi Osinbajo, on Aug. 26, presided over the virtual meeting of the National Economic Council (NEC) at the State House, Abuja.\nPermanent Secretary, State House, Mr Tijjani Umar, gave the warning at the inauguration of the State House Anti-Corruption and Transparency Unit on Aug. 27, in Abuja.\nThe Gross Domestic Product (GDP) grew by 5.01 per cent in Q2, 2021, following 0.51 per cent growth in Q1 2021."
  },
  {
    "headline": "I’ve not stepped down- Secondus",
    "summarized_story": "…Says mandate ends in DecemberBy Dirisu YakubuEmbattled chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus has denied media reports that he has stepped down from office.\nThe statement read: “Prince Secondus by his unavoidable absence at the party’s National Executive Committee, NEC, meeting on Saturday was merely obeying an interim order from Cross River state High Court.\n“As a law abiding citizen who has been an adherent of rule of law as a basis for democracy, stayed away in respect for the courts.\n“Prince Secondus’ four year mandate to lead the party given on December 10, 2017 ends by December, 2021.\n“By this release, media office wishes to urge media houses and members of the public particularly beloved members of PDP to disregard any news suggesting that he has stepped down.”Vanguard News Nigeria"
  },
  {
    "headline": "Nigeria first police professor in service opens up on tools to fight crime effectively in Nigeria",
    "summarized_story": "ExcerptsBy Emma Nnadozie, Crime EditorLast place of workI served for 28 years at Force CID Alagbon, Central Registry, Lagos.\nDetecting activities in crime scenesActivities in the crime scene, that one will also pay a lot.\nPolice that are serving in various places should be trained, they should know more about this forensic, about detecting crime.\nWe need to use graphs to analyze crime, to know crime statistics in particular places but the problem we are going to also have is finance.\nOnce they are trained on finger print, crime scene that’s forensic, they should be able to record finger print of suspects."
  },
  {
    "headline": "Plateau: Murder of 230 Igbos in Jos, fake news, malicious rumour – Police",
    "summarized_story": "The Police Command in Plateau has described as fake, the speculations that unidentified persons killed 230 Igbos in Jos.\nASP Ubah Ogaba, the Police Public Relations Officer (PPRO) of the command, dismissed the report in a statement on Sunday in Jos.\nThe social media had been agog with reports that a luxurious bus conveying commuters of Igbo extraction was set ablaze, killing 230 passengers, in Jos.\nThe PPRO called on members of the public to disregard the dangerous rumour or fake news and go about their lawful businesses.\nThe spokesperson also urged residents to report all suspicious movements, emergencies or distress to the nearest police formation for a prompt response."
  },
  {
    "headline": "Niger: Released Tegina Islamiyya school students reunited with parents",
    "summarized_story": "All the released pupils of the Salihu Tanko Islamiyya school, Tegina, in Rafi Local Government Area of Niger have been reunited with their parents.\nThe Head Teacher of the school, Alhassan Garba disclosed this to newsmen on Sunday in Minna.NAN reports.\n“I personally supervised the handover of the pupils to their parents on Friday and Saturday.\nThe headteacher said he personally picked up the pupils at a village called Gwaska in Birnin Gwari Local Government Area of Kaduna State.\nNiger: Anger as Gov Bello travels abroad amid kidnap of children, security challenges"
  },
  {
    "headline": "FG resumes cash transfer in Akwa Ibom, Lagos, Ogun",
    "summarized_story": "The Federal Government has resumed payment to beneficiaries of Household Uplifting Programme (HUP) under the Conditional Cash Transfer (CCT) Scheme.\nThe Focal Person, National Social Investment Programme (NSIP) in Akwa Ibom, Godwin Akpan, said disbursements have been made in Ukanafun and Oruk Anam Local Government Areas.\nIn Lagos, Commissioner for Wealth Creation and Employment, Yetunde Arobieke said 6,810 persons/households had benefited from the CCT since inception.\nThe State Focal Person said the transfer of N5,000 per month to beneficiaries is paid every two months.\n”A total of 6,810 beneficiaries from six targeted LGAs (Apapa, Amuwo-Odofin, Epe, Ibeju-Lekki, Lagos Island and Badagry) have been benefitting”, she added."
  },
  {
    "headline": "Forced marriage: Kano teenager who killed husband released on state pardon",
    "summarized_story": "The federal government has confirmed the pardon granted Rahma Hussein, a native of Kano, convicted of murder.\nIn 2014, at the age of 16, the child bride was charged with culpable homicide after killing her husband to protest her forced marriage.\nA statement on Sunday by Umar Gwandu, spokesman to Justice Minister, announced Rahma and 30 other inmates were released from the Kano correctional centre.\nNineteen were released after payment of fines by the Justice Ministry; 3 freed after payment by the Buni Yadi Foundation; 2 released after payment by Policy Vault Africa.\n“Representatives of UNODC and Buni Yadi Foundation were also present to lend their voice and support to the release of Rahma”, the statement added."
  },
  {
    "headline": "Plateau killings: Attacks on villagers, affront to national security – Atiku",
    "summarized_story": "Former Vice-President of Nigeria, Atiku Abubakar, has condemned the killings in parts of Plateau State.\nLast week, suspected gunmen attacked and killed 36 persons in Yelwa Zangam community in Jos North LGA.\nReacting, Atiku in a tweet on Sunday said the recent attack is an affront on Nigeria’s national security.\nThis recent attack on the city of Jos, like all others before it and everywhere else, is an affront to our national security.\nPlateau attack: Govt declares dusk to dawn curfew in three LGAs"
  },
  {
    "headline": "NDLEA arrests suspected kingpin for ingesting 87 wraps of cocaine",
    "summarized_story": "A suspected drug trafficker, Ibeh Kenneth Ejike, has been arrested by operatives of the National Drug Law Enforcement Agency (NDLEA) at the Nnamdi Azikiwe International Airport, Abuja for allegedly ingesting 87 wraps of cocaine.\nThe suspect was taken in upon arrival for secondary check during which he tested positive to ingestion of illicit substance.\nAccording to the statement, while under observation, he excreted 87 pellets of cocaine weighing 1.884 kilograms.\nIbeh, who imports cloths for sale, hails from Owerrizikeala village in Orumba Local Government Area of Anambra State, the statement revealed.\n“In Anambra state, operatives also raided the Onitsha main market, Marine Line on Thursday 26th August with the support of soldiers."
  },
  {
    "headline": "#BBNaija Shine Ya Eye: Tit bits from Saturday night party",
    "summarized_story": "The fifth Saturday night party had several highlights worth knowing.\nThe fun,which DJ Wysei dished out for the remaining 20 housemates, was immeasurable despite eviction lurking around the corner.\nDJ Wysei turned it upDJ Wysei dished out unlimited fun on the turntable, becoming the fifth DJ to play for the housemates in the BBNaija Shine Ya Eye edition.\nJackie B left Michael hangingIt turns out that Michael and Jackie B’s hope of sailing a relationship finally capsized during the fifth Saturday night party.\nCross unmoved despite eviction crossUndeniably the party beast, Cross displayed his usual positive vibe at the fifth Saturday night party."
  },
  {
    "headline": "Released Tegina Islamiyya school pupils reunited with parents",
    "summarized_story": "All the released pupils of the Salihu Tanko Islamiyya school, Tegina, in Rafi Local Government Area of Niger have been reunited with their parents.\n“I personally supervised the hand over of the pupils to their parents on Friday and Saturday.\nHe said the abductors of the pupils after collecting ransom insisted that he must personally go there and pick the children .\nMeanwhile, one of the mothers of the released children, Hajia Rabi Abubakar,said she was happy to have her two kids back.\nMeanwhile, one of the released pupils, Zuwaira Isa, said they trekked for almost four days in the forest before reaching a final destination."
  },
  {
    "headline": "NSA: no rift with Amnesty Administrator over tenure extension",
    "summarized_story": "The National Security Adviser (NSA) Major General Babagana Monguno (rtd) has dismissed as unfounded, reports that he is on war path with the Interim Administrator of the Presidential Amnesty Programme, Col. Milland Dixion Dikio (rtd), over tenure extension.\nHe urged stakeholders and Amnesty beneficiaries to the ongoing reforms of the programme.\nADVERTISEMENTAn online platform had reported that the NSA and the Amnesty boss are at loggerheads over tenure extension.\nOffice of The National Security Adviser, noted that the report “is false and concocted to stoke confusion and mislead the public”.\nFor the avoidance of doubt, the Interim Administrator of the Presidential Amnesty Programme enjoys the full support and confidence of the National Security Adviser”."
  },
  {
    "headline": "Ayuba, Runsewe, Tee Mac pay tributes to late Uwaifo",
    "summarized_story": "Nigerian Musicians, Adewale Ayuba, Omatshola Iseli popularly known as “Tee Mac” as well as Otunba Olusegun Runsewe, Director-General, National Council for Arts and Culture (NCAC), on Sunday paid tributes to late veteran musician, Victor Uwaifo who died on Aug.28 at 80.\nTee Mac said that the nation had lost a special musician who was always available to help young artistes and uplift the entertainment industry.\nAlso, Runsewe described late Uwaifo as a musician of a lifetime considering his huge contributions to the growth of the Nigerian entertainment industry.\nRunsewe noted that institutions and students also needed to study Uwaifo and his works, to spur their creativity in and inspire even unborn Nigerians.\n” Truly, he has paid his dues and to this, the NCAC will be immortalising him so that unborn Nigerians will know who Victor Uwaifo was,” he said."
  },
  {
    "headline": "Southern govs open grazing ban: One voice, divided action",
    "summarized_story": "All of us know what our people have suffered in terms of this open grazing.\nToday, all Nigerians have come to accept the reality that open grazing is no longer fashionable.\n“It is important to emphasize that our law against open grazing of cows is still operational.\nDeltaIn a twist difficult to understand, Delta State, where the decision to ban open grazing in southern Nigeria was taken, is yet to pass requisite law.\nHe said: “From my own perspective, the governors have just been using that issue of open grazing as political gimmick."
  },
  {
    "headline": "My father has been sleeping with me for over 7 years, teenager tells police",
    "summarized_story": "“I could no longer bear it and there was nobody I could tell this to because he always threatened to kill me if I exposed his action.\nThis made me run away from the house till I was invited by the police to come to the station.”The suspect, Akinsowon, who denied the allegation said: “It was her mother that cooked up the story against me just to tarnish my image in the society because she is no longer staying with me as my wife.\nI never slept with my daughter.” The State Police Public Relations Officer (PPRO), Funmi Odunlami, confirmed the arrest of the schoolteacher and said investigation into the matter had commenced.\nShe assured that the command would get to the root of the matter."
  },
  {
    "headline": "2023: Let’s work together, Tambuwal begs PDP members",
    "summarized_story": "The PDP has recently been embroiled in crisis as its leaders battle for supremacy ahead of the party’s national convention to elect a new leadership.\nHowever, on Thursday, a Kebbi State High Court, in Birnin Kebbi, issued an order asking Secondus to resume his functions as national chairman.\nIn another twist, a Federal High Court in Calabar, Cross River State, on Friday, restrained the PDP chairman from presiding over yesterday’s NEC meeting.\n“ Meanwhile, the PDP has said its national convention scheduled for October 30-31, will hold in the Federal Capital Territory (FCT), Abuja.\nThe PDP National Publicity Secretary, Kola Ologbondiyan, disclosed this, yesterday, while briefing journalists on the outcome of the 92nd meeting National Executive Committee (NEC) of the party."
  },
  {
    "headline": "Men run after me because of my plus-size – Mary John, actress",
    "summarized_story": "By Rita OkoyeBeautiful plus-size actress-cum-social media influencer, Mary John, has opened up on her sojourn in Nollywood, her love life, unique selling points and other issues.\nAs a plus size TV star, what are the issues you encounter on and off set?\nWhat are the main difficulties people of plus size encounter?\nIn Nollywood, Funke Akindele because she’s a strong woman with a funny character.\nI am a plus size model, an interior decorator and social media influencer."
  },
  {
    "headline": "PDP governors joining APC signal we’ll retain power in 2023 – Senator Osita Izunaso",
    "summarized_story": "Why should I entertain any fear when the governors of the PDP are joining us, the APC, on their own?\nSo, what is wrong in attending the meeting as major stakeholders of Imo State?\nIt is a misinterpretation of what is going on in the Imo APC.\nThe most popular person to govern Imo State is no longer alive, yet people still talk about him.\nAs a member of the Campaign Committee for Anambra governorship election, are you comfortable with the aftermath of the state party primaries?"
  },
  {
    "headline": "Secondus Absent as PDP NEC Approves October Convention",
    "summarized_story": "A Rivers State High Court had restrained Secondus from parading himself as the National Chairman of the party.\nSecondus had obtained a Kebbi High Court order to return to his desk as national chairman last Thursday following an earlier injunction obtained against him from a Rivers State High Court.\nBriefing journalists after yesterday’s NEC meeting, the National Publicity Secretary of the party, Mr. Kola Ologbondiyan, said, “NEC has resolved that Abuja will be the venue of the PDP National Elective Convention slated for October 31, 2021.\n“Media office of Prince Uche Secondus wishes to correct erroneous news circulating that he has stepped down as the National Chairman of the PDP.\n“Prince Secondus by his unavoidable absence at the party’s NEC meeting on Saturday was merely obeying an interim order from Cross River State High Court."
  },
  {
    "headline": "Nigeria Still Africa’s Biggest Economy after South Africa Rebased GDP",
    "summarized_story": "*South Africa’s GDP now $370bn, Nigeria’s $432bnGboyega AkinsanmiNigeria has maintained her position as Africa’s biggest economy after South Africa released the report of its rebased Gross Domestic Product (GDP) that pushed the latter’s economy up by 11 per cent, an analysis of a new report by Statistics South Africa (SSA), has revealed.\nThe rebasing of South Africa’s GDP coincided with the release of Nigeria’s latest GDP report, which showed a 5.01 per cent growth in the second quarter of 2021.\n“In terms of purchasing power parity (PPP), the World Bank currently ranks South Africa as the third biggest economy on the continent after Egypt and Nigeria.\nThe rebasing of South Africa’s GDP coincided with the release of Nigeria’s latest GDP report, which showed a 5.01 per cent growth in the second quarter of 2021.\nNigeria and South Africa are the two biggest economies in Africa."
  },
  {
    "headline": "THISDAY Disowns Fake Edition of Its Digital Newspaper",
    "summarized_story": "In a statement signed by the Managing Director of the newspaper, Mr. Eniola Bello, titled: ‘Fake Digital Edition of THISDAY Friday, 27 August 2021 in Circulation on Social Media,’ the media house described the purveyors of the cloned version as unscrupulous.\n“The attention of the management of THISDAY has been drawn to a fake version of our digital edition making the rounds on some social media platforms with the headline: ‘Shocking: Uzodinma declares Free Marriage Between Fulani Settlers and Imo Ladies’.\n“This fake version of our digital edition is being circulated on WhatsApp, Facebook, and other social media platforms.\nMeanwhile, Imo State Governor, Uzodimma, has also disowned the purported report on the cloned publication.\nThe statement advised the public to disregard the cloned publication as coming from depraved minds and enemies of the people and the society."
  },
  {
    "headline": "NNPC Spends N541.65bn on Petrol Subsidy in Six Months",
    "summarized_story": "Emmanuel Addeh in AbujaThe Nigerian National Petroleum Corporation (NNPC) expended N541.65 billion subsidy on petrol between February and July this year, a document detailing the national oil company’s presentation to the Federation Account Allocation Committee (FAAC) for August 2021, has shown.\nOn Friday, THISDAY reported that the corporation was again set to deduct about N215.3 billion from its contribution to next month’s joint federation account, being a combination of N175 billion subsidy sum and N40 billion Joint Venture (JV) cost recovery.\nThe data showed that NNPC paid N67.280 billion to the joint account in July, an improvement on the N47.162 billion in June, with the succeeding month’s payment being about N20 billion higher than that of June.\nTwo months ago, the NNPC told the nation that Nigeria was losing about 42 million litres of petrol to the activities of smugglers across the country’s borders, increasing Nigeria’s estimated daily consumption of 60 million litres to 103 million litres and worsening the subsidy payment regime.\nA THISDAY check-in July showed that the NNPC’s payment to the federation account had declined by over 63 per cent in the first five months of 2021."
  },
  {
    "headline": "Buhari, Obaseki Mourn as Joromi Crooner, Uwaifo Dies at 80",
    "summarized_story": "Deji Elumoye in Abuja and Adibe Emenyonu in Benin CityPresident Muhammadu Buhari and Edo State Governor, Mr. Godwin Obaseki have mourned the death of ‘Joromi’ crooner and highlife music icon and multi-instrumentalist, Sir Victor Uwaifo.\nThe music legend, whose song “Mammy Water,” was a hit for decades, died at the age of 80.\nMeanwhile, Edo State Governor, Mr. Godwin Obaseki, has also mourned the passing of legendary musician.\nAccording to him, “I received the news of the loss of legendary musician and art teacher, Prof. Victor Uwaifo, with shock and sadness.\n“He was talented, phenomenal and an illustrious son of Edo State who wowed the world with his array of skills, notably his music talent."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "BREAKING: Femi Otedola 'Accepts' PDP’s Offer To Run Against Ambode",
    "summarized_story": "Femi Otedola, a businessman and Chairman of Forte Oil PLC, has “accepted” the offer of a governorship ticket by the Peoples Democratic Party (PDP).\nPDP offers Femi Otedola governorship ticket.\nPDP offers Femi Otedola governorship ticket.\nAnd I am sure you feel the same way because we all envision a better Lagos, a Lagos of our dreams.\nI ask you to believe again and together, let’s achieve more,” Governor Ambode said."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "VERBATIM: What retired naval officer said on Channels TV about Boko Haram, NDA attack",
    "summarized_story": "“If you go to Defence Headquarters — I served at Defence Headquarters as the deputy director, defence administration between 2015 and 2017.\nThroughout my two years at Defence Headquarters, I received visitors only twice because of the strict security architecture at the Defence Headquarters.\nBoko Haram.\nThe centre of gravity is what they should look at and it is the sponsor of Boko Haram and bandits.\nAnd Defence Headquarters, army headquarters, naval headquarters, and the air force cannot do anything about that."
  },
  {
    "headline": "VERBATIM: What retired naval officer said on Channels TV about Boko Haram, NDA attack",
    "summarized_story": "“If you go to Defence Headquarters — I served at Defence Headquarters as the deputy director, defence administration between 2015 and 2017.\nThroughout my two years at Defence Headquarters, I received visitors only twice because of the strict security architecture at the Defence Headquarters.\nBoko Haram.\nThe centre of gravity is what they should look at and it is the sponsor of Boko Haram and bandits.\nAnd Defence Headquarters, army headquarters, naval headquarters, and the air force cannot do anything about that."
  },
  {
    "headline": "Amaechi: One day, the young boys we deprived will chase us out of Abuja",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says the political elite have wasted the country’s resources, depriving the youths of needed development.\nHe added that however, someday, “the young boys we deprived” will rise up and chase the government out of Abuja, the seat of power.\nThe only thing you will hear of Nigeria is that you should come to Abuja; that it is a fine city.\nIf we are not careful, we will be chased out of Abuja,” Amaechi said.\n“In the past, when I was the speaker and later, governor, I said we would wake up one day and the young boys we deprived would chase us out of town."
  },
  {
    "headline": "Amaechi: One day, the young boys we deprived will chase us out of Abuja",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says the political elite have wasted the country’s resources, depriving the youths of needed development.\nHe added that however, someday, “the young boys we deprived” will rise up and chase the government out of Abuja, the seat of power.\nThe only thing you will hear of Nigeria is that you should come to Abuja; that it is a fine city.\nIf we are not careful, we will be chased out of Abuja,” Amaechi said.\n“In the past, when I was the speaker and later, governor, I said we would wake up one day and the young boys we deprived would chase us out of town."
  },
  {
    "headline": "Grillo, Olaotan, Uwaifo… how Nigeria’s creative industry lost four icons in six days",
    "summarized_story": "Six days, four deaths; these are arguably not the best of times for the Nigerian creative industry following the demise of some of the biggest names in the sector in less than a week.\nAdvertisementBut barely four days after Grillo’s death, Victor Olaotan, the lead actor of ‘Tinsel’, the popular Nigerian soap opera, also passed away.\nAdvertisementAgain, Dike’s death sparked reactions with colleagues and movie lovers penning tributes to celebrate his illustrious career as an actor.\nIt’s sad.”AdvertisementA few hours after, the country’s creative industry was again struck by the news of the death of Victor Uwaifo, the veteran Nigerian highlife.\nFor years to come, the outgoing week would be remembered as one the Nigerian creative industry lost for big names to the cold hands of death."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Coronavirus: UAE opens travel to those vaccinated from Monday",
    "summarized_story": "The United Arab Emirates (UAE) has announced that it will resume issuing visas to all tourists fully vaccinated against the coronavirus from Monday.\nRead also: Nigerian fresh graduates and labour market challenges“The decision applies to citizens of all countries, including those arriving from previously banned countries,” WAM said.\nSince March, scheduled flights between Nigeria and the UAE have been stopped following a diplomatic row over COVID-19 protocol.\nThe UAE authorities had instructed Nigerian travellers at the Lagos and Abuja airports to take another PCR test on arrival in Dubai.\nBut Hadi Sirika, the minister of aviation, criticised the decision and termed it “discriminatory profiling” of Nigerian travellers."
  },
  {
    "headline": "Wanted: Courageous Nigerian soldiers",
    "summarized_story": "Nigerian soldiers were highly respected by their counterparts and civilians alike, across Africa because of their strength, discipline and high level of professionalism.\nAlso speaking, Yakubu Ali, a Nigerian war veteran, insisted that the Nigerian soldier is still the best on the continent, but needs fairness in treatment and good welfare.\nAccording to Sam Onikoyi, a Nigerian historian and Commonwealth researcher based in Brussels, the problem is leadership and not the soldiers.\nFor Ifewodor Ogala, a retired Navy officer, the Nigerian military is strong enough to dispel attacks on the entire West Africa, but there is an issue of trust.\nThose that invaded the Nigerian Defence Academy (NDA) just wanted to send across a message,” he said."
  },
  {
    "headline": "Soyinka chides Buhari over plans to review grazing routes",
    "summarized_story": "Wole Soyinka, a Nobel laureate, has faulted plans by President Muhammadu Buhari to go ahead with the reopening of grazing routes across Nigeria despite opposition to the plans.\nPresident Buhari had recently approved recommendations of a committee to review 368 grazing sites, across 25 states in the country, and to determine the levels of encroachment.\nBut speaking at a press conference, Friday in Lagos State, Soyinka noted that such idea was not in the best interest of Nigeria.\nAccording to him, “Virtually the whole nation is screaming that we do not want any open cattle grazing.\nWhether they go by the name of cattle routes or grazing reserves.”“Round the entire nation, we’ve had opinions surmounting the antiquated mode of cattle rearing."
  },
  {
    "headline": "PDP national convention to hold in Abuja – NEC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The National Executive Council of the Peoples Democratic Party (PDP) has approved Abuja as venue for the party’s elective national convention scheduled for Oct. 30 and Oct. 31.\nThe Party National Publicity Secretary, Mr Kola Ologbondiyan, disclosed this while reading the resolutions of the party’s 92nd NEC meeting held on Saturday in Abuja.\n“NEC has resolved that Abuja will be the venue of the PDP national elective convention slated for Oct. 30.\n“NEC will meet on Sept. 9, to approve the various nominations into the respective national convention committees.\n“I am sure that a new government of our party can return our nation to the path of peace stability and progress.”At the meeting were PDP governors, NEC members, BoT members, National Assembly caucus and states chairmen."
  },
  {
    "headline": "Obaseki mourns death of legendary musician, Prof. Victor Uwaifo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of legendary musician and art teacher, Prof. Victor Uwaifo, whose death was reported Saturday evening.\nThe governor, in a statement, expressed shock and sadness over the news of the passing of Prof. Uwaifo, noting that his death was a loss to Edo State, Nigeria and the Black Race.\nAccording to him, “I received the news of the loss of legendary musician and art teacher, Prof. Victor Uwaifo, with shock and sadness.\n“He was talented, phenomenal and an illustrious son of Edo State who wowed the world with his array of skills, notably his music talent.\n“An all-round artist, Prof. Uwaifo was an enigma, who made music for all, bringing the contemporary Benin culture to the world stage and providing vicarious experience of the peculiarities of our art and culture to a global audience.”The governor prayed that God will grant the Uwaifo family, friends, associates and well wishers the fortitude to bear the irreparable loss."
  },
  {
    "headline": "Edo Poly, ISPON set up Centre for Safety Studies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Polytechnic, Usen, and the Institute of Safety Professionals of Nigeria (ISPON) have set up a Centre for Safety Studies at the polytechnic to offer top-of-the-range training in Health, Safety and Environment (HSE).\nThe Rector of the Polytechnic, Prof. Abiodun Falodun, in a chat with journalists in Benin City, said the development is in line with the institution’s plan to become a go-to-place for technical education.\nAccording to him, “We have entered a partnership for the joint establishment of a Centre for Occupational Health, Safety, Security and Environmental Studies with the aim of jointly providing safety and allied training and certification for final year students of the Edo State Polytechnic to enhance their utilization in the public and private sectors upon their graduation.\nThis agreement also covers part-time students that may be admitted from time to time.”He added that the nature of education at the center includes trainings, lectures, seminars and workshops for basic health, Safety, Security and Environment (HSE), adding that the new centre adds to the wide array of professional education offered by the institution to contribute to the development and growth of the state and the country at large.\nProf. Falodun said the institution will continue to pursue similar partnerships to expand the scope of professional training at the polytechnic and provide a path for career growth for upwardly mobile professionals."
  },
  {
    "headline": "Edo, Delta to set up Bendel Commission to foster mutual cooperation on security, economy, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the government is commencing discussions with the Delta State Government to establish a Bendel Commission to foster mutual cooperation and collaboration in economic, security, cultural and environmental matters between the two states.\nObaseki disclosed this during a live broadcast to commemorate the 30th anniversary of Edo State.\nTo achieve our mission of MEGA comprehensively, we must involve our kit and kin in Delta State.\n“We are therefore commencing discussions to establish a Bendel Commission to foster mutual cooperation and collaboration in economic, security, cultural and environmental matters between Edo and Delta States,” he noted.\nWe have continued to invest in our youth through various programs spearheaded by the Edo Skills Development Agency (EdoJobs), which has given birth to numerous enterprises in the Edo Production Centres, Edo Tech Hub and Edo Creative Hub."
  },
  {
    "headline": "Our ordeals in the hands of bandits for 88 days – Freed Islamic school students",
    "summarized_story": "The bandits who kidnapped scores of Islamic school pupils in Niger State beat them daily and threatened to kill them if their families did not pay the ransom demanded, some of the students have said.\nOne of the pupils died in custody while the remaining 90 were freed on Friday after spending about 88 days in the custody of the kidnappers.\nThe OrdealOne of the released pupils, Zuwaira Isa, said they trekked for almost four days in the forest before reaching a final destination.\nParents SpeakMeanwhile, one of the mothers of the released children, Rabi Abubakar, said she was happy to have her two kids back.\n“We, the parents, have collectively agreed not to be discouraged by the recent activities of the bandits in preventing our children to acquire Islamic and western education."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Eligible customer regulation is still in force on eligible customer transactions – NERC",
    "summarized_story": "ON SEEKING ELIGIBLE CUSTOMER STATUSThe Eligible Customer Regulations was designed to provide a very simple process for securing eligibility status from the Commission for customer whose consumption is in excess of the minimum threshold of 2MWh/h over a period of one month.\n– The supplier (GenCo OR trading licensee) to the potential eligible customer should possess an unencumbered generation capacity to sell to other customers.\nThis is to ensure a continuity of supply to the eligible customer, in the event of a disruption by the contracted GenCo.\nOther reasons constraining the grant of eligible customer status to some major consumers of electricity include various litigations and/or objections to applications filed with the Commission.\nWe are committed to granting timely approvals to all applicants who have met the conditions for eligibility status as provided in the eligible customer regulations."
  },
  {
    "headline": "Legendary Nigerian musician Victor Uwaifo dies at 80",
    "summarized_story": "Celebrated Nigerian highlife musician, Sir Victor Uwaifo has died, aged 80.\nUwaifo died on Saturday in Benin, capital of Edo State, South-South, Nigeria, one of his children, Uwaifo Peter de Rock, said on his social media page on Saturday evening.\nProf sir Victor UWAIFO has gone to rest.\nThe late musician was Professor of Visual Arts at the University of Benin.\nSir Victor Uwaifo played the guitar with dexterity and he is known for his dancing steps."
  },
  {
    "headline": "U.S. residents indicted for attempts to illegally export arms to Nigeria",
    "summarized_story": "Three residents of Maryland, United States, face indictment for attempting to illegally export arms and ammunition to Nigeria.\nThe Department of Justice, U.S. Attorney’s Office, District of Maryland said the suspects allegedly exported arms and ammunition without obtaining export licenses, in violation of the Arms Export Control Act and the Export Reform Control Act.\nThe announcement, release on Friday, states:A federal grand jury has returned an indictment charging three Maryland men for the federal charges of conspiracy, violation of the Arms Export Control Act and the Export Reform Control Act, related to the export of firearms and ammunition from the United States to Nigeria.\nFinally, the indictment alleges that the defendants transported 28 firearms with obliterated serial numbers, including 18 rifles.\nActing United States Attorney Jonathan F. Lenzner commended HSI and the ATF for their work in the investigation."
  },
  {
    "headline": "Zenith Bank proposes N9.42bn interim dividend for half year 2021",
    "summarized_story": "Zenith Bank Plc has proposed to pay the total sum of N9.42 billion as interim dividends to its shareholders for the half year period ended 30th of June, 2021.\nThe interim dividend will be paid electronically to shareholders on the 20th of September, 2021, subject to appropriate withholding tax.\nShareholders must have completed the e-dividend registration and must have mandated the Registrar (Veritas Registrar Limited) to pay their dividends directly into their bank accounts.\nTo facilitate the payment, the financial giant noted that its register of shareholders will be closed on 13th of September, 2021.\nZenith had declared a half year profit of N106.12 billion in HY 2021, indicating a slight increase of about 2.2% YoY."
  },
  {
    "headline": "Pro-Saraki Group To Gift Fertiliser To North-Central, North-East Farmers",
    "summarized_story": "A political support group, Saraki Is Coming Door To Door 2023 organisation, is set to distribute fertiliser to low-income farmers in the North-Central and North-East geopolitical zones of the country.\nThe group said this is sequel to similar exercise in the North-West zone in the last two weeks.\nADVERTISEMENTHe noted that farmers in 12 States of North-Central and North-East zones are target beneficiaries of the gesture.\n“Needless to re-emphasise that we are doing this to show who our mentor, Dr. Abubakar Bukola Saraki, is.\n“This shows that when he take up another higher national assignment again, Nigerians will feel his humane and caring attributes in governance,” he said."
  },
  {
    "headline": "Pro-Saraki Group To Gift Fertiliser To North-Central, North-East Farmers",
    "summarized_story": "A political support group, Saraki Is Coming Door To Door 2023 organisation, is set to distribute fertiliser to low-income farmers in the North-Central and North-East geopolitical zones of the country.\nThe group said this is sequel to similar exercise in the North-West zone in the last two weeks.\nADVERTISEMENTHe noted that farmers in 12 States of North-Central and North-East zones are target beneficiaries of the gesture.\n“Needless to re-emphasise that we are doing this to show who our mentor, Dr. Abubakar Bukola Saraki, is.\n“This shows that when he take up another higher national assignment again, Nigerians will feel his humane and caring attributes in governance,” he said."
  },
  {
    "headline": "Yobe Marks 30th Anniversary With Special Prayer",
    "summarized_story": "The Yobe State government yesterday in Damaturu organized a special prayer to mark the 30th anniversary of its creation.\nThe chief imams in the 17 local government areas converged and attended the prayer conducted at Yobe Mosque and Islamic Centre, Damaturu.\nSpeaking after the prayer, Governor Mai Mala Buni noted that it was observed for peace and stability of the state and the country at large.\nThe governor also said he had requested all Christians across the state to also conduct special prayers on Sunday during church services.\n“The special prayer is to thank the Almighty God for sparing our lives to witness our 30th anniversary, and the improved peace, progress, unity and development recorded in the state within the period,” he said."
  },
  {
    "headline": "Yobe Marks 30th Anniversary With Special Prayer",
    "summarized_story": "The Yobe State government yesterday in Damaturu organized a special prayer to mark the 30th anniversary of its creation.\nThe chief imams in the 17 local government areas converged and attended the prayer conducted at Yobe Mosque and Islamic Centre, Damaturu.\nSpeaking after the prayer, Governor Mai Mala Buni noted that it was observed for peace and stability of the state and the country at large.\nThe governor also said he had requested all Christians across the state to also conduct special prayers on Sunday during church services.\n“The special prayer is to thank the Almighty God for sparing our lives to witness our 30th anniversary, and the improved peace, progress, unity and development recorded in the state within the period,” he said."
  },
  {
    "headline": "Market APC For 2023 Polls Despite Insecurity, Masari Tells Group",
    "summarized_story": "Governor Aminu Bello Masari of Katsina State has urged the Progressives Consolidation Group (PCG) to market their party, the All Progressives Congress (APC), by correcting the negative impression Nigerians have about the party because of the current insecurity in the country.\nHe stated this when he played host to the pro-Yemi Osibanjo group in his office yesterday, advising them to sell the party for the people to understand its tremendous efforts despite the security challenges and low incomes in the country.\nADVERTISEMENTHe said: “What is before us all is to work for APC towards winning the 2023 election.\nEarlier, the national coordinator of the group, Alhaji Ahmed Mohammed, said they were at the Government House, Katsina to seek his counsel and support to accelerate possibilities that would make Vice President Yemi Osibanjo continue the good work of President Buhari in 2023.\nHe added that the pro-APC group with membership from across every sector had begun the movement in 2019 because of the experience, capacity, eloquence and credibility."
  },
  {
    "headline": "Victor Uwaifo: All you need to know about the Guitar Boy",
    "summarized_story": "Victor Uwaifo: All you need to know about the Guitar BoyVictor Uwaifo: All you need to know about the Guitar BoyLegendary singer and guitarist, Sir Victor Uwaifo, is dead.\n“Prof Sir Victor Uwaifo has gone to restBlack Saturday for me nooow.\n“Victor Uwaifo is not just a friend to me, he was a man I respected so much.\nIn 2016, Victor Uwaifo was inducted into the Grammy Award Museum in Los Angelis, USA.\nHowever, 52 years after ‘Joromi’ ruled the airwaves, Uwaifo still regards the song as his greatest hit till date."
  },
  {
    "headline": "Victor Uwaifo: All you need to know about the Guitar Boy",
    "summarized_story": "Victor Uwaifo: All you need to know about the Guitar BoyVictor Uwaifo: All you need to know about the Guitar BoyLegendary singer and guitarist, Sir Victor Uwaifo, is dead.\n“Prof Sir Victor Uwaifo has gone to restBlack Saturday for me nooow.\n“Victor Uwaifo is not just a friend to me, he was a man I respected so much.\nIn 2016, Victor Uwaifo was inducted into the Grammy Award Museum in Los Angelis, USA.\nHowever, 52 years after ‘Joromi’ ruled the airwaves, Uwaifo still regards the song as his greatest hit till date."
  },
  {
    "headline": "Strike: Doctors can’t be above the law -Ngige",
    "summarized_story": "The Forum of Chairmen of Health Institutions in Nigeria has described the ongoing strike by the Nigerian Association of Resident Doctors as insensitive.\nThis is as Ngige described the industrial action as unjustifiable and unwarranted, noting that implementation of the Memorandum of Understanding signed on August 21 with doctors was on course.\nAll hope was that the meeting of last week where all the affiliates of the Nigerian Medical Association except NARD signed the MOU would resolve the strike.\n“Strike should be the last resort when every other effort has been exhausted in terms of finding a solution to whatever the problem is.\nBut for any little thing, you resort to disruption of services; it does not portray the country in good light."
  },
  {
    "headline": "Strike: Doctors can’t be above the law -Ngige",
    "summarized_story": "The Forum of Chairmen of Health Institutions in Nigeria has described the ongoing strike by the Nigerian Association of Resident Doctors as insensitive.\nThis is as Ngige described the industrial action as unjustifiable and unwarranted, noting that implementation of the Memorandum of Understanding signed on August 21 with doctors was on course.\nAll hope was that the meeting of last week where all the affiliates of the Nigerian Medical Association except NARD signed the MOU would resolve the strike.\n“Strike should be the last resort when every other effort has been exhausted in terms of finding a solution to whatever the problem is.\nBut for any little thing, you resort to disruption of services; it does not portray the country in good light."
  },
  {
    "headline": "Police speak on 230 Igbo killed in Jos",
    "summarized_story": "The Police Command in Plateau has described as fake news that unidentified persons have killed 230 Igbos in Jos.\nASP Ubah Ogaba, the Police Public Relations Officer (PPRO) of the command, dismissed the report in a statement on Sunday.\nSocial media reports claimed two luxury bus conveying commuters of Igbo extraction were set ablaze, with the 230 passengers killed, in Jos.\n“The command hereby states categorically that there is no record of such incident anywhere in Jos.\nThe spokesperson also urged residents to report all suspicious movements, emergency or distress to the nearest police formation for prompt response."
  },
  {
    "headline": "Businessman Ejike from Kigali ingests 87 pellets of cocaine",
    "summarized_story": "By Ibironke Ariyo/AbujaThe National Drug Law Enforcement Agency (NDLEA) has intercepted a drug kingpin, Mr Ibeh Ejike, at Nnamdi Azikiwe International Airport, (NAIA) Abuja for ingesting 87 pellets of cocaine.\nHe said the suspect was taken in for secondary check during which he tested positive to ingestion of illicit substance.\n“While under observation, he excreted 87 pellets of cocaine weighing 1.884 kilograms.\n“Ibeh, who imports clothes for sale, hails from Owerrizikeala village in Orumba Local Government Area of Anambra State,” Babafemi said.\n“In Anambra State, operatives also raided the Onitsha main market, Marine Line on Thursday, Aug 26, with the support of soldiers."
  },
  {
    "headline": "Why We Arrest Commoners But Leave The Rich And Powerful People Who Break Our Rules —Kano Islamic Police",
    "summarized_story": "While enforcing some of its laws, the Kano Hisbah Board, often known as the Islamic police, has explained why it treats the rich and poor differently.\nA director of the Islamic police, Aliyu Kibiya gave the explanation when he featured on a Freedom Radio programme.\nAll these have attracted punishments from Kano Hisbah, in cases where poor Nigerians were involved.\nSimilarly, in February, a barber from Benue State, Elijah Ode, was arrested by Kano Hisbah in the Sabongari area of the state for giving his customers haircuts said to have offended the Islamic faith.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets, and boutique owners in the state."
  },
  {
    "headline": "Buhari, Tinubu Saved Nigeria’s Democracy – Garba Shehu",
    "summarized_story": "With the union of the parties that created the APC, Messrs Buhari and Tinubu, according to the spokesperson, saved Nigeria.\nGarba Shehu, spokesperson for President Muhammadu Buhari, says Mr Buhari and former Lagos State governor Bola Tinubu saved Nigeria’s democracy with the merger that birthed the All Progressives Congress that defeated the Peoples Democratic Party in the 2015 presidential election.\n“President Muhammadu Buhari reconstructed political parties and formed this country’s biggest political merger in partnership with people like Asiwaju Bola Ahmed Tinubu and saved the country’s democracy by instituting a new administration that is change oriented,” Mr Shehu said.\nMr Buhari was a member of the Congress for Progressive Change that merged to form the APC.\nIn 2015, shortly after Mr Buhari came into power, over 348 members of Shiites Islamic group were massacred and buried in a mass grave by the Nigerian military."
  },
  {
    "headline": "NMA Gives Buhari Government 21 Days To Resolve Issues With Striking Resident Doctors, Others",
    "summarized_story": "The Nigerian Medical Association (NMA) has given President Muhammadu Buhari’s government 21 days to resolve all issues in the numerous agreements it has signed with its affiliate members, including resident doctors who are currently on strike.\nIn the 21-day notice, it asked the government to resolve all pending issues with the National Association of Resident Doctors (NARD), Medical and Dental Council of Nigeria (MDCAN), and the Medical and Dental Specialist Association in Basic Medical Sciences (MEDSABAMS).\nThe warning came after the NMA’s National Executive Council meeting in Edo State where it discussed the ongoing strike by resident doctors and the government’s position.\nThe NMA warned that no doctor should be victimised for participating or not participating in the strike action by NARD, adding that it supports all its affiliates in their efforts to improve healthcare delivery and their welfare.\nA statement by the NMA President, Prof Innocent Ujah, said, “In the event that the Federal Government fails to implement the agreements after the expiration of the 21-day notice, NMA shall summon an emergency delegate meeting to review the progress made on the implementation of the agreements.”"
  },
  {
    "headline": "President Buhari Reacts To Death Of Legendary Musician, Victor Uwaifo",
    "summarized_story": "President Muhammadu Buhari has expressed his condolences to the family, friends, and associates of Sir Victor Uwaifo, a great musician and multi-talented artiste who died on Saturday.\nHe described the music legend as one who portrayed life through his music and lived for many.\n“He was the winner of a gold disc in Africa for his song, “Joromi’’, released in 1965 at the age of 24.\n“The glory that Uwaifo brought to Nigeria through his international tours “and the active role he played in national development will always be remembered.\n“I pray for the soul of the departed musician, writer, sculptor, musical instrument inventor and university lecture and I believe the entire country, particularly the music industry, would sorely miss him,” the statement said."
  },
  {
    "headline": "Breaking: As resident doctors down tools, NMA issues strike notice",
    "summarized_story": "The Nigerian Medical Association (NMA) has given the federal government a 21-day strike notice starting from Monday August 30, 2021.\nThe NMA decision to embark on strike was made knownat the end of its National Executive Council (NEC) meeting in Benin City, Edo state capital on Saturday.\nTheir strike notice is coming amidst existing strike action by the National Association of Resident Doctors (NARD).\nThere are now concerns that another industrial action by NMA will cripple activities in government-owned hospitals across the country.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Arteta you are source of our problem, Dino Melaye blows hot after Manchester City Premier League defeat",
    "summarized_story": "The Gunners were handed a 5-0 defeat at the Etihad stadium on Saturday and they are now bottom on the league tableArsenal fans across Africa have once again called for Mikel Arteta’s sacking after the team suffered a 5-0 defeat against Man city in the Premier League on Saturday.\nThe former senator representing Kogi west, Senator Dino Melaye on Saturday in a video posted on his verified Facebook handle in a song prayed against every spirit keeping Mikel Arteta as the head coach of Arsenal.\nAccording to him, “Mikel Arteta you are the source of our problem.\nArteta go in the name of the father, in the name of the son and in the name of the holy ghost”The former lawmaker was seen in the video kissing the Arsenal’s badge on the popular white and red Gunners jersey he wears"
  },
  {
    "headline": "Breaking: Veteran musician, ‘Guitar Boy’, is dead",
    "summarized_story": "Nigerian-born iconic singer, Victor Iwaifo has passed on.\nAccording to a family source,The ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was also the first Commissioner for Arts, Culture and Tourism in Nigeria."
  },
  {
    "headline": "Tambuwal applauds NIS workforce as he commissioned newly constructed ultra modern edifice -NigPilot",
    "summarized_story": "The Nigeria Immigration Service (NIS) Thursday, has moved to their newly constructed ultra-modern Office Complex for the Sokoto State Command, located along Gusau Road in the State Capital.\nTambuwal stressed that the State recognizes the crucial role of the NIS in the national security architecture.\nEarlier, the Comptroller General of Immigration, Muhammad Babandede, had reiterated the Service’s uncommon commitment to the welfare of the workforce.\n“This has been pursued very vigorously till date, with the Sokoto Command Complex being the twelfth of such Buildings already delivered, while six others are currently in various stages of completion.\nRecalled, before now the Sokoto State Command has been operating at the Federal Secretariat in the State for decades."
  },
  {
    "headline": "Tambuwal applauds NIS workforce as he commissioned newly constructed ultra modern edifice -NigPilot",
    "summarized_story": "The Nigeria Immigration Service (NIS) Thursday, has moved to their newly constructed ultra-modern Office Complex for the Sokoto State Command, located along Gusau Road in the State Capital.\nTambuwal stressed that the State recognizes the crucial role of the NIS in the national security architecture.\nEarlier, the Comptroller General of Immigration, Muhammad Babandede, had reiterated the Service’s uncommon commitment to the welfare of the workforce.\n“This has been pursued very vigorously till date, with the Sokoto Command Complex being the twelfth of such Buildings already delivered, while six others are currently in various stages of completion.\nRecalled, before now the Sokoto State Command has been operating at the Federal Secretariat in the State for decades."
  },
  {
    "headline": "Stella Oduah dumps PDP, joins APC -NigPilot",
    "summarized_story": "Former Minister of Aviation in the administration of President Goodluck Ebele Jonathan and a serving Senator, Princess Stella Oduah-Ogiemwonyi , has dumped the People’s Democratic Party (PDP) and joined the ruling All Progressives Congress (APC) in Abuja.\nThe APC governorship candidate in the November 2021 election, Senator Andy Uba was at the occasion.\nShe is the latest of high profile members of the former ruling party who joined the APC recently.\n“You will enjoy the privileges enjoyed by all members of the party because you will have a waiver,” Bunu said.\nShe said during the occasion that she joined the APC family as part of the process of the changing political narrative in the South East, and assured that she joined the APC along with her multitude of supporters who have been jubilating in Anambra State."
  },
  {
    "headline": "Stella Oduah dumps PDP, joins APC -NigPilot",
    "summarized_story": "Former Minister of Aviation in the administration of President Goodluck Ebele Jonathan and a serving Senator, Princess Stella Oduah-Ogiemwonyi , has dumped the People’s Democratic Party (PDP) and joined the ruling All Progressives Congress (APC) in Abuja.\nThe APC governorship candidate in the November 2021 election, Senator Andy Uba was at the occasion.\nShe is the latest of high profile members of the former ruling party who joined the APC recently.\n“You will enjoy the privileges enjoyed by all members of the party because you will have a waiver,” Bunu said.\nShe said during the occasion that she joined the APC family as part of the process of the changing political narrative in the South East, and assured that she joined the APC along with her multitude of supporters who have been jubilating in Anambra State."
  },
  {
    "headline": "Digitalization: APC set to go ‘paperless’ – Buni -NigPilot",
    "summarized_story": "The ruling All Progressives Congress, APC, is set for serious digitization and digital transformation of its operations.\nThings are changing and digital technology is becoming a source of inspiration for us to do what we do better.\n” We can use technology to enhance our processes, services and also to deliver our traditional services more efficiently and transparently.\nLikewise, we can use technology to bring new things to our party.\nZainab Marwa, Charles Nkata, Imaan Sulaiman-Ibrahim, OWOLABI Olusegun Awosan, Nasiru Danu, Princess Nse Ekpo and Osayi Ejiga"
  },
  {
    "headline": "NMA Issues FG 21-Day Ultimatum To Resolve Industrial Disputes With NARD, Others",
    "summarized_story": "The Nigerian Medical Association has issued a 21-day ultimatum to the Federal Government to resolve all lingering industrial actions with the National Association of Resident Doctors (NARD), Medical and Dental Consultants Association of Nigeria, and other affiliate members.\nThis ultimatum is part of the resolutions reached during its National Executive Council (NEC) meeting, held in Benin City.\n“In the event that the FG fails to implement the agreements after the expiration of the 21 days’ notice, NMA shall summon an emergency delegate meeting to review the progress made on the implementation of the agreements,” the NMA added.\nFull SupportNMA’s ultimatum is the latest in the lingering tussle between the Nigerian government and NARD which has gone on strike since July 31.\n“The Nigerian Medical Association fully supports all her affiliates in their efforts to improve the healthcare delivery in Nigeria and the welfare of her members,” it assured."
  },
  {
    "headline": "Two Children ‘Abducted’ From Lagos By Nanny Rescued In Benin-City",
    "summarized_story": "﻿Two siblings based in Lagos have been rescued following their abduction allegedly by a nanny simply identified by Precious.\nPrecious was said to have absconded with the minors – a four-year-old boy and two-year-old girl – on Monday and brought them to Benin City to a couple based abroad who were on a visit to Nigeria.\nREAD ALSO: Three Killed As Gunmen Attack Zangon Kataf Again“Operatives of the Anti-Kidnapping and Cybercrime Unit on 26 at about 15:35 hours arrested some suspects for the abduction of children from Lagos down to Benin City,” he said.\nHe added that the armed men whom he said belonged to some unknown vigilante group took two other children the police had rescued from the premises along with them.\n“The children were rescued alongside two other children in the compound that we cannot establish who the parents are."
  },
  {
    "headline": "Legendary Musician Sir Victor Uwaifo Is Dead",
    "summarized_story": "Veteran musician Victor Uwaifo has died at the age of 80.\nHe was the first professional musician to be awarded the National Merit Honours of Member of the Order of the Niger (MON).\nBuhari mournsMeanwhile, President Muhammadu Buhari has condoled with the family and friends of the legendary musician.\n“President Muhammadu Buhari condoles with family, friends and associates of legendary musician and multi-talented artiste, Sir Victor Uwaifo, who passed on Saturday, leaving a legacy of successes in many areas of life, including academia and administration,” the statement said.\n“President Buhari prays for the soul of the departed musician, writer, sculptor, musical instrument inventor and university lecturer, knowing the entire country, particularly the music industry, will sorely miss him.”"
  },
  {
    "headline": "PDP Choose Abuja As Venue For National Convention",
    "summarized_story": "The Peoples Democratic Party has chosen Abuja as the venue for its national convention.\nThe decision was reached at the party’s 92nd National Executive Committee meeting held on Saturday.\nThe acting National Chairman, Elder Yemi Akinwonmi, presided over the meeting.\nREAD ALSO: Secondus Absent As Akinwonmi Presides Over PDP NEC MeetingMain opposition party PDP has recently been hit by multiple defections as some embittered members call for the resignation of Uche Secondus as National Chairman.\nNEC meetingAt the meeting, Akinwonmi said consultations within the party are yielding desired results."
  },
  {
    "headline": "Paralympics: Nigeria’s Omolayo Wins Powerlifting Gold, Sets Games Record",
    "summarized_story": "Nigeria’s Bose Omolayo has won gold in the women’s 79kg weightlifting event at the Tokyo Paralympics.\nUkraine’s Natalia Oliinyk took silver while Vera Vera from China settled for bronze in the same event.\nThe 32-year-old had clinched gold at the Rio 2016 Paralympic Games and got another gold in the World Championships in Kazakhstan, three years later.\nREAD ALSO: Nigerian Powerlifter Latifat Tijani Wins Gold At Tokyo ParalympicsOmolayo’s gold is Nigeria’s second in the competition.\nLatifat Tijani had claimed victory in the women’s 45kg powerlifting event after a lift of 107kg, with China’s Zhe Cui taking silver."
  },
  {
    "headline": "Afghanistan Live Updates: As Pullout Deadline Looms, U.S. Warns of a New Threat",
    "summarized_story": "Live Afghanistan Live Updates: As Pullout Deadline Looms, U.S.\nWarns of a New Threat The embassy said there was a “specific, credible” danger to the Kabul airport.\n‘Heartbreaking and terrifying.’ Two nonprofit groups are making a last-minute attempt to help Afghan women escape.\nBut the suicide bombing at the Kabul airport on Thursday has made those efforts much more difficult.\nA member of the Taliban’s Badri 313 Battalion guarding a gate at the Kabul airport on Saturday."
  },
  {
    "headline": "As the Taliban Tighten Their Grip, Fears of Retribution Grow",
    "summarized_story": "“It’s very much underground,” said one former legislator, who was in hiding elsewhere when the Taliban visited his home in the middle of the night.\nNor is it clear what level of the Taliban leadership authorized detentions or executions.\nPakistan’s Inter-Services Intelligence agency has long supported the Taliban in their violent opposition to the Kabul government.\nAll but the youngest remember the Taliban’s authoritarian regime of the 1990s, with its draconian punishments, hangings and public executions.\nMany people have gone into hiding, changed their locations and telephone numbers, and broken off communications with friends and colleagues."
  },
  {
    "headline": "Among the Troops Who Died, Two Women on the Front Line",
    "summarized_story": "Nicole Gee shared with her family from Afghanistan shows her in dusty body armor with a rifle, her long blond hair pulled back, her hands in tactical gloves.\nIt showed how, even in the tumult, many took time to comfort the families who made it through.\nIn a short message posted with the photo, the sergeant said, “I love my job🤘🏼”Sergeant Gee never made it out.\nShe was one of the 13 troops killed when a suicide bomb ripped through the crowds at the gate this week, killing nearly 200 people.\nThe Defense Department on Saturday officially identified the service members who were killed, and family and friends paid tribute to their lives and their sacrifice."
  },
  {
    "headline": "Nigeria at $432bn Still Africa’s Biggest Economy Despite South Africa’s Rebased GDP of $370bn",
    "summarized_story": "The rebasing of South Africa’s GDP coincided with the release of Nigeria’s latest GDP report, which showed a 5.01 per cent growth in the second quarter of 2021.\n“In terms of purchasing power parity (PPP), the World Bank currently ranks South Africa as the third biggest economy on the continent after Egypt and Nigeria.\nThe rebasing of South Africa’s GDP coincided with the release of Nigeria’s latest GDP report, which showed a 5.01 per cent growth in the second quarter of 2021.\nThe Q2, 2021 nominal growth rate was also higher than the 12.25 per cent growth recorded in Q1 2021.\nNigeria and South Africa are the two biggest economies in Africa."
  },
  {
    "headline": "Nigeria Medical Association Moves to Join Resident Doctors’ Strike, Gives FG 21-day Ultimatum",
    "summarized_story": "The Nigerian Medical Association (NMA) has issued a 21-day strike notice to the federal government with effect from today (Monday).\n“The resident doctors are on the scheme of service against which obtained earlier.\nNigeria is also about the only country that has the Medical Residency Training Fund, backed up by an Act, Medical Residency Training Act, passed into law by this administration in 2018.\nExplaining further, Ngige said: “As a matter of fact, the Residency Training Fund for 2021 is a borrowed fund.\nHe also said that all affiliates of the NMA signed the MOA, with only NARD dissenting."
  },
  {
    "headline": "NNPC Spends $1.3bn on Petrol Subsidy in Six Months",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) expended N541.65 billion subsidy on petrol between February and July this year, a document detailing the national oil company’s presentation to the Federation Account Allocation Committee (FAAC) for August 2021, has shown.\nOn Friday, THISDAY reported that the corporation was again set to deduct about N215.3 billion from its contribution to next month’s joint federation account, being a combination of N175 billion subsidy sum and N40 billion Joint Venture (JV) cost recovery.\nThe data showed that NNPC paid N67.280 billion to the joint account in July, an improvement on the N47.162 billion in June, with the succeeding month’s payment being about N20 billion higher than that of June.\nTwo months ago, the NNPC told the nation that Nigeria was losing about 42 million litres of petrol to the activities of smugglers across the country’s borders, increasing Nigeria’s estimated daily consumption of 60 million litres to 103 million litres and worsening the subsidy payment regime.\nA THISDAY check-in July showed that the NNPC’s payment to the federation account had declined by over 63 per cent in the first five months of 2021."
  },
  {
    "headline": "Powerful Hurricane Ida Closing in on Louisiana Landfall",
    "summarized_story": "Hurricane Ida strengthened into a major hurricane early Sunday, which could potentially bring devastating damage to Louisiana and the Gulf Coast.\nForecasters said Ida could intensify to a Category 4 hurricane with top winds around 130 mph (209 kph) before landfall.\nThe National Hurricane Center predicted Ida could be an extremely dangerous Category 4 hurricane with 130 mph (209 kph) winds when it makes an expected afternoon landfall.\nThe storm arrived on the exact date Hurricane Katrina ravaged Louisiana and Mississippi 16 years earlier.\nIda was a Category 2 hurricane Saturday night with maximum sustained winds of 105 mph (168 kph)."
  },
  {
    "headline": "Kabul Airlift in Final Phase as US Warns of More attack; Taliban Ready to Take Over Airport",
    "summarized_story": "Under a deal with the United States, the Taliban has said it will allow foreigners and Afghans who wish to leave to fly out.\nThe Taliban official told Reuters the Islamist group had engineers and technicians ready to take charge of the airport.\n“We are waiting for the final nod from the Americans to secure full control over Kabul airport as both sides aim for a swift handover,” the official said on condition of anonymity.\nIt was a clear attack on Afghan territory,” a Taliban spokesman told Reuters, adding that two women and a child were wounded in the attack.\nHe has defended his decisions, saying the United States long ago achieved its rationale for invading in 2001"
  }
]