[
  {
    "headline": "High charges for PCR test, inadequate testing frustrate Nigeria’s effort to curb COVID-19 –Experts",
    "summarized_story": "They stressed that the country must improve its COVID-19 testing to guaranty control efforts.\nAccording to them, lack of adequate testing, cost of testing, and sticking to the methods of testing can undermine efforts to curtail the infection.\nExperts, however, warned that Nigeria may not be able to control community transmission even with the spread of the Omicron variant of the virus and future variants.\nHe said that there is a need to redefine the role of testing for COVID-19 on many levels.\nWhile Prof. Fatusi advocates a need for everybody to self-test for COVID-19, Dr. Akase said there is a need to discuss if everyone should test for COVID-19."
  },
  {
    "headline": "High charges for PCR test, inadequate testing frustrate Nigeria’s effort to curb COVID-19 –Experts",
    "summarized_story": "They stressed that the country must improve its COVID-19 testing to guaranty control efforts.\nAccording to them, lack of adequate testing, cost of testing, and sticking to the methods of testing can undermine efforts to curtail the infection.\nExperts, however, warned that Nigeria may not be able to control community transmission even with the spread of the Omicron variant of the virus and future variants.\nHe said that there is a need to redefine the role of testing for COVID-19 on many levels.\nWhile Prof. Fatusi advocates a need for everybody to self-test for COVID-19, Dr. Akase said there is a need to discuss if everyone should test for COVID-19."
  },
  {
    "headline": "COVID-19 vaccines don’t increase risk of premature births –Study",
    "summarized_story": "Lara AdejoroA new study has indicated that the COVID-19 vaccines do not increase the risk of early delivery or a low-birth-weight baby.\nCommenting on the study, a public health physician, Dr. Ifeanyi Nsofor confirmed that there is no link between COVID-19 vaccines and giving birth to premature babies.\nHe, however, said pregnant women who have not received their COVID-19 vaccines have a higher risk of giving birth to premature babies.\n“Pregnant women who have COVID-19 and show symptoms have higher chances of dying due to the COVID-19 infection compared to women who are not pregnant.\n“The advice to pregnant women, women of childbearing age, and women who want to get pregnant in the future is to make sure they receive their COVID-19 vaccines as soon as possible.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "COVID-19 vaccines don’t increase risk of premature births –Study",
    "summarized_story": "Lara AdejoroA new study has indicated that the COVID-19 vaccines do not increase the risk of early delivery or a low-birth-weight baby.\nCommenting on the study, a public health physician, Dr. Ifeanyi Nsofor confirmed that there is no link between COVID-19 vaccines and giving birth to premature babies.\nHe, however, said pregnant women who have not received their COVID-19 vaccines have a higher risk of giving birth to premature babies.\n“Pregnant women who have COVID-19 and show symptoms have higher chances of dying due to the COVID-19 infection compared to women who are not pregnant.\n“The advice to pregnant women, women of childbearing age, and women who want to get pregnant in the future is to make sure they receive their COVID-19 vaccines as soon as possible.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "2023: Coalition of 57 youth groups endorse Osinbajo",
    "summarized_story": "Vice President Yemi OsinbajoOmeiza Ajayi, AbujaThe National Coalition of Youth and Students NACOYS, a coalition of 57 groups, has endorsed Vice President Yemi Osinbajo ahead of the 2023 presidential election, saying he is the best qualified for the top job.\nIn a communique read following their meeting with officials of The Progressive Project TPP, the sole coordinating body for scores of existing and upcoming pro-Osinbajo groups across Nigeria, representatives of the 57 youth organizations that constitute NACOYS also emphasized a firm resolve to mobilize at least five million youth across Nigeria to support Osinbajo if he finally decides to run for the presidency in 2023.\n“Being the most viable candidate for the office of the President of the Federal Republic of Nigeria, we shall, in the best of today’s youth and coming generations, strive towards the election of Professor Yemi Osinbajo SAN, GCON as the president of the Federal Republic of Nigeria come 2023,” said NACOYS coordinator, Barrister Festus Ofume while reading the 57 youth organizations’ three-page communique at the TPP office in Wuse, Abuja on Monday afternoon.\n“At our enlarged meeting held at Abuja on the 10″ day of January, 2022, we unanimously endorse Vice President Yemi Osinbajo, SAN, GCON as our candidate for the top job of the President of the Federal Republic of Nigeria for the 2023 general elections; we came to this conclusion after due consultation nationwide and after a thorough assessment of all he has done over the past seven years.\nThe youth coalition’s communique which also emphasized confidence in VP Osinbajo’s capacity to lift millions of Nigerians out of poverty and create vast opportunities for millions of youth in technology-related fields was signed by representatives of 57 organizations drawn from the North Central, North West, South West, North East, South East and South South geo-political zones."
  },
  {
    "headline": "Gov Emmanuel commends Senator Eyakenyi over empowerment of constituents",
    "summarized_story": "By Chioma Onuegbu – UyoAkwa Ibom State governor, Mr. Udom Emmanuel has commended Senator Akon Eyakenyi, representing Eket Senatorial district over human capacity development and empowerment of her constituents including the youths.\nHe pointed out that the Eyakenyi has been committed to carrying out empowerment and skills acquisition programmes for the youths of the Senatorial District since she went to the Senate in 2019.\nWe sit back at home and watch you raise your hands to speak for the people of Eket Senatorial District.\nHe used the opportunity to advise the people of the Senatorial district support the governor’s maintain peace nitiative and his succession plan in 2023, in order to achieve a better Akwa Ibom.\n“In 2019, the people of Eket Senatorial District made a good choice by choosing Sen. Akon Eyakenyi."
  },
  {
    "headline": "Buhari to commission landmark projects in Ogun on Thursday",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruABUJA—PRESIDENT Muhammadu Buhari will undertake a one-day official visit to Ogun State on Thursday, January 13, 2022, to commission landmark projects undertaken by the State Governor Prince Dapo Abiodun.\nThis was contained in a statement issued by the Special Adviser to the President on Media and Publicity, Chief Femi Adesina.\nREAD ALSOFAAN arrests over 90 ‘touts’, hands 89 over to PoliceAccording to the statement, “The President will commission the 42km Sagamu Interchange – Abeokuta dual carriageway, the new Kobape Housing Estate, located on the Sagamu Abeokuta Interchange, and the first phase of Kings Court Estate, Abeokuta, developed by the Ogun State Property and Investment Corporation (OPIC)President Buhari, who will use the opportunity of his State visit to interact with some stakeholders, will return to Abuja the same day.”"
  },
  {
    "headline": "IPOB advocates poultry, goat, fish farming ahead of April ban on beef",
    "summarized_story": "Stock: Fish FarmingBy Chimaobi Nwaiwu, NNEWITHE Indigenous People of Biafra, IPOB, on Monday, advised people of the South-East to seek alternative means of protein ahead of its ban on beef from Fulani cattle, which will take effect from April.\nThe pro-Biafran group said it did not ban the eating of beef in South-East, but herdsmen bringing cow that destroys farms, rape and kill women and girls.\n‘Farm chicken, goat, fish’While advising people from the region to be prepared for the ban, IPOB urged them to turn to poultry, goats and fish for protein.\nWe encourage our people to go into poultry farming, goat rearing and fish production.\n“How come these hypocrites never threatened Fulani herdsmen as they invade communites and kill farmers in Biafra land without any provocation?"
  },
  {
    "headline": "Why we’re establishing Science TV – FG",
    "summarized_story": "Ogbonnaya OnuBy Emmanuel ElebekeThe Minister of Science, Technology, and Innovation, Dr. Ogbonnaya Onu, has explained that the essence of establishing the Nigeria Science, Technology and Innovation Television (ScienceTV) by his ministry is to get Nigerians to appreciate the relevance and importance of STI to nation building.\nThe Minister explained disclosed this during the inauguration of Inter-Ministerial Committee for Nigeria Science, Technology and Innovation Television ([email protected]) on Monday, in Abuja.\nHe added that Science, Technology and Innovation remain the main driving force of growth and development in the nation.\nAccording to the minister, the television program will also cover every aspect of national life, which includes: Engineering, Health and Medicine, Natural Science, Environment and Wildlife, Science and Society, Agriculture and Children Curiosity among others.\nThe Television programme, he said will also showcase how our ancestors embrace science, technology and innovation in their daily activities by using locally available materials for their food, nutrition, drugs and medicine, building of houses."
  },
  {
    "headline": "UN reappoints Nigeria’s Amina Mohammed as Deputy Secretary-General",
    "summarized_story": "The United Nations (UN) has reappointed Amina Mohammed as Deputy Secretary-General.\nSecretary-General António Guterres had announced that Mohammed will continue in the role during his second term.\nMohammed has worked for the actualization of UN calls on Member States for the adoption of Sustainable Development Goals (SDGs).\nGuterres hailed his deputy’s leadership of the Sustainable Development Group, determination to reinforce results and maximization of the UN development system.\nShe served as Presidential Adviser on the Millennium Development Goals, advising on poverty alleviation, public sector reform and sustainable development."
  },
  {
    "headline": "Oil & gas: Bauchi is Nigeria’s future – Gov Mohammed",
    "summarized_story": "Bauchi State Governor, Senator Bala Abdulkadir Mohammed, on Monday, expressed optimism that his state would be the future of Nigeria because of the discovery of oil, gas and other mineral resources abound in Alkaleri Local Government Area and other parts of the state.\nThe governor said this while addressing journalists on his two-day engagement with stakeholders of Alkaleri LGA as part of his ongoing community engagement.\nAccording to him, his administration would establish a skills acquisition centre with a view to providing the needed manpower for oil exploration activities in the Alkaleri oil site.\n“The issue of discovery of oil in Alkaleri is good development not only to Alkaleri, northern Nigeria but Nigeria as a whole.\nThis two-day engagement certainly is more than a year’s engagement.”"
  },
  {
    "headline": "Bauchi, Gombe appeal to Buhari to pressurise NNPC to explore oil in Gongola basin",
    "summarized_story": "Bauchi and Gombe States have appealed to the Federal Government and President Muhammadu Buhari, in particular, to pressurise the Nigerian National Petroleum Company (NNPC) Limited to begin oil and gas exploration in the two states in particular and the entire Gongola basin generally.\nThe appeal was made by the Chairman, Association of Local Government in Nigeria (ALGON) in Bauchi State, Yusuf Garba Alkaleri and Barrister Abdulahi Mohammed Inuwa from Gombe State in separate interviews with journalists in Bauchi on Monday.\nAccording to him, the exploration would also ensure that the state joins oil producing states in Nigeria.\n“With the discovery of oil and gas in Bauchi State and in the whole of Gongola Basin, we are grateful to God and to President Muhammadu Buhari and Bauchi State governor for their support to ensure the discovery of oil in our areas.\nWe need President Buhari and the Federal Government to build even small modular refineries and start digging the oil in the market in order to boost economic activities,” he said."
  },
  {
    "headline": "2023: ‘Expect more hardship’ – Nigerians react as Tinubu informs Buhari of his presidential ambition",
    "summarized_story": "Some Nigerians have expressed mixed reactions over the decision of Bola Tinubu, National Leader of the All Progressives Congress, APC, to run for presidency in 2023.\nThey noted that Nigerians should expect more hardship if Tinubu eventually becomes president in 2023.\nWhile some Nigerians support Tinubu’s ambition, others are of the opinion that the APC chieftain would make Nigeria worse.\nThe former governor of Lagos State had earlier declared that he has informed President Muhammadu Buhari of his intentions to run for the Presidency in 2023.\nNoting that his ambition to be president had been a life-long ambition, Tinubu said he has the capacity to replicate what he did in Lagos State in Nigeria, if given the chance."
  },
  {
    "headline": "2023: Leadership not meant for particular region – Catholic Bishop, Ayah",
    "summarized_story": "“Let leadership go round, everybody has something to contribute and when we bring all these contributions together, we make Nigeria great again.\nLeadership is not meant for a particular group, what makes a particular group better than others?” He queried.\nThe Igbo man has something to contribute, the man from the north has something to contribute, the man from the west also has something to contribute.\nLet’s look at the greatness of this country and pray that God will hear our cries“When I hear America I envy them so much.\nWe too are blessed.”Bishop Ayah however prayed for unity and security of Nigeria and asked God to see the country through all these trying moments."
  },
  {
    "headline": "Clark to Buhari: majority of Nigerians believe in state police",
    "summarized_story": "Elder statesman Chief Edwin Clark has said majority of Nigerians are in support of state police.\nThe Ijaw leader was reacting to President Muhammadu Buhari’s opposition to the request for state police.\nBuhari, in an interview with Channels Television, said state police was not an option because governors would misuse it.\nClark, in a statement, said the excuses given by the president were not enough for him to have dismissed state police.\nHe said: “While the President is right that no local government in this country truly functions as provided by the constitution, not even the joint account under which state governments receive monies on behalf of the local governments, because the accounts are fully controlled by the governors, it is not enough to dismiss the demand for a state police.”- Advertisement -He quoted Sections 214 (1) of the 1999 constitution: “There shall be a Police Force for Nigeria, which shall be known as the Nigerian Police force, and subject to the provisions of this section, no other police shall be established for the Federation or any part thereof.”Clark also quoted Section 215 (4): “Subject to the provisions of this section, the governor of a state or such Commissioner for Government of the state as he may authorize in that behalf, may give to the Commissioner of Police of that State such lawful directions with respect to the maintenance and securing of public safety and public order within the State as he may consider necessary, and the Commissioner of Police shall comply with those directions or cause them to be complied with provided that before carrying out any such directions under the foregoing provisions of this subsection the Commissioner of Police may request that the matter be referred to the President or such Minister of the Government of the Federation as may be authorized in that behalf by the President for his directions.”"
  },
  {
    "headline": "EFCC recovered N152b, $386m last year",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) yesterday continued the review of its operational activities for last year.\nHe said: “The EFCC Headquarters Operation dominated the recoveries with N67, 249, 744, 994.89, $375,662,223.59 and £1,151,539.75.\n- Advertisement -“The Kaduna Zonal Command emerged third in terms of Naira recoveries with a total sum of N3, 339,405,723.93 while the Ibadan Zonal Command took the same position in terms of dollar recoveries to the tune of $387,385.00.\nTIS IV handed over to the Port Harcourt Zonal Command of the EFCC, the Nigerian Navy were quizzed in connection with alleged illegal dealing in petroleum products.\n“The representative of the Nigerian Navy, Navy Commander P. E Effah, who handed over the suspects and the vessel MT."
  },
  {
    "headline": "Insecurity pushing up costs of farm produce, say agric stakeholders",
    "summarized_story": "Agricultural stakeholders have blamed the rising cost of farm produce, livestock feeds, and other commodities, on the worsening security in the country.\nThe stakeholders, who stated these in separate interviews with reporters in Abuja yesterday, however, said the prize of many farm produce, especially beans, could drop by half if peace was returned to the North.\nA commercial maize farmer from Benue State, Tarnongo Vitalis, warned that the high costs of farm produce could persist if nothing was done to make farmers return to their farms.\n“The high cost of farm produce in the country is because of insecurity, many farmers are in IDP camps.\nAbioye said the lingering security challenges are contributory factors to the high cost of food items."
  },
  {
    "headline": "States to get N61.2b survival pill",
    "summarized_story": "States are to get N61.2 billion survival pill soon, the Federal Government said yesterday through the Minister of State for Industry, Trade and Investment, Ambassador Mariam Katagum.\nEach of the 36 states will access a minimum of N1.7 billion in the various schemes being implemented with the N75 billion Survival Fund.\nThe committee heard that over 1.1 million Nigerians have benefitted from the different schemes under the ESP MSME Survival Fund.\nSome 250,000 business names were registered free under the Survival Fund’s CAC Formalisation Support Scheme.\nThe ESP Solar Naija programme is designed to provide electricity access to 5 million households, and will serve about 25 million Nigerians in rural areas and under-served urban communities nationwide."
  },
  {
    "headline": "Tinubu: my presidential ambition a lifelong dream",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu will run for president, the All Progressives Congress (APC) stalwart declared yesterday.\nThe former Lagos State governor told reporters that his bid has been a lifelong ambition.\nTinubu said: “I’ve informed the President of my intention, but I’ve not informed Nigerians yet.\nTinubu added: “I’m not a spokesperson for the party and the President is the leader of the party.\nHe added: “First of all, the National Assembly and the President must be encouraged to review and review again."
  },
  {
    "headline": "I have informed Buhari of my 2023 presidential ambition – Tinubu",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAll Progressives Congress (APC) National Leader and former Lagos State Governor Asiwaju Bola Tinubu has disclosed that he has informed President Muhammadu Buhari of his intention to run for president in 2023.\nThe ex-governor said, as a democrat, President Buhari did not stop him from attempting to pursue his lifelong ambition.\nAsked if he has informed the president of his ambition, the APC chieftain said: ‘I will answer that with categorical yes.\nI’ve informed the President of my intention but I have not informed Nigerians yet.\nOn Osinbajo’s potential ambition, Tinubu maintained that he would not discuss any individual."
  },
  {
    "headline": "BREAKING: Buhari, Tinubu meet in Aso Rock",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently in a meeting with National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, at the Presidential Villa, Abuja.\nThe agenda of the meeting is not known as at press time.\nThe meeting is coming on the heels of fresh intra-party disagreement among leaders of the ruling party, which is threatening the conduct of the long-awaited National Convention of the party.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nTinubu is one of those reportedly interested in contesting in the 2023 Presidential electionDetails later…"
  },
  {
    "headline": "JUST IN: Juju maestro, Dayo Kujore, is dead",
    "summarized_story": "By Ayodele LawalVeteran juju musician, Wonder Dayo Kujore, is dead.\nKujore’s widow confirmed to The Sun that her husband died this afternoon after a brief illness.\nBorn on April 4, 1958 in Robiyan, ,Ogun State to Pa Micheal Odejimi Kujore and Madam Esther Kujore ,the Soko music exponent had his elementary education at African Church Primary School and then proceeded to African Church Secondary School, Abeokuta, Ogun State.\nDayo Kujore played alongside Sir Shina Peters and Segun Adewale in General Prince Adekunle’s band before going solo.\nSome of his hit albums include Super Jet, Soko Xtra etc"
  },
  {
    "headline": "FAAN arrests 90 persons including Patovilki, Lakewood, NAHCO staff for forgery, theft at Abuja, Lagos airports",
    "summarized_story": "By Chinelo ObogoFederal Airport Authority of Nigeria (FAAN) has revealed that it has arrested over 90 persons including staff of Patovilki Nigeria Limited, Lakewood Services, Nahco Plc, and other airport staff for producing fake Covid-19 test results, touting, unauthorised entry, trespassing, illegal facilitation, forgery, theft among others.\nThe General Manager of Corporate Affairs of FAAN, Henrietta Yakubu, said in a statement that the 90 persons were arrested at the Murtala Muhammed Airport, Lagos, and Nnamdi Azikiwe International Airport, Abuja, while carrying out nefarious activities.\nShe said out of the 90 persons arrested, 59 were handed over to the airport police command in Abuja for prosecution, while 30 were handed over to the police force in Lagos for same.\n“As part of effort to rid the nation’s airports of touting and extortion, the Federal Airports Authority of Nigeria (FAAN) has arrested over 90 persons, caught at both the Murtala Muhammed Airport, Lagos, and Nnamdi Azikiwe International Airport, Abuja, carrying out nefarious activities.\n“Some of those arrested are staff of Patovilki Nigeria Limited, Lakewood Services, Nahco Plc, and other airport staff."
  },
  {
    "headline": "2023 presidency: Anxiety over Jonathan’s rumoured interest",
    "summarized_story": "From Ndubuisi Orji, AbujaThe rumoured plot to draft former President Goodluck Jonathan into the 2023 presidential race by the All Progressives Congress (APC) is causing disquiet and panic in the Peoples Democratic Party (PDP).\nEze described Jonathan’s alleged presidential bid on APC platform as rumour, saying it had no basis.\n“Some of us are worried of its implications for the PDP, if it turns out to be true.\nHe said: “Because president Jonathan, since he left office, has not been participating actively in the affairs of the PDP.\nBabatope told Daily Sun, at the weekend, that Jonathan would be diminished if he contests in 2023 on APC platform."
  },
  {
    "headline": "Tinubu: I’ve Informed Buhari About My Presidential Ambition",
    "summarized_story": "Says he’s still consultingTo make formal declaration soonDeji Elumoye in AbujaFormer Governor of Lagos State and National Leader of the ruling All Progressives Congress (APC), Senator Bola Ahmed Tinubu, said he had informed President Muhammadu Buhari about his presidential ambition.\nSpeaking with newsmen after a closed-door meeting on Monday with President Buhari at the State House, Abuja, Tinubu said he had formally informed the President about his plan to succeed him in 2023.\nHis words: “I’ve informed the President of my intention but I have not informed Nigerians yet.\nAnd I’ve not set a parameter of limitation to the extent of how many people will I consult.\nYou’ve gotten that truth from me that I have informed Mr. President of my ambition, and you don’t expect more answers than that”."
  },
  {
    "headline": "News in Photographs: Buhari Meets Tinubu in State House",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is about now meeting with the National Leader of the ruling All Progressives Congress (APC), Asiwaju Bola Tinubu, at the State House, Abuja.\nThe meeting, holding at the President’s office, which is believed to be a courtesy one, is coming on the heels of fresh intra-party disagreement among leaders of the ruling party, which is threatening the conduct of the long-awaited national convention of the party.\nTinubu, a former Governor of Lagos State, is reported to be interested in vying for APC presidential ticket ahead of the 2023 general election.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "COVID-19: Djokovic Wins Appeal against Cancellation of His Australian Visa",
    "summarized_story": "Judge rules he should be released, overturns government’s decisionJudge Anthony Kelly has ruled in Melbourne quashing the Australian government’s decision to cancel Novak Djokovic’s visa and ordered that he should be released within 30 minutes of the decision.\nThe Serbian tennis player flew into Melbourne last week hoping to defend his Australian Open title after claiming to have medical exemption from COVID-19 vaccination.\nBut instead, he has been held in an immigration detention centre with Australia’s Border authorities claiming no such authorization came from them.\nHis visa to come into Melbourne to defend his Australian Open title was cancelled.\nBut in the ruling a few minutes ago, the judge ruled that the respondent — in this case, the Ministry of Home Affairs — must pay Djokovic’s costs as agreed or assessed."
  },
  {
    "headline": "Zamfara Killings: Atiku Urges FG to Ramp Up Security as Farouq Decries Situation",
    "summarized_story": "In the same vein, the Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, has also described the recent killings in Zamfara by bandits as nothing short of horrific.\nOver 500 fleeing bandits on motorcycles had reportedly attacked five villages and razed their homes, after killing over 200 of the people, recently.\n“We sympathise with the government and people of Zamfara State in this trying period and condole with the families of the dead.\nWe pray for the repose of their souls and that peace returns to the state and soon as possible,” she said.\n“Severally, without being prompted, you (Governor Zulum) come to our aide to support us (the army) even logistics wise."
  },
  {
    "headline": "Stock Market Gains N1.33trn in First Trading Week",
    "summarized_story": "Kayode TokedeThe Nigerian Exchange Limited (NGX) kicked off the first trading week of 2022 on a positive note as its market capitalisation gained N1.33 trillion.\nThis followed foreign investors’ and high net worth investors’ demand for Airtel Africa Plc, BUA Foods, Lafarge Africa Plc, and FBN Holdings Plc, which pushed market capitalisation to N23.628 trillion from the N22.296 trillion the stock market opened with trading on the first day.\nActivity levels were strong, as trading volume and value surged by 103.7per cent w/w and 246.8per cent w/w, respectively.\nThe Financial Services Industry followed with 537.959 million shares worth N4.627 billion in 8,015 deals.\nThe third place was The ICT Industry, with a turnover of 76.906 million shares worth N704.346 million in 933 deals."
  },
  {
    "headline": "EXCLUSIVE: Hacker Breaks Into NIMC Server, Steals Over Three Million National Identity Numbers Of Nigerians",
    "summarized_story": "Over three million National Identity Numbers of Nigerians have been stolen after a hacker known only as Sam broke into the server of the National Identity Management Commission.\nDisplaying a defaced National Identity card of a Nigerian alongside the article, the hacker said, “I've got one more output for s3 bucket, I casually tried to access it without any hope, and damn!\nA user on the micro-blogging platform with the handle @isidags while reacting to the development said, “I’m shocked Nigerians are shocked.\nBut despite those assurances, the latest attack has exposed the failure of the President Buhari administration to protect Nigerians from cyber criminals.\nOver 60 million Nigerians had so far been captured on the national identity database, according to the NIMC."
  },
  {
    "headline": "EXCLUSIVE: Hacker Breaks Into NIMC Server, Steals Over Three Million National Identity Numbers Of Nigerians",
    "summarized_story": "Over three million National Identity Numbers of Nigerians have been stolen after a hacker known only as Sam broke into the server of the National Identity Management Commission.\nDisplaying a defaced National Identity card of a Nigerian alongside the article, the hacker said, “I've got one more output for s3 bucket, I casually tried to access it without any hope, and damn!\nA user on the micro-blogging platform with the handle @isidags while reacting to the development said, “I’m shocked Nigerians are shocked.\nBut despite those assurances, the latest attack has exposed the failure of the President Buhari administration to protect Nigerians from cyber criminals.\nOver 60 million Nigerians had so far been captured on the national identity database, according to the NIMC."
  },
  {
    "headline": "EXCLUSIVE: Ex-President Jonathan's Ambition To Retake Power In 2023 Hits Setback As Former Appointees Fail To Support Move Over Distrust For Buhari",
    "summarized_story": "The newspaper had earlier reported how President Buhari shunned former governor of Lagos State and National Leader of the ruling All Progressives Congress, Asiwaju Bola Tinubu, and Vice President Yemi Osinbajo to support Jonathan’s ambition.\nSee Also Exclusive EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027To show commitment to this plan, the President Buhari administration had secretly released funds seized from Jonathan's wife, Patience, back to her.\n“They also said they can’t trust Buhari who their sources said is actually interested in relinquishing power to a Northerner from the North-East.\nThey were informed Buhari is looking at Buni or Zulum and is just lying to Jonathan.\n“Buhari also gave him an ultimatum to join APC by the end of January, early February or forget his ambition,” he said."
  },
  {
    "headline": "EXCLUSIVE: Ex-President Jonathan's Ambition To Retake Power In 2023 Hits Setback As Former Appointees Fail To Support Move Over Distrust For Buhari",
    "summarized_story": "The newspaper had earlier reported how President Buhari shunned former governor of Lagos State and National Leader of the ruling All Progressives Congress, Asiwaju Bola Tinubu, and Vice President Yemi Osinbajo to support Jonathan’s ambition.\nSee Also Exclusive EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027To show commitment to this plan, the President Buhari administration had secretly released funds seized from Jonathan's wife, Patience, back to her.\n“They also said they can’t trust Buhari who their sources said is actually interested in relinquishing power to a Northerner from the North-East.\nThey were informed Buhari is looking at Buni or Zulum and is just lying to Jonathan.\n“Buhari also gave him an ultimatum to join APC by the end of January, early February or forget his ambition,” he said."
  },
  {
    "headline": "Nigerian Group In UAE Petitions Foreign Minister, Onyeama Over Delay In Work Permit Renewals",
    "summarized_story": "A group, Union of Nigerians In UAE (UNUAE) has petitioned Geoffrey Onyeama, Nigeria's Minister of Foreign Affairs over the refusal of the government of the United Arab Emirates to renew work permits for Nigerians in the country.\nThe petition with the title, “Refusal To Renew Or Issue Work Permits To Nigerians By The United Arab Emirates Government” was signed by a legal practitioner, Tope Temokun for the Tope Temokun chambers.\nMinister for Foreign Affairs, Geoffrey OnyeamaIn the petition, the group decried the adverse effects of the passport renewal failure on Nigerians living in the country.\nAccording to the group, Nigerians suffered untold hardship as some companies sack their Nigerian employees over the inability to process and obtain work permit renewal.\nThe group said this has caused Nigerians in the country to lose their means of livelihood noting that majority have no roof over their heads."
  },
  {
    "headline": "BREAKTHROUGH: Pig heart transplanted into US resident in first-of-its-kind surgery",
    "summarized_story": "David Bennett, a 57-year-old patient with terminal heart disease, has undergone a successful transplant of a genetically-modified pig’s heart — the first-operation-of-its-kind.\nAccording to a statement issued on Monday by the University of Maryland School of Medicine (UMSOM), the historic surgery was conducted on Friday.\nAdvertisementHe had reportedly been deemed ineligible for a conventional heart transplant at the University of Maryland Medical Center (UMMC) and other leading transplant centres that reviewed his medical records.\nI look forward to getting out of bed after I recover.” Bennett had reportedly said before the surgery.\n“The FDA used our data and data on the experimental pig to authorize the transplant in an end-stage heart disease patient who had no other treatment options."
  },
  {
    "headline": "BREAKTHROUGH: Pig heart transplanted into US resident in first-of-its-kind surgery",
    "summarized_story": "David Bennett, a 57-year-old patient with terminal heart disease, has undergone a successful transplant of a genetically-modified pig’s heart — the first-operation-of-its-kind.\nAccording to a statement issued on Monday by the University of Maryland School of Medicine (UMSOM), the historic surgery was conducted on Friday.\nAdvertisementHe had reportedly been deemed ineligible for a conventional heart transplant at the University of Maryland Medical Center (UMMC) and other leading transplant centres that reviewed his medical records.\nI look forward to getting out of bed after I recover.” Bennett had reportedly said before the surgery.\n“The FDA used our data and data on the experimental pig to authorize the transplant in an end-stage heart disease patient who had no other treatment options."
  },
  {
    "headline": "Don't discard state police over fears of abuse by governors, Edwin Clark advises Buhari",
    "summarized_story": "Speaking during a recent Channels Television interview, President Muhammadu Buhari had said state police is not an option for the nation.\nHe argued that it cannot be discarded over fears that it “could be used by state governors in persecuting perceived political opponents”.\nHe gave an unrelated instance of the relationship between state governors, and local governments, that there is no functional local government in the country,” Clark said.\nAdvertisement“It is very unfortunate that the state governors who are elected under the party are the ones running the party today.\n“I totally agree with Mr. President that most state governors have undermined the provisions of the 1999 constitution, where local government is provided for under Section 8."
  },
  {
    "headline": "Don't discard state police over fears of abuse by governors, Edwin Clark advises Buhari",
    "summarized_story": "Speaking during a recent Channels Television interview, President Muhammadu Buhari had said state police is not an option for the nation.\nHe argued that it cannot be discarded over fears that it “could be used by state governors in persecuting perceived political opponents”.\nHe gave an unrelated instance of the relationship between state governors, and local governments, that there is no functional local government in the country,” Clark said.\nAdvertisement“It is very unfortunate that the state governors who are elected under the party are the ones running the party today.\n“I totally agree with Mr. President that most state governors have undermined the provisions of the 1999 constitution, where local government is provided for under Section 8."
  },
  {
    "headline": "'No rule says kingmaker can't become king' -- Tinubu speaks on presidential ambition",
    "summarized_story": "Bola Tinubu, a former governor of Lagos state, says there is no rule preventing a kingmaker from becoming king.\nFielding questions from reporters after meeting with Buhari at the presidential villa, Tinubu said he would pursue his ambition without the title of “kingmaker”.\nMe, I want to pursue my ambition without the title of a kingmaker.\nThat’s it.”The former Lagos governor said he has the capacity to govern Nigeria.\nAdvertisement“I have the confidence, the vision, the capacity to rule, build on the foundation of Mr. President, and turn Nigeria better,” he said."
  },
  {
    "headline": "On the making of King of Boys, Netflix’s first original Nigerian series",
    "summarized_story": "KOB 2 was well received by movie lovers as it topped Netflix’s top-ten movie charts for many weeks.\nMA: Interestingly, as at the time we started shooting KOB 2, I don’t think it was confirmed as a Netflix original.\nDA: Considering that this was Netflix’s first Nigerian original series, how much technical support did Netflix bring in?\nDA: What was the difference between shooting a regular movie and a 7-part series?\nMA: Another thing that’s noteworthy is that, when we finished shooting King of Boys, nobody knew we had shot a series."
  },
  {
    "headline": "Cameroon risks stunting mobile money growth with new transaction levy",
    "summarized_story": "Among Cameroonians, new year celebrations have so far coincided with pushback against a new tax on mobile money transactions introduced by the Paul Biya administration.\n#WeSayNo.”The new mobile money tax will especially hit the poorest, unbanked segments of Cameroon society.\nA later study also points out that many mobile money users belong to “marginalised societal groups” hence the negative impact on financial inclusion and broader development goals of mobile money taxes is significant.\nSimilarly, a 1% tax on mobile money transactions in Uganda was cut in half after protests.\nUnlike Ghana’s case, however, citizens were barely informed of the details before Cameroon’s government implemented the new mobile money tax in November, according to local media reports."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "How Touch and Pay (TAP) got 1.5 million Lagosians to adopt cashless bus rides",
    "summarized_story": "They are the founders of Touch and Pay (TAP), creators of the contactless Cowry card used in paying bus fares.\nThe founders thought the best way to digitise small payments would be through contactless cards.\nOluwole said, “We needed to mimic cash transactions, and one of the characteristics of cash is that it is physical.\nATM cards have contactless capabilities tooPhoto by Markus Winkler on UnsplashThe touch to pay technology on contactless cards is made possible by Near Field Communication technology or NFC.\nSo why can’t we just pay for bus rides with our bank cards?"
  },
  {
    "headline": "BFREE’s pre-Series A, instant transfers for Tanzanians, Africa’s startup laws",
    "summarized_story": "This payment system would enable Tanzanians to instantly transfer money to people in their mobile contact list without searching for their phone numbers.\nUnder Tanzania’s present payment system, transfers are made within two hours of the initiation of the transaction.\nComparing Africa’s startup lawsAfrica’s recent history with startup acts appears promising.\nRecently, Nigeria-based technological advisory firm, Tech Hive Advisory and Africa-focused tech policy research NGO, Ikigai Innovation Initiative released a guide on African startup acts: Start-up Laws in Africa Vol.\nWe can, however, (re)read Emmanuel’s Paul’s analysis here: Startup Acts: Can the decade’s sexiest law save Nigeria’s thriving but uncertain startup ecosystem?"
  },
  {
    "headline": "African startups raised $1 million every 2 hours in 2021 — Africa: The Big Deal",
    "summarized_story": "Odunayo Eweniyi, Co-founder, FirstCheck AfricaThe Big Deal reports that only 0.95% of the funding raised by African startups went to startups founded or led by a woman.\nAccording to Briter Bridges, 62% (~$2.9 billion) of total funding in African startups went to fintech startups, double the 31% recorded in 2020.\nMax AB, an Egyptian eCommerce startup raised a $55 million Series A across two rounds in 2021.\nSource: SuppliedSome startups that raised at least $100 million include Andela, $200 million Series E; Flutterwave, $170 million Series C; Chipper Cash, $250 million Series C across two separate rounds; OPay, $400 million Series C; Trade Depot, $110 million Series B; and Jumo, $400 million led by Fidelity Management & Research Company.\nWith the heights reached by African startups in 2021, it is logical to expect them to be matched and hopefully eclipsed in 2022."
  },
  {
    "headline": "Most valuable teams in AFCON",
    "summarized_story": "Data gleaned from the global football statistics website, transfermarkt, show 10 teams including star-studded Senegal, Ivory Coast, and Super Eagles of Nigeria stand out as the most valuable team at the AFCON tournament.\nThe criteria for selecting the valuation of the teams are based on their current squads at AFCON and the present value of their players.\nSenegalSenegal is currently ranked the most valuable African side at the AFCON.\nThe team’s other valuable players include Edouard Mendy (Chelsea) – €32 million, Kalidou Koulibaly (Napoli) – €45 million, and Ismaïla Sarr (Watford) – €27 million with over 14 trophies between them.\nAlgeriaThe current African champions have the fifth most valuable squad in Africa with a current squad worth €187.30 million."
  },
  {
    "headline": "FDI slides to 8-year low",
    "summarized_story": "Nigeria’s Foreign Direct Investment (FDI) plunged by 74.01 percent year-on-year in the third quarter of 2021, the lowest level since the National Bureau of Statistics (NBS) started collating the data in 2013.\nAs a percentage of the total investment inflow into Nigeria, FDI amounted to 6.23 percent in the review period.\nThe largest amount of capital importation by type was received through portfolio investment, which accounted for 70.30 percent ($1,217.21m) of total capital importation.\nWhen compared with the corresponding quarter of 2020, capital importation as well increased by 18.47 percent from $1.46 billion.\nThe trend of declining foreign investment, particularly FDI, is a worry for Nigeria in dire need of private capital to boost economic growth and create jobs."
  },
  {
    "headline": "Omicron’s mild effect signals end to COVID-19 severity",
    "summarized_story": "A new study suggests that immunity developed against Omicron can also protect against Delta, justifying how omicron outpaced Delta as the most dominant coronavirus variant.\nThis was detected in previously vaccinated and unvaccinated individuals who were infected with COVID-19 in the Omicron infection wave soon after symptoms started.\nThis also implies that while Omicron displaces Delta, it takes over re-infections in individuals with weak Delta infections and then counteracts itself.\n“The increase in Delta variant neutralization in individuals infected with Omicron may result in a decreased ability of Delta to re-infect those individuals.\nThat means there’s a chance that people who catch Omicron and experience it as a mild upper respiratory illness might not gain much protection if a more severe variant emerges."
  },
  {
    "headline": "Edo’s Ossiomo Power, FG conclude power supply agreement – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as firm lauds Obaseki on reforms to liberalize state’s electricity sectorThe Edo State Government’s Public Private Partnership (PPP) initiative, Ossiomo Power, has concluded an agreement with the Benin Owena River Basin Authority for the supply of electricity to the authority’s facilities.\nManaging Director, Ossiomo Power, Dr. Uwa Igiehon, who disclosed this in a chat with journalists, said the development is another milestone for the government-backed power initiative.\nAccording to him, “The Benin Owena River Basin Authority, which is a Federal Government agency, had been cut off from the National Grid for nearly four years.\nThe Benin Owena River Basin Authority is located in the same area so we reached an agreement to connect them to our plant.”He noted that the power supply agreement will provide power to the facilities at the Federal Government-owned institution to enable it live up to its mandate.\nHe expressed appreciation to the Edo State Governor, Mr. Godwin Obaseki, who instituted proactive policies in the electricity sector in the state to facilitate the company’s investment in power generation."
  },
  {
    "headline": "Edo govt announces school’s resumption, insists on close of Idogbo secondary school – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has announced Monday 10th January 2022 as the resumption date for all primary and secondary schools in the state.\nIn a statement, Permanent Secretary, Edo State Ministry of Education, Mrs. Stella-Maris Imasuen, said parents/guardians are to ensure that all relevant learning materials are provided for their children/wards.\nShe however noted that Idogbo secondary school remains closed till further notice.\nImasuen stated, “This is to inform principals, Primary School Heads, Proprietors of private schools, Parents/Guardians and the general public that all schools: primary and secondary (public and private) in Edo State resume for the second term of 2021/2022 on Monday 10th January 2022.\n“However, Idogbo secondary school, Idogbo remains closed till further notice.”“Parents/Guardians are to ensure that their children/wards have relevant learning materials necessary for learning before coming to school,” she charged."
  },
  {
    "headline": "Edo Central Hospital Repositioned for Quality Service Delivery – Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State government has said that the Central Hospital on Sapele Road, Benin City, adjacent to Edo Specialist Hospital was being repositioned for quality service delivery.\n“We have had to take a decision that that infrastructure is not good enough for Edo people.\n“So, what we have done is, some of the staff who use to work in that structure have been moved into Edo Specialist Hospital to take care of the surge in attendance, which is already happening.\nHer reaction was in apparent response to speculation that the hospital was being relocated to the Stella Obasanjo Hospital.\nAccording to her, “The decision to operate health care provision for our citizens meant that there has to be a lateral movement of services from Central Hospital to Edo Specialist Hospital."
  },
  {
    "headline": "Wike has set Rivers on the threshold of development – Nsirim …Urges journalists to be part of NEW vision history – Nigerian Observer",
    "summarized_story": "Wike has set Rivers on the threshold of development – Nsirim …Urges journalists to be part of NEW vision historyShare FacebookTwitterStumbleuponLinkedInPinterestRivers State Governor, Nyesom Ezenwo Wike has set the State on the threshold of a development agenda that catalyses progress in all facets of life, the State Information and Communications Commissioner, Pastor Paulinus Nsirim has said.\nThe Commissioner was speaking at a dinner he held for members of the Nigerian Union of Journalists, Rivers State Council, at the Ernest Ikoli Press Centre, Port Harcourt.\n“Governor Wike stands tall among Governors in the country.\nNsirim urged journalists in the State to strive to make inputs that would speak for them as people who also contributed to the development of Rivers State during the administration of Governor Wike.\nHe expressed the commitment of members of the Association to the realisation of the development agenda of the State Government under Governor Wike."
  },
  {
    "headline": "KAZAFIN SATA: Kotu ta yanke wa tsohon kansila hukuncin biyan sama da Naira miliyan 4 ga matan da ya sa ta yi rawa zindir a bainar jama’a",
    "summarized_story": ""
  },
  {
    "headline": "Jami’an tsaro sun kashe ‘yan bindiga biyar a karamar hukumar Giwa",
    "summarized_story": ""
  },
  {
    "headline": "Gwamnatin Buhari za ta murkushe ‘yan bindiga a kasar nan – APC",
    "summarized_story": ""
  },
  {
    "headline": "JIGAWA: ‘Yan sanda na farautar matashin da ya kashe Wansa da wuka",
    "summarized_story": ""
  },
  {
    "headline": "Kanawa sun yi ragaraga da NECO cikin Ɗalibai 89,000 da suka rubuta jarabawar, ɗalibai 80,000 sun cinye duka darussa 9 – Kwamishina Kiru",
    "summarized_story": ""
  },
  {
    "headline": "APC promises to reconcile warring factions before 2022 National Convention",
    "summarized_story": "From PETER OKORE, UmuahiaThe All Progressives Congress (APC) says the party is moving towards reconciling all existing warring factions in the party in all the states of the federation, before its proposed National Convention scheduled to hold next month (February).\nChairman of the 2022 APC Special State Congress Committee for Abia state, Hon.\nKolawale Babatunde, who dropped this hint in Umuahia, while announcing the results of the state Congress, said that the party cannot afford to go for the National convention in factions.\nHe said he was on a rescue mission to take over Abia state from the PDP in the 2023 general elections.\nHe disclosed that efforts were on to identify and eject those PDP-sponsored members hired to destabilize the APC in Abia state."
  },
  {
    "headline": "2023: Buhari’s endgame plan in danger",
    "summarized_story": "And this seems to be the prospective fortune of Nigeria’s sitting president, Muhammadu Buhari whose tenure of office expires either in May or June, 2023.\nThe onus is now on the ruling party and President Buhari to redeem the party from imminent collapse.\nThe worsening crisis in the All Progressives Congress, APC the party that brought President Buhari to power is a direct assault and indeed, revolt, against his succession plan.\nThis explains the controversy over the electoral amendment bill vetoed by President Buhari on December 19, 2021.\nPresident Buhari may have become APC’s only unifying factor and trump card."
  },
  {
    "headline": "2023: Tinubu meets Buhari, declares his intention to run for president",
    "summarized_story": "Former Lagos State governor, Bola Tinubu, has declared his intention to run for president ahead of the 2023 general election.\nTinubu who declared his intention on Monday while speaking with journalists at the Aso Rock Villa after meeting with President Muhammadu Buhari, said he told the president that he to go for the APC’s presidential ticket.\nHe said he was qualified to rule Nigeria, while listing achievements he made as governor of Lagos State.\n“I’ve informed the President of my intention but I have not informed Nigerians yet.\nYou’ve gotten that truth from me that I have informed Mr. President of my ambition, I did not expect more answers than that,” he added."
  },
  {
    "headline": "2023: Buhari holds close door meeting with Tinubu in Aso Rock",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari and former Lagos State governor, Bola Ahmed Tinubu, are in a closed-door meeting at the Aso Rock Villa, Abuja.\n“President Buhari receives in audience APC Chieftain Asiwaju Bola Ahmed Tinubu in State House on 10th Jan 2022,” presidential spokesman, Femi Adesina wrote in a Facebook post.\nThough the reason for the meeting was not disclosed, it may not be unconnected with the controversy over the proposed national convention of the All Progressive Congress (APC) and the quest by a number of its big wigs, including Tinubu, for power ahead of the 2023 general election.\nTinubu’s visit notably comes days after Buhari warned members of the APC that they may lose the 2023 general elections to the Peoples Democratic Party if they refused to settle their differences.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Osun APC: Oyetola’s Group Urges Reconciliation C’ttee To Dismiss TOP’s Allegations",
    "summarized_story": "The Ilerioluwa faction’s position was made known when the Committee met with them and the patron of the group at the Government House, Osogbo on Monday.\n“The Committee should take note that, these so-called TOP members have constituted themselves into a team more vicious than the opposition.\nThey do not have respect for the governor or the leadership of the party headed by Prince Gboyega Famodun.\nSimeon Popoola; the party chairman-elect, Prince Gboyega Famodun; reaffirmed the commitment of the party’s leadership to ensure unity and oneness.\n“When we came yesterday, our port of call was to visit Mr Governor to declare that we are at his domain."
  },
  {
    "headline": "Gunmen Kidnap Ex-Imo Speaker, Others",
    "summarized_story": "A former speaker, Imo State House of Assembly, Hon.\nEye-witness account stated that Duruji was kidnapped at Ehime Mbano LGA of the State while returning from a function.\nThe kidnappers also abducted the wife of an ex-chairman of Okigwe local government area, and the commandant-general of the Imo Community Watch, Hon.\nADVERTISEMENTAlso, unidentified persons were kidnapped at Okwelle junction in the Onuimo LGA of the state.\nHowever, another set of unidentified persons were abducted at Umbomiri junction in the Mbaitoli and Amaraku in the Mbano LGA of the state."
  },
  {
    "headline": "Youths Kick As FCTA Halts Sporting Activities At Old Parade Ground",
    "summarized_story": "Youths, especially athletes are currently protesting the dismantling of Area 10 Old Parade Ground football pitch by the Federal Capital Territory Administration (FCTA).\nThe ground is being converted for the storage of the maize.\nLabourers were sighted pulling down the perimeter fence to make way for trucks loaded with maize to pass through for offloading, thereby destroying the football pitch permanently.\nAlso in a bid to broaden space for heavy-duty trucks, FCTA reportedly pulled down a major fence leading directly to the pitch.\nADVERTISEMENTThe football pitch is where most teams in FCT train and play their league matches every week."
  },
  {
    "headline": "Youths Kick As FCTA Halts Sporting Activities At Old Parade Ground",
    "summarized_story": "Youths, especially athletes are currently protesting the dismantling of Area 10 Old Parade Ground football pitch by the Federal Capital Territory Administration (FCTA).\nThe ground is being converted for the storage of the maize.\nLabourers were sighted pulling down the perimeter fence to make way for trucks loaded with maize to pass through for offloading, thereby destroying the football pitch permanently.\nAlso in a bid to broaden space for heavy-duty trucks, FCTA reportedly pulled down a major fence leading directly to the pitch.\nADVERTISEMENTThe football pitch is where most teams in FCT train and play their league matches every week."
  },
  {
    "headline": "Buhari Will Sign Electoral Bill If NASS Removes Direct Primaries Clause – Amaechi",
    "summarized_story": "Chibuike Rotimi Amaechi, has declared that President Muhammadu Buhari will sign the Electoral Act (Amendment) Bill 2021 into law if the National Assembly removes the controversial Direct Primaries clause.\nAmaechi made the declaration at the weekend during an event organised by the All Progressives Congress (APC) at Ogbogoro Community in Obio/Akpor local government area of Rivers State.\nThe President will sign the Electoral Act after they remove the direct primaries.\nAmaechi said: “80 per cent of those who said they are leaving are those we fed, supported them as governor.\nSo, ignore them.”He stated that the APC will ensure that it recovers Rivers State come 2023 general election."
  },
  {
    "headline": "Attack: TotalEnergies shuts down power plant pipeline in Imo",
    "summarized_story": "The Niger Delta Power Holding Company (NDPHC) Limited has disclosed that it has been forced to shutdown its 504 Mega Watts Alaoji Power Plant in Imo State following an attack on the gas pipeline of TotalEnergies EP Nigeria Limited.\nThe Line Block Valve at KP38 was closed to isolate the sabotage point and depressurization of the line, this will affect gas supply to Alaoji (Power Plant) until further notice”.\nAs a result of this development, TotalEnergies EP Nigeria Limited stated that “Gas supply to Alaoji Power Plant was suspended due to this unfortunate event.\nPreliminary investigation to determine the extent of the damage is ongoing, and repair works shall commence as soon as feasible.”Without gas supply NDPHC announced “the shutdown of 504MW Alaoji Power Plant on January 7, 2022”.\n“The management of NDPHC hereby assures our customers that Alaoji Power Plant and others will resume power generation as soon as gas supply is restored”, the statement added."
  },
  {
    "headline": "Attack: TotalEnergies shuts down power plant pipeline in Imo",
    "summarized_story": "The Niger Delta Power Holding Company (NDPHC) Limited has disclosed that it has been forced to shutdown its 504 Mega Watts Alaoji Power Plant in Imo State following an attack on the gas pipeline of TotalEnergies EP Nigeria Limited.\nThe Line Block Valve at KP38 was closed to isolate the sabotage point and depressurization of the line, this will affect gas supply to Alaoji (Power Plant) until further notice”.\nAs a result of this development, TotalEnergies EP Nigeria Limited stated that “Gas supply to Alaoji Power Plant was suspended due to this unfortunate event.\nPreliminary investigation to determine the extent of the damage is ongoing, and repair works shall commence as soon as feasible.”Without gas supply NDPHC announced “the shutdown of 504MW Alaoji Power Plant on January 7, 2022”.\n“The management of NDPHC hereby assures our customers that Alaoji Power Plant and others will resume power generation as soon as gas supply is restored”, the statement added."
  },
  {
    "headline": "Court Adjourns Suspected Internet Fraudster, Alogba Olaoluwa’s Trial Till March 14",
    "summarized_story": "Solebo of the Special Offences Court sitting in Ikeja, Lagos, on Monday, January 10, 2022, adjourned till March 14, 2022 for adoption of written addresses in the case involving one Alogba Afeez Olaoluwa.\n“After the statement, I was charged to court and I pleaded not guilty to clear my name,” he said.\nMohammed, the defendant admitted that he was arrested on March 7, 2020 and that he gave his statement on March 8, 2020.\nMohammed confronted him with Exhibit A, his statement to the EFCC, and Exhibit B, the documents printed out from his email.\nThe case was, thereafter, adjourned till March 14, 2022 for adoption of written addresses."
  },
  {
    "headline": "Court Adjourns Suspected Internet Fraudster, Alogba Olaoluwa’s Trial Till March 14",
    "summarized_story": "Solebo of the Special Offences Court sitting in Ikeja, Lagos, on Monday, January 10, 2022, adjourned till March 14, 2022 for adoption of written addresses in the case involving one Alogba Afeez Olaoluwa.\n“After the statement, I was charged to court and I pleaded not guilty to clear my name,” he said.\nMohammed, the defendant admitted that he was arrested on March 7, 2020 and that he gave his statement on March 8, 2020.\nMohammed confronted him with Exhibit A, his statement to the EFCC, and Exhibit B, the documents printed out from his email.\nThe case was, thereafter, adjourned till March 14, 2022 for adoption of written addresses."
  },
  {
    "headline": "JUST IN: Mompha rearrested for laundering money for Yahoo Yahoo boys",
    "summarized_story": "The Lagos Command of the EFCC has rearrested a suspected internet fraudster, Ismaila Mustapha a.k.a Mompha for laundering funds obtained through unlawful activities and retention of alleged proceeds of crime.\nMompha was arrested on Monday 10 January, EFCC spokesman Wilson Uwujaren said.\nThe suspect is currently standing trial alongside his company, Ismalob Global Investment Limited on an amended twenty two-count charge bordering on cyber fraud and money laundering to the tune of N32.9bn (Thirty-two Billion Nine Hundred Thousand Naira) brought against him by the EFCC.\nMompha was initially arrested on 18 October 2019 at Nnamdi Azikiwe International Airport, Abuja, while boarding an Emirates Airline Flight to Dubai.\nMompha is alleged to have used his registered companies to receive illicit funds on behalf of “Yahoo Yahoo” boys from across the world in return for commission."
  },
  {
    "headline": "Bulldozers level Gwarinpa Abuja shanties",
    "summarized_story": "By Salisu Sani-IdrisThe Federal Capital Territory Administration (FCTA) on Monday cleared shanties converted to residential and commercial purposes, mainly by scavengers, traders and settlers.\nMost of the demolished shanties are scrap materials sitting on right of major road network around Angwan Berberi, off Efab Estate, and behind Kado Fish Market, near Life camp axis of Gwarimpa District of Abuja.\nAttah said that the FCTA discovered a very worrisome development on the road, which was Cadastral C02 road corridor in Gwarinpa, which people have built houses on.\n“Most of the Federal Capital Development Authority road corridors are transit ways not yet constructed, but people have already built on them.\n” We just finished, and we intended to pack in today; we actually spent about N3 million to set this building in this area."
  },
  {
    "headline": "2023: ‘Expect More Hardship’ – Nigerians React As Tinubu Informs Buhari Of His Presidential Ambition",
    "summarized_story": "Some Nigerians have expressed mixed reactions over the decision of Bola Tinubu, National Leader of the All Progressives Congress, APC, to run for presidency in 2023.\nThey noted that Nigerians should expect more hardship if Tinubu eventually becomes president in 2023.\nWhile some Nigerians support Tinubu’s ambition, others are of the opinion that the APC chieftain would make Nigeria worse.\nThe former governor of Lagos State had earlier declared that he has informed President Muhammadu Buhari of his intentions to run for the Presidency in 2023.\nNoting that his ambition to be president had been a life-long ambition, Tinubu said he has the capacity to replicate what he did in Lagos State in Nigeria, if given the chance."
  },
  {
    "headline": "2023: Tinubu Needs To Be Careful Of Osinbajo – Jonathan’s Ex-Aide, Omokri",
    "summarized_story": "2023: Tinubu Needs To Be Careful Of Osinbajo – Jonathan’s Ex-Aide, OmokriAsiwaju Bola Tinubu, national leader of the All Progressives Congress (APC), has been warned to be careful of Vice President, Yemi Osinbajo ahead of the 2023 presidential election.\nThis is coming after Tinubu informed President Muhammadu Buhari of his intention to vie for the presidential ticket of the party in 2023.\nReacting, Omokri warned that Osinbajo’s recent statements, pictures and mannerisms are suspicious.\nAccording to him, the Vice President’s attempt to distance himself from Buhari is a warning for Tinubu to be very careful.\nOn his Twitter page, he wrote: “With the way and manner Vice President Osinbajo is packaging himself, carefully releasing scripted subliminal messages, and releasing staged ‘un-staged’ photos, and attempting to distance himself from Buhari, one thing is VERY clear: Tinubu needs to be VERY careful.”"
  },
  {
    "headline": "BREAKING: I’ve Informed Buhari Of My Presidential Ambition – Tinubu",
    "summarized_story": "Asiwaju Bola Tinubu, National Leader of the All Progressives Congress (APC), says he has informed President Muhammadu Buhari of his presidential ambition.\nTinubu said this in an interactive session with State House Correspondents after meeting the president at Aso Rock on Monday.\n“I’ve informed the president of my intention but I have not informed Nigerians yet.\nAlthough there have been clear indications that he is interested in the highest office in the land, Tinubu has been avoiding direct comments on it.\nOne month after, elder Statesman, Tanko Yakasai, said Tinubu sought his support for the nation’s number one job."
  },
  {
    "headline": "BREAKING: Tinubu Visits Buhari In Aso Rock",
    "summarized_story": "President Muhammadu Buhari is currently hosting the National Leader of the ruling All Progressives Congress (APC) and former governor of Lagos state, Asiwaju Bola Ahmed Tinubu, at the Aso Rock Presidential Villa, Abuja.\nThough the meeting’s agenda is unknown, it has been learned that the focus will be on the conflicts that have led to postponing the decision to set a firm date for the APC National Convention.\nTinubu is believed to be a strong contender for the APC presidential ticket ahead of 2023 election.\nLast Friday, Chairman of the Northern Governors Forum and Governor of Plateau State, Simon Lalong, met the President over the coming convention.\nIn an interview the President granted to NTA, he had warned his party to take the issue of convention seriously."
  },
  {
    "headline": "Breaking: Despite maize farmers’ claims, FCT Minister stops moves to disrupt football activities on Abuja pitch",
    "summarized_story": "The authorities of the Federal Capital Territory (FCT) have immediately ordered some maize farmers to stop planned disruption of activities on Abuja football pitch located inside old parade ground.\nBlueprint crew had stormed the prestigious old parade ground on Monday where it was discovered that some part of the perimeter fence of the football playing ground was being removed in preparation for the hatched plans by some persons, officially unknown to FCTA.\nHowever, on Monday night, a media aide to the FCT Minister of state, Aderonke Bello, informed Blueprint via telephone call that such moves had been averted.\nSince then, most football clubs have been using the grass turf as their training and playing ground for top class League matches.\nAside football activities, the side part of the pitch has laid tracks where athletes and other individuals use for fitness purposes."
  },
  {
    "headline": "Breaking: Court rules on detained Novak Djokovic ahead Australian Open",
    "summarized_story": "Novak Djokovic has won a court battle to stay in Australia to contest the Australian Open despite being unvaccinated against COVID-19, but the government has threatened to cancel his visa for a second time.\nJudge Anthony Kelly has quashed the visa cancellation, and ordered the Australian Government to pay legal costs and release Djokovic from detention within half an hour as he delivered his verdict at 6.16am GMT.\nGovernment counsel Christopher Tran notified the court that the Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs – not the minister who made the original visa cancellation – will now consider whether to exercise a personal power of cancellation of Djokovic’s visa.\nEarlier in the day, Djokovic was removed from detention to be with his lawyers during the hearing, and Judge Kelly expressed agitation over the rejection of Djokovic’s medical exemption.\nDjokovic’s lawyers presented their arguments to the court, but government lawyer Mr Tran only spoke for half an hour before a lengthy adjournment."
  },
  {
    "headline": "Why we exonerated Dowen College students, others – DPP",
    "summarized_story": "The Lagos state Directorate of Public Prosecution (DPP) has explained further why the state exonerated five students and five officials of Dowen College, Lagos State, suspected to be linked to the death of a student, Sylvester Oromoni.\nThe first autopsy was conducted by the Oromoni family in Warri, Delta, and the second by the Lagos State Government, according to the source.\nThe result of the autopsy conducted in Warri revealed acute bacteria pneumonia, acute pyelonephritis, acute bacterial hepatitis, acute gastritis and cerebral oedema with raised intra-cranial pressure.\nThe seven pathologists included four pathologists, who each represented Dowen College and three of the accused students.\nThe result of the autopsy conducted in Lagos revealed marked pallor of organs, pneumonia (infection of the lungs), infection of the liver, kidney and heart."
  },
  {
    "headline": "I Have Informed Buhari Of My Intention To Run For President, Says Tinubu",
    "summarized_story": "﻿A chieftain of the All Progressives Congress (APC), Bola Tinubu, says he has informed President Muhammadu Buhari of his intention to contest the presidential election in 2023.\nHe, however, declared that he has yet to inform Nigerians of his intention to succeed the President.\nTinubu stated this on Monday while briefing State House correspondents after he met with President Buhari at the Aso Villa in Abuja.\nAt some point, reporters asked him what it feels like to be in the presidential race with the Vice President, Professor Yemi Osinbajo, who has also been tipped to succeed the President.\nTinubu, however, believes the President will determine whether or not it will be conducted next month, as leader of the party."
  },
  {
    "headline": "UPDATED: Greece Donates J&J COVID-19 Vaccines To Nigeria",
    "summarized_story": "﻿Greece has donated about one million doses of the Johnson and Johnson (J&J) COVID-19 vaccine to Nigeria as the Federal Government moves to ensure more citizens are vaccinated against the disease.\nHe said Nigeria and Greece have enjoyed a favourable bond over the years and that his country was even willing to expand the relationship.\nOnyeama, on his part, said Nigeria has enjoyed a smooth partnership with Greece in the area of defence.\nFollowing the new infections reported, Nigeria has now confirmed a total of 248,312 since it reported its first case in February 2020.\nWhile the NCDC said it has collected and tested a total of 3,863,081 samples, the country has 26,238 COVID-19 cases that are still active."
  },
  {
    "headline": "NASS Workers Protest, Demand Minimum Wage Implementation",
    "summarized_story": "﻿Members of the Parliamentary Staff Association of Nigeria (PASAN) have held a protest at the National Assembly complex over unpaid allowances.\nThe workers occupied the NASS complex on Monday morning chanting songs of solidarity and displaying various placards.\nAmong other demands, the workers want the full implementation of the national minimum wage signed into law in 2019 as well as the revised condition of service.\nREAD ALSO: ECOWAS Countries To Shut Borders, Withdraw Ambassadors From MaliThe workers accused the National Assembly management of breach of the Memorandum of Understanding (MoU) entered with the union on the 13th of April, 2021 on the full implementation of the new national minimum wage Act 2019 and the revised condition of service.\nAddressing the workers, the Chairman of PASAN, Sabiyi Sunday said executives of the association would be attending an emergency meeting called by the National Assembly Service Commission to address issues raised by the workers."
  },
  {
    "headline": "NCDC Alerts States As Lassa Fever Death Toll Hits 102",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) said it has sent letters to states to alert the authorities on the disturbing trend of Lassa fever outbreak in the country.\n“In week 52, the number of new confirmed cases decreased from 29 in week 51, 2021 to 28 cases,” it stated.\nThe predominant age group affected, according to the NCDC, is 21-30 years while the male to female ratio for confirmed cases is 1 : 0.9.\n“The five Lassa fever molecular laboratories in the NCDC network are working full capacity to ensure that all samples are tested, and results provided within the shortest turnaround time,” the agency said.\nLassa fever is an acute viral illness and a viral haemorrhagic fever first reported in the Lassa community in Borno State when two missionary nurses died from an unusual febrile illness."
  },
  {
    "headline": "NANNM Suspends 3-Day Warning Strike",
    "summarized_story": "The National Association Of Nigeria Nurses And Midwives (NANNM) has suspended its 3-day warning strike in Lagos State.\nThis follows a meeting between NANNM’s management and Governor Babajide Sanwo-Olu on Sunday.\nAccording to a statement by NANNNM’s State Secretary, Toba Odumosu, issues of agitation of nurses and midwives in Lagos were presented in an earlier notice of strike action, and the governor’s interventions on the demands urged the council to call for an emergency congress for 12noon Monday 10th January 2022.\nThe spokesperson noted that after considerations and a review of feedbacks and resolutions reached with the government, the congress has taken the decision to suspend the strike action effective from Tuesday 11th January 2022 by 8 am.\nAll nurses within the metropolis were urged to return to their duty post on Tuesday."
  },
  {
    "headline": "I am committed to APC retaining Power",
    "summarized_story": "Niger State Governor and Chairman North Central States Governors’ Forum Abubakar Sani Bello says he remains resolute and committed to seeing that the ruling All Progressive Congress (APC) retains power at the center as well as at the states and local government levels in the country.\nReceiving a high-powered delegation from the Senator George Akume Contact Team at Government House, Minna, Governor Sani Bello stated that it was deserved of the North Central Geopolitical Zone to get fair bargain in the political arrangement of the nation.\nThe Governor opined that the North Central Zone had been sociopolitically marginalized and unfairly treated in terms of Infrastructural development,noting that the region’s infrastructure has suffered immense deterioration because of its location as gateway between the northern and southern parts of the country."
  },
  {
    "headline": "My ambition to be President has been a life-long ambition -Tinubu",
    "summarized_story": "A national leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has notified President Muhammadu Buhari of his intention to contest the 2023 presidential election.\nTinubu asserted that his ambition to be president of Nigeria has been a life-long ambition, nothing that with what he did in Lagos in his time as governor, he has the capacity to rule Nigeria.\nOn Osinbajo’s potential ambition, the APC national leader maintained that he would not discuss any individual.\nI’ve informed the president of my intention but I have not informed Nigerians yet.\nYou’ve gotten that truth from me that I have informed Mr President of my ambition."
  },
  {
    "headline": "Asiwaju Tinubu informs President Buhari of intention to contest for 2023 Presidential Election",
    "summarized_story": "APC National Leader Asiwaju Bola Tinubu says he has informed President Muhammadu Buhari of his intention to pursue his ambition of becoming President of the Federal Republic of NigeriaAsiwaju TINUBU disclosed this to Statehouse Correspondents after meeting with the President at the Presidential Villa on MondayAnd while he has made his intentions known to the President, he says he is still consulting widely and will soon make his intentions known to the peopleA lot of pressure have comes from all quarters from people and groups who have urged Asiwaju TINUBU to contest for the Presidency come 2023The APC National Leader believes he is best positioned to carry on from where President Buhari stops and take Nigeria into a better future"
  },
  {
    "headline": "Nigerian youths urged to embrace entrepreneurial skills",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria: Tinubu Says He Has Informed Buhari About Presidential Ambition",
    "summarized_story": "Former Governor of Lagos State and National Leader of the ruling All Progressives Congress (APC), Senator Bola Ahmed Tinubu, said he had informed President Muhammadu Buhari about his presidential ambition.\nSpeaking with newsmen after a closed-door meeting on Monday with President Buhari at the State House, Abuja, Tinubu said he had formally informed the President about his plan to succeed him in 2023.\nHis words: “I’ve informed the President of my intention but I have not informed Nigerians yet.\nAnd I’ve not set a parameter of limitation to the extent of how many people will I consult.\nYou’ve gotten that truth from me that I have informed Mr. President of my ambition, and you don’t expect more answers than that”."
  },
  {
    "headline": "Dele Momodu Unveils ‘Owners of Nigeria’, Says They Chose Atiku Over Tambuwal in 2019",
    "summarized_story": ""
  },
  {
    "headline": "Dele Momodu: Nigeria’s Biggest Problem is Unity But I’m a Child of Diversity",
    "summarized_story": ""
  },
  {
    "headline": "Dele Momodu: Global Appeal Important to Winning 2023 Election",
    "summarized_story": ""
  },
  {
    "headline": "Atiku Abubakar Condemns Zamfara Massacre – Trending With Ojy Okpe",
    "summarized_story": "The Hollywood Foreign Press Association announced the winners of the 2022 Golden Globes via Twitter on Sunday night, with no media in attendance or celebrities walking the red carpet.\nIn Nigeria, former Vice President Atiku Abubakar, on Sunday, lent his voice to the security challenges facing the nation.\nIn a post shared on his social media handles, The Atiku said security should be beefed up to avoid the wastage of lives.\nAtiku was reacting to the massacre of over 200 residents of Zamfara State on the 6th of January.\nFinally Evangelist Funmilayo Adebayo nicknamed Mummy G.O, on social media, was trending over the weekend after comments she made during an interview she granted BBC pidgin, in which she claimed that most of the controversial videos of her circulating online were edited."
  }
]