[
  {
    "headline": "Christmas: Sanwo-Olu urges Christians on peace, tolerance",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Ltd. says Friday’s pipeline fire in Iyana-Odo/Baruwa axis of Lagos State will not disrupt the supply of petroleum products across the country.\nMalam Mele Kyari, Group Managing Director, NNPC Ltd., gave the assurance when he visited the scene of the incident.\n“We want to assure Nigerians that this incident will not affect the supply and distribution of petroleum products across the country,” he said.\nKyari said NNPC officials were working with the Lagos State Government and other relevant authorities to permanently put off the fire.\n“We are currently working with our TCN colleagues to ensure quick resolution and will keep you updated on the situation."
  },
  {
    "headline": "COVID-19: Govt tasks Deltans on non-pharmaceutical safety measures",
    "summarized_story": "…enjoins residents to get vaccinatedBy Festus Ahon, ASABADELTA State Commissioner for Health, Dr Mordi Ononye, has told Deltans to adopt non-pharmaceutical safety measures and get vaccinated so as to stem the spread of COVID-19.\nSpeaking during a press briefing in Asaba, Ononye who was flanked by his Information counterpart, urged Deltans to strictly adherence to all the protocols of the virus in the state.\nHe added that the COVID-19 vaccines were safe and good for the well-being of all.\nso, those negative information being spread around will not help us as a people,” he said.\nHe, however, thankedGod that the state had not recorded any death in the wave of OMICRON variant."
  },
  {
    "headline": "NNPC says Lagos pipeline explosion will not disrupt supply of petroleum products",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Ltd. says Friday’s pipeline fire in Iyana-Odo/Baruwa axis of Lagos State will not disrupt the supply of petroleum products across the country.\nMalam Mele Kyari, Group Managing Director, NNPC Ltd., gave the assurance when he visited the scene of the incident.\nKyari said the fire incident was as a result of power line collapse on a section of System 2B pipeline within the area.\n“We want to assure Nigerians that this incident will not affect the supply and distribution of petroleum products across the country,” he said.\nKyari said NNPC officials were working with the Lagos State Government and other relevant authorities to permanently put off the fire."
  },
  {
    "headline": "Electoral Act Amendment Bill: I’m not aware of any collection of signature to veto president assent -Gbajabiamilla",
    "summarized_story": "–As NASS transmits 2022 Appropriation Bill to Buhari next weekBy Johnbosco AgbakwuruSpeaker of the House of Representatives, Femi Gbajabiamilla has debunked the report that members of the National Assembly especially the Green Chamber have started collecting signature to veto President Muhammadu Buhari’s assent on the Electoral Act Amendment Bill.\nThere were criticisms as President Buhari declined to assent to the Electoral Act Amendment Bill passed by the two chambers of the National Assembly and transmitted to him.\nGbajabiamila said, “I’m not aware of any such threats to override the President’s decision; at least not in my chambers.\nIn fact, we’re very sure that Mr President will sign the bill into an act of the National Assembly next week by the grace of God.\n“So, I want to thank Mr President for thanking the National Assembly."
  },
  {
    "headline": "NiMet predicts 3-day haziness from Saturday",
    "summarized_story": "The Nigerian Meteorological Agency (NiMet) has predicted hazy weather condition from Saturday till Monday across the nation.\nAccording to the agency, moderate dust haze is also anticipated over the north central region throughout the forecast period.\nNiMet forecasts moderate dust haze over northern region and north central cities on Sunday with a range of horizontal visibility from 2000m to 5000m and localised visibility of less than or equal to 1000m.\nThe agency envisages dust haze over the northern cities and the north central region of the country during the forecast period on Monday.\nAccording to NiMet, the inland cities of the south and coastal cities of the south should experience hazy atmosphere during the forecast period."
  },
  {
    "headline": "Christmas: Blackout looms in Lagos as five electricity towers collapse",
    "summarized_story": "At least, five electricity transmission towers collapsed on Friday in Lagos State.\nThe fire caused massive damage to a 330kV Ikeja-West Akangba transmission line 1 and burnt off a large portion of the conductor.\nAccording to the Transmission Company of Nigeria (TCN), the development triggered a resistant pull on the high-tension towers along the line route causing five of them to collapse.\nOnce it is energized, supply will be restored to all the substations affected by the incident from the second 330kV transmission line, as the load carried by the burnt 330kV line will now be transferred to the second line.\nThis is because the re-erection of five towers and restringing of the 330kV transmission line is a major project that costs a lot of money and will take a while to complete."
  },
  {
    "headline": "Ibadan-based civil war photographer, Owolabi Ositelu dies at 86",
    "summarized_story": "A foremost civil war photographer in Ibadan, the Oyo State capital, Pa David Owolabi Ositelu, is dead.\nDAILY POST gathered that Ositelu died on Friday.\nAlabi said that the deceased “died peacefully in his Isale-Osi, Ibadan studio this afternoon”.\nHe said that Ositelu, has been a celebrated photographer who started his profession during the Old Western Region.\n“His competence as photographer brought his services to the tables of foremost politicians, statesmen and even the military since 1963, eventually leading him to the war front as a war photographer during Nigeria’s Civil War (1967-1970).”"
  },
  {
    "headline": "Christmas: Northern govs are patriots by day, terrorists at night – Ex- Senate President, Ebute",
    "summarized_story": "Third Republic Senate President, Senator Ameh Ebute, has alleged that some serving Northern governors are festering insecurity in the region and across the country.\nEbute lamented that these governors and supposed leaders act as patriots during the day but are bandits and terrorists at night.\nThe former Senate President made the allegation in his Christmas message titled ‘The gathering storm must not consume us’.\nThat I look behind the scenes and discover that even some serving Northern Governors are the forces backing festering insecurities in the region.\nRecent media reports have raised a lot of dusts on plots by some Northern Governors to destabilize the country."
  },
  {
    "headline": "Prominent Nigerians raise alarm over insecurity, unemployment",
    "summarized_story": "The Alumni Association of the National Institute (AANI) says it is deeply concerned about security and socio-economic problems.\nIn a Christmas message on Friday, the body of ex-security officials and other prominent Nigerians, including elder statesmen and women, urged the government to do more.\nA statement by National President, Mohammed Abubakar, said most of Nigeria’s challenges are deeply rooted and require concerted, participatory and proactive measures.\nOn the 2023 general election, AANI appealed to the political class to uphold global best practices.\n“They must focus on security, welfare, economic prosperity and place Nigerians above ambitions and interests."
  },
  {
    "headline": "International Crisis Group appoints Nigeria’s Comfort Ero as president",
    "summarized_story": "The International Crisis Group has appointed Nigeria’s Comfort Ero as President and Chief Executive Officer (CEO).\nEro, currently Africa Program Director and interim Vice President, will assume office after an extensive year-long search.\nEro joined Crisis Group in 2001 and was West Africa Project Director until 2004.\nEro served as deputy Africa Pogram Director, International Centre for Transitional Justice (2008-2010); Political Affairs Officer and Policy Advisor to UN Mission Liberia Special Representative (2004-2007).\n“The President firmly believes in the ability of this shining star to take the International Crisis Group to new and enviable heights in its work of preventing wars and shaping policies that will build a more peaceful world”, it added."
  },
  {
    "headline": "11 things you probably didn’t know about Bola Ige",
    "summarized_story": "11 things you probably didn’t know about Bola IgeChief James Ajibola Idowu Ige (SAN) was the Attorney-General and Minister of Justice renowned for his oratorial prowess and advocacy work on civil rights and democracy.\nHere are 11 things you probably did not know about the late Ige1.\nBola Ige was born in Esa Oke, Osun State in September 13, 1930.\nHe was a Nigerian lawyer and politician, who served as Attorney-General and Minister of Justice under former President Olusegun Obasanjo.\nIge established Bola Ige & Co in 1961 and later became a Senior Advocate of Nigeria."
  },
  {
    "headline": "‘I became an orphan again with Ige’s death’",
    "summarized_story": "‘I became an orphan again with Ige’s death’Elder statesman and former Osun State Governor Bisi Akande was on his way to Osogbo after a trip to the United Kingdom when Muyiwa Ige broke the news of his father’s death.\nHe drove in his car with Akinwumi and they headed for Osogbo via the old road from Ibadan, passing Iwo.\nThen, the line went off,” Akande recalled.\nMembers of the team started groaning and moaning and there was general confusion.\n“It was President Obasanjo on the other end,” Akande recalled."
  },
  {
    "headline": "Ige wanted to resign from Obasanjo’s govt before murder, says Akande",
    "summarized_story": "Ige wanted to resign from Obasanjo’s govt before murder, says AkandeChief Bola Ige intended to resign from the government of Chief Olusegun Obasanjo before he was killed on December 23, 2001, former Osun State Governor Chief Bisi Akande has said.\nAkande, in his book, ‘My Participations’, recalled that the late Ige confided in him about his plan to leave as the Attorney-General of the Federation and Minister of Justice.\nHis reason was that the government was not implementing programmes that could benefit the people.\nBefore being posted to the Ministry of Justice, Ige was Minister of Power and had vowed to ensure a stable electricity supply within six months.\n- Advertisement -The author also added that Ige’s former deputy governor, who was then the Minister of Internal Affairs, Chief Sunday Afolabi, chided Chief Ige that he should not forget that he was only invited to ‘come and eat.’"
  },
  {
    "headline": "Akande: How ex-minister Bola Ige was killed",
    "summarized_story": "Elder statesman Chief Bisi Akande has recounted how Chief Bola Ige was killed.\nIge was shot dead in his Ibadan, Oyo State capital, residence on December 23, 2001.\nAkande, who was Osun State governor at the time, recalled in his book ‘My Participations’ the circumstances in which Ige was killed.\n“Instead of going to Esa-Oke, Uncle Bola decided to spend the night in Ibadan.\n“They overpowered the only gateman who had been working with Uncle Bola before he took up the ministerial appointment with Obasanjo and marched him upstairs."
  },
  {
    "headline": "BREAKING: UAE bans Nigerian passengers, others over Omicron",
    "summarized_story": "The United Arab Emirates (UAE) has suspended travellers from Nigeria, Tanzania, Kenya and Ethiopia from entering the country.\nThe development has created chaos for both inbound and outbound passengers, including Nigerians wishing to come home for the Yuletide.\nThe suspension includes those who were present for 14 days before coming to the UAE.\nAlso on Friday, the Airport Manager of the Murtala Mohammed International Airport (MMIA), Lagos, Mrs. Victoria shin-Aba, slammed passengers who come to the airport with positive PCR test results.\n“They know with this they can’t travel but they still bring it but definitely they are not allowed to travel.”"
  },
  {
    "headline": "GOC reads riot act to newly promoted officers",
    "summarized_story": "BY PHILIP NWOSUThe General Officer Commanding (GOC) 81 Division of the Nigerian Army, Major General Lawrence Fejokwu on Friday read riot act for newly promoted officers in the division, urging them to ensure professionalism in all they do.\nThe newly promoted officers, include the former Aide de Camp (ADC) to President Muhammadu Buhari, Colonel Mohammed Abubakar, who was elevated and decorated with the rank of Brigadier General, (One Star General).\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nColonels Husanatu Mohammed and Nicholas Rumeh were also elevated to the rank of Brigadier General and decorated with their new ranks.\nThe officers pledged their loyalty to the President and Commander in Chief President Muhammadu Buhari, thanking him and the Army Council for finding them worthy of promotion."
  },
  {
    "headline": "Buhari swears in Sambo as Minister of State for Works and Housing",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has sworn-in new Minister of State for Works and Housing, Alhaji Mu’Azu Jaji Sambo at the State House Council Chambers.\nThe President had nominated Sambo as a ministerial nominee from Taraba State.\nSambo replaced the former Minister of Power, Sale Mamman, who was sacked in September, along with Sabo Nanono, the former minister of Agriculture and Rural Development.\nI pray that God Almighty will give me the strength and wisdom to discharge this trust and confidence that Mr. President has placed on me.\n“I want to assure Mr. President, that the confidence he has reposed in me, will not be misplaced."
  },
  {
    "headline": "Happening Now:Buhari’s former ADC decorated one star general",
    "summarized_story": "Former Aide de Camp to President Muhammadu Buhari, Colonel Muhammed Abubakar has been promoted to the rank of Brigadier General.\nThe former ADC was decorated by the General Officer Commanding (GOC) 81 Division Major General Lawrence Fejokwu .\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nGeneral Fejokwu advised the newly Promoted officers to ensure the work in line with the vision of the Chief of Army Staff, Lieutenant General Faruk Yahaya."
  },
  {
    "headline": "Breaking: Buhari, security chiefs in emergency meeting",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently presiding over Emergency Security Council Meeting in the Council Chambers of the State House, Abuja.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nDetails later…"
  },
  {
    "headline": "Apprehension as NIS uncovers foreign terrorists’ plot to attack Abuja",
    "summarized_story": "From Ndubuisi Orji, Fred Itua and Molly Kilete, AbujaThe Nigeria Immigration Service (NIS) has raised the red flag over plots by foreign terrorists to attack the nation’s capital, Abuja.\n“The import is about a looming attack on Nigeria’s Capital City, Abuja between 17th and 31st December 2021.\n“It is painful that there is a threat of imminent terrorists attack in Abuja.\nArmy on red alert, police, FCTA keep mumThe army and the police force have remained mum on the security alert.\nHowever, a top source told Daily Sun the military and security agencies have been on red alert in Abuja to counter any invasion."
  },
  {
    "headline": "Buhari in Borno, Promises to Cater for Families of Dead, Wounded Soldiers",
    "summarized_story": "* Says with new hardware, military more prepared to flush out terroristsDeji Elumoye in AbujaPresident Muhammadu Buhari, yesterday, said his administration would support families of dead and wounded soldiers, and help them realise their potential.\nBuhari stated this in Maiduguri, the Borno State capital, when he addressed troops at the Nigerian Air Force Base.\nBuhari assured the families of soldiers, who paid the supreme price for the country, and the injured that the federal government would cater for their needs, in recognition of their sacrifices for all Nigerians.\nI am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nThis intervention will benefit not only students from Borno and the North-east but also students from all parts of Nigeria."
  },
  {
    "headline": "Olori Naomi, Ooni of Ife’s Wife, Announces Divorce from Monarch",
    "summarized_story": "Yinka Kolawole in OsogboWife of the Ooni of Ife, Oba Adeyeye Ogunwusi, Ojaja II, Olori Naomi Silekunola, yesterday, announced her separation from the monarch, citing many personal reasons.\nIn a statement posted on her verified Instagram handle and Facebook account, in the morning, Naomi announced an end to the three-year marriage.\nOoni, on assuming the throne of his fathers, married Olori Wuraola Zaynab Otiti, who left in 2017.\n“Kabiyesi Ooni Adeyeye Enitan Babatunde Ogunwusi, Ojaja II, The Ooni of Ife, is an embodiment of God’s love for humanity.\nWhile the Ooni may not be able to make comments in the media, we will not stand by and allow the office of the Ooni and by extension, the entire Yoruba race to be denigrated.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Seplat Energy Terminates Avuru’s Appointment as Non-executive Director",
    "summarized_story": "Seplat Energy’s Director, External Affairs & Sustainability, Chioma Nwachuku, who made the announcement in a statement posted on the Nigerian Exchange (NGX) website, stated that the termination became effective from December 22, 2021.\nThe letter by Seplat was titled: ‘Change on the Board of Seplat Energy and signed by its Director, Legal/Company Secretary, Edith Onwuchekwa.\nIt stated: “The Board of Seplat Energy announces that it terminated the contract of appointment of Mr. Austin Avuru as a Non-Executive Director on 22nd December 2021, due to breaches of the Company’s corporate governance policies and his fiduciary duties.\nThe Board has called for his resignation as a Director of Seplat Energy.\n“The general public is hereby advised to discountenance Seplat Energy’s publication of December 23, 2021."
  },
  {
    "headline": "2023: IBB Roots for Osinbajo Presidency",
    "summarized_story": "Laleye Dipo in MinnaAhead of the 2023 polls, former Military President, Gen. Ibrahim Badamasi Babangida (rtd), has thrown his weight behind Vice-President Yemi Osinbajo for the presidency, saying: “He (Osinbajo) is a good man.”“I know the professor very well.\nHe is a good man and we need a good man to run us in this country.\nSomebody you can learn from; somebody you share a common conviction with.”“He has the passion for this great country.\nThis is what we need for this country,” Babangida said when the Osinbajo Grassroots Organization (OGO) visited him at his uphill residence in Minna on Thursday.\n“We came to consult the oracle and the oracle has spoken."
  },
  {
    "headline": "Titan Trust Acquires Majority Stake in Union Bank",
    "summarized_story": "‭Nume Ekeghe‬Titan Trust Bank ‬Limited (TTB) ‭has become the majority shareholder in Union Bank of Nigeria Plc.\nThis followed an agreement by ‭Union Global Partners Limited, ‬Atlas Mara Limited ‭and other majority shareholders to‬ divest 88.39 per cent shareholding in Union Bank ‭to‬ TTB.\n“We‭ ‭ ‬are ‭ ‬grateful ‭ to‭ ‭ ‬our ‭ ‬current ‭ ‬investors ‭ ‬whose ‭ ‬significant ‭ ‬and ‭ ‬consequential ‬‬‬investments over the past nine years facilitated the transformation ‭of‬ Union Bank, ‭one‭ ‬‬of‭ ‭Nigeria’s‬ oldest ‬and‭ storied institutions.\nToday, the bank ‭is‬ well-positioned with ‭an‬ ‬innovative product offering, a growing customer base ‭of‭ over six million ‭and‭ consistent ‬‬‬‬ year ‭on‬ year profitability.\n“This ‭is‬ a solid foundation for ‭our‬ incoming investors ‭to‬ buildon‭ ‬as‭ ‭we‬ move into a new era for the bank.‭”‭ ‬‬‬…..more details laterShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Police Officers Extorted N405,000 From Us After Falsely Accusing Us Of Being Cult Members— University Student",
    "summarized_story": "He said an officer had pointed his gun at the team of friends and cocked it even before the search began.\nHe added that while the search was on, the officers asked questions regarding their identities.\nSamuel said he had identified himself as a UNILAG student while his male friend identified himself as a student of Yaba College of Technology (YABATECH).\nBut another officer asked us to pay N400,000 instead.\n“The two guys with a woman they arrested along with us were invited to pay N640,000."
  },
  {
    "headline": "How Police Officers Extorted N405,000 From Us After Falsely Accusing Us Of Being Cult Members— University Student",
    "summarized_story": "He said an officer had pointed his gun at the team of friends and cocked it even before the search began.\nHe added that while the search was on, the officers asked questions regarding their identities.\nSamuel said he had identified himself as a UNILAG student while his male friend identified himself as a student of Yaba College of Technology (YABATECH).\nBut another officer asked us to pay N400,000 instead.\n“The two guys with a woman they arrested along with us were invited to pay N640,000."
  },
  {
    "headline": "How Police Officers Extorted N405,000 From Us After Falsely Accusing Us Of Being Cult Members— University Student",
    "summarized_story": "He said an officer had pointed his gun at the team of friends and cocked it even before the search began.\nHe added that while the search was on, the officers asked questions regarding their identities.\nSamuel said he had identified himself as a UNILAG student while his male friend identified himself as a student of Yaba College of Technology (YABATECH).\nBut another officer asked us to pay N400,000 instead.\n“The two guys with a woman they arrested along with us were invited to pay N640,000."
  },
  {
    "headline": "EXCLUSIVE: Christian Association Of Nigeria Directs Kaduna Churches To Suspend Christmas Eve Programmes Over Security Concerns",
    "summarized_story": "The Christian Association of Nigeria (CAN) has directed churches in Kaduna State to suspend this year's Christmas Eve services.\nHe added, \"Yes, we have written to churches to suspend this year's Christmas Eve and New Year's Eve events because of security concerns.\n\"However, in areas our people feel they can afford to congregate for Christmas Eve services, they should do so under security measures.\nSaharaReporters on November 29, 2021, reported that a group of bandits had written to the Christian community in Zamfara State, Northwest Nigeria to close churches or risk ferocious attacks.\nIt further says, \"Since 2011, inter-communal violence, rooted in competition over scarce resources, has escalated in central and north-west Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Christian Association Of Nigeria Directs Kaduna Churches To Suspend Christmas Eve Programmes Over Security Concerns",
    "summarized_story": "The Christian Association of Nigeria (CAN) has directed churches in Kaduna State to suspend this year's Christmas Eve services.\nHe added, \"Yes, we have written to churches to suspend this year's Christmas Eve and New Year's Eve events because of security concerns.\n\"However, in areas our people feel they can afford to congregate for Christmas Eve services, they should do so under security measures.\nSaharaReporters on November 29, 2021, reported that a group of bandits had written to the Christian community in Zamfara State, Northwest Nigeria to close churches or risk ferocious attacks.\nIt further says, \"Since 2011, inter-communal violence, rooted in competition over scarce resources, has escalated in central and north-west Nigeria."
  },
  {
    "headline": "Electoral bill: I'm unaware of threats to override Buhari's decision, says Gbaja",
    "summarized_story": "Femi Gbajabiamila, speaker of the house of representatives, says he is not aware of “threats” to override the decision of the president on the electoral bill.\nPresident Muhammadu Buhari had declined assent to the bill, citing concerns over the recommendation of direct primaries for political parties.\nAdvertisementThere had been reports that senators were collecting signatures to override the president’s decision.\nAdvertisement“I’m not aware of any such threats to override the president’s decision; at least not in my chambers.\nThe electoral law is what a credible electoral process needs and laws are what are required at this time."
  },
  {
    "headline": "Electoral bill: I'm unaware of threats to override Buhari's decision, says Gbaja",
    "summarized_story": "Femi Gbajabiamila, speaker of the house of representatives, says he is not aware of “threats” to override the decision of the president on the electoral bill.\nPresident Muhammadu Buhari had declined assent to the bill, citing concerns over the recommendation of direct primaries for political parties.\nAdvertisementThere had been reports that senators were collecting signatures to override the president’s decision.\nAdvertisement“I’m not aware of any such threats to override the president’s decision; at least not in my chambers.\nThe electoral law is what a credible electoral process needs and laws are what are required at this time."
  },
  {
    "headline": "Banditry: Ganduje visits Buhari, seeks military deployment in Kano forest",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, has asked President Muhammadu Buhari to deploy more military personnel to forests in Kano.\nHe called for the establishment of another military training base in the forest bordering Kano, Kaduna, Bauchi and Plateau, as part of efforts to check the activities of criminals.\n“In Kano state, we have taken some measures.\nWe have two large forests including the Falgore forest, which borders Kano, Kaduna and Bauchi and also not far away from Plateau.\nIn that forest, we established a military training ground in conjunction with the army and there’s a lot of military training going on in that forest, using the facilities that we have provided."
  },
  {
    "headline": "Banditry: Ganduje visits Buhari, seeks military deployment in Kano forest",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, has asked President Muhammadu Buhari to deploy more military personnel to forests in Kano.\nHe called for the establishment of another military training base in the forest bordering Kano, Kaduna, Bauchi and Plateau, as part of efforts to check the activities of criminals.\n“In Kano state, we have taken some measures.\nWe have two large forests including the Falgore forest, which borders Kano, Kaduna and Bauchi and also not far away from Plateau.\nIn that forest, we established a military training ground in conjunction with the army and there’s a lot of military training going on in that forest, using the facilities that we have provided."
  },
  {
    "headline": "David Mark: Insecurity beyond ordinary -- FG should do more to restore hope",
    "summarized_story": "David Mark, a former senate president, says the problem of insecurity in Nigeria is “beyond ordinary”.\nAdvertisementMark said this on Friday in a Christmas message shared by Paul Mumeh, his special adviser.\nHe expressed worry over the security challenges affecting the country and advised the federal government to “do more to restore hope”.\nAccording to the former senate president, the festive season provides an opportunity for Nigerians to seek divine intervention on insecurity.\n“Nothing can be more depressing and frustrating than a people without hope or future,” he said."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "Christmas: Edo govt urges love, sacrifice, fetes orphans, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents in the state to show love to orphans and the less privileged, in the spirit of the Christmas celebration.\nAddressing journalists in Benin City, after presenting gift items to children at the Project Charilove Foundation, in Benin City, the Commissioner for Social Development and Gender Issues, Hon.\nMaria Edekor said the government is committed to the welfare of all citizens, including the less privileged.\nGod gave them to us and we are happy because every gift from God is a good gift.”The commissioner further stated, “His Excellency thought it wise that we bring these gift items to these children.\nThe government is ready to serve the people, irrespective of your status or vulnerability.”The founder and service leader, Project Charilove Foundation, Bro."
  },
  {
    "headline": "CHRISTMAS MESSAGE – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI wish all Edo people in the state and the Diaspora a merry Christmas.\nKindly adhere to the COVID-19 protocols and be safe as you celebrate with your friends and loved ones.\nFor security and other emergencies, please call the Edo helpline on 08000911911 and 08001235111.\nI wish you all a joyful Christmas celebration.\nSignedHis Excellency, Godwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "AIG Zone 5 Warns Officers Against Bullying, Extortion, others – Nigerian Observer",
    "summarized_story": "AIG Ahmad Abdurrahman stated this in his maiden chat with our crime reporter at his office, Zone 5 Command headquarters, Adesuwa road, Benin City, yesterday.\n“I have held my maiden address with some senior police officers and some personnel of the zone.\nAIG Ahmad stated.\nRecall that AIG Ahmad Abdurrahman assumed duty in zone 5 on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia.\nZone 5 Command with its headquarters on Adesuwa road in Benin City is in charge of Edo and Delta States police command."
  },
  {
    "headline": "Buhari calls for cooperation among elites in tackling Nigeria’s challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says there is need for more cooperation among the elites in the country in resolving the challenges facing the nation.\nThe president’s spokesman, Mr Femi Adesina, in a statement in Abuja, said Buhari made the call when he visited the palace of the Shehu of Borno.\nHe said the elites owe it to the people to inform, guide and shape opinions since they had more access and knowledge on the economy.\n“What our country needs now is the continued cooperation of the elites.\nThe president assured Nigerians that his administration will use the remaining period to consolidate on efforts in restoring peace and improving the economy."
  },
  {
    "headline": "Catholic Bishops warn Buhari, others against continued harassment of critics",
    "summarized_story": "The Catholic Bishops Conference of Nigeria (CBCN), has urged government at all levels to resist the temptation of harassing and arresting their critics.\nThe bishops gave the advice in a Christmas message signed by the President of CBCN, Most Reverend Augustine Akubueze, and made available to journalists on Friday in Abuja.\nThey said there is need to listen to everyone, advising all Nigerians to pray for a government that will listen to everyone.\nThe conference also urged the government to release those who were arrested and detained for speaking their mind about the government.\nAccording to the bishops, there is need to listen to each other, as part measures to resolve insecurity and other challenges confronting the country."
  },
  {
    "headline": "Sterling Bank’s One Woman partners QSE Foundation to empower women",
    "summarized_story": "Sterling Bank Plc, through its One Woman Proposition, has collaborated with the QSE Foundation to empower women in the Ikate Elegushi community of Lekki in Lagos State by providing them with credit facilities.\nThe programme for empowering women, which is a focal point for One Woman at Sterling Bank, will enable the women to scale up their existing businesses while also positioning Sterling Bank Plc as a gender-centric organization.\nSpeaking at the presentation ceremony, Mr. Gbenga Adegoke, Group Head, Products and Proposition with Sterling Bank, said the empowerment programme is an integral part of the bank’s partnership with QSE Foundation, founded by Olori (Queen) Sekinat Aramide Elegushi.\nAlso speaking, the Head of One Woman Proposition, Mrs. Ifunanya Ugboko said it was important to ensure female owned businesses thrived, lifting a lot of women out of poverty.\nThis is because Every Nanny has evolved beyond providing nanny services to rendering other services like home tutor, elderly care, cooks, housekeepers etc."
  },
  {
    "headline": "Economic Sustainability Plan: NSIA, REA partner to roll out over 200,000 Solar Home Systems under “Solar Power Naija”",
    "summarized_story": "The Nigeria Sovereign Investment Authority (NSIA) is investing in the Off-Grid renewable space in partnership with the Rural Electrification Agency (REA).\nThe Solar Power Naija Program is being launched under the Buhari Administration’s Economic Sustainability Plan (“ESP”) and supervised directly by the Vice President of the Federal Republic of Nigeria, Prof. Yemi Osinbajo.\nThe NSIA-REA partnership will see the NSIA creating an initial revolving fund of N10 billion for qualified developers to distribute and manufacture Solar Home Systems.\nThe REA under the Ministry of Power will provide technical and advisory support to the NSIA as it rolls out the program.\nAt completion, it is expected that this investment will demonstrate locally that the Solar Off-Grid space is an investable segment of the power market."
  },
  {
    "headline": "Again, pipeline explosion rocks Lagos",
    "summarized_story": "A pipeline explosion on Friday, rocked Isale Odo, LASU Road, in Alimosho Local Government Area of Lagos State.\nThe explosion was confirmed by the Acting Coordinator, South West Zonal Office of the National Emergency Management Agency (NEMA), Mr Ibrahim Farinloye, in a statement.\nFarinloye said the explosion was caused by the collapse of a 330KV Line which occurred within the axis earlier in the day.\nAccording to him, the collapsed high tension line from Egbin Power Plant, Ikorodu, supplies electricity to Ikeja West which falls under the operational network of Ikeja Electric.\n“The electricity cable collapse led to sparks and the sparks got to spilled petrol around the area which led to the pipeline gutting fire and a subsequent explosion."
  },
  {
    "headline": "Senate President Visits Kwankwaso In Kano Over Brother’s Death",
    "summarized_story": "The President of the Senate, Ahmad Lawan, on Friday, paid a condolence visit to former governor of Kano State, Senator Rabiu Musa Kwankwaso, whose younger brother, Alhaji Inuwa died few days ago.\nA statement signed by the media adviser to the Senate President, Ola Awoniyi, said Lawan was in Kano to attend the wedding fatiha of the daughter of another former governor of the State and member of the Senate, Senator Ibrahim Shekarau.\nShortly after the wedding, the Senate President and his entourage proceeded to Senator Kwankwaso’s house to commiserate and pray with him.\nThe Senate President was accompanied by the Senate Leader, Dr Yahaya Abdullahi, Senator Bello Mandiya and Senator Barau Jibrin.\nADVERTISEMENT“We are here in your house this afternoon to condole with you over the death of our brother, our friend, Alhaji Inuwa who died some few days ago."
  },
  {
    "headline": "Bandits Have Taken Over Falgore Forest, Ganduje Tells Buhari",
    "summarized_story": "Kano State governor, Abdullahi Ganduje, has raised the alarm over the invasion of Falgore Forest by bandits.\nADVERTISEMENTHe said, “First of all, I came to see Mr. President and brief him on the security situation in Kano.\n“In Kano State we have taken some measures.\nWe have two large forests the Falgore forest, which is bordering Kano, Kaduna and Bauchi and also not far away from Plateau.\nADVERTISEMENT“So, that is helping to checkmate the activities of bandits in that forest and I have requested Mr President to also establish another institution within that forest and that forest will be liberated completely."
  },
  {
    "headline": "Christmas: Imbibe Virtue Of Reconciliation, Kaduna Senator Tasks Nigerians",
    "summarized_story": "The Senator representing Kaduna Central in the National Assembly, Uba Sani, has urged Nigerians to imbibe the spirit of reconciliation as they celebrate this year’s Christmas.\nBut the most worrisome remains the nefarious activities of terrorists, kidnappers, assasins and other criminal elements.\nADVERTISEMENT“In some communities, lack of unity makes common action against criminal elements difficult.\nWe must realise that the activities of criminal elements threatens our common humanity.\nMay He reward your sacrifices,” Uba Sani stated."
  },
  {
    "headline": "Christmas: Imbibe Virtue Of Reconciliation, Kaduna Senator Tasks Nigerians",
    "summarized_story": "The Senator representing Kaduna Central in the National Assembly, Uba Sani, has urged Nigerians to imbibe the spirit of reconciliation as they celebrate this year’s Christmas.\nBut the most worrisome remains the nefarious activities of terrorists, kidnappers, assasins and other criminal elements.\nADVERTISEMENT“In some communities, lack of unity makes common action against criminal elements difficult.\nWe must realise that the activities of criminal elements threatens our common humanity.\nMay He reward your sacrifices,” Uba Sani stated."
  },
  {
    "headline": "SGF Mustapha Felicitates With Nigerians At Christmas",
    "summarized_story": "The Secretary to the Government of the Federation (SGF), Boss Mustapha, has felicitated with Nigerians, particularly the Christian faithful, on the joyous occasion of the 2021 Christmas celebration, to commemorate the birth of our Lord, Jesus Christ.\nHe described the birth of Jesus Christ as a blessing to mankind exemplified in his teaching of love, humility, forbearance, compassion and selflessness.\nAccording to a statement signed by the director of information in the office of the SGF, Willie Bassey, on Friday, he charged Christians to emulate the pattern of life of Jesus Christ by exhibiting love, unity, harmony and peaceful co-existence in their daily living.\nThe SGF also called on Christendom to re-dedicate themselves to the will of God by eschewing violence, avarice, discord and all negative tendencies capable of dividing the nation.\nADVERTISEMENTWhile wishing Nigerians a Merry Christmas and a prosperous New Year in advance, he reminded all on the need to continue to adhere to all non-pharmaceutical interventions (NPIs) including regular wearing of masks, washing of hands , social distancing and avoidance of unnecessary travels in order to curb the spread of the Omicron variant of COVID-19."
  },
  {
    "headline": "Omicron: UAE bans Nigerian passengers, others",
    "summarized_story": "The United Arab Emirates (UAE) has suspended travellers from Nigeria, Tanzania, Kenya and Ethiopia from entering the country.\nThe development has created chaos for both inbound and outbound passengers, including Nigerians wishing to come home for the Yuletide.\nThe suspension includes those who were present for 14 days before coming to the UAE.\nAlso on Friday, the Airport Manager of the Murtala Mohammed International Airport (MMIA), Lagos, Mrs. Victoria shin-Aba, slammed passengers who come to the airport with positive PCR test results.\nShe said: “People with positive COVID test still come to the Airport to board planes."
  },
  {
    "headline": "Omicron: UAE bans Nigerian passengers, others",
    "summarized_story": "The United Arab Emirates (UAE) has suspended travellers from Nigeria, Tanzania, Kenya and Ethiopia from entering the country.\nThe development has created chaos for both inbound and outbound passengers, including Nigerians wishing to come home for the Yuletide.\nThe suspension includes those who were present for 14 days before coming to the UAE.\nAlso on Friday, the Airport Manager of the Murtala Mohammed International Airport (MMIA), Lagos, Mrs. Victoria shin-Aba, slammed passengers who come to the airport with positive PCR test results.\nShe said: “People with positive COVID test still come to the Airport to board planes."
  },
  {
    "headline": "‘Breach’ of company policies: Seplat Energy sacks Austin Avuru",
    "summarized_story": "Seplat Energy Plc says it has terminated the appointment of Austin Avuru as a non-executive director of the company.\nEdith Onwuchekwa, director, legal and company secretary at Seplat, announced this in a corporate filing on Thursday.\nThis is coming a month after Bryant Orjiako, chairman of Seplat Energy Plc, said he will step down from his position in 2022.\nAustin Avuru had retired as founder and chief executive officer (CEO) of Seplat Petroleum Development Company Plc on July 31, 2020, but had remained on the board as a non-executive director.\nHe was the pioneer managing director of Seplat before he moved to become the CEO."
  },
  {
    "headline": "Catholic Bishops: Political leaders must listen to save Nigeria",
    "summarized_story": "The Catholic Bishops Conference of Nigeria on Friday called on political leaders in Nigeria to listen to constructive criticism of the citizens in order to save Nigeria from looming collapse.\nThe CBCN said, “I invite you to join in praying for a Nigeria government that will listen to everyone.\n“Our political office holders at all levels should act according to the mind of their constituents.\nTo resolve the insecurity issues in Nigeria, we must listen to each other.\nWe know that if not for God, things would have been worse”, the Catholic Bishops said."
  },
  {
    "headline": "When was Jesus Christ really born?: The verdict of scholars",
    "summarized_story": "By Joseph CastroThe birth of Jesus Christ is commemorated by millions of people around the world with Christmas celebrations on Dec. 25.\nYet, most scholars agree that he wasn’t born on that day, or even in the year A.D. 1.\nHowever, nobody really knows exactly when Jesus was born.\nTHE DEATH OF KING HERODSome scholars believe that he was born between 6 B.C.\nand 4 B.C., based partly on the biblical story of King Herod the Great."
  },
  {
    "headline": "COVID-19 deaths recorded in Kano, Abuja as virus spreads",
    "summarized_story": "Kano and Abuja reported one COVID-19 related death each on Friday, the Christmas eve, according to the latest update by the NCDC, released 00.30 Saturday.\nThe two deaths took Nigeria’s pandemic death toll to 2,993.\nAdetifa said the Omicron variant cases recorded recently were not ones from travel history, suggesting that the country is already experiencing community transmission.\nHe said the six earlier Omicron cases were detected in people with recent travel history to South Africa.\nAccording to him, no person in Nigeria has died of COVID-19 with the Omicron variant in the country."
  },
  {
    "headline": "I’ll Deal With Bandits, Next President Must Secure Nigeria — Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that his government will consider using military force to fight robbers in the northwest.\nBuhari remarked in Maiduguri, Borno State, that Nigeria is now receiving military weapons that will be utilized to combat bandits.\nIn addition, the President stated that his successor would work to ensure the country’s security.\nOnly a secure country, according to Buhari, can be managed.\n“The problem is in the North West as I said, is same people, same culture, we are going to deal with them."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "BREAKING: Buhari Presides Over Security Meeting In Abuja",
    "summarized_story": "At the Presidential Villa in Abuja, President Muhammadu Buhari (retd.)\nis currently presiding over a security meeting.\nThis came after the President swore in Muazu Sambo, the newly appointed Minister of State for Works and Housing.\nThe Senate confirmed the new Minister of State, a building engineer, as a Minister-Designate earlier this week after the upper legislative house screened him.\nVice President Yemi Osinbajo, the Secretary to the Government of the Federation, Mr. Boss Mustapha, and the National Security Adviser, Major General Babagana Monguno, are among those in attendance (retd.)."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "VIDEO: Watch as Nigerian man marries two wives same day as Christmas gift",
    "summarized_story": "A video has surface online, showing a Nigerian man, simply identified as Muhammed who married to two beautiful women on the same day in Niger State.\nThe wedding ceremony took place in Bida, Niger state.\nIt had been reported earlier that Mohammed had announced that his wedding ceremony to Adama and Aisha will last for five days.\nThe wedding festivities began on December 22, and will end on Sunday, December 26.\nRelatedNo tags for this post."
  },
  {
    "headline": "[Breaking] Collapse: TCN restores electricity to affected Lagos communities",
    "summarized_story": "This, it said, had triggered a resistant pull on the high-tension towers along the line route causing five of them to collapse.\nBut Mrs Mbah in her new statement, which qouted the Managing Director and Chief Executive Officer (MD/CEO), TCN Engr.\nThis, he noted, meant that areas under Ikeja Disco whose supply were affected by the pipeline fire incident will now have normal supply of electricity.\n“In view of the importance of transmission line redundancy, Engr.\nAbdulaziz said TCN has already directed two contractors to mobilize to site to commence the reconstruction of the towers and 330kV line,” the MD said."
  },
  {
    "headline": "Breaking: Popular NPFL coach, others escape death in auto crash",
    "summarized_story": "The head head coach Abia warriors football club of umuahia coach Imama Amapakabo has reportedly been involved in a motor accident.\nAccording to the short press statement by the club,mthe coach and two other coaches were involved in a minor accident but no life was lost.\n“Our Head Coach, Imama Amapakabo, alongside other two coaches were involved in a minor road accident on their way to Okigwe for the team’s training session.\nNo life was lost, the Coaches involved are in stable condition.\nThe head coach, Imama Amapakabo, is also in a stable condition as well."
  },
  {
    "headline": "Avoid Unnecessary Travels To Curb Spread Of Omicron Variant – Boss Mustapha",
    "summarized_story": "The Secretary to the Government of the Federation, Boss Mustapha has asked Nigerians to avoid unnecessary travels in order to spread the spread of the Omicron variant in the country.\nThe SGF made the call in a statement issued by spokesperson Willie Bassey on the 2021 Christmas celebration to commemorate the birth of Jesus Christ.\n“The Secretary to the Government of the Federation, Boss Mustapha, felicitates with Nigerians, particularly the Christian faithful, on the joyous occasion of the 2021 Christmas celebration, to commemorate the birth of our Lord, Jesus Christ,” the statement read.\n“He described the birth of Jesus Christ as a blessing to mankind exemplified in his teaching of love, humility, forbearance, compassion and selflessness.\nHe charged Christians to emulate the pattern of life of Jesus Christ by exhibiting love, unity, harmony and peaceful co-existence in their daily living."
  },
  {
    "headline": "Yuletide: FG Declares Free Passenger Train Rides",
    "summarized_story": "The Federal Government through the Ministry of Transportation has in the spirit of Christmas declared passenger trains across the Nigerian Railway Corporation (NRC) system free of charge during the period.\nAccording to a communique from the Nigerian Railway Corporation (NRC), this gesture is to enable Nigerians to travel and celebrate Christmas.\nThe spokesman for the corporation, Yakub Mahmood, said passengers trains on both standard and narrow gauge lines, which include Abuja to Kaduna, Lagos to Ibadan, Warri to Itakpe, Kano to Lagos, Minna to Kaduna, Abba to Port Harcourt routes are now all free from today Friday 24th December 2021 to Tuesday 4th January 2022 inclusive.\nREAD ALSO: Yuletide: El-Rufai Approves Bonus For Civil ServantsThe NRC, however, noted that all boarding tickets due process by “valued customers must be complied with but not paid, while COVID-19 protocols also must be strictly observed on board”.\nWhile wishing all Nigerians a happy Christmas and prosperous New Year, the corporation appealed to them to use the Federal Government’s kind gesture to pray for the country."
  },
  {
    "headline": "Christmas: ‘Invoke The Indomitable Spirit,’ Buhari Tells Nigerians",
    "summarized_story": "President Muhammadu Buhari has called on Nigerians to rekindle hope in the country, urging them to use the Christmas season to show love to one another.\nIn his Christmas message on Friday, Buhari said Nigerians should use the season to “encourage ourselves so that the machinations of the wicked ones in our midst will find no place to thrive”.\nOn the fight against insecurity, Buhari assured that with the renewed commitment of security agencies, Nigerians would soon witness an improvement.\nAccording to him, his administration has continued to support the security personnel in the discharge of their duties, leading to “remarkable successes”.\nAnd as more states join the vaccination drive, President Buhari is also calling on Nigerians to get the jabs."
  },
  {
    "headline": "Pipeline Explodes As High Tension Cables Fall In Lagos State",
    "summarized_story": "A pipeline has exploded in the Egbeda area of Lagos State on Friday morning.\nBut men of the Nigeria National Petroleum Corporation (NNPC), security officials, firefighters, and the Nigeria Security and Civil Defence Corps (NSCDC) were at the scene of the incident.\nThe explosion was due to the collapse of some high tension cables.\nEyewitnesses say the fire started after the electricity cables collapsed, leading to electric sparks around the area.\nSpillage is a common occurrence in the pipeline corridor due to the activities of vandals."
  },
  {
    "headline": "Ganduje Visits Buhari, Says Forests Accommodating Bandits",
    "summarized_story": "﻿Kano State Governor, Abdullahi Ganduje on Friday visited President Muhammadu Buhari and said the nation’s forests are accomodating different kinds of criminals.\nMr. Ganduje made the comment at a press briefing after meeting with the President.\nHe noted that ridding the forest of unhealthy elements will go a long way in solving the nation’s insecurity problems.\n“We observed that the security situation now, our forests are the major problems, because they accommodate bandits, they accommodate terrorists, armed robbers, and herdsmen who are criminals,” Mr. Ganduje said.\n“I have requested Mr. President to also establish another institution within that forest, and that forest will be liberated completely.”"
  },
  {
    "headline": "Fayemi signs 2022 Appropriation bill into law, promises timely completion of legacy projects -",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi has signed the 2022 Appropriation of One Hundred Billion, Seven Hundred and Fifty Three Million, Nine Hundred and Ninety Three Thousand, Two Hundred and Forty One Naira, Sixty Kobo ( ₦100, 753,993,241.60K) into law with a promise to complete all ongoing legacy projects and consolidate on other achievements recorded in the past three years.\nThe 2022 Appropriation, christened “Budget of Legacy and Consolidation”, was presented to the Governor by the Speaker of the Ekiti State House of Assembly, Rt.\nHon Funminiyi Afuye, at the Executive Council Chamber, Governor’s Office, Ado Ekiti in the presence of the Deputy Governor, Otunba Bisi Egbeyemi, Deputy Speaker, Hakeem Jamiu, and other members of the Executive Council and the legislators.\nOthers include completion and equipping of the Intensive Care Unit (ICU) at Ekiti State University Teaching Hospital (ESUTH), construction and renovation of schools, provision of learning materials to students, completion of ongoing erosion and watershed management project, foundation laying for Ekiti Knowledge Zone and the Special Agriculture Processing Zone, among others.\nThe Governor added that the budget was also prepared to ensure that enduring legacies are handed over to successive governments with a clear blueprint of development plans to lift Ekiti into a period of sustained prosperity."
  },
  {
    "headline": "PDP nat'l chairman, Ayu felicitates with Nigerians at Christmas, charges them to keep hope alive -",
    "summarized_story": "The National Chairman of the People’s Democratic Party, Iyorchia Ayu, has felicitated with Nigerians at Christmas, and charged them to keep hope alive in spite of daunting circumstances.\nAyu said although the Christmas Season symbolizes love, hope, sharing, celebration and thanksgiving, the gloomy economic situation has made such very difficult.\nAyu spoke to Nigerians via his goodwill message to Nigerians, entitled, “Do not lose hope, Nigerians: the good days are coming back.”According to him: “Nigerians love themselves.\nNigerians love life.\nDo not let the sorry state of the nation dampen the Christmas spirit,” he added."
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "FULL TEXT: President Buhari’s letter on withholding assent to electoral bill -",
    "summarized_story": "The President of the Senate, Ahmad Lawan; and Speaker of House of Representatives, Femi Gbajabiamila, on Tuesday, at the opening of plenary read the communication from President Muhammadu Buhari on his rejection of the Electoral Act 2010 (Amendment) Bill.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Wale Adefarasin: As a Nation We Must Dialogue On How to Live Together",
    "summarized_story": "Today is Christmas eve, yet, some prominent Nigerians have called on the government led President Muhammadu Buhari to, as a matter of urgency, convene a national reconciliatory conference as a way of addressing the challenges confronting the nation.\nAmong those who made this call are former President Olusegun Obasanjo, the Sultan of Sokoto and President-General of Nigeria Supreme Council for Islamic Affairs, Alhaji Sa’ad Abubakar III, and President of the Christian Association of Nigeria (CAN), Bishop Samson Ayokunle.\nIn a report released after their Security Dialogue Retreat in Abuja, the participants said a national reconciliation conference should be held to address the numerous challenges, including widespread insecurity, that have stunted peace and prosperity in the country.\nAccording to them, the high prevalence of violent crimes, kidnappings, and fatal attacks in Nigeria are driven largely by social injustice and a failed economy.\nTo discuss some of these issues that must be confronted frontally if we are to make any progress and what his outlook is for 2022, is Wale Adefarasin, General Overseer of the Guiding Light Assembly."
  },
  {
    "headline": "Johnson Chukwu: National Development Plan 2021-2025 is a Welcome Development",
    "summarized_story": "On Wednesday, President Muhammadu Buhari formally launched the National Development Plan 2021-2025, with a targeted investment outlay of N348.1 trillion to achieve the goals set out in the five-year plan.\nThe new plan is the successor to the five-year Economic Recovery and Growth Plan, ERGP, which lapsed in 2020.\nBut the question on many minds is how many of the targets set in the ERGP were achieved by the administration and if the National Development Plan is going to make much of a difference.\nTo discuss the new five-year development plan and tell us how government intends to go about its implementation after the ERGP failed to meet any of its objectives, Johnson Chukwu, Founder and CEO of Cowry Asset Management Limited, joins The Morning Show."
  },
  {
    "headline": "Ooni Of Ife’s Wife Announces Split, Following The Monarch’s Suicidal Story – Trending With Ojy Okpe",
    "summarized_story": "The National Youth Service Corps has reacted to the detention of Sofiyat Akinlabi the female army officer who accepted a marriage proposal from a youth corps member.\nIn a statement the Nigerian army claimed that the female officer was detained for violating the military’s rules of engagement.\nSofiat’s detention has continued to elicit a wave of backlash amongst many Nigerians with over 10,000 signing a petition demanding her release, using the hashtag #FreeSofiyat.\nMeanwhile, the Ooni of Ife, Oba Adeyeye Ogunwusi has narrated how he once attempted to commit suicide but had to change his mind after listening to music.\nHe then began listening to a series of inspirational music which in turn elevated his spirits."
  },
  {
    "headline": "Nigeria Warns of Another Covid Lockdown",
    "summarized_story": "Nigeria’s federal government has warned that it might impose restrictions on gatherings, including curfew if the current surge in the number of COVID-19 cases continues.\nHe also urged Nigerians to celebrate responsibly during the Christmas and New Year holiday seasons and celebrations.\nHe reminded Nigerians that the country was experiencing the fourth wave of the coronavirus as new cases have continued to rise.\n“Avoid non-essential interstate travel at this period as this increases the risk of spreading infection from one place to another.\nPeople who intend to travel are encouraged to take a rapid COVID-19 test to confirm status as many infected persons are asymptomatic."
  },
  {
    "headline": "Nigeria: Government Agencies Blame Bayelsa Wellhead Blowout on Sabotage",
    "summarized_story": "The Nigerian Upstream Petroleum Regulatory Commission (NUPRC) and the National Oil Spills Detection and Response Agency (NOSDRA), two critical federal government agencies investigating the recent oil blowout on an Aiteo facility in Bayelsa, have linked the leak to sabotage.\nDuring a Joint Investigation Visit (JIV) to the Santa Barbara River, Nembe, both organisations agreed that the wind valve may have been tampered with by yet to be identified persons, leading to the spill.\nNOSDRA is the federal government agency responsible for monitoring and responding to oil spills in Nigeria and acts between oil companies and communities at the local and state level.\nWhere the spill came out from is from the wind valve.\n“The wind valve has been replaced now."
  }
]