[
  {
    "headline": "EndSARS: Truth always prevails, Mr Macaroni reacts to Lagos panel report",
    "summarized_story": "Nigerian Comedian, Debo Adebayo, popularly known as Mr. Macaroni, has reacted to the report by the Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and other matters.\nAccording to the report submitted by the panel, at least nine persons were confirmed dead at the Lekki toll plaza on the night soldiers stormed there to disperse #EndSARS protesters on October 20, 2020.\nThe Justice Doris Okuwobi-led panel made this known in its report submitted to the Lagos State Government on Monday.\nTaking to his verified Twitter page, Mr Macaroni wrote, “They were always asking were the survivors and families of the victims were.\nThe truth always prevails and that truth is the #EndSARS Movement."
  },
  {
    "headline": "EndSARS report: Protesters killed at Lekki tollgate more than nine but relatives scared to testify -Lawyer",
    "summarized_story": "One of the #EndSARS protesters lawyers, Adesina Ogunlana, says more than nine protesters were killed at the Lekki tollgate on October 20, 2020.\nAccording to the report submitted by the panel, no fewer than nine #EndSARS protesters were killed at the Lekki tollgate on October 20, 2020, while four others were presumed dead.\nThe report listed 48 names as those who were casualties of the Lekki incident of October 20, 2020.\nThe lawyer lamented that many families and witnesses were scared to testify publicly before the panel.\nHe told The PUNCH in a telephone interview that some of the eyewitnesses thought they could be killed if they testified."
  },
  {
    "headline": "6 dead, 19 others injured in Bauchi auto crash",
    "summarized_story": "The Federal Road Safety Corps (FRSC), Bauchi State Command, says no fewer than six persons lost their lives in a ghastly motor accident that occurred in Bauchi on Monday.\nThe Sector Commander, Mr Yusuf Abdullahi, who confirmed the incident in Bauchi on Tuesday in an interview with the News Agency of Nigeria (NAN), said that 19 others sustained various degrees of injuries.\n“25 people are involved in the crash comprising 23 males, one female and a female child.\nAmong them are 17 males, one female and a female child,” he said.\nWhile the name and the number plate of the other vehicle were not available at the time of the interview."
  },
  {
    "headline": "Lagos Gas Explosion Update: 10-yr-old boy, woman dead, as death toll hits 5",
    "summarized_story": "By Bose AdelajaThe death toll from the explosion which rocked a gas store at Ladipo, Mushin, Lagos, is now five.\nIt was three until the recovery of the body of a 10-year-old boy and a female adult from the scene of the incident.\nHe said the female adult was recovered dead, while a 10-year-old died on the way to the hospital.\nSo far, three male adults, Mama Funmi and the boy have been recovered dead.\nConfirming the incident, Farinloye said: “Altogether, five persons were recovered dead including a 10 years old boy.”Rescue operation was ongoing at press time."
  },
  {
    "headline": "UPDATED: Many feared killed as gas explosion rocks Ladipo in Lagos [photos]",
    "summarized_story": "By Evelyn Usman & Idowu BankoleMany residents are reportedly feared dead in a gas explosion that occurred at Ojekunle Street, Papa Ajao, close to the popular automobile spare parts market, Ladipo, in Lagos.\nMany dead victims have since been evacuated from the scene with many more trapped inside the explosion scene.\nThe Director, Lagos State Fire and Rescue Service, Mrs Margret Adeseye, explained that the incident was reported at about 8.42a.m., via the state emergency reporting platform.\nAccording to her, the Lagos State Fire and Rescue service swiftly responded to the call by dispersing a combination of first and secondary responders.\nShe said: “Three male adults have been recovered as rescue and recovery operations continue in an environment isolated from causing any further secondary incident."
  },
  {
    "headline": "Anambra: Soludo will create 520,000 jobs; 4,000 young millionaires — SMG",
    "summarized_story": "Adds: Under his watch, govt vehicles must be locally made…Insists no political godfather can pressure Anambra Governor-electBy Luminous JannamikeABUJA – The Soludo Media Group on Monday said that the Governor-elect of Anambra State, Prof. Charles Soludo, through his economic empowerment plan, will create 4,000 young millionaires in ICT and agriculture sectors.\nPauly Onyeka, stated this in Abuja while speaking with journalists on Soludo’s developmental agenda for Anambra in the next years.\nHe said through the jobs from the above sectors as well as those from the industrial sector, Soludo hopes to also create about 520,000 jobs for young Anambrarians.\nHe stated, “Soludo will revolutionise the industrial sector.\n“Anambra government under his watch shall patronize only made in Anambra products except where it is not readily available."
  },
  {
    "headline": "Lagos Endsars Panel releases list of casualties at Lekki Tollgate",
    "summarized_story": "By Nwafor SundayThe Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters (Lagos EndSARS Panel), has released a list of forty-eight casualties from the Lekki Tollgate incident.\nBe that as it may, the Lagos EndSARS Panel , yesterday submitted its report, accusing the Nigerian Army and Police force of shooting at the innocent protesters at Lekki Tollgate, last year.\nGeneral Taiwo admitted at page 22 that the Army went to the Lekki Toll Gate with live ammunition.\nAt earlier press conferences, I had called the reported massacre at the toll gate the first massacre in the world without blood or bodies.\nWhere are the families of those who were reportedly killed at the toll gate?"
  },
  {
    "headline": "NEMA confirms five dead in Ladipo market gas explosion",
    "summarized_story": "Five persons, including a 10-year old boy, on Tuesday, lost their lives following an explosion at an industrial gas retailing outlet in Ladipo Spare Parts Market, Lagos.\nMr Ibrahim Farinloye, acting Zonal Coordinator, South-West Zonal Office, National Emergency Management Agency (NEMA), confirmed the development in a statement in Lagos.\nFarinloye said the cause of the explosion, which occurred on Tuesday morning at the shop located at 33/35 Ojekunle St. Ladipo Spare Parts Market, Lagos was yet to be ascertained.\nAccording to him, the shop had several industrial gas cylinders used for welding purposes.\nHe said NEMA, Lagos State Fire Service, Police Disaster Management Unit, and Lagos State Emergency Management Agency immediately responded to the distress signal and were able to contain the fire."
  },
  {
    "headline": "PAP preps Niger Delta youths for NIRSAL loans",
    "summarized_story": "The Presidential Amnesty Programme (PAP) has commenced training programmes to prepare Niger Delta youths, including ex-agitators, for loans offered by the Nigeria Incentive-Based Risk Sharing System for Agricultural Lending (NIRSAL).\nDAILY POST learnt that PAP is facilitating the process through capacity building to help entrepreneurs in the region get the qualifications required to apply for the loans.\nThe Interim Administrator, PAP, Col. Milland Dixon Dikio (rtd), said 3000 entrepreneurs had opportunities to benefit from the loans to expand their businesses.\nHe explained that NIRSAL would select 30 youths for the pilot survey of the loan initiative after the training.\nHe said: “NIRSAL is supporting the SMEs with soft loans to enable them to expand their businesses."
  },
  {
    "headline": "Fearless Drink: Court rules on NBC’s application in Rite Foods’ contempt suit Dec 1",
    "summarized_story": "The NBC and Seguin are asking the court to set aside the contempt suit filed against them by Rite Foods Limited over alleged infringement of Fearless trademark.\nFollowing an application filed by NBC challenging the validity of the order, Justice Chukwujekwu Aneke discharged it order on September 27, 2021.\nThe Senior Advocate of Nigeria (SAN) argued that the contempt suit was initiated by the plaintiff for reasons best known to them, adding that he had also brought an application seeking to strike out the suit.\nOkonma recalled that he filed an application dated October 15, 2021, and a motion on notice in respect of the application to regularise the application dated November 11.\nNBC prayed the court to set aside the contempt suit and award punitive costs against Rite Foods if it finds no basis for the contempt proceedings."
  },
  {
    "headline": "Group blames Uzodinma over increasing cases of brutality against Imo youths",
    "summarized_story": "A group under the auspices of Imo Civil Society Community Human Rights Desk has slammed Governor Hope Uzodinma for failing to protect his subjects from alleged brutality, intimidation, and extortion in the hands of soldiers and policemen despite their complaints.\nThe group stated this on Tuesday in a jointly-signed communique by the Convener, Aku Obidinma; Barr.\nMrs. Ngozi Iwu, Secretary; and Chinonso Uba, Spokesman, made available to DAILY POST in Owerri, Imo State, shortly after a meeting that was attended by some victims who narrated their ordeal.\nThe group condemned what it called the inactive and lukewarm attitude of the Nigerian Bar Association chapters in the state in the face of massive lawlessness by the police and the military.\n“Civil Society Community shall compile all verified cases of human right violations and extortions after which a strong-worded petition will be written to the UN Human Rights department, The British and American Embassies, The European Union, African Union, and ECOWAS to press for sanctions and visa restrictions on the identified perpetrators of these human right violation crimes and their commanders."
  },
  {
    "headline": "End SARS massacre: Buhari told to sack, arrest Lai Mohammed immediately",
    "summarized_story": "President Muhammadu Buhari has been asked to sack the Minister of Information and Culture, Alhaji Lai Mohammed immediately.\nThe call came following the report of the Panel of Investigation set by the Lagos State Government to unravel the incidents of October 20, 2020, at the popular Lekki Toll Gate, Lagos State.\nThe Human Rights Writers Association of Nigeria (HURIWA) advocated his dismissal, arrest, and trial for his egregious falsehood which has now been contradicted by a judicial panel of investigators in Lagos.\nHURIWA made the demand in a media statement made against the backdrops of the issuance of a conclusive judicial report and verdict by the Lagos State Judicial Panel of investigations.\nHURIWA recalled that Mohammed also faulted the claim by Amnesty International that no fewer than 12 protesters were killed in Lagos State by security operatives during the EndSARS protest."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "BREAKING: Many feared dead in Lagos gas explosion",
    "summarized_story": "BREAKING: Many feared dead in Lagos gas explosionMany residents have been feared dead in a gas explosion that occured at Ojekunle Street, Papa Ajao Lagos on Tuesday morning.\nThe Nation reports the explosion occurred around 8am.\nMany bodies have been taken away from the scene with more feared trapped.\nRescue efforts by residents were ongoing as at the time of this report.\nDetails shortly…"
  },
  {
    "headline": "Retro-Review of Grand Theft Auto V",
    "summarized_story": "So, what really endears GTA V to gamers?\n- Advertisement -On his return home after the episode with Franklin, Michael finds his wife cheating on him with her tennis coach.\nGTA V shows an immersive world is possible in a video game.\nThe Grand Theft Auto series can only get better and better from here with improved graphics by the game developers at Rockstar North.\nNow, perhaps, it is only right to sound this to African writers and creatives of the enormous opportunity in the video game industry."
  },
  {
    "headline": "Bandits kill 15 in Sokoto attacks",
    "summarized_story": "Sokoto State government yesterday confirmed that bandits killed 15 persons in two of its councils.\nGovernor Aminu Tambuwal said the 15 were killed when the gunmen invaded Goronyo and Illela councils between Sunday night and yesterday morning.\nGiving some detail on the incident, he said 12 persons were killed in Illela and three in Goronyo.\n- Advertisement -In Delta, 11 persons were abducted on Sunday evening in Oleh, headquarters of Isoko South council of the state.\nA source said the gunmen shot into the air as they entered the community, and residents scampered for safety."
  },
  {
    "headline": "COVID-19: Fake vaccination certificate now in Nigeria, FG warns",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has warned that a black market for illegal vaccination certificate procurement now exist in the country.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe, however, assured that no vaccination certificate illegally procured would scale scrutiny whenever the need arises as all vaccination records have to be verified as authentic at every relevant point.\n“We have received intelligence and even detected that some unscrupulous citizens are procuring vaccination cards through the black market.\n“We are currently seeing some surges in cases in some countries in Europe (especially eastern Europe) due to under vaccination."
  },
  {
    "headline": "Gunmen invade Benue monarch’s home, murder son, abduct daughter",
    "summarized_story": "From Rose Ejembi, Makurdi and Tunde Omolehin, SokotoSome yet to be identified gunmen invaded the palace of a traditional ruler in Ado Local Government Area (LGA) of Benue State, yesterday, killing his son and abducted his daughter.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“After they forced their way into the premises of the clan’s head, they forcefully entered the house and met his son in his room.\nThe State governor, Aminu Tambuwal, made the disclosure yesterday while presenting the 2022 Appropriation Bill to the State House of Assembly.\nHe disclosed that 12 people lost their lives in Illela Local Government Area, while three were killed in Goronyo local government area of the state."
  },
  {
    "headline": "FCCPC, CBN, EFCC to probe rights violation in money lending",
    "summarized_story": "The Federal Competition and Consumer Protection Commission (FCCPC), the Central Bank of Nigeria (CBN) and the Economic Financial Crimes Commission (EFCC) have commenced rights violation investigation into the nation’s lending industry.\nHe disclosed that the committee would lead efforts to address multiple potentially dubious conducts of certain money lenders, otherwise known as loan sharks.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe regretted that the act was fast becoming a dominant and abusive practice targeting some of the most vulnerable in society.\n“Continuing complaints about questionable repayment enforcement practices including public shaming and violations of privacy have led to significant and understandable consumer aggravation and dissatisfaction."
  },
  {
    "headline": "Buhari, Kalu, Tinubu, others mourn Sani Dangote",
    "summarized_story": "President Muhammadu Buhari has commiserated with President of Dangote Group, Aliko Dangote, over the death of his younger brother, Sani.\nUntil his death in the United States of America on Sunday, Sani Dangote was vice president of the Dangote Group.\nPresident Buhari further acknowledged that the late Sani Dangote was reputed for his gentleness, loyalty and generosity.\nIn his condolence message, Kalu prayed to Allah to forgive the sins of Sani Dangote and make Al-Jannah Firdaus his final abode.\nHe said: “I sympathise with the President of Dangote Group of Companies, Aliko Dangote, management and staff of Dangote Group of Companies over the demise of the Vice President of the conglomerate, Sani."
  },
  {
    "headline": "Death of Nigerian in Cote d’ivoire sparks outrage",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe death of Ìtùnú Babalola, Nigerian sentenced to 20 years imprisonment in Côte Divoire for alleged human trafficking has sparked outrage and wild condemnation just as the Federal Government has demanded for full autopsy report.\n“Her death, will however, not stop the appeal in court in order to vindicate her of the charges against her,” she assured.\nRegardless, Nigerians on social media have continued to react to the death of Itunu Babalola.\nNo regard for life.”Human rights lawyer, Abdul Mahmud tweeted: “It’s only an irresponsible government that cares little for the citizens abroad.\nWorse still, it is only an irresponsible government that doesn’t provide consular assistance for its citizens abroad."
  },
  {
    "headline": "World Bank: Boko Haram Caused Economic Activities to Decline in North-east by 50%",
    "summarized_story": "Nume EkegheThe World Bank has stated that the destruction caused by the Boko Haram sect caused economic activities in the north-eastern part of the country to decline by 50 per cent.\nThe multilateral institution noted that Adamawa, Borno and Yobe states which are in the Lake Chad region saw economic activities decline from 10 to 14 per cent between 2009 and 2013, adding that the region has recorded 50 per cent decline in activities from 2018.\n“The third area is governance and the importance that it has across all the different development challenges that Lake Chad region faces.\nAnd the fourth one is about natural resource management.”On his part, the Country Director for Nigeria, World Bank, Mr. Shubham Chaudhuri advised Nigeria to urgently tackle insecurity to enhance growth especially in the north-east.\nHe said: “I think especially for an institution like the World Bank, you know we are for development and for that, we need peace and security to proceed with development.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "In Damning Report, Lagos #EndSARS Panel Says 11 Killed at Lekki Tollgate",
    "summarized_story": "The Panel stated that Army should never have been deployed in the first place since the protest was largely peaceful.\nIt manipulated the incomplete CCTV video footage of the Lekki Tollgate on the night of the 20th of October 2020, which it tendered before the panel,” the report said.\nIt stated that there was indeed an invitation of the Nigerian Army to Lagos State by the state government through the governor before the hierarchy of the Nigerian Army deployed its soldiers to the scene on the said night.\nIt listed its greatest limitation as time, as it had to undertake its investigation into the Lekki tollgate incident alongside other petitions in respect of police brutality related matters.\nSo, in this report, we made recommendations for a body to take over human rights abuse cases in Lagos State” she said."
  },
  {
    "headline": "In South Africa, Buhari Says Africa Must be Marketplace Where No Country is Left Behind",
    "summarized_story": "He however warned that this goal cannot be achieved by talking alone.\nSpeaking further, he said, “As we implement, we must ensure that we create jobs and enhance revenues for all parties.\nNoting that Free Trade must also be fair, Buhari said fairness can only be achieved when there is full compliance with regulations especially those relating to rules of origin.\n“The Intra-Africa Trade Fair is uniquely positioned to help in these areas,” he added.\nHe also commended the people of Durban for hosting this year’s intra-African trade fair and expressed hope that it will witness milestone agreements among African businesses at this gathering."
  },
  {
    "headline": "For the Record: Buhari’s Address at Intra-African Trade Fair 2021 in South Africa",
    "summarized_story": "Together with former President Mandela, they gave birth to a new South Africa.\n​Today is a great day for Africa as we start our collaborative journey towards collective economic prosperity through the African Continental Free Trade Area.\nI, also commend the people of Durban for hosting this year’s intra-African trade fair.\nI wish you all a very successful trade fair.\n*Full text of the address by President Muhammadu Buhari at the opening ceremony of the Intra-African Trade Fair 2021 at Durban, South Africa on Monday, Novermber 15, 2021Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "With 559 Days to Go, Buhari on Aggressive Int’l Investment Drive",
    "summarized_story": "Nigerians are currently seeing a different Buhari who is eager to document his achievements at every stop on his international investment drive.\nThe president is attending the event on the special invitation of South African President Cyril Ramaphosa.\nThese investment meetings came few days after the president returned from Riyadh, Saudi Arabia, where he also participated in a three-day investment conference organised by the Future Investment Initiative Institute.\nFor instance, he said, the country only produced 30 million tonnes of its five billion tonnes reserves.\nIf you look at limestone, the area that I represent, because I have plants in Nigeria, Nigeria is sitting on over 4-5 billion tonnes of limestone."
  },
  {
    "headline": "PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa",
    "summarized_story": "President Muhammadu Buhari on Saturday left Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nBuhari in endless junketing was pictured leaving the French capital with some of his aides and making his way to the 5N-FGW (Gulfstream Aerospace) aircraft.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nSaharaReporters had on Tuesday reported that Buhari would leave London for Paris on Wednesday or Thursday for the fourth edition of the Paris Peace forum 2021 to be hosted by the French President, Emmanuel Macron."
  },
  {
    "headline": "PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa",
    "summarized_story": "President Muhammadu Buhari on Saturday left Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nBuhari in endless junketing was pictured leaving the French capital with some of his aides and making his way to the 5N-FGW (Gulfstream Aerospace) aircraft.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nSaharaReporters had on Tuesday reported that Buhari would leave London for Paris on Wednesday or Thursday for the fourth edition of the Paris Peace forum 2021 to be hosted by the French President, Emmanuel Macron."
  },
  {
    "headline": "Presidency Confirms SaharaReporters’ Story, Says Buhari To Visit South Africa For Trade Fair",
    "summarized_story": "President Muhammadu Buhari will today, Saturday, leave Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe Presidency which confirmed the visit in a release on Saturday stated that Buari is expected back to the country on Tuesday, November 16.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Presidency Confirms SaharaReporters’ Story, Says Buhari To Visit South Africa For Trade Fair",
    "summarized_story": "President Muhammadu Buhari will today, Saturday, leave Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe Presidency which confirmed the visit in a release on Saturday stated that Buari is expected back to the country on Tuesday, November 16.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Presidency Confirms SaharaReporters’ Story, Says Buhari To Visit South Africa For Trade Fair",
    "summarized_story": "President Muhammadu Buhari will today, Saturday, leave Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe Presidency which confirmed the visit in a release on Saturday stated that Buari is expected back to the country on Tuesday, November 16.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "Lagos sets up committee to review #EndSARS report — and come up with white paper",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has constituted a four-member committee to come up with a white paper on the recommendations in the report of the state judicial panel on police brutality.\nAdvertisementOn Monday, the panel submitted two sets of reports — a consolidated report on police brutality and an investigation of the Lekki shooting incident.\nAdvertisementSanwo-Olu appointed Moyosore Onigbanjo, the state attorney-general, as head of the committee, and mandated the committee to come up with a white paper on the panel’s recommendations in two weeks.\nOn Monday, a copy of the report seen by TheCable revealed that protesters were killed at the Lekki tollgate on October 20, 2020.\nOne of the reasons a white paper is usually needed is to sieve through a report and recommendations to preclude inconsistencies."
  },
  {
    "headline": "Lagos sets up committee to review #EndSARS report — and come up with white paper",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has constituted a four-member committee to come up with a white paper on the recommendations in the report of the state judicial panel on police brutality.\nAdvertisementOn Monday, the panel submitted two sets of reports — a consolidated report on police brutality and an investigation of the Lekki shooting incident.\nAdvertisementSanwo-Olu appointed Moyosore Onigbanjo, the state attorney-general, as head of the committee, and mandated the committee to come up with a white paper on the panel’s recommendations in two weeks.\nOn Monday, a copy of the report seen by TheCable revealed that protesters were killed at the Lekki tollgate on October 20, 2020.\nOne of the reasons a white paper is usually needed is to sieve through a report and recommendations to preclude inconsistencies."
  },
  {
    "headline": "Twin bomb blasts rock Uganda's capital",
    "summarized_story": "Two explosions have rocked Kampala, the capital city of Uganda.\nBoth blasts were said to have occurred in a central area of Kampala metropolitan city.\nAdvertisementWhile one went off near a police station, the other explosion was said to have occurred near the parliament.\nAdvertisementWe have so far received 27 causalities, seven of these are in a critical condition – Mulago hospital medical personnel.\n#NTVNews | https://t.co/7KowBl0hI1 pic.twitter.com/mdMAaKd73m — NTV UGANDA (@ntvuganda) November 16, 2021"
  },
  {
    "headline": "Twin bomb blasts rock Uganda's capital",
    "summarized_story": "Two explosions have rocked Kampala, the capital city of Uganda.\nBoth blasts were said to have occurred in a central area of Kampala metropolitan city.\nAdvertisementWhile one went off near a police station, the other explosion was said to have occurred near the parliament.\nAdvertisementWe have so far received 27 causalities, seven of these are in a critical condition – Mulago hospital medical personnel.\n#NTVNews | https://t.co/7KowBl0hI1 pic.twitter.com/mdMAaKd73m — NTV UGANDA (@ntvuganda) November 16, 2021"
  },
  {
    "headline": "EXTRA: LCC MD said he couldn't recognise a bullet... even in pictures, says #EndSARS panel",
    "summarized_story": "The Lagos #EndSARS panel says Abayomi Omomuwasan, managing director of Lekki Concession Company (LCC), maintained that he didn’t know what a bullet was even in pictures.\nIn its report submitted on Monday, the panel said Omomuwasan stated during cross-examination on December 11 that he can only recognise a gun, but not a bullet.\nBefore the fire incident that gutted the plaza, no attacks whatsoever were recorded,” the report quoted the LCC MD to have said.\nAdvertisement“The witness further maintained that he had never seen a bullet before.\n“In addition, he denied knowing what a bullet was when shown pictures of it."
  },
  {
    "headline": "Keynote presentation by Tayo Oviosu",
    "summarized_story": "Future of Commerce 2021 Keynote presentation by Tayo Oviosu | Future of Commerce 2021Share this article"
  },
  {
    "headline": "Nigeria's technology ecosystem and its lower-class population",
    "summarized_story": "It had been three days since the lights went out on the off campus streets of the Federal University of Technology, Akure (FUTA).\nThe rise in technology advocacy and youth unemploymentIn recent years, there has been an increase in the number of young people beating a path to the doors of Nigeria’s tech ecosystem.\nFor Nigerian tech newbies, the reasons for quitting are not far-fetched.\nThe absence of infrastructure and resources in Nigeria’s technology ecosystemProgramming is highly demanding work.\nFor Nigerian tech enthusiasts, however, the problem is not passion; it is not the absence of grit or hunger."
  },
  {
    "headline": "Is Flutterwave’s acquisition of Disha a win for global creators?",
    "summarized_story": "Credit: Disha (Medium)The product was an instant hit and got considerable adoption among creators and gig workers.\n“Flutterwave is about creating endless possibilities for everyone, and Disha’s goal of enabling creators achieve success and get paid for their work ties into Flutterwave’s larger mission of helping small businesses thrive.”New look for Disha?\nDespite the acquisition, however, Disha will remain an independent company.\n“Before now, when users created a Disha page and linked to a Flutterwave payment link, they got taken off the Disha site.\nNow, with the acquisition, users can create and accept their payments, all in one place.”Flutterwave has always played in the creator space, having supported arts events like ArtX Lagos."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Wakanda Inu: What meme tokens are and why you should care",
    "summarized_story": "In fact, the first African themed meme coin, Wakanda Inu, has just been launched.\nAlthough there are hundreds of meme coins, those referred to as OG (original gangster) meme coins are the most popular with the highest market capitalisation.\nInterestingly there’s now an African-themed meme coin — Wakanda Inu — made to create wealth for Africans.\nFor example, the new African-themed meme token — Wakanda Inu — named after a fictional African city — Wakanda — in the movie the Black Panther is on the rise and rallying strongly.\nThe African meme token — Wakanda InuWakanda Inu home pageAccording to the token’s whitepaper, “Wakanda Inu is a community meme project forged from the deep and warm consciousness of humanity.”It says it is “a decentralized meme token to drive growth in the industry, decentralized finance-oriented activities across the world."
  },
  {
    "headline": "7 things to expect at Techpoint Build 2021",
    "summarized_story": "Share this article:In case you aren’t counting, Techpoint Build 2021 is only 67 days away.\nExhibitionsLike previous editions of Techpoint Build Exhibition, this year’s exhibition floor will welcome many brands and companies looking to tap into the Techpoint Build community/audience.\nTherefore, the 2021 edition of Techpoint Build is designed to help you meet and exchange contact information with prospects interested in similar areas.\nTechpoint Build 2021 will have free physical and online options for attendees.\nPrecious Mogoli Website I love love and a little peace and quiet."
  },
  {
    "headline": "Global startup, Healthlane, launches its world-class preventive healthcare facilities in Nigeria",
    "summarized_story": "This follows the Baseline checks which involves Heart Health, Diabetes check, Immunity, Kidney Health, Liver Health, Blood, Cancer check, Hormones, Bones and Minerals.\nFinally, the company creates a care plan using the insights from the test.\nYou also manage your health with a care plan which contains those reminders that tell you to drink water, eat well, and exercise” she detailed.\nThe company then went on to create a distinct healthcare plan to suit his needs.\nWe worked through the care plan and I got some supplements."
  },
  {
    "headline": "Teni, Waje, Jonny Drile, Ayarastarr, others light up Benin City as Alaghodaro Summit kick- off in Grand style – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – It is no longer news that the fifth Edition of the annual Alaghodaro Summit initiated by the Godwin Obaseki led administration in Edo State, Nigeria commenced yesterday Friday November 12th, 2021 in the ancient City of Benin with its usual fun-fare laced in tough provoking talk show and other interesting brain storming session geared towards the economy emancipation of the state.\nOrganized annually by the Edo State government, the event at every interval since its inception in the last five years had found a pathway as part of the blue print towards the economy development of the state.\nThe unique nature of this year’s annual top show introduced a new dimension to relive the popular adage of “All works have no play make Jack a dull boy “by bringing top Nigerian artistes to light-up the city with musical concert that both the old and young will live to remember for a very long time to come.\nExpectedly, top Nigerian Artistes like AYRA STARR, JONNY DRILE, WAJE, TENI, and DJ NEPUNE whom this writer learnt were already in town for the Edo Youth MEGA Concert are expected to showcase their talents at the long evening show.\nA visit by the Nigeria observer correspondent to the Sir Victor uwaifo creative hub of Fame revealed that all is now set for the show that is expected to draw the creme-de-la-creme in the business world, entertainment industry, as well as fun-seekers to the concert venue."
  },
  {
    "headline": "Alaghodaro 2021: Nosak, Gladtrico, others parade gains in manufacturing, infrastructure devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Indigenous business conglomerate, Nosak Group and engineering services company, Gladtrico International Ltd., at the Alaghodaro Summit, reeled gains from Governor Godwin Obaseki’s sustained efforts at supporting businesses and encouraging private enterprise.\nThe Alaghodaro Summit, in its fifth edition, is organised yearly to mark the anniversary of Governor Obaseki in office and showcases the progress being recorded in transforming the state into an investment haven.\nThe Summit, which took place between November 12 and 14 with the theme, “Edo of our dreams: building a sustainable future,” brought together captains of industry, top public and private sector players, interests groups, among others.\nChairman, Marketing and Branding Sub-Committee, Alaghodaro 2021, Crusoe Osagie, who spoke to journalists in Benin City, said firms at the event are impressed with the government’s investment in all sectors of the state, which has ensured the provision of adequate infrastructure and the right incentives to drive productivity and improve livelihoods of residents.\nAccording to him, “The just-concluded Alaghodaro Summit was yet another roll call of the transformative and impactful projects and policies by the Governor Godwin Obaseki-led state government to help businesses expand and increase productivity, as big-ticket players in Edo State’s economy, notably Nosak Group, Gladtrico International Ltd. and Presco Plc, among others, took turns to parade gains of these efforts, especially in infrastructure development, as well as the manufacturing and industrial sectors."
  },
  {
    "headline": "Obaseki mourns Alhaji Sani Dangote – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I am shocked and deeply saddened by the news of the passing of my dear friend and brother, Alhaji Sani Dangote, the Vice President of Dangote Group, who died in the United States of America (USA) after a protracted illness.\nSome of the businesses he owned are Dansa Foods Limited, Dansa Energy, Sagas Energy Limited, Bulk Pack Services Limited, Dansa Agro Allied Limited, and Dangote Farms Limited.\nSani made insightful contributions to the Edo State Palm Oil Initiative, for which we remain grateful.\nHis expertise as a boardroom guru earned him appointments into the boards of several companies, notable among which include Nigerian Textile Mills Plc, Nutra Sweet Limited, Gum Arabic Limited, Dangote Textile Mills Limited, Alsan Insurance Brokers, Dan-Hydro Company Limited, Dansa Food Processing Company Limited and Dangote Farms Limited.\n___________________________________________________________________________________________________________________Godwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Obaseki mourns Alhaji Sani Dangote, describes him as a pacesetting entrepreneur – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of the Vice President of Dangote Group, Alhaji Sani Dangote, who died in the United States of America (USA), after a protracted illness.\nLate Sani is the brother of Africa’s richest man and President of Dangote Group, Alhaji Aliko Dangote.\nIn a statement, Governor Obaseki described the news of the death as shocking, noting that he was deeply saddened by the unfortunate loss.\nSani made insightful contributions to the Edo State Palm Oil Initiative, for which we remain grateful.\nHe was an avid polo player and two-time president of the Lagos Polo Club, where his chivalry and good nature were infectious."
  },
  {
    "headline": "Twin blast hits Uganda a month after bus explosion",
    "summarized_story": "Two explosions in Kampala, Uganda’s capital, have left two persons dead and several cars ablaze, NTV Uganda reports.\nNTV Uganda said “scores” had been injured and there had been two blasts – one very close to parliament and one near the central police station.\nAn NTV Uganda reporter said he saw two bodies.\nA Ugandan military spokesperson, Brigadier Flavia Byekwaso, told Reuters that there had been “multiple” blasts and “multiple” casualties but declined to give further details.\n“We are not safe in Kampala,” Awio said."
  },
  {
    "headline": "Death toll in Lagos gas explosion rises to 5",
    "summarized_story": "The number of people killed in a gas explosion at 31, Odekunle Street, Papa Ajao, Mushin, Lagos, on Tuesday morning, has risen to five, while scores are injured.\nOfficials of the Lagos State Fire and Rescue Service are currently at the scene of the explosion.\nThe director of Lagos State Fire and Rescue Service, Mrs Margaret Adeseye said the incident was reported at 08:42 am via the State emergency reporting platform and was responded to by a combination of the State first and secondary responders.\nHe said preliminary investigations to establish the fact of the incident continue and further discovery will be made public.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "With AfCFTA, Africa can reduce reliance on imports, double continental trade by 2030 – Buhari",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has said that with the implementation of the African Continental Free Trade Area (AfCFTA), the continent can double intra-African trade by 2030, reduce the reliance on imports and also create more jobs within the continent.\nThe President disclosed this in his address at the opening ceremony of the 2nd Intra-African Trade Fair 2021 event in Durban, South Africa, on Monday.\n“We have streamlined the country’s participation under one roof to enable you to access all the information you need,” Buhari said.\n‘‘Under the African Continental Free Trade Area, we can double our intra-African trade by 2030, reduce our reliance on imports and therefore create more jobs within the continent.”Buhari warned that Africa cannot achieve intra-African trade by talking alone, adding that the implementation will be a difficult journey.\n“As we implement, we must ensure that we create jobs and enhance revenues for all parties and must leverage on one another’s strengths to succeed,” he said."
  },
  {
    "headline": "Bitcoin slides below $60,000, Ether down in crypto dip",
    "summarized_story": "OBINNA EZUGWUBitcoin slid below $60,000 and Ether dipped close to one month low as Cryptocurrencies fell on Tuesday.\nBitcoin, the largest digital token dipped as much as 6% to about $59, 200 on Tuesday, while second-ranked Ether tumbled as much as 6.8% to $4, 189.\nGlobal crypto market cap has dropped some 7% in the past 24 hours to $2.8 trillion, according tracker CoinGecko.\nThe Bitcoin and Ether rallies have started to ebbHuges also cited concerns about China continuing its regulatory crackdown.\nBitcoin has more than doubled this year, while Ether is up about sixfold."
  },
  {
    "headline": "Inflation: How NBS figures contradict market realities – Survey",
    "summarized_story": "Also reacting, a former President of Trade Union Congress (TUC), Peter Esele, wondered the metrics used by the NBS to measure the inflation rate.\nThe market is there to determine what the inflation rate is.\nBut the NBS in its latest report claimed that the inflation rate fell by 0.37 per cent from 16.36 per cent in September.\nIt added that urban inflation rate increased by 16.52 per cent (year-on-year) in October from 14.81 percent recorded in October 2020.\nMeanwhile, the rural inflation rate increased by 15.48 percent in October from 13.68 percent in October 2020, the Bureau added."
  },
  {
    "headline": "NIMC Decries Inability of NIS To Verify NINs Of Passport Applicants",
    "summarized_story": "The National Identity Management Commission (NIMC) has lamented the recent reports of the inability of Nigerian Immigrations Service (NIS) to verify National Identity Numbers (NINs) of passport applicants, saying it has shown that the alternative verification channels provided were not being utilised to serve their teeming customers.\nThis was disclosed in a statement issued on Monday by the Head of Corporate Communications of NIMC, Kayode Olagoke, even as the agency urged the NIS to leverage on these channels and the jointly agreed offline method for handling NIN verification requests for passport applicants.\n“The Commission wishes to reiterate that the improved NIS slip and mobile ID app are credible and reliable channels to carry out NIN verification services.\nADVERTISEMENTThe statement noted that in the past one year, NIMC launched improved NIN slip with QR Code and MobileID app to ensure that alternative channels for identity verification are provided.\nIt added that these new channels put personal identity back in the hands of the ID holder and allows for easier and quick verification by simply scanning the barcode."
  },
  {
    "headline": "NCC 2021 BMR: Akande, Danbatta Commit To Drive Next Phase Of Telecom Growth",
    "summarized_story": "BY CHIMA AKWAJA, LagosThe chairman, Board of Commissioners, Nigerian Communications Commission (NCC), Prof. Adeolu Akande and the executive vice chairman and chief executive officer of the commission, Prof. Umar Garba Danbatta have pledged to drive the next phase of telecommunications industry growth.\nThe duo stated this at the end of a three-day 2021 Board and Management Retreat (BMR) organised by the NCC.\nAccording to Danbatta, “I must commend the board of commissioners under the chairmanship of Prof. Adeolu Akande for their support.\nTherefore, I commend the Board for providing the necessary policy directions required to drive management’s daily activities,” Danbatta said.\nThe retreat follows the unveiling of two key documents – the Strategic Management Plan (SMP), 2020-2024, and the Strategic Vision Plan (SVP), 2021-2025."
  },
  {
    "headline": "UPDATED: 5 Killed In Lagos Gas Explosion",
    "summarized_story": "Five persons have lost their lives in a gas explosion at 31, Odekunle Street, Papa Ajao, Mushin area of Lagos, on Tuesday morning.\nThe Lagos State Emergency Management Agency (LASEMA), which disclosed this in a statement via its Facebook page, said officials of the Lagos State Fire and Rescue Service were on ground at the explosion site.\nLASEMA disclosed that an open land with shanties and shops where gas cylinders were stacked caused the gas explosion which rocked the Ladipo area of Lagos.\nThe statement reads, “Fire from the explosion has been put under control by the Lagos State Fire and Rescue Service and also the Lagos Neighbourhood Safety Corps.\nADVERTISEMENT“However, the Agency’s Team and its Fire Unit and Lagos State Fire & Rescue Service and Lagos Neighbourhood Safety Corps, LNSC, have been able to put the fire under control and the firemen are blanketing the affected area."
  },
  {
    "headline": "I5 Years After, Kwara Govt Immortalises Late Gov Lawal",
    "summarized_story": "Fifteen years after his demise, Kwara State government has named an edifice at the Kwara State Polytechnic, Ilorin, after the former governor of the state, the late Admiral Mohammed Lawal (rtd).\nThe rector of the Polytechnic, Dr Abdul Jimoh Muhammed, said that the incumbent governor of the state, AbdulRahman AbdulRazaq, directed the institution’s management to name the 2,000-capacity Polytechnic Auditorium after the late Lawal.\nMuhammed announced this development at a pre-convocation press conference he addressed in Ilorin, the state capital on Tuesday.\n“On this 15th memorial anniversary for His Excellency, the former Governor Mohammed Alabi Lawal, I join the people of the state to remember a man of honour who died sticking to his patriotic beliefs.\nHe was a valiant leader who touched the lives of the masses in every part of the state within available resources."
  },
  {
    "headline": "APC Collaborates With China’s CPC To Boost Nigeria’s Infrastructure",
    "summarized_story": "Nigeria’s ruling party, the All Progressives Congress (APC), is seeking a more robust collaboration with Communist Party of China (CPC) to improve the Nigerian electricity and boost infrastructure for the mutual benefit of both countries.\nThe party has also lifted nearly one billion people out of extreme poverty in the last 40 years in China and built socialism with Chinese characteristics.\nThe party has a theme, which is to “build a society of shared future for mankind”.\n“As a ruling party in Nigeria, we hope to see greater collaboration between Nigeria and the Chinese government in enterprise development, especially in our infrastructure of power/ energy generation, transmission and distribution.\nIt is the most essential infrastructure which benchmarks every other infrastructure in a country."
  },
  {
    "headline": "Missing OAU master’s student: Body found, police arrest six",
    "summarized_story": "The Osun State Police Command on Monday said it has arrested six suspects in connection with the case of a dead student of Obafemi Awolowo University, Ile-Ife, Timothy Adegoke.\nA statement by the spokesperson of the command,Yemisi Opalola, said Adegoke, a Master’s degree student of the university, had come from Abuja to sit examination at the OAU distance learning centre, Moro, Osun State, when he went missing.\n“Recall that a case of missing person was reported on November 7, 2021 around 4.30pm at the Edun Abon Police Station and later transferred to State Criminal Investigation Department.\n“The detectives from SCID of the command swung into action and arrested six suspects in connection with the case.\nThe body has been found while investigation is ongoing.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Missing OAU master’s student: Body found, police arrest six",
    "summarized_story": "The Osun State Police Command on Monday said it has arrested six suspects in connection with the case of a dead student of Obafemi Awolowo University, Ile-Ife, Timothy Adegoke.\nA statement by the spokesperson of the command,Yemisi Opalola, said Adegoke, a Master’s degree student of the university, had come from Abuja to sit examination at the OAU distance learning centre, Moro, Osun State, when he went missing.\n“Recall that a case of missing person was reported on November 7, 2021 around 4.30pm at the Edun Abon Police Station and later transferred to State Criminal Investigation Department.\n“The detectives from SCID of the command swung into action and arrested six suspects in connection with the case.\nThe body has been found while investigation is ongoing.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "EndSARS: Nine confirmed dead at Lekki tollgate – Lagos panel",
    "summarized_story": "The Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and other matters says at least nine persons were confirmed dead at the Lekki toll plaza on the night soldiers stormed there to disperse #EndSARS protesters on October 20, 2020.\nThe Justice Doris Okuwobi-led panel made this known in its report submitted to the Lagos State Government on Monday.\nTitled, ‘Report of Lekki Incident Investigation Of 20th October 2020’, a copy of which was made available to The PUNCH, the panel said at least 48 protesters were either shot dead, injured with bullet wounds or assaulted by soldiers.\nAccording to the report, nine protesters were confirmed dead, while four were presumed dead.\nAccording to the 309-page report, the protesters were allegedly killed by policemen and soldiers."
  },
  {
    "headline": "EndSARS: Nine confirmed dead at Lekki tollgate – Lagos panel",
    "summarized_story": "The Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and other matters says at least nine persons were confirmed dead at the Lekki toll plaza on the night soldiers stormed there to disperse #EndSARS protesters on October 20, 2020.\nThe Justice Doris Okuwobi-led panel made this known in its report submitted to the Lagos State Government on Monday.\nTitled, ‘Report of Lekki Incident Investigation Of 20th October 2020’, a copy of which was made available to The PUNCH, the panel said at least 48 protesters were either shot dead, injured with bullet wounds or assaulted by soldiers.\nAccording to the report, nine protesters were confirmed dead, while four were presumed dead.\nAccording to the 309-page report, the protesters were allegedly killed by policemen and soldiers."
  },
  {
    "headline": "Gumi Urges Govt To Build Schools For Bandits To End Insecurity",
    "summarized_story": "Sheikh Ahmad Gumi, a controversial Islamic cleric, has called on the Federal Government to construct schools for bandits.\nThe billions of Naira spent on weapons, according to Gumi, should be utilized to create schools for bandits.\nHe stated that the majority of the bandits he spoke with are willing to lay down their weapons and embrace education.\nGumi made the statement yesterday at the Uthman Dan Fodio Centre at Kagarko Grazing Reserve Kohoto Village, Kagarko Local Government Area, Kaduna State.\nI have spoken to lots of them, they have agreed to lay down their weapons and embrace education."
  },
  {
    "headline": "Why I Attacked, Battered My Lecturer — Final Year UNILORIN Student",
    "summarized_story": "Salaudeen Waliu, alias Captain Walz, a final-year student at the University of Ilorin’s Department of Microbiology, Faculty of Life Sciences, who assaulted a female lecturer, Mrs Zakariyau, has explained his actions.\nHe stated he went to the female lecturer’s office to urge her to waive the SIWES course that he had missed due to unforeseen circumstances.\nHe claimed to have met Mrs Zakariyau several times, all of which resulted in negative replies prior to the lecturer’s assault last Thursday.\nAfter the incident in Lagos, the final year student approached Mrs Zakariyau to explain his ordeal, but the lecturer told him there was nothing he could do except join the following set, which would give him an extra year.\nHe claimed that when he entered the lecturer’s office on that fateful Thursday, she ordered him out."
  },
  {
    "headline": "Boko Haram In Full Control Of Five Communities In Our State — Niger Govt Raises Alarm",
    "summarized_story": "The Niger State Government has raised the alarm over Boko Haram terrorists’ activities in at least five communities in the state’s Rafi and Shiroto Local Government Areas.\nThe affected communities are currently under the grip of the insurgents, according to the Secretary to the State Government, Alhaji Ahmed Matane, who stated this to NAN on Monday.\nKurebe, Farina Kuka, Gussau in Shiroro LGA and Madaka, Hanawanka in Rafi LGAs of the state are among the communities he mentioned.\nHe also revealed that the state administration has already contacted security agencies to take appropriate emergency security measures to safeguard citizens’ safety.\nMatane, also assured that the state government will not rest on its efforts to bring to a halt security challenges confronting the state presently."
  },
  {
    "headline": "Full list of victims of Lekki tollgate shooting during EndSars protest",
    "summarized_story": "On October 20, 2020, nine #EndSARS protesters were slain at the Lekki tollgate.\nAccording to the report, 48 people were killed in the Lekki event on October 20, 2020.\nProfessor John Obafunwa, a forensic pathologist at Lagos State University Teaching Hospital, submitted 96 other corpses before the panel.\n“Three trucks with brushes underneath were brought to the Lekki Toll Gate in the morning of October 21st October, 2020 to clean up the scene of bloodstains and other evidence.\nFollowing the incident at the Lekki Toll Gate on October 20, 2020, the terms of reference of the Panel were expanded to cover that incident."
  },
  {
    "headline": "Breaking: Commotion as another deadly blasts erupt",
    "summarized_story": "One blast took place near parliament, with the other going off close to the city’s police headquarters.\nThe cause of the blast was not immediately clear but the Ugandan authorities have blamed previous bombings on Islamist militants.\nUgandan forces are part of an African Union peacekeeping force in Somalia fighting al-Shabab, an insurgent group allied to al-Qaeda.\nLast month, the Islamic State group said it was behind an attack on a bar in Kampala which killed a 20-year-old waitress.\nProceedings in parliament have been called off and MPs advised not to come to the building following Tuesday’s blast."
  },
  {
    "headline": "Breaking: Many feared dead as explosion rocks Ladipo in Lagos",
    "summarized_story": "There are indications that many residents might have died after a gas explosion occurred near spare parts market in Ladipo, Lagos state, Blueprint is reporting.\nAlready casualties have been evacuated from the scene even as some are still trapped as at the time of filling this report.\nAuthorities are yet to confirm the latest development which reportedly occurred early Tuesday morning.\nDetails coming…"
  },
  {
    "headline": "Another shutdown of universities looms as ASUU threatens fresh strike",
    "summarized_story": "Announcing plan to resume fresh strike, the body said its members would withdraw its service for another round of industrial action.\n“ASUU is fully committed to upholding academic integrity in our universities and working to make them more globally competitive.\nWe are equally committed to promoting industrial harmony in the Nigerian university system for as long as all stakeholders are willing and committed to play their parts.\nGovernments ofNigerian should be held responsible should ASUU be forced to activate the strike it patriotically suspended,” Osodeke said.\nStating the position of the national body, Osodeke said: “The controversy this appointment has generated is unprecedented in the recent history of Nigerian universities."
  },
  {
    "headline": "VIDEO: At Least Five Killed As Gas Explosion Hits Ladipo Market",
    "summarized_story": "No fewer than five persons have been confirmed dead in a gas explosion at Ladipo in the Mushin Local Government area of Lagos State.\nThe explosion occurred on Tuesday morning at the Liquefied Petroleum Gas (LPG) domestic retail centre located on Ojekunle Street at the popular Ladipo Spare Parts Market.\nA spokesman for the National Emergency Management Agency (NEMA), Ibrahim Farinloye, confirmed the incident to Channels Television.\nThose present include personnel of NEMA, Lagos State Emergency Management Agency (LASEMA), Lagos State Fire Service, and the police.\nThe explosion occurred two weeks after a high-rise building under construction collapsed with dozens trapped in Ikoyi, Lagos."
  },
  {
    "headline": "Nigerian Govt Demands Probe Into ‘Mysterious’ Death Of Citizen Jailed In Cote d’Ivoire",
    "summarized_story": "The Nigerian Government has demanded a full autopsy on the ‘sudden and mysterious’ death of Itunnu Babalola, a Nigerian lady sentenced to 20 years imprisonment for alleged human trafficking in Cote d’Ivoire.\nChairman of the Nigerians in Diaspora Commission (NIDCOM), Abike Dabiri-Erewa, made the demand while condemning the death of the lady said to have been wrongfully jailed.\nFor Dabiri-Erewa, the death of the lady was a tragic blow that came at a time the Nigerian mission in Cote d’Ivoire had engaged the services of a lawyer to handle her appeal case.\nWhile the appeal case was ongoing, Itunnu was said to have complications from diabetes and was rushed to the hospital.\nThe fee for her treatment, according to the agency, was paid by the Nigerian mission through the lawyer whose services were engaged by the mission."
  },
  {
    "headline": "Twin Explosions Hit Ugandan Capital",
    "summarized_story": "Two explosions hit Uganda’s capital Kampala on Tuesday, injuring some people in what police termed “an attack” on the city, the latest in a string of blasts targeting the country.\n“The explosions took place near the Central Police Station and another took place near the entrance to Parliament, all in the central business district,” he said, adding that the injured had been taken to hospital.\nThe explosion near the police station shattered windows while the one near the entrance to parliament saw cars parked nearby burst into flames, he added.\nKyle Spencer, the executive director of Uganda’s Internet Exchange Point, who heard the blasts, told AFP that the explosions had sparked panic among many people nearby.\nThe ADF, historically a Ugandan rebel group, has been accused of killing thousands of civilians in the eastern Democratic Republic of Congo (DRC)."
  },
  {
    "headline": "Lekki Toll Gate: Army ‘Killed Unarmed, Defenseless Protesters’ – Lagos Panel",
    "summarized_story": "The Lagos State Judicial Panel of Inquiry on Restitution for victims of SARS-related abuses and other matters has concluded that the Nigerian Army shot and killed unarmed protesters at the Lekki Toll Gate on October 20, 2020.\nAccording to the Panel, the Nigerian Army “was invited for intervention in the State and was deployed to Lekki Toll Gate on the 20th of October 2020.\n“The Panel also found that the conduct of the Nigerian Army was exacerbated by its refusal to allow ambulances render medical assistance to victims who required such assistance.\n“The Panel found that there was an attempt to cover up the Incident of the 20th of October by the cleaning of the Lekki Toll Gate and the failure to preserve the scene ahead of potential investigations.”The Federal Government had denied that unarmed protesters were killed at the toll gate on October 20.\nThe Minister of Information, Mr. Lai Mohammed, described the incident as a “massacre without bodies.”The Nigerian Army also denied any wrongdoing."
  },
  {
    "headline": "Nomination, Expression Of Interest Forms For Ekiti, Osun Polls Cost N22.5m – APC",
    "summarized_story": "The All Progressives Congress (APC) has announced a total cost of N22.5 million for its nomination and expression of interest forms for members aspiring to contest for the party’s ticket ahead of the governorship elections in Ekiti and Osun States.\nThis was contained in the timetable and schedule of activities for the elections released by the National Secretary of APC Caretaker/Extraordinary Convention Planning Committee (CECPC), John Akpanudode.\n“The party fixed the sale of the forms at N22.5 million,” the document obtained by Channels Television on Tuesday said.\n“While the nomination form costs N20 million, the expression of interest form costs N2.5 million.\nHe explained that the timeline approved by the APC leadership was released in accordance with the provisions of the Electoral Act and INEC guidelines."
  },
  {
    "headline": "Why I resigned as Dapo Abiodun's Attorney-General",
    "summarized_story": "A former Attorney General and Commissioner for Justice in Ogun State, Akingbolahan Adeniran, has explained the reason behind his resignation from the government of Dapo Abiodun.\nIn a statement he personally signed and released on Monday, Mr Adeniran said his resignation is purely personal contrary to what is being reported in some media outfits.\nThe statement reads: “My attention has been drawn to some online news publications purporting to provide reasons for my resignation from the Ogun State Government as the Attorney-General and Commissioner for Justice.\nI have thoroughly enjoyed working with such an amazing group of administrators, technocrats and experts in various fields of endeavour.\nI have learnt a lot from you all and pray that God will continue to use you to improve on the lives of the good people of Ogun State,” the statement read."
  },
  {
    "headline": "JUST IN: Troops repel ISWAP's return to Askira Uba",
    "summarized_story": "Members of the Islamic State of West African Province, ISWAP, have returned to Askira Uba Local Government, at about 05:00pm, shooting sporadically and setting shops ablaze.\nThe insurgents struck at Dille, a village close to Lassa town in the local government.\nIn a swift reprisal, troops stationed at Damboa Local Government, some 70km from Askira Uba stormed the village killing scores of the terrorists including their commanders and destroying their weapons.\nDetails of the report are still sketchy about the current situation but sources say reinforcements have moved into the town and taken full control.\nThis is coming less than 48 hours after ISWAP terrorists attacked the local government , killing a brigadier general and three soldiers in one of the two ambushes they staged concurrently."
  },
  {
    "headline": "Boko Haram Seizes communities in Shiroro, Rafi LGAs In Niger State -",
    "summarized_story": "Boko Haram terrorists have taken over five communities in Rafi and Shiroto Local Government Areas of Niger state, an official of the state said.\nHe explained that the Boko Haram insurgents are fully in charge in Hanawanka ,Madaka ,in Rafi LGA and Kurebe,Gussau,Farina Kuka in Shiroro LGA, forcing the rural dwellers to migrate to safer grounds.\n” We have spent over N 2 billion on the security agencies in the ongoing fight against banditry, kidnapping and other criminal activities in the last two years .\nMatane, also acknowledged and applauded the Niger state government efforts at tackling the menace.\nHe said the government will not rest on its oars to bring to a halt security challenges confronting the state."
  },
  {
    "headline": "Oyo State Muslim Community is apolitical- Kunle Sanni",
    "summarized_story": "Chairman, Oyo State Muslim Community, Alhaji Kunle Sanni says the community does not belong to any political party but always fights for justice for the Muslims.\nAlhaji Sanni stated this in Ibadan at a programme reception organised by National Council of Muslim Youth Organisations, NACOMYO, Oyo State Chapter for new Muslim Commissioners, Local Government Chairmen, National Amirah of FOMWAN and a Senior Advocate of Nigeria.\nNone of my children is working with Oyo State Government to say that that is whom we are fighting for but for the generality of the Muslims.\nOther political functionaries in attendance are Chairman, Oyo State Civil Service Commission, Alhaji Kamorudeen Aderibigbe Chairman Ibadan North Local Government, Hon.\nYusuf Shuaib Oladejo and representative of Chairman, Association of Local Government Employee of Nigeria, ALGON, Oyo State Chapter."
  },
  {
    "headline": "Myanmar Charges Aung San Suu Kyi Over Alleged Election Fraud",
    "summarized_story": "Myanmar has charged 16 people, including former elected leader Aung San Suu Kyi, with election fraud over the 2020 elections, state media reported on Tuesday.\nAung San Suu Kyi, former President U Win Myint and the former head of the Elections Commission were among the group accused of “election fraud and lawless actions” during the November polls, which Aung San Suu Kyi’s National League for Democracy won in a landslide.\nAung San Suu Kyi has been detained since the military seized power on February 1 and has been charged with a litany of offences.\nThe military has claimed their power grab was necessary because of fraud in the election.\nThe armed forces have controlled Myanmar for most of the decades since the country’s independence, with Aung San Suu Kyi, now 76, spending years under house arrest."
  },
  {
    "headline": "US Condemns Russian Anti-Satellite Missile Test",
    "summarized_story": "The US has condemned Russia for conducting a “dangerous and irresponsible” missile test that it says endangered the crew aboard the International Space Station (ISS).\nThe space station orbits at an altitude of about 420km (260 miles).\n“Earlier today, the Russian Federation recklessly conducted a destructive satellite test of a direct ascent anti-satellite missile against one of its own satellites,” US state department spokesman Ned Price said at a briefing.\nRussian space agency Roscosmos downplayed the incident.\nIt appears to have come from a broken-up Russian satellite, Kosmos-1408."
  },
  {
    "headline": "Xi, Biden Wrap up ‘Virtual’ Meeting Amid Rising Tension",
    "summarized_story": "US President Joe Biden called for better and more “honest” communication between China and the US during a virtual call with Chinese President Xi Jinping where both leaders played up their close relationship.\nXi and Biden have met several times before.\nDuring the vcall with Xi, Biden said the US opposes “unilateral efforts to change the status quo or undermine peace and stability across the Taiwan Strait,” according to a White House statement.\n“It is very clear that US is concerned about the Taiwan Strait.”Speaking from Beijing, Xi said the two countries faced multiple challenges.\nThe virtual summit lasted for more than three and a half hours, wrapping up shortly before 12.30pm (04:30 GMT) Beijing time, according to Chinese state media."
  },
  {
    "headline": "Dutch Government Scrambles as Shell Plans Movement of $170bn Headquarters to UK",
    "summarized_story": "Earlier this year, Shell chief executive Ben van Beurden cited the Netherlands’ failure to abolish the dividend tax as a potential reason for leaving the country.\nThe UK is an exception among most European countries by not having a withholding dividend tax.\nThen last month Dutch pension fund ABP said it was divesting from all fossil fuel companies, including a significant stake in Shell.\n“Then there’s the recent Dutch court ruling obliging Shell to slash its annual emissions by 45 per cent by 2030.\nThe departure and loss of the Dutch “royal” label will win Shell few friends in its former home."
  },
  {
    "headline": "World Bank: Boko Haram Caused Economic Activities to Decline in Nigeria’s North-east by 50%",
    "summarized_story": "The World Bank has stated that the destruction caused by the Boko Haram sect caused economic activities in the north-eastern part of the country to decline by 50 per cent.\nThe multilateral institution noted that Adamawa, Borno and Yobe states which are in the Lake Chad region saw economic activities decline from 10 to 14 per cent between 2009 and 2013, adding that the region has recorded 50 per cent decline in activities from 2018.\n“The third area is governance and the importance that it has across all the different development challenges that Lake Chad region faces.\nAnd the fourth one is about natural resource management.”On his part, the Country Director for Nigeria, World Bank, Mr. Shubham Chaudhuri advised Nigeria to urgently tackle insecurity to enhance growth especially in the north-east.\nHe said: “I think especially for an institution like the World Bank, you know we are for development and for that, we need peace and security to proceed with development.”Nume Ekeghe"
  }
]