[
  {
    "headline": "Travel ban: Nigeria, UK may clash, FG alleges action discriminatory",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed, who said this at a press conference in Abuja on Monday, described the travel ban as discriminatory.\nAlso, Nigeria’s High Commissioner to the UK, Alhaji Sharafa Ishola, described the travel ban as apartheid.\nBut the Head of Communications, British High Commission, Hurlock, said the UK was aware of the significant impact of the travel ban.\nFG to respond to UK, Canada travel ban soon, says Lai MohammedBut earlier on Monday, the Minister of Information and Culture, Mohammed, condemned travel bans by the UK, Canada, Indonesia, Hong Kong and others.\nThe minister argued that the travel ban was counterproductive and wondered why British citizens coming from Nigeria were still allowed in."
  },
  {
    "headline": "We can’t enforce compulsory vaccination order in N’Assembly – Management",
    "summarized_story": "The management of the National Assembly has said the Federal Government’s order that all civil servants must be vaccinated before accessing their offices cannot be implemented at the legislative complex.\nThis is just as safety protocols have been relaxed at the National Assembly.\nFor instance, before the National Assembly went on its annual two-month recess in July, facemasks wearing was made compulsory for persons entering the premises especially the chambers, committee rooms and offices.\nWe have it here in the National Assembly, so the vaccination had commenced in the National Assembly over time and before that directive came.\n“The National Assembly is not like a strictly-civil service environment where you don’t expect to have visitors coming in."
  },
  {
    "headline": "Police arrest man for allegedly beating cigarette seller to death over N50",
    "summarized_story": "The Police Command in Ogun on Monday said it has arrested a 35-year-old man, Biodun Adeniyi, for allegedly beating a cigarette seller to death following an argument over N50 balance.\nThe Spokesman of Police in Ogun, ASP Abimbola Oyeyemi, made this known in a statement issued to newsmen in Ota, Ogun.\nHe stated further that at about 10 pm of the same day, the suspect came back and demanded for N50 balance, which led to an argument between the suspect and his son.\nHe said his son collapsed and was rushed to hospital where he was confirmed dead.\n“Upon the report, the Divisional Police Officer (DPO), Idiroko Division, CSP Shadrach Oriloye, quickly led his men to the scene, where the suspect was promptly arrested."
  },
  {
    "headline": "Fayemi tasks parents on moral upbringing of children",
    "summarized_story": "Bisi FayemiWife of Ekiti State governor, Mrs Bisi Fayemi on Monday in Ado-Ekiti called on parents to raise their children in ways that would make them to appreciate societal norms.\nFayemi gave the advice at the third Gender Based Violence (GBV) summit held at the state capital.\n“We need to underline the causes of GBV and ensure holistic approach to nipping the menace in the bud.\n“If we continue to encourage stereotype approaches, we shall be exposing more people to sexual violence,’’ she said.\nEarlier, the Commissioner for Women Affairs and Social Development, Alhaja Mariam Ogunlade commended the state’s GBV Management committee on successes recorded so far in the fight against the menace."
  },
  {
    "headline": "NAS sensitise public on HIV prevalence in South-West",
    "summarized_story": "The Alimosho chapter of the National Association of Seadogs (NAS) in Lagos State in collaboration with its New York branch in the United States has sensitised members of the public on the prevalence of the Human Immunodeficiency Virus (HIV) in the South-West region.\nShe regretted that the focus has shifted towards the global pandemic of Coronavirus popularly referred to as COVID-19, adding that HIV was still an issue.\nThey are always welcome and we support such programmes and partnerships aimed at strengthening healthcare awareness and solutions.”Meanwhile, the Lagos State Healthcare Board has always shown support in the medical missions organised by NAS.\nShe educated the participants on prevention, staying safe, as well as distribution of condoms to participants to encourage safe sex.\nThis revealed that Lagos has the second-highest no of people leaving with HIV (PLHIV) in South-West Nigeria."
  },
  {
    "headline": "Church urges support for Lagos Peace Walk",
    "summarized_story": "Governor Babajide Sanwo-OluThe Cherubim and Seraphim Movement Church Worldwide, Yaba District Headquarters (Ogo Serafu), has thrown its support on the Peace Walk planned by the Lagos State Governor, Mr Babajide Sanwo-Olu.\nSanwo-Olu had on Nov. 30 called on the youths and other stakeholders to join him on Peace Walk, for healing of Lagos State, after the disturbances that trailed the 2020 #EndSARS protests against police brutality.\nSogunro, a former Rector of the Lagos State Polytechnic, said that what had happened was irreversible, but all had to come together and move the nation forward.\n”Lagos State Government has been doing very well, as far as infrastructural development and listens to the masses.\nSo, the Peace Walk is the thing that everyone wants to embrace”What has happened has happened, we need to move on, let us come together and forge ahead."
  },
  {
    "headline": "FG commissions Virtual Court Room in Kuje Custodial Centre",
    "summarized_story": "By Omeiza Ajayi – AbujaAs part of its commitment to speedy dispensary of justice, the Federal Government has commissioned the newly deployed virtual Court room in Kuje Custodial Centre, Abuja.\nDirector Press in the Ministry of Interior, Mrs Blessing Lere-Adams, disclosed this in a statement issued Monday night in Abuja.\nAregbesola said the Virtual Court Room will reduce the cost and time wastage in transporting inmates to court along with the stress involved.\nHe further explained that during the COVID-19 pandemic, government was able to manage the situation in he facilities with zero case.\nMalami on his part said the Virtual Court rooms in Kuje Custodial Centre is the phase one of the project intended to put right the administration of criminal justice in the country."
  },
  {
    "headline": "COVID-19 Omicron: Nigeria, South Africa told to shut borders",
    "summarized_story": "Former presidential candidate, Kingsley Moghalu has asked Nigeria and South Africa to reciprocate travel bans by western countries and shut their borders.\nMoghalu said this following the travel ban handed to Nigeria by Canada, the United Kingdom, Indonesia, Singapore and Hong Kong.\nMany developed countries have been shutting their doors against African countries due to the newly detected coronavirus variant in South Africa.\nThe UK announced that it found 21 cases of the COVID-19 Omicron variant which were linked to Nigeria.\nMeanwhile, the Nigerians government has said there is no need for travel ban over concerns of Omicron variant."
  },
  {
    "headline": "50 per cent of COVID-19 positive cases in Nigeria from UK – FG",
    "summarized_story": "The Nigerian government has said that 50 per cent of the COVID-19 positive arrivals that the country has had are from the UK.\nMinister of Health Dr Osagie Ehanire said this while faulting the UK government for red-listing Nigeria and other African countries over fears of the Omicron COVID-19 variant.\nHe said, “We regularly have travellers from the UK that are COVID-19 positive.\nIn fact, within the last two weeks, the COVID-19 positive arrivals were 50 per cent from the UK.\nThe health minister stated that there are other ways to go about this COVID-19 variant than banning flights from African countries."
  },
  {
    "headline": "AEDC gives update, apologises for blackout in Abuja",
    "summarized_story": "The Abuja Electricity Distribution Company, AEDC, has apologised to residents over the blackout on Monday.\nDAILY POST observed that some areas of Abuja; Wuye, Utako, Kubwa axis have been in darkness since the early hours of Monday.\nThe staff of the Abuja Electricity Distribution Company AEDC, embarked on an indefinite strike following failure by Management to remit remittances deducted from their salaries.\nThe three states under the Abuja power distribution franchise include Niger, Kogi and Nasarawa may be in darkness till the strike is called off.\nAEDC assured all customers to be patient as all hands are on deck to resolve the issue."
  },
  {
    "headline": "Conduct child assessment on children of Erhimu Secondary School – Group urges Delta govt",
    "summarized_story": "A pro-democracy group, Take It Back,TIB, Monday, urged the Delta Women Affairs Commissioner to Conduct Child Assessment Procedure for All Children at Erhimu Secondary School Abraka, Ethiope-East Local Government Area.\nThis was contained in a statement signed by TIB Delta State Coordinator, Comrade Ighorhiowhunu Aghogho.\nThe operations of the ministry of basic and secondary education is limited to education of children only and not meddling into welfare of children in the state.\n“In 2018, 28 suspected teenage cultists operating in some public secondary schools in Asaba, the Delta State Capital were arrested by the State Police Command.\n“Peculiar (surname withheld), a 15-year old senior secondary school student of Ugbomro Secondary School was among the 25 school girls who fell victims to the syndicate."
  },
  {
    "headline": "Open defecation: Divergent views rock proposed bill at stakeholders’ meeting",
    "summarized_story": "Divergent views by lawmakers and other stakeholders rocked the proposed bill to establish the Clean Nigeria Agency for prohibition of open urination and defecation.\nThe Senate Committee on Water Resources on Monday held a one-day public hearing on the bill, but government agencies and the Federal Ministry of Water Resources differed extensively on the possibility of the agency, fearing that there might be duplication of responsibilities.\nOrdia said the bill would also complement the Presidential Executive Order 009 on enforcement and sanctions against Open Defecation System (ODS).\nMandiya was shocked that Nigeria had not attained significant progress in sanitation after four years of a committee to tackle the situation.\n“Why have we not done well like India that tackled its situation within four years”, he asked."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "PDP, APC clash over Akeredolu’s doctoral award",
    "summarized_story": "The opposition Peoples Democratic Party (PDP) and the ruling All Progressives Congress (APC) have clashed over the honorary doctoral degree conferred on Governor Oluwarotimi Akeredolu at the 12th and 13th convocation of Ajayi Crowther University, Oyo State.\nTo the PDP, the event was another drain on the state finances, as it alleged that Ondo government officials graced the occasion at tax payers’ expense.\nIt said it beats logical reasoning for a governor, whose sing song was paucity of funds, to mobilise almost everybody in the political circle of Ondo State to Oyo for an award.\n- Advertisement -Commissioner for Information and Orientation Donald Ojogo said it was illusionary to expect the PDP to keep quiet without last kicks and not embrace any straw in its drowning moment.\n“The reason is simple; the issue at stake, a Doctoral Degree in Law, LL.D, Honorary Causa, is far too sophisticated to be comprehended."
  },
  {
    "headline": "N7tr loans injected into economy in three years, says CBN",
    "summarized_story": "The Central Bank of Nigeria (CBN) has injected N7 trillion into the economy as loans in three years, it was learnt yesterday.\nCBN Deputy Governor, Financial Systems Stability, Mrs. Aishah Ahmad, dropped the hint at the 40th anniversary summit of the Financial Institutions Training Centre (FITC) in Lagos.\nShe said: “Over the years the CBN has tried to ensure that we drive lending to the real sector.\nShe added: “We’re very positive about the resilience and the soundness of the banking sector.\nActually, the banking system has been very strategic in support of the recovery based on the impact of COVID."
  },
  {
    "headline": "EFCC cautions court against granting ex-Jonathan’s aide, Olejeme’s request for foreign trip",
    "summarized_story": "The EFCC, in a counter-affidavit to Olejeme’s application for leave to travel abroad for medical attention, insisted that the ex-Chairman of the Nigerian Social Insurance Trust Fund (NSITF) was a high flight risk.\nEFCC through its lawyer, Steve Odiase, informed the court that the health challenges complained about by the defendant could easily be treated in some hospitals in Nigeria.\nHe also argued against Olejeme’s request for the EFCC to remove her name from its data base as a wanted person, contending that it was premature for the EFCC to be made to grant such a request.\nOlejeme had, through her lawyer, Paul Erokoro (SAN) prayed the court for leave to travel to South Africa and the United States for medical attention.\nHe urged the court to compel EFCC to notify the International Police, Immigration and other relevant authorities that Olejeme is no longer a wanted person."
  },
  {
    "headline": "Suspension of Ohaneze Youth Leader illegal, unconstitutional – Umahi",
    "summarized_story": "Ebonyi Governor, David Umahi has described the alleged suspension of the National Youth Leader of the Ohanaeze Ndigbo Worldwide, Engr Damian Okafor, as unconstitutional and illegal.\nHe said:“The purported suspension of the National Youth Leader of Ohaneze Ndigbo Worldwide, Comrade Damian Okafor, is illegal and unconstitutional.\n“Nobody can remove any officer that is zoned to Ebonyi and elected by the NEC, nobody, even if the Youth Leader is standing alone, even if this wonderful men and women are not supporting, he remains the Youth Leader and nobody can remove him from office.\n“I commended the Youth Wing of the Ohanaeze Ndigbo Worldwide led by Comrade Damian Okafor and urged them to lend their voice to the Igbo course in 2023.\n“Let us just be decent by our cultural values to do things very decently and please be the youth leader to APGA States, PDP States, and the APC States,” the statement read in part,” he said."
  },
  {
    "headline": "Blackout in Abuja as electricity workers embark on strike",
    "summarized_story": "In a statement, the General Manager, Abuja Electricity Distribution Company (AEDC), Bode Fadipe, said that power supply to some of these areas of operation, especially those on the 11kV network, would be affected.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nRecently, workers in the nation’s power sector, under the auspices of NUEE, served the Federal Government a notice of industrial unrest over planned sale of the Transmission Company of Nigeria, (TCN).\n“However, power evacuation from injection substations across AEDC franchise area has been disrupted following a shutdown of the AEDC facilities by its in-house workers’ union.\n“The areas under AEDC franchise include Abuja, Nasarawa, Kogi, parts of Edo, Niger and Kaduna States."
  },
  {
    "headline": "Man beats another to death over N50",
    "summarized_story": "By Christopher ojiA man, Biodun Adebiyi, 30, has been arrested for allegedly beating a cigarette seller to death over N50 balance at Idiroko area of Ogun State.\nThe suspect a resident of Oladun street Ikotun Lagos, killed the 35-yesr-old Mukaila Adamu ,with a fist blow.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“He stated further that at about 10 pm, the suspect came back and demanded for N50 balance.\n“Upon the report, Dpo Idiroko division, CSP Shadrach Oriloye, quickly led his men to the scene, where the suspect was promptly arrested."
  },
  {
    "headline": "BREAKING: Bandits reject N5million ransom offered by Zagaga community in Niger",
    "summarized_story": "From John Adams, MinnaThe Abductors of over 55 people from Zagzaga community in Munya local government area of Niger state have rejected N5million offered to them by the community for the release of their loved ones.\nHowever source close to Zagzaga told Daily Sun on phone on Monday that the community contributed N5million and offered it to the bandits but was rejected, insisting that the community must pay N1million for each victim, including children.\n“The community contributed N5million which we offered to them, but they told us that the amount is too small.\nAccording to our source, “the community is helpless because since this incident happened, nobody has come to the community to even identify with us.\nThe Military camp was established since 2018 after incessant attack on the community by bandits."
  },
  {
    "headline": "COVID-19 summit: Senate President lambast health ministers, perm sec for being absent",
    "summarized_story": "When told that the minister of health was present earlier, he insisted another senior official should have replaced him to demonstrate the seriousness of the event.\nThe Senate President who declared the summit opened said: “Before I begin my remarks, is the permanent secretary ministry of health here?\nWell, I asked that question because the two ministers of health are not here.\nThe Minister of Health, the Minister of State and the permanent secretary are not here.\nBecause everything we do here, the federal ministry of health is supposed to be here to garner all the resources that will come out of this."
  },
  {
    "headline": "Travel ban: FG demands immediate reversal",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has demanded a reversal of Britain’s travel ban on Nigerians as well as including the country on a Red List.\nMinister of Information, National Orientation and Culture, Alhaji Lai Mohammed, conveyed government’s decision at a press conference in Abuja, today.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nGovernment described the ban and Red List as unjust, discriminatory and not based on science.\nClick Here to Apply ."
  },
  {
    "headline": "Sowore's Lawyer Writes Buhari Ahead Of Tuesday's Court Sitting, Says Government-hired Thugs Plotting To Assassinate Activist",
    "summarized_story": "On October 21, the DSS also colluded with thugs to attack Sowore in the same court after he was denied entry by policemen during Kanu’s trial.\nOn December 2, the DSS added to the already swelling list of attacks against Sowore’s liberty on court premises.\nArmed thugs hired by the DSS attacked Sowore as he made his way out of the Federal High Court, Abuja.\nImmediately they sighted him, the thugs rushed towards Sowore and started throwing stones at the activist and the people with him.\nAs he navigated his way out of the court premises, the thugs rained several more stones on his car, damaging the shields, windows and some other parts."
  },
  {
    "headline": "Sowore's Lawyer Writes Buhari Ahead Of Tuesday's Court Sitting, Says Government-hired Thugs Plotting To Assassinate Activist",
    "summarized_story": "On October 21, the DSS also colluded with thugs to attack Sowore in the same court after he was denied entry by policemen during Kanu’s trial.\nOn December 2, the DSS added to the already swelling list of attacks against Sowore’s liberty on court premises.\nArmed thugs hired by the DSS attacked Sowore as he made his way out of the Federal High Court, Abuja.\nImmediately they sighted him, the thugs rushed towards Sowore and started throwing stones at the activist and the people with him.\nAs he navigated his way out of the court premises, the thugs rained several more stones on his car, damaging the shields, windows and some other parts."
  },
  {
    "headline": "BREAKING: Myanmar Court Sentences Former Leader, Suu Kyi To Four Years In Jail",
    "summarized_story": "A court in Myanmar on Monday sentenced the country’s deposed leader, Aung San Suu Kyi, to four years in jail, according to the AFP.\nAung San Suu KyiZaw Min Tun said she received two years in prison on each of the two charges.\nReuters and the Associated Press, citing sources familiar with the proceedings, also said Suu Kyi and Myint were sentenced to four years in prison each.\nThe trial in Naypyidaw has been closed to the media, while the military has barred Suu Kyi’s lawyers from communicating with the media and the public.\nSuu Kyi, who had spent 15 years in house arrest under a previous military government, denies all the charges."
  },
  {
    "headline": "BREAKING: Myanmar Court Sentences Former Leader, Suu Kyi To Four Years In Jail",
    "summarized_story": "A court in Myanmar on Monday sentenced the country’s deposed leader, Aung San Suu Kyi, to four years in jail, according to the AFP.\nAung San Suu KyiZaw Min Tun said she received two years in prison on each of the two charges.\nReuters and the Associated Press, citing sources familiar with the proceedings, also said Suu Kyi and Myint were sentenced to four years in prison each.\nThe trial in Naypyidaw has been closed to the media, while the military has barred Suu Kyi’s lawyers from communicating with the media and the public.\nSuu Kyi, who had spent 15 years in house arrest under a previous military government, denies all the charges."
  },
  {
    "headline": "COVID-19 Vaccines Should Reach 70% Of Citizens Before 2022 Ends – Nigerian Government",
    "summarized_story": "The Nigerian government has said it is prepared to vaccinate 70 per cent of Nigerians against COVID-19 before the end of 2022.\nThe Secretary to the Government of the Federation (SGF) and Chairman, Presidential Steering Committee (PSC) on COVID-19, Mr Boss Mustapha, said this on Monday in Abuja.\nNigeria has invested in vaccines that can cover over 70 per cent of our population before the end of 2022.\n“These vaccines are safe and efficacious; it is better and safer to be vaccinated against this virus, now,” Mustapha said.\nHe said, “Nigeria’s COVID-19 response has been driven by science, data and experience since then till date."
  },
  {
    "headline": "Fresh strike: We’ll soon announce next action, says ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) says it would soon announce its next line of action — after the expiration of its ultimatum to the federal government.\nAdvertisementOn November 15, ASUU gave the federal government a three-week ultimatum to implement the agreement it reached with the union.\nThe ultimatum expired on Sunday, prompting the union executives to summon a meeting to review government’s response to its demands.\nAdvertisementSpeaking with TheCable Lifestyle on Monday, Emmanuel Osodeke, ASUU national president, said the federal government has only met one of the union’s demands.\nThat would be announced very soon.”The union had embarked on a nearly nine-month strike in 2020 over the unmet demands by government."
  },
  {
    "headline": "KWASU sacks lecturer who ‘threatened to fail student over sex’",
    "summarized_story": "The Kwara State University (KWASU) has sacked one of its lecturers identified as Pelumi Adewale.\nAdvertisementThe academic was relieved of his duties for alleged sexual harassment of one Tosin Adegunsoye, a student of the department of Pure and Applied Sciences of the school.\nAccording to NAN, Mustapha Akanbi, the vice-chancellor at KWASU, announced Adewale’s dismissal in Ilorin on Monday.\nAdvertisementAkanbi said that Adewale had ceased to be a lecturer of the school for bringing the institution into disrepute.\nAdewale was, on September 11, arraigned before a magistrate court in Ilorin, over accusation of sexual harassment."
  },
  {
    "headline": "Students affected by fees scam flouted our directive, says EKSU",
    "summarized_story": "The Ekiti State University (EKSU) says some of its students affected by a recent tuition fee scam flouted its directive on the mode of payment.\nIt was gathered that the university authorities had asked the affected students to pay another school fee for the session.\nSpeaking with NAN on Monday, Bode Olofinmuagun, the head of the institution’s directorate of information and corporate affairs, said the affected students disregarded the university’s policy on the procedure for payment of fees.\nHe said the procedure for payment of fees and charges was uploaded on the university’s portal and website.\n“However, in spite of the above warning and after a thorough investigation, it was discovered that the defrauded students disregarded the policy on the procedure for payment."
  },
  {
    "headline": "2022 UTME: JAMB changes literature texts for language subjects",
    "summarized_story": "The Joint Admission and Matriculation Board (JAMB) says it has changed its literature texts for four language-related subjects.\nAdvertisementThe change, which also affects Literature-In-English, comes ahead of the 2022 Unified Tertiary Matriculation Examination (UTME).\nAccording to NAN, JAMB stated in its weekly bulletin issued on Monday that the four language subjects are Hausa, Igbo, Yoruba, and Arabic.\nThe changes, it said, would take effect from the 2022 UTME.\n“New texts for the Yoruba Language include ‘Akojopo Alo Ijapa, Apa Kinni’, by Adeboye Babalola;`Awon Oriki Orile Metadinlogbon’ by Adeboye Babalola, ‘Moremi Ajasoro’ by Debo Awe,” JAMB added."
  },
  {
    "headline": "Oromoni’s death: We also have bullies in Nollywood, says Halima Abubakar",
    "summarized_story": "Halima Abubakar, the Nollywood actress, says there are bullies in the country’s movie industry and she is ready to mention their names.\nAdvertisementThe movie star was reacting to the death of Sylvester Oromoni Jnr, the 12-year-old student of Dowen College, in an Instagram post on Monday.\nAdvertisementIn the post, Abubakar, who described herself as a survivor of bullying, said efforts must be put in place to ensure that Oromoni gets justice.\nLook even in Nollywood we have bullies and I will name them all.”View this post on Instagram Advertisement A post shared by Halima Abubakar (@halimabubakar)According to her, parents must ensure constant communication with their wards to eradicate bullying in society.\nLook, even in Nollywood, we have bullies and I’ll name them all."
  },
  {
    "headline": "Earnipay is improving financial well-being for salaried employees",
    "summarized_story": "In Nigeria, wages for formal-sector employees are paid monthly; in the informal sector, however, this is paid daily.\nNow, when salaried employees go broke between paydays, they have three options: borrow, take a loan, or request a salary advance.\nEarnipay, a fintech solution, founded by Nonso Onwuzulike, allows employees flexible access to their accrued salaries on any day of the month.\nCommenting on Earnipay’s plans for 2022, Onwuzulike said, “Our goal is to partner with employers to improve employee financial well-being.\nIn addition to flexible salary access, we provide financial education to advise employees on best practices to manage their finances, and other products to assist them daily.”Share this article"
  },
  {
    "headline": "TradeDepot secures $110m to expand Buy-Now-Pay-Later to more African retailers",
    "summarized_story": "The fund will support the delivery of Buy-Now-Pay-Later (BNPL) services to 5 million SME retailers and drive further expansion of its merchant platform across the continent.\nThe debt funding was led by Arcadia Funds.\nIn Africa, SME retailers generate $1 trillion in sales annually and contribute $2.6 trillion to the continent’s nominal GDP.\nTradeDepot has grown from over 40,000 merchants on its platform last year to more than 100,000 merchants.\nBut, as for TradeDepot, it wants to capture more than 5 million SMEs as it continues to leverage and expand its BNPL offering in the 12 cities it’s currently operating in."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "#Tech4Disabled, January 2022 and 5G in Nigeria, Flex Finance’s pre-seed",
    "summarized_story": "Share this article:Hi there,Today I’m discussing:A tech-inclusive world for Africa’s disabled personsNigeria and its 5G launch progress?\nWith MTN Nigeria’s recent share sales, continuing profits recorded by telcos operating in Nigeria, and a 5G auction coming up, 2022 is shaping up to be an exciting year for the telecommunications space in the country.\nNigeria-based Flex Finance raises pre-seedFlex Finance team.\nSource: SuppliedSpend management startup, Flex Finance has announced a six-figure pre-seed round to build the Ramp of Africa.\nWith an official launch in March 2021, Flex Finance currently operates an all-in-one spend management application equipped with a digital wallet to help African businesses efficiently perform trackable spending."
  },
  {
    "headline": "4 tech innovations that can make life easy for physically challenged Africans",
    "summarized_story": "However, the World Health Organisation (WHO) puts the number of people living with disabilities at 300 million.\nThe UN also affirms that most Africans living with disabilities are excluded from school and work opportunities.\nIn celebration of the International Day of the Disabled, we are looking at four tech innovations that could help people living with disabilities globally.\nRecalling when a group of visually impaired persons was testing the Eone, Kim was asked if the watch was made specifically for the blind.\nMore attention needs to be paid to assistive tech but, more importantly, persons with disabilities."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Nigeria eyes fresh $2.18bn Eurobond issuance",
    "summarized_story": "The amount will make up the $6.18bn external borrowing, already appropriated in the 2021 budget.\n“For the external borrowing, which is about $6.18bn, we raised $4bn in September.\nFor the remaining $2.18bn, we are working with the transaction advisers and monitoring the market.\n“If we think the market is good and our supervisors say we should raise that money, we will.\nBut our options are on the table for the external borrowing,” Patience Oniha, Director General, Debt Management Office (DMO) said Monday."
  },
  {
    "headline": "Nigeria may hike policy rate to 12.5% in 2022 on slowing inflation – Rencap",
    "summarized_story": "A more secure growth recovery and slowing inflation would give Nigeria scope for a one percentage point (1-ppt) policy rate hike to 12.5 percent in 2022, Renaissance Capital, an emerging and frontier markets-focused investment bank, said in a note on Monday.\nAlready, the firm noted that some African central banks have started to tighten their monetary policy before the growth recovery becomes entrenched.\nNigeria’s Monetary Policy Committee (MPC) left its policy rate at 11.5 percent on November 23, 2021, its last meeting of the year.\nNigeria’s central bank has kept the Monetary Policy Rate (MPR) at 11.5 percent since September 2020, from 13.5 percent, to improve the flow of credit to households and businesses.\nGenerally, real GDP growth rate is projected to remain robust and strengthen within the short-term, regardless of the imminent vulnerabilities."
  },
  {
    "headline": "UK travel ban: Airlines risk N965m daily",
    "summarized_story": "Airlines operating the Nigeria-London route could be losing about N965 million daily as a result of flight cancellations following the UK travel ban on Nigeria, BusinessDay’s findings have revealed.\nRead Also: UK travel ban: Passengers stranded over flight cancellationsThis implies that daily, the airline processes 1,200 passengers for both arriving and returning on London-Abuja and London-Lagos routes.\nThis implies that with each of the airlines processing 180 departing and arriving passengers daily to the UK, these seven airlines process 1,260 passengers to the UK.\nSusan Akporiaye, president, National Association of Nigeria Travel Agencies (NANTA) told BusinessDay that while airlines are rescheduling their flights, individuals have been cancelling their trips since the UK ban.\nFlights scheduled to operate on Sunday and other days have since been cancelled and rescheduled following the UK travel ban."
  },
  {
    "headline": "Buhari, Obaseki urge Auditor-Generals on strategies to end corruption – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – President Muhammadu Buhari and the Edo State Governor, Mr. Godwin Obaseki have charged Auditor-Generals in the country to develop innovative strategies that can help the government win the war against corruption.\nDeclaring open the 2021 conference of Auditor-Generals in Nigeria (COAGN) with the theme ‘Securing Audit Independence Sustainability: The Urgency of Now,’ President Buhari restated his administration’s commitment to end corruption in the country.\nBuhari, represented by Governor Obaseki, noted that the sustained fight against corruption by his administration is already yielding positive results.\nAccording to him, “As you go into deliberations, I urge you to come with strategies on how to help stamp out corruption in Nigeria.\nWe have no other country than Nigeria; it is by doing so that the future generations of Nigeria can thrive in this great nation.”Buhari further noted, “During my first inauguration, I told Nigerians that if we don’t kill corruption, corruption will kill Nigeria."
  },
  {
    "headline": "Obaseki approves appointment of Agbogun, Gowon, Obadiku as Special Advisers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the appointment of three new Special Advisers.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the appointees are James Babatunde Agbogun Esq.\nAccording to him, “The Edo State Governor, Mr. Godwin Nogheghase Obaseki, has approved the appointments of the underlisted persons as Special Advisers in the Edo State Government.\n; Yakubu Gowon, and Jimfred Obadiku.”He added that the swearing-in of the appointees will be conducted at a date to be announced later.\nThis follows the recent appointment of 38 Senior Special Assistants and 96 Special Assistants drawn from across the state after the harmonization of the Peoples Democratic Party (PDP) by the leaders of the party."
  },
  {
    "headline": "Obaseki: Edo’s 30-year plan’ll sustain reforms in healthcare, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state’s newly unveiled 30-year development plan will sustain ongoing reforms and projects by his administration aimed at improving the livelihoods of the people and ensuring a progressive and prosperous state.\n“In the last five years, we have undertaken transformational reforms targeted at overhauling the civil/public service, which is the engine that drives government.\nWe are aware that we need to sustain these deep reforms and initiatives.\nThat is why we unveiled the 30-year development plan process, which we have commenced.\n“The Edo State 30-year Development Plan and the Edo State 30-year Urban and Regional Masterplan will be a grand design to set the new course and direction for one of the most progressive and prosperous sub-national governments in Nigeria,” Obaseki added."
  },
  {
    "headline": "Obaseki to spend N51bn on physical infrastructure, construction of roads, bridges in 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the state plans to expend N51billion in 2022 for the development and sustenance of physical infrastructure, as well as the construction and rehabilitation of roads and bridges.\nThe governor, who recently presented the 2022 budget proposal to Edo State House Assembly in Benin City, said N30bn will be spent on improving roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nReassuring the completion of all ongoing road projects in the state, Obaseki, reassured residents that his government remains committed to infrastructural development across the state.\nIn the new financial year, we have budgeted N30bn to improve roads and bridges and N21bn for building more physical infrastructure and maintaining existing ones.\nThese include roads linking towns as well as small township and inner-city roads."
  },
  {
    "headline": "SERAS AWARDS 2021: 9mobile Wins Africa Prize for Innovation",
    "summarized_story": "Nigerian telecom provider, 9mobile has been recognized for its innovation in driving initiatives that solve critical societal challenges at the 15th edition of the prestigious Sustainability, Entrepreneurship and Responsibility Awards (SERAS).\nThe telecom company was awarded the Deborah Leipzigar Africa Prize for Innovation for powering the Bichi Emirate Digital Skills Project, an initiative aimed at empowering youths in the Bichi emirate of Kano state with the requisite digital skills needed to compete effectively on the global scene.\nCommenting on the award, PR Lead, 9mobile, Chineze Amanfo, commended organisers of the award for the recognition, stating that it was a due recognition of service.\nThe Deborah Leipzigar Africa Prize for Innovation is a pan Africa recognition for innovation that addresses crucial problems in society in a sustainable way.\nOver the years, the SERAS awards has grown to become a most prestigious and coveted recognition in the corporate space across Africa, attracting over 1500 entries from more than 350 organizations"
  },
  {
    "headline": "Ecobank declares N104.51bn PAT for first nine months of 2021",
    "summarized_story": "However, quarter-on-quarter, the bank recorded a 57% growth in its bottom line to N6.2 billion from N4 billion recorded in Q2 2021.\nIn a related development, Ecobank Group has announced the appointment of Mr. Jubril Mobolaji Lawal as Regional Executive and Managing Director designate of Ecobank Nigeria.\n“I wish Mobolaji the best and assure him of both my support and that of the entire Ecobank Group,” said Mr. Ade Adeyemi, Group Chief Executive Officer (GCEO) Ecobank Group.\nMrs. Bola Adesola, the Chairman of the Board of Ecobank Nigeria said: “We look forward to working with Mobolaji and assure him of the full support of the Board, Management and all the staff of Ecobank Nigeria.\nThe retiring managing director, Akinwuntan, expressed his gratitude to Ecobank Group stakeholders for the opportunity to have served the bank."
  },
  {
    "headline": "Omicron: Nigerian govt fumes over U.K. travel ban, vows to retaliate",
    "summarized_story": "He said, “As you are aware, Britain has put Nigeria on its red list and banned foreign travels from our country.\nThis is as a result of the discovery of Covid-19 cases, Omicron variant, in Nigeria.\nBritain now joins other countries, including Canada, which have taken a similar action against Nigeria over Omicron.\n“Gentlemen, in the wake of the discovery of Omicron, the PSC has reviewed its International Travel Protocol.\n“We sincerely hope the British government will immediately review the decision to put Nigeria on its red list and rescind it immediately."
  },
  {
    "headline": "Osun 2022: Adeleke insists he is qualified to run",
    "summarized_story": "Senator Ademola Adeleke, governorship candidate of the People’s Democratic Party for the 2018 governorship election has said he is qualified to contest for the state’s 2022 governorship election, though he is yet to officially declare his intention to contest.\n“I hold my family in esteem for their support over the years and I will not deliberately do anything to cause disaffection.\n“There have been numerous insinuations that HE Seyi Makinde is backing my candidacy, this is not true as I have never discussed my aspirations with him despite our closeness.\nI am also aware of a well orchestral plans by those close to the family to expose my paternity and brand me as a bastard.\nI have hopes that with time the dust we settle and all will be calm again.”"
  },
  {
    "headline": "LAWSAN Board Nullifies Election Of Arinze-led Executive, Others",
    "summarized_story": "The Board of the Law Students’ Association of Nigeria (LAWSAN), has nullified the election and convention, which produced Michael Arinze and others now parading themselves as executives, senate and appointees of the Association.\nThe secretary to the Board of LAWSAN, Mohammed Kime, who disclosed this in a statement in Abuja on Monday, said that a new timetable for election to the National Executive Council (NEC) and legislative arm of LAWSAN shall be released before December 20, 2021.\nAccording to him, the actions of the Board followed resolutions reached at its inaugural meeting held on December 2, 2021, in Abuja.\nHe said the Board also resolved that November 30 of every year shall be the official anniversary date of LAWSAN.\nADVERTISEMENTThe Board, according to him, noted that LAWSAN is opened to all students studying law in Nigerian-accredited Universities."
  },
  {
    "headline": "LAWSAN Board Nullifies Election Of Arinze-led Executive, Others",
    "summarized_story": "The Board of the Law Students’ Association of Nigeria (LAWSAN), has nullified the election and convention, which produced Michael Arinze and others now parading themselves as executives, senate and appointees of the Association.\nThe secretary to the Board of LAWSAN, Mohammed Kime, who disclosed this in a statement in Abuja on Monday, said that a new timetable for election to the National Executive Council (NEC) and legislative arm of LAWSAN shall be released before December 20, 2021.\nAccording to him, the actions of the Board followed resolutions reached at its inaugural meeting held on December 2, 2021, in Abuja.\nHe said the Board also resolved that November 30 of every year shall be the official anniversary date of LAWSAN.\nADVERTISEMENTThe Board, according to him, noted that LAWSAN is opened to all students studying law in Nigerian-accredited Universities."
  },
  {
    "headline": "W/Bank, Firm Empower 180 Women IDPs, Others",
    "summarized_story": "About 180 young girls and women have been trained on fourth generation jobs.\nOut of the number, 32 were selected from the Internally Displaced Persons (IDPs).\nThe fourth generation job project sponsored by the World Bank and executed by Natview Technology, a global ICT and knowledge management firm that focuses on delivering cutting edge solutions, exposed the women and young girls to the modern jobs.\nLEADERSHIP reports that out of the 180 young women that were trained, many have gotten jobs with companies within the short period.\nADVERTISEMENTSpeaking during the graduation ceremony held at The Cans Park, Maitama Abuja, the CEO of Natview Technology, the implementation partner on the Fasaha 4.0 Digital Skills Development Programme for girls and young women, Nuradeen Maidoki, said many existing jobs now will disappear in the next five years adding that the women trained are already getting place"
  },
  {
    "headline": "W/Bank, Firm Empower 180 Women IDPs, Others",
    "summarized_story": "About 180 young girls and women have been trained on fourth generation jobs.\nOut of the number, 32 were selected from the Internally Displaced Persons (IDPs).\nThe fourth generation job project sponsored by the World Bank and executed by Natview Technology, a global ICT and knowledge management firm that focuses on delivering cutting edge solutions, exposed the women and young girls to the modern jobs.\nLEADERSHIP reports that out of the 180 young women that were trained, many have gotten jobs with companies within the short period.\nADVERTISEMENTSpeaking during the graduation ceremony held at The Cans Park, Maitama Abuja, the CEO of Natview Technology, the implementation partner on the Fasaha 4.0 Digital Skills Development Programme for girls and young women, Nuradeen Maidoki, said many existing jobs now will disappear in the next five years adding that the women trained are already getting place"
  },
  {
    "headline": "Nigeria Is Prioritising Creative Industry’s Development – Katagum",
    "summarized_story": "For example, the Nigerian fashion industry, which is now a pacesetter on the African continent.\nADVERTISEMENT“A few days ago, we had the highly successful Arise Fashion Show 2021, as part of Dubai Expo’s Nigeria National Day events, which took place in Dubai, United Arab Emirates.\nThe show captivated the audience with the dynamic creativity and innovative styles of Nigerian fashion icons and pace setters,” she said.\nSome of these pacesetters will be recognised and appreciated during the entertainment events that will take place as the event proceeds,” she said.\nThe minister said at the end of the one-week event, a platform would be launched to provide master classes in business development for interested stakeholders."
  },
  {
    "headline": "2023 Presidency: Anyim is our best choice – Ebonyi PDP – Daylight",
    "summarized_story": "By CHIKA CHIMEZIEThe people’s Democratic Party, PDP, Ebonyi state chapter has resolved to swim and sink with Anyim Pius Anyim in his quest for the exalted office of Nigeria’s President.\nSpeaking after the State Working Committee meeting of the Party at Abakaliki, Nwoba Chika Nwoba, the state publicity secretary of PDP, said that the leadership of the party resolved that the choice of Anyim as presidential candidate of the party is none negotiable.\nAccording to him marketing Anyim to Nigerians is very easy because he had rescued Nigeria in the past when the country was faced with similar challenges.\nHe described Anyim as a natural stabilizer who he said Nigerians should ordinarily repose their hopes on to stabilize the current wobbling state of the nation.\nThe party he said also resolved to appeal and persuade the national working committee and national executive committee of the party to consider seriously the zoning of its presidency to South East."
  },
  {
    "headline": "2023 Presidency: Anyim is our best choice – Ebonyi PDP – Daylight",
    "summarized_story": "By CHIKA CHIMEZIEThe people’s Democratic Party, PDP, Ebonyi state chapter has resolved to swim and sink with Anyim Pius Anyim in his quest for the exalted office of Nigeria’s President.\nSpeaking after the State Working Committee meeting of the Party at Abakaliki, Nwoba Chika Nwoba, the state publicity secretary of PDP, said that the leadership of the party resolved that the choice of Anyim as presidential candidate of the party is none negotiable.\nAccording to him marketing Anyim to Nigerians is very easy because he had rescued Nigeria in the past when the country was faced with similar challenges.\nHe described Anyim as a natural stabilizer who he said Nigerians should ordinarily repose their hopes on to stabilize the current wobbling state of the nation.\nThe party he said also resolved to appeal and persuade the national working committee and national executive committee of the party to consider seriously the zoning of its presidency to South East."
  },
  {
    "headline": "Anambra: Nnewi, Onitsha grounded as traders, civil servants observe sit-at-home",
    "summarized_story": "The sit-at-home in the industrial city of Nnewi on Monday was severe as market leaders refused to open following reported threats from hoodlums.\nThe situation was mild in Onitsha with movement of residents though markets, shops and banks all locked up.\nMajority of civil servants refused to go to their offices for fear of attack.\n“IPOB told the people to disregard the sit-at-home order but their members are still killing innocent citizens.\nNnewi is like a ghost land now.”One of the civil servants told The Nation they take Monday as an extension of the weekend, adding that anybody who wanted to lose his or her life should dare the hoodlums."
  },
  {
    "headline": "Northern groups to Anyim: You’re the right man to be president in 2023",
    "summarized_story": "After the press conference, all the civil society organisations banded together in a grand ceremony and were inaugurated as Sen. Anyim Pius Anyim Support Groups in Northern Nigeria.\nAddressing Anyim as “a symbol of National Unity,” the groups said his emergence as a presidential aspirant was a prayer answered.\n“That is why we, as Nigerians, must be very careful in choosing who becomes president of Nigeria come 2023.\nThe president of Nigeria we need in 2023 must be a man of integrity and capacity with proven knowledge of how government works.\nWith Anyim as President, Nigeria will be more united and prosperous."
  },
  {
    "headline": "ICYMI: Nigerian Wilson appointed CMO of U.S. leading health group",
    "summarized_story": "A Nigerian Dr. Margaret-Mary Wilson has been appointed as the chief medical officer of UnitedHealth Group, the largest health insurance company in the United States by net premiumsWilson’s appointment is effective immediately.\nWilson’s UnitedHealth Group has a market capitalization of over $400.7 billion.\nDr. Wilson graduated from The College of Medicine, University of Ibadan, Nigeria in in 1983.\nShe moved to the United States to continue her training in Internal Medicine at New York University Downtown Hospital (1997-2000).\nIn 2008, she joined the UnitedHealth Group as a Regional Medical Director."
  },
  {
    "headline": "Fact Check: Did Sanwo-Olu disbursed N450m to higher institutions for Peace Walk?",
    "summarized_story": "It claimed that sources in government had it that the governor released N450 million for the Peace Walk and that the walk was scheduled to hold on Monday December 6, 2021.\nHe invited Falz, Mr. Macaroni, Seun Kuti and others for a Peace Walk on a yet to be announced date in December 2021.\n“In December, I will be leading A WALK FOR PEACE to herald the healing of our land.\nMr. Macaroni, Falz and Seun Kuti turned down the governor’s request for a Peace Walk.\nHow then can N450 million be released for an uncertain walk with no date yet?"
  },
  {
    "headline": "BREAKING: AEDC Workers, CBN Reach Truce Over N41 Billion Debt",
    "summarized_story": "Following the participation of important stakeholders, the National Union of Electricity Employees (NUEE) has called a halt to its current strike.\nAccording to him, the strike was called off when the Central Bank of Nigeria (CBN) pledged to settle all overdue payments within 21 days.\nFollowing the accruement of N41 billion in debt owed workers by the Central Bank of Nigeria, NUEE began an industrial action on Monday morning, December 6, shutting down operations of Abuja Electricity Distribution Company (AEDC).\nThe walkout caused power disruptions in Abuja and neighboring states covered by the distribution business, like as Nasarawa, Niger, and Kogi.\nAfter a discussion with all affected stakeholders, NUEE and the government struck an agreement."
  },
  {
    "headline": "87 University Students Expelled In Kwara For Robbery, Internet Fraud, Others",
    "summarized_story": "In the last two sessions, the Kwara State University (KWASU) has expelled a total of 87 students for alleged involvement in robbery, computer fraud, and other offenses.\nAkanbi said, “Kwara State University has zero-tolerance for indiscipline and misconduct.\n“Between 2019/2020 and 2020/2021 academic sessions, a total of 87 students were expelled from the university.\n“Exposure to negative influence outside the university campus is majorly responsible for the involvement of some students in internet fraud, substance abuse and other untoward crimes.\n“In addition, we are graduating 321 students for higher degrees in the 2019/2020 session and 96 in the 2020/2021 session."
  },
  {
    "headline": "Buhari Not Loyal To Nigeria, Will Retire To Niger Republic In 2023 – Ohanaeze Chieftain, Ibegbu",
    "summarized_story": "President Muhammadu Buhari, according to Chuks Ibegbu, a former National Publicity Secretary of the ‘Ohanaeze Ndigbo, is an unpatriotic Nigerian.\nBuhari, according to Ibegbu, is more patriotic and committed to the Niger Republic than to Nigeria, where he is president.\nBuhari will retire to the Niger Republic in 2023, according to the former Ohanaeze spokesman, who talked exclusively with DAILY POST.\nNigeria is currently building a 284-kilometer standard gauge rail connection that will allow Nigeria and Niger Republic to link.\n“As soon as his tenure ends, he will return to his country which is Niger Republic."
  },
  {
    "headline": "2023: Why Igbos May Never Produce President Of Nigeria – Bishop Azubuike",
    "summarized_story": "Athan Azubuike, the Presiding Bishop of the House of God International Church, has declared that the Igbos would always be second best and may never provide a president of Nigeria, even if they have everything it takes to govern the country in 2023.\nThis was said by the cleric during an Owerri event for young clergy.\nHe claimed that the average Igbo man is a trader rather than a politician because they lack the ability to mobilize people on a grassroots level.\nHe said,” One thing about an Igbo man is that an average Igbo person is a trader only interested in profit-making, we are not interested in working.\nYou’ll tell me it’s Rochas Okorocha, Anyim Pius Anyim, Sam Ohuabunwa among others but since Pius became the Senate President, how many times have you seen him and others in Imo State."
  },
  {
    "headline": "Breaking: Confusion as British airways fly in, out of Nigeria",
    "summarized_story": "There are indications that British Airways on Monday operated inbound and outbound flights out of the Murtala Muhammed International Airport (MMIA) Lagos.\nThe British carrier flew into Lagos with flight number – BA075 from London, Heathrow, MMIA officials revealed.\nThe eyewitness disclosed that the flight landed at the runways of the Murtala Muhammed International Airport at exactly 04.55 am.\nDetails loading…"
  },
  {
    "headline": "[VIDEO] Shame! Watch how FEPSGA officials exchanged blows, turned games to violent scene",
    "summarized_story": "The 2021 Federation of Public Service Games (FEPSGA) was marred by violence as officials exchanged blows during the opening ceremony of the ongoing event.\nBlueprint gathered that while the National Anthem was on, the officials whose names were not immediately ascertained engaged in fisticuffs in the presence of Kwara state governor, AbdulRahman AbdulRazaq.\nThe action then, threw the entire sporting competition in chaos.\nJust take a look…"
  },
  {
    "headline": "Omicron COVID-19: Red alert begins, British Airways cancels UK bound flight, passengers stranded, at Lagos Airport",
    "summarized_story": "After 21 Omicron cases linked to the country, the United Kingdom added Nigeria to its red alert with effect from Monday (4.00am).\nSources at the airport linked it to the implementation of the travel ban imposed on countries considered red flags to the new Omicron variant of COVID-19.\nAirport sources further said “the situation was to get a clearer picture of what’s happening around the Omicron variant of a thing.\nHe tweeted, “In light of the most recent data, we are taking further action to slow the incursion of the Omicron variant.\n“As our world-leading scientists continue to understand more about the Omicron variant we are taking decisive action to protect public health and the progress of our COVID-19 vaccination programme."
  },
  {
    "headline": "Omicron: UK Red Listing Nigeria Is Unjust, Discriminatory – Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Lai Mohammed, has condemned the red listing of Nigeria by the UK government over the two cases of the omicron variant of COVID-19.\nSpeaking at a news conference in Abuja, Mr Mohammed described the decision as unjust and discriminatory.\n[Read Also] Omicron: FG Expresses Disappointment Over UK Govt’s Red Listing Of NigeriaLai Mohammed’s comments are the latest reactions to the red listing which has continued to stir debates in Nigeria and across the world.\nEarlier, the Minister of Health, Dr Osagie Ehanire, expressed disappointment over the United Kingdom government’s placement of Nigeria on its red list following the detection of the COVID-19 Omicron variant.\n“From what we know about the COVID-19, there are many ways to manage it, and besides, not much is still known about the Omicron variant."
  },
  {
    "headline": "Nigeria’s Import Bill Grows As Exports Remain Oil-Dependent: NBS",
    "summarized_story": "Nigeria’s trade balance in the third quarter of 2021 amounted to a deficit of N3,023.50 billion as the value of imports continued to outpace exports, the National Bureau of Statistics said on Monday.\nThis was contained in the NBS’ Foreign Trade in Goods Statistics report.\nAnd total exports were pegged at N5,130.30 billion, which shows a 1% growth compared to the second quarter of the same year and a 71.38% growth compared to the third quarter in 2020.\n“Export in the third quarter 2021 was still oil-dependent,” the NBS said.\nHowever, the major import trading partners were China (29.95%), India (8.71%), the United States (7.35%), the Netherlands (6.80%) and, Belgium (5.32%)."
  },
  {
    "headline": "Police Begin Probe As Eight Children Die In SUV",
    "summarized_story": "The Lagos State Police Command said it is investigating the death of eight children, whose bodies were recovered in a Lexus Sport Utility Vehicle (SUV) van in the Badagry area of Lagos State.\nSpokesman of the Lagos State Police Command, CSP Adekunle Ajisebutu, confirmed the incident to Channels Television via a statement.\nCSP Ajisebutu noted that their bodies were found locked in the vehicle parked on Adelayo Street in the Jah-Michael area of Badagry.\n“Notwithstanding the report made to the Police, the Commissioner of Police, CP Hakeem Odumosu, has ordered a thorough and speedy investigation into the circumstances surrounding their death.”Multiple reports suggest that the car had a child lock feature and could only be opened from outside.\nThe children, mostly between four and six years old, were reportedly found dead when a parent was looking for her child."
  },
  {
    "headline": "‘End The Apartheid’: Adesina Condemns Omicron Travel Ban On African Countries",
    "summarized_story": "The President of the African Development Bank Group, Dr. Akinwumi Adesina, has condemned travel bans placed on African countries over the latest variant of COVID-19, Omicron.\nWhy single out African countries?\nSingling out African countries is very unfair, non-scientific, and discriminatory.\nLift bans on African countries!” Adesina said in a statement.\nwhen South African scientists discovered the new variant Omicron, we immediately took on the responsibility of informing the world."
  },
  {
    "headline": "Sylvester Oromoni: Family Hires Femi Falana Against Dowen College",
    "summarized_story": "The family of Sylvester Oromoni (Jnr), the late 12-year-old Dowen College student, has hired the firm of a foremost human rights lawyer and activist, Femi Falana, to prosecute its case against the institution over the death of their son.\nChannels Television obtained the letter written by Falana to the office of Lagos State’s Chief Coroner, requesting an inquest into the circumstances leading to the death of his client’s child.\nThe letter was dated December 6, 2021, signed by Taiwo Olawale, and addressed to the chief coroner, High Court of Lagos State.\nThe letter, titled ‘Request for Inquest into the Tragic Death of Sylvester Oromoni killed at Dowen College, Lekki, Lagos,’ said that based on the briefings by the family, the late student died as a result of injuries allegedly inflicted on him by his seniors at the school.”“Given the needless death of Sylvester Oromoni, we are compelled to request you to use your good offices to cause a coroner’s inquest to be conducted into the cause of death of this young and promising boy and make appropriate recommendations pursuant to Section 15 of the Lagos State Coroner’s Law 2007 that states that an inquest shall hold whenever a coroner is informed that the death of a deceased person within his coroner district is as a result of a death in a violent, unnatural or suspicious situation,” the letter read in part.\n“We hereby request your lordship to conduct an inquest into the circumstance surrounding this tragic death and we are confident that your lordship will accede to our request with utmost urgency.”"
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "Low turnout as Ekiti residents vote to elect Council chairmen, Councillors -",
    "summarized_story": "There was low turn-out of voters today at the Local Government Elections held in Ekiti State to determine which party will Pilot the affairs of the 16 LGA, and 20 LCDAs for the next two years.\nTVc monitored the Election around the State and reports that asides the fact that Vehicular Movement was restricted, the Voting Exercise was largely PeacefulIn most Polling units visited ,voters didn’t turn up until 10am, and before 12pm,the exercise has been concluded as party agents were nowhere to be found in most of the Wards and Units.\nThe Creation of 20 LCDAs had generated Controversies of its own in the last few months, and it is yet to be seen how the meagre resources available to Ekiti State will be able to take care of 36 Local Councils altogether."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Wayas was a special breed, his death painful",
    "summarized_story": "Former President, Olusegun Obasanjo has disclosed that the late Senate President, Dr. Joseph Wayas lived for the welfare and security of the common man.\nThe late Senate President died early hours of Wednesday, in United Kingdom after illness at age 80.\nWayas was a special breed who contributed immensely to the development of the country and became a parliamentarian in the Second Republic.\n“He was such a great patriot who had contributed his own quota to the legislative governance and overall development of Nigeria.\nHis knowledge of practices and procedures of the Senate, according to Obasanjo “helped him greatly in running the affairs of the Senate."
  },
  {
    "headline": "The State and The Parents Are Also Complacent in Sylvester Oromoni’s Death – Taiwo Akinlami",
    "summarized_story": "Since the death of 12-year-old Sylvester Oromoni Jnr, a student of Dowen College in Lekki, Lagos, several Nigerians have weighed in on the issue, calling on the authorities to conduct a thorough investigation into the boy’s death.\nThe late Sylvester, who would have turned 13 last weekend, was allegedly bullied and beaten last week by senior students of the private boarding secondary school for refusing to join a cult.\nFollowing the incident, the Lagos State Government ordered the indefinite closure of the school and has launched a probe into the death of the young boy.\nTaiwo Akinlami, a lawyer and UNICEF adviser on Child Protection, Rights Enlightenment, Education Curriculum Development and Youth Training, discusses the late Sylvester’s death, and what teachers and parents need to do to stem the prevalence of bullying and violence in schools.\nMr Akinlami is himself a survivor of dehumanising abuses as a child."
  },
  {
    "headline": "Lagos Releases Full #EndSARS Report as Panel Adjudicates on 11 of 65 Police Petitions",
    "summarized_story": "The Lagos State Government has released the two volumes of the report of the Judicial Panel of Inquiry (JPI), detailing the fallout of the #EndSARS protests in October last year.\nTagged “Consolidated Report on General Police Brutality Cases,” out of the 11 cases, eight were considered worthy of compensation while three were considered undeserving.\nOther petitioners considered by the panel included ACP Oketunji Sola, ASP Elizabeth Enadhuze, Iliyasu Muhammed, Shina Olunlade, Gbolahan Olugbemi and Taiwo Kasumu.\n“At the close of hearing and deliberation during the conference, which held on 30th October, 2021, eight of the petitions were found to be meritorious while three were not awarded compensation.\n“The panel consequently recommends that the state government approves and release the amounts awarded to the respective petitioners,” the body suggested."
  },
  {
    "headline": "Nigeria: US Foundation, ABUAD Hospital, Others Plan Free Open-heart Surgery",
    "summarized_story": "A Healthy Heart Foundation (HHF), the Afe Babalola University Multi-System Hospital and United States of America-based VOOM Foundation have gone into a partnership to carry out free heart surgeries for indigent patients in Ekiti and across Nigeria.\nThe free health intervention programme has been scheduled to take place in the ultra-modern 400-bed ABUAD multisystem hospital based in Ado Ekiti, Ekiti State.\nA statement by the Director, Corporate Affairs of Afe Babalola University, Ado-Ekiti(ABUAD), Mr. Tunde Olofintila yesterday, ABUAD Multi-system Hospital was chosen as the location for the December edition because of its sophisticated equipment.\nHe said: “This is my first visit to Ekiti and the ABUAD Hospital was my first stop.\nHe added that the HHF was set up to provide care (surgery) to indigent patients and training to willing Clinicians."
  },
  {
    "headline": "UniAbuja Mounts 24-hour Security Patrol, Deploys Hunters, Vigilantes Against Kidnappers",
    "summarized_story": "The Pro-Chancellor and Chairman of University of Abuja Governing Council, Modibbo Mohammed has disclosed that the university has mounted 24 hours security patrol not only within the campus but within the perimeters of the tertiary institution.\nThe initiative, according to him, was to prevent a repeat of the recent kidnapping that occurred at its staff quarter.\n“We have also employed additional hunters, vigilantes to patrol in areas that are not fenced because it is a very vast land,” he said.\nOn the staff quarters which was then reported to be in a deplorable state, he said: “Our staff housing is below standard.\n“The council has met the Minister of FCT and he has assured us to do something soon."
  },
  {
    "headline": "Nigeria: $10bn Train 7 Risks Suspension as Senate, Saipem Bicker",
    "summarized_story": "The Senate Committee on Local Content had last Wednesday, accused Saipem of deliberately circumventing Nigeria’s Local Content Act by sidelining Nigerian manufacturers in the bidding for the contract awards as provided for in the law.\nContractors for the project are SCD JV Consortium, comprising Nigerian affiliates of Saipem (Italy), Chiyoda (Japan) and Daewoo (South Korea.\nIt’s a warning that it’s no longer business as usual – you cannot sign Local Content Plan and do whatever you like.\nHowever, in its reaction, NLNG reiterated its full commitment to the delivery of the Train 7 Local Content Plan and the overall delivery of the project.\nHowever, NCDMB, the country’s local content agency, declined to comment on the matter as its corporate communications personnel did not respond to an enquiry sent to him as of the time of filing in this report."
  }
]