[
  {
    "headline": "Ban insecurity not Twitter, ActionAid tells FG",
    "summarized_story": "The Country Director of ActionAid Nigeria, Ene Obi, has urged the Federal Government to immediately unban Twitter, a microblogging social media platform, and rather ban insecurity and other socio-economic challenges confronting the country.\nShe made the plea on Tuesday in Abuja at the Youth Digital Engagement Project closeout and dissemination meeting.\nShe said that in Nigeria, the innovation was pioneered in partnership with Gombe State Youth Parliament, Gombe State; the African Human Development Centre, Akwa Ibom State and the Centre for Information Technology and Development in the FCT.\nOn his part, the Gombe State Youth Parliament/JONAPwD, Gombe State represented by Khalid Ahmed, said that findings showed that the COVID-19 pandemic exposed young persons and their families to hunger, poverty, insecurity and worsened access to health services in the state.\nThe findings from Gombe State data shows that three out of 10 persons with disabilities surveyed expressed that their welfare was severely affected by the COVID – 19 pandemic among others”, he said."
  },
  {
    "headline": "Continue tweeting, National Assembly minority caucus tells Nigerians",
    "summarized_story": "The joint minority caucus of the Senate and the House of Representatives has called on Nigerians to ignore the ban placed by the Federal Government on Twitter and continue to use the social media platform.\nThe National Assembly caucus, which described the ban as draconian, decried that many Nigerians are losing their sources of livelihood to the action.\n“The joint caucus, therefore, calls on Nigerians to use various opportunities offered by technology and continue making use of twitter since such does not violate any law in our country.\n“It is agonising that Nigeria and Nigerians have been losing billions of naira on a daily basis since the ban on Twitter.\nThe Caucus counsels the Federal Government to swallow its pride, accept its misdoing and go and settle whatever issue it has with Twitter instead of this resort to inflicting pains on Nigerians."
  },
  {
    "headline": "South-East SANS tasks Anyaoku, Abdulsalami, Jonathan, Bakare, others on intervention",
    "summarized_story": "By Clifford Ndujihe, Politics EditorSOME senior lawyers from the South-East geo-political zone have decried the raging killings in the Nigeria.\nIn a statement by Chief Udechukwu Nnoruka Udechukwu, SAN, they condemned ‘’unequivocally and in very clear terms the said acts of arson and the taking of human lives in the process.\nThese acts of violence are not supported and cannot be supported by the people of the South-East.\nIt is indeed worrisome that the persons or group of people responsible for the mayhem; where they are from and what their objectives are remain unknown.\nIt is equally worrisome that the management of the crisis unfortunately exhibits double standards with regard to the response of Federal security agencies in South-East vis à-vis other similarly afflicted zones."
  },
  {
    "headline": "Osun First Lady, Kafayat Oyetola emerges SGWF Chairperson",
    "summarized_story": "The First Lady of the State of Osun, Mrs. Kafayat Oyetola has been unanimously elected as the Chairperson of the Southern Governors Wives Forum (SGWF).\nShe was elected at the meeting of the Forum which held in Abuja Tuesday at the Edo State Governor’s Lodge.\nMrs. Oyetola replaces the First Lady of Edo State, Mrs. Betsy Obaseki, whose tenure ended Tuesday in a very glorious manner.\nAlso elected into the Cabinet of Mrs. Oyetola are, the First Lady of Akwa Ibom, Mrs. Martha Udom Emmanuel, elected as Vice President; the First Lady of Bayelsa, Mrs. Patience Diri elected as Secretary; First Lady of Imo State, Mrs.Chioma Ikeaka-Uzodimma, Treasurer; while the First Lady of Ogun State, Mrs. Bamidele Abiodun and First Lady of Abia State, Mrs., Nkechi Ikpeazu, emerge as Welfare Officer and PRO respectively.\nDelivering her acceptance speech, the First Lady of Osun State thanked her colleagues for the love displayed in unanimously electing her as the Chairperson."
  },
  {
    "headline": "Lagos shifts dates for 2021 public service exams",
    "summarized_story": "Lagos State GovernmentThe Lagos State Examinations Board has announced new dates for the conduct of the 2021 Public Service Examinations, which would be done through Computer Based Test (CBT).\nAccording to the Permanent Secretary, Ministry of Education, Mrs Abosede Adelaja, the examination which was earlier fixed to hold on Monday, 24 and Tuesday, 25 May, 2021, has now been rescheduled for Tuesday, 15 and Wednesday, 16 June, 2021 at the West African Examinations Council’s Testing and Training Centre, WTTC, Ogba, Lagos.\nALSO READ: Keep using Twitter, N/Assembly Joint Minority Caucus tells NigeriansShe noted that the examinations will be held for all categories of cadres in the state public service, including TESCOM and LASUBEB Officers.\nAbosede, therefore, urged all duly registered candidates to take note of the new dates and revisit the Lagos State Examinations Board Portal via www.examsboard.lagosstate.gov.ng from Tuesday, 8th June 2021, to print out their Examination Slips.\nVanguard News Nigeria"
  },
  {
    "headline": "Lawyers differ on higher pay for judicial officers",
    "summarized_story": "Justice MuhammadSome Abuja-based lawyers on Wednesday expressed divergent views on the Chief Justice of Nigeria (CJN), Justice Tanko Muhammad’s proposal to review salaries of Judicial Officers, every four years.\nNAN reports that since the has not been reviewed with effect from 2008, judges’ salaries have remained the same for about 13 years.\nMuhammad on June 3, asked the National Assembly to alter the 1999 constitution to mandate the National Judicial Council (NJC) to fix and review judges salaries every four years.\n“I support anything that will usher in sanity in our judiciary and financial independence plays a major role,” Owolabi said.\n” I personally buy into everything His Lordship put on the table here except the reduction of the number of Justices of the Supreme Court from 21 to 16."
  },
  {
    "headline": "BREAKING: Senate begins screening, confirmation of Lauretta Onochie, others as INEC Commissioners",
    "summarized_story": "THE Senate has begun the screening and subsequent confirmation of the Special Assistant, Social Media to President Muhammadu Buhari, Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission, INEC.\nRecall that President Muhammadu Buhari had in October , 2020, forwarded to the Senate for Screening and subsequent confirmation, his Special Assistant, Social Media, Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission, INEC.\nPresident of the Senate, Senator Ahmad Lawan read the letter from President Buhari forwarding the name of Onochie from Delta along side three other National Commissioners.\n“We are therefore troubled that Lauretta Onochie, a serving aide of the President who openly supports the president and his political party, has been nominated to the position of National Commissioner, INEC.\nAny INEC National commissioner should enjoy the trust and confidence of all parties concerned (Ruling and Opposition), Ms. Onochie failed this critical test with her several open confrontations with opposition elements through the media."
  },
  {
    "headline": "Ignore FG, keep using Twitter – National Assembly minority caucus tells Nigerians",
    "summarized_story": "The joint minority caucus of the National Assembly on Wednesday urged users of suspended microblogging platform, Twitter to ignore the decision of the Federal Government and continue using the medium.\nRecall that the FG had last Friday suspended the operation of Twitter in Nigeria for allegedly allowing contents that are capable of threatening the corporate existence of Nigerians.\nDespite the ban, most users have continued to access the platform via the use of Virtual Private Network (VPN).\nSome top politicians including religious leaders have defied the ban by tweeting via their handles.\nSecurity challenges: Minority caucus slams Buhari, vows to take measures if insecurity persistsThe decision of the joint caucus was contained in a statement issued by Minority Leader House of Representatives, Ndudi Elumelu, and the Senate Minority Leader, Senator Eyinnaya Abaribe."
  },
  {
    "headline": "South African woman gives birth to 10 babies to set world record",
    "summarized_story": "A 37-year-old South African woman, Gosiame Thamara Sithole, has reportedly delivered ten babies at once in Johannesburg, South Africa, breaking a record earlier set by a Malian woman, Halima Cissé, of eight babies.\nAccording to a report on Tuesday, Sithole and her husband, Teboho Tsotetsi, were expecting eight children following their doctor’s earlier report.\nTeboho Tsotetsi, who already had three children, expressed joy over the safety of his wife and her children.\nAccording to him, the pregnancy was natural, debunking the rumor that his wife conceived via in vitro fertilization, IVF.\n25-year-old woman gives birth to 9 babies at once"
  },
  {
    "headline": "Insecurity: NPC vows to continue enumeration, demarcation in Zamfara",
    "summarized_story": "The Zamfara State wing of the National Population Commission (NPC) has revealed that it has concluded Enumeration Area Demarcation in 13 local government areas of the state, saying that only Maru Local Government Area is left out.\nMutakkar Rini, said that due to the security challenges ravaging the state, the commission was not able to complete the Enumeration Area demarcation (EAD) in Maru.\n“However, the commission has provided adequate security for the demarcators and their equipment during the demarcation exercise in Maru Local Government Area,” he said.\n“Enumeration Area demarcation is not the enumeration of the population.\nHe however urged every member of the community to give the demarcators access to buildings/housing units in order to number them for demarcation exercise."
  },
  {
    "headline": "BREAKING: Senate screens Buhari’s aide, Onochie, others as INEC commissioners",
    "summarized_story": "Senate President Ahmad Lawan, on Wednesday, asked the Committee on the Independent National Electoral Commission (INEC) to screen President Muhammadu Buhari’s Senior Special Assistant on Social Media, Lauretta Onochie, and five other nominees as INEC commissioners.\nThis is coming eight months after President Buhari sent the list of the nominees to the Senate for screening.\nOther names on the list are Prof. Kunle Ajayi (Ekiti), Saidu Ahmad (Jigawa), Prof. Muhammad Kallah (Katsina), Dr Baba Bila (North-East) and Prof Sani Adam (North- Central).\nThe Senate INEC panel, which has Senator Kabiru Gaya as Chairman, has a month to conclude the screening and report back to the red chamber at plenary.\nDetails later…Igbo leaders responsible for insecurity in South-East – Buhari’s aide"
  },
  {
    "headline": "Minibus operators blast Uzodinma over order to repaint vehicles",
    "summarized_story": "Operators of minibuses in Owerri, the Imo State capital, have described the 14-day ultimatum given by the state government to paint their vehicles as wicked and insensitive.\nThe order was issued through the office of the Special Adviser to the Governor on Special Duties, Chinasa Nwaneri.\nThe release had ordered the cab drivers in the state to go to the Ministry of Transport to do the necessary or risk losing their vehicles after the 14-day ultimatum.\n“The government is either insensitive or wicked to the cab drivers.\n“No responsible government would give its commercial cab operators 14 days to paint their vehicles in the prevailing security economic crisis."
  },
  {
    "headline": "Biden visits Europe on first overseas trip as U.S. President",
    "summarized_story": "Agency ReporterU.S. President Joe Biden embarked on his first overseas trip on Wednesday where he will meet European partnersThe president and First Lady Jill Biden are scheduled to meet U.S. soldiers in the English county of Suffolk to kick off their first foreign trip since taking office in January.\nADVERTISEMENTOn Thursday, Biden was due to meet British Prime Minister Boris Johnson near Cornwall, where the G7 summit taking place from Friday to Sunday, on the fringes of which Biden was expected to meet German Chancellor Angela Merkel, among other G7 leaders.\nREAD ALSO: Biden brings more class warfare to foreign policyAt the end of their visit to Britain, the U.S. president and the first lady would be received by Queen Elizabeth II at Windsor Castle near London on Sunday.\nOn Monday, Biden planned to attend the NATO summit in Brussels, where a top-level meeting with EU representatives is scheduled for the following day.\nOn Wednesday of next week, Biden would be expected to hold an eagerly awaited summit with Russian President Vladimir Putin in Geneva before the U.S. president returned to Washington."
  },
  {
    "headline": "PHOTOS: Buhari receives first made-in-Nigeria cell phone",
    "summarized_story": ""
  },
  {
    "headline": "I’m your biggest fan, Wizkid tells Cavemen",
    "summarized_story": "By Ekaete BasseyGrammy award winner Wizkid has opened up on the highlife band The Cavemen, noting he is a huge admirer of their work and undoubtedly their biggest fan.\nBig Wiz, while appreciating the Cavemen brothers, also hinted that they work together to create some great vibes for their fans.\nIn the video, the “Holla at Your Boy” crooner can be seen hailing and having fun with the Cavemen brothers.\nHe then proceeded to say: “Bro mehn, to be honest with you, I’m your biggest fan.\nBiggest, biggest, biggest fan."
  },
  {
    "headline": "Thousands of nurses on strike in New Zealand",
    "summarized_story": "Agency ReporterAbout 30,000 nurses in New Zealand walked off their jobs on Wednesday in a nationwide eight-hour strike after negotiations with the government for better pay and working conditions failed.\nThe strike action came after the New Zealand Nurses Organisation (NZNO) rejected a 1.4 per cent pay hike proposed by the District Health Board earlier this week.\nThe government said the nurses’ demands amounted to a 17 per cent increase that it can’t afford, but pledged to continue negotiations.\nThousands of nurses marched on the streets holding placards, while others gathered at parks and outside hospitals around the country.\nNurses have complained of being underpaid and burnt out, with conditions worsening with the arrival of the COVID-19 pandemic."
  },
  {
    "headline": "US calls for immediate reversal of Twitter ban",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States Government has called for the immediate reversal of the suspension of Twitter’s operations in Nigeria.\nUnited States Agency for International Development (USAID) Administrator Samantha Power said the suspension was nothing more than state-sanctioned denial of free speech.\nIn a Facebook post by the United States Diplomatic Mission to Nigeria, Power said the suspension should be reversed immediately.\n‘There are nearly 40 M Twitter users in #Nigeria, and the country is home to Africa’s largest tech hub.\nIn the joint statement, the five missions expressed disappointment over the Federal Government’s decision to place a ban on Twitter’s operations in Nigeria."
  },
  {
    "headline": "Insecurity: Ohanaeze to meet with northern elders",
    "summarized_story": "From Stanley Uzoaru, OwerriWorried by the alarming insecurity in South East and Nigeria in general, Chairman of Ohaneze Ndigbo Council of Elders, Chief Emmanuel Iwuanyanwu, has disclosed that he is spearheading a meeting of the northern elders and Ohanaeze Ndigbo to fashion out a solution to the problems.\nIwuanyanwu while describing the unfolding events in the country as extremely shocking and completely beyond any expectation and human imagination has called on the President General of Ohaneze Ndigbo, Professor George Obiozor to arrange for the meeting immediately .\nIwuanyanwu has also commiserated with the families of the late former political adviser to former president, Goodluck Jonathan, Ahmed Gulak over his gruesome murder in Owerri.\n“On behalf of Ohaneze Ndigbo Council of Elders expressed deep sympathy to the family of our brother and friend Dr. Ahmed Gulak, the Arewa and other northern groups, the Government and People of Adamawa State including his friends and associates.\nIwuanyanwu also commiserated with all those who lost their relations as a result of insecurity across the country."
  },
  {
    "headline": "Buhari, Obasanjo, Abdulsalami, others meet over insecurity",
    "summarized_story": "Burning national issues including unity of the country, security, peace, integration, economic revitalisation and development would be on the table when the Interfaith Initiatives for Peace meet in Abuja tomorrow.\nObasanjo had on Sunday asked Nigerians to cry to God for a solution to the security crisis plaguing the country.\nWe have to cry out to God to help us.”Meanwhile, Onaiyekan has urged Nigerians to put elected leaders on their toes and hold them accountable.\nAbimbola, represented by Mr Felix Pwol, a Director at the centre, said it was imperative for government to focus on achieving national unity, national security, women and youth development as well as civil society and government partnership.\nParticipants were drawn from the six states of the North-Central geo-political zone: Benue, Kogi, Kwara, Nassarawa, Niger and Plateau."
  },
  {
    "headline": "Igangan massacre won’t happen again, says Makinde",
    "summarized_story": "From Oluseye Ojo, IbadanGovernor Seyi Makinde of Oyo State, yesterday, at Igangan, vowed to do everything possible to ensure massacre by criminal herdsmen never happen again.\nAddressing members of the community, he said: “I promise you this is the last time anything like this will ever happen here.\n“So, looking at the federal security agencies here in Oyo State, they have to get clearance from the federal.\nMakinde said the people should appreciate that “state policing is a sure cure to our national development challenges.\nThe government at the centre serves as a coordinator of assets but does not wield as much power,” Makinde said.."
  },
  {
    "headline": "Kalu cautions masterminds of insecurity in South East",
    "summarized_story": "Senate Chief Whip and former Abia governor, Orji Uzor Kalu, has called for restraints from masterminds of the insecurity in the South East, warning that the repetition of the 1967 genocide would not be tolerated.\nThe former governor said insecurity in the South East was strange, saying Igbo were not known for burning homes to punish enemies.\nOn the killing of innocent young people, Kalu called on the security agencies to desist from harassment, molestation and killing of innocent young people in the region.\nHe said he was worried that some security agents have been reported to be killing innocent souls.\n“It is better to thoroughly conduct your investigations and avoid the indiscriminate killings of young innocent Igbo men."
  },
  {
    "headline": "W’Bank Raises GDP Growth Forecast for Nigeria to 1.8%",
    "summarized_story": "But the World Bank hinged its positive prediction for Nigeria on the expectation that crude oil prices would remain high as well as the government effecting structural reforms and flexible exchange rate management.\n“Despite improvement, COVID-19 has continued to have adverse impacts on health, schooling, investment, and economic growth,” it stated.\nIt stated that while some countries (Ghana, Nigeria, South Africa) are presently upgrading national vaccine distribution systems, procurement and logistical hurdles in many other countries could slow vaccinations.\nA stronger-than-expected rally in metal and oil prices could boost revenues,” it stated.\nThe projected expansion would make 2021 the fastest year of growth since 1973’s 6.6 per cent."
  },
  {
    "headline": "Suspension to Remain Indefinitely Until Twitter Shows Remorse, Says FG",
    "summarized_story": "According to him, since the suspension of Twitter’s operations in Nigeria last Friday, the company has not reached out to the federal government for dialogue.\nHe said when the federal government complained, Twitter said the propagandists had not violated its rules.\nHe stated that even after that, Kanu used Twitter to ask his followers to kill Nigerian soldiers and police personnel and they obeyed.\nSuspension Unprofessional, Ill-advised, Says Catholic ChurchThe Catholic Secretariat of Nigeria (CSN) has described the suspension of Twitter operations in Nigeria as ill-advised.\nThe praise comes after it was announced earlier this month that Trump’s Facebook and Instagram would remain banned until early 2023."
  },
  {
    "headline": "Video: President Macron Slapped in the Face During Visit to Southeastern France",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Senate in Close-door Session",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe Senate at the resumption of plenary on Tuesday went into a close-door session.\nThe upper chamber after the opening prayer was said by the President of the Senate, Dr Ahmad Lawan, dissolved into an executive session.\nThe outcome of the meeting is expected to be made public by Lawan later before the Senate plenary resumes.\nDetails later..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "News in Photographs: Buhari Receives Made In Nigeria Phone, as FEC Meets",
    "summarized_story": "By Deji ElumoyeThe weekly Federal Executive Council (FEC) meeting is holding at the State House, Abuja with President Muhammadu Buhari presiding.\nAt the commencement of the meeting, the President was presented with locally manufactured phone by the Minister of Industry, Trade and Investment, Otunba Niyi Adebayo.\nThose attending the Cabinet meeting holding at the Conference Hall of the First Lady include Vice President Yemi, Chief of Staff to the President, Prof Ibrahim; Secretary to the Government of the Federation, Boss Mustapha; Information and Culture Minister, Alhaji Lai Mohammed and his Finance, Budget and National Planning counterpart, Zainab Ahmed, Attorney-General of the Federation and Minister of Justice, Mr Abubakar Malami and National Security Adviser, Major General Babagana Monguno (rtd).\nOther Ministers are attending the meeting virtually from their respective offices in Abuja.\nSee ImagesShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "REVEALED: How Malami Downloaded VPN, Logged Into Twitter To Deactivate Account",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami (SAN), on Tuesday logged into Twitter and deactivated his account using Virtual Private Networks (VPN), a screenshot posted by the minister has showed.\nMalami had on Saturday threatened to prosecute Nigerians who were still using VPN to access the micro blogging platform.\nVPN is a connection that allows users to establish a protected network connection when using public networks.\nBREAKING: Nigeriaâ\u0080\u0099s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account | Sahara Reporters https://t.co/SQF0PBodx2 pic.twitter.com/D3zHennjvF — Sahara Reporters (@SaharaReporters) June 8, 2021Malami took to his Facebook page on Tuesday, posting a screenshot from the Twitter app showing his account has been deleted.\nDespite his threat, many Nigerians have been using VPN to access Twitter."
  },
  {
    "headline": "REVEALED: How Malami Downloaded VPN, Logged Into Twitter To Deactivate Account",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami (SAN), on Tuesday logged into Twitter and deactivated his account using Virtual Private Networks (VPN), a screenshot posted by the minister has showed.\nMalami had on Saturday threatened to prosecute Nigerians who were still using VPN to access the micro blogging platform.\nVPN is a connection that allows users to establish a protected network connection when using public networks.\nBREAKING: Nigeriaâ\u0080\u0099s Attorney-General Of Federation, Malami, Violates Twitter Ban To Deactivate His Account | Sahara Reporters https://t.co/SQF0PBodx2 pic.twitter.com/D3zHennjvF — Sahara Reporters (@SaharaReporters) June 8, 2021Malami took to his Facebook page on Tuesday, posting a screenshot from the Twitter app showing his account has been deleted.\nDespite his threat, many Nigerians have been using VPN to access Twitter."
  },
  {
    "headline": "Insecurity in Imo: All 'Imolites' are guilty, says Maurice Iwu",
    "summarized_story": "Maurice Iwu, former chairman of the Independent National Electoral Commission (INEC), says all indigenes of Imo are to blame for the security challenges in the state.\nAdvertisementIn recent months, there have been attacks on security operatives and government property in Imo.\nAdvertisementReacting to the insecurity in the state, Iwu, an Imo indigene himself, said the blame for the security crisis should be put at the feet of all residents of Imo.\nHe said the silence and complicity of Imo indigenes allowed the insecurity to fester.\n“We’re guilty, all of us in Imo state, are guilty for allowing such things to happen."
  },
  {
    "headline": "Insecurity in Imo: All 'Imolites' are guilty, says Maurice Iwu",
    "summarized_story": "Maurice Iwu, former chairman of the Independent National Electoral Commission (INEC), says all indigenes of Imo are to blame for the security challenges in the state.\nAdvertisementIn recent months, there have been attacks on security operatives and government property in Imo.\nAdvertisementReacting to the insecurity in the state, Iwu, an Imo indigene himself, said the blame for the security crisis should be put at the feet of all residents of Imo.\nHe said the silence and complicity of Imo indigenes allowed the insecurity to fester.\n“We’re guilty, all of us in Imo state, are guilty for allowing such things to happen."
  },
  {
    "headline": "UN says Nigeria’s population has hit 211m",
    "summarized_story": "The United Nations Population Fund (UNFPA) has estimated Nigeria’s population to be 211.4 million.\nIn 2020, the UN estimated Nigeria’s population to be 206.1 million and put the life expectancy at 55 years.\nAccording to the UNFPA report, Nigeria’s population increased by 2.6 percent from 2015 to 2021.\nIn December 2020, the NPC announced that Nigeria’s population is estimated to be 206 million.\nWe will suggest a date to Mr President and we are targeting maybe 2022.”The last population census in Nigeria was conducted in 2006."
  },
  {
    "headline": "UN says Nigeria’s population has hit 211m",
    "summarized_story": "The United Nations Population Fund (UNFPA) has estimated Nigeria’s population to be 211.4 million.\nIn 2020, the UN estimated Nigeria’s population to be 206.1 million and put the life expectancy at 55 years.\nAccording to the UNFPA report, Nigeria’s population increased by 2.6 percent from 2015 to 2021.\nIn December 2020, the NPC announced that Nigeria’s population is estimated to be 206 million.\nWe will suggest a date to Mr President and we are targeting maybe 2022.”The last population census in Nigeria was conducted in 2006."
  },
  {
    "headline": "APC lawmaker: Suspension of Twitter yielding results",
    "summarized_story": "Yinusu Ahmed, member of All Progressives Congress (APC) caucus in the house of representatives, says the suspension of Twitter by the Nigeria government is yielding positive results.\nAdvertisementHe said the activities of Nigerians on the microblogging platform have been heating up the polity, but that the dust is settling as the suspension lingers.\nI think Nigerians should be able to wait for 10 days for things to be put into perspective rather than allow Twitter to run freely.\nThat suspension has started yielding results.\n“I think if the president feels like what he wrote was right, he should take up the matter with Twitter,” he said."
  },
  {
    "headline": "Nigerian lawmakers summon Lai Mohammed for questioning over Twitter ban",
    "summarized_story": "Nigeria’s House of Representatives on Tuesday passed a resolution to investigate the legality of the suspension of Twitter in the country.\nThe committees are expected to question Lai Mohammed and report to the House within 10 days to guide further action by the lawmakers on the matter, Gbajabiamila said.\nThe U.S. social media giant has said it is “deeply concerned” by the ban.\nNigerians continue to use Twitter, however, thanks to Virtual Private Networks (VPNs) that have helped bypass the ban.\nThe country’s broadcast regulator has also ordered television and radio stations to suspend their use of Twitter."
  },
  {
    "headline": "WhatsApp won’t restrict users who don’t agree to its privacy policy",
    "summarized_story": "WhatsApp recently announced that it will not be limiting access to the features of the app for those who reject the new privacy policy and disagree to let it share its data with Facebook and other third-party companies.\nThe initial deadline for the acceptance of its privacy policies was set to February 8, 2021, but after receiving backlash from its global users and dealing with media scrutiny, Facebook decided to extend the deadline to May 15, 2021.\nUsers will be “able to receive calls and notifications” but they “won’t be able to read or send messages” anymore.\nDuring this period, Whatsapp’s policy related to inactive users will apply.\nWhat’s nextAlthough users will no longer lose access to the app if they don’t agree to the new terms of service agreement, users will still get reminded about the new policy if they haven’t accepted it."
  },
  {
    "headline": "South African mobility startup WhereIsMyTransport raises $14.5million for expansion",
    "summarized_story": "South African Mobility startup WhereIsMyTransport has raised a $14.5 million Series A extension round to continue its expansion across emerging markets.\nFormed in 2016, WhereIsMyTransport is a big data platform that provides sustainable mobility solutions in emerging markets.\nWith this new investment, WhereIsMyTransport plans to continue its expansion across emerging markets, with a launch in Peru planned for later this year.\nMobility in emerging markets via public transportation is often a hassle – it’s inefficient and time-consuming.\nThe successful expansion of WhereIsMyTransport would reduce friction in the movement of people and goods across Africa and other emerging markets."
  },
  {
    "headline": "EASYSHARE.AFRICA LAUNCHES PLATFORM USING SAFE, LOW COST, CRYPTOCURRENCY TECHNOLOGY",
    "summarized_story": "By using innovative low-cost crypto-technology to drastically cut transaction fees, Easyshare will also allow consumers to perform micro-transactions safely, securely and affordably.\nSpeaking on the launch of the beta platform, Ben Onuoha Co-founder and Head of Partnerships & Community at EasyShare.Africa said, “Easyshare was born out of a lot of research.\nUsers can seamlessly send money to a mobile wallet or bank account using crypto in five easy steps.\nThe Easyshare.Africa platform is crowdsourcing to meet its expansion plansIn addition to serving ordinary consumers, Easyshare.Africa is committed to extending its impact, by pioneering the world’s first decentralized network of verified peer to peer crypto-powered remittance agents.\nCurrent crypto remittance systems and peer to peer platforms use centralized escrows to guarantee settlement."
  },
  {
    "headline": "PlugnPlay IoT To Hold Asset Tracking 101 Seminar For Top Nigerian Business Leaders",
    "summarized_story": "Digital transformation has reinforced the importance of investing in the Internet of Things (IoT) technology for asset monitoring, data collection, and decision making, to maximize value from operational assets in advanced and emerging economies.\nLagos, Nigeria: Today, PlugnPlay IoT, a subsidiary of NovaTrack Limited announced that it will be organizing a private Asset Tracking seminar in Lagos, Nigeria that will discuss the importance, necessity, and the ‘how’ of adopting the use of the Internet of Things (IoT) technology for business advancement, especially in emerging economies through digital transformation focused on asset management and tracking.\nAs rightly stated by PlugnPlay IoT, “the recent security challenges in major African economies, especially Nigeria highlight the need for increased security protocols for valuables.\nThis is why PlugnPlay IoT has put together the Asset Tracking 101 Seminar to present industry leaders who participate with the unfair advantage of business asset tracking with IoT technology.\nAbout PlugnPlay IoTPlugnPlayIoT is an IoT service provider, powered by NovaTrack Ltd, that empowers system integrators, technology experts, software developers and entrepreneurs to build and scale their own IoT business verticals at a relatively low cost."
  },
  {
    "headline": "Why investors may demand higher yield for Nigeria’s Eurobond amid Twitter ban",
    "summarized_story": "The N90.7 million ($250,600) Nigeria is losing per hour for banning Twitter is not the only cost Africa’s largest economy is paying for shutting down the microblogging platform.\nNigeria could be paying more to investors when it goes to the international market to issue the planned $3 billion later this year.\nThe ban, according to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "No respite for telcos as more subscribers, broadband drop in April",
    "summarized_story": "No respite for telcos as more subscribers, broadband drop in AprilThe lifting of the SIM registration ban in April failed to lift the fortunes of mobile network operators in Nigeria as the sector lost 3.7 million voice subscribers in that month.\nThe telecommunication sector’s total mobile subscription declined to 188.3 million in April from 192 million subscriptions in March.\nThe loss means the sector has…"
  },
  {
    "headline": "Twitter ban increases Nigeria’s investment hostility profile",
    "summarized_story": "The Federal Government of Nigeria has announced a ban on Twitter, a leading microblogging platform, using a tweet on Friday, June 4, 2021.\nIn what seems like a kickback, the Federal Government announced a country-wide ban on using the highly subscribed platform under the guise that it “threatens Nigeria’s corporate existence”.\nThis move has so far cost the country in terms of daily economic losses and investment potentials.\nThis choice, made by Twitter Inc., is without prejudice to Nigeria’s 40 million Twitter users, while Ghana’s entire population as of January 2021 is 31.4 million.\nThis firewall system will grant the Federal Government complete control over the Nigerian internet space to control all social media platforms, including Facebook and Twitter, just as China currently does."
  },
  {
    "headline": "Obaseki urges citizens’ ownership, warns against destruction of government property – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Group offers to comb highways for criminal hideoutsBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called on citizens to take ownership of government property in their localities, to sustain ongoing development across the state.\nObaseki said this when he received leaders and elders of Ekosodin community in Ovia North-East Local Government Area of the state, who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha, said his administration will continue to work for the people of Edo State.\nIt has brought development to the people of Ekosodin Community in Ovia North-East.”In another engagement, Odolevbo O’sioba Initiative, led by the Commandant General, Comr.\n“We will continue to collaborate in the area of security, as we have made great impact in the area of keeping the state safe and peaceful,” he said."
  },
  {
    "headline": "Obaseki explores options to accelerate completion of Benin",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… plans new road, rail line to link Benin River Port to OkpellaBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, is exploring a number of options to speed up the completion of Benin-Auchi Road, which has been in a state of disrepair for years.\nOne of the options being considered is a proposal to take over the management and maintenance of the Benin-Auchi Road under the Federal Government’s Highway Development and Management Initiative (HDMI) being promoted by the Federal Ministry of Works and Housing.\nWe are designing a new road from the Benin River Port to Okpella.\nHopefully, one day in our development plan, we would be able to put a rail link there,” he added.\nObaseki further noted that, “When you try to get a flight to Edo State now, it becomes difficult because a lot of people are trying to utilize the business friendly environment created by this administration.”..."
  },
  {
    "headline": "NFF Gives State FAs 10 Days To Submit Aiteo Cup Champions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Football Federation, NFF, organiser of Aiteo Cup Competition has given the 36 State and FCT Football Associations ten days to submit the name of club that will represent them in the 2021 National Aiteo Cup Competition.\nThis is contained in a statement dated 4th June and signed by the Secretary of the Organising Committee, Wilfred Onaji, which reads, “The Organising Committee of Nigeria Football Federation NFF on the directive by CAF all countries should submit by 30th June 2021 names of the teams that will take part in the various CAF Competitions.\n“In view of the above, the Committee concluded that all States Football Association should produce one representative latest 14 of June, 2021.\nA national draw will be held at a date that will be communicated for the 37 teams that qualified “."
  },
  {
    "headline": "Football Enthusiasts condemn Attack On Bendel Insurance Players During League Game – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Football enthusiasts in Yenagoa, the Bayelsa State capital have condemned the unruly behavior exhibited by fans of Remo Stars Football club against players and officials of Bendel Insurance FC in a matchday twenty one group B2 game of the Southern conference of the Nigeria National League, NNL played at Ikenne Ogun state on Sunday.\nRemo Stars who were at home allowed their supporters to beat up two Bendel Insurance players and secretary Charles Ihimekpan with other players seen escaping the stadium through the fence in a video that went viral on Sunday night.\nHe called on the Nigeria Football Federation and organizers of the league to sanction Remo stars FC and perpetrators of such violence in order to curtail the acts of hooliganism and insecurity in match venues across the country.\nAnother football enthusiast, Alaowei Mieseigha called on the league body to banish Remo Stars from Ikenne as well as place a fine on the team to serve as deterrent to others.\nAlso, Raphael Okolai noted that if strong measures were not taken against Remo stars, fans would continue to molest visiting teams whenever the home team fails to win a match on their ground."
  },
  {
    "headline": "JUST IN: Eight months after, Senate moves to screen Lauretta Onochie",
    "summarized_story": "ADVERTISEMENTThe Senate is set to commence screening of presidential aide, Lauretta Onochie, who was appointed as a commissioner for the Independent National Electoral Commission (INEC).\nThe Senate President, Ahmad Lawan, on Wednesday, directed the Senate Committee on INEC to commence screening.\nMs Onochie was appointed by President Muhammadu Buhari in October 2020 as an INEC resident electoral commissioner to represent Delta State.\nAlthough Ms Onochie was appointed alongside three other nominees, her appointment generated outrage, with some Nigerians describing it as unconstitutional.\nThis is, however, not the case with Ms Onochie, who had openly displayed partisanship and total support for the president and the All Progressives Congress in general."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Public uproar over killings in S/E, twitter ban",
    "summarized_story": "Social media, especially, Twitter, had provided a platform where many take to, to pour out their anger; to agree and disagree.\n“How do you ban Twitter which is a means of peaceful engagement?\nThe regulation of social media is the real aim of all of this.\nFormer Aviation Minister, Femi Fani-Kayode, on his part alleged that there is a plot to shut down social media.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms."
  },
  {
    "headline": "OAU first Nigerian university to distribute electricity – VC, Ogunbodede",
    "summarized_story": "…Unveils 60th anniversary logoBy Sunday Oguntuyi, OsogboThe Vice Chancellor of Obafemi Awolowo University (OAU), Ile-Ife, Prof. Eyitope Ogunbodede says the institution has obtained Marketing License to distribute electricity to the university community.\nOgunbodede said the Rural Electrification Agency (REA) 8.03MW power project for the supply of electricity to the University is on-going and almost completed.\n“The University has processed and obtained from the Transmission Corporation of Nigeria the Marketing License as Electricity distributor, the first Nigerian University to enjoy the privilege.\n“The aim is to reduce the economic burden of high tariff and ensure regular electricity supply to enhance its various academic activities.\nThe 60th anniversary logo of the university was also unveiled at the conference."
  },
  {
    "headline": "Bandits demand N150m for 156 kidnapped Niger students",
    "summarized_story": "Bandits who abducted 156 pupils of Salihu Tanko Islamiyya School in Tegina town of Rafi Local Government Area of Niger State, have reduced the ransom they earlier demanded to N150 million.\nThe bandits who abducted the children 10 days ago, had initially asked for a N110 million ransom, which was later hiked to N200 million before now reducing it to N150 million.\nThe Headmaster of the school, Alhaji Abubakar Alhassan, confirmed the new development, saying both the parents and the school authorities are confused on the next step to take.\n“We are pleading with the federal and state governments to come to the assistance of these parents.\nThe State Deputy Governor, Alhaji Ahmed Mohammed Ketso, said to journalists that “Niger State Government is negotiating the release of the abductees and we are confident that in no distant time the young children will be united with their parents."
  },
  {
    "headline": "World Bank raises Nigeria’s growth forecast to 1.8%",
    "summarized_story": "The World Bank has said Nigeria’s economy is expected to expand at a moderate rate of 1.8 percent this year and edging up to 2.1 percent in 2022.\nThe bank stated this in its June 2021 Global Economic Prospects, titled, “Global Recovery Strong but Uneven as Many Developing Countries Struggle with the Pandemic’s Lasting Effects”, released on Tuesday.\nIn January, World Bank had projected a 1.1 percent growth rate for the country in 2021 after the COVID-19-induced sharp recession in 2020.\n“While there are welcome signs of global recovery, the pandemic continues to inflict poverty and inequality on people in developing countries around the world,” David Malpass, World Bank Group president, said.\n“Globally coordinated efforts are essential to accelerate vaccine distribution and debt relief, particularly for low-income countries."
  },
  {
    "headline": "Tambuwal Urges Students Abroad To Be Steadfast, Disciplined",
    "summarized_story": "Governor of Sokoto State Aminu Tambuwal has urged Nigerian students studying abroad to be steadfast and disciplined while pursuing their studies.\nThe advice is contained in a statement signed by Tambuwal’s special adviser on media and publicity, Malam Muhammad Bello yesterday in Sokoto.\nThe governor was quoted as giving the advice in Khartoum, Sudan where he attended the graduation of medical and health students sponsored by the Sokoto State government.\nAccording to him, the students’ good conducts, hallmark of the typical upbringing of people of Sokoto, reflected in their performance, which makes the state proud.\nA similar award was given to Tambuwal by one of the universities from which the students graduated."
  },
  {
    "headline": "BREAKING: Senate Moves To Confirm Onochie, 5 Others As INEC Commissioners",
    "summarized_story": "The Senate has commenced a move to comfirm President Muhammadu Buhari’s social media aide, Lauretta Onochie, and five others as national commisioners in the Independent National Electoral Commission (INEC).\nOnochie alongside others were nominated and forwarded to the Senate eight months ago without any further action by the latter.\nThe nomination was sent to the Senate on October 12, 2020 but was not acted upon owing to partisanship concern.\nOther nominees are Prof Muhammad Sani Kallah (Commissioner, Katsina); Prof Kunle Cornelius Ajayi (Commissioner, Ekiti); Said Babura Ahmad (Commissioner, Jigawa); Prof Sani Muhammad Adam (Commissioner, North- Central) and Dr Baba Bills (Commissioner, North- East) while Onochie will represent Delta State.\nBut before seconding the motion raised by the Senate leader, the Minority leader of the Senate, Enyinnaya Abaribe, raised concerns about Buhari’s aide, Onochie, who is a card-carrying member of the ruling APC."
  },
  {
    "headline": "Biotechnology, Media Critical To Agricultural Growth – Kano Deputy Gov",
    "summarized_story": "Deputy governor of Kano State, Dr Nasiru Yusuf Gawuna, has said biotechnology and the media hold the key to strengthening Nigeria’s agricultural growth and development.\nHe stated this at the opening ceremony of a two-day retreat organised by the Open Forum on Agricultural Biotechnology (OFAB) and the National Biotechnology Development Agency (NABDA) for journalists, farmers and extension workers in Kano State.\nThe deputy governor said Nigeria’s agricultural prowess was being consistently weakened by some age-long practices and factors like over reliance on rain-fed agriculture, smallholder land holding, poor planting material, low fertiliser application, and the weak agricultural extension system in the country.\nGawuna noted that Nigeria could leapfrog other countries to become major supplier of agricultural products with timely deployment and adoption of biotechnology and getting the media to communicate it rightly.\nAlso, when Nigerian farmers are getting 13 tons for cassava, others are getting 40 tons."
  },
  {
    "headline": "Police Rescue Abandoned Child In Yobe",
    "summarized_story": "Yobe police have confirmed rescuing an abandoned boy of about one-year-old in Nyanya ward, Damaturu local government area of the state.\nIn a press statement signed by the spokesman of the command, Dungus Abdulkarim, and made available to LEADERSHIP in Damaturu, he stated that, “The boy was recovered by the police divisional headquarters on June 6.”According to the statement, “ An unknown woman handed over the boy to a passerby almajiri to take him to one Maman Faruk at a particular house.”He explained that the boy is presently in the custody of the state social welfare department, while the command had commenced investigation on the matter.\nHe urged the residents to be vigilant and report any suspicious movement or person around their neighbourhood to security agents for further investigation.\nHe appealed to the public to assist the command to identify the parents of the child in order to reunite them with the boy."
  },
  {
    "headline": "Lagos Fines 27 Schools For Exam Malpractice",
    "summarized_story": "The Lagos State government has fined 27 private schools N500,000 each, totalling N13.5 million payable to the state government’s coffers, as punishment for various examination malpractices during the year 2020 school-based West African Senior School Certificate Examination (WASSCE) conducted by the West Africa Examination Council (WAEC).\nThe government through its education ministry’s Office of Education Quality Assurance (OEQA) made the decision following its conclusion of investigations, having set up two separate panels of enquiry to investigate the indictment by the examination body and 19 other schools for allegation of involvement in examination malpractices and document falsification during the year 2020 SSCE and the Basic Education Certificate Examination (BECE) conducted by the state government for the junior secondary school 3 (JSS3) students.\nThe state government in a statement signed by the Head, Public Affairs, OEQA, Olaniran Emmanuel explained that the Director-General, Office of Education Quality Assurance, Mrs Abiola Seriki-Ayeni, led one panel that investigated 27 schools, while the state’s Teaching Service Commission (TESCOM), Mrs Elizabeth Ariyo, headed the panel where 19 schools were investigated.\nOlaniran said that while letters of advice and warning were issued to some of the schools, others were told to pay undisclosed fines as a punishment."
  },
  {
    "headline": "BREAKING: Senate screens Lauretta Onochie, five others as INEC commissioners despite public outcry",
    "summarized_story": "On Wednesday, Senate President Ahmad Lawan directed that the appointments of Ms. Lauretta Onochie and five other INEC commissioners be screened for confirmation by the Committee on the Independent National Electoral Commission.\nhanded the list of nominees to the Senate for consideration.\nThey also faulted the idea of making Onochie, a card-carrying member of the All Progressives Congress as an INEC Commissioner to represent Delta State on the board of the commission.\nProf. Muhammad Kallah (Katsina); Prof. Kunle Ajayi (Ekiti); Saidu Ahmad (Jigawa); Prof Sani Adam (North-Central); and Dr Baba Bila are among the others on the list (North-East).\nSenator Kabiru Gaya, who chairs the Senate INEC panel, has four weeks to complete the screening and report back to the red chamber in plenary."
  },
  {
    "headline": "I can’t guarantee security in Imo alone, says Uzodimma —",
    "summarized_story": "Governor of Imo State, Hope Uzodinma, has stated that if left alone, he will be unable to ensure security in the state.\nFormer political office holders, he claims, have issues to answer if they fail to speak out against the activities of troublemakers.\nDespite the fact that insecurity exists throughout Nigeria, he added that the authorities in Imo were doing their utmost to address the matter.\n“So far, the situation is relatively okay in Imo State than it was.\n“It is not only Imo that has security challenges."
  },
  {
    "headline": "BREAKING: PDP Lawmakers Challenge Buhari, open",
    "summarized_story": "The Peoples Democratic Party (PDP) in the National Assembly has launched a Twitter account, defying the administration of Muhammadu Buhari’s ban on the microblogging network.\nThis comes only hours after members of the party’s House of Representatives members staged a walkout over the Nigerian government’s actions.\nThe members staged a walkout on Tuesday after Speaker of the House Femi Gbajabiamila ruled their caucus leader Kingsley Chinda out of order.\nChinda has asked the House to press the Federal Government to lift the restriction while the House investigates its constitutionality.\nMembers of the PDP caucus in the House, according to Chinda, would continue to tweet despite the restriction."
  },
  {
    "headline": "BREAKING: FG commissions Lagos-Ibadan rail line",
    "summarized_story": "All is now set for Thursday’s official commissioning of the Lagos-Ibadan rail line, by President Muhammadu Buhari.\nMinister of Transportation, Rotimi Amaechi, who is already in Lagos for the big event, Wednesday, undertook a last minute inspection tour of the terminals and sub-stations along the 156km route, preparatory for the big event.\nAt the Apapa port, event planners could be seen putting make-shift structures in place ahead of the commissioning as the Minister expressed satisfaction with the level of work done.\nResidents of adjourning communities trooped out enmasse as they waved to Amaechi who undertook a train ride across all the stations, inspecting terminals, underpasses and overpasses.\nBuilt by the China Civil Engineering Construction Corporation, CCECC at a cost of $1.5 billion, the double-track standard gauge has 10 sub-stations between Lagos and Ibadan."
  },
  {
    "headline": "5th Columnists and the soul of NISER by Dapo Bruce",
    "summarized_story": "Alongside this, an obviously rented crowd purporting to be members of the institute (only one person in the crowd could be positively identified as NISER staff) confronted the Minister of Finance under whose ministry NISER functions.\nThe letter was signed on behalf of the group by four professors and heads of four departments at NISER.\nThough not a professor, he has distinguished himself in the understanding of development policy research and the expectations of NISER’s mandate.\nThis has introduced new and fresh rigour into NISER research activities”; enabled “implementation and regular funding of departmental research projects” and the“revival of Individual Research Project (IRP) programme for NISER research staff.\n***Dapo Bruce is a public analyst and writes from LagosShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "5th Columnists and the soul of NISER by Dapo Bruce",
    "summarized_story": "Alongside this, an obviously rented crowd purporting to be members of the institute (only one person in the crowd could be positively identified as NISER staff) confronted the Minister of Finance under whose ministry NISER functions.\nThe letter was signed on behalf of the group by four professors and heads of four departments at NISER.\nThough not a professor, he has distinguished himself in the understanding of development policy research and the expectations of NISER’s mandate.\nThis has introduced new and fresh rigour into NISER research activities”; enabled “implementation and regular funding of departmental research projects” and the“revival of Individual Research Project (IRP) programme for NISER research staff.\n***Dapo Bruce is a public analyst and writes from LagosShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Amputee woman accuses LASUTH of negligence, demands compensation",
    "summarized_story": "A 35-year-old woman, Oluwadamilare Aremu, has accused the Lagos State University Teaching Hospital of negligence leading to the amputation of her right leg.\nAremu told PUNCH Metro that she was admitted to LASUTH in December 2018 when an 18-passenger vehicle she boarded was involved in a crash on the Third Mainland Bridge, leading to her suffering a broken thighbone.\nLASUTH doctors told me that I would walk again.\nOak Hospital couldn’t remove the iron that LASUTH inserted in my leg, so they called a consultant to come.\nI want justice and proper compensation.”When PUNCH Metro contacted the Chief Medical Director of LASUTH, Prof Tokunbo Fabanwo, he said investigation into the case had begun."
  },
  {
    "headline": "Amputee woman accuses LASUTH of negligence, demands compensation",
    "summarized_story": "A 35-year-old woman, Oluwadamilare Aremu, has accused the Lagos State University Teaching Hospital of negligence leading to the amputation of her right leg.\nAremu told PUNCH Metro that she was admitted to LASUTH in December 2018 when an 18-passenger vehicle she boarded was involved in a crash on the Third Mainland Bridge, leading to her suffering a broken thighbone.\nLASUTH doctors told me that I would walk again.\nOak Hospital couldn’t remove the iron that LASUTH inserted in my leg, so they called a consultant to come.\nI want justice and proper compensation.”When PUNCH Metro contacted the Chief Medical Director of LASUTH, Prof Tokunbo Fabanwo, he said investigation into the case had begun."
  },
  {
    "headline": "Governor Bala sacks commissioners, SSG, CoS Salihu",
    "summarized_story": "Bauchi Governor Bala Mohammed, in a sweeping move, has sacked all commissioners, his chief of staff, Ladan Salihu and Secretary to the State Government (SSG), Alhaji Sabiu Baba.\nThe sack notice was released today by special adviser media, Mukhtar Gidado, who survived the axe.\nThe sack affected almost all political appointees, leaving few survivors.\nGidado’s statement read: ” The Governor has approved with immediate effect the dissolution of members of the State Executive Council and other political appointees that include, the Secretary to the State Government (SSG), the Chief of Staff (COS) Government House and all Special advisers, except the following:“Advisers on Security, National and State Assembly Liaison, Social Investment and Special Adviser Media and Publicity are retained.\n“All Commissioners are to handover the affairs of their ministries to their respective permanent secretaries, while the Secretary to the State Government (SSG), the Chief of Staff (COS) Government House and other affected Special Advisers are to handover to the most senior permanent Secretary in the Government House who is equally directed to take inventory of government property.”Bala Mohammed thanked all the sacked officers for their contributions to the state."
  },
  {
    "headline": "Actor Nonso Kalango announces debut movie ‘Verified’",
    "summarized_story": "By Taiwo OkanlawonNollywood actor and producer of web series “Mama and Papa Godspower”, Nonso Kalango has unveiled her debut feature film, a romantic drama titled ‘Verified’.\nThe new movie will be directed by ‘Living In Bondage: Breaking Free’ director, Ramsey Nouah and co-produced by popular comedian Nosa Afolabi popularly known as ‘Lasisi Elenu’.\nKalango in a recently held press conference revealed that the film will center on women empowerment, and will premiere in 2022.\nIn her words; “It talks about women supporting women, women empowerment… A lot of girls feel like they are unable to share things with other women.\n“‘Verified’ is a story saying, I can pick up my phone and call a friend and say this is what is bothering me and she will be concerned.”Lasisi Elenu also added that “‘Verified’ tells a story of the women of today and there is so much about the film that is yet to be revealed, and we will reveal them.”The film is scripted by Ifesinachi Okoli-Okpagu, produced by Chris Odeh and co-produced by Lasisi Elenu, Ramsey Nouah and Okoli-Okpagu."
  },
  {
    "headline": "JUST IN: Trump lauds Buhari for Twitter ban",
    "summarized_story": "Twitter-banned former U.S. President Donald Trump has expressed support for the Buhari government over its decision to block access to Twitter.\nIn a statement on Tuesday, Trump congratulated Nigeria and called on more nations to follow suit, New York Post reports.\n“Congratulations to the country of Nigeria, who just banned Twitter because they banned their President,” Trump said in an emailed statement.\n“More COUNTRIES should ban Twitter and Facebook for not allowing free and open speech—all voices should be heard.\n2024?”Donald Trump got a permanent ban from Twitter in the wake of the Jan. 6 riot at the US Capitol."
  },
  {
    "headline": "BREAKING: Bauchi Governor Sacks Commissioners, SSG, CoS",
    "summarized_story": "The State Executive Council has been disbanded with immediate effect by Bauchi Governor Bala Mohammed.\nThe Governor also fired Alhaji Sabiu Baba, the Secretary to the State Government (SSG), and Dr. Ladan Salih, the Chief of Staff (CoS) of Government House.\nThe termination of appointment was contained in a statement by the Special Adviser to the Governor on Media, Mukhtar Gidado.\nThe statement reads in part ” The Governor has approved with immediate effect the dissolution of members of the State Executive Council and other political appointees that include, the Secretary to the State Government (SSG), the Chief of Staff (COS) Government House and all Special advisers.\n“Advisers on Security, National and State Assembly Liaison, Social Investment and Special Adviser Media and Publicity are retained."
  },
  {
    "headline": "Nigerians React As Adeboye, Oyedepo, Kumuyi, Other Top Nigerian Pastors Keep Mute On TB Joshua’s Death",
    "summarized_story": "Popular Nigerian pastors have been silent until now in the midst of Prophet Temitope Balogun Joshua’s untimely death.\nT.B Joshua, a well-known preacher in Nigeria and Africa, including Asia, whose ability to perform miracles drew visitors from Europe, America, and other continents to Lagos, was verified deceased on Sunday morning.\nSuleman has said to his congregation on June 7, 2021, “Prophet T.B Joshua is too small.\nThese top pastors are mainly known in Nigeria while T.B Joshua brought foreigners Nigeria.\nSo, some of them might have felt belittled and this might have made them to develop everlasting hatred for him.”Chidinma Ebuha believes that most of these pastors did not believe in T.B Joshua’s miracles."
  },
  {
    "headline": "Don’t Access Twitter Through VPN – APC Warns Nigerians",
    "summarized_story": "The All Progressives Congress (APC) has warned Nigerians about the numerous dangers associated with utilizing the Virtual Private Network (VPN) to access content, particularly social media (VPN).\n“Those using the VPN are advised to desist in their own interests because of its risks, which include data theft, illegal access to strategic company documents and possible economic espionage.\n“The APC emphasises that VPN users expose their devices to vulnerabilities because the network allows third parties access to personal data and changes user location to another country which compromises data integrity.\n“Many individuals and organisations using VPN have lost their investments after compromising the security of their devices.\n“The APC strongly advises that Nigerians should avoid installing or using VPN to access social networking sites in order to protect their privacy and security online."
  },
  {
    "headline": "Twitter Ban: Trump Backs Nigeria, Advises More Countries To Follow Suit",
    "summarized_story": "Former President Donald Trump backed the Nigerian government’s decision to block Twitter access in the West African country on Tuesday, and called for more countries to follow suit.\n“Congratulations to the country of Nigeria, who just banned Twitter because they banned their President,” Trump said in an emailed statement.\n“More COUNTRIES should ban Twitter and Facebook for not allowing free and open speech—all voices should be heard.\n“We are deeply concerned by the blocking of Twitter in Nigeria.\nAccess to the free and #OpenInternet is an essential human right in modern society,” Twitter said in a statement Saturday."
  },
  {
    "headline": "Pictures: President Muhammadu Buhari showcases first ever made in Nigeria mobile phone",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: In Bauchi, Gov. Bala Mohammed fires SSG, CoS, 21 Commissioners",
    "summarized_story": "Governor Bala Mohammed on Wednesday announced the termination of appointment of Secretary to the State Government (SSG), Alhaji Sabiu Baba, and the Chief of Staff (CoS) Government House, Dr. Ladan Salihu.\nThe governor also sacked 21 Commissioners and other appointees.\nThis was disclosed in a statement by the Special Adviser to the Governor on Media, Mukhtar Gidado.\nDetails loading…"
  },
  {
    "headline": "VIDEO: How French man slapped President Macron",
    "summarized_story": "NextIgangan : we’ll prevent recurrence of violent attacks in Igangan, other communities – Gov Makinde"
  },
  {
    "headline": "Anambra guber: Women will make 40% of my government if elected gov – Etiaba -NigPilot",
    "summarized_story": "Leading APC governorship aspirant in the November 6 gubernatorial election in Anambra State, Chief Ben Etiaba, has promised adequate women inclusion and participation in his government if elected governor.\nSpeaking with journalists, Chief Etiaba expressed confidence that APC would emerge victorious in the November 6 election“The time for celebration is coming because APC will win this coming governorship election coming November.\n“Anambra needs a servant to be a governor, Anambra need a humble governor who will know that there is a strong virtue in humility in leadership, creative thinker, Anambra need a selfless leader.\nAnambra need a person with public service.\nHe maintained that the APC has done more for the entire South east and Anambra state in 6 years than the opposition PDP “did to our people in 16 years.”"
  },
  {
    "headline": "Twitter ban: You risk losing your lifetime investments via VPN, APC warns",
    "summarized_story": "The APC also warned legitimate private and public entities operating in the country to avoid the many dangers of exposing themselves to cybercrimes through the use of VPN which is not adequately secured.\nThe APC emphasised that VPN users expose their devices to vulnerabilities because the network allows third parties access to personal data and changes user location to another country which compromises data integrity.\nYour record can be traced to another country that is not yours, with all the risks that entails.\n“Many individuals and organisations using VPN have lost their investments after compromising the security of their devices.\nThe APC strongly advises that Nigerians should avoid installing or using VPN to access social networking sites in order to protect their privacy and security online."
  },
  {
    "headline": "Why EFCC is after me – Nwoko, Ex A’Ibom AG -NigPilot",
    "summarized_story": "So because of that matter, we got an injunction stopping the EFCC from interfering with the transactions of the Akwa Ibom State government.\nNot the transactions of the days of governor Udom Emmanuel, transactions that happened before he came into government.\nIf they win, they win, if I win, I win.\nSo because of the injunction, they couldn’t access Akwa Ibom State.\nNo one naira of Akwa Ibom State money was used to pay the legal bills of the governor."
  },
  {
    "headline": "Centre LSD unveils Build Grant to bridge gender imbalance -NigPilot",
    "summarized_story": "The African Centre for Leadership Strategy and Development (Centre LSD) has officially unveiled the “Centre LSD Build Grant,” to bridge the unacceptable gender imbalance in the extractive industry in the country.\nThe Centre said the Build Grant is for general support for strengthening an intersectional approach to gender and natural resources management, and a project for institutional strengthening.\nThe Programme Coordinator, Centre LSD, Ms. Victoria Udoh said this while unveiling the Grant in a press conference in Abuja.\n“Institutional Strengthening Interventions seeks to build the capacity of staff to deliver on the BUILD grant and beyond.\nFor example, as land is expropriated for extractive industry projects, so are family farms that women often manage."
  },
  {
    "headline": "Suspension: FG Should Have Sued Twitter, Not Place A Ban – Falana",
    "summarized_story": "Human Rights lawyer and a Senior Advocate of Nigeria, Femi Falana, says the Federal Government erred in suspending Twitter operations in the country.\nAccording to Falana, in a constitutional democracy, the government is not permitted to resort to self-help, which implies that rather than place a ban, the government is supposed to have “sued Twitter if the organization refuses to respond positively to the concerns of the government”.\nIn his opinion, Falana said there is no ground on which the action of the government can be justified.\nThe rights activist said 40 million Twitter subscribers in Nigeria cannot be disenfranchised over one person’s ego.\nThe PDP lawmakers also insisted that they would continue with their threat to go to court over the matter."
  },
  {
    "headline": "Continue Using Twitter – NASS Joint Minority Caucus Urges Nigerians",
    "summarized_story": "The Joint Minority Caucus of the Senate and the House of Representatives has met over the ban on Twitter by the All Progressives Congress (APC)-led Federal Government and has restated its condemnation of the embargo as draconian and unacceptable.\nThis position was contained in a communique signed by Senator Enyinnaya Abaribe the Minority Leader of the Senate) and Hon.\nIn the statement, the Joint Minority Caucus also dismissed threats by the APC-led government to arrest and prosecute Nigerians using Twitter and calls on Nigerians to go ahead and use their Twitter as they would not be contravening any law in Nigeria or any international statute.\nThe joint caucus, therefore, called on Nigerians to use various opportunities offered by technology and continue making use of Twitter since such does not violate any law in our country.\n“It is agonizing that Nigeria and Nigerians have been losing billions of naira on daily basis since the ban on Twitter."
  },
  {
    "headline": "#TwitterBan: PDP Reps Walk Out During Plenary",
    "summarized_story": "﻿Some lawmakers of the Peoples Democratic Party (PDP) on Tuesday staged a walkout during plenary at the House of Representatives.\nThe lawmakers staged the walkout after its caucus leader Kingsley Chinda was ruled out of order by Speaker of the House, Femi Gbajabiamila.\nThe Speaker, therefore, ruled Chinda out of order, a decision that did not go down well with some members of the opposition who walked out of plenary.\nThe PDP lawmakers also insisted that they would continue with their threat to go to court over the matter.\nPDP caucus in the House of Representatives had earlier threatened legal action against the Federal Government over its ban of Twitter operations in Nigeria."
  },
  {
    "headline": "#TwitterBan: SERAP Drags FG To ECOWAS Court",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) and 176 concerned Nigerians have dragged the Federal Government to the ECOWAS court over the unlawful suspension of Twitter in Nigeria.\n“The free communication of information and ideas about public and political issues between citizens and elected representatives is essential.\nThis implies a free press and other media able to comment on public issues without censor or restraints, and to inform public opinion.\nAn order setting aside the suspension, ban, sanction or other punishments whatsoever imposed on Twitter, Nigerians, media houses, broadcast stations and any social media service providers by the Defendant and its agents.\nSuch further orders the Honorable Court may deem fit to make in the circumstances of this suit."
  },
  {
    "headline": "Nobody Can Tell Me Why APC Should Not Win Next Election – Uzodinma",
    "summarized_story": "The Governor of Imo State, Hope Uzodinma says no one at moment can give him a reason why the All Progressives Congress (APC) will not be reelected in the next general elections.\nSpeaking to reporters on Tuesday at the Presidential Villa after meeting with President Muhammadu Buhari, Governor Uzodinma challenged Nigerians to give reasons why the ruling party should not win the 2023 polls.\nWhile responding to a question of whether more governors from the Southeast would defect to the APC, the governor said, “Not just from the South-east, many governors in Nigeria will join the APC”.\nCan anybody come and tell me one, two, three, four reasons why this APC should not win in the next election?\nAccording to him, if all leaders speak out condemning perpetrators of insecurity, a lot of changes would be visible."
  },
  {
    "headline": "NAPS supports FG on Twitter ban, says platform not bigger than Nigeria",
    "summarized_story": "The National Association of Polytechnic students says it is in support of the decision of the Federal Government on the ban of the social media platform, twitter.\nThe National president of NAPS Olalere Benedict made this known at a press conference in Ibadan.\nHe said the Federal Government had the right to put a stop to anything capable of heating the country’s polity.\nAdvertisementAccording to him, Twitter is not bigger than Nigeria, Twitter is an entity while Nigeria is a sovereign country.\nHe urged the Federal put in place control measures that will monitor the activities of every social media in Nigeria."
  },
  {
    "headline": "Senate set to confirm Lauretta Onochie as INEC national Commissioner",
    "summarized_story": "The Senate on Wednesday referred the name of the Special Assistant on Social Media to the President, Lauretta Onochie, to its Committee on the Independent National Electoral Commission (INEC) for screening as a National Commissioner of INEC representing Delta State.\nThis is coming about eight months after President Muhammdu Buhari forwarded Onochie’s name and five other nominees to the Senate for confirmation.\nOnochie’s nomination had generated controversy with critical stakeholders arguing her choice was not in order in view of her alleged ‘partisanship and identification’ with the All Progressives Congress (APC)."
  },
  {
    "headline": "Governor Makinde promises to end insecurity in Oyo State",
    "summarized_story": "Oyo State Governor, Seyi Makinde, has said he would do all it takes to ensure the lives of residents of the state are safeguarded.\nHe stated this on Tuesday in Igangan, Ibarapa North Local Government, where he visited the families of last weekend’s attacks.\nThe Governor said in addition to other measures taken to ensure that insecurity in Ibarapaland is a thing of the past, the State would empower local security guards and vigilantes.\nA statement by the Chief Press Secretary to the governor, Mr. Taiwo Adisa, indicated that Governor Makinde, who was in Igangan with top government functionaries and the Speaker of the Oyo State House of Assembly, Rt.\n“I urge you to give me that chance to make the issue of insecurity here become a thing of the past."
  },
  {
    "headline": "Super League: Big Six to Pay £20m Cost of Settlement to Premier League – Arise News",
    "summarized_story": "Reports suggest the supposed big six English clubs that secretly agreed to play in a European Super League (ESL) will pay just over £20 million to draw a line under their ensuing row with the Premier League, Sky News is reporting.\nAny of those clubs which signed up to a similar project would be liable to a penalty of more than £20m and a 30-point Premier League deduction, according to one source.\nThe eventual settlement is substantially smaller than an initial proposal made by the Premier League last month, which comprised a £15m fine per club and a substantial – albeit suspended – points deduction.\nHowever, Premier League directors are said to have decided that drawing a line under the European Super League project was a priority ahead of the league’s annual conference – attended by all 20 clubs – beginning on Thursday.\nThey rapidly abandoned the ESL project amid a huge backlash from rivals, fans and politicians."
  },
  {
    "headline": "Former Nigeria President Jonathan in Bamako for ECOWAS Mediation Talks – Arise News",
    "summarized_story": "A former Nigerian President Goodluck Jonathan arrived in Bamako on Tuesday with a delegation and — once again, as the mediator of the Economic Community of West African States (ECOWAS) for talks with the new Malian government.\nMr Jonathan while addressing the media said his visit is geared towards having a conversation with the head of the Mali government.\n“The military officials agreed that the prime minister would be a civilian.\nSo, it is not new.\nTo pressure Goita to step down and quell the perceived political crisis, the African Union has since suspended Mali’s membership and France has temporarily suspended its joint military operations with the Malian armed forces."
  },
  {
    "headline": "Syria Says Israeli Air Attacks Targeted Damascus",
    "summarized_story": "Israeli air attacks struck central Syria late on Tuesday, with state news agency SANA reporting “explosions in Damascus” before adding that its air defences had been activated against the “Israeli aggression”.\nIsraeli planes arrived from Lebanese air space, the news agency added.\nThe Britain-based war monitor said the attacks targeted air force positions near the village of Khirbet al-Tin on the outskirts of Homs, as well as an arms depot belonging to the Lebanese Hezbollah movement.\nThe Israeli army, which rarely acknowledges individual attacks on Syria, declined to comment on “reports in the foreign media”.\nSince a war broke out in Syria in 2011, Israel has carried out hundreds of air attacks on Syrian territory, targeting government positions as well as allied Iran-backed forces and fighters of Lebanon’s Hezbollah movement."
  },
  {
    "headline": "UN Warns of ‘Mass Deaths’ in Myanmar after 100,000 Flee Fighting",
    "summarized_story": "A United Nations rights expert has warned of “mass deaths from starvation, disease and exposure” in eastern Myanmar after “brutal, indiscriminate attacks” by the military forced tens of thousands of people to flee their homes in Kayah State.\n“Mass deaths from starvation, disease, and exposure, on a scale we have not yet seen since the February 1 coup, could occur in Kayah State absent immediate action.”Mass deaths from starvation, disease and exposure could occur in Kayah State after many of the 100,000 forced to flee into forests from junta bombs are now cut off from food, water and medicine by the junta.\nHuman rights groups say security forces have killed at least 849 people since the coup and detained 5,800 others.\nOn Monday, ASEAN foreign ministers met a Myanmar military envoy in China’s Chongqing and expressed concern over the army’s “painfully slow” progress on implementing the consensus.\n“We encourage all parties in Myanmar to engage in political dialogue within the constitutional and legal framework and restart the process of democratic transformation,” Wang said in the statement."
  },
  {
    "headline": "Nigeria: Former Leaders Obasanjo, Abdulsalami, Others Meet Thursday to Douse Tension",
    "summarized_story": "Former President Olusegun Obasanjo, former Head of State, Gen. Abdulsalami Abubakar (rtd); Sultan of Sokoto, Alhaji Sa’ad Abubakar, and former Catholic Archbishop of Abuja, John Cardinal Onaiyekan, and others will meet Thursday in Abuja on the state of the nation.\nThe meeting, which will be held under the auspices of Interfaith Initiatives for Peace, was convened to discuss “pressing issues” in the country.\nThe group is jointly led by Obasanjo, Sultan, Abdulsalami, and Onaiyekan.\nAccording to a letter addressed to President of the Nigeria Labour Congress (NLC), Ayuba Wabba, sighted by TheCable, issues such as national unity, security, peace, integration, economic revitalisation and development will be discussed at the meeting.\nObasanjo had recently expressed worry over the state of the nation and blamed bad leadership for the nation’s woes."
  }
]