[
  {
    "headline": "Ruptured appendix could cause sudden death, infertility in women, physician warns",
    "summarized_story": "Amarachi OkehA public health physician, Dr. Tunji Akintade has warned against delaying seeking medical intervention for appendicitis, noting that a ruptured appendix could cause sudden death and pelvic inflammatory disease which in turn could cause infertility in women.\n“One of the complications of ruptured appendix is peritonitis which is the inflammation of the peritoneum.\nAccording to, Medicalnewstoday – a medical news site, hydrosalpinx is the name for a condition in which a woman’s fallopian tube becomes blocked with fluid.\nContinuing, Akintade said that ruptured appendicitis can also cause sepsis.\nSpeaking on how people may know their appendix has ruptured, the general practitioner said, “Once you have abdominal pain especially in the right area, you must see your doctor immediately."
  },
  {
    "headline": "Ruptured appendix could cause sudden death, infertility in women, physician warns",
    "summarized_story": "Amarachi OkehA public health physician, Dr. Tunji Akintade has warned against delaying seeking medical intervention for appendicitis, noting that a ruptured appendix could cause sudden death and pelvic inflammatory disease which in turn could cause infertility in women.\n“One of the complications of ruptured appendix is peritonitis which is the inflammation of the peritoneum.\nAccording to, Medicalnewstoday – a medical news site, hydrosalpinx is the name for a condition in which a woman’s fallopian tube becomes blocked with fluid.\nContinuing, Akintade said that ruptured appendicitis can also cause sepsis.\nSpeaking on how people may know their appendix has ruptured, the general practitioner said, “Once you have abdominal pain especially in the right area, you must see your doctor immediately."
  },
  {
    "headline": "Worshippers, visitors shun COVID-19 protocols as Osun Osogbo festival ends",
    "summarized_story": "Thousands of worshippers, devotees and tourists at the grand finale of the Osun Osogbo festival on Friday ignored the mandatory wearing of face marks and maintenance of social distancing as part of the COVID-19 protocols.\nA correspondent of the News Agency of Nigeria who was at the Groove reports that worshippers and visitors violated the COVID-19 safety protocols.\nThe minister was represented at the festival by the Director-General, Nigerian Tourism Development Corporation, Mr. Folarin Coker.\n“Our cultural tourism can help reinforce identities, enhance cross-cultural understanding and preserve the heritage and culture of an area.\n“Cultural tourism can also have positive socioeconomic impacts as witnessed in the annual celebration of the Osun-Osogbo festival."
  },
  {
    "headline": "Worshippers, visitors shun COVID-19 protocols as Osun Osogbo festival ends",
    "summarized_story": "Thousands of worshippers, devotees and tourists at the grand finale of the Osun Osogbo festival on Friday ignored the mandatory wearing of face marks and maintenance of social distancing as part of the COVID-19 protocols.\nA correspondent of the News Agency of Nigeria who was at the Groove reports that worshippers and visitors violated the COVID-19 safety protocols.\nThe minister was represented at the festival by the Director-General, Nigerian Tourism Development Corporation, Mr. Folarin Coker.\n“Our cultural tourism can help reinforce identities, enhance cross-cultural understanding and preserve the heritage and culture of an area.\n“Cultural tourism can also have positive socioeconomic impacts as witnessed in the annual celebration of the Osun-Osogbo festival."
  },
  {
    "headline": "6 ESN members killed, 13 arrested, 19 AK-47 rifles recovered in Enugu, Ebonyi — Army",
    "summarized_story": "“Relatedly, troops raided IPOB/ESN members’ hideout at Amaechi Idodo community in Nkanu LGA of Enugu State and Nguzu Edda in Afikpo South LGA of Ebonyi State.\n“Troops also recovered a total of 19 AK-47 rifles, 2 single barrel Dane guns, one G3 assault rifle and 3 locally-made pistols.\n“The operations led to the destruction of bandits’ hideouts, arrest of 8 armed bandits including their informants and rescue of some kidnap victims.\n“The airstrikes resulted in the destruction of bandits’ structures including the residence of one of their leaders, Halilu Tubali, in which the armed bandits converged for a meeting.\n“The airstrikes resulted in the destruction of bandits’ structures including the residence of one of their leaders, Halilu Tubali, in which the armed bandits converged for a meeting."
  },
  {
    "headline": "Hull Blyth commences rail haulage of containers from Wasimi, Ogun State to Apapa port",
    "summarized_story": "The Wasimi Rail Hub, which is the first of its kind in Nigeria, will allow shippers receive import containers from Apapa port, and also send export/empty containers to the port by rail.\nJust send it to us at Wasimi and we will gladly move it to Apapa port by rail.\nHe said the Wasimi Rail Hub is the precursor to a Dry Port, which is already under construction.\nWhen completed, the Dry Port, will have capacity to handle up to 7,000 TEUs and will be fully connected to Apapa port by rail.\nA beneficiary of the first train service, MsDedeYebovi of Quinet International expressed satisfaction with the ease of moving export from Ogun State by rail to Apapa port."
  },
  {
    "headline": "Nigerian mission evacuates 100 stranded citizens from Libya",
    "summarized_story": "The Nigerian Mission in Tripoli said on Friday that it was evacuating 100 Nigerians stranded in Libya, with another set of 100 stranded Nigerians to be returned home in the next 10 days.\nAccording to Musa, the evacuees should arrive in Nigeria via the Nnamdi Azikiwe International Airport at 10 p.m Nigerian time.\n“Under special arrangements, NAF aircraft C-130 H evacuated 100 stranded Nigerians detained in various Libyan prisons after they had served respective jail terms.\n“The exercise will be a continuous one until all Nigerians stranded in Libya are returned home.\nAlready, another batch of 100 Nigerians are set to be evacuated in ten days,” Musa stated."
  },
  {
    "headline": "Our Charges Not Arbitrary, APMDC Replies Shippers’ Council",
    "summarized_story": "By Godwin OritseTHE management of the Associated Port Marine Development Company (APMDC), has denied allegations of arbitrary charges and charging in foreign currency levelled against it by the Nigerian Shippers’ Council (NSC).\nRecall that the council had shutdown the company’s terminal over allegations of non-compliance with regulatory directives and other arbitrary charges.\nAccording to APMDC, “APMDC charges structure is determined by high cost of delivering groupage containers from discharge ports or off docks to its Bonded Terminal/Warehouse.\nAlso speaking, the Deputy Manager, Shipping of APMDC, Rachael Monye said Shippers Council’s is uninterested about operators plights and industry inherent challenges that drive charges to customers.\nShe also accused the council of fees imposition without consideration or recourse to high costs of delivering the services."
  },
  {
    "headline": "Nigeria, 3 others get £16.2m UK grant to fight plastic pollution",
    "summarized_story": "Nigeria and three other developing countries are to benefit from a £16.2 million grant from the UK Government to facilitate a united effort against plastic waste globally.\nThe British High Commission in Nigeria, in a statement in Lagos on Friday, said the grant, from UK’s £500 million Blue Planet Fund, would help tackle plastic pollution and decline of global coral reefs in Nigeria, Ghana, Indonesia and Vietnam.\n“The Global Plastic Action Partnership (GPAP) is a multi-stakeholder platform that aims to shape a more sustainable and inclusive world through the eradication of plastic pollution.\n“It is uniquely equipped to bring together public, private and civil society leaders to develop joint solutions to the plastic pollution crisis that are both pragmatic and ambitious,” Melbourne said.\n“Over 80 countries, including Nigeria and several other West African states, now support the marine protection target,” the statement said.(NAN)."
  },
  {
    "headline": "Insecurity: Protect yourself in traditional way – Ifa priest charges Yorubas",
    "summarized_story": "A renowned Ifa Priest and Araba of Osogbo, Chief Ifayemi Elebuibon, has called all Yorubas to be more alert and protect themselves in a traditional means.\nThe popular Ifa priest said there is a need for Yorubas to be more alert and protect themselves traditionally not just only to go to church and mosque for prayer.\nHe noted this during the 2021 Osun Osogbo festival grand finale on Friday at the Osun groove.\nSpeaking further, Elebuibon said Yobubas should Discover themselves and start to uphold tradition and culture God gave them for maximum security.\n“We need to be more alert and protect ourselves traditionally not just only to go to church and mosque for prayer, we need to use our traditional means to protect ourselves,” he concluded."
  },
  {
    "headline": "Ahmed Joda’s death: Fall of an iroko — Atiku",
    "summarized_story": "Atiku Abubakar, a former Nigeria Vice President, has described the death of Alhaji Ahmed Joda, former Permanent Secretary, as “fall of an iroko”.\nAtiku, in a statement signed by himself on Friday in Abuja, described Joda as a great Nigerian and first generation of Adamawa indigenes who made immense contribution to the growth of the state and the country.\nHe said, “Today, our beautiful Adamawa State has lost a colossus.\nIndeed, an iroko tree has fallen in Nigeria, particularly Northern Nigeria.\n“The news of the death of Joda comes with some kind of a jolt even though he lived to a prime age."
  },
  {
    "headline": "Interior Minister lauds Gov. Ugwuanyi for promoting ‘one Nigeria’ spirit",
    "summarized_story": "The Interior Minister, who spoke during a Gala Night organized in his honour by Gov.\nAregbesola was in Enugu for the inauguration of the new office of Nigerian Immigration Service (NIS), Enugu State Command, located at Kilometre 5, Enugu-Abakiliki Expressway, Emene, Enugu.\n“I therefore congratulate you on today’s successful commissioning of the new office of the Nigerian Immigration Service, Enugu State Command, in spite of the challenges.\nMrs. Fidelia Njeze, President, Ohanaeze Ndigbo, Enugu State Chapter, Prof. Fred Eze and Chairman, Enugu State Traditional Rulers Council, HRH Igwe Amb.\nLawrence Agubuzu, who presented traditional gift items to the Interior Minister, Aregbesola and the Comptroller-General, NIS, Babandede."
  },
  {
    "headline": "Explosion claims five children in Borno",
    "summarized_story": "Explosion rocked Ngala community of Borno State, killing five children on Thursday.\nNgala, a Local Government Area in Borno, shares border with neighbouring Cameroon.\nIt was gathered that the kids were playing within a field when the unspent grenade exploded.\nThe Boko Haram sect seized Ngala eight years ago and was later dislodged by the military.\nIt is believed that unexploded mines and grenades from previous battles are still in the axis."
  },
  {
    "headline": "Effium killings: Umahi vows to rebuild Ebonyi community destroyed by war",
    "summarized_story": "Ebonyi State Governor, David Umahi, at the weekend, promised to rebuild the Effium market destroyed as a result of communal clashes in the area.\nThe governor, who equally swore in some commissioners at the event, said “I want to thank the Effium city crisis committee for doing a good job.\n“It has been very difficult and all over the country, the problem we have is our leaders.\n“We will do something about the Effium market, I won’t be a happy man to bow out without modernising Effium market.\nIt is better to modernize Effium market and make it beautiful, if they want to destroy it, let them do it but that was part of our campaign promises.”"
  },
  {
    "headline": "Obi Cubana remembers mom one month after burial",
    "summarized_story": "By Ekaete BasseyObi Cubana, the billionaire nightlife boss, has remembered his late mom exactly one month after she was laid to rest.\nThe burial ceremony on July, 13, in Oba, Anambra State attracted many captains of industry.\nTaking time out to remember and celebrate his late mom, Obi Cubana expressed the depth of love his siblings and himself have for her while noting they miss her.\nADVERTISEMENTSharing a video compilation from the burial-cum-carnival ceremony of the late mom, Ezinne Uche Iyiegbu, the Cubana chairman wrote; “Exactly One Month Today, You We’re Laid To Rest Mama!\nWe Love And Appreciate Everyone That Made This Event Beautiful; Family, Friends, Associates, Well Wishers, EVERYONE!"
  },
  {
    "headline": "Osun records seven COVID-19 deaths, 73 cases",
    "summarized_story": "By Toba Adedeji, OsogboOsun State has recorded seven deaths and 73 COVID-19 cases.\nCommissioner for Information and Civic Orientation, Mrs Funke Egbemode ,noted the cases were recorded within two weeks.\nIn the last two weeks, the state has recorded 74 cases with 7 mortality.\nThe effects of the virus keep getting worse by the day because our compliance level is deplorable and alarming.\n“The more nonchalant and careless we become this season, the more we open ourselves up to the dangerous effects of the pandemic.”"
  },
  {
    "headline": "Group backs investment promotion commission chief Sadiku",
    "summarized_story": "#FixPolitics Initiative, a Non-Governmental Organisation, has thrown its weight behind activities of the Executive Secretary of the Nigerian Investment Promotion Commission (NIPC), Ms Yewande Sadiku.\nThe group condemned what it tagged attempts to drag Ms Sadiku down.\n“As a Community of Practice committed to ethical and competent leadership, has observed with concern the continued harassment of the Executive Secretary of the Nigerian Investment Promotion Commission (NIPC), Ms. Yewande Sadiku, by several agencies, the most recent one being by the EFCC on Monday, 9th August, 2021.\n#FixPolitics therefore views this continued harassment of Ms. Sadiku with grave concern and is keeping a close watch on developments.\n#FixPolitics boldly stands with Ms. Yewande Sadiku.”"
  },
  {
    "headline": "Buhari commiserates with Niger Republic over flood",
    "summarized_story": "By Bolaji Ogundele, AbujaPresident Muhammadu Buhari has condoled with President Mohammed Bazoum, government and people of Niger Republic, over devastating floods that have left many dead and affected homes.\nIn a statement by his Senior Special Assistant on Media and Publicity Mallam Garba Shehu Buhari said losses reported from Niger Republic in the last two days were very vast and disturbing while also taking note of flooding in many parts of the world, including some states in Nigeria.\nADVERTISEMENTThe President affirmed that natural disasters are symptoms of climate change which all countries, including Nigeria, have committed to taking measures to prevent the adverse effects.\nPresident Buhari prayed for all the departed souls and affected families"
  },
  {
    "headline": "Showdown looms in South- East over sit-at-home order",
    "summarized_story": "As Igbo mull the experience, opinions are divided as to the possibility of sustaining the every Monday sit-at-home order.\nShe feared that, going by the way Igbo youths are being killed by suspected IPOB sit-at-home enforcers, the zone may soon be devoid of able-bodied youths.\nHowever, ahead of next sit-at-home exercise, indications are that the people might decide to stay indoors or resist the order.\nAn importer, Chief Onyebuchi Ikpa, said many of them took loans from banks, noting that the banks would not consider the sit-at-home days when computing days due for repayment.\nBut IPOB’s spokesman, Emmanuel Powerful said no price was too much for the Igbo to pay in securing their freedom and release of IPOB leader, Kanu."
  },
  {
    "headline": "IBB @ 80: Day of tributes from Gowon, Shonekan, Abdulsalami, Jonathan, Sambo, others – The Sun Nigeria",
    "summarized_story": "He prayed God to continue to keep General Babangida in good health and bless his family, while also praying God to bless the country.\n“The legacy of General Babangida are too numerous to be mentioned in a fora like this today.\nHowever, I reported to General Babangida who was my commander.\nHe said Babangida visited Enugu as military president then and, during a reception ceremony at Okpara Square, beckoned on him.\n“I want to convey my gratitude to all of you who have found time to be here today,” said the elated former military president."
  },
  {
    "headline": "Buhari returns to Abuja after education summit in UK, medical checkup",
    "summarized_story": "Buhari returns to Abuja after education summit in UK, medical checkupFrom Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has returned to Abuja after joining world leaders in making firm commitment to increase funding of education sector at the recent Global Education Summit in London, United Kingdom.\nHe has also used the opportunity of the trip to carry out routine medical check-up.\nAt the summit, President Buhari pledged to increase the budget for the education sector in Nigeria by as much as 50 per cent over the next two years.\nOn arrival, President Buhari inspected a guard of honour mounted by officers and men of the Guards Brigade of the Nigerian Army before watching displays by cultural troops representing different Nigerian cultures.\nBefore departing London, President Buhari was reported to have visited former Lagos State Governor and National Leader of the All Progressives Congress (APC), Bola Tinubu, who is believed to be on medical trip to London."
  },
  {
    "headline": "I was chained legs, hands for 48hrs without food and water",
    "summarized_story": "From John Adams, MinnaNiger state state Commissioner for information, Alhaji Muhammed Sani Idris who regained his freedom after four days in captivity has recounted his ordeals in the hands of his abductors, saying that he spent the first two night under a de-humanize condition with his two legs and hands chained without food and water.\nThe Commissioner also disclosed that he was made to sleep under the rain for the first two night before his abductors provided him with a trampoline.\n“I was asking them if what they were doing is welcome in the eyes of Allah, gradually, instead of breaking me, I started breaking them.\nAfter then they started giving me bread, water, they untied me and use the only trampoline they had to cover me during rain while they stayed under the rain.\nThey began to shed tears and they said that they pray that their meeting with me will be an end point to their banditry.”"
  },
  {
    "headline": "London: Nigerian High Commission shut over COVID-19 outbreak",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Nigerian High Commission in London, United Kingdom, has been shut for 10 days after two officials tested positive to COVID-19.\nThe Nigerian High Commission in London, in a statement issued on Thursday, narrated that yesterday afternoon, the Head of Immigration Section and two other officials went for a meeting at the Home Office.\nThe mission further said at the entrance, COVID-19 test was administered on them and one of them tested positive to the virus.\nThe High Commission added that the affected officer immediately isolated, while the other officials, who tested negative will also isolate for the next 10 days.\n“While the High Commission regrets any inconvenience that this may have caused, we solicit the cooperation of the general public,” the Nigerian High Commission in London said."
  },
  {
    "headline": "Buhari Returns to Abuja",
    "summarized_story": "* Inspects Guard of Honour at AirportBy Deji ElumoyePresident Muhammadu Buhari is back in Abuja, the nation’s capital, after a two-week visit to London, the United Kingdom.\nHis plane, Nigeria Air Force 1, touched down at the Presidential Wing of the Nnamdi Azikwe International Airport, Abuja at about 18.00 hours on Friday.\nOn arrival, President Buhari inspected a guard of honour mounted by officers and men of the Guards Brigade of the Nigerian Army before watching displays by cultural troops representing different Nigerian cultures.\nAccording to a police wireless message dispatched Thursday, all Sector Commanders and Divisional Police Officers at the Federal Capital Territory (FCT) Command were directed to mobilise adequately inward Abuja.\nThe message stated inter alia: “Mr President will be arriving Abuja from his trip outside the country tomorrow (Friday), the 12/08/2021 by 1700hrs."
  },
  {
    "headline": "Ahmed Joda is Dead",
    "summarized_story": "A former super federal Permanent Secretary, Alhaji Ahmed Joda, is dead.\nBaba said the deceased was born in Yola in 1930, attended Yola Elementary School and Yola Middle School before proceeding to Barewa College from 1945 to 1948.\nIn 1967, he became a federal permanent secretary in the Ministry of Information and subsequently moved to Lagos.\n“Ahmed Joda is an administrator, journalist and politician.\nJoda is survived by four children, comprising two males and two females, including Hajiya Asmau Joda, a female activist."
  },
  {
    "headline": "Buhari Returns from UK Today",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari is expected back in Abuja, the Nigerian capital on Friday (today).\nIt stated: “Mr President will be arriving Abuja from his trip outside the country tomorrow (Friday), the 12/08/2021 by 1700hrs.\n“Compol (Commissioner of Police) directs all Sector Commanders and DPOs to deploy adequately inward Abuja.\nPresident Buhari had left Nigeria for the United Kingdom on July 26 to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\nOn Thursday, Buhari paid a visit to former Lagos State Governor and National Leader of the ruling All Progressives Congress (APC), Asiwaju Bola Tinubu, who is said to be recuperating in the United Kingdom."
  },
  {
    "headline": "APC at Crossroads as PDP Tells Court to Declare Buni, Deputy’s Seats Vacant",
    "summarized_story": "Keyamo and others, like Senators Babafemi Ojudu and Ita Enang, had raised concerns about future elections, particularly, in a situation, where the convention to elect new leaders of the APC was conducted under the Yobe State governor.\nApart from Buni, PDP, citing section 187(1) of the 1999 Constitution, as amended, also sought the removal of Gubana from office as deputy governor.\nAlthough Oshiomhole did not challenge the dissolution of the NWC then, some aggrieved party members had approached the court seeking to stop the Buni-led caretaker committee.\nWhile the party would be battling on the one hand to legitimise the Buni-led committee, the Yobe State governor, on the other hand, would be battling to save his office as governor.\nIn the suit filed on their behalf by their lawyer, Chief Emeka Etiaba, SAN, the plaintiffs insisted that Buni ceased to be a governor from the moment he accepted to act as APC caretaker committee chairman."
  },
  {
    "headline": "At Babangida’s 80th Birthday Lecture, Panelists Address His Challenges",
    "summarized_story": "The colloquium was designed as part of events to mark Babangida’s 80th birthday coming up next Tuesday, August 17.\nThey also expressed concern about poor handling of Nigeria’s multi-ethnic nature, and set the agenda for the future.\nAkilu recalled how the former military president gave out his only car to a friend, who needed it.\nAbubakar, while underscoring the leadership qualities that endeared Babangida to many Nigerians, said, “Once you are a leader, everybody is yours.\nRegretting that the Babangida was one of the most misunderstood Nigerians, Abubakar noted that Babangida has the love of Nigeria at heart."
  },
  {
    "headline": "EXCLUSIVE: Tinubu, Aides Angry With Buhari, Presidency For Releasing Pictures Showing Ex-Lagos Governor With Walking Stick",
    "summarized_story": "“When Lagos governor, (Babajide) Sanwo-Olu and (Abiodun) Faleke (federal lawmaker) visited him, nothing revealed he had a surgery or was sick.\nBut the way Buhari had his photo ops handled by the Villa was not what he (Tinubu) bargained for.\n“They felt betrayed that such pictures showing him with a walking stick would be released.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling with some old age ailment.\nSaharaReporters had reported the conspicuous absence of Tinubu during the one-day working visit of President Buhari to inaugurate various projects in Lagos State."
  },
  {
    "headline": "EXCLUSIVE: Tinubu, Aides Angry With Buhari, Presidency For Releasing Pictures Showing Ex-Lagos Governor With Walking Stick",
    "summarized_story": "“When Lagos governor, (Babajide) Sanwo-Olu and (Abiodun) Faleke (federal lawmaker) visited him, nothing revealed he had a surgery or was sick.\nBut the way Buhari had his photo ops handled by the Villa was not what he (Tinubu) bargained for.\n“They felt betrayed that such pictures showing him with a walking stick would be released.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling with some old age ailment.\nSaharaReporters had reported the conspicuous absence of Tinubu during the one-day working visit of President Buhari to inaugurate various projects in Lagos State."
  },
  {
    "headline": "BREAKING: Buhari Leaves UK For Nigeria After Visiting Ailing Tinubu",
    "summarized_story": "President Muhammadu Buhari is expected to arrive in Nigeria Friday evening, sources close to the presidency have told SaharaReporters.\nBREAKING: Nigeria Shuts High Commission In London Over Continuous Anti-Buhari Protests | Sahara Reporters https://t.co/4tRSXN2Bcm pic.twitter.com/LgXt60xQVD — Sahara Reporters (@SaharaReporters) August 12, 2021“He is on his way, the presidential flight took off from Stansted Airport, London, about an hour ago,” the source said.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had purportedly damaged furniture in his office."
  },
  {
    "headline": "BREAKING: Buhari Leaves UK For Nigeria After Visiting Ailing Tinubu",
    "summarized_story": "President Muhammadu Buhari is expected to arrive in Nigeria Friday evening, sources close to the presidency have told SaharaReporters.\nBREAKING: Nigeria Shuts High Commission In London Over Continuous Anti-Buhari Protests | Sahara Reporters https://t.co/4tRSXN2Bcm pic.twitter.com/LgXt60xQVD — Sahara Reporters (@SaharaReporters) August 12, 2021“He is on his way, the presidential flight took off from Stansted Airport, London, about an hour ago,” the source said.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had purportedly damaged furniture in his office."
  },
  {
    "headline": "How Late Statesman, Ahmed Joda Prevented Nigeria From Breaking Up In 1966 – Obasanjo",
    "summarized_story": "Former President, Olusegun Obasanjo, has described as “heartbreaking”, the death of elder statesman Ahmed Joda, who died on Friday at the age of 91.\nIn a statement on Friday signed by his media aide, Kehinde Akinyemi, Obasanjo said the late Joda was his friend for about 60 years.\nIf every Nigerian have the attributes of Joda, Nigeria will have been better than what it is now.\nObasanjo recalled that the effort of Joda and his other Super Permanent Secretaries as they were fondly called in the then civil service saved Nigeria in 1966.\n“But, it was Ahmed Joda and other Super Permanent Secretaries (senior civil servants) like Philip Asiodu, Liman Ciroma, Alison Ayida who prevailed not to have Nigeria broken up."
  },
  {
    "headline": "'Resolution efforts have failed' -- FG drags resident doctors to court over strike",
    "summarized_story": "The federal government has instituted a case before the National Industrial Court against the National Association of Resident Doctors (NARD), over the strike embarked upon by the health workers.\nThe doctors had commenced the strike on August 1 over “irregular payment of salaries”, among other issues.\nAdvertisementIn his most recent comments on the strike on Thursday, Ngige had accused the doctors of trying to “play God”.\nSpeaking on the court action taken by the federal government, Ngige said most of the demands by the resident doctors have been met, but efforts to get them to call off the strike had “failed”.\nAdvertisement“‘I, hereby refer the matter for consideration, and the issues in dispute to the National Industrial Court of Nigeria for adjudication.”"
  },
  {
    "headline": "'Resolution efforts have failed' -- FG drags resident doctors to court over strike",
    "summarized_story": "The federal government has instituted a case before the National Industrial Court against the National Association of Resident Doctors (NARD), over the strike embarked upon by the health workers.\nThe doctors had commenced the strike on August 1 over “irregular payment of salaries”, among other issues.\nAdvertisementIn his most recent comments on the strike on Thursday, Ngige had accused the doctors of trying to “play God”.\nSpeaking on the court action taken by the federal government, Ngige said most of the demands by the resident doctors have been met, but efforts to get them to call off the strike had “failed”.\nAdvertisement“‘I, hereby refer the matter for consideration, and the issues in dispute to the National Industrial Court of Nigeria for adjudication.”"
  },
  {
    "headline": "Femi Adesina: It's too early for Buhari to support any aspirant for 2023 presidency",
    "summarized_story": "Femi Adesina, presidential spokesperson, says it is too early for President Muhammadu Buhari to support any aspirant for the presidency in the 2023 general election.\nAdvertisementAdesina, who explained that the meeting between Buhari and the APC chieftain on Thursday was a “goodwill visit”, said it will be unlike Buhari to jump the gun on supporting presidential aspirants for the 2023 election.\nSo, for him to start supporting somebody now will just be like jumping the gun and you know that President Buhari will never do that.\nHe was the one who came out to say ‘no, don’t do it; don’t jump the gun’.\nKnowing President Buhari, he will never jump the gun.”"
  },
  {
    "headline": "Femi Adesina: It's too early for Buhari to support any aspirant for 2023 presidency",
    "summarized_story": "Femi Adesina, presidential spokesperson, says it is too early for President Muhammadu Buhari to support any aspirant for the presidency in the 2023 general election.\nAdvertisementAdesina, who explained that the meeting between Buhari and the APC chieftain on Thursday was a “goodwill visit”, said it will be unlike Buhari to jump the gun on supporting presidential aspirants for the 2023 election.\nSo, for him to start supporting somebody now will just be like jumping the gun and you know that President Buhari will never do that.\nHe was the one who came out to say ‘no, don’t do it; don’t jump the gun’.\nKnowing President Buhari, he will never jump the gun.”"
  },
  {
    "headline": "Buhari returns to Abuja after attending education summit in UK",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja, after attending a global summit on improving funding for education, held in the United Kingdom.\nAdvertisementThe president had travelled to the UK in late July for the summit.\nIn an earlier statement announcing the president’s activities in the UK, Femi Adesina, presidential spokesman, said Buhari was also scheduled for a medical appointment in London after the summit.\nThe Global Education summit, co-hosted by Boris Johnson, British prime minister, and President Uhuru Kenyatta of Kenya, generated about $4 billion out of the target of $5 billion to improve access to quality education in low-income countries, including Nigeria.\nAdvertisementAt the summit, Buhari pledged to increase the budget for Nigeria’s education sector."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Obaseki congratulates Odigie-Oyegun on 82nd birthday, hails contribution to devt of Edo, Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated ex-governor of the state and former national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun on his 82nd birthday, hailing his commitment to Nigeria’s unity and development.\nIn a statement, the governor extolled the virtues of the elder statesman, describing him as an “erudite politician, true democrat and administrator par excellence, whose exemplary leadership has positively impacted the nation’s political space.”Obaseki noted, “On behalf of the government and good people of Edo State, I congratulate you, Chief John Odigie-Oyegun, as you mark your 82nd birthday anniversary.\n“You have continued to lead an enviable life that is worthy of emulation, distinguishing yourself as a role model, true democrat and administrator par excellence.\n“From your early days in the federal public service, where you rose to the peak of your career as a permanent secretary, up to when you got elected as the governor of Edo State, you have carried on with your vision of engendering sustainable development.\n“I applaud your unalloyed dedication and commitment to the Nigerian project and pray that the Almighty God will grant you more years in good health and happiness.”..."
  },
  {
    "headline": "Edo readies to receive second batch of COVID-19 vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state would, by weekend, receive its second batch of the coronavirus (COVID-19) vaccines, to protect the people against the deadly virus.\n“The Edo State COVID-19 response team has been reactivated; l am the chairman of the team and the deputy governor is the chairman of the Technical Committee.\nOko-Oboh noted: “We are receiving about 3.2 million doses of the COVID-19 vaccines, including Moderna, AstraZeneca, as well as Johnson and Johnson.\nIf you take AstraZeneca as the first dose, it must be AstraZeneca for the second dose and not Moderna.\nWe are expecting and encouraging everyone to come forward for the second dose of the AstraZeneca vaccine when it arrives.”..."
  },
  {
    "headline": "When Oredo Corpers Defiled Rain to Keep Benin City Clean – Nigerian Observer",
    "summarized_story": "The disciplinary NYSC officials in Oredo have not doubt instilled discipline in the serving Corps member which has put the Corps members always on the go when duty calls.\nSo when the Corpers’ Liaison Officer (CLO), Afemi Samson posted a reminder on the WhatsApp group that reads:“Attention Corps members, there will be a National Environmental Sanitation Day!\nOn Saturday, 17th July, corpers serving within Benin metropolis were spotted in every nook and cranny of the town carrying out sanitation.\nCorps members are expected to use one day in a week for group CDS activities.\n___________________________________________________________________________________________________________________Sinafi Omanga is a serving Corps member with The Nigerian Observer, Benin City."
  },
  {
    "headline": "NIDO President, Odibo, renowned pharmacist, Prof. Odidi, others make list of steering c’ttee to set up Edo Diaspora Agency – Nigerian Observer",
    "summarized_story": "The governor had, on Thursday, 5th August 2021, inaugurated the Edo State Head of Service, Anthony O. Okungbowa Esq., as the chairman of 8-man Steering Committee for the setting up of the Diaspora agency, while Mr. Isaac Ebewele serves as secretary.\nOdibo, with over 28 years of cross-industry experience in Consulting, IT/Telecom and Finance in Switzerland is currently a senior consultant at Itau Private Bank Zurich.\nProf. Odidi, who trained at Harvard University, University of London, University of Toronto, and Ahmadu Bello University, is an innovator who co-founded Intellipharmaceutical International Inc., which is listed and trading on two international stock exchanges in the USA and Canada.\nHe has a proven track record and experience in innovation, drug development, testing, clinical trials, regulatory and drug manufacturing.\nThe committee is expected to complete its assignment within a period of thirty (30) days and submit a report to the Edo State Government."
  },
  {
    "headline": "EPL: Brentford 2-0 Arsenal: Onyeka’s Bees sting Gunners",
    "summarized_story": "ADVERTISEMENTThe 2021/22 EPL season kicked off at the Brentford Community Stadium between the newbies and one of the league’s oldest statesmen.\nIt was a sweet strike from the edge of the Arsenal box after Calum Chambers failed to properly get rid of the ball.\nArsenal have thus started the new season poorly after they ended last season in a dismal eighth position despite five consecutive wins to end the season.\nFor a few hours, Brentford are top of the EPL with three points and a clean sheet.\nAt the end of 90 minutes, Brentford manager Thomas Frank was conducting the crowd to ‘we are top of the league’.The Bees show their sting very early – all opponents beware because Brentford are buzzing for the oncoming challenge."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari returns from UK medical vacation",
    "summarized_story": "President Muhammadu Buhari on Friday returned to Nigeria from London, United Kingdom, after undergoing medical checkup.\nBuhari left Nigeria for the United Kingdom on July 26 to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025, after which he stayed behind to undergo medical checks.\nPresident Buhari appeared on a panel of discussants with a live audience alongside his counterparts from other African countries including President Kenyatta, President Nana Akufo-Addo (Ghana), President Faure Eyadema (Togo) and President Lazarus Chakwera (Malawi).\nAt the summit, President Buhari pledged to increase the budget for the education sector in Nigeria by as much as 50 per cent over the next two years.\nPresident Buhari held bilateral meetings with British Prime Minister Boris Johnson and the Commonwealth Secretary-General, Baroness Patricia Scotland, at the sidelines of the Global Education Summit."
  },
  {
    "headline": "BREAKING: Ahmed Joda dies at 91",
    "summarized_story": "Super permanent secretary and elder statesman, Alhaji Ahmed Joda, has died, aged 91.\nFamily sources said he died at the Federal Medical Centre, Yola, Adamawa State capital on Friday and arrangements for his burial are currently ongoing.\nJoda is an administrator who rose through the administrative cadre of the Northern regional government and then the federal civil service to retire as Permanent Secretary, Ministry of Industries.\nHe was considered to be among a group known as super Permanent Secretaries secretaries in the 70s.\nJoda chaired the transition committee of President Muhammadu Buhari in 2015."
  },
  {
    "headline": "SEC says Nigeria’s unclaimed dividends now N170bn",
    "summarized_story": "The Securities and Exchange Commission (SEC) on Friday said the total unclaimed dividends in the Nigerian capital market stood at N170 billion as of December 2020.\nThe Director-General, SEC, Mr Lamido Yuguda, said this at the second post-Capital Market Committee (CMC) virtual news conference, NAN reported.\nAccording to him, the figure had increased compared with N158.44 billion total unclaimed dividends as of December 2019.\nThe increase, he attributed to identity management and multiple subscriptions of investors.\nHe noted that the commission constituted a Committee on Identity Management for the Nigerian Capital Market in June in order to address the unclaimed dividend issue."
  },
  {
    "headline": "Northern coalition vows to reclaim lands from herdsmen",
    "summarized_story": "A coalition of Northern groups under the auspices of Conference of Authoctonous Ethnic Nationalities Communities Development Associations (CONAECDA), has vowed reclaim lands seized from communities by herdsmen, just as said it would repel further attacks and killings in their region.\nThe organisation which has a coalition of 400 indigenous groups spread across 15 Northern states, said Thursday, that it will put an end to wanton killings and all forms of criminality in the North.\nThe statement was made at a press conference in Jos on Thursday, by the Secretary-General of the group, Suleman Sukukum.\nOur ability to farm, attend school and carry out our legitimate businesses is being denied by these terrorist activities.\n“The CONAECDA conference had decided to immediately commence a project to secure, reconstruct and protects such communities."
  },
  {
    "headline": "BBNaija6: Your bad boy energy makes me feel uncomfortable around you, Saskay tells Cross",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Saskay, has revealed that she gets uncomfortable whenever Cross is around her.\nIn a discussion between the duo on Friday, Saskay said that she feels uncomfortable around Cross because of his ‘bad boy energy’.\nCross, however, said that Saskay also has ‘bad girl energy’ and she went on to explain what her energy was all about.\nI’m not a sexual person in public so I feel uncomfortable around people that are so comfortable either talking or being all sexual around everybody.\n“So I feel uncomfortable around you because I felt like you’re all about the ‘bad boy sexual energy.’”Cross responded, “The thing is that I’m very comfortable with my sexuality but guess what?"
  },
  {
    "headline": "BBNaija6: Your bad boy energy makes me feel uncomfortable around you, Saskay tells Cross",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Saskay, has revealed that she gets uncomfortable whenever Cross is around her.\nIn a discussion between the duo on Friday, Saskay said that she feels uncomfortable around Cross because of his ‘bad boy energy’.\nCross, however, said that Saskay also has ‘bad girl energy’ and she went on to explain what her energy was all about.\nI’m not a sexual person in public so I feel uncomfortable around people that are so comfortable either talking or being all sexual around everybody.\n“So I feel uncomfortable around you because I felt like you’re all about the ‘bad boy sexual energy.’”Cross responded, “The thing is that I’m very comfortable with my sexuality but guess what?"
  },
  {
    "headline": "EFCC Arrests 42 Suspected Internet Fraudsters in Anambra, Enugu",
    "summarized_story": "By JUMOKE SANNIOperatives of the Enugu Command of the Economic and Financial Crimes Commission, EFCC have arrested 42 suspected internet fraudsters in separate operations in Awka and Enugu.\nTwenty-nine (29) of the suspects were arrested in Awka while thirteen (13) were arrested in Enugu following intelligence on their alleged involvement in internet fraud.\nThe suspects are: Chimezie Anyamutaku, Chinonso Dominic, Onyekachi Nwankwo,Ikenna Austin, Chinonso Anthony Caesar,Felix Okechukwu Chikagu, Dera Okoye, Victor Onyebuchi, Emmanuel Ifeanyi,Emeka Izu John, Raphael Gbughemobi,Okorie Charles,Onyeoji Chukwuemeka,Enem Bontis Obinna Udoka,Chibueze Udechukwu Ofor, Lawrence Oyegu, Soburu Kingsley, and Ikechukwu Umeakunne.\nOthers include Pascal Benjamin,Emeka Valentine,Nzube Kenneth Paul, Kelechi Elvis,Emmanuel Nwugo, Henry Onyebuchi Okoli,Uchechukwu Kachi ,Onyekachi Promise,Innocent Victor Ikenna ,Ekene Emmanuel, Chisom Nwora, Emmanuel Dimgba, Martin Chukwudalu, Nweze Desmond, Franklin Archibong, Austin Ikpeoha, Arinze Osakwe, Chukwuemeka Franklin, Emmanuel Murewa, Echefulam Uche, Ugochukwu Eze, Goodman Samuel, Emmanuel Nwoye and Ekene Udeh.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "EFCC Arraigns Serial Fraudster, Al-Ameen Idris, One Other for N10.7m Fraud",
    "summarized_story": "Prosecution counsel, Haruna Abdulkadir asked the court for a trial date and to remand the defendants in a Correctional Facility.\nB Usman applied orally for the bail of his clients which was opposed by the prosecution and subsequently refused by the court.\nShe adjourned the matter till September 23, 2021 for hearing and ordered that the defendants be remanded at the Correctional Centre.\nThe offence is contrary to and punishable under Sections 311 and 312 of the Penal Code Laws of Borno State Cap 102 Vol.\nJustice Fadawu adjourned the matter till September 14, 2021 for commencement of trial and ordered for the remand of the defendant at the Maiduguri Medium Custodial Centre."
  },
  {
    "headline": "Breaking: Buhari returns from London (Photos)",
    "summarized_story": "Nigeria’s President, Muhammadu Buhari returned to Abuja from London, the United Kingdom on Friday evening.\nThe president had travelled to London on July 26 for two weeks to see his doctor and attend other meetings.\nHe was received by the Chief of Staff, Prof. Ibrahim Gambari and some members of the executive council on arrival at the Nnamdi Azikiwe International Airport, Abuja.\nSee photos below:The president had travelled on July 26 to London and while in the UK, he attended the Summit co-hosted by the Prime Minister of the United Kingdom, Boris Johnson, and the President of Kenya, Uhuru Kenyatta.\nThe summit brought together Heads of State and Government as well as stakeholders and youth leaders, and provided a platform for partners to chart a way forward towards transforming education systems in partner countries, through exchange of best practices."
  },
  {
    "headline": "Arteta begs Arsenal fans after Brentford shock loss",
    "summarized_story": "By AbankulaArsenal coach Mikel Arteta apologised to the club’s fans on Friday following a shocking 2-0 defeat to Premier League debutants Brentford.\nFans unable to stomach the loss began the campaign to get Arteta out of the club.\n“I apologise for the result and we know that we have to improve”, Arteta said at his post match press conference.\n‘We have two big games coming up right now and we need to a different performance to get a different result.’Arsenal spent about £70million on new arrivals Ben White, Albert Sambi Lokonga and Nuno Tavares.\nThough the team did not feature two key forwards, Pierre-Emerick Aubameyang and Alexandre Lacazette, fans could not understand why they lost woefully at Brentford."
  },
  {
    "headline": "Civil Servants Should Own Homes –Vice President Osinbajo Says",
    "summarized_story": "Vice President Yemi Osinbajo believes that every public servant deserves to own a home, which is why the Nigerian Civil Service needs to be reformed.\nThe vice president remarked after getting a briefing on the Federal Civil Service Strategy and Implementation Plan 2021-2025 at the Presidential Villa in Abuja, according to Osinbajo’s spokesman, Laolu Akande.\nThe presentation was made by the Head of the Civil Service of the Federation, Dr Folashade Yemi-Esan.\nThe meeting is a presidential level briefing of the reform process of the Federal Civil Service which has been on since 2017.\nYemi-Esan also presented a report on the implementation status of the Federal Civil Service Strategy Plan 2017-2021."
  },
  {
    "headline": "Elder Statesman Who Headed Buhari’s 2015 Transition, Ahmed Joda Dies",
    "summarized_story": "Ahmed Joda, a northern elder statesman who also served on President Muhammadu Buhari’s 2015 Transition Committee, has died.\nJoda’s death was confirmed by a statement from several friends and family members on Friday.\nThe elder statesman was a retired Permanent Secretary, Ministry of Industries, and rose to become one of the super Permanent Secretaries under the military government of Gen Yakubu Gowon (retd.)\nHe was also a member of the 1988 Constituent Assembly which planned the constitutional transition of the Third Nigerian Republic.\nIn 1999, he was appointed in the committee to advise the Olusegun Obasanjo’s Presidency on Poverty Alleviation and in 2015, he headed the Muhammadu Buhari presidential transition"
  },
  {
    "headline": "BREAKING: Buhari Returns To Abuja After UK Trip [PHOTOS]",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja, after attending a global summit on improving funding for education, held in the United Kingdom.\nThe president had travelled to the UK in late July for the summit.\nIn an earlier statement announcing the president’s activities in the UK, Femi Adesina, presidential spokesman, said Buhari also scheduled a medical appointment in London.\nThe president’s plane touched down at the presidential wing of the Nnamdi Azikwe International Airport, Abuja, around 6pm on Friday.\nPresent at the airport to receive Buhari were Ibrahim Gambari, chief of staff; Babagana Monguno, national security adviser; Lucky Irabor, chief of defence staff (CDS), among others."
  },
  {
    "headline": "Stop Pampering Surrendered Boko Haram Terrorists – Senator Ndume Tells Nigerian Army",
    "summarized_story": "Senator Ali Ndume, the Chairman of the Senate Committee on Army, has stated that surrendered Boko Haram militants should not be granted blanket amnesty or pampered by the Nigerian Army.\nThe repentant terrorists, according to Ndume, who represents Borno South Senatorial District, should not be rewarded with a pat on the back.\nSenator Ndume said he was not surprised at the development due to the hostile environment the troops had created for the terrorists.\n“It is only that, as I have said before, there shouldn’t be blanket amnesty and pampering treatment to those who have surrendered,” Ndume said.\nThe federal lawmaker was of the opinion that the army should be more focused on ensuring that the Boko Haram war was brought to an end even faster than it had been projected in various quarters."
  },
  {
    "headline": "Breaking: Arsenal succumb to Brentford defeat in Premier League opener",
    "summarized_story": "Brentford celebrated their return to the top tier after a 74-year absence with a memorable, magnificent victory over woeful Arsenal as they opened their Premier League campaign in style.\nArsenal, without strike pair Alexandre Lacazette and Pierre-Emerick Aubameyang through illness, paid the price for a hopeless attempt to defend substitute Mads Sorensen’s routine long throw.\nBrentford could not have made a better start to life in the Premier League, showing the pedigree that has made them such an entertaining side on their journey to this stage.\nOnce they realised Arsenal had little offer after the early exchanges, Brentford took charge and Bryan Mbeumo had already struck the post before Canos opened the scoring.\nNo-one can begrudge them their victory – and the manner in which they revelled in it."
  },
  {
    "headline": "Ex-super perm sec, Ahmed Joda, is dead",
    "summarized_story": "A former super permanent secretary and one of Nigeria’s elder statesmen, Ahmed Joda, is dead.\nConfirming the death, Mohammed Baba, a long time associate of Joda told our reporter that the elder statesman died Friday afternoon.\nAhmed Joda was born in Girei local government area of Adamawa State 91 years ago.\nAfter completing his secondary education in 1948, Ahmed Joda was admitted to Moor Plantation, Ibadan.\nIn 1967, he became a federal permanent secretary in the Ministry of Information and subsequently moved to Lagos."
  },
  {
    "headline": "ACF, Afenifere, Ohaneze, others still believe in Nigeria -NIPR boss",
    "summarized_story": "He said, “The socio-cultural groups, we know the role they play in terms of generating and sustaining narratives.\n“As of today, we have had sit-downs with Arewa Consultative Forum (ACF), Middle Belt Forum, PANDEFF, Afenifere, Northern Elders Forum, and we are meeting with Ohaneze Ndigbo sometime next week in Enugu.\nSirajo, who lamented the lack of trust among the various ethnic and religious groups in Nigeria, attributed the same to lack of communication.\nSpeaking, the publisher thanked NIPR for intervening in the situation in the country.\nHe said, “I want to thank you for this intervention you are doing to make sure that we have security in Nigeria."
  },
  {
    "headline": "NIG @60: ALGON President applauds initiative to foster economic growth -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "NHGSFP: Humanitarian Commenced the physical verification, capturing of Data of Primary School Pupils in Nasarawa -NigPilot",
    "summarized_story": "Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq has commenced the physical verification and capturing of 196,878 primary school pupils in Nasarawa state is ongoing National Home Grown School Feeding program NHGSFPIn a statement signed by Adeyemo Felicia, chief information officer to Deputy Director information to the Minister said.\nThey are: the Conditional Cash Transfer CCT, the N-Power, the National Home Home Grown School Feeding Programme NHGSFP and Government Entrepneure Progamme GEEP.\nNine 9 Million’s pupils are currently benefiting from one free nutritious meals a day during the school term nationwide.\nShe noted that the Ministry now has the mandate of reaching an additional 5 million pupils by 2023.\nYakubu Habiba, a Food Vendor at RCM primary school Eggon, expressed his gratitude to the Federal Government for engaging and empowering them."
  },
  {
    "headline": "Abducted Niger state Information Commissioner released -NigPilot",
    "summarized_story": "The Niger State Police Command has said the abducted Commissioner for Information, Mohammed Sani Idris, has regained freedom” The Niger state police command wishes to inform members of the public that the abducted Commissioner for information, Hon Mohammed Sani Idris has been released by his abductors and successfully rescued unhurt.”The state Police Public Relations Officer, PPRO, Wasiu Abiodun, DSP, said on 8/08/2021 at about 2345hrs, the said victim was abducted by unknown gunmen in his residence at Babban-Tunga village, Tafa LGA of the state.\nThe PPRO said on the receipt of the incident, the Command immediately mobilized a joint Police, military, and vigilante team to the area for a manhunt of the hoodlums with a view to rescue the victim and arrest the culprits.\n” However, as a result of sustained pressure and trailing of the hoodlums by the joint team, the victim was released by the abductors on 12/08/2021 at about 2130hrs and surfaced at Kofa Dam area of Tafa LGA.\nHe was later debriefed and immediately taken to a hospital for medical attention."
  },
  {
    "headline": "Photo Op of the Flag off of construction of access road and car park of the Kagini Train Station -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "President Buhari Returns From UK Trip",
    "summarized_story": "﻿President Muhammadu Buhari has arrived in the country after a two-week trip to the United Kingdom.\nThe President had travelled to attend the Global Partnership for Education (GPE) organised Global Education Summit (GES) before undergoing a scheduled medical check-up.\nIn the weeks President Buhari spent in the UK, he met and played host to various dignitaries including the UK Prime Minister, Boris Johnson, who gave an assurance that the UK is available to assist Nigeria in its war against terrorism.\nNwajiuba disclosed this on Tuesday when he made an appearance on Channels TV’s Politics Today.\nWhile in London, President Buhari also met with a chieftain of the All Progressives Congress (APC) Bola Tinubu, in the wake of the recent crisis rocking the party."
  },
  {
    "headline": "All Civil Servants Ought To Own A Home – Osinbajo",
    "summarized_story": "Prof Osinbajo reportedly made the comment on Thursday at the Presidential Villa when he received a brief on the Federal Civil Service Strategy & Implementation Plan 2021-2025, presented by the Head of the Civil Service of the Federation, Dr Folashade Yemi-Esan.\nThe meeting is a Presidential Level Briefing of the reform process of the Federal Civil Service which has been on since 2017.\nA civil servant ought to be able to own a home, and justify to his family the reason why he went for the job”.\nThe Head of the Civil Service of the Federation also presented a report on the implementation status of the Federal Civil Service Strategy Plan 2017-2021.\nThe Head of the Civil Service of the Federation said the current reform in the Federal Civil Service has enabled government to save huge sums through the verification of personnel payroll and digitization of some operations, among others."
  },
  {
    "headline": "Medical Consultants To Meet Over Planned Strike As Govt Fails To Meet Demands",
    "summarized_story": "The Medical and Dental Consultants’ Association of Nigeria (MDCAN) are considering whether to embark on industrial action, ahead of a planned meeting on Sunday.\nThis comes as Nigerians struggle for medical treatment across government facilities amid the ongoing nationwide strike by members of the National Association of Resident Doctors (NARD).\nThe senior medical practitioners had issued a 21-day ultimatum to the Federal Government, which is set to expire on August 16.\n“MDCAN issued an ultimatum to (the) government – a 21-day ultimatum that is going to expire on Monday,” Ozoilo told Channels Television.\nAccording to the MDCAN president, the government has failed to meet the demands made by the medical association."
  },
  {
    "headline": "Taliban Close In On Kabul As Embassies Prepare For Evacuations",
    "summarized_story": "The evacuation orders came as the Taliban took control of Kandahar — their spiritual heartland and the nation’s second-biggest city — leaving only Kabul and small pockets of holdouts in government hands.\nPul-e-Alam, capital of Loghar province, was the latest city to fall Friday, putting the Taliban just 50 kilometres (30 miles) from Kabul.\nThe Mujahideen reached Martyrs’ Square,” a Taliban spokesman tweeted, referring to a city landmark.\nHours later, the Taliban said they had also taken control of Lashkar Gah, the capital of neighbouring Helmand province.\nOther nations, including Denmark, Norway, and Germany, announced their Kabul embassies would be temporarily shuttered or operations reduced due to security concerns."
  },
  {
    "headline": "Abducted Wife, Baby Of Former Zamfara Councilor Regain Freedom",
    "summarized_story": "Wife of the former councilor of Tundunwada ward of Gusau local government of Zamfara State, Babangida Damba and her eight month old baby have regained their freedom.\nThe duo were abducted by unknown gunmen on Wednesday at their residence in Damba Area of Gusau.\nAccording to sources close to the family, the kidnapped victims were released on Friday evening after spending more than 48 hours in captivity.\n“Alhamdulillah, Glory be to Allah, my wife and my baby regained freedom,” the former councilor, Babangida Haruna, posted on his Facebook page.\nIt is not clear whether a ransom was paid before the duo were released."
  },
  {
    "headline": "President Muhammadu Buhari returns to Abuja after UK Trip",
    "summarized_story": "President Muhammadu Buhari has returned to Nigeria from London after attending the Global education summit in the United Kingdom.\nMr. President also used the opportunity of the trip to see his doctors and carry out a routine medical checkup.\nDuring the global education summit, co-hosted by Britain’s prime minister Boris Johnson and Kenya’s President Uhuru Kenyata President Buhari appeared on a panel of discussants with a live audience alongside other African leaders.\nAdvertisementThe president also committed to progressively increase the country’s annual domestic education expenditure by fifty percent over the next two years and up to one hundred percent by 2025 beyond the 20 percent global benchmark.\nPresident Buhari left the country on the 26th of July, he spent 18 days outside the country,The President is also expected to travel to Kano to attend his Son’s wedding to the daughter of the Emir of Bichi"
  },
  {
    "headline": "Elder Statesman, Ahmed Joda, dies at 91",
    "summarized_story": "Elder statesman, Ahmed Joda has died at the age of 91 in Yola, capital of Adamawa State.\nThe former Permanent Secretary started out early as a journalist before climbing the administrative ladder to serve many Nigerian leaders, public institutions and most recently, heading the 2015 Presidential Transition Committee.\nA family source confirmed the death to newsmen in Yola.\nThe source said, “Inna Lillah wa inna ilaihi Rajiun.\nAlhaji Ahmed Joda has just died in Yola.”AdvertisementThe cause of his death is still unknown."
  },
  {
    "headline": "Governor Tambuwal mourns former President Shagari’s wife",
    "summarized_story": "Sokoto state Governor, Aminu Tambuwal has condoled with the family of President Shehu Shagari over the demise of the wife of the former President Hadiza Shehu Shagari.\nGovernor Tambuwal in a condolence message he personally signed described the passing away of Hadiza Shagari as a great loss, not only to the respected Shehu Shagari family but certainly to Sokoto State and Nigeria as a whole.\nThe governor expressed deep sadness over the passing away of Hadiza Shehu Shagari whom he described as mother to the people of Sokoto and the nation at large.\nThe Governor prayed that Allah (SWT) to grant the family, associates and all of the people of Sokoto and Nigeria the fortitude to bear the loss of this mother and matriarch.\nAdvertisementHe also prayed that Allah in His infinite mercy, forgive Hadiza Shehu Shagari and grant her eternal bliss."
  },
  {
    "headline": "Okupe: Nigeria’s Political Parties Taking People for Granted, Performance Abysmally Poor",
    "summarized_story": "As the tension continues to subside in Nigeria’s main opposition party, the Peoples Democratic Party all eyes ard now on the October Convention initially fixed for December.\nWith the latest development, embattled National Chairman of the party, Prince Uche Secondus, will no longer be forced to resign as being canvassed by some members of the National Executive Committee, National Working Committee, House of Representatives Caucus, youths and governors.\nAs rumoured, the October convention will most likely present a new Chairman for the party, who will come from the northern region of Nigeria.\nThis should pave the way for a southern region presidential zoning arrangement for the 2023 general election in Nigeria.\nTo discuss the political intrigues in PDP ahead of the 2023 elections, is Dr. Doyin Okupe, a Nigerian physician and politician, was on Friday’s Morning Show."
  },
  {
    "headline": "Trending: Pastor Snatches Church Member’s Wife",
    "summarized_story": "A Ghanaian clergywoman, Akua Ofori-Boateng, stunned the members of her church recently when she made them sing along to Nigerian singer, Teni The Entertainer’s song, Case.\nIn a video shared on her Instagram page, the clergywoman can be seen with her choristers singing and dancing to the song during their church service.\nMeanwhile in Nigeria, another top Boko Haram Senior Commander Amir Adamu Rugu and his family surrendered to troops of operation Hadin Kai in Gwoza Local Government Area of Borno state.\nFinally, reactions continue to trail the story of Pastor Moses Adeeyo who snatched and married the wife of his church member Tina Bright, now Tina Adeeyo."
  },
  {
    "headline": "Vote Count Begins in Zambia’s Closely Fought Elections",
    "summarized_story": "Electoral officials in Zambia has commenced vote counting following the successful staging of the southern African nation’s general elections.\nSome voters complained about the slow pace of voting in an election that is seen as a test of Zambia’s democracy.\nPresident Edgar Lungu deployed more troops in parts of the country to quell election violence in the tightly contested polls pitting him against long-time rival Hakainde Hichilema.\n“How can you talk about free and fair elections when our opponents have taken this election as war?” he said.\nAddressing opposition fears of fraud, Hichilema said Zambia’s next leader “must be determined by the… voters, not the people who count the votes”."
  },
  {
    "headline": "South Africa Wants More Men to Take Covid Jabs",
    "summarized_story": "South Africa has urged more men in the country to come out in larger numbers and take Covid jabs as their numbers trails that of women.\nAbout 60% of vaccines have been administered to women, health officials noted on Friday during a media briefing on the government’s efforts in the fight against the disease.\nHealth Minister Joe Phaahla ruled out the easing of Covid restrictions despite a “downward trend” in infections.\nSouth Africa has so far registered 2,568,511 cases of Covid and 76,243 deaths.\nIt has the most cases in Africa."
  },
  {
    "headline": "Sudan, ICC Sign Cooperation Deal, as Darfur Trials Inch Closer",
    "summarized_story": "Sudan has signed a cooperation deal with the International Criminal Court, a step further towards ex-dictator Omar al-Bashir facing trial for genocide in the Darfur conflict.\nBashir, 77, has been wanted by the ICC for more than a decade over charges of genocide, war crimes and crimes against humanity in the Sudanese region.\nTwo other former aides are also wanted to face war crimes charges.\nThe ICC issued an arrest warrant for Bashir in 2009 for war crimes and crimes against humanity in Darfur, later adding genocide to the charges.\nBashir is jailed alongside two other former top officials facing ICC war crimes charges — ex-defence minister Abdel Rahim Mohamed Hussein and Ahmed Haroun, a former governor of South Kordofan."
  }
]