[
  {
    "headline": "Plant, nurture trees, UNIOSUN orders new students",
    "summarized_story": "The directive was given to the students during the matriculation ceremony held simultaneously in the six colleges of the university.\nAddressing the new students at the Osogbo main campus of the university, the Vice-Chancellor, Prof ‘Labo Popoola, said after planting the trees, the students must nurture them till they exit the institution.\nHe said, “As a student of this institution, you are expected to plant a tree to mark your entrance into our community.\n“I implore you to stay away completely from any act of drug abuse, cultism and the likes, because the university has zero tolerance for these vices.\nIf you are caught, the university will not hesitate to apply appropriate sanctions, which may include summary dismissal.”"
  },
  {
    "headline": "ECOWAS Heads Of State to meet over Mali coup",
    "summarized_story": "He condemned the military coup in Mali led by Col. Asimi Goita on Monday.\nThe deposed President and Prime Minister were reported to have resigned on Wednesday and released on Thursday.\nSpeaker of the ECOWAS Parliament Hon.\nHe added that the Parliament, like other ECOWAS Institutions, has taken several steps to restore democratic rule in Mali.\n“The ECOWAS Parliament stands ready to support all efforts aimed at putting Mali on the right trajectory of peace and democracy,” he added."
  },
  {
    "headline": "STATE OF THE NATION: Parts of Nigeria experiencing civil war",
    "summarized_story": "Also, former president of the Nigeria Bar Association, NBA, Wole Olanipekun, SAN, has advocated true federalism and immediate reform in the judicial system, among others.\nBut Falana, in his presentation, said: “Our country is ruled by the rule of the rulers, and not rule of law.\nIf you don’t want people to break away from Nigeria, we must give them confidence and a sense of belonging, don’t declare war.\nConstitution Review waste of public funds —AfenifereMeanwhile, Afenifere’s Secretary-General, Mr. Sola Ebiseni, who addressed newsmen in Akure, said an amendment of the constitution will not cure the anomalies in the country.\n“Every session of the two arms of the National Assembly, since 2007, has embarked on the same jamboree of constitutional amendment spending public funds on public hearings, without any result."
  },
  {
    "headline": "PDP alleges killings of its members in Ebonyi",
    "summarized_story": "Kindly Share This Story:…Allegation is false —APC Chairman, Ebonyi…People should stop dragging govt into every issue — Commissioner…Activist declared missing in EbonyiBy Peter Okutu & Dirisu YakubuThe Peoples Democratic Party, PDP, yesterday, raised the alarm over alleged killings of its members in Ebonyi state.\n“During a recent courtesy call on the governor of Ebonyi State, Engr.\nAmos Ogbonnaya, who refused to join Governor Umahi to the APC was abducted and later released with life threatening injuries after much public outcry.\n“Governor Umahi’s suppressive government is now sealing off homes and businesses of PDP members all in a bid to cow and silence them.\nIt is not only APC people that my office is to protect; the state government is protecting every citizen of Nigeria in Ebonyi State."
  },
  {
    "headline": "Rehabilitation: Lagos to shut Eko Bridge for 9 weeks",
    "summarized_story": "Kindly Share This Story:By Olasunkanmi AkoniTHE Federal Government, in collaboration with Lagos State Government, yesterday, said it would commence emergency repairs of the National Stadium bound of Eko Bridge from Costain to Alaka, with partial closure from Friday, June 4 to Friday, August 13, 2021.\nOladeinde said: “Pending the commencement of the rehabilitation works, alternative routes have been made available for the awareness of motorists, to manage traffic during the period of repairs, as highlighted follows: traffic from Apongbon to Alaka, stadium, inner Surulere or Ikorodu Road, will be diverted to Eko Bridge to access Costain Roundabout to Iponri, through Alaka and Funso Williams Avenue.\n“Similarly, motorists from Eko bridge will have to navigate their desired destinations through Costain Roundabout to Abebe Village( by Nigerian Breweries Plc) through Eric Moore to Bode Thomas to Adeniran Ogunsanya, to access Shitta Roundabout by Stadium under the bridge to Funso Williams Avenue to Dorman-Long Bridge and Fadeyi-Ikorodu Road.\n“Motorists can gain access to Apongbon through CMS Outer Marina Road to connect Ebute Metta Ikorodu Road to access their destinations.\nApongbon through CMS to Outer Marina to Adeniji Adele, Third Mainland Bridge, Adekunle to Herbert Macaulay Way, Jibowu and Ikorodu road will also be available.”“Similarly, traffic directions and road signals will be made available to minimize inconveniences that may be experienced while the construction work lasts.”Kindly Share This Story:"
  },
  {
    "headline": "INSECURITY: SARS disbandment creating vacuum —IGP",
    "summarized_story": "The Police boss said that parading of suspects was a way of updating the public on their efforts to curb criminality.\nAnd if we have a reasonable belief that there are those who need to be relocated we will do that.\nWhile in the North-West it is also almost the same banditry, activities of Boko Haram, kidnapping and proliferation of arms.\nThe first operation in the South-East was done on the 18th of this month (May) in Enugu.\n“ In terms of arrest, we have 398 armed robbery suspects in our custody, 258 cult related offenders, 222 murder suspects, 202 bandits related matters and the 86 suspects involved in case of kidnapping."
  },
  {
    "headline": "20 Generals may go as Buhari appoints Farouk Yahaya as new COAS",
    "summarized_story": "Kindly Share This Story:…His appointment as Regular Course 37 officer wipes out Course 35, 36 intakesBy Kingsley OmonobiPresident Muhammadu Buhari yesterday appointed Major-General Farouk Yahaya as the new Chief of Army Staff, with about 20 Generals of Regular Course 35 and 36 expected to proceed on retirement.\n20 Course 35, 36 generals face instant retirementThe implication is that about 20 Major-Generals and Brigadier-Generals made up of five remaining Regular Course 35 intakes and 15 Regular Course 36 intakes would have to give way (proceed on retirement).\nAt several times, he was Military Secretary, (MS) Army at Army headquarters and Brigade Commander, 4 Brigade, Benin, as a Brigadier-General.\nThe new Chief of Army Staff was born on January 5, 1966, in Sifawa, Bodinga Local Government Area of Sokoto State.\nHe was Director, Manpower at Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) 1 Division of the Nigerian Army."
  },
  {
    "headline": "BREAKING: Unknown gunmen attack police station, kill two officers in Delta",
    "summarized_story": "Unknown gunmen at about 2 am Friday morning allegedly attacked Umutu Police Divisional Headquarters in Ukwuani Local Government Area of Delta State.\nIt was not clear if the gunmen carted away arms and ammunition from the police station.\nIt was learnt that the gunmen stormed the Community from Ndemili axis to wreak havoc on the Police Station.\nWhen contacted for comments at about 7:13 am, the Delta State Commissioner of Police, CP Ari Muhammed Ali said,”No comments for now.\nAs at the time filings this report, there is serious tension in Umutu community."
  },
  {
    "headline": "Devaluation of Naira, COVID-19 pandemic affecting road construction in Nigeria",
    "summarized_story": "The contractor handling Ibadan/ Iseyin Road has declared that the continued devaluation of Naira and COVID-19 pandemic were negatively affecting road construction in Nigeria.\nChamoun who spoke on behalf of Kopek Construction on Thursday in Ibadan said that devaluation of Naira, COVID-19 and the ENDSARS protests which took place last year affected construction of roads in the country.\nHe said that project which are supposed to be completed in eleven months could not be completed as promised due to the devaluation of Naira, COVID-19 pandemic, ENDSARS protests and lockdown in some states last year.\n“As I told you, devaluation of naira is a big challenge that we faced.\n“The challenges of lockdown, devaluation of Naira, ENDSARS and COVID-19 pandemic."
  },
  {
    "headline": "I will bequeath a better Nigeria to you",
    "summarized_story": "President Muhammadu Buhari celebrated the 2021 Children’s Day with a promise to bequeath a better Nigeria to the present and future generations.\nThe Nigerian leader hosted a group of kids at the State House on Thursday as part of the activities to mark the day.\nBuhari described children as “precious blessings who should be nurtured to carry the burden of society in the future”.\nThe President also received another group of children from Borno State.\nBuhari had a photo with his guests and Vice President, Yemi Osinbajo who led them."
  },
  {
    "headline": "Worsening insecurity in FCT traced to lack of CCTV, street lights, others",
    "summarized_story": "The deteriorating security situation in the Federal Capital Territory, particularly the satellite towns may not be unconnected to poor infrastructure in the nation’s capital.\nAnother essential amenity lacking in the city that could also help in tracking criminal activities is the solar street lights.\nSome of the satellite towns where insecurity is currently ravaging include, Bwari; Kubwa; Karshi; Kuje; Kusaki–Yanga; Dobi; Anagada and Gosa.\nSome residents who spoke with DAILY POST correspondent identified lack of CCTV as part of the factors fueling insecurity in the FCT, Abuja.\nThe rest satellite towns always struggle with criminals at night."
  },
  {
    "headline": "Children’s Day: School children accuse Cross River govt of abandoning, neglecting them",
    "summarized_story": "School children in Cross River State on Thursday lamented the State government’s failure to organise Children’s Day celebration in the State.\nThe children were frustrated as there was no Children Day celebration in Calabar, Cross River State to mark the children’s Day.\nDAILY POST correspondent who was at the U. J. Esuene’s stadium, venue of the celebration observed that thousands of school children from various schools across the state were at the stadium.\nI am in Abuja, may be you will direct your question to the Commissioner for Education or Commissioner for Women Affairs.\nWe all participated in it when we were young amd we have no reason as a government to deny our children of this."
  },
  {
    "headline": "CSCS eyes diversification to drive growth",
    "summarized_story": "By Collins NwezeThe Central Securities Clearing System (CSCS) Plc is optimistic of improved returns to shareholders as the ongoing diversification of its businesses and investments in human resources are expected to drive sustainable growth in the years ahead.\nIts Managing Director, Mr. Haruna Jalo-Waziri, who spoke at the company’s Annual General Meeting (AGM), said CSCS has laid a solid foundation that should provide a viable base for improved performance in the years ahead.\n“More importantly, we are enthusiastic on the progress made thus far in repositioning the business to efficiently play a more active and leading role in deepening the capital market.\n“I congratulate the Board and shareholders of CSCS on the impressive performance during the 2020 financial year and more importantly for a successful General Meeting,” Idiong said.\nCSCS afforded shareholders who nominated proxies for physical attendance to observe proceedings of the general meeting via Zoom and YouTube, as the event was streamed live throughout the session."
  },
  {
    "headline": "Sugar policy to earn Nigeria $700m yearly, says Dangote",
    "summarized_story": "By Taofik Salako, Deputy Group Business EditorChairman, Dangote Sugar Refinery (DSR) Plc, Alhaji Aliko Dangote, yesterday urged government to faithfully implement the national backward integration policy in the sugar industry as the implementation will bring foreign exchange of up to $700 millon yearly from sugar production self-sufficiency.\nGroup Managing Director, Dangote Sugar Refinery (DSR) Plc, Mr. Ravindra Singhvi, said the sugar group continued on the growth path with commitments to improve performance and generate value for all stakeholders.\nADVERTISEMENT“Our Backward Integration goal is to become a global force in sugar production, by producing 1.5M MT/PA of refined sugar from locally grown sugar cane for the domestic and export markets.\nDangote Sugar Refinery is Nigeria’s largest producer of household and commercial sugar with 1.44M MT refining capacity at the same location.\nThe Nasarawa Sugar Company Limited, is the registered subsidiary of Dangote Sugar Refinery Plc."
  },
  {
    "headline": "ABCON: ‘Corporate governance compliance key in BDCs’ operations’",
    "summarized_story": "By Collins NwezeAssociation of Bureaux De Change Operators of Nigeria (ABCON) has urged Bureaux De Change (BDC) to carry out their operations in line with sound corporate governance practices for sustainable growth of the industry.\nIts President, Aminu Gwadabe spoke in Lagos at the opening session of 2021 Annual ABCON Nationwide Training on BDC Operations.\nBDCs, he noted, occupy a very important position and play critical roles in the nation’s foreign exchange market which are germain to achieving stable exchange rate and easy access to foreign exchange for members of the public in a conducive environment.\nThe above, according to Gwadabe, informed the decision of ABCON to partner with the CBN, NFIU and other security agencies to organise the annual nationwide training on BDC operations.\nADVERTISEMENTExplaining further, he said, “The training will be executed by a team of highly experienced professionals from the CBN, NFIU and other organisations."
  },
  {
    "headline": "Lagos pays over N4.2b as pension arrears",
    "summarized_story": "By Oyebola OwolabiThe Lagos State government has paid N4.203 billion as pension under the Defined Benefits Scheme (DBS), otherwise known as ‘Pay As You Go’, between May 2019 and March 2021, Commissioner for Establishment, Training and Pension, Mrs. Ajibola Ponle, has said.\nShe addressed reporters as part of activities to mark Governor Babajide Sanwo-Olu’s second year in office.\nMrs Ponle said as part of the state’s commitment to the welfare of pensioners, the governor approved the payment of 33 per cent increment for pensioners under the DBS, and the 25 per cent balance of the rent allowance for officers on Grade Level 07 and above who retired between May 2000 and August 2004.\nADVERTISEMENTShe said: “There are currently 15 approved Pension Funds Administrators (PFA) and seven approved insurance companies who render pension funds management and annuities services to state retirees.\nToday, Lagos State is a trailblazer and pacesetter in pension matters in Nigeria having won awards as the most pension-compliant on several occasions.”Mrs Ponle added that as part of measures to better the lives of pensioners, the ministry is always interfacing with relevant stakeholders such as Nigerian Union of Pensioners (NUP), Association of Retired Heads of Service and Permanent Secretaries, and others."
  },
  {
    "headline": "Kalu salutes new Chief of Army Staff, General Yahaya",
    "summarized_story": "Congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with passion for professionalism and national development.\nThe former governor, urged the new army chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigerian army has continually played a noble role in nation building.\nHe said: “I felicitate with the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "45 generals to retire as Buhari names, Yahaya, new chief of army staff",
    "summarized_story": "From Molly Kilete, AbujaPresident Muhammadu Buhari has appointed Major Gen. Farouk Yahaya as new Chief of Army Staff (CAOS).\nHe was granted regular combatant commission as a member of 37 regular course on 22 September 1990 in the rank of Second Lieutenant with seniority in the same rank effective September 27, 1985.\nWith his appointment of Yahaya, a member of 37 Regular Course of the Nigerian Army, it was learnt that about 45 generals would have to resign .\nThe affected officers Daily Sun gathered are mostly officers of 35 Regular Course, 36 Regular Course and 37 Regular Course who incidentally are Course-mates of the new army chief.\nThe directive Daily Sun gathered has not changed, thus meaning more officers would retire with the naming of a new service chief."
  },
  {
    "headline": "Immigration increases production capacity to beat deadline for passport backlogs",
    "summarized_story": "Comptroller–General, Nigeria Immigration Service (NIS), Mr Muhammad Babandede, has said the service has increased its production capacity to beat the May 31 deadline set to clear backlog of passport applications.\nBabandede announced this while briefing newsmen on the NIS passport reforms and recruitment exercise, yesterday, in Abuja.\nHe said that the passport production centres across the country were working round the clock to clear the backlogs before the commencement of the new passport regime on June 1.\nHe also said that all passport collection centres would be opened from 6:00 a.m. to 6:00 p.m. daily for applicants.\nOn recruitment, NIS boss said that the current recruitment exercise was the best ever in immigration and assured all applicants of transparency and fairness."
  },
  {
    "headline": "Open grazing ban: Miyetti Allah seeks meeting with govs, other leaders",
    "summarized_story": "From Obinna Odogwu, AwkaThe leadership of Miyetti Allah Cattle Breeders’ Association of Nigeria (MACBAN), yesterday, appealed to governors of the 36 states and other leaders in the country to convene a meeting to enable them have a second look at the ban placed on open grazing by Southern governors.\nHe suggested that instead of the straight ban on open grazing by the Southern governors, a middle course should be taken to douse tension in the country, particularly in the Southern Nigeria.\nExplaining what he meant by middle course, Siddiki said that it was simply be the coming together of leaders of the South and North to chart the way forward for an improved and more modern mode of livestock keeping.\n“It will douse tension and the heightening tension across the north and south and give sufficient room for gradual adjustment that will be beneficial to the generality of Nigerians.\nNeither the northern nor the southern political leaders should call the bluff of the commoners whose surface interpretation of the situation has the tendency of brewing misgiving, rancour and avoidable friction across the board,” he said."
  },
  {
    "headline": "Constitution: Northern govs set up committee on restructuring",
    "summarized_story": "He advised that discussion on the review of the 1999 Constitution should be within the context of unity, stability, peace and progress of Nigeria.\nLalong made the remarks at the North Central Senate Committee’s public hearing on the review of the 1999 constitution review, in Jos, Plateau State.\n“We have to conduct the discussion on the review of the 1999 constitution within the context of the unity, stability, peace and progress of the country.\n• How Nigeria can enact new Constitution- EkweremaduFormer Deputy Senate President, Ike Ekweremadu, said while a new constitution is possible and would become ultimately inevitable, the nation needs to amend the 1999 Constitution to create a provision for achieving that.\nSome say, bring back the 1960 Constitution; some say bring back the 1963 Constitution."
  },
  {
    "headline": "Jubilations in Maiduguri as Yahaya Emerges New Army Chief",
    "summarized_story": "The officers at the same level with the current army chief that has just been appointed can be posted to tri-service institutions with those that are ahead of him.\n“He (new Army Chief) can also decide to retire them.\nHe described the new army chief as a man known to have the welfare of the army at heart.\nProfile of New Army Chief, YahayaYahaya was born on January 5, 1966, in Sifawa, Bodinga Local Government Area of Sokoto State.\nHe was also Director, Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) 1 Division of the Nigerian Army."
  },
  {
    "headline": "IG: Agitation for State Police Unnecessary",
    "summarized_story": "He said: “State policing is an issue.\n“If you look at it technically, I doubt if there is any state that does not have state police even now.\n“State governments or state governors are chief security officers of their states.\n“In terms of arrests, we have 398 armed robbery suspects, 258 cult-related offenders, 222 murder suspects, 202 bandit-related suspects and 86 suspects involved in cases of kidnapping.\nResponding to a question on the recent attack on Governor Samuel Ortom of Benue State, the IG said those involved had been arrested."
  },
  {
    "headline": "Emefiele: N35tn Infrastructure Investment Needed for Double-digit Growth",
    "summarized_story": "Besides, Emefiele, at another forum yesterday, also called on governors to make their states economically viable in order to reduce their dependence on allocations from the Federation Account.\n“If we take into account Nigeria’s Infrastructure Masterplan, we require close to N35 trillion worth of investment in order to attain double-digit growth.\n“This will help document a pipeline of PPP projects across various sectors of the economy,” he said.\nHe added that some MDAs have submitted their PPP Project Information Data ahead of the final submission date of May 31.\nEmefiele Urges Govs to Make States Economically ViableAlso yesterday, Emefiele called on governors to make their states economically viable in order to reduce their dependence on allocations from the Federation Account."
  },
  {
    "headline": "Buhari Pledges Better Nation for Future Generation",
    "summarized_story": "Femi Gbajabiamila, as well as Governors Dapo Abiodun of Ogun State and Muhammadu Inuwa Yahaya of Gombe State felicitated with children on their special day.\nBuhari, while hosting some children at the State House, Abuja, as part of activities to mark the occasion, said that he would focus attention on guaranteeing them a better tomorrow.\nGbajabiamila, while rejoicing with the children said in a statement that children are truly the leaders of tomorrow because of the enormous potential they possess.\nOn his part, the Gombe State governor who described children as the hope of the nation called on them to look forward to a brighter future as his administration is committed to their welfare and sound education.\nHe said: “To build a better tomorrow, we must build our children,” adding that as future leaders, children require security and right upbringing from both parents and government."
  },
  {
    "headline": "No Row over Addax Oil Blocks’ Revocation, Say FG, China",
    "summarized_story": "Emmanuel Addeh and Adedayo Akinwale in AbujaThe Chinese Ambassador to Nigeria, Mr. Cui Jianchun, and Minister of State, Petroleum Resources, Mr. Timipre Sylva, yesterday met in Abuja, with both countries agreeing that there’s no row between them.\nA statement by the Special Adviser to the minister, Mr. Garba Mohammed, said the two top officials committed to sustaining the excellent relations between their countries.\nLast month, President Muhammadu Buhari ordered the Department of Petroleum Resources (DPR) to restore four oil mining licences revoked from Addax Petroleum, owned by the Chinese state-run Sinopec.\nApparently to mend fences, Jianchun after concluding the discussions, extended an invitation to the minister to visit China.\nSylva accepted the invitation and promised to pay a visit to the Asian country later in the year."
  },
  {
    "headline": "We Raised N60million And Still Don't Have Our Children Back—Parents Of Abducted Kaduna Greenfield University Students",
    "summarized_story": "Parents of the remaining abducted students of Greenfield University in Kaduna State have decried the deafening silence by the government over securing the release of the students.\nThe Greenfield University students were abducted on April 20 from their Kaduna campus after which three of them were killed by their kidnappers.\n“The impression they gave us was that, as soon as the Afaka students were released, our children too would be released.\n“Immediately, there was a statement that since Afaka students have been released, the next will be the Greenfield University students.\nHe also condemned the stance of the Kaduna State Governor, Nasir El-Rufai on the issue, describing the governor's comment as immature."
  },
  {
    "headline": "We Raised N60million And Still Don't Have Our Children Back—Parents Of Abducted Kaduna Greenfield University Students",
    "summarized_story": "Parents of the remaining abducted students of Greenfield University in Kaduna State have decried the deafening silence by the government over securing the release of the students.\nThe Greenfield University students were abducted on April 20 from their Kaduna campus after which three of them were killed by their kidnappers.\n“The impression they gave us was that, as soon as the Afaka students were released, our children too would be released.\n“Immediately, there was a statement that since Afaka students have been released, the next will be the Greenfield University students.\nHe also condemned the stance of the Kaduna State Governor, Nasir El-Rufai on the issue, describing the governor's comment as immature."
  },
  {
    "headline": "We Raised N60million And Still Don't Have Our Children Back—Parents Of Abducted Kaduna Greenfield University Students",
    "summarized_story": "Parents of the remaining abducted students of Greenfield University in Kaduna State have decried the deafening silence by the government over securing the release of the students.\nThe Greenfield University students were abducted on April 20 from their Kaduna campus after which three of them were killed by their kidnappers.\n“The impression they gave us was that, as soon as the Afaka students were released, our children too would be released.\n“Immediately, there was a statement that since Afaka students have been released, the next will be the Greenfield University students.\nHe also condemned the stance of the Kaduna State Governor, Nasir El-Rufai on the issue, describing the governor's comment as immature."
  },
  {
    "headline": "Nigerian Government Suspends Broadcasting License Of Brekete Family Radio",
    "summarized_story": "The National Broadcasting Commission (NBC) announced this in a statement issued on Thursday.\nFollowing the criticism that trailed the video, Isah subsequently apologised, saying his action was triggered by zeal and passion.\nThe assaulted young man was the one who apologised, saying he was sorry for what he had done.\nThe statement read, “The National Broadcasting Commission met with Mr. Ahmed Isah, owner and popular host of Brekete family programmme on the Human Rights Radio on Tuesday 26th of May, 2021.\n“The National Broadcasting Commission has reviewed the events and notes the unreserved apologies and regrets expressed by the broadcaster."
  },
  {
    "headline": "Nigerian Government Suspends Broadcasting License Of Brekete Family Radio",
    "summarized_story": "The National Broadcasting Commission (NBC) announced this in a statement issued on Thursday.\nFollowing the criticism that trailed the video, Isah subsequently apologised, saying his action was triggered by zeal and passion.\nThe assaulted young man was the one who apologised, saying he was sorry for what he had done.\nThe statement read, “The National Broadcasting Commission met with Mr. Ahmed Isah, owner and popular host of Brekete family programmme on the Human Rights Radio on Tuesday 26th of May, 2021.\n“The National Broadcasting Commission has reviewed the events and notes the unreserved apologies and regrets expressed by the broadcaster."
  },
  {
    "headline": "Abidemi Rufai, suspended aide to Ogun governor, indicted for '$350k fraud' in US",
    "summarized_story": "Abidemi Rufai, a senior special assistant to Dapo Abiodun, governor of Ogun, has been indicted for alleged conspiracy, wire fraud, and aggravated identity theft.\nAdvertisementRufai was arrested at the JFK airport in New York on May 14 over alleged $350,000 unemployment benefits fraud.\nA criminal complaint was filed against Rufai for allegedly stealing over $350,000 in unemployment benefits from the Washington State employment security department (ESD).\n“Rufai is now charged with conspiracy to commit wire fraud, nine counts of wire fraud, and five counts of aggravated identity theft,” the statement reads.\nRufai, who was appointed in August 2020, has since been suspended by the Ogun state governor following his arrest."
  },
  {
    "headline": "Abidemi Rufai, suspended aide to Ogun governor, indicted for '$350k fraud' in US",
    "summarized_story": "Abidemi Rufai, a senior special assistant to Dapo Abiodun, governor of Ogun, has been indicted for alleged conspiracy, wire fraud, and aggravated identity theft.\nAdvertisementRufai was arrested at the JFK airport in New York on May 14 over alleged $350,000 unemployment benefits fraud.\nA criminal complaint was filed against Rufai for allegedly stealing over $350,000 in unemployment benefits from the Washington State employment security department (ESD).\n“Rufai is now charged with conspiracy to commit wire fraud, nine counts of wire fraud, and five counts of aggravated identity theft,” the statement reads.\nRufai, who was appointed in August 2020, has since been suspended by the Ogun state governor following his arrest."
  },
  {
    "headline": "FULL LIST: FG names 132 travellers who 'violated' COVID protocol",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 has released a second batch of names of travellers who reportedly violated the protocol for international passengers.\nAdvertisementOn May 23, the PSC had released the names of 90 travellers, who were accused of violating the protocol on mandatory self-siolation for passengers from Brazel, Turkey, and India.\nThe federal government had mandated travellers who arrived Nigeria within 14 days of visiting the three countries to embark on isolation.\nHowever, according to the PSC, the 132 passengers listed on Thursday came in through the Nnamdi Azikiwe international airport in Abuja and refused to embark on isolation.\nAdvertisementThe travellers have, however, been directed to report to the nearest government health facility within the next 48 hours."
  },
  {
    "headline": "FULL LIST: FG names 132 travellers who 'violated' COVID protocol",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 has released a second batch of names of travellers who reportedly violated the protocol for international passengers.\nAdvertisementOn May 23, the PSC had released the names of 90 travellers, who were accused of violating the protocol on mandatory self-siolation for passengers from Brazel, Turkey, and India.\nThe federal government had mandated travellers who arrived Nigeria within 14 days of visiting the three countries to embark on isolation.\nHowever, according to the PSC, the 132 passengers listed on Thursday came in through the Nnamdi Azikiwe international airport in Abuja and refused to embark on isolation.\nAdvertisementThe travellers have, however, been directed to report to the nearest government health facility within the next 48 hours."
  },
  {
    "headline": "I never received N2bn from recovered loot, Malami replies reps",
    "summarized_story": "Abubakar Malami, attorney-general of the federation (AGF), has denied the allegation that N2 billion was paid to his office from recovered loot.\nAdvertisementThe house of representatives ad hoc committee probing the status of recovered loot had on Tuesday queried Malami on the N2 billion which it said was never approved as budgetary allocation.\nHe said all looted funds recovered so far have been applied in accordance with the agreements reached with nations from which the funds are repatriated.\nHe said the federal government has a designated account at the CBN for all recovered assets.\n“Malami has neither, as a person, nor as the attorney-general of the federation and minister of justice, not in any way received any funds from the recovered assets,” the statement reads."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "OPay in talks to raise $400 million from investors at $1.5bn valuation to finance expansion plans",
    "summarized_story": "OPay is reportedly in talks to raise $400 million from investors at a valuation of $1.5 billion, according to an exclusive report from The Information.\nOPay is looking to raise funding to finance its expansion plan, having launched in Egypt this year.\nAn Africa-focused company with Chinese backersWhile OPay is based in Nigeria, its backers are mostly Chinese companies like Meituan, a multi-billion-dollar Chinese shopping platform.\nIn July 2019, OPay raised $50 million from Sequoia Capital, IDG Capital, Source Code, GSR Ventures and Meituan-Dianping.\nYet, should they successfully raise $400 million, it will be the kind of war chest that makes anything possible."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How OctaFX became the first financial company in Nigeria to organise a cooking session for Ramadan",
    "summarized_story": "OctaFX brought two popular bloggers together in a cooking studio: the comedian Apaokagi Maryam and the music video director Abdulazeez Greene.\nThey prepared a special evening meal for Ramadan called Iftar and compared the subtleties of cooking with those ingrained in trading.\n‘Ramadan Special’ is the first cooking show in Nigeria produced by a financial company.\nApaokagi Maryam is a frequent collaborator of the global Forex broker and took part in the last OctaFX Goal Booster promotion.\nThe company is aspiring to create more shows like ‘Ramadan Special’ in the future."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "What’s the fate of Nigerian fintech following banking regulator’s fresh regulations?",
    "summarized_story": "The new requirements apply to companies registered with the Corporate Affairs Commission (CAC) and wish to apply for new licences or renew old ones.\nThese requirements relate to licences for Switching and Processing, Mobile Money Operators (MMOs), Payment Solution Services (PSSs), Super Agent, Payment Solution Service Providers (PSSPs), and Payment Terminal Service Providers (PTSPs).\nSwitching and Processing, PSSPs, PTSPs, and Super Agent (super licence) — no longer apply: ₦3 billion reduction in minimum SHF, ₦1,900,000 reduction in application fees.\nMMOs, Non-Bank Merchant Acquiring, and Super Agent (standard licence) — no longer apply: ₦1 billion reduction in minimum SHF, ₦900,000 reduction in application fees.\nPSSPs, PTSPs, and Super Agent (basic licence) — no longer apply: no change in minimum SHF, no change in application fees."
  },
  {
    "headline": "What’s the fate of Nigerian fintech following banking regulator’s fresh regulations?",
    "summarized_story": "The new requirements apply to companies registered with the Corporate Affairs Commission (CAC) and wish to apply for new licences or renew old ones.\nThese requirements relate to licences for Switching and Processing, Mobile Money Operators (MMOs), Payment Solution Services (PSSs), Super Agent, Payment Solution Service Providers (PSSPs), and Payment Terminal Service Providers (PTSPs).\nSwitching and Processing, PSSPs, PTSPs, and Super Agent (super licence) — no longer apply: ₦3 billion reduction in minimum SHF, ₦1,900,000 reduction in application fees.\nMMOs, Non-Bank Merchant Acquiring, and Super Agent (standard licence) — no longer apply: ₦1 billion reduction in minimum SHF, ₦900,000 reduction in application fees.\nPSSPs, PTSPs, and Super Agent (basic licence) — no longer apply: no change in minimum SHF, no change in application fees."
  },
  {
    "headline": "These 11 startups are preparing African kids for the future",
    "summarized_story": "Nine million African girls between the ages of 6 and 11 will never go to school compared to 6 million African boys.\nNigeria, on the other hand, has just 3% of school-age children able to access the Internet at home despite having more edtech startups than any other African country.\nThe sector has grown consistently, with a Briter Bridges report stating that there are over 210 edtech startups on the continent as of Q1 2020.\nListed in no particular order below are 11 randomly selected edtech startups you should check out.\neLimuThe Kenyan edtech startup’s name means education in Swahili, and it creates educational apps and content for students in primary school."
  },
  {
    "headline": "Green Africa disrupts airline business with cheap airfares",
    "summarized_story": "“Actually, if I ran an airline in Nigeria, I would do exactly what Green Africa appears to be trying to do – target the mid-to-lower end of the market with cheap tickets by using propeller aircraft instead of jet aircraft.\n“If Green Africa does not get people to experience their flights, they won’t be able to penetrate the market.\nHe assured that after two weeks of offering promotional prices, Green Africa would begin to adjust prices to fit into current operational and economic realities.\nIt cost airlines between $500,000 and $1 million to carry out mandatory C-checks on their aircraft every 18 months.\nHowever, Tolu Odutola, a pilot and aviation expert, argued that Green Africa operates ATR 72-600, which are generally cheaper to maintain than the 737s, CRJs and other aircraft operated by local airlines."
  },
  {
    "headline": "Optimism over economic recovery despite weak numbers",
    "summarized_story": "The last few days have brought to the fore three weak numbers that have pointed to the recovery of the Nigerian economy, which sluggishly exited recession in the fourth quarter of 2020.\nStarting from the latest, these numbers include the Manufacturing Purchasing Managers’ Index (PMI), which grew to 49.0 index points in April 2021 from…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Energy-poor Africa makes case against exiting oil",
    "summarized_story": "As opposition to fossil fuel mounts in Western countries, African experts are standing up against efforts by Western countries to curb crude oil production as a way to protect the environment.\nThe International Energy Agency (IEA), a Paris-based think tank that advises Western countries on their energy policies, on May 18 released a roadmap outlining…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Children’s Day: We must build strong institutions to assure better future for our children – Obaseki – Nigerian Observer",
    "summarized_story": "Children’s Day: We must build strong institutions to assure better future for our children – ObasekiShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has assured that his administration will sustain ongoing reforms to strengthen public institutions to guarantee a sustainable future for children in the state.\nThe governor made the submission in a statement to mark the 2021 Children’s Day celebration, adding that his administration will continue to implement policy reforms to benefit children in the state.\nHe said, “I am delighted to mark this year’s Children’s Day and celebrate our children, who are the future of Edo State and Nigeria.\n“Our children remain the most important stakeholders in the Nigerian project and all our developmental efforts must be geared towards building a vibrant country with critical institutions and structures to assure a better future for them.”According to him, “In Edo State, children are beneficiaries of very pragmatic reforms that we have undertaken in the education sector over these past four years.\nI wish all Edo children a very happy Children’s Day!!"
  },
  {
    "headline": "Ambrose Alli Varsity: Obaseki sets up special intervention team with Olotu as chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has appointed a Special Intervention Team to exercise all the powers and functions of the Governing Council of Ambrose Alli University in accordance with the provisions of the Ambrose Alli University (Special Intervention Powers) Law 2021, except with respect to the appointment and removal of Principal Officers.\nThe Special Intervention Team is chaired by the Managing Director of Schlumberger Nigeria Ltd, Mr. Andrew Olotu.\nOther members of the Special Intervention team include Bar.\nPatrick E. Inegbedion, Mr. Uyi Izekor, Prof. Esther Ikuoria, Mrs. Imo Okundaye, Mr. Emmanuel Etomi, Mr. Osen Iyahen, Mr. Yusuf Mohammed, Comr.\n“This Special Intervention Team shall exercise all the powers and function of the Governing Council of the University as contained in the Ambrose Alli University Law 1999 (as amended) except with respect to the appointment and removal of Principal Officers.”..."
  },
  {
    "headline": "EDSG pledges to pay outstanding emoluments of AAU Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Edo State Government has pledged to pay the emoluments, including Cheque off dues of the striking workers of the Ambrose Alli University, (AAU), Ekpoma, Edo State, as soon as they return back to work.\nHe declared that the vision of the state governor, Mr. Godwin Obaseki was to reposition the university, and address the issues militating against the progress of the state owned institution.\nHe solicited the support of the monarch and his community, promising the traditional ruler that he would not disappoint him.\n“I have no issue with with the decision of governor, since the decision is to move the university forward.\nThough the university in Ekpoma, it is a state owned university”, the monarch said."
  },
  {
    "headline": "COVID-19: Again, Nigeria declares 132 travellers ‘wanted’ for allegedly violating protocols",
    "summarized_story": "Bello, Aisha Barau31.\nUmar Abdullahi Usman69.\nAbdullahi Bello Umar87.\nAbdullahi Bello Umar105.\nIbrahim Yusuf Buratai121."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NNPC records N39.8bn trade surplus in February",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) says it has recorded N39.85 billion trading surplus for the month of February 2021.\nTrading surplus or trading deficit is derived after deduction of the expenditure profile from the revenue for the period under review.\nThe figure represents a 314.24 per cent rise from the N9.62billion surplus it recorded in January 2021.\nThis is contained in the February 2021 edition of the NNPC Monthly Financial and Operations Report (MFOR).\nThe Corporation attributed the significant increase in trading surplus mainly to reconciled accounts by the Corporation’s downstream subsidiary, the Petroleum Products Marketing Company (PPMC), using the Petroleum Products Pricing Regulatory Agency (PPPRA) pricing template."
  },
  {
    "headline": "NNPC in talks to acquire 20% stake in Dangote Refinery",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has initiated talks with the Dangote Group about purchasing a 20 percent minority equity stake in its 650,000 barrels per day (bpd) refinery, ThisDay reports.\nMustapha Yakubu, NNPC chief operating officer, refining and petrochemicals, disclosed this on Wednesday at the 2021 edition of the Nigerian Oil & Gas Opportunity Fair (NOGOF), the report said.\n“We have what we call the green field refinery and the Greenfield Refining Projects Division (GRPD) of the NNPC.\n“At the moment, we have Dangote Refinery, which is the 650,000 capacity barrels per day plus a mini 80,000 tonnes per annum petrochemical plant.\nI can tell you today that we are seeking to have a 20 per cent minority stake in Dangote Refinery as part of our collaboration and you know that there’s a huge quantity of crude for that refinery."
  },
  {
    "headline": "LG leveraging on AI, Inverter Compressor to Deliver Next Generation of Premium ACs",
    "summarized_story": "In the residential air conditioners market, some of the products that the company has achieved remarkable innovation success are the ARTCOOL and DUALCOOL Premium Air Conditioners.\n“LG DUALCOOL Premium Air Conditioners are equipped with dual premium design and unique features such as Smart ThinQ, ice & custom cooling and energy saving.\nLG ARTCOOL product is equipped with sympathetic artificial intelligence which notifies the user of the driving mode that changes according to the situation without a customer’s question and tells the necessary information.\nCompared to general cooling of 10.8℃ in average, LG DUALCOOL Premium Air Conditioner blows 6.8℃ wind in average to provide instant cooling when it is turned on.\nLG Inverter ACs available in Nigeria today include ARTCOOL 2.0HP; DUALCOOL 1.5HP; ARTCOOL 1.5HP; DUALCOOL 2.0HP and many others."
  },
  {
    "headline": "Breaking: Buhari names Farouk Yahaya new Chief of Army Staff",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nHe replaces Lt General Ibrahim Attahiru, who died in an air crash last Friday.\nAmong other posts, Yahaya was the Theater Commander of Operation Lafiya Dole (OPLD) in Maiduguri.\nHe took over from Maj.-Gen. Olusegun Adeniyi, who was redeployed to the Nigerian Army Resource Centre as Senior Research Fellow.\nHe is from Sokoto State, North West Nigeria."
  },
  {
    "headline": "Enforce Armed Forces Social Media Policy, CDS Irabor Tells Personnel",
    "summarized_story": "The Chief of Defence Staff (CDS), General Lucky Irabor, has charged officers and men of the Armed Forces of Nigeria (AFN) to respect and enforce the AFN Use of Social Media Policy.\nThe CDS said adherence to the policy would go a long way in protecting the corporate image of the Armed Forces and that of personnel individually.\nThe CDS also urged officers to ensure that their commitment to work must be such that it shows loyalty to the country and the Service.\nGeneral Irabor assured that the welfare issues of the Service have been presented to the President and Commander-in-Chief of the Armed Forces, President Muhammadu Buhari, who has equally assured to address them in the immediate, medium and long terms.\nHe further urged the ratings to sustain the military tradition of esprit de corps and shun narratives that tend to emphasise their ethnicity, religion or background."
  },
  {
    "headline": "INEC Records 41 Arson Cases, Vandalisation In 2 Years",
    "summarized_story": "The Independent National Electoral Commission (INEC), has said in the last two years, the Commission has recorded a total of 41 incidents involving deliberate attacks on the commission’s facilities.\nYakubu told the committee that nine incidents of the attack on the commission happened in 2019 and 21 cases in 2020.\nThe INEC helmsman said by working together with the security agencies, they can stop the attacks and the wanton destruction of critical electoral assets.\n“I understand that the security agencies are doing their own individual assessments.\n“May God comfort their families as well as the families of voters who lost their lives during that election."
  },
  {
    "headline": "SEVEN TIPS ON: Nigerians Movies To Watch Out For In 2021",
    "summarized_story": "FINE WINEOne of the highest-grossing Nigerian movies in 2021 is ‘Fine Wine’.\nDAY OF DESTINYThe ‘Day of Destiny’ is one of the best Nigerian movies to watch in 2021.\nTANWA SAVAGE‘Tanwa Savage’ is one of the best Nigerian movies in 2021 to put on your must-watch list.\nOMO GHETTO – THE SAGAThis is another mega movie project in 2020 that had to enter our list of best Nigerian movies in 2021.\nADVERTISEMENTSTILL FALLING‘Still Falling’ is a 2021 movie you would want to watch by any means."
  },
  {
    "headline": "BACKSTORY- MAKING IT, SPENDING IT: Make Or Mar Money Choices",
    "summarized_story": "machine language and assembly language) and the high level language (e.g.\nthe procedural-Oriented Language, Problem-Oriented language and the Natural language).\nThe problems/obstacles are even worse for Nigerians, because learning programming language requires constant light, laptop and constant internet connection” Nnad added.\n“I had to raise money to buy myself a laptop, spent nearly all my salary on internet and pay for courses.\nweb programmer, cloud developer, engineer, system programmer and digital scientists among others are some of the highest paid, he said."
  },
  {
    "headline": "PMB Re-appoints Garba Abari As DG, NOA",
    "summarized_story": "President Muhammadu Buhari has reappointed Dr. Garba Abari as the Director-General of the National Orientation Agency (NOA).\nThe minister of Information and Culture, Alhaji Lai Mohammed, announced the reappointment in a statement issued in Abuja yesterday.\nThe appointment, which took effect from 25 May, 2021, is for a final term of five years.\nAbari was first appointed to the position in 2016."
  },
  {
    "headline": "Buhari reassures children of protection against attacks —",
    "summarized_story": "Ukpono Ukpong, AbujaPresident Muhamadu Buhari has said that his administration has put in place several interventions to ensure protection for every Nigerian child against incessant attacks, kidnap, violence, abuse and exploitations.\n“My Dear Children of Our great Country.\nNigeria, I congratulate you all on this special day set aside to celebrate you across the Federation.\nFurthermore, Buhari said that his administration is also expanding the Home-Grown-SchoolFeeding Programme by targeting an additional 3 million children who will receive one free nutritious meal a day.\n“In the same vein, the issue of Street Children or children in non-conventional educational system are also being given the requisite attention through the Alternative School Programme, where children who are out of conventional schools are enrolled in schools or supported to continue their education wherever they are."
  },
  {
    "headline": "A profile of new Chief of Army Staff Farouk Yahaya — Daily Times Nigeria",
    "summarized_story": "Andrew Orolua, AbujaCommander -in -Chief of the Armed Forces of the Federal Republic of Nigeria, President Muhammadu Buhari has approved the appointment of Major-General Farouk Yahaya as the new Chief of Army Staff.\nThe new Chief of Army Staff (COAS), Major General Faruk Yahaya was born on January 5, 1966 in Sifawa, Bodinga Local Government Area of Sokoto State.\nNotable among the appointments held by the new COAS are Garrison Commander Headquarters Guards Brigade, Directing Staff at the Armed Forces Command and Staff College (AFCSC), Deputy Director Army Headquarters Department of Military Secretary, Deputy Director Army Research and Development and the Chief of Staff, Headquarters Joint Task Force Operation Pulo Shield.\nHe was also Director Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) 1 Division of the Nigerian Army.\nThe new COAS has several honours and awards, some of which include, Forces Service Star, Meritorious Service Star, Distinguished Service Star, Grand Service Star, Passed staff course (Dagger), National Defence Course (Chile), Economic Community of West Africa State Monitoring Group Medal, Command Medal, Field Command Medal, General Operations Medal, Silver Jubilee Medal and Golden Jubilee Medal."
  },
  {
    "headline": "Ijaw youths shut down NDDC headquarters over absence of agency's...",
    "summarized_story": "Amaka Agbu, Port HarcourtIjaw Youths Congress (IYC) on Thursday shut down the recently completed 13-floor Headquarters of the Niger Delta Development Commission (NDDC), located at the Eastern By-Pass, Marine Base in Port Harcourt, capital of Rivers State.\nThe shutdown is coming on the heels of similar exercises carried out by the youth body in Bayelsa and other states earlier this week at the expiration of the one-month ultimatum handed to the federal government to constitute a substantive board for the commission.\nAccording to the Assistant Secretary of the Eastern Zone of the Ijaw Youth Congress, Mr. Ibiso Harry, it was unfortunate that the one month ultimatum, the body issued to the presidency was ignored.\nMr Harry said that the IYC was left with no other alternative than to block the Commission’s complex in compliance with the directive of the IYC President, Peter Igbifa, adding that the continued stay of the interim management was unknown to the laws establishing the NDDC.\nMeanwhile in spite of the heavy security mounted by the police, the workers were nowhere to be found before and after the blockage."
  },
  {
    "headline": "Updated: £4.2m Ibori's money: AGF recants, says FG yet to remit money...",
    "summarized_story": "“For now, no money has been returned to Delta State,” he said.\nDelta State Government immediately reacted to the development on Wednesday and said that it has yet to receive the money.\n“For now, no money has been returned to Delta State,” he said.\nHe is back in Nigeria where he is actively involved in the politics of Delta State as a kingmaker and godfather.\nMembers of the Committee butressed that withdrawals from the recovery accounts could not be traced in any Appropriation Act, and the National Assembly was not aware."
  },
  {
    "headline": "48-year-old man arrested for defiling three daughters in Anambra",
    "summarized_story": "The Nigeria Security and Civil Defence Corps in Anambra State on Thursday paraded a 48-year-old man, Thomas Igbo, for allegedly defiling his three daughters.\nIgbo, who admitted to abusing his eldest daughter, however, denied molesting the remaining two, blaming his action on alcohol.\nPUNCH Metro gathered that one of his daughters revealed the molestation to a neighbour, who reported the matter to a human rights group, Child Protection Network, which facilitated the arrest.\n“A hospital in Enugwu-Ukwu confirmed that the three children were severally molested”, the neighbour said.\nA spokesperson for the Child Protection Network, Mrs Okwuchukwu Chukwuenyem, said the case was brought to her knowledge after the neighbour noticed the “despicable behaviour” of the man."
  },
  {
    "headline": "48-year-old man arrested for defiling three daughters in Anambra",
    "summarized_story": "The Nigeria Security and Civil Defence Corps in Anambra State on Thursday paraded a 48-year-old man, Thomas Igbo, for allegedly defiling his three daughters.\nIgbo, who admitted to abusing his eldest daughter, however, denied molesting the remaining two, blaming his action on alcohol.\nPUNCH Metro gathered that one of his daughters revealed the molestation to a neighbour, who reported the matter to a human rights group, Child Protection Network, which facilitated the arrest.\n“A hospital in Enugwu-Ukwu confirmed that the three children were severally molested”, the neighbour said.\nA spokesperson for the Child Protection Network, Mrs Okwuchukwu Chukwuenyem, said the case was brought to her knowledge after the neighbour noticed the “despicable behaviour” of the man."
  },
  {
    "headline": "Buhari greets Ashafa Erogbogbo at 95",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari felicitates with Alhaji Ashafa Ajibola Erogbogbo as he turns 95 May 28, 2021, giving thanks to Almighty God for the gift of longevity, in sound mind and body.\nThe President commends the cosmopolitan exposure of the native of Ikorodu, Lagos State, which saw him working in different regions of the country as a young man, before retiring and going into private business.\nAlso commendable, according to the President, is Alhaji Erogbogbo’s almost 70 years marriage to Alhaja Abeke, which terminated only on February 1, this year, when the latter passed on.\nThe union produced illustrious children, among whom is Mrs Abike Dabiri-Erewa, Chairman, Nigeria Diaspora Commission (NIDCOM).\nPresident Buhari rejoices with the entire Erogbogbo family, friends and well-wishers on the auspicious milestone, wishing the nonagenarian greater service to God and humanity."
  },
  {
    "headline": "Buhari greets Ashafa Erogbogbo at 95",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari felicitates with Alhaji Ashafa Ajibola Erogbogbo as he turns 95 May 28, 2021, giving thanks to Almighty God for the gift of longevity, in sound mind and body.\nThe President commends the cosmopolitan exposure of the native of Ikorodu, Lagos State, which saw him working in different regions of the country as a young man, before retiring and going into private business.\nAlso commendable, according to the President, is Alhaji Erogbogbo’s almost 70 years marriage to Alhaja Abeke, which terminated only on February 1, this year, when the latter passed on.\nThe union produced illustrious children, among whom is Mrs Abike Dabiri-Erewa, Chairman, Nigeria Diaspora Commission (NIDCOM).\nPresident Buhari rejoices with the entire Erogbogbo family, friends and well-wishers on the auspicious milestone, wishing the nonagenarian greater service to God and humanity."
  },
  {
    "headline": "10 quick facts about new Chief of Army Staff Yahaya you must know",
    "summarized_story": "Daunting tasks certainly await Major General Farouk Yahaya, who was on Thursday appointed as the new Chief of Army Staff by President Muhammadu Buhari.\nBelow are some quick facts about the new Chief of Army Staff.\nHe was Deputy Director, Army Headquarters, Department of Military Secretary, Deputy Director Army Research and Development.\nYahaya was also Director Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) 1 Division of the Nigerian Army.\nThe new COAS is a proud holder of several honours and awards, some of which include, Forces Service Star, Meritorious Service Star, Distinguished Service Star, Grand Service Star, Passed staff course (Dagger), National Defence Course (Chile), Economic Community of West Africa State Monitoring Group Medal, among others."
  },
  {
    "headline": "Gov. Fayemi suspends Dr. Cecilia Adebayo",
    "summarized_story": "The Governor of Ekiti State, Dr. Kayode Fayemi has directed the suspension of the Provost, College of Health Sciences and Technology, Ijero-Ekiti, Dr (Mrs) Cecilia Adebayo.\nThe suspension, is without prejudice to the outcome of a meeting of the College’s Governing Council slated for next week.\nMembers of the panel are:i) Dr Oyebanji Filani, Commissioner for Health and Human Services.\n(Chairman)ii) Dr (Mrs) Olabimpe Aderiye, Commissioner for Education, Science and Technology.\niv) Prof Bolaji Aluko, Director General, Office of Transformation and Service Delivery (OTSD)v. Mr. Samuel Omoniyi, Director, State Fire Services."
  },
  {
    "headline": "Breaking: Army, DSS shoot seven ESN members dead, arrest five in Rivers",
    "summarized_story": "The army in a statement made available to to our Correspondent on Thursday night said the operation took place at about 6:15pm.\n“During the clearance/raid Operations, the team came in contact with the IPOB/ESN members.\nHowever, during the firefight, 7 IPOB/ESN members were neutralized and 5 suspects were arrested.\n“Items recovered during the clearance/raid on IPOB/ESN camp included two AK 47 rifles, two G3 rifles, one locally made machine gun and one G3 magazine.\nAlso recovered included three rounds of 7.62mm special, 10 rounds 7.62mm x 51mm NATO, one x cutlass, five Baofeng handheld radios with chargers, 10 black barretts.”"
  },
  {
    "headline": "Pastor’s Wife Fights Dirty With Husband’s Side Chic During Service |Video]",
    "summarized_story": "A viral video of a Nigerian pastor’s wife fighting dirty with her husband’s side chic, a deaconess daughter during church service has surfaced on social media.\nIn the video that has become a growing sensation, the Pastor’s wife, who’s yet to be identified as at the filing of this report, was pictured fighting with her husband’s side chic while the church members watched in amazement in Umuahia, Aboa State.\nThe lady’s mother was also filmed trying to separate them in church.\nWatch the video below;See comments below;@Jotham.fd wrote; ‘The Bible says “The violent taketh it by force”… she’s just practicing what she preaches.\nI’m here for it.”@majestic_margaret_vlogs wrote; ‘Pastor wife is only trying her possible best to separate the two women fighting …Free pastor wife oh….Mum G.o’@6car__wrote; ‘That woman wey dey down don collect’"
  },
  {
    "headline": "Lai Mohammed: Nigeria In Safe Hands Despite Security Challenges",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed, has assured Nigerians that in spite of the current security challenges,the country is in safe hands.\nHe appealed to Oba Ajakaiye to work with his fellow traditional rulers, as well as the Government of Ekiti State, to ensure peace and security in the state.\n”Putting the tourist sites on the national and global map will attract tourists, which will in turn boost the economy of not justIyin town but indeed the entire Ekiti State,” he said.\nHe stressed the need for the federal government to leverage on the tourism industry in its drive to diversify the economy away from oil.\nOba Ajakaiye used the occasion of his visit to invite the Minister to his forthcoming coronation as well as to visit the tourist sites atIyin-Ekiti – the two requests that were granted by the Minister.."
  },
  {
    "headline": "BREAKING: President Buhari Appoints New Chief Of Army Staff",
    "summarized_story": "The Commander in Chief of the Armed Forces of the Federal Republic of Nigeria, President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nPrior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nPlease disseminate this information to the general public through your news medium.\nThank you for your cooperation.\nONYEMA NWACHUKWUBrigadier GeneralActing Director Defence Information27 May 2021"
  },
  {
    "headline": "Emergence of new COAS: APC sets agenda as mixed feelings greet Yahaya’s choice",
    "summarized_story": "There are mixed feelings over Thursday’s appointment of Major-General Farouk Yahaya as the 22nd Chief of Army Staff (COAS).\n“Why continue to give forces that are tearing us apart, fuel fires of disintegration?”El-Rufai, MatawalleCongratulating the new COAS, Kaduna state Governor Nasir El-Rufai described him as hard working and foresighted.\n“The Governor of Kaduna state, Malam Nasir el-Rufai has congratulated the newly appointed Chief of Army Staff, Major General Yahaya Farouk.\n“The Kaduna state government is looking forward to working with the newly appointed COAS to advance peace and security in Kaduna state,” he said.\nIn a tweet, Fani-Kayode wrote: “Congratulations to Major General Yahaya on his appointment as Nigeria’s new Chief of Army Staff."
  },
  {
    "headline": "Pictures: President Muhammadu Buhari receives Ghanian President, Nana Akufo-Addo",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: See how President Muhammadu Buhari celebrated children’s day in Abuja",
    "summarized_story": "PreviousProfile of the new Chief of Army Staff, Maj.- Gen Faruk Yahaya"
  },
  {
    "headline": "Stolen Artefacts: ARAN commends FG’s recovery efforts -NigPilot",
    "summarized_story": "Rescuers Association of Nigeria, (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nHe said with the renewed calls for the repatriation of all looted Nigeria artifacts , with passion and commitment of the Minister, there is hope that “most stolen riches of the country will find its way back.”Recall that the Federal Government launched campaign for the repatriation of looted artefacts from the country in 2019 which yielded fruitfully with spate of return of stolen Nigerian antiquities from around the world.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral."
  },
  {
    "headline": "FG reiterates commitment to effective waste management system -NigPilot",
    "summarized_story": "Minister for Environment, Dr Muhammad Mahmoud Abubakar has said that the Federal Government is committed to an effective waste management system in Nigeria.\nThe Minister stated this at the 3rd International Waste Summit 2021, organised by the Waste Management Society of Nigeria, WAMASON, held in Port Harcourt, Rivers State.\nAbubakar noted that the Federal Government is seeking greater partnership with professional bodies like WAMASON on useful ideas on effective waste management in the country.\nHe stressed that youths could benefit through all the stages of waste management, from sorting, storage, transporting to treatment.\nIn achieving an effective waste management system, the Minister stated that the federal government will continue to develop policies to ensure that actions towards waste management are profitable."
  },
  {
    "headline": "NAPTIP DG calls for implementation of policies for protection of children",
    "summarized_story": "Director-General of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, Imaan Sulaiman – Ibrahim has called for the strengthening of policies, programs, and legal instruments that will further enhance the protection of Children in the Country.\nThe NAPTIP boss said “I join millions of Nigerians across the globe in wishing our children a Happy Children’s Day.\nQuite a large number of Nigerian children have fallen victims of illicit commercial activities which include human trafficking, sexual exploitation domestic servitude, and street begging.\n“It is therefore imperative that parents work closely with NAPTIP and other law Enforcement Agencies in ensuring that perpetrators of evil acts towards our children are reported in order to ensure that such perpetrators are brought to book.\n“NAPTIP on its part shall continue to work assiduously towards the protection of our children,” she said."
  },
  {
    "headline": "Children’s Day: UNICEF calls for protection of child rights -NigPilot",
    "summarized_story": "Commemorating the event of the Children’s Day, the United Nations Children’s Fund, UNICEF, has advocated the need to reinforce protection mechanisms for children especially at a challenging moment for child rights in the country and the world, with the COVID-19 pandemic threatening gains made for children’s development.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis – in Nigeria and around the world.\n“On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls is sexually abused.\n“Nigerian children are resilient, talented and aspire to do great things."
  },
  {
    "headline": "Buhari Appoints New Chief Of Army Staff, Major-General Yahaya",
    "summarized_story": "President Muhammadu Buhari has appointed Major-General Farouk Yahaya as the new Chief of Army Staff.\nMajor-General Yahaya started his cadet training on 27 September 1985 and was commissioned into the Nigerian Army Infantry Corps on 22 September 1990.\nRésumé/CV of newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya.\nNotable among the appointments held by the new COAS are Garrison Commander Headquarters Guards Brigade, Directing Staff at the Armed Forces Command and Staff College (AFCSC), Deputy Director Army Headquarters Department of Military Secretary, Deputy Director Army Research and Development and the Chief of Staff, Headquarters Joint Task Force Operation Pulo Shield.\nHe also served as the Principal General Staff Officer (PGSO) to the Honourable Minister of Defence, the Commander, Headquarters 4 Brigade and 29 Task Force Brigade (Operation Zaman Lafiya), Director Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) Headquarters 1 Division of the Nigerian Army."
  },
  {
    "headline": "PHOTOS: Buhari Celebrates Children’s Day",
    "summarized_story": "President Muhammadu Buhari celebrated Children’s Day with children in the State House on Thursday, May 27th.\nMay 27th is celebrated as Children’s Day in Nigeria.\nPresident Buhari commemorated the day with some kids in the Aso Rock Villa with cake and waving flags.\nAccording to the Presidency’s official Twitter handle, “The President spent the morning with a group of visiting children, at the State House.\nSchools and educational institutes used to celebrate this day by organizing fun days, and arranging for kids to go for match passes in stadia across the country."
  },
  {
    "headline": "Disbandment Of SARS Created A Vacuum In Police To Tackle Insecurity – IGP",
    "summarized_story": "The acting Inspector-General of Police (IGP), Alkali Usman has said that the disbandment of the Special Anti-Robbery Squad (SARS) created a vacuum which is challenging efforts by the Police to tackle insecurity in the country from a position of strength.\nThe acting IGP stated this on Thursday at a presidential briefing organized by the Presidential Communications Team at the statehouse in Abuja.\nREAD ALSO: Let Us Not Deceive Ourselves, Things Are Not Alright – Sultan AbubakarAccording to him, the aftermath of the EndSARS protest equally dampened the morale of the officers of the force.\nThe IGP also indicated that the police have recorded successes against secessionist groups and criminals in the southeast.\nHe noted that prosecution to ensure justice is served has remained a major challenge because of the ongoing strike by judiciary workers."
  },
  {
    "headline": "Let Us Not Deceive Ourselves, Things Are Not Alright – Sultan Abubakar",
    "summarized_story": "﻿The Sultan of Sokoto, Muhammad Sa’ad Abubakar, on Wednesday, said Nigerians should not deceive themselves that things are alright.\nHe made the comment during a National Security Summit in Abuja.\n“Let us not deceive ourselves that things are alright, things are not alright,” the revered traditional ruler said.\nWhile commending the Speaker of the House of Representatives, Femi Gbajabiamila, for initiating the National Security Summit, the Sultan called for the implementation of the resolutions of the summit.\nThe traditional ruler expressed happiness that both the Speaker and the Senate President, Ahmad Lawan, have admitted that things are not well with the country."
  },
  {
    "headline": "Malami Denies Receiving N2bn From Recovered Loots",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN) has denied allegations suggesting that N2 billion was paid to his office from the recovered funds.\nMalami, therefore, challenged any person who has any evidence of such payments to either him or his office, to come out publicly with proofs.\nN2bn Illegally PaidEarlier in the week, a House of Representatives panel said the Central Bank of Nigeria (CBN) illegally paid N2 billion to Abubakar Malami, attorney-general of the federation (AGF), from recovered loot.\nAt its sitting on Tuesday, the house ad hoc committee probing the status of recovered loot queried Malami on the funds which they said they never approved as a budgetary allocation.\nThey also challenged the Minister of Justice for allegedly requesting payment of approved solicitors’ fees from the recovered assets, a claim which Malami utterly denied."
  },
  {
    "headline": "Matawalle congratulates new COAS, Maj. Gen. Farouk Yahaya, says it’s a divine elevation",
    "summarized_story": "Zamfara State governor, Bello Matawalle, has congratulated Major General Farouk Yahaya over his appointment by President Muhammadu Buhari as the 22nd Chief of Army Staff.\nThe Governor, on behalf of the government and good people of the state, wishes him success as he takes over the highest seat in the Nigerian ArmyMr. Matawalle described the appointment as a divine elevationIn a press statement signed by the Director General Media and Communications to the Governor Yusuf Idris Gusau said the governor is optimistic that having come from the North West region of the country, the New chief of Army staff will play a vital role in addressing the lingering security challenges that has bedeviled the region and the nation at large.\n” As a top ranking military officer, Gen. Yahaya who is very conversant with the security challenges caused by armed Banditry and Boko Haram insurgents, I am optimistic that he will do well Nigeria proud by addressing the menace of Insecurity that has affected all aspect of human live in the north”.\nMatawalle saidAdvertisementHe also prayed God to continue to guide and protect the COAS as he lead his officers and men on this onerous task in the service of his fatherland.\nThe appointment of major General Yahaya Faruk is coming exactly a week after the death of lieutenant General Attahiru Ibrahim who died along side other senior military officers in a plane crash enroute Kaduna."
  },
  {
    "headline": "Somolu LG Chairman ‘Dullar’ calls for peace as hoodlums destroy campaign posters",
    "summarized_story": "Chairman of Somolu Local Government, Abdul Hamed Salawu has urged his supporters to remain calm as suspected hoodlums destroyed his campaign posters and signage posts across Somolu.\nDullar, as he is fondly called, who disclosed this while addressing his supporters at Agunbiade Primary School,, also warned against reprisal attack on banners and posters of his co-aspirants.\nHe said the destruction is a conspicuous sign that his opponents are aware that he is coasting to victory on Saturday.\nAccording to a statement from his media office, Mr Salawu said he still remain the most popular APC Chairmanship aspirant in Somolu and will emerge the ruling party’s candidate by Saturday after the Primary election.\nHe further urged his followers not to engage in any violence or criminal act to avenge the sponsored attack on his campaign posters and banners."
  },
  {
    "headline": "Macron Recognises French ‘Responsibility’ in Rwanda Genocide",
    "summarized_story": "French President Emmanuel Macron, in a visit to Rwanda, has said France recognised its “responsibility” in the 1994 Rwandan genocide, asking for forgiveness for his country’s role but without offering an official apology.\nThe genocide ended in July 1994 when the Rwandan Patriotic Front (RPF), led by current President Kagame, swept in from Uganda and seized control of the country.\nMacron said France did not listen to those who warned it about the impending massacre in Rwanda and stood de facto by a “genocidal regime”.\nMacron agreed in April to open the Rwanda archives of former President Francois Mitterrand, who was in charge during the genocide.\nAl Jazeera’s Malcolm Webb, reporting from Kigali, said Macron was “between a rock and a hard place, to some extent”."
  },
  {
    "headline": "Biden’s $715bn Defense Budget Seeks Greater China Deterrence and Nuclear Funding",
    "summarized_story": "US President Joe Biden’s $715 billion Department of Defense budget will shift funding from old systems to help modernize the nuclear arsenal to deter China, while also developing future warfare capabilities, people familiar with the budget said.\nThere will also be money to further develop and test of hypersonic weapons and other “next generation” weapons systems as the military aims to build capabilities to counter Russia and China.\nPresident’s budget requests, including those for the military, are commonly a starting point for negotiations with Congress which ultimately decides how funds are spent.\nThe Pacific Deterrence Initiative, created to counter China, focuses on competition in the Indo-Pacific and aims to boost U.S. preparedness in the region through funding radars, satellites and missile systems.\nAmong the Pentagon’s competing priorities, the Biden administration will request 85 stealthy F-35 fighter jets made by Lockheed Martin, the people said."
  },
  {
    "headline": "Nigeria’s Electoral Commission Boss Says Attacks on Offices ‘Major Threat’ Aimed at Dismantling Critical Infrastructure",
    "summarized_story": "Nigeria’s Independent National Electoral Commission (INEC) says attacks on its offices are a “major threat” to the commission’s scheduled activities as they have become “more frequent and systematic targeted at demobilising and dismantling critical electoral infrastructure.”According to the country’s electoral commission, 14 Nigerian states have been attacked 41 times since the 2019 general elections.\n“In the last two years, the commission has recorded a total of 41 incidents involving deliberate attacks on the Commission’s facilities.\n“In the last four weeks, 11 offices of the commission were either set ablaze or vandalised.\nTwo of these incidents were caused by Boko Haram and Bandit attacks while 10 resulted from thuggery during election and post-election violence.\nHowever, the majority of the attacks (29 out of 41) were unrelated to election or electoral activities."
  },
  {
    "headline": "Nigeria: $85bn Infrastructure Investment Needed for Double-digit Growth, Central Bank Chief Emefiele Says",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, declared that N35 trillion (about $85bn) investment in infrastructure is required for the economy to post a double-digit growth.\nThe Nigerian economy recorded a 0.51 per cent growth in the first quarter of 2021 after a 0.11 per cent growth in the fourth quarter of 2020.\nHe observed: “While this news is positive, growth is still well below our population growth of 2.7 per cent.\nIt is therefore imperative that we all work together to harness the growth potential of the Nigerian economy.\n“If we take into account Nigeria’s Infrastructure Masterplan, we require close to N35 trillion worth of investment in order to attain double-digit growth."
  },
  {
    "headline": "Nigeria: Thirty Bodies Discovered After Boat Sinks in Northwest Kebbi State",
    "summarized_story": "Thirty bodies have been pulled from a river where a boat carrying more than 150 passengers sank in northern Nigeria.\nAuthorities in the West African Country said only 20 people were rescued when the ferry travelling between Niger state and Kebbi state broke in two.\nYusuf Birma, head of the National Inland Waterways Authority (Niwa) in Kebbi state told the reporters that 30 bodies have so far been recovered.\nThe state governor tweeted that it was “in deep shock and sorrow, over the unfortunate boat accident which claimed the lives of over 100 passengers”.\nThis is the second accident in the region this month, after at least 28 people drowned when their boat capsized two weeks ago in Niger state."
  }
]