[
  {
    "headline": "Osinbajo in Daura as Buhari’s son bags chieftaincy title",
    "summarized_story": "Vice President Yemi Osinbajo was among dignitaries that witnessed the turbaning ceremony of the President’s son, Yusuf Buhari, as the Talban Daura and District Head.\nThis is according to a statement by the Senior Special Assistant to the Vice President on Media and Publicity, Laolu Akande, titled, ‘Osinbajo graces installation of president’s son as Talban Daura, District Head’.\nIn his remark, the Emir of Daura, Dr Umar Umar, praised the President, Major General Muhammadu Buhari (retd.)\nHe added also that Daura had been transformed under the leadership of the President, lauding him for the developmental strides witnessed so far.\nWhile addressing the Vice President, the Emir of Daura said, “We extend our appreciation to His Excellency, the representative of the President."
  },
  {
    "headline": "Group to visit 40 correctional facilities to celebrate Adeboye",
    "summarized_story": "As part of its plan to celebrate the 80th birthday of the General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, a group, Reach4Christ, has launched the LightUp 40 Correctional Facilities outreach in a bid to win souls and to commit the youth to soul-winning.\nThe outreach is one of the initiatives of the 80-Day Soul Winning challenge aimed at winning eight million souls in 80 days to celebrate the 80th birthday of Pastor Adeboye.\nSpeaking at the unveiling event, the President of the Pentecostal Fellowship of Nigeria, Bishop Francis Wale-Oke, said the project resonated with God’s will as soul-winning is the heartbeat of God.\nDescribing Adeboye’s passion for soul-winning as an admirable and inspiring attribute, Wale-Oke urged every believer to participate in the 80-Day Soul Winning Challenge.\nAlso speaking at the event, the National Overseer, RCCG Nigeria, Pastor J. Obayemi, emphasised the blessing reserved for soul winners and anyone who chose to honour a father with a gift that touches His heart."
  },
  {
    "headline": "Customs intercept container load of weapons at Tin Can",
    "summarized_story": "By Godfrey Bivbere and Providence AdeyinkaThe Nigeria Customs Service, NCS Tin Can Island Command, has intercepted a 1x40ft container with number TRHU8058369, loaded with cartons of guns.\nVanguard gathered that the said container which was declared as plasma television was discovered after examination.\nHe however confirmed that the container of guns were discovered during routine examination at terminal B2 (Vehicle) of the Tin-can Island Container Terminal, TICT.\nThe customs however vowed to get the bottom of the vex import and apprehend those suspected connection with it.\nHe called on Tin-can Customs Command and others to redouble their to ensure they keep the society safety and ensure the Federal Government do not lose revenue."
  },
  {
    "headline": "Mourinho’s hand in Nigeria’s new foreign coach",
    "summarized_story": "By Jacob AjomThe Nigeria Football Federation will soon announce the appointment of a new foreign coach for the Super Eagles.\n“The NFF boss went as far as meeting with many respected names including the former Chelsea coach, Jose Mourinho to assist him in getting a good coach for Nigeria,” our source said.\n“Qualification to the 2022 World Cup is top priority for NFF president Amaju Pinnick,” he said.\nAlthough the new coach is expected to be named before the AFCON, he is expected to be in Cameroon as a spectator.\n“He is expected to have a first hand knowledge of the team from the background while interim coach Austin Eguavoen pilots the campaign for Nigeria’s fourth continental title,” our source added."
  },
  {
    "headline": "2023: Presidency must go to South East Edwin Clark insists",
    "summarized_story": "By Chioma GabrielFrontline presidential aspirant, Sen. Anyim Pius Anyim, in continuation of his consultations, met with elder statesman and leader of Pan Niger Delta Forum (PANDEF), Chief Edwin Clark in Abuja Friday.\nAnyim also took the opportunity to consult with Clark on the state of our nation and his plan for the future.\nChief Clark reaffirmed his passionate belief that the presidency of Nigeria in 2023 should go to the Southern part of Nigeria and indeed to Southeast zone.\n“I encourage you and others to continue the task of persuading and reassuring other Nigerians to share that vision”, Clark charged.\nChief Clark offered a fatherly moving prayers for God’s blessings, protection and guidance for Anyim."
  },
  {
    "headline": "Enugu Psychiatric Hospital seeks assistance for abandoned patients",
    "summarized_story": "By Dennis AgboThe Federal Neuropsychiatric Hospital, Enugu, FNHE, has raised the alarm over the growing number of abandoned mental health patients in the hospital and asked the general public for assistance in their treatment and welfare.\nMedical Director of the Hospital, Associate Professor Monday Igwe who raised the alarm during the hospital’s 2021 Thanksgiving and Town Hall Meeting, also solicited for philanthropic gestures to off-set the patients’ medical bills and meet-up their daily needs.\nHe appealed to the Enugu State government, especially the governor’s wife, to add their patients in her schedule for Christmas visit and donations.\nIgwe said: “We have some indigent patients as well as those patients abandoned by their relatives who currently the hospital and its staff are forced to feed, cloth and buy drugs for.\n“People should remember these indigent and abandoned patients during this special season of sharing,” he said."
  },
  {
    "headline": "Okowa, Wike, Nwokolo, others bid Prof. Ukala farewell",
    "summarized_story": "Delta Governor, Dr. Ifeanyi Okowa and wife, Edith, Rivers Governor, Nyesom Wike and member representing Ika Federal Constituency, Hon.\nVictor Nwokolo, were among dignitaries, who bade playright and Theatre scholar Prof. Samuel Ukala farewell on Saturday.\nWike was represented by Rivers State Attorney-General and Commissioner for Justice, Prof. Zaccaus Adangor (SAN).\nREAD ALSO:Reps to probe tax compliance by Bolt, Uber operatorsThe late Prof. Ukala was an emeritus Professor of Theatre Arts and Drama at the Delta State University, Abraka.\nVictor Ebonka, Vice Chancellor of the Delta State University Abraka, Prof. Andy Egwunyenga and wife Prof. Ebele, Vice Chancellor of University of Delta, Agbor, Prof. Stella Chiemeke, former Vice-Chancellor of the University of Benin, Professor Emmanuel Nwanze, among others."
  },
  {
    "headline": "Igbos must produce Nigeria’s next president in 2023 – Edwin Clark",
    "summarized_story": "Edwin Clark, leader of the Pan-Niger Delta Forum, has maintained that the Southeast “must” produce Nigeria’s next president in 2023.\nClark disclosed this when a presidential aspirant, Anyim Pius Anyim, visited him on Friday.\nClark noted his passionate “belief that the presidency of Nigeria in 2023 must go to the Southern part of Nigeria and indeed to South-East zone.\nThe Director-General of the Voice of Nigeria, VON, Osita Okechukwu, had said the Southeast should be allowed to produce Nigeria’s president because the region would not disappoint.\nOkechukwu assured that an Igbo president would help develop Nigeria because the Southeast is “talented to do so.”"
  },
  {
    "headline": "COAS urges new recruits to discharge duties effectively",
    "summarized_story": "The Chief of Army Staff (COAS) Lt Gen Faruk Yahaya has charged 4,000 newly-recruited soldiers of the Nigerian Army to put national interest over their personal interests as they discharge their duties effectivelyOnyema Nwachukwu, Brigadier General Director Army Public Relations, in a statement Saturday, said the COAS gave the charge during the Passing Out Parade (POP) of 81 Regular Recruits Intake at the Depot Nigerian Army in Zaria, Kaduna state.\nHe said the COAS who was the Special Guest of Honour and Reviewing Officer of the POP further Congratulated the young soldiers for the successful completion of their training.\nHe described Depot Nigerian Army as a key training institution responsible for molding selected able bodied citizens into well trained and disciplined soldiers, to meet the manpower requirements of the Nigerian Army, ready to execute the onerous task of tackling contemporary security challenges bedeviling the nation.\nThe COAS disclosed that the rigorous training undertaken by the young soldiers has transformed them into highly skilled and professional young soldiers, poised to enhance the strength and combat efficiency of the Service.\nYahaya reminded them of the importance of the Oath of Allegiance, to which they have all sworn, adding that by the oath they are under obligation to remain loyal to the Constitution and President, Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria."
  },
  {
    "headline": "Defence Chief Irabor’s order for Nigerian Generals’ resignation illegal – Lawyer, Festus Ogun",
    "summarized_story": "A legal practitioner, Festus Ogun, says the directive by Nigeria’s Chief of Defence Staff (CDS), Leo Irabor, asking scores of Generals to resign is illegal.\n“There is no provision under the Armed Forces Act or any other subsidiary law that supports the order for compulsory resignation of military officers.\nSo, it really beats the imagination why the Nigerian military would force its officers to exercise their discretion against their very interests.\n“In the recent past, those military officers courageous enough to challenge the illegality have always defeated the Nigerian military in court.\nDemanding an end to “reign of impunity”, the Principal Partner of Festus Ogun Legal charged “the victimized officers” to find the courage to challenge Irabor’s instruction."
  },
  {
    "headline": "Open Onne export corridor to boost African trade – Exporters urge FG",
    "summarized_story": "The Nigerian Export Promotion Council (NEPC) in Imo State have made a passionate appeal to the Federal Government to open the Onne export corridor in Rivers State as a way of boosting free trade in Nigeria and Africa at large.\nEkeh, who described Nigeria as the giant of Africa, said that free trade should begin in Nigeria.\nAccording to him, “there would be a reduction in loss of export products to bad roads with a shorter proximity to the port.\nOnwumere, a pharmacist urged attitudinal change toward manufacturing of export products and called on the media to constantly promote awareness for made in Nigeria goods.\nEarlier in an address, NEPC’s Trade Promotion Advisor in Imo, Mr Anthony Ajuruchi urged exporters to eschew complacency and take advantage of grants and other incentives for exporters in the country."
  },
  {
    "headline": "Army denies torturing civilian to death",
    "summarized_story": "This was expressed in a statement on Saturday by Onyema Nwachukwu Brigadier General, Director Army Public Relations.\nHe said the Nigerian Army is a disciplined regimented organization with a focused trained personnel, that has human life and zero tolerance for infringement on the rights of the citizenry.\n” His behaviour was rather weird and indicative of one who was obviously under some sort of influence.\n” In her conversation with the soldiers, she attributed her son’s weird behaviour to the influence of alcohol.\n” The soldiers, however, maintained that whatever was responsible for Christian’s behaviour at that time, was way beyond alcoholism."
  },
  {
    "headline": "‘Monarch accused me of being too stingy with money’",
    "summarized_story": "‘Monarch accused me of being too stingy with money’As governor of Osun State, Chief Bisi Akande had problems with the immediate past Ooni of Ife, Oba Okuade Sijuwade, and the Owa-Obokun of Ijeshaland, Oba Adekunle Aromolaran.\nHe also said Oba Aromolaran was always saying bad things about him because of his belief that he was stingy.\nI told him that Osun State had no money now to buy cars for traditional rulers.\n- Advertisement -“But his pestering was too much and I secretly sent money to him to buy a car.\nHe explained that the late Ooni wanted him to renew the Ede-Osogbo Waterworks which was to be repaired with $300 million."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Breaking: Customs intercepts container-load of firearms at Tin Can Port – The Sun Nigeria",
    "summarized_story": "By Steve AgbotaThe Tin Can Island Command of the Nigeria Customs Service (NCS) has intercepted a container loaded with guns and ammunition at the terminal B2 (Vehicle) of the TICT.\nSunday Sun learnt that the container was reportedly declared as plasma television, but on examination, Customs discovered it to be loaded with cartons of guns.\nHowever, the incident was surprising to the examination officers and the clearing agent because the shipper made very feeble attempt at concealing the firearms.\n“I wish therefore to confirm that a container suspected to be laden with arms and possibly ammunition was intercepted.\n“Following this development, the command intimated the terminal operators and requested that the suspected container be transferred to our enforcement unit for 100% examination."
  },
  {
    "headline": "Nigerian Navy reiterates commitment to protection of the maritime environment",
    "summarized_story": "BY PHILIP NWOSUThe Nigerian Navy said it would continue to secure the maritime environment for businesses to thrive in the country.\nThe Flag Officer Commanding (FOC), Western Naval Command, Rear Admiral Jason Gbassa said this during the 2021 Nigerian Navy Ceremonial Sunset for Lagos area which held at the Nigerian Navy Ship (NNS) BEECROFT, Apapa.\n“This will re-energise the Nigerian Navy and enhance her as a well-motivated naval force in the discharge of her constitutional mandate.\n“This has been the CNS mantra and we, in the Lagos area will ensure that the maritime environment is secured for economic activities to thrive,” Gbassa said.\nHe urged military personnel to reflect on the expectations of the maritime stakeholders and brace-up to whatever sacrifice they may be called upon to make in ensuring safety of the maritime environment."
  },
  {
    "headline": "Fire in Okeafa, Isolo sends residents panicking",
    "summarized_story": "Property worth millions of naira have been destroyed at the Okeafa plank Market near the Jakande Gate area of Lagos, as a night fire wreaks havoc at the market.\nWitnesses said the fire started late in the evening and continue till very late in the night, as the cause of the fire remains unknown.\nThe huge fire sends residents of the area into panic as they battle along side fire fighters to quell the the fire."
  },
  {
    "headline": "My plan after office in 2023 –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident President Muhammadu Buhari has assured that he would hand over to a successor at the end of 2023 general elections, after which he would return to his farm.\n“I look forward to the year 2023 when I will finish, to go home to take charge of my farm.\n“As he stepped out of his suite moving to the meeting room, President Buhari met a surprise line-up of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\nMeanwhile, President Buhari has said in furtherance of sustained efforts at keeping Nigerians safer, the country would partner with Turkey in dealing with the current security challenges facing the nation.\nHe said: “Turkey has practical experience dealing with challenges over the years and Nigeria stands to gain from that.”"
  },
  {
    "headline": "Popular Ifa priest, Yemi Elebuibon: Blood money ritual a hoax",
    "summarized_story": "Prominent Ifa priest, Chief Ifayemi Elebuibon, has debunked the belief by some Nigerians that using human blood and body parts could generate wealth.\nHe is the founder of Ancient Philosophy International, Osogbo, Osun State, a centre dedicated to teaching African traditional religion and performing arts.\nYou have been consistent as a traditional priest for many years, in spite of the decreasing popularity of traditional religion.\nThere is no lesson that the Bible or the Quran taught us that is not in Ifa Oracle.\nI have never at a time thought of leaving traditional religion."
  },
  {
    "headline": "Osinbajo, Lawan, Govs, Ministers Grace Installation of Buhari’s Son, Yusuf, as Talban Daura",
    "summarized_story": "This is just as the Emir of Daura, Alhaji Umar Farouk Umar, lauded the President for his leadership qualities while describing Osinbajo as a noble man and trusted person.\nSpeaking at the occasion, the Emir of Daura, Alhaji Umar, praised President Buhari for his leadership qualities, adding that power belongs to God and He gives it to whoever He pleases.\nCommending both the State and Federal Governments, the traditional ruler testified that the Katsina State Government had been working hard to end the difficulties of the masses.\nHe added also that Daura had been transformed under the leadership of the President, lauding him for the developmental strides witnessed so far.\nThe Emir of Daura also extended his appreciation to the Vice President who represented the President at the occasion."
  },
  {
    "headline": "Turkey to Help Nigeria Tackle Insecurity; Buhari, Erdogan Strengthen Defence Ties",
    "summarized_story": "“I am happy Nigeria is stepping up cooperation with other nations in areas of defence and health, and we are ready to cooperate with you on these areas and more,” said Erdogan.\nPresident Buhari had earlier said Nigeria would partner with the Republic of Turkey in dealing with the current security challenges facing the nation.\nPresident Gets Surprise Birthday Cake in IstanbulPresident Buhari, at a surprise 79th birthday reception organised for him in Istanbul yesterday promised to advance the interest of Nigerians and that of the nation as he prepares to leave office in May, 2023.\nAs he stepped out of his suite, moving to the meeting room, President Buhari met a surprise lineup of the Nigerian delegation with a cake decorated in Nigeria’s national colours.\n“I look forward to the year 2023 when I finish, to go home to take charge of my farm."
  },
  {
    "headline": "NLC to FG: We will Confront Fuel Subsidy Removal with Protests",
    "summarized_story": "*Plans nationwide warning rallies January next yearOnyebuchi Ezigbo in AbujaThe Nigeria Labour Congress (NLC) yesterday warned the federal government against plans to remove the fuel subsidy in 2022, saying the action would be met with nationwide protests.\nThe congress said the protests would commence without warning should the FG announce new fuel prices ahead of its scheduled warning rallies in all the states of the federation in January.\nThe FG had said it would remove the fuel subsidy next year, following advice by the International Monetary Fund, and the World Bank.\nThe NLC argued that fuel subsidy would expose Nigerian workers and the generality of the citizenry to acute deprivation, hardship and suffering, as it would worsen the already established trend of hyperinflation in the country.\nThis, it noted, informed the traditional position of the Congress to reject an incessant increase in the pump price of petrol which is usually disguised as deregulation or removal of fuel subsidy."
  },
  {
    "headline": "US Study: Omicron Markedly Resistant to Vaccines, Booster Shots",
    "summarized_story": "*Canada lifts travel ban on Nigeria, 9 other African countriesOur correspondentsA new study by Columbia University in the United States says the Omicron variant of COVID-19 is “markedly resistant” to existing vaccines and antibody treatments, and that even booster shots may provide only modest protection against infection.\n“We found Omicron to be markedly resistant to neutralisation in individuals vaccinated with one of the four widely used COVID-19 vaccines.\nEven serum from persons vaccinated and boosted with mRNA-based vaccines exhibited substantially diminished neutralising activity against Omicron,” says the study.\nThe country also re-imposed testing, warning that the Omicron variant of COVID-19 risks quickly overwhelming hospitals.\nHe said the lifting of the travel ban would take effect from 11:59 pm today."
  },
  {
    "headline": "In Battle for Control of FBN Holdings, Babalola Out, Abdullahi is New Chairman",
    "summarized_story": "Obinna ChimaIn what is evidently a battle for the control of FBN Holdings (FBNH), Remi Babalola yesterday resigned as Chairman, Board of Directors of the company, two days after FBNH confirmed significant investment by billionaire businessman, Femi Otedola.\nFBN Holdings is the parent company of First Bank of Nigeria.\nLast week, Otedola acquired an additional 2.5 per cent in FBN Holdings Plc., becoming the single largest shareholder in the company.\nIn a corporate filing on the Nigerian Exchange Limited (NGX) on Wednesday, FBN Holdings confirmed the deals.\nCBN Okays Abdullahi as New ChairmanThe CBN yesterday okayed the appointment of Abdullahi as the new Chairman of FBNH to replace Balalola."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Travellers In Ghana Forced To Pay $100 Per Night To Isolate At Hotel That Offers No Water, Food After Testing Positive For COVID",
    "summarized_story": "Aviation authorities in Ghana have heightened their clampdown on Nigerians who test positive for Coronavirus while travelling through any of their airports.\nOfficials of the West African nation move affected Nigerian travellers to M Plaza Hotel in Accra, the country’s capital, and force them to pay $100 (N56,000) per night to isolate themselves at the place.\nAccording to findings by SaharaReporters, the amount does not give the affected person access to water or food at the hotel.\nHe said, “Passengers who test positive for COVID are forced to pay $100 a night in a hotel that’s not worth the amount.\n“There is a pregnant woman currently among the Nigerians being forced to stay at M Plaza Hotel in Accra."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Travellers In Ghana Forced To Pay $100 Per Night To Isolate At Hotel That Offers No Water, Food After Testing Positive For COVID",
    "summarized_story": "Aviation authorities in Ghana have heightened their clampdown on Nigerians who test positive for Coronavirus while travelling through any of their airports.\nOfficials of the West African nation move affected Nigerian travellers to M Plaza Hotel in Accra, the country’s capital, and force them to pay $100 (N56,000) per night to isolate themselves at the place.\nAccording to findings by SaharaReporters, the amount does not give the affected person access to water or food at the hotel.\nHe said, “Passengers who test positive for COVID are forced to pay $100 a night in a hotel that’s not worth the amount.\n“There is a pregnant woman currently among the Nigerians being forced to stay at M Plaza Hotel in Accra."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "EXCLUSIVE: Nnamdi Kanu, Igboho’s Lawyers Lament Their Clients May Spend Christmas In Jail",
    "summarized_story": "The lawyer said he was waiting for Abia State High Court to fix a date to continue hearing of Kanu’s case.\nEjimakor said, \"It is my hope as his lawyer that he will not spend Christmas in detention, but we don't have any court case this year again.\nIn November, Yoruba self-determination group, Ilana Omo Oodua announced that it had begun the movement to secure the release of Igboho.\nThe group had approached the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, with a letter stating their demands.\nAlso, a Nigerian-American philanthropist, Toyin Dawodu urged the Benin Republic government to immediately release Igboho from detention."
  },
  {
    "headline": "How not to kill the ‘hustle’ of Nigerians",
    "summarized_story": "If you are unfortunate to go into water production in Lagos state, there are many gods to appease, apart from NAFDAC and SON.\nThey are: Lagos State Water Regulatory Commission (LSWRC), LASEPA, Lagos State the Ministry of Environment, Lagos State Ministry of Health, Lagos State Fire Service, Federal Fire Service, Local Government Environment Service, Local Government Health Department, Local Government Fumigation Department, Local Government Food Department and the health office nearest to the factory.\nDoes the government — federal, state or local — ever assess the heavy-handedness and how it impacts on the economy?\nGenerally, it is as if government deliberately wants to kill the entrepreneurial spirit of Nigerians.\nMENTAL HEALTHAdvertisementAbdulrahman Odunare Olamilekan, a young Nigerian, reportedly jumped into the lagoon at Epe, Lagos state, on Tuesday."
  },
  {
    "headline": "How not to kill the ‘hustle’ of Nigerians",
    "summarized_story": "If you are unfortunate to go into water production in Lagos state, there are many gods to appease, apart from NAFDAC and SON.\nThey are: Lagos State Water Regulatory Commission (LSWRC), LASEPA, Lagos State the Ministry of Environment, Lagos State Ministry of Health, Lagos State Fire Service, Federal Fire Service, Local Government Environment Service, Local Government Health Department, Local Government Fumigation Department, Local Government Food Department and the health office nearest to the factory.\nDoes the government — federal, state or local — ever assess the heavy-handedness and how it impacts on the economy?\nGenerally, it is as if government deliberately wants to kill the entrepreneurial spirit of Nigerians.\nMENTAL HEALTHAdvertisementAbdulrahman Odunare Olamilekan, a young Nigerian, reportedly jumped into the lagoon at Epe, Lagos state, on Tuesday."
  },
  {
    "headline": "Lai: Buhari’s wisdom helped stabilise Nigeria... posterity will be kind to him",
    "summarized_story": "Lai Mohammed, minister of information and culture, says President Muhammadu Buhari’s “wisdom” helped to “stabilise” Nigeria during its difficult times.\n“On the occasion of Mr President’s 79th birthday, I want to pay tribute to him for his service to the nation.\nPresident Muhammadu Buhari’s life has been that of unalloyed service to Nigeria, his country, and to humanity at large,” the statement reads.\n“He fought a war to keep Nigeria together, and that explains his passion for the country’s unity.\nThat Buhari is in charge of Nigeria at this time is not mere happenstance."
  },
  {
    "headline": "Lai: Buhari’s wisdom helped stabilise Nigeria... posterity will be kind to him",
    "summarized_story": "Lai Mohammed, minister of information and culture, says President Muhammadu Buhari’s “wisdom” helped to “stabilise” Nigeria during its difficult times.\n“On the occasion of Mr President’s 79th birthday, I want to pay tribute to him for his service to the nation.\nPresident Muhammadu Buhari’s life has been that of unalloyed service to Nigeria, his country, and to humanity at large,” the statement reads.\n“He fought a war to keep Nigeria together, and that explains his passion for the country’s unity.\nThat Buhari is in charge of Nigeria at this time is not mere happenstance."
  },
  {
    "headline": "COVID: Omicron now in 89 countries, says WHO",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron variant of the coronavirus has now been detected in 89 countries.\nAdvertisementIt added that “given current available data, it is likely that Omicron will outpace Delta where community transmission occurs”.\n“As of 16 December 2021, the Omicron variant has been identified in 89 countries across all six WHO regions.\nCurrent understanding of the Omicron variant will continue to evolve as more data becomes available,” the statement reads.\n“There are still limited available data, and no peer-reviewed evidence, on vaccine efficacy or effectiveness to date for Omicron.”"
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "TeamApt deploys an interesting active POS terminal performance management system for cluster managers.\nThis drives cluster managers to identify and recruit the best agents and engage them daily to improve their performance.\nFailing cluster managers can’t get additional terminals, and this means their multi-level earnings on their agent network caps.\nIt affects your cluster manager’s appraisal, which in turn affects your state co-ordinator and regional manager’s appraisal.\nMerchant agents can become cluster managers at LG level, grow into state managers, and finally regional heads, while increasing their earnings along the way."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 reasons you should care about the next frontier",
    "summarized_story": "Since then, we’ve explored The Next Frontier as it relates to edtech and fintech.\nAPI healthtech startupsPhoto by National Cancer Institute on UnsplashThe fintech industry has benefited a great deal from the presence of API fintech startups as they have eased interoperability.\nCurrently, there are no African startups providing healthtech startups with an API.\nWithout API startups, the process of getting your medical history has to begin afresh, but with an API startup, all that information could be gotten in seconds.\nHolding on January 22, 2022, it will feature startup competitions and exhibitions in addition to conversations on The next frontier."
  },
  {
    "headline": "A Zimbabwean Data Protection Act to rule them all. Or not",
    "summarized_story": "Other laws included the Consumer Protection Act, Census and Statistics Act, and the Interception of Communication Act, among others.\nInitially, The Cybercrimes and Data Protection Bill was to cover all things incidental to Cybercrime and Data Protection.\nAdvertisementThe current state of affairsThe Data Protection Act, as it is known now, is styled after the Southern Africa Development Community (SADC) model law on data protection.\nAnd it might be easier than starting afresh.”Following the recommendation of the Parliamentary Joint Committee, the new act was renamed the Data Protection Act instead of the Cybercrimes and Data Protection Act.\nThe European Union’s General Data Protection Regulation — the first comprehensive data protection law — provides for this."
  },
  {
    "headline": "Nigeria-based logistics company launches HELP, to provide ambulance services with its Uber-like model",
    "summarized_story": "Our people are scared for their lives, because what happens in the case of a health emergency?\nHow it worksThe HELP mobile app is currently available for Android users on the Play Store and is soon to be available on the App Store.\nThere are two levels of external partners at HELP, Service Partners and Client Partners.\nService partners on the HELP platform include hospitals, health facilities, and private ambulance owners in the country.\nInterestingly, a random person can access the HELP service with the code."
  },
  {
    "headline": "Recharge card sellers struggle to survive as buyers move online",
    "summarized_story": "People depended on him to sell physical recharge cards to stay in touch with their loved ones or conduct their businesses.\nI had to add provisions and snacks to support myself as the recharge card business started slowing down,” he told BusinessDay.\nShe says the business is still going well as she gets a lot of Customers who buy recharge cards from her.\nAccording to Hammed, the paper recharge card attracts more cost for the company compared to the digital form of recharging.\nKanayo, who was sitting underneath a Recharge card seller’s umbrella, told BusinessDay that he prefers to recharge online than buy the recharge card (on paper) due to the convenience that comes with it."
  },
  {
    "headline": "What to look out for in an artist",
    "summarized_story": "However, just by self proclamation, or being called an Artist by others does not translate to mean that such an artist is considered good or great.\nThe latter part of Amanda Palmer’s quote aptly captures it all; “You’re…a good artist when you make somebody else experience or feel something deep or unexpected.” One can recognise a good or great artist by how her/his art makes them feel.\nHowever, should a good or great artist be measured only by how her/his art makes one feel?\nThere are other things that make up the secret sauce of what makes an artist good or great.\nThe current market value of an artist can in many ways foretell how good or great this artist may become."
  },
  {
    "headline": "Illegal betting markets yield $1.7tr revenue annually",
    "summarized_story": "The sports betting market has been categorized into three which include, White market, Grey market, and Black market.\nIllegal betting operators produce illegal betting website agents, illegal bet placement results into instant messaging, as well as illegal betting transactions give rise to e-payment providers.\nAccording to the report, illegal betting is more appealing because the commercial attractiveness of illegal betting operators will always be higher than that of their legal counterparts.\nA well-detailed research into illegal betting markets in order to improve internal and external understanding of illegal betting risks.\nOther recommendations include enforcing action against illegal betting operators, close collaboration between local and international stakeholders, among others."
  },
  {
    "headline": "Obaseki congratulates Alenkhe on emergence as Edo NUJ chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated Mr. Festus Alenkhe on his emergence as the Chairman of the Edo State chapter of the Nigeria Union of Journalists (NUJ) after a keenly contested election.\nAlenkhe, a crime journalist with the state-owned Edo Broadcasting Service (EBS), defeated the immediate past Secretary of the union, Titus Akhigbe.\nObaseki described the outcome of the election as a reflection of the choice of journalists and media professionals across the different chapels in the state.\nHe noted that Alenkhe is a thorough-bred journalist who has distinguished himself in crime reporting, noting that he was confident that he would bring his wealth of experience to bear in the administration of the NUJ in the state.\nThe governor urged Alenkhe on uniting the NUJ and mobilizing members of the union to meet their function of providing information, enlightenment, entertainment and surveillance to the larger society."
  },
  {
    "headline": "Osinbajo, Obaseki lay foundation for 20-hectare Edo Tech Park, inaugurate shared facility for MSMEs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Vice President Yemi Osinbajo and the Edo State Governor, Mr. Godwin Obaseki, on Friday, performed the groundbreaking for the 20-hectare permanent site of the Edo Tech Park and inaugurated a shared facility for Micro, Small and Medium Enterprises (MSMEs) in Edo State.\nInaugurating the shared facility for furniture production in Edo, Osinbajo said MSMEs are of top priority to the government in boosting the country’s economy.\nCommending the Vice President, Obaseki said the state government will adopt the facility model to build similar facilities in the six technical colleges across the state.\nMeanwhile, laying the foundation for the Edo Tech Park, the Vice President said the government will continue to play the role of a regulator in the tech space.\nThat mustard seed you sowed is what you saw at the take-off campus of the Edo Tech Park."
  },
  {
    "headline": "Students’ unrest: Edo govt shuts Idogbo Secondary School – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Friday, announced the indefinite closure of Idogbo Secondary School in Ikpoba-Okha Local Government Area of the state, following the destruction of the school’s property by some students and hoodlums on December 2, 2021.\nSecretary to the State Government, Osarodion Ogie Esq., in a statement, said the closure of the school is to enable the government to ascertain the level of destruction, effect repairs and put modalities in place to avoid any reoccurrence in the future.\nOgie noted that the resumption date for the school will be communicated in due course.\nAccording to him, “It is hereby announced for the information of the General Public, especially the Principals, Teachers and Students of Idogbo Secondary School, Idogbo, Ikpoba-Okha Local Government Area, that sequel to students unrest, which resulted in the destruction of the school’s property by some students and hoodlums on December 2, 2021, the school is hereby closed down till further notice.\n“The closure of the school is to enable the State Government ascertain the level of destruction, effect repairs and put modalities in place to avoid any reoccurrence in future.”..."
  },
  {
    "headline": "Obaseki strengthens security architecture, donates 50 patrol vehicles, 60 motorcycles to operatives – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has presented 50 patrol vehicles and 60 motorbikes to security agencies to further strengthen the capacity of security operatives to tackle crime and criminality in the state.\nObaseki handed over the vehicles to the security operatives shortly after the monthly Security Council Meeting at the state’s Command and Control Centre in Benin City.\nAccording to him, “Today, we are formally handing over the first batch of vehicles and bikes to security agencies to sustain our security network in Edo.\nThese are made up of 50 vehicles, including patrol and Hilux vans and 60 motorbikes.\nThe governor said all federal security operatives and the state’s vigilante network will be represented at the new Command and Control Centre."
  },
  {
    "headline": "WHO says Omicron Covid-19 variant now in 89 countries",
    "summarized_story": "Global health body, the World Health Organisation (WHO) has said the new Omicron variant of the coronavirus has now been detected in 89 countries.\nIn a statement on Saturday, WHO said there is consistent evidence that Omicron has a substantial growth advantage over Delta, adding that “given current available data, it is likely that Omicron will outpace Delta where community transmission occurs.”According to the organisation, “As of 16 December 2021, the Omicron variant has been identified in 89 countries across all six WHO regions.\nCurrent understanding of the Omicron variant will continue to evolve as more data becomes available,” the statement reads.\n“It is spreading significantly faster than the Delta variant in countries with documented community transmission, with a doubling time between 1.5–3 days.\n“There are still limited available data, and no peer-reviewed evidence, on vaccine efficacy or effectiveness to date for Omicron.”"
  },
  {
    "headline": "Lady Adanma Okpara: Eastern Nigeria Amazon Embarks on Her Final Journey Home",
    "summarized_story": "However, Dr. Okpara had a secret weapon in Lady Adanma, then a 37-year-old teacher, who readily stepped up to the responsibility of guiding her husband.\nIndeed, Lady Adanma as First Lady, epitomized humility, simplicity and dedication.\nIndeed, when Dr. Okpara left office, the only landed property he owned was one uncompleted building at Ogui Road in Enugu.\nThere he would live until his death in 1984, and there Lady Adanma lived till she passed on, too.\nLady Adanma set a standard on many fronts: In leadership, humility, discipline dedication, she was never found wanting."
  },
  {
    "headline": "Nigeria’s debt to China rises to $4.15 billion",
    "summarized_story": "Debt Management Office (DMO) in its latest data has revealed that Nigeria’s debt to China is $4.15 billion as of September 2021.\nThis balance is out of a total debt of $6.5 billion available for Nigeria to draw down.\nMost of the debts are for a period of 20 years with a grace period to repay the principal of about 7 years.\nOnly a $200 million debt had a tenor of 12 years with a grace period of 5 years.\nNigeria’s debt to China has risen over the last decade as government diversifies its debt portfolio towards cheaper Chinese loans with rates at an average of 2.5% per annum."
  },
  {
    "headline": "Customs Intercepts Container-Load Of Guns In Lagos",
    "summarized_story": "Officials of the Nigeria Customs Service attached to Tin Can Island Command intercepted a 40ft container carrying arms on Friday.\nThe owner of the container allegedly declared that the content were plasma televisions, but customs officers at the command discovered it contained cartons of guns.\nThe Public Relations Officer of the Tin Can Customs, Mr Uche Ejesieme, confirmed the development, saying that the container of guns was discovered during a routine examination at terminal B2 (Vehicle) of the TICT.\nHe added that, in line with service protocol, the command would inform the Customs high command in Abuja after the container had been thoroughly examined at the enforcement unit of the command.\n“As we speak, we do not have full details of who is behind the import, country of import and the model of guns."
  },
  {
    "headline": "CASER Seeks Disengagement Of MedTech, Others In Implementation Of ICTN",
    "summarized_story": "The Citizens Advocacy For Social and Economic Rights (CASER) has decried the blatant disregard for legal standards of public procurement as being witnessed in the alleged manipulation of President Muhammadu Buhari’s earlier directive for an International Competitive Bidding to be conducted for the appointment of an agent to implement the International Cargo Tracking Note (ICTN).\nICTN is a web-based portal for managing the security and accuracy of cargo, freight, and vessels coming into and leaving Nigeria.\nIt is a cargo verification solution that is internet[1]based and provides real-time information on cargo destined to implementing country.\nAddressing a press briefing in Abuja yesterday, the executive director, CASER, Barr Frank Tietie, said to cover up violations MedTech Scientific Ltd and Rozi International were appointed to implement ICTN in the country.\nTietie said they are compelled as a Nigerian civil society organisation, in the public and national interest, to bring to the attention f the public that the ongoing implementation of ICTN as recently directed by President Buhari was fraught with issues of official malfeasance, fraudulent misrepresentation, and brazen violation of known legal standards of public procurement."
  },
  {
    "headline": "CASER Seeks Disengagement Of MedTech, Others In Implementation Of ICTN",
    "summarized_story": "The Citizens Advocacy For Social and Economic Rights (CASER) has decried the blatant disregard for legal standards of public procurement as being witnessed in the alleged manipulation of President Muhammadu Buhari’s earlier directive for an International Competitive Bidding to be conducted for the appointment of an agent to implement the International Cargo Tracking Note (ICTN).\nICTN is a web-based portal for managing the security and accuracy of cargo, freight, and vessels coming into and leaving Nigeria.\nIt is a cargo verification solution that is internet[1]based and provides real-time information on cargo destined to implementing country.\nAddressing a press briefing in Abuja yesterday, the executive director, CASER, Barr Frank Tietie, said to cover up violations MedTech Scientific Ltd and Rozi International were appointed to implement ICTN in the country.\nTietie said they are compelled as a Nigerian civil society organisation, in the public and national interest, to bring to the attention f the public that the ongoing implementation of ICTN as recently directed by President Buhari was fraught with issues of official malfeasance, fraudulent misrepresentation, and brazen violation of known legal standards of public procurement."
  },
  {
    "headline": "Police Rescue Kidnapped Ilorin Traditional Chief",
    "summarized_story": "The Kwara State Police Command has rescued the Ilorin Emirate traditional chief, Dr Zubair Erubu, from kidnappers.\nZubair, a retired permanent secretary and Magaji Erubu of Ilorin, was kidnapped on December 9, 2021 along Ilorin-Afon road in Asa local government area of the state.\nThe spokesman of the police in the state, Okasanmi Ajayi, in a statement said they had secured the release eight days after he was kidnapped.\nAjayi said:” The victim of the recent kidnap incident that took place on the 9/12/2021 at Afon area of Ilorin, Dr Folorunso Zubair Erubu has been released this morning, after days of thorough search and rescue operation directed by the commissioner of police, CP Tuesday Assayomo.\nADVERTISEMENT“The release was made possible with the cooperation of the victim’s family members, the community and other security stakeholders, vigilante and hunters.”"
  },
  {
    "headline": "Police Rescue Kidnapped Ilorin Traditional Chief",
    "summarized_story": "The Kwara State Police Command has rescued the Ilorin Emirate traditional chief, Dr Zubair Erubu, from kidnappers.\nZubair, a retired permanent secretary and Magaji Erubu of Ilorin, was kidnapped on December 9, 2021 along Ilorin-Afon road in Asa local government area of the state.\nThe spokesman of the police in the state, Okasanmi Ajayi, in a statement said they had secured the release eight days after he was kidnapped.\nAjayi said:” The victim of the recent kidnap incident that took place on the 9/12/2021 at Afon area of Ilorin, Dr Folorunso Zubair Erubu has been released this morning, after days of thorough search and rescue operation directed by the commissioner of police, CP Tuesday Assayomo.\nADVERTISEMENT“The release was made possible with the cooperation of the victim’s family members, the community and other security stakeholders, vigilante and hunters.”"
  },
  {
    "headline": "SMEDAN Rewards 6 Youths For Inventing Agro-processing Machines",
    "summarized_story": "The Small and Medium Enterprises Development Agency of Nigeria (SMEDAN) yesterday rewarded six young Nigerians who invented various agro-processing machines with cash ranging from N200,000 to N1.5 million.\nThe awardees emerged winners in a talent hunt organised by SMEDAN to encourage young Nigerians to venture into agro-businesses and allied matters.\nSpeaking at the event, the head of the judges’ panel, Engr Olalekan Dolapo, urged the winners not to rest on their oars.\nADVERTISEMENTThe overall winner, Oke Michael Adeolu, on behalf of his colleagues thanked the federal government for providing the SMEDAN the wherewithal to organise the talent hunt.\nHe urged Nigerian youths to embrace agriculture and agro-businesses which he described as viable providers of job opportunities."
  },
  {
    "headline": "Two injured as herders, farmers clash in Anambra",
    "summarized_story": "Two persons were reportedly injured at Ugbene, Awka North Local Government Area of Anambra State, during a clash between farmers and cattle breeders in the area.\nBut the state Police command told The Nation yesterday that there was no clash between the farmers and herders in the state.\nThe Police Public Relations Officer, Ikenga Tochukwu, said the clash was simply between two persons.\nTochukwu warned that people should stop fanning the embers of discord in the state, adding that the issue of herders and farmers clashes ended over a year ago.\nThe group alleged that herders living in some parts of the state were being attacked on a daily basis."
  },
  {
    "headline": "Two injured as herders, farmers clash in Anambra",
    "summarized_story": "Two persons were reportedly injured at Ugbene, Awka North Local Government Area of Anambra State, during a clash between farmers and cattle breeders in the area.\nBut the state Police command told The Nation yesterday that there was no clash between the farmers and herders in the state.\nThe Police Public Relations Officer, Ikenga Tochukwu, said the clash was simply between two persons.\nTochukwu warned that people should stop fanning the embers of discord in the state, adding that the issue of herders and farmers clashes ended over a year ago.\nThe group alleged that herders living in some parts of the state were being attacked on a daily basis."
  },
  {
    "headline": "Oil spill: Investigation stalled as Aiteo allegedly bars Bayelsa Committee from JIV",
    "summarized_story": "Joint Investigative Visit (JIV) into the cause and volume of spill from the leak at Oil Mining Lease (OML) 29 suffered a setback following the exclusion of Bayelsa Technical Committee on the incised set up by Gov Douye Diri.\nOfficials of Aiteo Eastern Exploration and Production, operators of the OML 29 had opposed the inclusion of media in the investigation as the Bayelsa Technical Committee insisted that inclusion of the press was to ensure transparency.\nThe divergent views expressed by the two parties led to a boycott by the representatives of Bayelsa Ministry of Environment and Bayelsa Government Technical Committee on the Nov 5, incident.\nThe 11 member Bayelsa Technical Committee inaugurated by Diri on Dec 15 comprised five representatives five members.\nOthers are Mr Tobin Igiri, an Earth Scientist, Mr Enai Reuben, the Head of Petroleum and Pollution Department in the Bayelsa State Ministry of Environment, and Mr Iniruo Wills, a former of Environment in Bayelsa."
  },
  {
    "headline": "Oil spill: Investigation stalled as Aiteo allegedly bars Bayelsa Committee from JIV",
    "summarized_story": "Joint Investigative Visit (JIV) into the cause and volume of spill from the leak at Oil Mining Lease (OML) 29 suffered a setback following the exclusion of Bayelsa Technical Committee on the incised set up by Gov Douye Diri.\nOfficials of Aiteo Eastern Exploration and Production, operators of the OML 29 had opposed the inclusion of media in the investigation as the Bayelsa Technical Committee insisted that inclusion of the press was to ensure transparency.\nThe divergent views expressed by the two parties led to a boycott by the representatives of Bayelsa Ministry of Environment and Bayelsa Government Technical Committee on the Nov 5, incident.\nThe 11 member Bayelsa Technical Committee inaugurated by Diri on Dec 15 comprised five representatives five members.\nOthers are Mr Tobin Igiri, an Earth Scientist, Mr Enai Reuben, the Head of Petroleum and Pollution Department in the Bayelsa State Ministry of Environment, and Mr Iniruo Wills, a former of Environment in Bayelsa."
  },
  {
    "headline": "Buhari: Boko Haram still active, preying on soft targets",
    "summarized_story": "President Muhammadu Buhari said the Boko Haram terrorist group, though fragmented by internal strife and degraded by Nigeria’s defense forces, is still active and preying on soft targets.\nBuhari made this known while speaking at the third edition of the Turkey-Africa Partnership Summit on Saturday.\nThe president, however, called on the Turkey-Africa Partnership Summit to provide concrete support to help defeat terrorism and insurgency on the African continent.\n‘‘In this regard, Nigeria strongly endorses the Summit Declaration as well as the 2022-2026 Joint Action Plan,’’ he said.\nHe urged the African Continental Free Trade Agreement (AFCTA) to assist in further increasing the level of Africa-Turkey trade, leading to a win-win for all countries."
  },
  {
    "headline": "Nigeria collapsing under your leadership: Ortom tells Buhari",
    "summarized_story": "Benue State Governor Samuel Ortom said President Muhammadu Buhari is a father and a grandfather who should understand that Nigeria is collapsing due to the activities of terrorists.\nOrtom stated this in a message on Saturday to congratulate Buhari on his 79th birthday.\nHe said President Buhari may have good plans but Nigeria is gradually bleeding to death.\nAll is not well with Nigeria right now Mr. President.\nHe prays that God will keep Mr. President in perfect health and grant him the wisdom and strength to steer the nation to stability."
  },
  {
    "headline": "Pictorial: Actor Adedimeji Lateef Marries Adebimpe Oyebade",
    "summarized_story": "Nigerian actor, Adedimeji Lateef, on Saturday tied the knot with a fellow Nollywood star, Adebimpe Oyebade.\nThe duo took to their respective Instagram pages to share pictures from the wedding.\nSharing a picture of herself and her husband, the actress wrote, “Today I marry my best friend.”The actor also wrote, “The grace of the Almighty is sufficient.\nToday I marry my best friend.”See pictures of the couple below:"
  },
  {
    "headline": "PHOTOS: Yusuf Buhari’s Day Of Honour In Daura",
    "summarized_story": "President Muhammadu Buhari’s son, Yusuf, has been turbaned Talban Daura, making him the District Head of Kwasarawa.\nThe event, which held in the president’s hometown of Daura in Katsina State, had Vice-President Yemi Osinbajo; Senate President Ahmad Lawan; Governor Abdullahi Ganduje of Kano State; Aviation Minister, Senator Hadi Sirika, his Niger Delta and Science and Technology counterparts as well as many other Senators.\nAlso in attendance was the father-in-law of the new Talba, the Emir of Bichi, Alhaji Nasiru Ado Bayero.\nSee photos below:"
  },
  {
    "headline": "BREAKING: Popular Ex-Minister Is Dead",
    "summarized_story": "Alhaji Hussaini Zanwa Akwanga, a former Minister of Labour and Productivity, is dead.\nAccording to a report by Vanguard, Akwanga died on Friday at the age of 77 after a protracted illness in his country home Akwanga, the headquarters of Akwanga local government of Nasarawa State.\nThe former Minister, a professional teacher, became a minister in 2003 but was sacked by the then President Olusegun Obasanjo.\nIn 2017, the former minister was kidnapped in his farm in Kurmin Tagwaye Village, near Akwanga, but was however released two days later after paying the ransom.\nThe deputy chairman of Akwanga local government area of Nasarawa State, Alhaji Safiyanu Isa who confirmed the death of the former Minister said “the former minister died today (Friday), in Akwanga”He has since been buried according to Islamic rites in his hometown, Akwanga."
  },
  {
    "headline": "BREAKING: Sokoto Governor, Tambuwal Orders Arrest Of Musician Who Released Song Praising Bandit Kingpin, Turji",
    "summarized_story": "Sokoto State governor, Aminu Waziri Tambuwal has ordered the arrest of a musician, Mohammad Danshanawa for praising a bandit kingpin, Bello Turji in his music.\nIn a viral music audio, Danshawa praised the terrorist, Turji, describing him as “a lion, untouchable and a great leader”.\nThe governor’s order comes three days after the song went viral on several social media platforms.\nCommenting on the song, Governor Tambuwal said, “We ordered for his arrest to serve as a deterrent.\nAs it is, one cannot move from Sokoto here to Illeila, yet someone is praise-singing a terrorist.”"
  },
  {
    "headline": "By January, I ‘ll expose those behind insecurity in Imo – Uzodinma",
    "summarized_story": "Imo state governor Hope Uzodinma has revealed his readiness to expose those sponsoring various kinds of crime against the people of the state.\nThe governor who disclosed this on Saturday during the inauguration of newly elected executive of All Progressives Congress (APC) in Owerri.\nGovernor Uzodinma said all those involved in causing one form of insecurity or the other will face the full wrath of the law.\nHe said the names of those culpable will be revealed on January 3, 2022 when a stakeholders’ meeting will be convened.\nDetails loading…"
  },
  {
    "headline": "Tragedy! Bus crushes 8 dead at marriage party",
    "summarized_story": "A bus ran over a marriage party on Friday night in Pakistan’s eastern Punjab province, leaving eight people dead and nine others injured, local media and police said.\nThe uncontrolled bus crushed a group of people enjoying a marriage party in front of their house on the roadside near the Tahli Adda area of the Mandi Bahauddin district of Punjab, local police said.\nThe death toll is feared to rise as most wounded are in critical condition, said a hospital official.\nThe initial investigation revealed that the incident occurred amid dense fog when the driver lost control of the bus, local media reported.\nPunjabi police confiscated the bus and registered a case against the driver, who ran away after the accident."
  },
  {
    "headline": "Sylvester Oromoni, others: Boarding schools now death chambers?",
    "summarized_story": "Are boarding schools now death chambers, PAUL OKAH asks in this report.\nThis is as the House of Representatives directed the Inspector General of Police to investigate all victims of crimes in boarding schools.\nAlthough we do have one or two issues, but, to be frank, there are nothing compared to all these problems recorded in private boarding schools.\nMany parents often take their kids to boarding schools, simply because they’re avoiding responsibilities and also many of the children at boarding schools are products of broken homes.\nMajority of the shortfalls are mostly found within the private boarding schools."
  },
  {
    "headline": "Army Admits 4,800 More Soldiers To Combat Insecurity",
    "summarized_story": "﻿The Army on Saturday admitted 4,800 new soldiers at a passing out parade ceremony held in Kaduna State.\nThe new recruits are expected to contribute to the army’s ongoing operations in various parts of the country, the Chief of Army Staff, Lieutenant General Farouk Yahaya, said.\n“They commenced their training in August and they have been trained as professional soldiers in line with our training directives, taking cognisance, of course, of the current environment,” the army chief said.\n“The drive as mandated by Mr. President is to increase our strength and have more feet on the ground in addition to all the things we are doing,” he said.\n“And he has provided all the resources for this.”He added that there is also provision for specialised training being given to those already in the service, to enhance their capabilities."
  },
  {
    "headline": "294 Shops Razed In Lagos Market Fire – LASEMA",
    "summarized_story": "No fewer than 294 shops have been completely razed after a night fire raged at the Oke-Afa Planks and Building Materials Market in the Ejigbo area of Lagos State on Friday.\nThe Lagos State Emergency Management Agency confirmed the incident in a statement on Saturday.\nAlthough the cause of the inferno that started around 9 pm on Friday is yet to be ascertained, LASEMA said there was no record of casualties and no loss of lives.\nBesides the 294 shops razed, other properties destroyed by the fire include two residential bungalows, a market mosque, three storage tanks, amongst others.\nHe appealed to all traders to ensure their properties are well insured while urging Lagosians to be safety-conscious and vigilant especially during the harmattan season which is harsh and prone to fire incidents."
  },
  {
    "headline": "Sylvester Oromoni: Police Release Body To Family After Fresh Autopsy",
    "summarized_story": "The Lagos State Police Command has released the remains of the late student of Dowen College, Sylvester Oromoni, for burial.\nSylvester’s body was moved to Lagos on Monday from Delta state for the Autopsy at a public facility in the nation’s commercial hub.\nREAD ALSO: Sylvester Oromoni: Coroner Fixes December 15 For Preliminary MeetingOn Wednesday, the body was escorted back to Delta State where he will be laid to rest.\nAs part of the means to get the deserved justice for the 12-year-old boy, the Oromoni family had demanded a coroner inquest into the student’s death.\nThis is even as the Lagos State Commissioner of Police, Hakeem Odumosu, said that some students have been arrested for the alleged assault."
  },
  {
    "headline": "PHOTOS OF THE WEEK: Oba Of Benin Welcomes Home Looted Artefacts",
    "summarized_story": "This week’s photos, curated by channelstv.com‘s Photo Editor, Sodiq Adelakun, start from the ancient city of Benin and barrels down the town of Kayunga in Central Uganda, before terminating with the sombre snapshot of a football icon’s forced goodbye in Barcelona, Spain:"
  },
  {
    "headline": "Arsenal Thrash Leeds To Tighten Grip On Fourth Place",
    "summarized_story": "Arsenal consolidated their position in the Premier League’s top four with a 4-1 rout of Leeds in the only Premier League match on Saturday to survive a wave of coronavirus postponements.\nREAD ALSO: Dortmund Loss At Hertha Leaves Bayern Nine Points Clear“We were really lucky to play today with everything that’s happening,” said Arsenal boss Mikel Arteta.\nA meeting of the 20 Premier League clubs will take place on Monday to decide whether to go ahead with the Boxing Day fixtures next weekend or to halt the season temporarily.\n“The Premier League will make the best decision for everybody, but we want to play all under the same rules.\nLeeds had a three-goal deficit to overcome at half-time after Saka’s deflected shot left Meslier wrong-footed three minutes before the break."
  },
  {
    "headline": "Group vows to go to court to ensure Asiwaju Tinubu contest in 2023 -",
    "summarized_story": "A group, known as the Disciples of Jagaban (DOJ), has vowed to drag the National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu to court if he declined contesting for Presidency in the next general elections.\nThe leader of the group, Abdulhakeem Alawuje, noted that the main reason is because the suffering in the country has gotten out of control and the National Leader of the APC, has the capacity and strategy to change the situation.\nHe further explained that the giant strides Bola Ahmed Tinubu made as governor of Lagos State is enough proof that he can stabilize the nation if he becomes president in 2023.\nThe group went on to flagg off a continuous voter registration campaign in Kaduna state to sensitize youths and the general public on the need to get registered to vote.\nThey hope the campaign will also help raise the quality of participation in Politics in Nigeria"
  },
  {
    "headline": "PGF Secretariat greets PGF DG, Salihu Lukman at 59",
    "summarized_story": "The Progressive Governors Forum (PGF) Secretariat has congratulated the Director General of the Progressives Governor Forum, Salihu Lukman, on his 59th birthday.\nThe statement reads partly thus: “We appreciate your leadership style and personal commitment to the ideals of progressivism.\nAs the Director General of PGF Secretariat, we celebrate your doggedness and uncommon contributions to the development of policies across the APC controlled States and Nigeria as a whole.\n“Here in the secretariat, you always put your time and energy to make staff members be at their best.\n“Once again, congratulations and Happy Birthday, Comrade Salihu Lukman,” the statement said."
  },
  {
    "headline": "Buhari postpones official visit to Ogun",
    "summarized_story": "Ogun State Government has announced the postponement of the official visit of President Muhammadu Buhari to the State initially scheduled for Tuesday, 21st December 2021.\nIn a statement issued on Friday in Abeokuta by Tokunbo Talabi, Secretary to Ogun State Government, the government said a new date for the visit and commissioning of some of the landmark projects of Prince Dapo Abiodun Administration will be announced in due course.\nThe Government regrets any inconvenience the postponement might cause the invited guests, the statement concluded."
  },
  {
    "headline": "Photos: President Buhari cuts 79th birthday cake in Turkey",
    "summarized_story": "President Muhammadu Buhari, on Friday in Istanbul, Turkey cut his 79th birthday cake in the presence of some senior government officials.\nThe president alongside some of his ministers and other presidential aides had departed the country for the Africa-Turkey Investment Summit in Istanbul.\nAccording to pictures from the short ceremony, President Buhari and other top government officials including the minister of Foreign Affair, Geoffrey Onyeama, Minister of State Education, among others were in cheerful mood.\nSee photos below:"
  },
  {
    "headline": "Tesla Faces Investor Lawsuit Over Musk Tweets on 10% Stock Sales",
    "summarized_story": "Tesla Inc) was hit by a lawsuit over CEO Elon Musk’s social media posts including his Twitter poll on stock sales that pulled down its stock prices.\nTesla investor David Wagner called for access to internal documents to investigate whether Tesla and Musk violated an agreement with the U.S. securities regulator and its board members failed to adhere to their fiduciary duties.\nIn 2018, Musk settled a lawsuit by the Securities and Exchange Commission over his tweet on taking the company private, agreeing to have the company’s lawyers pre-approve tweets with material information about the company.\nTesla shares, which had hovered near record-highs, lost their value by about a quarter after Musk said on Nov. 6 he would sell 10% of his stake if Twitter users agreed.\nThe lawsuit, filed with the Delaware Court of Chancery on Thursday, seeks to obtain records and books related to his tweets, including documents to identify whether the stock sales tweets were reviewed or pre-approved in advance."
  },
  {
    "headline": "US Covid Vaccine Mandate Revived, Supreme Court Showdown Looms",
    "summarized_story": "A US appeals court on Friday reinstated a nationwide vaccine-or-testing COVID-19 mandate for large businesses, which covers 80 million American workers, prompting opponents to rush to the Supreme Court to ask it to intervene.\nread more“While we are disappointed in the Court’s decision, we will continue to fight the illegal mandate in the Supreme Court,” South Carolina Attorney General Alan Wilson said on Twitter.\n“We are confident the mandate can be stopped.”Within hours of the ruling, at least three petitions were filed with the U.S. Supreme Court, asking it to immediately block the mandate.\nread moreCourts have blocked Biden’s vaccine requirement for healthcare workers in half the states and a vaccine mandate for federal contractors has been blocked nationwide.\nRepublicans, conservative groups and trade organizations sued over the OSHA rule, arguing the agency overstepped its authority."
  },
  {
    "headline": "Hafsat Maina Muhammed: I Was Raped and Abducted, But Found My Voice",
    "summarized_story": "A heart-rending video call between two ladies went viral went at the weekend.\nThe lady in the video is Hafsat Maina Muhammed, a married mother of six children, and an indigene of Gwoza Local Government Area in Borno State.\nBefore her abduction, Hafsat worked as a full time journalist in Kano for Pyramid FM, Liberty Radio and T.V, FRCN Kaduna and Freedom Radio Jigawa State.\nShe joins the Morning Show from her base in Prince George’s Country in Maryland, U.S. is Hafsat Maina Muhammed.\nGood morning Hafsat and thank you for joining us on The Morning Show."
  },
  {
    "headline": "Following Confirmation of Otedola as Largest Shareholder, FBN Holdings Names Abdullahi New Chairman",
    "summarized_story": "FBN Holdings is the parent company of First Bank of Nigeria.\nAs at press time, it was not clear whether, Abdullahi was nominated by Otedola, who is now the single largest shareholder in the company.\nIndustry sources said FBNH had on Wednesday informed regulators about Otedola’s new position as the single largest shareholder.\nLast week, Otedola acquired an additional 2.5 per cent in FBN Holdings Plc., becoming the single largest shareholder in the company.\nIn a corporate filing on the Nigerian Exchange Limited (NGX) on Wednesday, FBN Holdings confirmed the deals."
  },
  {
    "headline": "Canada Lifts Travel Ban on Nigeria, 9 Other African Countries",
    "summarized_story": "Canada announced on Friday the lifting of a ban on foreign travellers from Nigeria and nine other African countries.\nThe country also re-imposed testing, warning that the Omicron variant of COVID-19 risks quickly overwhelming hospitals.\nApart from Nigeria, the travel restriction on flights is also lifted on South Africa, Mozambique, Botswana, Zimbabwe, Lesotho, Eswatini, Namibia, Malawi and Egypt.\nHe said the lifting of the travel ban would take effect from 11:59 pm today.\nThe restriction had been announced last month “to slow the arrival of Omicron in Canada and buy us some time,” he said."
  }
]