[
  {
    "headline": "Oscars: Will Smith apologises to Chris Rock over slap",
    "summarized_story": "Actor Will Smith apologised Monday to Chris Rock for hitting the comedian during the live broadcast of the glitzy Oscar ceremony in Hollywood.\nMy behaviour at last night’s Academy Awards was unacceptable and inexcusable.\nPinkett Smith suffers from alopecia, a condition that causes hair loss and had a closely cropped head at Sunday’s ceremony.\nThe 94th Academy Awards was in its final hour when actor and comedian Rock quipped that Pinkett Smith appeared ready to star in G.I.\nAfter at first appearing to laugh at the joke, Smith walked onto the stage and smacked Rock with an open hand."
  },
  {
    "headline": "We’ll use groundwater to address scarcity in Lagos –Engineers",
    "summarized_story": "THE Nigerian Institute of Environmental Engineers has assured residents of Lagos State that it would utilise groundwater to tackle the problems of unsafe water and water scarcity.\nResidents of the state have been reacting to the water scarcity experienced in Ketu, Ikorodu, Surulere and Alimosho areas of the state.\nHe said, “Water scarcity in the state is a concern to us because people must have access to clean water.\nArticle VI of the Sustainable Development Goals talks about access to water and sanitation, and this water has to be potable.\n“So, to tackle this lack of safe water, we want to first create awareness; collaborate with the government, the society and other stakeholders to ensure that people have access to safe water."
  },
  {
    "headline": "CITAD calls for sustainable community networks to bridge digital divide in Nigeria",
    "summarized_story": "The Centre for Information Technology and Development (CITAD) has called for commitments towards the establishment and sustaining of community networks, to help bridge the digital divide, across the country.\nRecently, the centre organized meetings with friends of community networks, the CSOs and with larger stakeholders on identification and cultivating local champions to influence and support the community networks.\nJointly, CITAD and the Association for Progressive Communication (APC), a South Africa based group sharing same ideals with CITAD, drafted a Regulatory Framework for Community Networks in Nigeria (CNRF).\nToday, the international dimension of the digital divide remains a major point of the global struggle for justice.\nGlobally these community networks are helping many countries such as Kenya, South Africa, Brazil and Mexico to address the internal dimensions of their digital divide."
  },
  {
    "headline": "APC: Nwosu tasks Adamu on harmonisation of factions",
    "summarized_story": "Nwosu, who hailed the new national officers of the party,led by the former governor of Nasarawa State, Abdullahi Adamu,as national chairman, advised the new leadership against working with factions.\nHe said,the leadership should rather ensure that factions that broke out ahead of convention was genuinely reconciled.\nAccording to him, the next phase of the electoral process, which is the election of candidates through party primaries, is more delicate than electing the party leadership in a convention.\nI think they have a serious task but I trust Abdullahi Adamu, he will do justice to that”.\nOn the ability of the new APC leadership to meet the yearnings of party members, Nwosu expressed confidence that Adamu has what it takes to deliver."
  },
  {
    "headline": "ABCON advocates CBN’s support for BDCs to meet retail FX demand",
    "summarized_story": "The group disagreed with claims that naira has remained largely stable and converging following the stoppage of dollar allocation to the BDCs.\nAccording to ABCON NEC, BDCs remain the most potent tool for the CBN to achieve its foreign exchange rate management.\nWe, therefore, reject the statements claiming that the naira exchange rate has improved following stoppage of dollar sales to BDCs and urge our members to ignore those pronouncements,” it said.\n“We the EXCOS are not sleeping on our responsibility to ensure that our members’ businesses are sustained.\nWe, therefore, call on all our members to continue to ignore statements against the BDCs and continue to give us the necessary support in ensuring normalcy is restored to the market “ the statement said."
  },
  {
    "headline": "AfDB boss mourns former FUTA VC, Prof Daramola",
    "summarized_story": "Akinwumi Adesina… describes him as man of impeccable integrityBy Jimoh BabatundeThe President of the African Development Bank, AfDB, Dr. Akinwumi Adesina, has described the late Prof. Adebiyi Gregory Daramola as a man of impeccable integrity.\nIn an emotional tribute titled “Professor Biyi Daramola: A classmate, friend, and twin brother”, Adesina said “Dear Biyi.\nYou were our pride when you got elected as Vice Chancellor of the Federal University of Technology, Akure (FUTA).\nI lost a wonderful and cherished classmate, friend, and a very dear twin brother.\nSleep well, my very dear classmate, friend and twin brother, Say B."
  },
  {
    "headline": "Security of Moving Cargo by Water Transportation: NIWA MD, Moghalu, seeks Nigerian Navy Collaboration.",
    "summarized_story": "By: Kingsley Omonobi – AbujaThe Managing Director/Chief Executive Officer, National Inland Waterways Authority, Dr George Moghalu has sought the support of the Nigerian Navy to boost water transportation and movement of cargo to enhance trade.\n“But what is for us to do, we need to put the infrastructure in place, making sure that we have safe passage, making sure that the baggies are available, making sure that the goods and the baggies are all insured so that nobody will have anyone to blame at the end of the day.\nMoghalu said the nation will gain a lot from water transportation but lamented challenges inhibiting its development.\nHe said, “There’s quite a lot Nigerians stand to gain because by the time we start moving cargo by water.\nFor example, now there’s a collaboration between NIWA,, the Nigerian navy and the NEXIM bank on carrying out the survey from the River Benue down to Burutu River, through Onitsha."
  },
  {
    "headline": "ExxonMobil’s proposed exit, good opportunity for local business – Idemeko",
    "summarized_story": "One of the governorship hopefuls in Akwa Ibom State, Obong Ide Owodiong-Idemeko, has said that ExxonMobil’s proposed sale of its assets and eventual exit from the state is good opportunity for indigenous firms and local business to grow.\nIt could be recalled that ExxonMobil had in a press release said it has reached an agreement to sell its equity interest in Mobil Producing Nigeria Unlimited to Seplat Energy, a Nigerian independent oil and gas company, through its wholly-owned subsidiary Seplat Energy Offshore Limited.\nBut, the Akwa Ibom State Government unsettled by the pronouncement, had to enter a court case restraining Mobil from continuing with the proposed sale of its assets with the claims of a pending litigation between it and Mobil.\nHowever, the governorship aspirant, who is an ex-staff of ExxonMobil, while fielding questions from journalists in Uyo on Monday, expressed pleasure that there were competent indigenous companies and businessmen in the position to benefit from the divestment opportunities.\nHe said, ”There could be a number of reasons the IOCs are divesting, it could be because of the return on capital investment, the challenges around operations, security issues, more prospects elsewhere and others."
  },
  {
    "headline": "Eviction: MURIC sends message to FG, Ogun, accuses RCCG of conspiracy",
    "summarized_story": "The Muslim Rights Concern (MURIC) has told the Federal Ministry of Works and the Ogun State Government to respect the Certificate of Occupancy (‘C of O’) of the Islamic City which is located at the Pakuro-Lotto axis of Lagos-Ibadan Expressway.\nHe said: “The Federal Ministry of Works allegedly marked buildings located inside the Islamic City, a settlement of the Zumratul Jamiu Mumin Society of Nigeria (ZJM) located at the Pakuro-Lotto axis of Lagos-Ibadan Expressway.\nMURIC will ensure that Nigerian Muslims resist this with every legitimate means at their disposal.\n“The Redeemed Church leadership has also been fingered as having an interest in evicting the Islamic City from its environs.\nOfficials of the Islamic City confided in MURIC that RCCG clerics had approached them to sell off their priced property because the church was ‘not comfortable with an Islamic group nearby’."
  },
  {
    "headline": "UNILORIN’s SSANU, NASU begin two weeks warning strike",
    "summarized_story": "Workers of the University of Ilorin under the aegis of the Senior Staff Association of Universities, SSANU and Non-Academic Staff Union of Universities, NASU, on Monday joined the nationwide two weeks warning strike as directed by their national bodies.\nWith the strike action, the major labour unions in Nigeria’s universities are now on strike with the latest coming few weeks after the Academic Staff Union of Universities, ASUU, extended its nationwide strike by two months following the Federal government’s deadlocked negotiation with ASUU.\n“Your strict compliance and adherence to the directive is mandatory for all branches of NASU and SSANU in the Universities and inter university centres, the letter emphasized.\nIt further stated that having waited for so long, the Federal government has not responded nor reacted to their demands.\nOthers are neglect and poor funding of state universities, non-payment of retirement benefits to outgoing members and non constitution of visitation panels to universities."
  },
  {
    "headline": "Anambra workers defy Gov Soludo’s directive obey sit-at-home",
    "summarized_story": "Civil servants in Anambra State Monday defied State Government’s directive to come to work every Monday against the Independent People of Biafra’s (IPOB) sit-at-home order.\nNAN correspondent, who monitored the situation in Awka, reports that most government offices visited were under lock and key.\nHowever, only a few junior workers were seen loitering around the state secretariat complex on Monday, March 28.\nMost staff buses, which convey workers to and fro their offices were also seen parked in the secretariat.\nSome of the buses included Route 1 for Awka- Ogidi-Onitsha, Route 2 for Awkuzu-Otuocha and Route 4 for Awka-Agulu-Ekwulobia."
  },
  {
    "headline": "Nigeria Immigration CG Jere orders continuation of e-Passport issuance in UK",
    "summarized_story": "Nigeria Immigration Service (NIS) Comptroller General, Isah Jere has reacted to the Nigerian High Commission circular announcing the suspension of e-Passports issuance in the United Kingdom.\nIn a statement Monday night, NIS Public Relations Officer, Amos Okpu announced that CG Jere has ordered continuation of the document.\nAppealing to Nigerians in the UK for calm, Okpu informed the CG has “directed the Immigration Attaches at the Mission to continue with the issuance of the enhanced e-Passports”.\nA team led by the Assistant Comptroller General of Immigration overseeing the Passport Directorate will fly to London this week to address all challenges.\nJere assured members of the public of management’s commitment to deploy ICT solutions “to eliminate all unnecessary bottlenecks with a view to maintaining quality and transparent service”."
  },
  {
    "headline": "WC play off: FG closes offices for Nigeria-Ghana match",
    "summarized_story": "The Federal Government has directed the closure of all offices from 1pm on Tuesday to mobilise support for the Super Eagles against the Black Stars of Ghana in a must-win second leg of the play off for Qatar 2022 World Cup ticket.\nThe first leg of the play off in Kumasi stadium last Friday ended in a goalless draw with the Eagles needing a win to qualify for the biggest soccer tournament in the world.\nA statement signed by Dr Ngozi Onwudiwe, Permanent Secretary Welfare Office for the Head of the Civil Service of the Federation, Folasade Yemi-Esan said workers should move to the Moshood Abiola Stadium, Abuja for the match immediately after closure of offices.\nThe statement reads: “As you are aware the Super Eagle of Nigeria will be meeting the Black Stars of Ghana in continuation of the FIFA World Cup qualifier, play off return leg.\n” Consequently, all offices will be closed by 1.pm on Tuesday to enable Nigerians move to the National stadium for the match.”"
  },
  {
    "headline": "Many feared abducted, injured as terrorists attack Kaduna-Abuja train",
    "summarized_story": "Many persons were feared abducted after suspected terrorists attacked a Abuja-Kaduna train with 970 passengers on board.\nFormer Senator representing Kaduna Kaduna Central Shehu Sani tweeted he has been trying to reach a number of passengers on the train without success.\n“We have been trying to call the numbers of passengers in the Kaduna-Abuja train but it’s not conneA passenger, Anas Iro Danmusa, who tweeted from the train, confirmed the incident.\nAbuja to Kaduna train.\n”He later tweeted that soldiers have arrived the scene of the train to rescue some of the passengers."
  },
  {
    "headline": "Bandits kill 15 in fresh attack on Kaduna village",
    "summarized_story": "Bandits have reportedly killed 15 persons during an attack on Hayin Kanwa village, Yakawada ward in Giwa Local Government Area of Kaduna State.\nA resident in the community, Alhaji Mohammed Buwala, told journalists 15 bodies were buried on Monday morning.\nHe said: “Killings and kidnapping in Giwa are getting out of hand, as people are being killed and kidnapped daily.\n“The situation is terrible because 15 more people were killed at Hayin Kanwa just yesterday (Sunday) night by bandits.\nBandits attacked nine villages in the Local Government last Thursday and killed about 50 people as well as razed several houses."
  },
  {
    "headline": "I will obey PDP’s decision on zoning- Wike",
    "summarized_story": "Rivers Governor Nyesom Wike has declared his readiness to obey any decision reached by the Peoples Democratic Party (PDP) on zoning.\nWike, who recently declared his interest to contest the presidential ticket of his party, however disagreed with other aspirants, who claimed that there was no zoning in the party.\nQuoting a relevant section of the PDP’s Constitution on zoning, Wike insisted that it was selfish for anybody in PDP to deny the arrangement because of his ambition.\n“I will abide by the party’s decision on zoning even if they zone it to the North.\nWike further took exemption to the argument that no PDP candidate from the South would match another Southern candidate of the APC."
  },
  {
    "headline": "PDP must respect zoning if it wants victory – Anyim",
    "summarized_story": "PDP must respect zoning if it wants victory – AnyimA presidential aspirant on the platform of the People’s Democratic Party (PDP), Sen. Anyim Pius Anyim has said that the party must respect zoning if it wants victory in 2023.\nThe former Senate President said that power must shift to accommodate the views of all Nigerians.\nHe said that those saying that power must remain in a particular zone for PDP to win the election were wrong.\nPlateau PDP Chairman, Mr Chris Hassan, said that the former senate president has the capacity to effectively lead Nigeria to greatness.\n“I know the friends you made in Plateau when you were senate president."
  },
  {
    "headline": "Two killed as terrorists attack Abuja-Kaduna bound train",
    "summarized_story": "Two persons a cleaners and a workers of the attacked Abuja-Kaduna train have been confirmed dead , following the attack on the train late Monday night.\nThe two persons identified as Loretta and Abdul are confirmed to be the only casualty for now, in the fierce late night attack on the train that was bearing about 970 passengers.\nUnofficial sources said also that some security personnel and passengers have been killed by the rampaging terrorists but their names have yet to be released.\nIt was earlier reported that the terrorists had attacked the Nigerian Railway Corporation train from Abuja to Kaduna on Monday night had abducted some of the stranded passengers.\nAbuja to Kaduna train; gunshots still being fired around us."
  },
  {
    "headline": "2023: PDP plotting another EndSARS protest –FG",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has accused the Peoples Democratic Party (PDP) of plotting another round of EndSARS protest and peddling lies about the government of President Muhammadu Buhari.\nHow do you explain their threat of another EndSARS that pushed Nigerian to the brink?\nWe were there before and we remain the ones to beat in terms of a determined, viable and relentless opposition.\nThe minister dismissed the opposition party’s claim that the PDP government handed over $550 billion economy, with single digit inflation and a much reduced debt profile.\nThey wrecked the country’s infrastructure and we are rebuilding them?…When PDP left, 21 states could not pay the salary of their staff."
  },
  {
    "headline": "Umahi, Rabiu, Lawan, Sanwo-Olu, Bala Mohammed, Uzodimma, Zulum, Ngige, Amaechi, Toyin Saraki, Ekwunife, Dokpesi, Akande win The Sun Awards",
    "summarized_story": "Governor of Ebonyi State, Dave Umahi; chairman of BUA Group, Alhaji Abdulsamad Rabiu; Senate President, Ahmad Lawan and 23 others have been named as winners of The Sun Awards 2021.\nUnveiling the award winners yesterday, the Management of The Sun Publishing Limited said Governor Umahi and Alhaji Rabiu emerged as Man of the Year, while Lawan won the Political Icon of the Year award.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nOther winners are Governor Babajide Sanwo-Olu of Lagos State, Governor Hope Uzodimma of Imo State and Governor Bala Mohammed of Bauchi State, who emerged as winners of Governor of the Year award, with Governor Babagana Zulum of Borno State, as winner of Courage in Leadership award.\nIn the business categories, Chief Benson Madubuko, chairman/CEO, De Chico Group and Alhaji Auwalu Rano of AA Rano Oil won Entrepreneur of the Year award,"
  },
  {
    "headline": "2023: INEC explains delay in distribution of PVCs, confirms fixing BVAS challenges",
    "summarized_story": "INEC Chairman, Mahmood Yakubu, who made the disclosure, also confirmed that the commission has found a permanent solution to the malfunctioning Bimodal Voter Accreditation System (BVAS) ahead of the 2023 general election.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“I am glad to report that the commission has completed the ABIS for the first and second quarter of the CVR.\nThe commission is meeting next week and the detailed dates and locations for the collection of PVCs will be announced.\nThe commission has also introduced a number of new innovations that we need to perfect ahead of the general election."
  },
  {
    "headline": "SSANU, NASU strike grounds public varsities",
    "summarized_story": "By Gabriel Dike, Seye Ojo, Ibadan, Fred Ezeh, AbujaAdministrative activities and essential services in the state and federal universities were, yesterday, grounded following the strike by the two non-teaching staff unions.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nJoint Action Committee (JAC) of the Senior Staff Association of Nigerian Universities (SSANU) and the Non-Academic Staff Union (NASU) on March 25 directed its members nationwide to embark on strike.\nBranch Chairman of NASU University of Lagos, Kehinde Ajibade, told Daily Sun that the campus is deserted because members complied with the directive to down tools.\nChairman of SSANU University of Ibadan chapter, Abiodun Omisore, said the union recorded 90 per cent compliance on the first day of the nationwide strike declared by the national body."
  },
  {
    "headline": "Breaking: Terrorists Attack Kaduna-bound Train",
    "summarized_story": "Suspected terrorist on Monday night attacked a Kaduna-bound train, few kilometers to Kaduna metropolis.\nAn authoritative source who confirmed the incident to the News Agency of Nigeria (NAN) on condition of anonymity, said the train departed Abuja 6pm, and was expected to arrive Kaduna 8pm.\nThe source further revealed that train was attacked at about 7.45pm, but did not give details of the attack.\n(NAN)Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Many Injured as Terrorists Attack Abuja- Kaduna Train",
    "summarized_story": "*Kaduna govt says efforts under way to convey injured passengers to hospital, as troops comb sorroundingsBy John Shiklam in KadunaTerrorist again struck on Monday in Kaduna, launching an attack on a Kaduna-bound train.\nSources said the attack occurred between Katari and Rijana communities in Kaduna state, believed to be the den of terrorists.\nThe Kaduna state Commissioner for Internal Security and Home Affairs, Samuel Aruwan, confirmed the incident in a statement late Monday night.\nThe statement reads:“Security agencies have reported to the Kaduna State Government that the military has secured the Kaduna bound train from Abuja trapped by terrorists.\n“The Kaduna State Government received multiple reports of an attack on the Abuja-Kaduna train service at around Kateri-Rijana general areas."
  },
  {
    "headline": "Breaking: NRC Confirms Terrorists’ Attack on Kaduna-bound Train",
    "summarized_story": "Kasim SumainaThe Nigerian Railway Corporation (NRC), Monday night confirmed terrorists attack on Kaduna bound train and successfully immobilised it.\nThe NRC boss said some passengers could not leave the train ,which means nobody knows what might happen to them.\nOne of the passengers who also confirmed the incident in a telephone call said the attackers had surrounded the train, shooting sporadically.\nSatellite map showing the location of the train as sent by one of the passengersThe Google map showing the location of the train as sent by one of the passengersThere are at least 970 passengers onboard the train, according to official sources familiar with the train service.\nThere had been several attempts by terrorists on the Abuja-Kaduna train service."
  },
  {
    "headline": "Buhari: Our Unity at Convention Signposts Victory in 2023 Polls",
    "summarized_story": "Buhari congratulated the newly elected APC national chairman, Senator Abdullahi Adamu, and the 79-member National Executive Committee (NEC) elected at the convention.\nBuhari stated in the release, “The APC convention hosted this weekend sets the scene for an APC victory in the presidential and general elections next year.\nThe APC national chairman said, “We are, however, satisfied that APC has fulfilled its covenant with the Nigerian people.\nNwosu (Abia State), National Welfare Secretary; and Nze Chidi Duru (Anambra State), Deputy National Organising Secretary.\nHe should, therefore, not have any illusion that being an APC chairman will avail him a perpetual cover."
  },
  {
    "headline": "Nigerian Governors in Dubai for Investment Drive",
    "summarized_story": "Chuks Okocha in AbujaFourteen Nigerian governors have arrived Dubai, United Arab Emirate (UAE) for an Annual Investment Meeting, starting tomorrow, March 29.\nA statement by Abdulrazaque Bello-Barkindo, the Head of Media and Information at the Nigeria Governors’ Forum (NGF), stated that, “Beginning from Tuesday, AIM global leaders debate.\nAbia State governor, Okezie Ikpeazu will have a business to government meeting with SALIC at the investment hub in Dubai.\n“Bayelsa State governor, Duoye Diri, who has already been in Dubai since Saturday, will be meeting with El Sewedy Electric.\nIn another business to government meeting also facilitated by Dubai foreign ministry, Diri will be meeting AMEA power and he will also be at the humanitarian summit among other meetings."
  },
  {
    "headline": "BREAKING: Terrorists Kill Three Persons In Ongoing Attack On Niger State Community, Residents Flee Homes",
    "summarized_story": "At least three persons have been killed in an ongoing attack on Kabo Village in the Gurara Local Government Area of Niger State by armed Fulani herdsmen.\nThe suspected terrorists, SaharaReporters reliably gathered, arrived in the community in large numbers on Monday afternoon, shooting sporadically in different directions.\nMost residents of the village were said to have been hit by bullets while fleeing into nearby bushes for safety.\nOn March 17, 2022, armed men killed a police officer during an attack on Bangi Divisional Headquarters in the Mariga Local Government Area of the state.\nA day before that incident, bandits killed four police officers including a divisional police officer, Muhammad Umar, and four vigilantes in the Magama council area of the state."
  },
  {
    "headline": "BREAKING: Terrorists Kill Three Persons In Ongoing Attack On Niger State Community, Residents Flee Homes",
    "summarized_story": "At least three persons have been killed in an ongoing attack on Kabo Village in the Gurara Local Government Area of Niger State by armed Fulani herdsmen.\nThe suspected terrorists, SaharaReporters reliably gathered, arrived in the community in large numbers on Monday afternoon, shooting sporadically in different directions.\nMost residents of the village were said to have been hit by bullets while fleeing into nearby bushes for safety.\nOn March 17, 2022, armed men killed a police officer during an attack on Bangi Divisional Headquarters in the Mariga Local Government Area of the state.\nA day before that incident, bandits killed four police officers including a divisional police officer, Muhammad Umar, and four vigilantes in the Magama council area of the state."
  },
  {
    "headline": "Breaking: Four Students Killed As Secondary School Building Collapses In Cross River",
    "summarized_story": "A building housing several classrooms at Diamond Grammar College, Ikang under Bakassi Local Government Area of Cross River State, has collapsed, killing four students in the process.\nThe tragedy, according to findings by SaharaReporters, occurred on Friday afternoon as students were taking an examination in the school.\n“I saw dead bodies of students being moved out of the school immediately after the building collapsed.\n“The heavy rain compounded the whole problem as it made the evacuation of students trapped in the collapsed building quite difficult for rescuers,” an eyewitness living close to the school told SaharaReporters.\n“It is individual and community efforts that have been helping affected families manage the situation since Friday when the building collapsed."
  },
  {
    "headline": "Breaking: Four Students Killed As Secondary School Building Collapses In Cross River",
    "summarized_story": "A building housing several classrooms at Diamond Grammar College, Ikang under Bakassi Local Government Area of Cross River State, has collapsed, killing four students in the process.\nThe tragedy, according to findings by SaharaReporters, occurred on Friday afternoon as students were taking an examination in the school.\n“I saw dead bodies of students being moved out of the school immediately after the building collapsed.\n“The heavy rain compounded the whole problem as it made the evacuation of students trapped in the collapsed building quite difficult for rescuers,” an eyewitness living close to the school told SaharaReporters.\n“It is individual and community efforts that have been helping affected families manage the situation since Friday when the building collapsed."
  },
  {
    "headline": "UPDATE: Two Bodies Deposited At Kaduna Hospital, Many Injured After Terrorists Bombed, Derailed Abuja-Kaduna Train",
    "summarized_story": "Two cleaners and workers of the attacked Abuja-Kaduna train identified as Loretta and Abdul have been confirmed dead, SaharaReporters learnt.\nSaharaReporters learnt that some security personnel and passengers have also been confirmed dead but their names have yet to be released.\n\"Meanwhile, two dead bodies have been deposited at St. Gerald’s Catholic Hospital in Kaduna while some persons are being treated for gunshot injuries,\" a source told SaharaReporters.\n“Some people have died, and the bandits kidnapped several persons,” a woman on the train confirmed to SaharaReporters.\nAbuja to Kaduna train; gunshots still being fired around us."
  },
  {
    "headline": "FG: Hike in prices of foodstuffs, diesel not a Nigerian problem -- it's global trend",
    "summarized_story": "Lai Mohammed, minister of information, says the current increase in the prices of food items and diesel is not only experienced in Nigeria.\nThere have also been concerns across the country over the hike in the price of diesel, which has reportedly led to the shutdown of businesses.\nAdvertisementSpeaking on the development on Monday, Mohammed said the price increase is a global trend, adding that the federal government is taking steps to address the situation.\nGoogle the price of foodstuffs in other countries, especially the UK and the US, and you will discover a steep rise.\nAdvertisement“What we are saying is that this increase is a global trend, and it’s not limited to any country."
  },
  {
    "headline": "FG: Hike in prices of foodstuffs, diesel not a Nigerian problem -- it's global trend",
    "summarized_story": "Lai Mohammed, minister of information, says the current increase in the prices of food items and diesel is not only experienced in Nigeria.\nThere have also been concerns across the country over the hike in the price of diesel, which has reportedly led to the shutdown of businesses.\nAdvertisementSpeaking on the development on Monday, Mohammed said the price increase is a global trend, adding that the federal government is taking steps to address the situation.\nGoogle the price of foodstuffs in other countries, especially the UK and the US, and you will discover a steep rise.\nAdvertisement“What we are saying is that this increase is a global trend, and it’s not limited to any country."
  },
  {
    "headline": "Wike: I will withdraw from presidential race if PDP zones ticket to north",
    "summarized_story": "Nyesom Wike, governor of Rivers, says he will withdraw from contesting the presidency if the Peoples Democratic Party (PDP) zones its ticket to the north.\nTo address the zoning concern, the PDP recently inaugurated a 37-member committee to make a recommendation on its presidential ticket.\nOn Sunday, Wike declared his intention to contest the presidency in the 2023 general election.\nAdvertisementSpeaking on the development, Wike said he believes in the party and will obey whatever decision is taken by the PDP on the presidential ticket.\n“Just as I am today, if the party says they are zoning it to the north, I have no problem.”AdvertisementAsked if he will still run for the position if the PDP’s presidential ticket goes to the north, Wike said: “I will not run."
  },
  {
    "headline": "Wike: I will withdraw from presidential race if PDP zones ticket to north",
    "summarized_story": "Nyesom Wike, governor of Rivers, says he will withdraw from contesting the presidency if the Peoples Democratic Party (PDP) zones its ticket to the north.\nTo address the zoning concern, the PDP recently inaugurated a 37-member committee to make a recommendation on its presidential ticket.\nOn Sunday, Wike declared his intention to contest the presidency in the 2023 general election.\nAdvertisementSpeaking on the development, Wike said he believes in the party and will obey whatever decision is taken by the PDP on the presidential ticket.\n“Just as I am today, if the party says they are zoning it to the north, I have no problem.”AdvertisementAsked if he will still run for the position if the PDP’s presidential ticket goes to the north, Wike said: “I will not run."
  },
  {
    "headline": "Travellers 'injured, missing' as gunmen attack Abuja-Kaduna train",
    "summarized_story": "A train on its way from Abuja to Kaduna was, on Monday, attacked by gunmen in Kateri-Rijana area of Kaduna state.\nThe train was said to have been a few minutes away from the Kaduna station when the incident occurred.\nAccording to him, several passengers sustained injuries, while security operatives are currently conducting “rescue efforts”.\nAdvertisement“Security agencies have reported to the Kaduna State Government that the military has secured the Kaduna bound train from Abuja trapped by terrorists,” the statement reads.\n“The Kaduna State Government received multiple reports of an attack on the Abuja-Kaduna train service at around Kateri-Rijana general areas."
  },
  {
    "headline": "Digital Nomads: The pastor turned tech bro",
    "summarized_story": "The reason, Jay says, was that the lecturers in charge, at the time, knew nothing about the applications of tech.\nThis was 2018, mind you, but they said that tech wasn’t that important in the country, and that I should research something else.\nFor Jay, this event pushed him towards putting his degree to good use and becoming an all-round tech bro.\nHe doesn’t think his lecturers meant any harm, but he believes their lack of knowledge on the impact of tech will have damning consequences on the students they teach.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Okubanjo to step back from people decisions at Bento Africa",
    "summarized_story": "Bento’s board’s decision comes a few days after TechCabal exposed the harrowing experiences of ex-employees of payroll startup Bento Africa and how Okubanjo had allegedly been the orchestrator of that through direct and indirect bullying, verbal abuse, and threats to employees.\nOur responsibility and charter is to the Company, not the founders we invest in,” the board said in an email sent to all Bento employees, past and present.\nFurthermore, the board said that while Okubanjo is taking a back seat with immediate effect, an internal investigation into Bento’s workplace culture has begun.\nThe board claimed to have “…ensured that the current team is safe and free to speak freely.\nWith Love, Okubanjo admits to encouraging a work culture of “long workdays and weeks” and apologised for his abusive outbursts."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "How to hitchhike safely",
    "summarized_story": "The law aims to allow smaller messaging platforms to access the “gatekeepers” of the messaging world.\nBorne out of unpleasant experiences with ride-hailing companies, he got three other friends to join in his desire to build a ride-sharing platform that connects drivers and riders going in the same direction.\nOn Friday, March 25, 2022, Hytch — Onifade’s ride-sharing platform — was publicly launched and currently operates in Lagos State.\nAn age-long problem: Before now, the federal government has made some inroads into challenges surrounding RoW charges.\nRoW charges affect the overall amount telcos spend in laying optic fibre and eventually affect the cost of calls and Internet data."
  },
  {
    "headline": "Ride-sharing newcomer, Hytch is providing a new way to travel, hitchhiking style",
    "summarized_story": "Well, Laolu Onifade thinks he might have found a sweet spot with his newly launched ride-sharing startup, Hytch.\nLaolu Onifade, Hytch FounderAccording to Onifade, Hytch connects car owners and passengers going in the same direction.\nI noticed that Uber and Bolt were getting so expensive and I used to wonder, how about I just hitch a ride?\nso guys, i got robbed on wednesday night at ikoyi by my bolt driver, he took my phone, my cards, my ID, all my money and savings, lemme tell you how it happened.\nAnother Twitter user, @ade_IDD, narrated how she was almost kidnapped by a Bolt driver whose appearance was different from the picture on the platform."
  },
  {
    "headline": "Quidax unveils Don Jazzy as its brand ambassador",
    "summarized_story": "Quidax has also found a way to engage users to learn crypto on its platform and recently launched Quidax academy to train crypto beginners.\nQuidax and Don JazzyBuchi said that they started the #TheQuidaxCall recently, aiming to help put crypto in front of more people.\nBuchi introduced Michael Collins Ajereh, professionally known as Don Jazzy as a new member and brand ambassador of the Quidax family.\nDon Jazzy also expressed his opinions on Non-fungible tokens (NFTs) and their many use cases.\nLearning crypto should be something you can relate to, and Don Jazzy exemplifies and shows what it means to be a Quidaxian."
  },
  {
    "headline": "How Nigeria’s oil sector walked to a cliff’s edge",
    "summarized_story": "“Before, we were dealing with pocket oil thieves who were only stealing buckets of crude oil; now it’s an organised crime syndicate,” said Bolaji Ogundare, a senior executive in an indigenous oil company.\nOil theft seems to have worsened, with sources saying it is now an industrial-scale enterprise involving well-connected government officials, security personnel, and local communities.\n“How can we be losing over 95 percent of oil production to thieves?\nNigeria’s crude oil pipeline network has collapsed completely as IOCs with a foot in the door have abandoned the maintenance of the pipeline network.\nBeyond oil theft, operators say court judgments awarding billions of dollars to communities further place a strain on oil companies when these leaks are now often caused by sabotage."
  },
  {
    "headline": "How Nigeria’s oil sector walked to a cliff’s edge",
    "summarized_story": "“Before, we were dealing with pocket oil thieves who were only stealing buckets of crude oil; now it’s an organised crime syndicate,” said Bolaji Ogundare, a senior executive in an indigenous oil company.\nOil theft seems to have worsened, with sources saying it is now an industrial-scale enterprise involving well-connected government officials, security personnel, and local communities.\n“How can we be losing over 95 percent of oil production to thieves?\nNigeria’s crude oil pipeline network has collapsed completely as IOCs with a foot in the door have abandoned the maintenance of the pipeline network.\nBeyond oil theft, operators say court judgments awarding billions of dollars to communities further place a strain on oil companies when these leaks are now often caused by sabotage."
  },
  {
    "headline": "IOCs’ exit cedes space to locals, will test FG’s policies",
    "summarized_story": "The reality of International Oil Companies’ (IOCs) departure from the largest oil patch in Africa is ceding the space to independent companies – a development that will test Nigeria’s ability to craft policies that will make its oil industry attractive for investments.\nItsueli, however, said the independents do not have the clout of the IOCs.\n“So, we need to craft the policies so that it can encourage these ones who do not have the same clout as the IOCs.\nA relapse to the old ways by the Nigerian government will trigger an exit faster than a 100 meters dash.\nOthers are Sogenal Energy Limited, operator of Akepo Marginal Field; Sahara Energy Limited and African Oil & Gas Limited, operators of Tsekelewu Marginal Field; Bicta Energy and Management Systems Ltd, operator of Ogedeh Marginal Field; and Goland Petroleum Limited, operator of Oriri Marginal Field."
  },
  {
    "headline": "Emeka Ogbu elected,Sworn In As NUGA President – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Says, it is countinuity in Progress for NUGABENIN CITY – Mr Emeka Ogbu of Enugu State University of Science and technology(ESUT) has been elected and sworn in as president,Nigeria University Games Association.\nMr Ogbu was returned unopposed to become the new NUGA President after his only opponentDr Nnadozie Cliford of Michael Okpara University of Agriculture , Umudike, Abia State,voluntarily stepped down from the race few hours before the election proper.\nOgbu was elected on Friday 25th of March,2022 to steer the Nigeria University Games Association wheel of progress for a period of two years.\nUntil now, Mr Emeka Ogbu served as 1st vice President under the outgone President, Prof. Stephen S. Hamafyelto.\nIn his words, ” we will collaborate and bring the best of brains to raise the bar in terms of preparation and sourcing for partnerships to improve the quality of our sporting competitions.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Doha 2022: Obaseki woos investors, showcases opportunities for investment in oil palm, tech, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, at the just concluded 2022 Doha Forum in Qatar, showcased business and investment opportunities in Edo State, rallying investors to take advantage of the business-friendly environment as well as incentives provided by his administration in the state to invest in new frontiers.\nObaseki, who joined other world leaders and policymakers at the 20th edition of the forum, showcased investment opportunities in different sectors of the state’s economy including agriculture, healthcare, technology and education, among others.\nThe governor further stated: “For us in Edo State, we didn’t suffer much from the infections or mortality rate of the COVID-19 because of the very young population we have in Nigeria and Edo State.\n“In terms of our healthcare response, we realized the opportunities for investment in the healthcare space and the participation of the private sector in healthcare delivery.\nBefore now, the bulk of healthcare investment was left to the government, even though the private sector is a key provider of healthcare services.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo govt warns against indiscriminate waste disposal, violating environmental laws – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has warned against indiscriminate waste disposal and unhealthy practices that violate the state’s extant environmental laws.\nAddressing journalists after inspecting Oregbeni market, Ikpoba Okha Local Government Area of the state, Commissioner for Environment and Sustainability, Hon.\nJonathan Lawani, urged stakeholders to collaborate with the state government to keep the state clean so as to prevent disease outbreaks.\nHe noted, “Disease-carrying organisms tend to spread when we don’t keep our environment clean, and as residents of the state, we need to ensure that our homes and markets are clean.\nShe appealed to the state government to replace the present waste manager for better waste management."
  },
  {
    "headline": "Ex-Edo governorship candidate commends mothers’ contributions to nation building – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The governorship candidate of the African Democratic Congress (ADC) in the 2019 Edo State governorship election, Mabel Oboh, yesterday, commended Nigerian mothers for their significant roles in nation’s building.\nShe gave the commendation in a statement signed and made available to newsmen in Benin City.\nOboh urges women not to relent but rise to the occasion irrespective of the onerous tasks confronting them at home, work and other places.\n“Today, I wish to commend all mothers in across the world for the roles they are playing for the growth and development of every society.\n“As we grapple with social vices in our society, we mothers believe it can be reduced if we all come together and speak against it rather than encourage it."
  },
  {
    "headline": "Access Bank names Roosevelt Ogbonna new MD, Wigwe remains as Holdco CEO",
    "summarized_story": "The parent company now holds 100 per cent shares of Access Bank Nigeria and 100 per cent shares of all non-banking subsidiaries of the bank.\nHe left Guaranty Trust Bank as an Executive Director to co-lead the transformation of Access Bank Plc in March 2002 as Deputy Managing Director.\nRoosevelt Ogbonna, the new managing director of Access Bank Nigeria, until his appointment, was the deputy managing director of Access Bank Plc.\nHe joined Access Bank in 2002 as a Manager from Guaranty Trust Bank Plc.\nMr. Ogbonna represents the Bank on the boards of Access Bank (Zambia) Ltd, Central Securities Clearing System Plc, Africa Finance Corporation and The Access Bank (UK) Limited"
  },
  {
    "headline": "Business Hallmark Newsletter, plus e-edition",
    "summarized_story": "Here are reports in today’s edition of Business Hallmark NewsletterAlso, download the e-edition of the newspaper here.\nFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Senator T.A. Orji mourns Prince Emeka Obasi",
    "summarized_story": "Orji, Senator representing Abia Central Senatorial Zone, has condoled with the family of Late Prince Emeka Obasi, the award winning journalist and publisher of Business Hallmark Newspaper, who passed on in a Lagos hospital on 16th March, after an illness.\nWhile Signing the condolence register at the palatial home of Prince Obasi in Ahiaeke lbeku, the Senator Orji stressed that the late veteran journalist was a good man, successful and had a good heart.\nHe recalled the good working relationship they had while the late journalist was commissioner for information in Abia state while he was chief of staff.\nOrji was received by Hon Okezie Obasi, the younger brother of Prince Emeka Obasi, who is a house of Assembly hopeful for Umuahia East State Constituency.\nAlso on ground to receive Senator Orji, were the traditional ruler of Azueke Ibeku acient kingdom, HRM, Eze Emmanuel Okechukwu Onwubuariri; Deacon Okezie Onyemuwa; Hon Henry Egesi; Chief Ikechukwu Onuoha; Hon Tony Onyeweaku; Hon Chidiebere Nwachuku; Austin Poku Onyeweaku; Prince Tony Onyems and many others."
  },
  {
    "headline": "Experts warn against more debt amidst dwindling revenue",
    "summarized_story": "The experts are kicking against the federal governments proclivity for debt, which they have described as unsustainable, calling for increased productivity with a view to boosting revenue.\nAlthough Nigeria’s current debt to Gross Domestic Product (GDP) 22.47 per cent is relatively low, giving it room to borrow, its inability to generate adequate revenue has worsened its debt problem.\nHe said, “Nigeria is on the brink of debt distress because our debt profile now is not sustainable.\nWe had a debt service to revenue ratio getting to 76 per cent as of November last year.\nHe said, “We are already in debt distress if we are spending a large proportion of our revenue on debt servicing, we are in trouble and our revenue is not growing."
  },
  {
    "headline": "Miyetti Allah To Curb Security Challenges Faced By Pastoralists",
    "summarized_story": "Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) has evolved strategies to check security challenges confronting pastoralists.\nThe communique was signed by the national president of MACBAN, Alhaji Hussein Bosso and the national secretary, Baba Ngelzarma.\nIt said the meeting deliberated on security challenges facing pastoralists across the country and issues related to the upcoming MACBAN national elections.\nADVERTISEMENTThe communique added that the association appealed to the sultan to organise a national conference involving pastoralists’ leaders, the intelligentsia and other critical stakeholders.\nADVERTISEMENTIt added that the meeting agreed to follow the timeline, rules and regulations for the conduct of the forthcoming MACBAN national elections."
  },
  {
    "headline": "Pope Francis Condemns ‘Barbarous’ War In Ukraine",
    "summarized_story": "The head of the Catholic Church has condemned the “cruel and senseless” war in Ukraine, where “barbarous” acts were “destroying the future”.\n“More than a month has gone by since the beginning of the invasion of Ukraine, of the beginning of this cruel and senseless war,” Pope Francis said at the end of the Angelus prayer.\n“War does not devastate the present only, but the future of a society as well,” he later said in a Tweet, pointing to the fact that one in two Ukrainian children have been displaced.\n“The scale of the forced relocation is comparable only to Hitler’s deportation [during] World War II,” Denisova said on Telegram.\nThe commissioner added that Russia’s minister of defence had also reported relocating 90,000 people from the region of Kherson."
  },
  {
    "headline": "Buhari Absolves Adamu, Says Ex-PDP Members In APC Have Repented",
    "summarized_story": "He stated: “The APC Convention hosted this weekend sets the scene for an APC victory in the presidential and general elections next year.\n“The PDP challenges members of the illegitimate APC national leadership, particularly Sen. Adamu to come clean on corruption charges against them.\n“The new APC Chairman should inform Nigerians why he was not courageous enough to submit himself to trial at the Federal High Court, Lafia, Nasarawa State rather than hide under technicalities.\nHe should therefore not have any illusion that being an APC Chairman will avail him a perpetual cover.\nAdamu Suitable For APC – LawanMeanwhile, Senate President Ahmed Lawan, has said Senator Abdullahi Adamu is the suitable person to lead the APC."
  },
  {
    "headline": "Buhari Absolves Adamu, Says Ex-PDP Members In APC Have Repented",
    "summarized_story": "He stated: “The APC Convention hosted this weekend sets the scene for an APC victory in the presidential and general elections next year.\n“The PDP challenges members of the illegitimate APC national leadership, particularly Sen. Adamu to come clean on corruption charges against them.\n“The new APC Chairman should inform Nigerians why he was not courageous enough to submit himself to trial at the Federal High Court, Lafia, Nasarawa State rather than hide under technicalities.\nHe should therefore not have any illusion that being an APC Chairman will avail him a perpetual cover.\nAdamu Suitable For APC – LawanMeanwhile, Senate President Ahmed Lawan, has said Senator Abdullahi Adamu is the suitable person to lead the APC."
  },
  {
    "headline": "2023: South East PDP Backs Southern Governors On Zoning",
    "summarized_story": "The Peoples Democratic Party (PDP) in the South East geo-political zone yesterday threw its weight behind the position of the Southern Governors’ Forum for the next Nigerian president to emerge from the southern part of the country.\nThe South East PDP also stated that the existing zoning patterns in states and constituencies should be adhered to in every state and constituency of the zone.\nLast week, PDP leaders in the South South and South West geopolitical zones had similarly demanded that the party’s presidential ticket be zoned to the South.\nADVERTISEMENTBriefing newsmen after the Enugu meeting yesterday, PDP national vice chairman (South East), Chief Ali Odefa disclosed that the decision at the meeting was unanimous.\nOdefa added that the South East PDP stands with the resolution of the Southern Governors’ Forum that the office of the Presidency should be zoned to the Southern part of Nigeria."
  },
  {
    "headline": "Angry Obasanjo shouts down Osinbajo's supporters in Abeokuta",
    "summarized_story": "By Adejoke AdeleyeFormer President, Chief Olusegun Obasanjo on Monday shouted down supporters of Vice President Yemi Osinbajo who came to drum support for his presidential ambition in Abeokuta, Ogun State.\nA large number of supporters of Osinbajo had stormed the Olusegun Obasanjo Presidential Library, Abeokuta, the venue of the Coalition for Democracy on Africa (CoDA) summit attended by the vice president.\nAs the meeting was ongoing, supporters of Osinbajo stormed the venue, chanting, ‘PYO for President.”This did not go well with Obasanjo, who came out to scold the supporters and told them to keep quiet.\nObasanjo came out as if he wanted to address the supporters, but ordered them to bring down their campaign placards as his library was not a campaign ground."
  },
  {
    "headline": "How Tinubu Helped Lagos Assembly Achieve Financial Autonomy",
    "summarized_story": "They also praised him for helping the parliament of the State achieve financial autonomy years before the mass clamour for it by other Houses of Assembly.\nMudashiru Obasa, described Asiwaju Tinubu is a benefactor, adding that the presidential aspirant had done well as a leader.\nGbolahan Yishawu, who represents Eti-Osa 2, described Tinubu as a man with a large heart and one who easily forgives.\nHe described Tinubu as a political colossus, political mathematician and doyen of modern day Nigeria.\nSanai Agunbiade, described Asiwaju Tinubu as a detribalised Nigerian, a leader of the people, and politician with a difference."
  },
  {
    "headline": "Kaduna govt, NRC speak on Abuja-Kaduna train attack",
    "summarized_story": "By Mohammed Tijjani/ Lucy OgalueKaduna State Government and the Nigeria Railway Corporation (NRC), have confirmed attack on the Abuja-Kaduna train by suspected terrorists on Monday night.\nThe incident happened between Katari and Rijana train stations, en route Kaduna from Abuja.\nKaduna State Government, in a statement by the Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan, said the military had rescued the Kaduna-bound train passengers trapped by terrorists Monday night.\nAruwan said the government received multiple reports of an attack on the Abuja-Kaduna train service around Kateri-Rijana area.\n“There are reports of gunshots and the train derailed due to the attack,” News Agency of Nigeria quoted Okhiria as saying."
  },
  {
    "headline": "BREAKING: Terrorists Bomb Abuja-Kaduna Train With Many Passengers Onboard",
    "summarized_story": "On Monday, some bandits allegedly bombed the Abuja-Kaduna train link.\nAn Abuja-Kaduna-bound train carrying people derailed when a terrorist-planted improvised explosive device detonated beneath one of the coaches.\nSome of the 970 passengers on board may have been kidnapped by the bandits, according to reports.\nThis comes just days after terrorists assaulted the Kaduna International Airport, preventing a plane from taking departure.\n“They (terrorists) put IED,” a source told our correspondent."
  },
  {
    "headline": "BREAKING: 7 Trapped As Two 20ft Containers Fall On 3 Cars In Lagos + VIDEO",
    "summarized_story": "BREAKING: 7 Trapped As Two 20ft Containers Fall On 3 Cars In Lagos + VIDEOOccupants of the ill-fated private cars struggle with lives as containers empty chemical contentTwo chemical-laden 20 feet containers, on Monsay night, fallen on three private cars in Lagos, emptying, also, their contents on seven trapped occupants of the cars.\nNEWS DIRECT reports that the accident, which occured at O Mark School Bus stop inward Iyana-Iba Igando LASU road, has worsened traffic gridlock on the road.\nOccupants of the ill-fated private cars were, as at he time of this report on Monsay night, struggling with lives as containers empty chemical content on them.\nSympathisers were seen wailing at the scene while others have begun self-motivated rescue operations."
  },
  {
    "headline": "Cocaine Deal: Court Declines Abba Kyari’s Bail Request, Orders Quick Trial",
    "summarized_story": "The defendants were charged with conspiracy, obstruction, and dealing of cocaine worth 17.55 kilograms in the FHC/ABJ/57/2022 accusation.\nKyari and four other accused pled not guilty at their arraignment.\nHe claimed that the case contains all of the reasons why the accused should not be given bail.\nThe trial judge, Emeka Nwite, agreed with the prosecution that the defendants are likely to interfere with and derail the proceedings.\nAs a result, he denied the bail motion and ordered a speedy trial."
  },
  {
    "headline": "JUST IN: Gunmen attack Imo police station, injure two officers",
    "summarized_story": "Gunmen, on Monday morning, attacked the Otoko Divisional Police Headquarters situated in the Obowo Local Government Area of Imo State, leaving two officers injured.\nVillagers told Punch Newspapers that the attack, which started around 3am, lasted a long time as residents feared for the unknown.\nYou know the Police Divisional Headquarters is situated on the Owerri-Umuahia express road.\n“Police officers engaged the gunmen and the situation became more terrible.\nTwo policemen were terribly injured and had been rushed to an undisclosed hospital.”Another source said that the gunmen were repelled and they could not gain access into the premises of the police station."
  },
  {
    "headline": "Breaking: NRC confirms terrorists’ attack on train along Abuja-Kaduna route",
    "summarized_story": "The Managing Director of the Nigerian Railway Cooperation (NRC) Fidet Okhiria on Monday night confirmed reported detonation bombs on the railtrack of Abuja-Kaduna train.\nOkhiria while confirming the incident via a telephone call said he was yet to get more information concerning the incident.\nAccording to sources, the attack occurred at a point between Katari and Rijana.\nOne of the passengers who confirmed the incident in a telephone call said the attackers have surrounded the train, shooting sporadically.\n“All the passengers are currently lying on the floor of the train."
  },
  {
    "headline": "Breaking: Anxiety as terrorists blast rail track, surround train along Abuja-Kaduna route, over 950 passengers trapped",
    "summarized_story": "There are indications that up to 970 passengers are currently trapped inside a Kaduna-bound train in a bush in Kaduna state, where terrorists reportedly bombed a rail track.\nThough information regarding the latest development was still sketchy as at the time of filling this story, Blueprint gathered the rampaging terrorists in the guise of bandits have surrounded the train that has been on a standstill.\n“My relation who is on board the train is supposed to have arrived, but till 9.30pm, nothing has been heard from him.\n“Villagers along Abuja-Kaduna road called to confirm hearing multiple gunshots and attack on the Abuja-Kaduna train by terrorists,” popular activist Shehu Sani tweeted Monday night.\nThe train reportedly departed Abuja by 6.10pm, but is yet to arrive Kaduna as at 9.45pm when this story was published on Monday."
  },
  {
    "headline": "[Breaking] ‘Drug trafficking’: Court sends Abba Kyari, 6 others to Kuje prison",
    "summarized_story": "The Federal High Court on Monday sent Suspended Deputy Commissioner of Police (DCP) Abba Kyari, and six others that are facing drug trafficking charges with him, to the Kuje Correctional Center.\nJustice Emeka Nwite, in a ruling, held that the the National Drug Law Enforcement Agency (NDLEA) had placed sufficient evidence before the court to refuse the bail request.Justice Nwite also rejected bail plea of Kyari’s co-defendants.\nThe anti-narcotic agency described Kyari as “a flight risk.”It argued that if granted bail, the suspended DCP might jump bail.\nThe agency, who said the applicant might interfere with the evidence if granted bail, urged the court to dismiss Kyari’s bail plea.\nIt argued that the medical challenges of the applicant was not beyond the capacity of the agency’s medical personnel."
  },
  {
    "headline": "Several Feared Injured As Bandits Attack Abuja-Kaduna Train",
    "summarized_story": "A train conveying passengers from Abuja to Kaduna has been attacked by gunmen suspected to be bandits in Kaduna State.\nMany passengers are feared injured while several others were said to have been kidnapped by the assailants.\nAlthough the police authorities are yet to confirm the attack, Channels Television gathered that the incident happened on Monday night.\nThe bandits reportedly attacked the train around Dutse axis in Kaduna, just a few kilometres to the Rigasa Train Station in Igabi Local Government Area of the state.\nOne of the passengers on the train told Channels Television that the bandits bombed the train track with an Improvised Explosive Device (IED) which forced the train to derail."
  },
  {
    "headline": "Troops Secure Abuja-Kaduna Train Attacked By Terrorists – Kaduna Govt",
    "summarized_story": "The Kaduna State Government has confirmed that the military has secured the Kaduna-bound train from Abuja attacked by terrorists.\n“The Kaduna State Government received multiple reports of an attack on the Abuja-Kaduna train service at around Kateri-Rijana general areas,” a statement signed by the State’s Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said.\n“The Government of Kaduna State will be liaising with the Nigerian Railway Corporation (NRC) to ascertain the list from the passengers’ manifest for efficient tracking.\nOne of the passengers on the train told Channels Television that the bandits bombed the train track with an Improvised Explosive Device (IED) which forced the train to derail.\nHe added that the terrorists later forced their way into the train and kidnapped an unspecified number of people, with some others feared killed."
  },
  {
    "headline": "Why I Want To Be Nigeria’s President In 2023 – Wike",
    "summarized_story": "Rivers State Governor Nyesom Wike on Monday said he wants to become President in 2023 in order to help solve the country’s problems.\nREAD ALSO: Osinbajo Meets Obasanjo In Abeokuta, Advocates For Democracy“As Governor of Rivers State, I solve problems.\nSo I’m going to offer myself, so I can contribute.”Mr Wike said he has the ability to solve Nigeria’s insecurity problems, referencing his war against oil bunkering in Rivers State.\nMr Wike on Sunday became the latest PDP strongman to declare his intention to become President.\nOther aspirants in the party include former Vice President Atiku Abubakar, former Senate President Bukola Saraki and Sokoto State Governor, Aminu Tambuwal, among others."
  },
  {
    "headline": "Our Agricultural Revolution Will Soon Be Felt On Nigerians’ Dining Tables – FG",
    "summarized_story": "﻿The days of hunger in the land are numbered as Nigerians will soon begin to feel the impact of the Federal Government’s effort to revamp the agricultural sector, even on their dining tables.\nMr Lai Mohammed, who is the Minister of Information and Culture, gave the assurance on Monday while briefing reporters in Abuja.\n“In fact, no government has invested in an agricultural revolution like the Buhari administration,” he stated.\n“They (critics) say ‘oh, but Nigerians are still hungry, and the price of the staples is still high’.\nRice production in Nigeria, according to him, has increased to over 7.5 million metric tons annually, thanks to the Anchor Borrowers Programme of the Central Bank of Nigeria (CBN)."
  },
  {
    "headline": "PHOTOS: Nigeria’s Super Eagles Prepare For Ghana Clash",
    "summarized_story": "The Super Eagles of Nigeria on Monday trained ahead of the FIFA World Cup Qatar 2022 playoff final battle against the Black Stars of Ghana.\nThis comes three days after the Ghanaians held the Eagles to a goalless draw in Kumasi on Friday last week.\nAhead of the second leg, the Super Eagles had a session at the Moshood Kashimawo Abiola (MKO) stadium in Abuja, where the match is scheduled to take place.\nThe match will kick-off 6pm Nigerian time and the winner will secure a ticket to the Qatar 2022 FIFA World Cup.\nREAD ALSO: Ministry, NFF Purchase 20,000 Tickets For Super Eagles’ Fans In Ghana ClashHighlights of the training by the Nigerian team are captured in the pictures below:"
  },
  {
    "headline": "Breaking: Osinbajo meets Obasanjo in Abeokuta",
    "summarized_story": "Vice President Yemi Osinbajo on Monday met with former President Olusegun Obasanjo in Abeokuta, the Ogun State capital.\nOur Correspondent gathered that Osinbajo visited Ogun State for a high-level dialogue organised by the Coalition for Dialogue on Africa (CoDA).\nThe dialogue tagged, ‘West Africa: Rising To The Challenge Of Consolidating Democratic Governance’, planned to hold at the Olusegun Obasanjo Presidential Library (OOPL), Abeokuta on Monday and Tuesday.\nHe who was escorted by the Ogun State Governor, Dapo Abiodun and was received by former President Obasanjo as they proceeded to the venue.\nFormer President Goodluck Jonathan was also in attendance during the programme."
  },
  {
    "headline": "2023: APC will poll 41m votes with the right candidate",
    "summarized_story": "Kogi State Governor, Yahaya Bello, has said that the All Progressives Congress will poll over 41 million votes in the 2023 general elections if a generally accepted candidate should emerge at the party’s primary.\nHe stressed that the APC as a party, as currently constituted, would not zone anyone out of the presidential race.\nGovernor Bello said this during an interview with the Sunrise Daily crew on Channels Television on Monday.\nHe said the party went for an experienced party leader to manage its affairs, noting that the period it took to organise the convention was worth the wait.\n“The new party leader and the National Working Committee have great experience to lead the party into a strong and cohesive entity."
  },
  {
    "headline": "Court remands Abba kyari at Correctional centre",
    "summarized_story": "A federal High Court in Abuja, on Monday ordered the remand of the suspended deputy commissioner of police, Abba Kyari and six others in correctional centre.\nThis is after Justice Emeka Nwite refused to grant him bail.\nThe court held that the NDLEA has placed sufficient evidence before the court enough for it to refuse bail.\nThe NDLEA in its counter affidavits to Mr Kyari’s bail application held that it is inappropriate to grant bail to the applicant because of the facts and circumstances of the case.\nThe 2nd applicant who is an Assistant Superintendent of police is under investigation for money laundering and may face charges on same."
  },
  {
    "headline": "Success of APC National Convention causing pains to PDP",
    "summarized_story": "The newly elected national chairman of the All Progressives Congress, Abdullahi Adamu, says politicians are not strangers to pain and disappointment in the outcome of political process.\nThe former governor of Nasarawa state said the success of the APC convention is causing pain to opposition party but members must resist every temptation to blow every personal differences into full blown party crisis.\nHe added that it is time to do things differently to avoid opposition taking advantageThe APC chairman said the time has come to be patriotic in words and deed.\nHe urged the media to follow the path of the pioneers of journalism in working for the success of the country.\nSenator Abdullahi appreciates party members for the confidence reposed in him and promised never to disappoint the party, the nation, Africa and the world."
  },
  {
    "headline": "Lai Mohammed Speaks On Buhari’s Achievements",
    "summarized_story": "Honorable Minister for Information and Culture, Lia Mohammed, speaks on President Muhammadu Buhari’s administration’s achievements as regards infrastructure.\nAccording to the Minister, those opposing the President cannot turn a blind eye to the level of accomplishments that President Buhari’s administration have achieved in terms of infrastructure which is the bedrock of economic prosperity."
  },
  {
    "headline": "Roman Abramovich and Ukrainian Peace Negotiators Suffer Suspected Poisoning",
    "summarized_story": "The Russian oligarch Roman Abramovich was poisoned along with Ukrainian negotiators, it has been claimed.\nQuoting ‘people familiar with the matter’, it added that Ukrainian President Volodymyr Zelensky, who has met with Abramovich, has not been affected.\n‘The negotiation round on the afternoon of 3 March took place on Ukrainian territory, and lasted until about 10 pm.\n‘Three members of the negotiating team retreated to an apartment in Kyiv later that night and felt initial symptoms – including eye and skin inflammation and piercing pain in the eyes – later that night.\n‘The symptoms did not abate until the morning.’President Zelensky’s spokesman said he had no information about any suspected poisoning, according to the WSJ."
  },
  {
    "headline": "Wike Declares Presidential Bid- Trending With Ojy Okpe",
    "summarized_story": "Governor of Rivers State Nyesom Wike On Sunday declared his intention to contest the presidency in the 2023 general election.\nIn another development, the All Progressives Congress convention over the weekend took a dramatic turn after various Supporters of Nigeria’s Vice President Yemi Osinbajo and the National leader of the All Progressives congress Asiwaju Bola Ahmed Tinubu engaged in a shouting match.\nMeanwhile, Supporters of the central bank Governor Godwin Emefiele who has not declared his intention to run for the presidency in 2023 trooped out in numbers chanting his praise"
  },
  {
    "headline": "Ukraine Pauses Civilian Evacuations, Citing Russian ‘Provocations’",
    "summarized_story": "Ukraine said Monday it was pausing evacuations of civilians from war-scarred regions of the country because intelligence reports suggested invading Russian troops were planning attacks on humanitarian routes.\n“Our intelligence has reported possible provocations by the occupiers on routes of humanitarian corridors,” Ukrainian Deputy Prime Minister Iryna Vereshchuk said in a statement on social media.\n“Therefore, for reasons of public safety, we are not opening humanitarian corridors today.”On Sunday, Vereshchuk said that Russia and Ukraine agreed to establish two humanitarian corridors in the breakaway regions of Donetsk and Luhansk.\nThe planned corridors aimed to allow Mariupol residents to evacuate to the city of Zaporizhzhia in southeastern Ukraine through their personal vehicles.\nHowever, attempts at establishing safe humanitarian corridors between Ukraine and Russia have largely faltered amid reports from Kyiv that Moscow’s troops are attacking the evacuation routes."
  },
  {
    "headline": "Nigeria: ‘Super Cop’ Abba Kyari, Held on Drug Charges, Denied Bail By Abuja Court",
    "summarized_story": "Justice Emeka Nwite of the federal high court sitting in Abuja has refused bail to the suspended Deputy Commissioner of Police Abba Kyari.\nThe court, on Monday, held that the NDLEA has placed sufficient evidence before the court enough for it to refuse bail.\nThe NDLEA in its counter affidavits to Mr Kyari’s bail application held that it is inappropriate to grant bail to the applicant because of the facts and circumstances of the case.\nThe 2nd applicant who is an Assistant Superintendent of police is under investigation for money laundering and may face charges on same.\nIt is on these premises that the court refused the bail application of the 1st and 2nd applicant"
  }
]