[
  {
    "headline": "Ex-France defender Adams dies after almost 40 years in coma",
    "summarized_story": "Former France defender Jean-Pierre Adams has died aged 73 after almost 40 years in a coma, his former club Nimes announced on Monday.\nAdams, who made 22 international appearances in the 1970s, slipped into a coma after a mistake by his anaesthetist during routine knee surgery in 1982.\nBorn in Dakar in 1948, he was one of the first men born in West Africa to play for France.\nHis centre-back partnership with Marius Tresor for France was nicknamed “the black guard”.\n“We learned this morning of the death of Jean-Pierre Adams,” Nimes wrote on Twitter, extending their “sincere condolences to his family”."
  },
  {
    "headline": "Hoodlums burn trailer carrying spare parts for disobeying IPOB’s sit-at-home",
    "summarized_story": "A truck fully loaded with motorcycle spare parts worth millions of naira has been reportedly burnt by hoodlums for allegedly refusing to obey the Monday sit-at-home order that had been suspended by the proscribed Indigenous People of Biafra.\nIt was gathered that the incident happened around 6 am on Monday at Eluagu Obukpa, in the Nsukka Local Government Area of Enugu State.\nSources told The PUNCH that the truck which was heading to Enugu-Ezike in the Igboeze North Local Government Area of the state was coming from Nnewi, Anambra State.\nIPOB had in August declared every Monday sit-at-home in the South-East to demand the release of its leader, Nnamdi Kanu who is in the custody of the Department of State Services.\nThough IPOB subsequently suspended the Monday sit-at-home, palpable fear has been pervading the South-East for five Mondays now as residents and traders stay indoors every Monday."
  },
  {
    "headline": "BBNaija S6: Jaypaul won Saskay’s heart through diligence – Cross",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Cross, has revealed that Jaypaul won Saskay’s heart by being diligent and focused.\nHe made this known while speaking with Pere and Jackie B about the Sunday live eviction show where the host, Ebuka Obi-Uchendu, openly revealed that Jaypaul and Saskay shared a kiss.\nAs they discussed the turnout of the event, Cross revealed that he no longer has feelings for Saskay.\nJaypaul is very determined.”In agreement, Pere said, “Jaypaul was actually taking care of Saskay.”Hailing Jaypaul, Cross said, “You know what they call diligence?\nJaypaul has been very focused.”Agreeing with Cross, Jackie B said that she admires Jaypaul’s diligence and consistency."
  },
  {
    "headline": "Driver docked for allegedly causing death of 2 passengers",
    "summarized_story": "A 51-year-old driver, Owoyemi Samuel, on Monday appeared in a Wuse Zone Six Magistrates’ Court, Abuja, for alleged reckless driving that led to the death of two passengers on a motorcycle.\nThe police charged Samuel, who resides in Divine Heritage Estate and Properties Lugbe, Abuja, with reckless driving and manslaughter.\nThe Prosecution Counsel, ASP Peter Ejike, alleged that on Aug.21, at about8:05pm, the defendant drove a Nissan pick-up with Reg.\nnumber BQ 494 GWA belonging to Divine Heritage Estate and Properties in a reckless manner and collided with commercial motorcycle from the opposite lane.\nHe told the court that the motorcyclist, Mr Musa Haruna, survived the accident but the two passengers died on the spot."
  },
  {
    "headline": "Beneficiaries commend Wema Bank’s SMEs Business School, list benefits",
    "summarized_story": "By Peter EgwuatuBeneficiaries of the maiden Wema SME Business School have commended the novel and impactful initiative of Wema Bank, noting that they have gained immensely from it.\nNigerian and international consultants from the Frankfurt School of Finance and Management Germany, Ernst & Young, Matt Anthony Consulting, IBFC Alliance, and Kuhl-Cher were part of the facilitators at the Business School.\nTwo beneficiaries, Emmanuel Elo-Irawo and Adesuwa Oguocha commended Wema Bank for the initiative, expressing what they had gained immensely from the Business School.\nHe added that the Business School is not just for its customers but for all Nigerian SMEs.\n“After this session, we will have online sessions to enable more MSMEs to participate in the Business School program."
  },
  {
    "headline": "CHI recapitalisation drive on course, posts 8.6% growth in profit",
    "summarized_story": "By Peter EgwuatuDespite the insurance industry recapitalization currently on hold, Consolidated Hallmark Insurance, CHI Plc, has disclosed that its plan of meeting the N10 billion capital base is still on course as it recorded 8.6 per cent growth in profit for the financial year ended December 31, 2020.\nThe net underwriting income grew to N6.5 billion in 2020 from N5.46 billion in 2019.\nClaims expenses jumped by 21 per cent to N 4.17billion in 2020 from N3.45billion in 2019, an affirmation of our commitment to continually maintain our sterling reputation of ensuring that customers get value through prompt payment of all valid claims.\n“We also recorded a modest growth of 8.6 per cent in Profit Before Tax which moved to N772 million in 2020 from N711million in the preceding year, while Profit After Tax increased to N677.98 million from N600.31 million in 2019.\nTotal Assets increased by 22 per cent, growing to N14.31 billion in the year under review from N11.74 billion.”On future outlook, he said: “The business operations now getting back fully to normal and the effects of the global pandemic gradually waning, especially in our local operating environment, we are quite hopeful of further improvement in performance.”"
  },
  {
    "headline": "Rivers APC 2023: Nobody can stop my aspiration, peoples support, Abe vows",
    "summarized_story": "Senator Magnus AbeBy Egufe Yafugborhi – Port HarcourtFORMER Rivers State All Progressives Congress (APC) governorship contender, Sen Magnus Abe, says political enemy or antagonist cannot stop his aspiration in the race for 2023 elections.\nAbe to his Rivers APC adversaries, said, “Those who don’t want to see me, when they hear the name Sen Abe, they can not sleep, when they hear Abe they are worried will fail against me.\nALSO READ: Magnus Abe denies involvement in alleged $650m scam“This is Rivers state and we will play politics in Rivers.\nThe President General, Rivers Voice of Freedom, Dominic Dumnakpigi said the aim of the group was to liberate Rivers people from oppression and tyrannical political leadership.\nNwogu Boms, Former Attorney General and Commissioner for Justice of Rivers state, described Sen Magnus Abe as “game changer in the state.”Vanguard News Nigeria"
  },
  {
    "headline": "Ogun moves to curtail cholera outbreak",
    "summarized_story": "Ogun State has stepped up efforts to curtail the recent outbreak of cholera in Magboro in Obafemi-Owode Local Government Area of the state.\nCommissioner for Health, Dr Tomi Coker, said in a statement issued on Monday in Abeokuta that the reported outbreak was predominant among motorcycle riders and scavengers.\nShe stated that the index case was reported to have returned to the state from elsewhere, while the public toilet used was the channel of transmission.\nDr Coker stated also that a treatment centre had been set up at the Magboro-Akeran Health Centre adding that the suspected public toilet had been sealed for sanitisation.\nShe said neighbouring communities had been sensitised on steps to take and where to seek care or report suspicious cases."
  },
  {
    "headline": "Insecurity: Nigerian leaders need to obey God – Pastor Adeboye",
    "summarized_story": "Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God, RCCG, has urged Nigerians to heed to God’s directive amid the insecurity challenges in the country.\nAdeboye said leaders and Nigerians, in general, should look up to God for a solution to the insecurity in the country.\nAdeboye urged church leaders to pray for the nation’s progress.\n“It is fulfilment of God’s directive to His servant, Esther Ajayi, some years ago; the centre has become a reality today.\nThe General Overseer urged Nigerians to embrace God for stability and progress in families and the nation."
  },
  {
    "headline": "Nnamdi Kanu’s lawyer moves to stop extradition of IPOB members from Ghana",
    "summarized_story": "Aloy Ejimakor, special counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has taken steps to stop the extradition of some members of the group arrested in Ghana to Nigeria.\nEjimakor said he had sent some legal documents to IPOB’s Directorate of State, DOS, to defend the group’s members arrested by Ghanaian police last week.\nHe explained that the step was to prevent the arrested Biafra agitators from being sent to Nigeria.\nIn a tweet, Ejimakor wrote: “Update on #IPOB Ghana: A few days ago, I sent to the DOS (via @ChinasaNworu) certain legal documents critical to the defense of the faithfuls currently distressed in Ghana.\nIn a video online, the arrested members were seen singing a pro-Biafra solidarity song."
  },
  {
    "headline": "FG wrongly paid millions of Naira to 588 doctors – Ngige",
    "summarized_story": "The Nigerian government has vowed to recover millions of Naira wrongly paid to 588 medical doctors.\nNgige said the affected doctors wrongly benefitted from the Medical Residency Training Fund meant for a particular category of doctors.\nTheir names were uncovered after a scrutiny of the 8,000 names submitted by Chief Medical Directors of federal institutions.\nHe said about 2,000 names should have been omitted because they don’t have Postgraduate Reference Numbers of National Postgraduate Medical College and (or) that of the West African Postgraduate Medical College.\nNgige said result of the first round of scrutinization will be compared to the lists the Post-Graduate Medical College and the Chief Medical Directors presented."
  },
  {
    "headline": "COVID-19 is real, take vaccine – CAN chairman tells Bauchi Christians",
    "summarized_story": "The Chairman of Christian Association of Nigeria (CAN) Bauchi State Chapter, Reverend (Dr) Abraham Damina Dimeus has said that the deadly COVID-19 disease is real.\nHe urged Christians in the state to, as a matter of necessity, make themselves available for COVID-19 vaccine.\nAccording to him, given the evidences of victims of the pandemic and the number of those who had died of complications of the dreaded disease, COVID-19 was real.\n“In all the meetings we have attended on the COVID-19 vaccination, fingers are being pointed at us as people who are not supporting the government to fight the pandemic.\nHe said that CAN in the state had arranged with the Bauchi State Primary Health Care Development Agency (BSPHCDA) to bring the vaccine to churches for ease of administration."
  },
  {
    "headline": "Suspected bandits abduct wife, children of Katsina lawmaker, Kurami",
    "summarized_story": "The wife and two children of Dr. Ibrahim Kurami, the lawmaker representing Bakori Constituency in Katsina State House of Assembly were kidnapped by suspected bandits late hours of Saturday.\nA reliable source informed DAILY POST that the bandits who stormed the Kurami residence of the lawmaker in Bakori Local Government Area settled for his wife and children when they discovered that the lawmaker was nowhere to be found.\nThe source also revealed that the bandits shot the security guards they met at the gate before proceeding to whisk away the family of the lawmaker to an unknown destination.\n“The bandits entered the house of our lawmaker, Dr. Ibrahim Kurami, to kidnap him but when they could not find him, they took his wife and two children instead.\nThey also shot the security guard at the gate and he is in the hospital receiving treatment,” the source said."
  },
  {
    "headline": "BBNaija: I was supposed to get married next year – Saskay",
    "summarized_story": "21-year-old Big Brother Naija Shine Ya Eye housemate, Saskay, has revealed that she was supposed to get married next year.\nShe said her boyfriend had told her their relationship will end if she became one of the housemates.\nWe were supposed to get married next year,” she added.\nStartled by the revelation, Angel said she was in ‘talking stage with a guy before the show.’“I was in talking stage but I don’t know about that again,” she stated.\nOn Friday Saskay told Cross that she had chosen Jaypaul because he put in more effort at wooing her."
  },
  {
    "headline": "BBNaija: Boma clears air on amorous affair with Tega after eviction",
    "summarized_story": "One of the four evicted housemates in Big Brother Naija, Boma, on Sunday night opened up on his purported amorous relationship with Tega.\nIronically, Tega, a married housemate, was the first to be booted out in tonight eviction in in what many of her critics described as Karma.\nWuzupNigeria reported that at least four housemates were evicted on Sunday in the first-ever quadruple eviction in the reality TV show.\nBoma, however, came clean on Sunday night about his perceived amorous affair with Tega.\nHis open confession seemed to synch with an earlier explanation given by Tega that her relationship with Boma was merely a script."
  },
  {
    "headline": "BBNaija: Daddy Freeze advises Boma after eviction",
    "summarized_story": "Popular controversial OAP, Daddy Freeze has advised evicted BBNaija housemate, Boma on his relationship outside the house.\nBoma was evicted on Sunday during the live eviction show which also saw three other housemates exit the reality show.\nBoma’s exit from the show was attributed to his relationship with Tega and his attitude towards other female housemates.\nHowever, he took responsibility for his actions and apologised to his fans for his mistakes.\nDaddy Freeze on his Instagram page advised Boma to work on himself."
  },
  {
    "headline": "Footballer dies after collapsing during FA Youth Cup match",
    "summarized_story": "West Bridgford Colts have been left saddened over the tragic death of a young footballer who suffered a suspected cardiac arrest while playing in an FA youth cup match.\nUK Sun reports that Dylan Rich collapsed on the pitch during the match against Boston United on Thursday.\nSadly, Rich passed away on Sunday, according to a statement from the club.\nThey said in a statement: \"It is with great sadness that, following the events of Thursday evening, we have to announce the tragic passing of Dylan Rich.\nOur thoughts and prayers go out to his parents Mike and Anna, his sister Lucy and Dylan’s family, friends and teammates."
  },
  {
    "headline": "BBNaija: Emmanuel is a flirt - Angel",
    "summarized_story": "Big Brother Naija season six housemate, Angel, has tagged Emmanuel a flirt despite being in a sizzling relationship with Liquorose.\nAngel revealed this during a conversation with JayPaul and Saskay in the garden on Sunday night.\nAccording to Angel, even the evicted housemate, JMK, took note of his flirty attitude the first day she entered the house.\nAngel said, “Everyone knows Emmanuel is a flirt.\nMeanwhile, Whitemoney has advised Emmanuel to stay away from Angel and stick with Liquorose if he really wants to stay longer in the house."
  },
  {
    "headline": "Govs disown FG over $418m consultancy debt",
    "summarized_story": "The Minister of Finance is said to have directed the Director General, Debt Management Office (DMO) to issue Promissory Notes in favour of the consultants.\n“It must be noted that custodians and managers of public funds are public trustees and must at all times act in the public interest.\n“The issuance of Promissory Notes of a humongous sum of over USD$418million to private persons for alleged consultancy work demands not only caution but strict due diligence, particularly when the judgments which gave rise to the payments sought to be enforced are the subject of pending litigation.\nThe nation is already going through economic adversity and every dollar is needed to be channelled to people-oriented projects.\nPublic duty and probity demand that public trustees must, at all times, act in the interest of the people they serve in order to protect their commonwealth."
  },
  {
    "headline": "Conflicting orders: CJN to quiz 7 Chief Judges today",
    "summarized_story": "From Godwin Tsa, AbujaThe Chief Justice of Nigeria (CJN), Justice Ibrahim Mohammad will today grill seven Chief Judges over conflicting court orders that emanated from their various states.\nThose to be quizzed are the Chief Judges of Rivers, Cross River, Anambra, Imo, Jigawa, Kebbi and Delta states.\nMeanwhile, Daily Sun gathered that Justice Mohammad has already directed them to come with the records of proceedings in all the suits from which conflicting ex parte orders emanated.\nThe CJN who is the Chairman of the National Judicial Council (NJC) had on August 30, issued the summons to the Chief Judges.\nThe summons read in part, “My attention has been drawn to media reports to the effect that some Courts of coordinate jurisdiction were granting conflicting ex parte orders on the same subject matter."
  },
  {
    "headline": "How Sowore was killed by suspected kidnappers –Edo police",
    "summarized_story": "From Tony Osauzo and Ighomuaye Lucky, BeninThe Edo State Police Command, yesterday, gave an update on how Felix Olajide Sowore, younger brother of the convener of Revolution Now, Omoyele Sowore, was killed Saturday by suspected kidnappers.\nAddressing journalists in Benin City, spokesman of the Command, Bello Kontongs, clarified that the younger Sowore was not an occupant of a commercial bus from which five persons were abducted.\nHe explained that Sowore was driving from Okada to Benin when he ran into the suspected kidnappers, who were shooting at the bus which broke down on Friday night and the occupants had to find somewhere else to sleep.\nKontongs added that the stranded commuters had returned early on Saturday to pick their personal effects from the bus, when the kidnappers, who had laid ambush, opened fire on them and Sowore drove into the firing line, unknowingly.\n“The Sowore Felix was not one of the occupants of the bus that some of them were kidnapped."
  },
  {
    "headline": "Bandits abduct district head, demand N100m ransom in Niger",
    "summarized_story": "From John Adams, MinnaBarely two days after armed bandits killed no fewer than 20 villagers in reprisal in magami, Shiroro local Government Area of Niger State, the District Head of Wawa in the Borgu emirate of the state, Mr Mahmud Ahmed Aliyu,has been abducted.\nThe Dodo of Wawa as the District head is popularly referred to, was abducted by the heavily armed men from his palace on Saturday night.\nThe Wawa town where the he was abducted is about two kilometers to the 221 Wawa Military cantonment in Borgu.\nThe Doodo of Wawa is most richest District head in Borgu Emirate, a Malaysia trained doctorate degree holder in Environmental Science who returned to the country last year after his programme.\nThe incident had thrown the entire Wawa community into confusion, bringing all activities into a halt."
  },
  {
    "headline": "PIA evil, oppressive, says Gov Diri",
    "summarized_story": "Bayelsa Governor, Senator Douye Diri, has described the Petroleum Industry Act (PIA) as evil and oppressive to people of the Niger Delta.\nDiri said the three per cent allotted to host communities in the Act was paltry and would continue to be opposed until justice was served.\nA lot of ignorant people were against the former governor of Bayelsa State, who rose and championed a walkout in the Senate.\nDiri promised to stand for the actualisation of the creation of two additional states for the Ijaw ethnic group, namely the Oil River and Toru-Ibe states.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Why PDP May Lose All Southern States if It Zones Presidency to North",
    "summarized_story": "The party might, however, lose states like Taraba, Benue and unable to win back Plateau, if it decided to zone presidency to the north.\nAccording to the THISDAY EIG survey, “If the PDP zones the Presidency to the North, they are likely to lose all their current Southern states, essentially, because of the mood in the South that Nigeria’s Presidency should rotate between the North and the South.\nHowever, Obaseki, although a PDP governor, the survey showed, is a firm believer in the southern presidency.\nAccording to the survey, the factors in each of the critical southern states, with seeming PDP influence, painted scenarios peculiar to them.\nWith federal support, they would dislodge the PDP in Delta and sweep Okowa away, should the PDP present a northern president."
  },
  {
    "headline": "Coup in Guinea as Soldiers Oust President Condé",
    "summarized_story": "•Nigeria, UN chief condemn developmentMichael Olugbode in Abuja and Sunday Okobi with agency reportDemocratic gains recorded on the continent, yesterday, suffered another tragic setback, when soldiers in Guinea, in an apparent coup d’etat, seized power from the country’s democratically elected President, Alpha Condé.\nThis followed hours of heavy gunfire near the presidential palace in the capital, Conakry.\nGuinea joined the growing list of countries on the continent that have recently fallen into military rule.\nMeanwhile, the Nigerian Government and the United Nations Secretary-General, Antonio Guterres, have condemned the coup and demanded immediate release of President Condé.\nAlso, in a viral video, which the media, including the BBC, has not been able to verify, the soldiers asked President Condé, 83, to confirm he was unharmed, but he refused to respond."
  },
  {
    "headline": "Buhari’s Administration Has Broken Many Jinxes, Says Presidency",
    "summarized_story": "Buhari’s media adviser, Femi Adesina, in a statement, titled, “Jinxes broken by Buhari,” listed the Petroleum Industry Bill, signed into law in 2021 after almost two decades in the works, as one of the major feats of the president.\nHe said the president had completed 12 inherited dam projects across the country.\nThese he listed to include Kashimbila Multipurpose Dam, Taraba; Ogwashi-Uku Multipurpose Dam, Delta; Adada Dam, Enugu; Sulma Earth Dam, Katsina; Gimi Earth Dam, Kaduna; Amla-Otukpo Dam, Benue; Amauzari Earth Dam, Imo; Ibiono-Ibom Earth Dam, Akwa Ibom; Gadau/Lafia Zigau Dam, Bauchi; Alajue Small Earth Dam, Osun; Kampe Omi Dam, Kogi (Rehabilitation); and Kargo Dam, Kaduna (Rehabilitation).\n“President Buhari is the first president to start and complete a rail project in Nigeria’s history (Lagos-Ibadan Rail).\nPresident Buhari has successfully flagged off Train 7 construction."
  },
  {
    "headline": "India, Netherlands, Spain Emerge Top Export Destinations for Nigeria’s Crude Oil",
    "summarized_story": "Other countries listed as consumers of Nigeria’s crude are United Kingdom with 24.3 million barrels, Cote d’Ivoire with 20.4 million barrels, France with 19.7 million barrels, Singapore which bought 19.4 million barrels and United States Gulf Coast with a cumulative purchase of 19.4 million barrels.\nTogo bought 17.3 million barrels, Portugal purchased 14.8 million barrels, Turkey’s total transaction for the year was 18.1 million barrels, followed by Indonesia’s 17.1 million barrels.\nFurthermore, an analysis of Nigeria’s 10-year crude oil production revealed that the country produced about 8.425 billion barrels during the period 2010-2020.\nA breakdown of the figures indicated that in 2010, 896 million barrels, the highest for the period, was produced, 866.2 million barrels was produced in 2011, 852.7 million barrels in 2012, 800 million barrels in 2013, 798 million barrels in 2014, and 773 million barrels in 2015.\nProduction by fiscal regime showed that Joint Ventures (JVs) contributed 208 million barrels, Alternative Financing (AF) contributed 68.8 million barrels, Production Sharing Contracts (PSCs) contributed 254.7 million barrels, Independents and the Nigerian Petroleum Development Company (NPDC) contributed 93.4 million barrels while marginal fields added 19.3 million barrels."
  },
  {
    "headline": "AMCON: Expert Seeks National Policy on Debt Recovery",
    "summarized_story": "Dike OnwuamaezeThe federal government has been challenged to expand the laws that grants the Asset Management Corporation of Nigeria (AMCON) special debt recovery powers in the corporation’s Act as amended into a national law.\nThis would insulate the banking sector against reckless borrowers and recalcitrant debtors that AMCON is currently chasing for the recovery of trillions of naira.\nSince then, AMCON has worked tirelessly to recover the huge debt, which were covered by various collaterals.\nBut as the years roll by, AMCON obligors have become more daring, and hiding under all manners of legal technicalities to delay the agency from recovery.\nThere must be a national law on debt recovery."
  },
  {
    "headline": "WATCH LIVE: TF Interviews: A Conversation With Omoyele Sowore",
    "summarized_story": "You may also like"
  },
  {
    "headline": "WATCH LIVE: TF Interviews: A Conversation With Omoyele Sowore",
    "summarized_story": "You may also like"
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "Cleric Warns Lagos Governor, Sanwo-Olu Over Second-term Ambition, Says 'Forget About Politics Now'",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has warned the Lagos State Governor, Babajide Sanwo-Olu of an impending crisis in his political ambition.\nThe cleric warned that Sanwo-Olu should forget politics for now and re-strategise because there are forces waiting to rain nemesis on him due to his second term ambition.\n“Sanwo-Olu's second-term crisis will begin, he should forget politics now and strategise, some forces are waiting to rain nemesis on him.\n“The Oba of Lagos, Oba Rilwan Akiolu should also be mindful of crisis in his kingdom.\nHe further revealed that Lagos State will be divided into five states in the nearest future."
  },
  {
    "headline": "Report: 1409 students kidnapped in Nigeria in almost two years",
    "summarized_story": "A new report by SBM Intelligence, Nigeria’s geopolitical intelligence platform, says at least 1409 students have been abducted in Nigeria in the past 19 months.\nAdvertisementIn the report titled, ‘School abductions in Nigeria’, the group broke down the figures of students who have been victims of these incidents since March 2020.\nSchools in Nigeria, particularly in the northern states, have been targets of bandits and Boko Haram insurgents in recent years.\nIn addition, SBM Intelligence, in its latest report, estimated that 1,409 students have suffered abductions since “the latest school abduction epidemic which started in March 2020,” with 16 of them killed in the process.\nAdvertisement“At least 1409 students have been kidnapped from their schools in Nigeria since the first incident in the country’s latest school abduction epidemic, which started in March 2020,” the report reads."
  },
  {
    "headline": "Report: 1409 students kidnapped in Nigeria in almost two years",
    "summarized_story": "A new report by SBM Intelligence, Nigeria’s geopolitical intelligence platform, says at least 1409 students have been abducted in Nigeria in the past 19 months.\nAdvertisementIn the report titled, ‘School abductions in Nigeria’, the group broke down the figures of students who have been victims of these incidents since March 2020.\nSchools in Nigeria, particularly in the northern states, have been targets of bandits and Boko Haram insurgents in recent years.\nIn addition, SBM Intelligence, in its latest report, estimated that 1,409 students have suffered abductions since “the latest school abduction epidemic which started in March 2020,” with 16 of them killed in the process.\nAdvertisement“At least 1409 students have been kidnapped from their schools in Nigeria since the first incident in the country’s latest school abduction epidemic, which started in March 2020,” the report reads."
  },
  {
    "headline": "Gunmen abduct three family members in Abuja, demand N50m ransom",
    "summarized_story": "Three family members were reportedly abducted by gunmen on Sunday in Pegi, a town in Kuje area council of the federal capital territory (FCT).\nAdvertisementThe victims — a mother and two daughters — were reportedly abducted when the gunmen invaded their home in the early hours of Sunday.\nThe head of the family of the abducted persons identified as Gabriel Oladapo, a pastor, was reportedly out of Abuja when the attack happened.\nAdvertisementThe kidnappers have reportedly demanded the sum of N50 million as ransom.\nThe abductors who contacted the family of the victims, initially demanded N100 million but later reduced it to N50 million, Daily Trust newspaper quoted a source to have said."
  },
  {
    "headline": "Gunmen abduct three family members in Abuja, demand N50m ransom",
    "summarized_story": "Three family members were reportedly abducted by gunmen on Sunday in Pegi, a town in Kuje area council of the federal capital territory (FCT).\nAdvertisementThe victims — a mother and two daughters — were reportedly abducted when the gunmen invaded their home in the early hours of Sunday.\nThe head of the family of the abducted persons identified as Gabriel Oladapo, a pastor, was reportedly out of Abuja when the attack happened.\nAdvertisementThe kidnappers have reportedly demanded the sum of N50 million as ransom.\nThe abductors who contacted the family of the victims, initially demanded N100 million but later reduced it to N50 million, Daily Trust newspaper quoted a source to have said."
  },
  {
    "headline": "LG election: PDP winning in my polling unit shows APC didn't manipulate e-voting, says el-Rufai",
    "summarized_story": "Nasir El-Rufai, governor of Kaduna, says the Peoples Democratic Party (PDP) winning in his polling unit in the LG election shows that the All Progressives Congress (APC) did not manipulate the e-voting machines.\nHowever, the APC lost in the polling unit of el-Rufai in the state’s LG elections on Saturday.\n“Those that reported that the machines were programmed were ashamed when it was reported that APC lost in my polling unit.\nPeople were laughing that I lost my polling unit, but it is democracy that won,” he said.\n“There is little we can do to avoid thugs snatching electoral machines, but you should know that these machines are programmed to be disconnected remotely by the electoral commission."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Entrepreneurs sidestep uncertainty to redefine farming in Jos",
    "summarized_story": "Jos is known for its peculiar weather in Nigeria, but actually, much of Plateau State benefits from the unique combination of climate, topography and elevated hills.\n“The climate in Jos is a bit comparable to a temperate climate,” says Marie Ekhator, an Austrian who runs Mama-Itohan RegenSoil, who BusinessDay met while in Jos.\nBut before Ekhator, people in Jos had already figured out there was something special about their environment and it could support crops not indigenous to Nigeria.\nOne of such new entrants would be Wiebe Boer, whose LinkedIn post on going into farming in Plateau State generated some buzz.\nBusinessDay also learnt of a strawberry community in Jos, where that is what the whole community does."
  },
  {
    "headline": "Entrepreneurs sidestep uncertainty to redefine farming in Jos",
    "summarized_story": "Jos is known for its peculiar weather in Nigeria, but actually, much of Plateau State benefits from the unique combination of climate, topography and elevated hills.\n“The climate in Jos is a bit comparable to a temperate climate,” says Marie Ekhator, an Austrian who runs Mama-Itohan RegenSoil, who BusinessDay met while in Jos.\nBut before Ekhator, people in Jos had already figured out there was something special about their environment and it could support crops not indigenous to Nigeria.\nOne of such new entrants would be Wiebe Boer, whose LinkedIn post on going into farming in Plateau State generated some buzz.\nBusinessDay also learnt of a strawberry community in Jos, where that is what the whole community does."
  },
  {
    "headline": "For educated Jos farmers, agric pays better than white-collar jobs",
    "summarized_story": "Farming started in 2017, a year after becoming a lecturer.\nHe cultivates vegetables on a 1.8-hectare farm in Kwang, with a combination of open field and greenhouse farming with six greenhouses.\nThe 44-year-old, who had run his family’s hotel business in the past and executed IT contracts through his company, started farming in 2008.\nShe quit banking and later started farming using both conventional greenhouses and, interestingly, repurposing uncompleted structures inside the family compound, to function as greenhouses.\nLike most greenhouse farmers, her main crop is the bell pepper, and the income helps complement the family’s earnings."
  },
  {
    "headline": "Edo Police, local vigilante comb forests, assure arrest of killers of Olajide Sowore – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA combined team of security operatives in Edo State at the weekend combed the forests in search of the killers of Olajide Sowore, the younger brother of Sahara Reporters’ Publisher and human rights activist, Omoyele Sowore.\nThe security team includes men and officers of the Edo State Police Command, local hunters and members of the Edo State Vigilante Security Network.\nThe Edo Police Public Relations Officer (PRO), Kontongs Bello, disclosed this while addressing journalists in Benin City on Sunday.\n“Sowore who was coming from Okada going towards Benin was just a victim whom they tried to stop and he refused and they shot at his car.\nThe Commissioner of Police is doing everything possible to ensure that these people are arrested and those kidnapped are rescued.”..."
  },
  {
    "headline": "Edo govt announces resumption of schools for 2021",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said schools in the state will resume for the 2021/2022 academic session on Monday, September 6, 2021.\nIn a statement, Permanent Secretary, Edo State Ministry of Education, Mrs. Stella-Maris Imasuen, said parents/guardians are to ensure that all relevant learning materials are provided for their children/wards.\nShe noted, “It is hereby announced for the information of the general public especially School Heads/Principals and Proprietors of Private Schools, that Schools in Edo State will resume for academic activities on Monday 6th of September, 2021 for first term of the 2021/2022 academic session.”According to her, all school Heads/Principals and Proprietors are to collect the School Calendar for 2021/2022 academic session from the Office of the Chief Inspector of Education in their respective Local Government Area.\n“For safe school environment, School Heads/Proprietors are to ensure strict compliance with the COVID-19 protocols, which include compulsory use of face mask, use of infrared thermometer, regular hand washing and use of hand sanitizers,” she added."
  },
  {
    "headline": "Fayemi Visits Olu Of Warri, Assures Of Governors’ Forum’s Support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Governor of Ekiti State, Dr. Kayode Fayemi has visited Olu Of Warri, His Majesty, Ogiame Atuwatse III, in his place in Warri, Warri South Council Area of Delta State.\nThe governor said the speech has made Nigeria and particularly, the Warri kingdom, the toast of the global community.\nWe want to create services that will improve not just Warri kingdom but the country”.\nMeanwhile, His Majesty Ogiame Atuwatse III, on Saturday formally confirmed seven additional traditional chiefs in Itsekiriland in continuation of the revalidation exercise.\nAll the chiefs pledged their moral and financial support for the socioeconomic agenda of His Majesty, Ogiame Atuwatse III to transform Warri kingdom."
  },
  {
    "headline": "SEC Promises to Reduce Operating Cost … Assures of Profitability in 2 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Securities and Exchange Commission has unveiled plans to reduce its operating costs in order to boost profitability within the next two years.\nSpecifically, he said that the total revenue so far paid by SEC into the treasury as of the end of June, 2021 was about N1.5bn.\nOn the high overhead costs, the SEC DG explained that this is being reduced aggressively.\n“It has reduced because we have since we came, aggressively looked at the overhead and staff cost and reduced certain components of our staff pay that has generated over N2bn of savings as at now.\n“If you take the MTEF numbers, as you go forward, you find that by 2024 staff cost reduces to only N5.88bn."
  },
  {
    "headline": "ANALYSIS: Zambia’s new president takes aim at security sector",
    "summarized_story": "True to the businessman he is, he wasted no time in aligning the security forces.\nMr Hichilema’s move is a necessary first step in developing professional security forces and engendering citizens’ confidence in the integrity of these institutions.\nIt can also help mend damaged relations between the public and the security forces, and show that the security sector should serve the nation – not the ruling party.\nIn a clear recognition of professionalism and integrity, Mr Hichilema promoted one of his jailers to Deputy Commissioner General of Correctional Services.\nSADC should perhaps take lessons from Mr Hichilema and create inclusive platforms that civil society and opposition parties can participate in."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Report says 1409 students kidnapped in Nigeria in 19 months",
    "summarized_story": "At least 1409 students have been abducted in Nigeria in the past 19 months, a report by SBM Intelligence, Nigeria’s geopolitical intelligence platform, has said.\nTitled ‘School abductions in Nigeria’, the report broke down the figures of students who have been victims of these incidents since March 2020.\nThe report estimated that 1,409 students have suffered abductions since “the latest school abduction epidemic which started in March 2020,” with 16 of them killed in the process.\n“At least 1409 students have been kidnapped from their schools in Nigeria since the first incident in the country’s latest school abduction epidemic, which started in March 2020,” the report reads.\n“In the 19 incidents up until the latest kidnap in Zamfara state, 17 teachers have also been kidnapped alongside their students, and at least ₦220 million has been paid out as ransoms."
  },
  {
    "headline": "Preference for foreign goods is destroying Naira – CBN",
    "summarized_story": "Nigeria’s Central Bank of Nigeria has said the appetite of Nigerians for foreign goods is destroying the naira.\nThis was disclosed by the Director, Corporate Communications Department, CBN, Osita Nwanisobi, at a one-day interactive session with the organised labour and civil society on the five-year policy thrust of the CBN in Enugu.\nThe CBN interventions are borne out of the critical issues within our economic space.\n“We are here to discuss about CBN policies and intervention programmes with some significant stakeholders in this country.\nThat is also why CBN is doing massive intervention especially in agriculture.”Issah Aremu, Director General of the Michael Imodu National Institute of Labour Studies, complimented the CBN for implementing a national planning policy."
  },
  {
    "headline": "Medview Airline Plc appoints new Company Secretary",
    "summarized_story": "The management of Medview Airline Plc, has notified the Nigerian Exchange Limited of the resignation of its Company Secretary, Abdullahi Adam Al-ilory Esq.\nof Messrs Abdullahi Adam Abdullahi & Co (Al-ilory Chambers) and the subsequent appointment of an acting secretary to fill the void.\nIn a letter signed by the Executive Director, Business Development and Commercials, Na’Allah I.S, the company announced that the resignation of Abdullahi became effective from 13th of August, 2021.\nTo fill the void, the company announced that Messrs G.Elias &Co will assume the role of the Company Secretary in acting capacity until the next Board meeting of the Company scheduled to hold on the 20th of September, 2021"
  },
  {
    "headline": "Ecobank Super Reward Scheme is to deepen savings MD/CEO",
    "summarized_story": "Adebayo ObajemuManaging Director/Regional Executive, Ecobank Nigeria Ltd, Patrick Akinwuntan has said the bank initiated Super Reward Scheme to deepen savings amongst Nigerians, reward and assist customers’ businesses.\nWe are giving them opportunity to grow their businesses by providing them with convenient banking services.\nWe are bringing banking services to every neighbourhood through Xpress points, our agency banking platforms where we presently have close to 35, 000 locations across the country.\nBadero Modupe Olufunmilayo, winner in Lagos Region, said she was attracted to Ecobank because of its network advantage and excellent service delivery.\nOn his part, Tsoho Alaye, winner in FCT/Northern Region appreciated the bank’s management for a track record of rewarding customers."
  },
  {
    "headline": "Why I’m Building Sports Centres – Sen Uba Sani",
    "summarized_story": "Senator Uba Sani has said that he is building Neighborhood Sport Centres in order to help create opportunities for youths to develop their talents, stay healthy and enhance peaceful coexistence.\nWe are determined to give our people the best.\nNo half measures.’’Senator Sani who said that that he was deeply inspired by Governor Nasir El-Rufai’s untiring efforts to make Kaduna state a model of development, also said that the five Sports Centres will be located at Narayi, Kajuru, Tudun Wada, Rigasa and Kawo.\nI facilitated the ongoing building of the N3 billion Faculty of Engineering, Kaduna State University.\nThis massive project will contribute to addressing the manpower deficit in Kaduna state.’’Senator Sani said that he has made key interventions across the seven local governments in his senatorial district, ranging from ‘’construction and equipping 110-bed space capacity hostels in secondary schools, technical entrepreneurial skill development in agriculture and agro-business.’’The legislator added that he has constructed primary healthcare centres, built and equipped skills acquisition centres, constructed solar powered and motorized boreholes as well as installed solar powered lights, constructed and equipped ICT centres in secondary schools."
  },
  {
    "headline": "Why I’m Building Sports Centres – Sen Uba Sani",
    "summarized_story": "Senator Uba Sani has said that he is building Neighborhood Sport Centres in order to help create opportunities for youths to develop their talents, stay healthy and enhance peaceful coexistence.\nWe are determined to give our people the best.\nNo half measures.’’Senator Sani who said that that he was deeply inspired by Governor Nasir El-Rufai’s untiring efforts to make Kaduna state a model of development, also said that the five Sports Centres will be located at Narayi, Kajuru, Tudun Wada, Rigasa and Kawo.\nI facilitated the ongoing building of the N3 billion Faculty of Engineering, Kaduna State University.\nThis massive project will contribute to addressing the manpower deficit in Kaduna state.’’Senator Sani said that he has made key interventions across the seven local governments in his senatorial district, ranging from ‘’construction and equipping 110-bed space capacity hostels in secondary schools, technical entrepreneurial skill development in agriculture and agro-business.’’The legislator added that he has constructed primary healthcare centres, built and equipped skills acquisition centres, constructed solar powered and motorized boreholes as well as installed solar powered lights, constructed and equipped ICT centres in secondary schools."
  },
  {
    "headline": "Kashim Ibrahim Fellowship: El-Rufai Reiterates Youth Inclusiveness",
    "summarized_story": "Governor Nasir El-Rufai has said that Kaduna State Government has demonstrated its belief in young people, by creating platforms and opportunities for them since 2015.\nThe governor said that he hopes to open up the Fellowship ‘’to all Africans, including those in the Diaspora, at the most appropriate time in the near future.’’El-Rufai said that Kaduna State Government has been impressed by the performance of the first three sets of the Kashim Ibrahim Fellowship.\nThe governor said that the earlier cohorts had notable traits like youthful vibrancy, willingness to learn and reliability in delivery.\n‘’As the fellows of the fourth cohort settle into their programme, I wish to challenge each of you to live up to the high standards already set,’’ he added.\nThe governor told the fellows that they ‘’ will be required to read a lot of books on subjects as diverse as Nigerian history and politics, geopolitics, governance, and global economic trends.’’"
  },
  {
    "headline": "Kashim Ibrahim Fellowship: El-Rufai Reiterates Youth Inclusiveness",
    "summarized_story": "Governor Nasir El-Rufai has said that Kaduna State Government has demonstrated its belief in young people, by creating platforms and opportunities for them since 2015.\nThe governor said that he hopes to open up the Fellowship ‘’to all Africans, including those in the Diaspora, at the most appropriate time in the near future.’’El-Rufai said that Kaduna State Government has been impressed by the performance of the first three sets of the Kashim Ibrahim Fellowship.\nThe governor said that the earlier cohorts had notable traits like youthful vibrancy, willingness to learn and reliability in delivery.\n‘’As the fellows of the fourth cohort settle into their programme, I wish to challenge each of you to live up to the high standards already set,’’ he added.\nThe governor told the fellows that they ‘’ will be required to read a lot of books on subjects as diverse as Nigerian history and politics, geopolitics, governance, and global economic trends.’’"
  },
  {
    "headline": "Amb. Coomassie Condemns Military Takeover In Guinea",
    "summarized_story": "Following the coup d’etat that ousted President Alpha Conde of the Republic of Guinea on Sunday, the UN SDG Ambassador and continental director, Advocacy for Good Governance Network, Amb Hussaini Coomassiehas condemned the coup that ousted the President calling it a calculated attempt to rubbish democracy in the country.\nHe made this known during a chat with our correspondent at his Abuja villa, immediately after the military took over power while frowning at the development.\nADVERTISEMENTAccording to him, Alpha Conde of the Republic of Guinea was elected by the people and should be removed using same democratic means.\nHe explained that the step taken by the military is unjust and should not be taking with kid gloves.\nNumerous reports say the coup was led by an elite unit headed by a former French legionnaire, Lt Col Mamady Doumbouya."
  },
  {
    "headline": "Opinion: Dogs Eat Tigers In Nigeria – By SUYI AYODELE – Daylight",
    "summarized_story": "The avatar, Chief Obafemi Awolowo, as far back as 1976 (45 years ago), warned about the current security situation in Nigeria.\nAnd they are made manifest even in our very present situation.\nThe anomic society Awolowo predicted some 45 years ago is exactly where we live right now as Nigerians.\nOn Tuesday, August 25, 2021, “bandits”, or “terrorists” or “unknown gunmen”, visited the heart of our defence and defence structure.\nThat was the day armed men stormed our Nigeria Defence Academy, (NDA), killed two middle-level officers and abducted one."
  },
  {
    "headline": "Opinion: Dogs Eat Tigers In Nigeria – By SUYI AYODELE – Daylight",
    "summarized_story": "The avatar, Chief Obafemi Awolowo, as far back as 1976 (45 years ago), warned about the current security situation in Nigeria.\nAnd they are made manifest even in our very present situation.\nThe anomic society Awolowo predicted some 45 years ago is exactly where we live right now as Nigerians.\nOn Tuesday, August 25, 2021, “bandits”, or “terrorists” or “unknown gunmen”, visited the heart of our defence and defence structure.\nThat was the day armed men stormed our Nigeria Defence Academy, (NDA), killed two middle-level officers and abducted one."
  },
  {
    "headline": "Teacher from hell: How he allegedly infected 14 pupils with HIV/AIDS in Niger",
    "summarized_story": "Teacher from hell: How he allegedly infected 14 pupils with HIV/AIDS in NigerTeacher from hell: How he allegedly infected 14 pupils with HIV/AIDS in NigerA Grade Two Teacher with the Central Primary School, Karabonde in Borgu Local Government Area of Niger State, Usman Galadima, suspected to have defiled 14 pupils of the school and infected them with HIV/AIDS virus is now in the Police net.\nBesides being under arrest and being interrogated by the state police command, Niger State Government has also constituted a committee to also investigate the allegation levelled against him.\nThe committee is headed by the state Commissioner for Education, Hajiya Hanatu Jibrin Salihu.\nOther members of the committee include Director of Child Rights Protection Agency, the state Commissioner for Women Affairs, State Universal Basic Education, SUBEB, Board among others.\nVanguard gathered that the State Universal Basic Education Board, SUBEB, has already suspended the suspect from work pending the outcome of the investigations by both the Police and state government."
  },
  {
    "headline": "Teacher from hell: How he allegedly infected 14 pupils with HIV/AIDS in Niger",
    "summarized_story": "Teacher from hell: How he allegedly infected 14 pupils with HIV/AIDS in NigerTeacher from hell: How he allegedly infected 14 pupils with HIV/AIDS in NigerA Grade Two Teacher with the Central Primary School, Karabonde in Borgu Local Government Area of Niger State, Usman Galadima, suspected to have defiled 14 pupils of the school and infected them with HIV/AIDS virus is now in the Police net.\nBesides being under arrest and being interrogated by the state police command, Niger State Government has also constituted a committee to also investigate the allegation levelled against him.\nThe committee is headed by the state Commissioner for Education, Hajiya Hanatu Jibrin Salihu.\nOther members of the committee include Director of Child Rights Protection Agency, the state Commissioner for Women Affairs, State Universal Basic Education, SUBEB, Board among others.\nVanguard gathered that the State Universal Basic Education Board, SUBEB, has already suspended the suspect from work pending the outcome of the investigations by both the Police and state government."
  },
  {
    "headline": "Germany's ambassador to China Jan Hecker dies 2 weeks on the job",
    "summarized_story": "By dpa/NANGermany’s new ambassador to China, Jan Hecker, has died shortly after taking up his post, the Foreign Office confirmed Monday.\n“It is with deep sadness and consternation that we heard of the sudden death of the German ambassador to China, Prof., Dr Jan Hecker.\n“At this moment, our thoughts are with his family and the people who were close to him,’’ the Foreign Office said in a statement.\nA native of the northern port city of Kiel, Hecker trained as a lawyer and had worked as an attorney and a judge.\nHecker was a university lecturer before becoming a foreign policy advisor to Chancellor Angela Merkel ahead of his appointment as ambassador."
  },
  {
    "headline": "Super Eagles land in Cape Verde",
    "summarized_story": "The Super Eagles have landed in Cape Verde for their Tuesday world cup qualifiers game against the Blue Sharks of Cape Verde.\nIn a statement on the Super Eagles verified page, the team landed at the Amilcar Cabral International Airport on Monday morning as they couldn’t land in Sao Vincente where the match will be played.\nThe statement noted that the team will take off fom Amilcar Cabral in an hour flight to where the match will be played.\nThe Nigerian Football Federation also stated that only 21 players traveled after the departure of UK-based players who returned to base.\nCape Verde is on the list."
  },
  {
    "headline": "JUST IN: Anti-Grazing laws, satanic agenda against our livelihood – Miyetti Allah",
    "summarized_story": "Fulani Sociocultural Association, Miyetti Allah Kautal Hore, has described Anti-Grazing laws being passed by some Southern state governments, as a satanic agenda out to destroy their source of livelihood, warning that it poses potential threat to the corporate existence of the country.\nNational Secretary Miyetti Allah Kautal Hore, Engr.\nHe said: “This is the clear case of current rush to create negative laws against our cultural heritage.\nAnti-grazing laws and policies and attempts to ban open grazing are nothing but populist and corruption driven agenda designed by visionless, inept and desperate politicians to destroy pastoralists means of livelihood.\n“These oppressive laws and hostile policies being enacted by state governors are fundamentally going against Fulani pastoralists culture, economic interest and constitutional rights….”"
  },
  {
    "headline": "Suspected Bandits Kidnap Wife, Children Of Katsina Lawmaker, Kurami",
    "summarized_story": "Dr. Ibrahim Kurami, a lawmaker in the Katsina State House of Assembly who represents Bakori Constituency, had his wife and two children abducted by suspected bandits in the late hours of Saturday.\nWhen the bandits who invaded the politician’s Kurami residence in Bakori Local Government Area discovered that the lawmaker was nowhere to be found, they settled for his wife and children, according to a trustworthy source.\nAccording to the source, the bandits shot the security officers they encountered at the entrance before abducting the lawmaker’s family and transporting them to an unknown location.\n“On Saturday night, about 11 pm, many bandits entered our village, Kurami and threw people into commotion as they began to shoot their guns.\n“The bandits entered the house of our lawmaker, Dr. Ibrahim Kurami, to kidnap him but when they could not find him, they took his wife and two children instead."
  },
  {
    "headline": "NCDC Confirms 459 COVID-19 New Cases, 30 Deaths",
    "summarized_story": "According to the Nigeria Centre for Disease Control, 459 new cases of COVID-19 have been reported in the country in the last 24 hours, including 30 deaths (NCDC).\nNigeria’s COVID-19 caseload now stands at 195,511.\nAccording to the NCDC, Lagos has 185 new cases, Abia and Oyo have 38, Akwa Ibom and Cross River have 33, Osun has 24, Ekiti has 23, Benue has 15, Kwara has 14, and Kano has 12.\nDelta and the FCT each had ten new cases, while Edo, Kaduna, Ogun, Katsina, Nasarawa, and Rivers each had two.\nThere have been 184,529 treated cases released, with a total of 2,552 deaths."
  },
  {
    "headline": "Tinubu’s Group Tells Court To Sack Buni s APC caretaker chairman",
    "summarized_story": "Ekiti State All Progressives Congress members loyal to former Lagos State Governor Bola Tinubu have urged the court to sack Governor Mai Mala Buni as Chairman, Caretaker Committee of the party.\nThe members, under the aegis of South West Agenda for Asiwaju 2023, a group rooting for Tinubu’s rumoured presidential bid, also urged the court to nullify all actions taken by Buni as APC Caretaker Committee Chairman and as well annul the July 31 ward congresses of the party in Ekiti State.\nAmong others, the applicants are seeking from the court “a declaration that the 2nd defendant (Buni) cannot hold the position of Chairman, Caretaker Extraordinary Convention Committee of the 1st defendant (APC) as such appointment/role is a constitutional violation of Section 187 of the 1999 Constitution as amended and Article 8 of the 1st defendant’s constitution.\n“A declaration that all committee/Ward congress committees set up by the 3rd defendant pursuant to the Ward Congress of 31st July 2021 was unconstitutional, illegal, null and void and in total violation of the guidelines of the 1st defendant on conduct of the congress”.\nThe SWAGA members also sought “a declaration that no congress was held in Ekiti-State chapter of the 1st defendant as no result has been declared in respect of the congress as at the date of filing this case”."
  },
  {
    "headline": "Breaking: Super Eagles land in Cape Verde ahead Blue Sharks 2022 FIFA World Cup qualifying clash (VIDEO)",
    "summarized_story": "Nigeria Super Eagles have landed in Amilcar Cabral International airport, Cabo Verde, ahead of second group stage FIFA World Cup qualification match against the Blue Sharks of Cape Verde.\nThe three-time African champions arrived Cape Verde via a chartered Air Peace Airline on Monday morning.\nThe World Cup qualifier match between Nigeria and Cape Verde will be played behind closed doors.\nAccording to report, the Cape Verdean Football Federation FCF received a communication from CAF, stating that they would have to face the Super Eagles of Nigeria without fans in their second group stage game in the World Cup qualifiers.\nUp to eight Nigerian players plying their trade in England will not be part of the encounter after their country of residence flagged Cape Verde on the COVID-19 red list."
  },
  {
    "headline": "Fresh cholera outbreak kills 150 in Katsina, 5,677 cases so far reported – PHCDA",
    "summarized_story": "Not less than 150 people have lost their lives in a fresh cholera outbreak in Katsina state, Executive Secretary of the State Primary Health Care Development Agency (PHCDA), Shamsudeen Yahaya, has said.\nHe said at least 5,677 cases have been reported since the outbreak of the epidemic in the state.\n“Just like it is happening in some parts of the country, we still have cholera cases in Katsina State.\n“As at Thursday, September 2, we had 5,677 cases of cholera covering the 34 local government areas of the state.\n“When people engage in indiscriminate dumping of refuse, indiscriminate open defecation, there must be a spread of diseases like cholera,” he added."
  },
  {
    "headline": "NEF to Masari, El-Rufai, Matawalle, Sani Bello: Your security measures lockdown on the North",
    "summarized_story": "As part of efforts at tackling banditry and related criminals in the North, some northern state governors, including Mohammed Bello Matawalle of Zamfara, Katsina state Governor Aminu Bello Masari, Kaduna state Governor Nasir el-Rufai and their Niger state counterpart, Abubakar Sani Bello announced certain measures.\n“30 boarding junior secondary schools out of the 34 schools in the state have been de-boarded with effect from September 6, 2021.\n“From now henceforth, all the 30 government junior secondary schools are now day schools.\n“The remaining four that are not affected are Government Girls Junior Secondary School, Yola, General Murtala Mohammed College, Yola, Special School, Jada and Special School, Mubi.\nHe directed that affected students would be distributed to the nearest public junior secondary schools."
  },
  {
    "headline": "JAMB withdraws 2021 UTME result of 19year-old candidate over forgery – NigPilot",
    "summarized_story": "The 19 year old candidate who claimed that JAMB has been altering his results since 2019 was also handed over to Nigeria Police for investigation.\nOloyede accused the candidate of result tempering, adding that he will be handed over to the police for investigation and subsequently prosecuted.\nBecause this boy has accused JAMB, we are going to withhold his result until the investigation is concluded.\nEarlier, John had said: The result I have been receiving is not the result I am entitled to.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Abuja Police arrest 2 adolescent kidnappers – Nigpilot",
    "summarized_story": "Federal Capital Territory FCT Police Command Abuja has arrested two adolescent kidnappers operating along Kwali area Council of the City.\nPublic Relations Officer of the Command in a statement on Thursday in Abuja, said the Command arrested one Musa Mukailu 18 years and one Damina Wali 17 years all male suspected to be kidnappers along Kwali axis of the FCT.\nAdding that they met their waterloo while trying to kidnap two women along kwali axis of the FCT.\nEffort is in place to arrest other members of the syndicate.”Stressing that the Command pledges its undeterred resolve to ensure lives and properties of residents within the FCT are protected.\nAnd urged the FCT residents to report all suspicious movements,"
  },
  {
    "headline": "Buhari has recovered about N1trn stolen funds, assets since 2015 – APC group – NigPilot",
    "summarized_story": "As part of its anti-corruption drive, the administration of President Muhammadu Buhari has recovered about a trillion Naira worth of stolen funds and assets since assuming office in 2015, Nigerian Pilot has gathered.\nThis is according to APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress, APC.\nThe group noted that under President Buhari’s watch the Federal Government has prioritized the recovery and return of stolen assets belonging to the Nigerian people.\nLukman, APC-LAC said all final forfeitures are being deployed for use in the Government’s special Infrastructure and Social Investment Programmes, or put into the annual Budget.\nIt added that the most recent Abacha and Ibori Loots were transferred to the Nigeria Sovereign Investment Authority (NSIA), for transparent management under the Presidential Infrastructure Development Fund (PIDF)."
  },
  {
    "headline": "We Will Withdraw Court Case If You Go Back To Work, FG Tells Striking Doctors",
    "summarized_story": "The Federal Government is ready to withdraw the case instituted against the National Association of Resident Doctors (NARD) if striking doctors return to work.\nDespite a series of meetings between the Federal Government and the striking doctors, no resolution has been reached.\nWhile the Federal Government insists that the demands of the doctors have been met, the doctors insist otherwise.\nThe Minister of Labour and Employment, Chris Ngige, had in the wake of the disagreements threatened to invoke the “no-work, no pay” rule on NARD.\nBut the NMA has thrown its weight behind the striking doctors and other health workers."
  },
  {
    "headline": "FG Condemns ‘Coup’ In Guinea",
    "summarized_story": "The Nigerian Government has condemned what it describes as an apparent coup d’état in the Republic of Guinea.\nAccording to the statement, the takeover of power by the military is in clear violation of the ECOWAS Protocol on Democracy and Good Governance.\nAnother video sent to AFP showed a rumpled-looking President Conde sitting on a sofa, surrounded by troops.\n“I am personally following the situation in Guinea very closely,” he said in a social media post.\n“I strongly condemn any takeover of the government by force of the gun and call for the immediate release of President Alpha Conde.”"
  },
  {
    "headline": "‘We Are Starving Here,’ Nigerians In UAE Lament Work Permit Restrictions",
    "summarized_story": "It’s been a tough period for many Nigerians living in the United Arab Emirates (UAE), especially those in Dubai, as they lament the loss of jobs and difficulty in obtaining a work permit.\nOfficials at the Nigerian Embassy in the UAE say they are doing everything in their power to resolve the issue, but the question the victims are asking is for how long?\n766 of 2015, a worker whose employment is terminated due to contract expiration can get a new work permit whenever he/she wishes to join new employment.\nThe law also allows an employee to get a new work permit for all limited and non-limited contracts if it is determined that the employer has failed to meet the legal and contractual obligations, among other conditions.\n“From what I believe as an official position from the UAE, the UAE is a very welcoming country."
  },
  {
    "headline": "Gunmen Kidnap Wife, Children Of Katsina Lawmaker",
    "summarized_story": "Bandits have reportedly kidnapped the wife and two children of the lawmaker representing Bakori Constituency in the Katsina State House of Assembly, Dr. Ibrahim Kurami.\nThe bandits, according to a resident, stormed the country house of the lawmaker located at Kurami village in Bakori Local Government of Area of the state at about 9:00 pm on Saturday after the Muslim night prayers.\nThe resident who pleaded anonymity, explained that on arrival, the hoodlums first shot at a member of the First Aid Group of Islam who they met at the entrance.\nThe victim who sustained injuries from the gunshots was later rushed to a medical facility for treatment.\nAt the time of the incident, the lawmaker was away, participating in the All Progressives Congress (APC) Local Government Congress in his council."
  },
  {
    "headline": "Guinea Awaits Future After Coup Leaders Demand Talks",
    "summarized_story": "The West African state of Guinea awaited word on its future on Monday as a new military junta summoned the outgoing cabinet a day after toppling the president.\nImpoverished and volatile, the West African state was hit by fresh turmoil on Sunday when special forces arrested 83-year-old President Alpha Conde, declared they were scrapping the constitution and imposed a curfew.\nLand borders have been shut, the government dissolved and top governors and other senior administrators have been replaced by the military, the junta said.\nInternational condemnationOutside Guinea, international leaders condemned the latest bout of turmoil in West Africa, a region where many countries are struggling with poverty, inequality and jihadist bloodshed.\nThe Economic Community of West African States (ECOWAS), through its acting president, Ghana’s leader Nana Akufo-Addo, threatened sanctions if Guinea’s constitutional order was not restored."
  },
  {
    "headline": "Ataga's murder: Lagos DPP to charge Chidinma Ojukwu, two others -",
    "summarized_story": "A Yaba Chief Magistrates’ Court in Lagos State has adjourned to sept 29, further hearing in the murder of Usifo Ataga, the Chief Executive Officer of Super TV.\na 21-year-old student, Chidinma Ojukwu and one Adedapo Quadri were again presented.\nbefore the Chief Magistrate, Adeola Adedayo on Monday after they were ordered to be remanded for thirty days at the Kirikiri Correctional Centre last month.\nThe four persons are Babalola Disu, Olowu Ifeoluwa, Olutayo Abayomi, Nkechi Mogbo, Ojukwu Onoh, who is said to be Chidinmas adopted father.\nOne Egbuchu Chioma who was allegedly found in possession of the deceased’s iPhone 7, and who had initially refused to release the phone on demand, is however to continue her trial."
  },
  {
    "headline": "FG approves establishment of 109 farm estates in Nigeria",
    "summarized_story": "The President Muhammadu Buhari administration has approved the setting up of integrated farm estates in all the senatorial districts across the country.\nHe said the land provided for the project would enable the youth to leave the unemployment market and help the country to achieve food security within a short time.\nIkonne added that the President is committed to and working towards ensuring that the country achieved food security.\nHe wants to see that we achieve food security in the country, and NALDA is purely under the supervision of Mr. President.\nIkonne said Nigerians would live to remember the foundation President Buhari is laying to make the country achieve food sufficiency."
  },
  {
    "headline": "INEC declares supports for questioning of judges over conflicting orders -",
    "summarized_story": "The National Chairman of the Independent National Electoral Commission, Professor Mahmoud Yakubu says the commission is in support of the move by the Chief Justice of Nigeria, questioning six judges on the conflicting orders from their courts.\nMr Mahmoud said this at INEC quarterly meeting with political parties in Abuja.\nWith the benefit of technology, the commission has been providing detailed information on the cumulative distribution of registered voters by age, occupation, gender and disability on weekly basis.\nSpeaking further at the event, Professor Mahmoud said: “we hope leaders of political parties will use the information in articulating your manifestos and planning your campaigns to target the concerns of specific categories of citizens.\n“For instance, in terms of age, young Nigerians between the ages of 18 and 34 constitute 65% of new registrants and 72% of completed registrations so far."
  },
  {
    "headline": "We will continue to balance appointments between Christians and Muslims",
    "summarized_story": "Governor of Oyo State, Seyi Makinde, has stated that his administration will continue to balance political appointments in the state between Christians and Muslims.\nThe governor stated this at the 1443/2021 Hijrah Luncheon held in Ibadan, the Oyo state capital.\n“I will continue to balance appointments between the Christians and Muslim faithful.\n“I have reappointed seven commissioners and, for the remaining 10 commissioners, you can rest, assured that it will be a balanced appointment, Governor Seyi Makinde emphasized.\nIf you see anything better that what we are doing in Oyo State, let me know and I will ensure I adjust”."
  },
  {
    "headline": "President of Southeastern Extraction Will Bring Unity to Nigeria: Ex-Enugu Governor Nwodo",
    "summarized_story": "A former governor of Nigeria’s southeastern Enugu state Okwesilieze Nwodo says a president of the southeastern extraction in 2023 will bring unity to the country.\nDr Nwodo featured as a guest on ARISE News on Monday and says the southeasterners live in every part of the country and will develop it as they would have developed their home.\nAccording to the former governor, the Igbos are the cement that holds Nigeria together.\nHe notes that actions taken by a southeastern President to marginalise any part of the country is putting the lives of his people on the line as they are located in every part of the country.\nHe reels out other reasons why Nigeria is ripe for a southeastern President in 2023."
  },
  {
    "headline": "Confident Super Eagles Land in Cape Verde for Qatar 2022 Qualifier",
    "summarized_story": "The Super Eagles’ contingent for Tuesday’s FIFA World Cup Qatar 2022 qualifying tango with the Blue Sharks of Cape Verde landed on the island of Mindelo on Monday morning, after a four-hour flight from Lagos aboard a special jet of Air Peace airline.\nRussia –based Chidera Ejuke, Italy –based former junior international Kingsley Michael and new face Innocent Bonke from Sweden are all available.\nThree points will consolidate Nigeria’s leadership of Group C, confirmed after the victory over Liberia that followed the draw between Cape Verde and Central African Republic in Douala.\nA win will guarantee Nigeria a minimum three points ahead of any other team in the pool, even if Liberia’s Lone Star are victorious against Central African Republic in Monrovia.\nA win will also brighten the path of the three –time African champions to the knockout final round, given that home-and-away fixture against the Central African Republic is what is on the plate in October."
  },
  {
    "headline": "Tunisia Retains African Basketball Crown After Defeating Ivory Coast",
    "summarized_story": "Tunisia defeated Ivory Coast 78-75 at Kigali Arena in the Rwandan capital on Sunday to retain the AfroBasket continental title they won on home soil four years ago.\nSalah Mejri led the winners with a game-high 22 points, backed by 18 from Michael Roll and 10 from Omar Abada.\nTheir long wait for an AfroBasket title continues – their last was back in 1985.\nThe Lions pulled away after that to secure third place in the tournament, equalling their performance from four years ago.\n18 points from Walter Tavares and 17 from Joel Almeida were the highlights for Cape Verde."
  },
  {
    "headline": "Nigeria: Why Opposition PDP May Lose All Southern States if It Zones Presidency to North",
    "summarized_story": "The party might, however, lose states like Taraba, Benue and be unable to win back Plateau, if it decided to zone the presidency to the north.\nAccording to the THISDAY EIG survey, “If the PDP zones the Presidency to the North, they are likely to lose all their current Southern states, essentially, because of the mood in the South that Nigeria’s Presidency should rotate between the North and the South.\nHowever, Obaseki, although a PDP governor, the survey showed, is a firm believer in the southern presidency.\nAccording to the survey, the factors in each of the critical southern states, with seeming PDP influence, painted scenarios peculiar to them.\nWith federal support, they would dislodge the PDP in Delta and sweep Okowa away, should the PDP present a northern president."
  },
  {
    "headline": "Voting APC Was Nigeria’s Biggest Mistake: Former VP Atiku",
    "summarized_story": "Former Vice President Atiku Abubakar says the victory of the All Progressives Congress (APC) in the 2015 general election was Nigeria’s biggest mistake.\nAtiku stated this on Saturday in Yola at an event, where prominent APC stalwarts defected to the Peoples Democratic Party (PDP).\nAtiku also alleged that PDP lost in 2019 because APC perpetrated massive fraud at the polls.\nAdamawa State Governor Ahmadu Fintiri described Atiku as the messiah the country had been waiting for.\n3, Bishop Fagun Road, Alagbaka, Akure, Ondo State, Atiku gave signs that he might give the presidency another shot in 2023."
  }
]