[
  {
    "headline": "With low sperm count, pregnancy is still possible – Urologist",
    "summarized_story": "Consultant Urologist at Ogah Hospital and Urology Centre, Fugar, Edo State, Dr. Gabriel Ogah, has said men with a sperm count of an average of 4 million sperm count can still impregnate their wives.\nAccording to the urologist, there may be no such thing as normal sperm count as research has found that men who had an average of three or four million sperm count were able to impregnate their wives.\nMedical News Today, an online health portal noted that sperm count refers to the average number of sperm present in one sample of semen.\nMayo Clinic, another site, noted that normal sperm “densities range from 15 million to greater than 200 million sperm per millilitre of semen.”It added, “You are considered to have a low sperm count if you have fewer than 15 million sperm per millilitre or less than 39 million sperm total per ejaculate.\n“Nobody knows what a normal sperm count is."
  },
  {
    "headline": "With low sperm count, pregnancy is still possible – Urologist",
    "summarized_story": "Consultant Urologist at Ogah Hospital and Urology Centre, Fugar, Edo State, Dr. Gabriel Ogah, has said men with a sperm count of an average of 4 million sperm count can still impregnate their wives.\nAccording to the urologist, there may be no such thing as normal sperm count as research has found that men who had an average of three or four million sperm count were able to impregnate their wives.\nMedical News Today, an online health portal noted that sperm count refers to the average number of sperm present in one sample of semen.\nMayo Clinic, another site, noted that normal sperm “densities range from 15 million to greater than 200 million sperm per millilitre of semen.”It added, “You are considered to have a low sperm count if you have fewer than 15 million sperm per millilitre or less than 39 million sperm total per ejaculate.\n“Nobody knows what a normal sperm count is."
  },
  {
    "headline": "Experts call on FG to bridge adult vaccination gaps",
    "summarized_story": "According to experts, pneumococcal diseases are bacterial infections caused by ‘Streptococcus pneumoniae’ and can affect the lungs and other parts of the body.\nProf. Adeyeye noted that pneumococcal diseases are public health concerns globally and a leading cause of morbidity and mortality.\nProf. Adeyeye said that a significant proportion of mortality from pneumococcal disease occurs among the elderly, especially those with co-morbidities, stressing that preventive measures through pneumococcal vaccination in adults should be intensified.\n“By getting vaccinated, a lot of people can help protect themselves from much of this unnecessary suffering.”Dr. Osiogbu, listed some adult vaccines to include Hepatitis A and B vaccines, Tetanus vaccine, Meningitis vaccine, Pneumococcal vaccine, Human Papillomavirus Vaccine, among others.\nShe appealed to the three levels of government to evolve strategies that would bridge adult vaccination gaps by resolving issues of vaccine affordability to encourage more adults to get vaccinated."
  },
  {
    "headline": "Experts call on FG to bridge adult vaccination gaps",
    "summarized_story": "According to experts, pneumococcal diseases are bacterial infections caused by ‘Streptococcus pneumoniae’ and can affect the lungs and other parts of the body.\nProf. Adeyeye noted that pneumococcal diseases are public health concerns globally and a leading cause of morbidity and mortality.\nProf. Adeyeye said that a significant proportion of mortality from pneumococcal disease occurs among the elderly, especially those with co-morbidities, stressing that preventive measures through pneumococcal vaccination in adults should be intensified.\n“By getting vaccinated, a lot of people can help protect themselves from much of this unnecessary suffering.”Dr. Osiogbu, listed some adult vaccines to include Hepatitis A and B vaccines, Tetanus vaccine, Meningitis vaccine, Pneumococcal vaccine, Human Papillomavirus Vaccine, among others.\nShe appealed to the three levels of government to evolve strategies that would bridge adult vaccination gaps by resolving issues of vaccine affordability to encourage more adults to get vaccinated."
  },
  {
    "headline": "Delta Marine School to be upgraded soon – Okowa",
    "summarized_story": "Delta Governor, Sen. Ifeanyi Okowa, on Thursday, said the School of Marine Technology, Burutu, would soon be upgraded by the state government.\nWhile saying that a substantive Provost would soon be appointed for the institution, Governor Okowa assured the people that the state government was mobilising action for work on the permanent site of the school.\nThat is a first step to upgrade the institution and we are committed about the school.\nVery soon, a substantive Provost will be appointed for the school,” he added.\n“Our leaders agreed and l must thank them and the people of Burutu for allowing him to be the local government chairman."
  },
  {
    "headline": "CSOs express anger over 1,545 Nigerians killed, 1,321 abducted Q1",
    "summarized_story": "By Gabriel Ewepu, AbujaAs Nigerians live at the mercy of terrorist groups, some Civil Society Organisations, CSOs — Community of Practice Against Mass Atrocities, and the Joint Action Civil Society Committee — on the auspices of Nigeria Mourns, Thursday, expressed anger over 1, 545 Nigerians killed and 1,321 Nigerians abducted by terrorist groups between January 1 and March 30.\nMeanwhile, the statement called on Federal Government to account for those rescued, missing, killed in the Abuja-Kaduna train bombing, and take immediate action to rescue the abducted.\n“Between January 1, and March 30, about 1,545 persons were killed, and at least 1,321 persons abducted by terrorists.\n“We are alarmed by the brazenness with which these ‘technically defeated terrorists’ continue to compromise our individual and collective security as Nigerians.\n“On this national occasion, our players did not wear black armbands in solidarity and were more concerned with filling the stadium with fans.”Vanguard News"
  },
  {
    "headline": "soludo appoints Anaeto as Principal Secretary",
    "summarized_story": "Mr. JPC Anaeto, a lawyer has been appointed Principal Secretary to the Executive Governor of Anambra State,Prof C.C.Soludo.\nHe hails from Aguluuzigbo in Anaocha local government area of Anambra State.\nDetails later."
  },
  {
    "headline": "Lekki-Ikoyi Link Bridge: Residents reject resumption of tolling",
    "summarized_story": "Residents of the Lekki area of the Lagos metropolis, under aegis of Lekki Estates Residents and Stakeholders Association (LERSA), have called on Governor Babajide Sanwo-Olu to halt the proposed resumption of toll collection on the Lekki-Ikoyi Link Bridge.\nThe Lekki Concession Company (LCC) had announced that the Lekki-Ikoyi Link Bridge Toll Plaza will resume today, 18 months after it was suspendedThe call was made to the governor in a letter titled “Position of Lekki Residents on the planned Re-introduction of Tolling”.\nIn the letter, LERSA questioned why tolling should resume on the 1.5km bridge in view of the harsh economic situation in the country.\n“Your excellency, graciously permit us to exemplify our fears as follows: For a couple living off Freedom Way, Lekki 1, husband working in Obalende and wife working on Osborne Road, Ikoyi.\nWe, therefore, do not understand why Lekki people must be the people to pay construction debts through tolling."
  },
  {
    "headline": "Buhari names Afunanya as NBC board member",
    "summarized_story": "Soni Daniel, AbujaPresident Muhammadu Buhari has approved the appointment of Peter Afunanya, the Spokesman for the Department of State Services as a member of the National Broadcasting Commission, NBC.\nAfunanya is to represent the Department of State Services, DSS on the NBC board along with other members who were inaugurated today by the Minister of Information, Lai Mohammed.\nAfunanya attended courses in Innovation and Strategy at Harvard University, Security Coordination and Management in London amongst other local and international training programmes.\nHe is a member of the Nigerian Institute of Chartered Arbitrators, the National Institute of Public Relations (NIPR), the Nigerian Institute of Management (NIM); the Society for Peace Scholars and Practice (SPSP); the American Society for Industrial Security (ASIS) and the Nigerian Institute for Industrial Security (NIIS).\nHe is also a member of the Nigerian Red Cross (NRC), a Fellow of the Institute of Corporate Administration (ICA) and a Fellow of the Security Institute (fsi)."
  },
  {
    "headline": "Buhari appoints new National Institute for Labour Studies board members",
    "summarized_story": "President Muhammadu Buhari has approved the reconstitution of the Board of National Institute for Labour Studies.\nThe appointees are Sam Okpako Onokohwomo (Kowho) (Chairman); Brigadier General Umar Gital Yusuf (Member), representing Nigerian Army; Omoabie Udeme Akpan (Member), representing the Ministry of Labour and Employment.\nOthers are CP Falaye Olaleye (Member), representing Nigeria Police Force; Amb Obinna Chukwuemeka Agbugba (Member), representing Ministry of Foreign Affairs; Mr. Umaru Ahmadu (Member), representing Service Strategy and Policy Office.\nComrade Salamatu Aliyu (Member), represents the Nigeria Labour Congress; Comrade Babatunde Goke Olatunji (Member), representing the Nigeria Labour Congress; Femi Mokikan (Member), representing the Nigeria Employers’ Consultative Association.\nOthers: Adeniyi Ologun (Member), representing the Nigeria Employers’ Consultative Association; Comrade Nasir Fagge (Member), representing Nigerian Universities, Comrade Issa Aremu (Member), the Director of National Institute for Labour Studies."
  },
  {
    "headline": "Kaduna killings: Buhari is Nigeria’s problem – Aisha Yesufu",
    "summarized_story": "Popular sociopolitical activist, Aisha Yesufu, has categorically told Nigerians that President Muhammadu Buhari is the reason the military have not been able to defeat the terrorists killing Nigerians across the country.\nWithin the last 72 hours, there have been several attacks, kidnappings and killing of innocent citizens in Kaduna and other states in the Northwest.\nThe terrorists shot many passengers dead as unascertained number of the passengers also sustained various degrees of injury as a result of gun shots.\nJust yesterday night, armed men stormed Kofar Gayan low-cost, Zaria, Kaduna, Kidnapped a customs officer, Muawiyya Gambo Turaki and nine others.\nAisha Yesufu believes that the “military can defeat the terrorists terrorising our people,” she tweeted."
  },
  {
    "headline": "Maryam Abacha has transformed many lives – Buhari",
    "summarized_story": "President Muhammadu Buhari has greeted the wife of former Head of State, Mrs Maryam Abacha on her 75th birthday.\nThe leader congratulated the former President of Nigeria Army Officers Wives’ Association (NAOWA), 1985-1990 on the milestone.\nA statement Thursday night by presidential spokesman Garba Shehu noted the warmth, large-hearted and charitable works of the matriarch of the Abacha family.\nBuhari affirmed that her initiative and leadership “transformed many lives across the country, particularly wives of military officers, girl-child, rural women and children”.\nThe President also commended Maryam for inspiring the African First Ladies Peace Mission, Poverty Alleviation Programme, National Programme on Immunisation, Family Support Programme, Family Support Basic Education Programme and Family Economic Advancement Programme."
  },
  {
    "headline": "You have just few days more to do your SIM-NIM linkage – FG warns Nigerians",
    "summarized_story": "In preparation for the enforcement, the Honourable Minister of Communications and Digital Economy, Isa Ali Pantami has urged citizens and legal residents to use the next few days to ensure that they complete the linkage of their SIM and NIM.\nThis follows the expiration of the approved extension of the NIN-SIM linkage on the 31st of March, 2022To this end, the Honourable Minister has further directed that the National Identity Management Commission (NIMC) should offer enrolment services round-the-clock for the next few days.\nPantami also thanked all those who have completed their NIN-SIM linkage.\nOn behalf of the Honourable Minister, the Executive Vice Chairman of NCC, Prof. Umar Garba Danbatta, and the Director-General/CEO of NIMC, Engr.\nAliyu Aziz, urged citizens and legal residents to take advantage of the window to complete the process of enrolment and verification within the next few days."
  },
  {
    "headline": "US begins construction of world’s largest consulate in Lagos, stresses Nigeria’s importance",
    "summarized_story": "The United States has again reiterated commitment to strengthen its relationship with Nigeria.\nThe American government noted this at the groundbreaking ceremony for construction of a new Consulate General in Lagos.\nAbout $95million will be invested in local economy and generate jobs for 2,500 Nigerians including engineers, architects, artisans, construction workers, and administrative staff.\nIn her remarks, Leonard expressed appreciation to the Government of Nigeria and the Lagos State Government for their support.\nOn completion, the building will be the largest United States consulate in the world."
  },
  {
    "headline": "DIG Kokumo takes over as FCID boss",
    "summarized_story": "The Inspector-General of Police (IGP) Usman Baba has ordered the posting of Deputy Inspector of Police (DIG) Johnson Kokumo to the Force Criminal Investigations Department (FCID) as the new Deputy Inspector-General of Police in charge of the Department.\nAccording to a statement by the Acting Force Public Relations Officer, CSP Olumuyiwa Adejobi: “Kokumo, was appointed to the Nigeria Police Force as a Cadet Assistant Superintendent of Police in 1988.\n“He holds a Bachelor’s Degree in Sociology from the University of Maiduguri, Borno State, and a Master’s Degree in Sociology with a specialty in Criminology from the University of Lagos.\n“He was equally a member of Senior Executive Course 41, 2019, National Institute for Policy and Strategic Studies (NIPSS), Kuru, Jos, Plateau State.\nUntil his recent posting, he was the DIG in charge of the Department of Research and Planning, Force Headquarters, Abuja."
  },
  {
    "headline": "2023: Saraki, Tambuwal, Bala Mohammed meet IBB in Minna",
    "summarized_story": "Former Senate President Bukola Saraki, Sokoto Governor, Aminu Tambuwal and his Bauchi counterpart Bala Mohammed have taken their consultation over 2023 to former Military President, General Ibrahim Badamosi Babangida in Minna, Niger State.\nBabangida applauded them for their efforts in trying to find a credible consensus candidate for the the Peoples Democratic Party (PDP) in the 2023 general elections.\nHe said that their consultations and compromises will make a better country.\n“Your belief in having a better Nigeria featured very prominently.\nWhat you talked about was Nigeria, Nigeria, Nigeria."
  },
  {
    "headline": "Police defuse explosive in Rigasa train community",
    "summarized_story": "Operatives of the Police Explosive Ordinance Department (EOD) have defused an Improvised Explosive Device (IED) in Rigasa, the Kaduna community where the Abuja-Kaduna train station is located.\nThe explosive device, according to sources in Rigasa, was found in a bucket along Makarfi road area of the community.\nAccording to him: “Yes there was an IED planted around Makarfi Road, Rigasa this morning.\nWe received a distress call and our officers from the EOD were deployed to the scene.\n“On getting to the scene, they identified the device as Improvised Explosive Device (IED) and they successfully defused the device without causing harm to anyone.”Normalcy has however returned to the area as of the time of filing this report."
  },
  {
    "headline": "Soldier ‘abandoned’ during operation coward – Army",
    "summarized_story": "The Nigerian Army has accused the soldier purportedly abandoned by his colleagues in a viral video of cowardice.\nIt said it was the soldier who absconded during operation with his colleagues and not the other way round.\nThe Director Army Public Relations Brigadier General Onyema Nwachukwu, in a statement, noted the video was a misrepresentation of what transpired between the soldier and his colleagues.\nDisappointingly, during an encounter, the said soldier abandoned his colleagues and absconded in an outright display of cowardice and possible sabotage, which negate the precepts of the military profession.\n“The video footage is thus, in all intent, and purpose a misrepresentation of what actually transpired between the soldier and his colleagues."
  },
  {
    "headline": "BREAKING: N223b Lagos consulate will be world’s largest – US",
    "summarized_story": "The United States Government has said its new $537million (approx N223,257,750,000.00) in Lagos will be its largest consulate in the world when completed in 2027.\nAmbassador Mary Leonard and Lagos Governor Babajide Sanwo-Olu stated this at the Eko Atlantic City in Lagos during the ongoing groundbreaking ceremony for the consulate.\nThe 10-storey consular complex will, according to Ambassador Leonard, pump about $90milion into the Lagos and Nigerian economy.\nDetails Shortly…"
  },
  {
    "headline": "UK warns against travels to 7 northern states",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom (UK) has advised against travel to seven northern states.\nThe states listed by the United Kingdom included Borno, Yobe, Adamawa, Gombe, Kaduna, Katsina and Zamfara.\nForeign, Commonwealth and Development Office (FCDO) gave the warning in its travel advisory on northern Nigeria posted on its website.\n“FCDO advise against travel to Borno, Yobe, Adamawa, Gombe, Kaduna, Katsina, and Zamfara states.\nThere has been an increase in insurgent attacks in Borno State."
  },
  {
    "headline": "2023: Igbo leaders insist on producing Buhari’s successor",
    "summarized_story": "From Geoffrey Anyanwu, Jude Chinedu and Abasianam Philip, EnuguIgbo leaders, yesterday, restated their demand for the South East to produce the president of Nigeria in 2023.\n“The South East has suffered monumental marginalisation of the zone since after the civil war.\n“The South East leaders noted that Nigeria has a zoning and rotational culture for the presidency of Nigeria.\nThey charged citizens of the zone across all parties to work in unity to achieve the objective of a South East presidency in 2023.\nSenator Ben Obi said the main aim of presenting the South East case, was to passionately appeal to Nigerian citizens, to support their quest to produce the next Nigerian President in 2023."
  },
  {
    "headline": "2023: INEC to shutdown online pre-registration portal April",
    "summarized_story": "Independent National Electoral Commission (INEC), yesterday, it will shutdown the ongoing nationwide continuous voters’ registration (CVR) pre-registration online portal in April in preparation for the 2023 general election.\nINEC National Commissioner in charge of Information and Voter Education, Festus Okoye, disclosed this in an interview with newsmen in Lagos.\nOkoye said: “We are going to shutdown the online portal latest by April but the physical registration will be going on until June.\n“People have to collect PVCs and we have to give every registered political party the voters’ register that will be used for the 2023 general election.\nThe INEC commissioner said the commission had seven services on the online registration portal for eligible voters as against six in previous registrations.He added that the seventh allowed people to locate where their PVCs were domiciled."
  },
  {
    "headline": "Reps direct CAC, JAMB, others to remit N195bn to govt coffers",
    "summarized_story": "From Ndubuisi Orji, AbujaHouse of Representatives has directed the Corporate Affairs Commission (CAC), the Joint Admission Matriculation Board (JAMB), Stanbic IBTC and First Bank to N195.9 billion hanging funds to the government coffers.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe panel, on Wednesday, had said it has so far uncovered over N300 billion unclaimed fund lodged in different commercial banks in the country.\nWe have the balances that need to be transferred to the Federal Government, starting with CAC, they have N25 billion not remitted allowances.\nHouse spokesman, Benjamin Kalu, while briefing newsmen on the activities of the panel, said the committee will resume sitting on Tuesday."
  },
  {
    "headline": "Soludo’s heart bleeds as gunmen kill security man, burn Anambra LG hqtrs",
    "summarized_story": "Meanwhile, the state Governor, Prof. Chukwuma Soludo, has ordered security operatives in the state, particularly the police, to fish out the criminals and ensure they’re brought to book.\nAlso in Delta State, some security operatives have been attacked by gunmen.\nThe hoodlums were said to have laid ambush for the security operatives, including police officers and local vigilantes.\nThe incident occurred along the Issele-Azagba axis of the Benin-Asaba-Onitsha Highway, in Aniocha North Local Government Area of Delta State.\nHe said the local security operatives took cover during the attack, stressing that no death was recorded."
  },
  {
    "headline": "News in Photographs: Buhari Receives Nigerien President in State House",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Court Convicts 73-year-old Man for Falsification of Vehicle Documents in Kwara",
    "summarized_story": "Hammed Shittu in IlorinA Magistrate Court in Ilorin, the Kwara State capital, has convicted a 73-year-old trader, Bashir Alabi, for falsification of vehicle documents.\nAlabi was handed over to the police for investigation having confirmed by the Kwara State Internal Revenue Service (KW-IRS) Motor Licencing Authority (MLA) office at Pake, Ilorin, that vehicle documents presented for processing by him were fake.\nThe additional three suspects were nabbed by the Monitoring Unit of the state Police Command for having incriminating documents in their possession and for their involvement in the trade of printing and selling fake Kwara State vehicle documents.\nA further investigation by the police also established the recovery of forged state vehicle documents from the shop of one Jamiu, who is now at large.\nHaving established a case of forgery and conspiracy by the police, all suspects were arraigned before Chief Magistrate A.M Ibrahim."
  },
  {
    "headline": "Breaking: NFF Disengages Super Eagles’ Technical Crew",
    "summarized_story": "Following the failure of the Super Eagles of Nigeria to qualify for the 2022 FIFA World Cup, the erstwhile Technical Adviser, Augustine Eguavoen, has stepped down from that position with immediate effect.The NFF has in the meantime withdrawn the two-and-half years contract offered the coaches and terminated the appointment of the entire technical crew of the team with immediate effect.\nA new crew will be announced after a proper review to lead the new charge of reinvigorating the Super Eagles to face future challenges appropriately.“We thank the coaches and team officials for their service to the nation and wish them success in their future endeavours,” said NFF General Secretary, Dr Mohammed Sanusi.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Eguavoen Steps down as Eagles Coach",
    "summarized_story": "Olawale Ajimotokan in AbujaSuper Eagles coach Augustine Eguavoen has thrown in the towel as the National coach following the failure of the Eagles to qualify for the 2022 World Cup billed for Qatar.\nHe tendered his resignation on Thursday, following the shocking elimination of the Eagles by arch-rivals, Ghana in the final play off for the World Cup.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "N1.2trn Unclaimed Funds: House C’ttee Discovers N300bn in Banks, MDAs",
    "summarized_story": "He said the trapped funds were in dormant bank accounts in domestic and foreign currencies, accounts without Bank Verification Number (BVN), failed contracts, and excess unremitted funds.\nWe will not allow any government agency or commercial bank to undermine our power.\nThe documents are consistently the same.”Meanwhile, the House Committee on Public Accounts demanded evidence from MTN to justify N2.6 trillion capital allowances it collected from FIRS.\n“We are investigating tax evasion; tax evasion is possible through abuse of fiscal regulations.\n“It is expected of the Federal Ministry of Industry to have inspected the assets before they issue the certificates."
  },
  {
    "headline": "BREAKING: Lawless Nigeria Police Re-arrest Enslaved 21-year-old Woman, Glory Okolie Weeks After Release From Suleja Prison",
    "summarized_story": "The Nigerian police have arrested a 21-year-old woman, Glory Okolie who only got out of the Suleja correctional centre in Niger State last week after more than eight months of incarceration.\nSaharaReporters learnt that Okolie was arrested by the Imo State Police Command acting through the Divisional Police Officer of Shell Police Station.\nSaharaReporters on November 23, 2021, reported that a Federal High Court sitting in Abuja granted bail to Gloria Okolie in the sum of N150 million with two sureties.\nShe was later transferred to Abuja, despite efforts by her family members to secure her release.\nOkolie was later released on bail."
  },
  {
    "headline": "BREAKING: Lawless Nigeria Police Re-arrest Enslaved 21-year-old Woman, Glory Okolie Weeks After Release From Suleja Prison",
    "summarized_story": "The Nigerian police have arrested a 21-year-old woman, Glory Okolie who only got out of the Suleja correctional centre in Niger State last week after more than eight months of incarceration.\nSaharaReporters learnt that Okolie was arrested by the Imo State Police Command acting through the Divisional Police Officer of Shell Police Station.\nSaharaReporters on November 23, 2021, reported that a Federal High Court sitting in Abuja granted bail to Gloria Okolie in the sum of N150 million with two sureties.\nShe was later transferred to Abuja, despite efforts by her family members to secure her release.\nOkolie was later released on bail."
  },
  {
    "headline": "BREAKING: Two Confirmed Killed As Gunmen Unleash Horror In Ongoing Attack On Kaduna Community",
    "summarized_story": "At least two persons have been confirmed killed in an ongoing attack by gunmen in Ankwa Ward in the Kachia Local Government Area of Kaduna State.\nSaharaReporters gathered that the gunmen in large numbers are moving from house to house, killing and kidnapping residents without any hindrance.\nChairman of the council area, who confirmed the ongoing attack, Mr Peter Agite, called on residents to remain calm despite the onslaught.\n\"I am appealing to citizens and residents of Kachia Local Government Area, especially Ankwa Ward, to remain calm and law-abiding.\nThe latest attack comes three days after terrorists bombed a Kaduna-Abuja bound train, killing several passengers and kidnapping scores more."
  },
  {
    "headline": "BREAKING: Two Confirmed Killed As Gunmen Unleash Horror In Ongoing Attack On Kaduna Community",
    "summarized_story": "At least two persons have been confirmed killed in an ongoing attack by gunmen in Ankwa Ward in the Kachia Local Government Area of Kaduna State.\nSaharaReporters gathered that the gunmen in large numbers are moving from house to house, killing and kidnapping residents without any hindrance.\nChairman of the council area, who confirmed the ongoing attack, Mr Peter Agite, called on residents to remain calm despite the onslaught.\n\"I am appealing to citizens and residents of Kachia Local Government Area, especially Ankwa Ward, to remain calm and law-abiding.\nThe latest attack comes three days after terrorists bombed a Kaduna-Abuja bound train, killing several passengers and kidnapping scores more."
  },
  {
    "headline": "MTN, GLO, Other Telecoms Companies In Nigeria Threaten To Increase Tariffs",
    "summarized_story": "Amid the crisis rocking the industry, telecommunication operators, including Globacom, Airtel, MTN and others, have threatened to raise tariffs within seven days if the Nigerian government does not find a solution.\nThe position of the companies was made known by Gbenga Adebayo, the Chairman of the Association of Licensed Telecommunications Operators of Nigeria (ALTON), during a press briefing on Thursday.\nAccording to him, over 70 sites within Kogi State and environs have shut down causing members' inability to access and maintain them amid the disputes arising from taxes and levies demanded by the Kogi State Government through the Kogi State Internal Revenue Service (KIRS).\n“These are states sharing borders with Kogi State,” the ALTON’s chairman, who also doubles as the joint spokesman for all the telecom operators, said.\nWe hereby call on the Federal Executive Council to prevail on the FCDA in granting approval/permit to our members to deploy infrastructure."
  },
  {
    "headline": "Nigerian 'prince' bags 33-month jail term in US for fraud",
    "summarized_story": "Sobanke Adereti, a 24-year-old Nigerian, has been sentenced to 33 months in prison over passport falsification and bank fraud in the United States of America.\nHe was said to have pleaded guilty to passport fraud and attempted bank fraud on October 25, 2021.\nThe check was said to have been purchased by a fraud victim who was deceived into sending money to the Nigerian who had falsely identified himself as “Robinson Elijah”.\nInvestigators determined that Adereti was also connected to scams related to business email compromise fraud and other government program fraud,” the statement reads.\nIt is up to all of us to share this awareness and look out for our greatest generation,” Featherston said."
  },
  {
    "headline": "Nigerian 'prince' bags 33-month jail term in US for fraud",
    "summarized_story": "Sobanke Adereti, a 24-year-old Nigerian, has been sentenced to 33 months in prison over passport falsification and bank fraud in the United States of America.\nHe was said to have pleaded guilty to passport fraud and attempted bank fraud on October 25, 2021.\nThe check was said to have been purchased by a fraud victim who was deceived into sending money to the Nigerian who had falsely identified himself as “Robinson Elijah”.\nInvestigators determined that Adereti was also connected to scams related to business email compromise fraud and other government program fraud,” the statement reads.\nIt is up to all of us to share this awareness and look out for our greatest generation,” Featherston said."
  },
  {
    "headline": "FG extends NIN-SIM linkage deadline by a 'few days'",
    "summarized_story": "The federal government has extended the deadline for the ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise by “a few days”.\nIn a statement announcing the latest extension, Isa Pantami, minister of communications and digital economy, urged citizens and legal residents to use the next few days to ensure that they complete the linkage.\nTo this end, the minister further directed that the National Identity Management Commission (NIMC) should offer enrolment services round-the-clock for the next few days.\n“On behalf of the Honourable Minister, the Executive Vice Chairman of NCC, Prof. Umar Garba Danbatta, and the Director-General/CEO of NIMC, Engr.\nAdvertisementThe deadline, which was first set for January 19, 2021, has now been pushed forward for an unspecified number of days."
  },
  {
    "headline": "FG extends NIN-SIM linkage deadline by a 'few days'",
    "summarized_story": "The federal government has extended the deadline for the ongoing national identification number (NIN) and subscriber identity module (SIM) integration exercise by “a few days”.\nIn a statement announcing the latest extension, Isa Pantami, minister of communications and digital economy, urged citizens and legal residents to use the next few days to ensure that they complete the linkage.\nTo this end, the minister further directed that the National Identity Management Commission (NIMC) should offer enrolment services round-the-clock for the next few days.\n“On behalf of the Honourable Minister, the Executive Vice Chairman of NCC, Prof. Umar Garba Danbatta, and the Director-General/CEO of NIMC, Engr.\nAdvertisementThe deadline, which was first set for January 19, 2021, has now been pushed forward for an unspecified number of days."
  },
  {
    "headline": "Kaduna train attack: Security threats rising... new strategies needed, says Niger president",
    "summarized_story": "Mohammed Bazoum, Niger Republic president, says African countries battling terrorism need to come up with new strategies for dealing with the challenges.\nBazoum spoke with state house correspondents after his visit to President Muhammadu Buhari on Thursday in Abuja.\nThe Niger Republic president said the West African region is battling an increased level of security threats, especially in the wake of the recent attack on the Abuja-Kaduna train.\nHe thanked Buhari for his support towards the multinational joint task force (MNJTF), saying Nigeria’s financial intervention has made the operation successful.\n“We also spoke about the gas pipeline in the sense that gas and oil now have become an issue in world politics, in the world economy.”"
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "How Ire Aderinokun is helping to shape Helicarrier's culture",
    "summarized_story": "The search for remote work has increased by 490% since the beginning of the pandemic.\nIn 2021, there were a number of product/market expansions on the continent that were fueled by raises and eased by remote work options.\nFounded in 2017 by Timi Ajiboye, Tomiwa Lasebikan and Ire Aderinokun, Helicarrier was originally Bitkoin Africa, a website for peer-to-peer (P2P) Bitcoin trading.\nOn building and maintaining company culture, Aderinokun states that most of the team members have direct relationships with 2 of the 3 co-founders.\nAs more team members get hired, though, Aderinokun believes that the team will have to find a sustainable method."
  },
  {
    "headline": "Andela expands its tech talent pool beyond software engineers",
    "summarized_story": "But on Wednesday, the global talent company said it is expanding its offering beyond engineering talent to include matching in new practice areas: specifically design, data, and product management.\n“Having worked across the continent and beyond, we know that the tech ecosystem does not just need only engineering talent,” Agnes Muthoni, Director of the Andela Learning Community, said on the move.\n“The Andela platform is constantly learning, helping to refine its personalised recommendations.\nThis is why we’ve built our new platform—to help talent find jobs that match their technical skills and careers that match their lives,” he said.\nLaunched in Nigeria in 2014, Andela started as an African-focused software developer training and outsourcing company."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Land Grabbing: Community calls for Oba Ewuare II Intervention – Nigerian Observer",
    "summarized_story": "According to Idemudia and Ekhaguere, the duo have continually constituted themselves as a threat to peace in the community.\n“These persons have sold off all the land in the village belonging to indigenes; as a result of this act, there is no longer free land for indigenes to farm.\n“That these persons who are non-indigenes of the village have capitalised on this and had forcefully taken over, even the land belonging to the mother of your Royal Majesty,” they said.\nThey added that “It is on record that from time immemorial, Iguomo community was founded and belongs to the mother of the Oba of Benin Kingdom, but it is unfortunate that non-natives have taken over all the land and sold them, with the aid of Pa Godwin Usiomoifo.\n“These persons have formed and become the overlords of the entire village as innocent indigenes of the village can no longer move freely in their own village."
  },
  {
    "headline": "Edo plans cultural hubs in senatorial districts to preserve, promote heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has disclosed plans to establish cultural hubs in the three senatorial districts of the state to preserve and promote Edo’s rich cultural heritage.\nThe Edo State Commissioner for Arts, Culture, Tourism and Diaspora Affairs, Hon.\nPrince Bamidele Obaitan, disclosed this to journalists in Benin City during a programme organized by the Ministry to mark the 2022 World Theatre Day.\nObaitan said the cultural hubs will leverage technology and the innovative potential of Edo youths to advance the preservation of the state’s cultural assets.\nObaitan announced that the Ministry of Arts, Culture and Tourism is currently doing a collation of all local festivals across the state in a bid to develop it into a calendar to boost the development of culture."
  },
  {
    "headline": "Obaseki seeks investments in Benin River Port, Enterprise Park, others at Dubai summit …showcases Edo’s business potential – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki at this year’s Annual Investment Meeting (AIM) in Dubai, thrilled investors with his pitch for investments in the Benin River Port, the Enterprise Park, and the Benin Inland Container Depot/Dry Port, among other big-ticket projects, in a drive to deepen development and open up the state’s economy for productivity and industrialization.\nThe governor is among members of the Nigeria Governors’ Forum (NGF) participating in the annual summit and seeking foreign direct investments from businesses and organisations in the United Arab Emirates (UAE).\nOthers on the delegation include Governors of Abia, Akwa Ibom, Bauchi, Bayelsa, Cross River, Ekiti, Enugu, Kwara, Niger, Ondo, Plateau, Sokoto and Yobe States.\nNoting the economic benefits of the Benin River Port and Edo Enterprise Park projects, the governor said his government will continue to push for more of such projects to ensure the requisite infrastructure to attract and keep investment and engender inclusive growth.\nThe Annual Investment Meeting (AIM) is an initiative of the UAE Ministry of Economy designed to provide a framework for global exchange on the key principles underpinning international investment policies, strategies and practices for sustainable development to achieve smart and inclusive global growth."
  },
  {
    "headline": "Financial crises rock Edo cooperative societies over non remittance of deductions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestCooperative societies in the eighteen local government councils and the Ambrose Ali University, Ekpoma are struggling under serious financial crises following the non remittance of due deductions by the respective Managementsof the councils and the university.\nAddressing newsmen shortly after a meeting with officials of the Edo State Ministry of Trade, Investment and Cooperatives led by the Commissioner Aishetu Braimah where the nagging issues were tabled, President of the Federation of Edo Cooperative societies Mr Filani Ojo said the non remittance of the said deductions has crippled activities of the aforementioned cooperative societies in the state.\nHe disclosed that the management of Ambrose Alli University was yet to remit deductions in Union dues and workers financial commitments to the AAU’s Cooperative Society in the tune of over N800 million.\nOredo Local Council he said had withheld over N120 million in deduction of monies belonging to the workers’ Cooperative Society.\nHe said the unhealthy development has crippled the activities of the cooperative societies and make them inable to meet their financial obligations to contributors of the funds."
  },
  {
    "headline": "Oyetola upgrades Osun College of Education Ilesa to full-fledged university",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Mr. Adegboyega Oyetola, on Thursday announced the upgrade of the state College of Education, Ilesa, to a full-fledged university.\nThis is even as the Governor inaugurated the Ijesa community funded Geriatric Centre.\nThe newly-inaugurated Geriatric Centre was funded and built by prominent Ijasa sons and daughters.\n“In other words, the Ijesa Geriatric Centre is a welcome development as it brings closer to our people a specialised geriatric care.\n“We appreciate you for heeding our age-old prayers of upgrading the 44-year-old College of Education, Ilesa, to a full fledged University."
  },
  {
    "headline": "Polytechnics’ lecturers threaten to resume strike over govt’s failure to honour agreement",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP), has said it is planning to resume a strike action it suspended after 61 days in June 2021, upon reaching an agreement with the government.\nThe union on Thursday issued a one-month ultimatum to government for the strike action, in Yola at the end of its 102nd National Executive Council meeting.\nAnderson Uzeibe, ASUP national president who issued the ultimatum while speaking with newsmen after the meeting, noted that the decision became necessary after the government failed to implement important aspects of the memorandum of action signed with the union nine months ago.\n“The government is yet to release the sum of N15billion as the first tranche of the N800billion revitalisation fund nine months after the approval by President Muhammadu Buhari,” he said.\n“Following exhaustive deliberation, the union’s National Executive Council has resolved to give the government a further one month as an ultimatum to address the outstanding issues as listed or face a review of the suspended industrial action by our union.”"
  },
  {
    "headline": "Hacey Health Initiative educates students on FGM in Osun",
    "summarized_story": "By Sunday Oguntuyi, OsogboHacey Health Initiative has noted that over 125 million girls and women in almost 29 countries in Africa and the Middle East are victims of Female Genital Mutilation and Cutting (FGM/C).\nMr. Ayo Alabi, the representative of the Hacey, made this assertion while presenting prizes to the winners of an essay competition on end Female Genital Mutilation in Osogbo, Osun state.\nHe appreciated the efforts of the students for their participation in the essay competition saying that two boys were among the winners.\nHe noted that there are laws and policies to prohibit FGM/C in Osun state but the awareness of these laws are very low.\nAccording to the Initiative, only 29.4 percent ,18.5 percent and 4.5 percent of the women in Osun, Ekiti and Oyo respectively were aware of the existence of the laws and policies."
  },
  {
    "headline": "NURTW stakeholders, TOOAN call for calm, say loyalty to Tinubu, Sanwo-Olu not negotiable",
    "summarized_story": "The leaders who gathered to offer their solidarity for Asiwaju for 2023 include, Alhaji Rafiu Akanni Olohunwa, former Chairman NURTW, Lagos Council, Comrd.\nSeyi Bankole, Secretary NURTW, Lagos State , Alh.\nAbiola Azeez, Istijabah as the TOOAN Lagos State Chairman.\nMany who spoke at the press conference said the appointment of the new state chairman of TOAN was the problem.\nHe said, “We have the state chairman of NURTW, and also there’s the state chairman of TOOAN."
  },
  {
    "headline": "Bauchi Gov Gives N75m Empowerment Items To 500 Shira Women, Youths",
    "summarized_story": "In continuation of his empowerment programme, Governor Bala Mohammed of Bauchi State yesterday distributed empowerment packages to 500 youths and women in Shira local government area.\nHe said the 500 beneficiaries in the council got sewing and grinding machines, motorcycles, vehicles while others were empowered with N50,000 each.\nBala said the scheme which is under his programme tagged: “Kaura Economic Empowerment Programme (KEEP)” is expected to cover all the 20 local government areas of the state.\nThe governor said his administration is desirous of pulling the people out of poverty and joblessness hence it initiated the empowerment programme.\nADVERTISEMENTThe chairman of Shira local government area, Mahmud Abba, expressed appreciation to the governor for carrying his people along in delivering the dividends of democracy."
  },
  {
    "headline": "Killings Have Made Mourning ‘Lifestyle’ In Kaduna – CAN",
    "summarized_story": "Kaduna State chapter of the Christian Association of Nigeria (CAN) has mourned victims of the Abuja-Kaduna train attack incident on Monday night.\nCAN said mourning has become a daily occurrence in Kaduna State because of recurring attacks and killings by bandits and terroristsIn a statement issued by the association’s chairman, Rev.\nJohn Joseph Hayab, he said, “Sadly, mourning is now an everyday ordeal in Kaduna even though we have a sitting government with huge security votes disbursed monthly.\nBesides, the train attack further amplifies the vulnerability Kaduna people and everyone who does business in the state face due to the rise in banditry and terrorism.\n“CAN and all well-meaning folks have cried that Kaduna residents and visitors across ethnic and religious divides live in fear everywhere and all the time following the dread of bandits have demonstrated more audacity stronger than that of the government of the day,” he said."
  },
  {
    "headline": "Killings Have Made Mourning ‘Lifestyle’ In Kaduna – CAN",
    "summarized_story": "Kaduna State chapter of the Christian Association of Nigeria (CAN) has mourned victims of the Abuja-Kaduna train attack incident on Monday night.\nCAN said mourning has become a daily occurrence in Kaduna State because of recurring attacks and killings by bandits and terroristsIn a statement issued by the association’s chairman, Rev.\nJohn Joseph Hayab, he said, “Sadly, mourning is now an everyday ordeal in Kaduna even though we have a sitting government with huge security votes disbursed monthly.\nBesides, the train attack further amplifies the vulnerability Kaduna people and everyone who does business in the state face due to the rise in banditry and terrorism.\n“CAN and all well-meaning folks have cried that Kaduna residents and visitors across ethnic and religious divides live in fear everywhere and all the time following the dread of bandits have demonstrated more audacity stronger than that of the government of the day,” he said."
  },
  {
    "headline": "Reps Demand Trans Saharan Natural Gas Pipeline Status",
    "summarized_story": "House of Representatives has urged the Nigerian National Petroleum Company (NNPC) Limited to provide information regarding the implementation, funds utilisation and status of the construction of the Trans Saharan Natural Gas Pipeline.\nThe House also asked NNPC to review the National Gas Master Plan relating to the project to conform with the variables of today’s global economy.\nThis followed the adoption yesterday of a motion on the Urgent Need to Address the Prolonged Construction of the Trans Saharan Natural Gas Pipeline Project raised at plenary on Wednesday by Hon.\nAccording to him, the pipeline was discovered to be technically and economically feasible and reliable which in turn led to the intergovernmental agreement on the pipeline signed by the Energy Ministers of Nigeria, Niger and Algeria on July 3, 2009, in Abuja.\n“A new Gas Master Plan (GMP) needs to be crafted due to the current geo-political realities”."
  },
  {
    "headline": "Reps Demand Trans Saharan Natural Gas Pipeline Status",
    "summarized_story": "House of Representatives has urged the Nigerian National Petroleum Company (NNPC) Limited to provide information regarding the implementation, funds utilisation and status of the construction of the Trans Saharan Natural Gas Pipeline.\nThe House also asked NNPC to review the National Gas Master Plan relating to the project to conform with the variables of today’s global economy.\nThis followed the adoption yesterday of a motion on the Urgent Need to Address the Prolonged Construction of the Trans Saharan Natural Gas Pipeline Project raised at plenary on Wednesday by Hon.\nAccording to him, the pipeline was discovered to be technically and economically feasible and reliable which in turn led to the intergovernmental agreement on the pipeline signed by the Energy Ministers of Nigeria, Niger and Algeria on July 3, 2009, in Abuja.\n“A new Gas Master Plan (GMP) needs to be crafted due to the current geo-political realities”."
  },
  {
    "headline": "Terrorists attacks: ‘Water don pass garri, now I’m vindicated’ – Fayose mocks Nigerians",
    "summarized_story": "A former Governor of Ekiti State, Ayodele Fayose, has again mocked Nigerians over the insecurity that has spread around the country, especially the North-West region.\nWithin the last 72 hours, there have been several attacks in Kaduna and its neighbouring states.\nThe terrorists shot many passengers dead as unascertained number of the passengers also sustained various degrees of injury as a result of gun shots.\nJust yesterday night, armed men stormed Kofar Gayan low-cost, Zaria, Kaduna, Kidnapped a customs officer, Muawiyya Gambo Turaki, and nine others.\nAll this put together, Fayose, said he has been vindicated, reminding Nigerians how he warned them against a Muhammadu Buhari presidency in 2015."
  },
  {
    "headline": "Muslim Leaders, Islamic Organizations Meet Osinbajo In Abuja",
    "summarized_story": "Osinbajo gave the position at the Presidential Villa, Abuja, when he received a delegation of Imams, Islamic scholars and Muslim leaders.\nThe delegation of more than 25 Islamic clerics, intellectuals and leaders of different groups was drawn from the influential National Council of Ulamas, Qadiriyya Movement, Fitiyanul Islam of Nigeria, Dariya Sect, and National Council of Muslim Youths.\nOthers include the Muslim Students Society of Nigeria, Jammat Tajdidul Islamy, Salafiyya Youth Movement, Imams from the National Mosque and Legislative Quarters in Apo, Abuja among others.\n“We are here in recognition of your love for all Nigerians and your belief in the harmonious existence of our country.\n“I am enriched from what I have heard today and I have noted all the issues."
  },
  {
    "headline": "Again, Fire Razes Popular Abuja Market",
    "summarized_story": "The Karimo market in Abuja, the Federal Capital Territory, has been engulfed in flames since early this morning.\nMany shops were alleged to have been damaged by the fire, with products worth millions of Naira being lost as a result of the blaze.\nAlthough the cause of the fire is unknown, our correspondent learned that firefighters had arrived on the scene to put it out.\nThe market also caught fire in July of last year, destroying around 200 stalls.\nDetails later…"
  },
  {
    "headline": "Former NNPC GMD, Andrew Yakubu Discharged, Aquitted Of $9.8m Corruption Charges",
    "summarized_story": "Andrew Yakubu, the former Group Managing Director, GMD, of the Nigerian National Petroleum Corporation, NNPC, was dismissed and cleared by a Federal High Court in Abuja on Thursday of the $9.8 million corruption charges made against him by the Federal Government.\nIn a ruling, Justice Ahmed Ramat Mohammed ruled that the large sums of foreign currency seized from him in 2017 and held by the Central Bank of Nigeria (CBN) be immediately reimbursed to him.\nThe judge ruled that the Economic and Financial Crimes Commission (EFCC), which prosecuted Yakubu, had failed miserably to prove that he had money in excess of the legal limit.\nJustice Mohammed went on to say that the testimony of the anti-graft agency’s witnesses presented doubts that had to be resolved in the defendant’s favor.\nDetails later…"
  },
  {
    "headline": "5 years after, court clears ex-NNPC GMD Yakubu of money laundering, EFCC goes on appeal – Blueprint Newspapers Limited",
    "summarized_story": "By the development, the trial court has finally acquitted Yakubu on the two remaining charges slammed against him.\nThe trial judge equally dismissed the EFCC’s claims that the funds were proceeds of crime for not going through a financial institution.\nThe trialOn March 16, 2017 specifically, the EFCC brought Yakubu before the court on six counts of money laundering and related offences.\nBut dissatisfied with the refusal of the court to dismiss all the counts, the defendant proceeded to the Court of Appeal.\nEFCC moves to appealResponding to the judgement, the EFCC said it would go on appeal, insisting the trial judge erred in discharging the former NNPC boss."
  },
  {
    "headline": "El-Rufai opens up: We know where the bandits are – Blueprint Newspapers Limited",
    "summarized_story": "Kaduna state Governor Nasir El Rufai has admitted the Nigerian authorities know the camps, the identities and listen to the conversations of the armed groups terrorising large swaths of the North-west region.\nThe governor explained why the military has not bombed the bandits despite knowing their whereabouts and listening to their conversations.\nSource: Premium Times‘No bandits’ barricade on Kaduna-Abuja road’Meanwhile, the Kaduna state government has debunked rumours that bandits Thursday barricaded a portion of Kaduna-Abuja highway.\n“The Kaduna state government will update members of the general public when more detailed feedback is received.\nThe Kaduna state government does not deny the existence of security challenges, and continues to work assiduously with relevant military and security agencies.”"
  },
  {
    "headline": "[Breaking] ‘Money laundering’: Court acquits, discharges ex-NNPC GMD Yakubu",
    "summarized_story": "The Federal High Court sitting in Abuja Thursday acquited and discharged former Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mr Andrew Yakubu.\nJustice Ahmed Mohammed gave the verdict while delivering his judgment on the matter.\nBefore the recent pronouncement, Yakubu was facing a money laundering charge instituted against him by the Economics and Financial Crimes Commission (EFCC) to the tune of over $9.8m found in his Kaduna home.\nThe court has then ordered return of the over $9.8m dollars found in his home.\nDetails loading…"
  },
  {
    "headline": "Why We Can’t Deliver Ajaokuta During Buhari’s Tenure – Minister",
    "summarized_story": "﻿The Minister of Mines and Steel Development, Mr Olamilekan Adegbite on Thursday admitted that the Federal Government will not be able to deliver on its promise to revive the Ajaokuta steel rolling mill before the end of the current administration in 2023.\nHe made the admission while fielding question from State House correspondents during the 34th session of the State House briefing held at the State House in Abuja.\nWhen we came back from Russia, yes, I went to the public and said, ‘look we will deliver Ajaokuta before the end of this tenure’.\nSo, it is a force majeure.”In 2020, the Minister had said the Ajaokuta Steel Mill was 90 percent complete and may be functional by early 2023.\nIn Sochi, President Buhari invited the Russians to help complete the steel mill on a Build-Operate-Transfer model, Adegbite said."
  },
  {
    "headline": "Bandits Invade Housing Estate In Kaduna, Kidnap Customs Officer, Five Others",
    "summarized_story": "Gunmen suspected to be bandits have attacked a low-cost housing estate at Kofar Gayan in Zaria Local Government Area of Kaduna State and kidnapped six people including a Customs officer and his son.\nThey moved straight to the Customs officer’s residence and thereafter took him away along with his son.\nAccording to the source, the bandits trailed him from his family house in Zaria city down to the estate.\nFour others within the estate were later abducted by the gunmen.\nKaduna State and several others in the northwest and north-central regions have suffered from banditry in recent years."
  },
  {
    "headline": "Nigerians Should Be Allowed To Bear Arms For Self-Defence – Reps Majority Leader",
    "summarized_story": "Majority Leader of the House of Representatives, Ado Doguwa, has said Nigerians should be allowed to bear arms in self-defense considering the deteriorating security situation in the country.\nAnother lawmaker, Honourable Aminu Suleiman who is also a member of the APC in his contribution said the security agencies are displaying ineptitude.\nHe drew the attention of the House to a group of young boys in Kano State called Suka, which he says are budding and could grow into another security threat.\nThe lawmakers also questioned the capability of the National Security Adviser, who has remained in the position since 2015, unchanged.\nHonourable Dachung Bagos asked that the house suspend releases to security agencies until they can account for all the funds released so far."
  },
  {
    "headline": "World Cup Miss: NFF Sacks Super Eagles Technical Crew",
    "summarized_story": "The Nigeria Football Federation (NFF) has sacked the Super Eagles’ technical crew.\nREAD ALSO: Super Eagles World Cup Disappointment Is ‘A Blessing In Disguise’ – George Abbey“The NFF has in the meantime withdrawn the two-and-half years’ contract offered the coaches and terminated the appointment of the entire technical crew of the team with immediate effect,” the communique read.\nIt also confirmed that Austine Eguavoen had earlier resigned as the team’s technical director.\n“When you put on that Super Eagles jersey, the whole nation is expecting you to go to war for us,” George, who played at the 2004 Africa Cup of Nations, added.\nWe need players who are ready to bleed for the nation and I did not see any of that.”"
  },
  {
    "headline": "Police Defuse Bomb Hidden Inside Bucket in Kaduna Community",
    "summarized_story": "The Police anti-bomb squad in Kaduna state on Thursday averted a tragedy when its operatives defused a bomb at Shanono community in Rigasa community of Igabi local government area of the state.\nA resident of the area, Bulus Neriya, told Channels Television that the bomb was hidden inside a plastic bucket and placed near a gully before it was discovered by residents.\nAccording to the spokesman of the Kaduna State Police Command, ASP Mohammed Jalige, the IED was discovered by residents of the area at about 7am on Thursday morning, who immediately reported to the police.\nREAD ALSO: Army Dismisses Viral Video Of Soldier Allegedly Abandoned By ColleaguesHe said that the Command’s Explosive Ordinance Department (EOD) swung into action and successfully defused the IED, without any loss of lives or property.\nFollowing the discovery of the IED, the Kaduna state acting Commissioner of Police, DCP Maiyaki Baba advised the general public to always report suspicious movement of persons in the state assuring that such information would be treated in full confidentiality."
  },
  {
    "headline": "Why Kwara House declared lawmaker’s seat vacant",
    "summarized_story": "Kwara State House of Assembly has declared the seat of Hon.\nSaheed Popoola vacant after he officially announced his defection from the All Progressive Congress (APC).\nIn a letter addressed to the INEC and dated March 28, 2022, Speaker of the Kwara State House of Assembly Rt.\nYakubu Danladi Salihu said the decision to declare the seat vacant is in line with the provisions of Section 109 (1) (g) of the Constitution.\nThe declaration of the seat as vacant joins several of such developments across the country, including recent court judgments on the issue."
  },
  {
    "headline": "Ondo assembly declares former deputy speaker, Iroju Ogundeji's seat vacant -",
    "summarized_story": "The Ondo State House of Assembly has declared the seat of the former Deputy Speaker, Iroju Ogundeji, vacant.\nIroju Ogundeji before he was fired was the lawmaker representing Odigbo constituency 1 in Ondo State House of Assembly.\nThe Speaker also asked the Commissioner of Police to arrest Ogundeji for parading himself as the Deputy Speaker of the Assembly.\nBut the embattled former Deputy Speaker of Ondo State House of Assembly, kicked against the declaration of his seat vacant by the Speaker of the Assembly.\nBanjo Aiyenakin sought the order of the court to restrain the Assembly from declaring his seat vacant."
  },
  {
    "headline": "Kano Commissioner for Water Resources, Sadiq Aminu Wali resigns",
    "summarized_story": "Kano State Commissioner for Water Resources, Sadiq Aminu Wali has resigned.\nThe commissioner in a statement said he resigned to pursue other opportunities in his political career.\nSadiq Aminu Wali assures Governor Abdullahi Ganduje of his unflinching loyalty and support in the future.\nThe water resources commissioner was appointed in November 2019 alongside nineteen others to serve at various Ministries under the Ganduje government."
  },
  {
    "headline": "25 groups purchase Sokoto PDP Governorship nomination form for Bafarawa",
    "summarized_story": "Representatives of twenty five groups in Sokoto state have presented the People’s Democratic Party (PDP) governorship nomination form to Sagir Bafarawa, calling on him to contest for the 2023 Governorship election in the state.\nMr. Bafarawa is a serving Sokoto state Commissioner for Environment, and has earlier declared his intention to join governorship race in the state on the platform of the PDP.\nLeader of groups, Malam Almustapha Sarkin-Baki, says they considered the achievements of Bafarawa in his capacity as Commissioner along with political movements being youths ambassador.\nHe says based on his past and present records, Bafarawa deserved collective support to continue with good leadership started by Gov Aminu Tambuwal in the state.\n‘Responding, Bafarawa commended the groups efforts and expressed his acceptance to his supporters and says he would reach out to elders as well as other stakeholders as part of continued consultations."
  },
  {
    "headline": "Okwesilieze Nwodo: Comparing APC With PDP Is Like Comparing Darkness With Light",
    "summarized_story": "At the expiration of a two-week deadline, the meeting of the Peoples Democratic Party (PDP) zoning committee ended inconclusively in Abuja, on Tuesday.\nThe PDP is yet reach a decision of where the presidential candidate for 2023 will come from.\nThe 37-member zoning committee of the Peoples Democratic Party (PDP) under the chairmanship of Benue State Governor Samuel Ortom has scheduled another meeting next week, same time and same venue.\nHowever, the committee, in a statement assured that members would come out with an acceptable position for all.\nTo discuss the inconclusiveness of zoning by the PDP 37-member zoning committee is Dr. Okwesilieze Nwodo, former Governor of Enugu and former national chairman of the People’s Democratic Party."
  },
  {
    "headline": "‘It Doesn’t Matter Whether It’s Day or Night, Terrorists Can Attack Anytime’- Kaduna Train Survivor",
    "summarized_story": "Some survivors of Monday night’s deadly attack on Kaduna bound train, have been recounting their horrible ordeal during the encounter with the bandits.\nAt least 8 people are now known to have died from the incident.\nSeveral are still unaccounted for.\nARISE News correspondent Nissi Gabriel who has been tracking this developing story now reports.\nWe are now joined by MAIMUNA IBRAHIM in Saint Gerald Catholic Hospital, Kaduna state, who is a survivor of the Abuja–Kaduna Rail Services Terror Attack."
  },
  {
    "headline": "Ukraine Preparing for New Russian Assault on Donbas, Zelenskyy Says",
    "summarized_story": "Ukraine’s President Volodymyr Zelenskyy has pledged to “fight for every metre” of Ukrainian land, saying his forces are preparing for new Russian attacks in the eastern Donbas region as Moscow amasses troops there.\nTough resistance by Ukrainian forces has prevented Russia from capturing any major city, including the capital, Kyiv, where a Russian armed column was held back for weeks.\nIn his address, Zelenskyy referred to Russian troop movements away from Kyiv and Chernihiv, saying that was not a withdrawal but “the consequence of our defenders’ work”.\nUkraine is seeing “a build-up of Russian forces for new attacks on the Donbas and we are preparing for that”, he said, adding that Ukrainians “won’t give up anything and we’ll fight for every metre of our land, for every citizen”.\nUkraine is seeing “a build-up of Russian forces for new attacks on the Donbas and we are preparing for that”, he said, adding that Ukrainians “won’t give up anything and we’ll fight for every metre of our land, for every citizen”."
  },
  {
    "headline": "I am the Most Qualified to Be Nigeria’s President in 2023, Says Ex-Senate President Saraki – Arise News",
    "summarized_story": "Ahead of the People’s Democratic Party (PDP) presidential primaries, former Senate President and presidential aspirant, Dr. Bukola Saraki has urged Nigerians to elect a president for the country based on competence and not on religion and ethnicity, adding that he is the most qualified for the job.\nSaraki, a former governor of Kwara State, stated this in Benin City when he paid a visit to PDP delegates in Edo State to solicit their support.\nSaraki stressed that he stands tall and remained the most competent and qualified aspirant among others.\nWe choose our leaders based on religion; we choose leaders based on zoning; we choose our leaders based on identity politics.\n“We cannot continue to use this parameters in choosing our leaders, especially the position of the president of the Federal Republic of Nigeria."
  },
  {
    "headline": "250 Million Africans Live on Empty Stomach Daily, Says AfDB President Adesina",
    "summarized_story": "The President of the African Development Bank Group (AfDB), Dr. Akinwumi Adesina has estimated that about 250 million men, women and children across the continent go on empty stomach from dusk to dawn.\n“Almost 250 million men, women, and children across the continent go on an empty stomach from dawn to dusk,” Adesina said.\nHe emphasised the need to invest in sustainable and healthy diets to ensure the advancement of the health and well-being of Africans.\nHe maintained that African countries had for too long failed to make investments necessary to provide sustainable and healthy diets for their citizens.\nPointing out that it was time to deliver food security at scale and to nourish Africa once and for all, Adesina also stressed the role of AfDB in ensuring food security and proper nutrition in Africa."
  }
]