[
  {
    "headline": "Bandits raid Kaduna community, abduct 22 residents",
    "summarized_story": "Twenty-two persons were reportedly abducted on Wednesday by bandits that operated at Idon town in Kajuru Local Government Area of Kaduna State.\nA source said four persons were injured in the attack which occurred in the early hours of the day.\n“We don’t know how they came but we just heard them shooting, breaking doors and windows.\nThey came at about 12.30am early in the morning”, he said.\nHe said, “During the attack, the following people were abducted: Justina Joseph, Mary Joseph, Rejoice Joseph, Stephen Joseph Samson Ladan, Christiana David, Boniface David, Helen Aminu, Mirabel Aminu, Precious Philemon, Nelson Philemon and Christian Philemon."
  },
  {
    "headline": "Senate laments abandoned health centres project, orders probe",
    "summarized_story": "The Senate has resolved to investigate the abandoned National Primary Health Centre project initiated by the administration of former President Olusegun Obasanjo.\nThe N400bn project was aimed at establishing PHCs in all the 774 Local Government Areas in Nigeria.\nFollowing the adoption of a motion titled ‘Need to Investigate the Abandoned N400bn National Primary Health Centre Project’ at plenary on Wednesday, the Senate mandated its Committees on Health; Primary Health Care and Communicable Diseases; Works; and Housing to carry out the probe.\nSponsor of the motion, Senator Yahaya Oloriegbe, noted that the project was initiated by the Obasanjo administration in 2006.\nHe said the project was designed to build in each of the 774 LGAs, a 60-bed PHC to be complemented with a three-bedroom flat doctors’ quarters, an ambulance, all basic hospital equipment and drugs."
  },
  {
    "headline": "Lagos residents cry out over attempts by hoodlums to takeover community",
    "summarized_story": "Residents of Etegbin in Oto-Awori council area of Lagos State on Wednesday cried out over the recent invasion of the riverine community by suspected hoodlums who claimed they were acting on a court order to repossess land in the area.\n“The hoodlums came in with dane guns and axes, destroying houses, shops and forcing many hotels to close down.\nAlso, Mr Olawole Olaniyi, a lecturer at Lagos State University and an indigene of Etegbin, said the situation was disheartening.\nShe appealed to the Lagos State Government to station security operatives in the town, adding that their lives were in danger.\nPastor Cornelius Ojelabi, Chairman, Lagos State Chapter of the All Progressives Congress (APC), who was part of the delegation, said Gov."
  },
  {
    "headline": "Fuel scarcity: NLC takes a stand",
    "summarized_story": "NLC President, Mr. Ayuba WabbaThe Nigeria Labour Congress (NLC) has condemned the current petrol scarcity across the country, that exposed millions of Nigerians to great hardship, saying it has taken a position.\nNLC President, Mr Ayuba Wabba, said this on Wednesday in Abuja, in a statement entitled; “’The Position of Nigerian Workers on Festering issues of National Importance”.\nWabba said that the NLC had observed the resurgence of a number of festering issues of national importance.\nAccording to him, the NLC wishes to categorically restate its full fledged support for the autonomy of local governments, state houses of assembly and the judiciary.\n“We demand that the affected states commence implementation without further delay, as acting otherwise is tantamount to breaking Nigeria’s law,” the NLC helmsman said."
  },
  {
    "headline": "Court affirms Adagunodo as Osun PDP chairman",
    "summarized_story": "Shina Abubakar, OsogboAn Osun State High Court, sitting in Ile-Ife, on Wednesday declined to set aside its November 22, 2021 judgement which affirmed Mr. Soji Adagunodo, as the chairman of the Peoples Democratic Party in the state.\nThe court in its judgement had held that the preservative order of an Ikirun High Court which declared Adagunodo as the chairman of the party was not appealed against, thus still subsists.\nBut the national leadership of the Peoples Democratic Party had approached the court with an application, asking that the court set aside its decision.\nBut while ruling on the application on Wednesday, Justice A. Aderibigbe declined the application and refused to set aside it’s ruling.\nIn his reaction to the court’s decision, counsel to Adagunodo, Edmund Biriomoni, disclosed that the implication of the verdict is the appointment of Wale Ojo, who was appointed acting chairman after Adagunodo had been elected South-West PDP chairman, was valid."
  },
  {
    "headline": "Osun Guber: Anyone can smash head on pole, Ijesaland is behind you —Owa Obokun assures Oyetola",
    "summarized_story": "Shina Abubakar, OsogboOwa Obokun of Ijesaland, Oba (Dr) Adekunle Aromolaran, has disclosed that any Ijesa man not satisfied with the second term bid of Governor Adegboyega Oyetola can smash head on pole.\nThis is as the monarch added that Ijesaland is standing behind the Governor to ensure he is re-elected for another term in office.\n“You are the candidate that will win Ijesaland, whosoever oppose yout candidature can smash his head on pole.\n“We don’t give room for rascality in Ijesaland.\n“I pledge on behalf of the Ijesha people that we will give your administration full support to ensure that you win come July 16 2022."
  },
  {
    "headline": "Duty Tour Allowance: EFCC secures interim forfeiture of N104m properties",
    "summarized_story": "Soni DanielThe Economic and Financial Crimes Commission, on Wednesday, secured the interim forfeiture of two landed properties worth over N104m belonging to Aminu Side Garunbabba.\nThe Court directed that the interim forfeiture order be published in Thisday and Punch Newspapers, alerting anyone with interest in the properties to show cause why they should not be forfeited to the Federal Government of Nigeria.\nThe respondent between 2017 and 2018, allegedly received the sum of N341.971,9 million as Duty Tour Allowance for travels that were not made and diverted the proceeds to acquire the forfeited properties.\nThe properties include a four-bedroom Terrace Maisonette with BQ at Barumark Groove Estate, Plot 667 Cadastral Zone Bo3, Wuye District, Abuja purchased at the rate of N65 million.\nJustice Egwatu adjourned till March 23, 2022, for consideration of the motion for final forfeiture of the propertiesVanguard News Nigeria"
  },
  {
    "headline": "FUTA lecturers join ASUU strike, berate FG over approach",
    "summarized_story": "The Federal University of Technology, Akure, FUTA, chapter of the Academic Staff Union of Universities, ASUU, has formally joined the ongoing strike announced by the association’s national body.\nProf. Yinka Awopetu, the chairman of the union in FUTA disclosed this on Wednesday after the union’s congress whi h was held at the school’s premises.\nAccording to Awopetu, the FUTA branch carried out the national body’s decision and has ordered all academic staff to vacate lecture halls.\nHe said that the federal government has purposely ignored the union’s agreement, claiming that until the union’s agreement is honoured, the one month industrial action will not be terminated.\nAlso, majority of the students have urged to the government and union to resolve the problem amicably for their sake."
  },
  {
    "headline": "2023: Next president must be less than 60 years – Nigerian youths demand",
    "summarized_story": "Nigerian youths have called on political leaders to ensure that the next president of the country is below the age of 60.\nThey also suggested that the next president must be someone who is prepared to show how far he has factored young people into his leadership vision.\nThe youths, under the aegis of the Nigerian Youths Union (NYU), warned that 2023 would witness the influx of young energy into active politics as was seen during the End SARS protest.\n‘‘The 2023 general election is a golden opportunity for Nigerian youths to take a stand and reclaim the country to engender inclusive and purposeful governance.\n”The same way Nigerian youths waved the national flag as a symbol of resistance during the End SARS protest, every of our members will arm him/herself with a Permanent Voter Card."
  },
  {
    "headline": "Lagos indigenes drag Buhari, Sanwo-Olu, others to court over appointments, employments",
    "summarized_story": "The group alleges “continuous and deliberate violation” of constitutional rights of Lagos indigenes regarding appointments and employment into public offices and career positions.\nThe defendants are President Muhammadu Buhari; Attorney General and Justice Minister, Abubakar Malami; Nigerian Senate; Lagos Governor Babajide Sanwo-Olu; Lagos Attorney General and House of Assembly.\nOthers are the Independent National Electoral Commission (INEC), All Progressives Congress (APC), People’s Democratic Party (PDP), Head of Service (Federation), Federal Civil Service Commission and Head of Service (Lagos).\nLagos establishments sued are Civil Service Commission, Local Government Service Commission, House of Assembly Service Commission, Judicial Service Commission, Teaching Service Commission and Health Service Commission.\nHe argued that Section 6 (b) of the Constitution created a ‘locus standi’ in matters relating to the provisions therein."
  },
  {
    "headline": "Reps probe Aregbesola over ‘misappropriated’ N165b prison funds",
    "summarized_story": "The House of Representatives has commenced a probe of the Minister of Interior, Rauf Aregbesola.\nThis development is coming few days after Aregbesola publicly blasted Tinubu for turning himself into a god.\nGbajabiamila presided over the plenary on Wednesday, where members resolved that the interior minister and prisons chief, Haliru Nababa be probed.\nThey are being accused of misappropriating about N165billion funds earmarked for prisons development across the country.\nThe House resolution came as a result of a motion of urgent public importance moved by Ndudi Elumelu, who is the Minority Leader of the House."
  },
  {
    "headline": "PRCAN to announce new practice standards for public relations consulting",
    "summarized_story": "The Public Relations Consultants Association of Nigeria (PRCAN), the sectoral trade group authorized by the NIPR Bye-Law to regulate the business of Public Relations Consulting in Nigeria, is set to announce far-reaching reforms that would help protect the businesses of clients and companies in the sector.\nAnnouncing the outcome of the well-attended retreat themed “Building Resilience for Growth-Rethinking How You Do Business”, PRCAN President, Israel Jaiye Opayemi stated that members of the association unanimously agreed and adopted the PRCAN Practice Standards 2022 for implementation during the retreat.\nOpayemi noted that the PRCAN Practice Standards 2022, expected to be launched within the next few weeks, would provide ground rules for improved public relations consulting practice and bring better value to corporate and public sector clients who engage the services of public relations consulting firms in Nigeria.\nThe PRCAN President explained that the reforms in the PRCAN Practice Standards 2022 would also help prospective corporate and public sector clients understand the 21 practice areas they can seek professional services from within the circle of legally recognized public relations firms in Nigeria.\nHe admonished government and corporate institutes engaging the services of public relations firms to demand their PRCAN membership certificate as a requisite minimum in addition to other prerequisites the PRCAN Practice Standards 2022 will make mandatory for such engagements."
  },
  {
    "headline": "NNPC apologises to Nigerians over adulterated fuel",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Nigerian National Petroleum Corporation (NNPC) apologised on Wednesday to Nigerians over the adulterated Premium Motor Spirit (PMS), which circulated in several filling stations across the country last week.\nThe NNPC GMD, Mele Kyari, tendered the apology when he appeared before the House of Representatives Committee on Petroleum (Downstream).\nNigerians can now work and earn dollars DAILY from home.\nThe committee is investigating the circulation of the adulterated PMS, at its attendant effects on the populace.\nKyari, who explained that all the PMS used in the country are imported, said there was no way for the NNPC to know that the toxic petroleum product contained methanol."
  },
  {
    "headline": "Kanu to knows fate April 8",
    "summarized_story": "Justice Binta Nyako fixed the date after the lead defence counsel to Kanu, Chief Mike Ozekhome, SAN, and the prosecution counsel, Shuaibu Labaran, had adopted arguments for and against the defendant’s preliminary objection.\nOzekhome specifically pleaded with the court to acquit and dismiss all the charges filed against Kanu by the Federal Government.\nHe asked the court to look at the entire grounds and affidavit, from paragraphs 5 to 36, of notice of preliminary objection, etc.\nOzekhome had complained that despite the court’s order, the DSS had refused Kanu to change clothes.\nHowever, Justice Nyako asked the defendant; “Mr Kanu, what type of cloth do you want to wear?"
  },
  {
    "headline": "Police parade suspected killers of ex-officer, Nollywood actress",
    "summarized_story": "From Paul Osuyi, AsabaOne of the fleeing suspects allegedly responsible for the killing of the former head of the legal department of Delta State Police Command has been smoked out of his hideout by operatives in Delta State.\nThe 27-year old suspect, Chukwudi Emenem and others still at large, allegedly killed the former OC Legal, Chris Kpatuma in Agwa clan, Oguta Local Government Area of Imo State.\nHe was arrested on February 12, 2022 at Aboh, Ndokwa East Local Government Area of Delta State where he was hibernating with his supposed female friend.\nAccording to Mr. Ali, the suspect stated that “he is related to the late police officer and that the leader of the gang is called ‘Mega Bush’.\nUpon interrogation they confessed to have robbed severalPOS operators and also confessed that their gang members were responsiblefor the robbery and murder of Ngozi,” he said."
  },
  {
    "headline": "Again, bandits kidnap 22, injure four in Kaduna",
    "summarized_story": "From Sola Ojo, KadunaBandits terrorising Kaduna State in the wee hours of Wednesday launched a fresh attack on Idon town in Kajuru local government area of Kaduna state injured four persons and went away with 22 others.\n“We don’t know how they came but we just hear them shooting, breaking doors and windows.\nSupervisory Councilor of Admin, Finance and Health, Kajuru local government area of the state, Bala Jonathan gave the names of the abducted and injured persons.\nAccording to him, after the attack, the following people were abducted; Justina Joseph, Mary Joseph, Rejoice Joseph, Stephen Joseph Samson Ladan, Christiana David, Boniface David, Helen Aminu, Mirabel Aminu, Precious Philemon, Nelson Philemon, Christian Philemon.\nBoth the Kaduna State Police Command and State:s Ministry of Internal Security and Home Affairs were yet to make official statements on this development at the time of filing this report."
  },
  {
    "headline": "Pandemonium in Makurdi as Tiv, Jukun clash over fish pond",
    "summarized_story": "From Rose Ejembi, MakurdiThere was pandemonium at the Rice Mill area of Makurdi the Benue State capital on Wednesday after crisis over a fish pond left two persons critically injured and houses burnt.\nOur correspondent gathered that the violent clash between Tiv and Jukun youths happened at a riverside beside rice mill around New Bridge area of Wurukum.\nYou know it’s a fish pond and every year people fish from there and get a lot of money.\nOf the two persons that were injured, the mother of one of them is even from the Tiv side.\nWe are waiting for the traditional ruler from the Tiv side who ran to an undisclosed location after his house was torched."
  },
  {
    "headline": "Massive Oil Theft, High Pipeline Repairs Cost, Bleeding Nigeria’s Economy",
    "summarized_story": "A THISDAY analysis showed that at a projected 1.86 million barrels per day in 2021, the country recorded nearly 200 million barrels’ crude deficit, out of a possible 700 million barrels yearly, in the first 11 months of the year.\nKomolafe attributed the underperformance to mostly oil theft, sabotage, vandalism, as well as technical issues, including ruptures associated with the assets.\nIn a period of 10 years, he stated, an analysis by NEITI put losses to oil theft at $41.9 billion, about $4.1 billion per year.\nIn all, the government appears helpless, despite attempts in the past to reduce the incidence of vandalism and oil theft.\nSince this year, Wike has repeatedly accused the Nigeria Police and Nigeria Security and Civil Defence Corps (NSCDC) of connivance."
  },
  {
    "headline": "Buhari Accuses National Assembly of Inserting N887bn into 2022 budget",
    "summarized_story": "This was just as the president has asked the National Assembly to amend the 2022 Appropriation Act passed by the National Assembly in December, 2021.\nBuhari in the letter, he also said it was imperative to remove all capital projects that were replicated in the 2022 Appropriation Act.\n“It is therefore necessary to transfer the National Assembly’s expenditures totaling N16.59 billion in the Service Wide Vote to National Assembly Statutory Transfer provision (see Schedule l).\nHe said: “Following the suspension of the petrol subsidy removal, the 2022 Budget Framework has been revised to fully provide for PMS subsidy.\n“Therefore, the amount available to fund the federal budget is projected to decline by N969.09 billion.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Inflation Drops to 15.60%",
    "summarized_story": "The 0.87 per cent decline indicated that the headline inflation rate slowed down in January when compared to the same month in the previous year.\nHowever, month-on-month, the headline index slowed to 1.47 per cent in January, representing 0.34 per cent points moderation compared to1.82 per cent recorded in December 2021.\nOn month-on-month, the core sub-index increased by 1.25 percent in January, down by 0.13 per cent when compared with 1.12 per cent recorded in December.\nThis is 0.17 per cent points higher than 13.16 per cent recorded in December.\nThe urban inflation slowed to 16.17 per cent year-on-year in January 2022 from 17.03 per cent recorded in January 2021, while rural inflation rate also moderated to 15.06 per cent in January from 15.92 per cent in January 2021."
  },
  {
    "headline": "Buhari Transmits 2022 Supplementary Budget to House",
    "summarized_story": "Udora Orizu in AbujaPresident Muhammad Buhari has transmitted the 2022 Supplementary Budget to the House of Representatives for consideration and approval.\nThough Buhari signed the 2022 budget into law in December 2021, he raised reservations about some of its contents, particularly the ‘worrisome changes’ made by the lawmakers.\nThe lawmakers had approved a total expenditure of N17.1 trillion against the N16.3 trillion proposed by the president in October.\nThe six page letter, was read by the Speaker, Hon.\nFemi Gbajabiamila, at the commencement of plenary, Tuesday."
  },
  {
    "headline": "Subsidy: Buhari Transmits N3trn Supplementary Budget to National Assembly",
    "summarized_story": "Seeks review of Finance ActSunday Aborisade, AbujaPresident Muhammadu Buhari, on Tuesday, transmitted a supplementary budget of N3trn to the National Assembly for consideration and passage.\nThe amount included N2.557trn meant to provide subsidy on petroleum products from June to December 2022.\nThis is contained in a letter from the President and read on the floor at plenary by the Senate President, Ahmad Lawan.\nBuhari also requested the federal parliament to review the Finance Act 2021.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, EFCC, Immigration Service Place Nigerian Navy Ex-Director On Watch List Over N2billion Fraud",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has again been placed on the watch list of the Nigeria Immigration Service.\n“He is now on our watch list again, the EFCC requested the NIS to place him on watch list and inform it anytime he is travelling out of the country from any of the international airports and other points of entry and exit,” a senior immigration officer told SaharaReporters.\nThe EFCC had accused Yusuf of stealing N2billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nThe EFCC and National Intelligence Agency also asked the Nigeria Immigration Service and Interpol to place him on a watch list and have him arrested at the point of entry or exit."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, EFCC, Immigration Service Place Nigerian Navy Ex-Director On Watch List Over N2billion Fraud",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has again been placed on the watch list of the Nigeria Immigration Service.\n“He is now on our watch list again, the EFCC requested the NIS to place him on watch list and inform it anytime he is travelling out of the country from any of the international airports and other points of entry and exit,” a senior immigration officer told SaharaReporters.\nThe EFCC had accused Yusuf of stealing N2billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nThe EFCC and National Intelligence Agency also asked the Nigeria Immigration Service and Interpol to place him on a watch list and have him arrested at the point of entry or exit."
  },
  {
    "headline": "How Ogun Police Spokesperson Protects Alleged Fraudulent Car Dealer, Detains, Parades Victim",
    "summarized_story": "Sokunbi Damilola, an Abeokuta-based aluminium fabricator, has narrated how Mohammed Seedu, a car dealer, allegedly influenced the Ogun State Police Command to detain him and his friends after defrauding him of N3million.\nPolice Public Relations Officer, DSP Abimbola OyeyemiHe said he met Seedu in September 2021, after one of his church members, who is also a police officer, introduced him as a reliable car dealer.\n“On September 8, 2021, I journeyed to Coutonu, Benin Republic, with the dealer to get my car.\nOn February 13, 2022, Damilola got a hint from his friends that the dealer was in a car wash around Olomore, Ogun State.\nWhen Oyeyemi, the Ogun police spokesperson, was contacted, he said he was in a meeting."
  },
  {
    "headline": "How Ogun Police Spokesperson Protects Alleged Fraudulent Car Dealer, Detains, Parades Victim",
    "summarized_story": "Sokunbi Damilola, an Abeokuta-based aluminium fabricator, has narrated how Mohammed Seedu, a car dealer, allegedly influenced the Ogun State Police Command to detain him and his friends after defrauding him of N3million.\nPolice Public Relations Officer, DSP Abimbola OyeyemiHe said he met Seedu in September 2021, after one of his church members, who is also a police officer, introduced him as a reliable car dealer.\n“On September 8, 2021, I journeyed to Coutonu, Benin Republic, with the dealer to get my car.\nOn February 13, 2022, Damilola got a hint from his friends that the dealer was in a car wash around Olomore, Ogun State.\nWhen Oyeyemi, the Ogun police spokesperson, was contacted, he said he was in a meeting."
  },
  {
    "headline": "EXCLUSIVE: Court Threatens To Jail Nigeria’s Secret Police, DSS Boss, Yusuf Bichi Over Refusal To Release Youth Leader",
    "summarized_story": "Ntari's lawyer, P. D. Pius had prayed the court to order his client’s release after spending six months in custody without trial.\nThe order reads, \" Take notice that if you, within the named State Security Service (also known as DSS) neglect to obey this order of Federal High Court per A.I.\nChikere made on 29th November 2021 attached or if State Security Service disobeys this order you, Director General State Security Service Abuja, Abbas A. Olayiwola Esq, State Security Service Abuja and S.M.\nBello Esq, State Security Service Abuja may be held in contempt of court and liable to imprisonment.\"\nHe also attached a copy of the release order."
  },
  {
    "headline": "'First of its kind' -- Nigeria embassy visits German city to issue passports to Nigerians",
    "summarized_story": "The Nigerian embassy in Germany, on Wednesday, visited Cologne, a city in Germany, to conduct a passport intervention exercise.\nAdvertisement“Today the Embassy of Nigeria Germany was in Cologne issuing passports to Nigerians,” Tuggar said in a Twitter post.\n“It’s an intervention, first of its kind, to save applicants the trouble of travelling to Berlin and Frankfurt to renew their passports.\nWe hope to visit other cities and plead for your cooperation.”Today the Embassy of Nigeria Germany was in Cologne issuing passports to Nigerians.\nIt’s an intervention, first of its kind, to save applicants the trouble of travelling to Berlin and Frankfurt to renew their passports."
  },
  {
    "headline": "'First of its kind' -- Nigeria embassy visits German city to issue passports to Nigerians",
    "summarized_story": "The Nigerian embassy in Germany, on Wednesday, visited Cologne, a city in Germany, to conduct a passport intervention exercise.\nAdvertisement“Today the Embassy of Nigeria Germany was in Cologne issuing passports to Nigerians,” Tuggar said in a Twitter post.\n“It’s an intervention, first of its kind, to save applicants the trouble of travelling to Berlin and Frankfurt to renew their passports.\nWe hope to visit other cities and plead for your cooperation.”Today the Embassy of Nigeria Germany was in Cologne issuing passports to Nigerians.\nIt’s an intervention, first of its kind, to save applicants the trouble of travelling to Berlin and Frankfurt to renew their passports."
  },
  {
    "headline": "Hong Kong hospitals 'overwhelmed' in fresh COVID surge",
    "summarized_story": "Hospitals in Hong Kong have reportedly become overwhelmed with COVID cases amid a new surge said to be partly driven by the highly infectious Omicron variant.\n“I hope these measures can decrease the congestion in hospitals and also decrease the risk of nosocomial infection in the hospitals.\nAccording to Wen Wei Po, a state-owned newspaper based in Hong Kong, President Xi Jinping of China has called on the Hong Kong government to take responsibility and work towards limiting the spread of infections.\nThe new spike in infections comes amid Hong Kong’s ‘Zero COVID’ policy which has come with a strict lockdown as well as mandatory testing and quarantines.\nAdvertisementMeanwhile, Carrie Lam, chief executive of Hong Kong, has said the government has no plans to enforce a lockdown amid the spike in infections."
  },
  {
    "headline": "Hong Kong hospitals 'overwhelmed' in fresh COVID surge",
    "summarized_story": "Hospitals in Hong Kong have reportedly become overwhelmed with COVID cases amid a new surge said to be partly driven by the highly infectious Omicron variant.\n“I hope these measures can decrease the congestion in hospitals and also decrease the risk of nosocomial infection in the hospitals.\nAccording to Wen Wei Po, a state-owned newspaper based in Hong Kong, President Xi Jinping of China has called on the Hong Kong government to take responsibility and work towards limiting the spread of infections.\nThe new spike in infections comes amid Hong Kong’s ‘Zero COVID’ policy which has come with a strict lockdown as well as mandatory testing and quarantines.\nAdvertisementMeanwhile, Carrie Lam, chief executive of Hong Kong, has said the government has no plans to enforce a lockdown amid the spike in infections."
  },
  {
    "headline": "FEC approves $2.8bn for railway equipment",
    "summarized_story": "The federal executive council (FEC) has approved $2.81 billion for the procurement of rolling stocks and maintenance equipment for rail lines.\nRolling stock is a generic term used to denote anything on rail wheels.\nAdvertisementHe said the rolling stock would ensure that the trains, coaches and locomotives are adequately maintained.\n“Rolling stocks are consumables for the maintenance and operation of the railway.\n“So, with this, we will replace all the rolling stock."
  },
  {
    "headline": "Africa’s young population is driving a gaming market revolution",
    "summarized_story": "This article is contributed to TechCabal by Conrad Onyango/bird story agencyFrom consoles to smartphones, Africa’s growing, tech-savvy population is driving significant growth in the multi-million dollar gaming industry as increased adoption of digital currencies and blockchain technology takes African gaming to the next level.\nUsiku Games Africa, a Kenyan based Social Impact gaming company is pioneering the new era of blockchain gaming in the country where the rising number of tech-savvy youth could soon start earning from the industry boom.\nKenya and Ethiopia finish fourth and fifth largest gaming markets in the continent with 22 percent and 13 percent of their population into gaming respectively.\nAccording to Newswagg’s, 80 percent gamers with crypto accounts are interested in using digital currency for gaming purchases, with 67 percent yearning for an opportunity to use cryptocurrency in gaming.\nGlobal crypto gaming was valued at 321 million US dollars in 2020."
  },
  {
    "headline": "Inside NVIDIA plans to develop Africa’s AI ecosystem",
    "summarized_story": "In 2019, Africa’s AI ecosystem raised $11.27 million—up by 223% from the $3.6 million in 2018—and Tunisia’s InstaDeep $7 million raise represents 62% of the total investment made that year in the ecosystem.\nThrough this programme, InstaDeep was able to buy its first NVIDIA DGX Station, an AI system that brings AI supercomputing to data science teams.\nFast forward to today, NVIDIA has grown to become the pioneer of the modern AI, deep learning, and machine learning market.\n“Africa is a hugely important market for NVIDIA, which is why we are working within its developer ecosystem,” NVIDIA said in an email.\nThis is why NVIDIA is taking a different approach to engage with Africa’s AI ecosystem."
  },
  {
    "headline": "Flutterwave secures $250m Series D with valuation at over $3bn",
    "summarized_story": "Nigeria-based fintech giant Flutterwave has raised $250 million in Series D funding, its single-biggest investment to date, valuing the company at over $3 billion.\nThe investment was led by B Capital Group with participation from new investors Alta Park Capital, Whale Rock Capital, Lux Capital, among others and existing ones, including Glynn Capital, Avenir Growth, Tiger Global, Green Visor Capital, and Salesforce Ventures.\nThe Series D fundraise comes on the back of an impressive run of five years in which Flutterwave has processed over 200 million transactions worth over $16 billion to date across 34 countries in Africa.\nIt also follows a year of rapid growth for the brand which now serves over 900,000 businesses across the globe.\nThis latest fundraising sees its valuation more than triple since its last funding round in March last year, when it raised $170 million in Series C to push its valuation as of then to over $1 billion."
  },
  {
    "headline": "Is Africa’s tech startup ecosystem set for a debt financing boom?",
    "summarized_story": "Okoudjou’s statement came after the pan-African fintech giant closed a $100 million Series C financing round—split between $70 million equity and $30 million debt.\n“Debt investors usually look for predictable cash flows or transferable assets (such as real estate) to secure their exposures.\nAccording to Ayobamigbe Teriba, an ex-analyst at Ingressive Capital, debt financing is viable to businesses but tricky.\nIt participated in MFS Africa’s $100 million funding round with $30 million debt and has backed many startups in Africa.\nShort-term debt financing can also be accessed if it is backed by inventory; for example, e-commerce retailers and their suppliers."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "Local competition for Uber, Wasla raises $9 million, MoneyHash’s pre-seed round",
    "summarized_story": "Today on Techpoint Digest:Local competition for UberWasla’s $9 million raiseMoneyHash’s pre-seed fundingLocal competition for Uber?\nThe startup has announced an investment of $9 million from Contact Financial Holding, a financial services provider in Egypt.\nFollowing the fresh injection of capital, the startup plans to introduce buy now, pay later options and a new online payment option for its users.\nThey’re very technologically advanced, and their adoption of eCommerce is quite good.”MoneyHash’s pre-seed fundingAccepting payments is a significant challenge for businesses across the globe.\nMoneyHash, an Egyptian startup, has raised $3 million in pre-seed funding for this purpose after launching in 2021."
  },
  {
    "headline": "How Healthdart is providing affordable and accessible healthcare in South Africa",
    "summarized_story": "In South Africa, one healthtech startup is helping South Africans access drugs and health advice using their phones.\nMission-driven entrepreneurshipIn the early 2000s, South Africa had an HIV crisis on its hands.\nBringing primary health care closer to the peopleHealthdart co-founders, L-R, Yauvan Hansraj (CTO), Njabulo Skhosana (CEO), and Tshwanelo Matsane (CPO).\nSource: HealthdartMost plans to improve healthcare in Africa are focused on secondary care, with primary healthcare often an afterthought.\nAdvertisementHis reply corresponds to a 2020 report from the Independent Communications Authority of South Africa (ICASA) that claims that the smartphone penetration in South Africa stands at ~91%."
  },
  {
    "headline": "The economics of 5G deployment in Nigeria",
    "summarized_story": "Compared to 4G and 5G networks, the speeds of these networks are exceptionally slow.\nTheir attractiveness, however, pales in comparison to the speeds of 4G and 5G networks.\nInstability in the FX marketThe 5G operators in Nigeria would face a big cost hurdle while trying to navigate the foreign exchange market in Nigeria.\nThe telecom industry in Nigeria depends heavily on foreign equipment manufacturers and imported technical expertise for the deployment and maintenance of networks.\nNigeria would need to work with lawmakers to come up with legal frameworks to guide service delivery in the new 5G era."
  },
  {
    "headline": "The economics of 5G deployment in Nigeria",
    "summarized_story": "Compared to 4G and 5G networks, the speeds of these networks are exceptionally slow.\nTheir attractiveness, however, pales in comparison to the speeds of 4G and 5G networks.\nInstability in the FX marketThe 5G operators in Nigeria would face a big cost hurdle while trying to navigate the foreign exchange market in Nigeria.\nThe telecom industry in Nigeria depends heavily on foreign equipment manufacturers and imported technical expertise for the deployment and maintenance of networks.\nNigeria would need to work with lawmakers to come up with legal frameworks to guide service delivery in the new 5G era."
  },
  {
    "headline": "Five policy steps to fast-track 5G roll-out in Nigeria",
    "summarized_story": "While the President’s enthusiasm for 5G may be a welcome development for operators, the reality of the commercialisation of 5G technology in Nigeria depends more on the policies enabling its deployment.\nThere should be a subsidy from the government for 5G deployment.\nEase of sharing network agreementsDue to the enormous CAPEX and OPEX burden of network deployment on operators, network sharing has become a strategy aimed at reducing the cost weight.\nAnd this is not limited to just the 5G network as operators have used this method for previous generations.\nA prominent example of a network sharing agreement is the one between Orange Belgium and Proximus in July 2019."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "Osun 2022: We’re resolute about your second term in Ijeshaland – Owa Obokun tells Oyetola",
    "summarized_story": "Oba Aromolaran said this in his Palace when the train of strategic engagement tour of Governor Oyetola moved to Ijesa-South Federal Constituency.\nThe traditional ruler declared his unalloyed support on behalf of the traditional rulers, sons and daughters of Ijesaland for Governor, saying they are resolute to return him for second term.\nAlso in his remarks, Alamo of Ayegbaju-Ijesa in Atakumosa East Local Government Area, Oba Adeyemi Abideen, lauded Governor Oyetola for running a people-oriented government that has brought drastic change to all sectors.\nThe new members promised to work hand-in-hand with the leadership and members of the party to ensure victory for Governor Oyetola in the primary and governorship election.\nAddressing the mamonth crowd across the Local Governments of the Federal Constituency, Governor Oyetola urged the party loyalists to be wary of those that are buying membership slips."
  },
  {
    "headline": "2023: Igbo elders insist on producing next president",
    "summarized_story": "Leaders of the Southeast geopolitical zone under the aegis of Igbo Elders Consultative Forum, (IECF), have insisted that the Igbo must produce the next president of Nigeria.\nEzeife insisted that it is either the Southeast is allowed to produce the Nigeria’s next president in 2023 or the region will quit the country.\n“It is either we are allowed to produce the president of this country in 2023 to change the appalling narrative of continued decay, poverty, insecurity, poor governance, corruption and maladministration in Nigeria or out of it.\nNo half measure, as serious sanctions will be visited on any Igbo man or woman that sabotages this noble and patriotic decision of our people to provide for Nigeria a credible, visionary and creative president.\n“We are waiting for them (political parties), as they will meet their Waterloo this time, if they insist on shortchanging the Southeast people this rare opportunity of producing a credible, patriotic, detribalised and dynamic president of Nigeria in 2023,” he saidFacebook Notice for EU!"
  },
  {
    "headline": "Identity of military officer who stole N10.9bn revealed",
    "summarized_story": "The anti graft agency had on Tuesday presented details of 24 properties worth N10.9 billion forfeited to the federal government by military officers, including late Gen. Maude Aminun-Kano.\nThen director general of the NIA, Ayodele Oke, had admitted that the money belonged to his agency and was later suspended from office.\nOthers are No 15, 21 Crescent, 2nd Avenue, Gwarinpa Estate, Abuja; No 3 Liverpool Close, Sun City Estate, Abuja; No 52 Mainstreet, Sun City Estate, Abuja; and No 25 Osaka Street, Sun City Estate, Abuja.\nThe EFCC said it acted on intelligence that a serving top military officer was in the habit of acquiring high-profile properties and had floated companies that owned similar assets.\nEFCC spokesperson Wilson Ujuwaren declined to comment on the agency’s ties to Mr Mohammed, insisting that he would not disclose other information beyond what was contained in court documents."
  },
  {
    "headline": "Abia govt expresses outrage as gunmen kill cattle dealers in state",
    "summarized_story": "The government of Abia State has condemned in strong terms, the killing of eight persons at New Cattle Market located in Omumauzor, Ukwa West Local Government Area of the State on Tuesday by unidentified gunmen.\n“On Tuesday, 15th February, 2022 at about 11:35pm, some yet to be identified hoodlums allegedly invaded traders at the New Cattle Market located in Omumauzor, Ukwa West Local Government Area of our Dear State,” the statement said.\n“We are working assiduously to provide succour to the families of the victims.\nWe have equally started the immediate relocation of the traders while working out compensation for lost properties.\n“We urge all Citizens of our great Country in Abia State to remain law abiding and promptly report any suspicious movements to the appropriate authorities.”"
  },
  {
    "headline": "Police Nabs Soldier With 81 Parcels Of Indian Hemp In Bauchi",
    "summarized_story": "The Bauchi State Police Command said it has arrested a soldier, Yusuf Gongpolai Adams, with 81 parcels of dried leaves suspected to be cannabis sativa in his possession.\nAdams, who is said to be of the Nigerian Army 145 Battalion, Abia State, was intercepted on February 6, 2022 along Bauchi–Darazo highway while driving a Toyota Highlander.\nADVERTISEMENTOther items recovered from the suspect are two Michelin tires, one Army helmet, one bag containing some clothes and some charms.\nCP Sanda added that investigation was ongoing after which the suspect will be charged to court.\nExhibits recovered from the suspect include two locally-made Dane guns, one military camouflage uniform and some charms."
  },
  {
    "headline": "JUST-IN: Unknown Gunmen Kill 7, Injure Many In Abia",
    "summarized_story": "An early Wednesday morning attack by unknown gunmen at a new abattoir in Omumauzor in Ukwa West local government area of Abia State, has left seven persons dead and others injured.\nLEADERSHIP reports that the attack occured barely one week after the abbattoir was relocated from Aba Waterside (Ahia Udele) following a truck accident which claimed six lives and property.\nA reliable source in the community, which said the attack lasted over an hour, added that no fewer than 70 cows were killed and other valuables destroyed by the assailants.\nMeantime, the chairman of the Ukwa West LGA, Chief Okey Kanu, has, in company of a team of combined security agents, visited the scene of the attack to ascertain the extent of the destruction.\nHowever, a reliable source at Obehie Police Station confirmed the incident, adding that the casualty figure could be higher."
  },
  {
    "headline": "Kano Emir Leaves For The Gambia, Senegal On Week-long Working Visit",
    "summarized_story": "The Emir of Kano, Alhaji Aminu Ado Bayero will, on Thursday, leave for The Gambia and Senegal on a week-long working visit on the invitation of the National Council of Elders of The Gambia.\nA statement issued by the Kano Palace said the first-leg of the visit, which will take him to The Gambia will enable him to attend the country’s Independence Anniversary, which comes up on Friday, February 18, 2022, as a special guest of honour.\nHe will also hold meetings with the members of The Gambian Business Community.\nThe Emir is scheduled to also attend the Jumma’at prayer together with The Gambian President, Adama Barrow, and later pay him a courtesy visit.\nADVERTISEMENTThe visit to The Gambian will end with a grand reception in honour of Emir Bayero by The Gambian National Elders Council."
  },
  {
    "headline": "Kano Emir Leaves For The Gambia, Senegal On Week-long Working Visit",
    "summarized_story": "The Emir of Kano, Alhaji Aminu Ado Bayero will, on Thursday, leave for The Gambia and Senegal on a week-long working visit on the invitation of the National Council of Elders of The Gambia.\nA statement issued by the Kano Palace said the first-leg of the visit, which will take him to The Gambia will enable him to attend the country’s Independence Anniversary, which comes up on Friday, February 18, 2022, as a special guest of honour.\nHe will also hold meetings with the members of The Gambian Business Community.\nThe Emir is scheduled to also attend the Jumma’at prayer together with The Gambian President, Adama Barrow, and later pay him a courtesy visit.\nADVERTISEMENTThe visit to The Gambian will end with a grand reception in honour of Emir Bayero by The Gambian National Elders Council."
  },
  {
    "headline": "Nnamdi Kanu Going Blind, Ozekhome Tells Court",
    "summarized_story": "Counsel to the leader of the proscribed Indegeneous Peoples of Biafra (IPOB), Chief Mike Ozekhome (SAN), has raised an alarm that the sight of the detained leader of the IPOB leader, Nnamdi Kanu, has deteriorated.\nOzekhome told a Federal High Court sitting in Abuja that Kanu, who is currently in custody of the Department of State Services (DSS), may go blind, if nothing was urgently done to restore his sight.\nHe equally told the court that a new pair that Kanu bought was also seized from him during his extradition from Kenya.\nADVERTISEMENTOzekhome said despite an express order of the court, the DSS declined to allow the IPOB leader to have a change of clothing.\n“So bad was it that Ejiofor had to call the Director of Legal Services and complained to him,” Ozekhome stated."
  },
  {
    "headline": "Pantami: MURIC Lambasts ASUU Over Professorial Appointment",
    "summarized_story": "Muslim Rights Concern (MURIC) has opposed the Academic Staff Union of Universities (ASUU) position regarding the professorial appointment of Minister of Communications and Digital Economy, Prof Isa Ali Pantami.\nASUU had declared the appointment by the Federal University of Technology Owerri (FUTO) “illegal”, a description MURIC called “joke of the century”.\n“ASUU national should know its limits.\nWhat came out of the conflict between ASUU national and its UNILORIN branch?\n“It is quite amusing that ASUU national threatened to sanction those who participated in the FUTO appointment."
  },
  {
    "headline": "JUST IN: Why Nnamdi Kanu Won’t Be Allowed To Wear Clothes With Lion Head Image – SSS",
    "summarized_story": "JUST IN: Why Nnamdi Kanu Won’t Be Allowed To Wear Clothes With Lion Head Image – SSSThe State Security Service (SSS), on Wednesday, told the Federal High Court in Abuja that Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), cannot wear clothes with an insignia of a lion’s head.\nMr Kanu was accused of various offences, including treasonable felony and terrorism, offences he allegedly committed in the course of his separatist campaigns.\nMrs Nyako had ordered the SSS to allow Mr Kanu change his clothes from the regular Fendi jumpsuit he had been wearing to court.\n“My Lord, clothes that were brought for the defendant had lion’s head embroiled on them, and the defendant (Mr Kanu) can’t wear clothes with a lion’s head,” he said.\nThe secret service’s lawyer explained that “clothes with lion’s head offend the standard operating procedures” of the SSS."
  },
  {
    "headline": "House Of Reps Test Runs Electronic Voting Device",
    "summarized_story": "The House of Representatives conducted a test run of the electronic voting equipment on Wednesday, ahead of a vote on a constitutional change.\nFemi Gbajabiamila, Speaker of the House, stated that the lower chamber of the legislative Assembly would ensure the machine’s effectiveness before voting day.\nThe purpose of the test was to eliminate any uncertainty during voting on highly contentious subjects, as the Constitution is normally considered clause by clause, with the presiding officer having no influence on the voting.\nThe method of voting in the constitutional amendment is normally done through electronic voting through a screen put in plain view of members, according to the DAILY POST.\nThe amendment to the Constitution is now being worked on by both the upper and lower legislative chambers."
  },
  {
    "headline": "PHOTOS: Family Members In Court As Nnamdi Kanu’s Trial Resumes",
    "summarized_story": "The trial of Nnamdi Kanu, the leader of the proscribed Indigenous People of Biafra (IPOB), continued on Wednesday in Abuja’s Federal High Court, with his family present.\nDespite the trial judge, Justice Binta Nyako, ordering the DSS to allow Mr Kanu to change his clothes before his next appearance in court, Mr Kanu appeared in court wearing his customary Fendi costume.\nKanu’s younger brother has been denied entry to the DSS facility where Kanu is being held three times, according to Ozekhome.\nThe court is now hearing an application challenging the legality of Nnamdi Kanu’s trial as well as the competence of the charges brought against him at the time of this report.\nIn the courtroom, see images of Nnamdi Kanu and his family…"
  },
  {
    "headline": "Breaking: Salah scores as Liverpool tame Inter Milan, edge closer to Champions League quarter-final berth",
    "summarized_story": "Liverpool took a huge step towards the Champions League quarter-finals after scoring two late goals against Inter Milan in the San Siro.\nItalian champions Inter hit the bar through Hakan Çalhanoglu and were on top for long periods of the second half before Firmino struck in the 75th minute.\nBut Jurgen Klopp’s team had to dig deep as Inter looked the more threatening side after a strong start by the Premier League club.\nIn a fascinating match, Liverpool – who gave 18-year-old Harvey Elliott his first Champions League start – took the lead through Firmino’s glancing 75th-minute header before Salah doubled the lead eight minutes later.\nThere is still work to do for Klopp’s team but it is going to require something extra special from Inter to turn this tie around."
  },
  {
    "headline": "APC chair: Divided govs settle for North-central, zone scribe to South-south",
    "summarized_story": "Governors elected on the All Progressives Congress (APC) platform have zoned the position of the national chairman of the party to the North-central.\nThe governor s, who met under the aegis of Progressive Governors Forum (PGF), took the decision ahead of the February 26 APC National Convention.\nAPC had slated February 26, 2022 for its national convention in Abuja, but the issue of zoning has remained a major challenge the needed to contend with to avoid self-implosion.\n“The Forum of APC Aspirants for 2022 National Convention writes to intimate Your Excellency on the true state of affairs with the National Convention of our great party, the All Progressive Congress (APC).\nWhatever crises the party faces nationally today were birthed at the state levels owing to the overbearing disposition of some state governors."
  },
  {
    "headline": "22 kidnapped, as Police nab 2 bandits who amputate captive",
    "summarized_story": "Bandits launched an attack on Idon town in Kajuru local government area of Kaduna state in the early hours of Wednesday kidnapping 22 people, while injuring four others.\nThis was just as Kaduna state Police Command disclosed said that its men on Tuesday arrested two notorious bandits who amputate their captive around Sabon Gaya Village Chikun local government, along the Kaduna-Abuja highway.\n“After the attack, the following people were abducted; Justina Joseph, Mary Joseph, Rejoice Joseph, Stephen Joseph Samson Ladan, Christiana David, Boniface David, Helen Aminu, Mirabel Aminu, Precious Philemon, Nelson Philemon, Christian Philemon.\n“The criminal elements were apprehended around Sabon Gaya village in Chikun LGA of Kaduna state.\n“However, preliminary investigation so far reveals the identity of the bandits as Dini Samaila a.k.a Yellow 15yrs and Musa Bature."
  },
  {
    "headline": "NNPC Insists Toxic Petrol Not Imported Deliberately, Says Fuel Scarcity To End Soon",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) says the recent importation of toxic Premium Motor Spirit (PMS), popularly known as petrol, into the country was not deliberate.\nThe NNPC chief assured Nigerians that about 2.1 billion litres of the product would have been injected into the system before the end of the month.\n“By the end of this month, we will have up to 2.1 billion litres of PMS in this country (that will not contain methanol).\nNNPC Group Executive Director (Downstream), Mr Adetunji Adeyemi, who briefed reporters on Tuesday in Abuja, stated that the company was already accelerating petrol distribution.\nStressing that several million litres of petrol were in stock, he revealed that the NNPC was expecting about 2.3 billion litres of petrol in the country by the end of the month."
  },
  {
    "headline": "Strike: FG Ready To Resolve Outstanding Issues With ASUU – Education Minister",
    "summarized_story": "The Minister of Education, Adamu Adamu, on Wednesday said he is willing to reach an agreement with the striking university lecturers under the aegis of the Academic Staff Union of Universities (ASUU).\nPeaceful ResolutionWhile maintaining his resolve to reach an agreement with the union, Adamu believes there is always a solution to every problem.\nWe want a peaceful resolution.”The minister also reacted to several accusations by ASUU, including claims that he has consistently shunned the negotiation meetings but sends representatives.\nWhen asked if the government would reach an agreement with ASUU before the end of the 30-day strike, the minister said he doesn’t know.\n“I am ready to reach an agreement with ASUU now, but since I’m not the only one, I can’t give you time."
  },
  {
    "headline": "Why Nnamdi Kanu Is Not Allowed To Change His Clothes – DSS",
    "summarized_story": "The trial of the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu resumed on Wednesday at the Federal High Court in Abuja with him wearing his regular Fendi outfit.\n﻿Mike Ozekhome, the lawyer to Mr Kanu, also complained to the court that the DSS have refused to allow Kanu a change of clothes contrary to a definite order of the court that he must be allowed to wear a new outfit.\n﻿“My Lord, clothes that were brought for the defendant had lion’s head embroiled on them, and the defendant (Mr Kanu) can’t wear clothes with a lion’s head,” he said.\nCounsel to Nnamdi Kanu, Mike Ozekhome complained to the court that the DSS have refused to allow Kanu a change clothes.\nHe added that, thrice, Kanu’s younger brother has been refused access to DSS facility where Kanu was detained."
  },
  {
    "headline": "Reps To Probe Nigerian Correctional Service Over Welfare Of Staff, Inmates",
    "summarized_story": "The House of Representatives has mandated its Committee on Reformation Services to investigate the state of the Nigerian Correctional Service.\nThe development on Wednesday followed a motion of urgent national importance by the minority leader, Ndudi Elumelu.\nRead Also: Father Alleges ‘Massive Cover Up’ In Sylvester Oromoni’s DeathDuring plenary, concerns were raised about the “deteriorating” working conditions of staff, as well as the welfare of inmates.\nThe lawmakers also noted that the Arms Unit of the service still parades substandard weapons, despite the N1 billion budget provision in the 2020/2021 budget."
  },
  {
    "headline": "Kaduna Residents Groan As Black Marketers Sell Petrol At N1,000/Litre",
    "summarized_story": "Residents of Kaduna groaned on Wednesday as black marketers sell Premium Motor Spirit, popularly known as petrol for N1,000 per litre in parts of the state.\nThis comes amid the fuel scarcity that hit the country recently and has yet to abate.\nChannels Television observed that motorists continue to queue for hours at petrol stations to buy the product.\nHe, therefore, called on the Federal Government and state authorities to tackle the fuel scarcity for the overall good of Nigerians.\nMost of the people cannot travel because of this fuel scarcity,” he said."
  },
  {
    "headline": "Ango Abdullahi meets Obasanjo says \"We must strategize for the good of Nigeria\" -",
    "summarized_story": "The Convener of the Northern Elders Forum (NEF), Prof. Ango Abdullahi has disclosed that the country needed good tidings from the 2023 elections, hence the need to strategize.\nAbdullahi made this disclosure after about two hour meeting with former President, Chief Olusegun Obasanjo in Abeokuta on Tuesday evening.\nAdvertisementThis was contained in a release by Special Assistant on Media to the former President, Kehinde Akinyemi on Wednesday.\nYou are in the media and you know what we have been saying about the situation in the country.\nThings are not good enough and as we head for 2023, we hope to be strategizing for the good of the nation.”"
  },
  {
    "headline": "Just In: Reps probe cause(s) of petrol scarcity",
    "summarized_story": "The House of Representatives has launched an investigation into the cause(s) of petrol scarcity across the country.\nThe importation of adulterated Premium Motor Spirits into the country has caused scarcity of the product across the with a litre sold between N250 and N300 in many places.\nAdvertisementMeanwhile, members of the house of representatives will vote on clause by clause amendment to 1999 Constitution on Wednesday.\nAlso, President Muhammadu Buhari has translitted the 2022 Supplementary Budget to House of representatives for consideration."
  },
  {
    "headline": "Zamfara CJ inaugurates 7-man committee to investigate deputy Gov -",
    "summarized_story": "Zamfara State Chief Judge, Kulu Aliyu has Inaugurated a seven man committee to Investigate allegations against the State Deputy Governor Mahdi Aliyu Gusau.\nThe Committee is chaired by retired Justice Halidu Tanko Soba.\nAdvertisementShe adds that the Committee members are of unquestionable integrity and not been members of any public service, legislative Houses or political party.\nThis Development is coming five days after the Zamfara state House of Assembly request the state chief judge to Set up a Committee to Investigate Deputy Governor Mahdi Aliyu Gusau.\nAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of gross misconduct, abuse of office among other thingsAdvertisementIt is coming amidst move by the Zamfara State House of Assembly to Impeach the Mahdi Aliyu as the state Deputy GovernorAdvertisementA federal high court in Abuja had in November last year restrained the Zamfara State House of Assembly from from any move to impeach the deputy Governor."
  },
  {
    "headline": "Nigeria's problem needs immediate change in leadership",
    "summarized_story": "Presidential aspirant on the platform of the opposition People’s Democratic Party, Sam Ohuabunwa visited former military President Ibrahim Babangida in his hilltop residence in Minna, Niger State.\nSpeaking to journalists after the closed door meeting he said Nigeria’s problem needs immediate change in leadership.\nAdvertisementThis is why Mazi Sam Ohuabunwa is visiting former president Ibrahim Badamosi Babangida.\nThe state party chairman Tanko Beji while receiving the aspirant at the party secretariat pledged his support noting that the chapter is ready to support all aspirants to give them equal opportunities.\nAdvertisementWith so many people indicating interest to represent the party at the polls getting a nod from the stalwarts is becomes paramount for aspirants."
  },
  {
    "headline": "Dele Farotimi: Nigeria Cannot Move Forward Without Restructuring",
    "summarized_story": "On Monday, Deputy Commissioner of Police, Abba Kyari, was found out and subsequently arrested illicit drug trafficking and attempting to bribe an NDLEA officer.\nKyari already faces indictment for his alleged involvement with advance fee fraudster, Ramon Abbas, also known as Hushpuppi, and faces possible extradition to the U.S. to stand trial.\nThe disgraced officer was caught in a sting operation over his involvement with an international drug cartel that operates the Brazil-Ethiopia-Nigeria illicit drug pipeline.\nTo discuss the latest saga involving Kyari, what this says about the Nigerian socio-political landscape and the upcoming elections, is Dele Farotimi, a lawyer, political and civil rights activist.\nMr Farotimi also shares his views on the Electoral Act (Amendment) Bill, which President Muhammadu Buhari is accused of ignoring since it was sent to him by the National Assembly."
  },
  {
    "headline": "Wanda Sykes, Amy Schumer and Regina Hall To Host The 2022 Oscars",
    "summarized_story": "After a subdued three year covid impacted Oscars award, that witnessed a noticeable absence of a primary host, the producers have decided to get closer to pre covid events by announcing Wanda Sykes, Amy Schumer and Regina Hall as host for the Oscars awards scheduled to hold in March 2020."
  },
  {
    "headline": "Amaechi’s Panel Clears Hadiza Bala-Usman Of Fraud – Trending With Ojy Okpe",
    "summarized_story": "Hadiza Bala Usman, the former managing director of the Nigerian Ports Authority yesterday, was cleared of allegations of failing to remit 165 billion Naira operating surplus, to the coffers of the federal government.\nFrancis Waive, a lawmaker from Delta state, has presented a bill to the House of Representatives, seeking to replace the punishment for attempted suicide.\nIn South Africa, a proposal at a female secondary school has generated debates on social media.\nThe proposal took place ahead of Valantine’s day in front of the school yard, during school hours."
  },
  {
    "headline": "With New $250m Funding, Flutterwave Now Highest-Valued African Startup at Over $3bn – Arise News",
    "summarized_story": "Flutterwave, a leading technology company, announced on Tuesday that it has raised $250 million in Series D funding, valuing the company at over $3 billion as the brand continues to transform the way Africans transact on the continent and worldwide.\nFlutterwave has become the highest valued African startup with this investment.\nIt is also a huge endorsement in the growth of the business, innovation and technology landscape in Africa.\nFlutterwave’s latest backers include some of the world’s most respected investors led by B Capital Group, and with participation from Alta Park Capital, Whale Rock Capital, Lux Capital, among others.\nThis latest funding demonstrates the conv iction of some of the world’s leading investors in both our business model, team and the Africa technology market."
  },
  {
    "headline": "Russian Olympian Valieva Had Three Heart Drugs in Her System: Report",
    "summarized_story": "The drug, commonly used to treat angina, has been prohibited by the World Anti-Doping Agency since 2014 for its potential to enhance blood flow and aid endurance.\nIn 2019, the US Anti-Doping Agency suspended track coach Alberto Salazar for four years — later extended to a lifetime ban — for improperly using substances including L-carnitine.\nThe World Anti-Doping Agency has announced that it is investigating the entourage surrounding Valieva.\nThe panel rejected appeals by WADA, the International Olympic Committee and the International Skating Union to reinstate a suspension that was originally levied but then removed by Russian anti-doping authorities.\nHowever, the IOC has announced that no medals will be distributed to any athletes if Valieva reaches the podium."
  }
]