[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Poor infrastructure affecting our money transfer business – Postmaster-General",
    "summarized_story": "What is NIPOST doing currently to rebrand logistics in Nigeria?\nThe problem that happened following the pandemic was that the entire global postal operations stopped because of the closure of several borders.\nWhat is NIPOST doing to ensure that dangerous/contraband weapons and equipment are not moved from one point to another via courier or mail?\nDuring the meeting, they told us that the problem with many of the courier logistics operators in the country is that in many instances they use those motorcycles to traffic drugs and weapons.\nFor instance, NIPOST is also involved in the distribution of support to the rural community through the cash transfer programme."
  },
  {
    "headline": "FAAC allocation drops to N2.1tn in three months",
    "summarized_story": "Data collated from different reports of the National Bureau of Statistics showed that in January 2022, the FAAC disbursed N766.47bn to the three tiers of government.\nThis was from the total revenue generated in December 2021.\nIn February 2022, the FAAC disbursed the sum of N692.86bn to the three tiers of government from the total revenue generated in January 2022.\nFigures for March 2022 showed that the FAAC disbursed the sum of N722.38bn to the three tiers of government from the total revenue generated in February 2022.\nCumulatively, the sum of N2.18trn was disbursed by the FAAC to the three arms of government in the first three months of 2022."
  },
  {
    "headline": "We can’t be intimidated, CAN tells Tinubu over choice of Shettima as running mate",
    "summarized_story": "By Luminous Jannamike, AbujaThe Christian Association of Nigeria, CAN, said it was not moved by the announcement of Senator Kashim Shettima as the running mate of the All Progressives Congress, APC, presidential candidate, Asiwaju Bola Tinubu.\nThe umbrella Christian organisation said its leaders were determined to stand their ground against every form of intimidation, including the floating of a Muslim-Muslim presidential ticket by the political party.\n“We’ll escalate this issue because our call for fairness and the balancing of the presidential ticket for the sake justice, unity and fairness apparently fell on deaf ears.\nWe will not be moved by any form of intimidation,” the CAN leader in the Northern region added.\nHe reiterated that a more profound reaction would be made available to the public through the media soon."
  },
  {
    "headline": "Abia 2023: My candidature not in dispute – Ikechi Emenike",
    "summarized_story": "God said Emenike ‘ll be Abia’s next gov – Rep OnyejeochaBy Steve OkoThe governorship candidate of the All Progressive Congress, APC, in Abia State, High Chief Ikechi Emenike, has said that his candidacy has never been in dispute, insisting that contrary to any claim by anybody, he is the authentic flag bearer of the party in the 2023 Abia governorship contest.\nEmenike advised media organisations against addressing any other person as Abia APC governorship candidate as the party has only one governorship flag bearer in the state.\nThe APC governorship candidate urged his supporters not to discriminate against the returnees or tag them moles of other parties but to concede positions to thrm where necessary as part of sacrifices for unity.\nGod has said that Chief Ikechi Emenike will be next Abia Governor.\nThe former party Chairman also said that APC in Abia had only one recognised leadership under the chairmanship of Dr Kingsley Ononogbu."
  },
  {
    "headline": "Ortom making passionate case for helpless Nigerians on global stage",
    "summarized_story": "Only two weeks ago, Governor Ortom spoke on two television programmes – Arise News and Channels TV.\nThose who had thrown darts at the Benue State Governor have now put their tails between their legs.\nThrough the enactment of the Open Grazing Prohibition and Ranches Establishment Law, 2017, Benue bade farewell to open grazing to welcome ranching.\nWhen Governor Ortom advocated licensing of AK-47 to private individuals for self-defence, it first appeared as though it was an unpopular opinion.\nIt is worthy of note that when the Benue State Governor speaks, he speaks the minds of the majority of Nigerians and from the information at his disposal."
  },
  {
    "headline": "We ‘ll shut power sector if NLC declares action – Electricity workers",
    "summarized_story": "By Victor Ahiuma-YoungWorkers in the nation’s Power sector have threatened to shut electricity supply in the country should Nigeria Labour Congress, NLC, declare a nationwide protest over the protracted industrial crises in the country’s educational sector.\n“NUEE therefore calls on the Federal Government to address all issues concerning non implementation of Agreements and others affecting Nigeria’s hallowed Tertiary Institutions.\n“The nation that is committed to human capital development does not toy with the Education, training and manpower need of its Youth population.\n“The laissez-faire attitude of the Government whether in the States or National towards the continued closure of schools is a sorry state in the process of our development towards nationhood.\n“It is through education that this nation Nigeria could be pulled out of the current duldroms and be positioned towards Socio-economic and Technical development of the next millennium."
  },
  {
    "headline": "2023: FHC okays virtual hearing of cases, service of hearing notice by email",
    "summarized_story": "By Ikechukwu NnochiriIn a bid to fast track the resolution of election related matters, the Federal High Court, has issued new practice directions that allows for virtual hearing of cases and electronic service of notices on lawyers.\nIt provides that interlocutory issues touching on the jurisdiction of the Court, shall be suspended and delivered at the stage of final judgment.\n“This Practice Directions shall apply notwithstanding the provisions of the Federal High Court (Civil Procedure) Rules, 2019.\n“Any amendment to the Originating Summons may be made with the leave of Court within 7 (seven) days of service of the Respondent’s Reply.\nOn service of processes, the new rules, provides that a party shall not serve a notice of an application on another party on the date scheduled for hearing."
  },
  {
    "headline": "Osun: Nigerians don’t have money to buy weapons – Adeleke",
    "summarized_story": "Ademola Adeleke, the Peoples Democratic Party, PDP, governorship candidate in Osun State, has said he will bring back community policing to solve the insecurity in his state if elected governor.\nAdeleke said this while appearing on Channels TV for Osun State governorship debate on Sunday.\nAccording to him, Nigerians do not have the money to own guns to protect themselves even if the senate approves such.\nHe said: “Nigerians don’t even have the money to buy weapons.\nI will promote community policing."
  },
  {
    "headline": "FG was anticipating Barkindo’s post-OPEC intervention in local oil industry – SGF",
    "summarized_story": "The Federal Government was anticipating how Secretary General of Organisation of Petroleum Exporting Countries (OPEC), Mohammadu Barkindo, would use his expertise for the benefit of Nigeria’s local oil industry when he suddenly died.\nSecretary to the Government of the Federation (SGF), Boss Mustapha, stated this in the Adamawa State capital, Yola, on Sunday when he paid a condolence visit to the Lamido Adamawa, Alhaji Muhammad Aliyu Musfafa.\nBarkindo, who had died on the night of July 5, was flown to Yola, his home town and buried the following day, July 6.\n“Oil prices are up but we can’t see the benefits translated to the daily needs of our people because of the heavy loans under recovery (subsidy) being paid.\n“He (Barkindo) would have been helpful to Nigeria, especially in dealing with challenges of meeting the OPEC quota,” the SGF said."
  },
  {
    "headline": "Tinubu/Shetima ticket: Incentive for Boko Haram, ISWAP to thrive – Adegoruwa",
    "summarized_story": "A Senior Advocate of Nigeria, Ebun-Olu Adegoruwa, has reacted to the Muslim-Muslim ticket by the All Progressives Congress, APC, presidential flag bearer, Senator Bola Ahmed Tinubu, describing it as a terrible choice.\nAdegoruwa in a statement on Sunday, said the latest move by Tinubu and his party is insensitive and a wrong choice in several ways.\nHe said: “Nigerians, whether muslims, christians, traditionalists, should reject APC with their votes come 2023 because a Muslim-Muslim ticket in present-day Nigeria is fuel for Boko Haram, incentive for ISWAP and a call for terrorism to thrive more.\nRecall that it has been confirmed that Tinubu picked former Borno State Governor, Kashim Shetima as his running mate for the presidential election slated for next year 2023.\nThe choice comes even as the Christian Association of Nigerian CAN has repeatedly warned against candidates standing for election under the same religious background."
  },
  {
    "headline": "2023 presidency: Tinubu made wisest choice on Shettima as running mate – Zulum",
    "summarized_story": "Borno State Governor, Babagana Zulum, has commended the All Progressives Congress, APC, presidential candidate, Bola Tinubu, for picking Kashim Shettima as his running mate.\nZulum said Tinubu made the wisest choice by picking Shettima as his running mate.\n“It has been my greatest wish that Kashim Shettima gets this elevation that he so much deserves as one of Nigeria’s highly patriotic leaders.\n“For me, and I am sure for many leaders and members of the APC, Tinubu’s choice of HE Kashim Shettima is the wisest choice at this point in time.\nZulum described Shettima as a patriotic individual with a deep sense of the country’s economy."
  },
  {
    "headline": "Kidnapped daughter of Adamawa pastor released day of murdered siblings’ burial",
    "summarized_story": "The daughter of an Adamawa pastor, Daniel Umaru kidnapped the day her father was shot and two brothers murdered, has been released.\nDAILY POST gathered on Sunday that 13-year-old Ijagla was released on Saturday as her two brothers who were shot dead by the gunmen who also shot her father and took her away, were being buried.\nPastor Umaru’s daughter got her freedom after “a huge ransom” was paid to the kidnappers, according to a source who did not mention the amount.\nGunmen had stormed the residence of Umaru of the ‘Eklesiya Yan’uwa A Nigeria’ (EYN); otherwise known as Church of the Brethren in Nigeria, on July 5 at Njairi, a community in Mubi Local Government Area and shot the father of the house (the pastor) and his two sons before carrying the daughter, Ijagla, away.\nThe sons died instantly, leaving the father who is now at a medical facility battling to live, and mother who is also in hospital being treated for trauma."
  },
  {
    "headline": "CBN tightens e-payment rules for banks The Nation Newspaper",
    "summarized_story": "Flouting the rules guiding e-payment product development by banks will henceforth attract sanctions, the Central Bank of Nigeria (CBN) has warned.\nThe new rules tagged “Digital Financial Services Awareness Guidelines” are primarily packaged to ensure that customers get value for their deposits.\nIn the guidelines released at the weekend, the CBN directed banks to first seek its approval for their e-payment product and service development.\nThe apex bank said the directive aligns with the digital financial services awareness scheme meant to bridge the gaps in consumer knowledge and practices for e-products.\nIt explained that digital financial services have the potential to expand access to financial services for the Nigerian population and spur innovation in the financial service industry."
  },
  {
    "headline": "DHQ tackles Fani-Kayode over allegations against military The Nation Newspaper",
    "summarized_story": "In all these allegations, Mr Fani-Kayode is merely playing to the gallery.\nIt is said that Mr Fani-Kayode is ignorant of whose responsibility it is to guard the prison.\nMr Fani-Kayode is encouraged to pay more attention to the weekly briefs by Defence Media Operations.\n“Finally, in a miserable attempt to malign the leadership of the military, Mr Fani-Kayode gave the impression that while junior military commanders and non-commissioned officers are working hard, senior commanders are doing nothing.\nMr Fani-Kayode is completely oblivious of the fact that in the military, orders, instructions and directives are issued from the hierarchy to the lower rungs of command."
  },
  {
    "headline": "Uzodimma selling off my personal vehicles, Okorocha alleges The Nation Newspaper",
    "summarized_story": "The Senator representing Imo West Senatorial Zone, Owelle Rochas Okorocha, yesterday accused Imo State Governor Hope Uzodimma of auctioning his personal cars, those of his aides and Rochas Foundation College.\nOkorocha said the vehicles were impounded when his wife’s Royal Palm Hotel was sealed by the state government in 2021.\nHe called on Inspector-General of Police Alkali Usman to direct the Imo State Police Commissioner, Mohammed Barde, to recover the vehicles and documents in them.\nThe Police have some explanations to make.”But the state’s Information and Strategy Commissioner, Declan Emelumba, told the Nation that Okorocha was raising a false alarm.\nHe said that Royal Palm Hotel which has yet to be unsealed is now government property."
  },
  {
    "headline": "Non-issuance of white paper delays 65-year retirement age in 34 states The Nation Newspaper",
    "summarized_story": "Thirty-four states are yet to commence the implementation of the 65-year retirement and 40-year condition of service benefits, three months after it was signed into law by President Muhammadu Buhari.\nThe government extended teachers’ retirement age to 65 and their duration of service from 35 to 40 years.\n“Once it is gazetted, the white paper will be issued.\n“But now, as it is, states are just doing it based on the approval that was done by Mr president.\nAt some point, some states said there is no white paper in that regard."
  },
  {
    "headline": "Gunmen kill 19 in 'random' bar shootings in South Africa The Nation Newspaper",
    "summarized_story": "Gunmen killed 19 people in two apparently random shootings within hours of each other at taverns in South Africa, police said yesterday.\nSouth Africa, home to about 60 million people, is one of the world’s most violent countries with 20,000 people murdered every year, one of the highest per-capita murder rates globally.\n“I’m so heartbroken,” said the 59-year-old gardener, adding that Sthemibiso’s girlfriend had arrived on the scene shortly after the shooting to find him still breathing.\nPolice confirmed a second apparently random shooting hours earlier, at around 8:30 p.m. on Saturday, in a tavern in Pietermaritzburg, 500 km southeast of Soweto, which saw four people killed and eight wounded.\nThere are about 3 million guns registered in the country, according to campaign group Gun Free South Africa, though many more are thought to be circulating on the black market."
  },
  {
    "headline": "CAN, others kick as Tinubu picks Muslim running mate",
    "summarized_story": "However, the decision to settle for a Muslim-Muslim ticket has elicited wide condemnations from Christians and Northern minorities.\nThe APC flag bearer arrived Daura to pay Sallah homage to President Buhari who arrived his home town on Friday.\n”APC, Tinubu misfiredPDP chieftain and former presidential aspirant, Alhaji Isa Saulawa, described the Muslim-Muslim ticket as signifying victory for his party, the PDP.\nThere is nothing wrong with Muslim-Muslim ticket or Christian-Christian ticket in a democratic setting.\n“If you take Kaduna State as a case study, you see that the Muslim-Muslim ticket is viable where the governor is Muslim and the deputy is also Muslim."
  },
  {
    "headline": "Lagos boat mishap: Death toll rises to 17",
    "summarized_story": "The National Emergency Management Agency (NEMA), yesterday said that 13 more bodies were recovered from the ill-fated boat sailing from Mile 2 to Ibeshe, a suburb of Lagos, on Saturday.\n“Late yesterday night, two more bodies were recovered in addition to the two earlier recovered in the morning.\nThe coordinator decried illegal boat operators plying the waterways beyond the stipulated official hours which he said leads to avoidable deaths.\n“It was revealed that the regulatory bodies have tried to stamp out illegal operations of small boat operators, who hardly use life jackets after official hours.\nBut it is only at this odd hour that illegal operators always put the lives of unsuspecting passengers at risk,’’ Farinloye said."
  },
  {
    "headline": "Nationwide shutdown of electricity, railway imminent over ASUU, others",
    "summarized_story": "According to the union, the industrial action is undoubtedly exposing the students to all forms of negative vices inimical to nation-building.\nNUEE charged government to address all issues concerning non-implementation of agreements and other matters affecting Nigeria’s tertiary education institutions.\nThe Federal Government should always remember that an idle hand is the devil’s workshop,” the union said.\nMeanwhile, the railway workers said they may be compelled to embark on a total and indefinite strike any moment from now to challenge the insensitivity of the management and the board of Nigerian Railway Corporation to the welfare and wellbeing of the railway workers.\n“The review committee worked inconclusively and, till now, there is no known standard condition of service in the rail transport industry."
  },
  {
    "headline": "Security beef-up as NSCDC hints of ISWAP planned attacks",
    "summarized_story": "From Romanus Ugwu, and Molly Kilete, AbujaThe Federal Government has beefed up security within the Federal Capital Territory (FCT) following a security alert on fresh terrorists’ attacks by the Nigerian Security and Civil Defence Corps (NSCDC).\n“Intelligence abounds that ISWAP terrorist group has claimed responsibilities of the Tuesday July 5, 2022 attack on Kuje Medium Security Custodial Centre, releasing their adherent members.\n“Every security agency gives intelligence report to the concerned authority from time to time and this one from the NSCDC is not an exception.\nIt is just a security measures that we are taking,” she said.\nSimilarly, the commander Guards Brigade, Nigerian Army, Brigadier General Usman, called on resident continue to be security conscious and report any suspicious movement to the security agencies."
  },
  {
    "headline": "Osun: Oyetola, 4 other governorship candidates speak on security, economy, others",
    "summarized_story": "From Lateef Dada, Osogbo and Molly Kilete, AbujaFive governorship candidates in Osun State, yesterday, spoke on their plans to improve the security of the state, raise the economy and others if elected on July 16.\nI will create 100,000 jobs.”He told other contestants to step down for him, saying, “I will collaborate with all security operatives and recruit more Amotekun.\nOn security, Oyetola said: “We have the joint task force that takes care of armed robbery, kidnapping and banditry.\nDIG Kokumo, supervisory DIG for the South-West Geo-Political Zone, is to be assisted by four Assistant Inspectors-General of Police, four Commissioners of Police, 15 Deputy Commissioners of Police, and 30 Assistant Commissioners of Police.\nForce Force Public Relations Officer, Muyiwa Adejobi, in statement, said the IGP has also ordered deployment of adequate police personnel in the ranks of Chief Superintendents of Police and below to ensure a crisis free election."
  },
  {
    "headline": "Raheem Sterling Set for Chelsea Medical with £50m Deal – THISDAYLIVE",
    "summarized_story": "Raheem Sterling is set to undergo a medical at Chelsea ahead of a £50million move from Manchester City, 90min reports.\nSterling is departing the Etihad Stadium following a hugely successful seven years where he has helped City win four Premier League titles.\nIt is understood that Chelsea will be paying around £50m for Sterling’s services, whose City contract is set to expire at the end of the season.\nSources have told 90min that Sterling will undergo a medical in the near future, likely within 48 hours.\nThe Leeds winger favours a switch to Barça, but Chelsea are ready to pounce if he changes his mind."
  },
  {
    "headline": "Djokovic Beats Kyrgios to Win Fourth Consecutive Wimbledon Title – THISDAYLIVE",
    "summarized_story": "Novak Djokovic underlined his recent dominance at Wimbledon with a composed and controlled fightback against Australia’s Nick Kyrgios to win a fourth consecutive men’s singles title yesterday.\nSerbia’s Djokovic, 35, lost the first set after some incredible serving from Kyrgios, but ended up winning 4-6 6-3 6-4 7-6 (7-3) on Centre Court.\nIt is Djokovic’s seventh SW19 men’s title and only Roger Federer has more.\nWhile Kyrgios increasingly remonstrated with his support team, Djokovic remained cool in the heat of the battle on a scorching Centre Court.\nThe pair have also had an uneasy relationship in the past, with Kyrgios last year branding Djokovic a “tool” and a “strange cat”."
  },
  {
    "headline": "Nigeria Draw Cameroon in Battle for World Cup Ticket – THISDAYLIVE",
    "summarized_story": "On record, the neighbouring countries have met 12 times with Nigeria winning 10 times, drew once and lost just one time to the emerging power house in African football.\nBoth sides did not meet again until 1998 when Nigeria hosted the tournament in Ijebu-Ode and Kaduna and Falcons recorded 6-0 win against Cameroon at the Ahmadu Bello Stadium where the two semi-final matches were played.\nNigeria won 3-0 again in the group phase in South Africa in 2000 and four years later in the Rainbow nation both side played out 2-2 draw in the group phase and qualified into the knockout stage.\nBut 2014 in Namibia, Nigeria bounced back to winning way with a 2-0 victory Just Falcons won by a lone goal in 2016 edition hosted by Cameroon with only goal scored by Desire Oparanozie.\nAt the last edition in Ghana, both teams played out a goalless semi final clash but Nigeria won 4-2 on penalties and went ahead to win the cup against South Africa in the final match."
  },
  {
    "headline": "Elephant Girls Lift Sam Oguche Basketball Tourney – THISDAYLIVE",
    "summarized_story": "FirstBank Female Basketball team, the Elephants Girls, proved once again that they are a team to reckon with in the Nigeria basketball circle with their victory over the hard fighting MFM Queens in the final of Sam Oguche Basketball competition.\nThe Second quarter saw the Bankers consolidating their hold on the lead with another excellent performance winning 28-14.\nThough the MFM Queens fought back in the third quarter, but their resolve had little or no effect as FirstBank Female Basketball team held on to the lead.\nSatisfied with the performance of her girls, Coach Lati Erinfolami said the team will continue to work hard to maintain the high standard they are noted for.\nThe girls were determined to excel and that was why they dominated from the beginning to the end."
  },
  {
    "headline": "Road to NPFL: Alli Calls for Massive Support Against Ikorodu City – THISDAYLIVE",
    "summarized_story": "The Sports Commission boss made the call ahead of the club’s crucial fixture against Ikorodu Utd FC.\nThe Benin Arsenals need just three points to seal their promotion ticket to NPFL and a win against Ikorodu Utd FC on Wednesday would guarantee that.\nThe fans have shown tremendous support and understanding this season and this match against Ikorodu will be fitting end to a glorious outing.\nInsurance are currently leading Group B1 with 43 points, seven points clear of closest rivals, Gateway Utdwho will also be in another away game versus Vandrezzer FC.\nThe Benin Arsenal gained promotion to NPFL in 2018/2019 after 11 years i but could not sustain their stay and were relegated immediately."
  },
  {
    "headline": "BREAKING: APC Presidential Candidate, Tinubu Picks Former Borno Governor, Shettima As Running Mate, Travels To Daura To Inform Buhari",
    "summarized_story": "There are indications that the All Progressives Congress presidential candidate for the 2023 elections, Bola Tinubu has finally settled for a Muslim - Muslim ticket, by picking former governor of Borno State, Senator Kashim Shettima as his running mate.\nSaharaReporters gathered that Tinubu had wanted to pick the incumbent governor of Borno, Babagana Zulum as the running mate but he reportedly pleaded that his mentor, Shettima should rather be picked.\nA source in the APC told SaharaReporters that Bola Tinubu had gone to Daura, Katsina State to inform President Muhammadu Buhari about his final choice.\n\"Tinubu has picked Kashim Shettima former Borno State governor as his running mate.\n\"I was thinking he might pick Zulum the current Borno State governor."
  },
  {
    "headline": "BREAKING: APC Presidential Candidate, Tinubu Picks Former Borno Governor, Shettima As Running Mate, Travels To Daura To Inform Buhari",
    "summarized_story": "There are indications that the All Progressives Congress presidential candidate for the 2023 elections, Bola Tinubu has finally settled for a Muslim - Muslim ticket, by picking former governor of Borno State, Senator Kashim Shettima as his running mate.\nSaharaReporters gathered that Tinubu had wanted to pick the incumbent governor of Borno, Babagana Zulum as the running mate but he reportedly pleaded that his mentor, Shettima should rather be picked.\nA source in the APC told SaharaReporters that Bola Tinubu had gone to Daura, Katsina State to inform President Muhammadu Buhari about his final choice.\n\"Tinubu has picked Kashim Shettima former Borno State governor as his running mate.\n\"I was thinking he might pick Zulum the current Borno State governor."
  },
  {
    "headline": "ISWAP Terrorists Planning To Attack Christians, Targets In Nigerian Capital, Abuja, Released Kuje Jihadists To Pursue Goal—Civil Defence, NSCDC",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has raised the alarm over planned attacks by the Islamic State in West Africa Province (ISWAP) terrorists on selected targets in the Federal Capital Territory, Abuja.\nIt also said that the Islamic terrorists had declared war against Christians in Nigeria, saying that was why they attacked the Kuje Correctional Centre and released some of their fighters to sustain the attack.\nThe letter obtained by Leadership which SaharaReporters sighted on Sunday, was dated July 8, 2022, and titled: \"Security Alert: Renewed Threat Of Attack By ISWAP Terrorist On Targets within The FCT\".\n\"Intelligence abounds that ISWAP terrorist group has claimed responsibilities of the Tuesday 5th of July, 2022 attack on Kuje medium security custodial centre, releasing their adherent members.\nLast Tuesday, ISWAP terrorists attacked Mike Correctional Centre, freeing hundreds of inmates, including Jihadists held at the prison facility."
  },
  {
    "headline": "ISWAP Terrorists Planning To Attack Christians, Targets In Nigerian Capital, Abuja, Released Kuje Jihadists To Pursue Goal—Civil Defence, NSCDC",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has raised the alarm over planned attacks by the Islamic State in West Africa Province (ISWAP) terrorists on selected targets in the Federal Capital Territory, Abuja.\nIt also said that the Islamic terrorists had declared war against Christians in Nigeria, saying that was why they attacked the Kuje Correctional Centre and released some of their fighters to sustain the attack.\nThe letter obtained by Leadership which SaharaReporters sighted on Sunday, was dated July 8, 2022, and titled: \"Security Alert: Renewed Threat Of Attack By ISWAP Terrorist On Targets within The FCT\".\n\"Intelligence abounds that ISWAP terrorist group has claimed responsibilities of the Tuesday 5th of July, 2022 attack on Kuje medium security custodial centre, releasing their adherent members.\nLast Tuesday, ISWAP terrorists attacked Mike Correctional Centre, freeing hundreds of inmates, including Jihadists held at the prison facility."
  },
  {
    "headline": "Gunmen Invade Church, Kidnap Wife Of Imo Zoo General Manager",
    "summarized_story": "Gunmen suspected to be kidnappers have invaded First Baptist Church, Nekede in Imo State and abducted Mrs. Bola Abioye, the wife of the General Manager of Imo State Zoological Garden and Wildlife Park, Mrs. Bola Abioye.\nSaharaReporters gathered that the hoodlums who were in police uniform drove a grey-coloured Toyota Sienna minivan to the church.\nThe incident happened on Sunday, around 1:30 pm when the church was about to dismiss service.\n\"The abductors who wore police vests were shooting right there at the car park.\nAnd within minutes, they drove off still shooting.”Efforts made by SaharaReporters to get the reaction of the Imo State Police Command were unsuccessful as the mobile line of the spokesman, Michael Abattam, failed to connect."
  },
  {
    "headline": "Kwankwaso to Tinubu: Take care of your health... 2023 campaign is very rigorous",
    "summarized_story": "Rabiu Kwankwaso, presidential candidate of the New Nigeria Peoples Party (NNPP), has advised Bola Tinubu, standard-bearer of the All Progressives Congress (APC), to take things easy.\nSince the former governor of Lagos state declared his intention to run for president, concerns have been raised about his health.\nSpeaking during an interview on Arise Television on Sunday, Kwankwaso said Tinubu should pay attention to his health.\nAdvertisement“If you see my friend, Bola, tell him to take it easy, take good care of his health and make sure that… because I love him so much, he is my friend,” he said.\nI know he is a strategist, Bola Tinubu, he is a good man."
  },
  {
    "headline": "Kwankwaso to Tinubu: Take care of your health... 2023 campaign is very rigorous",
    "summarized_story": "Rabiu Kwankwaso, presidential candidate of the New Nigeria Peoples Party (NNPP), has advised Bola Tinubu, standard-bearer of the All Progressives Congress (APC), to take things easy.\nSince the former governor of Lagos state declared his intention to run for president, concerns have been raised about his health.\nSpeaking during an interview on Arise Television on Sunday, Kwankwaso said Tinubu should pay attention to his health.\nAdvertisement“If you see my friend, Bola, tell him to take it easy, take good care of his health and make sure that… because I love him so much, he is my friend,” he said.\nI know he is a strategist, Bola Tinubu, he is a good man."
  },
  {
    "headline": "Zulum: Tinubu made the wisest choice by picking Shettima as running mate",
    "summarized_story": "Babagana Zulum, Borno governor, says Bola Tinubu, the All Progressives Congress (APC) presidential candidate, made the “wisest choice” by choosing Kashim Shettima as his running mate.\nBola Tinubu, presidential candidate of the party for the 2023 election, on Sunday announced Shettima as his VP pick.\nAdvertisement“For me, and I am sure for many leaders and members of the APC, Tinubu’s choice of HE Kashim Shettima is the wisest choice at this point in time,” he said.\nThere is hardly any tribe in any of Nigeria’s 36 states and the FCT that Senator Kashim Shettima cannot knowledgeably speak about.\nThe announcement of Shettima as the APC vice-presidential candidate came shortly after Ibrahim Masari stepped down as the “placeholder” running mate of Tinubu."
  },
  {
    "headline": "Zulum: Tinubu made the wisest choice by picking Shettima as running mate",
    "summarized_story": "Babagana Zulum, Borno governor, says Bola Tinubu, the All Progressives Congress (APC) presidential candidate, made the “wisest choice” by choosing Kashim Shettima as his running mate.\nBola Tinubu, presidential candidate of the party for the 2023 election, on Sunday announced Shettima as his VP pick.\nAdvertisement“For me, and I am sure for many leaders and members of the APC, Tinubu’s choice of HE Kashim Shettima is the wisest choice at this point in time,” he said.\nThere is hardly any tribe in any of Nigeria’s 36 states and the FCT that Senator Kashim Shettima cannot knowledgeably speak about.\nThe announcement of Shettima as the APC vice-presidential candidate came shortly after Ibrahim Masari stepped down as the “placeholder” running mate of Tinubu."
  },
  {
    "headline": "PROFILE: Kashim Shettima, Tinubu's running mate who prefers nanotechnology to restructuring",
    "summarized_story": "Finally, Bola Tinubu, presidential candidate of the All Progressives Congress (APC), has announced his running mate for the 2023 election.\nKabiru Masari stepped down from his “placeholder” position and Kashim Shettima, former governor of Borno, took his place on the party’s ticket beside Tinubu.\nShettima has been a media face of Tinibu since the former Lagos governor declared his presidential bid.\nZulum has enjoyed good reviews as governor of Borno state and was one of those being touted as potential running mates to Tinubu.\nAT WAR WITH BOKO HARAM FOR EIGHT YEARSShettima’s tenure as governor of Borno, the “Home of Peace”, from 2011 to 2019 was marred by Boko Haram insurgency."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Digital Nomads: Freelance digital marketer Baraka Mafole wants Tanzanians to thrive in the digital economy",
    "summarized_story": "After discovering that his fellow students were making money online, Mafole decided to join them; he spent hours learning digital skills.\nIn the last decade, the Tanzanian digital ecosystem has evolved as more Tanzanian citizens have access to digital services.\nThis led them to co-found an initiative called Tanzania Digital Trailblazers later that month, a series of virtual events to bring awareness of digital skills to young Tanzanians.\nThis time around, they added physical monthly digital skills training events to the mix.\nMafole said that dozens of Tanzanian youths have connected with his story and have been inspired to upgrade their lives by learning digital skills."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Rita Anwiri Chindah on her life as a lawyer and digital content creator",
    "summarized_story": "Today on Everyday People, we meet Rita Anwiri Chindah, an intellectual property and information technology lawyer and an arbitrator based in Port-Harcourt, Rivers State.\nSo sometimes when I want to record, I have to tell my family, cause I stay with my parents.\nI went there the first time and they said, “Okay, maybe come back next week.”And I went back the following week.\nGet ready to subscribe on Spotify, Apple podcast, google podcast and other platforms.\nWhen you’re trying to Google, trying to read different documents, make sure that you give a brief summary of everything."
  },
  {
    "headline": "No complacency as we transform to limited coy — Kyari – Nigerian Observer",
    "summarized_story": "No complacency as we transform to limited coy — KyariShare FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian National Petroleum Company Limited (NNPC Ltd.) started the new week with an assurance to its investors and stakeholders that the days of complacency were over.\nThe NNPC GMD/CEO also said that the Petroleum Industry Act (PIA) had also provided ample incentives for investors in the gas sector.\nThe GMD/CEO of NNPC Ltd., Malam Mele Kyari, made the call at the NNPC Spotlight Session of the just concluded 21st Nigerian Oil and Gas Conference and Exhibition which held at the International Conference Centre, Abuja.\nWunti made the disclosure in Abuja during a panel session at the just concluded 21st Nigerian Oil and Gas Conference and Exhibition with the theme, “Funding the Nigerian Energy Mix for Sustainable Economic Growth”.\nThe Nigerian oil and gas industry, and indeed the entire global energy community missed his invaluable contributions to the growth of the industry."
  },
  {
    "headline": "Attacks on Military, Police Formations, Correctional Centres and Aregbesola – Nigerian Observer",
    "summarized_story": "OF late, there had been series of sponsored attacks on military, police, INEC offices and correctional centres facilities.\nThere have been more attacks on military and police facilities than correctional centres.\nSeveral but unsuccessful attempts were made to attack correctional facilities since then, as the armed guards repelled them on each occasion.\nThese are not mean institutions, and are manned by many top officialsThe state is host to the elite 1st Division of the Nigerian Army, Nigerian Army Depot, Zaria, Armed Forces Command and Staff College, Jaji, Nigerian Defense Industry, Nigerian Airforce Training School, Nigerian Police College and the Nigerian Navy School of Armament, Kachia.\nOther military institutions in Kaduna are: The Nigerian Army School of Legal Services, Bassawa Zaria, the Nigerian Defence Academy, the Nigerian Army School of Artillery, Kachia, the Nigerian Army School of Military Police, Army Operation Base, Southern Kaduna and the Nigerian Army School of Infantry."
  },
  {
    "headline": "Eid-el-Kabir: Benin monarch tasks muslims on religious tolerance, peace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Benin Monarch, His Royal Majesty, Oba Ewuare II has tasked Muslims on religious tolerance towards achieving stability and peaceful coexistence in Nigeria.\nSpeaking when he received members of Benin Muslim Congress during the Eid-El-Kabir festival at his palace in Benin City, where they offered prayers for Benin Kingdom and Nigeria at large, he said “That is what the Sultan usually tells us when we are together in a gathering.\nHe expressed concern over the security challenges in NigeriaLeader of the group and Chief Imam of Benin Central Mosque, Sheikh Adulfatai Enabulele, eulogized the Benin monarch for his traditional and spiritual role in Edo State and Nigeria at large.\nAccording to him, “We muslims in this Kingdom, by the grace of God will continue to work assiduously to make sure that nobody comes here (Edo) and misbehaves.\nWe pray that the security agencies have the will power to deal with them (criminals),” he said."
  },
  {
    "headline": "Community Policing child of necessity – NBA chairman – Nigerian Observer",
    "summarized_story": "However, he said that community policing should operate within a holistic legal framework to be able to meet the yearnings and expectations of the populace.\nHe said that community policing in Edo State will grow into a monster in view of the absence of a regulatory framework.\nAccording to him, community policing thrives prior to the military’s intervention in the governance of Nigeria which led to overriding the thriving community policing.\nHe said that community policing uses environmental intelligence to successfully combat crime.\nHe advised against the application of political coloration to operate community policing, saying it was capable of undermining successful community policing."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Women’s Nations Cup: Nigeria beat Burundi 4-0 to book quarter final ticket",
    "summarized_story": "Nigeria’s Super Falcons on Sunday night, defeated debutants, Burundi 4-0 to book a quarter final ticket against Cameron in the ongoing Women’s African Cup of Nations in Morocco.\nRasheedat Ajibade opened scoring via the penalty spot on the 25th minute, and a second goal followed in the 28th minute from Peace Efih.\nUchenna Kanu scored in the 29th and 46th minutes to complete the four goals rout, but the Nigerian side were largely wasteful in the encounter.\nThe victory means that they finish second in group C with six points, behind South Africa who took maximum nine points, having beaten Botswana by a loan goal on the night.\nNigeria will face Central Africa power house, Cameroon in the quarter final, while South Africa battle Senegal."
  },
  {
    "headline": "2023: I went for competence – Tinubu defends choice of fellow Muslim running mate",
    "summarized_story": "Bola Tinubu, presidential Candidate of the ruling All Progressives Congress (APC), has defended his choice of Senator Kashim Shettima as his running mate, noting that he could not choose a Christian and a Muslim at the same time.\n“I am mindful of the energetic discourse concerning the possible religion of my running mate.\nOther have said I should pick a Muslim to appeal to the Muslim community.\nTo forge ahead as a nation toward development and prosperity, we must break free of old binds.\nWe must recalibrate our political calculations to where competence and fairness matter more than reductive demographics.”"
  },
  {
    "headline": "Muslim-Muslim ticket: CAN kicks against Tinubu’s choice of Shettima as running mate",
    "summarized_story": "The Christian Association of Nigeria (CAN) has kicked against the decision of Bola Tinubu, presidential candidate of the All Progressives Congress (APC) to select former governor of Borno state, Kashim Shettima as his running mate.\nReacting to the development, CAN’s spokesperson, Adebayo Oladeji, said making such a decision in a polarised country was a wrong move.\nOladeji warned that Nigerians should be ready to face the consequences of their actions if they endorsed and vote for a Muslim-Muslim ticket.\n“It is left to Nigerians to make their choice, let them vote them in and we will all face the consequences together.\n“If Niger State must be rescued, then Christians both in the rural and urban areas must wake up and do the needful."
  },
  {
    "headline": "Stemming the alarming exodus of professionals",
    "summarized_story": "Unvalued, underpaid and unsecure in their fatherland, Nigeria’s professionals are daily leaving our shores to seek greener pastures abroad.\nAlso, the British General Medical Council, said 805 medical doctors migrated to the UK between July and December 2021.\nThis figure is for the UK alone where 8,178 medical doctors of Nigerian origin were practising as at December 2021.\nWe, however, urge Nigerian professionals running away from the country to reconsider.\nTeachers and health professionals, like all other professionals, are trained in the nation’s tuition free universities."
  },
  {
    "headline": "Parliament of Eunuchs, By Tola Adeniyi",
    "summarized_story": "The earliest records of intentional castration to produce eunuchs are from the Sumerian city of Lagash in the 2nd millennium BCE.\nSecondly, for failing to halt breach of federal character principle by the President.\nFor these flops, the 9th National Assembly is an accessory to current woes of the country, and cannot be absolved.\nBut the National Assembly lacks the courage to reject Buhari’s nominees or even initiate impeachment threat, obviously, for fear of Executive intimidation.\nHigh Chief Tola Adeniyi is a veteran columnist, author and former MD of the Daily Times of Nigeria."
  },
  {
    "headline": "Delta Govt Confirms 12 Injured In Tank Farm Explosion",
    "summarized_story": "Twelve workers who sustained injuries at the Matrix Tank Farm’s explosion at Ifiekporo in Warri South local government area of the state are battling for their lives.\nThe oil and gas facility were gutted by fire on Friday night following an explosion from the gas component of the tank farm.\nThe explosion which sparked panic in the area, left 12 persons including workers and cooks who were on night duty with various degrees of injuries.\nThe victims are hospitalised at the Ogiame Ikenwoli Hospital in Ubeji, Warri where they are currently receiving treatment.\nThe head of the tank farm, Oghale Oyibo, while conducting the delegation round the premises, disclosed that investigation into the incident had commenced."
  },
  {
    "headline": "Delta Govt Confirms 12 Injured In Tank Farm Explosion",
    "summarized_story": "Twelve workers who sustained injuries at the Matrix Tank Farm’s explosion at Ifiekporo in Warri South local government area of the state are battling for their lives.\nThe oil and gas facility were gutted by fire on Friday night following an explosion from the gas component of the tank farm.\nThe explosion which sparked panic in the area, left 12 persons including workers and cooks who were on night duty with various degrees of injuries.\nThe victims are hospitalised at the Ogiame Ikenwoli Hospital in Ubeji, Warri where they are currently receiving treatment.\nThe head of the tank farm, Oghale Oyibo, while conducting the delegation round the premises, disclosed that investigation into the incident had commenced."
  },
  {
    "headline": "2 Firms Partner NYCN To Empower Youths On Alternative Energy",
    "summarized_story": "The CEO of Asteven Group commended President Muhammadu Buhari administration over its commitment to implementing the Renewable Energy Roadmap with major projects already in operation and contributing significantly in decongesting the national grid.\nHe applauded the N120billion Solar Naija Funds created by the government to boost renewable energy among other strategic renewable energy investment incentives.\n“We must commend the federal government for the giant strides in renewable energy generation culminating into the pilot projects in Usmanu Danfodiyo University, Bayero University and many others that are up and running.\nIn his remarks, Comrade Solomon Adodo of NYCN thanked the CEO of Asteven’s Group for the opportunity given to Nigerian youths and pledged the Council’s resolve to support and encourage Nigerian youths to participate actively in the training to make them self-employed and self-reliant.\nHe called on senators and members of the House of Representatives, governors, philanthropists, and international development partners to join in sponsoring the youth for the training."
  },
  {
    "headline": "2 Firms Partner NYCN To Empower Youths On Alternative Energy",
    "summarized_story": "The CEO of Asteven Group commended President Muhammadu Buhari administration over its commitment to implementing the Renewable Energy Roadmap with major projects already in operation and contributing significantly in decongesting the national grid.\nHe applauded the N120billion Solar Naija Funds created by the government to boost renewable energy among other strategic renewable energy investment incentives.\n“We must commend the federal government for the giant strides in renewable energy generation culminating into the pilot projects in Usmanu Danfodiyo University, Bayero University and many others that are up and running.\nIn his remarks, Comrade Solomon Adodo of NYCN thanked the CEO of Asteven’s Group for the opportunity given to Nigerian youths and pledged the Council’s resolve to support and encourage Nigerian youths to participate actively in the training to make them self-employed and self-reliant.\nHe called on senators and members of the House of Representatives, governors, philanthropists, and international development partners to join in sponsoring the youth for the training."
  },
  {
    "headline": "Harvest Of Terror At The Centre Of Power",
    "summarized_story": "After a period of relative peace, the nation, has entered a new phase of terrorist attacks that frontally challenges state power.\nNow, they boldly attack trains and airports in Kaduna, shoot at planes with land-to-surface missiles, attack military barracks and kill soldiers at will, attack a correctional centre at the centre of power ,and attack the President’s convoy with temerity.\nThe audacity with which terrorists and bandits challenge the state’s authority and the ordinary functioning of its coercive apparatus is unimaginable.\nThe attack on Kuje Medium Security Custodial Centre of the Nigerian Correctional Service (NCS); was a development that left at least 879 inmates fleeing from custody.\nThe lessons of the Kuje terror attack and bandits’ attack on the presidential convoy are glaring for all to see."
  },
  {
    "headline": "I won't forgive but kill you if you insult Oyedepo",
    "summarized_story": "The General Overseer, Salvation Ministries, Pastor David Ibiyeomie has vowed to tear anyone to pieces and kill him if the person should insult Bishop David Oyedepo.\nHe had once threatened to kill critic, Daddy Freeze for insulting Oyedepo.\nIn human life, the first person you will insult that I won’t forgive you is Oyedepo.\n“Insult me, insult my wife, I don’t care but if you take your mouth to touch my wife you are touching me.\nIf you insult Oyedepo I will kill you; and that’s how God is."
  },
  {
    "headline": "Rasheedat Ajibade celebrates Jesus after scoring for Falcons",
    "summarized_story": "Super Falcons player, Rasheedat Ajibade has celebrated Jesus on the African continent after scoring a goal for the nation’s female national team.\nAjibade is one of the stars discovered at the ongoing Women African Nations Cup (WAFCON) in Morocco.\nOn Sunday, she opened scoring for the Falcons in their 4-0 demolition of Burundi to reach WAFCON’s quarter-finals.\nAjibade later took to her Twitter handle after the match, expressing more gratitude to Jesus.\nShe wrote: “Thank you Jesus, Good performance from the entire team and through to the knockout rounds."
  },
  {
    "headline": "BREAKING: Tinubu Announces Kashim Shettima As Running Mate",
    "summarized_story": "Bola Tinubu, the presidential candidate of the All Progressives Congress, has announced Senator Kashim Shettima as his running mate.\nMr Tinubu announced this while addressing journalists in Katsina State on Sunday.\nTinubu earlier chose Ibrahim Kabiru Masari, as a placeholder for the vice-presidential slot.\nAddressing journalists on Sunday, Tinubu said a substantive running mate would replace Ibrahim Masari.\nWhen quizzed further on the substantive running mate, Tinubu said, “Kashim Shettima, I have not discussed with him but I have disclosed it to you.”Meanwhile, Ibrahim Masari who was earlier announced as a placeholder for the vice-presidential slot has resigned."
  },
  {
    "headline": "BREAKING: Tinubu Finally Picks Muslim Running Mate",
    "summarized_story": "Bola Tinubu of the All Progressives Congress, or APC, has chosen a Muslim as his running partner for the 2023 presidential election.\nAccording to the DAILY POST, certain national stakeholders urged the former governor of Lagos State against choosing a Muslim running mate since a Muslim-Muslim ticket would exclude Christians.\nHowever, according to a report published by Vanguard on Sunday, Tinubu has chosen Senator Kashim Shettima as his running mate.\nShettima served as the governor of Borno State for two terms and is the senator for Borno Central in the Red Chamber.\nWithin the next week, Tinubu is anticipated to inform President Muhammadu Buhari of his choice of running partner."
  },
  {
    "headline": "‘Tinubu has chosen his running mate’ – TCO",
    "summarized_story": "Sen. Bola Ahmed Tinubu, 2023 presidential candidate of the All Progressives Congress (APC) has decided on his choice of running mate.\nAbdullahi Ganduje of Kano State said on Saturday that Tinubu had settled for a Muslim-Muslim ticket,’’ the source said.\nThe source added that in picking the running mate, Tinubu was not thinking about religion, but about competence, exposure and intellectual depth of the candidate.\nTinubu is scheduled to pay Sallah homage to President Muhammadu Buhari in Daura, Katsina, on Sunday to brief him on his chosen running mate.\nThe former two-term Lagos State governor won the APC’s presidential ticket at the party’s June 8 special national convention and presidential primary election."
  },
  {
    "headline": "VIDEO: Goodluck Jonathan’s Cousin, Mike Ogiasa Begs For His Life In Kidnapper’s Den",
    "summarized_story": "In a video that has since gone viral, Mike Ogiasa, a relative of former president Goodluck Jonathan who was kidnapped by gunmen in Bayelsa State, can be seen pleading for his life in the kidnapper’s den.\nOn June 4, 2022, Ogiasa, an engineer, was abducted in his hometown of Otuabadi in the Ogbia Local Government Area.\nOgiasa is seen half-naked in a flooded tomb in the video, which SaharaReporters got and ran for 27 seconds.\nWATCH: Kidnappers Release Disturbing Video Of Abducted Former Nigerian President, @GEJonathan’s Cousin Mike Ogiasa Crying For Help Inside A shallow Grave FULL VIDEO: https://t.co/sXmTAe4zyZ pic.twitter.com/It9o8IKhtk — Sahara Reporters (@SaharaReporters) July 9, 2022He cried, “You’re seeing me in the grave.\nOgiasa, who also served as Special Adviser on Power to the state government, had finished attending a meeting before his assailants swooped on him."
  },
  {
    "headline": "[Breaking] WAFCON 2022: Nigeria’s Super Falcons sink Swallows, face Cameroon’s Indomitable Lionesses in quarterfinal",
    "summarized_story": "Super Falcons of Nigeria on Sunday night thrashed the Swallows of Burundi 4-0 in the last group game of the ongoing Women Cup of Nations in Morocco.\nThe Nigerian team have now qualified their place in the quarter-final of the competition, and will face Cameroon’s Indomitable Lionesses.\nWAFCON 2022 Quarter Final FixturesMorocco 🇲🇦 Vs 🇧🇼 BotswanaCameroon 🇨🇲 Vs 🇳🇬 NigeriaZambia 🇿🇲 Vs 🇸🇳 SenegalSouth Africa 🇿🇦 Vs 🇹🇳 TunisiaShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Novak Djokovic conquers Nick Kyrgios, wins 7th Wimbledon title",
    "summarized_story": "Novak Djokovic fended off a typically feisty Nick Kyrgios in the final, 4-6 6-3 6-4 7-6(3), to claim his seventh Wimbledon crown and 21st Grand Slam title.\nThe 27-year-old, who was unseeded at the All England Club, took just minutes to delight the fans with an underarm serve, which may well have been the first during a Wimbledon singles final.\nAs is so often the case, Djokovic lost the opening set as Kyrgios continued his positive and punishing start to the match.\nA single break of serve was sufficient for him to stamp his authority on the match and assume the early advantage.\nThe first mutterings, and at times yells, followed from Kyrgios as he felt frustration for the first time in the match."
  },
  {
    "headline": "Biography of Kashim Ibrahim Shettima, Bola Ahmed Tinubu’s 2023 presidential running mate",
    "summarized_story": "Senator Kashim Shettima is a very intelligent and outspoken politician from the Kanuri tribe.\nSen. Kashim Shettima was born in Maiduguri, Borno state, Nigeria to the family of Sir Kashim Ibrahim.\nIn mid-2007, Shettima was appointed Commissioner of the Borno State Ministry of Finance and Economic Development.\nHowever, amidst such fright, Governor Kashim Shettima who was out of the country for an official assignment, returned to Maiduguri in a show of courage and patriotism.\nWith peace building, Governor Kashim Shettima has been championing Reconstruction, Rehabilitation and Resettlement of victims."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "‘Amotekun, State Helicopter, Debt’: Main Issues In Osun Governorship Debate",
    "summarized_story": "﻿Five aspirants slugged it out on Sunday in Osogbo during a debate ahead of the Osun state governorship election, which is slated for July 16.\n– Oyegoke Omigbodun (SDP)#OsunDebate2022#CTVTweets pic.twitter.com/YPZspHzzv2 — Channels Television (@channelstv) July 10, 2022As Governor, I will expand the capacity of Amotekun.\n– Oyegoke Omigbodun (SDP)#OsunDebate2022#CTVTweets pic.twitter.com/hdjOfRTa7K — Channels Television (@channelstv) July 10, 2022The debt profile of Osun state is alarming.\n– Yusuf Lasun (Labour)#OsunDebate2022#CTVTweets pic.twitter.com/jvHvpXyzkl — Channels Television (@channelstv) July 10, 2022I have managed the debt profile of Osun state very well.\n– Oyegoke Omigbodun (SDP)#OsunDebate2022#CTVTweets pic.twitter.com/fWRitg5qdt — Channels Television (@channelstv) July 10, 2022Citizens of Osun, I want to give you a new beginning."
  },
  {
    "headline": "Tinubu Picks Ex-Borno Governor Shettima As Running Mate",
    "summarized_story": "﻿ ﻿The presidential candidate of the All Progressives Congress (APC), Bola Tinubu, has announced Senator Kashim Shettima as his running mate in the 2023 general elections.\nAccording to the APC stalwart, Shettima was selected because the former Borno State governor is “competent, capable, reliable and able to be picked as a running mate”.\nThe APC presidential candidate was accompanied to Daura by Governor Aminu Masari shortly after his aircraft landed at the Umaru Musa Yar’Adua Airport in Katsina State.\nHe further stated that that the former Borno governor is “inter-generationally mobile (he’s young, yet experienced), fiercely loyal, phenomenally complimentary to Bola Ahmed Tinubu”.\nThe APC chieftain thanked Asiwaju Tinubu for the trust vested in him, and promise that he and his family will remain steadfast in their support for the APC presidential flagbearer and the party."
  },
  {
    "headline": "Osun Debate: Adeleke Tackles Oyetola On State Helicopter, Use Of Amotekun",
    "summarized_story": "Senator Ademola Adeleke on Sunday tackled Governor Gboyega Oyetola on how his administration is using operatives of the Amotekun Security Network and the condition of the state-own helicopter.\nWe don’t know where our helicopter is and we want to know today because Osun people have the right to know where our helicopter is,” Senator Adeleke queried.\nThe ex-lawmaker said if elected governor, he will develop state policing and empower Amotekun operatives for the overall good of the Osun people.\nOyetola RepliesGovernor Oyetola, in his response, stated that the helicopter was in existence but it has broken down.\nWhile noting that the surveillance equipment has been packed in Rivers State, the governor said he has instructed that the helicopter be sold."
  },
  {
    "headline": "Lagos Boat Mishap: 13 More Bodies Recovered As Death Toll Rises To 15",
    "summarized_story": "Thirteen more dead bodies have been recovered from the Ojo area of Lagos state where a W-19 passenger fibre boat capsized.\nWhile two bodies were immediately recovered, two more bodies were later retrieved last night in rescue operations.\n“Late yesterday night, two more bodies were recovered in addition to the two earlier recovered in the morning.\nWith this, it has become a total of 15 bodies recovered.\nAccording to NEMA, regulatory bodies have tried to stamp out illegal operations of small boat operators who hardly use life jackets after official hours."
  },
  {
    "headline": "Insecurity: Amotekun Should Be Encouraged To Carry Arms – Oyetola",
    "summarized_story": "Governor Adegboyega Oyetola of Osun State has said it is not a bad idea to enhance the operations of Amotekun by having members of the security network bear arms.\n“I am of the opinion that it is not out of place for the Amotekun people to be able to carry arms,” Oyetola asserted while tackling questions regarding security.\nWhen asked if he agrees to having individuals carry weapons to fight for themselves, Governor oyetola replied that this “will result to anarchy”.\nREAD ALSO: Osun Guber Race: Four Years Is Not Enough, Give Me Another Term – OyetolaAllowing Nigerians to carry arms will lead to anarchy.\nBut Amotekun should be encouraged to carry arms."
  },
  {
    "headline": "Ondo youths movement drums support for NNPP Assembly Candidate, Kolawole Oluwaseyi -",
    "summarized_story": "AdvertisementAlabi said Akoko North-West youths are backing his candidacy, because of his antecedents and love for development of the youths.\nThe communique reads in part, “Many aspire to lead, even when they don’t have what it takes to lead.\nThe group added that it is time to support a personality with a vision and mission to redefine development in the constituency.\nAdvertisementIt also called on all stakeholders in Akoko North-West beyond party affiliations to support aspiration of Oluwaseyi, so that the constituency can move forward.\n“His antecedents in diverse professions are clear pointers that he is more fit than any other person to lead the constituency”, the group stressed."
  },
  {
    "headline": "Chief Whip dismisses Rumoured Defection of 8 PDP Oyo Lawmakers -",
    "summarized_story": "Hon Adedibu, who is also the Chief Whip of the House debunked the rumor during Wednesday’s plenary under personal explanation.\nAdvertisementHe explained that though he and the other seven members will not be returning to the House in 2023, there is no plan by them to leave the ruling Peoples Democratic Party, PDP in Oyo State.\nHon Adedibu urged members of the public to disregard the unfounded rumour.\n” On behalf of other seven members, i Hon Hakeem Adedibu wish to state categorically that there was never a plan by me or any of the other seven members of the PDP to defect to another party .\n” Hon Hakeem Adedibu."
  },
  {
    "headline": "Oyo assembly directs CJ to set up panel against Deputy Governor -",
    "summarized_story": "AdvertisementRecall that on the 17th of June, 2022 a correspondence/petition titled ” Notice of Allegations of Gross Misconduct Against the Deputy Governor of Oyo State, Engr Rauf Olaniyan” was read at the floor of the plenary.\nIn the petition, the 23members accused the Deputy Governor of Gross Misconduct, abuse of office, financial recklessness, abandonment of office and insubordination.\nAdvertisementAdvertisementThe House thereafter served the Deputy Governor and all other members of the Legislature a copy of the allegations.\nWhile reading the motion, the Majority Leader noted that up till now the Deputy Governor had not responded to the copy of the allegations served him by the House.\n“We have no say whether the State Deputy Governor is guilty or not."
  },
  {
    "headline": "Over 78,000 persons have completed their registration in Oyo- INEC -",
    "summarized_story": "The Independent National Electoral Commission says a total of 78,420 persons have completed the Continuous Voters Registration in Oyo State but only about 45,000 are valid out of them.\nThe Oyo state Resident Electoral Commissioner Mutiu Agboke disclosed this at a media briefing held in Ibadan.\nAdvertisementAdvertisementAccording to him, we have 78,420 registrants that completed registration during these period but there were only 45,187 valid registration out of it all.\nThe Independent National Electoral Commission, INEC, had originally scheduled the deadline for the stoppage of registration for the PVC’s for the 30th of June but has now extended the deadline indefinitely.\nThis is another in the Series of regular update by the Election Mangement Body, INEC."
  },
  {
    "headline": "Djokovic Wins 4th Wimbledon in a Row, 21st Grand Slam",
    "summarized_story": "Serbian Novak Djokovic has won the 2022 Wimbledon final against larger than life character Nick Kyrgios.\nAs for Djokovic, the match against Kyrgios was ironically a tale of the Serb’s Wimbledon tournament as a whole.\nAfter losing the first set, Djokovic came back in some style to defeat the Brit 2-6, 6-3, 6-2, 6-4.\nVictory over the Aussie means that Djokovic has now won four Wimbledon titles in a row and his seventh overall.\nAs of right now, Roger Federer has won the most Wimbledon titles with eight."
  },
  {
    "headline": "APC’s Tinubu Announces Former Borno Governor Shettima as Running Mate",
    "summarized_story": "Presidential candidate of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu has named former Borno State governor Kashim Shettima as his running mate ahead of Nigeria’s 2023 elections.\nTinubu announced this while addressing journalists in Katsina on Sunday.\nThis is coming hours after Tinubu met with President Muhammadu Buhari alongside Katsina State Governor, Aminu Masari.\nSee the video:"
  },
  {
    "headline": "South Africa Police Say 15 Killed in Bar Shooting in Soweto",
    "summarized_story": "Gunmen armed with rifles and pistols opened fire at people in a bar in the South African township of Soweto in the early hours of Sunday, killing 15 and wounding nine.\nThe carnage took place shortly after midnight, according to police who said the group of men entered the Orlando East tavern, in the township on the outskirts of the main city Johannesburg, before “shooting randomly at the patrons”."
  },
  {
    "headline": "At Least 15 Killed After Russian Rockets Hit Apartment Building in Ukraine’s Donbas",
    "summarized_story": "At least 15 people were killed and two dozen more are feared trapped after Russian Uragan rockets hit a five-storey apartment block in Ukraine’s Donetsk region, local officials said on Sunday as rescuers picked their way through rubble.\nLuhansk and Donetsk provinces comprise the Donbas, Ukraine’s eastern industrial region that has become Europe’s biggest battlefield for generations.\nLuhansk region Governor Serhiy Gaidai said Russian forces were gathering in the area of the village of Bilohorivka, about 50 km (30 miles) east of Sloviansk.\nUkrainian military spokespeople were not immediately available for comment.\nIn the south, Ukrainian forces fired missiles and artillery at Russian positions including ammunition depots in the Chornobaivka area, Ukraine’s military command said."
  },
  {
    "headline": "Nigerian Manufacturers Lament High Cost of Diesel, Demand Licence to Import from Niger Republic, Chad",
    "summarized_story": "The Manufacturers Association of Nigeria (MAN) has decried the rising cost of diesel in the country and urged the federal government to issue its members licences to import the product from the Republic of Niger and Chad.\nThe manufacturing sector, which dominates export trade in the West African sub-region, employs more than five million workers, directly and indirectly, and contributes 8.46 per cent to the nation’s Gross Domestic Product (GDP).\nHe added that the manufacturing sector had been battered by many familiar challenges that had plummeted the number of industries and converted industrial hubs to warehouses of imported goods and event centres.\n“MAN is greatly concerned about the implications of the over 200 per cent increase in the price of diesel on the Nigerian economy and the manufacturing sector in particular.\nAjayi-Kadir urged the government to strengthen the nation’s economic absorbers from external shocks to reduce the myriad challenges the manufacturing sector was already beguiled with."
  }
]