[
  {
    "headline": "Bandits kill 88 in Kebbi –Police",
    "summarized_story": "The Police Command in Kebbi on Saturday confirmed that bandits killed 88 people in Danko/Wasagu Local Area of the state on Thursday.\nAccording to him, the command has so far recovered the 88 bodies and dispatched a detachment of operatives to maintain law and order in the affected communities.\n“The killing took place in Koro, Kimpi, Gaya, Dimi, Zutu, Rafin Gora and Iguenge villages, all in Danko/Wasagu LGA of Kebbi State.\n“Initially, the bodies recovered were 66 but as I am talking to you now, about 88 bodies have been recovered,” Abubakar said.\nThe News Agency of Nigeria recalls that in April, bandits killed nine police officers including the Divisional Police Officer as they were responding to a distressed call."
  },
  {
    "headline": "76,855 candidates jostle for 3,000 admission spaces in unity schools",
    "summarized_story": "The Federal Government on Saturday disclosed that a total of 76,855 candidates enrolled for the 2021 Common Entrance Examinations into unity schools across the country.\nThe government also disclosed its intention to expand the carrying capacity of the schools to 30,000 students from the current 26,000 students.\n“This year we had a total number of 76,855 candidates enrolled for the examinations and the schools at the moment will only take in 3,000 candidates due to limited spaces,” he said.\nStatistics provided by the board which gave details on candidates that sat for the examination revealed that Lagos had the highest number of candidates with 21,423 candidates followed by FCT, 8674 candidates, Anambra 5,738 and Zamfara has 4,865 while Taraba has the least registered number of candidates with 113.\nThe data released also showed that the number of girls that registered for the examination was 39,555 while a total of 37,300 male candidates registered for the examination."
  },
  {
    "headline": "One dead as police, kidnappers clash in Ogun",
    "summarized_story": "A suspected kidnapper was shot dead during a gun duel between a gang of kidnappers and policemen in Ogun State.\nMen of Ogun State Police Command killed the suspect in Mologede Area of Odeda Local Government Area of the state.\nOyeyemi said the incident happened on Friday after policemen received a distress call.\n“While combing the bush, the kidnappers were sighted in the forest where they engaged the policemen in a gun battle.\n“In the process, one of the kidnappers was shot on the leg, while others escaped with various degrees of gunshot injuries, while the victim was rescued unhurt."
  },
  {
    "headline": "Lusting after a lad could give a cougar a bad name",
    "summarized_story": "READ ALSO: Being a successful cougar is an art“I teased him about being very young with a lot of girl-friends but he smiled shyly.\nHe said he’d soon be 24 – but his body – over 6ft, broad shoulders and slim hips, screamed sexuality.\nThen I felt excited – to this day, I’d never know why.\n“The next day, as soon as I led him to the bedroom he dived into the bed, quickly peeling off his clothes.\n‘Don’t you feel the same abut me?’ he asked, hurt, I told him I did, convinced he’d soon get bored when he found much younger girls."
  },
  {
    "headline": "Banning Twitter regressive, should be rescinded – NPAN",
    "summarized_story": "It is that threat of maximum state reparisal that Twitter found objectionable, according to its stated policy and sanctioned President Buhari with a deletion.\nTo the extent that Twitter may have been hasty in sanctioning President Buhari and shown an uneven application of its rules against separatist Kanu, its sincerity stands questioned.\nHowever, The Newspaper Proprietors’ Association of Nigeria (NPAN), thinks that the suspension of Twitters operation by Nigerian is wrong and an overreaction.\nTwitter is a global platform for public communication that has expanded the frontiers of Free Speech and Press Freedom.\nBanning Twitter is regressive and should be rescinded in favour of dialogue”."
  },
  {
    "headline": "CNG condemns FG’s suspension of Twitter",
    "summarized_story": "Urges Buhari to lift banBy Gabriel Ewepu – AbujaAs Nigerians continue to hope for peace in parts of the country, a Civil Society Organization, Concerned Nigerians Group, CNG, Friday, condemned the action of the Federal Government over suspension of Twitter operations in the country.\nThis was contained in a statement signed by the Convener, CNG, Comrade Deji Adeyanju, where the group pointed that the action of the Buhari-led administration was taken to far as it is a deliberate act to silence the voice of the media.\nThe statement reads in part, “We condemn in strong terms, the suspension of Twitter operations by the Federal Government of Nigeria.\n“The Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nAlso the Minister said, “The Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.”Vanguard News Nigeria"
  },
  {
    "headline": "Twitter suspension: Malami’s prosecution order illegal, null, void – PDP",
    "summarized_story": "By Dirisu YakubuThe Peoples Democratic Party, PDP, yesterday, said the directive by the President Muhammadu Buhari-led All government to arrest and prosecute any Nigerian using Twitter, is unconstitutional, illegal, null and completely of no effect.\n“President Muhammadu Buhari and his APC are informed that there is no extant law that defined the use of Twitter as a criminal offence and there is no penalty prescribed in a written law for the use of Twitter by any Nigerians.\n“Moreover, they should also realize that the suspension of Twitter by the APC-led federal government, in addition to its unconstitutionality, only suspended Twitter operations and not the use of Twitter by Nigerians.\n“Malami’s directive to arrest and prosecute Nigerians using Twitter is therefore an attempt to suspend the 1999 Constitution (as amended), a development which bears the imprints of the leaked memo in which Mr. President was reportedly advised to suspend the constitution and strip Nigerians of their rights and freedom.\n“The PDP again cautions the Buhari Presidency and the APC to end their acts of suppression against Nigerians as such amounts to pushing the people to the wall.”"
  },
  {
    "headline": "Two killed, 2 others injured in Bauchi autocrash",
    "summarized_story": "By Charly Agwam – BauchiThe Federal Road Safety Corps (FRSC) in Bauchi state has confirmed a fatal car that has killed two people and injured two others at Zangoro village along Bauchi – Maiduguri highway.\nThe Sector Commander, FRSC, Bauchi state, Yusuf Abdullahi, confirmed that the crash occurred yesterday, Friday at about 2.00 pm.\nAccording to him, the fatal crash involved six males in two vehicles, a Peugeot 406 with registration number: TRN-36SL and a DAF Truck also with registration number: PKM-77-XA.\nREAD ALSO: Bauchi State Governor commends Aero Contractors decision to open routeAccording to him, two people died, two others sustained varying degrees of injuries while the remaining two escaped unhurt.\nHe assured that the FRSC will continue to do its best in ensuring safety of lives and properties on the highway."
  },
  {
    "headline": "Attacks: Speak up – Wamakko challenges South East leaders",
    "summarized_story": "Senator Aliyu Wamakko (APC-Sokoto), the Chairman of the Senate Committee on Defence, has challenged political leaders from the south-eastern part of Nigeria to speak up in condemnation of the violence in the region.\nWamakko, a former governor of Sokoto State, insisted that their silence could be interpreted as subtle support for criminal gangs in the region.\nRecall that unknown gunmen have been terrorizing the south-eastern states in recent weeks, killing security personnel and attacking government establishments.\nAttacks: Unknown gunmen are our young men, women – Gov Umahi“Through all these, as individual leaders and collectively, we’ve maintained a studied silence by avoiding anything that will further rock the boat.\n“As leaders of our own people, we’ve been under intense pressure over the current situation."
  },
  {
    "headline": "Nigeria's Twitter ban, affront on nation's democracy",
    "summarized_story": "Yiaga Africa on Saturday frowned at the suspension of Twitter by the federal government and the directive that all Over-The-Top, OTT, services must be licensed by the National Broadcasting Commission, NBC, before they can operate within Nigeria.\nAccording to the microblogging platform, the suspension of Twitter is antithetical to democracy principles.\nIt further stated that the platform had emerged as a veritable space where citizens express their opinions and as questions and demand accountability from their leaders.\nThe organisation added that democracy cannot thrive in an oppressed civic space where the government opposes any form of dissent or opposition and shuts down easy and accessible channels of communication at will.\nUK states position on suspension of Twitter in Nigeria"
  },
  {
    "headline": "Buhari sends delegation to Enugu over Nwodo’s death",
    "summarized_story": "President Muhammadu Buhari, Saturday, described the late Joseph Nwodo as “one of the leading lights of the legal profession” at the burial ceremony of the deceased held in Ukehe Nsukka, Enugu State.\n“The late Joe was an epitome of humility and good manners and radiated utmost friendliness in his relationship with people of all ethnic groups and calling.\nThe legal family in Nigeria will always remember him as one of the leading lights of the profession, because of his erudite contributions to the nation’s jurisprudence.\n“In the political arena, the Ochendo was a great grassroots mobiliser and will forever be remembered for his philosophy of Equity and Justice to all.\nHe was a strong Governorship contender that emerged in Old Anambra State in 1990 – 1991 and later the National Republican Convention (NRC) Presidential aspirant that emerged from Enugu State under the Party’s Option A4 Presidential Election in 1992."
  },
  {
    "headline": "Why NYSC will not be scrapped",
    "summarized_story": "The South West Director of the National Youth Service Corps, Mrs. Oluwafunmayo Akin-Moses, has described the scheme as a vehicle for developing the manpower and generation of youth employment.\nAccording to her, NYSC is also an agent of peace and progress in Nigeria and as such, calling for it to be scrapped would end up doing a lot of harm than good to the generality of youths waiting to benefit from it.\nDon’t allow scrap of NYSC – HURIWA tells BuhariShe said as part of efforts to sustain the scheme, the Director General of the NYSC, Brigadier General Shuaibu Ibrahim has been doing everything within the law to ensure the NYSC was not scrapped even as some Nigerians have called for the scrapping of the scheme because it has failed to achieve the purpose for which it was founded.\nThe Director called on corps members to serve with humility, selfless service and always put in their best in whatever circumstances they find themselves.\nBuhari’s Minister, Dare kicks against call to scrap NYSC"
  },
  {
    "headline": "HURIWA calls on DSS to arrest Bulkachuwa for ‘threatening’ Igbos",
    "summarized_story": "Bulkachuwa described members of the Indigenous People of Biafra, IPOB as terrorists attacking security operatives and destroying government property in the region.\nElders speak words of peace, not war – HURIWA blasts Sen BulkachuwaReacting, the Human Right Writers condemned the DSS’ failure to arrest the Senator despite the open threat.\nMeanwhile, HURIWA has also slammed President Buhari over the current security crisis rocking the North East due to the activities of Fulani herdsmen and armed bandits.\nReacting to the recent incident in Kebbi State where over 66 persons were killed by bandits in Danko-Wasagu Local Government Area of the state, HURIWA described the attacks as “reprehensible and totally abhorrent”.\nIf you want another war, Nigerian Govt will have no choice – Senator Bulkachuwa warns Southeast"
  },
  {
    "headline": "Igbo traditional rulers in diaspora condemn Gulak’s murder",
    "summarized_story": "By Fanen Ihyongo, KanoIgbo traditional rulers in the diaspora, under the umbrella body of Association of Eze Nigbo N’uzo Ije, have condemned in strong terms, the assassination of former Special Adviser on Politics to former President Goodluck Jonathan, Ahmed Gulak.\nADVERTISEMENTDr. Ibekwe, who is the president-general of the Igbo traditional leaders in the diaspora, called on security agents to fish out all those connected to the killing of the former president’s adviser.\nAhmed Gulak at Owerri, Imo State, is one murder too many and calls for total condemnation.\n“We commiserate with his family and the nation over the dastardly act and pray for the repose of his gentle soul.\n“We want to make a clarion call on southeast governors to engage the Ebubeagu Security outfit in flushing out criminals from the zone."
  },
  {
    "headline": "BOS, LASU and dance of the naked gods",
    "summarized_story": "In the ongoing protracted process to appoint the 9th Vice Chancellor of the Lagos State University (LASU), almost five decades after Chukwuemeka Ike’s novel was published, it is evident that some of the fabled gods of academia still dance naked in the marketplace to our utter national embarrassment.\nWhat should be a routine exercise has become a time-consuming and energy-sapping affair that neither the institution nor the state can afford.\nHe wondered why the governor was not more assertive and forceful in utilizing the expansive powers of his office particularly in handling the LASU VC debacle.\nIt is instructive that on assumption of office, BOS renewed the appointment of Professor Adebayo Ninalowo as Pro-Chancellor and Chairman of the Governing Council of LASU.\nAccording to ASUU, the adverts placement for the position of the Vice Chancellor was executively done by Ninalowo without the involvement of Council as required by the law."
  },
  {
    "headline": "Wike disowns NGF’s agreement with JUSUN",
    "summarized_story": "By Mike Odiegwu, Port HarcourtRivers State Governor Nyesom Wike has said the agreement reached by the Nigeria Governors’ Forum (NGF) with the Judiciary Staff Union of Nigeria (JUSUN) is not binding on the Rivers government.\nHe said: “Rivers State Government has implemented financial autonomy for the legislature and Judiciary.\nSo, whatever they have signed with JUSUN, let me tell you people, it is not binding on Rivers State government,” he said.\nThe governor noted that the Rivers State University secured the support of the state government because of the harmonious relationship between the university management and the governing council.\nWike mandated the university to commence construction work on the building to house the School of Nursing within the premises of the Faculty of Medical Sciences."
  },
  {
    "headline": "BREAKING: Yoruba nation agitators are foolish – Aregbesola",
    "summarized_story": "By Toba Adedeji, OsogboMinister of Interior, Rauf Aregbesola on Saturday said those leading and supporting agitation for the Yoruba Nation are foolish saying “they should consider the consequences of war.”Aregbesola while speaking at Zenabab Hotel, Ilesha, Osun State during his 64th birthday celebration warned that agitators must consider the women, children, old people and those living with disabilities who are mostly affected.\nHe said Nigeria must be more united else African countries will be enslaved once again.\nADVERTISEMENTHe noted that Nigeria is the country that will liberate Africa from all oppressions therefore Nigerians must not give nod to secessionists.\n“Anything that threatens and creates a problem for Nigeria may cause backwardness for our country for 50 years,” he added."
  },
  {
    "headline": "Police investigate murder of DSS operative in Ekiti",
    "summarized_story": "Agency ReporterThe Police Command in Ekiti State on Saturday confirmed the murder of a detective with the Department of the State Security Service (DSS) in a hotel at Ado Ekiti on Friday night.\n“I can confirm we heard that the DSS operative was killed during a hot argument with some soldiers yesterday, (Friday) evening.\nThe News Agency of Nigeria (NAN) reports that the incident happened in Ado Ekiti on Friday evening as three soldiers allegedly killed DSS operative inside the hotel (names withheld).\nADVERTISEMENT“When the DSS man got to the soldiers, a hot argument ensued between them and one of the soldiers became so angry that he drew out a knife and stabbed DSS operative in the neck.\n“The DSS man fell immediately and started bleeding."
  },
  {
    "headline": "Twitter Suspension: Editors Urge FG To Seek Legitimate Means",
    "summarized_story": "Twitter Suspension: Editors Urge FG To Seek Legitimate MeansThe Nigerian Guild of Editors (NGE) has urged the federal government to tread with caution and immediately reconsider the suspension of the operation of Twitter in Nigeria and seek other legitimate means of resolving its dispute with the company.\n‘’The Guild sees the federal government’s action as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’If the federal government finds Twitter’s action against the President objectionable, Nigerians should not be made to suffer the collateral damage of denying them their right to freely discourse on Twitter’’, the Guild added.\nNoting the socio-political and economic benefits of social media platforms, the NGE explained that strong democracies rely on both civic and political participation by citizens, saying that Twitter, has over the years, aided citizens’ participation in the nation’s democratic process.\n‘’The Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check dictatorship and promote democracy worldwide."
  },
  {
    "headline": "Nigerians groan as telcos effect Twitter ban",
    "summarized_story": "Commenting on the development, a seasoned lawyer and Senior Advocate of Nigeria, Mr Mike Ozhekome, condemned the ban, saying that Twitter was one of the few places where Nigerians could freely express their grievances.\n‘Well, I am not surprised that the Federal Government has suspended Twitter operations in Nigeria.\nMore so, Ministries, Departments and Agencies have lately deepened the use of Twitter to disseminate information, having found it effective and cost-saving.\nTwitter in its latest update has promised to restore access to the microblogging app for Nigerians.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world,’ it said."
  },
  {
    "headline": "BREAKING: Twitter Ban: Malami orders prosecution of offenders – The Sun Nigeria",
    "summarized_story": "The Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN), has ordered the immediate prosecution of offenders of the Federal Government ban on Twitter operations in the country.\nAccordingly, the Director of Public Prosecution of the Federation (DPPF) has been directed to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of opetations of Twitter in Nigeria.\nThe directive followed the indefinite suspension placed on Twitter’s operations in the country by the Federal government.\n“The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria,” it read.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world,” it said in a statement."
  },
  {
    "headline": "Stubborn male fans won’t let me rest –Princess Salt",
    "summarized_story": "Nollywood diva, Chidimma Agunobi aka Princess Salt has maintained that her curvaceous sexy figure is natural and not enhanced with surgery.\nShe told Saturday Sun: “I’ve always had this sexy shape from birth.\nI’m not against those that do liposuction; you are free to do with your body whatsoever makes you happy.\nHowever, some stubborn male fans won’t let me be.\nIt’s crazy out there with these crazy fans."
  },
  {
    "headline": "NDDC board: Tension in Niger Delta as Tompolo’s ultimatum ends",
    "summarized_story": "From Paul Osuyi and Ben Dunno, WarriTension is building again in the oil rich Niger Delta region as the seven-day ultimatum issued by ex-militant warlord, Government Ekpemupolo alias Tompolo for the Federal Government to reconstitute the board of the Niger Delta Development Commission (NDDC) expires today.\nAs a result of the tension generated by Tompolo’s ultimatum, Minister of Niger Delta Affairs, Mr. Godswill Akpabio visited Delta State where he met with some key stakeholders with a view to dousing the rising tension.\nAfter the ultimatum and nothing is done, don’t blame anybody.”Speaking earlier Akpabio made reference to how war would break out in the Niger Delta if tension continues to grow.\nHe said that it was necessary for the youths to give peace a chance going by the fragile nature of the Niger Delta region, saying that “we must not allow our region to boil.\nIt was, however, learnt that the minister left the peace parley at Oporoza with the promise to commence the process of constituting the substantive NDDC board on returning to Abuja."
  },
  {
    "headline": "Just In: Bandits Kill 88 in Kebbi",
    "summarized_story": "By Ismail AdebayoThe police on Saturday said they had recovered 88 bodies from the eight communities attacked by bandits in Danko Wasagu local government area in Zuru Emirate of Kebbi state.\n“The killing took place in Koro, kimpi, Gaya, Dimi, Zutu, Rafin Gora and Iguenge villages, all in Danko/Wasagu LGA of Kebbi State,” he said.\nBandits had last month killed nine policemen, including a DPO while responding to a distress call by the locals in the emirate.\nThis is the fifth attack by the bandits in the emirate in less than a year.\nA source in the area said many of those who escaped the bandits attack in the eight affected communities had fled to nearby town of Riba in the emirate for safety."
  },
  {
    "headline": "Twitter Ban: Justice Minister Orders Prosecution of Violators",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, on Saturday, issued an order for the enforcement of the ban placed on Twitter by the Nigerian government.\nIn a statement by his spokesperson, Umar Gwandu, Malami ordered the prosecution of violators of the suspension of the operations of Twitter in Nigeria.\nTwitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted Tuesday wherein he threatened to deal with secessionists “in the language they understand”.\nThe social media giant had said the tweet violated the Twitter Rules.\n“Malami directed the DPPF to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Telcos Block Access to Twitter in Nigeria",
    "summarized_story": "By Emma OkonjiTelecommunication operators, Saturday, received a directive from the telecoms regulator, the Nigerian Communications Commission (NCC), to suspend access to Twitter accounts in Nigeria.\nThe order was sequel to the suspension of Twitter operations in Nigeria by the federal government.\nChairman of the Association of Licensed Telecoms Operators of Nigeria (ALTON), Mr. Gbenga Adebayo, who confirmed the order to deactivate Twitter in Nigeria, said telecoms operators would act in accordance with the NCC order.\nTHISDAY checks however showed that access to Twitter accounts in Nigeria, had been deactivated.\nA statement from ALTON, reads: “We, The Association of Licensed Telecommunication Operators of Nigeria (ALTON) wish to confirm that our members have received formal instructions from the Nigerian Communications Commission (NCC), the industry regulator to suspend access to Twitter."
  },
  {
    "headline": "Aisha Buhari Deactivates Twitter Account",
    "summarized_story": "First lady, Aisha Buhari, has deactivated her Twitter account following the indefinite suspension of Twitter operation in Nigeria by the Federal Government.\n“I will be deactivating my twitter account for now.\nLong live Federal Republic of Nigeria,” the wife of Nigerian President tweeted before deactivating her account on Friday evening.\nThe first lady’s announcement of the deactivation of her Twitter account came as Nigerians on Satu4day morning could not access the microblogging site, except through Virtual Private Network (VPN) providers which hide their internet footprints.\nThe Twitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted Tuesday wherein he threatened to deal with secessionists “in the language they understand”."
  },
  {
    "headline": "In a Shocking Overreaction, FG Suspends Twitter’s Operations",
    "summarized_story": "This must be reviewed.”The Peoples Democratic Party (PDP) vehemently rejected the Twitter suspension, describing it as a draconian action and a slide towards a fascist regime in our country.\nNigeria, we’ll see in court.”The British embassy in Nigeria also condemned the Twitter suspension.\nNobel Laureate, Prof Wole Soyinka described Twitter suspension as unbecoming of a democratically elected President.\nUnrepentant tyrant.”In another post, he said, “No shaking I have VPN.”Twitters’ ReactionMicro-blogging site, Twitter, says the suspension of its operations in Nigeria is “deeply concerning”.\n“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning."
  },
  {
    "headline": "Twitter Ban: Malami Orders Prosecution of Offenders",
    "summarized_story": "Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, has ordered the prosecution of those violating the ban on Twitter.\nThe directive is in a statement issued by Umar Jibrilu Gwandu, media aide of Malami, on Saturday.\nThe statement read, “Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN has directed for the immediate prosecution of offenders of the Federal Government ban on Twitter operations in Nigeria.\n“Malami directed the Director of Public Prosecution of the Federation (DPPF) at the Office of the Attorney General of the Federation and Minister of Justice to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of operations of Twitter in Nigeria.\nA check by SaharaReporters in the early hours of Saturday showed that the platform is no more active within the country."
  },
  {
    "headline": "Twitter Ban: Malami Orders Prosecution of Offenders",
    "summarized_story": "Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, has ordered the prosecution of those violating the ban on Twitter.\nThe directive is in a statement issued by Umar Jibrilu Gwandu, media aide of Malami, on Saturday.\nThe statement read, “Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN has directed for the immediate prosecution of offenders of the Federal Government ban on Twitter operations in Nigeria.\n“Malami directed the Director of Public Prosecution of the Federation (DPPF) at the Office of the Attorney General of the Federation and Minister of Justice to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of operations of Twitter in Nigeria.\nA check by SaharaReporters in the early hours of Saturday showed that the platform is no more active within the country."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "Buhari, Biafra And Twitter, By Ozodinukwe Okenwa",
    "summarized_story": "Nigeria, contrary to what Adesina, the Senior Special Adviser to the President on Media and Publicity, believes, does not need the combination of General Buhari andPresident Buhari.\nWhether as a General or President Buhari has proven himself to be a failure.\nTwitter enjoys a large following in Nigeria given the mobile young generation the country boasts of.\nSOC OkenwaBesides, the statement equally \"directed the National Broadcasting Commission to immediately commence the process of licensing all OTT and social media operations in Nigeria\".\nBy reaching the draconian abhorrent decision to ban Twitter from our national space Buhari has demonstrated yet again his primitiveness and lawlessness."
  },
  {
    "headline": "BREAKING: US cautions FG, says Twitter suspension 'sends poor message to investors'",
    "summarized_story": "The United States mission in Nigeria has cautioned the federal government on the recent suspension placed on the operations of Twitter.\nReacting to the suspension in a statement on Saturday, the US said such suspension undermines citizens fundamental freedoms and also sends a wrong message to investors.\nThe Government’s recent #Twitterban undermines Nigerians’ ability to exercise this fundamental freedom and sends a poor message to its citizens, investors and businesses,” the statement reads.\nAdvertisement“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms.\n“The path to a more secure Nigeria lies in more, not less communication, alongside concerted efforts toward unity, peace, and prosperity.”More to follow…"
  },
  {
    "headline": "BREAKING: US cautions FG, says Twitter suspension 'sends poor message to investors'",
    "summarized_story": "The United States mission in Nigeria has cautioned the federal government on the recent suspension placed on the operations of Twitter.\nReacting to the suspension in a statement on Saturday, the US said such suspension undermines citizens fundamental freedoms and also sends a wrong message to investors.\nThe Government’s recent #Twitterban undermines Nigerians’ ability to exercise this fundamental freedom and sends a poor message to its citizens, investors and businesses,” the statement reads.\nAdvertisement“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms.\n“The path to a more secure Nigeria lies in more, not less communication, alongside concerted efforts toward unity, peace, and prosperity.”More to follow…"
  },
  {
    "headline": "Wamakko: South-east leaders' silence on attacks against northerners no longer acceptable",
    "summarized_story": "Aliyu Wamakko, senator representing Sokoto north, has accused Igbo leaders of not speaking up against the “recent undue harassment” of northerners in the south-east region.\nWamakko, who described the attacks as “a disturbing snowballing of a little flame into a raging fire that is threatening the peace and stability of Nigeria”, said the silence of south-east leaders is no longer excusable.\n“Through all these, as individual leaders and collectively, we have maintained a studied silence by avoiding anything that will further rock the boat.\nSilence is no longer acceptable in the face of this clear danger and threat against the country.\nIPOB has often been accused of carrying out violent attacks in the south-east since it launched the Eastern Security Network (ESN), its militant arm."
  },
  {
    "headline": "Wamakko: South-east leaders' silence on attacks against northerners no longer acceptable",
    "summarized_story": "Aliyu Wamakko, senator representing Sokoto north, has accused Igbo leaders of not speaking up against the “recent undue harassment” of northerners in the south-east region.\nWamakko, who described the attacks as “a disturbing snowballing of a little flame into a raging fire that is threatening the peace and stability of Nigeria”, said the silence of south-east leaders is no longer excusable.\n“Through all these, as individual leaders and collectively, we have maintained a studied silence by avoiding anything that will further rock the boat.\nSilence is no longer acceptable in the face of this clear danger and threat against the country.\nIPOB has often been accused of carrying out violent attacks in the south-east since it launched the Eastern Security Network (ESN), its militant arm."
  },
  {
    "headline": "Tompolo: FG has until end of June to constitute NDDC board",
    "summarized_story": "Government Ekpemupolo, better known as Tompolo, says he has “reluctantly” agreed to allow the process of constituting a board for the Niger Delta Development Commission (NDDC) till the end of June.\nAdvertisementAkpabio had visited Delta state to plead with Tompolo over a seven-day ultimatum issued in May for President Muhammadu Buhari to constitute the NDDC board or face a complete breakdown of law and order in the south-south region.\nTompolo said Akpabio had promised to constitute the board immediately, adding that the minister had asked that the process be allowed till the end of June to be completed.\nAdvertisement“As it stands now, I have accepted the outcome of the meeting reluctantly.\nThe ultimate goal in this issue is for the Minister to abide by the promise he has made to start the process of constituting the NDDC board now."
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "5 Reasons Why You Should Consider A Loan from Page Financials",
    "summarized_story": "If you are still thinking about whether or not to consider a personal loan, we have highlighted 5 reasons why customers usually resort to getting a personal loan.\nDebt ConsolidationOne of the popular reasons to get a personal loan from Page is for debt consolidation.\nWhat To Consider When Considering A Personal LoanApplying for a Page Loan is super easy, everything happens online and you don’t need to visit their office.\nConsider avoiding a personal loan if:You can’t afford it.\nIf you can’t afford monthly payments for your new personal loan, consider skipping it."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "4 ways Nigeria’s Twitter ban would affect businesses",
    "summarized_story": "He also disclosed the government’s directive to the National Broadcasting Commission (NBC) to start licensing all over-the-top (OTT) and social media operations.\nThe Twitter ban would also affect the country’s economy.\nFreelancersThe increase in Internet penetration has increased the number of people making a living off the Internet, specifically social media.\nAdvertisementFrom social media managers to content creators and product photographers, thousands of Nigerians have created careers off these platforms.\nThese are all activities that a social media ban would hinder."
  },
  {
    "headline": "Nigerian government suspends access to Twitter indefinitely, Facebook, others could be next",
    "summarized_story": "The Nigerian Federal Government has announced that it will be indefinitely blocking access to microblogging and social media platform, Twitter, in Nigeria.\nOn Friday, June 4, 2021, Nigeria’s Federal Ministry of Information and Culture made this move known on its Twitter and Facebook handles.\nOver the years, Twitter has become an important social media platform for Nigerians.\nNigeria’s latest suspension means that it could order telecom companies to block access to Twitter if this move is not fought against.\nAdvertisementHowever, all signs point to the fact that the Social Media Bill could be very much alive."
  },
  {
    "headline": "Using WhatsApp On Multiple Devices, Building Africa's Tesla, Twitter Activates Subscription Service • Techpoint Africa",
    "summarized_story": "Today, I’m discussing:WhatsApp’s multi-device supportBuilding Africa’s TeslaTwitter launching Twitter BlueOne WhatsApp account, multiple devicesInstant messaging app, WhatsApp, will soon allow users to simultaneously open one account across several devices.\nWhen are these features coming?\nThough there is no launch date for these features, Zuckerberg hints at some time within the next two months.\nAdvertisementTwitter launches premium subscription serviceTwitter launched its premium subscription service, Twitter Blue, on June 3, 2021.\nWhile Twitter didn’t mention a cost, my story about the coming of Twitter Blue might give you an idea."
  },
  {
    "headline": "Nigerian govt hunts for VPN users as Twitter ban kicks off",
    "summarized_story": "Nigerian govt hunts for VPN users as Twitter ban kicks offA statement from the office of the attorney general of Nigeria has threatened to prosecute any Nigerian found to have downloaded a Virtual Private Network (VPN) with the aim to bypass the ban on Twitter.\nRead Also: As telcos enforce Nigeria’s Twitter ban, experts disagree on the legality Abubakar Malami, the minister of justice and attorney…"
  },
  {
    "headline": "As telcos enforce Nigeria’s Twitter ban, experts disagree on the legality",
    "summarized_story": "As of 12 am on Saturday, 5 June 2021, Twitter users in Nigeria using any of the four telecom operators, MTN, Globacom, Airtel, and 9Mobile started to experience limited services.\nNetblocks, a watchdog organization that monitors cybersecurity and the governance of the internet, also confirmed the restriction of Twitter in Nigeria from the morning of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why no African made 106 global millennial billionaires’ list",
    "summarized_story": "No citizen of an African country made the list of 106 richest millennial billionaires in the world, analysis of the latest data on millennial billionaires published by Visual Capitalist shows.\nBy producing 33 millennial billionaires, the US accounts for $266.7 billion of the youngest billionaires’ wealth, representing 46.5 percent of the total 106 millennial billionaires’ wealth.\nGermany produces eight millennial billionaires with a combined wealth of $11.7 billion, which represents 2 percent of the total wealth.\nThe five youngest billionaires from Russia control 6.4 percent of the total wealth which amounts to $36.8 billion, while Sweden’s five millennial billionaires control 2.4 percent of the total wealth of the 106 millennial billionaires, amounting to $13.9 billion.\nIndia’s millennial billionaires are worth $4.8 billion, which represents 0.8 percent of the total wealth of the 106 millennial billionaires worldwide."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "Legislate on child protection, JDPCI urges lawmakers – Nigerian Observer",
    "summarized_story": "Speaking on the the theme of the 2021 Child Protection Day, “The Role of Parents and Caregivers in the Protection of Children, the Coordinator of the Edo State Child Protection Network, Barr.\nHe listed the types of Child Abuse to include Physical, Emotional and Sexual Abuses, asserting that abusing a child constituted the worst thing anybody could do to a child.\nWhen you protect children, you are not doing them a favour.\nIt is the duty of everyone to protect children because we are all stakeholders.\n“Not putting a child in school is another form of child abuse."
  },
  {
    "headline": "#TwitterBan: Banning social media undermines fundamental freedoms, U.S. tells Nigerian govt",
    "summarized_story": "ADVERTISEMENTThe Nigerian government’s recent Twitter ban undermines freedom of expression and sends a poor message to citizens and investors, the U.S. government has said.\nIn a statement posted on its Twitter handle, the U.S. Mission in Nigeria advised the Nigerian government to consider a different path to secure Nigeria.\nDetails later…"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigerian govt vows to prosecute citizens for using Twitter",
    "summarized_story": "Nigeria’s Attorney General and Minister of Justice, Abubakar Malami, (SAN), has directed immediate prosecution of offenders of the federal government ban on Twitter operations in Nigeria.\nOn Friday, Alhaji Lai Mohammed, Minister of Information and Culture, announced an indefinite suspension of Twitter operations in the country.\nThe announcement came after the platform yanked off a tweet of President Muhammadu Buhari on civil war.\nTo circumvent the ban, many Nigerians had opted for the Virtual Private Networks (VPNs).\n“Malami directed the DPPF to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”"
  },
  {
    "headline": "Nigeria’s Twitter ban a brazen abuse of fundamental human rights",
    "summarized_story": "Digital rights body, Paradigm Initiative, has described the decision of Nigeria’s federal government to ban access to social media platform, Twitter, as a brazen abuse of human rights.\nMany Nigerians, according to the Initiative, read the announcement of the ban on Twitter as a reflection of the importance of the platform and other digital (social media) platforms to Nigerians in accessing information and disseminating the same.\nThis move is therefore aimed at making him unaccountable to the people of Nigeria who constantly take to social media platforms to share their views on the actions and policies of the government.\n“It is evident that shutting down Twitter is illegal and illegitimate policies such as this are unacceptable!\nWe urge the Nigerian authorities to respect and enforce citizens’ fundamental rights as provided for by the Nigerian constitution and International human rights treaties that Nigeria is a party to."
  },
  {
    "headline": "Nigerians resort to VPN to access Twitter as NCC, telcos block access on govt orders",
    "summarized_story": "OBINNA EZUGWUNigerian tweeps have resorted to using Virtual Private Network (VPN) as the country’s telecommunications operators have blocked access to Twitter on the order of President Muhammadu led Federal Government.\nBy 12 am on Saturday, many noticed that they could not longer access the platform using their mobile networks.\nThe telcos, under the aegis of the Association of Licensed Telecoms Operators of Nigeria (ALTON) said there had been a directive from the Nigerian Communications Commission (NCC) to block Nigerians from accessing the platform.\nALTON statement reads: “We, the Association of Licensed Telecommunication Operators of Nigeria (ALTON) wish to confirm that our members have received formal instructions from the Nigerian Communications Commission (NCC), the industry regulator to suspend access to Twitter.\n“Based on national interest provisions in the Nigerian Communications Act, 2003, and within the licence terms under which the industry operates; our members have acted in compliance with the directives of the Nigerian Communications Commission (NCC) the industry regulator."
  },
  {
    "headline": "NAFDAC, Global Alliance for Trade partner to enhance ease of doing business in Nigeria",
    "summarized_story": "The project is being powered by the Global Alliance for Trade Facilitation.\nShe said NAFDACs focus now is to ensure smooth trade facilitation and regulation, stressing that operations of regulators should not pose an hinderance to trade transactions but facilitate them.\n‘We are also working clearly on defining export data, documents and processes for the Nigeria Customs service, and other partner agencies.\n‘’In February we realized a memorandum of understanding with the Nigeria Customs as a lead agency for border operations in Nigeria.\nLast month we had an executive master class for the management of the Nigeria Customs Service on trade facilitation agreement issues in Nigeria’’."
  },
  {
    "headline": "Nigeria Ban: Twitter Announces Next Line Of Action",
    "summarized_story": "Popular microblogging and social networking service, Twitter, has promised to restore access to its new platform to all Nigerians.\nThe twwet was a reaction to the indefinite suspension slammed on it by the Federal Government of Nigeria on Friday.\nThe action taken by the Federal Government now puts the country in the class of North Korea, Iran, China and Turkmenistan that banned access to Twitter.\nADVERTISEMENTTwitter’s tweet reads, “We are deeply concerned by the blocking of Twitter in Nigeria.\n“We will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world."
  },
  {
    "headline": "OPINION: Why Twitter Ban Is Disastrous For Nigeria",
    "summarized_story": "Yesterday the federal government of Nigeria released a statement via its official Twitter handle of the ministry of information and culture, banning all Twitter service operations in Nigeria.\nThis ban invariably means that Twitter services will no longer be accessible directly on the internet via any Nigeria Internet Service Provider.\nThe ban is to mandate all Internet Service Providers in Nigeria to prevent its internet users from accessing Twitter services either via the regular web or mobile application.\nFor the federal government to effect this ban, Internet Service Providers will need to identify and blacklist all IP addresses that belong to Twitter.\nOnce this is done, no one should be able to access Twitter again directly from their phones, or laptops."
  },
  {
    "headline": "Illegal Twitter Users Risk Prosecution – AGF",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, on Saturday, directed the Director of Public Prosecution of the Federation to begin immediate prosecution of those who violate the Federal Government’s order suspending Twitter operations in Nigeria.\nMalami’s spokesman, Umar Gwandu, disclosed this in a statement titled, ‘Twitter ban: Malami orders prosecution of offenders.’The Nigerian Twitterati woke up on Saturday encountering difficulty in accessing their Twitter handles while some navigated the hurdle using virtual private networks.\nThe statement by the AGF read, “Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN has directed the immediate prosecution of offenders of the Federal Government ban on Twitter operations in Nigeria.\n“Malami directed the Director of Public Prosecution of the Federation at the Office of the Attorney General of the Federation and Minister of Justice, to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of operations of Twitter in Nigeria.\n“Malami directed the DPPF to liaise with the Ministry of Communication and Digital Economy, National Communication Communication and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”"
  },
  {
    "headline": "Bandits Kill 5 In Fresh Kaduna Attacks",
    "summarized_story": "No fewer than five residents of Chikun and Igabi local government areas were killed by bandits, Kaduna State government has disclosed.\nThe statement explained that two citizens were killed, as two others sustained injuries at Kabai general area of Chikun LGA.\nAccording to the statement, the security agencies also reported that a church building of the Assemblies of God denomination and one house were burnt by the attackers.\nADVERTISEMENTThe statement further said governor Nasir El-Rufai has condoled families of the five citizens and prayed God grants them eternal rest.\nAruwan added that, the governor directed the Kaduna State Emergency Management Agency to carry out immediate assessment at the church and the other affected building in Kabai village."
  },
  {
    "headline": "Twitter Ban: Nigerian Editors Urge Federal Govt To Rescind Decision",
    "summarized_story": "The Nigerian Guild of Editors (NGE) has urged the federal government to tread with caution and immediately reconsider the suspension of the operation of Twitter in Nigeria.\nThe umbrella body of Nigerian Editors also urged the federal government to seek other legitimate means of resolving its dispute with the microblogging platform.\n‘’The Guild sees the federal government’s action as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’The Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check dictatorship and promote democracy worldwide.\nThe Guild, therefore, called on the federal government to immediately rescind its decision in order not to deny millions of Nigerians who rely on Twitter to provide services and earn a living."
  },
  {
    "headline": "Kaduna spends N211m monthly on refuse evacuation — Commissioner —",
    "summarized_story": "The Kaduna State Government says it spends N211 million monthly on refuse evacuation across the three metropolitan cities in the state.\nAccording to him, Kaduna state which hosts the third largest city in the country generates huge refuse due to increase in population and indiscriminate disposal.\nHe said that the heaps of refuse were being evacuated mainly from Zaria, Kafanchan and Kaduna metropolises.\nIbrahim added that the state government engaged the services of refuse contractors to ensure proper evacuation of refuse across the state.\nHe also urged residents to take ownership of the exercise by informing government whenever refuse were not promptly evacuated."
  },
  {
    "headline": "Police investigate murder of DSS operative in Ekiti — Daily Times Nigeria",
    "summarized_story": "The Police Command in Ekiti State on Saturday confirmed the murder of a detective with the Department of the State Security Service (DSS) in a hotel at Ado Ekiti on Friday night.\n“I can confirm we heard that the DSS operative was killed during a hot argument with some soldiers yesterday, (Friday) evening.\nThe News Agency of Nigeria (NAN) reports that the incident happened in Ado Ekiti on Friday evening as three soldiers allegedly killed DSS operative inside the hotel (names withheld).\n“When the DSS man got to the soldiers, a hot argument ensued between them and one of the soldiers became so angry that he drew out a knife and stabbed DSS operative in the neck.\n“The DSS man fell immediately and started bleeding."
  },
  {
    "headline": "Twitter Ban: Malami orders prosecution of offenders — Daily Times Nigeria",
    "summarized_story": "Justice Minister Abubakar Malami, SAN, has directed for the immediate prosecution of offenders of the Federal Government’s ban on Twitter operations in Nigeria.\nThe order is contained in a statement issued by Dr Umar Gwandu, Malami’s Special Assistant on Media and Public Relations on Saturday in Abuja.\nMalami directed the Director of Public Prosecution of the Federation (DPPF) of the office of the Attorney General to swing into action and commence in earnest the process of prosecution of violators of the federal government de-activation of operations of Twitter in Nigeria.\nHe also directed the DPPF to liaise with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay."
  },
  {
    "headline": "Twitter’s suspension : Makinde appeals FG to reverse its decision —",
    "summarized_story": "Gov Seyi Makinde of Oyo State has appealed to the Federal Government to reverse its suspension on Twitter for the greater good of Nigerians.\n“Nigerian youths and digital communications organisations earn a living from being able to use the platform to post communications on behalf of their clients.\n“Others who may not have physical stores also rely on twitter to give visibility to their products and services” he asserted.\nMakinde further stated that Twitter provided a platform “for young people and indeed all Nigerians to exercise their fundamental right to express and publish an opinion.\nHe urged the Federal Government to beactively interested in how certain policies and action will affect investor confidence."
  },
  {
    "headline": "Presidency speaks on Twitter suspension in Nigeria, says removal of Buhari’s tweet disappointing",
    "summarized_story": "By GARBA SHEHUPRESIDENTIAL STATEMENT ON TWITTER SUSPENSION IN NIGERIAThe temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThere has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nNevertheless, the removal of President Buhari’s tweet was disappointing.\nA terrorist organisation (IPOB) poses a significant threat to the safety and security of Nigerian citizens.\nTwitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Presidency speaks on Twitter suspension in Nigeria, says removal of Buhari’s tweet disappointing",
    "summarized_story": "By GARBA SHEHUPRESIDENTIAL STATEMENT ON TWITTER SUSPENSION IN NIGERIAThe temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThere has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nNevertheless, the removal of President Buhari’s tweet was disappointing.\nA terrorist organisation (IPOB) poses a significant threat to the safety and security of Nigerian citizens.\nTwitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "NBA threatens lawsuit, says Twitter suspension illegal",
    "summarized_story": "The Nigerian Bar Association has threatened to challenge in court, the decision of the Federal Government to suspend the operations of microblogging site Twitter in the country.\nNBA President, Olumide Akpata, who made this known in a statement on Friday night, described the government’s decision as illegal.\nThe PUNCH had earlier reported that Twitter deleted a post by the Nigerian President, Major General Muhammadu Buhari (retd.\nConsequently, Minister of Information and Culture, Lai Mohammed, announced the suspension of Twitter today, citing the “persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence”.\n“Consequently, if this decision is not immediately reversed, the Nigerian Bar Association will have no choice but to challenge same in the interest of the public and our democracy.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "NBA threatens lawsuit, says Twitter suspension illegal",
    "summarized_story": "The Nigerian Bar Association has threatened to challenge in court, the decision of the Federal Government to suspend the operations of microblogging site Twitter in the country.\nNBA President, Olumide Akpata, who made this known in a statement on Friday night, described the government’s decision as illegal.\nThe PUNCH had earlier reported that Twitter deleted a post by the Nigerian President, Major General Muhammadu Buhari (retd.\nConsequently, Minister of Information and Culture, Lai Mohammed, announced the suspension of Twitter today, citing the “persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence”.\n“Consequently, if this decision is not immediately reversed, the Nigerian Bar Association will have no choice but to challenge same in the interest of the public and our democracy.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "Twitter Suspension: Malami’s Prosecution Order Is Illegal, Null And Void – PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) declares that the directive by the All Progressives Congress (APC)-led administration to arrest and prosecute any Nigerian using Twitter, is blatantly unconstitutional, illegal, null and completely of no moment.\nThe PDP states that nothing in our extant laws, not even the suspension of Twitter in Nigeria, constitutionally criminalized the use of Twitter by Nigerians or empowers the Federal Governments to arrest and prosecute any Nigerians for using Twitter.\nPresident Muhammadu Buhari and his APC are informed that there is no extant law that defined the use of Twitter as a criminal offence and there is no penalty prescribed in a written law for the use of Twitter by any Nigerians.\nMoreover, they should also realize that the suspension of Twitter by the APC Federal Government, in addition to its unconstitutionality, only suspended Twitter operations and not the use of Twitter by Nigerians.\nThe PDP again cautions the Buhari Presidency and the APC to end their acts of suppression against Nigerians as such amounts to pushing the people to the wall."
  },
  {
    "headline": "Nigerians Ignore Buhari, Continue To Tweet Despite Prosecution Threat",
    "summarized_story": "Nigerians have continued to twitter despite the Muhammadu Buhari administration’s threats to arrest and punish anyone who tweets in the country.\nThe minister of justice, Abubakar Malami, issued a statement on Saturday afternoon ordering the arrest and punishment of any Nigerian spotted using Twitter.\n“You want to arrest anyone still using Twitter?” Mr Suleman asked.\n— Demola Olarewaju (@DemolaRewaju) June 5, 2021Deji Adeyanju, an activist, questioned the legality of Mr Malami’s order.\nWhich police station should I report to for using Twitter?,” he said."
  },
  {
    "headline": "When Charged In Court, Nigerians Who Continue To Use Twitter Will Be Aware Of The Law They Are Breaking — Malami",
    "summarized_story": "Abubakar Malami, the Attorney-General of the Federation and Minister of Justice, ordered the prosecution of Nigerians who disobeyed the government’s Twitter ban on Saturday, though he did not specify which law was being broken.\nThe point is that Twitter is no longer accessible.\n#TwitterBan#On Friday, the government declared a “indefinite suspension” of Twitter operations in Nigeria, via the communications minister, Lai Mohammed.\nThis happened two days after Twitter removed a contentious remark by President Muhammadu Buhari, which many Nigerians interpreted as a veiled threat of violence against the Igbo ethnic group and which Twitter said violated its rules.\nMany people both inside and outside Nigeria have spoken out against the ban."
  },
  {
    "headline": "All Buhari Accounts Should Be Deleted On Your Platform, Fayose Tells Facebook, Instagram And Others",
    "summarized_story": "Former Ekiti state governor, Ayo Fayose, has called on Twitter and other social media platforms to deactivate President Buhari’s accounts following the Federal government’s move to halt Twitter’s operations in Nigeria after the website deleted President Buhari’s tweets referencing the Civil War.\nGod, please save us from President Buhari, ‘the jonah in our ship’.\n“I will be deactivating my Twitter account for now.\nMinutes later, the account, which had over one million followers as of June 4, was no longer available on the social media platform.\nHowever, the account of her husband, @MBuhari, was still active as of the time of filing this report."
  },
  {
    "headline": "Breaking: FG suspends Twitter indefinitely in Nigeria",
    "summarized_story": "The Federal Government has suspended, indefinitely, the operations ofthe microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed theNational Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Arms proliferation: Nigerians alarmed as insecurity heightens",
    "summarized_story": "The Chief of Defence Staff (CDS), Gen. Lucky Irabor, recently decried the proliferation of illegal arms in Nigeria, saying it was a threat to the country’s corporate existence.\nA security expert, Dr. Don Belema, in his view, blamed it on the lack of harmonious relationships among security agencies in arms proliferation and poor border management.\nWe need to look at it and see how to move regulations that could control small arms in the country.\n“There is a committee of federal government bodies that are in charge of small arms proliferation and prevention.\n“They should work and share intelligence not only with relevant national security agencies, but also neighbouring countries and regional organs like ECOWAS."
  },
  {
    "headline": "Breaking: Tuchel strikes fresh Chelsea deal",
    "summarized_story": "Chelsea manager Thomas Tuchel has signed a contract extension until the summer of 2024.\nTuchel, 47, signed an initial 18-month deal when he replaced Frank Lampard as Blues boss in January.\nHe led the club to victory in the Champions League final and a fourth-placed finish in the Premier League.\nChelsea were ninth in the Premier League and without a win in five games when Tuchel was appointed at the start of the year.\nThe London club also reached the FA Cup final, where they were beaten 1-0 by Leicester at Wembley."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "#TwitterBan: Malami Orders Prosecution Of Offenders",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami has directed the immediate prosecution of offenders of the Federal Government’s ban on Twitter operations in Nigeria.\nThis was announced in a statement issued by the Office of the Attorney General of the Federation and Minister of Justice on Saturday.\nSpokesperson of the Ministry, Umar Jibrilu Gwandu said the AGF has directed DPPF to swing into immediate action and commence prosecution of the violators of the ban.\n“Malami directed the DPPF to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay,” the statement read in part.\nThe Federal Government of Nigeria on Friday announced the indefinite suspension of Twitter in the country."
  },
  {
    "headline": "#TwitterBan Is Clear Violation Of Democratic Rights – Reps Minority Caucus",
    "summarized_story": "The Minority Caucus in the House of Representatives has condemned the suspension of Twitter in Nigeria by the Federal Government describing it as a clear violation of freedom of speech and other democratic rights and tenets as provided by the 1999 constitution.\nThe lawmakers, in a statement by the Minority Leader of the House of Representatives, Ndudi Elumelu, on Saturday, described the suspension as “provocative, obnoxious and unjustifiable”.\nThey further described the suspension as suppressing of Nigerian citizens.\n“The Minority Caucus is disturbed that the suspension of Twitter in the country came after the social media platform deleted President Muhammadu Buhari’s tweets.\nThe Minority caucus, therefore, called on President Muhammadu Buhari to immediately reverse the suspension placed on Twitter so as not to exacerbate the already tensed situation in the country."
  },
  {
    "headline": "Twitter Blocked After FG’s Order To Telecos",
    "summarized_story": "Telecoms operators in Nigeria have blocked Twitter in Nigeria, a day after the Federal government announced its indefinite suspension.\nMr Adebayo noted that the association wished to confirm that its members had received formal instructions from NCC, the industry regulator, to suspend access to Twitter.\nCivil War TweetThe Federal Government of Nigeria on Friday announced the indefinite suspension of Twitter in the country.\nSeveral countries including China and Turkey have come under fire for putting restrictions on social media platforms such as Twitter.\nIn February Twitter condemned Myanmar for blocking access to its platform as part of a crackdown on social media, days after a coup that saw Aung San Suu Kyi and other civilian leaders jailed."
  },
  {
    "headline": "Bandits Kill Five, Raze Church Building In Kaduna",
    "summarized_story": "Bandits have attacked communities in Igabi and Chikun Local Government Areas of Kaduna State killing five persons and leaving two others injured.\nA church building belonging to the Assemblies of God church and one house was burnt by the attackers during the operation.\nSimilarly, security agencies also confirmed the killing of three travellers and injuring of several others around the Lambar Zango area of Kaduna-Zaria Road in Igabi Local Government Area.\nGovernor Nasir El-Rufai in reaction condoled families of the deceased and prayed that God grants them eternal rest.\nThe Governor who further prays for the speedy recovery of those receiving medical attention also directed the Kaduna State Emergency Management Agency to carry out an immediate assessment at the church and the other affected building in Kabai village."
  },
  {
    "headline": "NDLEA Seizes Tramadol, Diazepam Being Transported To Borno",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) operatives in Lagos has intercepted total of 34,950 capsules of Tramadol and Diazepam suspected to be heading to insurgents’ camps in Borno stateA 25-year-old suspect, Mohammed Isah was nabbed by the agency while trying to move the drugs from Lagos to Borno.\nThis was disclosed in a statement signed on Saturday by the spokesperson of NDLEA, Femi Babafemi.\n“He said Kakali advised him to either board a Tanker or Trailer from Lagos to Maiduguri to avoid being caught.\nInvestigations by the enforcement agency revealed that before Mohammed’s arrest, Kakali had travelled out of Lagos to Maiduguri to await the arrival of the consignment.\nChairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Bandits Attack: Kebbi Governor Visits Danko/Wassagu, commiserates with",
    "summarized_story": "Kebbi state governor, Atiku Bagudu has visited Danko/Wassagu local government area where suspected bandits killed over eighty persons.\nBagudu was in the local government in company of some of his cabinet members to commiserate and condole the people over the attack.\nThe governor pleaded with the people to remain calm as government is doing all within it’s powers to restore normalcy in the area.\nThe youth are calling on the authority to redouble effort in finding a lasting solution to the deteriorating security challenges.\nAdvertisementA reliable source in the village says the number of casualty figures have risen to ninety two persons while several others have sustained injuries."
  },
  {
    "headline": "Police confirm killing of 88 persons in Kebbi state",
    "summarized_story": "The Nigeria Police in Kebbi state have confirmed the killing of eighty eight persons in eight villages of Danko/Wassagu local government area of Kebbi state.\nThe public relations officer of the Command Deputy Superintendent Nafi’u Abubakar said the attack took place on Thursday night.Bandits Attack Claim Over Sixty lives in Kebbi Village.\nAccording to the Public Relations of the command, the police are are still gathering data and statistics to ascertain the exact numbers of casualties.\nHe says the police has already deployed a detachment of officers and men of the Nigeria Police to restore peace and stability and well as to investigate and go after the perpetrators.\nHe says the killing took place in villages of Koro, Kimpi, Haha, Dimi, Zutu, Rafin Gora and Iguenge all in Danko/ Wassagu local government area."
  },
  {
    "headline": "Telecoms operators receive orders to suspend Twitter",
    "summarized_story": "The Association of Licensed Telecommunication Operators of Nigeria (ALTON), has confirmed the receipt of directives from the Nigerian Communications Commission (NCC) to suspend access to Twitter.\nThe President of ALTON, Mr Gbenga Adebayo made this known in a statement made available to newsmen in Lagos, on Saturday.\nAdebayo noted that the association wished to confirm that its members had received formal instructions from NCC, the industry regulator, to suspend access to Twitter.\nHe said the association remained committed to supporting the government of the Federal Republic of Nigeria and upholding the rights of citizens.\nAs an industry, ALTON endorsed the position of the United Nations that the rights held by people offline must also be protected online, Adebayo’s statement said."
  },
  {
    "headline": "We’ll Work to Restore Access, Twitter Reassures Nigerians",
    "summarized_story": "American microblogging and social networking service, Twitter says it’s working to restore access for all Nigerians who rely on social media site to communicate and connect with the world.\nThe Nigerian government on Friday indefinitely suspended Twitter operations in the country, accusing the microblogging platform of undermining Nigeria’s existence.\nThe company said, “We are deeply concerned by the blocking of Twitter in Nigeria.\nAccess to the free and #OpenInternet is an essential human right in modern society.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria to Prosecute Citizens Who Disregard Twitter Ban – Arise News",
    "summarized_story": "The Nigerian government has ordered the prosecution of citizens who bypass the country’s firewall and continue the use of Twitter despite the ban in the country.\nThe West African country’s Minister of Justice and Attorney General of the Federation, Abubakar Malami gave the order on Saturday in a statement where he directed the Director of Public Prosecution of the Federation (DPPF) to prosecute offenders of the Federal Government ban on Twitter operations in Nigeria.\n“The AGF directed the Director of Public Prosecution of the Federation (DPPF) at his office to swing into action and commence in earnest the process of prosecution of violators of the Federal Government de-activation of operations of Twitter in Nigeria,” the statement signed by Umar Gwandu, a special assistant to the minister read.\n“The DPPF is to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”"
  },
  {
    "headline": "Twitter Ban Projects Nigeria as a Dictatorship: Editors",
    "summarized_story": "Editors in Nigeria have called on the federal government to immediately reconsider the suspension of operations of Twitter as the move projects the Nigerian government as a dictatorship.\n‘’The Guild sees the federal government’s action as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’If the federal government finds Twitter’s action against the President objectionable, Nigerians should not be made to suffer the collateral damage of denying them their right to freely discourse on Twitter’’, the Guild added.\n‘’Certainly, the federal government has the responsibility to safeguard the unity, peace and stability of Nigeria and any person or group that threatens this must draw its ire.\n‘’The Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check dictatorship and promote democracy worldwide."
  },
  {
    "headline": "G7 Nations Strike Deal to Tax Big Companies and Squeeze Havens",
    "summarized_story": "“G7 finance ministers have reached a historic agreement to reform the global tax system to make it fit for the global digital age,” British finance minister Rishi Sunak said after chairing a two-day meeting in London.\nU.S. President Joe Biden’s administration gave the stalled talks fresh impetus by proposing a minimum global corporation tax rate of 15%, above the level in countries such as Ireland but below the lowest level in the G7.\nGerman finance minister Olaf Scholz said the deal was “bad news for tax havens around the world”.\n“Companies will no longer be in a position to dodge their tax obligations by booking their profits in the lowest-tax countries,” he added.\nIrish finance minister Paschal Donohoe, whose country is potentially a big loser with its 12.5% tax rate, said any global deal also needed to take account of smaller nations."
  },
  {
    "headline": "Nigeria: It Will Affect Investors Confidence, Oyo Governor Makinde Asks FG to Reverse Twitter Ban",
    "summarized_story": "Governor of Nigeria’s southwestern Oyo State, Seyi Makinde says the federal government’s decision to ban Twitter operations in the country will affect investor’s confidence and called on the Nigerian leader to reverse the decision.\n“Twitter has become the platform for young people and indeed all Nigerians to exercise their fundamental right to express and publish an opinion.\n“We should also remember that Twitter has gone beyond a source of communication for many of our hardworking youths in Nigeria.\n“Furthermore, I believe the Federal Government should be actively interested in how certain policies and action will affect investor confidence.\nI, therefore, use this medium to appeal to the Federal Government to reverse this suspension for the greater good of Nigerians.”By Abel Ejikeme"
  }
]