[
  {
    "headline": "Bello rebuffs calls for rotational presidency, calls it outdated",
    "summarized_story": "The Governor of Kogi State, Yahaya Bello, has rebuffed recent appeals for a rotational presidency, tagging it an outdated system.\nHe said this at the Presidential Villa in Abuja on Thursday while addressing State House Correspondents.\nThis was after a meeting with the President, Major General Muhammadu Buhari (retd.)\nBello also said that he will consider the various calls from Nigerians and run for presidency come 2023.\nHe further emphasised the need for Nigerians to put a high premium on virtues such as competence and capacity when electing the next president."
  },
  {
    "headline": "Twitter to introduce ‘undo tweet’ option",
    "summarized_story": "Popular microblogging platform, Twitter, is set to introduce the ‘undo tweet’ option in its new subscription service known as Twitter Blue.\nAs tweeps had always clamoured for an ‘edit’ button, Twitter is offering a similar option known as the ‘undo tweet’ button.\nWith the ‘undo tweet’ option, users can be allowed to preview a tweet before actually posting it.\nThe ‘undo tweet’ option comes with the new subscription, Twitter Blue, which attracts a monthly fee of $3.49 CAD or $4.49 AUD.\nAsides from the ‘undo tweet’ option, another feature is the ability for the users to change the look inside the app, including the colour of the Twitter app icon."
  },
  {
    "headline": "TWEETS: Stop threatening Ndigbo, 1967 can’t be repeated in Igboland — IPOB tells Buhari",
    "summarized_story": "IPOB urged President Buhari to stop threatening Ndigbo, saying that Ndigbo of today are not the one of 1967 that the Nigeria government under which he played major role killed massively.\nWhile commending Twitter for deleting the alleged President Buhari’s tweets, IPOB told Twitter to completely delete the President from its systems.\nIPOB demands that Twitter should go a step further to completely delete Buhari from its system as a deterrent to other tyrants.\n“We know that the global outrage sparked by the evil, unpresidential and genocidal tweets made the cabal running the zoo to beg Twitter to delete them.\nThe 1967 genocide can never be successfully repeated in Biafra land by anybody including Buhari and his administration, that is an assurance."
  },
  {
    "headline": "Insecurity: Uzodimma, Umahi asked to convey multi-stakeholders meeting",
    "summarized_story": "By Chinonso Alozie, OwerriThe Igbo National Council, INC, yesterday called on the governor of Ebonyi, and Imo state, Dave Umahi and Hope Uzodimma, to convey a multi-stakeholders peace meeting to end the insecurity in Igboland.\nINC, president, Chilos Godsent, made this call in Owerri, while suggesting a way out of the insecurity in the Southeast zone.\nINC said that the need for a peace meeting has come because the presence of military personnel in Igboland was leading to killing of unarmed civilians in the land.\nAccording to INC, “The Igbo National Council (INC) worldwide is deeply worried over the increasing violent attack and militarization of the Igbo Nation territory by dreaded armed Fulani Machineries and military gang who were deployed to Igbo Nation to kill our people and decimate our population.\nWe have observed the desperate reckless engagement of the murderous Fulani armed military gang against the armless Igbo population in our own territory."
  },
  {
    "headline": "Presidency faults article on Nigeria by Foreign Affairs Magazine",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJATHE Presidency yesterday faulted the latest article on Nigeria published by the Foreign Affairs (Magazine) in United States, titled, ‘The Giant of Africa is Failing’, which was written by John Campbell, an American diplomat.\nIn a letter titled “Re: Giant of Africa Falling: Stating the Facts” Shehu wrote: “The latest article on Nigeria in Foreign Affairs titled ‘The Giant of Africa is Failing’ is unfair both to a magazine with such an esteemed pedigree and to its readers.\n‘It’s not just a question of the invented addition of ‘to Nigeria’ with regard to AFRICOM.\nNigeria faces multiple challenges, not least of which is the dissemination of fake news and prejudiced opinion.\nIt is still a surprise, and a disappointment, to see them joined by Foreign Affairs.”"
  },
  {
    "headline": "Constitutional Amendment: Okowa recommends devolution of powers to states, councils",
    "summarized_story": "ThursdayDelta Governor Dr. Ifeanyi Okowa, on Thursday, advocated for the devolution of powers to states and local governments to stop overburdening the Federal Government with many responsibilities.\nOkowa made the call when he received on a courtesy visit, House of Representatives Sub-Committee on review of the 1999 Constitution led by Deputy Speaker of the House, Rt.\nHe said that there hadn’t been any review since 1999 even when the Constitution provided for a review every five years.\n“For justice and fairness, the revenue allocation commission should lay its proposal directly to the National Assembly,” he stated.\n“So, the best way forward is truly to increase the revenue allocation by way of derivation."
  },
  {
    "headline": "APC has failed Nigeria ― Ortom",
    "summarized_story": "By Adeola BadruBenue State Governor, Samuel Ortom, has said that the ruling All Progressives Congress, APC, has failed Nigeria economically, security-wise, socially, and politically, saying the party is deficit.\n“Let me once again call on the APC led Federal Government to rise up and give leadership.\nWithout security, there can be no meaningful development except in PDP controlled states.”“I want to challenge the APC in this country because they have failed.\nEconomically, security wise, socially and politically, the APC government is in deficit.”“Government is all about providing security for lives and property.\nThat is what leadership is and that is what the people of Nigeria are yarning for,” he said."
  },
  {
    "headline": "June 12: Prophet TB Joshua declares fasting, prayer for Nigeria",
    "summarized_story": "Prophet TB Joshua, founder of the Synagogue, Church of All Nations (SCOAN) has called for fasting and prayer for Nigeria.\nJoshua said Nigerians should fast and pray for Nigeria on June 12, 2021, which happens to be his birthday.\nI feel their pain; I feel their worry so pray for Nigeria on June 12, 2021.\n“Let us dedicate this day to prayer and fasting.\nDon’t forget the needy.”Dare: T.B Joshua reacts to death of Pastor Adeboye’s son"
  },
  {
    "headline": "South-East attacks: 'Stop arresting innocent youths'",
    "summarized_story": "Senate Minority leader, Enyinnaya Abaribe, has condemned the approach the federal government is taking to resolve South-East attacks.\nAbaribe in an interview on Arise TV on Thursday, condemned the arrest of innocent youths, especially young boys by security operatives in the South-East each time there is an attack on a security formation.\nHe also insinuated that there are speculations that the attacks which are being done in quick succession in Igbo land were aimed at scuttling the proposal for an Igbo presidency.\n“We have directed the inspector-general of police and other security agencies to conduct a thorough investigation not to just round up youths that you see, conduct extra-judicial killings and say you’ve resolved the issue.\n“All we are saying is, try to conduct a thorough investigation then we’ll know who is doing this, who their sponsors are and why they are doing it,” he said."
  },
  {
    "headline": "Biafra group slams Wike over threat to kill IPOB",
    "summarized_story": "The Biafra Nations League, BNL, has faulted Governor Nyesom Wike of Rivers State for threatening the Indigenous People of Biafra, IPOB.\nWike had issued the threat on Tuesday during the commissioning of construction work at the Ahoada Campus of the Rivers State University and the dualization of the Ahoada-Omoku Road in Ahoada Town.\nReacting, BNL dismissed the threats by Wike to kill and bury anyone associated with Biafra, particularly IPOB members in the state.\n“Any Governor who wants to kill his people over a cause will be haunted down no matter the kind of security men with him,” the statement added.\nHURIWA drags Wike before international court over threat to kill, bury IPOB members"
  },
  {
    "headline": "Twitter deletes video of Buhari threatening to deal with those who want to destroy his govt",
    "summarized_story": "Twitter has deleted the video of President Muhammadu Buhari, threatening to deal with those who want to destroy his government.\nRecall that Twitter had on Wednesday deleted the tweet for violating its rules.\nHowever, barely 24-hours after Lai Mohamed accused Twitter of meddling in the political affairs of the country, Twitter has now taken down the video of the threat.\nHe maintained that Buhari has the right to express himself.\nIt was taken down for violating Twitter rules."
  },
  {
    "headline": "Niger govt imposes total ban on commercial motorcycles in Minna",
    "summarized_story": "Niger State Police Command says it will, along with other security agencies in the state embark on aggressive enforcement of the total ban on commercial motorcycle operators popularly known as “Okada” in Minna as from 3rd June, 2021 as announced by Niger State Government.\nThe state Police Commissioner, Adamu Usman, in a statement made available to newsmen in Minna, said the command has observed with dismay the non compliance by Okada rider to ban.\nHe noted that any one anyone found violating the order shall have his motorcycle confiscated.\nHe explained that the measure was taken to ensure the safety and security of Minna metropolis in particular and Niger State in general.\nThe command then urged members of the public to cooperate with security agencies in the interest of general security of the state."
  },
  {
    "headline": "Chrocboy sets to release single, talk",
    "summarized_story": "By Ekaette BasseyFast rising music act, Kingsley Anche Clement aka Chrocboy has concluded arrangements to launch his first single ‘talk’ on June 25.\nThe Kaduna-born 26-year-old UNIJOS Mathematics graduate started playing music as a young boy in the church.\nADVERTISEMENTHe moved to Lagos in 2020 to pursue his musical career.\nChrocboy, who grew up in Michika, Adamawa State, said the single Is to establish himself as a musician worthy of huge fan base within and outside the country."
  },
  {
    "headline": "Nigeria flowing with bitterness, sadness – Obasanjo",
    "summarized_story": "By Ernest Nwokolo, AbeokutaFormer President Olusegun Obasanjo has lamented that rather than flowing with milk and honey, Nigeria has become a “land flowing with bitterness and sadness.”Obasanjo urged Nigerians to strive to change the narrative, saying geniuses abound in every section of the country to turn things around for good.\nObasanjo noted that God created Nigeria to lead the black race, lamenting the country has not fit into that role because of leadership failure.\n“The task before us now is to think of what to contribute to make Nigeria what God created it to be, a land flowing with milk and honey.\nRight now, it is land flowing with bitterness and sadness.\nAnd you should say what you should say and say it when you should say it."
  },
  {
    "headline": "Injury rules Alexander-Arnold out of Euro 2021",
    "summarized_story": "Our ReporterEngland have been dealt a major blow as Trent Alexander-Arnold has been ruled out of Euro 2020 due to a thigh injury.\nAlexander-Arnold limped out of England’s 1-0 friendly win over Austria on Wednesday night after picking up a knock, leading to fears over his participation in the summer tournament.\nThe England camp have released an official statement confirming the news, which reads: “Trent Alexander-Arnold has been ruled out of UEFA EURO 2020.\n“The Liverpool player sustained a thigh injury in the closing stages of Wednesday’s 1-0 win against Austria in Middlesbrough.\n“Trent Alexander-Arnold has withdrawn from England’s Euro 2020 squad due to injury,” the club briefing states."
  },
  {
    "headline": "BREAKING: I may run for 2023 presidency – Gov Bello",
    "summarized_story": "By Bolaji Ogundele, AbujaKogi Governor Yahaya Bello has said he is considering the possibility of heeding calls on him to contest the 2023 presidential election.\nGovernor Bello stated this during a chat with State House Correspondents after meeting with President Muhammadu Buhari in his office in the Presidential Villa in Abuja.\nADVERTISEMENTHe also said competence and capacity should be the criteria for electing the next president and not his ethnicity or region.\nDetails shortly…"
  },
  {
    "headline": "Olamide’s ‘Rock’ makes top 10 on billboard top triller global chart",
    "summarized_story": "By Ekaete BasseyOlamide Baddo’s latest song “Rock” has made it to the no.\n9 spots on Billboard’s top triller global chart, making him the only African artiste on the top 10.\nBillboard’s top triller global chart is updated weekly.\nThe latest one for the week ending on Saturday, June 5, 2021, shows Olamide’s “Rock” jump 8 spots from 17th position last week to 9th position this week.\nADVERTISEMENT“Rock” has attained that position by virtue of being one of the most used songs on the triller app since its release."
  },
  {
    "headline": "Gulak: S’East APC postpones commissioning of zonal secretariat",
    "summarized_story": "From Magnus Eze, EnuguThe All Progressives Congress (APC) in the South East has again postponed the commissioning of its zonal secretariat in Enugu.\nIt said the event slated for Friday, June 4, was shifted in honour of a chieftain of the party, Ahmed Gulak, who was recently killed on his way to the Sam Mbakwe Airport in Imo State.\nIn a statement, Nnamani said: “In honour of Alhaji Ahmed Gulak who was gruesomely murdered recently, the circumstance and place of death,’ we have decided to postpone the official commissioning of our SouthEast APC zonal secretariat to a future date.\n“Alhaji Gulak was a notable stalwart of our party and a very good friend of many of us from the SouthEast Chapter of APC.\n“We condemn without mincing words the murder of Alhaji Ahmed Gulak and call on security agencies to unravel the circumstances surrounding his death."
  },
  {
    "headline": "BREAKING: NECO names John Ogborodi Acting Registrar",
    "summarized_story": "From John Adams, MinnaThe Governing Board of the National Examinations Council (NECO) has approved the appointment of Mr. Ebikibina John Ogborodi as the Acting Registrar/Chief Executive of the Council.\nUntil his appointment, Mr. Ogborodi was the Director Special Duties in the Council.\nThe Acting Registrar joined the service of NECO in 1999 and had served in different capacities.\nHe was a former Acting Director, Examination Development Department; Acting Director, Office of the Registrar; Director, General Services and Director, Human Resource Management among others.\nMr. Ogborodi is married and blessed with children"
  },
  {
    "headline": "Christians have right to defend themselves against attack with equal force –Martins",
    "summarized_story": "By Philip NwosuCatholic Archbishop of Lagos, Alfred Adewale Martins, has said on Tuesday that Nigerians and particularly Christians being attacked and killed in the northern part of the country have right to defend themselves against incessant attacks on their communities by invaders, tagged: herders.\nMartins, who spoke during the celebration of its 62nd birthday anniversary, said one of the moral principles in life is that, “if a person is under attack, he has the right to defend himself with equal force that he is being attack.\nSo, in principle, every human being has the right to defend himself or herself.\n“Regrettably, those salient conventions have taken flight from our polity and thereby paved the way for mistrust, corruption and banditry.\n“From the North to the South, every part of the country is witnessing one form of brigandage or the other,” he said."
  },
  {
    "headline": "Igbo abroad insist on restructuring, fiscal federation",
    "summarized_story": "By Zika BobbyDiaspora Igbo group, the Igbo World Assembly (IWA), has said there was need to restructure Nigeria to ensure true federalism as it was in the 1963 Constitution based on regions.\nIt condemned Federal Government’s shoot-on-sight position, noting that such could be termed an act of ethnic cleaning.\nRestructuring of Nigeria, according to him, should be a means of tackling the worsening security situation and the agitation for secession.\n“We need a Nigerian political structure that is based on equity, fairplay, balance and equal access to political power for the good of all Nigerians.\nIWA states only restructuring can prevent Nigeria from disintegration.”Speaking on the Fulani herdsmen, he said Ndigbo will no longer tolerate the attack by herdsmen."
  },
  {
    "headline": "Tension as gunmen kill Ortom’s aide",
    "summarized_story": "Reacting to the incident, governor Ortom described the Dega’s murder as a huge blow to his administration and the entire state.\n“Retired AIG Dega served with me here and this is someone who has retired, but is not tired, and was very active.\nSo, for him to have been murdered in the manner they did, a retired AIG gunned down, is very sad,” Ortom stated.\nHe decried the increasing spate of insecurity that has bedevilled the North East, North West and North Central, South South, South East, South West, and called on security agencies to find the killers of his aide.\nMeanwhile, the Plateau state police command said it has arrested some suspected killers of Dega."
  },
  {
    "headline": "FG Protests Deletion of Tweet, Says Twitter Can’t Gag Buhari",
    "summarized_story": "The accusation followed the decision of Twitter to delete a controversial post by Buhari on the Nigerian civil war.\nThe same Twitter during the ENDSARS protests promoted tweets trying to raise funds for the ENDSARS protesters.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "Ezeife: South-east Violence, Plot to Undermine Clamour for Igbo Presidency",
    "summarized_story": "Ezeife described the insurrection in the South-east as an attempt to provoke indigenes of the South-east.\n“Now we know that more than 80 per cent of the people caught by the CCTV are not from the South-east.\nHe stated that a South-east governor who had earlier accused IPOB and ESN of executing the attacks had since exonerated the secessionist group.\nDuring the ENDSARS protests, people attributed what was happening in Lagos to some Igbo people and it was later discovered to be untrue.\nThe guild thanked Ganduje and members of the state Executive Council for providing the enabling environment for the national convention to hold."
  },
  {
    "headline": "$40bn Investments Needed for Nigeria’s Gas Plan, Says NNPC",
    "summarized_story": "He added that the figure on the quantum of funds needed is based on the submissions NNPC has received from potential investors.\nIn addition, he stated that about 39 thermal power plants were being targeted as opposed to the current 33.\nHe said: “In terms of benefits, we will generate 45,000 megawatts of power in terms of gas use, creating massive employment and import substitution.\n“There are changes we need to look at to actualise the decade of gas.\nHe stated that if Nigeria will achieve the decade of gas, it must transit to a willing-buyer willing-seller market."
  },
  {
    "headline": "‘Retired AIG Gunned down! This is Very Sad,’ Ortom Reacts to Aide’s Murder",
    "summarized_story": "The governor, while speaking to journalists Wednesday at Benue Peoples House, Makurdi, lamented that the retired AIG was very active even in retirement, saying it was painful that he was gunned down in such a gruesome manner.\n“Retired AIG Dega served with me here and this is someone who has retired but is not tired and was very active.\nSo for him to have been murdered in the manner they did, a retired AIG gunned down.\nThe governor, who stressed that insecurity had bedevilled the entire country, called on security agencies to find killers of his aide.\nGovernor Ortom sympathized with the family, friends and former colleagues of the deceased and prayed God to grant him eternal rest."
  },
  {
    "headline": "Breaking: Twitter Deletes Buhari’s Tweet Threatening to Deal With Secessionists ‘in the Language They Understand’",
    "summarized_story": "Twitter has deleted President Muhammadu Buhari’s tweet posted Tuesday where he threatened to deal with secessionists “in the language they understand”.\nThe social media giant said, “This Tweet violated the Twitter Rules.\nHe also threatened to deal with “those misbehaving today” “in the language they understand.”Though the President tweeted five tweets on his meeting with Prof. Yakubu, it was the last tweet that Twitter said violated its rules and was deleted, while the remaining four tweets were retained.\nThose of us in the fields for 30 months, who went through the war, will treat them in the language they understand.”The state House has yet to react to Twitter’s action.\nSee the thread of the original tweets below."
  },
  {
    "headline": "After Deleting Tweet, Twitter Removes Video Featuring Buhari's Genocidal Comment",
    "summarized_story": "The microblogging platform, Twitter, has yanked off a video which showed President Muhammadu Buhari threatening to deal with youths of the South-East.\nIn the video, Buhari noted the role he played alongside other Nigerian military officers in the Nigerian Civil War of 1966-70, which led to the murder of over three million Igbos.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansThis was after many Nigerians reported massively, Buhari's Twitter account likening the tweet to comments made by former United States President, Donald Trump which caused his ban from the social media app.\nSee Also Breaking News BREAKING: Twitter Is Bias, Favours Biafra Agitation, Nnamdi Kanu's Inciting Remarks—Nigerian Government“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”See Also Politics Nigerians Rejoice As Twitter Deletes Buhari’s ‘Genocidal Tweet’"
  },
  {
    "headline": "After Deleting Tweet, Twitter Removes Video Featuring Buhari's Genocidal Comment",
    "summarized_story": "The microblogging platform, Twitter, has yanked off a video which showed President Muhammadu Buhari threatening to deal with youths of the South-East.\nIn the video, Buhari noted the role he played alongside other Nigerian military officers in the Nigerian Civil War of 1966-70, which led to the murder of over three million Igbos.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansThis was after many Nigerians reported massively, Buhari's Twitter account likening the tweet to comments made by former United States President, Donald Trump which caused his ban from the social media app.\nSee Also Breaking News BREAKING: Twitter Is Bias, Favours Biafra Agitation, Nnamdi Kanu's Inciting Remarks—Nigerian Government“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”See Also Politics Nigerians Rejoice As Twitter Deletes Buhari’s ‘Genocidal Tweet’"
  },
  {
    "headline": "BREAKING: Tension In Lagos As Nigerian Soldier Kills Customs Officer",
    "summarized_story": "Tension has gripped people living around Seme boarder in Badagry area of Lagos state as a soldier on Wednesday night allegedly shot dead a Customs officer in the area.\nThe soldier, according to residents, was said to be under the influence of alcohol.\n“Fears are currently mounting on possible breakdown of law and order in this area,” a source said.\nMuyiwa Ogunjobi, police spokesman in Lagos state told SaharaReporters that the command was not aware of the incident.\n“We are not yet aware, where?"
  },
  {
    "headline": "'Check The Value Of Naira To Dollar When APC Came In'—Governor Ortom Slams Buhari Again",
    "summarized_story": "The Governor of Benue State, Samuel Ortom says President Muhammadu Buhari and the ruling party, the All Progressives Congress (APC), have failed Nigerians in all areas of governance.\nOrtom, who appeared to be bitter about the situation of the country, described the ruling APC as a complete failure.\nOrtom added that the PDP has been demonstrating good leadership as evident in its governors delivering laudable infrastructure projects.\nGo and check, economically, how much was one dollar when APC came into government in 2015?\n\"What was the nature of our security in this country when APC took over power?"
  },
  {
    "headline": "'Check The Value Of Naira To Dollar When APC Came In'—Governor Ortom Slams Buhari Again",
    "summarized_story": "The Governor of Benue State, Samuel Ortom says President Muhammadu Buhari and the ruling party, the All Progressives Congress (APC), have failed Nigerians in all areas of governance.\nOrtom, who appeared to be bitter about the situation of the country, described the ruling APC as a complete failure.\nOrtom added that the PDP has been demonstrating good leadership as evident in its governors delivering laudable infrastructure projects.\nGo and check, economically, how much was one dollar when APC came into government in 2015?\n\"What was the nature of our security in this country when APC took over power?"
  },
  {
    "headline": "2023: Yahaya Bello faults ‘rotational presidency', asks Nigerians to pick 'best candidate'",
    "summarized_story": "Yahaya Bello, governor of Kogi, has faulted the calls for the zoning of the presidency ahead of the 2023 election.\nAdvertisementSpeaking with journalists after a visit to President Muhammadu Buhari on Thursday, the governor said “rotational presidency” has outlived its usefulness.\nLet us evaluate our successes or achievements from this seeming rotational presidency between then and now,” he said.\nYou see, we are where we are today not because we are practising rotational presidency.\n“So, I want to believe that when the time comes, Nigerians will see reason."
  },
  {
    "headline": "2023: Yahaya Bello faults ‘rotational presidency', asks Nigerians to pick 'best candidate'",
    "summarized_story": "Yahaya Bello, governor of Kogi, has faulted the calls for the zoning of the presidency ahead of the 2023 election.\nAdvertisementSpeaking with journalists after a visit to President Muhammadu Buhari on Thursday, the governor said “rotational presidency” has outlived its usefulness.\nLet us evaluate our successes or achievements from this seeming rotational presidency between then and now,” he said.\nYou see, we are where we are today not because we are practising rotational presidency.\n“So, I want to believe that when the time comes, Nigerians will see reason."
  },
  {
    "headline": "Bakare: Nothing comes out of my discussions with Buhari -- I've decided to stay back",
    "summarized_story": "Tunde Bakare, overseer of the Citadel Global Community Church, formerly known as Latter Rain Assembly, says President Muhammadu Buhari never listened to his ideas on how to move Nigeria forward.\nSpeaking with BBC Yoruba, Bakare said Nigerian leaders are corrupt and have steered the country to its current state.\nThey brought us here before they grew old in the job and refused to leave,” Bakare said.\n“If a military takes over a country, they won’t leave until things become bad.\nOn the campaign for Oodua Republic, Bakare said such agitations are a result of the state of affairs in the country."
  },
  {
    "headline": "Bakare: Nothing comes out of my discussions with Buhari -- I've decided to stay back",
    "summarized_story": "Tunde Bakare, overseer of the Citadel Global Community Church, formerly known as Latter Rain Assembly, says President Muhammadu Buhari never listened to his ideas on how to move Nigeria forward.\nSpeaking with BBC Yoruba, Bakare said Nigerian leaders are corrupt and have steered the country to its current state.\nThey brought us here before they grew old in the job and refused to leave,” Bakare said.\n“If a military takes over a country, they won’t leave until things become bad.\nOn the campaign for Oodua Republic, Bakare said such agitations are a result of the state of affairs in the country."
  },
  {
    "headline": "Presidency: Events have proven John Campbell's prediction of Nigeria's collapse wrong",
    "summarized_story": "The presidency says John Campbell, a former US ambassador to Nigeria, has been “consistently” proven wrong over his predictions that the country will collapse.\nAdvertisementThe presidency was reacting to a recent article co-authored by Campbell and Robert Rotberg.\nAdvertisementReacting in a statement on Thursday, Garba Shehu, presidential spokesman, said while Campbell is entitled to his opinions, events have proven his predictions wrong.\nHe is of course entitled to his opinions, even where events consistently prove him wrong.\nThe relocation, according to Buhari, is necessary as part of efforts to address insecurity in Nigeria and other African nations."
  },
  {
    "headline": "Can TalentQL’s six-month program fill Africa’s need for senior developers?",
    "summarized_story": "According to Yusuf, the program is necessary because up to 90% of TalentQL’s clients want senior software engineers.\nThey have now expanded their talent pool to include Latin America to more ably serve the senior talent need that Africa alone cannot solve.\nThere will be a screening process to choose only those who want to “make the jump to become Senior Software Developers,” Yusuf says.\nAdewale Yusuf, TalentQL’s founderWhich, as you may have deduced, means that solving Africa’s shortage of senior developers will require more than one training of this sort.\nYet, it could be a valuable experiment for the ecosystem in training senior developers."
  },
  {
    "headline": "After Buhari’s “civil war” tweet is deleted, Nigerian minister accuses Twitter of suspicious agenda",
    "summarized_story": "Buhari’s deleted tweet was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War,” the tweet read.\nTwitter had never deleted tweets by the Nigerian president before.\n“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”Last October, Twitter became the platform where the world learned much about END SARS protests in Nigeria."
  },
  {
    "headline": "Banks don’t fund African renewable energy startups. So where can founders find money?",
    "summarized_story": "Michael Famoroti, chief economist at Stears gave two reasons during a recent TechCabal Live event on financing renewable energy companies in Africa.\nLike renewable energy for example.\nWiebe Boer, All On’s managing director, empathizes with founders who need funding but have little sources to reach out to.\nFrom there, it might be possible to access funding from All On’s initiatives for projects at the ideation stage.\nBut he hopes they persevere because “ultimately, there is a big market to serve.”Watch the full video of the TechCabal Live event on financing an African renewable energy company here."
  },
  {
    "headline": "2021 Kickstart: International Breweries Calls for Application from Young Entrepreneurs",
    "summarized_story": "The application portal for young entrepreneurs between 18 and 35 years old to apply to the highly anticipated 6th Edition of International Breweries Plc’s Kickstart Initiative is now open.\nEndAbout International Breweries Plc.\nInternational Breweries Plc (IBPLC), is a proud part of the world’s largest brewer, Anheuser-Busch InBev, (AB InBev), the world’s largest brewer with over 400 beer brands.\nInternational Breweries was established in 1971 and was listed on The Nigerian Stock Exchange in 1995.\nAB InBev consolidated its business stakes in Pabod Breweries Limited, Intafact Beverages Limited into its majority ownership of International Breweries Plc in a merger that was concluded in December 2017."
  },
  {
    "headline": "Highlights from the Extraordinary Launch of the Infinix Note 10 – Where Beauty meets Strength",
    "summarized_story": "Did you miss the most exciting smartphone launch in recent times?\nInfinix Mobility has unveiled yet another product — the Infinix Note 10, the device that meets beauty with strength.\nThe launch, which was tagged, ‘Meet Beauty With Strength’ illustrates the beautiful screen and body of the device, while showing the strength of its processor.\nInfinix Nigeria went all out at the launch of the new Infinix Note 10 to showcase the elements of the new Note 10- Speed, Beauty, Power, and Strength.\nThe Infinix Note 10 boasts of being the World’s biggest center-punch screen smartphone with a super amazing Helio G95 processor."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Kenya-based startup, Kibanda TopUp, raises $460k pre-seed",
    "summarized_story": "Kibanda TopUp, a Kenyan startup which aims at digitising the food supply chain for micro, small, and medium restaurants in Africa has closed a $460k pre-seed round to increase its customer base.\nThe involvement of local investors like Rockson and Agboola continues a growing trend of African investment in early-stage startups.\n“We are increasing restaurants’ contributions to Africa’s GDP by helping reduce cost with the supply chain.\nBased on Blauwhoff’s skills in entrepreneurial digital strategy and project management, and Mutambo’s experience in logistics, Rockson expresses confidence in the founders’ vision.\nKibanda TopUp has a great opportunity to drive a transformation of these businesses into a formal restaurant cooperative to maximise the economic potential."
  },
  {
    "headline": "Twitter launches Birdwatch to combat misinformation",
    "summarized_story": "Twitter has revealed plans to roll out Birdwatch as part of its efforts to combat misinformation on the platform.\nThe social media platform informed users in a tweet that they might see Tweets with Birdwatch notes across all devices.\nA pilot version of the product was launched in January, with the social media giant calling it a community-based approach to misinformation.\nYou’ll still be able to get to Birdwatch notes on that Tweet by clicking on the Birdwatch icon in the Tweet details page.\nAs social media platforms become more powerful, the question about whose responsibility it is to check abuse remains."
  },
  {
    "headline": "Nigerian e-mobility company, Siltech, wants to foster a cleaner Africa with electric vehicles",
    "summarized_story": "So far, it has been difficult to achieve improved adoption of electric vehicles.\nIts suspension, while being good for Asian and European roads, could not survive Nigerian roads.\nWilliams explains that the company employs people with pre-existing knowledge of motorbikes and combustion engines and trains them to assemble and maintain electric vehicles.\n“As long as you can charge your laptop and your mobile phone, you have access to charging life; you can charge your electric bike.\nGathering a decent community of users, Williams believes more adoption would reduce the number of cars and bikes on Nigerian roads."
  },
  {
    "headline": "Banks’ cheap funds don’t reflect in loans to customers",
    "summarized_story": "Nigerian banks access low-cost funds from individual/corporate deposits, interventions from the Central Bank of Nigeria (CBN) and development finance institutions but lend same to customers at higher rate.\nA publication by the CBN, themed ‘Bullion,’ noted that 2019 started with the industry weighted average prime lending rate (PLR) and maximum lending rate (MLR) as high as 16.01 percent and 30.48 percent, respectively.\nThis implies that while the cost of funds to banks was declining, lending rate was on the rise.\nThis disparity was a clear signal of exploitation by the banks, which is no doubt unfriendly to growth, the publication stated.\nArising from the adjustment in the Cash Reserve Ratio (CRR) to 27.5 percent in January 2020, however, the private sector credit moderated to 12.57 percent."
  },
  {
    "headline": "Nigeria falls short of 2020 financial inclusion target as 38m adults lack access",
    "summarized_story": "Nigeria failed to meet its National Financial Inclusion Strategy target for 2020 to include 80 percent of its adult population into the financial system.\nEFInA data show that only 64.1 percent were financially included by the end of last year.\nThis means that 36 percent of Nigerian adults, or 38.1 million of the country’s 106…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "5 reasons $71 oil price is not enough to boost Nigeria’s economy",
    "summarized_story": "5 reasons $71 oil price is not enough to boost Nigeria’s economyPositive crude oil prices since the Organization of the Petroleum Exporting Countries (OPEC) projected increase in demand have raised hope of a better global fiscal performance after severe disruptions caused by COVID-19 that unsettled oil-dependent economies.\nOn Thursday, Brent, against which Nigeria’s oil is priced, grew by 1.57 percent to open at $71.70 compared to…"
  },
  {
    "headline": "Acting Edo PDP chairman calls for calm – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – Mr Harrison Omagbon, Edo acting Peoples Democratic Party (PDP) Chairman, has called for calm among party faithful, following the suspension of the state chairman, Dr Tony Aziegbemi.\nHe said that the suspension of Aziegbemi was to allow for proper investigation into the allegations against him.\n“That is why we have set up a committee to investigate and unearth the facts of these allegations,” he said.\nOmagbon added: “My dear party faithful, we are at a very auspicious time in our democracy.\n“It is on record that our governor is counted among those delivering the dividends of democracy to the people."
  },
  {
    "headline": "Obaseki: Court ‘ll decide fate of 14 run-away Assembly members-elect – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that the fate of the 14 members-elect of the state’s House of Assembly, whose seats were declared vacant, rests with the Court.\nThe seats of the 14 members-elect were in December 2019 declared vacant by the House led by former speaker, Rt.\nAccording to him, “Some characters said they sent congratulatory letters to me and put it in all kinds of conditions.\n“How can you tell me to forgive those 14 lawmakers-elect who are responsible for sedition and treason in Nigeria?\nOsanyande said that the e-revenue collection system would further increase the state government Internally Generated Revenue (IGR)."
  },
  {
    "headline": "Obaseki meets Edo youths, says Nigeria in dire need of strong institutions not strongmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has identified weak institutions as a bane of Nigeria’s underdevelopment, hinting on the need for leaders across the country to build strong institutions to achieve sustainable development.\nObaseki made the call while addressing youths in the state during a stakeholders’ engagement of the Edo State Transition Committee with youths and student groups at the New Festival Hall, Government House, Benin City.\nAccording to Obaseki, “Let us hold our political leaders to account; people will come and go, but institutions will remain.\nThe only way this will happen is when we realize that the government is about you and when you participate in governance.\nYou need to participate – not just sit down and participate on social media – in your community; speak up,” the governor charged."
  },
  {
    "headline": "Obaseki appoints Osaigbovo Iyoha as Chief of Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has appointed Hon.\nIyoha Osaigbovo Toni, as his Chief of Staff.\nIyoha Osaigbovo Toni, born on 6th of July 1973, holds a Bachelors’ degree in Mechanical Engineering from Ambrose Alli University, (formerly Edo State University) and a Masters of Engineering degree in Industrial Engineering from the University of Benin (UNIBEN).\n“He is presently concluding a Ph.D in Industrial Engineering from UNIBEN.\nHis experience spans across Construction, Legislation, Public Service and Industrial Engineering."
  },
  {
    "headline": "Nigerian govt plans 30-year concessions for four airports",
    "summarized_story": "ADVERTISEMENTFour Nigerian airports will be handed over to private operators who will run them for at least 20 to 30 years, the Federal Ministry of Aviation has said.\nThe concessions will affect the Lagos, Abuja, Port Harcourt, and Kano airports.\nThis plan is contained in a document sent to PREMIUM TIMES by the ministry’s spokesperson, James Odaudu, on Thursday.\n“Infrastructure concessions of this nature come with a significant financial obligation which any responsible concessionaire will no doubt be keen to recoup,” it said.\nThe concession will cover only non-aeronautic assets of the airports located in the passenger and cargo terminals, the document explained."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "How Dave Umahi became enemy of Ebonyi people, By Abia Onyike",
    "summarized_story": "Okpara(pioneer Premiers of Eastern Region, Dr. Akanu Ibiam(pioneer Governor of Eastern Region), Col.Chukwuemeka Odumegwu Ojukwu(Military Governor of Eastern Region), Chief Sam Mbakwe (Governor of Old Imo state), Chief Jim Nwobodo(Governor, old Anambra state), Chief C.C.Onoh(Governor, old Anambra state), Dr. Ogbonnaya Onu( Governor, old Abia state), Commander Walter Aye Feghabor(first Military Administrator, Ebonyi state),AIG of Police Simeon Oduoye(Military Governor, Ebonyi state), Dr.Sam Ominyi Egwu(first civilian Governor, Ebonyi state and Chief Martin Elechi(second civilian Governor of Ebonyi state).\nNo single state hospital is working in Ebonyi state.\nEven with the lack of teachers in Ebonyi state schools, the last thing to suggest to Umahi is employment of teachers.\nUmahi came into office in 2015, Ebonyi state University was rated as one the best state universities in Nigeria.\nAbia Onyike,Former Commissioner for Information, Ebonyi state."
  },
  {
    "headline": "Time has come to change Nigeria’s narrative – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has said it time to change the Nigerian narrative, and transform the country from one flowing with anger and bitterness, to one flowing with milk and honey.\nObasanjo said, “My prayer is that all of us will have something to contribute to making this country what God has created it to be – a land flowing with milk and honey.\n“Right now, it is a land flowing with bitterness and sadness, that is not what God wants this country to be.\n“We must change the narrative, we must talk to ourselves in the civilised language.\n“There is nowhere you go in this country that you will not see geniuses in any section of the country."
  },
  {
    "headline": "Our Southeast branches fully open – First Bank",
    "summarized_story": "OBINNA EZUGWUFirst Bank of Nigeria, has denied reports that it closed all of its branches in Nigeria’s Southeast, noting that the branches are fully open.\nReports had recently circulated on social media that the country’s oldest bank, shut its branches in the region over security concerns.\nHowever, debunking the reports in a public announcement yesterday, the bank said, “This is to inform the public that our South East branches are fully open for business.\nPlease disregard any news making the rounds that is contrary to this.”"
  },
  {
    "headline": "Malami denies advising Buhari to suspend Nigeria’s Constitution",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, has denied advising President Muhammadu Buhari to suspend the country’s constitution and implement martial law to be able to tackle the escalating insecurity in the country more effectively.\n“Malami remains a true democrat who believes in rules of law and tenant of democracy and Constitutional order.\n“The Office of the Attorney-General of the Federation and Minister of Justice is a constitutionally recognised one with its role and responsibilities embedded in the constitution.\nAccording to the newspaper, Mr Malami specifically urged the president to suspend the fundamental rights of all Nigerians as guaranteed under Chapter IV of the Constitution.\nAccording to the report, Mr Malami, said the president should issue instruments of emergency and publish them in the federal gazette."
  },
  {
    "headline": "Nigeria’s Vaccination Plans May Hit A Snag, Federal Govt Warns",
    "summarized_story": "The federal government has raised the alarm that Nigeria’s vaccination programme against COVID-19 pandemic may hit a halt.\nAccording to him, virtually all the initial plans to vaccinate Nigerians were threatened by non-availability of products from expected sources.\nBilateral is that you approach certain countries that have surplus, or that have declared they have surplus and say, will you share with us.\n“So yes, that vaccine is effective against the India variant, otherwise they themselves will not use it anymore, they will be giving it away”, he said.\nThe minister also said the federal government wants to get the actual price of COVID vaccine before submitting a supplementary budget to the national assembly."
  },
  {
    "headline": "Nigeria’s Vaccination Plans May Hit A Snag, Federal Govt Warns",
    "summarized_story": "The federal government has raised the alarm that Nigeria’s vaccination programme against COVID-19 pandemic may hit a halt.\nAccording to him, virtually all the initial plans to vaccinate Nigerians were threatened by non-availability of products from expected sources.\nBilateral is that you approach certain countries that have surplus, or that have declared they have surplus and say, will you share with us.\n“So yes, that vaccine is effective against the India variant, otherwise they themselves will not use it anymore, they will be giving it away”, he said.\nThe minister also said the federal government wants to get the actual price of COVID vaccine before submitting a supplementary budget to the national assembly."
  },
  {
    "headline": "Presidency Faults Foreign Affairs Report On Nigeria",
    "summarized_story": "The presidency has faulted the latest article on Nigeria in Foreign Affairs magazine titled ‘The Giant of Africa is Failing’ saying its unfair both to a magazine with such an esteemed pedigree and to its readers.\nPresidential spokesman, Garba Shehu, in a statement on Thursday, said Ambassador Campbell has been predicting the collapse of Nigeria for several years.\nThe transcript of the call with Secretary Blinken is available on the State Department’s own website.\n“Nigeria faces multiple challenges, not least of which is the dissemination of fake news and prejudiced opinion.\nIt is still a surprise, and a disappointment, to see them joined by Foreign Affairs."
  },
  {
    "headline": "Presidency Faults Foreign Affairs Report On Nigeria",
    "summarized_story": "The presidency has faulted the latest article on Nigeria in Foreign Affairs magazine titled ‘The Giant of Africa is Failing’ saying its unfair both to a magazine with such an esteemed pedigree and to its readers.\nPresidential spokesman, Garba Shehu, in a statement on Thursday, said Ambassador Campbell has been predicting the collapse of Nigeria for several years.\nThe transcript of the call with Secretary Blinken is available on the State Department’s own website.\n“Nigeria faces multiple challenges, not least of which is the dissemination of fake news and prejudiced opinion.\nIt is still a surprise, and a disappointment, to see them joined by Foreign Affairs."
  },
  {
    "headline": "Use Of Technology In Elections Has Come To Stay – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC), has said that the use of technology in elections has come to stay in Nigeria, stressing the need for it to be improved upon.\nThis is even as the nation’s electoral body noted that technology is evolving, saying that it was important to move with the trend to get the benefits therein.\nHe said the deployment of technology has touched most of the election processes, and INEC was working on the last part – deployment of EVMs.\nHe also added that INEC was institutionaliding the technologies.\nHe said, “The challenges with IT deployment could be overwhelming, especially for a vast country like ours."
  },
  {
    "headline": "Remembering Funmilayo Ransome-Kuti – Nigeria’s ‘lioness of Lisabi’",
    "summarized_story": "During the raid, Kuti’s 76-year-old mother, Funmilayo Ransome-Kuti, was thrown from a second-storey window.\nAt least two Nigerian news outlets reported her death with the headline: “Fela’s Mum is Dead.”But Ransome-Kuti was not just “Fela’s mum”.\nHer husband, Reverand Israel Oludotun Ransome-Kuti, was the school’s principal and the couple lived on the premises with their children.\n“She was well-known to us youngsters, as the leader of the Abeokuta Women’s Union (AWU),” Sotunde explained.\nAccording to a March 1959 report in South Africa’s Drum magazine: “Thousands of Abeokuta women went about shedding tears."
  },
  {
    "headline": "Nigeria, Ethiopia strengthens bilateral relations on industrialization, politics",
    "summarized_story": "By Nneka NwogwugwuNigeria and Ethiopia have pledged to strengthen bilateral relations on industrialization, politics, economy, and consular relations.\nThis was made known when the Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the Federal Democratic Republic of Ethiopia, with concurrent accreditation to Djibouti and Permanent Representative to the African Union and the United Nations Economic Commission for Africa, His Excellency, Amb.\nVictor Adekunle Adeleke, on Monday, while presenting his Letters of Credence to Her Excellency, Madams Sahel-Work Zewde, President of the Federal Democratic Republic of Ethiopia.\nAmb Adeleke, also said that the Group 4 under the African Union will be revived for their benefits on the multilateral stage.\nThe new Ambassador used the opportunity to assure the Chairperson of the African Union of his unflinching support to all AU programs and initiatives."
  },
  {
    "headline": "BREAKING: Nigeria is oozing bitterness, grief, Obasanjo laments —",
    "summarized_story": "Nigeria, according to former President Olusegun Obasanjo, is currently oozing with bitterness and grief.\nHe remarked this on Thursday at the Olusegun Obasanjo Presidential Library in Abeokuta, Ogun State’s capital, when he was presented with a book titled “The Man, The General, and The President,” written by Femmy Carrena.\nObasanjo said, “My prayer is that all of us will have something to contribute to making this country what God has created it to be – a land flowing with milk and honey.\n“Right now, it is a land flowing with bitterness and sadness, that is not what God wants this country to be.\n“There is nowhere you go in this country that you will not see geniuses in any section of the country."
  },
  {
    "headline": "AK-47 Factory Uncovered in Plateau",
    "summarized_story": "The police in Plateau State’s Jos South Local Government Area discovered an AK-47 production plant.\nMr. Christopher Dega, a retired Assistant Inspector-General of Police (AIG) who served as Benue State Governor Samuel Ortom’s security adviser, was traced to a café in Jos, Plateau State, where he was assassinated, according to the police.\nThey had a total of 80 bogus number plates retrieved from them.\nHe added that the police were in possession of the full list of persons with such fake number plates.\nA student at the University of Jos in Plateau State was also exposed for masterminding the murder of a friend who had given him a loan of N500, 000 for his wedding."
  },
  {
    "headline": "NIOMR celebrates World Environment Day, calls for restoration of degraded landscapes",
    "summarized_story": "By JUMOKE SANNIThe Nigerian Institute for Oceanography and Marine Research in collaboration with the Global Monitoring for Environment and Security & Africa (GMES and Africa) join the Government and People of the Federal Republic of Nigeria and communities around the world to commemorate World Environment Day.\nEvery year ever since, 5 June has remained United Nation’s flagship day for promoting worldwide awareness and action for the environment.\nThis years Environment Day celebration will kick off with the formal launch of the UN Decade on Ecosystem Restoration 2021-2030.\nThe Decade will be a global mission to restore billions of hectares of degraded landscapes notably forests including coastal mangroves, farmlands, coastal zones, grasslands, wetlands and seabed as well as coral reefs.\nAs the people and government at all levels in Nigeria commemorate World Environment Day, restoring our degraded landscapes primarily the coastal mangroves stretching from Lagos to the Niger Delta is one of our major concerns."
  },
  {
    "headline": "NIOMR celebrates World Environment Day, calls for restoration of degraded landscapes",
    "summarized_story": "By JUMOKE SANNIThe Nigerian Institute for Oceanography and Marine Research in collaboration with the Global Monitoring for Environment and Security & Africa (GMES and Africa) join the Government and People of the Federal Republic of Nigeria and communities around the world to commemorate World Environment Day.\nEvery year ever since, 5 June has remained United Nation’s flagship day for promoting worldwide awareness and action for the environment.\nThis years Environment Day celebration will kick off with the formal launch of the UN Decade on Ecosystem Restoration 2021-2030.\nThe Decade will be a global mission to restore billions of hectares of degraded landscapes notably forests including coastal mangroves, farmlands, coastal zones, grasslands, wetlands and seabed as well as coral reefs.\nAs the people and government at all levels in Nigeria commemorate World Environment Day, restoring our degraded landscapes primarily the coastal mangroves stretching from Lagos to the Niger Delta is one of our major concerns."
  },
  {
    "headline": "Yahaya: No mass retirement in the military – DHQ",
    "summarized_story": "There may be respite for members of Regular Course 35, 36 and 37, as the Defence Headquarters, Thursday, allayed fears of mass retirement in the military, following the appointment of Major General Farouk Yahaya as the Chief of Army Staff.\nBut the Acting Director Defence Media Operations, Brigadier General Benard Onyeuko, during a press conference with Defence Correspondents, said retirement for senior officers is only on voluntary basis.\nThis has stirred up lot of rumours in the media about mass retirements in the military.\nTroops conducted series of clearance patrols, ambush, raid, picketing, cordon and search operations as well as artillery bombardments.\nThey rescued kidnapped victims, neutralized scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items including vehicles."
  },
  {
    "headline": "Yahaya: No mass retirement in the military – DHQ",
    "summarized_story": "There may be respite for members of Regular Course 35, 36 and 37, as the Defence Headquarters, Thursday, allayed fears of mass retirement in the military, following the appointment of Major General Farouk Yahaya as the Chief of Army Staff.\nBut the Acting Director Defence Media Operations, Brigadier General Benard Onyeuko, during a press conference with Defence Correspondents, said retirement for senior officers is only on voluntary basis.\nThis has stirred up lot of rumours in the media about mass retirements in the military.\nTroops conducted series of clearance patrols, ambush, raid, picketing, cordon and search operations as well as artillery bombardments.\nThey rescued kidnapped victims, neutralized scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items including vehicles."
  },
  {
    "headline": "Nigeria not failing: Aso Rock blasts U.S. magazine, Amb. Campbell",
    "summarized_story": "By AbankulaNigeria’s Presidency has slammed the U.S. based Foreign Affairs magazine over its doomsday article titled: ‘The Giant of Africa is Failing’.\n“Ambassador John Campbell has been predicting the collapse of Nigeria for several years.\nThe transcript of the call with Secretary Blinken is available on the State Department’s own website.\n“It’s not just a question of the invented addition of ‘to Nigeria’ with regard to AFRICOM.\n“Nigeria faces multiple challenges, not least of which is the dissemination of fake news and prejudiced opinion."
  },
  {
    "headline": "Fintiri appoints Baha as FCE Hong new Provost, others",
    "summarized_story": "By Ibrahim KadoGovernor Ahmadu Fintiri of Adamawa State has approved the appointment of Dr Yusuf Baha as the new Provost of College of Education (FCE), Hong, and other principal officers.\nThis was disclosed in a statement issued by Umar Daware, the Commissioner for Higher Education on Thursday in Yola.\nHe said that Dr Baha’s appointment followed the expiration of the tenure of Prof. Johnson Pongri.\nThe commissioner stated that other Principal officers appointed include: Shuaibu Ahiwa, Registrar; Isa Sali Song, Librarian, and Augustine Kafari, Bursar.\nAhmadu Fintiri while wishing them successful tenure urged them to uphold the ideals of the present administration toward enhancing education in the state,” he stated."
  },
  {
    "headline": "Ex-Nigerien leader Issoufou bags N2billion Ibrahim Prize",
    "summarized_story": "Mahamadou Issoufou, the former President of Niger, was honoured on Thursday as the recipient of the $5million (N2.065 billion) 2020 Ibrahim Prize for Achievement in African Leadership.\nSpeaking from Niamey to a global audience via MIF.Live, President Issoufou said: “I was moved and proud to be chosen by the Ibrahim Prize Committee.\nI salute and congratulate Mo Ibrahim and the Mo Ibrahim Foundation for the comprehensive support they provide to the development of our continent.”The Ibrahim Prize recognises and celebrates excellence in African leadership.\nOutlining the decision to make President Issoufou an Ibrahim Prize Laureate, Festus Mogae, Chair of the independent Prize Committee and former President of Botswana, said: “President Issoufou made history in Niger.\nI want to commend President Issoufou specifically on what he has done for gender equality and women’s empowerment."
  },
  {
    "headline": "Reno Omokri Attacks Buhari Over Plans To Mobilize Corps Members For War",
    "summarized_story": "Reno Omokri, a former presidential aide, responded on Thursday to Brig-Gen Shuaibu Ibrahim, the Director-General of the National Youth Service Corps (NYSC), saying that corps members may be recruited for war if necessary.\nThe NYSC director made the announcement on a Channels TV show on Wednesday, noting that the corps members are part of Nigeria’s reserve defense system.\nReno, who reacted on Twitter, chastised President Muhammadu Buhari for failing to provide jobs for Nigerian youngsters.\nThe former presidential advisor questioned why the federal government is sending troops to fight in the battle, and suggested that the president send his son, Yusuf.\nFirst send your son, Yusuf!”"
  },
  {
    "headline": "‘Bandits Hiding In Kano Forests’ — Ganduje Raises Alarm Over Upcoming Kano Attack",
    "summarized_story": "The governor of Kano, Abdullahi Ganduje, has called on the military to intervene against the criminals who have turned part of the state’s woodlands into hideouts.\nOn Thursday, Ganduje made the announcement during a meeting with Farouk Yahaya, the Chief of Army Staff, at the Defence Headquarters in Abuja.\nHe claimed that bandits had begun converging in Falgore woodland, and he raised concern that they were plotting attacks across the state.\n“My visit here today is to condole with the Nigerian Army over the death of the former Chief of Army Staff, Lieutenant General Ibrahim Attahiru and ten other officers,” he said.\n“I am also here to seek the help of the Nigerian Army to sustain the peace in Kano State; bandits have converted some forests in the state to hideouts."
  },
  {
    "headline": "Soldier Kills Customs Officer In Lagos",
    "summarized_story": "At the Seme border in Lagos State, a Nigerian soldier is said to have shot and killed a Customs official.\nThe incident occurred in the early hours of Thursday, according to reports.\nAccording to an eyewitness who talked with the Daily Trust, the incident heightened anxiety in the area due to fears of a border fight between military and customs inspectors.\nThe soldier was suspected of being under the influence of alcohol, according to a source who asked not to be identified.\n“It’s possible that the soldier was under the influence of alcohol because no one expected him to behave in such a strange manner.”Seme is a Nigerian town that shares a border with Cotonou, the Benin Republic’s capital."
  },
  {
    "headline": "BREAKING: Buhari Steps Down As Niger Basin Authority Chairman",
    "summarized_story": "Buhari said this in Abuja on Thursday while declaring open the virtual 12th Summit of Heads of State and Government of the Niger Basin Authority.\nHe also urged them to keep supporting efforts at developing the Niger Basin in the fight against pollution and the degradation of ecosystems.\nAs outgoing Chairman of the NBA Leaders’ Summit, Buhari gave account of his five-year term leading the organisation.\nHe enumerated other ongoing programmes including the Integrated Development and Adaptation to Climate Change in Niger Basin financed by the AfDB, GEF, KFW and NBA Member Countries.\n“At this Summit, my tenure as the Chairman Summit of Heads of State and Government of our common institution comes to an end as I will hand over to a new Chairman."
  },
  {
    "headline": "#BlueprintAt10 – VIDEO: Watch as Gwape International Troupe entertains guest",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Former President, Goodluck Ebele Jonathan, receives African Icon of Democracy award at #BlueprintAt10 event",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Hilarious as Kelechi Iheanacho leads other Super Eagles in chorus ahead Cameroon friendly clash",
    "summarized_story": "Previous2023: Why Enugu should route for equity candidature"
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "Nigeria Is Flowing With Bitterness And Sadness – Obasanjo",
    "summarized_story": "﻿Former President of Nigeria, Chief Olusegun Obasanjo says Nigeria is dripping with bitterness and sadness in the face of the current socio-economic and political challenges facing the country.\nAccording to Obasanjo, the current challenges besetting the nation run contrary to the dreams and aspirations of the founding fathers and what God destined the country to be.\nHe made the assertion on Thursday at the Olusegun Obasanjo Presidential Library in Abeokuta, Ogun State’s capital, when he was presented with a book titled “The Man, The General, and The President,” written by Femmy Carrena.\n“Right now, it is a land flowing with bitterness and sadness, that is not what God wants this country to be.\n“There is nowhere you go in this country that you will not see geniuses in any section of the country."
  },
  {
    "headline": "Buhari Seeks Global Support To Develop Niger Basin",
    "summarized_story": "President Muhammadu Buhari called for global support to develop the resources in the Niger Basin area – home to over 160 million people who depend on the river as a means of sustenance.\nHe made the call on Thursday in Abuja when he declared open the virtual 12th Summit of Heads of State and Government of the Niger Basin Authority (NBA).\nThe President believes the Niger River, commonly called Djoliba in Guinea and Mali, offers enormous development opportunities in the fields of agriculture, animal husbandry, fishing, fish farming, hydropower, hydraulics and navigation.\nHe urged them to continue to support efforts at developing the Niger Basin in the fight against pollution and the degradation of ecosystems, in order to manage its resources in a sustainable and equitable manner.\n“At this summit, my tenure as the Chairman Summit of Heads of State and Government of our common institution comes to an end as I will hand over to a new chairman."
  },
  {
    "headline": "COAS Appointment: Military Denies Enforcing Mass Compulsory Retirement Of Officers",
    "summarized_story": "Military authorities have dispelled the rumour of mass compulsory retirement of senior military officers, following the appointment of the new Chief of Army Staff (COAS), Major General Farouk Yahaya.\nTroops conducted series of clearance patrols, ambush, raid, picketing, cordon and search operations as well as artillery bombardments.\nOn 20 May 2021, troops had contact and engaged BHT criminal elements in Gwoza LGA of Borno State.\nIn Rivers State, troops immobilised several illegal refining sites along with numerous reservoirs and polythene bags of illegally refined oil products at different sites.\nOperation AwatseBetween 20 May and 2 June 2021, troops of Operation AWATSE maintained constant vigilance and operational tempo as well as patrolled our waterways."
  },
  {
    "headline": "Gunmen Hijack Ondo School Bus, Release School Attendant",
    "summarized_story": "A school attendant has been released few hours after some gunmen hijacked a school bus and abducted the staff of the private school, on Thursday morning in Ondo State.\nThe gunmen at about 6.30 am on Thursday abducted her and hijacked the private school bus in Oba Ile Estate of Akure North Local Government Area of Ondo State.\nA staff of the school, Olufunke Oloye explaining to journalists how the incident happened said the victim was later released near Ilaramokin, a neighbouring town while the hoodlum took the school bus away.\nThe spokesperson of the command, DSP Tee-Leo Ikoro while addressing journalists also confirmed that the attendant has been released.\nHe noted that the police are on the trail of the hoodlums, hoping to apprehend them and recover the bus as soon as possible."
  },
  {
    "headline": "PDP, APC Trade Words Over Insecurity In Imo",
    "summarized_story": "A war-of-words has ensued in Imo State regarding the security situation which has continued to be a thing of great concern for the Imo people and Nigeria as a whole.\nReacting to what it termed a continually degenerating situation, the People’s Democratic Party (PDP) on Thursday asked Governor Hope Uzodinma to resign.\nThe opposition party urged the governor to throw in the towel, arguing that he (Uzodinma) has failed to secure the lives and property of the Imo people.\nThe PDP urged the Federal Government to set up a high-powered panel to investigate the actual cause behind the gruesome murder of former presidential aide, Ahmed Gulak, which occurred in the state on Sunday morning.\nMeanwhile, in a swift reaction, the Imo State Government through the commissioner of information Declan Emelumba said the statement credited to the PDP over the present state of insecurity in Imo is a clear case of self-indictment of the party as the real perpetrators of the chaos."
  },
  {
    "headline": "Niger Bans Commercial Motorcycles in Minna",
    "summarized_story": "The Niger state government has banned commercial motorcycles from operating in the state capital, Minna, after security intelligence revealed that bandits were planning to commit heinous crimes using motorcycles.\nAccording to a statement by the state government, non-commercial motorcycles are permitted to operate between the hours of 6 a.m. and 9 p.m., but commercial riders are prohibited.\n“Please be informed that the Niger State Government has banned completely the operation of commercial motorcycles within Minna, the state capital.” The state government said.\nThe state govt noted that the restrictions begins from 9pm to 6am.”“Noncommercial motorcycles however, are permitted to operate but only within the hours of 6am and 9pm.\n“Niger state Government regrets any inconvenience this necessary decision may cause the residents of the state.” The sated govt stated."
  },
  {
    "headline": "FBI arrest Nigerian for stealing $800,000 in payroll hack",
    "summarized_story": "Charles Onus, a Nigerian, has been arrested by the Federal Bureau of Investigation (FBI) for his alleged involvement in a $800,000 money laundering scheme.\nAccording to a statement issued by the US Department of Justice on Wednesday, Onus was involved in a scheme to steal payroll deposits by conducting cyber intrusions into multiple user accounts maintained by a company that provides human resources and payroll services to employers across the country.\nAccording to the allegations in the indictment, the suspect was involved in the scheme from July 2017 to 2018.\n“As alleged, Onus did this as effectively as someone who commits bank burglary, but with no need for a blowtorch or bolt-cutters.\nThanks to the FBI and IRS-CI, Onus is in custody and facing serious federal charges.”According to the statement, “at least approximately 5,500 company user accounts were compromised between July 2017 and 2018, and more than $800,000 in payroll funds were fraudulently diverted to prepaid debit cards, including those under the control of Onus.”"
  },
  {
    "headline": "20,000 vulnerable households in Lagos to benefit from COVID-19 cash programme-LASG",
    "summarized_story": "The Lagos State Operations Coordinating Unit (LASOCU) of the Ministry of Economic Planning & Budget has said that a total of 20,000 Vulnerable Households in Lagos State are set to benefit from the Federal Government COVID-19 Rapid Response Cash Transfer Programme.\nThe Director of LASOCU, Mrs. Oluwakemi Adedeji spoke of the development, explaining that it is an initiative of the Federal Government, through the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development, in partnership with the Lagos State Government and the World Bank.\nThe exercise will commence with the registration of small business owners and artisans, whose businesses were badly affected by COVID-19 in Lagos State.\nMrs. Adedeji said, “LASOCU will commence the registration process for the COVID-19 Rapid Response Register by sending text messages to the phones of residents in some local government areas between May 30th and June 5th, 2021.\nRecipients of the text are advised to register by responding to the messages or contact their Community Development Areas (CDA) in selected wards”."
  },
  {
    "headline": "Buhari’s Civil War Tweet Deleted -Trending with Ojy Okpe",
    "summarized_story": "The Minister of Information and culture Lai Mohammed accused blogging platform of double standards and described their presence in the country as suspicious after the social media platform deleted Buhari’s civil war tweet.\nFollowing the rising spate of crime in Rivers state, the Governor of the State, Nyesom Wike in a now viral video threatened to carry out extra judicial Killings on criminals in the state."
  },
  {
    "headline": "Nigeria: Attorney General Malami Denies Asking President Buhari to Suspend Constitution",
    "summarized_story": "Nigeria’s Minister of Justice and Attorney General of the Federation, Abubakar Malami has denied ever writing a memo to President Muhammadu Buhari asking him to suspend the use of the country’s 1999 constitution as amended to enable him tackle rising insecurity in the country.\nAccording to a publication by the Peoples Gazette, Mr Malami specifically urged the president to suspend the fundamental rights of all Nigerians as guaranteed under Chapter IV of the Constitution due to the rising insecurity.\n“General public are hereby asked to disregard the media report as fabrications of anti-constitutional democratic stability in Nigeria.\n“The office of the attorney-general of the federation and minister of justice is a constitutionally recognised one with its role and responsibilities embedded in the constitution.\nHence, Malami discharges his constitutionally recognized mandates in compliance with principles of transparency, openness and accountability.”By Abel Ejikeme"
  },
  {
    "headline": "Ugandan Transport Minister Discharged From Hospital After Shooting Incident",
    "summarized_story": "Uganda’s Transport Minister General Katumba Wamala has been discharged from hospital after undergoing surgery to remove a bullet in his arm.\nThe minister was injured after gunmen riding on motorcycles shot at his vehicle killing his daughter and driver.\nThe minister has asked those behind the killings to be arrested and brought to book.\nOne suspect has been arrested in connection with the killings, according to state-owned New Vision newspaper.\nNTV Uganda shared a video of the minister viewing her body:The minister and his daughter were heading for a vigil at his mother-in-law’s home on Tuesday when the attack happened."
  },
  {
    "headline": "I Don’t Have Conversations With IPOB Leader Nnamdi Kanu: Senator Abaribe",
    "summarized_story": "Leader of the minority caucus in the Nigerian Senate Enyinnaya Abaribe has said he does not have conversations with Nnamdi Kanu, the leader of the proscribed Indigenous Peoples of Biafra (IPOB).\nMr Abaribe and two others had stood as sureties for Kanu before he was granted bail by a Federal High Court in Abuja on April 25, 2017.\nThe IPOB leader however slipped out of Nigeria after soldiers deployed under the Operation ‘Python Dance II’ in the South-East to quell the agitation for the Biafra Republic, invaded his home in Afara-Ukwu, Umuahia, Abia in September 2017.\nBut speaking to ARISE News on Thursday, Senator Abaribe said he does not have the privilege to speak with Mr Kanu but goes through his lawyers to get messages across to the IPOB leader.\nAccording to the lawmaker Abaribe, the messages sent to Mr Kanu has always been to embrace peace in his pursuit of justice and not violence."
  },
  {
    "headline": "Nigeria Government Ignoring Killings in Other Regions But Applying Force in Southeast: Senate Minority Leader Abaribe",
    "summarized_story": "Senator Enyinnaya Abaribe, the leader of the minority caucus in the Nigerian Senate is accusing the federal government of following a pattern that tends to ignore the killings and abductions in other parts of the country but applies enormous force to douse crisis and violence in the southeast.\nMr Abaribe stated this on Thursday when he featured on an ARISE News programme, The Morning Show and queried the response President Muhammadu Buhari gave to the crisis in the region when he threatened to visit on people depredations of the civil war.\nAccording to the Senate minority leader, President Buhari’s reaction to the violence and agitation in the southeast was an uncalculated response.\nWatch the interview."
  }
]