[
  {
    "headline": "‘Living with albinism tough in Nigeria, we suffer social discrimination, mockery of our eyesight’",
    "summarized_story": "Donald Tampi and Lawrence Mary, two persons living with albinism, in this report, share their experiences of battling against discrimination, stereotypes and psychological issues.\nFor him, primary school was a shower of ridicule, while secondary school was the downpour.\nShe said, “It was when I was in primary school that I got to understand that I was different from other people.\nI was glad for his help.”She added, “My younger sister is also living with albinism and my mum’s cousins have albinism.\nPersons living with albinism may suffer psychologically due to stigmaSpeaking with PUNCH HealthWise, a Lagos-based Psychotherapist, Dedoyin Ajayi, said she has had to treat persons with albinism in her practice who were psychologically affected by stigma."
  },
  {
    "headline": "‘Living with albinism tough in Nigeria, we suffer social discrimination, mockery of our eyesight’",
    "summarized_story": "Donald Tampi and Lawrence Mary, two persons living with albinism, in this report, share their experiences of battling against discrimination, stereotypes and psychological issues.\nFor him, primary school was a shower of ridicule, while secondary school was the downpour.\nShe said, “It was when I was in primary school that I got to understand that I was different from other people.\nI was glad for his help.”She added, “My younger sister is also living with albinism and my mum’s cousins have albinism.\nPersons living with albinism may suffer psychologically due to stigmaSpeaking with PUNCH HealthWise, a Lagos-based Psychotherapist, Dedoyin Ajayi, said she has had to treat persons with albinism in her practice who were psychologically affected by stigma."
  },
  {
    "headline": "Anambra teaching hospital spends N8m on diesel monthly —CMD",
    "summarized_story": "Ikenna ObianeriThe Chief Medical Director of Chukwuemeka Odimegwu Ojukwu University Teaching Hospital, Amaku Awka, Dr. Joe Akabuike, has revealed that the hospital is spending between N7m to N8m every month to meet its electricity demands.\nAkabuike pointed out that he was the initiator of primary health care services in Anambra just as he stated that he met what he termed vertical and horizontal fragmentations and total collapse of primary health care services.\nAccording to the CMD, Anambra started with 63 primary health care centres under his watch as the commissioner for health and equally introduced the “Keke Ambulance” while lamenting that the PHCs were not spreading the way they should in the present circumstance.\n“Currently, the primary health care centres were not functioning the way they should but I believe that what is needed is a sustained effort to make the sector work.\nThat the PHCs could be scaled up from 63 to 200 and above, the present administration is determined to provide solutions to issues concerning primary health care and the health sector in general."
  },
  {
    "headline": "Anambra teaching hospital spends N8m on diesel monthly —CMD",
    "summarized_story": "Ikenna ObianeriThe Chief Medical Director of Chukwuemeka Odimegwu Ojukwu University Teaching Hospital, Amaku Awka, Dr. Joe Akabuike, has revealed that the hospital is spending between N7m to N8m every month to meet its electricity demands.\nAkabuike pointed out that he was the initiator of primary health care services in Anambra just as he stated that he met what he termed vertical and horizontal fragmentations and total collapse of primary health care services.\nAccording to the CMD, Anambra started with 63 primary health care centres under his watch as the commissioner for health and equally introduced the “Keke Ambulance” while lamenting that the PHCs were not spreading the way they should in the present circumstance.\n“Currently, the primary health care centres were not functioning the way they should but I believe that what is needed is a sustained effort to make the sector work.\nThat the PHCs could be scaled up from 63 to 200 and above, the present administration is determined to provide solutions to issues concerning primary health care and the health sector in general."
  },
  {
    "headline": "Russian rockets kill 15 in Ukraine, more under rubble",
    "summarized_story": "Source: Reuters/ BBCAt least 15 people have been killed and about 20 more are feared buried under rubble after Russian rockets struck an apartment block in Chasiv Yar, a town in eastern Ukraine, officials say.\nChasiv Yar is near the city of Kramatorsk, in Donetsk region.\nWe sat there all night until this morning.”On Saturday the Russian defence ministry reported that its forces had destroyed a hangar storing US M777 howitzers in Chasiv Yar.\nThe BBC was unable to verify details of the attacks on Chasiv Yar at the scene.\nVeronika Bakhal of Donetsk emergency services told the BBC at least 20 people were believed to still be under the rubble in Chasiv Yar, including one child."
  },
  {
    "headline": "N1.85bn Recovered Loot: Ex-Army Chief, Buratai threatens court action",
    "summarized_story": "“The publication is not only false but malicious and an attempt to malign the reputation of our client.\n“Our client, who was also a former Chief of Army Staff from July 2015 to 2021 has taken the battle against insurgency to the field with enormous energy and resources as well as loss of field officers.\n“We hereby demand that you retract your publication with a public apology to our client within seven days of receiving this letter and a public apology to be published in two national dailies in Nigeria.\n“Take notice that if you fail, neglect and/ or refuse to publish the apology within seven from today, we shall not hesitate to commence legal action against your organisation for defamation.\n“It is hoped that you would comply to avoid the unpleasantness of litigation and its attendant consequences.”"
  },
  {
    "headline": "Tinubu has chosen running mate – Campaign team",
    "summarized_story": "Sen. Bola Ahmed Tinubu, 2023 presidential candidate of the All Progressives Congress (APC) has decided on his choice of running mate.\nA highly-competent source in the Tinubu Campaign Organisation who requested anonymity confirmed this to the News Agency of Nigeria (NAN) on Sunday in Abuja.\nThe source added that in picking the running mate, Tinubu was not thinking about religion, but about competence, exposure and intellectual depth of the candidate.\nTinubu is scheduled to pay Sallah homage to President Muhammadu Buhari in Daura, Katsina, on Sunday to brief him on his chosen running mate.\nThe former two-term Lagos State governor won APC’s presidential ticket at the party’s June 8 special national convention and presidential primary election."
  },
  {
    "headline": "NAHCON denies collecting money from pilgrims for airlift",
    "summarized_story": "Reacting to a viral video where the allegation was made by an intending pilgrim, NAHCON Chairman/Chief Executive Officer (CEO), Alhaji Zikrullah Kunle Hassan, denied requesting or collecting money from any pilgrim.\n“National Hajj Commission does not collect money from single individual.\nEven in the state, we also don’t collect money.\nAbout 1,809 intending pilgrims missed the Hajj exercise.\n97 pilgrims from Plateau State, 12 pilgrims from Bauchi State and 1000 from Tour Operators."
  },
  {
    "headline": "FRSC to prosecute under-age drivers in Katsina",
    "summarized_story": "Mr. Ali Sule, Commander of the Federal Road Safety Corps (FRSC), Katsina said that the corp’s mobile court will try any under-age child caught driving in the state.\nSule disclosed this to the News Agency of Nigeria (NAN) on Sunday in Katsina.\n“The agency will view the act as a serious offence to see any under-age child driving on high ways in the state.\n“If we catch any under-age, we will hand him or her over to mobile court to be prosecuted,” he said.\nMeanwhile, the commander urged drivers to ensure perfect condition of their vehicles during rainy seasons."
  },
  {
    "headline": "Kuje jailbreak: What a shame, you’re ignorant – Nigerian military dismisses Fani-Kayode’s allegations",
    "summarized_story": "Akpor insisted that it was a shame that Fani-Kayode is ignorant of whose responsibility it is to guard the prison.\nAccording to him, the former minister made the allegations in a social media video following the recent spate of terrorists’ attacks, especially the attack on the Kuje Custodial Centre.\nThe defence spokesman said it was also an attempt to smear the military and form bad blood between service personnel and the military high command.\nFani-Kayode is encouraged to pay more attention to the weekly briefs by Defence Media Operations.\n“Defence Media Operations gives weekly briefs and updates on operations being conducted across the country; press releases on military operations are also made when the need arises."
  },
  {
    "headline": "Taraba: Allow citizens defend themselves, you have failed – CAN to govt",
    "summarized_story": "The leadership of the Christian Association of Nigeria (CAN), Taraba State chapter, has decried the alarming rate of killings in Takum and Ussa Local Government councils of the State.\nTaraba has been under heavy attack by militias, with several number of persons killed in the last two weeks.\nApart from the killings, valuables worth millions of Naira have been destroyed by the rampaging militias.\nWhere are the security men, why were they withdrawn, who withdrew them, and for what reason?”The association added that “It is high time the Federal Government of Nigeria led by President Mohammedu Buhari began to match words with action in the areas of security, so as to save the nation from imminent collapse.”It said the security situation had ubjected the people to untold hardships and was hampering economic activities.\nThey also expressed displeasure that despite several calls, the National Emergency Management Agency (NEMA), had not deemed it fit to support the victims via relief materials."
  },
  {
    "headline": "Banditry: All our efforts have failed – Gov. Matawalle begs for prayers",
    "summarized_story": "Matawalle, who appealed to Muslim faithful to pray fervently for divine intervention, said every effort by his administration to end banditry had failed.\n“Peace and harmony are the bedrocks of any meaningful development.\nAnd we all must join forces to ensure that these criminal elements are pushed out of the whole system,” he added.\nHe said that his administration had done everything within its power to end the ugly development but the banditry activities had persisted.\n“We have implemented various security measures, established so many security committees but all to no avail,” he said."
  },
  {
    "headline": "Zamfara: Bandits have overpowered security operatives – Locals",
    "summarized_story": "Residents of Zamfara State, especially the rural dwellers, have described the salaries and allowances being paid to security agencies as a huge loss since they could not control the insecurity situation in the State.\nAccording to one Umar Magami, most of the villagers celebrated their sallah in Gusau and other urban areas because no community in Zamfara State is secured.\n“Every assurance the security agencies are giving was to satisfy their paymasters.\nThe security operatives cannot handle the security challenges in the State.\n“The bandits are killing the security operatives like chickens."
  },
  {
    "headline": "USAID appropriates $5million for COVID-19 vaccine in Nigeria",
    "summarized_story": "The United States Agency for International Development, USAID, says it has given over $5m additional funds to support the administering of the COVID-19 vaccine in Nigeria.\nThe Deputy Project Director, Risk Communication, of Breakthrough Action Nigeria, Dr. Olayinka Umar-Farouk revealed this on weekend during a Workplan Development Workshop for the 2023 fiscal year.\nFarouk explained that the funding was aimed at addressing vaccine hesitancy across different States in Nigeria, with key focus on people living with HIV and AIDS, healthcare workers and persons with co-mobidity illnesses.\nAccording to the statement issued to journalists in Uyo, ”Breakthrough Action Nigeria has been funded by USAID since the outbreak of COVID-19 in 2020 to support risk communication and community engagement efforts in Nigeria.\nThrough these activities, 415,376 persons have been vaccinated.”The statement revealed that according to reports of Nigeria Centre for Disease Control, NCDC, COVID-19 has affected a total number of 256,415 persons in Nigeria, causing the death of 3,144 persons, while 250,147 persons were successfully treated."
  },
  {
    "headline": "Kuje prison: DHQ tackles Fani-Kayode over allegations against military The Nation Newspaper",
    "summarized_story": "It said the former Minister’s wild and unsubstantiated allegations against the Armed Forces following the Kuje Prison invasion is deliberate falsehood intended to mislead the public.\nIn all these allegations, Mr Kayode is merely playing to the gallery.\nIt is sad that Mr Kayode is ignorant of whose responsibility it to guard prison.\n“Mr Fani-Kayode is also called to refresh himself on the constitutional roles of the Armed Forces of Nigeria.\n“Maybe they are angry that the Armed Forces has continued to remain loyal to the Constitution and President Muhammadu Buhari."
  },
  {
    "headline": "Over 800 million faced acute hunger in 2021 — Report The Nation Newspaper",
    "summarized_story": "The number of people affected by hunger globally rose to as many as 828 million in 2021, according to the latest State of Food Security and Nutrition report.\nAs many as 828 million people were affected by hunger in 2021 – 46 million people more from a year earlier and 150 million more from 2019.\nNearly 924 million people (11.7 percent of the global population) faced food insecurity at severe levels, an increase of 207 million in two years.\nThis is a similar number to 2015, when the goal of ending hunger, food insecurity and malnutrition by the end of this decade was launched under the 2030 Agenda for Sustainable Development.\nThis comes as supply chains are already being adversely affected by increasingly frequent extreme climate events, especially in low-income countries, and has potentially sobering implications for global food security and nutrition."
  },
  {
    "headline": "PCN arrests vendors, seals 434 medicine shops in Plateau The Nation Newspaper",
    "summarized_story": "The Pharmacist Council of Nigeria (PCN), has sealed 434 medicine shops caught in unethical practices.\nThe enforcement arm of the PCN said the medicine shops sealed were those selling prohibited drugs, operating without licences, and those who are using expired licences.\nThis is because most criminal elements in society take this drug as a confidence booster before carrying out their activities.\nThe council observed that many wholesale pharmacies and patent medicine shops are not licensed by PCN and have been operating illegally.\nIn an effort to address these challenges, the PCN has strengthened the Pharmaceutical Inspection Committee and Patent and Proprietary Medicine Vendor’s Licence Committee nationwide to enhance inspection and monitoring activities."
  },
  {
    "headline": "Falana to professional bodies: mobilise your members for PVC registration The Nation Newspaper",
    "summarized_story": "A civil rights activist, Femi Falana has called on professional bodies to mobilise their members to obtain their permanent voter’s cards and use their large population to elect the right persons that would move Nigeria to her promised land.\nFalana posited that we cannot leave politics to charlatans who cannot be accountable to anyone for their performance in public office.\nIn his words, the President of the NIQS, QS Olayemi Shonubi charged members to continue to promote integrity and accountability in both public and private sector.\nHe noted that the task of building our nation is not for people in government alone but all of us.\nHe stated that professionals must rekindle the patriotic spirit and work toward making Nigeria great again."
  },
  {
    "headline": "No respite for states as pension arrears, workers’ salaries mount The Nation Newspaper",
    "summarized_story": "The dwindling revenue from crude oil sales is not helping matters and is even beginning to threaten salary payment in some states.\nThe last pension paid was also in April.\nThe last pension paid was also in April.\nThe story is not different in other tertiary institutions like Abia State College of Education Technical, Arochukwu and Abia State College of Health Technology, Aba.\nFigures obtained from the Federal Ministry of Finance show that the following amounts were disbursed to states from the Federation Account Allocation Committee (FAAC) over the last one year:May 2022: N241.824bApril 2022: N201.256bMarch 2022: N227.201bFebruary 2022: N190.007bJanuary 2022: N179.251bDecember 2021: N221.190bNovember 2021: N210.046bOctober 2021: N209.838bSeptember 2021: N220.272bAugust 2021: N217.183bJuly 2021: N222.514bJune 2021: N215.572bMay 2021: N194.195bApril 2021: N193.432bMarch 2021: N179.242bFebruary 2021: N166.08bJanuary 2021: NN177.171bStory ByNduka Chiejina, Abuja/Kolade Adeyemi, Jos/Ernest Nwokolo, Abeokuta/Sunny Nwankwo, Umuahia/Nwanosike Oku, Awka/Onimisi Alao, Yola/Damian Duruiheoma, Enugu/Yinka Adeniran, Ibadan /Joel Duku,Damaturu/Ogochukwu Anioke,Abakaliki"
  },
  {
    "headline": "Untold story of Kuje prison attack – The Sun Nigeria",
    "summarized_story": "PorositySecurity sources described the location of the Kuje prison as very porous and prone to attacks by anybody.\nReacting to the situation in Kuje Prison, Retired Deputy Controller of Prison, Simon Dung, in a chat with our correspondent, lamented that Kuje prison only recently developed a negative reputation as a detention centre for high profile criminals like Boko Haram terrorists.\n“May I remind you that Kuje Prison was actually a facility financed by the military to keep pro-democracy agitators?\nPro-democracy activists arrested for whatever reason across Nigeria were sent to Kuje prison.\n“So, as you can see the reason for setting up Kuje Prison was political and not crime."
  },
  {
    "headline": "Kuje prison attack: Police recapture Boko Haram escapee in Nasarawa",
    "summarized_story": "From Abel Leonard, LafiaNasarawa State police command says it has recaptured one Hassan Hassan, male, whose name and picture was amongst the Boko Haram inmates that escaped from Kuje correctional facility.\nThis was contained in a press release signed by the Police Public Relations Officer, DSP Ramhan Nansel, who said the escapee was recaptured by the police operatives of the Nasarawa State police command in Keffi at 01:30am.\nThe state Commissioner of Police, Adesina Soyemi, has since ordered the transfer of the suspect to a safer location while intensive search for other escapees and handing over process of the arrested inmates progresses.\nSoyemi further appreciated the efforts of the police, and assured members of the public of the command’s unrelenting efforts at making the society safe for all."
  },
  {
    "headline": "Osun guber poll: Oyetola, Adeleke, others to slug it out Saturday",
    "summarized_story": "Watching from the sideline, many political pundits see the contest as a straight fight between the APC and PDP.\nFor the APC, in spite of the obvious advantage of the power of incumbency, Governor Oyetola has been unrelenting in his vigorous campaign for re-election for his second term.\nAgain, with the newfound relationship between Governor Oyetola and his predecessor, Ogbeni Rauf Aregbesola, the coast now appears to be clearer for the party.\nAlmost all the founding fathers and chieftains of the party have vowed not to have anything to do with Adeleke.\nPolitical observers have described the gale of defections that recently hit the PDP in the state as a big minus for Adeleke."
  },
  {
    "headline": "Kalu rejoices with Mike Awoyinfa as The Sun former MD turns 70",
    "summarized_story": "Former governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu, has described the pioneer Managing Director and Editor-in-Chief of The Sun newspapers, Mike Awoyinka, as a cerebral media guru.\nAcknowledging the contributions of Awoyinfa to the growth and progress of the media industry beyond the shores of Nigeria, Kalu stressed that the media practitioner’s outstanding leadership qualities are unbeatable and remarkable.\nHe said: “On behalf of the people of Abia North Senatorial District, I congratulate the former Managing Director and Editor-in-Chief of the Sun newspapers, Mr Mike Awoyinka as he clocks 70.\n“The celebrant is a household name in the media industry, having made enormous contributions to the media profession over the years.\nHis passion for the media profession is highly commendable and worthy of emulation.”Kalu wished the celebrant a joyous birthday celebration."
  },
  {
    "headline": "16 passengers missing in another Lagos boat mishap – The Sun Nigeria",
    "summarized_story": "By Steve AgbotaBarely three days after a 20-passenger boat ferrying 17 persons capsized and two persons died on Lagos water channel, another passenger boat carrying 16 persons late Friday night capsized with all passenger onboard declared missing.\nAccording to her, the tide of the water drifted the boat to a stationary barge, which caused the boat to overturn.\n“At about 7.45 today the 8th of July 2022, The National Inland Waterways Authority and Lagos State Waterways Authority received a distress call of an incident on the waterways.\n“A W19 passenger fibre boat carrying 16 persons capsized along the Ojo area of the state.\nShe said that NIWA, Lagos State Waterways Authority (LASWA) and Lagos State Emergency Management Agency (LASEMA), mobilised to the scene of the incident."
  },
  {
    "headline": "BEDC Faults Takeover by Fidelity Bank – THISDAYLIVE",
    "summarized_story": "Adibe Emenyonu in Benin CityFollowing the activation of calls on its collateralised shares by Fidelity Bank Plc, the Benin Electricity Distribution Company (BEDC) Plc yesterday said there was no legal basis for the takeover of the company.\nThe purported activation seeks to take over the respective Boards of Kano Electricity Distribution Company, Kaduna Electricity Distribution Company and Benin Electricity Distribution Company over their inability to repay the loans obtained to acquire majority stakes in the DisCos in furtherance of the 2013 privatisation exercise.\nIn its statement, BEDC said the referenced report also alleged that certain parties “have been appointed as Board Members, Independent Directors and Managing Director of BEDC Electricity Plc.\n“As we understand it, Vigeo Holdings Limited (VHL – a non-shareholder of BEDC) obtained credit facilities from Stanbic IBTC Bank Limited, Fidelity Bank Plc, and Keystone Bank Plc (the VHL Lenders).\nThe management of BEDC Electricity Plc warned that, “Any attempt by Fidelity Bank and/or BPE to intervene in BEDC in the manner being reported will be illegal, unlawful and will be resisted”."
  },
  {
    "headline": "Coalition Asks INEC to Curb Vote buying in Osun Guber Poll – THISDAYLIVE",
    "summarized_story": "Oluchi ChibuzorA coalition of Civic Society Organisations has challenged the Independent National Electoral Commission (INEC) to proactively curtail technical manipulation activities in order to curb vote buying in the forthcoming governorship election in Osun State.\nThe statement said the coalition was largely on ground “to monitor and to observe the Ekiti elections.\nIt boldly returned the verdict that the Ekiti elections left much to be desired.\n“Consequently, Nigerians, both home and in diaspora, as well as members of the international community must kick-start a thorough monitoring of the electoral process of the Osun governorship election.\nIn addition to this, a beauty pageant where a bevy of Ijebu-born ladies will compete for the “Miss Ojude Oba” crown will be held."
  },
  {
    "headline": "Edevbie: I Went to Court to Save PDP in Delta – THISDAYLIVE",
    "summarized_story": "“Let me be clear, this should not be seen as a personal victory but as a victory for our great party, PDP, which is firmly rooted in justice.\n“Delta State has always been a PDP State and by the grace of God, it will remain so after the next elections.\n“Now that order has been restored, our PDP family is stronger and ready to defeat all opposition parties in Delta State in 2023.\nThis is not the hill to die on.”In the Thursday’s court ruling, the presiding Judge, Justice Taiwo O. Taiwo, declared that Sheriff Oborevwori is not qualified to contest for the office of Governor of Delta State, adding that the applicant/plaintiff, Edevbie should be given due respect as the PDP Delta State governorship candidate.\nOborevwori, the defendant who is also Speaker, Delta State House of Assembly, has since indicated his readiness to appeal the verdict of the high court."
  },
  {
    "headline": "AbdulRazaq, Saraki Exchange Warm Handshake at Ilorin Praying Ground – THISDAYLIVE",
    "summarized_story": "The event took place at the Ilorin prayer ground as part of the activities to mark this year’s Eid-el-Kabir celebration, which was marked in a peaceful atmosphere, unlike the previous events.\nThe governor arrived in his Toyota Hilux vehicle at the prayer ground with his eldest brother and Mutawalli of Ilorin, Dr Alimi AbdulRazaq.\nSaraki had earlier arrived at Eid Prayer Ground in the company of his aides, associates and loyalists.\nPolitical loyalists from both camps were also seen exchanging banter at the prayer ground.\nAlso, at the Eid was the Emir of Ilorin, Dr Ibrahim Sulu-Gambari, accompanied by a retinue of royal chiefs and kakaki-blaring traditional guards"
  },
  {
    "headline": "CAN Denies Endorsing Gadzama for NBA Presidency – THISDAYLIVE",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe leadership of the Christian Association of Nigeria (CAN) has denied endorsing Chief Joe Gadzama (SAN) for the President of the Nigerian Bar Association (NBA).\nWhile disowning an earlier statement on the issue, CAN said it only prayed for the best to emerge as the leader of the association.\nIn a separate statement signed by the Media Assistant to the CAN President, Pastor Adebayo Oladeji, the association also denied endorsing the senior lawyer.\n“We pray for the best to emerge as the leader of this noble association (NBA),” the statement added.\nSamson Ayokunle, reiterated the position of the association in remaining neutral in the NBA election in an interview granted to online media."
  },
  {
    "headline": "ISWAP Terrorists Planning To Attack Christians, Targets In Nigerian Capital, Abuja, Released Kuje Jihadists To Pursue Goal—Civil Defence, NSCDC",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has raised the alarm over planned attacks by the Islamic State in West Africa Province (ISWAP) terrorists on selected targets in the Federal Capital Territory, Abuja.\nIt also said that the Islamic terrorists had declared war against Christians in Nigeria, saying that was why they attacked the Kuje Correctional Centre and released some of their fighters to sustain the attack.\nThe letter obtained by Leadership which SaharaReporters sighted on Sunday, was dated July 8, 2022, and titled: \"Security Alert: Renewed Threat Of Attack By ISWAP Terrorist On Targets within The FCT\".\n\"Intelligence abounds that ISWAP terrorist group has claimed responsibilities of the Tuesday 5th of July, 2022 attack on Kuje medium security custodial centre, releasing their adherent members.\nLast Tuesday, ISWAP terrorists attacked Mike Correctional Centre, freeing hundreds of inmates, including Jihadists held at the prison facility."
  },
  {
    "headline": "ISWAP Terrorists Planning To Attack Christians, Targets In Nigerian Capital, Abuja, Released Kuje Jihadists To Pursue Goal—Civil Defence, NSCDC",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has raised the alarm over planned attacks by the Islamic State in West Africa Province (ISWAP) terrorists on selected targets in the Federal Capital Territory, Abuja.\nIt also said that the Islamic terrorists had declared war against Christians in Nigeria, saying that was why they attacked the Kuje Correctional Centre and released some of their fighters to sustain the attack.\nThe letter obtained by Leadership which SaharaReporters sighted on Sunday, was dated July 8, 2022, and titled: \"Security Alert: Renewed Threat Of Attack By ISWAP Terrorist On Targets within The FCT\".\n\"Intelligence abounds that ISWAP terrorist group has claimed responsibilities of the Tuesday 5th of July, 2022 attack on Kuje medium security custodial centre, releasing their adherent members.\nLast Tuesday, ISWAP terrorists attacked Mike Correctional Centre, freeing hundreds of inmates, including Jihadists held at the prison facility."
  },
  {
    "headline": "I Will Probe, Retrieve Every Penny Stolen By Past Nigerian Rulers – AAC Presidential Candidate, Sowore",
    "summarized_story": "The presidential candidate of the African Action Congress (AAC) and convener of #RevolutionNow, Omoyele Sowore, has stated that if elected the president of Nigeria in 2023, he will probe past Nigerian leaders and recover every public fund stolen during their stay in the office.\nOmoyele SoworeHe argued that if the country could be retrieving money from the dead and long buried former Head of State, Sani Abacha, nothing would stop him from retrieving stolen funds from living legendary thieves.\nHe said, “As President of Nigeria, I will probe and retrieve every penny stolen by past Nigerian rulers, those who’ve murdered innocents and deprived them of a bright future.\n“If we could be retrieving money from dead and buried Sani Abacha, we should retrieve from living legendary thieves.”SaharaReporters had earlier reported that the Labour Party counterpart, Peter Obi, said that he would not probe any Nigerian past leader if elected the president in 2023.\nAccording to the former Governor of Anambra State, “You can’t close your shop and be chasing thieves” because “those who only look at yesterday and today will miss tomorrow.”"
  },
  {
    "headline": "I Will Probe, Retrieve Every Penny Stolen By Past Nigerian Rulers – AAC Presidential Candidate, Sowore",
    "summarized_story": "The presidential candidate of the African Action Congress (AAC) and convener of #RevolutionNow, Omoyele Sowore, has stated that if elected the president of Nigeria in 2023, he will probe past Nigerian leaders and recover every public fund stolen during their stay in the office.\nOmoyele SoworeHe argued that if the country could be retrieving money from the dead and long buried former Head of State, Sani Abacha, nothing would stop him from retrieving stolen funds from living legendary thieves.\nHe said, “As President of Nigeria, I will probe and retrieve every penny stolen by past Nigerian rulers, those who’ve murdered innocents and deprived them of a bright future.\n“If we could be retrieving money from dead and buried Sani Abacha, we should retrieve from living legendary thieves.”SaharaReporters had earlier reported that the Labour Party counterpart, Peter Obi, said that he would not probe any Nigerian past leader if elected the president in 2023.\nAccording to the former Governor of Anambra State, “You can’t close your shop and be chasing thieves” because “those who only look at yesterday and today will miss tomorrow.”"
  },
  {
    "headline": "I Will Probe, Retrieve Every Penny Stolen By Past Nigerian Rulers – AAC Presidential Candidate, Sowore",
    "summarized_story": "The presidential candidate of the African Action Congress (AAC) and convener of #RevolutionNow, Omoyele Sowore, has stated that if elected the president of Nigeria in 2023, he will probe past Nigerian leaders and recover every public fund stolen during their stay in the office.\nOmoyele SoworeHe argued that if the country could be retrieving money from the dead and long buried former Head of State, Sani Abacha, nothing would stop him from retrieving stolen funds from living legendary thieves.\nHe said, “As President of Nigeria, I will probe and retrieve every penny stolen by past Nigerian rulers, those who’ve murdered innocents and deprived them of a bright future.\n“If we could be retrieving money from dead and buried Sani Abacha, we should retrieve from living legendary thieves.”SaharaReporters had earlier reported that the Labour Party counterpart, Peter Obi, said that he would not probe any Nigerian past leader if elected the president in 2023.\nAccording to the former Governor of Anambra State, “You can’t close your shop and be chasing thieves” because “those who only look at yesterday and today will miss tomorrow.”"
  },
  {
    "headline": "INSIGHT: How dissemination of fake images is aggravating Nigeria's security challenges",
    "summarized_story": "So, when fake photos surface online showing vivid scenes of killings, kidnappings and arson from different parts of the country, they go viral and generate a lot of comments, conspiracies and controversies.\nHOW FAKE PHOTOS GO VIRALSeeing is believing, they say.\nSocial media users, who posted the image, attributed it to the Kaduna train attack without stating if the image was for mere illustration.\n“That’s to show how false photos could cause grave harm to any society,” he said.\nAs the 2023 Nigerian general elections draw closer, fake news, propaganda and disinformation are expected to be on the rise."
  },
  {
    "headline": "INSIGHT: How dissemination of fake images is aggravating Nigeria's security challenges",
    "summarized_story": "So, when fake photos surface online showing vivid scenes of killings, kidnappings and arson from different parts of the country, they go viral and generate a lot of comments, conspiracies and controversies.\nHOW FAKE PHOTOS GO VIRALSeeing is believing, they say.\nSocial media users, who posted the image, attributed it to the Kaduna train attack without stating if the image was for mere illustration.\n“That’s to show how false photos could cause grave harm to any society,” he said.\nAs the 2023 Nigerian general elections draw closer, fake news, propaganda and disinformation are expected to be on the rise."
  },
  {
    "headline": "MAN to FG: Remove VAT on diesel to curtail price hike",
    "summarized_story": "The Manufacturers Association of Nigeria (MAN) has asked the federal government to remove the value-added tax (VAT) on diesel as an instant stimulus for an immediate price reduction.\nSegun Ajayi-Kadir, director-general, MAN, made the call in a statement issued on Saturday in Lagos.\n“MAN is greatly concerned about the implications of the over 200 per cent increase in the price of diesel on the Nigerian economy and the manufacturing sector in particular,” the statement reads.\nAdvertisement“More worrisome is the deafening silence from the public sector as regards the plight of manufacturers.\nIt also implored the government to continue to support manufacturing to accelerate recovery from COVID-19 and previous bouts of recession."
  },
  {
    "headline": "MAN to FG: Remove VAT on diesel to curtail price hike",
    "summarized_story": "The Manufacturers Association of Nigeria (MAN) has asked the federal government to remove the value-added tax (VAT) on diesel as an instant stimulus for an immediate price reduction.\nSegun Ajayi-Kadir, director-general, MAN, made the call in a statement issued on Saturday in Lagos.\n“MAN is greatly concerned about the implications of the over 200 per cent increase in the price of diesel on the Nigerian economy and the manufacturing sector in particular,” the statement reads.\nAdvertisement“More worrisome is the deafening silence from the public sector as regards the plight of manufacturers.\nIt also implored the government to continue to support manufacturing to accelerate recovery from COVID-19 and previous bouts of recession."
  },
  {
    "headline": "Report: Tinubu has settled for Muslim running mate, to inform Buhari today",
    "summarized_story": "Bola Ahmed Tinubu, presidential candidate of the All Progressives Congress (APC), has reportedly settled for a Muslim running mate.\nA highly-competent source in the Tinubu Campaign Organisation who requested anonymity confirmed this to NAN on Sunday in Abuja.\nOver the past few weeks, there has been a national conversation about the religious background of the presidential candidates and their intended running mates.\nAbdullahi Ganduje of Kano State said on Saturday that Tinubu had settled for a Muslim-Muslim ticket.”The source added that in picking the running mate, Tinubu was not thinking about religion but about the competence, exposure and intellectual depth of the candidate.\nAccording to NAN, Tinubu is scheduled to pay Sallah homage to President Muhammadu Buhari in Daura, Katsina, on Sunday to brief him on his chosen running mate."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Digital Nomads: Freelance digital marketer Baraka Mafole wants Tanzanians to thrive in the digital economy",
    "summarized_story": "After discovering that his fellow students were making money online, Mafole decided to join them; he spent hours learning digital skills.\nIn the last decade, the Tanzanian digital ecosystem has evolved as more Tanzanian citizens have access to digital services.\nThis led them to co-found an initiative called Tanzania Digital Trailblazers later that month, a series of virtual events to bring awareness of digital skills to young Tanzanians.\nThis time around, they added physical monthly digital skills training events to the mix.\nMafole said that dozens of Tanzanian youths have connected with his story and have been inspired to upgrade their lives by learning digital skills."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Rita Anwiri Chindah on her life as a lawyer and digital content creator",
    "summarized_story": "Today on Everyday People, we meet Rita Anwiri Chindah, an intellectual property and information technology lawyer and an arbitrator based in Port-Harcourt, Rivers State.\nSo sometimes when I want to record, I have to tell my family, cause I stay with my parents.\nI went there the first time and they said, “Okay, maybe come back next week.”And I went back the following week.\nGet ready to subscribe on Spotify, Apple podcast, google podcast and other platforms.\nWhen you’re trying to Google, trying to read different documents, make sure that you give a brief summary of everything."
  },
  {
    "headline": "Has government lost its monopoly of violence to terrorists?",
    "summarized_story": "Sources said that the security appratchiks were told of the planned attack on Kuje Correctional Centre, nothing was done to nip it in the bud.\nNigerians have reached a point where their governor cannot rescue her citizens from terrorists but terrorists can easily and do easily rescue their members from government prisons.\nCecil Esekhaigbe, a retired major-general, wondered how a huge number of terrorists could beat all the security posts on the road without anybody noticing or challenging them.\nToday, it does seem that government has completely lost that right to bandits and other assorted criminal gangs in the country.\nHow do you have grasses growing around the entire place; that’s a security threat in a place called medium security prison; and you are going there in your opulence."
  },
  {
    "headline": "What worsening insecurity means for 2023 election",
    "summarized_story": "For many, the present fear for safety, amid the alarming rate of attacks on lives and property across the country pose a big risk for the success of the 2023 general election.\nFor Sam Onikoyi, a Nigerian lecturer and research fellow in Belgium, what the worsening insecurity means for the 2023 general election is fear of attacks or bloodbath for innocent voters that step out to vote.\nOnikoyi admonished those who say that despite insecurity the 2023 general election will hold to rethink because there have been some unimaginable changes, shifts and moves in recent times.\nIn the same vein, Elvis Omejiaku, a director of strategy at an Abuja-based civil right organisation, decried that what the growing insecurity means for the 2023 general election is inconclusive election.\nRead also: What worsening insecurity means for 2023 electionWhy insecurity won’t affect 2023 election – AgbakobaBut in an exclusive interview with BusinessDay Sunday, Olisa Agbakoba, a senior advocate of Nigeria (SAN), said that the insecurity would not affect the election."
  },
  {
    "headline": "Who benefits from INEC’s voter registration extension?",
    "summarized_story": "The Independent National Electoral Commission (INEC) had last week formally extended indefinitely the Continuous Voter Registration (CVR) exercise which was to end on June 30.\nYakubu assured that: “The voter registration exercise will not end on June 30 as earlier proposed.\n“Concerned by reports of shortages of voter registration machines, inadequate manpower and personnel at registration centres which may lead to frustrations among prospective registrants and in some cases, unrest at some registration centres.\nLike in Osun for instance now, election is next week there is no longer voter’s registration because the fact that if you do voter’s registration now you will not be able to process those cards for election next week.\n“The campaign now is not just about voter’s registration."
  },
  {
    "headline": "Eid-el-Kabir: Obaseki felicitates with Muslims, urges love, sacrifice – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with Muslims on the celebration of Eid-el-Kabir.\nIn a statement, the governor urged the Muslim faithful to imbibe the lesson of sacrifice which the Eid-el-Kabir symbolizes.\nHe said, “I felicitate with our Muslim brothers and sisters on the celebration of the Eid-el-Kabir festivities.\nAs we join our Muslim faithful to mark this auspicious celebration, I urge everyone to imbibe the lesson of sacrifice that it symbolizes.\nBeyond personal convictions, we all have a deeper and greater responsibility to God and humanity."
  },
  {
    "headline": "Eid-el-Kabir: Shaibu charges Nigerians on religious tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Acting Governor, Rt.\nComrade Philip Shaibu, has called on Nigerian leaders to demonstrate the virtue of religious tolerance in the spirit of the Eid-el-Kabir celebration.\nShaibu said this while receiving Muslim faithful who were at the Government House, Benin City, to commemorate the Eid-El-Kabir celebration.\nHe noted: “Edo State is one of the states in Nigeria where Muslims and Christians live peacefully and work together for the development of the state.\n“We have been trying our best to make Edo State great."
  },
  {
    "headline": "DTSG Presents Cheques To Next Of Kins Of Victims Of Oleh, Ozoro Crisis – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestASABA – Delta State Government has presented government’s financial support to the next of kins of victims of the boundary dispute between Ozoro and Oleh communities in Isoko South Local Government Area towards the burial of those who died as a result of the dispute.\nThe Secretary to the State Government (SSG), Chief Patrick Ukah, on behalf of the state government presented cheques to the beneficiaries in his office in Asaba.\nVantus Ogboghoro, thanked Oleh community for the matured way they handled the dispute.\nHe appealed to the state government to ensure the implementation of the resolutions of the white paper.\nMr. Egeme thanked the state government for wading into the matter with a view to proffering lasting solution and pledged that the two communities would maintain peace."
  },
  {
    "headline": "300 Pupils Benefit From Free LAPO Community Health Outreach – Nigerian Observer",
    "summarized_story": "The Primary Schools are Obazagbon Primary School and Ogiama Primary School in Obazagbon Community.\nDelivering his address at the 17th edition of the LAPO community health outreach on Friday, July 8, 2022 in Obazagbon community, the Executive Director, LAPO, Dr. Honestus Obadiora said LAPO institutionalized its community health outreach in 2015 as a direct response to health challenges in rural communities.\nDr. Obadiora, represented by Mrs.Vivian Evbotokhai , Senior Program Officer, LAPO, revealed that a total of 15,649 persons have benefitted from the community health outreaches since its inception in 2015 .\nThe 17th LAPO community health outreach provided the pupils of indigent parents in Obazagbon community free health care services, administered by medical consultants and specialists in areas of oral / personal hygiene and eye care services.\nOn her part , Mrs. Irabor Josephine, Health Officer, (SUBEB) stated that government through the board, had provided the enabling environment through its school based management committee and its field officers for the successful organization of the 17th LAPO community health outreach in Obazagbon community in Edo state."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "2023: Tinubu has picked a running mate – Campaign team",
    "summarized_story": "Bola Ahmed Tinubu, presidential candidate of the All Progressives Congress (APC) has decided on his choice of running mate, a member of his campaign team has disclosed.\nA highly-competent source in the Tinubu Campaign Organisation who requested anonymity confirmed this to the News Agency of Nigeria (NAN) on Sunday in Abuja.\nThe source added that in picking the running mate, Tinubu was not thinking about religion, but about competence, exposure and intellectual depth of the candidate.\nTinubu is scheduled to pay Sallah homage to President Muhammadu Buhari in Daura, Katsina, on Sunday to brief him on his chosen running mate.\nThe former two-term Lagos State governor won APC’s presidential ticket at the party’s June 8 special national convention and presidential primary election."
  },
  {
    "headline": "Omolaraeni, McEnies boss advises PR practitioners on self-reputation management",
    "summarized_story": "The Group Chief Executive Officer of McEnies Global Communications, Ms Omolaraeni Olaosebikan, has enjoined practitioners, particularly young and upcoming PR personnel to pay special attention to managing their reputation alongside their official responsibility of nurturing the reputation of their clients.\nShe directed the appeal to young professionals in self-reputation management who are often accused of treating clients with levity and with total disregard for professional ethics.\nShe added that the situation can be salvaged by practitioners through sincere display of integrity and commitment to the practice.\nVirtues such as trust, honesty, humility and a commitment to transparency should be upheld while transacting business with the clients.\nAccording to her, “Practitioners within the space of marketing communications, event planning or management, advertising, public relations, etc."
  },
  {
    "headline": "Nigeria’s Joe Aribo joins Southampton on four-year deal",
    "summarized_story": "Joe Aribo, Super Eagles midfielder, has joined Southampton from Scottish giants Rangers on a four-year deal.\nAribo becomes Southampton’s fifth signing of the summer after the arrivals of Gavin Bazunu, Mateusz Lis, Armel Bella-Kotchap and Romeo Lavia.\nThe statement from Southampton read: “Southampton Football Club is delighted to announce the signing of Joe Aribo from Rangers on a four-year deal.\n“Known for his versatility, Aribo stands at 6ft tall and can operate anywhere across midfield, or as a forward.\nSpeaking on his move to Southampton, Aribo said: “It’s an amazing club with a lot of history here, and it’s a good plan with what’s to come next."
  },
  {
    "headline": "NBRP lauds NLNG on release of 2022 longlist, opens platforms for exposure of books, authors",
    "summarized_story": "The Network of Book Clubs and Reading Promoters in Nigeria (NBRP), has welcomed the release of the longlist for the Nigerian Prize for Literature 2022, just as commended the NLNG for keeping faith with the process through the years.\nIn support of the laudable objective of the initiative, NBRP, also known as the Network, said it is also opening up its platforms to support awareness of the project through encouraging its members countrywide to read and discuss the books in the lists, including where scheduled, having the writers themselves in attendance.\n“This is an excellent opportunity to get people reading,” Richard Mammah, President of the Network, said, adding that “the NLNG Nigeria Prize for Literature longlist has opened an exciting season of reading that will linger on long after the winner has been announced.”Established in February 2020, NBRP only recently carried out a pilot nationwide survey of the State of reading infrastructure in Nigeria."
  },
  {
    "headline": "JUST IN: Terrorists free seven more Kaduna train passengers",
    "summarized_story": "Terrorists who abducted passengers of a Kaduna-bound train after the attack on March 28, have released seven more persons.\nMalam Tukur Mamu, one of the negotiators and Media consultant to Islamic Cleric, Sheikh Ahmad Gumi, disclosed this on Saturday.\nHe said through his singular efforts, he successfully negotiated the release of “another seven victims.”The terrorists had earlier threatened to start killing the abducted passengers within 24 hours if the federal government failed to meet their demands.\nMore subsequently …"
  },
  {
    "headline": "As NNPC Transits Into CAMA Company",
    "summarized_story": "On July 1, 2022, the Nigerian National Petroleum Company Limited legally transformed into a company whose operations and activities are regulated under the Companies and Allied Matters Act, CAMA.\nThe NNPC’s transformation into a CAMA company follows the implementation of the Petroleum Industry Act.\nConsequently, NNPC had set up a PIA transition committee with specific directive to drive the transitioning of NNPC into a full CAMA company.\nThe road map includes valuation of the assets and liabilities, development of corporate governance frameworks, rebranding of NNPC to NNPC Ltd and change management.\n“Secondly, this company will pay company income tax that also comes to the federation for the benefit of all."
  },
  {
    "headline": "As NNPC Transits Into CAMA Company",
    "summarized_story": "On July 1, 2022, the Nigerian National Petroleum Company Limited legally transformed into a company whose operations and activities are regulated under the Companies and Allied Matters Act, CAMA.\nThe NNPC’s transformation into a CAMA company follows the implementation of the Petroleum Industry Act.\nConsequently, NNPC had set up a PIA transition committee with specific directive to drive the transitioning of NNPC into a full CAMA company.\nThe road map includes valuation of the assets and liabilities, development of corporate governance frameworks, rebranding of NNPC to NNPC Ltd and change management.\n“Secondly, this company will pay company income tax that also comes to the federation for the benefit of all."
  },
  {
    "headline": "Decongestion: Ganduje Releases 3, 898 Inmates",
    "summarized_story": "Kano state governor Dr Abdullahi Umar Ganduje has released a total number of 3,898 inmates across Kano Correctional Centres within a period of Seven years.\nThe exercise is conducted through the State Prerogative of Mercy Committee at the intervals of Sallah festivities.\nThe 90 inmates who were released today were among the released 3,898, as he disclosed during today’s visit to Gorondutse Correctional Centre on Sallah day.\nGovernor Ganduje assured that he would continue with the good work up to 2023 when his administration ends.\nIn his brief remarks the Controller of Kano Correctional Centres, Sulaiman M Inuwa hailed governor Ganduje, revealing further that, “In my 30 years of working experience, I have never come across a governor who did something close to this.”"
  },
  {
    "headline": "Decongestion: Ganduje Releases 3, 898 Inmates",
    "summarized_story": "Kano state governor Dr Abdullahi Umar Ganduje has released a total number of 3,898 inmates across Kano Correctional Centres within a period of Seven years.\nThe exercise is conducted through the State Prerogative of Mercy Committee at the intervals of Sallah festivities.\nThe 90 inmates who were released today were among the released 3,898, as he disclosed during today’s visit to Gorondutse Correctional Centre on Sallah day.\nGovernor Ganduje assured that he would continue with the good work up to 2023 when his administration ends.\nIn his brief remarks the Controller of Kano Correctional Centres, Sulaiman M Inuwa hailed governor Ganduje, revealing further that, “In my 30 years of working experience, I have never come across a governor who did something close to this.”"
  },
  {
    "headline": "After 15 Jail breaks, 3,828 Escaped Immates Still At Large",
    "summarized_story": "Two years after Nigeria recorded 15 jailbreaks across the country, the federal government is yet to track and recapture the over 3,828 escaped inmates roaming the country freely.\nA security expert, Mr. Thomas Adoye said, “It is sad that till date, the Nigeria Correctional Service has not been able to harmonise their information.\nThey need to be told that it is also very important to have their fingerprints, pictures and other details to do so successfully.\nHe expresses his deep appreciation to security agencies and patriotic Nigerians whose collaboration is facilitating the recovery exercise.\n‘My boss has assured the public of his irrevocable commitment to bringing back all escapees to answer for their crimes."
  },
  {
    "headline": "‘Tinubu has chosen his running mate’ – TCO",
    "summarized_story": "Sen. Bola Ahmed Tinubu, 2023 presidential candidate of the All Progressives Congress (APC) has decided on his choice of running mate.\nAbdullahi Ganduje of Kano State said on Saturday that Tinubu had settled for a Muslim-Muslim ticket,’’ the source said.\nThe source added that in picking the running mate, Tinubu was not thinking about religion, but about competence, exposure and intellectual depth of the candidate.\nTinubu is scheduled to pay Sallah homage to President Muhammadu Buhari in Daura, Katsina, on Sunday to brief him on his chosen running mate.\nThe former two-term Lagos State governor won the APC’s presidential ticket at the party’s June 8 special national convention and presidential primary election."
  },
  {
    "headline": "VIDEO: Goodluck Jonathan’s Cousin, Mike Ogiasa Begs For His Life In Kidnapper’s Den",
    "summarized_story": "In a video that has since gone viral, Mike Ogiasa, a relative of former president Goodluck Jonathan who was kidnapped by gunmen in Bayelsa State, can be seen pleading for his life in the kidnapper’s den.\nOn June 4, 2022, Ogiasa, an engineer, was abducted in his hometown of Otuabadi in the Ogbia Local Government Area.\nOgiasa is seen half-naked in a flooded tomb in the video, which SaharaReporters got and ran for 27 seconds.\nWATCH: Kidnappers Release Disturbing Video Of Abducted Former Nigerian President, @GEJonathan’s Cousin Mike Ogiasa Crying For Help Inside A shallow Grave FULL VIDEO: https://t.co/sXmTAe4zyZ pic.twitter.com/It9o8IKhtk — Sahara Reporters (@SaharaReporters) July 9, 2022He cried, “You’re seeing me in the grave.\nOgiasa, who also served as Special Adviser on Power to the state government, had finished attending a meeting before his assailants swooped on him."
  },
  {
    "headline": "BREAKING: Terrorists Release Seven More Train Passengers — Negotiator",
    "summarized_story": "Following more than 100 days in captivity in the forest, the terrorists who attacked the Abuja-Kaduna bound AK9 train on March 28 have freed a new group of seven hostages.\nOne of the negotiators and media advisor to controversial Islamic cleric Sheikh Ahmad Gumi, Malam Tukur Mamu, revealed this and claimed that via his lone efforts, he had successfully negotiated the release of “another seven victims.”Details later…"
  },
  {
    "headline": "JUST IN: Itsekiri host Communities’ Shutdown Chevron’s Olero, Dibi fields",
    "summarized_story": "The Olero, Dibi, and Abiteye Fields’ Itsekiri host communities, who also demand basic facilities and the hiring of VTP 5 and VTP 6 trainees, have forced Chevron to cease operations in Delta State.\nComrade Raymond Aderojo led the protesters, who started the shutdown this morning.\nThey demanded portable drinking water, electricity, health care, a review of undergraduate scholarships, a review of community workers’ salaries, employment for graduates, the location of the vocational training center in Warri so that the VTP Program could resume, and the conversion of VTP 5 and VTP 6 trainees."
  },
  {
    "headline": "Buhari, other Muslim faithful perform Eid prayer on Sallah day",
    "summarized_story": "President Muhammadu Buhari on Saturday joined other Muslims at the Kofar Arewa Eid prayer ground, Katsina State.\nThis is because the President joined hundreds of Muslim faithful to participate in the 2023 Eid-El-Adha also known as Eid-El Kabir.\nThe security operatives drawn from the Police, Army, the Department of State Services (DSS), the Nigeria Security and Civil Defence Corps (NSCDC) and other sister security agencies stormed the Eid Prayer Ground to give maximum security for the President, his entourage and other worshippers attending the Eid Prayer.\nChannels Television observed that the entire parameter fencing of the Eid Prayer Ground was completely surrounded by a team of security personnel deployed by their various agencies with movements of vehicles including bicycles restricted in the area.\nThe two Rak’at prayers led by Imam Safiyanu Yusuf Dansanwai at Kofar Arewa Eid Prayer Ground commenced at about 10:00 am and rounded up at about 10:05 am."
  },
  {
    "headline": "Breaking: Amidst wild protest, Sri Lanka’s President resigns",
    "summarized_story": "Soon after they stormed the presidential palace, Rajapaksa’s nearby seafront office also fell into the hands of protesters.\nA new prime minister, Ranil Wickremesinghe, took over in May to help steer the country out of the crisis.\nThousands of people broke through barricades and entered President Gotabaya Rajapaksa’s residence and nearby office to vent their anger against a leader they hold responsible for the nation’s worst crisis.\nVideos posted on social media showed protesters storming the residence, chanting ‘Gota go home,’ calling the president by his nickname.\nSri Lanka Medical Council said that the president, prime minister and the government would be held responsible if people died or were maimed."
  },
  {
    "headline": "Happening now: Protest worsens in Sri Lanka, Prime Minister’s house set ablaze, President remains in hiding",
    "summarized_story": "The planned rally, one of the largest anti-government marches in the crisis-hit country this year, turned violent as thousands of furious demonstrators surged past police barricades and into the presidential compound and nearby office of Sri Lankan President Gotabaya Rajapaksa.\nThe office of Prime Minister Ranil Wickremesinghe said the protesters forced their way into his Colombo home on Saturday evening.\nSome protesters, holding Sri Lankan flags and helmets, also swam in the presidential swimming pool, video footage from local TV news NewsFirst channel showed.\nTwo defence ministry sources said President Gotabaya Rajapaksa was removed from the official premises on Friday for his safety ahead of the planned rally over the weekend, with government spokesman Mohan Samaranayake unsure of Rajapaksa’s whereabouts.\nMany blame the country’s decline on President Gotabaya Rajapaksa, as it muddles through with aid from India and other countries and its leaders try to negotiate a bailout with the International Monetary Fund."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "Kaduna Train Attack: Terrorists Release Seven More Kidnapped Passengers",
    "summarized_story": "Seven more kidnapped passengers of the March 28 train attack in Kaduna state have been released by the terrorists who attacked the train.\nThe victims were released by their abductors on Saturday after spending over 100 days in captivity.\nBut he did not say if any ransom was paid or not before the terrorists released the victims.\nMamu disclosed that the seven released hostages have been handed over to the military and that they were in their way to Kaduna.\nMamu, while reiterating the power of mediation in addressing the security challenges bedeviling the country, claimed that he singlehandedly facilitated and initiated the release of the seven kidnapped victims with support from Sheikh Ahmad Gumi."
  },
  {
    "headline": "Two Missing As Flood Wreaks Havoc In Lagos",
    "summarized_story": "Three persons have been rescued with two others missing as flood wreaked havoc on a community in the Orile Agege area of Lagos State.\nChannels Television gathered that the victims were caught up in a severe flood on Oyatoki Street in the nation’s commercial centre.\nThe Southwest Coordinator NEMA, Ibrahim Farinloye, explained that four of the victims have been rescued, while two are still missing.\nREAD ALSO: Flooding: Lagos Govt To Divert Traffic In Ogba For Installation Of Concrete CulvertRescuers from both the National Emergency Management Agency (NEMA) and those from the Lagos State Emergency Management Agency (LASEMA) as well as those from the fire service were still searching for the two missing persons at the time of this report.\nAs part of measures to contain the situation, the Lagos State Government announced the diversion of traffic along Oba Ogunji Road, Ogba for one week for the installation of a precast concrete culvert across Metal Box Road."
  },
  {
    "headline": "Eid-El-Kabir: Muslims Observe Prayers At Eid Grounds",
    "summarized_story": "The annual festival of Eid al-Adha or the Festival of Sacrifice marks the end of the hajj pilgrimage to Mecca by hundreds of millions of Muslims.\nIn Katsina, President Muhammadu Buhari arrived his country home, the Daura area of the north-western state for the Eid-el- Kabir on Friday evening.\nThe two Rak’at prayers led by Imam Safiyanu Yusuf Dansanwai at Kofar Arewa Eid Prayer Ground commenced at about 10:00 am and rounded up at about 10:05 am.\nEarlier before the commencement of the prayer, security was beefed up at the Kofar Arewa Eid prayer ground in Daura.\nSecurity personnel from the Police, the Army, the DSS, the NSCDC and other sister security agencies stormed the Eid Prayer Ground to give maximum security for the President, his entourage and other worshippers attending the Eid Prayer."
  },
  {
    "headline": "Kuje Attack: Fleeing Inmate Linked To Terrorism Arrested In Nasarawa",
    "summarized_story": "One of the suspected terrorists who escaped from the Kuje Correctional Centre during the Boko Haram invasion, Hassan Hassan, has been recaptured in Nasarawa State.\nOn Friday, the Nigerian Correctional Service (NCoS) revealed the names and photos of 69 inmates who escaped from the correctional facility following an attack by terrorists three days ago.\nChannels Television observes that Hassan is number 12 on the list of terrorism suspects released.\nThe Police Public Relations Officer in Nasarawa State announced his arrest via a statement obtained by Channels Television.\nREAD ALSO: Kuje Prison Attack: FG Declares Fleeing Boko Haram Suspects Wanted, Releases PhotosHe said the Commissioner of Police in the state, Adesina Soyemi, has directed the transfer of the suspect while intensifying the search for other fleeing inmates."
  },
  {
    "headline": "Super Eagles Midfielder Aribo Seals Premier League Move",
    "summarized_story": "Super Eagles midfielder Joe Aribo has joined Premier League side, Southampton on a four-year deal from Scottish Giants, Rangers.\nThe 25-year-old has played the past three seasons at Ibrox, scoring 26 goals in 149 matches since joining from English league one side, Charlton Athletic in 2019.\nAribo helped Rangers win their 55th SPL title in the 2020/2021 season, their firstin 10 years while liftingthe Scottish Cup last season.\nHe was a runner-up in last season’s UEFA Europa League in which he scored in the final against German Bundesliga side Frankfurt.\n“The Premier League is the best league in the world."
  },
  {
    "headline": "Ondo youths movement drums support for NNPP Assembly Candidate, Kolawole Oluwaseyi -",
    "summarized_story": "AdvertisementAlabi said Akoko North-West youths are backing his candidacy, because of his antecedents and love for development of the youths.\nThe communique reads in part, “Many aspire to lead, even when they don’t have what it takes to lead.\nThe group added that it is time to support a personality with a vision and mission to redefine development in the constituency.\nAdvertisementIt also called on all stakeholders in Akoko North-West beyond party affiliations to support aspiration of Oluwaseyi, so that the constituency can move forward.\n“His antecedents in diverse professions are clear pointers that he is more fit than any other person to lead the constituency”, the group stressed."
  },
  {
    "headline": "Chief Whip dismisses Rumoured Defection of 8 PDP Oyo Lawmakers -",
    "summarized_story": "Hon Adedibu, who is also the Chief Whip of the House debunked the rumor during Wednesday’s plenary under personal explanation.\nAdvertisementHe explained that though he and the other seven members will not be returning to the House in 2023, there is no plan by them to leave the ruling Peoples Democratic Party, PDP in Oyo State.\nHon Adedibu urged members of the public to disregard the unfounded rumour.\n” On behalf of other seven members, i Hon Hakeem Adedibu wish to state categorically that there was never a plan by me or any of the other seven members of the PDP to defect to another party .\n” Hon Hakeem Adedibu."
  },
  {
    "headline": "Oyo assembly directs CJ to set up panel against Deputy Governor -",
    "summarized_story": "AdvertisementRecall that on the 17th of June, 2022 a correspondence/petition titled ” Notice of Allegations of Gross Misconduct Against the Deputy Governor of Oyo State, Engr Rauf Olaniyan” was read at the floor of the plenary.\nIn the petition, the 23members accused the Deputy Governor of Gross Misconduct, abuse of office, financial recklessness, abandonment of office and insubordination.\nAdvertisementAdvertisementThe House thereafter served the Deputy Governor and all other members of the Legislature a copy of the allegations.\nWhile reading the motion, the Majority Leader noted that up till now the Deputy Governor had not responded to the copy of the allegations served him by the House.\n“We have no say whether the State Deputy Governor is guilty or not."
  },
  {
    "headline": "Over 78,000 persons have completed their registration in Oyo- INEC -",
    "summarized_story": "The Independent National Electoral Commission says a total of 78,420 persons have completed the Continuous Voters Registration in Oyo State but only about 45,000 are valid out of them.\nThe Oyo state Resident Electoral Commissioner Mutiu Agboke disclosed this at a media briefing held in Ibadan.\nAdvertisementAdvertisementAccording to him, we have 78,420 registrants that completed registration during these period but there were only 45,187 valid registration out of it all.\nThe Independent National Electoral Commission, INEC, had originally scheduled the deadline for the stoppage of registration for the PVC’s for the 30th of June but has now extended the deadline indefinitely.\nThis is another in the Series of regular update by the Election Mangement Body, INEC."
  },
  {
    "headline": "Nigerian Manufacturers Lament High Cost of Diesel, Demand Licence to Import from Niger Republic, Chad",
    "summarized_story": "The Manufacturers Association of Nigeria (MAN) has decried the rising cost of diesel in the country and urged the federal government to issue its members licences to import the product from the Republic of Niger and Chad.\nThe manufacturing sector, which dominates export trade in the West African sub-region, employs more than five million workers, directly and indirectly, and contributes 8.46 per cent to the nation’s Gross Domestic Product (GDP).\nHe added that the manufacturing sector had been battered by many familiar challenges that had plummeted the number of industries and converted industrial hubs to warehouses of imported goods and event centres.\n“MAN is greatly concerned about the implications of the over 200 per cent increase in the price of diesel on the Nigerian economy and the manufacturing sector in particular.\nAjayi-Kadir urged the government to strengthen the nation’s economic absorbers from external shocks to reduce the myriad challenges the manufacturing sector was already beguiled with."
  },
  {
    "headline": "Plot fo Remove PDP Chairman Iyorchia Ayu Thickens",
    "summarized_story": "A plot by some southern governors elected on the platform of the Peoples Democratic Party to remove its National Chairman Iyorchia Ayu from office is gaining momentum.\n“The National Chairman is back and he has lined up a series of meetings to address this perceived crisis, including agitations for his removal.\n“He is billed to meet the PDP governors, the BoT members and even former PDP governors and Atiku once he returns to the country.\nThe source explained that it was agreed that at the pre-convention stages in October 2021 that if the presidential candidate comes from the North, the National Chairman should resign.\nOn his part, the chairman of PDP BoT, Jibrin told THISDAY that he would meet Atiku to present the BoT’s recommendations to him."
  },
  {
    "headline": "Wooing Rivers Governor Wike an Exercise in Futility, Saraki Tells APC Governors",
    "summarized_story": "The three APC governors were said to be in Port Harcourt, the Rivers State capital, apparently to woo the aggrieved PDP governor to the ruling APC.\nAccording to him, “Governor Wike is an important member of our party and I am very confident that in no distant time, we will sit down and address all the issues.\nSaraki added: “The fact that some APC governors went to see their colleague, trying to capitalise on what they think is an issue is a gross miscalculation.\n“The APC governors know that it is this kind of a crack they need to latch on to.\nFortunately, we are not going to give him (Wike) to them because the election ahead is too important."
  },
  {
    "headline": "Nigeria: How Ex-Boko Haram Fighter Emerged as Prison Official",
    "summarized_story": "Fresh facts have emerged on how an ex-Boko Haram fighter became an official of the Nigeria Correctional Services (NCoS).\nIt was gathered that on February 18 this year, an alarm was raised at a correctional centre in Adamawa State.\nRelatedStories No Content AvailableA former Boko Haram fighter, Wilberforce Yohanna, was recruited as a staff of the Yola New Custodial Centre in the state.\nLeaked internal documents on the security situation at the prison facility according to the report showed that Mr Yohanna’s Boko Haram background was detected following the dexterity he displayed with gun handling during training.\n“Upon further interrogation and collaborative findings, he confessed to having been abducted and held hostage by members of Boko Haram for two years.”The new prison official also confessed to having received training in heavy weapon handling from a Boko Haram base before he escaped their custody, according to the documents."
  },
  {
    "headline": "Police Rearrest Fleeing Boko Haram Suspect in Nasarawa, FG Tightens Security in Abuja – Arise News",
    "summarized_story": "The Nasarawa State Police Command on Saturday said it recaptured a Boko Haram suspect, Hassan Hassan, who was among the inmates that escaped from the Kuje Maximum Custodial Centre in Abuja.\nMeanwhile, the federal government said it has tightened security around the Kuje Correctional facility and other parts of the Federal Capital Territory (FCT).\nThe Police Public Relations Officer (PPRO) of the Nasarawa State command, DSP Ramhan Nansel added that the fleeing Boko Haram suspect was recaptured at Keffi, headquarters of Keffi Local Government Area of the state.\nThe FCT Police Command in a statement issued Friday night said it had put in place water-tight security around Abuja.\n“At all other praying grounds within the FCT, no vehicle will be permitted to park 200 metres close to the praying grounds."
  }
]