[
  {
    "headline": "‘Nigerians attributing cough, catarrh to AA genotype may have contracted Omicron’",
    "summarized_story": "The researchers’ call is a reaction to recent contentious debates on online platforms on the link between the AA genotype and malaria infection.\n“I don’t think it has anything to do with having AA genotype as some people speculated.\nAccording to him, there is no scientific evidence linking the AA genotype to the spike in cases of cough, catarrh and fever.\nIn addition, the transmission of COVID-19 Omicron variant may be another factor,” he said.\nIt has nothing to with this talk of AA genotype that is all over the place,” he said."
  },
  {
    "headline": "‘Nigerians attributing cough, catarrh to AA genotype may have contracted Omicron’",
    "summarized_story": "The researchers’ call is a reaction to recent contentious debates on online platforms on the link between the AA genotype and malaria infection.\n“I don’t think it has anything to do with having AA genotype as some people speculated.\nAccording to him, there is no scientific evidence linking the AA genotype to the spike in cases of cough, catarrh and fever.\nIn addition, the transmission of COVID-19 Omicron variant may be another factor,” he said.\nIt has nothing to with this talk of AA genotype that is all over the place,” he said."
  },
  {
    "headline": "India begins vaccinating teenagers as Omicron fears rise",
    "summarized_story": "India extended COVID-19 vaccinations to teens aged 15-18 on Monday after officials tightened restrictions in big cities to avoid a repeat of last year’s devastating outbreak.\nMore than 200,000 people around India died in a huge spring virus wave that overwhelmed hospitals and crematoriums.\n– ‘Safeguard the kids’ –Last year’s Delta variant wave in India struck after one of the world’s biggest religious gatherings, the Kumbh Mela, which attracted around 25 million Hindu pilgrims.\nBut under-reporting is widespread and some studies have estimated India’s true toll could be up to 10 times higher.\nIndia will begin rolling out booster vaccines for people aged over 60 from next Monday."
  },
  {
    "headline": "India begins vaccinating teenagers as Omicron fears rise",
    "summarized_story": "India extended COVID-19 vaccinations to teens aged 15-18 on Monday after officials tightened restrictions in big cities to avoid a repeat of last year’s devastating outbreak.\nMore than 200,000 people around India died in a huge spring virus wave that overwhelmed hospitals and crematoriums.\n– ‘Safeguard the kids’ –Last year’s Delta variant wave in India struck after one of the world’s biggest religious gatherings, the Kumbh Mela, which attracted around 25 million Hindu pilgrims.\nBut under-reporting is widespread and some studies have estimated India’s true toll could be up to 10 times higher.\nIndia will begin rolling out booster vaccines for people aged over 60 from next Monday."
  },
  {
    "headline": "2023 Presidential Election: APC wooing Goodluck Jonathan, says PDP",
    "summarized_story": "File: Former President, Dr. Goodluck Jonathan(right) and President Muhammadu Buhari during a recent closed-door meeting in Abuja.\nBy Dirisu Yakubu, ABUJAThe Peoples Democratic Party, PDP, has alleged that the ruling All Progressives Congress, APC, was wooing former President, Dr. Goodluck Jonathan ahead of the 2023 presidential election.\nPDP made the revelation while reacting to insinuation that Jonathan would soon join APC.\nHowever, spokesman of the PDP, Debo Ologunagba, in a chat with Vanguard, dismissed speculations linking Jonathan to the APC.\n“This time, they are flying a kite that Dr. Jonathan is likely to join them."
  },
  {
    "headline": "2023: It’s ungodly for Delta South to aspire for governorship — Gbagi",
    "summarized_story": "By Ochuko Akuopha, UGHELLIFORMER Minister of State for Education and Delta State governorship aspirant, Olorogun Kenneth Gbagi, has said that it was ungodly for Delta South senatorial district to aspire for the gubernatorial position in the state in the 2023 general election.\nSpeaking when he hosted members of the Gbagi Support Movement at his Oginibo, Ughelli South Local Government Area, country home, Gbagi insisted that it was the turn of Delta Central to produce the governor of the state in 2023.\n“Delta South that has just finished the governorship cannot claim that it is their turn to produce the governor.\n“I plead that we should understand ourselves and work for the growth, greatness and development of Delta State,” Gbagi said.\nReiterating that he was a founding member of the PDP in the state, Gbagi noted that “I am the oldest PDP member vying for the governorship among the lot of persons."
  },
  {
    "headline": "Abia APC Crisis: More party chieftains defect to Emenike group",
    "summarized_story": "By Ugochukwu Alaribe, UMUAHIAThree members of the former executive committee of the All Progressive Congress, APC, Abia State, led by Chief Donatus Nwankpa, have joined the mainstream Chief Ikechi Emenike leadership recognised by the national leadership of the party.\nRecall that the Abia APC had been divided between the Emenike group and the faction led former state Chairman, Nwankpa.\nIt read: “This is to inform all Nigerians, Abians, friends and well-wishers that Benedict Godson, Chief Obi Aham and Menyechi Onuoha has decided to join and work for our great party, the All Progressives Congress (APC) under the leadership of High Chief Ikechi Emenike.\n“Also, we want to use this medium to state clearly that we believe that APC in Abia State is united and stronger under the leadership of High Chief Ikechi Emenike.\n“And we hereby use this medium to officially announce our loyalty and dedication to this one and only APC, Abia State chapter.”They noted that any other announcement, report or statement that goes contrary to their decision should be disregarded, stressing that joining Emenike is in best interest of the APC in the state."
  },
  {
    "headline": "Why I want to succeed Buhari — Okunnu-Lamidi, female presidential aspirant",
    "summarized_story": "The Founder and Chief Executive Officer of Slice Media Solutions, disclosed that her motivation in vying for the presidency stems from her desire to restore hope and make Nigeria work for all Nigerians.\nThe media expert noted that youths under the age of 30, who represent about 70 per cent of Nigeria’s population, have borne the most impact of bad governance.\nShe added that the youth account for 13.9 million of the unemployment figures, which stood at 21.7 million in the second quarter of 2020.\n“The challenge of the presidency is to make Nigeria work for all of its diverse peoples.\n“It is the most powerful office in the land, but it is a place of service, and responsibility and duty and not a place of arrogance or show.”Vanguard News Nigeria"
  },
  {
    "headline": "Bolaji Akinyemi @80: A Tribute",
    "summarized_story": "James Akinyemi, Bolaji Akinyemi turns 80 today.\nHe is nothing short of Kissingerian in his impact on Nigerian foreign policy at a time when our country still had a strong presence in world politics.\nAlthough he previously headed the NIIA for eight years and so was already well known in foreign policy circles, preparation and hard work met opportunity and, combined with a keen intellect and strong worldview, created an eventful career in foreign policy.\nBolaji Akinyemi saw tomorrow in the context of the world and Nigeria’s potential place in it.\nBolaji Akinyemi remains a sought-after public commentator today, alongside his role as an elder statesman."
  },
  {
    "headline": "Jama’are community begs Bauchi govt not to relocate state varsity campus",
    "summarized_story": "The People of Jama’are Local Government Area of Bauchi State have begged the state government not to relocate the Bauchi State University campus sited in Jama’are, even as they organised a special prayer session for God to intercede on their behalf on the issue.\nDauda appealed to the state government to allow the faculty to remain in Jama’are in the interest of fairness and justice.\nOn his part, the secretary of Jama’are Development Forum, Saleh Ahmed Malle, said that they had been hearing rumours the Bauchi State government was planning to relocate the Faculty of Agriculture to another town.\nMalle informed that the Jama’are community was in possession of a copy of the approval granted to TetFUND by the state government, signed by the state governor, Senator Bala Abdulkadir Mohammed.\n“The two institutions are for the development of not Jama’are LGA alone but the entire state."
  },
  {
    "headline": "Buhari reacts to Bashir Tofa’s death",
    "summarized_story": "President Muhammadu Buhari on Monday expressed grief over the death of a one-time Presidential Candidate in a two-horse race, Bashir Tofa.\nBuhari made his feelings known in a tribute to the deceased, which was released by Garba Shehu, his Senior Special Assistant on Media and Publicity, in Abuja.\nThe President described the late Tofa, a politician of note, who was also a promoter of Islamic culture and civilization, as a “true nationalist that would be difficult to replace”.\nHe said: “The late Tofa was noted for his untiring commitment to public enlightenment and was unafraid to speak the truth all the time that he lived.\nWe owe it to his memory and to the nation.”According to Buhari, the late Tofa set up the Bureau for Islamic Propagation, BIP, in the mid-80s that helped to unite Muslim Scholars in the Northern States."
  },
  {
    "headline": "‘They put me in nasogastric tube’ – Brazil President, Bolsonaro on his health",
    "summarized_story": "President of Brazil, Jair Bolsonaro, has provided the latest update on his health situation after he was taken to the Vila Nova Star hospital in the South of Sao Paulo on Monday.\n“The President shall undergo more tests to find out what is in the abdomen.\nMacedo also said that the suspicion, for now, is of a new intestinal obstruction, technically called “intestinal subocclusion.\nReacting to the development, Bolsonaro, in a tweet via his Twitter account, said he was put in a nasogastric tube, adding that more tests will be done for possible surgery.\n“They put me in a nasogastric tube."
  },
  {
    "headline": "Tofa was patriotic, wanted to serve his country – ACF mourns",
    "summarized_story": "The Arewa Consultative Forum (ACF) on Monday, mourned the death of a former candidate of the 1993 presidential election under the National Republican Convention (NRC), Bashir Tofa.\nThe group described Tofa as a patriot who wanted to serve his country.\nThe statement described Tofa, as a man of many parts, adding that, he was sometimes a national politician, community leader or an international businessman.\nThe statement said Tofa’s participation in the 1993 presidential election as the candidate of the NRC overshadowed all other things he did.\n”It was as if he never did anything in life other than participate in that election whatever happened to that election should not be blamed on him”."
  },
  {
    "headline": "Olubadan stool: Do not install Lekan Balogun, he has already been crowned Oba – Lawyer petitions Makinde",
    "summarized_story": "The legal practitioner said, for this reason, Makinde should desist from going forward to install Balogun as the next Olubadan of Ibadan land.\nReports also indicate that the next person to ascend the throne is a former Senator from Oyo state, High Chief Mashood Olalekan Balogun.\nBalogun, who was next to the Olubadan was also among the High chiefs who accused the departed monarch of running a one-man show.\nBalogun and other High Chiefs among whom were High Chief Akinloye Owolabi Olakunlehin – Balogun of Ibadanland, High Chief Tajudeen Abimbola Ajibola – Otun Balogun of Ibadanland, High Chief Eddy Oyewole – Asipa Olubadan, High Chief Lateef Gbadamosi Adebimpe – Osi Balogun, High Chief Abiodun Kola-Daisi – Eekerin Olubadan and High Chief Salaudeen Hamidu Ajibade – Eekarun Olubadan collided with Ajimobi and were installed and crowned as Obas.\nLana in his letter argued that High Chief Lekan Balogun and other High Chiefs who were elevated as Obas do not qualify to be crowned the Olubadan."
  },
  {
    "headline": "Controversy trails selection of new Olubadan",
    "summarized_story": "In what appears to be a brewing controversy, the installation and coronation of the new Olubadan of Ibadanland following the demise of the 41st Olubadan, Oba Saliu Akanmu Adetunji Ajeogunguniso I, has assumed another dimension.\nThe Nation gathered that following the death of the monarch, Lekan Balogun who is currently the Otun Olubadan is next in line to be king.\nBut a former Attorney-General of Oyo State, Michael Lana, said Balogun was unfit to be crowned as the next Olubadan.\nThe lawyer said Balogun, some high chiefs and Baales were illegally conferred with their titles by former Governor Abiola Ajimobi.\nHe said: “Under that declaration and all relevant law, no Oba can ascend to the throne of Olubadan."
  },
  {
    "headline": "JUST IN: Police kill suspected IPOB member in foiled Imo palace attack",
    "summarized_story": "The police on Monday repelled an attempt to set ablaze the palace of Eze Amaifeke in Orlu Local Government Area of Imo State, Emmanuel Okeke.\nOkeke is the Chairman of Imo State Traditional Rulers Council.\nThe hoodlums, who the police suspect to be members of the Indigenous People of Biafra IPOB and its enforcement arm the Eastern Security Network (ESN), stormed the palace at about 1am.\nThe Command’s tactical teams deployed to communities to monitor palaces along with the vigilante group engaged the hoodlums in a gun duel.\nAbattam said the command’s tactical teams were combing the bush for the fleeing members of the gang."
  },
  {
    "headline": "JUST IN: IPOB bans cows in Southeast",
    "summarized_story": "JUST IN: IPOB bans cows in SoutheastThe Indigenous People of Biafra (IPOB) on Monday said cows reared by Fulani herdsmen would no longer be used for any social event in the Southest.\nRead Also: IPOB: our members now endangeredIt said only native cows would be allowed in the region for such events.\nThe group said: “The ban placed on Fulani cows will take effect in April 2022.\n“Effective that month, Fulani cows will not be used for any social or ceremonial events and festival in Biafraland.\n“Our native cows will be used instead for these events."
  },
  {
    "headline": "Imo now war zone, monarchs, clerics cry out, vow to mediate",
    "summarized_story": "Monarchs and clergymen in the Southeast on Monday said Imo State has turned to a warzone.\n- Advertisement -The groups spoke in a statement titled “Imo politicians must de-escalate hostilities to save Imo State”, jointly signed by the Obi of Onitsha, Igwe Nnaemeka Achebe and Methodist Archbishop of Umuahia, Chibuzo Opoko.\n“This state of affairs in Imo State, blamed largely on a few politicians of the state and their cohorts, constitute an assault on the dignity and well-being of Ndi Imo and the Igbo nation.\n“Next, we ask for an examination of conscience of the actors in Imo State, FCT, Abuja, or elsewhere.\n“May peace and good order reign in Imo State.”"
  },
  {
    "headline": "Bayelsa govt donates land for proposed Anglican university",
    "summarized_story": "The Bayelsa government has promised to provide land for the proposed establishment of an Anglican university in the state.\nDescribing Anglican schools as strong institutions that contributed in producing responsible members of society, Diri said hosting an Anglican university would positively impact the state and the Niger Delta region.\n- Advertisement -Diri attributed the successes recorded under his administration to God and appreciated the Anglican Primate for the visit.\nHe said: “Your request for land for the proposed Anglican university is a good request.\nSo, we are very happy and prepared to host the Anglican university."
  },
  {
    "headline": "Burial of The Sun MD’s father-in-law holds tomorrow",
    "summarized_story": "The burial of Pa Silas Amaghereonu Nwachukwu, father-in-law of the Managing Director/Editor-in-Chief, The Sun Publishing Limited, Mr. Onuoha Ukeh, holds tomorrow, January 4, 2022.\nPa Silas, who died at the age of 82, will be laid to rest in his compound at Umuanum, Ohekelem, Ngor Okpala, Imo State.\nAccording to burial arrangements released by Andrew Chinaegbomkpa Nwachukwu, the body of Pa Silas will leave Orient Mortuary, Egbelu, Uvuvru Mbaise at 9am tomorrow for lying- in- state in his compound.\nThere will be a funeral service conducted by St. Matthew’s Anglican Church, Ohekelem at Pa Silas compound, Umuanum, Ohekelem, Ngor Okpala, Imo State.\nHis children include Mrs. Chidiadi Iheanacho, Mrs. Nkechi Alessandra Onuoha-Ukeh, Miss Chikaodi Nwachukwu, Miss Oluchi Nwachukwu, Mrs. Chinasa Chidi-Okoro, Mr. Andrew Chinaegbomkpa Nwachukwu and Mr. Chibuzor Nwachukwu."
  },
  {
    "headline": "Supreme Council of Sharia in Nigeria appoints new president",
    "summarized_story": "From Desmond Mgboh, KanoThe Supreme Council for Shariah in Nigeria (SCSN) has appointed Sheikh AbdurRashid Hadiyatullah as its new President.\nMaking the announcement of the new appointment at a press conference in Kano, Monday, the Secretary General of the Council, Nafi’u Baba Ahmed, explained that the appointment followed the death of their former President, Sheikh Ibrahim Datti Ahmed who passed on a few days ago.\nAccording to him, the new President was the former Vice President of the Council during the immediate past administration, adding that his elevation was in total submission to the will of Allah and in line with the Constitution of the Council.\nSpeaking on the deceased, he revealed that the Council was overwhelmed by the passage of their former President while praying Allah to forgive the deceased his shortcomings and grant him eternal rest.\nIn attendance at the press conference include respected Islamic clerics from the North such as Sheikh Abdulwahab Abdallah, Sheikh Ibrahim Khaliel, Malam Abba Koki and Malam Sani Yakubu, among others"
  },
  {
    "headline": "How Bashir Tofa died in Kano",
    "summarized_story": "BY DESMOND MGBOH, KANOOne of the leading candidates in the 1993 Presidential election, Alhaji Bashir Tofa, has diedFamily sources said the former presidential candidate died in the early hours of Monday after a protracted illness.\nAlhaji Tofa was the Presidential candidate of the defunct National Republican Convention and a major challenger of Chief MKO Abiola’s in the controversial June 12, 1993, presidential election, annulled by the military government of General Ibrahim Babangida.\nTofa was born in Kano to a Kanuri family on June 20, 1947.\nHe had his primary education at Shahuci Junior Primary, Kano, and then continued studies at City Senior Primary School in Kano.\nAfter completing his studies at the Provincial school, he worked for Royal Exchange Insurance company from 1967 to 1968."
  },
  {
    "headline": "Lekan Balogun tipped as successor as Olubadan dies",
    "summarized_story": "The fact that Oba Adetunji was produced by the Balogun Lineage has automatically positioned the Otun Lineage to produce the next Olubadan.\nIn this instance, the four most senior chiefs on the Otun Line are Senator Balogun as the Otun Olubadan; Senator Rashidi Ladoja, former governor of Oyo State, as Osi Olubadan; Eddy Oyewole as Ashipa Olubadan and Abiodun Kola-Daisi, as Ekerin Olubadan.\nBuhari, Kalu, Tinubu, Dare pour tributes, encomiumsEminent Nigerians have paid glowing tributes on the late Olubadan.\nIn a condolence message released by his Media Office and signed by Mr. Tunde Rahman, Asiwaju Tinubu said:“The late Olubadan was a sage.\n“On the throne, the late Olubadan worked assiduously for peace and stability of not only Ibadanland, Oyo State and Yorubaland, but also the entire country."
  },
  {
    "headline": "MBF, Arewa, Afenifere, Ohanaeze, MBF set agenda for Buhari – The Sun Nigeria",
    "summarized_story": "The Ohanaeze Ndigbo, the Middle Belt Forum (MBF), the Yoruba socio-cultural group, Afenifere and the Arewa Consultative Forum were among groups and individuals who, yesterday, advised the APC-led Federal Government on what to do to bring about peace as the New Year dawns.\nSpecifically, the MBF decried the plight of people of the Middle Belt who have continued to suffer severe and persistent attacks from marauding gangs of murderous herdsmen.\n“These killings have become the trend in many parts of the Middle Belt region of southern Kaduna, Niger, Plateau, Benue, Adamawa, among others.\nWhen innocent and vulnerable people are left unprotected from the terror of criminals, there can be no option left than self-defence,” Its National President, Dr. Pogu Bitrus, in a statement, yesterday.\nThe forum called on relevant security agencies not to relent in cleansing the Middle Belt communities of terrorists who take pleasure in kidnapping, destroying communities and dislocating people."
  },
  {
    "headline": "NFF to Deny Unvaccinated Journalists Access to Eagles Training",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Nigeria Football Federation (NFF) has made the possession of COVID-19 vaccination cards mandatory for journalists wishing to cover the Super Eagles training session at the Moshood Abiola National Stadium, Abuja.\n“We appreciate you for positively projecting our darling team, the Super Eagles.\n“There will be full media access to the team’s training today, 3rd January, 2022 from 5pm.\nThere will also be 15 minutes access to all players and officials after the training.\n“In strict adherence to COVID-19 protocols, everyone will present their COVID-19 vaccination cards or PCR Test result (72hrs maximum) at the gate,” the statement said."
  },
  {
    "headline": "Breaking: Bashir Tofa, Ex-presidential Candidate, is Dead",
    "summarized_story": "By Ibrahim Shuaibu in KanoAlhaji Bashir Othman Tofa, presidential candidate of the defunct National Republican Convention (NRC) in the June 12, 1993 election, is dead.\nTofa, according to family sources, died at the Aminu Kano Teaching Hospital (AKTH) in the early hours of Monday after a brief illness.\nConfirming his death, one of the deceased relations, said: “Alhaji Bashir Tofa died after a brief illness.”Tofa was the challenger of late Chief MKO Abiola, candidate of the defunct Social Democratic Party (SDP), winner of the June 12 election.\nThe result of the election, which was not fully released officially, was annulled by the military regime of President Ibrahim Babangida.\nBorn on June 20, 1947 in Kano, the late Tofa was also a businessman, oil trader and industrialist."
  },
  {
    "headline": "2019 Audit Report: 178,459 Firearms, Ammunition Missing from Police Armoury",
    "summarized_story": "The report accused the Nigeria Police headquarters of lacking comprehensive details of unserviceable weapons, lamenting that such could fall into unauthorised hands for illegal use.\nThe AuGF report stated, “Audit observed from the review of Arms Movement Register, Monthly Returns of Arms and Ammunition and Ammunition Register at the Armoury section that a total number of lost firearms as reported as at December 2018 stood at 178,459 pieces.\nFormal report on the loss of firearms through dully completed Treasury Form 146 (loss of stores) were not presented for examination.\n“Records obtained from force armament at the Force headquarters showed 21 Police Mobile Force (PMF) Squadron, Abuja, did not report a single case of missing firearm, whereas, schedule of missing arms obtained from the same PMF showed a total number of forty six (46) missing arms between year 2000 and February 2019.\n“The above anomalies could be attributed to weaknesses in the internal control system at the Nigeria Police Force Armament."
  },
  {
    "headline": "It’s War Clearing Goods at Ports, Organised Private Sector Tells FG",
    "summarized_story": "The leaders of the real sector spoke in separate chats with THISDAY.\nThey noted that removing hindrances to the activities of manufacturers and other key players in the country’s real sector would enhance productivity, especially as Africa prepares to fully implement the African Continental Free Trade Area (AfCFTA).\nSome of the major constraints they asked the government to address included low FX supply and poor electricity to the real sector, challenges at the country’s seaports, and low patronage of made in Nigeria goods.\nThe Nigeria Customs Service (NCS) is always like never wishing us to clear our goods at a time meant for them to be cleared.\nAjayi-Kadir said stakeholders from the private sector should be nominated to monitor the disbursement of forex by commercial banks to ensure transparent and timeous allocation to bona fide manufacturers."
  },
  {
    "headline": "With $130trn Tied to Renewables Globally, Nigeria Walks Tight Rope in Bid for Oil Sector Investment",
    "summarized_story": "In its oil and gas outlook for 2022, Wood Mackenzie predicted that record cash flows would come under increasing scrutiny as operators would begin to align with their pledges on decarbonisation.\n“Financing oil and gas was getting harder before COP26, but the pressure will ratchet up in 2022.\nOf more concern is the possibility that the development of new discoveries may be prohibited,” Wood Mackenzie noted.\nAt a projected 1.86 million barrels daily oil production in the country’s 2021 budget, Nigeria recorded a huge deficit of almost 200 million barrels of the liquid in the first 11 months of last year.\nFigures from the NURPC obtained by THISDAY last week indicated that while Nigeria was expected to pump approximately 635 million barrels of oil by November 2021, it only struggled to produce 441 million barrels for the entire period."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigating Financial Scandal In NIRSAL",
    "summarized_story": "SaharaReporters has done series of exclusive stories on how MD of NIRSAL, Aliyu Abduhalmeed, has been siphoning the agency's money.\nAGF MalamiHowever, it has now been discovered that the AGF is frustrating the probe of the fraud and has ordered security agencies to stop the investigation.\nThe Economic and Financial Crimes Commission, Independent Corrupt Practices and other related offences Commission, the State Security Service and Nigeria Intelligence Financial Unit are all to stop investigating the fraud within NIRSAL, the AGF instructed.\n\"All other agencies investigating the matter are to stay further action to allow your office total control of the investigation.\"\nSee Also Corruption EXPOSED: How Managing Director Of NIRSAL, Aliyu Abdulhameed, Diverted Almost N1bn To Bank Account Of Agency's Head Of FinanceDOCUMENT: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigati... by Sahara Reporters on ScribdSee Also Corruption Top Controversial Cases Taken Over By Nigeria’s Attorney General, Malami, And How They Ended"
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigating Financial Scandal In NIRSAL",
    "summarized_story": "SaharaReporters has done series of exclusive stories on how MD of NIRSAL, Aliyu Abduhalmeed, has been siphoning the agency's money.\nAGF MalamiHowever, it has now been discovered that the AGF is frustrating the probe of the fraud and has ordered security agencies to stop the investigation.\nThe Economic and Financial Crimes Commission, Independent Corrupt Practices and other related offences Commission, the State Security Service and Nigeria Intelligence Financial Unit are all to stop investigating the fraud within NIRSAL, the AGF instructed.\n\"All other agencies investigating the matter are to stay further action to allow your office total control of the investigation.\"\nSee Also Corruption EXPOSED: How Managing Director Of NIRSAL, Aliyu Abdulhameed, Diverted Almost N1bn To Bank Account Of Agency's Head Of FinanceDOCUMENT: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigati... by Sahara Reporters on ScribdSee Also Corruption Top Controversial Cases Taken Over By Nigeria’s Attorney General, Malami, And How They Ended"
  },
  {
    "headline": "Apple hits $3trn market value -- now worth more than ALL cryptocurrencies",
    "summarized_story": "Apple has become the first American company to reach a market capitalisation of $3 trillion.\nIt is worth more than the value of all of the world’s cryptocurrencies.\nIt also implies that Apple’s net worth exceeds the gross domestic product (GDP) of countries including India ($2.9 trillion), France ($2.9 trillion) and Russia ($1.6 trillion).\nAt a market value of $3 trillion, Apple tripled its valuation in less than four years.\nAdvertisementWhile iPhone is still the biggest sales driver, Apple’s services business grew 25.6 percent year-over-year and delivered more than $18 billion in revenue last quarter."
  },
  {
    "headline": "Apple hits $3trn market value -- now worth more than ALL cryptocurrencies",
    "summarized_story": "Apple has become the first American company to reach a market capitalisation of $3 trillion.\nIt is worth more than the value of all of the world’s cryptocurrencies.\nIt also implies that Apple’s net worth exceeds the gross domestic product (GDP) of countries including India ($2.9 trillion), France ($2.9 trillion) and Russia ($1.6 trillion).\nAt a market value of $3 trillion, Apple tripled its valuation in less than four years.\nAdvertisementWhile iPhone is still the biggest sales driver, Apple’s services business grew 25.6 percent year-over-year and delivered more than $18 billion in revenue last quarter."
  },
  {
    "headline": "Ita Enang: FG will soon release white paper on NDDC forensic audit report",
    "summarized_story": "Ita Enang, senior special assistant to the president on Niger Delta affairs, says the federal government will soon release a white paper on the report of the forensic audit of the Niger Delta Development Commission (NDDC).\nAdvertisementPresident Muhammadu Buhari had, in 2019, ordered a forensic audit of the NDDC’s operations from 2001 to 2019.\nIn September 2021, Abubakar Malami, attorney-general of the federation, received the NDDC forensic audit report on behalf of the president.\nAdvertisementSpeaking on the development on Monday in an interview on Channels Television, Enang said a white paper on the forensic audit report will show the recommendations which are accepted or rejected by the federal government.\nThe presidential aide said it will amount to prejudice if he gives details of the audit prior to the release of the white paper."
  },
  {
    "headline": "Ita Enang: FG will soon release white paper on NDDC forensic audit report",
    "summarized_story": "Ita Enang, senior special assistant to the president on Niger Delta affairs, says the federal government will soon release a white paper on the report of the forensic audit of the Niger Delta Development Commission (NDDC).\nAdvertisementPresident Muhammadu Buhari had, in 2019, ordered a forensic audit of the NDDC’s operations from 2001 to 2019.\nIn September 2021, Abubakar Malami, attorney-general of the federation, received the NDDC forensic audit report on behalf of the president.\nAdvertisementSpeaking on the development on Monday in an interview on Channels Television, Enang said a white paper on the forensic audit report will show the recommendations which are accepted or rejected by the federal government.\nThe presidential aide said it will amount to prejudice if he gives details of the audit prior to the release of the white paper."
  },
  {
    "headline": "El-Rufai: Let's bomb forests to tackle banditry",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna state, says security operatives should “carpet bomb the forests” to wipe out bandits.\nEl-Rufai attributed the prolonged inability of security operatives to curb banditry in the northwest region to a “lack of enough boots on the ground”.\nHe added that more investment in security personnel, technology and military equipment will see bandits wiped out “once and for all”.\n“Ramp up the number of boots and more technology and more investment in armament and wipe these guys once and for all.\nLet’s carpet-bomb the forests and bomb all of them."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Meaningful reflection and excitement for the future",
    "summarized_story": "Unsurprisingly, the industry that stood out heads, shoulders, and knees above the pack was the fintech space.\nContext: In recent years, mobile money adoption in Ghana has been growing in leaps and bounds to rival Kenya’s success story.\nA levy on mobile money transactions would improve taxation revenues, but there’s no telling how it would impact the average mobile money user.\nWhatever the apex bank decides tomorrow could heavily affect Nigeria’s fintech space.\nAlso, in 2021, Nigerian fintech, Piggyvest, said it disbursed $587.5 million to 3.5 million customers."
  },
  {
    "headline": "Techpoint Africa is 7! The next frontier",
    "summarized_story": "Techpoint Africa has been in business for exactly seven years!!\nThemed “The next frontier“, Techpoint Build promises to be, as always, the largest gathering of innovators, startup founders, thinkers, programmers, policymakers, and investors in West Africa.\nAs part of the activities for Techpoint Build, five of 15 shortlisted startups from across Africa will compete for $10,000 in equity-free grant money.\nTo receive an invite to the dinner, you have to purchase a VIP ticket to Techpoint Build.\nTechpoint Africa Membership ProgrammeIn October 2021, we activated our Membership Programme to zero fanfare."
  },
  {
    "headline": "10 memorable moments for African tech in 2021",
    "summarized_story": "As the year ends, we bring you a few memorable moments across the African tech ecosystem, some good and some bad.\nMore African investors throw their hats in the ringKola Aina, pioneer founder Ventures Platform fundFor so long, most of the investment into African startups came from foreign investors.\nHowever, more African investors are springing up and providing much-needed funding for African startups.\nFor so long, it has been argued that Nigerian startup founders need to be proactive in their interactions with the government and regulators.\nAs a result, some of the country’s most prominent founders and investors came together to work on the Nigerian Startup Bill."
  },
  {
    "headline": "Loan apps defy Google, Nigeria’s data and cyber laws to humiliate defaulters",
    "summarized_story": "The numbers stored on their phones and accessed by the loan apps, were the lenders’ insurance against any inability to repay.\nAfter the lender reached out to her phone contacts, to console herself, she said in a mixture of Pidgin and English; “Who no dey borrow?\nApart from violating the terms by Google playstore, the loan apps have also been alleged to contravene Nigeria’s data privacy law on one hand, and cyber security law on the other.\nMonths later, the action taken against Soko loan has not deterred other loan apps from similar practices.\nIt is yet to be seen how this committee will ensure loan apps continue operating, without abusing the privacy of users."
  },
  {
    "headline": "Guyana’s oil savings fund shows Nigeria’s failure to be future-ready",
    "summarized_story": "The parliament of Guyana voted last week to amend its Natural Resources Fund (NRF) Act that will govern a sovereign wealth fund to create a fund that will manage oil proceeds.\nThis compared poorly with Norway, with a sovereign wealth fund worth more than $1 trillion.\nIt has set up Sovereign Wealth Fund to effectively manage the economy and the expected revenue windfall ahead of first oil.\nThe country’s wealth fund currently stands at US$534 million,“Guyana is a resource-rich, underdeveloped economy.\nOil revenue is a bonus to accelerate Guyana’s economic transformation, modernization, diversification, and development over the next decade,” according to the Guyana Oil and Gas Energy Chamber, which backed the bill."
  },
  {
    "headline": "Edo sets up c’ttee to audit orphanages, threatens to shut down charity homes operating as businesses – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has disclosed plans to set up a committee to monitor and audit orphanage homes in the state, threatening to close down and prosecute orphanage homes operating as businesses as against their designation as charities.\n“They build orphanage homes with the intention to make a profit, rather than for charitable purposes.\nYou will understand that the issue of human trafficking has been a very strong challenge globally and at the state level, Governor Godwin Obaseki has made serious efforts to stamp out human trafficking in Edo State.\nIt then means we must reform every department that is within the purview of this ministry.\nIt is a charity and if you do not have the heart to do charity, you cannot be in the issue of managing orphanage homes."
  },
  {
    "headline": "Edo residents hail Obaseki on ‘most peaceful Yuletide season’ on back of security reforms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Bold and courageous reforms initiated by the Edo State Governor, Mr. Godwin Obaseki have been identified as being instrumental to the relatively peaceful yuletide celebration witnessed across Edo State.\nThe governor had in the last few months mobilized communities and security agencies in the state in activating a community policing model that involved local vigilantes, who collaborate with security agencies to provide intelligence and patrols.\nThis development had forestalled crime and criminality in major cities, towns and communities across the state.\nA cross-section of residents in Edo State hailed the state government for the peaceful atmosphere in which they marked the Yuletide festivities.\nHe made all this possible with the bold reforms in security management.”..."
  },
  {
    "headline": "EDSTMA: A Boost To Obaseki’s Administration – Nigerian Observer",
    "summarized_story": "Making this assertion shortly after being bestowed with an “Award of Excellence,” during the Edo State Traffic Control and Management Agency’s (EDSTMA) end of year party and parade which held at the EDSTMA Head office on January 2, 2022, Barr.\nOlayiwola Afolabi, a Benin based legal practitioner and advocate of social Justice praised EDSTMA for being a viable traffic agency whose display of professionalism has helped to restore faith and respect in the Governor Godwin Obaseki’s led administration.\nManaging Director EDSTMA, Dennis Oloriegbe speaking on achievements for year 2021, said, aside from carrying out its basic function, which is traffic management, the agency was able to reduce traffic menace to fifty percent (50%).\nIf they keep to the law, they would not be harassed or arrested.”As part of the end of year activities EDSTMA unveiled its maiden anthem.\nThe EDSTMA headquarters brigade clinched the first prize closely followed by zones 4 and 6."
  },
  {
    "headline": "Obaseki mourns death of ex-Edo sports commissioner, Brown Ebewele – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has mourned the passing of former Edo State Sports Commissioner, Brown Ebelewe.\nMr. Ebewele, whose death was reported at the weekend was an Olympian and former National Champion, and was part of the Edo delegation to the 20th edition of the National Sports Festival, which held in Benin.\nObaseki, who bemoaned the tragic loss, said Ebewele’s passing was painful, as he still had a lot to offer Edo State and the country in general.\nAccording to Obaseki, “I am saddened by the news of the passing of seasoned sportsman and sports administrator, who made indelible contributions to the development of sports in the old Bendel State and also in Edo State.\nObaseki extended his condolences to the Ebewele family, the sports community as well as friends and associates of the deceased, praying that God will grant all the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "SEC reminds fund managers of payment of regulatory fees",
    "summarized_story": "The Securities and Exchange Commission (SEC), has reminded all fund managers that payment of the annual supervisory fee to the Commission becomes due from the 1st January 2022 and full payment must be made on or before 31st January 2022.\nThis was contained in a Circular released by the SEC at the Weekend.\nAccording to the SEC, “The Commission hereby draws the attention of all registered Fund/Portfolio Managers to the SEC Rule on Annual Supervision Fees for Collective Investment Schemes (CIS) and Regulatory Fees for Discretionary and Non-Discretionary Funds/Portfolios issued on January, 21 2021 and the amendment thereto issued on December 20, 2021.\nThe Circular also stipulates that all fund managers shall pay the annual supervisory fee to the Commission not later than 31st January of every year and that the payment for 2021 annual supervisory fee shall be based on the value of NAV as at December 31st 2021.\nOn Annual Regulatory fee for Discretionary and Non-Discretionary Funds/portfolios, the SEC stated that every Fund/Portfolio manager shall pay not later than 31st January of every year annual regulatory fees to the Commission."
  },
  {
    "headline": "CBN to improve access to credit for households, businesses in 2022",
    "summarized_story": "The Central Bank of Nigeria (CBN), says the banking sector will increase access to loans for Nigerian households and businesses in 2022.\nCBN governor, Mr. Godwin Emefiele who disclosed this in a statement emphasized the need for all stakeholders to work to build a more resilient economyAccording to him, the objective of the central bank in 2022 would be to increase access to loans for households.\n“The policy focus of the bank for 2022 is with a pledge to sustain improved access to finance and credit for households and businesses, mobilise investment to boost domestic productivity, enable faster growth of non-oil exports, and support employment generating activities,” Emefiele said.\nThe CBN governor noted that one of the vital lessons learned from the COVID-19 outbreak was the need to make conscious measures to diversify Nigeria’s economic base.\nEmefiele also said that all necessary approvals had been obtained for the Infrastructure Corporation to begin operations in early 2022"
  },
  {
    "headline": "Oyetola, Osun speaker mourn Obi, ex-military administrator",
    "summarized_story": "Adebayo ObajemuOsun State governor Adegboyega Oyetola on Sunday mourned the death of a former Military Administrator in the state, Anthony Obi, saying his death was painful.\nThe ex military administrator passed away on January 1.\nMr Oyetola, in a statement signed by his media aide, Ismail Omipidan, on Sunday in Osogbo, expressed sadness at the death of Mr. Obi and sent his condolences to his family.\nHe said that the late Mr Obi was one of the leaders, who laid the foundation of the state.\nSimilarly, Speaker of Osun House of Assembly, Timothy Owoeye, in his condolence message, said the late Mr Obi would be greatly missed."
  },
  {
    "headline": "2023: Gov Ikpeazu endorses Anyim Pius Anyim for President",
    "summarized_story": "Abia State governor, Dr. Okezie Ikpeazu has endorsed the presidential aspiration of former president of the senate, Anyim Pius Anyim ahead of the 2023 general election, noting that he is the ideal candidate for Nigerian president of Igbo extraction.\nThe governor stated this on Sunday at his country home in Umuobiakwa, Obingwa Local Government Area of the state, when he received Anyim who visited him.\nHe described Anyim as “a man whose public service credentials and experience are good enough for the Presidency of Nigeria”.\nThe Abia governor who joins other stakeholders of the Southeast to endorse Anyim, assured the former secretary to the government of the federation of his support.\nHe noted that what matters now is “just for the Igbo to be given a chance to produce the next Nigerian President”."
  },
  {
    "headline": "2023: Group Condemns Campaign Of Calumny Against Kogi Gov",
    "summarized_story": "A political support group under the auspices of ‘Got Your Back Nigeria’, rooting for the 2023 presidential aspiration of the Kogi State governor, Yahaya Bello, has said that the governor is qualified and ready to run the presidential race.\nThe group also called out politicians whose agenda, it said, was purely to tarnish the image of Governor Bello because of his presidential ambition, to stop such campaign of calumny.\nThe national coordinator of the group,Prof Chris Mustapha Nwaokobia Jnr, in a press statement on Monday, expressed displeasure over what he called campaign of lies already flying against the Kogi governor.\nSo interesting they have made the phenomenal history maker called GYB, their politics.\n“Only Governor Yahaya Bello has clearly said that when he becomes President he will improve on the profound legacies of the incumbent President."
  },
  {
    "headline": "2023: Chart A Course For APC, Obahiagbon Tells Buhari, CECPC",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) and former Member, House of Representatives, Hon.\nPatrick Obahiagbon, has advised President Muhammadu Buhari and the party’s Caretaker and Extraordinary Convention Planning Committee (CECPC), to chart a pathway for the party ahead of the 2023 general election.\nObahiagbon gave the charge Monday in Abuja, in a letter of commendation to the chairman of CECPC and Yobe State governor, Hon.\nThe former lawmaker further cautioned that personal and selfish interests must not override the interest of the party.\n“The party interest is more paramount than parochial and self centered agitations from a microscopic few,” he said."
  },
  {
    "headline": "Group Chides FCT NUJ Over Journalist Arrest Allegation Against Masari",
    "summarized_story": "A community-based organisation (CBO), Grassroots Development Initiative (GDI) has berated the Nigeria Union of Journalists (NUJ), FCT Abuja Council, for wrongly accusing the Katsina State governor, Aminu Bello Masari, of masterminding the arrest of an Abuja-based journalist, Omonu Nelson.\nADVERTISEMENTMeanwhile, the FCT NUJ had since apologised to Governor Masari after realising that it was misled and that the governor was not responsible for Omonu’s arrest.\nBut GDI said the NUJ ought to know that such unfounded allegation was capable of portraying Governor Masari in bad light and as well pitching journalists in the country against him.\n“The apology not withstanding, the Abuja NUJ failed to do the right thing, that is due diligence before making the allegation against His Excellency, Governor Aminu Bello Masari of Katsina State.\nThis is unfair to Governor Aminu Bello Masari and peace-loving people of Katsina State,” Kemi said."
  },
  {
    "headline": "Group Chides FCT NUJ Over Journalist Arrest Allegation Against Masari",
    "summarized_story": "A community-based organisation (CBO), Grassroots Development Initiative (GDI) has berated the Nigeria Union of Journalists (NUJ), FCT Abuja Council, for wrongly accusing the Katsina State governor, Aminu Bello Masari, of masterminding the arrest of an Abuja-based journalist, Omonu Nelson.\nADVERTISEMENTMeanwhile, the FCT NUJ had since apologised to Governor Masari after realising that it was misled and that the governor was not responsible for Omonu’s arrest.\nBut GDI said the NUJ ought to know that such unfounded allegation was capable of portraying Governor Masari in bad light and as well pitching journalists in the country against him.\n“The apology not withstanding, the Abuja NUJ failed to do the right thing, that is due diligence before making the allegation against His Excellency, Governor Aminu Bello Masari of Katsina State.\nThis is unfair to Governor Aminu Bello Masari and peace-loving people of Katsina State,” Kemi said."
  },
  {
    "headline": "Nigeria Envoy To Sierra Leone Turbanned In Nasarawa",
    "summarized_story": "Paramount ruler of Doma and the Andoma of Doma in Nasarawa State, Alhaji Ahmadu Aliyi Ogah, has described Nigeria’s High Commissioner to Sierra Leone Henry Omaku as an outstanding son of the area and a true ambassador of Doma, the state and Nigeria.\nThe monarch spoke at the turbanning of Omaku as the Adagba Gi DomHe charged indigenes of Doma in prominent positions to emulate Omaku by supporting the community’s development.\nHe said Omaku apart from holding sensitive positions, has travelled widely and earned the respect of his people.\nThe state governor, Engineer Abdullahi Sule.\nin his speech, praised the envoy for being a true representative of the stateThe deputy governor, Dr Emmanuel Akabe, who represented the governor at the event, appealed to the people of Nasarawa State to support the administration of Governor Sule"
  },
  {
    "headline": "Panic as suspected herdsmen in military uniform sack Edo community",
    "summarized_story": "dSuspected Fulani herdsman, armed and dressed in military uniform, on Sunday reportedly invaded a farming community, 2nd Abumere Ojigbelu Camp in the Ovia Northeast Local Government Area of Edo State.\nOne of the victims, Mattu Alli, from Taraba State narrated his ordeal: “I lack words to explain what I witness in our community.\n“One of the Fulani herdsmen pointed a gun at me and said they were for peace.\nIf you people touch our cows we will kill everybody in this village.’ For us to be safe, we ran to the next community.\nWe later discovered that Fulani Herdsmen had taken over our community with sophisticated AK 47 and threatened to kill us if we didn’t cooperate with them."
  },
  {
    "headline": "Panic as suspected herdsmen in military uniform sack Edo community",
    "summarized_story": "dSuspected Fulani herdsman, armed and dressed in military uniform, on Sunday reportedly invaded a farming community, 2nd Abumere Ojigbelu Camp in the Ovia Northeast Local Government Area of Edo State.\nOne of the victims, Mattu Alli, from Taraba State narrated his ordeal: “I lack words to explain what I witness in our community.\n“One of the Fulani herdsmen pointed a gun at me and said they were for peace.\nIf you people touch our cows we will kill everybody in this village.’ For us to be safe, we ran to the next community.\nWe later discovered that Fulani Herdsmen had taken over our community with sophisticated AK 47 and threatened to kill us if we didn’t cooperate with them."
  },
  {
    "headline": "Supreme Council for Shari’ah names Sheikh AbdurRashid Hadiyatullah as new leader",
    "summarized_story": "By TANKO ALIThe Supreme Council for Shari’ah in Nigeria (SCSN) has ratified the appointment of Sheikh AbdurRashid Hadiyatullah as the new President of the council in line with SCSN’s Constitution following the death of its leader Dr. Ibrahim Datti Ahmad.\nUntil his appointment, the new President was the Vice President of the Council where he worked harmoniously and conscientiously with the late President.\nThe statement reads: “All praises and adorations are due to Allah (SWT), the most Beneficent, and the most Merciful.\nMay Allah SWT forgive his shortcomings and grant him Aljannatul Firdaus.\n“As we grieve over this great loss, in total submission to Allah and in line with the Constitution of the Council, Sheikh AbdurRashid Hadiyatullah, who was the Vice President of the Council, is now the new President of Supreme Council for Shari’ah in Nigeria."
  },
  {
    "headline": "Supreme Council for Shari’ah names Sheikh AbdurRashid Hadiyatullah as new leader",
    "summarized_story": "By TANKO ALIThe Supreme Council for Shari’ah in Nigeria (SCSN) has ratified the appointment of Sheikh AbdurRashid Hadiyatullah as the new President of the council in line with SCSN’s Constitution following the death of its leader Dr. Ibrahim Datti Ahmad.\nUntil his appointment, the new President was the Vice President of the Council where he worked harmoniously and conscientiously with the late President.\nThe statement reads: “All praises and adorations are due to Allah (SWT), the most Beneficent, and the most Merciful.\nMay Allah SWT forgive his shortcomings and grant him Aljannatul Firdaus.\n“As we grieve over this great loss, in total submission to Allah and in line with the Constitution of the Council, Sheikh AbdurRashid Hadiyatullah, who was the Vice President of the Council, is now the new President of Supreme Council for Shari’ah in Nigeria."
  },
  {
    "headline": "4 killed by COVID-19 in Abuja since 1 January",
    "summarized_story": "Four people have died of COVID-19 in Abuja since the beginning of 2022, the Nigeria Centre for Disease Control announced on Monday night.\nThe NCDC also announced 670 new cases of COVID-19, with Lagos reporting 277 cases, the highest.\nKaduna reported 199 cases and Abuja 120.\nAccording to the NCDC, Kaduna recorded additional 65 cases on 20 December, 70 cases on 22 December and 45 cases on 23 December.\nBreakdown of COVID-19 cases on 3 January:Lagos-277Kaduna-199FCT-120Kwara-20Abia-14Rivers-11Gombe-9Katsina-9Bauchi-6Edo-3Cross River-2244,120 confirmed216,180 discharged3,045 deathsToday’s report includes:"
  },
  {
    "headline": "BDC agent Salisu arraigned for duping army officer N2.6m",
    "summarized_story": "By Paul IyoghojieA Bureau De Change (BDC) agent, Abubakar Salisu, 61, has been arraigned before a Lagos Magistrate’s Court for allegedly obtaining the sum of N2.600, 000 from an army officer (name withheld) under false pretence.\nPolice alleged that Salisu collected the money from the complainant on the pretext of selling dollars equivalent to him, but that after the defendant collected the money from the officer, he absconded with the money and switched off his phones.\nThe Police team, after several months of intelligence gathering tracked the defendant to a hideout in Lagos and arrested him.\nSalisu was charged before the Tinubu Magistrate’s Court, Lagos on a one count charge of obtaining money under false pretence and stealing.\nThe defendant pleaded not guilty to the charge and Magistrate, MRS K.K Awoyinka granted him N1, 000, 000 bail with two Surety in like sum."
  },
  {
    "headline": "Gunmen Kill APC Party Chieftain In Akwa Ibom On His Way Home From Crossover Service",
    "summarized_story": "Otu Inyang, a chieftain of the All Progressives Congress in Akwa Ibom State, was assassinated by gunmen suspected of being hired assassins.\nWhen he was quite close to his home, the late politician was ambushed by his killers, who fired six shots into his head.\nI knew Elder Otu Inyang very well, back in our days in ANPP 2000 – 2003 when he helped us build a formidable opposition party.\n“The command has received such report and it is unfortunate.\nSo, we are on top of the situation and I want to assure you that the culprits will not escape,” he said."
  },
  {
    "headline": "2023 Elections Under Threat If Buhari Fails To Address Insecurity In Remaining Months — Coalition Of Northern Groups",
    "summarized_story": "The CNG said, “In the North especially, government should, with the entire national resolve behind its efforts, work to achieve final disengagement, disarmament, demobilisation, reintegration and reconstruction within the next few months.\nUnless this is done as quickly as possible, the 2023 elections would be greatly threatened and that would in turn affect the nation’s democratic progress and set the country back several decades.\n“No nation can aspire to greatness or seek to remain secure and safe when its youth and the productive segments of society are left to indulge in self-destructive practices like drug and substance abuse.\n“Failure to do so will indubitably mean that every effort made in isolation will defeat all the endeavours and render the task of ending the crisis the more difficult and futile.\n“Every one of us must therefore become a stakeholder and a committed actor in this struggle to free our society and our country of this debilitating problem.”"
  },
  {
    "headline": "BREAKING: MKO Abiola Challenger, Bashir Tofa Is Dead",
    "summarized_story": "The Presidential Candidate of the defunct National Republican Convention (NRC), Alhaji Bashir Othman Tofa is dead.\nTofa was MKO Abiola’s major challenger in the controversial June 12, 1993, presidential election, annulled by the military government of General Ibrahim Babangida.\nAccording to family sources, he died in the early hours of Monday after an illness.\nConfirming his death, one of the deceased’s relations, Alhaji Muhammad, said “Alhaji Bashir tofa died after being admitted in hospital for sometime.”"
  },
  {
    "headline": "Olubadan Stool: Ex-Oyo Senator, Lekan Balogun To Succeed Oba Adetunji",
    "summarized_story": "According to the DAILY POST, a former Oyo State senator, High Chief Mashood Olalekan Balogun, would succeed the immediate past Olubadan of Ibadan land, Oba Saliu Akanmu Adetunji.\nThe departed monarch, Oba Adetunji of the Balogun line, was the Balogun of Ibadan territory till his installation.\nAccording to our source, ascension to the Olubadan stool begins with installation from Mogaji and continues with promotion to either Ajia Balogun of Ibadan land or Ajia Olubadan of Ibadan territory.\nAccording to DAILY POST, he will succeed the monarch in accordance with Ibadan tradition.\nHigh Chief Mashood Olalekan Balogun – Otun OlubadanHigh Chief Akinloye Owolabi Olakunlehin – Balogun of IbadanlandHigh Chief Tajudeen Abimbola Ajibola – Otun Balogun of IbadanlandHigh Chief Senator Rashidi Adewolu Ladoja – Osi OlubadanHigh Chief Eddy Oyewole – Asipa OlubadanHigh Chief Lateef Gbadamosi Adebimpe – Osi BalogunHigh Chief Abiodun Kola-Daisi – Eekerin OlubadanHigh Chief Salaudeen Hamidu Ajibade – Eekarun Olubadan"
  },
  {
    "headline": "Presidential reservations on NASS 2022 Budget tinkering",
    "summarized_story": "While signing into law, the N17.127trillion 2022 budget on Friday last week, President Muhammadu Buhari expressed some reservations bordering on removal of some of the original proposals and insertions of new ones.\nHe said: “It is in this regard that I must express my reservations about many of the changes that the National Assembly has made to the 2022 Executive Budget proposal.\n‘‘Provisions made for as many as 10,733 projects were reduced while 6,576 new projects were introduced into the budget by the National Assembly.\n‘‘I signed the 2022 Appropriation Bill into law to enable its implementation to commence on 1st January 2022.\nBut the Presidency in a statement on Sunday night, declared that observations or reservations expressed by President Buhari on changes made on the 2022 budget by the National Assembly will not in anyway affect their harmonious working relationship."
  },
  {
    "headline": "NPower batch C employment: FG begins payment",
    "summarized_story": "Npower management has begun the process of paying stipends for the month of October 2021.\nNpower official in Kogi state, has disclosed that on or before January 8, 2022, all Npower Batch C1 beneficiaries will receive their October stipend.\nAccording to the source, who spoke on the condition of anonymity, disclosed that payment for October and November stipend process began on the 31st of December, 2021.\n“November payment process was removed a few hours after it was initiated.\nHe further advised that those who are still having problems with their September payment should contact NASIMS management."
  },
  {
    "headline": "VIDEO: Nollywood veteran actor, Clem Ohamaeze, breaks silence after successful spinal cord surgery",
    "summarized_story": "Popular Nollywood actor, Clem Ohamaeze, has spoken for the first after his successful spinal cord surgery.\nIn a viral video, the 56 years old is seen undergoing a recovery process.\nThe actor who cried out some months ago got financial help from Prophet Jeremiah Fufeyin which enabled him to go for surgery.\nWith the successful surgery, he can now walk well and take more roles in the Nollywood industry.\nHe thanked Nigerians for coming to his aid."
  },
  {
    "headline": "Name And Prosecute Terrorism Financiers, Ndume Tells FG",
    "summarized_story": "The Chairman, Senate Committee on Army, Senator Ali Ndume has asked the Federal Government to name and arrest those that finance terrorism in the country.\nSpeaking during an interview on Channels Television’s Political Paradigm, Ndume said he was prosecuted by the Federal Government for sponsoring Boko Haram.\n“Just because they were tracking my phone and they said a spokesman of Boko Haram called me, they went and arrested me.\nHe recalled that the then DSS spokesperson, Marilyn Ogar, briefed journalists where he was accused of sponsoring terrorism.\nThe senator also called on the government to rebuild the north-east that has been ravaged by the insurgency for over a decade."
  },
  {
    "headline": "Visitors To Aso Villa Will Be Tested For COVID-19 – Presidency",
    "summarized_story": "Shehu said every visitor including state governors are required to take the COVID-19 rapid test before entry into the presidential villa.\n“Yes, a new regime of COVID-19 regulation has been put in place for all visitors to the Villa, not for Governors alone.\nLast week, some aides of President Muhammadu Buhari were said to have tested positive for the virus.\nShehu announced last week that he tested positive for COVID and subsequently went into isolation.\nThe Minister of the Federal Capital Territory (FCT) Mohammed Bello in a statement personally signed by him on Friday announced that he has tested positive for COVID-19."
  },
  {
    "headline": "Apple Becomes First US Company To Reach $3trn Valuation",
    "summarized_story": "Apple became the first US company to hit $3 trillion in market value, briefly reaching the landmark on Monday in the latest demonstration of the tech industry’s pandemic surge.\nThe iPhone maker scaled the record level near 1845 GMT, reaching $182.88 a share before slipping back slightly.\nWhile the top tier of US stock markets are dominated by Silicon Valley companies, Microsoft is the only other American company worth more than $2 trillion.\nIn October, Apple reported net income of $20.5 billion on revenue of $83.4 billion, a record high for the quarter ending in September.\nNear 1930 GMT, Apple shares were up 2.4 percent to $181.91."
  },
  {
    "headline": "Bashir Tofa, Former Presidential Candidate, Dies At 74",
    "summarized_story": "The former presidential candidate of the defunct National Republican Convention (NRC), Bashir Tofa, is dead.\nTofa was the presidential candidate of the NRC in the June 12, 1993 election.\nDuring the election, Tofa squared off against MKO Abiola of the Social Democratic Party (SDP), the presumed winner of the election.\nAlthough the official results of the election were never released by Babangida’s government, Tofa was apparently defeated in the presidential election by his rival Moshood Abiola.\nIn 1993, when the Babangida administration introduced the Option A4 system, Tofa was elected the presidential candidate representing Kano."
  },
  {
    "headline": "Sokoto Accident: Four Killed As Mob Razes Customs Vehicles",
    "summarized_story": "No fewer than four persons have died in a road accident involving three commercial vehicles in Sokoto State.\nThis led to a protest by an angry mob that razed two vehicles belonging to the Nigeria Customs Service.\nThe mob blamed the fatal accident that claimed the lives of the four persons on the customs checkpoint at Asara Unit of Illela Command.\nThe drivers involved, according to sources, loaded their vehicles with contrabands such as foreign rice and vegetable oil.\nAccording to witnesses, it took the timely intervention of troops of the Nigerian Army to stop the mob from further attacking the customs facilities."
  },
  {
    "headline": "APC caretaker committee must ensure National Convention goes beyond just electing NWC",
    "summarized_story": "A chieftain of the All Progressives Congress and Director General Of the Progressives Governors Forum, Salihu Lukman, has appealed to the party’s Caretaker Extraordinary Convention Planning Committee, to ensure that the February 2022 Convention is not just about electing National Working Committee members.\nHe urged party leaders on recommendations from the Convention, which he says should guide the review process of the party’s manifesto and bring out some of the campaign agenda of the APC for the 2023 campaigns.\nSalihu Lukman says It is quite worrisome that speculations about the Convention are allowed to create strong doubts as to when the Convention will hold.\nThe major gap, however, is that no date or details of Committees, their membership and terms of reference, were given,a worrisome situation.\nGiven the roll out of political activities for the year, Mr Lukman advised the Caretaker Committee to set up relevant committee for the party’s national assembly, to rest speculations is some quarters that the convention will not hold in February."
  },
  {
    "headline": "Tinubu hails Prof. Bolaji Akinyemi at 80",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has poured encomiums on elder-statesman and former Foreign Affairs Minister, Prof. Bolaji Akinyemi, as he turns 80 on January 3, 2022.\nIn a statement by his Media Office signed by Mr. Tunde Rahman, Asiwaju, the former Lagos governor, said:“Warm congratulations to former Minister of Foreign Affairs, Prof. Bolaji Akinyemi, on attaining 80.\nErudite scholar, author, diplomat, pro-democracy activist and committed progressive, Prof. Akinyemi has done a lot for this country.\nEasily one of the best the country has produced in that office till date, his two years in office were significant as they represented some of the country’s best moments in international relations.\n“Rich in experience, wisdom and knowledge, Prof. Akinyemi is today an important elder-statesman."
  },
  {
    "headline": "Shekarau, Nanono mourn MKO Abiola's opponent Bashir Tofa",
    "summarized_story": "In this video, Senator Ibrahim Shekarau and former Minister of Agriculture, Nanono speak on the death of former Presidential candidate, Alhaji Bashir Tofa.\nMr Tofa, a former presidential candidate of the NRC in the 1993 Presidential Election, died Monday morning at the age of 76."
  },
  {
    "headline": "Buhari, Tinubu, others mourn late Olubadan, Saliu Adetunji",
    "summarized_story": "Tributes are pouring in for the late Olubadan of Ibadan, Oba Saliu Adetunji as President Muhammadu Buhari, Bola Ahmed Tinubu & others have sent their condolence messages.\nOba Adetunji died on Sunday at the University Teaching Hospital, Ibadan.\nHe was aged 93."
  },
  {
    "headline": "Trump, Ivanka, Don Jr Subpoenaed By New York Attorney General",
    "summarized_story": "New York’s attorney general has issued subpoenas to former President Donald Trump and his two eldest children in connection with an ongoing civil investigation into the family’s business practices, according to a court filing Monday.\nAttorney General Letitia James’ office said in the filing that it is seeking testimony and documents from Trump, Donald Trump Jr. and Ivanka Trump “in connection with an investigation into the valuation of properties owned or controlled” by Trump and his company, the Trump Organization.\nJames has been investigating the Trump Organization’s business practices since 2019, while Trump was still in office.\nLater that year, longtime Trump Organization chief financial officer Allen Weisselberg was charged with several crimes linked to tax fraud.\nIn the past, Trump has decried the investigation as part of a “witch hunt.”"
  },
  {
    "headline": "NFF President Amaju Pinnick Speaks on Super Eagles’ Propects at AFCON 2021",
    "summarized_story": "With the 33rd Africa Cup of Nations ki King off in Cameroon in less than a week, there have been concerns from Nigerians about the chances of the Super Eagles having a good outing at the competition, due to the recent change of coach and the absence of key players for different reasons.\nThree-time African champions, Nigeria, will confront seven-time and record winners Egypt, Sudan, and debutants Guinea Bissau in Garoua in the group stage.\nThe Eagles kick off their tournament with a clash against the Pharaohs on Tuesday, January 11, which many believe the outcome of the game will determine who tops the group at the end of the the first phase.\nNigeria Football President Amaju Pinnick was a guest on the Morning Show to discuss the chances of the Super Eagles at the upcoming tournament.\nWatch this riveting interview for more…"
  },
  {
    "headline": "Rivers Governor Wike Bans Street Prostitution and Nightclubs In Port Harcourt – Trending With Ojy Okpe",
    "summarized_story": "Hakeem Odumosu, the Lagos State Commissioner of Police, came under fire on social media over the weekend, after he ordered the arrest of security guards at a private estate in Lagos, who allegedly delayed and denied him entrance into the estate.\nHe continued that after about 30 minutes of deliberate humiliation by the security guards, the CP ordered their arrest.\nThe statement went further to warn private security guards against the flagrant disregard for police officers.\nMeanwhile, reactions are trailing a declaration made by the Governor of Rivers State Nysome Wike who over the weekend placed an immediate ban on street prostitution and night club activities in many parts of Port Harcourt.\nThe governor made the declaration during a New Year broadcast, a move he says is to curtail open display and solicitation of sexual services, drug abuse and public intoxication."
  },
  {
    "headline": "Pinnick: Incoming Super Eagles Manager Jose Pesairo Will Reside in Nigeria",
    "summarized_story": ""
  },
  {
    "headline": "Ex-Super Eagles Manager Rohr Will Be Paid in Full on Tuesday, NFF Boss Pinnick Says",
    "summarized_story": ""
  }
]