[
  {
    "headline": "Buhari appoints Babagana Kingibe special envoy on Chad, Lake Chad basin",
    "summarized_story": "), has approved the appointment of Ambassador Babagana Kingibe as his Special Envoy with Cabinet Rank Status, to Chad and the Lake Chad Basin Region.\nThis was contained in a statement by Secretary to the Government of the Federation, Boss Mustapha, on Monday.\nThe statement read, “This appointment of a Special Envoy by the President is also in consonance with the resolution of the Extraordinary Summit of Heads of State and Government of the Lake Chad Basin Commission Member Countries, on the situation in Chad on the 25th of May, 2021.\n“President Buhari has by this appointment demonstrated the determination of Nigeria to lead regional security efforts that will stabilize the Lake Chad Basin Region, bring peace to Chad and ultimately eliminate the Boko Haram Insurgency in the North East zone of Nigeria.\nHe had also participated in previous Nigeria-led Chadian reconciliation talks (Kano 1 & II as well as Lagos 1 & II).”"
  },
  {
    "headline": "De-proscribing IPOB as terror group will pave way for dialogue -Ex-DSS director, Ejiofor",
    "summarized_story": "People are afraid of both the military and IPOB, they are afraid of the consequences of coming out.\nThere could be a clash between IPOB and security forces and the people might be caught in a crossfire.\nThe government should look for a political solution by de-proscribing IPOB and engaging them in dialogue.\nThis is a political problem that requires a political solution.\n), had in September 2017 outlawed IPOB and declared that the activities of the secessionist group constituted an act of terrorism and illegality."
  },
  {
    "headline": "No increase in terminal charges yet ― Shippers’ Council",
    "summarized_story": "Kindly Share This Story:Hassan Bello, the Executive Secretary, Nigerian Shippers’ Council (NSC) on Monday said that the council has not increased its terminal charges.\nAccording to him, no one can increase or review charges without the approval of the council.\n“We are not adverse to increase charges and there has been no increase in charges for like 10 years now.\n“Even shippers will not mind an increase as long as they get their cargo out of the terminal in a very good time and at a reasonable cost,” Bello said.\nBello said that presently there was a form of competition with terminal operators as regards abiding to the specifications of the NSC such that a terminal that had low percentage in automation after three months came up."
  },
  {
    "headline": "Wake up, Nigeria on precipice, Afenifere, Ohaneze leaders warn Buhari",
    "summarized_story": "Kindly Share This Story:…insist no brand new Constitution, no election in 2023….Northern region not afraid of disintegration, NCF leader fires backBy Ikechukwu Nnochiri & Victoria OjemeLeaders of major ethnic nationalities in Nigeria, on Monday, converged in Abuja, where they urged President Muhammadu Buhari to wake up to his responsibilities, warning that the nation is currently on the precipice.\nWhile Pan Yoruba socio-political group, Afenifere, through its National Leader, Chief Ayo Adebanjo, called for total overhaul of the present 1999 constitution which it said was “tilted in favour of the North against the South”, on its part, Ohaneze Ndigbo, through its President General, Prof. George Obiozor, said there was need to re-negotiate Nigeria’s unity.\nREAD ALSO:The two regional groups tabled their grievances and also proffered solutions to some of the existential problems facing the nation, at an event tagged “Nigeria’s 2023 Presidential Transition Inter-Ethnic Peace Dialogue”, which was organised by Youths Off The Streets Initiative, YOTSI.\nIn his presentation at the event, Afenifere leader, Chief Adebanjo, decried that the country is presently faced with critical threats of imminent second civil war and forceful political break-up.\nDetails later:Vanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "Kaduna state govt to certify Almajiri teachers",
    "summarized_story": "Kindly Share This Story:Kaduna State Government on Monday, inaugurated a committee to develop a curriculum for the certification of Almajiri school teachers in the state.\nMuhammad explained that the step was part of efforts to reform the Almajiri and Tsangaya system of education for full integration into the mainstream western education system.\n“The committee will also develop a training and retraining framework of all Almajiri teachers in the state.\nThe commissioner said that the committee had members from the Ministry of Education, Kaduna State University, Kaduna State Universal Basic Education Board, Bureau of Interfaith, and Ministry of Human Services and Social Development.\nOthers, he said include, Sustainable Education Foundation for African Development, AMA Foundation, Kaduna State Schools Quality Assurance Authority, Office of the Head of Service and Tsangaya Schools Association of Nigeria."
  },
  {
    "headline": "APC Lagos LG primaries: Tension over delay in release of results",
    "summarized_story": "The development has given rise to rumours with conflicting results of the exercise claimed to have emanated from APC Lagos Secretariat.\nLoyalists and party faithful loyal to different aspirants who have continued to throng the party Secretariat in Acme, Ikeja, were prevented from gaining entrance into the premises by stern, armed security personnel.\nIt was, however, gathered that the results in circulation were not genuine and the public should disregard it.\nResults were also said to have been cancelled by APC, where violence were recorded.\nSome of the party supporters who stormed the APC Secretariat on Monday, lamented bitterly, what they described as “poor organisation” which largely encouraged electoral irregularities during the exercise."
  },
  {
    "headline": "Gulak didn't deserve to die the way he did, Uzodinma laments",
    "summarized_story": "Kindly Share This Story:By Chidi NkwoparaGovernor Hope Uzodimma of Imo State has lamented over what he called “the thoughtless and reckless” murder of Alhaji Ahmed Gulak.\nUzodimma also sympathized with the families of those who lost their lives, through stray bullets during this period.\nBut the brutal and callous assassination of Alhaji Ahmed Gulak, Sunday, May 30, 2021, on his way to the Sam Mbakwe Cargo Airport, is painful because he did not deserve to die that way.\nI was shocked to my marrows when the sad news of his callous murder was broken to me.\n“Alhaji Ahmed Gulak was in Imo State, for a national assignment."
  },
  {
    "headline": "Biafra: Declare May 30 public holiday",
    "summarized_story": "The Ohanaeze Ndigbo Youth Council Worldwide has asked the Federal Government to recognize May 30 as a national public holiday.\nThe group made the call while reacting to the compliance level of the sit-at-home declared by the Indigenous People of Biafra, IPOB.\nDAILY POST had reported that the order witnessed the highest level of compliance ever.\nOkwu said “the Government has had several opportunities to win back the confidence of Ndigbo but it threw it away.\n“However, we call on the Buhari Government to declare May 30 as a national public holiday in honour of over 5 million Biafrans killed during the civil war."
  },
  {
    "headline": "JUSUN accuses FG, govs of conspiracy against judiciary autonomy",
    "summarized_story": "The hope of early return to work by judiciary workers in the country appears dimmed as the Judiciary Staff Union, JUSUN, accused both the 36 governors and the Attorney General of the Federation of conspiring against the autonomy being sought for the judiciary at the state level.\n“”The Accountant General of the Federation has explained to us that he would deduct money meant for the state judiciary from the federation account if Malami asked him to do so.\n“We don’t just know the politics the federal government and the state governments are playing with the Judiciary.\n“If they don’t want the judiciary as part of the government, let them come out plainly and say so,” the JUSUN spokesman said.\nThe JUSUN urged the Accountant General of the Federation to deduct funds due state judiciary from the federation account and that if the governors feel aggrieved, they should go to court."
  },
  {
    "headline": "TETFund raises alarm over attempts to defraud 2 millions students",
    "summarized_story": "The Tertiary Education Trust Fund, TETFund, has raised the alarm over attempts by fraudsters to defraud unsuspecting Nigerian students by luring them to register for a fake grant purportedly given by the fund.\nOniyangi further explained that the fraudsters claim that the grant is part of TETFund 2021 budget to support the 2 million Nigerian students, urging students to register before registration closes on the 6th of June 2021.\nThe TETFund boss dissociated the organisation from the claims.\nHe warned that such a move was another attempt by fraudsters to deceive students and Nigerians.\nThe TETFund Director also cautioned Nigerians to be wary of the fraudulent registration website with the address https://bit.ly/TETFUND-GRANTS."
  },
  {
    "headline": "Ortom accuses ACF’s spokesman, Yawe of inciting hatred, crisis in Benue",
    "summarized_story": "Governor Samuel Ortom of Benue State has accused Emmanuel Yawe, spokesman of the Arewa Consultative Forum, ACF of hiding behind the forum to stir crisis and hatred in the state.\n“He was on a shameful mission; an unsavory role to please enemies of Benue State and save his pay cheque.\nHe urged ACF to caution its spokesman against issuing statements that can worsen the current crisis in the country.\n“We wish to urge ACF to call Emmanuel Yawe to order.\nHe is one of the crisis merchants who want the disintegration of this country and are doing everything to stir hatred among Nigerians”."
  },
  {
    "headline": "‘I begged them to take me, our daughter in his place but they refused’ – Wife of kidnaped Taraba lecturer",
    "summarized_story": "Samira Umar, wife of the kidnapped lecturer of the Taraba State University, Buba Umar, has revealed how she pleaded with the abductors to kidnap her and her little child in place of her husband but was turned down.\nShe added that the family were yet to know the whereabouts of their breadwinner as the abductors are yet to make any contacts.\nReacting to the development, the Vice-Chancellor of the university, Professor Vincent Ado Tenebe, wondered how the abductors succeeded despite the massive presence of security operatives in the quarters.\nHe said, “This is a very sad story.\nReiterating the determinations of the leadership of the University not to be deterred, plans to go back to the drawing board and put in place more security apparatus to halt future occurrences, he said have become necessary."
  },
  {
    "headline": "Simi, Adekunle Gold release new song for daughter’s first birthday",
    "summarized_story": "By Ekaete BasseyMusic couple Simi and Adekunle Gold has released a new song to mark their daughter, Adejare Kosoko’s first birthday.\nThe sensational musical couple went the extra mile for their adorable daughter by releasing a new single titled “Happy birthday” to celebrate her first birthday.\nADVERTISEMENTSimi and Adekunle Gold shared this new information via their social media pages.\nSimi shared screenshots from the song and a photo with Deja and captioned post: “Swipe For a Surprise.\nOn his part, Adekunle Gold shared a screenshot of the song and wrote: “I’ve done the walk so you can fly” ‘Happy Birthday’ out now!”The song also features Simi and Adekunle Gold’s one-year-old daughter, Deja."
  },
  {
    "headline": "90% of trucks in Nigeria over 30 yrs – FRSC",
    "summarized_story": "Agency Reporte rThe Federal Road Safety Corps (FRSC) says 90 per cent of trucks in the country are over 30 years.\nThe FRSC Corps Marshal, Dr Boboye Oyeyemi, disclosed this in an interactive session between the Nigerian Shippers’ Council (NSC), the FRSC and Haulage operators on Monday in Lagos.\nAccording to him, the NSC conceptualised the development of the Truck Transit Park, now VTA, to provide convenient rest areas for truckers.\nHe said the MoU was also to generate a database on trucks, training, VTA implementation, public education and enlightenment and others.\nSome of the stakeholders that participated in the event include the Association of Maritime Transport Owners, the Council of Maritime Truck Unions and Associations, the Road Transport Employers Association of Nigeria, and the Nigeria Association of Road Transport Owners."
  },
  {
    "headline": "Lottery operators clash as Senate summons Akume",
    "summarized_story": "By Sanni Onogu, AbujaThe Senate has summoned Minister of Special Duties, Senator George Akume, over the alleged failure of lottery operators in the country to remit revenues to the Federation Account.\nChairman, Senate Committee on Sports, Senator Obinna Ogba, stated this after his panel met with the lottery operators and the regulatory agencies handling their affairs.\nHe claimed the NLRC has failed to implement the terms of the agreement to set up the Ghana Games Lottery Commission in Nigeria so that his firm would be earning its due commission.\nWhat we discovered is that the country is not getting much revenue from the lottery operators.\n“About the Ghana Games, some operators are scared that the operators should not play the role of a regulator."
  },
  {
    "headline": "BREAKING: Gunmen raze another police station in Imo",
    "summarized_story": "By Chris Njoku, OwerriGunmen have razed Amandugba Divisional Police Headquarters in Isu Local Government Area of Imo State.\nIt was the fourth Divisional Police Headquarters razed in less than one week in Imo State.\nThe Nation learnt the attackers threw inflammable substances at the police facility, which triggered the fire.\nADVERTISEMENTA villager, who did not want his name mentioned, said:” Isu Divisional Police Headquarters is on fire now.\nThe attackers threw explosives objects and it caught fire immediately.”Imo Police spokesperson, Bala Elkana, said he was going to get back when contacted but was yet to do so as at the time of filing this report."
  },
  {
    "headline": "BREAKING: Traders injure as explosion rocks market in Rivers",
    "summarized_story": "From TONY JOHN, Port HarcourtSome traders at the Mile 3 Market in Diobu axis of Port Harcourt, Rivers State, yesterday, sustained injuries following an explosion of a substance suspected to be dynamite that occurred in the place.\nDaily Sun gathered that the explosion occurred in the morning at the Mile 3 Motor Park, which has been converted to a trading point.\nEyewitnesses said some traders and passengers sustained injuries as they scampered for safety following the explosion.\nOmoni said the Explosive Ordinance Disposal (EOD) was immediately despatched to the scene to sweep and render the entire market safe.\nSimilarly, major business areas like Okija and Azikiwe Streets in Port Harcourt City, were partially open."
  },
  {
    "headline": "Breaking: Gunmen kill Imo Immigration command’s provost",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen continued their nefarious activities in Imo State as they killed the provost of the State command provost of the Nigerian Immigration Service,(NIS) Okiemute Mrere.\nAccording to the source, Mrere, was riding a Hilux van belonging to NIS when he was allegedly ambushed, and shot to death.\nBut his official Hilux van he was riding in before his death was riddled with bullet the source added.\n“The provost of Nigerian Immigration service, Imo state command, Okiemute Mrere, has been assassinated.\nHe was riding in his official Hilux van when he was attacked, they shot him several times judging from the bullet holes on his official vehicle."
  },
  {
    "headline": "Michael Okpara centenary celebration holds in Abuja June 3",
    "summarized_story": "The first posthumous and commemorative centenary anniversary in honour of Dr. Michael Iheonukara Okpara, first republic politician, nationalist and former premier of Eastern Region of Nigeria (1959 -1966) holds on Thursday, June 3 at Sheraton Hotels and Towers, Abuja.\nThe event will also feature the presentation of Okpara Leadership Prize to a number of personalities, two universities and their Vice Chancellors, namely Michael Okpara University of Agriculture, Umudike (MOUAU) in Abia State and the University of Nigeria, Nsukka (UNN).\nThe Centenary Organising Committee proffered reasons for presenting the Okpara Leadership Prize to the personalities.\nThe amiable Premier and nationalist, Dr. Okpara would have been 100 years old having been born on 25 December 1920.\nDr. Okpara was former member of Eastern Nigeria House of Assembly on the ticket of the National Council of Nigeria and the Cameroons (NCNC)."
  },
  {
    "headline": "Sit-at-home: Tension, fear grip South East",
    "summarized_story": "Similarly, MASSOB leader, Uchenna Madu, yesterday, warned the Nigeria security agencies that their threats would not hold waters.\nThis came as the various police commands threatened to crush any form of procession or gathering relating to Biafra today.\nAttendance in many churches was scanty due to fear, as many people assumed the sit-at-home started yesterday as it used to.\nSimilarly, a wave of uncertainty enveloped Enugu State, yesterday, ostensibly because of recent security threats.\nHis warning is coming on the heels of the sit-at-home order for today by members of the Indigenous People of Biafra (IPOB)."
  },
  {
    "headline": "COVID-19: Erring passengers risk jail or N500,000 fine",
    "summarized_story": "By Doris ObinnaThe Lagos State Government has said that new Coronavirus Act of 2021 empowers Mr.\nGovernor to sanction erring individuals with fines of up to N500,000 and/or imprisonment of up to five years.\nIn a statement, yesterday, the commissioner said the state is going to follow to the letter laid sanctions by Lagos State House of Assembly, which is also implemented by the Attorney General of the state.\nWe have isolated 433 passengers in our various accredited hotels and facilities; 262 are in Isolation and 154 passengers have been discharged with a negative COVID-19 test.\n“All absconders will also face the penalties of the coronavirus pandemic Law 2021 of Lagos State, including varying lengths of prison time up to one year and fines of up to N500,000."
  },
  {
    "headline": "FCT Police Debunk Sowore Shooting Report",
    "summarized_story": "Olawale Ajimotokan in AbujaThe FCT Police have debunked a video that has gone viral on social media that activist, Omoyele Sowore, was shot by a female Assistant Commissioner of Police Monday morning at the Unity Fountain.\nThe Police Public Relations Officer,ASP Yusuf Mariam, issued the rebuttal in a statement on behalf of the Commissioner of Police, FCT Police Command.\nShe said that contrary to the speculation, police operatives professionally restored calm at the Unity Fountain following attempts by a group of protesters to incite public disturbance.\nASP Yusuf said the protesters who went on ramapage were resisted by police operatives in order to prevent them from causing a breakdown of law and order, adding there was no record of any shooting incident as at the time of this release.\nThe Command enjoins residents to remain calm and law-abiding while reaffirming its commitment towards the protection of lives and property within the FCT."
  },
  {
    "headline": "Bandits Kill 15 in Niger Community",
    "summarized_story": "By Laleye Dipo in MinnaNo fewer than 15 villagers are reported to have been killed in Beri town in Bobi district of Mariga local government of Niger state on Monday morning.\nTHISDAY was told that the men of the local vigilant group were able to neutralise five of the bandits.\nAlso on Monday, some bandits raided Ungwan Bako in the Kotonkoro district of Mariga local government abducting many people mostly women and children.\nThe Niger State Emergency Management Agency NSEMA confirmed the incidents but did not give details.\nPolice Public Relations Officer Niger State Police Command Public Relations Officer, DSP Wasiu Abiodun, did not respond to calls made to his cell phones for comments on the development."
  },
  {
    "headline": "Revenue Agencies Remit N1.5tn to Federation Account in Q1",
    "summarized_story": "By Ndubuisi Francis and James EmejoThe Revenue Mobilisation Allocation and Fiscal Commission (RMAFC) has disclosed that the revenue generating agencies in the country made a total remittance of over N1.5 trillion (N1,538,021,801,518.37) into the Federation Account during the first quarter of 2021.\nThe Chairman of the Commission, Elias Mbam, said this while receiving a revenue performance report from the Post-Mortem Sub Committee of the Federation Account Allocation Committee (FAAC) in Abuja.\nThe sum of N496,390,010,655.56 was also remitted into the Federation Account as Value Added Tax (VAT) in the first quarter of 2021.\nThis, according to Mbam, surpassed the targeted tax revenue by N36,803,760.80, representing 108.01 per cent for the period under review.\nMbam stated that RMAFC was committed in its effort to increasing revenue generation into the Federation Account and equitable distribution of the accrued revenues to the three tiers of government."
  },
  {
    "headline": "Rescue our Children from Kidnappers, Father of Abducted Girls Appeals to FG, Niger",
    "summarized_story": "Female school teacher among those kidnappedBy Laleye DipoThe father of five of the abducted girls in Salihu Tanko Islamiyya School in Tegina Rafi Local Government Area of Niger State, Ali Mohammed, a tipper driver, has appealed to the state and federal governments to rescue the pupils from the kidnappers.\nSpeaking in an interview with THISDAY Monday, Mohammed said no fewer than 25 of the bandits stormed the school and took away the pupils to an unknown destination.\nAccording to him, the school had a population of over 200 pupils with more than half of the population being girls, adding that most of the kidnapped pupils are girls.\nMohammed wondered why policemen, whose station is located a few meters from the school, could not rescue the pupils from the kidnappers.\nIn his statement, Musa described the incident “as callous and unfortunate” before asking the federal government to strengthen security in Niger State, particularly in areas where bandits have been terrorizing the people."
  },
  {
    "headline": "TETFund Raises Alarm over Fake Grant Meant to Defraud 2m Students",
    "summarized_story": "By Kuni TyessiThe Tertiary Education Trust Fund (TETFund) has raised the alarm over attempts by fraudsters to defraud unsuspecting Nigerian students by luring them to register for a fake grant purportedly given by the fund.\nOniyangi further explained that the fraudsters claim that the grant is part of TETFund’s 2021 budget to support the two million Nigerian students, urging them to register before registration closes on June 6, 2021.\nHe therefore dissociated the fund from the claims, stating that it is another attempt by the criminals to deceive Nigerian students and members of the public.\n“The Fund reiterates that student bursary has never been a part of its intervention activities and that the entire information is false and should be disregarded.\nThe TETFund director also urged students and members of the public to be wary of the fraudulent website where the fake registration activities are taking place, with the address https://bit.ly/TETFUND-GRANTS."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "EXCLUSIVE: Davido: 'No Money Osun State Can Make In 40 Years That My Dad Hasn't Made'",
    "summarized_story": "Nigerian singer David Adeleke, aka Davido, says there is no money Osun State can make in the next 40 years that his father, Adedeji Adeleke, has not already made as the 'omo baba olowo' crooner revealed why he stayed away from Nigeria for eight months.\nA similar controversial statement regarding the paltry financial capacity of Osun was made by the national leader of the All Progressives Congress, Bola Tinubu.\nAccording to him, he needed to protect his family and associates which he was why he left the country.\n“Yoruba culture when somebody holds an office and he passes on they either give the bride or the close relatives.\nThere’s no money Osun wants to make in the next 30 to 40 years that my father has not made."
  },
  {
    "headline": "EXCLUSIVE: Davido: 'No Money Osun State Can Make In 40 Years That My Dad Hasn't Made'",
    "summarized_story": "Nigerian singer David Adeleke, aka Davido, says there is no money Osun State can make in the next 40 years that his father, Adedeji Adeleke, has not already made as the 'omo baba olowo' crooner revealed why he stayed away from Nigeria for eight months.\nA similar controversial statement regarding the paltry financial capacity of Osun was made by the national leader of the All Progressives Congress, Bola Tinubu.\nAccording to him, he needed to protect his family and associates which he was why he left the country.\n“Yoruba culture when somebody holds an office and he passes on they either give the bride or the close relatives.\nThere’s no money Osun wants to make in the next 30 to 40 years that my father has not made."
  },
  {
    "headline": "Nigerian-American Artiste, Mezuo Composes For Netflix's Movie",
    "summarized_story": "Directed by the award-winning filmmaker Pascal Atuma, Mezuo’s music is expected to add elements from both the United States and Nigeria.\nWe’re as connected as ever to the Nigerian music industry from the United States as ever thanks to social media.\nThere are also more international collaborations across the board as a result of all of this.”He also expressed a belief that he will succeed in the Nigerian music industry.\nHe said, “Operating from North Hollywood but having my roots in Nigeria gives me unique leverage because I’m foreign, yet familiar in the Nigerian market.\nMoreover, I’ve personally made it a point to incorporate the Nigerian market in my career pursuits because I noticed that opportunity pretty early on."
  },
  {
    "headline": "Uzodimma: Gulak’s murder appears to be political assassination",
    "summarized_story": "Hope Uzodimma, governor of Imo state, says the killing of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, seems to be politically-motivated.\nAdvertisementGulak was murdered in Owerri, Imo capital, on Sunday while on his way to the airport.\n“Alhaji Ahmed Gulak was in Imo State for a national assignment.\nThat is exactly why his gruesome murder appears to be a clear case of political assassination.\n“Let me make it very clear that everything will be done by security agencies to find those who murdered Gulak and their sponsors."
  },
  {
    "headline": "Uzodimma: Gulak’s murder appears to be political assassination",
    "summarized_story": "Hope Uzodimma, governor of Imo state, says the killing of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, seems to be politically-motivated.\nAdvertisementGulak was murdered in Owerri, Imo capital, on Sunday while on his way to the airport.\n“Alhaji Ahmed Gulak was in Imo State for a national assignment.\nThat is exactly why his gruesome murder appears to be a clear case of political assassination.\n“Let me make it very clear that everything will be done by security agencies to find those who murdered Gulak and their sponsors."
  },
  {
    "headline": "Gulak was in Imo as part of constitution review committee, says son",
    "summarized_story": "Mohammed, son of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, says his father visited Imo as a member of the committee on constitutional review.\nAdvertisementGulak, a chieftain of the All Progressives Congress (APC), was killed on Sunday in Owerri, Imo state capital.\nAdvertisementThe deceased was the chairman of the APC committee that conducted the primaries for Imo governorship election in 2019.\nAdvertisement“Afterwards, everybody in the house began to cry.’’On what took Gulak to Imo, he noted that the deceased was part of the committee on ongoing constitutional review.\nHe was happy and told me ‘God bless you, my son’,” Mohammed said."
  },
  {
    "headline": "Gulak was in Imo as part of constitution review committee, says son",
    "summarized_story": "Mohammed, son of Ahmed Gulak, a former aide of ex-President Goodluck Jonathan, says his father visited Imo as a member of the committee on constitutional review.\nAdvertisementGulak, a chieftain of the All Progressives Congress (APC), was killed on Sunday in Owerri, Imo state capital.\nAdvertisementThe deceased was the chairman of the APC committee that conducted the primaries for Imo governorship election in 2019.\nAdvertisement“Afterwards, everybody in the house began to cry.’’On what took Gulak to Imo, he noted that the deceased was part of the committee on ongoing constitutional review.\nHe was happy and told me ‘God bless you, my son’,” Mohammed said."
  },
  {
    "headline": "Imo in 48 hours: Gulak killed, police stations, courts, INEC office razed",
    "summarized_story": "Forty-eight hours after, another police station was set on fire while two courts and a health centre were razed.\nThe 48-hour mayhem started on Saturday evening when the gunmen razed Attah divisional police headquarters after scaring residents away with sporadic gunshots.\nThe violence continued in Oguta LGA on Saturday night when hoodlums razed the Izombe police station.\nAdvertisementWhile Nigerians were still mourning Gulak, the Independent National Electoral Commission (INEC) announced that its office in Njaba LGA has been razed in yet another attack.\nINEC said although no life lost, electoral materials, office equipment and furniture were destroyed in the attack."
  },
  {
    "headline": "Almentor’s online learning platform for Africa and the Middle East gets $6.5m backing from Partech, Sawari and Sango Capital",
    "summarized_story": "Almentor, a video-based online learning platform for the Middle East and North Africa, has raised $6.5m in a Series B round led by Partech from its Africa Fund.\nHow Almentor worksFrom gamified mobile apps to websites that enable streaming, online learning comes in different varieties across the world.\nAlmentor can be accessed in multiple countries across Africa but the content is focused on North Africa and the Middle East.\nIn 2019, Almentor’s $4.5 million Series A was led by Sawari Ventures, an Egyptian firm that closed a $71 million fund in April.\nSawari also invested in this Series B round as Sango Capital, a firm based in South Africa."
  },
  {
    "headline": "Bezos Expeditions invests again as Chipper Cash raises $100 million in Series C round",
    "summarized_story": "Barely seven months after a $30 million funding round in which Jeff Bezos participated, Chipper Cash has raised $100 million in a Series C round.\nExisting Chipper Cash investors like Deciens Capital, Ribbit Capital, Bezos Expeditions and 500 Startups participated.\nChipper Cash enables individuals to transfer money at zero fees between African countries.\nSegunjogi’s comment suggests that Chipper Cash may also now be worth over $1bn, even if they have raised $80m less than the Nigerian fintech.\nLike Flutterwave, Chipper Cash is headquartered in San Francisco but has over 200 employees working out of Africa and serving African customers."
  },
  {
    "headline": "The Next Wave: Nigeria and other real-time payments leaders",
    "summarized_story": "Another space where Nigeria’s example may influence the global space is real-time payments, as we’ll see shortly after a message from our partners.\nIndia’s real-time payments revolution started in 2016 when the Unified Payments Interface (UPI) was launched.\nBut before all this, Nigeria made a similar historic move with NIBSS Instant Payments (NIP) in 2011.\nNIBSS (Nigeria Interbank Settlement Scheme, a company co-owned by banks in Nigeria) built E-bills Pay on the NIP platform to enable account-to-account payments.\nIt is already being called “NIBSS for fintechs.”The upshot: Nigeria does not have India or China’s population to top real-time payments lists."
  },
  {
    "headline": "2021 Oxford Africa Conference Innovation Fair Pitch competition: Winners announced!",
    "summarized_story": "The Oxford Africa Conference Innovation Fair took place on the 28th and 29th of May 2021 with a cohort of 11 highly innovative companies, based across five African countries.\nIn addition, each company received one-on-one mentorship from an industry leader in their field, which was enabled by the support of the TechCabal team.\nThe Fair ended with a highly competitive pitch competition judged by: Dr. Watu Wamae (PhD) – Research Engagement Manager at the Africa Oxford Initiative; Dr. Amy Kao (PhD) – Oxford Sciences Innovation Associate and Dr. Tinashe Chandauka – Oxford Sciences Innovation Associate.\nEmerging from the 11 finalists, the overall cash prize winners were: Maxi Mobility winning 5,000 GBP for first place, Hustlenomics winning 2,500 GBP for second place and Sanaa space winning third prize of 1,000 GBP.\nThe 11 finalist companies in the Oxford Africa Conference Innovation Fair were:EcoboraEcovonHustlenomicsMazi MobilityNatal CaresNuna Premium ResourcesAkoo AudiobooksPledreRecon Health MediaSanaa SpaceThe icreate ProjectFollow the Oxford Africa Conference social media pages or look at our website to learn more about the companies and conference:Or contact:Shaan Pattni, Daniel KandieCo-Managers of the Oxford Africa Conference Innovation Fair"
  },
  {
    "headline": "Unicorn Incubation Campus Launch",
    "summarized_story": "Unicorn Group is launching the largest incubation campus.\nEverywhere you turn, Africans are innovating and creating solutions that are not only unlocking Value on the continent but also putting the world on notice, this is why the Unicorn Campus is giving innovation a home.\nAnyone from age 10 can be a member at the first 24-hour innovation and Incubation house in Africa.\nWith Access Capital for bringing great ideas to life, mentors, advisers, library, technology, resources, global networks, ideas.\nThe campus features 6 floors of business learning and innovation that will help create a world-class network for African start-ups and entrepreneurs."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How Nigerian credit fintech startup, BFREE, is helping Africans repay their loans",
    "summarized_story": "AdvertisementWhile loan collection for BVN-linked bank accounts may be somewhat smooth, the reverse is the case for credit fintech startups.\nMoreover, with millions of people demanding personal loans, lending amounts for these platforms become smaller.\nThat’s exactly what we are doing at BFREE,” Flosbach says.\n“Here we deploy machine learning algorithms that predict the probability to repay a customer and define the use case of the customer,” Flosbach submits.\nWhile they reach out to the debtors, the co-founders believe that in an ethical credit collection, not everyone would repay."
  },
  {
    "headline": "How Nigerian credit fintech startup, BFREE, is helping Africans repay their loans",
    "summarized_story": "AdvertisementWhile loan collection for BVN-linked bank accounts may be somewhat smooth, the reverse is the case for credit fintech startups.\nMoreover, with millions of people demanding personal loans, lending amounts for these platforms become smaller.\nThat’s exactly what we are doing at BFREE,” Flosbach says.\n“Here we deploy machine learning algorithms that predict the probability to repay a customer and define the use case of the customer,” Flosbach submits.\nWhile they reach out to the debtors, the co-founders believe that in an ethical credit collection, not everyone would repay."
  },
  {
    "headline": "It might get harder for budding African creators to make money with YouTube’s new terms of service",
    "summarized_story": "Google-owned video-sharing platform, YouTube, released an update to its terms of service in November 2020.\nThe update revealed that taxes will now be levied on the royalties of content creators resident in the US, who are already entitled to payments on the platform.\nThis will soon take place in other countries as the new terms of service are rolled out.\nThe YPP was launched in December 2007 as a means of revenue generation for creators, who allow ads to appear on their videos for an amount of money.\nThe new policy puts some creators on the platform at a disadvantage, especially those still looking to grow their channels."
  },
  {
    "headline": "News",
    "summarized_story": "Going by an update to @YouTube terms of service, from June 1 2021, creators outside the US that are not on the YouTube Partner Program (YPP) might now have ads appear on their videos with no entitleme…"
  },
  {
    "headline": "Oil up, near $70 a barrel as demand outlook improves",
    "summarized_story": "Oil prices firmed on Monday, with Brent trading near $70 a barrel on growing optimism that fuel demand will grow in the next quarter, while investors looked ahead to see how producers will respond at this week’s OPEC+ meeting.\nTrading was thin as U.S. and UK markets were closed on Monday due to public holidays….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Is crypto the future of money?",
    "summarized_story": "Imagine walking into your favourite clothing store and after shopping for some outfits, you are told the price is 0.00062 BTC rather than N10,000.\nOr you are taking a trip and you don’t need to take any physical cash and from the plane tickets, accommodation and food all paid with Bitcoin and everyone receives it…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s NAFEX adoption may be long walk from full unification -",
    "summarized_story": "Issues around liquidity and restriction on dollar deposits and usage are bigger challenges to full unification than merely recognising an overdue update on the CBN website, analysts say.\nRead Also: BDCs tell public to patronize CBN-licenced operatorsNigeria, unlike it African peers, has continued to operate multiple exchange rate windows.\nAccording to him, if the market is liberalised the naira will settle at its true value, which is higher than the current NAFEX rate.\nData collated from the black market implies a gap of N83 between the now official NAFEX rate and the parallel market rate.\nAlthough on the rise, the falling global crude price always reduces FX supply in Nigeria and affects the exchange rate like in 2016 and 2020."
  },
  {
    "headline": "World No Tobacco Day: Edo govt urges urgent measures to save over 16,000 lives lost annually to tobaccoC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has expressed concern over 16,100 Nigerians killed annually by tobacco, calling for urgent measures and partnerships among relevant stakeholders to check its consumption and reduce the health and other risks associated with tobacco use.\nPermanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa said this while briefing journalists in Benin City in commemoration of the World No Tobacco Day, marked by the World Health Organisation (WHO) and other organs to raise awareness and check the consumption of tobacco.\n“The Tobacco Atlas 2018 report for Nigeria, estimates more than 16,100 annual deaths from tobacco-related diseases.\n“Today as we observe World No Tobacco Day, I call on people of all ages, especially the young, to join the fight against the tobacco epidemic.\nI encourage youth groups to build a movement for a tobacco free generation."
  },
  {
    "headline": "Ize Iyamu Congratulates Gov Obaseki, pledges loyalty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Candidate of the All Progressives Congress (APC) in the last Governorship election in Edo State, Mr. Osagie Ize-Iyamu on Monday congratulated the governor of Edo state, Mr. Godwin Obaseki over his victory at the Supreme Court which upheld his re-election.\nThis was contained in a letter addressed to the state governor and signed by Osagie Ize-Iyamu in Benin City, Edo state.\nIze-Iyamu said the judgement of the Supreme Court last Friday however put an end to the series of litigations over last year’s governorship elections in the state.\nOn our part, our party, the APC had only one case against Your Excellency and your party.\nOur appeal is that you consider paying them their entitlements since it is now late for them to return to their offices."
  },
  {
    "headline": "Obaseki, Shaibu, others to receive second jab of COVID-19 vaccine tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…as Edo flags off second dose vaccinationBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, his deputy, Rt.\nComrade Philip Shaibu and other political, religious and traditional leaders in the state will tomorrow, Tuesday, June 01, 2021, receive the second jab of the Oxford-Astrazeneca COVID-19 vaccine, as the state begins second dose vaccination in its efforts to contain the pandemic and protect citizens.\nThe Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, who disclosed this to journalists in Benin City, urged eligible citizens to present themselves for the second dose vaccination to get full protection against the virus.\nAccording to him, “Obaseki and other dignitaries will be vaccinated with the second dose of the vaccine at the official flag-off ceremony coming up on Tuesday, June 01, 2021.\nIrowa further noted that the COVID-19 vaccines in the state are safe, effective and administered free of charge."
  },
  {
    "headline": "Edo market women hail Supreme Court verdict, say confidence in Obaseki was never misplaced – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Traders in Edo State have hailed the Supreme Court verdict dismissing the alleged certificate forgery suit against Governor Godwin Obaseki and affirming the governor’s victory at the September 19 governorship poll, adding that Edo people’s confidence in the governor was never misplaced.\nAnother trader, Mrs. Vivian Obi, while commending the verdict of the Supreme Court, said, “I never had any doubt about Governor Obaseki’s qualification for the number one seat in the state.\n“Obaseki has never disappointed the Edo people.\nI am happy with the verdict of the Supreme Court.\nThe Supreme Court’s five-man panel of justices on May 28, 2021 upheld the ruling of the Appeal Court, which dismissed the alleged certificate forgery suit filed by the APC against the Governor, during the 2020 governorship election."
  },
  {
    "headline": "EXCLUSIVE: Seven soldiers killed, five injured as terrorists ambush Nigerian troops",
    "summarized_story": "ADVERTISEMENTAt least seven soldiers of the Nigerian Army have been killed by an improvised explosive device planted by Boko Haram terrorists, in Borno state, Nort-east Nigeria, PREMIUM TIMES can exclusively report.\nAccording to sources familiar with the situation, a senior military officer and four other soldiers were severely injured by the explosive.\nSerial AttacksTroops of the Nigerian Armed forces have suffered many attacks from the Boko Haram terrorists.\nGroups like Boko Haram and the Islamic State’s West Africa Province have terrorised Nigeria’s North-east geopolitical zone for more than a decade.\nThis has led to the death of thousands of soldiers and civilians and has displaced thousands of residents."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun 2022: Group drums support for Oyetola’s re-election",
    "summarized_story": "The group enjoined the Oyetola to remain focused and concentrate on continuous delivery of the dividend of democracy to the people of the state so as to guarantee continuous victory for the party in all elections.\nOther members of the team at the meeting include Sen. Babajide Omoworare, Hon.\nAdeyinka Ajayi, Oluomo Sunday Akere, former Commissioner for Information and Strategy, RH.\nAkintunde Adegboye, Hon.\nSemiu Ayofe, Mr Segun Omoworare and Elder Tunde Adedeji."
  },
  {
    "headline": "Tributes as Abuja bids Joe Nwodo farewell",
    "summarized_story": "The night of tribute organized by friends and relations of the late constitutional lawyer attracted prominent heads from political and corporate community across the country.\nPrince Secondus said the brilliance exhibited by Late Nwodo in Port Harcourt at the defunct NRC Presidential Convention in the third republic electioneering could only come from an exceptional and uncommon talent.\nHe said that in Dr Joe Nwodo was that example of good heads being kept out of power noting that such action is responsible for the glaring leadership vacuum in our land today.\nAlhaji Idi Farouk who chaired the organizing Committee of the National Convention in question in 1993 where Joe Nwodo shone like star recalled the brilliance of the great icon whom he also described as a good man and an accommodating leader.\nThe wake keep ceremony will be at Dr Joe Nwodo’s Residence in Ukehe House, Igbo Etiti while the funeral mass is to hold at St.Peter’s Catholic Church,mUkehe on Saturday and on a Sunday outing servicing at Mother of Christ Parish, Ukwuaji, Ukehe."
  },
  {
    "headline": "NNPC to deduct N126bn from June remittance to FAAC amid rising subsidy payment",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), has given a notice to the Federation Account and Allocation Committee (FAAC) that it will deduct about N126 billion from its remittance to the Federation Account at the next meeting scheduled for June, amid rising subsidy payments.\nNNPC stated that its overall crude oil lifting for both export and domestic in March 2021, recorded 29 per cent decrease relative to the 10.79Mbbls lifted in February 2021.\nMCA is a financing agreement whereby the International Oil Companies (IOCs) advance loans to NNPC to invest in upstream projects.\nOn the analysis of receipts due in April, gross revenue from JV crude was N124.3 billion, JV gas was N26.1 billion, while N5.8 billion was received from miscellaneous sources, amounting to N156.3 billion.\nAfter deduction of royalty, JV cost recovery, profit before tax and taxes, receipts from JV crude came down to N5.5 billion, while that of JV gas stood at N7.8 billion."
  },
  {
    "headline": "Streets, markets deserted in Southeast, Asaba over IPOB’s sit-at-home order",
    "summarized_story": "Major markets and streets in Nigeria’s Southeast and Asaba, Delta State, South South, were deserted on Monday over a sit-at-home order issued by the Indigenous Peoples of Biafra (IPOB) in honour of those killed during the Nigeria-Biafra war.\nIn Abia State, streets were deserted and shops are under lock and key while in Anambra State, the situation is the same.\nThe inner streets were deserted with security men positioned at different locations.\nMany businesses in Delta State capital, Asaba were also shut as residents comply with the sit-at-home order.\nThe expressway leading to the head bridge was completely deserted while businesses along the expressway were also shut."
  },
  {
    "headline": "COVID-19: Nigeria Cannot Afford A Third Wave, Federal Govt Warns",
    "summarized_story": "The Presidential Steering Committee (PSC) on COVID-19 has warned that Nigeria cannot afford a third wave of coronavirus and will do everything to protect its territory.\n“The PSC will urge the United Arabs Emirates to remove the country specific and discriminatory practices against Nigeria.\nTo this end, the PSC has published the names and particulars of over two hundred violators that evaded the quarantine requirement.\n“Nigeria will continue to monitor the unfolding events and will deal with them as applicable.”ADVERTISEMENTMeanwhile, the PSC members took their second jab of AstraZeneca COVID-19 vaccine on Monday.\n“Over the weekend, His Excellencies, the President and the Vice President received their second dose of the AstraZeneca vaccine."
  },
  {
    "headline": "COVID-19: Nigeria Cannot Afford A Third Wave, Federal Govt Warns",
    "summarized_story": "The Presidential Steering Committee (PSC) on COVID-19 has warned that Nigeria cannot afford a third wave of coronavirus and will do everything to protect its territory.\n“The PSC will urge the United Arabs Emirates to remove the country specific and discriminatory practices against Nigeria.\nTo this end, the PSC has published the names and particulars of over two hundred violators that evaded the quarantine requirement.\n“Nigeria will continue to monitor the unfolding events and will deal with them as applicable.”ADVERTISEMENTMeanwhile, the PSC members took their second jab of AstraZeneca COVID-19 vaccine on Monday.\n“Over the weekend, His Excellencies, the President and the Vice President received their second dose of the AstraZeneca vaccine."
  },
  {
    "headline": "Group Rallies Support For Osinbajo, Al-Mustapha Ticket For 2023",
    "summarized_story": "He said the pair of vice president Osinbajo and former CSO to former Head of State, Major Al-Mustapha, has what it takes to turn the country’s economy around and create jobs for the teeming youths.\nGora said the group was backing Osinbajo’s presidential ambition for 2023 and was also calling on others to queue behind him.\nHe said, “Osinbajo and Al-Mustapha are vastly knowledgeable in the economy and security intelligence of rebuilding a better and united Nigeria.\n“The vice president has the experience and mature disposition required to govern a multi-ethnic society like Nigeria.\nAccording to Gora, “the group has realised that youths and women in the country are vital in ensuring Osinbajo and Al-Mustapha ticket, hence, the need to reach out to them."
  },
  {
    "headline": "Group Rallies Support For Osinbajo, Al-Mustapha Ticket For 2023",
    "summarized_story": "He said the pair of vice president Osinbajo and former CSO to former Head of State, Major Al-Mustapha, has what it takes to turn the country’s economy around and create jobs for the teeming youths.\nGora said the group was backing Osinbajo’s presidential ambition for 2023 and was also calling on others to queue behind him.\nHe said, “Osinbajo and Al-Mustapha are vastly knowledgeable in the economy and security intelligence of rebuilding a better and united Nigeria.\n“The vice president has the experience and mature disposition required to govern a multi-ethnic society like Nigeria.\nAccording to Gora, “the group has realised that youths and women in the country are vital in ensuring Osinbajo and Al-Mustapha ticket, hence, the need to reach out to them."
  },
  {
    "headline": "Senate Summons Akume Over Lottery Revenue",
    "summarized_story": "The Senate has summoned the Minister of Special Duties, Senator George Akume, over the alleged failure of lottery operators to remit appropriate revenues to the coffers of the Federal Government.\nThe chairman, Senate Committee on Sports, Senator Obinna Ogba, disclosed on Monday after his committee’s meeting with the lottery operators and the regulatory agency.\nWhat we discovered is that the country is not getting much revenue from the lottery operators.\nThe senator had expressed concern that statutory remittances by most lottery operators in the country remained extremely poor and not reflective of the actual sales generated by operators.\nThe Senate President, therefore, mandated the Senate Committee on Sports to investigate the alleged non-execution of the settlement and report back within four weeks."
  },
  {
    "headline": "Man recounts how Pastor told him to drink wife’s urine for 2yrs until the unexpected happened",
    "summarized_story": "A man has shared a bitter story of how his pastor had instructed him to drink his wife’s urine for two years because of wealth.\nMeanwhile, the fake pastor has been having an affair with his wife within this period and got her pregnant.\nDo you know I have been drinking my wife’s urine for 2 years now because I want to be rich and work in an oil company.\nMy pastor told me not to touch my wife but drink her urine every morning and wait for God to embarrass me with wealth.\nNo wonder when she took in I was surprised but was brainwashed by my pastor that the holy spirit was at work and with the connection of my wife’s urine she can get pregnant.”"
  },
  {
    "headline": "Mother of 6 dumps husband of 20 years to marry “holy spirit” spends honeymoon in Uganda",
    "summarized_story": "A Kenyan woman, Elizabeth Nalem last week shocked her countrymen by ending her 20-year-marriage to “marry” the Holy Spirit.\nThe mother of six from Makutano town in West Pokot County exchanged wedding vows with Holy Spirit on Tuesday, May 25, in a ‘lavish’ ceremony that attracted a multitude of people at the Chelang’a Gardens.\nHer husband, Joshua Nalem was said to be have been left in a quagmire not knowing what step to take next, after his wife left their matrimonial home to dedicate her life to the church.\nAlthough he says that he still loves Elizabeth, Joshua insists that he does not know the next course of action.\nAfter shocking the country by abandoning her family in West Pokot to marry the Holy Spirit, Elizabeth Nalem now says she is headed for her honeymoon in Uganda."
  },
  {
    "headline": "Kemi Olunloyo Reveals That Shmed Gulak Killed In Imo State Was Shot By Fulani Bandits",
    "summarized_story": "Nigerian journalist, Kemi Olunloyo has revealed that a former presidential aide, Ahmed Gulak killed in Imo state was shot by Fulani bandits.\nSee tweets by Kemi below:QuoteBREAKING Outspoken politician Ahmed Gulak has been SHOT DEAD assassination style in OWERRIFlag of Nigeria.\nKemitalksmediaAnyone suggesting that IPOB killed Ahmed Gulak is a slowpoke.\nHe took a Uber with two people and that Uber took a back road.\nHe took a Uber with two people and that Uber took a back road."
  },
  {
    "headline": "Marriage to Aishy makes me stronger, declares Musicbysire",
    "summarized_story": "By Mutiat AlliCouples don’t have to give up their passion because of marriage.\nInstead, marriage should be a catalyst that further inspires them to greater heights.\nSaid he: “We both are in the creative industry and neither of us has to give up his or her passion because of marriage.\nContinuing, he disclosed: “Quilavisuals and Aishy Productions are working together to bring creativity on a whole different level to your screen.\nYou all should be on the lookout for her movies coming soon.”Speaking about what the future holds for him and his young marriage, he reflected: “We are going to work at making our marriage stronger."
  },
  {
    "headline": "JAMB: Candidates to pay N700 for mock UTME",
    "summarized_story": "JAMB made the announcement three days before the commencement of the mock examination via its Twitter handle.\n“All candidates sitting the 2021 Mock examination scheduled for Thursday, 3rd June 2021 are advised to go to their assigned centres with N700.\nAll candidates sitting the 2021 Mock examination scheduled for Thursday, 3rd June 2021 are advised to go to their assigned centres with N700.\n“Candidates, who had registered for the 2021 UTME and indicated interest to sit for the optional mock examination, are to reprint their mock notification slips.\n“This is consequent on the change of date for the mock- UTME earlier scheduled for Thursday, May 20 and now to hold on Thursday, June 3."
  },
  {
    "headline": "JAMB: Candidates to pay N700 for mock UTME",
    "summarized_story": "JAMB made the announcement three days before the commencement of the mock examination via its Twitter handle.\n“All candidates sitting the 2021 Mock examination scheduled for Thursday, 3rd June 2021 are advised to go to their assigned centres with N700.\nAll candidates sitting the 2021 Mock examination scheduled for Thursday, 3rd June 2021 are advised to go to their assigned centres with N700.\n“Candidates, who had registered for the 2021 UTME and indicated interest to sit for the optional mock examination, are to reprint their mock notification slips.\n“This is consequent on the change of date for the mock- UTME earlier scheduled for Thursday, May 20 and now to hold on Thursday, June 3."
  },
  {
    "headline": "NDSF 2021: Mba-Uzoukwu to discourse role of Nigerian software in digital governance",
    "summarized_story": "Confirming this in Lagos, the organisers through the Lead Consulting Strategist and Group Executive Editor, ITREALMS Media inc, Mr. Remmy Nweke, said that ISPON president would be exploring the role of Nigerian software in digital economy within this year’s main theme which centers on Digital Cooperation: Enhancing Multistakeholders Governance for Digital Economy.\nNweke also said that Mba-Uzuokwu, who is also the Managing Director and Chief Executive Officer (CEO), InfoGraphics Nigeria Limited, would precisely dwell on subtheme focus is on the “Role of Nigerian Software in Enhancing Multistakeholder Governance for Digital Economy” as a special guest to the 2021 Nigeria DigitalSENSE Forum series.\n“We are particularly pleased with the stated objectives,” he said, and looked forward to exciting forum.\nNweke recalled that this year’s Nigeria DigitalSENSE Forum series on Internet Governance for Development would be presided over by the National President of the Nigeria Computer Society (NCS), Prof. Adesina Sodiya.\nFurther, Nweke pointed out that Mr. Chinenye Mba-Uzoukwu has over 30 years of an eclectic career spanning enterprise solution architecture, design and software development, marketing communications, digital design, strategy, and change/transformation in private and public sectors."
  },
  {
    "headline": "NDSF 2021: Mba-Uzoukwu to discourse role of Nigerian software in digital governance",
    "summarized_story": "Confirming this in Lagos, the organisers through the Lead Consulting Strategist and Group Executive Editor, ITREALMS Media inc, Mr. Remmy Nweke, said that ISPON president would be exploring the role of Nigerian software in digital economy within this year’s main theme which centers on Digital Cooperation: Enhancing Multistakeholders Governance for Digital Economy.\nNweke also said that Mba-Uzuokwu, who is also the Managing Director and Chief Executive Officer (CEO), InfoGraphics Nigeria Limited, would precisely dwell on subtheme focus is on the “Role of Nigerian Software in Enhancing Multistakeholder Governance for Digital Economy” as a special guest to the 2021 Nigeria DigitalSENSE Forum series.\n“We are particularly pleased with the stated objectives,” he said, and looked forward to exciting forum.\nNweke recalled that this year’s Nigeria DigitalSENSE Forum series on Internet Governance for Development would be presided over by the National President of the Nigeria Computer Society (NCS), Prof. Adesina Sodiya.\nFurther, Nweke pointed out that Mr. Chinenye Mba-Uzoukwu has over 30 years of an eclectic career spanning enterprise solution architecture, design and software development, marketing communications, digital design, strategy, and change/transformation in private and public sectors."
  },
  {
    "headline": "Oshiomhole bows to Obaseki, says ‘our differences unfortunate’",
    "summarized_story": "By Jethro Ibileke/BeninFormer National Chairman of the All Progressives Congress (APC), Comrade Adams Oshiomhole, has congratulated Governor Godwin Obaseki of Edo State, over his victory at the Supreme Court, describing their differences as unfortunate.\nObaseki who succeeded Oshiomhole as governor of Edo State, was disqualified from contesting the governorship primary of the APC, under the watch of Oshiomhole as national chairman of the party.\nThe Supreme Court, however, declared Obaseki winner of the poll, noting that the appellants failed to prove that the governor forged his University of Ibadan degree certificate.\nIn the congratulatory letter he personally signed on Monday, the former Edo State Governor said he had put all that transpired between him and his estranged political godson, behind him, describing their differences as “unfortunate”.\nHe said: “Congratulations on your victory at the Supreme Court, which has effectively laid to rest all matters arising from the last election."
  },
  {
    "headline": "Uzodinma breaks silence on Gulak’s murder, attack on his convoy",
    "summarized_story": "By Kazeem UgbodagaImo State Governor, Hope Uzodinma has broken his silence on the murder of a former presidential aide, Ahmed Gulak and the purported attack on his convoy.\n“Let me make it very clear that everything will be done by security agencies to find those who murdered Gulak and their sponsors.\nUzodinma also rubbished claims that his convoy was attacked, saying nothing like that even happened.\n“Finally, let me also clarify the story trending on the social media platforms, that my convoy was attacked, my convoy was never attacked.\nThat is the wish of those who murdered Gulak,” he said."
  },
  {
    "headline": "Biafra: How Southeast stood still at Nnamdi Kanu’s command",
    "summarized_story": "Kazeem Ugbodaga, with Agency ReportThe entire Southeast Nigeria stood still on Monday in compliance with the order of the Indigenous People of Biafra (IPOB) for residents to sit at home to mark Biafra day.\nIPOB’s leader, Nnamdi Kanu had issued an order that residents in the five eastern states should stay at home on Monday, May 31.\nGovernment offices, schools, banks, shops, business centres, markets, malls and plazas and petrol outlets remained closed.\nIn Awka, Anambra State, residents also complied with the directive as hotels, restaurants and markets in the city and surrounding villages remained closed.\nAccording to the News Agency of Nigeria all the streets, markets, banks, schools and government offices were closed."
  },
  {
    "headline": "Nigeria is becoming a failed State – Ishaku",
    "summarized_story": "Governor Darius Ishaku of Taraba State has stated that Nigeria is becoming a failed state, insisting that the only solution is to establish state police.\nAccording to the governor, Nigeria is sliding into anarchy due to increased insecurity in the country.\nIshaku in an interview with newsmen in Jalingo noted that the increasing spate of insecurity across Nigeria and the inability of the military and other security agencies to address the situation were indications of anarchy.\nThe governor said, “Nigeria is sliding into a failed state, yes of course Nigeria is sliding into anarchy.\nIt is a disgrace if a country’s military cannot flush out insurgents within its territory.”He added, “we need a state police; we need the constitution to be amended."
  },
  {
    "headline": "BREAKING: Osun Residents Protest Over Insecurity, Bad Governance",
    "summarized_story": "In Osun state, civil society organizations thronged major avenues in Osogbo, the state capital, to protest insecurity and poor administration in Nigeria.\nAccording to the Convener, Comrade Waheed Lawal, the purpose of the demonstration is to raise awareness among inhabitants of the state about the need of speaking up against injustice and maladministration rather than dying in quiet.\nThe demonstrators marched from Old Garage’s popular Freedom Park to Station Road, where they spoke to store owners near Fagbewesa Junction on the importance of joining the fight for a better Nigeria.\nComrade Waheed Saka who spoke at the Fagbewesa junction said despite the human and natural resources the country is endowed with, poor leadership has put the country in the wrong direction leading to untold hardship among the masses."
  },
  {
    "headline": "Sowore Speaks After Been Shot By Police Officer In Abuja",
    "summarized_story": "The founder of Sahara Reporters, Omoyele Sowore has Spoken after he was reportedly been shot by a female police officer in Unity Of Fountain, Abuja.\nIn his tweet, he wrote: “Just been shit by a police officer, ACP Atine at the Unity Fountain in Abuja.\n#RevolutionNow Let the struggle continue even if they take my life!\n#BuhariMustGo”Just been shit by a police officer, ACP Atine at the Unity Fountain in Abuja.\n#BuhariMustGo pic.twitter.com/c9ui2UutXO — Omoyele Sowore (@YeleSowore) May 31, 2021NEWS DIRECT Earlier gathered that he sustained gunshots injuries and has been rushed to hospital for medical treatment."
  },
  {
    "headline": "Former Presidential Aide, Ahmed Gulak Buried In Abuja [Photos]",
    "summarized_story": "Ahmed Gulak, a former presidential advisor to former President Goodluck Jonathan, has been laid to rest.\nOn Sunday, May 30, about 8 p.m., he was laid to rest in the Gudu Cemetery in Abuja.\nThe National Mosque in Abuja hosted his funeral service.\nOn Sunday, May 30, Gulak was slain while traveling to the airport.\nSee photos from his memorial service below:"
  },
  {
    "headline": "Breaking: Again, JAMB extends 2021 UTME registration, tells candidates what to do before deadline",
    "summarized_story": "Joint Admissions and Matriculation Board (JAMB) has given two given another two weeks extension to candidates to complete their registration for the 2021 Unified Tertiary Matriculation Examination (UTME).\nThe deadline for first registration extension was May 29, 2021.\nThis was disclosed in statement by JAMB’s head of information and protocol, Dr. Fabian Benjamin on Monday.\nAccording to the statement, candidates yet to register have between May 31 and June 15 to complete their registration if they were not able to by last Saturday because of NIN verification issues using a new guideline.\nThe statement reads: “All prospective candidates with genuine proof(s) of failed efforts to register before the closing date, are to, between Monday May 31 and June 15, 2021, visit any of the Joint Admissions and Matriculation Board offices (including JAMB-owned professional test centres, PTCs) across the nation to:“(I) obtain at no cost and complete a form which is being made available to candidates with genuine reasons for missing the registration;“(ii) submit (for the reading test and application), a certified bank draft of N4,000 in favour of the Joint Admissions and Matriculation Board (and obtain a signed duplicate copy from the office);“(iii) submit the completed form with a recent passport photograph at the same office of collection;“(iv) collect a copy of the reading test;“(v) await further directives through the registered phone number and public service announcement as soon as the screening is completed.”Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "VIDEO: How gunmen murdered ex-high court judge, Stanley Nnaji",
    "summarized_story": "NextBreaking: Again, JAMB extends 2021 UTME registration, tells candidates what to do before deadline"
  },
  {
    "headline": "Pictures: Another tragedy as gunmen kill ex-high court Judge",
    "summarized_story": ""
  },
  {
    "headline": "2023 elections: Group drums support for Osinbajo, Al-Mustapha aspiration -NigPilot",
    "summarized_story": "The group said that the success of the duo in 2023 would lead to economic prosperity, job creation, and sustainable development.\nThe leader of the group said it was backing Osinbajo’s presidential ambition for 2023 and was also calling on others to queue behind the VP.\nAccording to him, “Osinbajo and Al-Mustapha are vastly knowledgeable in the economy and security intelligence of rebuilding a better and United Nigeria.\n“We have realized that youths and women in the country are vital to ensuring Osinbajo and Al-Mustapha ticket, hence, the need to reach out to them.\n“For the APC, the unifying balm of Buhari will still play a vital role to salvage her mistakes and reposition a better Nigeria."
  },
  {
    "headline": "North-East stakeholders demand creation of Savannah State -NigPilot",
    "summarized_story": "In Bauchi centre, the people of Southern Borno comprising nine local government areas on Thursday disagreed with the position of the Borno State government and insisted on the creation of Savannah State.\n“We the people of Askira/Uba, Bayo, Biu, Chibok, Damboa, Gwoza, Hawul, Kwaya-Kusar and Shani Local Government Areas of Borno State wish to present our request for the creation of Savannah State out of the present Borno State.\nThe 2014 Conference report has again clearly shown that SAVANNAH state met all necessary criteria for the creation of the state in Nigeria.\n“The proposed Savannah State is richly endowed with Solid Minerals, agricultural products, tourism potentials and human resources that can be harnessed to lay a solid foundation for the transformation of the State.\n“It is an incontrovertible fact that greater part of both the human and material resources of the present Borno state come from the southern part."
  },
  {
    "headline": "Pan-Nigeria group commends Buhari’s choice of Farouk Yahaya as COAS -NigPilot",
    "summarized_story": "Nigeria First, a pan-Nigeria group, has applauded President Muhammadu Buhari’s choice of Major General Farouk Yahaya as late Lt Gen Ibrahim Attahiru’s successor for the position of Chief of Army Staff.\nAccording to the group, Maj Gen Yahaya’s appointment is another evidence of President Buhari’s commitment to the war against insurgency and insecurity across the nation.\nNigeria First, which made this known on Sunday at a press conference in Abuja, described the move as the right step in the right direction.\nIt also urged the new COAS to ensure that the Nigerian Army develops a versatile and proactive intelligence network that would greatly assist in nipping in the bid acts that undermine national security.\nThe group further tasked Yahaya to ensure that the Nigerian Army remains apolitical in its various operations across the country, and also put the interest of the country and the nation’s nascent democracy at the centre of all decision making."
  },
  {
    "headline": "Insecurity: FCTA demolishes Fulani settlement, other illegal structures",
    "summarized_story": "The Federal Capital Territory Administration FCTA, through its Joint Task Force JTF, has demolished a Fulani Ruga settlement located very close to Nnamdi Azikiwe International Airport, Abuja.\nThis was even as illegal structures and outright encroachment within both the Army and Police estates along the Airport road, as well as a drug market, popularly called ” car wash ” in Lugbe, were all demolished.\nAttah said that the Airport road was a major gateway to the city centre of the nation’s capital, and therefore won’t be abandoned to lawlessness.\nHe added that two months notice had been given to the affected people, but no compliance was recorded.\nAttah said, “two months ago the FCT Minister, Malam Muhammad Bello visited the in-bound and outbound of the Airport road with key stakeholders and showed us several contraventions."
  },
  {
    "headline": "IPOB Cannot Give Sit-At-Home Order In Rivers – Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike on Monday said the proscribed Indigenous People of Biafra (IPOB) cannot issue a sit-at-home order to the people of Rivers State.\nWike stated this on Channels Television’s Politics Today, adding that Rivers is a South-South state and not one of the South-Eastern states.\n“IPOB cannot make an order to say sit at home in Rivers State.\nI have said so clearly before because it does not exist in Rivers State,” he said.\nRivers State is South-South, we are in the Niger Delta."
  },
  {
    "headline": "Despite Attacks In South-East, INEC Vows To Conduct Anambra Gov Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has vowed to conduct the Anambra governorship election despite the recent attacks on its facilities in the region.\nThe Anambra governorship election is scheduled to hold on November 6, 2021, but the South-East has been a hotbed of insecurity with gunmen attacking police facilities, burning INEC buildings, and destroying electoral materials.\nREAD ALSO: Anambra Election: Only 18 Parties Are Recognised, INEC Tells 74 OthersThis was disclosed by the National Commissioner of the Commission, Adekunle Ogunmola after a strategic meeting in Lagos, on Monday.\n﻿“For INEC, it won’t be a difficult thing to plan for the Anambra election.\nThe electoral body said it is working on a strategic plan and strategic program of action for 2022-2026."
  },
  {
    "headline": "Businesses Shut, Streets Deserted In South-East Amid IPOB’s Sit-At-Home Order",
    "summarized_story": "Businesses, schools, and other major economic hubs were shut.\nIn Abia State, streets were deserted and shops are under lock and key while in Anambra State, the situation is the same.\nThe inner streets were deserted with security men positioned at different locations.\nMany businesses in Delta State capital, Asaba were also shut as residents comply with the sit-at-home order.\nThe expressway leading to the head bridge was completely deserted while businesses along the expressway were also shut."
  },
  {
    "headline": "Zamfara Youths Block Highway, Destroy Vehicles In Violent Protest",
    "summarized_story": "Angry youths armed with weapons have staged a violent protest along the Gusau – Kaura Namoda Highway in Zamfara State.\nEyewitnesses told Channels Television that the protesters occupied the road very early on Monday over the incessant attacks by bandits in their communities.\nOne of the commuters who was trapped along the road explained that the youths blocked the highway along Kurya junction and began to destroy public vehicles travelling along the road.\nREAD ALSO: How Bandits Attacked Five Zamfara Communities, Killed Over 20 People – WitnessesResidents of Zamfara have been living in fear as a result of the continued attacks by bandits on communities in various parts of the state.\nDosara noted that the Zamfara State government has spent the sum of N970 million on payment of ransom to bandits to secure the release of kidnapped victims since 2011."
  },
  {
    "headline": "Lukaku Wins Serie A MVP Prize, Ronaldo Scoops Best Striker",
    "summarized_story": "Inter Milan’s Romelu Lukaku has won the Serie A best overall Most Valuable Player award for the 2020/2021 session after helping the Nerazzurri to their first league crown in 11 years.\nThe former Manchester United forward scored 24 times and provided 11 assists as the team romped to the title.\nIn a Google translated post on its website, the Serie A said, “With 24 goals and 11 assists, he is the first player to reach 20 goals and 10 assists in a single Serie A season since the data was collected (2004/05 season).”Juventus star Cristiano Ronaldo was also picked as the best attacker in the league after he netted 29 goals in the league, making him the top scorer in Italy for the campaign.\n“When his teammates give him the ball he has already foreseen what he will have to do,” the league explained."
  },
  {
    "headline": "President Buhari appoints Ambassador Babagan Kingibe as Special envoy on Chad, Lake Chad Basin",
    "summarized_story": "President Muhammadu Buhari, has approved the appointment of Ambassador Babagana Kingibe as his Special Envoy with Cabinet Rank Status, to Chad and the Lake Chad Basin Region.\nA statement signed by the Secretary to the Government of the Federation, Boss Mustapha the appointment of a Special Envoy by the President is in consonance with the resolution of the Extraordinary Summit of Heads of State and Government of the Lake Chad Basin Commission, Member Countries, on the situation in Chad on the 25th of May, 2021.\nThe Special Envoy will amongst others things Monitor developments in Chad and the Lake Chad Basin Region,aid reconciliation and seamless progress towards return to democratic rule at the end of the current Transitional Military Council’s rule.\nAmbassador Kingibe is an accomplished multi-lingual diplomat, who had at various times served the nation as Federal Permanent Secretary, Secretary to the Constituent Assembly, Cabinet Minister and Secretary to the Government of the Federation.\nHe had also participated in previous Nigeria-led Chadian reconciliation talks."
  },
  {
    "headline": "We are working to secure safe release of abducted Islamiya Students – Niger State Government",
    "summarized_story": "Niger State Government is putting in measures to ensure the safe release of Islamic school children abducted by bandits in Tegina, Rafi Local Government.\nKetso said that though the number of the kidnapped school children is not fully ascertained, however, efforts by security agencies to secure their release have been intensified.\nDescribing the situation as unfortunate, the Deputy Governor disclosed that the islamiyya school has three components comprising of Nursery, primary and junior secondary school.\nAdvertisementHe assured that strategies are in place to secure the release of the abductees the same way those of Kagara boys were released ruling out the option of paying ransome.\nHe said that the government has made contact with some of the identified parents of the kidnapped children, assuring them of their safe return."
  },
  {
    "headline": "Naomi Osaka Withdraws from French Open after Refusing to Do News Conferences",
    "summarized_story": "World number two Naomi Osaka says she is withdrawing from the French Open as a result of controversy over her refusal to speak to the media during the tournament.\nOn Sunday a joint statement from Grand Slam organisers said Osaka could face expulsion from the tournament.\nIn a tweet, Osaka revealed she had “suffered long bouts of depression” since winning her first Grand Slam title in 2018.\nLater on Sunday, organisers of the four Grand Slams released a joint statement saying Osaka could face “more substantial fines and future Grand Slam suspensions” for her decision.\nAfter a “lack of engagement” from Osaka, the Grand Slam organisers wrote to her to offer support, as well as to “remind her of her obligations”."
  },
  {
    "headline": "Mary J. Blige Inducted into Apollo Walk of Fame and Bill Cosby’s Parole Petition Denied",
    "summarized_story": "Mary J. Blige has been inducted into the Apollo Theatre’s iconic Walk of Fame.\nShe joins other legends like Michael Jackson, Quincy Jones, Patti Labelle, Smokey Robinson, Ella Fitzgerald, the Temptations and many more.\nMeanwhile, American actor Bill Cosby won’t be paroled this year after refusing to participate in sex offender programs during his nearly three years in state prison in Pennsylvania.\nThe 83-year-old Cosby has long said he would resist the programs and refuse to acknowledge wrongdoing even if it means serving the full 10-year sentence.\nFinally, TIME has released the newest class of Next Generation Leaders and Nigeria-born Akwaeke Emezi, best-selling author of the critically acclaimed “Freshwater”, “PET” and “The Death of Vivek Oji”, made the list."
  },
  {
    "headline": "Death Toll in DR Congo Attack Rises to 50",
    "summarized_story": "The number of people killed in two attacks in the east of the Democratic Republic of Congo has risen to at least 50.\nThey are thought to have been carried out by gunmen from the Allied Democratic Forces or ADF – one of the dozens of armed groups operating in the region.\nThe area has however also seen violence between two ethnic groups.\nEyewitnesses said armed men on motorbikes targeted a camp for people who had been displaced by earlier violence.\nPresident Felix Tshisekedi gave extra powers to the military to address the insecurity which has seen numerous attacks every week despite the presence of thousands of UN peacekeepers"
  },
  {
    "headline": "Brazil Named New Hosts of Copa America 13 Days to Go after Colombia, Argentina Stripped of Hosting – Arise News",
    "summarized_story": "South American soccer body CONMEBOL has announced Brazil as the host of Copa America for the second consecutive time after Colombia and Argentina were stripped of hosting rights for the tournament.\nLike other continental tournaments, Copa America was initially scheduled for 2020, but the COVID-19 pandemic forced its postponement.\nThe 2020 version of Copa America was to introduce a new format with five teams based in each of the co-hosts, Colombia and Argentina.\nGroup A features Argentina, Bolivia, Chile, Paraguay and Uruguay while Group B includes Brazil, Colombia, Ecuador, Peru and Venezuela.\nIt would have been the first Copa America hosted by two countries."
  },
  {
    "headline": "China Explains Role in Blocking Taiwan from World Health Assembly",
    "summarized_story": "China has explained her role in the blockade of Taiwan from attending recently held World Health Assembly.\nZhang said the decision was taken by allies of China across the world who believe in a United China which include Taiwan.\nZhang, in the statement said: “I was caught by surprise to read in a local newspaper an article entitled “Taiwan’s exclusion from the World Health Assembly undermines global health” by Her Excellency Mary Beth Leonard, U.S.\nSince the outbreak of the pandemic, the Central Government of China has sent 260 notifications on COVID-19 to Taiwan region.\n“The WHO Secretariat briefed health experts in Taiwan region several times on pandemic information."
  }
]