[
  {
    "headline": "I dreamt I was winning souls for God, says BBNaija Mercy Eke",
    "summarized_story": "Reality TV star, Mercy Eke, has said that she dreamt that she was winning souls for God and healing people.\nShe noted that she neither lied nor drank alcohol on the eighth day of the year, as she prayed to God for more strength.\nThe 28-year-old further revealed that she dreamt that she was winning souls and preaching.\nShe wrote, “Day 8: No alcohol, no lies, no sin, no party.\nI had a dream where I was winning souls for God(I was preaching and healing people)”Copyright PUNCH."
  },
  {
    "headline": "FMC Yola to launch childhood vaccine reminder App",
    "summarized_story": "The Federal Medical Center, Yola, in partnership with Manaco Impact Foundation has developed a vaccine reminder App (Paediatric Oncall) designed to promote childhood vaccination.\nChief Medical Director of the centre, Prof. Auwal Abubakar, told the News Agency of Nigeria on Saturday that the app would be launched in March.\nRead Also Again, FMC Yola separates conjoined twinsAbubakar said the App would be used by mothers of children from zero to 15 months.\n“It will monitor to know if they take the immunisation at the stated times and serve as a reminder.\nAccording to him, the App can also be modified and upgraded to monitor other parameters, including that of the mothers and others with time."
  },
  {
    "headline": "Nnamdi Kanu: Political solution still being pursued, says Ekweremadu",
    "summarized_story": "Former Deputy President of the Senate, Senator Ike Ekweremadu, has said a political solution is still being pursued concerning the case of the leader of the Indigenous People of Biafra, Nnamdi Kanu.\nThis is amidst calls for a political solution to Kanu’s case.\nReacting, Ekweremadu, in an interview with Dream FM, Enugu, said he doesn’t think Buhari ruled out a political solution to Kanu’s case.\nThe Senator said, “Political solution in the Nnamdi Kanu’s matter is still very feasible.\nIn fact, I would have been surprised if he said he would just release Nnamdi Kanu because there is independence of every arm of government, including the judiciary."
  },
  {
    "headline": "Brown Ebewele: A giant has gone to rest",
    "summarized_story": "According to some of his former athletes, Coach Brown saw them beyond their sporting needs.\nHis foundation for me led me, triggered many successes, trail blazing, you may say.We had several fights during training with Coach Brown.\nThese experiences with Coach Brown made me tough and disciplined.I will miss you, Coach Brown!\nI was never thefastest or anywhere near being the fastest, but my coach Brown saw the potential in me,and the rest was history.\nCoach Brown, my hero, the coach who would fightyou because he wanted the best for you and from you."
  },
  {
    "headline": "Plateau: NMDPRA debunks govt insinuation of fuel hoarding, cautions citizens against panic buying",
    "summarized_story": "NMDPRA also urged the government not to carry out the mandate they don’t have as it is only its office that is mandated to license and monitor activities of petrol stations in the country.\nAccording to him,”… We know there is no hoarding in the State but unavailability of the product because of the spike of commuters during festive season.\nBetween yesterday and today, we have received about 1.6million litres of petrol so the issue of nonavailability is easing out.\nCitizens should not engage in panic buying, the product is now available.”Meanwhile, a Manager with Dipdat petrol station along the Bukuru expressway, Gabriel Norbert confirmed that there is no need to worry saying “We are not selling because we don’t have but we are expecting the product.\nWe had a challenge because our truck broke down on the way, hopefully, by next week, we will have enough product to dispense to the buyers.”"
  },
  {
    "headline": "2022: Industrialist, Mbisiogu, tasks businesses on discipline, vision",
    "summarized_story": "….As Blue Diamond holds AGM, honours staffBy Cynthia AhaiweChairman of Blue Diamond Group, Mr. Festus Mbisiogu, has said that for businesses to survive current economic climate, there must be orderliness and adherence to laws governing them.\nIn a speech titled: Business Process Re-engineering, said businesses shouldn’t be afraid of competition, saying it brings out the best in a brand.\nCompetition“Competition is good for business but has led to the closureof many businesses because they have been forced out of the market by competition.\nDon’t say the market is too crowded, and don’t take competition for granted, because they can edge you out.\nNo matter what, just realize that competition in business is real, and they can make you fail."
  },
  {
    "headline": "Black Girl Child Care educates girls on hygiene",
    "summarized_story": "L-r Member Nigerian Girl Guides Association ‘Olori Bakare Olanrewaju, member Iyaniwura Children Care Foundation, Olajumoke Otitolyu, Chief Volunteer Black Girl Child Initiative ; Akinyemi Cynthia Anuoluwapo; Lion Bukola Bade, and National Public Relations Officers Nigerian Girl Guide Association ;Titilola Oluwatoyin during the Nigerian Girls Guide Association Ikeja Division 16th Days of Activities Campaign on Elimination of the Gender Based Violence Against Girls in Collaboration with Black Girl Child care Initiative held in Lagos…distributes sanitary towelsBy Vera AnyagafuAs part of efforts to inculcate good hygiene practices among secondary school girls in Lagos state, Black Girl Care Initiative held a one -day sensitisation programme.\nThe event which was held in partnership with the Nigerian Girls Guide Association, Lagos was also part of the organisers activities to mark the 2021, 16 days activism.\nSpeaking at Ikeja Junior High school, venue of the event, executive director of Black Child Care Initiative, Cynthia Anuoluwapo Akinyemi said the enlightenment programme was ideal as it would educate girls on how to maintain proper hygiene during their monthly period.\nIn her words: ‘’One of the challenges facing Nigerian girls is lack of education, a lot of girls particularly in the north do not go to school.\nOlori Bakare Olanrewaju, of the Nigerian Girl Guides Association advised the girls to focus more on their academics so as to achieve their set goals in life."
  },
  {
    "headline": "Late Sylvester Oromoni: No evidence of torture, bullying, poisoning — Police",
    "summarized_story": "He warned that the Police would not fold their hand and allow any act of of omission that could threaten the peace in Lagos State .\nIt has also been established that a postmortem examination was initially carried out on December 2,2022, by a consultant pathologist, Dr Clement Vhriterhire, of the Central Hospital, Warri ,Delta.\nThe corpse was therefore moved with armed police escort from Delta State to Lagos State by TOS funeral and the autopsy conducted at the expense of the Lagos State Government.\nOn December 30,2021, the Toxicology screening result of the first autopsy carried in Warri was released.\nAt the end of diligent investigation carried out so far, there is no evidence to establish a case of torture , bullying and forceful application of poisonous substance against the suspects."
  },
  {
    "headline": "Pastor Giwa decries shortage of teachers, doctors in Ondo, tasks Akeredolu on security",
    "summarized_story": "The Senior Pastor of Awaiting the Second Coming of Jesus Christ, Pastor Adewale Giwa, has cried out over the acute shortage of teachers in primary and secondary schools across Ondo State.\nGiwa has also lamented that the number of doctors in the state can no longer serve its growing population.\nWhile urging Governor Oluwarotimi Akeredolu to urgently do the needful to reverse the situation, Pastor Giwa maintained that the state deserves better.\n“Within two years, traditional ruler and traditional chief were murdered by Fulani terrorists in Ondo State.\nOndo State deserves better treatment.”"
  },
  {
    "headline": "Buhari appoints ex-Lagos commissioner, Ayo Gbeleyi to head Federal Mortgage Bank",
    "summarized_story": "President Muhammadu Buhari has appointed Ayodeji Gbeleyi as the Chairman, Board of Directors, Federal Mortgage Bank of Nigeria (FMBN).\nGbeleyi, a native of Igbesa in Ogun State, replaces the immediate past chair, Adewale Adeeyo, who passed on recently.\nThe chartered accountant, an associate of the Chartered Institute of Taxation of Nigeria (CITN), served as Commissioner for Finance in Lagos State.\nGbeleyi was Director-General, Lagos Office of Public-Private Partnerships (PPP) and later Special Adviser to the Governor on PPP.\nGbeleyi was the first and only Chief Treasury Officer, Celtel Nigeria, now known as Airtel Nigeria."
  },
  {
    "headline": "Osun river has been highly polluted with heavy metals – Urban Alert",
    "summarized_story": "It has been confirmed that gold mining is responsible for the colour change of the Osun River.\nThe Urban Alert team lead claimed the state government only took action on the peoples complaints after the State Assembly oversight committee confirmed that the river was already polluted.\nIn his words, “Osun River is part of Osun Osogbo sacred grove which is a point of attraction for local and international tourists.\nThe Urban Alert Team Lead called on the federal government to step into the situation and proffer solutions.\nThe Osun Rivers has its source in Igede-Ekiti through Osun, Oyo, Ogun, Lagos and then into the lagoon."
  },
  {
    "headline": "IPOB does not speak for Igbos – Ohanaeze blasts Northern groups over inciting comments",
    "summarized_story": "President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor has insisted that the Indigenous People of Biafra, IPOB, does not speak for the entire people of the Southeast.\nObiozor, however, said the group’s anger was based on perceived injustice against the Southeast.\nBut according to Obiozor: “Take it from me and it is the right statement: IPOB doesn’t speak for Igbo and that is the truth.\n“To be very candid with you, the IPOB anger is an accumulated anger based on perceived or real injustice against Ndigbo for so long.\n“However, the truth of the matter is that they are not mandated to speak for Ndigbo.”He also berated Northern Groups for making inciting comments."
  },
  {
    "headline": "Gov Uzodinma has killer strike squad in Imo – Okorocha alleges",
    "summarized_story": "Imo West Senator, Rochas Okorocha has alleged that the state Governor, Hope Uzodinma has a killer squad known as Hopism Strike Force, HSF.\nOkorocha disclosed that the killer squad was behind the insecurity crisis rocking Imo State.\n“He is among the striking force of Uzodimma, I still ask Uzodimma, who killed Gulak?\nWho killed traditional rulers?\nHope Uzodimma has a striking force called ‘Hope striking force’ they should ask them what they are doing with this killer squad.”"
  },
  {
    "headline": "AFCON champions to earn N2.8bn as CAF increases prize money",
    "summarized_story": "The News Agency of Nigeria (NAN) reports that the winners’ prize money was increased from 4.5 million dollars, representing an increase of about 11 percent.\nThe decision was taken on Friday in Douala, Cameroon during the meeting of the Executive Committee of the Confederation of African Football (CAF).\nNAN reports that the prize money increase is beginning with the 2021 AFCON which gets underway on Sunday in Yaounde.\nThe competition’s runners-up will get 2.75 million dollars in prize money, up from 2.5 million dollars and an increase of 10 percent.\nThe new AFCON prize money structure is as follows:* Winners: 5 million dollars (an increase of 500,000 dollars)* Runners-up: 2.75 million dollars (an increase of 250,000 dollars)* Semi-Finalists: 2.2 million dollars (an increase of 200,000 dollars)* Quarter-Finalists: 1.175 million dollars (an increase of 175,000 dollars)(NAN)"
  },
  {
    "headline": "As APC crisis deepens, Buhari demands convention timeline",
    "summarized_story": "Buhari personally asked for the convention timetable from the Caretaker and Extraordinary Convention Planning Committee (CECPC) of the party, The Nation gathered yesterday.\nAccording to investigation, Buhari had received representations from some governors and party leaders on the danger of not holding APC National Convention on time.\nA top source said yesterday: “The dilly-dallying over APC National Convention may soon end because President Muhammadu Buhari has asked the Caretaker Committee to come up with a timetable for the convention.\n“If the Caretaker Committee can draw a timeline, there will be less tension in the party.\nSome of us are becoming impatient with the conduct of the Caretaker Committee, but we do not want a full blown crisis in APC."
  },
  {
    "headline": "Restructuring not threat to Nigeria’s unity – Ohanaeze",
    "summarized_story": "President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor, has said restructuring is not a threat to the unity of Nigeria.\nProf. Obiozor who spoke on Friday on Arise TV morning show, said that restructuring is a national blessing.\n“Restructuring is not a threat to the national unity, it is a very dynamic thing in a dynamic institution of a nation state where as you grow, new things are developed and new ideology evolves.\nIn fact every country that is wise and progressive takes restructuring into account as they grow.\nOn state police, Ebebuagu, he said the state police or formation of Ebubeagu or Amotekun is imperative in a federation like Nigeria."
  },
  {
    "headline": "STAR-STUDDED AFCON GETS UNDERWAY IN CAMEROON -",
    "summarized_story": "With 16 goals and nine assists, the Liverpool star has 25 goal involvements in the Premier League already in 2021-22, having played just 20 games.\nHe’s averaged a goal involvement every 71 minutes in the Premier League this season, which is his best rate in any top-flight league campaign across his career.\nDespite having host nation Cameroon in their group, Burkina Faso should expect to qualify for the knockout stages at AFCON 2021.\nMOHAMED BAYO (GUINEA)Mohamed Bayo comes into AFCON 2021 as Guinea’s major goal threat following a brilliant 18 months at club level.\nIn fact, no player has scored more goals inside the six-yard box than Bayo in Ligue 1 this season (four)."
  },
  {
    "headline": "Security agencies probe ex-NIA boss over alleged leaks, petitions",
    "summarized_story": "Some of the leaks, according to claims, were aimed at stopping the reappointment of the present NIA DG, Amb.\n- Advertisement -There were indications yesterday that the agencies might seek the extradition of the ex-NIA boss because some of the leaks allegedly traced to him fell into the hands of foreign intelligence agencies.\nAlthough the Federal Government has filed an appeal against the judgment, security agencies are said to be uncomfortable with Dauda’s alleged covert activities in Dubai.\nSecurity agencies claim that Dauda is still in possession of some “classified information” which he has allegedly been releasing to “hurt” Nigeria’s security system.\n“International security agencies were afraid to collaborate with their Nigerian counterparts because of such leaks."
  },
  {
    "headline": "“I will neither praise nor condemn you” – Kalu tells Ikpeazu",
    "summarized_story": "The Chief Whip of the Senate, Senator Orji Uzor Kalu has said he will not criticize or praise the Governor Okezie Ikpeazu-led administration because of some personal reasons.\nThe former Abia state governor disclosed this when he paid Govenor Okezie Ikpeazu a courtesy visit at his country home in Umuobiakwa, Obingwa LGA.\nI thank the governor for having me,” Senator Kalu said.\nHe explained that the meeting was first of its kind where he had a sincere discussion with Govenor Ikpeazu.\n“I want to thank the Governor, I will never praise nor criticize him in public but I thank him for been steadfast."
  },
  {
    "headline": "National Convention: APC crisis deepens as Govs Forum DG demands Buni, Akpanudoedehe’s resignation",
    "summarized_story": "Lukman, demanded immediate resignation of the Chairman and Secretary of Caretaker/Extraordinary Convention Planning Committee (CECPC), Governor Mai Mala Buni and Sen John James Akpanudoedehe, respectively.\nThe PGF DG hinged his demand for their resignation on their failure to put practical arrangements in place for the initially agreed February 5, 2022 APC National Convention.\n“As things are, if the APC National Convention is to hold February 5, 2022 as decided, by January 15, 2022, notice of the Convention must be transmitted to Independent National Electoral Commission (INEC) as required by the Electoral Act.\nSome of the speculations as the reasons for that include the alleged ambition of Mala Buni to manipulate his emergence as the substantive National Chairman of the party.\nFemi Gbajabiamila, Progressive Governors, Chief Bisi Akande, former APC Interim National Chairman Chief John Odigie-Oyegun, former APC National Chairman, Comrade Adams Oshiomhole, former APC National Chairman, Asiwaju Bola Ahmed Tinubu, APC National Leader, Dr. Ogbonnaya Onu, former National Chairman of ANPP and members of the CECPC."
  },
  {
    "headline": "Northern, Southern leaders list Buhari’s grave mistakes",
    "summarized_story": "If the Boko Haram members are given amnesty and political solution, they are also murderers; so, it should apply also the Kanu,” Pogu added.\n“On the issue of no political solution to free self-determination agitators like Nnamdi Kanu and Chief Sunday Adeyemo, better known as Sunday Igboho, everything about that issue is political.\nFor the president to say there is no political solution, it means he is not been realistic.\nSo, for Igboho, it has to be a political solution.\nThough I don’t know much about Nnamdi Kanu, the president cannot rule out political solution."
  },
  {
    "headline": "Lekki residents to Sanwo-Olu: Stop allocation of coastal road to private developers",
    "summarized_story": "Emadoye noted that the reluctance of the Lagos State Government to develop the coastal road, which offers the only access route for some residents in the area, has resulted in largescale illegal property development projects on the portion earmarked for the road.\nAccording to Emadoye, efforts by the residents, which took him meeting with government agencies in charge of physical development, to issue a ‘stop work order’ on the projects have been futile.\nDuring Babajide Sanwo-Olu’s campaign to become governor, he promised to ensure the development of the coastal road to ease the challenge residents face to reach their homes.\nJust last year, we began to notice building projects on the road.\nWe believe that this is also an indication that government is not ready to develop the road despite the huge revenue the state generates from Lekki."
  },
  {
    "headline": "Sexual harassment happens everywhere – Georgina Ibeh",
    "summarized_story": "For curvy Nollywood actress, Georgina Ibeh, sexual harassment takes place everywhere and not restricted to only the Nigerian entertainment sector.\nIn an encounter with Saturday Sun, the Imo State indigene and one of the most sought-after faces on TV, said, “Sexual harassment is everywhere; it’s in churches, schools, offices and entertainment sector, so why not our movie world?\nFor me, it is all about your ability to avoid all sorts and stay hopeful, believing that your hustle must pay off one day.\nWith the right curves at the right places, Georgina Ibeh says she’s indifferent when it comes to liposuction.\nIf liposuction makes you feel comfortable with yourself, why not?"
  },
  {
    "headline": "Heeding Buhari’s Advice, APC Govs Convene Emergency Meeting to Actualise National Convention",
    "summarized_story": "The aggrieved members want the court to issue an order restraining the Buni-led CECPC from going ahead with the convention.\nRecall that some members of the APC are clamouring for a change in date of the scheduled national convention.\nThe APC, Buni and the Independent National Electoral Commission (INEC) were listed as 1-3 defendants in the court processes.\nLukman stated this in a letter dated January 5, 2022 titled, “APC National Convention: Urgent Matters for the Survival of APC,” and addressed to the Chairman of PGF and Governor Atiku Bagudu of Kebbi State.\nLukman recalled that on Monday, January 3, 2022, he sent an open letter to all APC leaders titled “Plausibility of February 2022 APC Convention”, which highlighted some of the reasons the APC National Convention should not be postponed."
  },
  {
    "headline": "NNPC Must Focus on Profitability, Value Creation, Operate at Par with Global Industry Peers, Buhari Tells New Board",
    "summarized_story": "Buhari said: ”The Nigerian National Petroleum Company Limited is mandated to focus on profitability and continuous value creation beyond the simple fulfilment of legal and regulatory requirements.\n”NNPC Limited is expected to operate at par with its industry peers across the world, while acting as Enabler Company that will foster the development of other sectors of our Economy.\n”The inauguration of this Board is a major step in the ongoing transition to a more viable petroleum industry that will attract investment to support our economic growth and generate employment to millions of our people”.\nPresident, this is history in the making because this is the first time any President of the Federal Republic of Nigeria is inaugurating an independent board of an independent NNPC Limited.\nHenry Obih (South East); Barrister Constance Harry Marshal (South South); Chief Pius Akinyelure (South West); Dr. Nasir Sani Gwarzo, Permanent Secretary, Ministry of Petroleum Resources; and Aliyu Ahmed, Permanent Secretary, Ministry of Finance, Budget and National Planning."
  },
  {
    "headline": "Obasanjo: Unemployment Forcing Youths into Violent Groups, Kidnap Gangs",
    "summarized_story": "Our CorrespondentsFormer President Olusegun Obasanjo yesterday raised the alarm that many Nigerian youths “are enlisting in violent groups and kidnap gangs” owing to unemployment and the inability of government to manage the country’s population.\nObasanjo, who was speaking at the Oyewusi Ibidapo-Obe symposium in Lagos, also expressed worry about the country’s growing population, especially the unemployed youths.\nHe said political will and action were key to transforming the country’s population into an asset.\nHow do we keep them from enlisting in violent groups and gangs of kidnappers?\nPolitical will and political action can make the population an asset."
  },
  {
    "headline": "Buhari Names Ayo Gbeleyi as FMBN Board Chairman",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has approved the appointment of Mr Ayodeji Ariyo Gbeleyi as the Chairman of the Board of Directors of the Federal Mortgage of Bank of Nigeria (FMBN).\nAccording to a statement issued on Friday by Media Adviser to the President, Femi Adesina, Gbeleyi replaced Chief Adewale Adesoji Adeeyo, who passed on recently.\nA Chartered Accountant and an Associate of the Chartered Institute of Taxation, Gbeleyi is a well-known financial expert who was once a Commissioner for Finance in Lagos State as well as a player in the aviation sector.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "APC to Meet Sunday to Fix Date for National Convention, Says Lalong",
    "summarized_story": "Deji Elumoye in AbujaThe ruling All Progressives Congress (APC) is expected to meet on Sunday to choose a definite date in February 2022 for the conduct of its national convention.\nThis was disclosed to newsmen on Friday by the Chairman of the Northern Governors Forum and Plateau State Governor, Simon Lalong, after a closed-door meeting with President Muhammadu Buhari at the State House, Abuja.\nAccording to him, the Sunday meeting to be attended by APC governors in Abuja, will centre on the proposed date for the convention, adding that President Buhari’s admonition to the party that it risks losing power to the Peoples Democratic Party (PDP) is a signal for the party to have a seamless convention so that it will not disintegrate.\nHe said the governors have now given the president the assurance that the APC convention will still hold in February.\nDetails Later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: All Progressives Congress Cabals Trick President Buhari To Install Stooges As Commissioners In INEC To Pave Way For Manipulation Of Party Primaries, 2023 General Elections",
    "summarized_story": "Some political bigwigs in the ruling All Progressives Congress have started perfecting their plot of manipulating the party’s primaries and 2023 general elections by nominating proxies to President Muhammadu Buhari to be made electoral commissioners, SaharaReporters has gathered.\nSaharaReporters further learnt that the stooges planted by the cabals in the country's electoral agency, the Independent National Electoral Commission, had already been approved by Buhari, who was not diligent to be aware of the grand plot to manipulate the electoral process.\n\"In their calculation, if the plans they have in place for the party convention and party primaries lead to fragmentation, they need to have buffers.\nIn the South-West, Governor Kayode Fayemi of Ekiti was responsible for the Resident Electoral Commissioners and the commissioner elevated from the state.\nRecall that Silva also nominated Prof Braibafah as managing director of NDDC and was disgraced from office over corruption but the matter was swept under the carpet without prosecution till date."
  },
  {
    "headline": "EXCLUSIVE: All Progressives Congress Cabals Trick President Buhari To Install Stooges As Commissioners In INEC To Pave Way For Manipulation Of Party Primaries, 2023 General Elections",
    "summarized_story": "Some political bigwigs in the ruling All Progressives Congress have started perfecting their plot of manipulating the party’s primaries and 2023 general elections by nominating proxies to President Muhammadu Buhari to be made electoral commissioners, SaharaReporters has gathered.\nSaharaReporters further learnt that the stooges planted by the cabals in the country's electoral agency, the Independent National Electoral Commission, had already been approved by Buhari, who was not diligent to be aware of the grand plot to manipulate the electoral process.\n\"In their calculation, if the plans they have in place for the party convention and party primaries lead to fragmentation, they need to have buffers.\nIn the South-West, Governor Kayode Fayemi of Ekiti was responsible for the Resident Electoral Commissioners and the commissioner elevated from the state.\nRecall that Silva also nominated Prof Braibafah as managing director of NDDC and was disgraced from office over corruption but the matter was swept under the carpet without prosecution till date."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari To Begin 2022 Travels With Trip To Gambia Next Week",
    "summarized_story": "Nigeria's President, Muhammadu Buhari, who is notorious for embarking on trips around the world, will be jetting out to The Gambia by next week, SaharaReporters has learnt.\nSee Also Exclusive EXCLUSIVE: Junketing Nigerian President, Buhari To Visit Borno ThursdayRecall that SaharaReporters had on December 1, 2021 reported how Buhari departed the country to attend the Expo 2020 in Dubai, United Arab Emirates.\nThe Nigerian President has been junketing across the world in the last four months.\nSee Also Exclusive EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China TripIn September 2021, Buhari travelled to New York, United States, to participate in the 76th Session of the United Nations General Assembly.\nOn Tuesday, November 9, 2021, Buhari departed London for Paris, France."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari To Begin 2022 Travels With Trip To Gambia Next Week",
    "summarized_story": "Nigeria's President, Muhammadu Buhari, who is notorious for embarking on trips around the world, will be jetting out to The Gambia by next week, SaharaReporters has learnt.\nSee Also Exclusive EXCLUSIVE: Junketing Nigerian President, Buhari To Visit Borno ThursdayRecall that SaharaReporters had on December 1, 2021 reported how Buhari departed the country to attend the Expo 2020 in Dubai, United Arab Emirates.\nThe Nigerian President has been junketing across the world in the last four months.\nSee Also Exclusive EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China TripIn September 2021, Buhari travelled to New York, United States, to participate in the 76th Session of the United Nations General Assembly.\nOn Tuesday, November 9, 2021, Buhari departed London for Paris, France."
  },
  {
    "headline": "Students Kick As Seventh-Day Nursing School Slams N5,000 Compulsory COVID-19 Test On Attendees",
    "summarized_story": "Students of Seventh-Day Adventist School of Nursing, Lagere, Ile Ife, Osun State, have kicked against the imposition of N5,000 Coronavirus test fee by the school's management on each of them.\n“Every student is required to undergo a mandatory COVID-19 test on resumption.\nHowever, some students who spoke with SaharaReporters, described the fee as insensitive on the part of the school authorities.\n“The test we did last year, you won’t believe we weren’t given the result till now.\nAll my friends are lamenting now, but nobody can face the school management."
  },
  {
    "headline": "Moses Simon, Joe Aribo, Ola Aina… meet the 28 Eagles flying Nigeria's flag at AFCON",
    "summarized_story": "Francis UzohoAdvertisementInjuries and poor form cost the Aspire Football Academy product his place as the undisputed number one goalie of the Super Eagles.\nHe will be keen to silence his doubters when the Super Eagles take to the pitch.\nFrank OnyekaThe jewel in Brentford’s crown, Onyeka has enhanced his reputation as one of the Super Eagles’ best midfielders.\nKelechi IheanachoThe striker is already an integral part of the Super Eagles team and has everything it takes to light up the AFCON.\nThe Super Eagles have been crying out for ball-playing wingers for years and suddenly have four at once!"
  },
  {
    "headline": "Moses Simon, Joe Aribo, Ola Aina… meet the 28 Eagles flying Nigeria's flag at AFCON",
    "summarized_story": "Francis UzohoAdvertisementInjuries and poor form cost the Aspire Football Academy product his place as the undisputed number one goalie of the Super Eagles.\nHe will be keen to silence his doubters when the Super Eagles take to the pitch.\nFrank OnyekaThe jewel in Brentford’s crown, Onyeka has enhanced his reputation as one of the Super Eagles’ best midfielders.\nKelechi IheanachoThe striker is already an integral part of the Super Eagles team and has everything it takes to light up the AFCON.\nThe Super Eagles have been crying out for ball-playing wingers for years and suddenly have four at once!"
  },
  {
    "headline": "TRENDING VIDEO: Imo lawmaker furious after constituents asked him not to run for another term",
    "summarized_story": "Chiji Collins, a member representing Isiala Mbano state constituency in Imo, reacted in anger after a constituent challenged him for lack of performance.\nIn a trending video on social media, a constituent questioned Collins’ performance as a lawmaker in the last four years.\nHe faulted the lawmaker, saying he doesn’t deserve another term and should step down.\nAdvertisementHowever, when the young man refused and kept pointing out faults, the lawmaker angrily pushed the table in front of him, overturning the plate of kola nuts for the meeting.\nThe development caused a commotion as the meeting ended with the lawmaker’s allies trying to calm him down and control the crowd."
  },
  {
    "headline": "TRENDING VIDEO: Imo lawmaker furious after constituents asked him not to run for another term",
    "summarized_story": "Chiji Collins, a member representing Isiala Mbano state constituency in Imo, reacted in anger after a constituent challenged him for lack of performance.\nIn a trending video on social media, a constituent questioned Collins’ performance as a lawmaker in the last four years.\nHe faulted the lawmaker, saying he doesn’t deserve another term and should step down.\nAdvertisementHowever, when the young man refused and kept pointing out faults, the lawmaker angrily pushed the table in front of him, overturning the plate of kola nuts for the meeting.\nThe development caused a commotion as the meeting ended with the lawmaker’s allies trying to calm him down and control the crowd."
  },
  {
    "headline": "'It will cause mass hunger, hardship' -- NLC rejects new tax on carbonated drinks",
    "summarized_story": "The Nigeria Labour Congress (NLC) has rejected the federal government’s introduction of N10/litre on all non-alcoholic, carbonated and sweetened beverages.\n“A similar situation is playing out with the soft drinks manufacturing sub-sector.\n“There is thus no gainsaying the fact that the industry is a golden goose that must be kept alive.”AdvertisementHe said an additional increase in the retail price of carbonated drinks would put more Nigerians at risk of serious health challenges as many people would resort to consuming sub-standard drinks as substitutes for carbonated drinks.\nWhile the government will only make total projected receipts of N81 billion from the proposed re-introduction of the excise duties.\nNLC, therefore, asks the national assembly to quickly amend the sections of the Finance Act that re-introduced excise duties on non-alcoholic and carbonated drinks."
  },
  {
    "headline": "On the making of King of Boys, Netflix’s first original Nigerian series",
    "summarized_story": "KOB 2 was well received by movie lovers as it topped Netflix’s top-ten movie charts for many weeks.\nMA: Interestingly, as at the time we started shooting KOB 2, I don’t think it was confirmed as a Netflix original.\nDA: Considering that this was Netflix’s first Nigerian original series, how much technical support did Netflix bring in?\nDA: What was the difference between shooting a regular movie and a 7-part series?\nMA: Another thing that’s noteworthy is that, when we finished shooting King of Boys, nobody knew we had shot a series."
  },
  {
    "headline": "Cameroon risks stunting mobile money growth with new transaction levy",
    "summarized_story": "Among Cameroonians, new year celebrations have so far coincided with pushback against a new tax on mobile money transactions introduced by the Paul Biya administration.\n#WeSayNo.”The new mobile money tax will especially hit the poorest, unbanked segments of Cameroon society.\nA later study also points out that many mobile money users belong to “marginalised societal groups” hence the negative impact on financial inclusion and broader development goals of mobile money taxes is significant.\nSimilarly, a 1% tax on mobile money transactions in Uganda was cut in half after protests.\nUnlike Ghana’s case, however, citizens were barely informed of the details before Cameroon’s government implemented the new mobile money tax in November, according to local media reports."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "African startups raised $1 million every 2 hours in 2021 — Africa: The Big Deal",
    "summarized_story": "Odunayo Eweniyi, Co-founder, FirstCheck AfricaThe Big Deal reports that only 0.95% of the funding raised by African startups went to startups founded or led by a woman.\nAccording to Briter Bridges, 62% (~$2.9 billion) of total funding in African startups went to fintech startups, double the 31% recorded in 2020.\nMax AB, an Egyptian eCommerce startup raised a $55 million Series A across two rounds in 2021.\nSource: SuppliedSome startups that raised at least $100 million include Andela, $200 million Series E; Flutterwave, $170 million Series C; Chipper Cash, $250 million Series C across two separate rounds; OPay, $400 million Series C; Trade Depot, $110 million Series B; and Jumo, $400 million led by Fidelity Management & Research Company.\nWith the heights reached by African startups in 2021, it is logical to expect them to be matched and hopefully eclipsed in 2022."
  },
  {
    "headline": "Fintech predictions in 2022, LinkedIn’s Clubhouse-like platform, JABU’s $3.2m seed",
    "summarized_story": "Today, I’m discussing:2022 predictions for the fintech industryLinkedIn’s Clubhouse-like platformJABU’s $3.2m fundWhat does 2022 hold for the fintech industry?\nHere’s Emmanuel Paul’s take on that: Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin.\nThe new events platform will begin with an audio-only product — clubhouse-style audio events — released in beta this January.\nAdvertisementIn March 2021, LinkedIn confirmed that it has been working on a Clubhouse rival to cultivate a larger and more active Creator community.\nAfore Capital, Y Combinator, FJ Labs, Quiet Capital, Kli Capital, Pareto Capital, among other unnamed investors, participated in the round."
  },
  {
    "headline": "Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin",
    "summarized_story": "That’s how significant the exponential growth in the fintech space has been in recent years, and it creates room for bullishness in the space.\nFor instance, Nigerian fintech funding in 2021, $800 million, was 120% higher than funding in the last three years combined.\nPhoto by Kglavin via Wikipedia CommonsIn 2021, Africa minted five unicorns, two of which were Nigerian fintech companies.\nIt’s unlikely that WhatsApp’s payment play would be good news to existing banks and fintech players.\nWhat do you think about predictions for the fintech space?"
  },
  {
    "headline": "How 10 Nigerian startups have fared after Y Combinator funding",
    "summarized_story": "Founded in March 2005, Y Combinator is a famous startup accelerator, which selects tech startups to take part in its programme twice yearly.\nFor the purpose of this, 10 startups who have featured in Y Combinator’s funding are being highlighted in terms of their expansion and acquisitions.\nNigeria accounts for 50 percent of the 60 tech companies from Africa that have received funding from Y Combinator.\nThe startup raised $150,000 twice in March 2019 as its first funding, and is seen to be making progress.\nKobo360 (logistics)Kobo is a technology company providing SMEs with solutions to challenges faced with their ability to scale."
  },
  {
    "headline": "Concerns over increasing aircraft amid limited parking spaces at airports",
    "summarized_story": "Industry operators have raised concerns over inadequate parking spaces across Nigerian airports amid plans by existing airlines to acquire new aircraft just as new airlines are set to commence operations in 2022.\nHowever, there are concerns about the capacity of the airports to contain these aircraft and passenger surge if the economy gets better.\nHe also advised airlines to consider making less busy airports their hub and operational base to decongest traffic at busy airports.\nFAAN needs to extend the operational hours of these airports to reduce the bottlenecks in the major airports.\nHe also said the Federal Government needs to ensure the uncompleted terminals in Lagos and Enugu are completed to reduce bottlenecks in other airports."
  },
  {
    "headline": "Blue chip vs red chip art",
    "summarized_story": "Seasoned art collectors are very familiar with the terms “blue chip art” and albeit newly coined, “red chip art”.\nBlue chip art.\nIn art, blue chip art is created by the world’s most renowned artists whose works and position in the art market have been reinforced by many years of extraordinary sales volume.\nIf you’re looking for consistent high value art investment, blue chip art is your best option.\nRed chip artists do not enjoy the type of support and recognition blue chip artists get."
  },
  {
    "headline": "Kids Club Charity Donates Educational Materials To Schools In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In its resolved to helping humanity particularly the downtrodden and vulnerable in the society, one of the leading Non Governmental Organisations (NGO) in the country, Kids Club Charity, recently distributed “back to school materials” to schools across Edo state.\nSome of the ‘back to school items’ distributed by the NGO include School Uniforms; Sandals; books, biros and other educational materials.\nThe Kids Club Charity which is the brainchild of Dr. Awele Eucharia Ilobah, according to her is an NGO that is committed to catering for the less privileged and vulnerable children in the society.\nIn their separate remarks, the beneficiary schools and children expressed appreciations and commended the humanitarian gesture of Kids Club Charity for reaching out to them.\nAt the end of the NGO 2021 annual humanitarian services, about 20 schools were reached."
  },
  {
    "headline": "DOCUMENTING EDO STATE GOVERNMENTS – Nigerian Observer",
    "summarized_story": "As a journalist, writer and social scientist I have interacted with hundreds of politicians, public office seekers, academics, civil servants, clerics, critics and scores of other individuals in Edo State.\nFollowing this development, I resolved to start documenting all Edo State Governments in power since 2007 for public consumption beginning with Comrade Adams Aliu Oshiomhole whose administration oversaw the affairs of Edo State from 2007-2016.\nMaterials used for government documentation are from on/offline sources, most especially reports carried in the state-owned Nigerian Observer published by Bendel Newspapers Company Limited with headquarters in Benin City, capital of Edo State.\nGovernor Godwin Nogheghase Obaseki assumed office as Edo State Governor on November 12, 2016.\nRather, the works were put together by a team of researchers who believe passionately in providing resources material with which Edo citizens and other interested persons can get relevant facts about Edo State Government."
  },
  {
    "headline": "With 40MW power plant operational, investors scramble for space in Benin Industrial Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as Edo govt earmarks 100ha for first phase, assures incentives for investors… Ossiomo Power generation capacity now 95MWBENIN CITY – With the coming on stream of the 40MW Independent Power Plant (IPP) built by Ossiomo Power and dedicated to provide power to the Benin Industrial and Enterprise Park, investors are trooping in to harness the benefit of the 24-hour electricity and other benefits available at the mixed-purpose park.\nOssiomo Power had announced that its new 40MW plant became operational in December 29 and had already connected and powering Ologbo and Obayantor communities in Ikpoba Okha Local Government Area of the State.\nThe new plant increases the generation capacity of Ossiomo Power to 95MW, as a 55MW plant had been operational since 2020.\nManaging Director, Edo State Investment Promotion Office (ESIPO), Kelvin Uwaibi, in a chat with journalists, said the state government has earmarked 100 hectares for the first phase of the mixed-purpose Benin Industrial and Enterprise Park, which measures about 997-hectares.\nAccording to him, “We are being inundated by enquiries from investors and are ready for those who want to set up shop as quick as possible."
  },
  {
    "headline": "Obaseki advances on digital economy, to provide optic fibre connectivity across 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain ongoing reforms and programmes aimed at achieving digital economy in the state, promising to provide fibre optic connectivity to all Edo communities to enhance access to the internet and expand the state’s digital economy.\nObaseki, who spoke to journalists in Benin City, said his administration is committed to building physical and digital infrastructure, leveraging technology to drive sustainable growth and development in the state.\nHe stated, “Our operation Light Up Edo is in full gear with the street-lighting project being rolled out in Benin City, Ekpoma and Auchi.\n“As a government, we are recommitting ourselves to deepen growth across all sectors of the state and provide more opportunities for our people to realise their full potential.\nThese we will do by leveraging the innate abilities of our people and providing them with the tools and enablement to dominate and conquer their world.”..."
  },
  {
    "headline": "Buhari appoints Ayodeji Gbeleyi Federal Mortgage Bank Chairman",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has appointed Ayodeji Gbeleyi as board chairman of the Federal Mortgage of Bank of Nigeria (FMBN), the apex mortgage finance institution in the country which regulates the activities of primary mortgage loan originators.\nThe appointment was announced on Friday in a statement issued by Femi Adesina, special adviser to the president on media and publicity.\n“President Muhammadu Buhari has approved the appointment of Mr Ayodeji Ariyo Gbeleyi as the Chairman of the Board of Directors of the Federal Mortgage of Bank of Nigeria (FMBN),” the statement said.\n“A Chartered Accountant and an Associate of the Chartered Institute of Taxation, Gbeleyi is a well-known financial expert who was once a Commissioner for Finance in Lagos State as well as a player in the aviation sector.\n“He replaces Chief Adewale Adesoji Adeeyo who passed on recently.”Gbeleyi was a former commissioner for finance in Lagos during the tenure of Babatunde Fashola."
  },
  {
    "headline": "Ugwuanyi summons security meeting as bandits kill traders in Enugu community",
    "summarized_story": "The Enugu State governor, Hon.\nIfeanyi Ugwuanyi, has summoned an “emergency security meeting” with stakeholders following the killing traders by bandits in Eha-Amufu community, Isi-Uzo LGA of the state on Thursday.\nSteve Oruruo, media aide to the governor who disclosed this in a statement, said the meeting will take place on Saturday at the Enugu government house.\nThose expected at the meeting are the chairman of the Isi-Uzo LG council, heads of security agencies, traditional rulers of autonomous communities in Eha-Amufu, presidents-general of autonomous communities in Eha-Amufu, youth leaders, clerics, and heads of vigilante groups in the area.\nThe bandits had unleashed attack on the community killing at least two people, while several properties were razedThe Enugu police command which confirmed the incident on Friday in a statement by Daniel Ndukwe, its spokesperson, said information gathered during an assessment tour of the community revealed that the traders were attacked at Orie market in Ogbete-Mgbuji village on Thursday."
  },
  {
    "headline": "Equity bulls deflated by hawkish Fed",
    "summarized_story": "Given the market reaction to a more hawkish Fed, global equities certainly remain highly sensitive to increased rate hike expectations.\nWith the US December jobs report around the corner, the atmosphere across the board could become tense and nervy as investors adopt a cautious stance.\nIt’s all about the US non-farm payrollsAll eyes are now firmly focused on December’s US jobs report which will be released on Friday.\nThe March Fed meeting is now very much “live” with an 80% chance of an interest rate hike.\nSuch a development may result in a stronger dollar while pressuring equity bulls and gold further."
  },
  {
    "headline": "Nigerian govt spends $1.68bn on food imports in nine months",
    "summarized_story": "According to the report, $184.69m, 188.88m and 271.59m were spent in July, August and September, respectively.\n“We have to do everything possible to reduce the rate of unemployment in the country.\nEmefiele said the CBN recently unveiled the ‘100 for 100’ policy on production and productivity to engender growth and employment.\nAccording to him, under the programme, targeted credit of up to N5bn will be provided to 100 firms every 100 days, provided the firms are investing in greenfield projects.\nThe CBN governor said the bank remained committed to supporting eligible firms with foreign exchange to import machinery and equipment."
  },
  {
    "headline": "Amotekun Deploys Operatives To Prisons In Ondo",
    "summarized_story": "Following the withdrawal of men of the Nigerian Army from the Correctional Centers across the State, the Ondo State Security Network Agency, also known as Amotekun Corps, has deployed its officers to correctional centres in the state.\nApart from Amotekun, other security agencies in the state, including the Nigeria Police Force and the Nigeria Security and Civil Defence Corps, (NSCDC), have also deployed their men to complement the efforts of the officers of the custodial centres.\nLEADERSHIP investigation revealed that the deployment was initiated by the state governor, Oluwarotimi Akeredolu, to prevent any breach of security, particularly jailbreaks in the state.\nSpeaking with journalists in Akure, the state capital, Amotekun Commander, Chief Adetunji Adeleye, said the correctional centres which are the Federal Government’s responsibilities ought to be the responsibility of the federal security agencies to provide adequate protection for the facilities.\nADVERTISEMENTAccording to Adeleye, “As soon as that incident (soldiers withdrawal) happened, the police and the NSCDC immediately deployed their men to all the correctional centres."
  },
  {
    "headline": "APC Govs To Choose Convention Date Sunday – Lalong",
    "summarized_story": "Plateau State governor, Simon Lalong, has disclosed that the Progressive Governors’ Forum (PGF) will give a date for the All Progressives Congress (APC) national convention after its meeting on Sunday.\nADVERTISEMENTThe caretaker chairman of the APC, Governor Mai Mala Buni of Yobe State also met with the President on Thursday.\nHowever, Lalong said the governors were working assiduously to hold the party’s convention next month.\nI think our first date before Christmas we said we’re going to do a convention in February and we are still working for convention, as far as I’m concerned, except things change from another angle.\nADVERTISEMENT“People will come with different interests and so when you are preparing like this, you have different interests and those different interests will be aired in different ways."
  },
  {
    "headline": "Bauchi Govt Drags Dogara, Others To Court Over Bogoro Violence",
    "summarized_story": "The Bauchi State government has dragged a former Speaker of the House of Representatives, Barr.\nYakubu Dogara, and 28 others before a State High Court for 11-count criminal charges.\nThe eleven count suit reads in part: “Pursuant to Sections 98 (1) & (2), 100 (b) and 103 (b) of the Administration of Criminal Justice Law of Bauchi State, 2018.\nYakubu Dogara, male of Maitama, Abuja-FCT, Air Commodore Ishaku Komo (Rtd), male of Kaduna-Abuja Road, Kaduna, Kaduna State, Rev.\nNo date has been fixed for the commencement of the case but court processes were being served as indicated by the charge sheet."
  },
  {
    "headline": "Bauchi Govt Drags Dogara, Others To Court Over Bogoro Violence",
    "summarized_story": "The Bauchi State government has dragged a former Speaker of the House of Representatives, Barr.\nYakubu Dogara, and 28 others before a State High Court for 11-count criminal charges.\nThe eleven count suit reads in part: “Pursuant to Sections 98 (1) & (2), 100 (b) and 103 (b) of the Administration of Criminal Justice Law of Bauchi State, 2018.\nYakubu Dogara, male of Maitama, Abuja-FCT, Air Commodore Ishaku Komo (Rtd), male of Kaduna-Abuja Road, Kaduna, Kaduna State, Rev.\nNo date has been fixed for the commencement of the case but court processes were being served as indicated by the charge sheet."
  },
  {
    "headline": "Station Attack: Imo Police Begin Manhunt For Suspects",
    "summarized_story": "The Imo State Commissioner of Police, Rabiu Hussaini, has announced a manhunt of suspects with bullet wounds in connection with the attack on the Ideato South Police station.\nHe explained that the manhunt was for suspects who sustained gunshot wounds during the shoot-out with policemen on Thursday.\nAbattam appealed to residents especially in the Ideato South local government area with any information to immediately inform the police.\nADVERTISEMENTHe said the gunmen invaded the station after they threw in improvised explosive device, after which they engaged the police in a gun duel.\nHowever, no life was lost while the suspected hoodlums sustained gunshot wounds and ran into the surrounding bush."
  },
  {
    "headline": "Oyo woman cries to court: My husband wants to kill me with too much sex",
    "summarized_story": "Oyo woman cries to court: My husband wants to kill me with too much sexOyo woman cries to court: My husband wants to kill me with too much sexA mother of three, Olamide Lawal, on Friday pleaded with a Grade ‘A’ Customary Court in Mapo, Ibadan, to grant her divorce on grounds that her husband, Saheed Lawal, engages her with too much sex.\nIn her petition, Mrs Lawal, who lives in Ibadan, also accused her husband of being a drunk.\nShe further pleaded with the court to restrain her husband from calling her mobile phone or visiting her apartment.\nMr Lawal, however, prayed the court to pacify his wife to remain with him.\nAkintayo, the president of the court, who adjourned the matter until March 1 for judgment, advised the couple to maintain peace."
  },
  {
    "headline": "Oyo woman cries to court: My husband wants to kill me with too much sex",
    "summarized_story": "Oyo woman cries to court: My husband wants to kill me with too much sexOyo woman cries to court: My husband wants to kill me with too much sexA mother of three, Olamide Lawal, on Friday pleaded with a Grade ‘A’ Customary Court in Mapo, Ibadan, to grant her divorce on grounds that her husband, Saheed Lawal, engages her with too much sex.\nIn her petition, Mrs Lawal, who lives in Ibadan, also accused her husband of being a drunk.\nShe further pleaded with the court to restrain her husband from calling her mobile phone or visiting her apartment.\nMr Lawal, however, prayed the court to pacify his wife to remain with him.\nAkintayo, the president of the court, who adjourned the matter until March 1 for judgment, advised the couple to maintain peace."
  },
  {
    "headline": "Sidney Poitier, Oscar-winning actor and Hollywood’s first Black movie star, dies at 94",
    "summarized_story": "Sidney Poitier, whose elegant bearing and principled onscreen characters made him Hollywood’s first Black movie star and the first Black man to win the best actor Oscar, has died.\n“He said, ‘take care of yourself, son.’ And he turned me around to face the boat,” Poitier told NPR in 2009.\n“That man, every night, the place is closed, everyone’s gone, and he sat there with me week after week after week,” Poitier told CBS News.\nActor Sidney Poitier, left, with actor Tony Franciosa, talk show host David Susskind, singer Harry Belafonte and actress Shelley Winters on the talk show “Open End” in 1960 in New York City.\nThere was almost no frame of reference for us except as stereotypical, one-dimensional characters,” Poitier told Winfrey."
  },
  {
    "headline": "Sidney Poitier, Oscar-winning actor and Hollywood’s first Black movie star, dies at 94",
    "summarized_story": "Sidney Poitier, whose elegant bearing and principled onscreen characters made him Hollywood’s first Black movie star and the first Black man to win the best actor Oscar, has died.\n“He said, ‘take care of yourself, son.’ And he turned me around to face the boat,” Poitier told NPR in 2009.\n“That man, every night, the place is closed, everyone’s gone, and he sat there with me week after week after week,” Poitier told CBS News.\nActor Sidney Poitier, left, with actor Tony Franciosa, talk show host David Susskind, singer Harry Belafonte and actress Shelley Winters on the talk show “Open End” in 1960 in New York City.\nThere was almost no frame of reference for us except as stereotypical, one-dimensional characters,” Poitier told Winfrey."
  },
  {
    "headline": "Nnamdi Kanu: Political solution still being pursued",
    "summarized_story": "Former Deputy President of the Senate, Senator Ike Ekweremadu, has said a political solution is still being pursued concerning the case of the leader of the Indigenous People of Biafra, Nnamdi Kanu.\nReacting, Ekweremadu, in an interview with Dream FM, Enugu, said he doesn’t think Buhari ruled out a political solution to Kanu’s case.\nThe Senator said, “Political solution in the Nnamdi Kanu’s matter is still very feasible.\nI also watched the Channels Television interview and I don’t think Mr. President ruled out a political solution.\nIn fact, I would have been surprised if he said he would just release Nnamdi Kanu because there is the independence of every arm of government, including the judiciary."
  },
  {
    "headline": "BREAKING: Valuables Worth Millions Of Naira Destroyed As Fire Razes Popular Market In Yobe",
    "summarized_story": "BREAKING: Valuables Worth Millions Of Naira Destroyed As Fire Razes Popular Market In YobeAccording to reports, a fire consumed Nguru Central Market in Yobe State’s Nguru Local Government Area, destroying valuables worth millions of naira.\nThe fire started around 8:00 a.m. on Saturday, according to witnesses.\nThey further stated that the fire started in the shoe and plastic sectors and spread to several stores.\nAt the time of filing the report, the cause of the fire was said to be unknown."
  },
  {
    "headline": "‘We Have Won, Stop Spreading False Informations,’ Dowen College Tells Nigerians",
    "summarized_story": "“Our truth has won,” according to the management of Dowen College in Lagos, which has advised Nigerians to stop circulating false information concerning the death of a 12-year-old pupil, Sylvester Oromoni.\nThis is according to a statement released by the school on Friday, just days after the Lagos State government cleared its pupils and employees of any wrongdoing in the death of a former student.\nDowen College believes it is past time for Nigerians to let Sylvester’s 12-year-old soul rest in peace.\nOn Wednesday, the Lagos State Ministry of Justice’s Director of Public Prosecution (DPP) stated that there was insufficient evidence to prove that the arrested students were members of an illegal society.\nBut Dowen College said that “we do not know under what circumstances the accused names were mentioned,” adding that it had “no response” to that."
  },
  {
    "headline": "Over 200 Residents Buried As Bandits Raze Zamfara Communities In Fresh Attacks",
    "summarized_story": "Over 200 Residents Buried As Bandits Raze Zamfara Communities In Fresh AttacksAfter gunmen suspected of being bandits invaded various towns in Zamfara State’s Anka and Bukkuyum local government areas, almost 200 dead were found and buried.\nBarayar Zaki, Wanu, Rafin Gero, Laho, Lallaho, Kurfar Danya, Dutsin Dan Ajiya, Tungar Geza, Kewaye, and Tungar Na More are some of the communities.\nOver 200 bodies have been discovered from bushes, according to SaharaReporters, while some people were caught off guard on their farmlands.\nBanditry had blossomed in Zamfara State, and deadly attacks have raged across the state.\nDespite this, towns throughout the state continue to be assaulted, with residents being kidnapped and killed."
  },
  {
    "headline": "Christmas Amnesty: Ethiopia frees rebel leaders",
    "summarized_story": "Ethiopia’s government says it will free several prominent opposition figures as the country marks Orthodox Christmas.\nLeaders of the rebel Tigrayan People’s Liberation Front (TPLF) will be among those pardoned in the amnesty.\nAnnouncing the new amnesty, the government communications service said in a statement that the “key to lasting unity is dialogue.\nHaving advanced to within 300km (186 miles) of the capital, Addis Ababa, TPLF forces have been forced to retreat in recent weeks after a resurgence from government forces.\nThe Tigray conflict broke out in November 2020 after Mr Abiy ordered a military offensive against regional forces in the area."
  },
  {
    "headline": "More jitters as Lassa fever ‘returns’ amidst rising Covid-19 Omicron cases",
    "summarized_story": "This was disclosed in the agency’s latest Lassa fever situation report for week 49 spanning from December 6-20.\nSimilarly, two senior consultant gynecologists have reportedly died of Lassa fever at the Dalhatu Arafat Specialist Hospital (DASH) in Lafia, Nasarawa state.\nNMA’s warningsMeanwhile, the Nigerian Medical Association (NMA) has advised the country to prepare for possibly fresh and deadlier Lassa fever outbreaks.\nHe said, “Lassa fever is a severe and often-fatal hemorrhagic illness caused by Lassa virus.\nInstead of witnessing a decline in yearly infection rates, Lassa fever cases appear to have become more widespread in the country."
  },
  {
    "headline": "Joining APC won’t save corrupt politicians from trial – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari has said joining the ruling All Progressives Congress (APC) by corrupt politicians would not save them against prosecution by anti-graft agencies.\nThe president said this in an interview with the Nigeria Television Authority (NTA) monitored in Abuja.\nHe said: “I don’t like to accept that joining our party will check our insistence on accountability.\nSo, the party, because I’m concerned about my party, the party, in all constituents, they will know their positions, coming up.\n“The age is telling on me, working now for 6,7,8 hours a day flight in the office is no joke."
  },
  {
    "headline": "NLC Rejects FG’s Plan To Increase Tax On Carbonated Drinks",
    "summarized_story": "The Nigeria Labour Congress (NLC) is rejecting plans by the Federal Government to increase taxes on non-alcoholic and carbonated drinks.\nThe NLC, therefore, asked the National Assembly to urgently amend the sections of the Finance Act which re-introduced excise duties on non-alcoholic and carbonated drinks.\nSome of the provisions of the Finance Act includes the imposition of excise duties on locally produced non-alcoholic, carbonated, and sugary drinks.\nA similar situation is playing out with the soft drinks manufacturing sub-sector.\nThe truth of the matter is that an additional increase in the retail price of carbonated drinks would put more Nigerians at risk of serious health challenges as many people would resort to consuming sub-standard and unhygienic drinks as substitutes for carbonated drinks."
  },
  {
    "headline": "VIDEO: Sylvester Oromoni’s Death Not Caused By Poison, Torture – Police",
    "summarized_story": "Police authorities in Lagos State on Friday said the 12-year-old student of Dowen College in Lekki, Sylvester Oromoni, died a natural death.\nThe briefing held two days after the Lagos State government cleared the students and employees of the school accused of complicity in the death of Sylvester.\nThe corpse was, therefore, moved with armed police escorts from Delta State to Lagos State by TOS Funeral and the autopsy conducted at the expense of the Lagos State Government.\nCSP Rasak Oseni, Homicide Section, represented the Nigeria Police Force, Lagos State Command.\nDSP Olusegun Bamidele, Homicide Section, also represented the Nigeria Police Force, Lagos State CommandXiv."
  },
  {
    "headline": "APC Convention: Aggrieved Members Take Buni-Led Committee To Court",
    "summarized_story": "Some aggrieved members of the All Progressive Congress (APC) have taken the Gov.\nBuni led Caretaker- and Extraordinary Convention Planning Committee before a Federal High Court in Abuja, over plans to hold a national convention in February.\nJoined as defendants in the suit are the APC, the Chairman, All Progressives Congress’ Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission (INEC).\nThey raised five questions for the court to determine and also sought eight declarative reliefs.\nAlso included in reliefs asked for, is an order of the court directing the 1st and 2nd defendant to first conduct state congresses in Anambra state and Zamfara state before national convention of the 1st defendant (APC) can be scheduled and conducted."
  },
  {
    "headline": "Omicron Is Not ‘Mild’, Kills People Like Other Variants – WHO",
    "summarized_story": "The Omicron variant of Covid-19 is killing people across the globe and should not be dismissed as mild, the World Health Organization insisted Thursday.\n“While Omicron does appear to be less severe compared to Delta, especially in those vaccinated, it does not mean it should be categorised as mild,” Tedros told a press conference.\n“Just like previous variants, Omicron is hospitalising people and it is killing people,” he explained.\nIn facing the more transmissible Omicron variant, Van Kerkhove urged people to step up the measures they were already taking to protect themselves against the virus.\n[READ ALSO] COVID-19: Election Rallies Cancelled As India Sees Omicron Surge“Do everything that we have been advising better, more comprehensively, more purposefully,” she said."
  },
  {
    "headline": "Ethiopia Frees High-Profile Political Prisoners",
    "summarized_story": "The Ethiopian government announced Friday it was pardoning a number of high-profile political prisoners, including members of the rebel Tigray People’s Liberation Front (TPLF), in a bid to promote “national dialogue”.\nEthiopia will make any sacrifices to this end,” the government communications service said in a statement announcing the amnesty.\nIt was not immediately clear how many of those granted amnesty had yet been freed.\nUN Secretary-General Antonio Guterres said in a statement on Twitter he welcomed the amnesty announcement.\n“I will remain actively engaged in assisting Ethiopia to bring an end to the fighting and to restore peace and stability,” he added."
  },
  {
    "headline": "Aggrieved APC members ask court to stop national convention -",
    "summarized_story": "Some aggrieved members of the All Progressives Congress have made fresh moves to stop the national convention from holding next month.The plaintiffs are seeking an order of the Federal High Court in Abuja to restrain the Gov.\nBuni-led Caretaker- and Extraordinary Convention Planning Committee from going ahead with the convention on the grounds that state congresses are yet to be completed in all the 36 states of the federation.\nJoined as defendants in the suit are the APC, the Chairman of the APC Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission.\nNo date has been fixed for a hearing of the case."
  },
  {
    "headline": "National Convention: APC Govs set to meet President Buhari",
    "summarized_story": "Governors of the All Progressives Congress will on Sunday with President Muhamadu Buhari on Sunday to decide on a date for the party’s National Convention.\nPlateau State Governor and Chairman of the Northern Governors Forum Simon Lalong made this known after a meeting with the President on Friday.\nHe said President Buhari assured that nothing would stop the APC from conducting the convention in February, hence the resolve by the governors to harmonise all interests and pending litigations.\nThe President had raised fears that a failure by the APC to hold a National Convention expeditiously would negatively impact on its chances of success in coming electionsBut Governor Lalong assures that since the President remains resolved that conventions must be held immediately, Governors would do their parts to make this work.\nMeanwhile the Chairman of the Caretaker and Convention Planning Committee of the APC Governor Mai Mala Buni Yobe state, was also at the Presidential Villa."
  },
  {
    "headline": "Gov Bello commends local contractor 'Alhaji Friday' for excellent work -",
    "summarized_story": "Kogi State governor, Yahaya Bello, has commended a local contractor, popularly known as Alhaji Friday, for his outstanding performance in the handling of a project in the state.\nThe governor who gave the commendation after inspecting the multibillion naira Civic centre project, said he is impressed by his performance.\nIn his words, ” I have heard enough about this project, so I decided to come and see for myself, I couldn’t believe what I am seeing.\n“This is a definition of “follow who know road make you no enter portor-portor.\n“This is Alhaji Friday, Alhaji Friday the man that is making things happen, he is a Kogiet, he did this job, look around, this is not Julius Berger’s work, it is the hand work of this young man,” Gov Bello’s remarked."
  },
  {
    "headline": "We are not involved in war of words over insecurity",
    "summarized_story": "The All Progressive Congress APC loyal to Senator Kabiru Marafa in Zamfara state has distance self from the recent allegation by the Matawalle’s led Faction of the party that some members of the PDP owns over seventy percent of all mining sites in the state“We seek to be counted out of this madness” The Marafa’s Faction saidA press statement signed by the spokesperson of Senator Marafas-led faction Bello Bakyasuwa Maradun under the Chairmanship of Sirajo Garba Maikatako condemns the allegation and consider it baseless, careless and irresponsible“Our understanding of the formation and character of the three factions of APC in the state vis-a-vis the contents of the briefing from which the reports were developed point to the action as a product of the crafty government faction that depends on blackmail, propaganda and witch-hunt to survive” he added“We are obliged by statements like this to call on the media to do well by indicating clearly the faction of APC from where they sourced the content of their publications”Zamfara State now has three factions of APC namely Former Governor Yari-led faction, Senator Marafa-led faction and that of Governor Bello Matawalle-led factionThis is due to the internal Crisis rocking the party since the build up of the 2919 General Elections“Unless the dispute is settled by competent court of law or acceptable consensus, we want to appeal to the professional standing of the media to properly label reports with their relevant factions to avoid misguided attributions” Bakyasuwa urges the mediaThe Marafa’s Faction also appeal to Governor Bello Matawalle, to minimize his local and international trips and avail self in the state to focus on supervising the various operations of the Nigerian Military against the bandits.\n“We are particularly worried that while these operations were going on, the Governor was outside the country attending the traditional wrestling events in Niger Republic.\nThese and the abysmal absence of developmental projects in the state are not in tendem with the principles and ideals of APC that we know as founding members”"
  },
  {
    "headline": "US Supreme Court Conservatives Lean Against Biden Business Vaccine Policy",
    "summarized_story": "The conservative justices have shown skepticism toward sweeping actions by federal agencies in past rulings.\nSome justices raised the possibility of the court issuing a temporary stay blocking the OSHA rule while the court decides how to proceed.\nConservative Justice Amy Coney Barrett suggested the government could require vaccinations in certain facilities but not others.\nBiden’s administration asked the justices to lift lower court orders blocking the CMS mandate in half the 50 states.\nCircuit Court of Appeals on Dec. 17 lifted an injunction issued by another court that had blocked the OSHA rule, prompting challengers to ask the Supreme Court to intervene."
  },
  {
    "headline": "Arbery Killers Sentenced to Life in Prison; No Parole for Father, Son",
    "summarized_story": "Three white men convicted of murder for chasing and killing Ahmaud Arbery were sentenced to life in prison Friday, with a judge denying any chance of parole for the father and son who armed themselves and initiated the deadly pursuit of the 25-year-old Black man.\nTheir neighbor, William “Roddie” Bryan joined the pursuit in his own truck and recorded cellphone video of Travis McMichael firing close-range shotgun blasts into Arbery.\nWalmsley ordered the McMichaels to serve life without parole and granted Bryan a chance to earn parole after serving at least 30 years in prison.\nDuring the sentencing hearing, Arbery’s family had asked the judge to show no lenience in deciding whether to grant an eventual chance at parole.\nNext month, the McMichaels and Bryan face a second trial, this time in U.S. District Court on federal hate crime charges."
  },
  {
    "headline": "Unemployment Forcing Nigerian Youth into Violent Groups and Kidnap Gangs, Obasanjo Says",
    "summarized_story": "Former Nigerian President Olusegun Obasanjo on Friday raised the alarm that many Nigerian youths “are enlisting in violent groups and kidnap gangs” owing to unemployment and the inability of government to manage the country’s population.\nObasanjo, who was speaking at the Oyewusi Ibidapo-Obe symposium in Lagos, also expressed worry about the country’s growing population, especially the unemployed youths.\nHe said political will and action were key to transforming the country’s population into an asset.\nHow do we keep them from enlisting in violent groups and gangs of kidnappers?\nPolitical will and political action can make the population an asset."
  },
  {
    "headline": "NNPC Must Focus on Profitability and Operate at Par with Global Industry Peers, Buhari Tells New Board",
    "summarized_story": "Buhari said: ”The Nigerian National Petroleum Company Limited is mandated to focus on profitability and continuous value creation beyond the simple fulfilment of legal and regulatory requirements.\n”NNPC Limited is expected to operate at par with its industry peers across the world, while acting as Enabler Company that will foster the development of other sectors of our Economy.\n”The inauguration of this Board is a major step in the ongoing transition to a more viable petroleum industry that will attract investment to support our economic growth and generate employment to millions of our people”.\nPresident, this is history in the making because this is the first time any President of the Federal Republic of Nigeria is inaugurating an independent board of an independent NNPC Limited.\nHenry Obih (South East); Barrister Constance Harry Marshal (South South); Chief Pius Akinyelure (South West); Dr. Nasir Sani Gwarzo, Permanent Secretary, Ministry of Petroleum Resources; and Aliyu Ahmed, Permanent Secretary, Ministry of Finance, Budget and National Planning."
  },
  {
    "headline": "Nigeria: APC Governors Convene Emergency Meeting to Actualise National Convention",
    "summarized_story": "The aggrieved members want the court to issue an order restraining the Buni-led CECPC from going ahead with the convention.\nRecall that some members of the APC are clamouring for a change in date of the scheduled national convention.\nThe APC, Buni and the Independent National Electoral Commission (INEC) were listed as 1-3 defendants in the court processes.\nLukman stated this in a letter dated January 5, 2022 titled, “APC National Convention: Urgent Matters for the Survival of APC,” and addressed to the Chairman of PGF and Governor Atiku Bagudu of Kebbi State.\nLukman recalled that on Monday, January 3, 2022, he sent an open letter to all APC leaders titled “Plausibility of February 2022 APC Convention”, which highlighted some of the reasons the APC National Convention should not be postponed."
  }
]