[
  {
    "headline": "Tunde Bakare condemns Ondo church attack, demands justice",
    "summarized_story": "The Serving Overseer of the Citadel Global Community Church, Pastor Tunde Bakare, has condemned what he described as the “mass murder” of worshippers at St Francis Catholic Church in Owo, Ondo State.\nBakare, who is a presidential aspirant on the platform of ruling All Progressives Congress, said these in a statement on Sunday titled, ‘The Owo Massacre is an Assault on the Nigerian State – ‘Tunde Bakare’.\nThe cleric urged the security agencies to immediately investigate the killing and ensure the perpetrators pay for their crime.\nI trust that we will ultimately emerge undaunted in the pursuit of a nation worth living for.\n“May God comfort the families and people of Owo, the Catholic Church, the Government of Ondo State, and every Nigerian whose heart is laden with sorrow.”Copyright PUNCH."
  },
  {
    "headline": "Eight states fail to access N377m special education fund",
    "summarized_story": "Eight states of the federation have failed to access the N377.07m earmarked for Special Needs Education by the Federal Government through the Universal Basic Education Commission, The PUNCH has learnt.\nThe fund is lying fallow despite the poor state of special needs schools in Nigeria.\nIn 2017, the commission noted that Edo and Imo states again, failed to access N30, 400,600 each.\nSpeaking in an interview with The PUNCH, a special needs education advocate, Yusuf Balogun, noted that the failure of states to access special intervention grants hinders special needs education in the country.\n“The failure of states to access these special intervention grants is a core hindrance to thorough, efficient special needs education in the country."
  },
  {
    "headline": "Ogunsan showers encomium on Kumuyi at 81",
    "summarized_story": "He is also my adviser, mentor and leader; a God-sent to me, in actual fact and if I must not mince words.\nI can jolly well label him as a man with a coat of my colours too dynamic to express in mere words.\n“One soon wonders if baba, at 81, is ever getting older because he is still as agile as a youth.\n“I salute the man of God who led me to God when I was just a wretched sinner without any direction for destiny in life.\nWe love you!”Born on June 6, 1941, Pastor William Folorunso Kumuyi hails from Erin-Ijesha, Osun State."
  },
  {
    "headline": "MKO Abiola’s son wins PRP 2023 presidential ticket",
    "summarized_story": "Mr Kola Abiola has emerged the 2023 presidential candidate of the Peoples’ Redemption Party (PRP).\nHe won against Usman Bugaje, Patience Key and Col. Gboluga Mosugu (rtd) to pick the PRP ticket.\nAbiola, is the first child of late Chief M.KO Abiola, acclaimed winner of the June 12, 1993, annulled presidential election.\nSo that is why we decided that the primary election will take place in the 36 states and the FCT.\n“Definitely, having it in the states, rather than bringing them here, is more convenient for them."
  },
  {
    "headline": "2023: APC set for third presidential election victory — Buhari",
    "summarized_story": "––Hosts party’s National Advisory CouncilBy Johnbosco Agbakwuru, ABUJAPRESIDENT Muhammadu Buhari last night boasted that the ruling All Progressives Congress, APC, was set to win its third presidential election since 2015.\nPresident Buhari said his optimism that the party would make its third straight victory was as a result of the fruitful outcome of his consultations he had with different party stakeholders.\nAnd as members of the National Advisory Council of the APC, the President says he recognizes the fact that they all have diverse interests, spheres of influence and expectations.\n“You similarly possess the collective ability to ensure our victory at the 2023 polls by strengthening the stability and unity of the party.\nThey were unanimous that with hard work and a united front, the APC would win the presidential election billed for February next year, as well National Assembly, governorship, and State Assembly polls."
  },
  {
    "headline": "Owo Church Attack: Peter Obi mourns, demands justice for victims",
    "summarized_story": "By Miftaudeen RajiPresidential candidate on the platform of Labour Party (LP), Peter Obi, has extended condolences to the family of the victims of the attack on St Francis Catholic Church, Owo, Ondo State, which left scored dead.\nObi, in his reaction on Sunday via his verified twitter handle, noted that the incident further demonstrated that Nigeria is fast becoming a failed state.\nHe said: “What happened in Owo today again adds to my position that our country is fast becoming a failed state.\n“I sympathise with the victims’ families, the Catholic Diocese of Ondo, the people and the Government of Ondo State,” he mourned.\nMeanwhile, the former governor of Anambra State has demanded for justice for the slain worshipers in the dastardly attack."
  },
  {
    "headline": "Jonathan condemns Owo church attack",
    "summarized_story": "Urges security agencies to fish out culpritsFormer President Dr Goodluck Jonathan has condemned the deadly Sunday attack on a Church in Ondo State by unknown assailants which claimed the lives of scores of worshippers and charged the security agents to be swift in their efforts to apprehend the criminals and make them pay for their actions.\nJonathan who stated this in a condolence message to the Government and people of Ondo State said: “I offer my heartfelt condolences to the victims, their families, the entire congregation of Saint Francis Catholic Church, in Owo as well as the Government and people of Ondo State.”He denounced the “brutal killing in cold blood of innocent worshippers by mindless outlaws, out to cause havoc and mayhem in the society.”The former President further decried the nefarious activities of murderous criminals in the country and urged security agencies to go after them, adding that all efforts should be made to apprehend and bring them to justice."
  },
  {
    "headline": "Owo attack: Killing babies, women, couples height of madness – Ondo Catholic Bishop",
    "summarized_story": "Bishop of the Catholic Diocese of Ondo, Most Reverend Jude Arogundade, has described as “madness” the attack on worshippers by gunmen suspected to be bandits.\nAccording to the Bishop, who visited the scene of the incident, the attack is an indication that the country is at war.\nGunmen suspected to be bandits had on Sunday morning invaded Saint Francis Catholic Church, Owo in Owo Local Government where scores of worshippers were killed.\nhttps://dailypost.ng/2022/06/05/many-feared-dead-as-gunmen-attack-church-in-gov-akeredolus-hometown/Arogundade maintained that all over the world there is nowhere people will slaughter babies, children, husbands and wives worshipping on Pentecost day.\nHe added that those who were running out were being shot from outside while those who were inside were shot inside."
  },
  {
    "headline": "Owo church massacre: You must find, flush out killers – Amaechi reacts to attack",
    "summarized_story": "A presidential aspirant on the platform of the All Progressives Congress, APC, Chibuike Rotimi Amaechi, has condemned the attack and killing of innocent worshippers at a church in Owo, Ondo State.\nOur security agencies have to put heads together and smoke out these monsters and ensure they are punished, immobilized, and totally flushed out.\n“They must also in partnership with our government, step up intelligence and work round the clock to nip such acts of terror in the bud.\n“May the souls of the departed rest in the bosom of the Lord.\nI also pray for the families, the church, the people and the Government of Ondo State to find strength in the midst of the sorrow and pain.”"
  },
  {
    "headline": "Who will vote for you if we’re all killed – Yul Edochie weeps over Ondo church massacre",
    "summarized_story": "Nigerian movie star, Yul Edichie has lamented the killing of innocent worshipers at St Francis Catholic Church in Owo, Ondo State, by yet-to-be-identified gunmen.\nReacting, Yul, in a video on his social media handles, wept over the level of insecurity ravaging the nation.\nHe said, “Everyone is running from the country because their lives are not safe and no one can blame them.\nKilling and kidnapping in North, South and everywhere, human life no longer mean anything to people anymore.\n“Everyone is concerned about election but if they kill all Nigerians who are they going to govern and who will even vote?”"
  },
  {
    "headline": "Ondo church attack: NANS sends message to Buhari, Akeredolu",
    "summarized_story": "The leadership of the National Association of Nigerian Students (NANS) has condemned in totality, the attack and heinous killing of many worshippers at St. Francis Catholic Church in Owa-luwa Street, Owo town, Owo Local Government Area of Ondo State.\nHe expressed worry that Owo Local Government Area houses one of the state-owned tertiary institutions, Rufus Giwa Polytechnic, Owo, asking security agencies to ensure that the assailants do not go scot-free.\n“It is sad and inhumane waking up to such heart wrecking news as this is an unexpected development.\n“We call on all Nigerian students in the Sunshine State to be law abiding, vigilant and not to take laws into their hands.\n“NANS also commiserates with families of those who lost their loved ones in this unfortunate attack and bring succor to the wounded,” he said."
  },
  {
    "headline": "2023 presidency: Primate Ayodele warns of what will happen if Northerner succeeds Buhari",
    "summarized_story": "The leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, has warned against allowing a Northerner to emerge as Nigeria’s next president.\nPrimate Ayodele warned that things would turn upside down if a Northerner emerges as Nigeria’s next president.\n“The Northerner still want to be in power because the pronouncement of President Buhari cannot be trusted, there are some agendas that will be exposed before the election.\nPresident Buhari should stand by his word to give it to a southerner because there will be lot of influence on him to backtrack on his words.\nSouthern presidency will break northerners, cabals will still be frustrated to destabilize the southern presidency, some northerners will not be happy to see a southern president but no matter what, President Buhari should stand by his word’’."
  },
  {
    "headline": "African lawmakers chart new path for continental growth",
    "summarized_story": "For him, a post-COVID economic recovery strategy for Africa must go beyond efforts of individual countries to forging greater collaboration and integration to drive sustainable economic growth and recovery across the African continent.\nHe said democracy on the African continent was under threat by military incursion in some Francophone countries and loss of confidence on democratic government by the people.\nPresident of the African Development Bank, Dr Akinwunmi Adesina, however, warned of an imminent food crisis, saying African countries must begin to produce their own foods and stop relying on imports from developed nations.\nThe dependency of African countries on Russia and Ukraine, the war disruption has added to the looming food crisis in Africa.\nThe African Development Bank has designed a $1.5 billion emergency food production plan to support African countries to avert the looming food crisis."
  },
  {
    "headline": "JUST IN: Buhari hosts APC Govs, stakeholders others ahead presidential primary",
    "summarized_story": "President Muhammadu Buhari is hosting some critical stakeholders of the ruling All Progressives Congress (APC) ahead its presidential primary in Abuja.\nAlthough details of the dinner are sketchy, some visuals seen by The Nation shower senior government functionaries and party stakeholders are part of it.\nAmong those sighted in the visuals arw include Vice President Yemi Osinbajo; Senate President Ahmad Lawan; APC National Chairman, Senator Abdullahi Adamu and National Secretary, Senator Iyiola Omisore and others.\nAmong the Governors seen at the dinner are Simon Lalong(Plateau); Bello Matawalle (Zamfara); Dave Umahi (Ebonyi) and Babagana Zulum (Borno).\nThe President was expected to use the occasion to press ahead with his desire to achieve a consensus for the emergence of the APC presidntial candidate."
  },
  {
    "headline": "Four killed in Bayelsa cult clash",
    "summarized_story": "Four persons were killed in the Swali area of Yenagoa Local Government Area of Bayelsa State as cult groups clashed yesterday.\nThe fight occurred barely two days after communities in Yenagoa placed a ban on cult activities in the area.\nThree persons were killed on a road in the clash between the Dey-Well and Bobos groups, it was said.\nPolice spokesman Asinim Butswat confirmed the incident, but said two persons were killed.\nHe added that the police arrested four persons in connection with incident, and that investigation was ongoing."
  },
  {
    "headline": "Policemen arrested for extorting man N300,000",
    "summarized_story": "By Precious Igbonwelundu (Lagos) and Gbenga Omokhunu, AbujaFour policemen who allegedly extorted a man, Uche Anthony, of N300,000 on Wednesday in Lagos have been arrested, spokesman Muyiwa Adejobi has said.\nHe wrote: “I just got accosted by the police and I was extorted of N300,000 in Lagos.\nA few days later, Adejobi through his Twitter handle confirmed that the police team responsible for the extortion had been identified and arrested.\nThe policeman caught singing and dancing to a cult song in a viral Tiktok video, Isaac Matthew, has been demoted from the rank of corporal to constable.\nMatthew, who was attached to the Ebonyi State Police Command, was seen in a viral Tiktok video on May 7 dressed in full police uniform, singing, dancing, and brandishing an AK-47 rifle in praise of a secret confraternity."
  },
  {
    "headline": "11 arrested in huge drug seizure at Abuja, Lagos airports",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has thwarted attempts by drug cartels to break through security at the Nnamdi Azikiwe International Airport (NAIA), Abuja, and the Murtala Mohammed International Airport (MMIA), Lagos and seized large consignments of drugs.\nSpokesman of the Agency Femi Babafemi said 11 members of drug syndicates were arrested in connection with the seizures.\n“A follow-up operation in Abuja led to the arrest of a taxi driver, Nsikak Evans sent to collect the consignment.\n“On Tuesday 24th May, another freight agent, Moshood Azeez Olaide was arrested at NAHCO export shed of the MMIA when he presented a cargo containing psychotropic substances heading to Dubai.\nA follow-up operation led to the arrest of another suspect linked to the crime, Olagboye Selim on Friday 27th May."
  },
  {
    "headline": "Attack on Owo church a raw persecution-CAN",
    "summarized_story": "From Fred Ezeh, AbujaChristian Association of Nigeria (CAN) has condemned Sunday’s attack at St. Francis Catholic Church, Owa-luwa Street, Owo, Ondo State, that resulted in the death of several worshippers.\nCAN President, Dr. Samson Ayokunle Olasupo, in a statement by his media aide, Pastor Bayo Oladeji, described the attack as a raw persecution, demanding that security agencies apprehend the perpetrators of the dastardly criminality.\nHe added: “This menace of insecurity has gotten out of hands and is embarrassingly sore.\n“What legacy is the government and those who are the managers of our security architecture leaving behind for the unborn generations?\nWe are praying for the government and the security agencies to get it right before it will be too late."
  },
  {
    "headline": "Akeredolu expresses sadness over killings in Owo Church",
    "summarized_story": "The governor of Ondo State Rotimi Akeredolu,(SAN, said he is deeply saddened by the unprovoked attack and killing of innocent people of Owo, worshipping at the St Francis Catholic Church, Owa-luwa Street, on Sunday.\n“I have spoken to the Bishop of the Catholic Diocese of Ondo, Most Reverend Jude Arogundade, who is presently on his way to Owo.\nI extend my condolences to Olowo of Owo, Oba Gbadegesin Ogunoye as well as the Catholic Church.\nI have equally been assured that security operatives would be deployed to monitor and restore normalcy to Owo kingdom.” .\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "BREAKING! Scores feared killed in Ondo explosion",
    "summarized_story": "The tragic incident which happened during the Sunday mass held in the church rendered many children dead and others injured.\nSome residents of the town attributed the incident to explosion, claiming that an explosive device exploded during the church service.\nMeanwhile, Ondo State Governor, Mr Rotimi Akeredolu has expressed sadness over the incident.\n“I have spoken to the Bishop of the Catholic Diocese of Ondo, Most Reverend Jude Arogundade, who is presently on his way to Owo.\nI extend my condolences to Olowo of Owo, Oba Gbadegesin Ogunoye as well as the Catholic Church."
  },
  {
    "headline": "Watertight security in Abuja as APC presidential primary begin, police divert traffic around venue",
    "summarized_story": "The police also said it has restructured its security architecture to ensure law and order during the occasion.\nIt said the deployment would witness heavy visibility policing at the various traffic control points to aid the free flow of traffic, Stop and search, and vehicular and foot patrol among others.\nFCT Police Command Public Relations Officer Josephine Adeh said in a statement:“The All Progressive Congress ( APC) Presidential primary election is scheduled to hold from Monday 6th June to Tuesday 7th June 2022 at Eagle’s Square.\nNotable amongst the apparatus of this security arrangement is the emplacement of traffic diversions at strategic places around the event ground as follows:1.\n“The deployment is also characterized by heavy visibility policing as would be witnessed at the various traffic control points to aid the free flow of traffic, Stop and search, and vehicular and foot patrol among many others."
  },
  {
    "headline": "Ogun outburst: APC moves to sanction Tinubu",
    "summarized_story": "The APC national leader and presidential aspirant was involved in an outburst in Ogun when he visited the state to campaign to the delegates for votes ahead of the presidential primary scheduled for Monday.\nSpeaking to newsmen in Abuja yesterday, specifically on the Ogun outburst, Adamu said: “He (Tinubu) went as far as saying how General Muhammadu Buhari went to him, citing instances of even prostrating in tears begging him to endorse him and to support him for the presidency.\nWe do hope that he would never say that kind of thing again, particularly of the APC extraction to make such kinds of comments.\n“Yes, yesterday we saw some part of a retraction, but that effort is not adequate.\nIf there is the need to penalize any member of the party, not just Bola Tinubu, anybody we will bring him to the party book."
  },
  {
    "headline": "News in Photograph: Buhari Meets APC Leaders Ahead of Party’s Presidential Primary",
    "summarized_story": "President Muhammadu Buhari Sunday night met with some critical stakeholders of the ruling All Progressives Congress (APC) ahead of the party’s national convention which begins in Abuja.\nThe event was a follow up to the meeting the President had Saturday with all the 23 presidential aspirants of the party at the State House.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Hosts Adamu, Osinbajo, Lawan, Gbajabiamila, Other APC Stakeholders to Dinner",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari Sunday hosted some critical stakeholders of the ruling All Progressives Congress (APC) to dinner ahead of the party’s national convention which begins in Abuja Monday.\nThe event was a follow up to the dinner the President had Saturday with all the 23 presidential aspirants of APC at the State House, Abuja.\nSunday’s dinner which took place at the Banquet Hall of the Presidential Villa, Abuja, was attended by Vice President Yemi Osinbajo; the leadership of the National Assembly including the President of the Senate, Dr Ahmad Lawan and Speaker of the House of Representatives, Hon Femi Gbajabiamila and other prominent members of the ruling party.\nThe President was expected to use the occasion to press ahead with his desire to achieve a consensus in the race for the party’s presidential ticket before the convention.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Many Feared Dead as Explosion Rocks Ondo Catholic Church",
    "summarized_story": "Fidelis David in AkureAn explosion on Sunday rocked the St. Francis Catholic Church, Owa-luwa Street, in Owo Local Government Area of Ondo State capital.\nTHISDAY gathered that the explosion, which occurred on the church premises, left many dead and many others injured.\nEyewitness, Kehinde Ogunkorode, told THISDAY that the incident caused pandemonium in the area as residents, who were taken by surprise, ran for safety.\nPictures and videos of the incident sent by Ogunkorode showed gory details of the incident.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Northern APC Govs, Others Zone Presidential Ticket to the South",
    "summarized_story": "In line with the decision of the governors and other leaders, the Jigawa State Governor, Mr. Mohammed Abubakar Badaru, has withdrawn from the presidential race, just as the party’s screening committee has recommended 13 presidential aspirants.\nBadaru’s counterpart in Ebonyi State, Mr. Dave Umahi, has, however, denied stepping down from the race.\nWe take exception to this and this doesn’t show any appreciable level of respect for the office of Mr. President and the person of Mr. President.\nAsked if punitive measures would be taken against Tinubu, the APC national chairman said: “I don’t want to take this together because they are mischief-laden.\nMeanwhile, ahead of the party’s presidential primary, the Ondo State Governor, Mr Oluwarotimi Akeredolu, has promised that the APC will have a hitch-free event on Monday."
  },
  {
    "headline": "Atiku’s Candidacy and Nigeria’s Delicate Balance",
    "summarized_story": "Dr Iyorchia Ayu, the PDP chairman and Atiku’s long-time associate, was caught on video celebrating Tambuwal as a “hero”.\nHead or tail, presidential power would have gone to the south.\nThe first was at ward level, the second at local government, the third at state and the fourth at national.\nBy now spitting on power rotation, Atiku has somehow vindicated my perception of him: that all he wants is power.\nHis life-long ambition has the potential to upset Nigeria’s fragile balance at a time there is so much discontent with the union."
  },
  {
    "headline": "BREAKING: Many Worshippers Killed As Terrorists Attack Ondo Church",
    "summarized_story": "Suspected terrorists have attacked a church in Ondo State, with a yet-to-be-ascertained number of people killed while scores were injured.\nThe incident was said to have occurred at St Francis Catholic Church, Owa-luwa Street, in Owo Local Government Area of Ondo State.\nSaharaReporters gathered that the church is behind Olowo of Owo palace.\nOne of the videos of the incident obtained by SaharaReporters shows that children were also killed in the attack.\nShe also did not reply to a text message sent to her."
  },
  {
    "headline": "BREAKING: Many Worshippers Killed As Terrorists Attack Ondo Church",
    "summarized_story": "Suspected terrorists have attacked a church in Ondo State, with a yet-to-be-ascertained number of people killed while scores were injured.\nThe incident was said to have occurred at St Francis Catholic Church, Owa-luwa Street, in Owo Local Government Area of Ondo State.\nSaharaReporters gathered that the church is behind Olowo of Owo palace.\nOne of the videos of the incident obtained by SaharaReporters shows that children were also killed in the attack.\nShe also did not reply to a text message sent to her."
  },
  {
    "headline": "How Hoodlums Attacked Hausa Community In Ondo After Terrorists Struck Church, Killed Worshippers—Local Chief",
    "summarized_story": "Members of the church were attacked by terrorists said to be of Northern extraction during the celebration of the Pentecost Sunday.\nMany members of the congregation were shot dead by the terrorists.\nOne of the videos of the incident obtained by SaharaReporters shows that many women and children were killed in the attack.\nA chief in Owo town, where the incident occurred, said some residents retaliated by attacking some Hausa people (ethnic nationality from Northern Nigeria) in some areas of the town.\nThe chief described the attackers as miscreants and hapless individuals who only used the opportunity to loot."
  },
  {
    "headline": "How Hoodlums Attacked Hausa Community In Ondo After Terrorists Struck Church, Killed Worshippers—Local Chief",
    "summarized_story": "Members of the church were attacked by terrorists said to be of Northern extraction during the celebration of the Pentecost Sunday.\nMany members of the congregation were shot dead by the terrorists.\nOne of the videos of the incident obtained by SaharaReporters shows that many women and children were killed in the attack.\nA chief in Owo town, where the incident occurred, said some residents retaliated by attacking some Hausa people (ethnic nationality from Northern Nigeria) in some areas of the town.\nThe chief described the attackers as miscreants and hapless individuals who only used the opportunity to loot."
  },
  {
    "headline": "Governor Akeredolu Sheds Tears At Scene Of Ondo Terrorist Attack, Says 'This Is A Great Massacre'",
    "summarized_story": "Governor of Ondo State, Rotimi Akeredolu, on Sunday shed tears at the scene of a deadly attack by terrorists in the state.\nTerrorists earlier in the day attacked St. Francis Catholic Church in Owo town, the governor's hometown, killing dozens of worshippers.\nAkeredolu, who was in Abuja when the incident occurred, immediately left for his hometown to visit the scene of the tragic incident.\nThe governor earlier vowed that his government would \"hunt down\" the killers and \"make them pay\".\n\"What happened today is tragic."
  },
  {
    "headline": "Use your influence to push for consensus candidate, Buhari tells APC caucus",
    "summarized_story": "President Muhammadu Buhari has asked the national advisory council of the All Progressives Congress (APC) to “actively” promote consensus building among the presidential hopefuls of the party.\nThe president met with the APC stakeholders and some governors at the state house on Sunday night.\nSpeaking at the meeting, Buhari said the ruling party is on course for a third straight electoral victory.\nAdvertisement“I underscored the important roles consensus building and consultation have played in the survival of successful political parties around the world, adding that our party should not be an exception.\n“My charge and appeal to all of you, therefore, is to reach out to your various spheres of influence to actively promote the spirit of consultation and consensus-building so that a formidable candidate for the 2023 Presidential elections would emerge from the convention."
  },
  {
    "headline": "Use your influence to push for consensus candidate, Buhari tells APC caucus",
    "summarized_story": "President Muhammadu Buhari has asked the national advisory council of the All Progressives Congress (APC) to “actively” promote consensus building among the presidential hopefuls of the party.\nThe president met with the APC stakeholders and some governors at the state house on Sunday night.\nSpeaking at the meeting, Buhari said the ruling party is on course for a third straight electoral victory.\nAdvertisement“I underscored the important roles consensus building and consultation have played in the survival of successful political parties around the world, adding that our party should not be an exception.\n“My charge and appeal to all of you, therefore, is to reach out to your various spheres of influence to actively promote the spirit of consultation and consensus-building so that a formidable candidate for the 2023 Presidential elections would emerge from the convention."
  },
  {
    "headline": "Yahaya Bello: APC presidential hopefuls agreed to back Buhari's anointed candidate",
    "summarized_story": "Yahaya Bello, governor of Kogi state, says the presidential hopefuls of the All Progressives Congress (APC) have agreed to support President Muhammadu Buhari’s anointed candidate.\nAt the meeting, he asked them to “come up with a formidable” consensus candidate before the party holds its primary election.\nThe Kogi governor, who is also a presidential hopeful, said he will support Buhari’s choice.\nAdvertisement“Whoever Mr President will come up with, I’m in 100 percent in support of that.\nThe Kogi governor described the decision as “self-opinion”."
  },
  {
    "headline": "Badaru: Our position on power shift to the south still subject to Buhari's nod",
    "summarized_story": "Abubakar Badaru, governor of Jigawa state, says the decision of northern governors in the All Progressives Congress (APC) to back power shift to the south is subject to the approval of President Muhammadu Buhari.\nThey asked the northern presidential hopefuls in the APC to withdraw from the race in national interest.\nA statement issued after the meeting also stated that Badaru has withdrawn from the race “to contribute to this patriotic quest”.\nThe governor added that he will only withdraw from the presidential race if Buhari gives his consent for power to be shifted to the south.\nWe concluded to advise Buhari that given the situation, it will be better to cede the candidature to the south,” Badaru said."
  },
  {
    "headline": "Badaru: Our position on power shift to the south still subject to Buhari's nod",
    "summarized_story": "Abubakar Badaru, governor of Jigawa state, says the decision of northern governors in the All Progressives Congress (APC) to back power shift to the south is subject to the approval of President Muhammadu Buhari.\nThey asked the northern presidential hopefuls in the APC to withdraw from the race in national interest.\nA statement issued after the meeting also stated that Badaru has withdrawn from the race “to contribute to this patriotic quest”.\nThe governor added that he will only withdraw from the presidential race if Buhari gives his consent for power to be shifted to the south.\nWe concluded to advise Buhari that given the situation, it will be better to cede the candidature to the south,” Badaru said."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Four rising sectors in African tech",
    "summarized_story": "In 2020, when AI companies globally attracted $36 billion, AI companies on the continent could only raise $11.63 million.\nIn January, it raised $100 million—the only record funding into the African AI industry this year—solidifying hopes that Africa can play on the global AI scene.\nWhile many edtech companies around the world benefited from this, as the industry attracted an influx of funding, African edtech companies struggled to tap into this opportunity.\nIn 2021, when edtech globally raised $20 billion, African edtech companies raised less than $40 million.\nThere have been impressive efforts by African companies to solve the continent’s educational problems."
  },
  {
    "headline": "Founder of Babymigo speaks on reducing maternal deaths in Africa",
    "summarized_story": "Kemi OlawoyeThe role of tech in improving maternal healthcareHA: How big of a role do you think tech can play in improving maternal health in Nigeria?\nHA: What singular aspect of maternal healthcare in Nigeria do you think needs the most urgent intervention?\nHA: What are the things you believe will accelerate the growth of the maternal health sector in Nigeria?\nKO: The first thing will be to identify policies and interventions that affect outcomes in terms of maternal and child health.\nIn the next 3 years, we hope to provide healthcare services to 10 million mums across the African continent."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "Subscribe to Techpoint DigestA daily 5-minute roundup of happenings in African and global tech, sent directly to your email inbox, between 5 a.m. and 7 a.m (WAT) every week day!"
  },
  {
    "headline": "Consensus: Buhari hosts dinner for APC stakeholders",
    "summarized_story": "President Muhammadu Buhari on Sunday, continued his engagements with the All Progressives Congress (APC) stakeholders, at a dinner, as he makes last minute efforts to achieve a consensus for the party’s presidential candidate.\nThe dinner which took place at the Banquet Hall of the Presidential Villa, Abuja, on Sunday, came on the heels of a similar one on Saturday night.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\nThis is the second in the series and I still look forward to meeting with party stakeholders.\nRecognizing this fact, the Screening Committee has, amongst others, recommended that consensus building through consultation, be intensified."
  },
  {
    "headline": "Finally, Nigeria Air gets air transport licence",
    "summarized_story": "The proposed national carrier for Nigeria, Nigeria Air, may be kicking off soon asthe Nigerian Civil Aviation Authority (NCAA) will on Monday present the airline with Air Transport Licence (ATL).\nThe Air Transport License (ATL) is issued as authorisation to airlines to provide scheduled and non-scheduled services.\n“This is to inform the general public that Messrs Nigeria Air Limited has applied to the Nigerian Civil Aviation Authority (NCAA) for the grant of an Air Transport License (ATL) to operate scheduled and non-scheduled passenger and cargo services within and outside Nigeria,” the notice reads.\nRead also:Nigeria Air to fly before end of Buhari’s tenure – ICRCBusinessDay had reported in April that the NCAA disclosed that the AOC of Nigeria Air, the planned national carrier is in process.\nMusa Nuhu, director-general NCAA said the promoters of Nigeria Air have applied for AOC and the process is still ongoing."
  },
  {
    "headline": "Black Sunday in Ondo as many children, women killed in Catholic Church explosion",
    "summarized_story": "There was pandemonium on Sunday in Owo, Owo Local Government Area of Ondo state as some gunmen attacked St. Francis Catholic Church, Owaluwa, killing scores of worshipers.\nBlood stains litter the floor of the Church as corpses were moved to the Federal Medical Centre and St Louis Catholic Hospital, Owo.\nI extend my condolences to Olowo of Owo, Oba Gbadegesin Ogunoye as well as the Catholic Church.\nThe statement read, “The massacre in Owo Catholic Church is a direct attack on Yoruba land.\n“We commiserate with the government and people of Ondo state, the Catholic Church, the Olowo of Owo and the people of Owo."
  },
  {
    "headline": "Northern APC governors are patriots worthy of honour – Tinubu Campaign",
    "summarized_story": "The Asiwaju Bola Ahmed Tinubu Campaign Organisation has described the 11 Northern All Progressives Congress Governors as worthy patriots for their decision to support power shift to the South.\nThe campaign organisation in a press statement on Sunday, signed by its Director of Media and Communication, Bayo Onanuga noted that all lovers of peace, progress, equity, justice and stability of Nigeria should celebrate and honour the Northern APC Governors.\nThe Northern APC Governors also commended their Jigawa State counterpart, Governor Mohammad Abubakar Badaru for withdrawing from the presidential race ahead of APC Convention on Tuesday, June 7, 2022.\nThe decision of the Northern APC Governors has once again confirmed that our country will make tremendous progress when the bond of our unity is strengthened and preserved.\nThe 11 Northern APC Governors have restored the confidence of millions of Nigerians and party members in the greatness and unity of our country."
  },
  {
    "headline": "Northern APC governors, leaders back southern candidate (Full Statement)",
    "summarized_story": "The All Progressives Congress (APC) governors and political leaders from northern Nigeria have thrown their weight behind the emergence of a presidential candidate of the party from the southern part of the country.\nAccording to the statement, Governor Mohammed Abubakar-Badaru who is also a contesting the APC presidential ticket has withdrawn from the race.\nThe statement read: “APC governors and political leaders from the northern states of Nigeria today met to review the political situation and to further support our Party in providing progressive leadership amidst our national challenges.\nDuring our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\nThis moment calls for the most sober and inclusive approach to selecting our party’s candidate, and we call on all APC leaders to fulfil their responsibility in this regard."
  },
  {
    "headline": "Obaseki seeks stakeholders’ buy-in to sustain gains in forest regeneration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr Godwin Obaseki, has urged civil society organisations, organised private sector, donor agencies and trade groups, to support ongoing reforms in engendering forest regeneration in the state.\nThe governor added, “In the past six years, we have made concerted efforts to protect the environment and engender environmental sustainability through implementation of novel policies and programmes.\nIn partnership with private stakeholders, we have restored 218 hectares of forest land across the state, as part of our efforts to boost the state’s green economy.\n“Also, as part of the Edo State Oil Palm Programme, investors are mandated to restore 20 percent of total land area allocated to them for plantation.\nThese efforts will prevent further erosion and destruction of public and private infrastructure and potential agricultural land.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "We’ll collaborate to build local capacity, drive investment – German govt to Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Minister of State, German Foreign Office, Ms. Katja Keul has assured that the German government will collaborate with the Edo State Government to build local capacity and drive investment into the state.\nShe made the remark during a breakfast session with Governor Godwin Obaseki, who is in Germany to deepen partnership with the German government on a number of skills development, culture and social development projects being implemented in Edo State.\nIn a tweet after the meeting with the governor, Keul said: “Nigeria is one of Germany’s key partners in Africa.\nWe will work closely with @giz-gmbh to expand vocation training.\nThe governor, during his meeting with Ms. Keul, highlighted the need to further the potential for collaboration on regular migration for skilled workforce from Edo State and Nigeria."
  },
  {
    "headline": "Bendel Insurance Feeders Beat Excellent FC As Stephen Keshi National U-17 Tourney kicks off – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAs the 2022 Stephen Keshi National U-17 Championship begins in Benin, Bendel Insurance Fc Feeders,weekend defeated Excellent Fc of Ughelli 1-0 to begin title defence on a bright note.\nGodspower Osa struck in the 37th minute to help the young Benin Arsenal beat the highly rated Excellent FC .\nThis year’s tournament is the fift edition with eighteen clubs featuring.\nAnd the coach Stanley Osazee led Insurance FC Feeders have only appeared in the last two editions and won both.\nIn the other day one fixtures, DYNAMOS FC beat GENESIS FC 2 -1 while OGBOMO FC, ANDALLAS FC andOZA PC, Elemen FC settled for goalless drawsShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NNL WK 15: Insurance pip Campos In Owerri to Lead Group B1 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBendel Insurance Football Club of Benin,weekend, returned to the summit of the southern conference of the Nigeria National League (NNL) Group B1 following their hard earned 1-0 victory over Campos FC of Owerri.\nInsurance FC who also defeated Campos FC 2-1 in their first round meeting in Benin now fully occupy the leadership position of the southern conference Group B1 table with 31 points after playing fifteen games,two points ahead of their major contender Gateway Utd who lost 1-0 at Adoration FC, Enugu to step down from the number one position.\nCoach Monday Odigie made five substitutions in the bid to get more goals but his boys were wasteful but lucky to run away with the lone goal victory as the host fought hard for equalizer they never never got.\nInsurance will be leaving Owerri happy and with confidence to host Osun Utd in their next game in Benin next weekend.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Buhari hosts govs, APC chieftains ahead of presidential primary",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, on Sunday night, hosted some members of the All Progressives Congress (APC) national caucus for a dinner at the State House Banquet Hall.\nThe dinner comes ahead of the party’s presidential primary scheduled to begin on Monday.\nParty chieftains at the dinner include the party’s National Chairman, Senator Abdullahi Adamu, former Chairmen, Bisi Akande, John Oyegun, the party’s Secretary, Senator Iyiola Omisore, and some APC Governors.\nThe meeting is part of continued consultations the President is having with various party stakeholders to elect a consensus candidate ahead of the presidential primary."
  },
  {
    "headline": "APC presidential primary: Buhari working on Amaechi/Lawan ticket – Lamido",
    "summarized_story": "Former Jigawa State governor, Sule Lamido, has said President Muhammadu Buhari is working on a joint ticket of Rotimi Amaechi, former minister of transportation and Ahmad Lawan, senate president ahead of the APC presidential primary scheduled to begin on Monday.\nThe former governor who spoke to Vanguard, said Buhari will never support Tinubu to be president because of his mentality and psychology.\nI mean, he is their own son, why can’t they make him?”“Mark my words, Buhari will never ever support Tinubu.\nThere is no way Buhari is going to support Tinubu, because the whole thing is going to take personal dimension.\nIn Nigeria today, even if it (APC ticket) not given to him, he will still win election because Nigeria wants anything except Buhari."
  },
  {
    "headline": "Rafael Nadal wins 14th Roland Garros title",
    "summarized_story": "Spanish tennis legend, Rafael Nadal on Sunday, won a 14th French Open and record-extending 22nd Grand Slam title with a straight-sets rout of Casper Ruud to become the oldest male champion at Roland Garros.\nThe 36-year-old won 6-3, 6-3, 6-0 with victory coming 17 years to the day since he claimed his first French Open as a 19-year-old in 2005.\nNadal won the last 11 games of the final and is now two Slams ahead of rivals Novak Djokovic and Roger Federer with Sunday’s victory coming against all the odds.\nHe also needed the best part of a gruelling 12 hours to see off Felix Auger-Aliassime, Novak Djokovic and Alexander Zverev in the previous three rounds.\n“I don’t know what I would do in terms of injuries if it wasn’t for the team, my family and everyone around me,” said Nadal."
  },
  {
    "headline": "Capital Market Participants To Get Unique Identifiers – SEC",
    "summarized_story": "In a bid to contain issues of fraud in the capital market as well as reduce to the barest minimum the quantum of unclaimed dividends, capital market participants are to be given unique identifiers.\nThis is part of efforts by the Securities and Exchange Commission to manage identities of participants in the capital market.\nDirector General of the SEC, Mr. Lamido Yuguda stated this during a meeting with the Management of Nigeria Data Protection Bureau in Abuja weekend.\nYuguda said the identity management project already on-going in the capital market is to ensure that every participant within the capital market has a unique identifier that will be given to them so all capital market transactions will be secured and done on a Straight Through Processing basis, leaving very little human intervention in the processing of data.\nLooking at the capital market, people buy investments, remove money, get dividends etc., everything about it is data because no one wants to go to a stockbroker’s office now."
  },
  {
    "headline": "U.S. Consulate celebrates accomplishments of 2021 Carrington fellows",
    "summarized_story": "The U.S. Consulate has hosted a graduation ceremony celebrating the success of 17 young Nigerians who formed the 2021 cohort of the Carrington Youth Fellowship Initiative (CYFI).\nDelivering remarks during the graduation ceremony of the 2021 cohort, U.S. Consulate Public Affairs Officer Stephen Ibelli highlighted the positive impact the initiative has had on local communities since its inception in 2011.\nHe commended the graduating fellows for their selfless service and commitment to the values championed by the late U.S.\nIbelli welcomed the graduating CYFI fellows to the U.S. government exchange alumni community, a prestigious and vast network of like-minded and highly regarded professionals across the country.\nThe 2021 cohort is the first graduating class since the passing of Ambassador Carrington."
  },
  {
    "headline": "An Cimma Cikakkiyar Nasarar Harba Kumbon Shenzhou-14",
    "summarized_story": ""
  },
  {
    "headline": "Saboda Alakata Da Gwamnatin Masari Ake Kokarin Ɓata Mun Suna – Mustapha Inuwa",
    "summarized_story": ""
  },
  {
    "headline": "CMG Ya Kaddamar Da Aikin Kafofin Watsa Labarai Na Kare Muhalli Na Sin Da Afirka",
    "summarized_story": ""
  },
  {
    "headline": "Dan Takarar Sanatan Bauchi Ta Kudu A NNPP Ya Janye Wa Sanata Mai Ci, Lawan Gumau",
    "summarized_story": ""
  },
  {
    "headline": "Shettima Ya Nemi Yafiyar Osinbajo Kan Kalamansa A Hirarsa Da Channel TV",
    "summarized_story": ""
  },
  {
    "headline": "JUST IN: Buhari Hosts APC Govs, Other Stakeholders Ahead Of Presidential Primary",
    "summarized_story": "JUST IN: Buhari Hosts APC Govs, Other Stakeholders Ahead Of Presidential PrimaryPresident Muhammadu Buhari is hosting some critical stakeholders of the ruling All Progressives Congress (APC) ahead of its presidential primary in Abuja.\nAlthough details of the dinner are sketchy, some visuals seen by The Nation showed senior government functionaries and party stakeholders are part of it.\nAmong those sighted in the visuals include Vice President Yemi Osinbajo; Senate President Ahmad Lawan; APC National Chairman, Senator Abdullahi Adamu and National Secretary, Senator Iyiola Omisore and others.\nThe event taking place at the Banquet Hall of the Presidential Villa is a follow up of the meeting Buhari had with the national leadership and presidential aspirants of the party on Saturday night.\nThe President was expected to use the occasion to press ahead with his desire to achieve a consensus for the emergence of the APC presidential candidate."
  },
  {
    "headline": "BREAKING: Many feared dead as gunmen attack church in Gov Akeredolu’s hometown",
    "summarized_story": "Gunmen on Sunday morning attacked St. Francis Catholic Church in Owo, the headquarters of the Owo Local Government Area of Ondo State, murdering many worshippers.\nUnconfirmed number of bodies had been removed from the church, with many who sustained injuries rushed to the Federal Medical Center, FMC, in Owo.\nAccording to eyewitnesses, the gunmen stormed the church while service was going on and opened fire on the congregation.\nOne of the eyewitness who craved anonymity stated that the worshippers were caught off guard when the attackers arrived.\nHe added that the number of casualties could be higher because some attendees who were taken to the hospital gave up the ghost."
  },
  {
    "headline": "El-Rufai, Zulum, other Northern govs backing South are traitors –Coalition",
    "summarized_story": "A regional group, Northern Interests Coalition, has faulted the 10 Northern governors of the All Progressives Congress (APC) who threw their weight behind power returning to the South in 2023.\nThe APC Northern Governors Forum had backed the South to produce the next president of Nigeria at a meeting on Saturday.\nChairman of the Northern Interests Coalition, Malam Umar Gazali, declared that people in the North have rejected the decision of the governors for betraying the north.\nThis is a direct assault against Northern interests and these governors must be stopped fast.\n“The eleven Northern Governors have betrayed the North for their selfish interests."
  },
  {
    "headline": "BREAKING: Buhari backs southern candidate for president",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has endorsed a power shift to the South in 2023.\nHe made this known at a dinner with All Progressives Congress presidential aspirants in Abuja.\nDetails Shortly…"
  },
  {
    "headline": "Breaking: In 2022, Rafael Nadal outclasses Casper Ruud, grabs 14th French Open title",
    "summarized_story": "Rafael Nadal won his 14th French Open title after producing a ruthless 6-3 6-3 6-0 win over Casper Ruud on Sunday afternoon.\nIt is also the first time Nadal has won the Australian Open and the French Open in the same year.\nAt triple break point, Nadal double faulted to hand Ruud the initiative.But Nadal broke straight back.\nAt 5-3 up, Nadal ripped a cross-court winner on Ruud’s serve to earn himself double set point.\nAfter a change of clothes ahead of the third set, Nadal continued to be relentless."
  },
  {
    "headline": "Breaking: Tension as gunmen invade church, massacre many in Ondo",
    "summarized_story": "From Owo, a popular community in Ondo state comes a report that unknown gunmen numbering up to 50, invaded a catholic church and killed many worshippers on Sunday June 4, 2022.\nThe name of the church was given as St. Francis Catholic Church, Owo.\nBlueprint gathered that no fewer than 40 worshippers were either shot dead dead or murdered with different weapons, while others were injured.\nThe injured persons, according to an eyewitness have been taken to nearby hospitals.\nPolice authorities were yet to react to the latest development as at the time of filling this report."
  },
  {
    "headline": "2023: At last, INEC decides where to keep sensitive electoral materials",
    "summarized_story": "The Independent National Electoral Commission (INEC), Saturday, declared it will no longer keep sensitive electoral materials in the Central Bank of Nigeria (CBN).\nThe latest decision by the commission became paramount after perceived partisanship by the incumbent CBN governor.\nChairman of INEC, Mahmood Yakubu, further said the ballot papers for the 2023 elections would be printed locally because it has more than 180 days before the 2023 general elections.\nYakubu said it used to print the ballot papers outside Nigeria because of the exigences of time, which is not the case now.\nAccording to him, this decision was to guarantee that electoral materials for the lined-up elections are not compromised."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria",
    "summarized_story": "By our correspondentAn Agricultural based company operating under the aegis of Green Agriculture West Africa Limited; GAWAL has reiterated its commitment to contribute to food security in Nigeria via quality and high yielding seeds.\nHe said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tons per hectare.\nThis outstanding result has ensured that more and more people are showing interest in GAWAL R1 “Through different channels, a growing number of Nigerian farmers and organizations are reaching us to buy GAWAL R1 rice seeds.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company that not only sold seed but taught farmers advanced planting techniques for optimum yield."
  },
  {
    "headline": "Africa must not be left behind in moving from fossil fuel to renewable energy sources — President Buhari",
    "summarized_story": "Minister of mine and steel Arc Olamilekan Adegbite on Wednesday said Africa needs to join the rest of the world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nAfrican Natural Resources and Mines Limited, ANRML, is a group company of the African Industries Group.\nThe mining sector is the backbone of industrialization of the economy."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria via high yield rice.",
    "summarized_story": "He said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tones per hectares.\nThis outstanding result has ensures that more and more people are showing interest in GAWAL R1.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company, that not only sell seed but teach farmers advance planting technique for optimum yield.\nAs one of the large-scale seed companies in Nigeria, it has supplied over 20,000 mt rice and maize seeds to Nigeria farmers in over 30 states."
  },
  {
    "headline": "Nigeria Committed to Energy Transition, Reducing Gas Emission – Silva",
    "summarized_story": "According to him, “the only viable option currently on the table is natural gas, considering vast proven gas endowments, put at 209 TCF, with 600 TCF potential reserves.\nWe cannot ignore this resource, especially when energy poverty is viciously starring at us.”“The goal of Nigeria’s gas policy is to ensure that gas development is undertaken in accordance with our socio-economic development priorities.\nAccording to him, “the implication of the above is that the issues surrounding energy poverty, climate and sustainable development are not mutually exclusive.\nBut of equal concern is the alarming level of energy poverty.\nEnergy transition is about providing clean energy, and not about discriminating between energy sources."
  },
  {
    "headline": "TRCN Registrar elected president of AFTRA",
    "summarized_story": "By Ngozi NwankwoRegistrar/CE Teachers Registration Council of Nigeria, Prof Josiah Ajiboye has been elected the President of the Africa Federation of Teaching Regulatory Authorities, AFTRA.\nAjiboye was elected the AFTRA president at the end of its 9th Annual Conference and 11th Roundtable held in Accra, Ghana, today June 1.\nNigerian Pilot Newspapers learnt that the Africa Federation of Teaching Regulatory Authorities is a continental body comprising all teaching regulatory authorities in all the 54 Africa countries.\nOther elected officers were Deputy President- Zambia, Secretary General- Ghana, Treasurer – Namibia and Assistant Secretary General- South Africa.\nHe also promised to assist countries who are yet to have teacher regulatory bodies to establish one, so that together Africa teachers will enjoy professional status and benefits."
  },
  {
    "headline": "‘Our Hearts Are Heavy’: Akeredolu Vows To Hunt Down Owo Church Attackers",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has expressed sadness over Sunday’s attack at the St Francis Catholic Church, Owo, and vowed to hunt down the masterminds of the assault.\nThis is a personal loss, an attack on our dear state,” Governor Akeredolu said.\nOndo State Governor, Arakunrin Oluwarotimi Akeredolu, SAN, is deeply saddened by the unprovoked attack and killing of innocent people of Owo, worshiping at the St Francis Catholic Church, Owa-luwa Street, on Sunday.\nI have equally been assured that security operatives would be deployed to monitor and restore normalcy to Owo kingdom.” Akeredolu said.\nSigned:Richard OlatundeChief Press Secretary to the Governor of Ondo State."
  },
  {
    "headline": "Many Feared Dead As Terrorists Attack Catholic Church In Owo, Ondo",
    "summarized_story": "Suspected terrorists are said to have attacked St Francis Catholic Church in Owo, the headquarters of Owo Local Government Area of Ondo State.\nMeanwhile, the Ondo State Governor, Arakunrin Oluwarotimi Akeredolu, has expressed deep sadness over what he calls an unprovoked attack and killing of innocent people of Owo, worshiping at the St Francis Catholic Church, Owa-luwa Street.\n“I have spoken to the Bishop of the Catholic Diocese of Ondo, Most Reverend Jude Arogundade, who is presently on his way to Owo.\n“I commiserate with my people in Owo, particularly families of the those who lost their lives to this ugly and unfortunate attack.\nI extend my condolences to Olowo of Owo, Oba Gbadegesin Ogunoye as well as the Catholic Church,” Akeredolu stated."
  },
  {
    "headline": "‘Darkness Will Never Overcome Light’ – Buhari Condemns Owo Attack",
    "summarized_story": "President Muhammadu Buhari has condemned the attack on St Francis Catholic Church in Owo, the headquarters of Owo Local Government Area of Ondo State, saying darkness will never overcome the light.\n“No matter what, this country shall never give in to evil and wicked people, and darkness will never overcome the light.\nHe equally mourned the dead, condoling with their families, the Catholic Church, and the Government of Ondo State.\nMeanwhile, the state governor, Rotimi Akeredolu has expressed sadness over Sunday’s attack at the St Francis Catholic Church, Owo, and vowed to hunt down the masterminds of the assault.\nThis is a personal loss, an attack on our dear state,” Governor Akeredolu said."
  },
  {
    "headline": "Shettima Apologises To Osinbajo, Lawan Over Viral Remarks",
    "summarized_story": "Senator Kassim Shettima has apologised to Vice President Yemi Osinbajo and Senate President Ahmed Lawan for remarks he made about them recently.\nBut nice men do not make good leaders, because nice men tend to be nasty,” he said on Channels Television’s Politics Today.\nDoes the brand name sell?”While Shettima faced backlash over the comment, the former governor has said his remarks were never meant to insult Osinbajo or Lawan as perceived in many quarters.\n“The interpretations of my remarks on @ProfOsinbajo and @SPNigeria, Senator Lawan are, thus, being done literally and overblown.\n“I hereby tender my unreserved apologies to the Vice President and the President of the Senate for the unintended pains my jibes might have caused them and their families and supporters.”"
  },
  {
    "headline": "APC Set For Third Straight Victory Since 2015 – Buhari",
    "summarized_story": "President Muhammadu Buhari on Sunday said the ruling All Progressives Congress (APC) is set for its third victory since 2015.\nHe stated this during a meeting at the State House Abuja that drew in attendance members of the APC National Advisory Council, where he appraised the series of consultations held so far towards getting a widely acceptable presidential standard-bearer.\nREAD ALSO: 2023 Presidency: I Am The Voice Of Young People – Yahaya Bello“I am pleased to inform you that those meetings have been fruitful and indicative of a party that is prepared and marching towards a third straight victory since 2015, at the presidential polls,” the President was quoted as saying in a statement issued by his media aide, Femi Adesina.\n“I am optimistic that the outcome of this consultation with the National Advisory Council will in addition to sharpening our focus, help to fortify the positive democratic principles, practices and culture that already exists within the party system.\n“In the course of these consultative processes, I have already met separately with the Progressive Governors and with all our eminent members who are aspiring to become the Presidential flag bearer for our party during the 2023 elections.”See the full statement issued below:"
  },
  {
    "headline": "Tambuwal wins Sokoto Senatorial ticket, mobilises for PDP's return to power",
    "summarized_story": "Governor Aminu Waziri Tambuwal has emerged Senatorial candidate of the People’s Democratic Party (PDP) for Sokoto South Senatorial District.\nTambuwal will now represent seven local government areas in the red chamber in 2023 as a result of this affirmation.\nThe local government areas are: Bodinga, Dange/Shuni, Kebbe, Shagari, Tambuwal, Tureta andYabo local government areas.\nTambuwal, who compared the ruling All Progressives Congress (APC) to a critical care unit in a hospital, said the PDP and its Presidential candidate are poised to reclaim their pride of place as the country’s ruling party and president after the general elections next year.\nHe urged men, women, youths and the elderly to continue praying stating that when the time comes and campaign commences, everyone must go into the nooks and crannies of villages and communities to campaign for the party."
  },
  {
    "headline": "Sensitive electoral materials no longer to be kept with CBN-INEC",
    "summarized_story": "The Independent National Electoral Commission has announced that election materials will no longer be lodged with the Central Bank of Nigeria as the 18th of June governorship election in Ekiti State approaches.\nChairman of INEC, Mahmood Yakubu explained that going forward the Commission will devise means of lodging its materials without having to make use of the apex bank.\nThis decision, he said is to ensure that the electoral materials for the upcoming elections are not tampered with.\nThis was stated by INEC Chairman while responding to questions in an ongoing dialogue in Elections in Abuja after stories about the CBN governor, Mr Godwin Emefiele, indicating interest in running for the country’s presidential seat hit the airwaves in recent months, several individuals and groups expressed grave concern about the sanctity of Elections materials kept with the CBN."
  },
  {
    "headline": "Plateau APC Chieftain Amos Gizo urges delegates to vote Asiwaju",
    "summarized_story": "A chieftain of the All Progressives Congress and gubernatorial aspirant in Plateau state, Amos Gizo has tasked delegates in the state to support the aspiration of Asiwaju Bola Ahmed Tinubu to clinch the party’s Presidential ticket.\nThe Plateau APC stalwart says Asiwaju possesses better credentials and experience than all the other aspirants.\nHe made his views known during a parley with journalists in Jos, the state capital.\nMr Gizo warned that the party risks the chance of losing power and the opportunity to consolidate on the good work it has started if Asiwaju is denied the ticket."
  },
  {
    "headline": "APC South Govs appeal to Lawan, Yahaya Bello to withdraw Presidential Primaries",
    "summarized_story": "The Southern Nigeria Governors’ Forum applauded their northern counterparts for resolving to allow power to be zoned to the South.\nAs a result, the Southern Governors appealed to all Northern state aspirants to withdraw in the national interest, allowing only Southern state aspirants to proceed to the primaries.\nThe forum applauded Governor Abubakar Badru’s decision to withdraw his presidential bid in order to contribute to this patriotic cause.\nWe appeal to all aspirants from the Northern state to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries.\nWe thank the leadership of the Northern Governors’ Forum for the patriotic zest displayed at this crucial moment."
  },
  {
    "headline": "Nigeria: Dozens Killed as Terrorists Attack Church During Service In Ondo State",
    "summarized_story": "Terrorists have attacked St Francis Catholic Church in Owo, Ondo State, in Nigeria’s southwest region.\nAccording to local sources, no fewer than 50 corpses have been moved out of the church with many casualties lying at the Federal Medical Center, Owo, for medical attention.\nAccording to sources, the gunmen also used some explosives within the compound of the church but said most of the people were hit by bullets.\nThe perpetrators were said to have fled the scene immediately they carried out the killing, leaving many people dead.\nSome dead bodies were seen soaked with blood in the church in videos circulating on social media."
  },
  {
    "headline": "Nigeria Blames Drop in Electricity Generation on Shutdown of Critical Gas Plant",
    "summarized_story": "Nigeria’s federal government on Saturday explained that the drop in electricity generation was a result of the partial shutdown of the Oben gas plant for the repair of critical gas processing equipment.\nIt has also disclosed that the 14 reactivated independent power plants (IPP) across the country will produce off-grid electricity of 1,000 megawatts.\n“We have been assured that the repair work would be concluded this weekend and normalcy will be restored.\nFG Tasks Gas Operators on Accuracy of Dispensing InstrumentsIn a related development, the federal government has directed operators in the Liquefied Petroleum Gas (LPG) sector to install deadweight at their premises to test the accuracy of weighbridges used for dispensing bulk gas to retailers.\nThe resolution came against the backdrop of persistent complaints of under-dispensing of products at LPG depot terminals as well as retail outlets across the country."
  },
  {
    "headline": "Nigeria: After Losing Presidential Primary, Bauchi Governor Wins PDP Ticket for Second Term",
    "summarized_story": "Bauchi State Governor, Senator Bala Mohammed has been declared the winner of the rerun gubernatorial primary election of the Peoples Democratic Party (PDP) in the state.\nThe rerun primary election took place on Saturday at the Zaranda Hotel, Bauchi.\nMohammed had recently lost his bid to secure the presidential ticket of the PDP during the presidential primary where he polled 20 votes.\nAccording to him, Governor Mohammed secured all the 646 votes that were cast.\nAs a way of rewarding Kassim, the Bauchi State governor reappointed him as the SSG."
  },
  {
    "headline": "No One Person Can Install Nigeria’s President, Tinubu’s Comments an ‘Arrogant Assumption’",
    "summarized_story": "Lawal said Tinubu was not the only person that helped President Buhari to win the 2015 presidential election.\nBefore we went for Tinubu, Buhari had consistently scored more than 11 million votes at the polls.\nThe claim that he made Buhari president is an arrogant assumption,” Lawal explained.\nSpeaking on Tinubu’s outburst in Abeokuta on Thursday, Lawal said he believed Tinubu was stressed at the time he boasted how he helped Buhari to win the 2015 presidential election.\nThe former SGF blamed Tinubu’s outburst purely on widespread conspiracy theories, which was prevalent in the political space."
  },
  {
    "headline": "Nigeria: INEC to Print Ballot Papers in Nigeria, Says Election Materials won’t Be Kept with CBN",
    "summarized_story": "The Independent National Electoral Commission (INEC) has disclosed that the ballot papers for the 2023 elections would be printed locally because it has more than 180 days before the 2023 general election.\nThe electoral umpire has also confirmed that it would not keep sensitive electoral materials for the upcoming Ekiti State governorship election with the apex bank.\nAccording to him, this decision is to guarantee that electoral materials for the lined-up elections are not compromised.\nAnd when it comes to the general election, we have to look for an alternative way of doing it.”, the INEC chairman stated.\nWe want to do away with this voter apathy and we are starting with the Ekiti election."
  }
]