[
  {
    "headline": "Kanu: After Igbo delegation’s visit, CNG seeks audience with Buhari",
    "summarized_story": "A week after an Igbo delegation, led by first republic parliamentarian and Aviation Minister, Mbazulike Amaechi, met with the President, Major General Muhammadu Buhari (retd.\n), to seek the release of the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, the Coalition of Northern Groups has also sought audience with the President on the matter.\nThe CNG alleged that Kanu was responsible for the “chain of ugly events, collective national distractions, destruction, harassment and killing of innocent northerners, violent separatism and hateful campaign since 2017”.\nThis was contained in a letter addressed to the President, titled, ‘Request for audience to present the case for Northerners violated and killed in series of attacks incited and coordinated by Nnamdi Kanu and IPOB leadership’, and signed by a representative of the group and displaced families, Dr Nastura Ashir Shariff.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Insecurity: Kaduna restores telecommunication services, closes weekly markets",
    "summarized_story": "The Kaduna State Commissioner of Internal Security and Home Affairs, Samuel Aruwan, on Friday, announced the restoration of telecommunication services in some parts of the state it shut down to tackle the banditry.\nThe state government had on Wednesday September 29, 2021, suspended telecommunication services to tackle the troubling banditry and other related crimes in the state.\nKajuru, Chikun, Igabi, Birnin Gwari, Giwa, Zaria and Zango-Kataf are some of the Local Government Areas where telecommunication services were suspended in the state.\nThe commissioner while addressing newsmen in Kaduna on Friday said it had contacted relevant federal agencies to effect the immediate restoration of the telecommunication services to the affected LGAs.\n“The security agencies have now notified the government that telecoms services can be restored."
  },
  {
    "headline": "Trading reverses on NGX, indices up by 0.46%",
    "summarized_story": "FCMB Group was the most active stock during the day, exchanging 81.05 million shares valued at N247.85 million.\nGTCO followed with an account of 29.53 million shares worth N738.32, while Access Bank traded 28.01 million shares valued at N253.85 million.\nHoney Well Flour traded 16.84 million shares worth N70.20 million, while Zenith Bank exchanged 13.15 million shares valued at N320.17 million.\nIn all, investors sold 305.32 million shares worth N3.58 billion in 4,450 deals, indicating an increase of 14.73 per cent.\nThis was against a turnover of 266.12 million shares, valued at N4.22 billion traded in 3,905 deals on Thursday."
  },
  {
    "headline": "Almakura challenges Northern youths on nation building",
    "summarized_story": "Almakura stated this in his opening address at the inauguration of the newly elected Speaker, Principal Officers and Members the Third Northern Youths Assembly of Nigeria, NYAN, in Abuja.\n“We condemned the continuous senseless killings, abduction and destruction of lives and properties in the Northern region of the country by terrorist group.\nHe said during his term the assembly was about to collaborate with National Drug Law Enforcement Agency and Ministry of Health to organize programmes for northern youths.\nSimilarly, the Chairman, Board of Trustee, Northern Youths, Mr. John Aba, said the spirit of the youths in national development cannot be overemphasized.\nThe northern youths would be a deciding factor in the 2023 general election to produce the president of this country,’’ Aba said."
  },
  {
    "headline": "PDP Retreat: Udom canvasses stronger participation of women, youths",
    "summarized_story": "By Dirisu YakubuAkwa Ibom State Governor, Udom Emmanuel, has called for a structural process in the Peoples Democratic Party, PDP, capable of enhancing greater participation of women and youths in politics and governance of the country.\nGovernor Emmanuel, who spoke at the closing of the two days retreat of the PDP, themed “Rescue and Rebuild Nigeria”, insisted that women and youths must be given the opportunity to explore their full potentials within the party and in government.\nAccording to him, youths and women are the powerhouses of electioneering activities as well as economic and social development of any society and as such should be allowed greater participation in policy making and implementation both in the party and in government.\n“Youths and women are the real powerhouse of our electioneering activities; they are also the real drivers of our economic and social development as a country.\nHe therefore charged the women and youths to get ready and position themselves to take up key party and government positions at the various levels across the country, especially as the party set to democratically take over power come 2023."
  },
  {
    "headline": "Enugu State has 152, 243 stunted children – UNICEF",
    "summarized_story": "UNICEF declared in Enugu on Friday that 152,243 children below five years of age are stunted in Enugu State.\nIts Planning and Monitoring Specialist, Enugu Field Office, Mrs Maureen Zubie-Okolo, made the declaration at a policy dialogue with Enugu State Executive and Legislative Councils on Investment in Nutrition.\nZubie-Okolo attributed the situation to poor nutrition arising from poor maternal, infant and young child feeding practices during the first 1,000 days of birth.\nIn her contribution, a Nutrition Specialist, Mrs Chizoba Steve-Edemba, said that the nutrition indices in Enugu State was so low and needed to be addressed.\nResponding, the Enugu State Commissioner for Budget and Planning, Mr David Ugwunta, said that the state government would aggregate all issues raised at the meeting and attend to them."
  },
  {
    "headline": "Rape: Adamawa records 149 cases in 10 months",
    "summarized_story": "Mrs Saso Ali, the Permanent Secretary, Adamawa Ministry of Women Affairs and Social Development, says 149 cases of rape were recorded in the last 10 months in the state.\nShe said the cases were recorded between January and October, 2021, adding that 123 of the cases were minors.\nThe Permanent Secretary said that 89 per cent of the perpetrators were charged to courts after receiving services from the police.\n“We are yet to secure a single conviction on the cases,” she said.\n“If we do not have conviction, some bad elements will continue to commit rape because they may feel that nothing will happen to them,” she said."
  },
  {
    "headline": "Buhari reveals his desire for Nigeria as Gen. Zurkusu, 7 other slain soldiers are laid to rest",
    "summarized_story": "President Muhammadu Buhari says his desire is to build a good, secured and safe place for future generations of Nigerians.\nBuhari, represented by the Secretary to the Government of the Federation, Mr Boss Mustapha, gave the assurance in Yola on Friday at the burial of Brig.- Gen. Dzarma Zurkushi and seven other soldiers.\nHe died on Nov. 13 alongside the seven other soldiers while rushing to reinforce troops in a counter-offensive against terrorists.\nAhmadu Fintiri of Adamawa described the death of late Zurkushi and other officers as a major setback in the counter insurgency campaign.\nFintiri said that Zurkushi’s death remained one death too many in a needless war."
  },
  {
    "headline": "Oyo govt suspends 3 teachers over alleged sexual assault on students",
    "summarized_story": "Oyo State Government on Friday announced that it has suspended no fewer than three teachers over alleged sexual harassment of students.\nThe three teachers were teaching at Oyo state basic school, Ogbomoso prior to their suspension.\nThe state Commissioner for Education, Science and Technology, Mr. Rahman Abdu-Raheem made these revelations in a statement made available to DAILY POST Friday night.\nThe commissioner in addition, explained that the Headteacher of the school and the Principal, Oyo State Training School for the Blind have been transferred.\nHe then “urged parents, students and other relevant stakeholders to support and partner with this government."
  },
  {
    "headline": "COVID-19: 3.5m Nigerians fully vaccinated",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) says 3,487,298 Nigerians have been fully vaccinated against COVID-19.\nDr Faisal Shuaib, the Executive Director, made the announcement at the start of mass vaccination in Nasarawa State.\n“From the data above, it is clear that Nigeria is still far from reaching its target of vaccinating almost 112 million of its eligible population,” he noted.\nShuaib added that the Federal Government is steeping up vaccination in view of the festive period to avoid risk of virus spread.\n“The main aim of the mass vaccination campaign is to vaccinate 50 per cent of Nigeria’s eligible population by January 2022,” the official told reporters."
  },
  {
    "headline": "NIMASA boss, Danish envoy meet over reported killing of pirates",
    "summarized_story": "The Nigerian Maritime Administration and Safety Agency (NIMASA) has met with the Danish Ambassador to Nigeria, Mr Sune Krogstrup, on the reported killing of pirates in the Gulf of Guinea by a Danish frigate.\nThe Director General of NIMASA, Dr Bashir Jamoh, made this known in a statement in Lagos on Friday.\nThe statement was signed by Mr Edward Osagie, Assistant Director, Public Relations of NIMASA.\nHe said that the agency would continue to do everything within its powers, including collaborations, to ensure the Gulf of Guinea remained a safe place for virile maritime activities.\nJamoh said that NIMASA would update the public with necessary information as the situation unfolds and more facts become available."
  },
  {
    "headline": "Gen Dzarma Zurkusu, 7 other slain soldiers buried in Yola",
    "summarized_story": "Slain Brigadier-General Dzarma Zurkusu was buried on Friday at the military cemetery in Yola, the Adamawa State capital.\nZurkusu was killed alongside four soldiers in an ambush by the Islamic State West Africa Province (ISWAP) terrorists in Uba Askira, Borno State, on November 13, 2021.\nAll the slain eight military officers and men were buried at Gibson Jalo Cantonment cemetery Friday during a string of ceremonies, including an afternoon church service, that lasted into the evening.\nIn a message to the burial ceremony, President Muhammadu Buhari described the late military officers as great fighters.\nGovernor Ahmadu Fintiri, who personally attended the burial ceremony, announced the naming of a street in Yola after the deceased brigadier general."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "My abductors were in army uniform, says Eze Ndigbo",
    "summarized_story": "The abducted Eze Ndigbo of Ifon, in Ose Local Government Area of Ondo State, Donatus Okereke, who was on Friday evening released from captivity said his abductors were northerners dressed in army uniform.\nOkereke was kidnapped last Monday and spent five days in captivity before he was released.\n“One of them (the shooters) was wearing an army uniform.\nWe later trekked the whole night.\nMy abductors are purely northerners,” Okereke said."
  },
  {
    "headline": "General killed by ISWAP, seven others buried in Yola",
    "summarized_story": "General killed by ISWAP, seven others buried in YolaBrigadier General Dzarma Zurkusu and seven other soldiers killed earlier in the month in Chibok, Borno State, were buried on Friday in Yola.\nZurkusu was killed alongside four soldiers in an ambush by the Islamic State West Africa Province (ISWAP) terrorists in Uba Askira, Borno State, on November 13, 2021.\nEarlier, three other military fighters were killed in a separate encounter with the terrorists.\n“He was synonymous with gallantry,” Boss Mustapha said of the General, adding that the General would be remembered for such worthy attribute.\nBoth towns have always been the hardest hit in Adamawa State in respect of attacks by Boko Haram terrorist elements."
  },
  {
    "headline": "Police recommend dismissal, prosecution of Enugu killer inspector",
    "summarized_story": "The police authorities in the Zone 13, Ukpo-Dunukofia, Anambra State have recommended the dismissal of a police officer, Inspector Edem Ebong, for allegedly killing five persons.\nThe victims were reportedly shot dead by Ebong while he was attached to RC Lotto Company, at Golf Estate, GRA, Enugu, on June 20.\nEbong subsequently claimed that the shooting was perpetrated by unknown gunmen before one of the survivors reported him as the attacker.\nAfter months of investigation into the matter, the Assistant Inspector-General of Police in charge of Zone 13, Ukpo-Dunukofia Anambra State, AIG Muri Umar Musa, approved Ebong’s dismissal from the police and his subsequent prosecution.\nThe police, therefore, called on residents of the state to remain law-abiding, and promptly report erring policemen to the nearest station, or by calling the command’s hotlines."
  },
  {
    "headline": "Diezani loses bid to recover $40m jewelry from Fed Govt",
    "summarized_story": "The appellate court held that there was no substance in Alison-Madueke’s bid to overturn the lower court’s order.\nOn July 5, 2019, the EFCC secured an order of the high court temporarily forfeiting the expensive items to the Federal Government.\nThe judge held that the former minister failed to show cause why the jewelry should not be forfeited to the Federal Government.\nThe Former Minister on her part had challenged the seizure of the jewelry from her premises by the EFCC.\nShe also accused the anti-graft agency of entering her apartment illegally and taking the items without any court order."
  },
  {
    "headline": "Herdsmen kill 11 persons in Plateau village",
    "summarized_story": "“Again this same Fulani herders attacked the Village of Ta’agbe and as at now we have already established the dead of 11 people while the search is ongoing.\nThe Governor totally condemned the attack and said there is no explanation that can justify it.\nHe therefore directs security agencies to take immediate and drastic steps to apprehend the perpetrators and ensure that they pay for their crimes.\nLalong said “the persistent attacks in this general area remains condemnable and unacceptable to Government.\n“I expect the security agencies to deploy everything at their disposal to arrest those who carried out the crime no matter how long it takes."
  },
  {
    "headline": "Ohanaeze congratulates the first woman president",
    "summarized_story": "The National leadership of the Apex Igbo social-cultural Organization, Ohanaeze Ndigbo Worldwide, has sent a congratulatory message to the newly elected President of Ohanaeze Ndigbo UK and Ireland, Chief Lady Aqueen Ibeto.\nStepping into the culturally reserved enclave of men, Aqueen Ibeto made history, became the very first Igbo woman to be entrusted with the exulted office of Ohanaeze President anywhere in the world.\nChief Lady Aqueen Ibeto came into prominence with her election as the deputy President of Ohanaeze UK, representing Enugu State in 2018.\nThe office of the President General of Ohanaeze Ndigbo Worldwide will always accord you all the support and cooperation while your tenure ends”.\nThis special recognition by the National headquarters of Ohanaeze Ndigbo worldwide has put to rest some discordant voices that are not comfortable with the emergence of woman as Ohanaeze President."
  },
  {
    "headline": "No rest until insurgents, bandits’re crushed –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has again issued marching order to security chiefs over insecurity across the country occasioned by activities of bandits and insurgents, saying they must not rest until all Nigerians are at rest.\nMinister of Interior, Rauf Aregbesola, made the disclosure at the end of the National Security Council (NSC) meeting at the State House, Abuja.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe police and other security agencies had been mobilised to intensify surveillance, patrol in pursuit of the criminals.\n“The president was particularly happy with the fact that a free and fair election was made possible by the INEC and our security agencies."
  },
  {
    "headline": "‘FG’s bailout funds to states hit N1.7trn’",
    "summarized_story": "From Fred Itua, AbujaBailout funds given to the 36 states to cushion the effects of recession have hit N1.75 trillion.\nThe funds approved by the President Muhammadu Buhari-led Federal Government did not get the nod of the National Assembly.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nA former senator, Dino Melaye, during a press conference, wondered why President Buhari has not queried how governors expended the funds since the first tranche was given.\n“Each state is to receive N18.2 billion from the facility, which according to the report, will help the states afford the repayment of previous bailout facilities namely the Salary Bailout, Excess Crude facility and Budget Support facility guaranteed to them by the Federal Government."
  },
  {
    "headline": "Sultan, Fayemi, Ikpeazu, Lalong others to brainstorm on insecurity in Abuja",
    "summarized_story": "From Fred Itua, AbujaReligious, traditional and political leaders have concluded plans to converge on Abuja for national unity summit.\nAccording to organisers of the event, it would provide a platform for illustrious Nigerians representing diverse interests and groups to have a meaningful conversation on the themes of peace, unity, equity and nation-building.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe summit would also provide new perspectives to the issues of equity, inclusion and economic prosperity for Nigerians and in the end, stimulate the process of national healing, understanding and progress.\nAlso expected are Prof. Attahiru Jega, former Chairman of INEC, who is to deliver the keynote address and Prof. Doyin Salami, chairman of the Presidential Economic Council."
  },
  {
    "headline": "Breaking: FG Orders Civil Servants on GL 12 and Below to Resume Duties Dec 1",
    "summarized_story": "Olawale Ajimotokan in AbujaThe federal government has ordered all civil servants on Grade Level 12 and below, who have been working from home as part of measures to curtail the spread of COVID-19 to resume duties on December 1, 2021.\nThe Head of Service of the Federation, Dr Folasade Yemi- Esan gave the directive in a circular HCSF/ 3065/ Vol.\nShe advised all public officers who are yet to be vaccinated to visit the following centres in Abuja: Federal Staff Clinic, Federal Secretariat Complex, Phase I, Federal Staff Clinic, Federal Secretariat Complex, Phase ll, Federal Ministry of Works and Housing Clinic, Mabushi, Federal Ministry of Finance Staff Clinic and Federal Ministry of Agriculture and Rural Development Staff Clinic and other centres nationwide that can be found on the website of the National Primary Health Care Development Agency (NPHCDA).\nShe enjoined all permanent secretaries and heads of government agencies to bring the contents of the circulars to the attention of their staff as well as ensure strict compliance.\nIt will be recalled that civil servants from GL 12 and below have since March 2020 been directed to stay at home until further notice to streamline the number of workers who come to work daily as a preventive measure to curb the spread of the virus."
  },
  {
    "headline": "Breaking: Fresh Attack on Plateau, Several People Killed, Houses Burnt",
    "summarized_story": "Corpses evacuated, says community leaderSeriki Adinoyi in JosNo fewer than 10 persons were killed as gunmen attacked Te’egbe community in Bassa Local Government Area of Plateau state on Friday.\nSpokesman for the Miango Youth Development Association, Mr Nuhu Bitrus, while confirming the attack on Friday morning said search and rescue operations for the victims were still ongoing.\nHe said, “Last night was really another black day for the Rigwe nation as (suspected) Fulani militia attacked Te’egbe village, killed so many people and injured many others.\nThey also set their houses on fire.\nWe will let you know when we are done with the search and rescue operation.”The Police are yet to confirm the incident."
  },
  {
    "headline": "In Matching Words with Action, Emefiele Inaugurates N500m Youth Entrepreneurs’ Scheme",
    "summarized_story": "He urged government at all levels to evolve policy measures to support entrepreneurial development among the youth in the country.\nOther members of the BoE include Chief Financial Officer, First Bank Plc, Mr. Patrick Iyamabo; Mr. Adamu Lawani (Zenith Bank Plc); Ms. Ngover Ihyembe-Nwankwo (Rand Merchant Bank); Mr. Ashafa Ladan (National Universities Commission); Mr. Abbati D.K.\nEmefiele also noted that the development grant component was aimed at raising awareness and visibility of entrepreneurship among undergraduates of Nigerian tertiary institutions.\nHe insisted that the grant awards should be used by the tertiary institutions solely for the development of the award-willing ideas.\nHe said the CBN was playing a significant role in laying a solid foundation for technological development in the tertiary institutions."
  },
  {
    "headline": "FG: Nembe Oil Spill Now Under Control",
    "summarized_story": "Minister of Environment, Sharon Ikeazor, who made disclosed the control of the spill at the weekly ministerial press briefing organised at the State House, Abuja.\nSylva, also disclosed that the federal government and Aiteo oil company had moved to contain the massive oil spill.\nShe also disclosed plans to institute stiffer penalty for companies involved in oil spill in the country, adding that the operating company is blaming locals for the latest incident in OML29, Nembe.\nShe said, “I got briefings and what I saw in terms of the pollution either through oil refining or illegal oil refining and otherwise – the devastation of the Niger Delta is massive.\nIt’s a collective action between the Ministry of Petroleum Resources, the Ministry of Environment, and the oil company involved."
  },
  {
    "headline": "Oil Market Defies US-led Coalition’s Strategy to Lower Rising Prices",
    "summarized_story": "Emmanuel Addeh in AbujaDespite the United States-led coalition’s strategy to cool oil prices, the market remained steady yesterday, with Brent, Nigeria’s benchmark oil, still above $80 per barrel.\nCrude oil prices recently touched seven-year highs and although they are still some way short of levels reached between 2011 and 2014, when they broke through $100 a barrel, many consumers are feeling the pain of a dramatic increase from a year ago.\nHigh oil prices have added to inflationary concerns, with the coordinated release expected to add around 70-80 million barrels of crude supply to markets, according to analysts at Goldman Sachs.\nThe US Department of Energy had launched an auction to sell 32 million barrels of strategic petroleum reserves(SPR) for delivery between late December to April 2022.\nThat is, if 66 million barrels are injected by major consumers over the two-month period, according to a document leaked to the public."
  },
  {
    "headline": "BREAKING: Nigerian Communications Commission Approves Immediate Restoration Of Telecoms Services In Kaduna Communities",
    "summarized_story": "The Nigerian Communications Commission (NCC) has approved the immediate restoration of telecommunications services for communities in Kaduna State where they had initially been shut down.\nA message from the NCC to Kaduna State Government obtained by SaharaReporters on Friday said the approval had been granted with immediate effect.\nIt said, \"Approval is hereby granted for you to restore telecom services in the following LGAs of Kaduna State with immediate effect.\nSee Also Breaking News BREAKING: Kaduna Lifts Two-Month Ban On Mobile Phone Services As Bandits On Kaduna-Abuja Road Defy Telecoms Shutdown\"Letter will follow as usual.\"\n\"The relevant federal agencies have today informed the Kaduna State Government that the processes for telecoms shutdown in parts of the state have commenced."
  },
  {
    "headline": "BREAKING: Nigerian Communications Commission Approves Immediate Restoration Of Telecoms Services In Kaduna Communities",
    "summarized_story": "The Nigerian Communications Commission (NCC) has approved the immediate restoration of telecommunications services for communities in Kaduna State where they had initially been shut down.\nA message from the NCC to Kaduna State Government obtained by SaharaReporters on Friday said the approval had been granted with immediate effect.\nIt said, \"Approval is hereby granted for you to restore telecom services in the following LGAs of Kaduna State with immediate effect.\nSee Also Breaking News BREAKING: Kaduna Lifts Two-Month Ban On Mobile Phone Services As Bandits On Kaduna-Abuja Road Defy Telecoms Shutdown\"Letter will follow as usual.\"\n\"The relevant federal agencies have today informed the Kaduna State Government that the processes for telecoms shutdown in parts of the state have commenced."
  },
  {
    "headline": "Islamic Police, Hisbah Arrests Youths For Playing ‘Whot Game’ In Kano",
    "summarized_story": "The Kano Hisbah Command has arrested a group of youths playing a popular card game, Whot, in Warawa town, Kano.\nThe young men were accused of wasting their time playing the card game instead of using their time for a productive venture.\nA video of the wedding party shows Nigerian singer, Mayorkun singing and some of the party attendees spotting Afro, Mohawk or any of the hairstyles Kano State Hisbah has labelled as “unIslamic” and an insult to Islam.\nAll these have attracted punishments from Kano Hisbah, in cases where poor Nigerians were involved.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state."
  },
  {
    "headline": "Islamic Police, Hisbah Arrests Youths For Playing ‘Whot Game’ In Kano",
    "summarized_story": "The Kano Hisbah Command has arrested a group of youths playing a popular card game, Whot, in Warawa town, Kano.\nThe young men were accused of wasting their time playing the card game instead of using their time for a productive venture.\nA video of the wedding party shows Nigerian singer, Mayorkun singing and some of the party attendees spotting Afro, Mohawk or any of the hairstyles Kano State Hisbah has labelled as “unIslamic” and an insult to Islam.\nAll these have attracted punishments from Kano Hisbah, in cases where poor Nigerians were involved.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state."
  },
  {
    "headline": "Islamic Police, Hisbah Arrests Youths For Playing ‘Whot Game’ In Kano",
    "summarized_story": "The Kano Hisbah Command has arrested a group of youths playing a popular card game, Whot, in Warawa town, Kano.\nThe young men were accused of wasting their time playing the card game instead of using their time for a productive venture.\nA video of the wedding party shows Nigerian singer, Mayorkun singing and some of the party attendees spotting Afro, Mohawk or any of the hairstyles Kano State Hisbah has labelled as “unIslamic” and an insult to Islam.\nAll these have attracted punishments from Kano Hisbah, in cases where poor Nigerians were involved.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state."
  },
  {
    "headline": "Ethiopian prime minister 'joins army at battlefront in fight against rebel forces'",
    "summarized_story": "Prime Minister Abiy Ahmed of Ethiopia, on Friday, shared a video of himself in what appeared to be a military operation.\nThe prime minister had vowed to lead troops in the fight against the Tigray People’s Liberation Front (TPLF), a rebel group.\nIn the video, Ahmed, whose comments were translated to English, said troops were recording success in the military operation.\nAdvertisementThe prime minister had also asked residents of the country to arm themselves against the TPLF.\nAdvertisementMeanwhile, Ahmed, who was sworn in for a second term as prime minister in October 2021, was awarded the Nobel peace prize in 2019."
  },
  {
    "headline": "Ethiopian prime minister 'joins army at battlefront in fight against rebel forces'",
    "summarized_story": "Prime Minister Abiy Ahmed of Ethiopia, on Friday, shared a video of himself in what appeared to be a military operation.\nThe prime minister had vowed to lead troops in the fight against the Tigray People’s Liberation Front (TPLF), a rebel group.\nIn the video, Ahmed, whose comments were translated to English, said troops were recording success in the military operation.\nAdvertisementThe prime minister had also asked residents of the country to arm themselves against the TPLF.\nAdvertisementMeanwhile, Ahmed, who was sworn in for a second term as prime minister in October 2021, was awarded the Nobel peace prize in 2019."
  },
  {
    "headline": "WHO names new COVID strain ‘Omicron’, says it's 'variant of concern'",
    "summarized_story": "The World Health Organisation (WHO) has named the new COVID-19 strain as ‘Omicron’ and classified it as a variant of concern.\nAdvertisementOn Thursday, South Africa’s National Institute for Communicable Diseases (NICD) announced the discovery of the new variant, B.1.1.529, and said 22 positive cases of the strain had so far been detected in the country.\nIn recent weeks, infections have increased steeply, coinciding with the detection of B.1.1.529 variant.\nThe number of cases of this variant appears to be increasing in almost all provinces in South Africa.\nUsing this approach, this variant has been detected at faster rates than previous surges in infection, suggesting that this variant may have a growth advantage."
  },
  {
    "headline": "WHO names new COVID strain ‘Omicron’, says it's 'variant of concern'",
    "summarized_story": "The World Health Organisation (WHO) has named the new COVID-19 strain as ‘Omicron’ and classified it as a variant of concern.\nAdvertisementOn Thursday, South Africa’s National Institute for Communicable Diseases (NICD) announced the discovery of the new variant, B.1.1.529, and said 22 positive cases of the strain had so far been detected in the country.\nIn recent weeks, infections have increased steeply, coinciding with the detection of B.1.1.529 variant.\nThe number of cases of this variant appears to be increasing in almost all provinces in South Africa.\nUsing this approach, this variant has been detected at faster rates than previous surges in infection, suggesting that this variant may have a growth advantage."
  },
  {
    "headline": "Cable Foundation advocates political awareness among campus journalists",
    "summarized_story": "The importance of campus journalism as a tool for deepening democratic consciousness and active participation of youth in politics has been emphasised.\nAdvertisementThis was the crux of the town hall meeting organised by Cable Newspaper Journalism Foundation (CNJF).\nThe town hall meeting was implemented under the Campus Civic Media Campaign (CCMC) of the CNJF, with support from the Open Society Initiative for West Africa (OSIWA).\n“The town hall meeting is also designed to examine the youths’ understanding of issues bedevilling Nigeria’s democracy and to assess the performance of new media in democracy,” he said.\nAddressing participants at the town hall meeting, Cynthia Mbamalu, programme manager, Yiaga Africa, encouraged youths to engage in formal political processes and have a say in formulating policies."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "Oba Ewuare II Fixes Tuesdays, Thursdays For Receipt of Complaints, Protest from Public – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Benin Monarch, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Ewuare II, The Oba of Benin, has fixed Tuesdays and Thursdays as the days the palace would be receiving complaints and protests from members of the public henceforth.\nThis was contained in a public announcement issued by Secretary to the Benin Traditional Council (BTC), Frank Irabor and made available to newsmen yesterday in Benin City.\nThe Monarch said that protest to the palace on daily basis by individuals and villages would no longer be entertained except on Tuesdays and Thursdays.\n“The general public is hereby inform that His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Ewuare II, Oba of Benin, has instructed that henceforth, those who have complaints and would want to protest to the Palace, should do so either on Tuesdays or Thursdays.\n“Consequences, the Palace will not entertain any protest during the month of December, 2021”, the statement concluded."
  },
  {
    "headline": "Obaseki pledges to empower more Edo youths through sports – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government will sustain investment in sports development to productively engage and empower youths in the state.\nObaseki gave the assurance when he received the National Scrabble Champion, Osahon Omosefe, who was on a courtesy visit at the Government House, Benin City.\n“Scrabble is among the indoor games that we want to encourage our young ones to participate in.\nI have seen the potential in our young people; such potential is being exhibited by someone like you.\nThe National Scrabble Champion noted, “I am delighted to present the trophy to you, Your Excellency."
  },
  {
    "headline": "Obaseki urges policies to attract investment in gas sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki and stakeholders in the Liquefied Petroleum Gas (LPG) sector have called for targeted policies to attract more investments into the sector to maximise Nigeria’s gas resources for national development.\nObaseki, represented by the state’s Commissioner for Mining, Oil and Gas, Engr.\nEthan Uzamere, said the value and investment to the sector could be increased with the right policies and regulatory framework.\nAccording to him, “Given this impressive statistic, work to scale up the project is currently ongoing.\nWe are planning on selling power to clients who are willing to buy."
  },
  {
    "headline": "No Truth About Rumored 5k Disburment for Nigerians – Senator Olamilekan – Nigerian Observer",
    "summarized_story": "Senator Olamilekan stated this during the presentation of 2022 budget report before the committee on Appropriations in Abuja.\nSenator Solomon Adeola Olamilekan said the budget appropriated for the Ministry of Finance has fallen below standard and needed to be reviewed.\nAlso presenting his committee’s report on power, senator Gabriel Suswam said the 2022 budget was aimed addressing some challenges in the power sector.\nSenator Suswam said he was worried with the poor electricity supply in the country looking at the funds expended on the sector.\nSenator Gabriel Suswam said that already the ministry of power has begun to carry out minor road construction to the site."
  },
  {
    "headline": "Bukola Afriogun appointed as new Acting CFO of Infinity Trust Mortgage Bank appoints",
    "summarized_story": "Mr Bukola Afriogun has been appointed as Acting Chief Financial Officer (CFO) of Infinity Trust Mortgage Bank Plc, effective from 30th of October, 2021.\nThe appointment follows the resignation of the former CFO of the bank, Mr Samson Agbaka, whose resignation became effective from 30th of October, 2021.\nPrior to the recent appointment, he was the Deputy CFO of the Bank.\nHe also served as a former CFO of Hasal Microfinance Bank Limited.\nFounded in 1992, Infinity Trust Mortgage Bank Plc engages in providing mortgage banking, construction finance, and other financial services to corporate and individual customers."
  },
  {
    "headline": "CBN projects 3.0 GDP growth for 2021",
    "summarized_story": "OBINNA EZUGWUThe Central Bank of Nigeria (CBN) has projected the country’s economy to grow by 3.0 percent in 2021, up from negative growth of -1.8 percent in 2020.\nHe said, “As a result of these measures, we witnessed robust economic recovery as GDP growth stood at 4.03% in the 3rd quarter of 2021, following the 5.01% growth recorded in the 2nd Quarter of 2021.\nWe have also witnessed a gradual recovery in manufacturing output growth as the Manufacturing PMI index rose to 47.3 points in October 2021 from 44.9 in January 2021.\nI am pleased to note that growth has returned to pre-covid levels due to the accommodative policy support provided by the monetary and fiscal authorities.\n“As a result of these growth enhancing policy measures, we project that GDP will grow at 3.0 percent for 2021 up from -1.8 percent in 2020."
  },
  {
    "headline": "Start preparing for life after school before graduation -Farounbi advises students",
    "summarized_story": "Farounbi noted that lack of employment opportunity is the major problem confronting the nation, stressing that employment education should be given to school leavers right from their school days.\nThe diplomat stated this during a stakeholders meeting and presentation of a book tagged “Employment Education, the New Imperative” for the who is who in education sector in Osun state.\nAccording to him, every school leaver should start preparing for work after school from elementary stage, adding that skill acquisition should be embedded in every school curriculum to allow school leavers not only to be self reliant, but also to be able to practicalize what they have been taught in the school.\nHe implored government at all levels to give priority to teaching of skill acquisition in schools so that unemployment could be drastically reduced.\nIn his own remarks, spokesperson for FROSTOW, Prince Abiodun Lufadeju said a major cause of unemployment in Nigeria is lack of employment education."
  },
  {
    "headline": "BEDC assures customers of improved services, complaint resolution",
    "summarized_story": "The Management of BEDC Electricity Plc has assured customers of her commitment to resolving complaints during a Customer Complaints Resolution session organized by the Federal Competition and Consumer Protection Commission (FCCPC) in partnership with MacArthur Foundation on Wednesday in Benin City, Edo State where they met with electricity consumers.\n“BEDC has a robust system put in place to attend to customers’ complaints, and we are ready to attend to your complaints and lots of things are being done by the company to ensure that customers are happy,” he said.\nAccording to Enechaziam, BEDC has commissioned some projects to boost network infrastructure and improve power availability to customers in its franchise and currently had lots of network expansion going on to boost customer satisfaction.\nHe said it is a ccommencement of a four-day electricity consumer complaint resolution platform in Benin and that the platform was being organised by FCCPC in conjunction with the MacArthur Foundation.\nThe 4-day complaint resolution session is a triage, a collaborative desk where BEDC customers can have their complaints attended to with a view of resolution, while also interacting with customers to identify the problems being experienced as a feedback for service improvement, with a view to resolving such complaints/issues to enable legitimate customers continue to enjoy improved service."
  },
  {
    "headline": "Manufacturers, Others Jittery Over Electricity, Petrol Subsidy Removal",
    "summarized_story": "He said the impact of subsidy removal will be felt by both demand and supply, with more emphasis on the demand side.\nOn his part, head of research, Agusto & Co, Jimi Ogbobine, noted that the economic implication of fuel subsidy “is that we spend over N1 trillion every year on fuel subsidy.\nThe reality is that the sentiments among the citizenry are not favourable to the deregulation of petroleum product pricing or petroleum subsidy removal.\nNo doubt there is a sound economic and business case in favour of fuel subsidy removal, but the social and political contexts are equally critical.\nIt is true that to sustain private investment in the electricity sector, the subsidy should be discontinued."
  },
  {
    "headline": "Manufacturers, Others Jittery Over Electricity, Petrol Subsidy Removal",
    "summarized_story": "He said the impact of subsidy removal will be felt by both demand and supply, with more emphasis on the demand side.\nOn his part, head of research, Agusto & Co, Jimi Ogbobine, noted that the economic implication of fuel subsidy “is that we spend over N1 trillion every year on fuel subsidy.\nThe reality is that the sentiments among the citizenry are not favourable to the deregulation of petroleum product pricing or petroleum subsidy removal.\nNo doubt there is a sound economic and business case in favour of fuel subsidy removal, but the social and political contexts are equally critical.\nIt is true that to sustain private investment in the electricity sector, the subsidy should be discontinued."
  },
  {
    "headline": "HOS Directs Civil Servants From Grade 12 And Below To Resume",
    "summarized_story": "Head of the civil service of the federation, Dr. Folashade Yemi- Esan has directed civil servants from grade 12 and below to resume work on December 1st.\nRecall that because of the Covid -19 pandemic, civil servants from grade 12 and below were asked to work from home to curtail the spread of the pandemic.\nIn a circular on Friday, Yemi- Esan said on the recommendation on the committee on Covid -19, President Muhammadu Buhari had approved the vaccine mandate policy.\nADVERTISEMENTShe said all civil servants would therefore be required to show proof of Covid-19 vaccination or present a negative Covid -19 PCR test result done within 72 hours."
  },
  {
    "headline": "HOS Directs Civil Servants From Grade 12 And Below To Resume",
    "summarized_story": "Head of the civil service of the federation, Dr. Folashade Yemi- Esan has directed civil servants from grade 12 and below to resume work on December 1st.\nRecall that because of the Covid -19 pandemic, civil servants from grade 12 and below were asked to work from home to curtail the spread of the pandemic.\nIn a circular on Friday, Yemi- Esan said on the recommendation on the committee on Covid -19, President Muhammadu Buhari had approved the vaccine mandate policy.\nADVERTISEMENTShe said all civil servants would therefore be required to show proof of Covid-19 vaccination or present a negative Covid -19 PCR test result done within 72 hours."
  },
  {
    "headline": "Appeal Court Dashes Diezani’s Bid To Recover $40m Jewelry",
    "summarized_story": "The Appeal Court yesterday dismissed an appeal filed by a former minister of Petroleum Resources, Diezani Alison-Madueke, seeking to recover her jewelry worth $40 million which was forfeited to the federal government.\nThe Lagos division of the appellate court, in its judgment read by Justice Festus Obande, ruled that the appeal lacked merit.\nThe appellate court held that there was no substance in Alison-Madueke’s bid to overturn the lower court’s order and subsequently dismissed the move.\nLEADERSHIP Weekend recalls that Justice Oweibo had on July 19, 2019 granted final forfeiture of the expensive items to the federal government.\nShe also accused the anti-graft agency of entering her apartment illegally and taking the items without any court order."
  },
  {
    "headline": "Tears as herdsmen abduct 10 travellers, rape, stab woman to death in Abia",
    "summarized_story": "Confirming the dastardly incidents to our Correspondent, the Isuikwuato LGA Chairman, Hon.\nChima Agbaeze decried the activities of Fulani herdsmen in the area.\nThe Council boss particularly expressed shock and rage that bandits successfully abducted travelers despite having many security checkpoints on the same road.\nOn the identity of the abducted travelers, the LG boss said efforts were ongoing to unravel it.\nKidnapping for ransom by Fulani bandits have become a regular occurrence around Isuikwuato LGA and some parts of Abia North."
  },
  {
    "headline": "Tears as herdsmen abduct 10 travellers, rape, stab woman to death in Abia",
    "summarized_story": "Confirming the dastardly incidents to our Correspondent, the Isuikwuato LGA Chairman, Hon.\nChima Agbaeze decried the activities of Fulani herdsmen in the area.\nThe Council boss particularly expressed shock and rage that bandits successfully abducted travelers despite having many security checkpoints on the same road.\nOn the identity of the abducted travelers, the LG boss said efforts were ongoing to unravel it.\nKidnapping for ransom by Fulani bandits have become a regular occurrence around Isuikwuato LGA and some parts of Abia North."
  },
  {
    "headline": "$111,500,000 Fraud: Man Docked For Presenting Forged Documents To ZenithBank",
    "summarized_story": "By TONY ADAMSThe Economic and Financial Crimes Commission, EFCC, on Friday, November 26, 2021, arraigned one Stanley Okoye and Larbrador Shipping Services Limited before Justice O.A.\nTaiwo of the Special Offences Court sitting in Ikeja, Lagos for an alleged $111,500,000 fraud.\n“We also urge the Court to order that the defendant be remanded at the Nigerian Correctional Centre,” he said.\n“We also urge the Court to remand the defendant in EFCC custody,” Ofulue added.\nIn his response, Mohammed argued that a proper bail application ought to be brought before the Court, which the prosecution will also respond to."
  },
  {
    "headline": "$111,500,000 Fraud: Man Docked For Presenting Forged Documents To ZenithBank",
    "summarized_story": "By TONY ADAMSThe Economic and Financial Crimes Commission, EFCC, on Friday, November 26, 2021, arraigned one Stanley Okoye and Larbrador Shipping Services Limited before Justice O.A.\nTaiwo of the Special Offences Court sitting in Ikeja, Lagos for an alleged $111,500,000 fraud.\n“We also urge the Court to order that the defendant be remanded at the Nigerian Correctional Centre,” he said.\n“We also urge the Court to remand the defendant in EFCC custody,” Ofulue added.\nIn his response, Mohammed argued that a proper bail application ought to be brought before the Court, which the prosecution will also respond to."
  },
  {
    "headline": "2021 NCOY: FirstBank partners Junior Achievement Nigeria, reiterates commitment to innovation, education",
    "summarized_story": "The 2021 edition of the NCOY competition will be held virtually via Zoom meetings at 10am on Saturday, 27th November 2021.\nThe 2021 National Company of the Year Program will also feature SPARK Competition.\nSPARK as an initiative of First Bank of Nigeria Limited, is an acronym for Start Performing Acts of Random Kindness.\nI would like to specially appreciate FirstBank Nigeria for their continued support and belief in the boundless potential of young Nigerians’’.\nAbout FirstBankFirst Bank of Nigeria Limited (FirstBank) is the premier Bank in West Africa and the leading financial inclusion services provider in Nigeria for over 127 years."
  },
  {
    "headline": "3 students of AAU develop robotic guard dog",
    "summarized_story": "Three students of Adekunle Ajasin University, Akungba Akoko are going places with their invention, a robotic guard dog.\nIn an interview with Reuters, the students explained why they developed the guard dog.\nTheir immediate consideration is that the guard dog if mass produced, will help fight insecurity in the country.\nThe owner of the dog can view the trigger via a camera attached to the dog’s chest, without coming out.\nThey want to make the dog move around like a normal dog, avoid obstacles, recognise its owner and be able to function in all weather."
  },
  {
    "headline": "Bianca Ojukwu joins Igbo leaders begging Buhari to release Kanu",
    "summarized_story": "By Victor NwachukwuFormer Nigerian Ambassador to Spain, Mrs Bianca Ojukwu, has pleaded with President Muhammadu Buhari to release Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB).\nMrs Ojukwu made the plea while speaking at the 10th memorial anniversary of late Igbo leader, Chukwuemeka Odumegwu Ojukwu, organised in Owerri on Friday.\nShe urged the President to consider the plea made by some Igbo leaders during their recent visit to the State House, Abuja, asking for Kanu’s release.\n“Kanu’s release will further buttress President Buhari’s commitment to healing the wounds inflicted by the sense of marginalisation felt by the Igbo nation,” she said.\nSpeaking, Mr Ahamefula Ojukwu, chairman of the occasion and son of the late Igbo leader, thanked Uwazuruike for conducting the affairs of the entire Igbo nation in unity."
  },
  {
    "headline": "BREAKING: Declaration Of Bandits As Terrorists Won’t Change Anything — Gumi",
    "summarized_story": "Declaring bandits as terrorists is just a decision taken for political expediency, renowned Islamic scholar, Sheikh Ahmad Gumi, has said.\nAccording to him, “I think the Federal Government has succumbed to media blackmail by a section of the country.\nThe declaration was even backed by the order of the Court, but as you can see even the international community did not recognise FG’s declaration on IPOB.\n“I hope this declaration will not give the licence to people to be profiling herdsmen in general as terrorists and taking laws into their hands against them.\nThe declaration will not change anything, it will not change the dynamics."
  },
  {
    "headline": "Burial Service Holds In Yola For Slain Brigadier-General, Four Other Soldiers",
    "summarized_story": "The burial service of Brigadier-General Zirkushu Dzarma and four other soldiers who died fighting against Boko Haram terrorists was held on Friday at the Saint Stephen’s Protestant Church in Yola, Adamawa State.\nThe names of the other late soldiers are: Major Luka Barde, Lance Corporal Simon Solomon, Pte.\nThe soldiers are to be buried at the military cemetery of 23 brigade of the Nigerian Army in Yola.\n‘Fallen heroes’The soldiers were killed on November 13 during a fierce encounter with terrorists in Askira Uba Local Government Area of Borno State.\nBorno State Governor, Babagana Zulum described the soldiers as fallen heroes for what he called “their supreme sacrifices to the Nigerian Nation”."
  },
  {
    "headline": "Unrest In Plateau As Gunmen Strike Again, Kill Many, Burn Houses",
    "summarized_story": "Unidentified gunmen attacked the Te’egbe community in Plateau State’s Bassa Local Government Area, killing an unknown number of residents.\nThe event occurred on Friday morning, according to NEWS DIRECT, when gunmen assaulted the neighborhood with sophisticated weaponry.\nAbout ten corpses have been retrieved, according to an eyewitness who spoke to our community journalist, while scores more are still missing.\nAccording to him, the Commissioner of Police is currently on the site assessing the extent of the damage caused by the attack.\nHe said, “We are aware of the incident, the Commissioner of Police is currently there, details will be communicated to you shortly."
  },
  {
    "headline": "Scary Events Will Happen Soon – Fresh Prophecy Emerges Concerning Nigeria",
    "summarized_story": "The Christ Apostolic Miracle Ministry’s Apostle Paul Okikijesu has warned of a significant security situation in most sections of the country.\n“The event will make people afraid to discuss in their homes; or even use their cell phone to discuss with other people.\nThese scary events will start very soon; if adequate security is not provided for the country, then people will be mindful of their speeches.\nPeople should also pray for the banking sector, oil and gas sector, foreign sector and every other sector, because all the sectors in Nigeria need supervision.\n“Nigeria should be prepared; so that it will not become a slave of those countries that are below her in every ramifications,” he added."
  },
  {
    "headline": "Abuja-Kaduna railroad passengers as endangered species",
    "summarized_story": "“Yes, there was an explosive on our rail track somewhere around Rijana and Dutse last night, and this damaged the tracks.\nHe said: “I am delighted to be here today to commission the Abuja – Kaduna railway track and flag-off the Abuja-Kaduna train services (Passengers & Freight) on Nigeria’s first ever Standard Gauge Rail track to go into operation.\nWhat this has done to us will fasten the procurement of the digital security system that we are trying to put in place.\n“The essence of the security system is to enable us to know if there is an impact on the censor.\nWe will try to get the police involved before we install the security system."
  },
  {
    "headline": "Npower batch C employment: How payment issue will be solved",
    "summarized_story": "For N-Power Batch C volunteers whose payroll status recently changed from “failed” to “pending”, should take note the stages below which are the procedures stipend will undergo before payments.\n1) If you are an N-Power Batch C volunteer and your payroll status says ‘PENDING’ it simply means you are being processed into the payroll structure, once you are on the payroll list it means your chances of being paid is at 100%.\n2) From “PENDING” your payroll status will change to “PROCESSING” this simply means your money/stipend has been sent to your bank from Central Bank of Nigeria, again your chances of being paid at this stage is 100%.\n3) Once your payroll status displays “PAID” it simply means your account has been credited, if your payment status displays paid, it means your chances of being paid is >100%, at this stage all N-Power Batch C Volunteers are advised to keep checking their banking app or use their bank USSD to check if there was an increase in their account balance.\nRelatedNo tags for this post."
  },
  {
    "headline": "Insecurity: Buhari gives service chiefs marching orders",
    "summarized_story": "For the umpteenth time, President Muhammadu Buhari has given marching orders to the security chiefs to go after insurgents, bandits and terrorists, saying they must not rest until all Nigerians are at rest.\nAregbesola said President Buhari appreciated the successes and gains recorded by all security chiefs, the security agencies and intelligence organisations on security situation nationwide after he received briefs from them at the meeting.\n“The President was particularly happy with the fact that a free and fair election was made possible by the INEC and our security agencies.\nThe police and other security agencies had been mobilised to intensify surveillance, patrol in pursuit of the criminals.\nDirector Defence Media Operations (DMO) Brigadier-General Bernard Onyeuko stated this while briefing journalists on update of military operations across the country from 11 to 25."
  },
  {
    "headline": "Pictures: Late veteran Baba Suwe’s burial rites begins",
    "summarized_story": "NextPius Awodi, passage of a man of honour and intergity"
  },
  {
    "headline": "Air Nigeria returns April 2022, to create 70,000 jobs – Sirika",
    "summarized_story": "Minister of Aviation Hadi Sirika has said the country’s national air carrier, Air Nigeria, is expected to take off April 2022.\nSitrika said, when it becomes operational, the national carrier would create about 70,000 jobs for Nigerians.\n“Today in Council, civil aviation presented two memoranda.\nThe first one is approval for the award of contract for the provision of Automated Civil Aviation Regulatory Equipment, including software support and training, which will be located in Nnamdi Azikiwe International Airport.\nThese 70,000 jobs are higher than the total number of civil servants that we have in the country."
  },
  {
    "headline": "NANS rejects proposed subsidy removal, payment of N5000 to 4om Nigerians -",
    "summarized_story": "The National Association of Nigerian students has rejected the proposed subsidy removal of the federal government and payment of five thousand naira to 40 million poor Nigerians as transportation grant.\nThe students body threatened to shut down the country should the federal government fail to suspend its plans.\nAddressing journalists at a press conference in Abuja, they described the transportation grant as another window of corruption and excessive spending by the government."
  },
  {
    "headline": "Ondo Assembly Suspends Ifedore council Chairman",
    "summarized_story": "The Ondo State House of Assembly has suspended the Chairman of Ifedore local government of Ondo State, Hon Alex Oladimeji from office for three months for alleged gross misconducts.\nThe assembly gave announced his suspension despite a court order restraining it.\nThe embatlled Chairman had on Wednesday dragged the state House of Assembly, the Speaker and the Clerk before the State High Court to restrain them from carrying any suspension or impeachment against him under any guise.\nReacting to his suspension, the council chairman said the lawmakers’ decision was illegal."
  },
  {
    "headline": "Appeal Committee Begins Sitting In Gusau, Insist No Faction In Zamfara APC -",
    "summarized_story": "The All Progressive Congress APC appeal Committee on Zamfara ward and local government congresses says it has not received petition from any quata after five days of it’s sitting in Gusau, the state CapitalThe Committee also says the party is one and United in the state and has no FactionSecretary of the Committee set up by the National Headquarters of the APC Barr.\nSuleiman Usman Elegwu at a press conference says the Committee is committed to doing justice to it’s mandateThe Press Conference took place at the state party’s Secretariate of the Matawalle’s led FactionBarr.\nElegwu says the main objective of the committee is to receive complain from aggrieved members of the party regarding the just concluded ward and local government Congresses should there be anyThe five man APC appeal Committee led by its chairman Hamman Komo says it is yet to receive complain from any quata after five days of it’s sitting in GusauThe Committee also promises to be fair in the discharge of it’s responsibilitiesGovernor Bello Matawalle and Senator Kabiru Marafa’s Factions had conducted pararell congresses during the ward and local government congresses in the stateAPC Ward Congress in Zamfara held on Saturday 13th November while the Local Government congress held on Saturday 20th and the state Congress is expected to hold this Saturday 27th NovemberThe congresses has afforded members to elect officers of their choice that will steer the ship of the party at all levels in the next four yearsThe Governor Bello Matawalle’s led Faction and that of Senator Kabiru Marafa’s Faction has been at loggerhead since the Defection of Governor Bello from the PDP to the ruling APC in July this yearThe five man APC appeal Committee which is holding it’s sitting at the Headquarters of the Matawalle’s led Faction of the party is expected to complete it’s assignment before the State Congress of the party slated for Saturday, November 27thThe Committee also recognizes the Matawalle’s led Faction secretariate as the authentic in the state."
  },
  {
    "headline": "Anambra Election Conduct was our most Challenging",
    "summarized_story": "The chairman of the Independent national electoral commission, Mahmood Yakubu , said the Anambra governorship election is the most difficult election ever conducted in the history of the commission.\nHe made the statement at a two day interactive meeting for Online publishers, media executives .\nThe commission Chairman said the sit at home order on Mondays in Anambra State by IPOB affected the preparation for election.\nMr Mahmood Yakubu said the commission lost everything in Anambra State in preparation for the election when the inec office in Awka was razed down in June.\nAs a result of that all non sensitive materials were gotten from neighbouring States, Enugu and Imo."
  },
  {
    "headline": "IPOB Accused of Arson In Imo By Nigerian Army – Trending With Ojy Okpe",
    "summarized_story": "The Nigerian Army has denied the alleged reprisal attack, by some of its officers on civilians in Imo state.\nGunmen on Monday afternoon were said to have killed a military officer when they attacked some soldiers in Awo Mmamma, in the Oru East Local Government Area of Imo State.\nThe Governor of Abia State Okezie Ikpeazu has come under fire on social media for saying that women who deliver at primary health care facilities in the state would be given N500.\nHeavy rainfall in the city of Aba in Abia State.\nMeanwhile major street was flooded leaving commuters and vulnerable school children no choice but walk through murky water to get to their destination."
  },
  {
    "headline": "Sudan’s PM Hamdok Backed Military Takeover, Says General",
    "summarized_story": "The deputy head of Sudan’s governing sovereign council, General Mohamed Hamdan Dagalo, has said that Prime Minister Abdalla Hamdok was aware of last month’s military takeover before it happened and was “completely agreeable” to it.\nHamdok was deposed by the military on October 25 but reinstated as interim premier after signing a deal on Sunday with Sudan’s top general to restore the transition to civilian rule.\n“We did not make such a move on our own.”Dagalo said the military takeover was “the best option to stop what was becoming a spiralling crisis”.\n“Now the deputy chairman says they had actually discussed it with Hamdok and he knew of the military takeover before it took place,” said Atas.\nTwelve cabinet ministers also submitted their resignation to Hamdok in protest against the deal between the prime minister and the military."
  },
  {
    "headline": "World Takes Action as New Covid Variant Emerges in Southern Africa; Europe and Asia Tighten Borders",
    "summarized_story": "A slew of nations moved to stop air travel from southern Africa on Friday, and stocks plunged in Asia and Europe in reaction to news of a new, potentially more transmissible COVID-19 variant.\nAirlines shares were hammered, with Lufthansa off 12.4%, IAG, parent of British Airways and Iberia, off 14.4%, Air France-KLM down 8.9% and easyJet falling 10.9%The World Health Organization cautioned not to jump to conclusions too fast.\nCurrently identified as B.1.1.529, the new variant has also been found in Botswana and Hong Kong in travelers from South Africa, he said.\nIt says coronavirus infections jumped 11% in Europe in the past week, the only region in the world where COVID-19 continues to rise.\nThe WHO’s Europe director, Dr. Hans Kluge, warned that without urgent measures, the continent could see another 700,000 deaths by the spring."
  },
  {
    "headline": "Peng Shuai: Man Claiming to Know Athlete Says WTA Head Ignored Mail",
    "summarized_story": "A man claiming to be an associate of Chinese tennis star Peng Shuai has accused the head of the Women’s Tennis Association (WTA) of ignoring an email from her.\nMs Peng disappeared from public view after accusing former Vice-Premier Zhang Gaoli of sexually assaulting her.\nThank you again for your concern.”In an email interview with the BBC, Mr Ding alleged that Mr Simon had received the emails but “avoided” her.\nHe claimed Ms Peng was under “absolutely no supervision nor pressure, and there was definitely no punishment”.\nThis is despite Ms Peng having explicitly stated she was forced to have sex with Zhang Gaoli."
  },
  {
    "headline": "France Lashes Out at Britain’s Latest Proposal on Migrants",
    "summarized_story": "France reacted with fury Friday to Britain’s latest proposals for dealing with the deadly flow of migrants between their shores as the war of words between the two countries over the dangerous crossings across the English Channel ramped up further.\nThe letter, which was made public on social media, was deemed “unacceptable” by French government spokesman Gabriel Attal.\nAs a result, he said Britain’s Home Secretary Priti Patel was no longer welcome at a European meeting on Sunday to discuss the problem.\nAmong his recommendations, Johnson asked that France take back all migrants who cross illegally from its shores to Britain.\nBritish Transport Secretary Grant Shapps said Johnson had made the proposals in “good faith” and urged the French to reconsider their decision."
  }
]