[
  {
    "headline": "Akpabio plotting to stop protests with N2.5bn compensation, Niger Delta group alleges",
    "summarized_story": "The people of Eleme and Ogoni communities in Rivers State have decried the release of N2.5bn for compensation to reconstruct the Eleme section of the dilapidated East-West road.\nThe President General, Ogoni Youths Federation, Legborsi Yamaabana, expressed mixed feelings over the release of the money for the payment of compensation to property owners along the East-West road.\nThis is just a statement issued by the Minister of Niger Delta Affairs, Senator Godswill Akpabio.\nWe don’t need remedial work anymore.\n“You and I know we have had remedial work on that road before and it still goes bad."
  },
  {
    "headline": "Alaafin shuns Ooni-backed group over alleged anti-Buhari posture",
    "summarized_story": "A former governor of Ogun State, Otunba Gbenga Daniel, is also said to be a member of Ooni’s Caucus, but he was not on the delegation to Alaafin’s palace on Friday.\nBut when we got there today, he kept us waiting; after a while, he asked to see the Olugbon.\nDurojaye said the Alaafin would be willing to entertain the group if they booked an appointment.\nObasanjo himself is a friend of Kabiyesi, so you can see that what you were told was not what happened.\nYou cannot just come and say you want to see him, there are protocols to follow and due process is always adhered to at Alaafin’s Palace."
  },
  {
    "headline": "We need to assist one another to alleviate poverty — AbdulLateef",
    "summarized_story": "According to the former Lagos State Commissioner for Home Affairs, Poverty is one of the major cause of crime in society.\n“Nigeria has so much but people have flagrantly disregarded the need to give even within their immediate family.\n“Nigerians need to assist one another.\nApart from the government, we also need to assist one another.\n“Our intervention in the past has reflected that their business became expanded and this would alleviate poverty in our society."
  },
  {
    "headline": "Niger closes 10 boarding schools, relocate students to safer schools for exams",
    "summarized_story": "By Wole MosadomiFOLLOWING the incessant raid of many communities including boarding schools in Niger State, the government has shut down 10 out of its 56 existing boarding schools.\nIt has consequently relocated those affected to safer schools to continue their education.\nShe explained: “After carrying out security assessment of our schools, we considered some as very “high risk” and this is why we had to close down the schools and relocate the students immediately.\nThe Education commissioner noted that, despite the security challenges confronting the state, 25 boarding schools in the State are still in operation as they are considered to be operating in relatively low-security atmosphere.\nHajiya Hannatu further said the remaining 21 boarding Schools were converted to Day schools in order to allow the students to continue their education without disruption in the locality."
  },
  {
    "headline": "I didn’t call Biafra, Yoruba nation agitators cowards – Onyema, Air Peace boss",
    "summarized_story": "Onyema was reacting to a news report in a national daily (not Vanguard), titled, “Onyema Blasts Secessionists as Cowards”.\nYes, IPOB, Yoruba nation or Arewa have their reasons for doing whatever they are doing.\n“So, I’m not here to condemn IPOB or to praise them, neither am I here to praise Sunday Igboho nor to condemn him.\nWhat I always preach to everybody, be it Arewa, Yoruba nation or IPOB or any group at that matter, is peace.\nI also didn’t use the word IPOB or Yoruba nation or Arewa."
  },
  {
    "headline": "Congress: Osun APC group raises alarm, alleges exclusion from process",
    "summarized_story": "A group of the All Progressives Congress (APC) in Osun state known as Osun Progressives (TOP) has raised an alarm, alleging that the key stakeholders have been excluded from the ward Congress commencing nationwide on Saturday.\n“We remind you that there haven’t been any signs that the Osun APC has preparation of any sort for the Congress.\n“We have it on good authority that the Ward Congress Committee appointed by the National Caretaker and Extraordinary Convention Planning committee arrived Osogbo this morning.\n“We at the Osun Progressives (TOP) will not accept that.\nWe hope the Ward Congress committee members just arriving Osogbo are pious of sterling character who exercise fairness to all stakeholders within the party."
  },
  {
    "headline": "Ward Congress: Osun APC youth protest alleged hijacking of forms, camping of officials",
    "summarized_story": "The youths who staged a protest on the Gbongan-Ibadan road, Ogo-Oluwa, Osogbo, today alleged Oyetola and Famodun of hijacking the nomination forms brought by some national officials of the APC.\nThe two leaders of the party are clearly killing APC in the State of Osun.\nThey are not either at the State Party Secretariat or any other place carrying out their national duty.\nShe called on the national leaders of the party to rescue the soul of Osun APC and its members from Governor Oyetola and Famodun.\n“We are supposed to go to the party Secretariat but they have stationed thugs there."
  },
  {
    "headline": "EFCC Recovers N5.4bn for NHIS",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, has recovered the sum of N5.4billion for the National Health Insurance Scheme, NHIS.\nThe Executive Secretary of the Commission, Professor Muhammad Nasir Sambo, disclosed this during a visit to the headquarters of the EFCC, Jabi, Abuja.\nHe said the EFCC recovered some monies belonging to the NHIS that has been trapped.\nProf Sambo commended the EFCC for the recoveries and assured that every kobo recovered will be judiciously utilized.\nResponding, the Executive Chairman, EFCC, Abdulrasheed Bawa, who was represented by the Director of Operations, Abdulkarim Chukkol, reiterated the Commission’s resolve to work with the NHIS in achieving universal health coverage."
  },
  {
    "headline": "Troops of operation Hadin Kai arrests ISWAP fighters",
    "summarized_story": "Troops of 202 battalions have taken custody of eight Boko Haram insurgents and their families, comprising 10 adult females and 22 children, who surrendered to troops at Ruwaza village in Bama Local Government Area of Borno state.\nIn a similar development, troops of the Forward Operational Base (FOB) operating along Bocobs- Bama road also arrested 20 Boko Haram fighters and their families, who surrendered to troops at Nbewa village, also in Bama Local Government Area of Borno state.\nIn a statement by Onyema Nwachukwu, Director Army Public Relations the surrendering families of the insurgents comprised 15 adult females and 26 children.\nHe said ” all the suspects surrendered to the troops, during clearance operations in the areas on 29 July 2021 following ongoing intense clearance operations by troops in the general areas.\n”Nigerian troops capture Boko Haram suppliers, recover weapons, sex enhancement drugs, others"
  },
  {
    "headline": "Ondo varsity lecturers embark on indefinite strike",
    "summarized_story": "Lecturers of the Olusegun Agagu University of Science and Technology, OAUSTECH, Okitipupa, Ondo State on Friday embarked on indefinite strike.\nThe lecturers under the aegis of Academic Staff Union of Universities, ASUU, said the industrial action became expedient in to press home their demands from the management of the institution.\nThe union took the decision after its members met during the congress at the TETFUND Building, School of Agriculture, Food and Natural Resources, OAUSTECH.\n“Congress summed up this attitude to be insensitive, provocative and a deliberate act to subject staff of the University to untold hardship.\nOndo varsity non-teaching staff suspends strike"
  },
  {
    "headline": "NIPR fumes over appointment of new military spokesperson, General Sawyer",
    "summarized_story": "The Nigerian Institute of Public Relations (NIPR) has expressed anger over the appointment of Major General Benjamin Olufemi Sawyer as the new military spokesperson.\nSawyer resumed at the Defence Headquarters on Friday as the Director of Defence Information (DDI).\nThe NIPR lamented that the Armed Forces disregarded the statutory provisions on the appointment, noting that only professionals should hold such positions whether in public or private organisations.\nThis deliberate policy of embarrassing a professional body for image-maker and crisis communicators is very unfair and unfortunate.”The NIPR official said there are set parameters of knowledge that must be acquired before anyone can practice public relations.\nHe stressed that the law establishing the NIPR makes it a criminal offence for anybody to practice PR in Nigeria without a license."
  },
  {
    "headline": "Ooni’s think-tank visits Alaafin, seeks support of traditional ruler",
    "summarized_story": "The 28-member think tank committee, comprising prominent individuals from the South-West geo-political zone set up by the Ooni of Ife, Oba Enitan Ogunwusi has visited the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi.\nThe group visited the palace on Friday.\nThe think-tank headed by Mr. Akin Osuntokun, during the visit to the Alaafin, are seeking the support of the monarch for the actualisation of the group’s mandate.\nThe delegation which includes Osuntokun, Dr. Doyin Okupe, Mr. Muyiwa Ige and other members waited at the palace for about three hours.\nSources further disclosed that the Alaafin complained that some members of the Ooni Caucus have been relentless critics of Buhari."
  },
  {
    "headline": "Court stops APC congresses in Imo",
    "summarized_story": "By Okodili Ndidi AbujaA High of the Federal Capital Territory (FCT) has warned the All Progressives Congress (APC) not to go ahead with Saturday’s congresses in Imo State pending hearing of a suit brought before the Court by the Applicant, Okey Anyikwa.\nAnyikwa is APC chairman of Ideato South Local Government Area.\nADVERTISEMENTThe applicant had approached the Court for an injunction restraining the APC from going ahead with the Saturday’s congresses because of the judgement of the Appeal Court that upheld the tenure of the State Exco elected in 2018.\nJustice Valentine Oriji, threatened to invalidate the outcome of congresses if the party disregards the position of the Court.\nOriji, had after Friday’s proceeding, ordered that all action regarding the APC congresses in the state should be stayed, pending the hearing of the Application slated for August 10."
  },
  {
    "headline": "Anambra 2021: Okonkwo resigns from PDP",
    "summarized_story": "By Nwanosike Onu AwkaChairman of United Nigeria Airlines (UNA) Chief Obiora Okonkwo has resigned from the Peoples Democratic Party (PDP) ahead of the November 6 governorship electionIn a letter of resignation addressed to National Chairman of PDP dated July 24, Okonkwo said his decision was finalHe said he had equally written to his ward chairman in Ogidi, Idemili North local government area of Anambra State.\nOkonkwo was one of the 16 governorship aspirants that contested the primary for the PDP ticket on June 26, 2021.\nADVERTISEMENTHe listed some of the reasons for his decision as unresolved litany of Court cases in the party and PDP not practicing real democracyHe maintained the PDP would not give him the platform needed to serve his State.\nThough he had not announced the party under which he would contest the November 6 election, a source reliably informed The Nation it may be the Zenith Labour Party (ZLP)."
  },
  {
    "headline": "Maduagwu to Davido: you won’t win Grammy until you marry Chioma",
    "summarized_story": "By Ekaete BasseyControversial Nollywood actor, Uche Maduagwu has mocked Davido hours after the singer in a viral video was seen calling on his father from his luxurious car.\nIn the video, the popular singer who is in the US was seen cruising in his new Rolls Royce Cullinan while his father was inside a Bentley.\nRead Also: Israel DMW curses those criticising him for worshipping DavidoReacting to this viral video, Uche mocked the DMW boss noting he’s busy screaming “My daddy” while his colleague, Burnaboy is screaming “My Grammy”.\nAccording to the Instagram actor, the “If” singer will miss out on a Grammy award unless he marries his estranged fianceé, Chioma.\nMaduagwu wrote: “Naija music industry get levels, driving your father’s Rolls Royce and screaming my daddy is one, winning globally with your music and screaming GRAMMY is another higher level."
  },
  {
    "headline": "Tokyo 2020: Mass disqualification mars Nigeria’s fortune in athletics",
    "summarized_story": "Not the best of time for Team Nigeria at the on-going Tokyo 2020 Olympic Games following the disqualification of 10 athletes by the Athletics Integrity Unit (AIU) of World Athletics as the track and field events of Tokyo 2020 kick off today.\nOLALEKAN OKUSAN and OLUWAMAYOMIKUN OREKOYA write on the development following the crisis that engulfed the Athletics Federation of Nigeria (AFN) ahead of the quadrennial games.\nThe AIU is an independent body created by World Athletics (WA) to manage both doping and non-doping issues for the sports of athletics.\n“What would have helped us is for the AFN to plead with the US athletics to assist in conducting doping tests for our athletes.\n“All our athletes resident in Nigeria and who qualified for the Olympic Games completed the three mandatory tests,” he said."
  },
  {
    "headline": "Super TV CEO, Usifo Ataga, buried in Lagos",
    "summarized_story": "The slain Super TV Chief Executive Officer, Usifo Ataga, was buried on Friday at the Ebony Vaults, Ikoyi, Lagos.\nHe was buried around 12.30pm in a low-key ceremony attended by his family members, including his wife, and friends.\nFollowing his death, Lagos Police Command arrested a 21-year-old undergraduate of the University of Lagos (UNILAG), Chidinma Ojukwu and others in connection with his death.\nDuring the funeral service, which held at Our Lady of Perpetual Help Catholic Church, Lagos, the officiating priest, Very Rev.\nHe noted Ataga was a man of many parts that meant many things to different people."
  },
  {
    "headline": "IPOB declares total lockdown in S/East for Kanu",
    "summarized_story": "• Wants schools, banks, airport others closedFrom Stanley Uzoaru,OwerriThe Indigenous People of Biafra IPOB (IPOB) has declared a complete shutdown in South East, directing all markets, banks, schools, airports and other public places to close down from August 9 till further notice until their leader,Nnamdi Kanu is unconditionally released from detention.\nHe explained that the lockdown will take effect every Monday of every week from 6 am to 6pm.\nFrom that day Biafra land will be on lockdown every Monday from 6:00am to 6:00pm until our leader, Mazi Nnamdi Kanu who was unlawfully abuducted in Kenya and illegally detained by the federal government of Nigeria is released.\nOur Leader Mazi Nnamdi Kanu is not a criminal and has the rights to be visited in their custody.” Powerful stated.\nOur intelligence reveals that Nnamdi Kanu is under serious torture and humiliation because he refused all offer given to him.” Powerful claimed."
  },
  {
    "headline": "2020 Olympics: Disqualified Team Nigeria’s athletes protest in Tokyo",
    "summarized_story": "By Bunmi OgunyaleTeam Nigeria camp at the ongoing Tokyo 2020 Olympics is in disarray as athletes are protesting over their disqualification from the Games.\nCompetent source in Tokyo hinted that the athletes, in a peace protest, were sighted in the Games Village with placards to express their grievances.\nThe placards on display have various inscriptions such as; ”All we want to do is to compete.\n“Why should we suffer because of somebody else’s negligence.”Recalled that 10 Nigerian athletes were disqualified from participating in Tokyo due to the Sports federations failure to adhere to the mandatory pre-Olympics conditions.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "JUST IN: New Defence spokesman, Gen Sawyer, assumes duty",
    "summarized_story": "Molly Kilete, AbujaThe newly appointed Director Defence Information(DDI), Major General Benjamin Sawyer has formally assumed office with an appeal to the media to support the military in tackling the security challenges bedeviling the nation.\nSawyer has also promised to run an open door policy to fast track information needed by journalists to carry out their reportage.\nSawyer was handed over the battle of leadership of the directorate by the acting director Air Commodore Maigida, who appealed to the media to support the new director.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Alleged $1.1m bribe: US court orders Abba Kyari’s arrest",
    "summarized_story": "The FBI said Hushpuppi and Kyari, both of whom it alleged had been friends, conspired to launder money.\nThe FBI also indicted Kyari for allegedly receiving bribes from Hushpuppi to arrest a member of the syndicate in Nigeria.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him.\nVincent is alive, he can be contacted.”•IGP orders his probeInspector General of Police(IGP), Usman Alkali Baba, has ordered an investigation into the alleged indictment by the Federal Bureau of Investigation (FBI), against Abba Kyari.\n“Moreover, if this Abba Kyari matter is not well handled, it will be a permanent stain on the reputation of our police, security system and our nation at large,” the PDP said."
  },
  {
    "headline": "Just In: APC Chieftain Asks Court to Halt Party’s Congress over Buni’s Leadership",
    "summarized_story": "Alex Enumah in AbujaA chieftain of the All Progressives Congress (APC), Mr Kalu Agu, on Friday asked a High Court of the Federal Capital Territory (FCT) for an order of perpetual injunction restraining the APC from going ahead with its planned Ward congress scheduled for Saturday July 31 as well as subsequent Local Government, State, Zonal Congresses as well as the party’s National Convention.\nThe suit filed by his lawyer, Ukpai Ukairo, has the APC and Mai Mala Buni as first and second defendants respectively.\nAmong the issues he wants the court to determine are; whether the APC can conduct a ward congress when there is no elected ward executive committee of the APC.\nDefendant at any level of the political structure in Nigeria created by the Constitution of the 1st Defendant.\nNo date however has been fixed for the hearing of the suit."
  },
  {
    "headline": "Appeal Court Sacks Odey, Declares Jarigbe Senator-elect for C’River North",
    "summarized_story": "By Bassey InyangThe Court of Appeal sitting in Calabar has declared the Member representing Obudu/Yala Federal Constituency Hon.\nIn a judgement delivered on Friday, the three man Appeal Tribunal headed by Hon.\n“It is our humble and firm view that the issue calls for consideration whether the tribunal was right to jettison the decision of the High Court, Appeal Court and Supreme Court and declare the 1st Respondent (Odey) as validly elected,” the Appeal Court said.\nStressing that the Appeal court is bound by decisions of courts superior to the trial courts, the Appeal court panel headed by Justice Nwosu declared Jarigbe as the Senator Elect for Cross River North Senatorial District.\nIn ordering INEC to issue a Certificate of Return to Jarigbe, the Appeal Court said: “Two certificates of return cannot exist in the eye of the law."
  },
  {
    "headline": "APC in Jeopardy Over Buni’s Continued Stay as National Chair",
    "summarized_story": "Even more, stakeholders are currently divided over the matter with the party congresses still going ahead as scheduled.\nExpectedly, this development had immediately divided the stakeholders in the APC over Buni’s continued stay, both as national chairman of the party and governor of Yobe State.\nSection 183 of the 1999 constitution unequivocally forbids a sitting governor from combining his office with any other job, both as executive positions, same as Article 17 (iv)of the APC constitution.\nThe competence of Governor Mai Mala Buni to organise the congresses has been called to question by the Supreme Court.\nBy implication, if the APC goes ahead and holds the congresses, it might turn out an effort in futility."
  },
  {
    "headline": "Hushpuppi: IG Orders Review of FBI’s Allegation Against Abba Kyari",
    "summarized_story": "Baba’s order followed a United States Court order of arrest of Kyari, issued by a District Court of California.\nSome US Court documents further showed that American prosecutors had first sought a court warrant to arrest Kyari on February 12, 2021, while another request was made on April 29, 2021.\nBut Judge Wright’s permission for the FBI to arrest Kyari and hold him in US custody, it was further gathered, was unsealed on July 26, 2021.\nAccording to the indictment, Abbas was assisted in laundering the proceeds of the fraud by Rukayat Motunraya Fashola, a.k.a.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by DCP Abba Kyari, 46, of Nigeria."
  },
  {
    "headline": "Naira Strengthens, as Bank CEOs Pledge Support for New CBN FX Policy",
    "summarized_story": "The apex bank insisted it would not rescind the ban on FX sale to BDCs.\nGwadabe said the association would engage with the banking sector regulator to address and resolve all the issues that led to the ban on FX sale to its members.\nThe CBN governor said the bank would now channel weekly FX allocations, hitherto meant for BDCs, to commercial banks.\nMahmud said unlike the temporary ban of FX sale to BDCs in 2016, the central bank was taking a tougher stand this time.\nMahmud explained, “One big area that was a major issue is the behaviour in the BDC market."
  },
  {
    "headline": "How Nigeria Police Consistently Ignored Criminal Petitions Against ‘Super Cop’ Kyari — Activist Reveals",
    "summarized_story": "A human rights activist has explained how several petitions were sent to the Nigeria Police Force over atrocities allegedly committed by embattled Deputy Commissioner of Police, Abba Kyari, but they were ignored for unknown reasons.\nThe source, who spoke to SaharaReporters, said the recent report by the Federal Bureau of Investigation did not come as a surprise to human rights groups, who pioneered the majority of the petitions.\nIt was alleged that Adiukwu was ‘killed’ in custody because he was in possession of the money robbed from the bank.\n“There is nothing new to us — Nigerian human rights groups — about the revelation by the US intelligence agency about Abba Kyari.\nHe was on his way to Owerri in his Sienna car when he was accosted and arrested by the IRT officers who operated in a Hummer Bus."
  },
  {
    "headline": "How Nigeria Police Consistently Ignored Criminal Petitions Against ‘Super Cop’ Kyari — Activist Reveals",
    "summarized_story": "A human rights activist has explained how several petitions were sent to the Nigeria Police Force over atrocities allegedly committed by embattled Deputy Commissioner of Police, Abba Kyari, but they were ignored for unknown reasons.\nThe source, who spoke to SaharaReporters, said the recent report by the Federal Bureau of Investigation did not come as a surprise to human rights groups, who pioneered the majority of the petitions.\nIt was alleged that Adiukwu was ‘killed’ in custody because he was in possession of the money robbed from the bank.\n“There is nothing new to us — Nigerian human rights groups — about the revelation by the US intelligence agency about Abba Kyari.\nHe was on his way to Owerri in his Sienna car when he was accosted and arrested by the IRT officers who operated in a Hummer Bus."
  },
  {
    "headline": "How Nigeria Police Consistently Ignored Criminal Petitions Against ‘Super Cop’ Kyari — Activist Reveals",
    "summarized_story": "A human rights activist has explained how several petitions were sent to the Nigeria Police Force over atrocities allegedly committed by embattled Deputy Commissioner of Police, Abba Kyari, but they were ignored for unknown reasons.\nThe source, who spoke to SaharaReporters, said the recent report by the Federal Bureau of Investigation did not come as a surprise to human rights groups, who pioneered the majority of the petitions.\nIt was alleged that Adiukwu was ‘killed’ in custody because he was in possession of the money robbed from the bank.\n“There is nothing new to us — Nigerian human rights groups — about the revelation by the US intelligence agency about Abba Kyari.\nHe was on his way to Owerri in his Sienna car when he was accosted and arrested by the IRT officers who operated in a Hummer Bus."
  },
  {
    "headline": "BREAKING: FBI Agents In Second Meeting This Week With Nigeria's Police IG To Demand Abba Kyari's Arrest, Extradition",
    "summarized_story": "He said, \"FBI agents met with the IGP yesterday (Thursday) to demand Abba Kyari's arrest and extradition to the United States citing the urgency of the case.\nFour FBI agents returned to the IG’s office this morning, they are there asking the IGP to release Kyari for interrogation.\"\nSaharaReporters earlier reported that the United States' Court had issued a warrant of arrest for Kyari, over his role in Hushpuppi’s multi-million naira fraud probe.\nAmerican prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "BREAKING: FBI Agents In Second Meeting This Week With Nigeria's Police IG To Demand Abba Kyari's Arrest, Extradition",
    "summarized_story": "He said, \"FBI agents met with the IGP yesterday (Thursday) to demand Abba Kyari's arrest and extradition to the United States citing the urgency of the case.\nFour FBI agents returned to the IG’s office this morning, they are there asking the IGP to release Kyari for interrogation.\"\nSaharaReporters earlier reported that the United States' Court had issued a warrant of arrest for Kyari, over his role in Hushpuppi’s multi-million naira fraud probe.\nAmerican prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "FG asks political parties to ensure compliance with COVID-19 protocol at events",
    "summarized_story": "The Presidential Steering Committee on COVID-19 (PSC) has asked political parties to ensure strict compliance with the COVID-19 protocol at all events in the country.\n“Political mass gatherings serve as super-spreader events for the propagation of COVID-19 infection in our communities.\nAdvertisement“The PSC wishes to reiterate the significance of the publicized INEC policy on the conduct of political events and the code of conduct for voters and political parties within the context of COVID-19.\n“The PSC therefore cautions all political parties to institute public health and social measures in all locations where political events will occur.\nThese measures include:“Mandatory use of face mask for everyone attending these political events."
  },
  {
    "headline": "FG asks political parties to ensure compliance with COVID-19 protocol at events",
    "summarized_story": "The Presidential Steering Committee on COVID-19 (PSC) has asked political parties to ensure strict compliance with the COVID-19 protocol at all events in the country.\n“Political mass gatherings serve as super-spreader events for the propagation of COVID-19 infection in our communities.\nAdvertisement“The PSC wishes to reiterate the significance of the publicized INEC policy on the conduct of political events and the code of conduct for voters and political parties within the context of COVID-19.\n“The PSC therefore cautions all political parties to institute public health and social measures in all locations where political events will occur.\nThese measures include:“Mandatory use of face mask for everyone attending these political events."
  },
  {
    "headline": "Appeal court nullifies judgement sacking Anambra PDP executives",
    "summarized_story": "The court of appeal in Abuja has nullified the judgment of the federal capital territory (FCT) high court which ordered the sack of the Anambra state Peoples Democratic Party (PDP) executive committee.\nDiscontented with the decision of the FCT high court, the PDP and Uchenna Obiorah in their separate appeals marked CA/A/359/2021 and CA/A/CV/368/2021 approached the appeal court to set aside the judgement of the trial court.\nAdvertisementDelivering Judgement on the two suits brought before the court on Friday, the three-member panel led by Stephen Adah, upheld the appeals filed against the judgement of the lower court.\nAdah held that the lower court lacked the territorial jurisdiction to have heard the suit brought before it on the dispute over the leadership of the PDP in Anambra state.\nThe appeal court therefore, dismissed the judgement ordering the sack of the Anambra PDP executives."
  },
  {
    "headline": "Appeal court nullifies judgement sacking Anambra PDP executives",
    "summarized_story": "The court of appeal in Abuja has nullified the judgment of the federal capital territory (FCT) high court which ordered the sack of the Anambra state Peoples Democratic Party (PDP) executive committee.\nDiscontented with the decision of the FCT high court, the PDP and Uchenna Obiorah in their separate appeals marked CA/A/359/2021 and CA/A/CV/368/2021 approached the appeal court to set aside the judgement of the trial court.\nAdvertisementDelivering Judgement on the two suits brought before the court on Friday, the three-member panel led by Stephen Adah, upheld the appeals filed against the judgement of the lower court.\nAdah held that the lower court lacked the territorial jurisdiction to have heard the suit brought before it on the dispute over the leadership of the PDP in Anambra state.\nThe appeal court therefore, dismissed the judgement ordering the sack of the Anambra PDP executives."
  },
  {
    "headline": "Court orders APC to halt congress in Imo",
    "summarized_story": "A federal capital territory (FCT) high court has ordered the All Progressive Congress (APC) not to go ahead with its planned congress in Imo state.\nAfter the proceedings, the judge ordered that all actions regarding the APC congresses in the state should be stayed, pending the hearing of the application slated for August 10.\nAdvertisementThe judge also threatened to invalidate the outcome of the congresses if the party disregards the position of the court.\nKeyamo had asked the party to sack Buni and anyone holding any executive position on the committee and immediately suspend the planned congresses.\nAdvertisementHe said this is to avoid legal battles since the competence of Buni to hold the position of chairman has been questioned by the supreme court."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Airtel Africa receives $200 million to invest in network and sales infrastructure",
    "summarized_story": "It had also gotten a $100m investment from Mastercard in Airtel Mobile Commerce BV (AMC BV) in April.\nAirtel Africa says that QIA will hold a minority stake in the company while it retains the majority.\nComparing revenue from Q1 2020 with Q1 2021, Airtel saw a significant increase in revenue at $1.03b, dwarfing Q1 2020’s revenue of $899m by 21.7%.\nIts mobile money customer base went from 18.3 million in Q1 2020 to 21.7 million in Q1 2021, an 18.5% increase.\nHe also believes that the Sovereign Wealth Fund’s investment in Airtel Africa will contribute to sub-Saharan Africa’s financial inclusion."
  },
  {
    "headline": "Who puts out your IT fires when you’ve deleted an entire file from the company’s servers?",
    "summarized_story": "Share this article:Recently, the job of a system administrator — sometimes called a sysadmin or system admin — had begun to fascinate me.\nMy first experience with system administrators was with the technical support staff in the ICTU/CRPU unit of the University of Benin.\nAdvertisementWho are System Administrators?\nSystem Administrators troubleshoot all day, every day.\nHowever, according to Olusegun Balogun, an IT Support Specialist, you don’t necessarily have to have those degrees to become a system administrator."
  },
  {
    "headline": "How LoftyInc Capital invests, Dyslexia and assistive technology, Google’s app update",
    "summarized_story": "How LoftyInc Capital Management invests in Capital investsLoftyInc Capital Management Management Partners.\nThey are all LoftyInc Capital Management (LCM) portfolio companies, one of the oldest venture capital firms in Nigeria.\nThis is an excellent time to revisit it: The unique case of Africans with learning disabilities and assistive technology.\nGoogle has announced a new policy update on the Android Play Store to support user control, privacy, and security, beginning September 1, 2021.\nGoogle claims that with its User Data Policy update, it will be illegal to link persistent device identifiers to personal and sensitive user data or resettable device identifiers unless for pre-approved use cases."
  },
  {
    "headline": "Naira strengthens further to N517 as dollar demand slows",
    "summarized_story": "Naira strengthens further to N517 as dollar demand slowsNigeria’s currency on Friday strengthened further by 0.57 percent to N517 per dollar compared with N520/$ it closed Thursday, at the parallel market.\nNaira firmed to N520 on Thursday after the Nigerian banks’ chief executives agreed to provide dollars for Personal Travel Allowance (PTA), Business Travel Allowance (BTA), school fees, and other legitimate needs to…"
  },
  {
    "headline": "Nigeria’s economic growth still far from reducing poverty",
    "summarized_story": "Nigeria’s economic growth still far from reducing povertyNigeria’s GDP per capita income or what economists interpret as economic growth per head is projected to rise in 2022, after seven years of decline following a growth forecast of three percent by the Economic Intelligence Unit (EIU), the world leader in global business intelligence.\nBut the rise in Africa’s biggest economy’s per capita income…"
  },
  {
    "headline": "How to make money with your smartphone",
    "summarized_story": "How to make money with your smartphoneSmartphones are getting more sophisticated with in-built cameras that could rival most traditional cameras.\nStorage has also been getting a lot of attention.\nIn the 2019-2020 period, nearly half of Huawei’s and Apple’s smartphone shipments came from their 128GB and 64GB variants, respectively.\nIn the same period, Huawei’s and Apple’s 128GB variants experienced a yearly…"
  },
  {
    "headline": "Edo govt begins awareness campaign on inactivated polio vaccine …inspects Benin Airport, insists on strict adherence to COVID-19 protocols – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Friday, kicked off a fresh campaign to enlighten residents on the need to immunize their children with the Inactivated Polio Vaccine (IPV) to guarantee full protection against Polio Mellitus.\nThe Edo State Deputy Governor, Rt.\nShaibu, while speaking with the Edo women on the need to vaccinate their children, noted that the inactivated polio vaccine provides additional and rapid immunity that covers all three types of polioviruses.\nHe however urged them not to neglect the Oral Polio Vaccine (OPV), adding that a combination of both the OPV and IPV provide stronger protection for the children.\nThe deputy governor was also at the Benin Airport to check protocols put in place by the airport management to prevent the importation of the Delta variant of coronavirus (COVID-19) into the state."
  },
  {
    "headline": "Obaseki vows to recover Edo taxpayers’ money looted through Benin Stormwater Project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…expresses satisfaction with progress of work on ongoing dualization of Ekehuan RoadBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has vowed that his administration will recover taxpayers money wrongfully spent on the Benin Stormwater Project.\nObaseki gave the assurance while on an inspection tour of ongoing construction of New Lagos Road, Textile Mill Road, 2nd West Circular Road and Ekehuan Road, all in Benin City, the Edo State capital.\nYou recall that I said I am going to probe that contract, but wanted to convince myself that it was not a case of witch-hunt.\nThe governor continued: “At Evbareke Market, there is supposed to be a road and drainage.\nYou are standing on very huge underground drainage and it has been covered, as you will not know that there is an extensive drainage under it."
  },
  {
    "headline": "Obaseki, UK High Commission brainstorm on strategies to sustain anti-human trafficking campaign gains – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Governor, Mr. Godwin Obaseki, has reiterated the commitment of his administration to sustain the gains made in the fight against human trafficking and irregular migration.\nThe governor made the submission during an event to mark the World Day Against Trafficking in Persons 2021, organized by the United Kingdom AID (UKAID) and the International Organisation for Migration (IOM).\nGovernor Obaseki said the state government has recorded tremendous progress in the fight against human trafficking, especially in the rehabilitation and resettlement of returning illegal migrants.\nAccording to him, “Our intervention to address the issue of human trafficking has been pragmatic and far-reaching.\nThe Edo State Government, in 2018, enacted the Edo State Trafficking in Persons Prohibition Law, as part of its over-arching strategy to combat the menace of human trafficking, after securing the support of traditional institutions in an aggressive campaign to drastically reduce the incidence of human trafficking in the state."
  },
  {
    "headline": "Obaseki unveils plan to make Edo one of Africa’s top 20 economies, rallies United Nations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has unveiled the Making Edo Great Again (MEGA) vision to the United Nations Country Team (UNCT) in Nigeria, outlining the government’s audacious plan to make Edo State one of the 20 top economies in terms of Gross Domestic Product (GDP) in Africa by 2050.\nThe governor, in a presentation titled, ‘The Edo Vision: From Who We Are To Where We Want To Be by 2050’, at the United Nations House, Abuja, noted that the state is harnessing its human and natural resources to place it as a leading destination for investment in Nigeria.\nHe added: “With an estimated population of 10 million residents by 2050, our educational system must be the best in Nigeria and we should boast of one of the best workforce on the continent.\n“This will be achieved through rigorous planning in regional and urban planning, which will point to and emphasize what we must do to attain double-digit growth over the next three decades, and socio-economic master plans to complement the physical master plans.\n“The government will ensure the sustenance of its massive investment in infrastructure to take advantage of the location of Edo."
  },
  {
    "headline": "ASR Africa adopts Gwarimpa General Hospital’s neonatal unit under initiative",
    "summarized_story": "ADVERTISEMENTThe Abdul Samad Rabiu Africa Initiative (ASR Africa) on Friday, donated multimillion Naira state-of-art equipment and a fully equipped emergency ambulance to the Paediatric Unit of the Gwarimpa General Hospital, Abuja as part of its Health Systems Support Initiative.\nASR Africa also announced that it was adopting the Neonatal Unit of the hospital under this initiative as well as providing N500,000 towards a fund being setup to assist indigent patients in accessing quality healthcare at the hospital.\nWhile presenting the ambulance and Health Systems Support Grant to the management of the hospital in Abuja, the Managing Director of ASR Africa, Ubon Udoh, stated that this project was very dear to the founder of ASR Africa, Abdul Samad Rabiu who is also Chairman of BUA Group.\nWe have taken a tour of the facilities and we are replacing all the equipment in the neonatal unit.\nABOUT ASR AFRICAThe brainchild of African Industrialist, Philanthropist and Chairman of BUA Group, Abdul Samad Rabiu, the Abdul Samad Rabiu Africa Initiative (ASR Africa) was established in 2021 to provide sustainable, impact-based homegrown solutions to developmental issues affecting health, Education and Social Development within Africa."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anambra 2021: Ozigbo campaign org. hails Appeal Court ruling overturning sack State PDP executives",
    "summarized_story": "The Valentine Ozigbo Campaign Organisation has hailed the ruling of the Court of Appeal Abuja Division delivered a few minutes ago in the case of PDP vs Samuel Anyakorah & ORS.\nThe appeal was against the judgment of Justice Adeniyi of FCT High Court delivered on the June 9, 2021 wherein the court, against the earlier and subsisting judgment of Honourable Justice Musa of the same FCT High Court, recognised Samuel Anyakorah and his group as the valid executive committee of the party in Anambra state.\n“Valentine Ozigbo is grateful for all the support and encouragement, and goodwill he has received since he won the primary, especially from people of Anambra State, PDP Governors, and the leadership of the party at ward, local government, state and national levels.\n“We are resolute in our resolve to actualise our grand vision to rescue Ndi Anambra from the abysmal All Grand Progressives Alliance (APGA) government come November.\nA. Nwabunike judgement pending before the Court of Appeal in Awka Division is based on."
  },
  {
    "headline": "BEDC decries vandalism in franchise areas",
    "summarized_story": "BEDC Electricity Plc (BEDC), has decried the rising cases of vandalism across its franchise zone which it says aside being an economic crime is an act of sabotage against the good purpose and intents of the company, canvassing that the effects of vandalism should stimulate tougher laws to be enforced to protect public property, especially electricity infrastructure.\n‘’The recent surge in cases of vandalism within our franchise area calls for greater attention.\nAs a company, we see these as acts of economic sabotage against the good intents of BEDC,” he remarked.\nOn 3rd July 2021, a 2.5MVA, 33/11KV Injection Substation at Igarra near Auchi, in Edo state was vandalized while RUM, upriser cables, incomer cables etc.\nThey were reportedly charged to Ogwuashi-Uku Magistrate Court on early this month and remanded at Ogwuashi-Uku Correctional Center Ogwuashi-Uku."
  },
  {
    "headline": "Osun PDP: The Long Walk to Justice, By Dr. Longe Oyeleye",
    "summarized_story": "The Adeleke Group in their sheer ignorance went into wreck jubilation, without realizing that what they got was a judicial mirage that would soon evaporate.\nIt is very clear that it is the Adeleke Group that is trying to subvert the PDP and waste her chances at the polls.\nIt was the Adeleke Group, who forged signatures of SWC members to pass a vote of no confidence on Hon.\nIt was the Adeleke Group who made a spirited attempt to steal the case file from High Court 4, Osogbo.\nHead or tail, the Osun PDP is in deep shit!"
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Ward Congress: Kwara APC Stakeholders Opt For Consensus",
    "summarized_story": "Ahead of Saturday’s ward congresses nationwide, members of the All Progressives Congress (APC) in Kwara State have agreed to adopt consensus candidates for ward congresses across the 16 local government areas of the state.\nThis is just as the chairman of the Kwara APC ward congress committee, Prof Jonathan Ayuba, urged all the stakeholders to ensure that the process is peaceful and orderly.\nAt the end of the stakeholders’ meeting called by the congress planning committee in Ilorin, members of the party unanimously settled for consensus candidates across the 193 wards.\nGovernor AbdulRazaq said the party congress is a democratic process designed to ensure smooth running of the party.\nMay we have a successful outing tomorrow,” said the governor, who was represented by deputy governor Kayode Alabi."
  },
  {
    "headline": "Ward Congress: Kwara APC Stakeholders Opt For Consensus",
    "summarized_story": "Ahead of Saturday’s ward congresses nationwide, members of the All Progressives Congress (APC) in Kwara State have agreed to adopt consensus candidates for ward congresses across the 16 local government areas of the state.\nThis is just as the chairman of the Kwara APC ward congress committee, Prof Jonathan Ayuba, urged all the stakeholders to ensure that the process is peaceful and orderly.\nAt the end of the stakeholders’ meeting called by the congress planning committee in Ilorin, members of the party unanimously settled for consensus candidates across the 193 wards.\nGovernor AbdulRazaq said the party congress is a democratic process designed to ensure smooth running of the party.\nMay we have a successful outing tomorrow,” said the governor, who was represented by deputy governor Kayode Alabi."
  },
  {
    "headline": "Oyo Gov Donates Buses To Islamic Group, Broadcasters",
    "summarized_story": "Governor ‘Seyi Makinde of Oyo State declared on Friday that some persons who are fond of accusing him of hating Islam or religious favoritism are individuals with skeletons in their cupboards.\n“So, today, I want to fulfill part of the promises I made before I got elected as the governor of Oyo State.\nShe said: “You all know that I was once a Speaker in this state and Senator that represented Oyo Central Senatorial District.\nWe are looking round to gather people within Oyo State for us to be able to support the Governor Makinde-led administration to succeed.\nSo, we thank him and all the good people of Oyo State."
  },
  {
    "headline": "Oyo Gov Donates Buses To Islamic Group, Broadcasters",
    "summarized_story": "Governor ‘Seyi Makinde of Oyo State declared on Friday that some persons who are fond of accusing him of hating Islam or religious favoritism are individuals with skeletons in their cupboards.\n“So, today, I want to fulfill part of the promises I made before I got elected as the governor of Oyo State.\nShe said: “You all know that I was once a Speaker in this state and Senator that represented Oyo Central Senatorial District.\nWe are looking round to gather people within Oyo State for us to be able to support the Governor Makinde-led administration to succeed.\nSo, we thank him and all the good people of Oyo State."
  },
  {
    "headline": "APC Congress: Buni Sues For Peaceful Exercise, Warns Against Sabotage",
    "summarized_story": "Mai Mala Buni, has enjoined party stakeholders and members to conduct the exercise peacefully.\n“As stakeholders of the party, we have great responsibility to make the ward Congress in all the participating states successfull.\nADVERTISEMENT“We should endeavour to place the party and members interest above personal interests,” Buni charged.\nThe party national caretaker chairman warned that the party would not hesitate to take decisive measures against anyone who deliberately sabotage the congress.\nHe solicited for support and cooperation of members to the officials “for APC to be a role model for other parties”."
  },
  {
    "headline": "Two missing, travellers stranded as bridge collapses in Bauchi",
    "summarized_story": "The bridge links Bauchi metropolis to Ningi Local Government Area of the state, as well as Jigawa and Kano states.\nAs a result, many vehicles and hundreds of passengers are stranded, as there is no entry into Ningi LGA to Jigawa or Kano state from Bauchi and vice versa.\nThe Danburam of Ningi Emirate in Ningi LGA of Bauchi state, Yusuf Danyaya, confirmed the incident to The PUNCH in a telephone interview.\n“Yes, the incident is true and as I speak to you, people cannot travel to Bauchi from Ningi; likewise people from Bauchi cannot travel to Ningi up to Kano State from here.\nOne of them had been on top of a tree and it wasn’t long that he was rescued."
  },
  {
    "headline": "Two missing, travellers stranded as bridge collapses in Bauchi",
    "summarized_story": "The bridge links Bauchi metropolis to Ningi Local Government Area of the state, as well as Jigawa and Kano states.\nAs a result, many vehicles and hundreds of passengers are stranded, as there is no entry into Ningi LGA to Jigawa or Kano state from Bauchi and vice versa.\nThe Danburam of Ningi Emirate in Ningi LGA of Bauchi state, Yusuf Danyaya, confirmed the incident to The PUNCH in a telephone interview.\n“Yes, the incident is true and as I speak to you, people cannot travel to Bauchi from Ningi; likewise people from Bauchi cannot travel to Ningi up to Kano State from here.\nOne of them had been on top of a tree and it wasn’t long that he was rescued."
  },
  {
    "headline": "Unity Bank Grows 34% Pre-tax Profit, Records N23B Gross Earnings in H1 2021",
    "summarized_story": "By KEN EMORDINigeria’s retail lender, Unity Bank Plc has declared half-year result posting gross earnings of 23.6 billion Naira, which is a 3% increase compared with the corresponding period of 2020.\nThe Bank grew bottom-line by 34% as Profit before Tax (PBT) moved up significantly in positive territory to close at N1.50 billion from N1.12 billion recorded in H2 2020.\nInterest and similar income also rose though recording a marginal 2% growth to close at N20.27 billion compared to the N19.79 billion recorded in half-year 2020.\nEarnings per share rose by 3 kobo to close at 11.82 Kobo within the period compared to 8.82 Kobo recorded in the corresponding period of 2020.\nPre-tax profit for the period closed at N718.0 million, a 31% increased from N546.35 million recorded in Q2 2020, while Profit After Tax equally closed at N660.57 million from N502.65 million recorded in the corresponding review period."
  },
  {
    "headline": "Assault on AIT reporter: NUJ orders boycott of Police coverage",
    "summarized_story": "The Nigeria Union of Journalists, Bauchi State Council, has directed all its members to boycott all activities of the Nigeria Police Force in the state.\nHe was assaulted while covering a protest by students of the College of Agriculture, Yelwa, a suburb of Bauchi metropolis.\nHis phones, camera and microphone bearing the AIT logo on them were all confiscated by the security operatives.\n“The union commended the management of the College of Agriculture Bauchi for it’s humanitarian gesture by taking the AIT reporter to hospital for medical attention.\n“The NUJ called on the Bauchi state government to consider the establishment of a standing panel of inquiry to hear cases of security brutality against citizens in the state,” the Union said."
  },
  {
    "headline": "91 Boko Haram/ISWAP fighters, families surrender",
    "summarized_story": "By Sumaila OgbajeNinety-one Boko Haram/Islamic States West Africa Province (ISWAP) terrorists and their families have surrendered to the Nigerian Army in the North East.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu disclosed this in a statement on Friday in Abuja.\nHe said the troops of Forward Operational Base (FOB) operating along BoCobs-Bama road also arrested 20 terrorists and their families, who surrendered to troops at Nbewa village also in Bama Local Government Area.\nAccording to him, the surrendered families of the insurgents comprised 15 adult females and 26 children.\n“Others are five packets of candies, five packets of seasoning and measures of other foodstuffs,” he said."
  },
  {
    "headline": "Northern Nigeria, 22 others world’s hunger hotspots",
    "summarized_story": "By Cecilia OlogunagbaThe World Food Programme (WFP) and the Food and Agriculture Organisation (FAO) have classified northern Nigeria and 22 other countries as ‘hunger hotspots’.\nIn the next four months, conflict, COVID-19 and the climate crisis are likely to increase hunger in those countries, according to WFP/FAO.\nKaneko said Ethiopia and Madagascar were the world’s newest “highest alert” hunger hotspots, according to the report.\nAccording to her, WFP and FAO have said humanitarian action is urgently needed to prevent hunger, famine and death in all 23 hotspots.\n“It means checkpoints allow trucks to pass and reach their destination, it means humanitarian responders are not targeted, so they are able to carry out their life- and livelihood-saving work,” Beasley said."
  },
  {
    "headline": "Nigerian govt breaks silence on $875m ammunition deal blocked by US lawmakers",
    "summarized_story": "By Rotimi IjikanmiThe Nigerian Government on Friday said it is not aware of any $875 million ammunition deal with the US which is being purportedly blocked by some lawmakers in that country.\n“We are quite satisfied with the progress and cooperation that we received from the government of the US on this issue.\n“As a matter of fact, six of the Tucano helicopter will be launched on Aug. 3, this year.\nThe reports in some sections of the media had claimed that influential U.S. lawmakers were masterminding a hold on a proposed sale of ammunition and attack helicopters to Nigeria over allegations of human rights abuses and anti-democratic actions of the present administration.\nThe report listed the blocked proposed sale to include 12 AH-1 Cobra attack helicopters accompanied by defence systems, 28 helicopter engines produced by GE Aviation and 14 military-grade aircraft navigation systems made by Honeywell."
  },
  {
    "headline": "Zimbabwe’s Former First Lady dies aged 83",
    "summarized_story": "Janet Banana, the widow of Zimbabwe’s first president Canaan Banana has died at the aged of 83, her family announced.\nShe died at Bulawayo’s Mater Dei Hospital from a kidney ailment, according to her niece Priscilla Misihairabwi-Mushonga.\nBut the wind of change was already blowing through Africa as the continent sought to shake off European colonial rule.\nAt Zimbabwe’s independence in 1980, Canaan became the country’s president, a largely ceremonial position until a constitutional amendment abolished the post in 1987.\nShe was in and out of the hospital in South Africa and Zimbabwe, battling a kidney ailment."
  },
  {
    "headline": "Internet Fraud: Abba Kyari Deletes Facebook Post Mocking Police Probe of FBI Charges",
    "summarized_story": "“Hahahahaha This is the funniest One so far, we are enjoying the Show,” Mr Kyari said on his Facebook page Friday night.\nThe Acting Inspector General of Police, Usman Baba Ahmed on Thursday ordered a probe into Mr Kyari’s indictment by the FBI.\nBefore now, Mr Kyari has been accused of corruption.\nIn 2018, rights group Amnesty International accused Mr Kyari of illegally depleting assets of a suspected criminal after his team shot the man dead on the highway.\nCollins Ezenwa’s wife at the time said Mr Kyari and his team withdrew money from her late husband’s bank account and pocketed millions in accommodation proceeds from his hotels."
  },
  {
    "headline": "Sunday Igboho Can Be Killed If Beninese Court Frees Him At This Time – Lawyer",
    "summarized_story": "One of the nine lawyers for Yoruba Nation agitator Sunday Adeyemo (Igboho), Olusegun Falola, has said that the activist may be killed if a Beninese court decides to release him at this time while tensions between the Nigerian and Benin Republic governments remain high.\n“His continued incarceration here is to allow things to calm down and for peace to reign between Nigeria and Benin Republic.\nWe have no criminal allegation against him in the Benin Republic.\n“About the next court appearance, we have not gone back to the court because that is not how we do it here.\nIgboho had planned a ”Yoruba Nation Rally” in Lagos two days before the raid."
  },
  {
    "headline": "JUST IN: Hushpuppi Ally Abba Kyari Says Police Probe Of His FBI Indictment Is A Joke",
    "summarized_story": "Mr Kyari’s unremorseful remark came after a social media user accused him of rapping a suspect in police custody.\nMr Kyari claimed the rape allegation was the funniest aspect of everything that has happened since his indictment was made public by prosecutors at the US Department of Justice on Wednesday night.\n“Hahahahaha This is the funniest One so far, we are enjoying the Show,” Mr Kyari said on his Facebook page Friday night.\nBut Mr Kyari now described everything as a joke, giving credence to public cynicism that nothing concrete would come out of the investigation.\nMr Kyari has been dogged by multiple allegations of brutality and corruption, but his controversial side was long overlooked for his adorned image as a crime-busting police officer."
  },
  {
    "headline": "Breaking: Again, Nigeria’s D’Tigresses lose Olympics basketball game in Tokyo",
    "summarized_story": "Nigeria’s women basketball team D’Tigresses on Friday lost their second game 87-62 versus France in the ongoing Olympic games in Tokyo Japan.\nThe Nigerian team had lost to USA during their first encounter at the gamesDetails loading…"
  },
  {
    "headline": "Hushpuppi: IGP orders review of Kyari’s indictment, PDP urges probe",
    "summarized_story": "The DCP also allegedly sent a bank account to Hushpuppi reportedly for the payment for Vincent’s arrest and imprisonment.\nAccording to the indictment, “Abbas was assisted in laundering the proceeds of the fraud by Rukayat Motunraya Fashola, a.k.a.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\n“Nobody demanded for a kobo from Abbas Hushpuppi.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "Breaking: History as Nigeria’s Blessing Okagbare, Grace Nwokocha storm 100m semi-final at Tokyo Olympics",
    "summarized_story": "For the first time since 2012, two Nigerian athletes will be running in the semifinals of the women’s 100m after Blessing Okagbare and Nzubechi Grace Nwokocha qualified from their respective heats Friday in Tokyo, Japan.\nNwokocha had to run a new personal best of 11.00 seconds to secure her qualification to the semifinals in her debut at the Games.\nWhile Nwokocha qualified for her first semifinal, Okagbare will be running in her third since she made her debut in the event at the 2012 Olympics in London.\nThe 32-year-old ran 11.05 seconds to win her first round heat.\nThe 2008 Beijing Olympics Long Jump silver medallist will be in action at exactly 11.15 am Nigerian time on Saturday."
  },
  {
    "headline": "SON proffers ways Nigerian goods can compete in continental trade -NigPilot",
    "summarized_story": "THE Standards Organisation of Nigeria (SON), has said Nigerian manufacturers must improve on their products to maximise opportunities in the African Continental Free Trade Agreement (AfCFTA).\n“This is very important, because we have the new African free trade, where goods will be crossing borders without too much hindrance.\n“So it is our responsibility as the SON to make sure our goods in this country are up to standard.\nWe must make sure that substandard goods in the markets decrease.\n“Governments should make sure that there are consequences and sanctions against any products or persons producing substandard products."
  },
  {
    "headline": "SON proffers ways Nigerian goods can compete in continental trade -NigPilot",
    "summarized_story": "THE Standards Organisation of Nigeria (SON), has said Nigerian manufacturers must improve on their products to maximise opportunities in the African Continental Free Trade Agreement (AfCFTA).\n“This is very important, because we have the new African free trade, where goods will be crossing borders without too much hindrance.\n“So it is our responsibility as the SON to make sure our goods in this country are up to standard.\nWe must make sure that substandard goods in the markets decrease.\n“Governments should make sure that there are consequences and sanctions against any products or persons producing substandard products."
  },
  {
    "headline": "We are empowered to source forex from other sources, say BDCs -NigPilot",
    "summarized_story": "THE Association of Bureaux De Change Operators of Nigeria has assured members of the public that Bureaux De Change operators are still providing foreign exchange services.\nABCON said while the dollar sale from the Central Bank of Nigeria had helped in enhancing supply, the fact remained that BDCs were empowered to source forex from other sources and also to provide various services to members of the public.\nThe President, ABCON, Aminu Gwadabe, said this in a statement on Thursday, adding that the recent pronouncement of the CBN did not stop BDCs from providing forex services as allowed by their operating licences.\n“BDCs are licensed to provide retail FX services, including buying from the public and also selling to end-users for allowable transactions, namely personal travel allowance, business travel allowance, payment of medical and school fees,” Gwadabe said.\nThe ABCON president said, “While the CBN has stopped dollar sale to BDCs, it has not cancelled their operating licences or banned them from providing FX services to members of the public."
  },
  {
    "headline": "We are empowered to source forex from other sources, say BDCs -NigPilot",
    "summarized_story": "THE Association of Bureaux De Change Operators of Nigeria has assured members of the public that Bureaux De Change operators are still providing foreign exchange services.\nABCON said while the dollar sale from the Central Bank of Nigeria had helped in enhancing supply, the fact remained that BDCs were empowered to source forex from other sources and also to provide various services to members of the public.\nThe President, ABCON, Aminu Gwadabe, said this in a statement on Thursday, adding that the recent pronouncement of the CBN did not stop BDCs from providing forex services as allowed by their operating licences.\n“BDCs are licensed to provide retail FX services, including buying from the public and also selling to end-users for allowable transactions, namely personal travel allowance, business travel allowance, payment of medical and school fees,” Gwadabe said.\nThe ABCON president said, “While the CBN has stopped dollar sale to BDCs, it has not cancelled their operating licences or banned them from providing FX services to members of the public."
  },
  {
    "headline": "Qatar 2022 World Cup qualifier: Taribo warns Rohr against Liberia, Cape Verde",
    "summarized_story": "WITH less than two months to the qualification matches of the Qatar 2022 World Cup, former Super Eagles defender, Taribo West has warned national team gaffer, Gernot Rohr to ensure that only his best players make the team.\nThe Super Eagles will in September kick-start their qualification games against fellow West Africans, Liberia, and Cape Verde and the former Inter Milian man believes only the best players in Eagles camp can give the country something to cheer for.\n“I want to believe that the Franco ~German tactician of the Super Eagles understands that most African countries have come of age in football.\n“You know that Rohr since he started handling the national team more tham five years ago has been experimenting with players, inviting new set of players for any match in the name of building a solid national team.\nWhile this is good but I believe this is not the time to continue with that policy beause world cup qualifier is a serious business and loosing or drawing a game could be dangerous’, he concluded."
  },
  {
    "headline": "We Are Not Aware Of $875m Ammunition Deal With US – Lai Mohammed",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed says the Federal Government is not aware of any $875 million ammunition deal with the US which is being purportedly obstructed by some lawmakers in the States.\nMr. Mohammed stated this while speaking with newsmen on Friday in Abuja.\nAccording to him, there is no contract of such nature and sum between Nigeria and the US.\nReports suggesting that influential U.S. lawmakers were obstructing a proposed sale of ammunition and attack helicopters to Nigeria over allegations of human rights abuses and anti-democratic actions of the present administration have been making the rounds.\nLai Mohammed however stated that the reports are false, emphasizing that “the relationship between Nigeria and the US is smooth and waxing stronger”."
  },
  {
    "headline": "Abba Kyari And The Hushpuppi Scandal: Follow Due Process, Moghalu Tells Buhari",
    "summarized_story": "Former presidential candidate of the Young Progressive Party (YPP), Professor Kingsley Moghalu, has urged President Muhammadu Buhari to respect international law on the issue involving Deputy Commissioner of Police, Abba Kyari regarding his link to the international fraudster, Ramon Abbas, also known as Hushpuppi.\nThe FBI had stated that Hushpuppi and Kyari have been friends and were both involved in a conspiracy to launder money.\nMr. Kyari had also arrested and jailed one Chibuzo Vincent, at the behest of Hushpuppi.\nHe also allegedly sent Hushpuppi bank account details into which Hushpuppi could deposit payment for Vincent’s arrest and imprisonment.\nAccording to him, “What leadership calls for is obvious, President Buhari should respect laws and follow due process”."
  },
  {
    "headline": "Nigeria To Roll Out 5G Technology Soon – NCC",
    "summarized_story": "The Federal Government is set to begin the roll-out of fifth-generation (5G) services across the country.\nExecutive Vice Chairman of the Nigerian Communications Commission (NCC), Prof. Umar Danbatta, made the announcement on Friday at a public inquiry on the instruments necessary for the deployment of the technology.\nThe NCC and the Nigerian Communications Satellite (NIGCOMSAT) had signed a Memorandum of Understanding in May to facilitate the deployment of 5G technology.\nBoth agencies signed the agreement on the use of C-Band Spectrum for 5G services in Nigeria at an event in Abuja.\nHe stated that 5G services have already been deployed in the United States and South Korea among many more countries in the world."
  },
  {
    "headline": "UK ‘Committed’ To Help Nigeria Curb Human Trafficking – Envoy",
    "summarized_story": "The British High Commissioner to Nigeria, Catriona Laing, has restated the UK’s commitment to helping Nigeria curb human trafficking and other forms of irregular migration.\nAttendees included the International Organisation for Migration Chiefs of Mission from Niger and Nigeria, the French Ambassador to Nigeria, Jerome Pasquier and Governor of Edo State, Godwin Obaseki.\nIn 2013 the United Nations General Assembly had declared July 30 as the World Day Against Trafficking in Persons.\n“We will remain committed to building on our partnerships in Nigeria and Niger tackle their shared challenges on trafficking.”One key component of the UK’s efforts against human trafficking in Nigeria is The Collaboration Against Trafficking and Smuggling between Nigeria and Niger programme, also known as CATS.\n“As IOM, we welcome the UK Home Office’s Collaboration Against Trafficking and Smuggling Programme between Nigeria and Niger to enhance migration governance and an effective counter-trafficking response between the two countries.”"
  },
  {
    "headline": "Bandits Attack General Hospital In Zamfara, Kidnap Health Worker",
    "summarized_story": "Armed bandits have attacked a General Hospital within the Dansadau community in the Maru local government area of Zamfara State.\nThe attack which took place in the early hours of Friday led to the abduction of a health worker and one other individual.\nWorried about the unfortunate incident, Dr. Bature noted that the NMA Zamfara branch will hold an emergency state officers council meeting on Saturday 31st July 2021 at NMA Secretariat to deliberate on the issue.\nDansadau community has been in the news recently for several attacks by bandits, leading to the kidnapping of residents.\nThe community has been reaching out to the Federal and State Governments, pleading that more security personnel be deployed to the troubled area."
  },
  {
    "headline": "Bandits Invade General Hospital Dansadau, Abduct Ward Attendant",
    "summarized_story": "Armed Bandits have attacked General Hospital Dansadau in maru local government area of Zamfara StateThe gunmen attacked the General Hospital early hours of Friday with the intent to abduct Medical Doctors and Nurses, but ended up abducting a ward attendant and a patient relationTwo other female staff of the hospital sustained Injuries in the processThe Chairman of the Nigerian Medical Association Zamfara state branch Mannir Bature confirmed this in a press statement made available to newsmen in GusauHe says, the association is saddened by the unfortunate incident and describe it as inhumanAdvertisementDr. Bature adds that the association has called for an emergency meeting to discuss on issues of security in all Hospitals across the stateDansadau area has been experiencing bandits attack in the last one week, forcing residents including the paramount ruler of the area to flee their homes."
  },
  {
    "headline": "Police deploy personnel to vulnerable communities in Kaduna",
    "summarized_story": "The Kaduna state Police command says it has deployed security personnel to areas identified as vulnerable Communities in the state to ensure that citizens are better protected.\nThe move is to also ensure that farmers go to their farms without being attacked to prevent looming food scarcity.\nDivisional Police Officers in the state have also been directed to deploy personnel to schools located within their areas.\nUmar Muri said the Kaduna Police Command under his leadership as Commissioner had arrested four hundred and ninety-two suspects and recovered six hundred and seventy six rustled cattle.\nAdvertisementHe has charged traditional leaders and other opinion leaders in the state to work in synergy with the Police and other security agencies to tackle insecurity."
  },
  {
    "headline": "2 missing, Others stranded as Flood cuts Bauchi-Ningi-Kano road",
    "summarized_story": "Two people are reportedly missing after their vehicle was washed away by flood caused by heavy downpour in Malka village in the Ningi Local Government Area of Bauchi State.\nThe flood which lasted for several hours from Thursday night to Friday morning, led to the collapse of the road linking Bauchi metropolis, Ningi LGA as well as Jigawa and Kano States.\nOther passengers in the vehicle were said to have been rescued and immediately rushed to the hospital.\nSeveral travellers were seen stranded on the ever-busy Bauchi-Ningi-Kano road according to The Nation.\nChairman Ningi LGA, Hon."
  },
  {
    "headline": "Why You Should Try Intermittent Fasting",
    "summarized_story": "You’re probably living under a rock if you’ve not heard about intermittent fasting because it’s one of the most popular health and fitness trends right now.\nIntermittent fasting is a feeding plan that alternates between fasting and feeding periods, the goal is to systematically starve the body long enough to trigger fat burning.\nThis is why people on intermittent fasting plan will experience a reduce in brain fog.\nFor intermittent fasting to be safe and effective, it must be combined with balanced meals that provide good nutrition.\nNext week I’ll write a complete beginners guide to intermittent fasting for those that are curious, and common mistakes that may be stalling your results."
  },
  {
    "headline": "Shell Launches Major Divestment of Nigerian Assets, SPDC for Sale",
    "summarized_story": "Royal Dutch Shell has launched a major divestment of its Nigerian assets, several sources familiar with the matter said.\nShell has hired Standard Chartered to sell its Shell Petroleum Development Company of Nigeria Limited (SPDC) subsidiary, two of the sources said.\nAlternatively, Shell may sell portions of equity in the whole of SPDC to different consortia of buyers, this source said.\nShell first announced its plans to sell down its Nigerian onshore interests during its annual general meeting in May.\n“Over the last 10 years we have reduced the total number of licences in onshore Nigeria by half."
  },
  {
    "headline": "Isabel Dos Santos: Former Angolan President’s Daughter Ordered to Repay $500m",
    "summarized_story": "An international court has ordered Isabel Dos Santos, the daughter of Angola’s former president who was once known as Africa’s richest woman, to surrender oil and gas shares worth $500m.\nThe Netherlands Arbitration Institute, part of the International Court of Arbitration, said that the transaction in which Ms Dos Santos had received the shares in Portuguese oil and gas firm Galp was illegal.\nIt ordered that she must return them to the Angolan energy group Sonangol.\nMs Dos Santos has faced a slew of allegations that she plundered state assets and sent the money abroad.\nShe denies the allegations and says she is the victim of a political witch-hunt."
  },
  {
    "headline": "Kenya Signs Multi-million Dollar Armoured Car Deal with Turkish firm",
    "summarized_story": "As a way of boosting Kenya’s capacity in waging war against terrorism, the country’s armed forces has signed a deal worth Sh9.87 billion with Turkish armoured vehicles manufacturer Katmerciler.\nThe deal which is to get 118 new armoured military vehicles for the country, is the largest single order for such vehicles in several years.\nTurkish firm Katmerciler made the announcement in a regulatory filing, filed with the Turkish stock exchange, the Borsa Istanbul.\nThe Turkish manufacturer said the new vehicles can be used for combat, command and control, chemical, biological, radiological and nuclear defence, weapon carrier, ambulance, border security, and reconnaissance.\nNairobi has recently been keen to strengthen its security and trade ties with Istanbul in the face of growing terrorism threats."
  },
  {
    "headline": "Airtel Africa Plc Records $142m Profit, Revenue Grows 31% in Q1 2021",
    "summarized_story": "Airtel Africa Plc has announced a net profit of $142 million in the fiscal first quarter as revenue grows 31% to $1.1billion.\nThe company’s Q2 2021 unaudited results for the period ended June 30th, 2021 shows a profit before tax of 133 per cent to $259million while profit after tax went up by 149 per cent to $142m.\nThe Africa unit’s average revenue per user (ARPU) grew 6.5% sequentially to $3.1 in the April-June period.\nData revenue, in turn, grew nearly 14% on-quarter to $355 million while voice revenue rose 3.3% sequentially to $559 million in the June quarter.\nAirtel Africa Plc which was listed on London Stock Exchange in late-June 2019, is a leading provider of telecommunications and mobile money services, with a presence in 14 countries across Africa."
  }
]