[
  {
    "headline": "Complaints as over 50,000 users download eNaira App in 24 hours",
    "summarized_story": "No fewer than 50,000 Nigerians have downloaded the eNaira application, 24 hours after it was launched by the Federal Government.\neNaira Speed wallet is a fast and convenient way to conduct financial transactions,” CBN said while telling users about the App.\nIt is a known fact that email was not a mandatory requirement setting up BVN, now this app wants to use the BVN email.\nIf CBN wants eNaira wallet to be used in our day-to-day living, then they should make it easy to use and accessible for everyone.\n“I have successfully registered and the App is working well but there is no means of crediting the eNaira wallet."
  },
  {
    "headline": "Senate rejects NBTI 2022 budget, insists on separate proposals for incubation centres",
    "summarized_story": "The Senate Committee on Science and Technology has rejected the 2022 budget proposal of the National Board for Technology Incubation.\n“It also coordinates technology incubation in the country.\n“The committee noted the over 40 business technology incubation outlets providing natural platforms for entrepreneurial skills across the country.\n“The budgets of the incubation centres had been merged with that of the NBTI headquarters which is totally unacceptable by this committee.\n“The NBTI centres are quite resourceful, enterprising and focused."
  },
  {
    "headline": "BREAKING: UN writes Nigeria, Kenya over Kanu",
    "summarized_story": "Warns of consequences if torture allegations are confirmed.\nUN also warned of serious consequences if the allegations of torture and violation of fundamental human rights against the IPOB leader were confirmed.\nThe UN intervention followed a petition to the UN by Kanu’s brother, Kanunta Kanu; and his Special counsel, Mr. Aloy Ejimakor.\nIt also has made public an acknowledgment it received on 17th September 2021 from the ‘Permanent Mission of the Federal Republic of Nigeria to the United Nations’.\n“It is important to emphasize that this is just the beginning of more United Nations and other global strong actions that would be seen in the coming weeks."
  },
  {
    "headline": "I will become next Nigeria president come May 29, 2023 — Yahaya Bello",
    "summarized_story": "By Arogbonlo IsraelFollowing calls to join the presidential race, Kogi State Governor, Yahaya Bello has said he has all the qualities needed to succeed President Muhammadu Buhari come May 29, 2023.\nAccording to him, he is ready to take over from President Buhari considering his good track record in Kogi.\n“By the grace of God when I would have [been] sworn in as the president and commander-in-chief taking over from Buhari on May 29, 2023, Nigeria will have a heave of relief,” he said.\nEarlier, a youth group gave governor Bello 14-day ultimatum to make his intention known ahead of the 2023 presidential election.\nVanguard also reports some South-West youths last month (September), endorsed the 2023 presidential aspiration of Yahaya Bello, in 2023."
  },
  {
    "headline": "Just in: 99.4 % of bank accounts contain less than N500,000-NDIC",
    "summarized_story": "By Babajide KomolafeThe Nigeria Deposit Insurance Corporation, NDIC, said that 99.4 per cent of bank accounts contain less than N500,000 Maximum Insured Limit (MIL) of the Nigeria Deposit Insurance Corporation, NDICManaging Director/Chief Executive, NDIC, Mr. Bello Hassan disclosed this in Gombe, at the second led of the Corporation’s workshop for Finance Correspondents and Business Editors.\nHe stated this against the concerns over the adequacy of tl the NDIC’s maximum coverage limits of N500,000per depositor per commercial, merchant and, non-interest bank, primary mortgage bank and mobile money operator, as well as N200,000 per depositor per microfinance bank.\nDeposit insurance coverage should also be consistent with the deposit insurance system’s public policy objective.\nOut of these numbers, the N500,000 coverage limit fully covered 99.4%; 97.6%; 97.5% and 97.6% of accounts, respectively.\nWhat these figures entail is that only less than 3% of accounts/depositors are not fully covered by the prevailing coverage limits."
  },
  {
    "headline": "Police arraign man for allegedly defrauding pastor N1.2m",
    "summarized_story": "The Police in Lagos on Tuesday, arraigned a 45-year-old man, Taiwo Awopetu, before a Badagry Magistrates’ Court, for allegedly defrauding one Pastor Felix Ogoh of N1.2 million.\nThe prosecutor, ASP Ikem Uko, told the court that the defendant committed the offences sometimes in Jan. 2021 at Ajara, Badagry area of Lagos.\nUko said the defendant allegedly collected the sum of N1.2 million from the complainant under the pretext of selling a Toyota Corolla 2006 model to him.\nThe Chief Magistrate, Patrick Adekomaiya, granted the defendant bail in the sum of N200,000 with two sureties in like sum.\nAdekomaiya said the sureties must reside within the court’s jurisdiction with evidence of tax payments to the Lagos State Government."
  },
  {
    "headline": "NHRC urges Police, others to locate ‘missing’ Journalist",
    "summarized_story": "Mr Tony Ojukwu, the Executive Secretary of the National Human Rights Commission, has urged the Police and other security agencies in the nation’s capital to do everything within their powers to locate a missing journalist.\nTordue Salem, a Vanguard Newspaper’s House of Representatives Reporter reportedly went missing on Oct. 13 in the Federal Capital Territory Abuja.\nREAD ALSO: NSCC to partner NHRC against abuse of senior citizensHe expressed sadness over the news of the National Assembly Correspondent who has been missing for 15 days.\n“He has painstakingly reported human rights issues as well as educated the masses on their rights since his days with the leadership newspaper.\n” Enforced disappearance is one of the hazards associated with the practice of journalism in Nigeria” Ojukwu added."
  },
  {
    "headline": "Introduce critical thinking as subject in primary schools – Educationist tells FG, states",
    "summarized_story": "The author, who spoke shortly after donating some critical thinking materials to pupils of selected public primary schools in the state, appealed to the governments to provide critical thinking materials in all primary schools in the country.\nCritical thinking materials.\n“But, we don’t have books that encouraged or helped to cultivate critical thinking skills.\nWhat I have done is to help develop critical thinking materials which we are now using as part of critical thinking materials.\n“I am the one behind the critical thinking project whose aim is to introduce critical thinking as a subject at primary schools."
  },
  {
    "headline": "FCE Yola closed following riot by students over water scarcity",
    "summarized_story": "This followed a riot by students who protested Tuesday morning over the lack of water around the campus.\nSources said the students went wild over water scarcity and the school management reacted by shutting down the school.\nRegistrar of the college, Mallam Ahmad Gidado, told newsmen that the water scarcity was caused by the breakdown of the main industrial borehole supplying water to the entire school.\nHe said the Provost of the College had directed a water tanker to supply water after the breakdown of the industrial borehole but yet the students were adamant.\nGidado said the school was closed down till further notice to curtail further breakdown of law and order."
  },
  {
    "headline": "Group asks FG to name sponsors of terrorism",
    "summarized_story": "A religious organisation under the auspices of King Abdullah bin Abdulaziz International Centre for Interreligious and Intercultural Dialogue has asked the Federal Government to name the sponsors of terrorism and banditry in the country.\nThe organisation asked President Muhammadu Buhari to deal decisively with the terrorism financiers, stressing that insecurity has set Nigeria on the reverse gear.\nHe explained that the motives of the sponsors of terrorism for destabilising the entire country should be revealed with the sole aim of bringing it to an end.\nHe advised the government to go after the sponsors of insecurity, assuring that there are people sponsoring terrorism as it is not enough to buy Super Tucanos and gadgets while leaving the sponsors.\nHe lamented that the education system in the country is being destroyed by the activities of bandits, saying that it portends a bad omen for Nigeria’s future."
  },
  {
    "headline": "Northern coalition advocates S/East’s speedy exit from Nigeria",
    "summarized_story": "Some members of the Coalition of Northern Groups (CNG) have approached the Federal High Court in Abuja, asking it to order the National Assembly to ensure the exit of the South East from Nigeria.\nThe members said the exit could be made before the conclusion of the ongoing constitutional amendment.\nIPOB, led by Nnamdi Kanu, has been agitating for self-determination.\nHe was repatriated to Nigeria from Kenya, where he was rearrested after jumping bail to flee Nigeria in 2017.\nBiafra: ​Igbo youths issue demand on IPOB leader, Nnamdi Kanu"
  },
  {
    "headline": "Boko Haram: Army shuns Col Suleiman who arrested 377 terrorists, prevented Presidential Villa attack",
    "summarized_story": "The sharpshooter coordinated the arrest of no fewer than 377 Boko Haram terrorists in 2009.\n“He led a joint intelligence task force comprising other security agencies in uncovering camps of the Boko Haram in the North.\n“His prowess as a spy played a major role in discovering a Boko Haram cell within the Presidential Villa before the terrorists struck.\nSuleman was also key to the arrest and prosecution of Boko Haram pioneer spokesman Umar Sanda Konduga, a Chadian arms supplier Bana Fannaye, among others.\nThe gallant officer won the Chief of Army Staff Commendation Award and received a national honour – Member of the Order of the Federal Republic (MFR)."
  },
  {
    "headline": "I will take over from Buhari in 2023, Yahaya Bello boasts",
    "summarized_story": "I will take over from Buhari in 2023, Yahaya Bello boastsKogi Governor Yahaya Bello has expressed optimism he will succeed President Muhammadu Buhari in 2023.\nHe said he has all the qualities to succeed as President, stating he has fixed Kogi since he took over.\n“By the grace of God when I would have [been] sworn in as the president and commander-in-chief taking over from Buhari on May 29, 2023, Nigeria will have a heave of relief,” he said.\n“I inherited a State faced with a lot of crimes and criminal activities.\nI inherited a state that required the binding of youths, women and all inclusive governance."
  },
  {
    "headline": "Rape cases, not considered for presidential pardon – Ncos",
    "summarized_story": "Mr Francis Adebisi, the Controller, Nigeria Correctional Service (NCoS) in Lagos State, says inmates involved in defilement of minors and other rape cases will not be considered for presidential pardon.\nHe, however, said that inmates involved in rape cases, especially the defilement of minors, would not benefit from such pardon, hence they were excluded from the assessment.\nAdebisi added that 300 inmates would be scrutinised in the state, while only 80 would be considered for pardon.\n- Advertisement -READ ALSO: Fed Govt compiles names of prison inmates for presidential pardonHe said “the pardon, however, will depend on whether the inmates under consideration will meet the criteria.\nBabajide Sanwo-Olu of Lagos State, Minister of Interior, Rauf Aregbesola, andController-General of NCos, among others.” (NAN)"
  },
  {
    "headline": "NYSC moves to vaccinate Corps members",
    "summarized_story": "The National Youth Service Corps (NYSC) plans to vaccinate all Corps members of the 2021 Batch C Stream 1 to keep them safe from the COVID-19 virus.\nDirector-General of the Corps, Brig-Gen Shuaibu Ibrahim, stated this while addressing members of the Batch during their swearing-in ceremony nationwide.\nIbrahim noted that the management decided to vaccinate the Corps members as they could be affected by the deadline.\nThe NYSC DG warned the corps members to refrain from using the social media to cause division and hatred but to promote unity.\nIbrahim also urged the corps members to be security conscious at all times and avoid putting themselves in harm’s way."
  },
  {
    "headline": "We have enough manpower for Anambra election – INEC official",
    "summarized_story": "We have enough manpower for Anambra election – INEC officialThe Independent National Electoral Commission (INEC) says it has adequate manpower for the conduct of Nov. 6 governorship election in Anambra.\nDr Nwachukwu Orji, INEC Resident Electoral Commissioner in Anambra State disclosed this in an interview with the News Agency of Nigeria (NAN) on Tuesday in Awka.\n- Advertisement -Orji who was reacting to viral media report that hundreds of adhoc workers recruited for the Anambra election resigned en-masse, said there was no truth in the publication.\n“As the head of the commission in Anambra, I am telling you authoritatively that we have more than enough manpower for the conduct of the forthcoming governorship election in Anambra”, he said.\n- Advertisement -READ ALSO: INEC rules out postponement of Anambra electionThe INEC official explained that none of the adhoc workers being recruited had been given engagement letter."
  },
  {
    "headline": "IPOB: UN probes Nigeria, Kenya’s roles in Kanu’s rendition",
    "summarized_story": "From Magnus Eze, EnuguThe United Nations has issued ‘Urgent Appeals’ in the case of leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu against Nigeria and Kenya, the separatist activist’s younger brother, Kingsley Kanunta has disclosed.\nKanunta said Tuesday, that he had undertajen a number of urgent steps within the realm of the international community, particularly in Britain and the United Nations in the last three months.\nAccording to Kanunta, these interventions were kept secret because the applicable rules, especially that of the United Nations, required them to be kept confidential for 60 days.\nKanu noted that the UN had also made public an acknowledgment it received on September 17, 2021 from the ‘Permanent Mission of the Federal Republic of Nigeria to the United Nations’.\n“It is important to emphasize that this is just the beginning of more United Nations and other global strong actions that would be seen in the coming weeks."
  },
  {
    "headline": "Terrorists: Ohanaeze, MBF, CAN, NINAS, Kaigama, Mogekwu, Kokori, Okorie hit Gumi over comment",
    "summarized_story": "“If the Governor of Kaduna State, where Gumi lives, is asking the Federal Government to declare bandits as terrorists, who is Gumi to say otherwise?\nHe also called on government to, as a matter of urgency, arrest Sheikh Gumi.\n“What I think Sheikh Gumi and many good Nigerians should do is how do we conquer the situation?\n“So if he wishes to declare bandits as saints, let him continue to do so.\nLet the president declare them saints if that is his advice; advising the president to declare bandits as saints."
  },
  {
    "headline": "Allow Igbo secede, northern leaders tell court",
    "summarized_story": "From Godwin Tsa, AbujaA group of northern elders have commenced legal process for the secession of South East from the Nigerian federation.\nHowever, lawyers from the South East have applied to the court to join them as defendants in a suit.\nThe lawyers are asking for order of the court to allow them join in the suit as representatives of the people of the South East.\nThat the Igbo Lawyers Association represented by the applicants are an indigenous association of lawyers from the South East of Nigeria and other indigenous Igbo speaking tribe in Nigeria.\nThat the Igbo Lawyers Association and its objective is to represent the interest of the Igbo people which said people are indigenous in the South East of Nigeria."
  },
  {
    "headline": "2023: Middle Belt youths meet in Enugu, back S’East presidency",
    "summarized_story": "From Magnus Eze, EnuguYouth leaders from the ethnic nationalities of the Middle Belt have declared support for a president of South East extraction in 2023.\nPresident General and leader of delegation of youth leaders of Middle Belt, to a one-day strategic partnership meeting, Timothy Hembaor, disclosed this to newsmen, at the weekend in Enugu.\nHembaor said the Middle Belt was preparing for the 2023 presidency but decided to drop the ambition and back the South East after considering the magnitude of injustice meted to the Igbo in Nigeria.\n“Let us know we are the same people, let us know we are one Nigeria; let us love one another.\n“The more South East is held down, the more our nation would be in a quagmire situation, unable to make any meaningful progress."
  },
  {
    "headline": "Wike, CJN berate NBA over silence on national crisis, assault on judiciary",
    "summarized_story": "From Tony John, Port HarcourtRivers State Governor Nyesom Wike, and the Chief Justice of Nigeria, Justice Tanko Mohammed, have flayed the Nigerian Bar Association (NBA) for keeping silent on the crisis confronting the nation and assault on judiciary.\n“But, the central question is whether the NBA has been living up to its credo and responsibility?\n“Another challenge being faced by the judiciary is the assault by litigants against the institution of the judiciary when their cases are not met.\nUnfortunately, some members of the Bar also join them in ridiculing our courts in their private discussions and on national dailies.\nI wish, therefore, on behalf of the Senate and, in deed, the National Assembly thank the NBA for organising this conference."
  },
  {
    "headline": "Politicians Still Influencing Judges to Use Court against Democracy",
    "summarized_story": "Whether the appellate court would accede to the demand or not is another, particularly, taking into consideration the recent position of appellate court justices with respect to exparte granted by High Court judges.\nIt is worthy of mention that the appellate court and even the Supreme Court had descended heavily on the High Court judges particularly, in the Anambra governorship suits.\nThe appellate court claimed that the trial court erred by entertaining a suit wherein it lacked jurisdiction.\nBut Okeke challenged the authenticity of the Oye leadership at a Federal High Court in Jigawa State, where judgment was given in his favour.\nBut before Secondus could carry out the order, Justice Edem Kooffreh of a Cross River State High Court on August 28, restrained him from resuming."
  },
  {
    "headline": "Buhari Unveils eNaira as CBN Launches Instrument to Support 300 Companies",
    "summarized_story": "He stressed that Nigeria was the first country in Africa and one of the first in the world to introduce digital currency.\nHe disclosed that the journey to create a digital currency for Nigeria began in 2017.\nCBN decided to implement its own CBDC and to name the digital currency eNaira, with the expectation that the innovation would make significant positive difference to Nigeria and Nigerians, he stated.\nThe eNaira wallet is required to access, use and hold eNaira, which will be exchangeable for other Central Bank Digital Currencies (CBDC).\nThe CBN added that the AML/CFT checks for fraud prevention and detection would apply on the eNaira platform."
  },
  {
    "headline": "NSA: IPOB Must Not Test Our Will to Guarantee Peaceful Poll in Anambra",
    "summarized_story": "“INEC is determined to proceed with the Anambra State Governorship election as scheduled.\n“I am sure the Commissioner Police, Anambra State, in his briefing, will provide more details regarding preparations on the ground.\n“The professionalism and neutrality exhibited by the security agencies in the two elections have been widely praised nationally and internationally.\nWe are confident that this will be replicated in Anambra State,” Yakubu said.\nHe, therefore, commended the security agencies for the support INEC had received from religious, traditional and community leaders for peaceful elections."
  },
  {
    "headline": "Buhari Swears in Two INEC National Commissioners",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has sworn in two National Commissioners of the Independent National Electoral Commission (INEC).\nThe swearing-in took place on Monday at the Conference Hall of the First Lady’s office at the State House, Abuja, before the official launch of the eNaira and 2022 Armed Forces Remembrance Day emblem.\nThe new National Commissioners are Prof. Muhammad Sani Kallah (Katsina State) and Prof. Kunle Cornelius Ajayi (Ekiti State).\nThe duo are part of the six INEC commissioners cleared by the Senate in July this year.\nPresident Buhari had on September 15, 2021, sworn in three of the cleared National Commissioners."
  },
  {
    "headline": "Buhari: Peace Now Returning to Troubled Areas in Nigeria",
    "summarized_story": "Wants Nigerians to celebrate gallantry of nation’s troopsBy Deji ElumoyePresident Muhammadu Buhari has disclosed that peace has started to return to troubled areas which in the past faced terrorism and banditry attacks across the country.\n”The exploits of our Armed Forces to maintain peace as well as their disposition to the unity of Nigeria have contributed in no small measure to our stability.\nOur faith in our Armed Forces remains unshaken and as a government we will do all within our powers to ensure that our Armed Forces are motivated to perform optimally.\n“The same call goes to all visitors and friends of Nigeria as well as corporate bodies operating in Nigeria,” he said.\n”I have the pleasure to acknowledge the contributions of retired officers and men of the Nigerian Armed Forces to the ongoing war on insurgency."
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "Hushpuppi Scandal: Police Authorities Under Pressure From Buhari’s Minister, Malami, Others To Clear Disgraced Officer, Abba Kyari",
    "summarized_story": "See Also Police Probe Report: Nigeria Police Query Disgraced Officer, Abba Kyari Over Communications With Suspected Fraudster, HushpuppiThe agency said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n\"Not only some influential Nigerians, even Malami (AGF) also wants to clear Abba Kyari,\" another top source said.\nWE NEED HIM BACK BY ALL MEANS AS SOON AS POSSIBLE.”Another Facebook user wrote, “Please @⁨BisongOnonye⁩, can Abba Kyari be restored to the Nigeria Police?\nMay God Save My Home Land.”On Instagram, Chinedum Agwaramgbo said, \"Pls ABBA KYARI should be re-instated!\nBRING ABBA KYARI BACK!\""
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Electoral Commission Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu has been holding secret meetings with top leaders of the All Progressives Congress (APC), SaharaReporters has learnt.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Electoral Commission Chairman, Yakubu Holding Secret Meetings With Senate President Lawan, Ruling APC Party Leaders Ahead Of Elections",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu has been holding secret meetings with top leaders of the All Progressives Congress (APC), SaharaReporters has learnt.\nSources explained that the INEC chair, who is supposed to be neutral and non-partisan has been holding frequent meetings with Ahmad Lawan, Senate President and Mai Mala Buni, Caretaker Chairman of the ruling APC and governor of Yobe State.\nIt was gathered that the trio had a meeting last Friday, October 22 at a guest house belonging to the Senate President between 10 pm and 1 am.\nOne of the sources stated: “INEC chairman is frequently having private meetings with the duo of the Senate President and Buni at a private guest house owned by the Senate President in Maitama, Abuja.\nIt was between the Senate President, INEC chairman and Buni."
  },
  {
    "headline": "Bagudu: People say we have over-borrowed -- but states need more money",
    "summarized_story": "Atiku Bagudu, governor of Kebbi state, says state governments need more resources to invest in infrastructural development and lift millions of poverty.\nAdvertisementBagudu said this on Monday while speaking with journalists on the sidelines of the 27th Nigerian Economic Summit (NES) in Abuja.\nHe said the limiting factor for sub-national government is financial resources and called for synergy between the federal and state government on accessing more resources.\nAdvertisement“People say we have over-borrowed, but we need more money, and we need the support urgently to invest in our capacities.\nOn Nigeria’s debt profile, Zainab Ahmed, minister of finance, budget and national planning, said the present government’s borrowings are backed up by law and within the ability to repay."
  },
  {
    "headline": "Bagudu: People say we have over-borrowed -- but states need more money",
    "summarized_story": "Atiku Bagudu, governor of Kebbi state, says state governments need more resources to invest in infrastructural development and lift millions of poverty.\nAdvertisementBagudu said this on Monday while speaking with journalists on the sidelines of the 27th Nigerian Economic Summit (NES) in Abuja.\nHe said the limiting factor for sub-national government is financial resources and called for synergy between the federal and state government on accessing more resources.\nAdvertisement“People say we have over-borrowed, but we need more money, and we need the support urgently to invest in our capacities.\nOn Nigeria’s debt profile, Zainab Ahmed, minister of finance, budget and national planning, said the present government’s borrowings are backed up by law and within the ability to repay."
  },
  {
    "headline": "Zainab Ahmed: FG will pay petrol subsidy in first six months of 2022",
    "summarized_story": "Zainab Ahmed, minister of finance, budget and national planning, says the federal government will cater for subsidy on petrol in the first six months of 2022.\nAdvertisementShe said this on Monday at a panel session during the 27th Nigerian Economic Summit (NES#27) in Abuja.\nAhmed said that complete deregulation of the downstream oil and gas sector will start by July 2022.\nIn seven months, petrol subsidy payments gulped N714 billion, shrinking monthly revenue accrued to the federation account.\nAdvertisementHe said that the Petroleum Industry Act (PIA) made the payment of subsidy of petrol illegal."
  },
  {
    "headline": "Zainab Ahmed: FG will pay petrol subsidy in first six months of 2022",
    "summarized_story": "Zainab Ahmed, minister of finance, budget and national planning, says the federal government will cater for subsidy on petrol in the first six months of 2022.\nAdvertisementShe said this on Monday at a panel session during the 27th Nigerian Economic Summit (NES#27) in Abuja.\nAhmed said that complete deregulation of the downstream oil and gas sector will start by July 2022.\nIn seven months, petrol subsidy payments gulped N714 billion, shrinking monthly revenue accrued to the federation account.\nAdvertisementHe said that the Petroleum Industry Act (PIA) made the payment of subsidy of petrol illegal."
  },
  {
    "headline": "'A mere circular is not law' -- Court faults CBN, unfreezes Rise Vest's accounts",
    "summarized_story": "A federal high court sitting in Abuja has vacated the interim order freezing the accounts of Rise Vest Technologies Ltd, a fintech company.\nThe affected companies are Rise Vest Technologies Limited, Bamboo Systems Technology Limited, Bamboo Systems Technology Limited OPNS, Chaka Technologies Limited, CTL/Business Expenses, and Trove Technologies Limited.\nAdvertisementResponding, Mathew Onoja, CBN’s counsel, argued that the ex-parte order of the court was proper, lawful, and valid.\nThe law is trite that any conduct that must be sanctioned must be expressly stated in a written law,” he said.\n“Being unknown to law, circulars cannot create an offence because it was not shown to have been issued under an order, Act, Law or Statute."
  },
  {
    "headline": "Africa eShop, DHL’s online retail service, is shutting down this month",
    "summarized_story": "After two years of operation, DHL Africa is shutting down its pan-African online retail platform, e-Shop, at the end of the month.\nSorry for any inconvenience this may have caused,” a message on the Africa eShop website reads.\nTechCabal reached out to DHL Africa for answers but has yet to receive a response at the time of publication.\n— DHL Africa (@DHLAfrica) October 21, 2021A white-labeled productWhile the Africa eShop appears to be a standalone e-commerce platform owned by DHL, that isn’t the case.\nBeing a white-labeled product, DHL’s Africa eShop website and offerings are very similar to that of MallforAfrica."
  },
  {
    "headline": "How Koa is helping Kenyans build and manage wealth",
    "summarized_story": "After doing that for a while, she joined MEST Africa.\nAfter leaving MEST Africa, the duo forayed into different businesses but kept in touch and would always meet up whenever they were in the same city.\nSo, Koa is killing two birds with one stone by holding its users’ money in a money market through a partnership with Britam, an asset manager in the Kenyan market.\nOn Koa, users earn up to 10% interest on their money annually, depending on market conditions.\nSo are Koa users aware that their money is being invested in a money market?"
  },
  {
    "headline": "Here’s everything you need to know about Apple’s new releases",
    "summarized_story": "In a beautiful transition between Tim Cook and Zain Lowe, Apple also revealed the Music Voice Plan, a new subscription category for Apple Music that allows users to seamlessly use Siri with Apple Music.\nThe fall event started off with the introduction of Apple Music Voice Plan, a new subscription offering that allows users to seamlessly enjoy Siri with Apple Music.\nApple Music plansNew colours for Apple HomePod Mini Smart SpeakerAesthetics—that’s the simplest way to describe this update.\nM1 Pro And M1 Max ChipsEarlier in this article, we called these updates the two biggest surprises of the night.\nThe basic models come as standard with the M1 Pro, 16GB of Unified Memory and a 512GB SSD."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Risevest accounts unfrozen, Vendease’s seed round, and Interswitch X OkHi’s partnership",
    "summarized_story": "Global Founders Capital led the round with Hustle Fund, Hack VC, Soma Capital, Y Combinator, Liquid 2 Ventures, MAGIC Fund, Tayo Oviosu, Paga CEO, and John Obaro, Remita CEO joining the round.\nIn addition to its expansion plans, the funds will help the startup build its technology and financial services offerings.\nPer TechCabal, the size of the market and the complexity of the Nigerian financial services industry was critical to the startup’s decision.\nIncidentally, in 2020, it also raised $1.5 million in a round led by Interswitch, Founders Factory Africa, and Betatron venture capitalists.\nThrough this partnership with Interswitch, OkHi is perfectly poised to serve other financial institutions in Nigeria, most of whom are served by Interswitch."
  },
  {
    "headline": "eNaira launch: CBN highlights relief funds, cross-border payments, and unknown risks",
    "summarized_story": "According to the design paper, one of the benefits of the eNaira is the possibility of direct welfare disbursement to citizens.\nThe design paper says that the eNaira will speed up cross-border payments but doesn’t state how fast it will be.\nThis will be possible because of the eNaira’s interoperability, one of the design elements mentioned in the design paper.\nAdvertisementIn a recent article, we explored how private or permissioned blockchains, such as the Hyperledger Fabric being used by the CBN, work and the amount of control it gives it.\nMeanwhile, the eNaira website indicates that the speed wallet app that will facilitate eNaira transactions is available for download."
  },
  {
    "headline": "How to support us",
    "summarized_story": "Shut Techpoint Africa upWhat would a day in the African tech space be like without Techpoint Africa?\nWell, it is not lost on us that there are a number of anti-Techpointers who really wish we would stop existing.\nIn the famous words of Pablo Escobar, “Everyone has a price, the important thing is to find out what it is.” He was right; ours is ₦10,000,000/$20,000 per day.\nYes, for just ₦10,000,000 or $20,000, you can shut down the Techpoint Africa website for one day of your choosing.\nThat is 24 full hours without one Techpoint Africa publication, be it an article, newsletter or social media post."
  },
  {
    "headline": "Obaseki education reforms get kudos, as Sanwo-Olu commends, urges states to embrace EdoBEST – Nigerian Observer",
    "summarized_story": "Hailing Obaseki for the ingenuity of starting EdoBEST, Sanwo-Olu described the programme as a model for across-the-board basic education reform.\n“I usually concede and acknowledge Governor Obaseki because I copied something from him,” Governor Sanwo-Olu said at the recently concluded Ekiti State Fountain Summit, while speaking about EdoBEST.\nWe’ve copied that (EdoBEST) from Edo and it is working well in Lagos and we will scale it up,” Governor Sanwo-Olu said.\nOn his part, Obaseki stated, “Education is the foundation in which every other thing rests particularly the use of ICT.\nFor the future, we need to see how we now use technology to recast basic education."
  },
  {
    "headline": "Obaseki Health Reforms: Nursing, Midwifery Council accredits Edo College of Nursing SciencesNursing, Midwifery Council accredits Edo College of Nursing Sciences – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nursing and Midwifery Council of Nigeria (NMCN) has approved the establishment of the Edo State College of Nursing Sciences, Benin City to commence the training of nurses and midwives in the state from October 2021.\nThe approval followed the weekend visit of the NMCN accreditation team to the remodeled state-owned tertiary institution, which had lost its accreditation since 2012.\nThe letter reads: “the Board of the Nursing and Midwifery Council of Nigeria pursuant to Section 14 (Sub-section 1 and 2) of the Act 143, Laws of the Federal Republic of Nigeria (2004), has approved the establishment of the Edo State College of Nursing Sciences, Benin City, Edo State.\n“In the light of that, I wish to convey the Board’s approval to commence training of Nurses and Midwives at the Edo State College of Nursing Sciences, Benin City, Edo State.\nThe approvals are as follows:“General Nursing Programme-Provisional Accreditation Status of one hundred (100) Students’ intake with effect from October 2021."
  },
  {
    "headline": "Obaseki assures of sustained reforms, policies to guarantee sustainable devt in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration will sustain policies and programmes to guarantee the growth and development of the state, ensuring better livelihoods for Edo citizens.\nObaseki gave the assurance when he received the executive members of the Nigerian Veterinary Medical Association (NVMA), led by its Chairman, Dr. Ibrahim Ado, who were on a courtesy visit at the Government House, Benin City.\nObaseki said, “Growing up in Benin City, the veterinary clinic was a place to visit to see veterinary doctors treat animals.\nWe thank God for an association like yours, which is on the ground to change the narrative.\nVeterinary services are needed; it is a means for generating income for Edo State, as we work to increase our Internally Generated Revenue (IGR).”He added, “We have embarked on a lot of reforms in the state."
  },
  {
    "headline": "Oba Ewuare II Commends President Buhari On Reparation Of Benin Artefacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Benin Monarch, His Royal Majesty ,Omo N Oba N’Edo Uku Akpolokpolo Ewuare II has appreciated President Mohammed Buhari on his efforts and support in the reparation of the Benin artefacts.\nOba Ewuare II in the same vien appreciated the Minister of Information and Culture Alhaji Lai Mohammed, the DG of National Commission for Museum and Monuments as well as all well meaning Nigerians for their efforts and support in the reparation of the Benin artefacts.\nThe Oba made the appreciation when the founder of DAAR Communications, Chief Executive Officer of Raypower and African Independents Television (AIT) High Chief Raymond Dokpesi paid him a courtesy visit at the Palace recently.\nThe Oba then prayed to God and ancestors to continue to protect high Chief Dokpesi and family out of harms way.\nThe highpoint of the visit was a special presentation of the Red Book to the founder of DAAR Communication by the Oba."
  },
  {
    "headline": "Shugaban Jami’ar Maryam Abacha, Farfesa Gwarzo zai yi jawabi a jami’ar IHERIS dake kasar Togo",
    "summarized_story": ""
  },
  {
    "headline": "TSAKANIN 2019 ZUWA 2020: Yadda aka yi wa talakawa wala-walar ayyuka 73 a mazaɓun Ondo da Gundumar FCT Abuja",
    "summarized_story": ""
  },
  {
    "headline": "KURA DA FATAR AKUYA: Gwamnatin Tarayya ta bankaɗo alaƙar Sunday Igboho da mai ɗaukar nauyin ‘yan Boko Haram",
    "summarized_story": ""
  },
  {
    "headline": "Kotu ta yanke wa dan damfara hukuncin sharar kotu na tsawon watanni shida",
    "summarized_story": ""
  },
  {
    "headline": "El-Rufai ya goyi bayan Majalisar Dattawa Tarayya domin kiran ‘yan bindiga da suna ‘yan ta’adda",
    "summarized_story": ""
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "World Bank says Nigeria’s per capita income has not improved in 40 years",
    "summarized_story": "The World Bank has said per capita income (PCI) in Nigeria, has remained at the same level as it was 40 years ago.\nAccording to Chaudhurie, the country needs to make strategic decisions to set it on the path to realising its potential.\nHe noted that in 1981, Nigeria’s PCI was $2,180.2 and $2,097 in 2020.\n“Nigeria today has real per capita income that was the same as 40 years — in 1981.\n“But our sense is that Nigeria is at a point in time where some critical decisions need to be made."
  },
  {
    "headline": "NDIC insurance coverage limit one of the most robust in the world – Bello Hassan",
    "summarized_story": "By OBINNA EZUGWUThe Managing Director/Chief Executive and Executive Director of Nigeria Deposit Insurance Corporation (NDIC), Mr. Bello Hassan, has noted that the insurance coverage limit of the corporation is one of the most robust in the world, and covers up to 97 percent of deposits in Nigerian banks.\nHe said, “The NDIC coverage limit is very robust, it’s one of the most robust in the world.\nHe further explained that depositors who have more than N500,000 in their bank accounts are also covered by the corporation, but within the limit of N500,000.\n“If you have N1million in your bank account, it doesn’t mean that you would lose the whole money in the event of failure.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Tesla momentarily hits $1 trillion market cap after Hertz says it will buy 100,000 electric vehicles",
    "summarized_story": "Electric car maker, Tesla briefly hit a $1 trillion market cap on Monday following news that Hertz is ordering 100,000 vehicles to build out its electric vehicle rental fleet by the end of 2022.\nNews of the deal brought Tesla’s stock to more than $998 midday, a new record-high one trading day after shares hit $900.\nThe deal, which will bring in a reported $4.2 billion for Tesla, is the largest ever purchase of electric vehicles, CNBC quoted Bloomberg to have said in a report.\nThe deal comes more than a year after Hertz filed for bankruptcy protection during the height of the pandemic, as demand for travel and rental vehicles waned.\nThis year, investors from Knighthead Capital Management and Certares Management said they would take over the company."
  },
  {
    "headline": "E-naira may add $29bn to Nigeria’s GDP ― Buhari",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has expressed optimism that the adoption of the Central Bank Digital Currency (CBDC) and its underlying blockchain technology, can increase Nigeria’s GDP by $29 billion over the next 10 years.\nPresident Buhari, who assured Nigerians of the safety and scalability of the CBDC system, said the journey to create a digital currency for Nigeria began sometime in 2017.\nWhile explaining how he approved the use of digital currency, President Buhari stated: ”In recent times, the use of physical cash in conducting business and making payments has been on the decline.\n“It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the e-Naira,’’ he said.\nIn his remarks, the CBN Governor explained that e-Naira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira."
  },
  {
    "headline": "Rep Vows To Sanitise FCT’s Real Estate Sector",
    "summarized_story": "Chairman House of Representatives Ad-hoc Committee investigating the operations of real estate developers in the Federal Capital Territory (FCT), Abuja, Hon Blessing Onuh, has said she would ensure that sanity returns to the sector in the nation’s capital.\nShe said the House has mandated her committee to investigate the operations of developers in the FCT and liaise with stakeholders to create legislation to sanitise the sector and curb sharp practices.\nOnuh disclosed that the committee has called for submission of memoranda and invited all stakeholders in the real estate sector, government agencies, investors, home-buyers and the general public to a one -day public hearing on the investigation.\nThere have been complaints that estate developers take money from subscribers without fulfilling their end of the bargain by providing the residential houses as promised.\nThe report said, “The Nigerian real estate sector has long provided opportunities for persons and companies to launder illegally acquired funds.”“The share of the real estate services to the nominal Gross Domestic Product (GDP) is estimated at around seven per cent per annum."
  },
  {
    "headline": "Rep Vows To Sanitise FCT’s Real Estate Sector",
    "summarized_story": "Chairman House of Representatives Ad-hoc Committee investigating the operations of real estate developers in the Federal Capital Territory (FCT), Abuja, Hon Blessing Onuh, has said she would ensure that sanity returns to the sector in the nation’s capital.\nShe said the House has mandated her committee to investigate the operations of developers in the FCT and liaise with stakeholders to create legislation to sanitise the sector and curb sharp practices.\nOnuh disclosed that the committee has called for submission of memoranda and invited all stakeholders in the real estate sector, government agencies, investors, home-buyers and the general public to a one -day public hearing on the investigation.\nThere have been complaints that estate developers take money from subscribers without fulfilling their end of the bargain by providing the residential houses as promised.\nThe report said, “The Nigerian real estate sector has long provided opportunities for persons and companies to launder illegally acquired funds.”“The share of the real estate services to the nominal Gross Domestic Product (GDP) is estimated at around seven per cent per annum."
  },
  {
    "headline": "Forum Charges Nigerians On New Orientation For National Devt",
    "summarized_story": "It is only by making the interest of the nation a major priority that Nigerians can achieve its lost glory and as well attain its God-given potentials.\nThis remark was the position of a newly formed group under the auspicies of National Interest Forum (NIF), at a press conference held on Monday.\n“As patriots, the National Interest Forum sees the need to close the big gap in our nation today which came about as a result of lack of trust, lack of unity, misunderstanding, personal and sectional interests among others.\nBut the good news is, our nation has the capacity and potential to surmount all these challenges which are not peculiar to our nation, Nigeria.\nGod bless our nation, Nigeria.”"
  },
  {
    "headline": "Forum Charges Nigerians On New Orientation For National Devt",
    "summarized_story": "It is only by making the interest of the nation a major priority that Nigerians can achieve its lost glory and as well attain its God-given potentials.\nThis remark was the position of a newly formed group under the auspicies of National Interest Forum (NIF), at a press conference held on Monday.\n“As patriots, the National Interest Forum sees the need to close the big gap in our nation today which came about as a result of lack of trust, lack of unity, misunderstanding, personal and sectional interests among others.\nBut the good news is, our nation has the capacity and potential to surmount all these challenges which are not peculiar to our nation, Nigeria.\nGod bless our nation, Nigeria.”"
  },
  {
    "headline": "Dwindling Revenue In Aviation Sector Threat To Safety, Security – NiMet DG",
    "summarized_story": "The director general, Nigerian Meteorological Agency (NiMET), Prof. Mansur Matazu, yesterday said dwindling aviation revenue due to Covid-19 pandemic is threatening safety and security in the sector.\nThe NiMET boss, however, lamented that despite recovering from the Covid-19 pandemic, the aviation sector was still battling with dwindling revenue.\nHe said: “Despite the current recovery being recorded in the industry around the world, the impact of the COVID-19 pandemic is still clearly visible with us.\nWith dwindling revenue, funds to sustain security and safety are also limited.\nWhile we all work hard to build security and safety culture at our airports, we must not lose sight of safety at take-off, airborne and landing."
  },
  {
    "headline": "Nigerians lament as, food prices soar amid rising transport fare",
    "summarized_story": "The prices of food rose Year-on-Year (YoY) amidst rising transport fare in September.\nSimilarly, the NBS Transport fare watch data revealed that the prices of transport fare paid for bus, air, water and motorcycle journeys rose sharply YoY in September 2021.\nSimilarly, the average price of 1kg of rice local, sold loose increased YoY by 4.95 per cent to N410.01 from N390.68.\nSimilarly, the NBS Transport fare watch data revealed that the prices of transport fare paid for bus, air, water and motorcycle journeys rose sharply YoY in September 2021.\nSimilarly, the average price of 1kg of rice local, sold loose increased YoY by 4.95 per cent to N410.01 from N390.68."
  },
  {
    "headline": "Nigerians lament as, food prices soar amid rising transport fare",
    "summarized_story": "The prices of food rose Year-on-Year (YoY) amidst rising transport fare in September.\nSimilarly, the NBS Transport fare watch data revealed that the prices of transport fare paid for bus, air, water and motorcycle journeys rose sharply YoY in September 2021.\nSimilarly, the average price of 1kg of rice local, sold loose increased YoY by 4.95 per cent to N410.01 from N390.68.\nSimilarly, the NBS Transport fare watch data revealed that the prices of transport fare paid for bus, air, water and motorcycle journeys rose sharply YoY in September 2021.\nSimilarly, the average price of 1kg of rice local, sold loose increased YoY by 4.95 per cent to N410.01 from N390.68."
  },
  {
    "headline": "IPOB: Northern coalition asks court to allow Igbo secede",
    "summarized_story": "The coalition of Northern Groups has filed a case asking the court to compel the Senate President and Speaker of the House of Representatives to hasten the exit of the South-eastern region out of Nigeria.\nThey pleaded that this should be done before the conclusion of the ongoing amendment to Nigeria’s constitution.\nIn their suit, they argued allowing the Igbo to secede would end violence and destruction in the South-East.\nThey also explained that this will stop the repeat of the 1967 to 1970 civil war in Nigeria that led to wanton destruction of lives and property.\nThey also said this would put an end to the agitations by members of the Indigenous People of Biafra led by Nnamdi Kanu."
  },
  {
    "headline": "IPOB: Northern coalition asks court to allow Igbo secede",
    "summarized_story": "The coalition of Northern Groups has filed a case asking the court to compel the Senate President and Speaker of the House of Representatives to hasten the exit of the South-eastern region out of Nigeria.\nThey pleaded that this should be done before the conclusion of the ongoing amendment to Nigeria’s constitution.\nIn their suit, they argued allowing the Igbo to secede would end violence and destruction in the South-East.\nThey also explained that this will stop the repeat of the 1967 to 1970 civil war in Nigeria that led to wanton destruction of lives and property.\nThey also said this would put an end to the agitations by members of the Indigenous People of Biafra led by Nnamdi Kanu."
  },
  {
    "headline": "Akeredolu: Bombing of rail track, kidnapping acts of terrorism, not banditry",
    "summarized_story": "By Emmanuel MogbedeVarious criminal activities of kidnapping, bombing and assault on the people in some parts of the country must be aptly addressed as terrorism, Governor Rotimi Akeredolu has said.\n“In Ondo State, we don’t have terrorism.\n“We have always preached the multi-level policing in Ondo State.\n“Things are changing and have really changed in Ondo state.\nOn open grazing, Akeredolu said nomadic pastoralist was a culture that must be discouraged in the interest of those involved."
  },
  {
    "headline": "APC stakeholders hail Fayemi’s three-year performance",
    "summarized_story": "By Yinusa IsholaSome Stakeholders of the All Progressives Congress (APC) in Moba Local Government Area, Ekiti have commended Governor Kayode Fayemi’s performance over the last three years.\nThey made the commendation during the celebration of Fayemi’s third year of his second term in office in Otun-Ekiti, headquarters of the council.\nThe gathering attracted political appointees, elected and career council officials, State and federal legislators, traditional rulers, traders, artisans, transport union members, party officials, among others.\n”It is a glaring fact that Moba local government area is largely indebted to the present administration, for having benefitted immensely from the Governor’s Midas touch across the wards and communities,” he said.\nFurthermore, he urged the people of the council to reciprocate the governor’s magnanimity through their continued support for the administration’s programmes, policies and initiatives."
  },
  {
    "headline": "Sheraton Hotels Expatriate GM Beats Up Nigerian Staff, Unions Kick",
    "summarized_story": "The General Manager of Sheraton Hotels in Nigeria has been fired and repatriated after a violent assault on a Nigerian employee at the hotel’s Lagos location, according to organized labor in the hospitality industry.\nAccording to Isola, the cluster’s managing director, Rex Nijof, turned the entire workforce to casuals and contract workers who are renewable every two years.\nA blatant rejection of the goodwill of the entire workers.\nAn action the entire workers considered a slight.\nEqually, the union accused him of giving the status of permanent staff to people he employed, while some casuals who have spent 10 years as casuals, are yet to be made staff."
  },
  {
    "headline": "JUST IN: Buhari arrives Saudi Arabia ahead of lesser Hajj, investment summit",
    "summarized_story": "President Muhammadu Buhari has arrived Riyadh, Saudi Arabia ahead of the investment conference organised by the Future Investment Initiative Institute.\nThe president was welcomed at the airport by a team of Saudi government and Nigerian Embassy officials, some cabinet ministers from Nigeria as well as some members of Nigerian community in Saudi Arabia.\nMr Shehu said the president would perform the lesser Hajj in Madinah and Makkah before returning to the country on Friday.\nThose accompanying the president on the trip include the Minister of Industry, Trade and Investment, Niyi Adebayo; Minister of Communications; Digital Economy, Isa Pantami, and Minister of State for Foreign Affairs, Zubairu Dada.\nOthers are the Minister of State for Petroleum Resources, Timipre Sylva; Director-General of National Intelligence Agency, Ahmed Rufai, and Managing Director of Nigerian Sovereign Investment Authority, Uche Orji."
  },
  {
    "headline": "Arabic School Torture: Probe Committee Submits Report To Govt",
    "summarized_story": "On Monday, Governor Abdulrahman Abdulrazaq in Ilorin received the report of an 11-man committee appointed by the Kwara State government to probe the abuse of several children at Misbaudeen Arabic School in Ganmo.\nWhile presenting the report, the committee’s Chairman, retired Justice Idris Haroon, expressed displeasure with the severity and manner of the punishment at the school.\nHe stated that the committee was established on October 15, 2021, and that it immediately began meeting till October 24, 2021.\nDuring the meetings, he added, the committee talked with the school’s management, employees, and students.\n“We are pleased that you have submitted your report in such a short time,” the governor added."
  },
  {
    "headline": "E-Naira Adds No Value To Nigeria’s Economy — Expert Faults FG",
    "summarized_story": "Following the debut of the much-anticipated digital currency, e-Naira, which is Africa’s first of its kind, a social justice expert has expressed worry.\nThe digital currency has the potential to boost economic growth through increasing economic activity, remittances, financial inclusion, and monetary policy effectiveness.\nOnyekpere complained to DAILY POST that the newly introduced e-Naira offers “no remarkable value” to the economy.\nThe CSJ Lead Director characterized the government’s recent step as “cosmetic,” and wondered what value the digital currency would add to the economy.\nHe said: “I think the important thing right now is what adds value to the economy in terms of job creation, stabilizing our currency, economic growth, and reducing the run on the Naira."
  },
  {
    "headline": "Sheikh Gumi to Yoruba, Igbo clerics: Talk to IPOB, Igboho as I talk to bandits",
    "summarized_story": "But when terrorists bandits are affected, he speaks.\nHow long shall a government that is after Igboho and Kanu continue tolerating the PR work Gumi is doing for terrorists bandits?\nWe have always preached the multi-level policing in Ondo state.\nThings are changing and have really changed in Ondo state.\nSpeaking on the recent ban on open grazing, Governor Akeredolu said the culture of nomadic pastoralist must be discouraged in the interest of those involved."
  },
  {
    "headline": "Leaked audio sparks off renewed calls for Shema’s speedy trial",
    "summarized_story": "A leaked audio conversation that has gone viral on the social media has caused renewed calls on the anti-graft agencies to intensify investigation into alleged financial misdeeds by former Katsina state Governor Ibrahim Sheu Shema.\nThe conversation has the ex-governor’s chief of staff, Husseini Dambo and a former caretaker committee chairman of Kankara local government council, Mallam Hadi Audu.\nShema was governor from 2007 to 2015 and currently being investigated by the Economic and Financial Crimes Commission(EFCC) for alleged embezzlement of N5.7 billion state funds.\nIn the audio conversation, Dambo obviously responding to prodding by Hadi, said the former governor is worth trillion of naira having allegedly diverted funds belonging to the Katsina state government.\nThe clips also revealed the duo as expressing angst over what they called the overbearing influence of the PDP chairman in the state, Mallam Salisu Majigiri."
  },
  {
    "headline": "eNaira ‘ll boost our GDP by $29bn in 10 years – Buhari",
    "summarized_story": "The adoption of the Central Bank Digital Currency (CBDC) and its underlying technology, called block chain, can increase Nigeria’s gross domestic product (GDP) by $29 billion over the next 10 years, President Muhammadu Buhari has said.\nThe president, who assured Nigerians of the safety and scalability of the CBDC system, said the journey to create a digital currency for Nigeria began sometime in 2017.\nThe president also explained to Nigerians why he approved the use of the digital currency.\n”It is on the basis of this that the Central Bank of Nigeria (CBN) sought and received my approval to explore issuing Nigeria’s own Central Bank Digital Currency, named the eNaira,’’ he said.\nThe eNaira and Naira will have the same value and will always be exchanged at 1 naira to 1 eNaira,” he said."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Farouq Bags award from Yusuf Sule Malta a University -NigPilot",
    "summarized_story": "The award was presented to her yesterday by the Faculty of Humanities at their 2nd International Conference themed “Nigeria in the 21st Century: Culture, State and Society.\nIn a statement signed by Nneka lkem Anibeze Special Advisal on media to the minister yesterday in Abuja said.\nIn her response, the Minister Umar Farouq thanked the Governing Council of the university for finding her worthy of an award.\nThe Minister expressed gratitude adding that the award will nudge her to further serve humanity through the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development.\n“It must be noted that all interventions, policies and frameworks being fashioned by the Ministry of Humanitarian Affairs, Disaster Management and Social Development have been created to support and improve the lives of Nigerians."
  },
  {
    "headline": "Desist from admitting National Diploma, part-time, JAMB warns institutions -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB has said that all applications for admissions to First Degree, National Diploma, National Innovation Diploma, and the Nigeria Certificate in Education into Full-Time, Distance Learning, Part-Time, Outreach, Sandwich, and others must be processed only through it.\nThe advisory warned institutions that are still involved in advertising or selling “application forms” for admissions into the programs listed above were advised to desist forthwith.\nIt, therefore, enjoined institutions to advise their candidates to apply to them through the Joint Admissions and Matriculation Board, adding that duplication of application forms is also NOT allowed.\n“ JAMB and the three Regulatory Agencies: (National Universities Commission (NUC), National Board for Technical Education (NBTE), and National Commission for Colleges of Education (NCCE) will ensure that all Tertiary Institutions comply with this policy directive.\nOther Professional Regulatory Agencies are also expected to play critical roles in sanitizing the process,” it said."
  },
  {
    "headline": "FG begins implementation of Ogoni cleanup, other projets to tackle environmental challenges -NigPilot",
    "summarized_story": "The Federal Ministry of Environment has said it is accelerating the implementation of various projects to address environmental challenges in the country.\nThe Minister of Environment, Sharon Ikeazor disclosed this at the meeting of the 15th National Council on Environment, NCE, held in Abuja, weekend.\nIkeazor said for Nigeria to realize the environment of her dream, it is imperative to consistently tackle environmental challenges such as climate change, deforestation, desert encroachment, loss of biodiversity, flood and erosion, environmental pollution amongst others.\nAnother strategy is the Implementation of a comprehensive program on the domestic use of Liquefied Petroleum Gas.\nThe Minister, therefore, urged National Council to critically appraise the emerging challenges faced by the environment while also acknowledging the opportunities that are inherent to be able to balance our actions towards achieving a sustainable environment."
  },
  {
    "headline": "FG selects six Universities for production of experts in procurement, others -NigPilot",
    "summarized_story": "Federal Government has selected six federal universities to host the Sustainable Procurement, Environmental and Social Standards Centres of Excellence , SPESSCEs, for the implementation.\nSPESSE also aims to establish strategic partnerships with leading international research funding, research performing and international capacity building organisations and top-performing institutions.\nThe Universities were: Abubakar Tafawa Balewa University, (ATBU), Bauchi; Ahmadu Bello University (ABU), Zaria; the Federal University of Agriculture, Makurdi (FUAM); the Federal University of Technology, Owerri (FUTO); University of Benin (UNIBEN) and University of Lagos (UNILAG).\nAccording to him, by developing curricula aligned with international standards, setting up the Centres of Excellence and supplying qualified professionals, SPESSE will improve, significantly, Nigeria’s capacity for procurement, environmental and social standards.\nRasheed commended the Vice-Chancellors of the selected universities for the key roles they played in developing the winning proposals and urged them to continue to support the Centres for the benefit of their universities, the Nigerian University System (NUS) and the country in general."
  },
  {
    "headline": "Alleged N7.1bn Fraud: FG Appeals Judgement Prohibiting Retrial Of Orji Uzor Kalu",
    "summarized_story": "The Federal Government has asked the Court of Appeal in Abuja, to order a fresh trial in an alleged N7.1billion laundering charge against the former Governor of Abia State, Senator Orji Uzor Kalu.\nThe government is asking the appellate court to set aside the September 29 judgement of the Federal High Court, Abuja, which prohibited it from retrying the former governor and his firm, Slok Nigeria Limited.\nJustice Ekwo held that the Supreme Court only ordered the retrial of former Director of Finance in Abia State, Jones Udeogu, who was the appellant before it.\nThe Supreme Court had ordered a retrial at the Federal High Court.\nBut Kalu who profited from the ruling to secure release from the Kuje Correctional Centre filed an application before the Federal High Court in Abuja to stop his retrial."
  },
  {
    "headline": "Soldiers Open Fire On Protesters In Sudan After Military Coup",
    "summarized_story": "Crowds protested into the night in Sudan Monday to denounce a military coup, with chaos engulfing the capital Khartoum after soldiers opened fire on demonstrators and reportedly killed three people.\nClashes erupted in the capital Khartoum after his speech, with the information ministry saying that soldiers had “fired live bullets on protesters rejecting the military coup outside the army headquarters”.\nThree protesters were killed and about 80 people wounded when soldiers opened fire, according to the independent Central Committee of Sudan Doctors.\nUN Secretary-General Antonio Guterres said in a statement the detention of the civilian leaders was “unlawful” and condemned “the ongoing military coup d’etat”.\n“We will not accept military rule, and we are ready to give our lives for the democratic transition in Sudan,” said one demonstrator, Haitham Mohamed."
  },
  {
    "headline": "[Video]: The Next World War Will Be Caused By Fake News – Lai Mohammed",
    "summarized_story": "The Minister of Information and Culture, Lai Mohammed, has warned against what he believes to be the growing trend of fake news, saying it can result in the next World War.\n“People of today, they don’t read newspapers, they don’t watch television — it’s social media.\n“I have always said it here that the next world war will be caused by fake news.\nIn February, the minister had said the use of social media in amplifying fake news had become a form of cancer.\n“If we do not take the issue of fake news, social media seriously, it will be at our own peril,” Mr Mohammed said at the time."
  },
  {
    "headline": "eNaira: Top Six Things You Should Know About CBN’s Digital Currency",
    "summarized_story": "President Muhammadu Buhari launched Nigeria’s digital currency at the Presidential Villa, Abuja on Monday.\nThe digital currency was billed to be unveiled on October 1 but was shifted due to other activities slated for the Independence Day celebration.\nHere are six things we all need to know about the e-Naira:Beyond CBDCAccording to the CBN, the e-Naira is not just another CBDC (Central Bank Digital Currency); the platform is said to be a people-oriented digital currency leveraging technology to connect individuals and businesses for easy trading and financial inclusion.\n“We are the foremost audience-centric digital currency brandishing a face,” the CBN noted on the e-Naira official website.\nIt also has an exclusive operational structure that is “both remarkable and nothing like other forms of central bank money,” CBN notes in its official page."
  },
  {
    "headline": "Japan’s Princess Mako Marries Years After ‘Pain’ Of Rumours",
    "summarized_story": "Japan’s Princess Mako married her university sweetheart on Tuesday, but it was a low-key union bereft of traditional rituals, with the couple voicing sadness over the controversy that haunted their engagement.\nOur marriage is a necessary step for us to be able to protect our hearts,” she told reporters after the marriage was registered.\n“I have been scared, feeling sadness and pain whenever one-sided rumours turn into groundless stories,” she added as the newlyweds read out rehearsed statements in a soberly decorated hotel function room.\nMako also turned down a large payment usually offered to royal women on their departure, reportedly up to 153 million yen ($1.35 million), and they are now said to be planning a move to the United States.\nIt is not clear if Mako will work, but she is well qualified, having studied art and cultural heritage at Tokyo’s International Christian University."
  },
  {
    "headline": "Committee on corporal punishment in Arabic school submits report -",
    "summarized_story": "The 11-person committee set up by the Kwara State Government to investigate the corporal punishment meted to some Arabic school students in Ganmo has submitted its report.Presenting the report to Governor AbdulRahman AbdulRazaq on Monday, chairman of the committee and former Grand Kadi of the state Justice Idris Haroon said their recommendations included an appeal to the government to immediately set up the Arabic Board to regulate the activities of Arabic and Islamic schools.\nThe Committee said it frowns at the magnitude and manner in which the punishment was carried out at the Arabic school and said steps must be taken to ensure that corrective measures are moderate and better implemented.\nGovernor AbdulRahman AbdulRazaq said the government will study and implement the report for the benefits of the society, including the setting up of the Arabic Board.\nHe said the government understands the delicate nature of the issues involved, hence the invitation of experts in the field to look into the issue."
  },
  {
    "headline": "Sokoto Exco approves N12bn for roads construction, agricultural Scheme -",
    "summarized_story": "Sokoto state government has approved the sum of twelve billion naira for the execution of roads constructions projects, finance agricultural schemes for economic self-reliant and boost food Production.\nThe approval followed a state executive council meeting presided sover by the state governor Aminu Tambuwal at the state executive council chambers..\nAt a resume sitting of the council presided over by the state Deputy Governor, Muhammad Manir Dan’Iya, the council also approved the sum of four billion naira for agricultural development programme.\nThe Commissioner said a total of sixteen thousand eight hundred and seventy six farmers are expected to benefit from the scheme.\nJunaid said the programme will cover rice, wheat and Tomatoes farmers and will be supervised by the state advisory committee and approved consultants."
  },
  {
    "headline": "Four killed, three injured as locals, herders clash in Zango Kataf LGA -",
    "summarized_story": "At least four persons have been reportedly killed and three others injured in brutal clash between some locals and herders in Zango Kataf Local Government Area, that’s in Kaduna State.\nAccording to reports by the security authoritues the clash occurred along cattle routes in Jankasa village in Zangon Kataf Local council and later escalated into a fierce fire exchange between the two groups before the arrival of security operatives.\nThis was confirmed by the Commissioner for Internal Security and Home Affairs in Kaduna State, Samuel Aruwan, in a security report on Monday.\nMr Samuel Aruwan pointed out that 13 cows were killed and troops recovered 25 others.\nReceiving the report, Governor Nasir El-Rufai condemned the incident and prayed for the repose of the souls of those killed."
  },
  {
    "headline": "Gunmen kill 18 persons in attack on Niger community",
    "summarized_story": "No fewer than 18 persons were reportedly killed in the early hours of Monday by armed gunmen at Maza-Kuka in Mashegu local government council of Niger state.\nThe armed men in their numbers stormed a mosque in the community while the victims were performing their morning prayers.\nAccording to reports, the attackers shot sporadically on the victims at closed range inside mosque leading to the death of scores leaving many others injured.\nIt was gathered that the armed men came on motorbikes to carry out the attack on the villagersThe Niger state police command is yet to confirm this attack."
  },
  {
    "headline": "Nigeria Condemns Coup in Sudan, Calls for Immediate Restoration of Civil Rule",
    "summarized_story": "The Nigerian government has condemned the coup d’état in Sudan, calling for the immediate restoration of civil rule and release of ousted Prime Minister and all other political leaders from arrest.\nA signed statement on Monday by the Spokesperson of the Ministry of Foreign Affairs, Mrs. Esther Sunsuwa read that: “The Ministry of Foreign Affairs of the Federal Republic of Nigeria stronglycondemns the coup d’état that has taken place today in Sudan, in which the militaryhas dissolved the civilian component of the transitional government and arrested its leaders.\n“The Ministry of Foreign Affairs calls for the immediate release of the Prime Minister and all political prisoners and an immediate restoration of the transitionalgovernment and implementation of the agreed roadmap to return the country toconstitutional democracy.”Michael Olugbode in Abuja"
  },
  {
    "headline": "Nigeria’s Drug Addiction Three Times More Than Global Average, Says NDLEA Boss Marwa",
    "summarized_story": "Chairman/Chief Executive of Nigeria’s National Drug Law Enforcement Agency (NDLEA), Brig.\nGen. Buba Marwa (Retd) has lamented that Nigeria’s drug addiction is thrice the global average.\nOn such occasion, your training will be called to test.”In his remarks, Commandant, Nigerian Army School of Infantry, Maj. Gen. M.G.\nAli, commended Marwa for repositioning NDLEA for efficiency and relevance within the country’s security architecture.\nHe said the training, as the first of its kind will enhance the Agency’s capability to handle more complex challenges in its task of tackling drug barons and cartels."
  },
  {
    "headline": "US: Shopping Mall Shooting in Idaho Leaves 2 Dead, 4 Injured",
    "summarized_story": "Two people were killed and four others, including a police officer, were injured on Monday in a shooting at a shopping center in Boise, Idaho, that ended with the lone suspect taken into custody, authorities said.\nOfficial details of the bloodshed were sketchy, but Boise Police Chief Ryan Lee told reporters at a briefing that police responded to reports of a shooting at the Boise Towne Square mall shortly before 2 p.m. local time.\nNo information about the suspect was given, nor were any of the victims identified.\nBoise Towne Square is located on the western end Idaho’s capital and its most populous metropolitan area, a city of some 250,000 residents.\n“We believe there was only a single shooter involved, and there is no ongoing threat to the community at large,” Lee said."
  },
  {
    "headline": "Overcoming Scandal and PTSD, Japan’s Princess Mako Finally Marries College Sweetheart",
    "summarized_story": "Japan’s Princess Mako, the emperor’s niece, has married her commoner college sweetheart on Tuesday and left the royal family after a years-long engagement beset by scrutiny that has left the princess with post-traumatic stress disorder (PTSD).\nMako and fiance Kei Komuro, both 30, announced their engagement four years ago, a move initially cheered by the country.\nBut things soon turned sour as tabloids reported on a money scandal involving Komuro’s mother, prompting the press to turn on him.\nThe marriage was postponed, and he left Japan for law studies in New York in 2018 only to return in September.\nThough Mako bowed formally to her parents, her sister grabbed her shoulders and the two shared a long embrace."
  },
  {
    "headline": "Nigeria: NSA Monguno Warns IPOB Not to Disrupt Anambra Election",
    "summarized_story": "The National Security Adviser (NSA), Major General Babagana Monguno, on Monday, warned that nobody or group should test the resolve by the federal government to guarantee the November 6 gubernatorial election in Anambra State.\nThe REC for Anambra State is here to fully provide an update on the implementation of other activities and INEC’s general state of readiness for the election.\n“INEC is determined to proceed with the Anambra State Governorship election as scheduled.\n“I am sure the Commissioner Police, Anambra State, in his briefing, will provide more details regarding preparations on the ground.\nWe are confident that this will be replicated in Anambra State,” Yakubu said."
  }
]