[
  {
    "headline": "Researchers caution against adding salt to foods, say it can reduce life expectancy, cause death",
    "summarized_story": "Oluwatobiloba JaiyeolaResearchers at Tulane University, United States, have cautioned against adding extra salt to food at the table, noting that it could increase the risk of untimely death and lower life expectancy.\n“To my knowledge, our study is the first to assess the relationship between adding salt to foods and premature death.\nThe researchers noted that the information on the frequency of adding salt to foods did not include salt used in cooking.\nThe study also revealed that adding salt to food was linked to a lower life expectancy.\n“Our findings indicate that higher frequency of adding salt to foods is associated with a higher hazard of all-cause premature mortality and lower life expectancy.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Researchers caution against adding salt to foods, say it can reduce life expectancy, cause death",
    "summarized_story": "Oluwatobiloba JaiyeolaResearchers at Tulane University, United States, have cautioned against adding extra salt to food at the table, noting that it could increase the risk of untimely death and lower life expectancy.\n“To my knowledge, our study is the first to assess the relationship between adding salt to foods and premature death.\nThe researchers noted that the information on the frequency of adding salt to foods did not include salt used in cooking.\nThe study also revealed that adding salt to food was linked to a lower life expectancy.\n“Our findings indicate that higher frequency of adding salt to foods is associated with a higher hazard of all-cause premature mortality and lower life expectancy.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "WHO reports 9,200 monkeypox cases from 63 countries",
    "summarized_story": "Oluwatobiloba JaiyeolaThe World Health Organisation has said that about 9,200 cases of monkeypox have been recorded in 63 countries worldwide.\nThe WHO said the spike in cases of monkeypox has made the need for an emergency meeting by the Emergency Committee for monkeypox necessary, to discuss the spread of the virus.\nThe Director-General of the WHO, Dr. Tedros Ghebreyesus disclosed this on Wednesday, via tweets posted on the official Twitter handle of the global health agency.\n“Second, WHO continues to work with countries and vaccine manufacturers to coordinate the sharing of vaccines, which are currently scarce.\n“Third, WHO continues to work with countries and experts to drive forward research and development,” he said."
  },
  {
    "headline": "WHO reports 9,200 monkeypox cases from 63 countries",
    "summarized_story": "Oluwatobiloba JaiyeolaThe World Health Organisation has said that about 9,200 cases of monkeypox have been recorded in 63 countries worldwide.\nThe WHO said the spike in cases of monkeypox has made the need for an emergency meeting by the Emergency Committee for monkeypox necessary, to discuss the spread of the virus.\nThe Director-General of the WHO, Dr. Tedros Ghebreyesus disclosed this on Wednesday, via tweets posted on the official Twitter handle of the global health agency.\n“Second, WHO continues to work with countries and vaccine manufacturers to coordinate the sharing of vaccines, which are currently scarce.\n“Third, WHO continues to work with countries and experts to drive forward research and development,” he said."
  },
  {
    "headline": "Governors, lawmakers responsible for challenges in the north — Nastura, CNG",
    "summarized_story": "By Ogalah IbrahimThe Coalition of Northern Groups (CNG) has blamed Northern Governors, law makers and council leaders for the challenges bedeviling the north.\nNastura expressed dissastisfaction over how Nigerian governors’ hijack and mismanage the local government allocation from the Federal government leaving those at the grassroot to suffer untold hardship.\nIt’s obvious that such a speaker was brought to answer “yes sir” to the Governor’s whim and caprices.\n“Some of those representing us only goes to the state and national assembly offices when they need to sign and collect money only.\n“With the right people elected into the state and national assembly, there’s no way a Governor will dare toy with the needs of the masses."
  },
  {
    "headline": "Ondo commissioner resigns hours after cabinet reshuffle",
    "summarized_story": "Ondo State Commissioner for Physical Planning and Urban Development, Mrs Yetunde Adeyanju has resigned her appointment after a minor cabinet reshuffle by Gov.\nOluwarotimi Akeredolu of Ondo State.\nAdeyanju, who was on Wednesday redeployed from the Ministry of Water and Sanitation, to the Ministry of Physical Planning and Urban Development, tendered her resignation letter shortly after Akeredolu announced the reshuffle of his cabinet.\nAdeyanju, in a copy of the letter tagged “Resignation of Appointment” made available to newsmen hours after the cabinet reshuffle, appreciated the governor for the opportunity to serve the people of Ondo state.\nThe letter directed to the governor Akeredolu reads, “I hereby resign my appointment as a Commissioner in Ondo State with immediate effect."
  },
  {
    "headline": "Nigerians to access affordable surgical care — FG",
    "summarized_story": "Dr Deborah Bitrus-Oghoghorie, Consultant Grade 1, Federal Ministry of Health, Hospital Services, has said that Nigerians would began to access affordable surgical care.\nShe said that NSOANP had to do with providing affordable, accessible and safe surgery to Nigerians that need it as part of universal health coverage.\nShe said that World Health Assembly Resolution 68:15 says Surgical, Obstetrics, Anesthesia and Nursing care are important components of Universal Health Coverage.\nShe said that Universal Health Coverage (UHC) is complete when surgeries are fully integrated into healthcare services.\nShe said prevention was also possible for surgery in that one should present early with ones surgical conditions."
  },
  {
    "headline": "How flood swept away 3 siblings, 4 others in Lagos, Ogun",
    "summarized_story": "Vanguard gathered that in a bid to rescue Timi, Michael and Elizabeth were equally swept away.\n“The rest of the siblings while trying to rescue their sibling were also swept away.\nMeanwhile, residents of Oko-Oba, in Lagos have continued the search and rescue for one of the victims who were swept away by flood on Sallah Day.\nWhile Lagos residents were counting their losses, the NEMA Coordinator said two persons were swept away in Ogun while another was rescued.\n“Another two male adults were swept away while trying to cross over a road along Alagbole – Akute Road by Four Gate Hotel, Akute in Ogun State, a border community to Lagos State."
  },
  {
    "headline": "Educate yourselves to overcome poverty — Buhari challenges youths",
    "summarized_story": "At that point, I realised and I told my children that your net worth is what is in your head, not what you have acquired in life.\nI told my children, particularly the girls, that they can only get married after getting a first degree.\n“No government in the history of this country has done more to reduce poverty like President Buhari’s administration.\nMasari said security in the country had improved considerably, compared to when the President came into power.\nThe Emir of Daura thanked the president for the infrastructural and institutional developments in the state, saying generations would remember and remain grateful to President Buhari."
  },
  {
    "headline": "2023: Why Kwankwaso, Kachikwu’s names are missing on portal – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) has said the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP) are yet to upload details of their governorship candidates on the electoral body’s nomination portal.\nWhile Rabiu Musa Kwankwaso is the NNPP presidential candidate, Dumebi Kachikwu is ADC flag bearer.\nParties are expected to put up the names of their candidates for the governorship and state assembly elections by July 15.\n“However, two political parties, the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP), are yet to upload a single nomination to the portal.\n“The Commission hereby reminds all political parties that they have three days left to upload their list of candidates to the ICNP."
  },
  {
    "headline": "Edo govt urged to return St. Maria Goretti Girls School to Catholic mission",
    "summarized_story": "The Class of 1982 of Saint Maria Goretti Girls Grammar School Benin City have pleaded with the Edo State Government to consider returning the school to the Catholic Mission to enhance the education of the girl child.\nThe old students, under the auspices of Saint Maria Goretti Old Girls’ Association (SMAGOGA), made the passionate appeal in Lagos recently where they marked their 40 years reunion after leaving school.\nShe said the association looks forward to the time when the school will be returned to the Catholic mission.\nSaint Maria Goretti Girls’ Grammar School was founded on March 4, 1959, by the Catholic Mission.\nSt Maria Goretti Girls Grammar School in its heydays, under the Catholic Mission, was the school of choice for people, who wanted an all-round spiritual, moral, vocational and academic development for the girl child."
  },
  {
    "headline": "2023 presidency: Peter Obi, Baba-Ahmed have nothing to offer – Adegboruwa",
    "summarized_story": "Legal practitioner, Ebun-Olu Adegboruwa says he is not impressed with the Peter Obi – Baba-Ahmed candidacy.\nThe former governor and ex-lawmaker are running for the 2023 presidency under the Labour Party (LP) ticket.\nThe Senior Advocate of Nigeria (SAN) said Obi and Baba-Ahmed used their financial prowess “to corner a ticket meant for genuine representatives of the working class”.\n“What does Peter Obi offer or represent in present-day Nigeria other than ethnic and religious sentiments?\nAdegboruwa also chided LP promoters – Nigeria Labour Congress (NLC) – for failing to engage in meaningful struggle since the APC assumed power."
  },
  {
    "headline": "NSCDC rescues girl locked up for eight years in Kaduna",
    "summarized_story": "The Nigerian Security and Civil Defense Corps (NSCDC), Kaduna State Command, on Wednesday, said its operatives rescued a girl who was chained and locked up in a room for eight years by her mother.\nDSC Habeeb Badamasi, Spokesperson for NSCDC, who confirmed this to newsmen in Kaduna, said the victims had health-related issues such as psychiatric complications and trauma.\nAlso, speaking, Hajiya Hapsat Baba, the Kaduna State Commissioner of Human Services and Social Development, said she was informed of Hauwa’s ordeal by one Rukaiya Sani and immediately reached out to NSCDC where she was rescued.\n“Right now, she’s at a hospital where she’s been rehabilitated; thereafter, we’ll seek psychiatric care at a tertiary hospital.\n“She was put in this condition by her mother, but that’ll not stop us from prosecuting whoever is involved according to the laws of the state,” she said."
  },
  {
    "headline": "Ondo Commissioner, Adeyanju resigns hours after cabinet reshuffle",
    "summarized_story": "Mrs. Yetunde Adeyanju, a Commissioner in the Ondo state Government, has resigned her appointment in the Governor Oluwarotimi Akeredolu administration.\nAfter being transferred on Monday from the Ministry of Water and Sanitation to the Ministry of Physical Planning and Urban Development, Mrs. Adeyanju submitted her letter of resignation hours after she was reassigned to another ministry.\nIn a copy of her resignation letter obtained by DAILY POST, Adeyanju appreciated Akeredolu for the opportunity given to serve the people of Ondo state.\nThe content of the letter reads, “I hereby resign my appointment as a Commissioner in Ondo State with immediate effect.\n“You gave me the platform and I’m proud that I used it well for the good of humanity.”"
  },
  {
    "headline": "Okowa, Tambuwal, Diri meet Oyinlola, Babayemi faction ahead PDP mega rally The Nation Newspaper",
    "summarized_story": "Peoples Democratic Party (PDP) Vice Presidential candidate Governor Ifeanyi Okowa; Sokoto Governor Aminu Tambuwal and his Bayelsa counterpart Douye Diri held a closed-door meeting with former Osun Governor Prince Olagunsoye Oyinlola and Dotun Babayemi’s faction for reconciliation ahead of the party’s mega rally for Saturday’s Osun Gov rally.\nSources disclosed that Okowa appealed that to the aggrieved members and elders to support the party despite ill-fighting.\nDiri apologised to the aggrieved elders for coming for reconciliation a day to mega rally of the PDP in Osun.\nThe Vice President and other 3 governors have listened to us and have promised us immediate action.\nPDP is the party the masses are yearning for they have tasted 2 wives and they know which is better."
  },
  {
    "headline": "Ondo Commissioner resigns hours after redeployment The Nation Newspaper",
    "summarized_story": "Ondo Commissioner for Ministry of Water and Sanitation, Mrs Yetinde Adeyanju, has resigned.\nAdeyanju tendered her resignation few hours after she was redeployed to the Ministry of Physical Planning and Urban Development.\nOn her resignation letter, Adeyanju explained that she left to explore other endeavours outside politics for now.\nThe letter reads: “I hereby resign my appointment as a Commissioner in Ondo State with immediate effect.\n“My decision is predicated on a personal conviction to explore other endeavours outside politics for now."
  },
  {
    "headline": "Police arrest fleeing Kuje prison inmate in Ogun The Nation Newspaper",
    "summarized_story": "The Police in Ogun State have arrested one of the inmates that fled Kuje Medium Custodial facility after last week’s terrorists attack.\nYakubu AbdulMumuni, 28, was arrested on Monday Morning at Sango Ota after a tip-off from people who sighted him.\nOyeyemi said: “One of the Kuje Correctional Center escapees was on Monday July 11, arrested by operatives of Ogun State Police Command.\n“He confessed to the police that he escaped from Kuje Correctional Center on July 5, when the center was attacked by bandits.\nHe stated further that he was convicted by Kogi State High Court for offences of conspiracy and culpable homicide and sent to Kuje Correctional Center."
  },
  {
    "headline": "I'm a proud prostitute, says Tacha The Nation Newspaper",
    "summarized_story": "Reality TV star-turned-actress Natacha Akide aka Tacha has declared she is a proud prostitute.\nTacha made this declaration while affirming the assertion of a tweep concerning the relationship that exists between beautiful girls and prostitution.\nThe tweep had noted “Prostitution starts when a girl thinks she’s too beautiful to suffer.”Reacting, the former BBNaija “Pepper Dem” housemate, wittily admitted to the tweep’s submission, noting she’s a proud prostitute.\n“That must make me a proud prostitute.\nLOL,” Tacha wrote."
  },
  {
    "headline": "Sola Sobowale jubilates, lands first Bollywood role The Nation Newspaper",
    "summarized_story": "Veteran actress Sola Sobowale is beyond ecstatic after landing her first role in Indian film industry, Bollywood.\nThe excited thespian took to her Instagram page to inform fans that she would be working with Hamisha, Daryani Ahuja, a record-breaking Director/Executive Producer.\n“I am so excited to announce that I will be working with record-breaking Director/Exec Producer, @HamishaDaryaniAhuja on her upcoming project!\n“And… get this….we will be going to India to film!\nI will be playing a very dynamic role in this project and cannot wait for you to watch it."
  },
  {
    "headline": "More trouble for APC over Muslim-Muslim ticket",
    "summarized_story": "One day, the same people promoting this will insist on North-North Muslim-Muslim ticket.\n“In 1993 when people voted for Muslim-Muslim ticket, can you compare Nigeria of that time with Nigeria of today?\nIf Nigerians vote for Muslim-Muslim ticket, and they get to power, whatever happens, they ask for it; CAN has said its own.\n“Therefore, I declare the Muslim-Muslim ticket barbaric and unacceptable.\nLawal, in a lengthy statement he personally signed, called on the leadership of the APC and President Buhari, to reject a Muslim-Muslim ticket."
  },
  {
    "headline": "Lagos flood kills 7, auto crash claims 4 in Ondo",
    "summarized_story": "From Bamigbola Gbolagunte, AkureFour people, including a commercial driver, yesterday, lost their lives in a fatal road accident which occurred along Olokuta-Shasha road in Akure, the Ondo state capital.\nMeanwhile, the National Emergency Management Agency (NEMA) said that last week’s flooding which occurred in Lagos claimed seven lives.\nThe agency’s Zonal Coordinator, South West, Mr Ibrahim Farinloye, made the disclosure in a statement in Lagos, yesterday.\nThe coordinator added that the remaining two, while trying to rescue their sibling, were also swept away by the flood.\nFarinloye also gave an update on the flood at Oyatoki in Orile Agege, saying that two people died, while four were rescued."
  },
  {
    "headline": "FG to ASUU: Buhari doesn’t sign collective bargaining agreement",
    "summarized_story": "Federal Government has stated that there is no Collective Bargaining Agreement (CBA) between it and the Academic Staff Union of Universities (ASUU) which currently awaits signing by the President.\n“This clarification has become necessary in view of the deluge of deliberate misinformation being dished out to Nigerians by the President of ASUU, Prof. Osodeke as well as his branch leaders, calling on President Buhari to sign an agreement which they claimed to have reached with the Federal Government.\n“We wish therefore to inform Nigerians that there is no such Collective Bargaining Agreement(CBA) that has been reached between the Federal Government, ASUU and other university unions on the renegotiation of their salaries and allowances(wages).\nWhat is in existence is a proposal.\nEven when such CBA is made , it is not the President that signs it."
  },
  {
    "headline": "Udom picks hole in PIA, says it marginalises Niger Delta",
    "summarized_story": "“Most worrisome is Section 6(2a) of the recent Nigerian Host Community Development Regulations unveiled on Tuesday, June 28, 2022 which gives only 500 metres as distance to determine host communities appurtenances to deep water areas of operation.\nThese events impose hardship on the health and livelihood of the people.\nIt is expected that if Section 104(4) is implemented to the letter, it would provide funds to remediate the environment in order to cushion the effects of pollution occasioned by oil spills on the people.\n“Therefore, I will advocate that the ‘commission’ and the ‘authority’ should be proactive in ensuring that degraded environments in host communities are well remediated and the ecosystem restored,” the governor said.\nCommissioner for Power and Petroleum Development, John Etim, whose ministry organised the workshop, explained that most stakeholders of the host communitiesunveiling of the Upstream Petroleum Host Community Regulations on Tuesday, June 28, 2022, which our people have to know to enable them to make informed decisions."
  },
  {
    "headline": "Police arrest suspected Kuje prison escapee in Ogun",
    "summarized_story": "The police in Ogun State, yesterday, said they have arrested a suspected Kuje prison escapee, Yakubu Abdulmumuni, at the Sango-Ota area of the state.\nOyeyemi explained that Abdulmumuni, aged 28, was arrested following information received by policemen at Divisional Headquarters, Sango-Ota, that the convict was sighted around the area.\nThe convict confessed to the police that he escaped from Kuje Correctional centre on July 5, when the centre was attacked by bandits.\n“Abdulmumuni stated further that he was convicted by Kogi state High Court for the offence of conspiracy and culpable homicide, and sent to Kuje Correctional Centre,” Oyeyemi said.\nHe said that the Commissioner of Police in the state, Mr Lanre Bankole, had ordered the Criminal Investigation Department to transfer the convict to the Correctional Centre with immediate effect."
  },
  {
    "headline": "WHAT WILL SAVE NIGERIANS NOW? – THISDAYLIVE",
    "summarized_story": "This title could easily have read, “Who Will Save Nigeria Now?” For most people, the answer would most probably be twofold: God and government officials.\nOnly very few Nigerians do not profess one or two of the three major religions in the country namely, Christianity, Islam and traditional African religion, with the first two being monotheistic.\nUbiquitous and imposing structures that serve as places of worship, including government-sponsored National Ecumenical Centre and National Mosque in the heart of the Federal Capital Territory.\nSo, seeing God as the one who can deliver the country from its troubles is always in the estimation of the populace.\nProperly managing this transition period and giving Nigerians something to hope for should be your preoccupation now, not thoughts of retirement."
  },
  {
    "headline": "ON THE ONDO FAITH TRAVESTY – THISDAYLIVE",
    "summarized_story": "Many church goers are increasingly being manipulated by their so-called pastorsA total of 77 persons, including 26 children, were recently rescued by police officers from the basement of a church in Ondo State.\nBut there is also the more insidious criminal exploitation of these weaknesses by a new crop of crude faith merchants of all hues.\nMass imprisonment of vulnerable citizens including children under the dubious pretense that they are on their way to heaven is an exploitation of faith to deny innocent citizens their freedom under whatever guise.\nYet we must stress that worship is different from willful mass submission to captivity based on foolish manipulation of faith.\nThe Ondo State police command has its case clearly cut out in this matter."
  },
  {
    "headline": "PatrickGold Bank Launches Digital Banking Platform – THISDAYLIVE",
    "summarized_story": "Kemi OlaitanPatrickGold Micro Finance Bank, has launched a digital banking platform, GetriPay, to promote the ease of financial inclusion for the populace.\nThe new platform launched alongside GetriSave, promised a big boost in ease of fund transfer, bills payment, loan accessibility, savings and transaction rewards.\nAccording to him, “For the record, we are here to revolutionise digital banking with amazing rewards for our customers and we will prove this to Nigerians.\n“Customers would also enjoy 15 free transfers monthly to any Nigerian banks alongside free fund transfers from accumulated points.\nWe also give loyalty rewards on savings every 30 days.”The PatrickGold Micro Finance Bank, licensed by the Central Bank of Nigeria (CBN) and with deposits insured by the Nigeria Deposit Insurance Corporation (NDDC), has as its partners Nigeria Inter-Bank Settlement System Plc, Interswitch, Zenith Bank and Flutterwave, among others."
  },
  {
    "headline": "LAGOS, RAINS AND FLOODING – THISDAYLIVE",
    "summarized_story": "If this is put alongside the volume of rain being experienced lately, it might be difficult to rule out flash flooding, especially in some areas.\nRecent developments have authenticated this position, especially about the volume of rains being experienced across the country.\nThis often results in blockage of free flow of wastewater, resulting in flash flooding whenever it rains.\nConsequently, its approach to tackling the issue of flooding in the state is multi-faceted and multi-dimensional.\nAs already stressed, being a coastal city, Lagos is naturally prone to flash flooding."
  },
  {
    "headline": "CHIDOKA: NO EASY MARK AT 51 – THISDAYLIVE",
    "summarized_story": "Pat Onukwuli pays tribute to Osita Chidoka, former Minister of AviationHe easily comes across as brilliant and urbane.\nThere is sufficient proof of this with his appointment to the Federal Road Safety Corps and the Ministry of Aviation, especially the former.\nBarely one month to his 36th birthday, he was appointed to the headship of the Federal Road Safety Corps (FRSC) where he was saddled with responsibility of managing the safety of Nigerians on the road and contending with road hogs on the wheel.\nChidoka is one of the few Igbo political leaders who openly endorse the rights of the Indigenous People of Biafra (IPOB) to peaceful agitation.\nThere is no doubt that Chidoka like a few others has a lot to offer Nigeria if called upon to do so."
  },
  {
    "headline": "FLASHBACK: How Tinubu’s Running Mate, Shettima’s Government In Borno Contributed To Abduction Of Chibok Schoolgirls By Boko Haram In 2014",
    "summarized_story": "On April 14, 2014, the schoolgirls were abducted when insurgents attacked the Government Girls’ Secondary School (GGSS) in Chibok, Borno State.\nIt, however, had to buckle when Shettima assured the Council, in writing, that adequate security would be provided.\n“We also asked the various state governments to relocate all the centres to the state capitals where there would be adequate security.\n“The three governors did not respond to our request but instead said they had made adequate security arrangements.\n“Borno State government only agreed to relocate the remaining 189 pupils after the abduction of the girls,” he said."
  },
  {
    "headline": "FLASHBACK: How Tinubu’s Running Mate, Shettima’s Government In Borno Contributed To Abduction Of Chibok Schoolgirls By Boko Haram In 2014",
    "summarized_story": "On April 14, 2014, the schoolgirls were abducted when insurgents attacked the Government Girls’ Secondary School (GGSS) in Chibok, Borno State.\nIt, however, had to buckle when Shettima assured the Council, in writing, that adequate security would be provided.\n“We also asked the various state governments to relocate all the centres to the state capitals where there would be adequate security.\n“The three governors did not respond to our request but instead said they had made adequate security arrangements.\n“Borno State government only agreed to relocate the remaining 189 pupils after the abduction of the girls,” he said."
  },
  {
    "headline": "FLASHBACK: How Tinubu’s Running Mate, Shettima’s Government In Borno Contributed To Abduction Of Chibok Schoolgirls By Boko Haram In 2014",
    "summarized_story": "On April 14, 2014, the schoolgirls were abducted when insurgents attacked the Government Girls’ Secondary School (GGSS) in Chibok, Borno State.\nIt, however, had to buckle when Shettima assured the Council, in writing, that adequate security would be provided.\n“We also asked the various state governments to relocate all the centres to the state capitals where there would be adequate security.\n“The three governors did not respond to our request but instead said they had made adequate security arrangements.\n“Borno State government only agreed to relocate the remaining 189 pupils after the abduction of the girls,” he said."
  },
  {
    "headline": "Lagos Newly Created Agency Imposes Millions Of Naira Tax On Car Park Operators",
    "summarized_story": "The newly-created Lagos State Parking Authority (LASPA) has taken over open parking spaces in the state.\nThe government had claimed it created the agency to enforce parking violations and offences in the state.\nIn a document seen by SaharaReporters, park operators (commercial) were asked to pay to between N2million and N23million annually, depending on the location as “license” fee.\nSaharaReporters learnt that the government had started serving notices of trespass on landmarks that were not on government roads.\n“The Lagos State government has commenced exploration of off street parking lots operators again under the state's illegal LASPA agency,” a resident said."
  },
  {
    "headline": "Lagos Newly Created Agency Imposes Millions Of Naira Tax On Car Park Operators",
    "summarized_story": "The newly-created Lagos State Parking Authority (LASPA) has taken over open parking spaces in the state.\nThe government had claimed it created the agency to enforce parking violations and offences in the state.\nIn a document seen by SaharaReporters, park operators (commercial) were asked to pay to between N2million and N23million annually, depending on the location as “license” fee.\nSaharaReporters learnt that the government had started serving notices of trespass on landmarks that were not on government roads.\n“The Lagos State government has commenced exploration of off street parking lots operators again under the state's illegal LASPA agency,” a resident said."
  },
  {
    "headline": "Kaduna PFN faults Muslim-Muslim ticket, says it portrays Nigeria in bad light",
    "summarized_story": "The Kaduna state chapter of the Pentecostal Fellowship of Nigeria (PFN) says the Muslim-Muslim ticket fielded by the All Progressives Congress (APC) showcases the country “in a bad light”.\nBola Tinubu, APC presidential candidate, on July 10, announced Kashim Shettima, former governor of Borno, as his running mate.\nAdvertisementIn a statement issued on Wednesday, Emmanuel Bako, Kaduna state chairman of PFN, said the Muslim-Muslim ticket has the “potency” to further polarise the country.\n“I have noticed with great dismay the consistent disregard for our heterogeneous nature in Nigeria by our political players.\n“Therefore, I declare the Muslim-Muslim ticket unacceptable."
  },
  {
    "headline": "Kaduna PFN faults Muslim-Muslim ticket, says it portrays Nigeria in bad light",
    "summarized_story": "The Kaduna state chapter of the Pentecostal Fellowship of Nigeria (PFN) says the Muslim-Muslim ticket fielded by the All Progressives Congress (APC) showcases the country “in a bad light”.\nBola Tinubu, APC presidential candidate, on July 10, announced Kashim Shettima, former governor of Borno, as his running mate.\nAdvertisementIn a statement issued on Wednesday, Emmanuel Bako, Kaduna state chairman of PFN, said the Muslim-Muslim ticket has the “potency” to further polarise the country.\n“I have noticed with great dismay the consistent disregard for our heterogeneous nature in Nigeria by our political players.\n“Therefore, I declare the Muslim-Muslim ticket unacceptable."
  },
  {
    "headline": "INEC: AAC, NNPP yet to upload governorship candidates' details on nomination portal",
    "summarized_story": "The Independent National Electoral Commission (INEC) says the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP) are yet to upload details of their governorship candidates on the commission’s nomination portal.\nINEC said it has so far processed 6,995 nomination forms uploaded by 16 out of 18 political parties for the constituencies where they intend to sponsor candidates.\nAdvertisement“However, two political parties, the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP), are yet to upload a single nomination to the portal,” the statement reads.\n“The Commission hereby reminds all political parties that they have three days left to upload their list of candidates to the ICNP.\nAdvertisement“Sadly, in spite of the Commission’s effort, 147 out of 476 requests processed as at today involving 5,646 pages are yet to be collected by applicants."
  },
  {
    "headline": "INEC: AAC, NNPP yet to upload governorship candidates' details on nomination portal",
    "summarized_story": "The Independent National Electoral Commission (INEC) says the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP) are yet to upload details of their governorship candidates on the commission’s nomination portal.\nINEC said it has so far processed 6,995 nomination forms uploaded by 16 out of 18 political parties for the constituencies where they intend to sponsor candidates.\nAdvertisement“However, two political parties, the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP), are yet to upload a single nomination to the portal,” the statement reads.\n“The Commission hereby reminds all political parties that they have three days left to upload their list of candidates to the ICNP.\nAdvertisement“Sadly, in spite of the Commission’s effort, 147 out of 476 requests processed as at today involving 5,646 pages are yet to be collected by applicants."
  },
  {
    "headline": "Pope appoints women as members of bishops' advisory committee -- first time ever",
    "summarized_story": "Pope Francis has named three women as members of the Catholic dicastery for bishops.\nThe members of the dicastery assist in the selection of bishops for dioceses, and they also conduct analyses on position papers regarding opinions on candidates.\nThe three women were among 14 other people appointed to the dicastery for bishops and the appointment lasts for five yearsAdvertisementThe other 11 appointed on Wednesday are cardinals, bishops and priests.\nMeanwhile, the development comes months after Petrini was appointed as the first female secretary-general of the governorate of Vatican city state.\nThe secretary-general is the “second-ranking position in the government of the Vatican City State”."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "What to look for in a startup lawyer",
    "summarized_story": "Being a relatively new development, it is not far-fetched to assume that startups might not know what to look for in a startup lawyer.\nTo identify the unique qualities a startup lawyer should have, I asked 4 lawyers what qualities startups should look for in an in-house counsel.\nThe role of a startup lawyer is essential to support the startup from a legal perspective such that it can function at optimum capacity.\nWhether the startup is pre-seed, bootstrapped or VC-funded, a good startup lawyer is crucial for its day-to-day running.\nA startup lawyer should also be able to work in a startup environment, which is not as rigid as a law firm."
  },
  {
    "headline": "South African charged in largest fraud scheme involving bitcoin",
    "summarized_story": "The U.S Commodities Futures Trading Commission (CFTC) has charged South African resident Cornelius Johannes Steynberg in a bitcoin fraud scheme case totalling $1.7 billion.\nIn a press statement published on its website, the CFTC alleges that Steynberg, through a South Africa-registered company, Mirror Trading International Proprietary Limited (MTI), created and operated a global foreign currency commodity pool.\nThe pool, which had a value of $1.7 billion, only accepted bitcoin from users who wanted to purchase participation in it.\nJohnson said Steynberg in general operated the pool as a Ponzi scheme.\nSternberg is a fugitive from South African law enforcement but was recently detained in Brazil on an Interpol arrest warrant."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Gideon Dada’s guide for getting into venture capital",
    "summarized_story": "Dada is an Investment Associate at Metis Capital Partners, Nigerian businessman Hakeem Belo-Osagie’s family office.\nIn 2021, he got a LinkedIn message from someone at Metis Capital who was recruiting and wanted to know if he was interested in the role.\nBut why would he leave a job in a structured environment for the murky waters of venture capital?\nFor Dada, it was primarily the opportunity to work with his current bosses at Metis Capital.\nLike many investors in Africa, Dada disclosed that Metis Capital could only invest in a handful of startups that they come across."
  },
  {
    "headline": "2023: INEC Gives Ultimatum to Political Parties to Upload Candidates – Nigerian Observer",
    "summarized_story": "According to the release, the Commission has processed 6,995 nomination forms (EC9) uploaded by 16 out of 18 political parties for the constituencies where they intend to sponsor candidates.\nHowever, two political parties, the African Action Congress (AAC) and New Nigeria Peoples Party (NNPP), are yet to upload a single nomination to the portal.\nThe Commission hereby reminds all political parties that they have three days left to upload their list of candidates to the ICNP.\nThe number of requests processed has now risen to one million, six hundred and sixty-two thousand, nine hundred and eighty seven (1,662,987) pages of documents.\nSadly, in spite of the Commission’s effort, 147 out of 476 requests processed as at today involving 5,646 pages are yet to be collected by applicants."
  },
  {
    "headline": "Human capital devt: Edo govt flags off training programmes for youths, women – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government has commenced an intensive training programme for youths and women in the three oil and gas-producing local government areas of the state.\nThe training programme tagged “2022 Aguakpa Ghe Igbama,” was organized by the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC).\nThe youths and women were trained in several vocational skills including welding and fabrication, plumbing, agriculture, catering and decoration, shoe and bag making, fishery, poultry, piggery and panel beating, among others.\nOsifo added, “this present administration of the commission had the mandate from Mr.\nThe commission’s chair explained that EDSOGPADEC is focusing on empowering youths and women with a view to assisting them to develop their community-based business enterprises that would improve their living conditions and reduce the level of restiveness in these communities."
  },
  {
    "headline": "Over 500 indigents, elderly persons benefit from telemedicine services in Edo …beneficiaries hail Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government is expanding its telemedicine services across communities in the state with over 500 indigents and elderly persons in the state receiving free medical treatment and consultancy through telemedicine.\nHailing the Edo State Governor, Mr. Godwin Obaseki for his nuanced reforms in the health sector, beneficiaries of the telemedicine service, said the governor has continued to improve access to quality healthcare for citizens in the state.\nOne of the beneficiaries, a pensioner, Mrs. Stella Ajila, noted, “I thank God for my life and what he is doing in Edo State through Governor Obaseki.\n“My prayer is that God should continue to empower the Edo State Government and the Governor to continue in this regard.\nWe are indeed proud of him.”Another beneficiary, Mrs. Beatrice Oyem, said, “This programme has helped me improve my health situation."
  },
  {
    "headline": "2023: Omo-Agege Appoints Orubebe As Campaign D-G – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The Deputy President of the Senate and All Progressives Congress (APC) governorship candidate, Senator Ovie Omo-Agege, has appointed former Minister of Niger Delta Affairs, Elder Godsday Orubebe as the Director-General of Omo-Agege Governorhip Campaign Organisation.\nIma Niboro, Director of Communications and Media Strategy of the Delta State All Progressives Congress (APC) made this known on Wednesday.\nElder Peter Godsday Orubebe was born June 6th 1959 at Ogbobagbene in Burutu Local Government Area in Delta state.\nHe was later to become Minister of State for Niger Delta Affairs when the ministry was created in December 2008.\nOrubebe resigned from office in February 2014 to contest for the governorship of Delta State in the build up to the 2015 general elections."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "APC paid me to support Tinubu, I’m doing my job – Portable to critics",
    "summarized_story": "Habeeb Okikiola, a rising controversial singer better known as Portable, has claimed the All Progressives Congress (APC), paid him to support Bola Tinubu, its presidential candidate, ahead of the 2023 election.\nPortable had earlier visited Gboyega Oyetola, governor of Osun state, during which he backed his re-election bid.\nDuring his meeting with Oyetola in Osogbo, the state capital, he had endorsed Tinubu for president.\nBut in a follow-up video via his Instagram page, Portable hit back at his critics.\nPortable claimed he was paid to support the ex-Lagos governor for president, adding that his critics should allow him to do his job."
  },
  {
    "headline": "Nigeria records 7m new broadband subscribers",
    "summarized_story": "Nigeria’s broadband penetration recorded a quantum leap in the last seven months from November 2021 with a record of seven million new subscriptions.\nThe development represents an impressive push towards the nation’s quest to achieve 70 per cent national coverage by 2025.\n“Internet subscribers have grown from 90 million in 2015 to 150.36 million as at May 2022.\nAlso, within the period under review, broadband penetration increased from 8 per cent to 43.67 per cent, indicating that over 83.3 million subscribers are on broadband networks of 3G and 4G.\nIndeed, between November 2021 and May 2022, the networks have added 7 million new users,” Danbatta said."
  },
  {
    "headline": "Osun Guber: Obi, Labour Party leaders storm Osogbo for Lasun",
    "summarized_story": "By Sunday Oguntuyi, OsogboAhead of Saturday’s governorship election in Osun state, the presidential candidate for Labour Party, Mr. Peter Obi has assured the people of the state of good governance if the candidate of the party, Rt.\nObi argued that, Labour party, being the party of the masses have come with a lots of goodies for the masses.\nWhile speaking, the Labour Party governorship candidate, Hon.\n“They don’t know.\n“By July 16, I know Osun State will vote for me and it will shock them."
  },
  {
    "headline": "Group to FG: Don’t sell power assets",
    "summarized_story": "The Coalition of Northern Groups (CNG) has cautioned the National Council on Privatisation headed by Vice President Yemi Osinbajo and the Bureau of Public Enterprise over plans to sell the Ihovba, Calabar, Geregu, Olorunsogo, and Omotosho power plants.\nCNG in a statement issued in Abuja yesterday by Samaila Musa, its director of Strategic Communication, asserted that the sale of the power held by Niger Delta Power Holding Company Limited (NDPHC) will further diminish the economic viability of the northern region.\nThe statement reads in part: “The CNG insists that the power plants’ equity through NIPPs is owned by states and LGAs alongside the federal government which was designed and implemented in the South and eventually to be replicated in the North, as such, we reject in its totality any such plan to dispose of the plants without replicating same in the North as per the initial agreement.\n“Also, we demand the northern versions of plants to be immediately established as agreed in 2004 when NIPPs was established and urge Northern federal lawmakers to stand firmly against this attempt at mortgaging the future of the North,” the CNG explained."
  },
  {
    "headline": "2023: Agbaje backs power shift to south, hits PDP for abandoning rotation",
    "summarized_story": "Mr. Jimi Agbaje, former governorship candidate of the People’s Democratic Party (PDP) in Lagos State, has backed power shift to south in 2023, noting that he is in support of the Afenifere, Yoruba sociocultural group on the subject.\nHe accused the ruling All Progressives Congress (APC) of murdering religious harmony in Nigeria, while also hitting the PDP for ‘murdering equity.\n“Nigeria is at war and we need a leader who can manage a post war country.\nI support rotation and religious inclusion.\nI am not active again in Afenifere and I support the position taken by the group regarding Muslim-Muslim ticket and rotation."
  },
  {
    "headline": "Gov Ayade Takes Over C/River North APC Senatorial Ticket",
    "summarized_story": "All Progressives Congress (APC) Cross River State has adopted Governor Ben Ayade as its senatorial candidate for Cross River North.\nAyade’s adoption by the party has ended APC’s plan to conduct primary for the governor’s formal candidacy today at Ogoja Local Government Area Secretariat, headquarters of the senatorial district.\nA letter by the APC national chairman Abdulahi Adamu and national secretary Senator Iyiola Omisore, addressed to the Independent National Electoral Commission (INEC) listed three constituencies in the country including Cross River North whose flagbearers had withdrawn from participating in the 2023 senatorial contest on the party’s platform.\nA development which necessitated the conduct of fresh primaries election to enable the APC pick its new senatorial candidate to replace the old flagbearers.\nIt means Mr Martins Orim who was the APC north senatorial district flagbearer has withdrawn his interest to contest the senatorial election."
  },
  {
    "headline": "Gov Ayade Takes Over C/River North APC Senatorial Ticket",
    "summarized_story": "All Progressives Congress (APC) Cross River State has adopted Governor Ben Ayade as its senatorial candidate for Cross River North.\nAyade’s adoption by the party has ended APC’s plan to conduct primary for the governor’s formal candidacy today at Ogoja Local Government Area Secretariat, headquarters of the senatorial district.\nA letter by the APC national chairman Abdulahi Adamu and national secretary Senator Iyiola Omisore, addressed to the Independent National Electoral Commission (INEC) listed three constituencies in the country including Cross River North whose flagbearers had withdrawn from participating in the 2023 senatorial contest on the party’s platform.\nA development which necessitated the conduct of fresh primaries election to enable the APC pick its new senatorial candidate to replace the old flagbearers.\nIt means Mr Martins Orim who was the APC north senatorial district flagbearer has withdrawn his interest to contest the senatorial election."
  },
  {
    "headline": "Appeal Court Orders MultiChoice To Sublicence Channels",
    "summarized_story": "The Port Harcourt Division of the Court of Appeal has directed MultiChoice to sublicence some of its channels to Metro-Digital, in line with the code of the Nigerian Broadcasting Commission (NBC).\nAdegbehingbe nullified the ruling of the lower court, which dismissed the suit of the appellant, Metro-digital, despite its proving the existence of the dispute between itself and, MultiChoice.\nHe said, “It is my conclusion that the lower court erred when it struck out the name of the third respondent on the suit.\n“The appeal is highly successful and the judgment of lower court dismissing the entirety of the appellant is hereby set aside.\nWe came to court to compel MultiChoice to sublicense the enumerated channels we requested pursuant to the NBC code."
  },
  {
    "headline": "Appeal Court Orders MultiChoice To Sublicence Channels",
    "summarized_story": "The Port Harcourt Division of the Court of Appeal has directed MultiChoice to sublicence some of its channels to Metro-Digital, in line with the code of the Nigerian Broadcasting Commission (NBC).\nAdegbehingbe nullified the ruling of the lower court, which dismissed the suit of the appellant, Metro-digital, despite its proving the existence of the dispute between itself and, MultiChoice.\nHe said, “It is my conclusion that the lower court erred when it struck out the name of the third respondent on the suit.\n“The appeal is highly successful and the judgment of lower court dismissing the entirety of the appellant is hereby set aside.\nWe came to court to compel MultiChoice to sublicense the enumerated channels we requested pursuant to the NBC code."
  },
  {
    "headline": "I’ve Told My Children I Won’t Leave Any Inheritance For Them – Buhari",
    "summarized_story": "President Muhammadu Buhari says he has told his children that he would not leave any inheritance for them.\nBuhari said, “My focus has always been on training the children to be relevant wherever they find themselves.\nI told my children, particularly the girls, that they can only get married after getting a first degree.\nAt that point, I realised and I told my children that your net worth is what is in your head, not what you have acquired in life,” he said.\nThe Emir of Daura thanked the president for the infrastructural and institutional developments in the state, saying generations will remember and remain grateful to President Buhari."
  },
  {
    "headline": "There’s dignity in labour, Peter Obi replies Tinubu",
    "summarized_story": "The presidential candidate of the Labour Party, Peter Obi, on Wednesday, has reacted to the presidential candidate of the All Progressives Congress, APC, Bola Tinubu’s comment he made about their party, which the Labour party and its members considered derogatory.\nObi made the remark in Osogbo, the Osun State capital, at a mega rally to support the governorship candidate of the party, Lasun Yusuff.\nHe said: “I listened to our chairman when he said that somebody said ‘they can labour till death’.\n“When they show you hatred, Labour Party will show them love.\nSimilarly, the LP’s candidate, Lasun lambasted Tinubu, saying his comment about the Labour Party by the APC leader was inconsistent with the attributes of a virtuous Yoruba man."
  },
  {
    "headline": "Osun Guber: Ayu, Atiku, PDP governors storm Osogbo tomorrow for Adeleke",
    "summarized_story": "Ahead of the Osun State governorship election slated for next Saturday, the Peoples Democratic Party (PDP) National Chairman, Dr. Iyorchia Ayu, 2023 party Presidential candidate, Atiku Abubakar and governors will tomorrow storm Osogbo for the mega rally.\nPDP candidate for the July 16 governorship election is Senator Ademola Adeleke.\nNews Direct gathered that the Chairman PDP governors forum, Sokoto State Governor, Aminu Waziri Tambuwal, Chairman PDP Osun Governorship Campaign Council, Bayelsa State Governor, Douye Diri and his Edo State counterpart, Godwin Obaseki are already in Osun State.\nPDP National Chairman charged all stakeholders in Osun State, party faithful and residents to come out en mass to grace the rally.\n“I charge every lover of democracy and good governance to come out and identify with the PDP candidate, Sen. Ademola."
  },
  {
    "headline": "JUST IN: Police Arrest Kuje Prison Escapee In Ogun",
    "summarized_story": "JUST IN: Police Arrest Kuje Prison Escapee In OgunYakubu AbdulMumuni, a 28-year-old escapee from the Kuje Correctional Center, was apprehended by Ogun State Police Command personnel.\nThe culprit was taken into custody at Sango-Ota, which is part of the State’s Ado-Odo/Ota Local Government Area.\nAbdulMumuni, who was sentenced to Kuje prison in Kogi State after being found guilty of conspiracy and culpable homicide, was apprehended on Monday by members of the Police Command, according to Oyeyemi.\nOyeyemi said “the escapee, 28year old Yakubu AbdulMumuni was arrested following information received by policemen at Sango-Ota divisional headquarters that, the convict was sighted somewhere around Sango Ota.\n“He confessed to the Police that he escaped from Kuje Correctional Center on the 5th of July 2022, when the Center was attacked by bandits."
  },
  {
    "headline": "BREAKING: Another Building Collapses In Lagos, Many Feared Dead",
    "summarized_story": "BREAKING: Another Building Collapses In Lagos, Many Feared DeadAt around 1.07 am on Wednesday, a structure in the Onipanu neighborhood of Lagos State apparently collapsed on Oke Arin Street, off of Shyllon Ilupeju.\nDr. Oluwafemi Oke-Osanyintolu, the permanent secretary of LASEMA, the Lagos State Emergency Management Agency, acknowledged the Onipanu tragedy.\n“The Alpha Cobra team of Lagos State Emergency at Onipanu En route Oke Arin street off shyllon Ilupeju.” He said.\nOne person was confirmed deceased in a building fall on Lagos Island in Lagos State in May, according to SaharaReporters.\nOn Saturday afternoon, the event took place at a two-story building on Freeman Street."
  },
  {
    "headline": "Breaking: Another top shot dumps APC, few days after Tinubu announced Shettima as running mate",
    "summarized_story": "Suleiman Yahaya-Kwande, has finally withdrew his membership from the All Progressives Congress (APC).\nKwande has earlier through his media aide, Usama Jafar, announced his resignation from the APC.\nSuleimanYahaya-Kwande, has finally reseigned and withdrew his membership of the All Progressive Congress (APC),” Jafar said on his verified Facebook page.\nHe added that his boss said, “having being part of APC since inception, it was indeed an emotional moment to say goodbye.”A further confirmation by Hon.\nSuleiman Kwande, was made in a letter he personally signed dated July 4, 2022, and addressed to his Jenta Adamu Ward chairman of the APC."
  },
  {
    "headline": "Pictures: Peter Obi storms Osun for labour Party grand finale rally",
    "summarized_story": "The Labour party presidential flagbearer, Peter Obi, Wednesday, stormed Osogbo, the Osun state capital as the Party helds grand finale rally ahead of the state governorship election scheduled to hold on Saturday.\nLabour Party Candidate is the former deputy speaker of the House of Representatives, Lasun Yusuf.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Raheem Sterling completes Chelsea £45m move, becomes Todd Boehly’s first major signing",
    "summarized_story": "Raheem Sterling has completed his sensational move from Manchester City to Chelsea, with Todd Boehly finally landing his first major signing since taking over the club from Roman Abramovich.\nSterling has signed a five-year contract worth significantly more than the £300,000 a week he was paid by City.\nHe becomes the first signing of the Boehly era and will be followed by Napoli defender Kalidou Koulibaly after Chelsea agreed a £34m move for the centre back on Wednesday.\nSterling could make his Chelsea debut in Charlotte next Thursday or against Arsenal in the Florida Cup final the following Saturday.\nChelsea flew out for their USA pre-season tour on Saturday and were keen to have the forward available to travel with them."
  },
  {
    "headline": "BON hotel set to empower Nigerian Youths through branch expansion in Lagos, Abuja, Port Harcourt",
    "summarized_story": "By Ere-ebi AgedahLeading hospitality brand, BON Hotels International West Africa has expressed readiness to take more youths in the country out or labour market and meaningfully engage them with economic activities.\nThe hotel listed Lagos, Abuja, Port Harcourt, Ibadan, Kano, Warri, Ekiti, Akure, Ogbomosho, Owerri, Asaba, Awka, Enugu and others as some of the cities it plans to establish 60 new branches.\nThe hospitality industry has been identified as one of the sectors with humongous capacity to reduce Nigerian unemployment figure which has for decades increasing surged.\nThe World Travel & Tourism Council estimates that the hospitality industry accounts for 10 percent of global GDP and provides 1 in 10 jobs worldwide.\nThis suggests that one in 10 workers in Nigeria is directly or indirectly employed in the hospitality industry."
  },
  {
    "headline": "Jack-Rich Harps on Economic Liberalisation Strategy For Private capital Boom in 2023",
    "summarized_story": "Jack-Rich said to achieve this, policy makers must award deep tax cuts, promote sectoral economic stimulus through soft credit lines to help indegenous companies produced the country’s needs.\n”It is a phenomenal tool to activate private capital growth, and to join the trillion-dollar economic league,” he said.\nAccording to the philanthropist, global economic trend has its impact on Africa, which accounts for only three per cent of global trade with seven per cent of trade deficit.\n”Ignoring economic stimulus and pursuing interest rate hike, with the taxman on the neck of businesses, will further stifle earnings and worsen access to credit for large ticket investments,” he said.\nAccording to the oil tycoon, this will increase unemployment rates, and further exacerbate the wind of economic recession, and possibly social issues."
  },
  {
    "headline": "How women play leading roles in COMEG – Prof Opafunso",
    "summarized_story": "The Registrar/CEO of COMEG, Prof Zacheus Opafunso made the call during the inauguration of COMEG Cooperative and Building Committee in Abuja on 6th July, 2022, officiated by the President of the Nigerian Mining and Geosciences Society, NMGS, Alabo Charlesye David Charles.\nOpafunso said COMEG will continue to give relevant support to women individuals and women groups who wish to participate in the development of the sector, provided that it is in line with the mandate of the Council.\nHe said the economic diversification goal cannot be pursued by men alone, adding that COMEG was committed to gender balance in line with the National Gender Policy.\nDiscussing other important roles that women have played in COMEG over the years, Prof Opafunso recalled that the first Acting Registrar of COMEG was a woman – Dr. (Mrs) A.\nB. Durotoye, adding that women continued to serve on the COMEG Council till date."
  },
  {
    "headline": "Mining: Research, devt pivotal to achieving economic diversification- Asuquo",
    "summarized_story": "Prof. Linus Asuquo has said that research and development should be given priority if the nation was bent on achieving its goals on economic diversification.\nLet me say this, as I have repeated many times, we should not play with the Ajaokuta Steel company.\n“So, if we start doing research and development and the Ajaokuta Steel Company is working, there will be development, without Ajaokuta working, then we are just playing lip service.\nWe just seat down at home here and criticize that our Ajaokuta Steel Company is outdated.\nEven if it’s outdated, we can modernize it into sections; that’s why it’s called Ajaokuta Steel Company."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "ASUU: It’s Unacceptable To Still Have Schools Closed After Many Months – Bishop Kukah",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Mathew Kukah, has said it is unacceptable that Nigerian Universities are still closed after so many months.\nBishop Kukah who stated this on Wednesday at the signing of a peace accord ahead of the Osun State gubernatorial election, asserted that the prolonged strike does not speak well of the democracy we profess to be practicing.\n“This is unacceptable especially as these things are happening in a democracy,” Kukah insisted.\nBishop Kukah said it is sad that increasingly the country is witnessing a transition from democratic rule to plutocracy.\nBishop Kukah called on Nigerians to come out and vote when the elections get underway, stressing that the urgency of fixing the nation is tied to the process of governance adopted in the constitution."
  },
  {
    "headline": "2023: Tinubu’s Muslim-Muslim Ticket Is ‘A Disastrous Error, Dead On Arrival’ – Babachir Lawal",
    "summarized_story": "Former Secretary to the Government of the Federation, Babachir Lawal, has faulted the announcement of a Muslim-Muslim ticket by the presidential candidate of the All Progressives Congress, Bola Ahmed Tinubu.\n“But if he thinks a Moslem-Moslem ticket will win him the northern Muslim votes, he should have a rethink.\nI have also on several occasions passed on to him counsels and messages from some well meaning Nigerians intended to alert him on the possible outcomes of the Presidential ticket permutations.\nThe northern governors and some northern moslem elites must have persuaded him that they will never vote for a ticket that has a northern Christian on it.\nBut, were he to win and become President of Nigeria, it will be as a sectional President; an Islamic President."
  },
  {
    "headline": "Inmate Who Escaped From Kuje Prison Arrested In Ogun",
    "summarized_story": "The Ogun State Police Command says it has arrested one of the inmates who fled the Medium Security Correctional Centre, Kuje in Abuja following an attack on the facility by terrorists.\nAbimbola Oyeyemi, who is the Police Public Relations Officer in Ogun, confirmed the arrest of the inmate in a statement on Wednesday in Abeokuta, the state capital.\nAccording to Oyeyemi, the escapee was arrested following information received by policemen at Sango Ota Divisional Headquarters that the convict was sighted somewhere around the area.\nThe suspect is said to have confessed to the police that he escaped from the correctional centre in Kuje on Tuesday last week when the facility was attacked by terrorists.\n“He (the escapee) stated further that he was convicted by the Kogi State High Court for the offence of Conspiracy and Culpable Homicide and sent to Kuje correctional centre,” the command’s spokesman said."
  },
  {
    "headline": "Osun Election: Oyetola To Know Fate In Disqualification Suit On Thursday",
    "summarized_story": "The Federal High Court in Abuja has fixed Thursday to deliver judgment in a suit seeking the disqualification of Governor Adegboyega Oyetola of Osun State as the All Progressives Congress (APC) candidate in the July 16 governorship election.\nAdeoti was one of the aspirants who lost the APC governorship ticket to Governor Oyetola in the party’s primary held on February 19.\nGovernor Oyetola is seeking to extend his tenure in office by another four years, having won the last election held in 2018.\nThe court will deliver judgement on the suit seeking to disqualify him two days to the date set by the Independent National Electoral Commission (INEC) to conduct the election.\nAhead of the poll, the APC held a mega rally in Osogbo to canvass support for its governorship candidate before the deadline for campaigns."
  },
  {
    "headline": "Ondo Commissioner Resigns, Gives Reasons",
    "summarized_story": "The new Ondo state Commissioner for Physical Planning and Urban Development, Mrs. Yetunde Adeyanju, has resigned her appointment, giving reasons for her decision.\nMrs. Adeyanju who was on Wednesday redeployed from the Ministry of Water and sanitation to the Ministry of Physical Planning and Urban Development tendered her resignation letter shortly after Governor Oluwarotimi Akeredolu announced a minor reshuffle in the cabinet.\nIn a copy of the letter, Mrs. Adeyanju appreciated Gov Akeredolu for the opportunity to serve the people of Ondo state.\nREAD A COPY OF THE LETTER BELOW:"
  },
  {
    "headline": "Three APC Governors visit Nyesom Wike in Port Harcourt",
    "summarized_story": "Rivers State Governor Nyesom Wike held closed door meetin with three governors of the All Progressives Congress in Port Harcourt.\nNyesom Wike received the Governors of Lagos State, Babajide Sanwo-Olu, Ondo State, Rotimi Akeredolu and Ekiti State, Kayode Fayemi at his country home.\nThe visit of the APC governors comes amidst speculations about the political future of Governor Nyesom Wike following the outcome of the PDP Presidential Primaries and the choice of a running mate to the PDP flagbearer, Atiku Abubakar.\nAdvertisementAdvertisementThe crisis worsened after Atiku rejected the recommendation of an ad hoc committee of the party and picked Delta State Governor, Ifeanyi Okowa, as his running mate.\nThe committee was reported to have recommended Mr Wike for the position, although the party later cllaimed that Mr Wike was only one of three nominees recommended by the committee."
  },
  {
    "headline": "Akinlade joins PDP, emerges Adebutu's running mate",
    "summarized_story": "Ladi Adebutu and Hon.\nAdekunle Akinlade are long time allies, who both served at the green chamber from the state in the eighth legislative assembly.\nAkinlade is a strong loyalist of Senator Ibikunle Amosun and had earlier announced his defection from the ruling party, blaming his decision on injustice within the APC."
  },
  {
    "headline": "2023: Labour Party announces Datti Ahmed as Peter Obi's running mate -",
    "summarized_story": "The Labour Party has officially announced Datti Ahmed as Peter Obi’s running mate for the 2023 Presidential Election.\nThis follows the withdrawal of Doyin Okupe from the race in a letter he personally signed and sent to the Independent National Electoral Commission.\nAdvertisement"
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "It is the Constitutional Right of the South East to Produce the Next President – Pa Adebanjo",
    "summarized_story": "Leader of the Afenifere a Pan Yoruba Socio-Political Association Chief Ayo Adebanjo pledges supports for Labour Party’s Presidential candidate, Peter Obi as his candidate ahead of the 2023 election."
  },
  {
    "headline": "Sunak Top as Six Candidates Make Second Round of UK PM Race",
    "summarized_story": "Former UK Chancellor Rishi Sunak has secured the most votes from Tory MPs after the first round of voting, in the race to succeed Boris Johnson as UK Prime Minister.\nIn an 8-person field, Nadhim Zahawi and Jeremy Hunt were eliminated from the race, following the end of first round of voting.\nThe remaining candidates left in the leadership contest are:Kemi Badenoch – 40 votesSuella Braverman – 32 votesPenny Mordaunt – 67 votesRishi Sunak – 88 votesLiz Truss – 50 votesTom Tugendhat – 37 votesCandidates needed at least 30 MPs to support them to progress to a second round – neither Hunt nor Zahawi managed this.\nThose six who made it will now proceed to a series of votes among MPs, eliminating the last placed candidate in each round until a final two are left.\nThis process is set to be completed by Parliament’s summer recess on 21 July."
  },
  {
    "headline": "British DJ Tim Westwood Accused of Sex With 14-Year-Old Girl When in His 30s",
    "summarized_story": "British DJ Tim Westwood is facing allegations from a woman who says he first had sex with her when she was 14 and he was in his 30s.\nThe womenEstherEsther* says she met Westwood in 1990, when as a hip-hop-loving 14-year-old she would go to the Arch nightclub in Vauxhall, south London.\nEmmaEmma* says she met Westwood when she joined his promotional “street team” in 1999, when she was 15.\nTaliaTalia* says she was 20 when she met Westwood at the Oceana nightclub in Nottingham in 2012.\nIsla* says she met Westwood in August 2017 at Boxpark in Croydon, and alleges he rubbed his genitals on her behind."
  },
  {
    "headline": "Elisha Abbo: You Can’t Be Loyal to a Government that Breaks Its Own Constitution",
    "summarized_story": "Senator Elisha Abbo, Representing Adamawa North speaks on his displeasure with the choice of his party’s presidential candidate."
  },
  {
    "headline": "Nigeria Restates Commitment to Recovering Stolen Artefacts",
    "summarized_story": "Nigeria’s Minister of Information and Culture, Alhaji Lai Mohammed reaffirmed the federal government’s commitment towards recovering the nation’s stolen artefacts across the country.\n“Let me restate our commitment to recovering our priceless works of art which were looted from our country.\nThere is no doubt that the return of the most coveted Benin bronzes to Nigeria will help to stimulate domestic tourism in our country,” he said.\n“The Art Hotel brand is a new offering associated with art, style, culture, sophistication and contemporary creativity that promises quality service and genuine guest experiences to deliver customer satisfaction in a distinctive environment.\n“The domestic tourism industry in Nigeria has enormous growth potential with huge possibilities for bringing in Foreign Direct Investments, infrastructural development, tourism asset development and the creation of local, national and international awareness for our tourism assets."
  }
]