[
  {
    "headline": "Integrity is about public funds management, Obi replies Wike",
    "summarized_story": "A former governor of Anambra State, Peter Obi, has replied Governor Nyesom Wike of Rivers State over the latter’s criticism of his resignation from the Peoples Democratic Party.\nObi, while faulting Wike for questioning his loyalty and integrity to the PDP, stated that integrity was about prudent management of public resources and not membership of a political party.\nWike had on Thursday taken a swipe at Obi for quitting the PDP few days to the presidential primary of the opposition party.\nWike had said, “It is not surprising to me.\n“I don’t know how that one came in but I think when we talk about integrity, we are talking about integrity in management of public resources."
  },
  {
    "headline": "PDP mocks Akeredolu over rancorous APC primaries",
    "summarized_story": "The Ondo State Chapter of the Peoples Democratic Party says indication have emerged that the ruling All Progressives Congress would lose the general elections in the state, given how rancorous the APC primaries in the state were.\nThe opposition party said the primaries so far conducted by the ruling party had shown that the APC would have a tragic outing in the 2023 general elections.\nThis was contained in a statement issued by the Publicity Secretary of the PDP, Mr Kennedy Peretei, on Friday, in Akure, the state capital.\nAccording to Ondo PDP, APC primaries have been marred by irregularities.\nIn Ondo State, for example, one does not need the prophetic exactitude of a Jewish prophet to know that the Rotimi Akeredolu-led APC will have a tragic outing in the 2023 general elections."
  },
  {
    "headline": "Lagos APC primaries turn bloody in Alimosho",
    "summarized_story": "By Bose AdelajaThe primary elections of All Progressives Congress APC, for the House of Representatives in Alimosho area of Lagos, on Friday, reportedly turned bloody following the alleged killings of two party faithfuls.\nThe incident reportedly occured at about 3pm at the Secretariat of Ikotun/igando Local Council Development Area, where the primary elections were held.\nEye witnesses’ account said there were two factions of the party for the two aspirants for Federal House of Representatives seat in Alimosho Constituency.\nREAD ALSO:Ogunlaye was said to be the Zonal Chairman, National Union of Road Transport Workers NURTW, in Alimosho.\nAt press time, there was apprehension in Ikotun, Igando, Egbeda and their environ over possible reprisal attacks in the area."
  },
  {
    "headline": "2023: CUPP spokesman, Ugochinyere wins PDP ticket for Ideato Fed. Constituency",
    "summarized_story": "Ikenga Imo Ugochinyere has emerged winner of the Peoples Democratic Party, PDP House of Representatives primary for Ideato North/South Federal Constituency.\nIn the contest that saw seven other aspirants vying for the federal legislative seat, Ugochinyere scored 71 out of 82 votes.\nWhile extending his hand of fellowship to his challengers,the aspirant said Ideato was ready to return to PDP.\nIkenga declared that as the candidate of the party, he would stop at nothing to return the federal constituency to the Peoples Democratic Party after over 10 years’ inability to win.\nHe enjoined them to close ranks as they work towards taking the constituency to the party."
  },
  {
    "headline": "DELTA APC PRIMARIES: Uboh return unopposed in Ika Fed Constituency",
    "summarized_story": "…as Opone clinches Ndokwa/Ukwuani ticket…Nwaka takes Aniocha/Oshimili flag…Atie wins Warri North constituency APC PrimaryBy Jimitota Onoyume, Festus Ahon, Ochuko Akuopha & Paul Olayemi, ASABAFORMER member of the Federal House of Representatives, Mrs Doris Uboh, Friday, picked the All Progressives Congress, APC ticket for the Ika Federal Constituency unopposed.\nAlso returned unopposed, is former Delta State Governorship aspirant, Chief Johnson Opone to fly the APC flag in the Ndokwa/Ukwuani Federal Constituency.\nIn the Ughelli North constituency I, Mr. Matthew Omonade pipped the incumbent representative of the constituency, Mr. Charles Oniyere to the party’s ticket while Mr Spencer Ohwofasa Ohwofa emerged as the party’s flagbearer in the Ughelli North constituency Il.\nIn Okpe constituency, Barr.Hero Omuirhiriren emerged winner of the primaries as Comrade Blessing Achoja Odewene and Moses Ogodo clinched the party’s ticket in Ethiope West and Sapele constituencies respectively.\nOthers who picked the party’s ticket are: David Ochonogor Ukwuani constituency; Valentine Oyemike Ndokwa West; Blessing Ese, Isoko South I and Frank Embrose Uwomano, Isoko South ll."
  },
  {
    "headline": "2023: Buhari reiterates commitment to fair, peaceful elections",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJAAHEAD of the 2023 general elections, President Muhammadu Buhari has for the umpteenth time, reiterated his determination to ensure peaceful and fair elections.\nThe President also expressed his commitment to seeing candidates with integrity prevail in next year’s general elections.\nLado’s meeting with the President came a day before the senatorial primary elections of the APC scheduled for Friday, May 27, 2022.\nBriefing State House Correspondents after his meeting with the President, Senator Lado said “As you are aware, Kano State is the largest producer of votes in Nigeria.\n“After my briefing, Mr President reiterated his commitment to credible and peaceful elections and also his desire to see candidates with integrity prevail at the polls all across Nigeria,” Lado said."
  },
  {
    "headline": "Igboke, Ebonyi LG boss wins APC Rep ticket for Ohanivo",
    "summarized_story": "By Dennis AgboThe Chairman of Onicha Local Government Area of Ebonyi State, Ogbonna Igboke has clinched the All Progressives Congress (APC) ticket for Ohaozara/Onicha/Ivo (OHANIVO) Federal Constituency.\nTo emerge victorious, Igboke, an engineer, polled 167 of the 170 votes cast in the election.\nReputed as a grassroots politician, Igboke in a short remark after he was declared winner assured the people of the constituency of effective representation if he wins the election for the House of Representatives next year.\n“I’ve always been with you, I know your pains, I know what OHANIVO deserves and by the grace of God, we are heading to Abuja.\nAnd in Abuja, we shall deliver by ensuring effective and total representation,” he stated."
  },
  {
    "headline": "Ogun: Group calls for investigation into Wale Matasacker’s murder",
    "summarized_story": "A group has said the popular area boy killed by some suspected cultists on Sunday, Akinwale Sorunke, was not a member of the Aiye confraternity, saying his killing was more or less a political assassination.\nSorunke, popularly known as Wale Matasacker, was killed by some suspected cultists at Quarry road, Abeokuta.\nThere were rumours that the young man was a member of the Aiye cult group, and he was killed by members of the rival Eiye group.\nBut, the Noe Black Movement (NBM) of Africa, Abeokuta zone, described as defamatory, claims that Sorunke was a cultist.\n“We are also preaching free, fair and credible elections in 2023 and completely frown at killing of people to attain political gains,” Odunewu’s statement read partly."
  },
  {
    "headline": "N96b alleged fraud: I’ve been vindicated – Amaechi",
    "summarized_story": "Chibuike Rotimi Amaechi against the Rivers State Government on the Justice George Omereji Judicial Commission of Inquiry.\n“The Supreme Court ruling clearly vindicates the former Governor of Rivers State.\n“With this judgment, Amaechi has been vindicated and cleared of all purported or alleged indictment by the Governor Wike’s Commission.\nAmaechi challenged the decision of the governor at the High Court of Rivers State in a suit marked: PHC/187/15.\nOn appeal, the Court of Appeal also expressed a similar view, which was also reflected in the judgment of the Supreme Court on Friday."
  },
  {
    "headline": "Amaechi’s fate in N96bn indictment lies with Rivers’ Elders – Wike",
    "summarized_story": "Basking in the euphoria of the Supreme Court judgment which dismissed former Governor Rotimi Amaechi’s suit on N96B indictment, Rivers State Governor, Nyemsom Wike, has said that the coast has become clear for elders of the state to determine the fate of the former governor.\nWike asserted that as a person, he would not take any action on the report of Justice George Omekeji Commission of Inquiry, which indicted Amaechi for alleged massive fraud without the direction of Rivers Leaders.\n“There is nobody that sees the report and recommendation of the panel of Inquiry that will not cry for Rivers and its people.\nIf they say, prosecute them, on Monday, the Rivers Government will file charges against Amaechi and others,” Wike stated.\n“Imagine that the sum of $50million dollars was paid to Sahara Energy Company that belongs to Tonye Cole, etc,” Wike lamented."
  },
  {
    "headline": "Osinachi: Family of Ekwueme singer reportedly fixes burial date, hints on returning bride price",
    "summarized_story": "The family of the late gospel artist, Osinachi Nwachukwu, has fixed a date for her burial.\nOsinachi’s family reportedly fixed June 25, 2022 for the burial of the “Ekwueme” crooner.\nThe deceased family insisted that Osinachi would be buried in her father’s compound at Isuochi, Abia State, instead of her husband’s house.\nOsinachi was said to have died as a result of domestic violence she suffered from her husband, Peter Nwachukwu.\nThe Attorney General of the Federation had dragged Peter before a Federal Capital Territory, FCT, High Court."
  },
  {
    "headline": "Nigeria intensifies surveillance to prevent monkeypox outbreak",
    "summarized_story": "The Nigerian government is working with stakeholders to intensify surveillance and prevent the outbreak of monkeypox.\nAbubakar advised the public to avoid contact with animals that are sick, found dead, and their items.\nThe minister called for increased hygiene, hand washing and the use of alcohol-based sanitizers after contact with infected animals or humans.\nHe assured Nigerians and foreign countries of continued collaboration with relevant sectors to promptly contain the disease in the event of an outbreak.\nMonkeypox, first detected in 1958 in monkeys and rodents, is now transmissble to man and other animals."
  },
  {
    "headline": "At the mercy of Nyesom Wike?",
    "summarized_story": "Justice Adamu Jauro who led the seven member panel of justices while delivering judgment, dismissed the appeal for lacking in merit.\nWith the development, the former Rivers State governor can be brought to face a probe panel planned for him by his successor and arch rival, Governor Nyesom Wike.\n“God forbid Amechi should be at the mercy of Wike.\nThe ex-minister had approached the Supreme Court praying for an order of the court to prohibit Wike from investigating his eight-year tenure as governor of Rivers.\nBut Wike persisted in his determination to bring his predecessor to answer questions about his time in office."
  },
  {
    "headline": "Is that all Mr. Presidential aspirant?",
    "summarized_story": "The aspirant, an incumbent political office holder, had visited the state to solicit for the support of delegates and party leaders in his quest to succeed President Muhammadu Buhari.\nBut the hitherto patient party members soon turned to a grumbling and angry lot when, at the end of the very long speech, Mr. Aspirant made to leave without the ‘usual’ thank you envelopes.\nUpon realizing that the presidential hopeful didn’t drop money for them with the organizers of the meeting, some party members approached him and demanded to know what was happening.\n“Oga wa, so ti tan naa nun?\nSo ti tan nuun,” meaning “Our leader, is that all?"
  },
  {
    "headline": "APC, PDP: A day of decision",
    "summarized_story": "If PDP produces a candidate tomorrow and the APC candidate is nowhere to be found, it would mean that the APC forced the hand of the electoral commission to amend the electoral timetable.\nAll the delegates were elected in APC and PDP.\nNo APC aspirant has campaigned more than the great leader and mobiliser,Asiwaju Bola Tinubu, national leader of APC.\nHe was present when Ekiti State Governor Kayode Fayemi unfolded his plans at the Federal Capital Territory (FCT).\nEbonyi State Governor Dave Umahi will surely pull more votes from delegates from his state than elderstatesman Dr. Ogbonnaya Onu."
  },
  {
    "headline": "Children’s Day: Every child’s right must be protected – Bagudu",
    "summarized_story": "Children’s Day: Every child’s right must be protected – BaguduThe Kebbi State Government under the leadership of Senator Abubakar Atiku Bagudu, yesterday, joined the rest of the world in celebrating Children’s Day .\nThe governor has re-emphasised that children must be given the major requisite for normal development through sound education, quality healthcare, good feeding.\nBagudu also said the child must be put in a position to earn a livelihood and must be protected against every form of exploitation.\n“It is one of the cardinal principles of the Bagudu administration that children in the state deserve the best and a safe environment where they can grow, interact with friends and emerge as successful leaders in different fields of endeavour.”“Kebbi State Government has invested enormous resources in improving the education sector by constructing new schools, provision of learning materials, feeding and affordable health care, particularly to children.”This is in order to ensure healthy living and growth."
  },
  {
    "headline": "Police bust ‘Yahoo Yahoo’ training center in Bauchi, arrest five",
    "summarized_story": "Operatives of the Bauchi State Police Command have arrested five cybercrime ‘Yahoo Yahoo’ Suspects undergoing training in Bauchi.\nA statement signed by the Police Public Relations Officer of the Command, SP Mohammed Ahmed Wakil, stated that its successful operation led to the arrest of one Emmanuel Saleh nicknamed Wizblaq (22 yrs old ‘m’) of Rafin-Zurfi, Bauchi, an alleged owner of the academy center and four others.\nAccording to Wakil, the operatives of the State Intelligence Bureau (SIB), Bauchi Command acted on a verified intelligence on May 20, 2022, when it burst into an apartment located at Kirfi Road, GRA, Bauchi, where the training center was established for the training of youths who want to venture into internet crime.\nOthers are Bulus Haruna, 18 years old ‘m’ of Rafin-Zurfi, Bauchi, and Kingsley Simon* 19 years old ‘m’ of Rafin-Zurfi, Bauchi.\nHe said the crime Items recovered from the residential apartment turned training center as exhibits include; four laptops, one television set, four sound systems, a brand new power generator, seven plastic chairs, one office chair, a musical keyboard and a fridge."
  },
  {
    "headline": "APC, PDP presidential primaries: How the aspirants stand – The Sun Nigeria",
    "summarized_story": "They are former Vice President Atiku Abubakar; ex-Senate President, Bukola Saraki; Sokoto State Governor, Aminu Tambuwal; Rivers State Governor, Nyesom Wike and Bauchi State governor, Bala Mohammed.\nRivers: it’s Wike’s turfThe state governor, Nyesom Wike and presidential aspirant will ride on the party’s one family and loyalty.\nKogi: Saraki, Atiku on topAbout 80 per cent of the delegates votes will be shared between Saraki and Atiku.\nAlthough, other aspirants might get a share of the delegates’ votes from Delta, their score would be insignificant to swing the pendulum.\nBenue: Aspirants might share votesThe relationship between the state governor, Samuel Ortom and the Rivers State governor, Nyesom Wike, as well as that between former governor, Gabriel Suswam and Akwa Ibom governor, Emmanuel Udom, will determine the voting pattern."
  },
  {
    "headline": "INEC bows to pressure, extends party primaries deadline by one week",
    "summarized_story": "So if it please the Commission allow us between 3rd and 9th so that the political parties so that the political parties can put their house together up to 10.\n“INEC met with the leadership of political parties today Friday.\n“Earlier, the political parties had requested for 37 – 60 days extension of the timeline for primaries and the nomination of candidates.\n“However, this request is granted in respect of outstanding primaries only without prejudice to those already concluded by political parties.\nThe Commission will train four officials from each of the 18 political parties, making a total of 72 in all."
  },
  {
    "headline": "Confusion, uncertainty over APC presidential primary",
    "summarized_story": "From Romanus Ugwu, AbujaConfusion and anxiety best portray the state of mind of presidential aspirants on the platform of the All Progressives Congress (APC), who are currently in the dark over what becomes of their fate ahead of the proposed presidential primary.\n“President Buhari has heightened the suspense.\nEverybody, including the party leadership and aspirants kept waiting for him to give them direction.\nFaced with the uncertainty, the party’s leadership has continued to screen the presidential aspirants secretly, fuelling rumours that some of them may be facing disqualification from participating in the forthcoming primary.\nPresident Buhari dictates proceedings in the party especially as it concerns picking the presidential candidate of the party."
  },
  {
    "headline": "Uche Ogah wins APC guber ticket in Abia",
    "summarized_story": "Former Minister of State for Mines and Steel Development, Dr Uche Ogah has been declared winner of Abia State All Progressives Congress (APC) governorship primary election.\nOut of the total of 195,801 votes cast, the former Minister polled 141,952 votes to beat his closest rival, Paul Ikonne who got 27,054.\nOthers who participated at the direct primary election include, Ikechi Emenike who polled 9,446, Emeka Atuma with 7,429 and Obinna Oriaku with 5,553.\nAlex Otti, who pulled out of the contest and APC before the primary election, got 2,414 and Daniel Eke who got 1,953.\nOn Thursday, Chief Ikechi Emenike was announced the winner of an indirect primary election, which took place in Umuahia the state capital."
  },
  {
    "headline": "Osinbajo under fire for using presidential jet for political campaign tours",
    "summarized_story": "Twenty–four hours to the presidential primary of the All Progressives Congress (APC), Vice President Yemi Osinbajo has come under fire for travelling in presidential jet during his meet-the-delegates tour nationwide.\nThe condemnation of Osinbajo peaked after the presidential jet, Boeing 727-2N6 with registration no.\nCommenting on Osinbajo’s use of presidential jet for political trips, Mallam Maida Bello said it was morally wrong.\nHe said political party events or political campaigns are not classified as official trips.\nHe said the vice president ought to have hired a private jet for his political consultations."
  },
  {
    "headline": "Sanwo-Olu, Abiodun, Abdulrazaq, Sule, Inuwa, Matawalle, Others Secure APC Guber Tickets",
    "summarized_story": "Chairman of primary election, Dr. Emmanuel Dan Daura, who conducted the election announced results, affirming the governor’s victory.\nSule was consequently declared winner of the Nasarawa State APC governorship primary election held at the Lafia City Hall by chairman of the state APC Governorship Primary Election Committee, Isa Ibeto.\nThe state APC governorship election committee chairman announced that Sule polled 698 votes to defeat the ex-wife to the APC national chairman,, Fatima who scored three votes.\nZamfara StateGovernor Muhammad Bello Matawalle of Zamfara State has emerged APC governorship candidate for 2023 election.\nThe governorship primary election took place on Thursday at Pa Ngele Oruta township stadium Abakaliki."
  },
  {
    "headline": "Finance Minister: Nigeria’s Low Crude Oil Production Barely Enough to Cover Petrol Imports",
    "summarized_story": "Peter Uzoho with agency reportNigeria’s low crude oil production means the country is barely able to cover the cost of imported petrol from its oil and gas revenue, the Minister of Finance, Budget and National Planning, Zainab Ahmed said yesterday.\nThe government had budgeted 1.8 million bpd of production, Ahmed said, blaming crude theft and attacks on oil infrastructure for the shortfall.\n“When the production is low it means we’re … barely able to cover the volumes that are required for the (petrol) that we need to import.”Nigeria exports crude oil and imports refined petrol, suffering intermittent fuel shortages.\nCommenting on the interest rate hike, Ahmed said the central bank move was necessary.\nMeanwhile, the U.S. Federal Reserve’s interest rate hikes, including a 50 basis-point rise earlier this month, alongside Russia’s war in Ukraine and coronavirus lockdowns in China have prompted a move from riskier emerging markets to safe havens."
  },
  {
    "headline": "Buhari Talks Free Polls, Jonathan Attacks National Assembly, Faults Section 84 of New Electoral Act",
    "summarized_story": "And the national assembly cannot make laws to strangle the political parties and that is my thinking on this issue that is quite controversial,” he said.\nYou are inducing the electorate and that’s a criminal offence and the National Assembly should be able to criminalise this.\nSo the National Assembly must have to wake up.\nBefore the president signs any bill into law, it passes through different processes after the national assembly and their committees finish their work,” he noted.\n“You cannot just be taking money and be sleeping and for the national assembly this is a good wake-up call because they have various aides who are employed to do this work."
  },
  {
    "headline": "Sanwo-Olu Emerges Lagos APC Governorship Candidate, Mustapha, Oluwo Disqualified from Exercise",
    "summarized_story": "Segun JamesThe Governor of Lagos state, Mr Babajide Sanwo-Olu has emerged as the All Progressives Congress (APC) governorship candidate for Lagos state.\nSanwo-Olu’s emergence followed the disqualification of his opponents, Olawale Oluwo and Olufemi Mustapha from participating in the exercise by the election committee of the party.\nIn attendance included Deputy Governor, Dr Obafemi Hamzat, Speaker House of Representatives, Rt.\nFemi Gbajabiamila, former Deputy Governors in the State, Lagos APC chairman, State executive council members among others.\nIn his address, Governor Sanwo-Olu said, “I acknowledge all the committee members from Abuja."
  },
  {
    "headline": "Winners of PDP Governorship Primaries (See Table)",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Bashir Ahmad loses bid to secure APC house of reps ticket",
    "summarized_story": "Bashir Ahmad, personal assistant to President Muhammadu Buhari on new media, has lost his bid to represent Gaya/Ajingi/Albasu constituency of Kano state in the house of representatives.\nAhmad, a member of the All Progressives Congress (APC), had contested against Mahmud Gaya, the lawmaker who currently represents the constituency in the house of representatives.\nAdvertisementWith the result, Gaya secured the APC ticket to seek a second term in the house of representatives in the 2023 elections.\nAhmad was said to have left the venue of the primary before the conclusion of the exercise.\nAdvertisement“As an aspirant, I left the venue of primary election for Gaya, Ajingi and Albasu Federal Constituency, because of the security of our majority delegates."
  },
  {
    "headline": "Bashir Ahmad loses bid to secure APC house of reps ticket",
    "summarized_story": "Bashir Ahmad, personal assistant to President Muhammadu Buhari on new media, has lost his bid to represent Gaya/Ajingi/Albasu constituency of Kano state in the house of representatives.\nAhmad, a member of the All Progressives Congress (APC), had contested against Mahmud Gaya, the lawmaker who currently represents the constituency in the house of representatives.\nAdvertisementWith the result, Gaya secured the APC ticket to seek a second term in the house of representatives in the 2023 elections.\nAhmad was said to have left the venue of the primary before the conclusion of the exercise.\nAdvertisement“As an aspirant, I left the venue of primary election for Gaya, Ajingi and Albasu Federal Constituency, because of the security of our majority delegates."
  },
  {
    "headline": "Police arrest Lagos APC constituency chairman over 'illegal distribution of election materials'",
    "summarized_story": "Yomi Olubamido, chairman of the All Progressives Congress (APC) in Somolu constituency 1 in Lagos state, has been arrested for allegedly distributing election materials illegally.\nAccording to NAN, Olaibi Blaize, head of the APC electoral committee for Somolu constituency 1, ordered the arrest of Olubamido on Friday.\nAccording to the electoral committee chairman, tags and accreditation materials were discovered with delegates before the exercise was scheduled to begin.\n“I was told from the APC secretariat in Acme that the election materials have been sent to the local government.\n“I was surprised when l saw the delegates’ tags and other election materials with party members and delegates."
  },
  {
    "headline": "Police arrest Lagos APC constituency chairman over 'illegal distribution of election materials'",
    "summarized_story": "Yomi Olubamido, chairman of the All Progressives Congress (APC) in Somolu constituency 1 in Lagos state, has been arrested for allegedly distributing election materials illegally.\nAccording to NAN, Olaibi Blaize, head of the APC electoral committee for Somolu constituency 1, ordered the arrest of Olubamido on Friday.\nAccording to the electoral committee chairman, tags and accreditation materials were discovered with delegates before the exercise was scheduled to begin.\n“I was told from the APC secretariat in Acme that the election materials have been sent to the local government.\n“I was surprised when l saw the delegates’ tags and other election materials with party members and delegates."
  },
  {
    "headline": "Peter Obi: I'm not desperate to be president",
    "summarized_story": "Peter Obi, former governor of Anambra, says he is not “desperate” to become Nigeria’s president.\nThe former governor had, on Thursday, resigned his membership of the Peoples Democratic Party (PDP).\nOn Friday, Obi announced his decision to join the Labour Party, saying the party is a route to make Nigeria a production country.\nI’m desperate to see Nigeria work, especially for the youths of this country,” he said.\n“This is not the first time I left PDP."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Elon Musk’s Starlink receives approval to provide internet service in Nigeria and Mozambique",
    "summarized_story": "On Friday, Tesla CEO Elon Musk announced on Twitter that Starlink, the satellite internet service launched by SpaceX, his space exploration company, has been approved in Nigeria and Mozambique.\nThis licensing follows a visit to Nigeria by the company’s team in May last year to discuss the possibility of obtaining a licence.\n“The company received two licenses, which include the International Gateway license and Internet Service Provider (ISP) license, and will be trading as Starlink Internet Services Nigeria Ltd.\nStarlink approved by Nigeria 🇳🇬 & Mozambique 🇲🇿https://t.co/Q1VvqVmJ2i — Elon Musk (@elonmusk) May 27, 2022Starlink is a low latency broadband internet system created to meet the needs of consumers in rural areas with low internet penetration across the globe.\nStarlink enters a Nigerian Internet service provider space that is dominated by telcos like MTN and Airtel, as well as individual ISPs such as Spectranet, SMILE and others."
  },
  {
    "headline": "Here are the confirmed speakers for the Africa Mobility Conference",
    "summarized_story": "Share this article:The Africa Mobility Conference organised by GIG Mobility in partnership with Techpoint Africa will be held at Eko Hotel and Suites, Victoria Island, Lagos, on Thursday, June 2, 2022.\nShe will be delivering the first keynote speech and is a panellist in the session discussing policies and environmental drivers for mobility growth.\nHe will be joining the panel discussion on policies and environmental drivers for mobility growth.\nDr Frederic will be delivering the opening note speech and join other panellists in discussing policies and environmental drivers for mobility growth.\nHe will be contributing to the discussion on policies and environmental drivers for mobility growth."
  },
  {
    "headline": "Kenya’s digital products for PwDs",
    "summarized_story": "AdvertisementThis weekend, I’m also following my advice and billing you.\nKenya’s digital products for people with disabilitiesAccording to a report, approximately 40% of Africa’s population is disabled, including 10-15% of school-age children.\nThis means that people with disabilities, and older people who are largely disconnected from most e-government services and business-owned digital platforms, will be connected, supported, and empowered by digital products to increase their digital inclusion.\nAlso, public and private sector digital products and services (like websites and mobile applications) will be more accessible and usable by all Kenyan citizens.\nThis is similar to EnableMe Kenya, an online platform, aimed at providing community-oriented technological support and increasing digital inclusion for people with disabilities."
  },
  {
    "headline": "Dear healthtech startups, Jumia is coming for your bread!",
    "summarized_story": "It also represents a more formidable competitor for existing healthcare startups.\nThis makes it imperative that healthtech startups build solutions for this purpose.\nIn a chat with Techpoint Africa, he said, “Jumia can potentially build out its healthtech play through more partnerships to facilitate diagnostics.\nHealthtech startups, for example, can provide faster and more efficient services by partnering with Jumia.\nDespite being boosted by the COVID-19 pandemic, healthtech startups are still a long way from meeting Africa’s healthcare needs."
  },
  {
    "headline": "How to Transition into Tech in 1 Year",
    "summarized_story": "This piece answers some of your questions about pursuing a career in tech and how to transition.\nA sizeable number of people that transition to tech do so by leveraging their previously acquired skills—though these skills are mostly no-code or non-technical.\nOn a final note:It is very much possible to transition into tech within one year.\nIn the meantime, let’s circle back to where we began:A quick guide on How to Transition into Tech in 1 Year?\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Get a foreign bank account and card in minutes on Geegpay by Raenest",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The world is now fully digital.\nWith Geegpay, African talents can create USD, GBP, and EUR virtual bank accounts for faster payments for their work.\nThey can automate their employer billing through our smart invoicing, and build their credit score while spending with Geegpay virtual card.\nAfter your identity verification, you can then request a virtual bank accountAnd that’s itGeegpay PageIdentity verification and request for a virtual bank account are instant!\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "INEC extends deadline for primaries by one week",
    "summarized_story": "The Independent National Electoral Commission (INEC) has extended the June 3 deadline for the conduct of primary election by political parties for about one week, shifting the new date to June 9, 2022.\nThe full statement read:“The Independent National Electoral Commission (INEC) met with the leadership of political parties today Friday 27th May 2022.\n“Earlier, the political parties had requested for 37 – 60 days extension of the timeline for primaries and the nomination of candidates.\nThe Commission will train four officials from each of the 18 political parties, making a total of 72 in all.\n“Unfortunately, some of the political parties are still yet to submit their nominees for the training."
  },
  {
    "headline": "Peter Obi joins Labour Party",
    "summarized_story": "Peter Obi, a former governor of Anambra State and presidential aspirant, has joined the Labour Party.\nObi’s decision to join the Labour Party is coming less than 48 hours after announcing that he is dumping thePeople’s Democratic Party (PDP).\nThe former governor had been scheduled to participate in the PDP presidential primary scheduled for May 28.\nSpeaking on his decision to join the Labour Party, the presidential hopeful said the party aligns with the interest of Nigerians across different sectors.\n“I invite all Nigerians to join me in taking back our country."
  },
  {
    "headline": "Court clears Jonathan to contest for presidency",
    "summarized_story": "The Federal High Court sitting in Yenagoa has ruled that former President Goodluck Jonathan is eligible to contest the 2023 presidential election.\nThe presiding judge, Justice Isa Hamma Dashen gave the judgement on Friday.\nHe also held that Jonathan’s right to vie for the office of president again cannot be stopped by any retroactive law."
  },
  {
    "headline": "Edo Poly, NIMASA, Port of Antwerp partner on capacity building for dockworkers, seafarers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Chairman of the Greg Ogbeifun Institute of Maritime Technology (GOMIT) at the Edo State Polytechnic, Usen, Engr.\nOgbeifun made the submission during an official visit to the Director-General, Nigerian Maritime Administration and Safety Agency (NIMASA), Dr. Bashir Jamoh and the agency’s management.\nHe was accompanied on the visit by some representatives of the Port of Antwerp, and officials of the Edo State Polytechnic Usen, where GOMIT is domiciled.\nGOMIT is a newly established professional training institute at the Edo State Polytechnic aimed at building capacity in the maritime industry and grooming youths for careers in seafaring and transport management.\nDirector-General, (NIMASA), Dr. Jamoh emphasized the agency’s commitment to the pursuit of capacity domestication, in a bid to save Nigeria’s scarce foreign exchange."
  },
  {
    "headline": "Obaseki eulogizes late Dr. Akele, hails support for reforms in healthcare system – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has eulogized late Dr. Mrs. Clara Akele, hailing her contributions to the development of the state’s health sector while she was alive.\nI think that as Christians, we should take solace given the fact that the person we are here to mourn her transition is a person who lived a good life.\n“She is somebody who lived a good life that was meaningful, not just her immediate family but many members of the society.\n“We thank God for her life; we thank God for her service to humanity.\nWe have every reason to celebrate her life and not be sad about her passage."
  },
  {
    "headline": "Enageed Resource Initiates Free Healthcare, ICT Training for Host Community in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – As part of its Corporate Social Responsibility (CSR) to host communities, Enageed Resource Limited, a Sahara Group Company, has initiated free healthcare, ICT training for the people of Ajoki, in Ovia North East local government area of Edo State.\nThe firm also engaged local contractors in the area on how to improve production, facilitate development, personal financing, and business registration.\nHe also stated that Enageed developed this initiative with the objective to improve the capacity of local community contractors and ensure their businesses continue to grow.\n“To ensure community contractors have the right skills for an increasingly digital and globalized world, the ICT session which is a key component of this training would bridge that gap.\nIn his goodwill message, the Secretary General of Ajoki Community, Scott Omesan, thanked Sahara Group for coming up with the initiative to foster better relationship between it and the host Community."
  },
  {
    "headline": "Edo steps up efforts to contain Lassa fever in communities, to relocate civil service recreation centre – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is ramping up efforts to contain the spread of Lassa fever across communities in the state, with a charge to environmental health officers in various local government areas to ensure zero incidence in their localities.\nThe Edo State Commissioner for Information, Andrew Emwanta, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nEmwanta said Governor Obaseki has also approved the relocation of the Edo State Civil Service Recreation Centre at Osadebe Avenue in the GRA axis of the state to a more suitable location.\nHe said, “According to the Edo State Commissioner for Health, Prof. Akoria Obehi, who is also a member of the State Taskforce on Lassa fever, the state has not had any new case or incident of the disease.\n“The Council has resolved that the environmental health officers of the various local government areas especially those in the affected area of Lassa fever will be held responsible for any new outbreak of Lassa fever."
  },
  {
    "headline": "Amstel Malta Ultra Sponsors Okpekpe 10km International Road Race",
    "summarized_story": "Sports and wellness-supporting brand, Amstel Malta Ultra has doubled down on efforts to strengthen sports culture in Nigeria with its sponsorship of the Okpekpe 10km International Road Race.\n“The Okpekpe 10km International Road Race does not only give indigenous sportsmen the opportunity to participate in a race of international standards, but it also affords them long-distance endurance and high-altitude training needed to compete in prominent events on the global stage,” said Tobiloba Obawede, Brand Manager, Amstel Malta Ultra.\nNow considered a mainstay in the national sporting calendar, the Okpekpe 10km International Road Race, with Amstel Malta’s support, has redefined the face of long-distance racing events in Nigeria.\nThis edition is set to raise the standard even higher, with premium malt brand, Amstel Malta Ultra ardently supporting.\nAmstel Malta Ultra, whose continued support of the Okpekpe 10km International Road Race has earned it the ‘Friend of the race’ title, has also been announced as the official malt drink for the event, reiterating yet again the brand’s commitment to growing not just the African sports community but contributing to the global sports culture."
  },
  {
    "headline": "BREAKING: INEC finally bows to pressure, extends deadline for party primaries",
    "summarized_story": "The Independent National Electoral Commission (INEC) has finally extended the time schedule for the 2023 general elections, after initially refusing to do so.\nHe said, “Earlier, the political parties had requested for 37 – 60 days extension of the timeline for primaries and the nomination of candidates.\n“However, this request is granted in respect of outstanding primaries only without prejudice to those already concluded by political parties.\nThe Commission will train four officials from each of the 18 political parties, making a total of 72 in all.\n“Unfortunately, some of the political parties are still yet to submit their nominees for the training."
  },
  {
    "headline": "BREAKING: INEC rejects political parties’ request to adjust timetable for 2023 polls",
    "summarized_story": "The Independent National Electoral Commission (INEC) has rejected a request by political parties to adjust its timetable for the 2023 general elections.\nINEC Chairman Professor Mahmood Yakubu gave the response during a meeting between the Commission and leaders of political parties under the auspices of the Inter-Party Advisory Council (IPAC).\nHe however noted that the political parties have modified their request from the previous one, where they demanded for an extension of between 37 and 60 days.\nHe said: “This meeting is convened from the request of the political parties, so this is distinct from our regular consultative meetings.\nWe have heard from the IPAC Chairman who on behalf of the political parties again requested for a review of our election timelines."
  },
  {
    "headline": "Alleged N96bn Fraud: Supreme Court decision a vindication of Amaechi – Media office",
    "summarized_story": "The Supreme Court had earlier on Friday, dismissed a suit filed by Amaechi, a former governor of Rivers State and presidential aspirant of the All Progressive Congress, (APC), to stop his planned probe by the commission over alleged N96 billion fraud.\nReacting to the development in a statement on Friday, the media office stated that “The Supreme Court ruling clearly vindicates the former Governor of Rivers State.\nThe apex court was categorical and clear that Amaechi was not on trial.\n“With this judgment, Amaechi has been vindicated and cleared him of all purported or alleged indictment by the Governor Wike’s Commission.\nThe apex court judgment today, further buttressed this stance."
  },
  {
    "headline": "BREAKING: Peter Obi joins Labour Party, says won’t let Nigerians down",
    "summarized_story": "Peter Obi, a former governor of Anambra State, has joined the Labour Party days after announcing his exit from the Peoples Democratic Party (PDP).\nObi who had aspired for president on the main opposition party’s platform but was crowded out, is expected to contest the presidential primary on the platform of his new party.\n“I thank all Nigerians, especially our youths who have joined me in the mission of taking back and reuniting Nigeria,” Obi said in an announcement on his verified Twitter handle.\n“I invite all Nigerians to join me in taking back our country.\n“Be assured that I’ll never let you down.”Dr. Alex Otti, former bank CEO and governorship hopeful in Abia State, had also announced his membership of Labour Party."
  },
  {
    "headline": "Outrage as Brazilian police execute black man Santos with gas [Video]",
    "summarized_story": "The videos of a 38-year-old Brazilian Genivaldo de Jesus Santos gassed to death in the trunk of a police car have triggered outrage across Brazil.\nSantos was killed after getting stopped by highway patrol.\n“They threw some kind of gas inside the trunk and went to the police station, but my uncle was unconscious.\nIn a statement, Brazil’s Federal Highway Police (PRF) said Santos was arrested because he actively resisted an approach by police.\nSantos became ill during the trip to the police station and was then taken to a nearby hospital, where he was pronounced dead, according to the PRF statement."
  },
  {
    "headline": "Buhari's aide Ahmad heavily defeated in Kano, mocked on Twitter",
    "summarized_story": "President Muhammadu Buhari’s new media aide, Bashir Ahmad, has suffered a crushing defeat in his bid to represent a Federal constituency in Kano.\nAhmad was defeated by the All Progressives Congress incumbent Abdullahi Mahmood Gaya, who represents Gaya, Ajingi, Albasu Federal Constituency.\nWhile Gaya scored 109 votes in the poll, Ahmad got a paltry 16 votes.\nAhmad was mocked on Twitter after his loss, with commenters telling him that popularity in the social media does not translate to poll victory.\nPolitics is local”, wrote Kawu Garba, who also mocked Shehu Sani for his loss in Kaduna, despite having 2.2million followers."
  },
  {
    "headline": "Electoral Body, INEC Refuses To Adjust Timetable For 2023 General Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Friday refused several pleas from political parties to adjust the timetable for the 2023 general elections.\nThe INEC Chairman, Prof Mahmood Yakubu, stated this during a meeting between the Commission and leaders of political parties under the auspices of the Inter-Party Advisory Council (IPAC).\nRecall that the electoral body had already fixed Presidential and National Assembly elections for February 25, 2023 while governorship and state assembly elections would be held on March 11, 2023.\nIPAC had earlier asked INEC to extend the deadline for primaries to August 4, but the commission had rejected the request.\nIn his response, the INEC Chairman, Mahmood Yakubu, said the commission would review the political parties’ request."
  },
  {
    "headline": "BREAKING: Court Fixes Judgment Day For Taraba Kidnap Kingpin, Wadume, Others",
    "summarized_story": "Barring any last-minute change, the Federal High Court in Abuja will on June 10 deliver judgment in the case of suspected Taraba State kidnap kingpin, Bala Hamisu, popularly known as Wadume and others charged with conspiracy and kidnapping.\n“Wadume, the kidnap kingpin would be going for judgement on 10th of June,” one of the officials informed SaharaReporters.\nThe police had on February 3, 2020, originally filed 16 counts of terrorism, murder, kidnapping and illegal arms running against Wadume and the others.\nThree policemen and two civilians were killed during the incident, while five other police officers were injured.\nOne of the policemen killed in the incident was Felix Adolije, an Assistant Superintendent, who was described as one of the best among the team known for handling special crime cases across the country."
  },
  {
    "headline": "BREAKING: 2023: Heavy security at Awolowo stadium as Oyo APC guber primary begins",
    "summarized_story": "The security operatives were detailed to man the All Progressives Congress (APC) gubernatorial primary taking place at the stadium today.\nOur correspondent recalls that the primary election was to be held yesterday, Thursday, but was postponed to Friday.\nFollowing the resumption of the primaries, security operatives have been stationed in and outside the stadium in order to ensure a hitch-free primary election.\nOther five candidates all of whom are from Ibadan, are participating in the primary election to secure the ticket of the party ahead of the 2023 general elections.\nThe delegates for the primary election have been screened at the time of filing this report."
  },
  {
    "headline": "BREAKING: Ex-PDP Presidential Aspirant, Peter Obi Joins Labour Party",
    "summarized_story": "Peter Obi, the former governor of Anambra State and a former presidential candidate for the Peoples Democratic Party (PDP), has formally joined the Labour Party (LP) to run for president in 2023.\nObi enrolled as a member of the party in his ward in Anambra State on Friday, according to NEWS DIRECT.\nOn Wednesday, NEWS DIRECT claimed that Obi was preparing to leave the PDP and join the Labour Party.\n“He is leaving for the Labour Party,” a source had told SaharaReporters.\nConsequently, I am by this letter informing you of my withdrawal from the PDP Presidential Primary."
  },
  {
    "headline": "2023: At last, INEC postpones deadline for party primaries",
    "summarized_story": "The Independent National Electoral Commission (INEC) has eventually agreed to extend the deadline given for various political parties to conduct primaries ahead of 2023 general elections.\nEarlier, the political parties had requested for 37 – 60 days extension of the timeline for primaries and the nomination of candidates.\nHowever, this request is granted in respect of outstanding primaries only without prejudice to those already concluded by political parties.\nThe Commission will train four officials from each of the 18 political parties, making a total of 72 in all.\nUnfortunately, some of the political parties are still yet to submit their nominees for the training."
  },
  {
    "headline": "2023: Jonathan eligible to run for president – Court",
    "summarized_story": "While Falana insisted that Jonathan cannot run by virtue of Section 137 (3) of the 1999 Constitution, the Law and Order Group disputed Falana’s assertion.\nThe statement read: “It has been confirmed that former President Goodluck Jonathan has decided to join the APC for the purpose of contesting the 2023 presidential election.\n“It is not in dispute that Dr. Jonathan became the President of Nigeria in 2010 following the sudden death of President Umoru Yar’Adua.\nHaving spent five years in office as President, Dr. Jonathan is disqualified from contesting the 2023 presidential election.\n“Again, it is not in dispute that Jonathan contested the presidential election in 2015 on the basis of the right which accrued to him."
  },
  {
    "headline": "Breaking: Peter Obi joins Labour Party, rallies supporters ahead 2023 general elections",
    "summarized_story": "Two days after quitting People’s Democratic Party, former governor of Anambra state, Peter Obi, has eventually joined Labour party, a platform he hopes to actualise his presidential ambition.\nRead his full statement“The Road to RecoveryI thank all Nigerians, especially our youths, who have joined me in the mission of rescuing and taking back Nigeria.\nThis project is yours and for the future of your children.\nFor me, the process of getting into this high office is as fundamental as what one will do thereafter.\nI invite my fellow Nigerians to join me to take back our country."
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "FBNInsurance Shareholders Approve 74 Kobo Dividend",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSSHAREHOLDERS of FBNInsurance Limited has approved a full year dividend of 74 kobo per ordinary share for the year end 2021.\nSpeaking at the Annual General Meeting, Mr. Val Ojumah, the Managing Director/Chief Executive Officer of FBNInsurance Limited, stated that FBNInsurance financial performance in 2021 demonstrates the company’s strong footing despite the challenging operating environment in 2021.\nThe dividend declared for year 2021 is a 6% increase from 70k that was declared in 2020.\nIt is worthy to note that FBNInsurance Limited has consistently paid dividend to its shareholders in the last eight years.\nFBNInsurance is also a member of the Sanlam Group, a leading diversified, pan-African financial services group."
  },
  {
    "headline": "FCMB Offers Up to N30m Auto Loan to Make Vehicle Ownership Easy",
    "summarized_story": "The FCMB auto loan supports acquiring brand new and pre-owned vehicles (popularly known as “Tokunbo”), with N500,000 as the minimum loan amount that a customer can access for a repayment duration of up to 5 years.\nNigerians can now finance their dream vehicle with an auto loan from FCMB at a low-interest rate with monthly or yearly payment options depending on their income.\nWe, therefore, urge the populace, including, but not limited to salaried individuals, to take advantage of this opportunity to fulfil their vehicle ownership dream”.\nFCMB Auto Loan empowers qualified Nigerians to part-finance the purchase of brand-new and pre-owned vehicles while spreading the repayment between one and five years.\nHowever, vehicle ownership in the country has been declining because of increased prices."
  },
  {
    "headline": "Excess Crude Account, $35.377m as of 25th May 2022 – FG",
    "summarized_story": "602bn in AprilBY ONU OKORIEFederal Government has revealed that the balance in the Nigeria’s Excess Crude Account as of 25th May 2022 stands at $35.377 million.\nThe communiqué indicated that the Gross Revenue available from the Value Added Tax (VAT) for April 2022 was N166.522 billion.\nThe distribution is as follows; Federal Government got N24.978 billion, the States received N83.261 billion, Local Government Councils got N58.283 billion.\nAccording to the communique, Gross Statutory Revenue of N461.189 billion, from which the Federal Government was allocated the sum of N217.412 billion, States got N110.275 billion, LGCs got N85.017, Derivation (13% Mineral Revenue) got N48.485 billion.\nThe communiqué also revealed that Petroleum Profit Tax (PPT), Oil and Excise Duty increased marginally, while Oil and Gas Royalties, Import Duty, Companies Income Tax (CIT) and Value Added Tax (VAT) all recorded significant decreases."
  },
  {
    "headline": "UPDATED: INEC Extends Deadline For Party Primaries By Six Days",
    "summarized_story": "The Independent National Electoral Commission (INEC) has extended the deadline for political parties to conduct their primaries for the 2023 general elections.\nINEC’s National Commissioner and Chairman of Information and Voter Education Committee, Festus Okoye, announced this in a statement on Friday in Abuja.\nThis comes hours after leaders of various political parties met with the leadership of the electoral umpire led by the INEC Chairman, Professor Mahmood Yakubu, at the commission’s headquarters in the nation’s capital.\nAt the meeting, the politicians under the auspices of the Inter-Party Advisory Council (IPAC) again appealed to INEC to adjust the timetable for the forthcoming polls.\n“However, this request is granted in respect of outstanding primaries only without prejudice to those already concluded by political parties."
  },
  {
    "headline": "2023: PDP Ready For National Convention – Committee Chair",
    "summarized_story": "The Chairman of the Peoples Democratic Party’s (PDP) National Convention Organizing Committee (NCOC), Senator David Mark has assured that arrangements have been made for a hitch free exercise on Saturday.\nAddressing members of the committee of the Convention in Abuja ahead of the programme, Senator Mark assured that the exercise will be smooth and transparent.\nHe told members of the committee to brace up to the challenges to ensure a credible exercise, saying “you must be absolutely transparent.\nSenator Mark maintained that the stage is set for a hitch-free programme as all logistics, materials and security have been sorted out.\nThe PDP is expected to elect its presidential flag bearer for the 2023 presidential election on Saturday."
  },
  {
    "headline": "Senator Aishatu Beats Ribadu, Ex-Governor To Win APC Adamawa Guber Ticket",
    "summarized_story": "Senator Aishatu Binani has emerged as the winner of the All Progressives Congress (APC) governorship primary poll in Adamawa State.\nThe Chairman of the APC Adamawa State Electoral Committee, Gambo Lawal, announced the result on Friday.\nA further breakdown of the result showed that Namdas had 94 votes, Theman 21 votes, and Umar Mustapha scored 39 votes.\nWinners Emerge In APC Governorship PrimariesThe primary, which took place at the Lamido Cinema in Yola, the Adamawa State capital, started at about 5:00 pm on Thursday with the accreditation of delegates.\nThe other person to have achieved that feat was the late former Minister of Women Affairs, Aisha Alhassan, who became the APC governorship flag bearer in Taraba State in 2015."
  },
  {
    "headline": "UPDATED: Abaribe Resigns As Senate Minority Leader, Dumps PDP For APGA",
    "summarized_story": "The Minority leader of the Senate, Enyinnaya Abaribe, has resigned from the Peoples Democratic Party (PDP).\nSenator Abribe made his decision known in a letter to the Ward Chairman of the PDP in his ward, Ward 5, Obingwa Local Government Area of Abia State.\nIn a separate letter, Senator Abaribe notified Senate President Ahmed Lawan of his resignation from the PDP.\n“This also means my resignation as Minority Leader of the Senate,” he said.\nThat was why my campaign set sail on a democratic journey that took us to all the nooks and crannies of our dear state.”Below are Abaribe’s letters conveying his resignation from the PDP as well as the Senate Minority Leader’s post:"
  },
  {
    "headline": "I’m Not Desperate To Be President – Peter Obi",
    "summarized_story": "﻿Former Governor of Anambra State, Peter Obi, on Friday said he is not desperate to be President.\nMr Obi made the comment while appearing on Channels Television’s Politics Today.\nAccording to Mr Obi, he left the Peoples Democratic Party for the Labour Party because the former did no longer align with his political values.\nREAD ALSO: Peter Obi Joins Labour Party After Dumping PDP“I’m not desperate to be President or anything,” he said.\n“I would rather lose doing the right thing than win doing the wrong thing."
  },
  {
    "headline": "Breaking: APC postpones presidential primary to 6th, 7th June",
    "summarized_story": "The All Progressives Congress (APC) has postponed its presidential primary election to Monday, June 6 and Tuesday, 7.\nThe APC announced the postponement after the Independent National Electoral Commission (INEC) on Friday evening bowed to pressure by political parties to extend the dates for the conduct of primary elections.\nThe INEC’s statement reads in part:The Independent National Electoral Commission (INEC) met with the leadership of political parties today Friday 27th May 2022.\nEarlier, the political parties had requested for 37 – 60 days extension of the timeline for primaries and the nomination of candidates.\nHowever, this request is granted in respect of outstanding primaries only without prejudice to those already concluded by political parties."
  },
  {
    "headline": "APC youngest presidential aspirant, Felix vows to end insecurity -",
    "summarized_story": "A presidential Aspirant under the platform of All Progressives Congress, APC has pledged to tackle insecurity and revive the private sector for the development of the country if elected as the president of Nigeria in the 2023 general election.\nWhile addressing delegates and stakeholders of the All Progressives Congress APC, in Lafia, the state capital, Dr. Nicolas Felix said if elected as president in 2023, education, agriculture and tackling insecurity would remain his cardinal objectives.\nDr. Felix stressed that it is time to change the nation’s economy by diversifying to agriculture, building industries; manufacture and processing industries, and also increasing fabrication and production.\nHe says his priorities would be tackling insecurity, unemployment and ensuring massive food production across the nation,"
  },
  {
    "headline": "Journalists, delegates scamper for safety as thugs disrupt APC Primary in Akure -",
    "summarized_story": "Journalists and delegates on Friday scampered for safety as thugs disrupted the Akure South/North Primary election with gunshots.\nAs at the time of filing this report, gunshots are still being fired at the venue of Akure North/South Primary election at Ade Super Hotel in Akure, Ondo state.\nOur correspondent reports that trouble started when the votes cast were about to be counted.\nSome journalists who were at the venue have to run for their lives."
  },
  {
    "headline": "Yishawu Gbolahan, Noheem Adams win APC LAHA primaries",
    "summarized_story": "Member representing Eti-Osa Constituency 2 in the Lagos State House of Assembly, Gbolahan Yishawu has won the APC ticket for the Lagos Assembly.\nThe incumbent defeated three other aspirants to emerge victorious in the contest.\nAnnouncing the result, chairman of the electoral committee, Tolani Sulaimon said Mr Yishawu polled the highest number of votes.\nSimilarly, lawmaker representing Eti-Osa Constituency 1, Noheem Adams has emerged candidate of the party for the constituency.\nMr Noheem polled 29 out of 30 votes cast to defeat two other contenders."
  },
  {
    "headline": "Adeseye Ogunlewe: Politics Is A Business, If You Don’t Invest Heavily You Can Never Reap",
    "summarized_story": "APC Chieftain, Senator Adeseye Ogunlewe, speaks on the lack of understanding of politics for aspirants contesting elections, while previewing the just concluded Lagos State APC, Primaries"
  },
  {
    "headline": "Wike Criticises Obi for Dumping PDP, Condemns Amaechi & Nwajiuba’s Ambition – Trending With OjyOkpe",
    "summarized_story": "The governor of Rivers State, Nyesom Wike has reacted to the former Governor of Anambra State, Peter Obi’s exit from the people’s Democratic Party.\nThe outspoken Governor has also criticized the immediate past Minister Of Transportation, Rotimi Amaechi, and the immediate past Minister of State for Education, Emeka Nwajiuba for aspiring to be President in 2023.\nIn another development, a video showing the First Lady of Kogi State, Rashida Yahaya Bello sharing bundles of cash to her domestic staff made the rounds on social media on Thursday.\nA video showing the Lagos State Governor, Babajide Sanwo-Olu celebrating victory with his entourage dancing to Kizz Daniel’s Buga after he secured the governorship ticket of the All Progressives Congress for the 2023 general election on Thursday has made the rounds on social mediaFinally, in Sierra Leone a video of the country’s First Lady Fatima Maada-Bio seen dancing to the Popular song #Buga in what she described as a celebration dance for when her husband returns home from a trip has gone viral on social media."
  },
  {
    "headline": "PDP Presidential Primary: Former Senate President Anyim Protests Absence of Ebonyi Delegates List – Arise News",
    "summarized_story": "Frontline presidential aspirant on the platform of the Peoples Democratic Party (PDP), Senator Anyim Pius Anyim has expressed deep concern on the absence of list of delegates from Ebonyi State, among the list of delegates from other states of the federation, for the national convention of party scheduled to hold on the 28th and 29th of May, 2022 in Abuja.\n“On an examination of the list, I discovered that the Ebonyi State delegates list was not included.\nOn inquiry from the National Organizing Secretary, he informed me that there was a technical error and it will be corrected today.\n12 noon 27th/05/2022, I have no clue about the fate of the delegates from Ebonyi State.\n“The purpose of this letter is to alert all concerned that disenfranchising delegates from Ebonyi State or any state for that matter will fundamentally affect the election”, the open letter warned."
  },
  {
    "headline": "Court Rules That Former Nigeria Leader Jonathan Eligible to Run for President Again",
    "summarized_story": "A Nigerian High Court sitting in Yenagoa has ruled that former President Goodluck Jonathan is eligible to contest the 2023 presidential election.\nHe also held that Jonathan’s right to vie for the office of president again cannot be stopped by any retroactive law.\nIn April, a Senior Advocate of Nigeria Femi Falana had earlier stated that the former president is not allowed by the constitution to contest in the upcoming 2023 presidential election.\nHe said the constitution bars Jonathan from seeking re-election and that his re-election will be a breach of the provision of section 37 of the 1999 constitution.\nHowever the ruling of the Yenagoa court means Jonathan is eligible to contest in the forthcoming All Progressives Congress primaries if he desires and if he meets the party’s requirements."
  },
  {
    "headline": "Ray Liotta: Scorsese, De Niro Lead Tributes to the Late Goodfellas Actor",
    "summarized_story": "Hollywood director Martin Scorsese and actor Robert De Niro have led the tributes to Goodfellas star Ray Liotta, who died this week aged 67.\nScorsese, who directed both in the 1990 gangster crime film, called Liotta a “uniquely gifted” and “courageous” performer.\nThe late actor is best known for his portrayal of mobster Henry Hill in the film, opposite De Niro and Joe Pesci.\nLiotta died in his sleep in the Dominican Republic at the age of 67, it was confirmed on Thursday.\n“I got to work with him on the Bloodstream music video with [music video director] Emil Nava, and got hung out with him at gigs,” posted the English singer-songwriter."
  }
]