[
  {
    "headline": "Smoking during pregnancy increases risk of cleft lip, palate in babies, psychiatrist warns",
    "summarized_story": "Angela OnwuzooWomen who smoke while pregnant are at risk of giving birth to babies with cleft lip and palate, a mental health expert, Dr. Sunday Amosu has warned.\nSpeaking with PUNCH HealthWise in an interview, Dr. Amosu stressed that women who smoke are particularly at risk of giving birth to babies with defects.\nWe can look at the risk of tobacco smoking in pregnancy in terms of the risk to the baby and the risk to the mother.\n“Studies have shown that there is an increased incidence of cleft mouth and cleft lips among children whose mothers smoked during pregnancy.\nThe World Health Organisation says no fewer than 1.2 million people die annually due to exposure to tobacco smoke."
  },
  {
    "headline": "Smoking during pregnancy increases risk of cleft lip, palate in babies, psychiatrist warns",
    "summarized_story": "Angela OnwuzooWomen who smoke while pregnant are at risk of giving birth to babies with cleft lip and palate, a mental health expert, Dr. Sunday Amosu has warned.\nSpeaking with PUNCH HealthWise in an interview, Dr. Amosu stressed that women who smoke are particularly at risk of giving birth to babies with defects.\nWe can look at the risk of tobacco smoking in pregnancy in terms of the risk to the baby and the risk to the mother.\n“Studies have shown that there is an increased incidence of cleft mouth and cleft lips among children whose mothers smoked during pregnancy.\nThe World Health Organisation says no fewer than 1.2 million people die annually due to exposure to tobacco smoke."
  },
  {
    "headline": "DR Congo Ebola outbreak: 233 persons under surveillance, two deaths confirmed —WHO",
    "summarized_story": "Alfred OlufemiThe World Health Organisation has said that no fewer than 233 persons who made contact with two Ebola patients in the Democratic Republic of the Congo, have been tracked and are currently under surveillance.\nThe UN agency in an update released by its African office on Wednesday also reported that two persons have died from the viral disease.\nEbola virus disease, formerly known as Ebola haemorrhagic fever, is a rare but severe illness transmitted to people from wild animals.\nWhile it first broke in 1976, West Africa experienced the largest Ebola outbreak between 2014-and 2016.\nBased on the latest record, DR Congo, a Central African nation, is experiencing its fourteenth Ebola outbreak since 1976."
  },
  {
    "headline": "DR Congo Ebola outbreak: 233 persons under surveillance, two deaths confirmed —WHO",
    "summarized_story": "Alfred OlufemiThe World Health Organisation has said that no fewer than 233 persons who made contact with two Ebola patients in the Democratic Republic of the Congo, have been tracked and are currently under surveillance.\nThe UN agency in an update released by its African office on Wednesday also reported that two persons have died from the viral disease.\nEbola virus disease, formerly known as Ebola haemorrhagic fever, is a rare but severe illness transmitted to people from wild animals.\nWhile it first broke in 1976, West Africa experienced the largest Ebola outbreak between 2014-and 2016.\nBased on the latest record, DR Congo, a Central African nation, is experiencing its fourteenth Ebola outbreak since 1976."
  },
  {
    "headline": "(UPDATED) 2023 Presidency: Why Jonathan can’t contest —Falana",
    "summarized_story": "Femi FalanaLAGOS—HUMAN rights lawyer, Mr Femi Falana, SAN, Wednesday, declared that former President Goodluck Jonathan cannot contest the 2023 presidential election by 137 (3) of the Constitution of the Federal Republic of Nigeria, 1999 (as amended).\nJonathan was elected President of Nigeria in the 2011 election but lost to Muhammadu Buhari in 2015.\nFalana, in a statement, said: “It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress, APC, to contest the 2023 presidential election.\n“He later contested and won the 2011 presidential election.\nHaving spent five years in office as President, Dr. Jonathan is disqualified from contesting the 2023 presidential election."
  },
  {
    "headline": "2023: Don’t allow self-destructive campaigns, Gov Bala Mohammed warns PDP",
    "summarized_story": "John Alechenu, AbujaThe Governor Bala Mohammed Presidential Campaign has urged the People’s Democratic Party to discourage its aspirants from engaging in self-destructive campaigns against each other.\nUdenta Udenta, made the appeal at a media briefing in Abuja, on Thursday.\nHe said this against the backdrop of alleged disparaging remarks made against his principal by Senator Ehigie Uzamere.\nAlso Read:2023: My nomination by northern elders not embargo for others ― Gov Bala Mohammed“The PDP must reign in those using uncouth language against other aspirants.\n“He described the Bauchi State Governor as the most prepared among aspirants seeking to lead Nigeria come 2023."
  },
  {
    "headline": "Customs intercept contraband worth N31.5m in Buhari’s home state",
    "summarized_story": "The Katsina Area Command of the Nigeria Customs Service intercepted contraband which Duty Paid Value was put at N31.\nAlhaji Wada Cedi, the Comptroller in charge of Katsina, made this known while displaying the goods before newsmen in Katsina.\nAlso Read:How Igbo customs checkmated wife batteringCeci said the customs also seized eight vehicles with a DPV of N8.6 million.\nHe said the ban on the export and import of contraband remains in spite of the reopening of the Jibiya border.\n“I want the general public to get this clear, the ban on the importation or exportation of contraband remains enforced."
  },
  {
    "headline": "30 days after train attack, FG should’ve rescued kidnapped victims, says CAN",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Christian Association of Nigeria (CAN) in Kaduna State has said that 30 Days after the Kaduna-Abuja train attack, it’s high time the government rescue innócent Nigerians from captivity.\nRev Joseph John Hayab Chairman, CAN Kaduna State, in a statement on Thursday, said on 28th March 2022, a passenger train from Abuja to Kaduna was attacked, some passengers were killed, others sustained injuries whereas scores were kidnapped.\nCurrently, many households are starving, as many are without jobs, food, and health care, whereas university students are at home because of the ASSU strike.\nMoreover, citizens cannot move freely to seek means to bring succour to their children, wives and aged parents due to fear of bandits and terrorists”.\nMay God delivers Nigeria from evil people and grants us peace and unity,” he said."
  },
  {
    "headline": "Mr & Mrs: Madam knows value of bullion vans",
    "summarized_story": "Mr & Mrs: Madam knows value of bullion vans"
  },
  {
    "headline": "Insecurity threatens Nigeria’s foundations – Gbajabiamila",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has said that the current security challenges in the country are threats to the foundations of Nigeria as a nation.\nThe lawmaker, however, noted that the Federal Government of Nigeria has responded to the challenges by taking necessary measures such as recruiting personnel for security agencies and increasing funding for the police and the military, among others.\nThe Speaker stated this when he delivered a paper titled ‘Democracy in Challenging Times: The Role of African Parliaments in Safeguarding and Delivering on the Dividends of Democracy’ at the School of Oriental Studies, London on Wednesday as part of his ongoing official visit to the UK.\nHe said, “The most pressing of these challenges today is the national security crisis that threatens the foundations of our nationhood and portends great danger for Africa and the world if it persists.\n“The government of the Federal Republic of Nigeria has responded to the reality of our present challenges by increasing funding provisions for the police and armed forces, accelerating recruitment and training to put more boots on the ground and also acquiring weapons systems designed to give the security agencies an advantage.”"
  },
  {
    "headline": "CAN tasks FG with rescuing abducted victims 30 days after Kaduna-Abuja train attack",
    "summarized_story": "The Christian Association of Nigeria (CAN), Kaduna State chapter, has called on the Federal Government to order the security agencies to rescue the 17 women, four children, and 41 males, held hostage, whose photos the terrorists have disrespectfully sent out to the world, 30 days after the Kaduna-Abuja train attack.\nThe statement observed that since then it is now 30 days of agony, sleepless nights, lamentation, shedding of tears, and psychological anguish for the victims, the members of their immediate and extension families, people of conscience, and many well-wishers.\nConsequently, CAN Kaduna State said it frowns at the way these families have been left on their own, especially the lack of adequate and encouraging proof from the government and the agency responsible for rail transportation to douse their fears.\nThe statement stated that as part of utter disregard, not the managing Director of NRC nor the Hon Minister of Transport, who should have resigned and tendered a public apology by now for his or their failure, has acknowledged their oversight in averting the incident.\nIt said to those the terrorists and bandits are holding hostage, they love them and will not cease to pray and play their role till you all come back safely while hoping that the country is liberated from all forms of criminality."
  },
  {
    "headline": "TB Joshua’s Church confirms fire outbreak in Synagogue",
    "summarized_story": "The Synagogue Church of All Nations (SCOAN) has confirmed a fire outbreak at its old site in Agodo, Egbe, Lagos State.\nReports had it that the fire affected the shelter covering the tomb of the late SCOAN founder, Prophet Temitope (T.B.)\nIt added that the cause of the outbreak was unknown and there were no injuries or lives lost.\n”On the evening of Wednesday, April 27, 2022, a fire outbreak occurred at the old site of the SCOAN, located at Agodo, Egbe.\n”Please, disregard any alarmist news aimed at creating panic amongst the church members in particular and the general public."
  },
  {
    "headline": "Presidency: Buhari unpredictable – Okorocha speaks on President’s choice of successor",
    "summarized_story": "Ahead of the 2023 Presidential election, Imo West Senator, Rochas Okorocha has said the choice of President Muhammadu Buhari may surprise Nigerians.\nSpeaking with Channels Television, Okorocha, the Presidential aspirant, said Buhari will consider certain factors before endorsing any politician for the 2023 presidency.\nAccording to Okorocha: “But if you know President Muhammadu Buhari, he is a general.\n“The President Buhari, I know, will want to check the mood of the nation.\nPresident Buhari in making his decision will be guided by so many issues that he has to consider.”"
  },
  {
    "headline": "Plateau attack: Kanam killings would have been averted – Laven indicts Gov Lalong",
    "summarized_story": "The embattled Chairman of Langtang North Local Government Area of Plateau State, Hon.\nJoshua Laven has blamed Governor Simon Lalong over the recent killings in Kanam LGA of the State.\nHe said if the State government had responded swiftly to intelligence reports, the carnage that took place in the aCouncil would have been averted.\nHe also alleged that the Governor failed to make judicious use of local intelligence reports at his disposal.\n“There was also intelligence reports about the attack in Mangu and the next is Langtang North."
  },
  {
    "headline": "JUST IN: Oyo APC gladiators meet at Ajimobi’s residence for peace",
    "summarized_story": "JUST IN: Oyo APC gladiators meet at Ajimobi’s residence for peaceThe leadership crisis rocking the All Progressives Congress (APC) in Oyo State may soon be laid to rest following an ongoing meeting by the gladiators at the Oluyole, Ibadan residence of ex Governor late Abiola Ajimobi.\nThose at the meeting are former First Lady, Dr Florence Ajimobi; embattled State chairman, Isaac Omodewu; Former Deputy Governor Alake Adeyemo; Senator Ayo Adeseun; former Commissioner of Health, Dr Azeez Adeduntan; former SSG, Olalekan Alli and other leaders from all the zones of the State.\nWelcoming the members, Mrs Ajimobi said there was no alternative to peace, urging everyone to work together.\nJournalists were excused from the discussion as the stakeholders meet behind closed doors.\nDetails Shortly…"
  },
  {
    "headline": "Cause of Synagogue fire unknown, says church",
    "summarized_story": "The Synagogue Church of All Nations (SCOAN) said it was yet to determine the cause of Wednesday’s fire outbreak at its old site in Agodo, Egbe, two kilometres from SCOAN headquarters cathedral.\nBut, in a statement, SCOAN said the fire affected a general purpose store while there were no injuries or lives lost.\nThe statement was titled ‘FIRE OUTBREAK AT SYNAGOGUE CHURCH OF ALL NATIONS (SCOAN) OLD SITE: WE ARE ON TOP OF THE SITUATION’.\nIt reads: “On the evening Wednesday, April 27, 2022, a fire outbreak occurred at the old site of the SCOAN, located at Agodo, Egbe; about two kilometres from SCOAN headquarters cathedral.\n“Currently, the cause of the fire is unknown."
  },
  {
    "headline": "2023: Battle for tickets pits governors against senators",
    "summarized_story": "Tension in states over slotsParties moderate struggle for positionsThe battle for senatorial tickets ahead of next year’s elections has pitted governors against senators nursing re-election in many states.\nThere is tension between some governors and senators, based on the fact that the governors may muscle them out because they control the party machinery and the majority of delegates.\nIn Taraba State, Governor Ishiaku Darius, a PDP chieftain, was challenging Senator Emmanuel Bwacha for the Taraba South ticket.\nIn Kebbi, sources said the Progressives Governors Forum, Governor Atiku Bagudu, is eyeing the senatorial ticket in the Central District.\nIn Plateau State, Governor Simon Lalong is battling Senator Nora Daduut for the Plateau South ticket."
  },
  {
    "headline": "PVCs ready for collection in Rivers, Ebonyi",
    "summarized_story": "The Independent National Electoral Commission (INEC) in Rivers State has urged the public to pick their Permanent Voter Cards (PVCs) ahead of the 2023 elections.\n“On no account should anyone’s card be collected by proxy.”The Commission has also begun distributing over 23,000 PVCs in Ebonyi State.\nHe said: “We took delivery of 23,248 PVCs from the INEC headquarters in Abuja on April 20, and distribution has started.\nAccording to him, the commission had deployed 14 machines to each of the 13 councils in the state and the INEC state headquarters for the exercise.\nHe said the commission was poised to ensure that every eligible voter was registered irrespective of area of residence."
  },
  {
    "headline": "Incessant strikes by varsity unions damaging Nigeria’s image, says VC",
    "summarized_story": "Incessant strikes by the Academic Staff Unions of Universities (ASUU), Non- Academic Staff Union (NASU) and Senior Staff Association of Nigerian Universities (SSANU) are damaging the image of Nigeria in the comity of nations, the Vice Chancellor of Al-Hikmah University, Ilorin, Prof Noah Yusuf, has said.\nHe said the strikes did not show the seriousness of the country towards education.\nSaid he: “Incessant strikes by unions in the country’s public universities put a question mark on the government’s seriousness on education.\nThe university scored 100 per cent in the exercise by recording full accreditation status in all academic programmes.\n“The newly accredited programmes are spread across the faculties of humanities and social sciences, natural and applied sciences to education.”"
  },
  {
    "headline": "APC set to disqualify aspirants over resignation",
    "summarized_story": "Governorship, Senate, Federal and State Assembly primary elections to select APC candidates for the general elections, according to the party’s timetable, would hold between May 18 and 23.\nExpectedly, appointees for such positions who did not resign would have lost whatever was left of their chances to contest in the primaries.\nThe APC primary for presidency, according to the ruling party’s timetable, has been scheduled to hold between May 30 and June 1.\nA Federal High Court in Umuahia had nullified Section 84(12) of the Electoral Act, recently passed the National Assembly.\nNgige, while daring the NWC of APC, said his decision was in line with the 1999 constitution."
  },
  {
    "headline": "Abia First Lady, Saraki’s wife eulogise The Sun Awards",
    "summarized_story": "Wife of Abia State Governor, Dr. Nkechi Ikpeazu, as well as wife of former President of the Senate and ex-First Lady of Kwara State, Toyin Saraki, have eulogised The Sun Awards, saying the recognition is well-thoughtout.\nWhile Mrs. Ikpeazu will receive Most Supportive First La-dy award for 2021, Mrs Saraki will be honoured with Humanitarian Service Icon award also for 2021.\n“I know this is a unique award and not every First Lady in the country has received one.\nThe Sun MD said Mrs. Saraki, through Wellbeing Foundation Africa, is tackling many challenges faced by women, children and the less-privileged in Nigeria and beyond.\n“In 2004, when you were the First Lady of Kwara State, you founded the Wellbeing Foundation Africa to drive your mission."
  },
  {
    "headline": "Senate criminalises ransom payment to kidnappers",
    "summarized_story": "From Fred Itua, AbujaThe Senate, yesterday, passed a bill seeking to amend the Terrorism (Prevention) Act 2013, and to prohibit the payment of ransom to kidnappers in the country.\nThe passage of the bill followed the consideration of a report by its Committee on Judiciary, Human Rights and Legal Matters.\nIn the memoranda presented to the committee, several issues relating to terrorism and terrorism financing in line with global best practices were raised.\nBamidele, in his presentation, said the bill sought to outlaw the payment of ransom to abductors, kidnappers and terrorists for release of any person who has been wrongfully confined, imprisoned or kidnapped.\nHe emphasised that the proposed repeal and enactment bill was geared towards improving the effectiveness of countermeasures against terrorism, terrorism financing and proliferation financing."
  },
  {
    "headline": "$418m Paris Club Refund: Court grants substituted service of contempt charge against four SANs",
    "summarized_story": "A Federal High Court in Abuja has ordered that contempt charge be served on four senior lawyers involved in the $418 million Paris Club refund suit through Courier services.\nThe four Senior Advocates of Nigeria (SANs) are Sunday Ibrahim Ameh, Jubrin Okutepa, Garba Tetengi and Olumuyiwa Akinboro.\nThe contempt charge was initiated against them by a private company, Panic Alerts and its sponsor, George Uboh, who accused the lawyers of engaging in wrongdoings in their service to their client.\nThe aggrieved applicants asked the court for an order to serve the contempt charge on the lawyers through a nominated courier company and by pasting same in their respective offices.\nHowever Justice Ekwo proceeded with the ex-parte application and granted the requests of the two applicants."
  },
  {
    "headline": "You’ve shown incapacity, unwillingness to tackle Nigeria’s problems, Afenifere tells Buhari",
    "summarized_story": "From Fred Ezeh, AbujaPan-Yoruba socio-political organisation, Afenifere, yesterday, accused President Muhamamdu Buhari of incapacity and unwillingness of tackling Nigeria’s problems.\nThe organisation said Nigeria needs a government of national unity to tackle its insecurity problems and midwife a new democratic government.\nThe communiqué signed by its National Publicity Secretary, Jare Ajayi, read: “The situation in the country is in a more decisive manner.\n“Afenifere is reiterating its position that restructuring of the Nigerian state must take place before the much-vaunted elections.\nWe also recommend that states that are ready must be allowed to establish their own Police Forces."
  },
  {
    "headline": "THISDAY Presents Video Evidence of Wike’s Unreliability: Praising Amaechi, Obaseki Yesterday, Attacking Them Next Day",
    "summarized_story": "The video further showed that the newspaper’s publication of June 23, 2020, with caption: “With a Friend Like Wike, Obaseki Meets His PDP’s Waterloo; Almost,” was not libelous.\nDuring the cross examination, the witness, Igbanoi, argued that the publication by THISDAY did not make Wike’s political associates and friends to shun or abandon him.\nHe was appointed Director General of Obaseki Campaign Organisation despite the publication an indication that the publication clearly did not injure his public perception.\nLast month, the Rivers State High Court sitting in Port Harcourt had also watched video clips tendered by THISDAY.\nThe governor had claimed during his appearance in court that the publication portrayed him as deceitful, untrustworthy person."
  },
  {
    "headline": "Senate Amends Terrorism Act, in Bid to Stave Off Sanctions",
    "summarized_story": "The passage of the Terrorism (Prevention) Act 2013 (Amendment) Bill, 2022, followed the consideration of a report by the Committee on Judiciary, Human Rights and Legal Matters.\nTwo months ago, the federal government disclosed that it had uncovered 123 companies and 96 other entities linked to terrorism financing.\nThe companies, which were alleged to be conduit for movement of money by terrorists, are yet to be tried by the federal government.\nCurbing terrorism financing has remained a hard nut to crack for the Nigerian government either due to lack of political will or gaps in legislation.\nThe gunmen had ambushed the train heading for Kaduna from the nation’s capital after bombing its rail track."
  },
  {
    "headline": "NALDA Targets 1,000MT of Maize in New Food Security Drive",
    "summarized_story": "James Emejo in AbujaThe National Agricultural Land Development Authority (NALDA) has flagged off its “Aggressive Food Production” project in eight communities in Shendam Local Government Area of Plateau State in a bid to boost food security.The projects involved the cultivation of 200 hectares of maize farm for the 2022 wet season, targeting about 1,000 metric tons at harvest.Other interventions included the provision of five solar powered boreholes for dry season irrigation farming and to serve as source of water supply for the communities as well as distribution of inputs.The Executive Secretary of NALDA, Prince Paul Ikonne, during a visit to the farms, explained that the initiative was part of President Muhammadu Buhari’s efforts to ensure that no matter the level of food crisis that may arise from the effect of the Russia/Ukraine war, Nigeria would have enough food for its citizens.He said, “So these steps we’re taking is to ensure that Nigeria does not experience any form of food shortage or go cap-in-hand looking for food”.The NALDA boss added that the authority had already taken delivery of inputs including seeds, herbicides, pesticides and fertilisers to 600 beneficiary farmers through the traditional ruler and youth leaders.He pointed out that prior to the inputs distribution, land preparation activities had been carried out by the authority.A total of hectares was donated by the communities for the projects with 200 hectares so far made available in the first phase.Ikonne said the targeted yield from the cultivation was 1,000 metric tons of maize which would serve as a great boost to the government’s food security efforts.In addition to the input distribution, goat pens and veterinary clinic are being built by NALDA at a central location for the communities.The clinic and pens which are near completion would serve the veterinary needs of herders and goat breeders in all eight communities.According to him, NALDA is encouraging farmers with the support of the Central Bank of Nigeria (CBN) to aggressively produce food by meeting them at their point of need in their localities.He said, “You can see the excitement on them, this being the first time they’re having federal presence of any kind, this shows how committed Mr. President is in reaching the unreached using agriculture.”It also shows how committed Mr. President is in achieving food security and engaging our youth.\nWhat NALDA is doing at this time is to encourage farmers and individuals to aggressively go into farming in order to achieve food security considering the situation the world would be going into as a result of the Russia/Ukraine war”.Ikonne, further disclosed that there are plans for NALDA to cultivate wheat in the state after the wet season harvest.He assured the farmers of continuous support all through the farming process through extension services to ensure maximum yields -as well as market availability as NALDA would off-take yields from the harvest.The traditional ruler of the communities, Kanankur Sule Longvel while receiving the inputs on behalf of the communities, commended the authority for being the first to bring such an intervention to them.He assured that the inputs would be fully utilised, and further appealed for the construction of access roads to the farms and tractors to be made available to enable them engage in mechanised agriculture.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ex-PDP Ministers List Age, integrity as Criteria for Emergence of Party’s Presidential Candidate",
    "summarized_story": "The former ministers from 1999 to 2015 spoke yesterday when the former Secretary of the government of the federation, Senator Anyim Pius Anyim officially notified them of his presidential aspiration.\nAlso, Anyim tasked the former ministers to ensure that the party adopts a proper political leadership solution for the purposes of exiting Nigeria out of it’s political crisis.\nThe former senate president said that fixing political leadership is panacea to rescuing Nigeria from the present political crisis.\nHe said as a result of leadership failure, Nigeria has not been able to take her rightful place in the comity of developed nations.\nHe pointed out that if Nigerians elect the wrong leader, the country will sink more deeper than she is today."
  },
  {
    "headline": "Zamfara Deposes Two Emirs, District Head over Banditry",
    "summarized_story": "The Zamfara State Government has deposed the of Emirs of Zurmi and Dansadau, Alhaji Abubakar Atiku and Alhaji Hussain Umar Dansadau, respectively, for alleged involvement in banditry activities in the state.\nThe Zamfara State Commissioner for Information, Alhaji Ibrahim Dosara, disclosed this to newsmen yesterday as part of the resolutions of the state executive council meeting, held in Government House, Gusau.\nThe state executive council meeting was chaired by the Zamfara State Acting Governor, Senator Hassan Nasiha.\nThe information commissioner mentioned that the District Head of Birnin Tsaba, Suleiman Ibrahim, has also been removed over similar offences.\nThe Head of one of the committees, Mamman Tsafe, who is the state’s Commissioner for Security Affairs, formally presented the report to Zamfara State Deputy Governor Hassan Nasiha."
  },
  {
    "headline": "EXCLUSIVE: Buhari Extends Tenure Of Nigeria Immigration Service Boss, Isah Jere, Despite Attaining Retirement Age",
    "summarized_story": "President Muhammadu Buhari has approved the extension of the tenure of the Acting Controller-General of Nigeria Immigration Service, Isah Idris Jere.\nAn extension of the tenure of Jere as CGI will lay another bad precedent and will kill the morale of officers and men of the Nigeria Immigration Service.\n\"The officers working with NIS should be allowed to get to the pinnacle of their careers by allowing the young to grow instead of bringing officers from retirement to head the Nigeria Immigration Service.\nIn February 2021, Buhari caused public outrage after extending the tenure of the then Inspector General of Police, Mohammed Adamu, for three months after the police boss’ retirement.\nHowever, despite the public outrage, President Buhari refused to replace him, keeping the 67-year-old in that position to date."
  },
  {
    "headline": "EXCLUSIVE: Buhari Extends Tenure Of Nigeria Immigration Service Boss, Isah Jere, Despite Attaining Retirement Age",
    "summarized_story": "President Muhammadu Buhari has approved the extension of the tenure of the Acting Controller-General of Nigeria Immigration Service, Isah Idris Jere.\nAn extension of the tenure of Jere as CGI will lay another bad precedent and will kill the morale of officers and men of the Nigeria Immigration Service.\n\"The officers working with NIS should be allowed to get to the pinnacle of their careers by allowing the young to grow instead of bringing officers from retirement to head the Nigeria Immigration Service.\nIn February 2021, Buhari caused public outrage after extending the tenure of the then Inspector General of Police, Mohammed Adamu, for three months after the police boss’ retirement.\nHowever, despite the public outrage, President Buhari refused to replace him, keeping the 67-year-old in that position to date."
  },
  {
    "headline": "Why Goodluck Jonathan Can't Contest For Nigerian President Again – Lawyer, Falana",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Femi Falana, says former President Goodluck Jonathan cannot seek re-election into the office of the President, according to the constitution.\nPresident Muhammadu Buhari had on June 4, 2018, signed a constitutional amendment that stops a Vice President who completes the term of a President from contesting for the office of the President more than one more time.\nA President’s term can be cut short by reasons of death, resignation, or death to pave the way for the Vice President to complete the term of the departed President.\nFollowing the death of then-President Umaru Yar’Adua on May 5, 2010, Jonathan as the then Vice President, took a new oath of office to complete Yar’Adua’s term as President.\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress (APC) with a view to contesting the 2023 presidential election."
  },
  {
    "headline": "Why Goodluck Jonathan Can't Contest For Nigerian President Again – Lawyer, Falana",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Femi Falana, says former President Goodluck Jonathan cannot seek re-election into the office of the President, according to the constitution.\nPresident Muhammadu Buhari had on June 4, 2018, signed a constitutional amendment that stops a Vice President who completes the term of a President from contesting for the office of the President more than one more time.\nA President’s term can be cut short by reasons of death, resignation, or death to pave the way for the Vice President to complete the term of the departed President.\nFollowing the death of then-President Umaru Yar’Adua on May 5, 2010, Jonathan as the then Vice President, took a new oath of office to complete Yar’Adua’s term as President.\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress (APC) with a view to contesting the 2023 presidential election."
  },
  {
    "headline": "Why Goodluck Jonathan Can't Contest For Nigerian President Again – Lawyer, Falana",
    "summarized_story": "Human rights activist and Senior Advocate of Nigeria, Femi Falana, says former President Goodluck Jonathan cannot seek re-election into the office of the President, according to the constitution.\nPresident Muhammadu Buhari had on June 4, 2018, signed a constitutional amendment that stops a Vice President who completes the term of a President from contesting for the office of the President more than one more time.\nA President’s term can be cut short by reasons of death, resignation, or death to pave the way for the Vice President to complete the term of the departed President.\nFollowing the death of then-President Umaru Yar’Adua on May 5, 2010, Jonathan as the then Vice President, took a new oath of office to complete Yar’Adua’s term as President.\n“It has been confirmed that former President Goodluck Jonathan has decided to join the All Progressives Congress (APC) with a view to contesting the 2023 presidential election."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "Techstars accelerator solidifies Lagos as Africa’s most attractive tech hub",
    "summarized_story": "Techstars, one of the most influential accelerators in Africa, announced on Tuesday the ARM Labs Lagos Techstars Accelerator for early-stage fintech and proptech startups across the continent.\nWhile the accelerator will be open to startups across the continent, the opportunity highlights the continued focus on Lagos as Africa’s fast-growing tech hub.\nThe ARM Labs Lagos Techstars Accelerator will be the second Techstars-hosted programme on the continent; the first was in South Africa.\nSince then, the accelerator programme has hosted more than 400 Techstars Startup Weekend events across 40 African countries.\nThe ARM Labs Lagos Techstars Accelerator Programme will also allow the partnering companies to tap into Africa’s ever-lucrative fintech sector."
  },
  {
    "headline": "“All startup founders must be financially literate.” – Olumide Adesina",
    "summarized_story": "Share this article:What do you think of when you hear financial literacy for startups?\nIf you’re like most people, you’re probably wondering why startups have to be financially literate, especially when much of the conversation around financial literacy has been about personal finance.\nAs surprising as it is, even businesses need financial literacy.\nHowever, he pointed out that knowing about financial issues does not equate to financial literacy.\nWith many startups opting for venture capital investments, Adesina observed that founders need to be careful while deciding what kind of investment they accept."
  },
  {
    "headline": "Another NFT hack?",
    "summarized_story": "Billed as the next generation of the web, Web3 focuses on decentralisation using decentralised blockchains.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nAnother NFT phishing schemeOn Monday, April 25, 2022, the Instagram account of the popular NFT collection, Bored Ape Yacht Club (BAYC), was hacked.\nEssentially, the hacker duped victims into handing over control of their wallets by creating a fake advertisement for an upcoming NFT project.\nThe hacker tricked users into clicking a link to “mint” a bogus NFT by sending Ethereum (eth) and, in some cases, an NFT to wrap into a token."
  },
  {
    "headline": "Hacking web3 with web2",
    "summarized_story": "On today’s episode of the Techpoint Africa Podcast, we discussed possible changes following the Digital Services Act, NFT scams, and African agritech inventions.\nWith the law not immediately coming into force, it would be interesting to see how tech companies adapt to these changes.\nIf this fuels your distrust or reluctance to get on the web3 train, Bolu says not to worry, as it was an Instagram account that was hacked.\nRegardless, there will be more attempts as web3 technologies catch on, and it will be interesting to see how it plays out.\nYou can always get today’s episode and previous episodes on your favourite podcasts, including Google Podcasts, Apple Podcasts, and Spotify."
  },
  {
    "headline": "Spring sale – great cryptos for lower prices: invest in Logarithmic Finance (LOG), NEAR Protocol (NEAR) and Hedera (HBAR)",
    "summarized_story": "If you are not overly excited about investing in popular cryptos, then take advantage of Logarithmic Finance (LOG) presale pricing!\nLogarithmic Finance (LOG)Logarithmic Finance (LOG), a next-generation Layer-3 swapping protocol, promises to make it easier for innovators and investors to collaborate.\nNEAR Protocol (NEAR)NEAR Protocol (NEAR) is a decentralised platform that focuses on accessibility and secure scalable technology development.\nFor more information:Logarithmic Financehttps://presale.logarithmic.finance/registerhttps://logarithmic.finance/Aquasis Protocol (AQS)https://presale.aquasis.io/https://aquasis.io/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Stanbic IBTC DiSEP: Empowering Nigerian Youths with Digital Skills",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:As part of its continued efforts to equip Nigerian youths with core digital skills, Stanbic IBTC has launched the second edition of the Digital Skills Empowerment Programme (DiSEP).\nTo bridge the gap and provide Nigerians, especially youths the opportunity to acquire digital skills, which will have a positive impact on the economy, Stanbic IBTC introduced the Digital Skills Empowerment Programme (DiSEP).\nDiSEP is an intensive program designed to train Nigerian youths in the most sought after professional certifications in emerging technology e.g.\nStanbic IBTC remains committed to equipping Nigerian youths with the requisite skills and knowledge for personal development and national growth.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Nigerians’ woes worsen on oil sector mismanagement",
    "summarized_story": "Above-the-ground issues have deterred both local and foreign investors from injecting capital in Nigeria’s troubled oil sector, once touted as the goose that lays the golden egg.\nSo, when oil production is stopped because of crude theft or pipeline vandalism, gas production also stops.\nAiteo, an indigenous operator that secured seller financing years ago to acquire the Nembe Creek Trunk line, has abandoned the vital asset and does not even use it to carry its own crude oil because of oil theft and frequent attacks on the pipeline by organised crude oil thieves.\nSome oil sector officials say that while the contempt for JV partners rose to a peak during the days of former oil minister Diezani Alison Madueke, the situation has yet to improve.\nBut, crude oil sales make up one-third of the government’s revenue and about 90 percent of the West African nation’s export earnings."
  },
  {
    "headline": "Why Nigeria is missing out on $100 crude price",
    "summarized_story": "An oil price of $100 per barrel is wonderful news for any oil-producing country, but Nigeria, Africa’s biggest top producer, is not making the most of the rally.\nBased on data from the Organization of Petroleum Exporting Countries’ (OPEC), the other years in history when average crude oil price reached $100 were 2011 ($107), 2012 ($109.45) and 2013 ($105.87).\nOPEC data also show the highest price ever paid for crude oil was between June and July 2008, when a barrel of crude oil was sold for around $130 to $147, although the average crude oil price in 2008 ended up being $94.45 per barrel.\n“Nigeria’s oil assets are facing rising existential risks, which are compounded by wasteful expenditure,” Nwakwue says.\nAccording to the document, Nigeria incurred a subsidy cost of N210.3 billion in January 2022, N219.783 billion in February, and N328.004 billion in March."
  },
  {
    "headline": "Why Jonathan is ineligible to contest again",
    "summarized_story": "Former President Goodluck Jonathan who was defeated by the incumbent in the 2015 election can no longer contest for election to the highest office following the 2018 amendment to the constitution of the federal republic of Nigeria.\nThat amendment rules out Jonathan on the ground that he was sworn to complete the term of the late president Yar Adua and then went on to win another term in 2011.\nAccording to a BusinessDay investigation, on the 26th of July 2017, the Nigerian Senate passed a bill to amend the Constitution.\nIt would seem that all those who are calling on him, including those youths who purportedly stormed his office few days ago, to beckon on him to contest in 2023, are doing so in futility.\nAccording to one lawyer, “it appears that even Jonathan, including his handlers, are either unaware of this provision of the 1999 Constitution as amended or are playing games.”."
  },
  {
    "headline": "How Customs 15% levy denies Nigerians cheaper cars",
    "summarized_story": "This development has resulted in a fresh round of controversy at the nation’s seaport between the Nigeria Customs Service (NCS), car dealers, and the freight forwarders.\nWith the new policy, car dealers bringing in used cars, popularly known as ‘tokunbo’, into the country would be expected to pay 20 percent import duty plus 15 percent NAC levy, amounting to 35 percent duty.\nGiving insight into the issue, Lewis Ogunojemite, a former Customs officer, who faulted the controversial 15 percent NAC levy imposed on imported vehicles, described it as an illegal collection.\nRead also: Trouble trails Customs 15% NAC levy on imported used carsOn the NAC levy, Ogunojemite said the policy was formulated to protect the 36 companies registered to manufacture vehicles in Nigeria but some of them were bringing in new vehicles into the country as made-in-Nigeria cars.\nAccording to him, the levy is supposed to be 2 percent of cost, insurance, and freight on new vehicles or spare parts, and not used vehicles."
  },
  {
    "headline": "Obaseki approves price augmentation, as construction work picks up in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…hands over College of Education Ekiadolor to FG tomorrowThe Edo State Governor, Mr. Godwin Obaseki, has approved price augmentation of contracts for ongoing construction projects in the state to enable contractors cope with the recent increase in the price of construction materials.\nThe Commissioner, Edo State Ministry of Roads and Bridges, Hon Newton Okojie, disclosed this while briefing journalists after the weekly Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, Benin City.\nWith the approval, road construction projects are expected to pick up in Edo as the contracting firms are expected to return to site.\n“The Council approved the memo to create an augmentation of the prices of contracts that will enable our contractors to cope with the increase in the price of construction materials.\nHe said, “The Executive Council has approved the Edo State Policy on Aging which will provide social care and protection for senior citizens."
  },
  {
    "headline": "2023: PDP makes u-turn on zoning, begins screening Friday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPeoples Democratic Party (PDP) National Publicity Secretary, Mr. Debo Ologunagba, Tuesday, said that all those who had obtained the presidential forms were free to contest its presidential ticket regardless of zones.\nHowever, the PDP spokesman explained that the constitution gives all qualified Nigerians the right to contest and not be discriminated against.\nHe said even if the party decided to zone its presidential ticket, it would not stop anybody from contesting.\n“In 1999, the PDP zoned its presidential ticket to the South.\nThe Spokesman for Obi said it was regrettable that the party had decided to jettison the zoning arrangement of the party."
  },
  {
    "headline": "2023: Cross River State Governor joins presidential race – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Consults with Buhari, leaders of the party.\nFollowing a consultative visit to President Muhammadu Buhari, Tuesday, Cross River State Governor, Professor Ben Ayade has declared his intentions to run for president in 2023.\nAyade who met with President Buhari behind closed doors said the President has given him the assurance to go ahead and run if he has the qualities.\nHowever, he said he will continue to consult widely with leaders of the party from the south-south region.\nRecall that the Cross River Governor recently defected from the opposition Peoples Democratic Party to the All Progressive Congress."
  },
  {
    "headline": "Iftar: lnsecurity is a common enemy bedeviling the country –Buhari – Nigerian Observer",
    "summarized_story": "President Muhammadu Buhari, Tuesday, appealed to all political parties in the country to keep elections and election-related differences aside and team-up with his administration’s drive to conquer insecurity in the country.\nThe President, while hosting the members of the business community and the leadership of political parties at Presidential Villa, Abuja, during an Iftar dinner, described insecurity as a ‘‘common enemy’’ bedeviling the country.\nOur country must be kept safe for progress and prosperity to be entrenched.\n‘‘We’ll equally continue to count on the support of the private sector to improve economic growth and create new job opportunities for our teeming population.\nHe said, ‘‘The fact that political leaders of various political parties are sitting with you today speaks volumes that you are truly a democrat and believe in the project of growing democracy in this country.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NNPC spends N675bn on fuel subsidy in 3 month, delivers zero FAAC remittance",
    "summarized_story": "The value shortfall comprises the previous months’ outstanding and part of the February 2022 value shortfall.\nAccording to the document, the national oil company declared zero remittance to the federation account — the third time in 2022.\nIn January, February and March 2022, petrol subsidy gulped 210.38 billion, N219.78 billion, and N245.77 billion, respectively.\nIn February, the federal government postponed the planned petrol subsidy removal, citing “high inflation and economic hardship”.\nThe World Bank had advised Nigeria to rethink its steps in the petrol subsidy policy"
  },
  {
    "headline": "Cadbury Nigeria grows profit by 538% to N1.54 profit for Q1 2022",
    "summarized_story": "Cadbury Nigeria Plc has released its Q1 2022 financial results, reporting a profit of N1.54 billion.\nThe company had declared a dividend of N0.50 kobo for FY 2021, to be paid on June 16, 2022, while Earnings per share for Q1 2022 is N0.82.\nThe N1.54 billion figure represents a massive 538% jump compared to N242 million in the corresponding period of 2021.\nFurther look at the result shows that the company’s profit was driven by significant sales of the company’s geographical segments, the domestic and export sales.\nBoth segments delivered revenue of N12.79 billion in Q1 2022 compared to N8.92 billion in the same period of 2020."
  },
  {
    "headline": "NYSC begins probe as Stephanie Terungwa, Abuja corps member is found dead",
    "summarized_story": "A female corps member in Abuja, Stephanie Terungwa, who was declared missing on April 14, has been found dead.\nThe spokesperson for the National Youth Service Corps (NYSC), Eddy Megwa, announced the development in a statement on Wednesday.\nHe said the late corps member was found wearing the NYSC khaki trouser with her face defaced beyond recognition.\n“The attention of NYSC Management has been drawn to the pictures making the rounds in the social media of a missing corps member deployed to the federal capital territory, Abuja,” the statement said.\n“It was later confirmed that the remains was that of a missing Corps Member, Stephanie Se-Ember Terungwa, with State Code Number FC/21B/5807.”The NYSC spokesman said an investigation has already commenced, adding that those responsible for her death would be brought to book."
  },
  {
    "headline": "FAAC disburses N725.57bn to FG, states, LGAs as March allocation",
    "summarized_story": "Nigeria’s Federation Account Allocation Committee (FAAC), has shared a total sum of N725.571 billion – revenue that was generated in March 2022 – to the federal government, states and local government areas.\nAccording to the communiqué, the N725.571 billion total distributable revenue comprised statutory revenue of N521.169 billion and Value Added Tax (VAT) revenue of N204.402 billion.\nFrom the N521.169 billion distributable statutory revenue, the federal government received N246.444 billion, the state governments received N125.000 billion and the local government governments received N96.369 billion.\nThe sum of N6.322 billion allocation to NEDC and N8.780 billion cost of collection were deducted from the N219.504 billion gross VAT revenue, resulting in the distributable VAT revenue of N204.402 billion.\nFrom the N204.402 billion distributable VAT revenue, the Federal Government received N30.660 billion, the state governments received N102.201 billion and the local government governments received N71.541 billion."
  },
  {
    "headline": "I Have No Hand In Catholic Priest Travails, Says Umahi",
    "summarized_story": "Ebonyi State Governor Dave Umahi has denied having a hand in the ordeals of detained Catholic priest, Rev.\nUchenna Orji, clarified that the Catholic priest is facing criminal charges following his alleged aiding and abetting war and killings in Effium/Ezza Effium community in Ohaukwu local government area.\nOrji insisted that Governor Umahi has no hands whatsoever on the matter, stressing that it is purely a serious security concern handled by the community and security operatives.\nADVERTISEMENT“The security report made available to us indicates that Rev.\nOrji said that the security report further revealed that clergyman is a native of Inikiri Umuezokaoha Ezza Effium, a section of the warring community where the suspected attack occurred."
  },
  {
    "headline": "TETFund Boss Seeks More Investment in Basic Schools",
    "summarized_story": "The executive secretary of Tertiary Education Trust Fund (TETFund), Arc Sonny Echono, has called for more investment in primary and secondary schools to enhance the pursuit of purposive tertiary education, tailored towards meeting the needs of the society.\n“Once you have that solid foundation, you can begin to build on it, and tertiary education is at the apex of that building.\nSo, you begin to reap the reward of your education after tertiary education,” he said.\nThe executive secretary expressed appreciation at the show of support from Governor Lalong, while pledging continued commitment to the development of tertiary education in the state.\nEarlier in his remark, Governor Simon Lalong lauded the fund for the numerous iconic projects dotting the tertiary institutions in plateau State, saying TETFUND has become a lifeline for the schools."
  },
  {
    "headline": "NYSC DG Hails Retired Directors For Meritorious Service",
    "summarized_story": "The director-general of National Youth Service Corps (NYSC), Major General Shuaibu lbrahim has commended the retired directors of the Scheme for their selfless and meritorious service to the Scheme and the nation at large.\nIn a statement by the director, press and public relations, Eddy Megwa, the DG stated this in Abuja during a Send forth ceremony organised for NYSC directors who retired between January 2020 and March 2022.\n“You have mentored millions of youths and l can assure you that we will forever be grateful for your mentorship and service,” General Ibrahim said.\nThe DG admonished the retired and serving NYSC Staff to be mindful of their health status at all times.\nA total of fourteen retired Directors were celebrated and presented with the Director-General’s plaque and gift at the event."
  },
  {
    "headline": "NYSC DG Hails Retired Directors For Meritorious Service",
    "summarized_story": "The director-general of National Youth Service Corps (NYSC), Major General Shuaibu lbrahim has commended the retired directors of the Scheme for their selfless and meritorious service to the Scheme and the nation at large.\nIn a statement by the director, press and public relations, Eddy Megwa, the DG stated this in Abuja during a Send forth ceremony organised for NYSC directors who retired between January 2020 and March 2022.\n“You have mentored millions of youths and l can assure you that we will forever be grateful for your mentorship and service,” General Ibrahim said.\nThe DG admonished the retired and serving NYSC Staff to be mindful of their health status at all times.\nA total of fourteen retired Directors were celebrated and presented with the Director-General’s plaque and gift at the event."
  },
  {
    "headline": "APC, PDP Nomination Fees: Brace For Win-at-all-cost Politics, Third Force Warns",
    "summarized_story": "Condmeming the high fees charged by the two parties, head of public affairs for NCFront, Dr Tanko Yunusa, said the 3rd Force strongly perceives these fees imposed by the two dominant political parties as discriminatory and corruptive.\n“It is not strange to us that both the APC and the PDP now place more premium on money rather than other critical values like character and competence for aspirants that seek political offices.\n“The irrationality of the imposition of prohibitive fees on aspirants can be seen in the light of the worsening official corruption at all levels of governance.\nNigeria cannot survive the booby trap of political monetization as being exhibited today across the country.”“In addition, monetizing the political process with humongous costs would result in more inflation and the cost of winning elections and doing legitimate business in Nigeria would further skyrocket.\nThis is why the 3rd Force is calling on Nigerians, particularly the electorate, to team up with our emergent People’s alternative political platform, evolving into a robust 3rd Force Party, with the ultimate aim of wresting power from both APC and PDP."
  },
  {
    "headline": "2 ex-Chibok schoolgirls Pogu, Bishara bag Masters degrees in U.S.",
    "summarized_story": "Joy Bishara and Lydia Pogu who escaped an abduction by Boko Haram in Chibok, Borno state in 2014 will receive master’s degrees from Florida’s Southeastern University on Friday.\nThe women were among the over 200 Chibok schoolgirls kidnapped by Boko Haram in April 2014.\nSoutheastern University leaders offered scholarships to the women as they finished high school.\nPogu will receive a master’s in human services during Friday’s graduation ceremony, and Bishara will receive a master’s in social work, reports The Ledger based in Lakeland Florida.\nBishara plans to work in a hospital setting as a social worker after graduation, the release said."
  },
  {
    "headline": "EU to suspend all duties on imports from Ukraine",
    "summarized_story": "The European Commission has proposed suspending import duties on all Ukrainian exports to the European Union for one year.\nEU Trade Commissioner Valdis Dombrovskis said on Wednesday, adding that the proposal is termed “an unprecedented gesture of support for a country at war.’’The proposal envisages the suspension for one year of all EU anti-dumping and safeguard measures in place on Ukrainian steel exports.\nIt is designed to help boost Ukraine’s exports to the EU and help alleviate the difficult situation for Ukrainian producers and exporters in the face of Russia’s military invasion.\n“The EU has never before delivered such trade liberalisation measures, which are unprecedented in their scale.\nAlso granting Ukraine zero tariff, zero quota access to the EU market.’’The EU Parliament and the EU countries still have to approve the measure, and changes to the proposal were possible."
  },
  {
    "headline": "JUST IN: Pete Edochie Reacts To Son’s Second Marriage, Bans New Wife From His House",
    "summarized_story": "JUST IN: Pete Edochie Reacts To Son’s Second Marriage, Bans New Wife From His HouseVeteran Nollywood actor, Chief Pete Edochie, has broken silence on his son’s, Yul Edochie, extramarital affairs.\nRecall that Yul had on Wednesday announced that he had a second wife with whom he also had a son.\nHe introduced Judy as his second wife, after 17 years of marriage with May.\nPete who spoke Wednesday outrightly declared bjat son’s newly found second wife Judy Austin persona non grata in his household.\nA child that doesn’t listen to his father end up cutting his or her life span short.”Yul, on Wednesday, welcomed a son with his second wife, Judy Austin, who is also a Nigerian actress."
  },
  {
    "headline": "Fire Guts TB Joshua’s Property, Destroys Tomb Shelter",
    "summarized_story": "The house started burning around 6.30 pm and as I speak with you, fire service officials are trying to put out the fire.\nHe said, “The incident happened at a building belonging to the late pastor.\nThe late pastor usually went there to relax and meditate.\nShe said, “It is confirmed that a section around the tomb of the late pastor TB Joshua caught fire.\nA shelter was built to cover the tomb because it is an open place, so, it was the shelter that caught fire."
  },
  {
    "headline": "‘I found out about the bride price on Monday, I leave them to God’ – May Edochie breaks down, reveals more about Yul Edochie’s betrayal",
    "summarized_story": "‘I found out about the bride price on Monday, I leave them to God’ – May Edochie breaks down, reveals more about Yul Edochie’s betrayalMay Edochie, Nollywood actor Yul Edochie’s first wife has shed more light on her husband’s recent betrayal.\nThe mother of Yul Edochie’s four kids revealed that her husband paid the bride price of his baby mama, Judy Austin on Sunday, April 24, however, she found out on Monday (the next day).\n“I have left them to God,” May Edochie told a popular Instagram blogger.\nYul Edochie who is married to May Edochie with 4 lovely kids (3 boys and a girl) welcomed a bouncing baby with his colleague turned baby mama, Judith Austin.\nIn a swift reaction to his post on Instagram, May Edochie expressed her pains and disappointment, she wrote, “May God judge you both” on the comment section of his post."
  },
  {
    "headline": "BREAKING: Wike Declares PDP Governorship Aspirant Wanted",
    "summarized_story": "The Governor of Rivers State, Nyesom Wike, has declared Hon.\nFarah Dagogo wanted for allegedly hiring cultists to attack the Peoples Democratic Party (PDP) secretariat in Port Harcourt, the state capital.\nIn the light of this development, Governor Wike directed the Rivers State Police Command, CP Friday Eboka to arrest Hon.\nFarah Dagogo for hiring cultists who stormed the PDP secretariat in Port Harcourt, and disrupted the screening of aspirants for various elective positions.\nHon Dagogo was one of the first PDP aspirants to form to contest for the Governorship of Rivers state on 2023."
  },
  {
    "headline": "At last, Nollywood legend, Pete Edochie, breaks silence on son’s second wife, issues ultimatum",
    "summarized_story": "As reactions continue to trail Yul Edochie’s announcement of a second wife with his new son, his father and veteran Nollywood actor, Chief Pete Edochie, has given ultimatum.\nPete who spoke Wednesday outrightly banished son’s newly found second wife Judy Austin from entering his household.\nYul set social media on fire recently after he introduced Judy as his second wife, after 17 years of marriage with May.\nThe veteran actor bore his mind on the second wife and son that Yul had outside his knowledge, after having four children from the first wife.\nA child that doesn’t listen to his father end up cutting his or her life span short.”Yul, on Wednesday, welcomed a son with his second wife, Judy Austin, who is also a Nigerian actress."
  },
  {
    "headline": "APC presidential ticket: Yahaya Bello, Nwajiuba pick forms, thief carts away $75,000",
    "summarized_story": "Bello speaksSpeaking to journalists shortly after picking the forms, Governor Bello promised to unite and secure the country.\n“If at the end of seven days after Ramadan, President Goodluck Jonathan remains undecided, we shall most respectfully repeat our visit to his office for a Second meeting with President Goodluck Jonathan.\n“In furtherance of our position, we have written President Goodluck Jonathan a letter to this effect, which was acknowledged and received by his office yesterday, April 26th, 2023.\n“We earnestly hope that President Goodluck Jonathan fully understands that our future depends on his decision.\nAccording to Akumobi, “Goodluck Jonathan is a custodian of freedom of speech; he is a man with good heart."
  },
  {
    "headline": "Niger guber: Malagi picks EoI, nomination forms, campaign office opens April 30",
    "summarized_story": "Organising Secretary of the Malagi Campaign Group, Barrister Bala Marika, in company with Alhaji Abdulmalik Muye and Hon.\nAlso, several APC flags were seen flying in front of the campaign office while the inscription “Malagi 2023 Governorship Campaign Office, Minna” could be seen boldly on top of the buildings.\n“Malagi is the first among all the governorship aspirants to open campaign office in Minna.\nAlso, Coordinating Secretary of the Malagi for Governor 2023 Campaign Organisation, Barrister Bala Marika, confirmed to Blueprint on the telephone that all was set for the take-off of the office.\n“Yes, we have acquired campaign office in Minna and we are planning to commission it on Saturday."
  },
  {
    "headline": "AIB-N releases interim report on united Airl peace max police Accidents",
    "summarized_story": "By Naomi DouglasAccident Investigation Bureau, Nigeria AIB-N, on Tuesday, released four preliminary reports on serious incidents and accident involving aircraft owned and operated by United Nigeria Airlines Limited, Max Air, Air Peace and the Nigerian Police Air Wing.\nThe preliminary report on the serious incident involving Max Air Boeing 737-300 aircraft, which was parked at the Nnamdi Azikiwe International Airport, Abuja with nationality and registration marks 5N-DAB and was involved in an on-ground collision with Skyway Aviation Handling Co. Plc SAHCO lavatory service truck with fleet number 9/5 on November 21, 2021.\nThe preliminary report on serious incident involving a Boeing 737-300 aircraft owned and operated by Air Peace Limited with nationality and registration marks 5N-BUQ, which occurred after take-off from Sam Mbakwe Airport, Owerri, Nigeria enroute Lagos on November 22, 2021 and finally.\nThe preliminary report on an accident involving a Bell 429 helicopter owned and operated by Nigeria Police Air Wing with Nationality and Registration marks 5N-MDA, which occurred at the Sir Abubakar Tafawa Balewa Airport, Bauchi, Nigeria on January 26, 2022.\nHe explained that the preliminary reports are not final but contained information gathered from witness statements, flight recorders, Health and Usage Monitoring System Hums Data, Flight Data Monitoring FDM data, and preliminary inspection of the accident sites and the wreckages."
  },
  {
    "headline": "MDAs under Ministry of Communication brief new Permanent Secretary",
    "summarized_story": "By Asuelimen OsasuyiAll departments, agencies and unites under the Federal Ministry of Communication/Digital Economy have briefed the newly appointed Permanent Secretary Mr. William Nwankwo Alo about their activities.\nTop official at the ministry told Nigerian Pilot that the Permanent Secretary who assumed office last week needs to meet with all the heads of agencies, departments and unites before hitting the ground running.\nNwankwo Alo, from Ebonyi State was moved from the Police Service Commission to replace Mr. Bitrus Nabasu who retired from service recently.\nNigerian Pilot source said activities at the ministry have been put on hold following the absence of a permanent secretary to give directives since Mr. Bitrus Nabasu went on retirement.\nNow that we a permanent secretary, things will soon begin to work as expected,’’ Our source said."
  },
  {
    "headline": "NDE empowers 235 unemployed persons with enhancement loans in Anambra",
    "summarized_story": "Tony Oraeki, AwkaNo fewer than 235 unemployed persons have benefitted from the dual programmes of Micro Enterprise Enhancement Scheme, MEES, and Start Your Own Business, SYOB, organized by the National Directorate of Employment, NDE, in Anambra state.\nAmong the number of beneficiaries, 228 persons were selected under the MEES group and were empowered with a loan package of #4,560,000 at #20,000 to each person, while 7 persons under SYOB were equally given a total sum of #3,500,000 at the rate of #500,000 per person.\nDisclosing this during the disbursement ceremony yesterday in Awka, the Anambra State Coordinator of NDE, Mrs. Chika Ufelle stated that NDE created this loan scheme to further empower artisans and market women with soft loans in order to enhance their operational capacity under MEES.\n“ It is our strong belief that all the beneficiaries of this loan scheme would judiciously make use of this opportunity to create and enhance their businesses, make more money and employ others.” The Coordinator stated.\nAccording to her, “Another 146 previously trained SADTS and other graduates of agricultural schemes were resettled with a total loan package of #14,600,000 while #100,000 was disbursed to each of the beneficiaries."
  },
  {
    "headline": "OFIs: CBN releases guidance on AML/CFT regulations",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE Central Bank of Nigeria (CBN) has released a guidance note on Anti-Money Laundering (AML) and Combating the Financing of Terrorism (CFT) regulations for Other Financial Institutions (OFIs).\nIn a circular posted on its website, which was signed by the Director, Financial Policy and Regulation Department, Mr. Chibuzo Efobi, the CBN said it developed the guidance note in order “to assist the OFIs in iden-tifying risks associated with money laundering and terrorist financing that will help them in designing effective AML/CFT compliance programme.”The apex bank, however, emphasised that the note “does not constitute secondary regulation or new regulatory requirement.\nIt is intended to assist OFIs to comply with measures contained in the CBN AML/CFT Regulations, 2013 (as amended) and other relevant AML/CFT laws.”It further stated that it does not override any legal or regulatory requirements, adding that “in the event of any discrepancy between the Guidance Note and relevant AML/CFT laws and regulations, the provisions of the latter will apply.” According to the CBN, OFIs should develop and administer AML/CFT programme that is commensurate with their size, complexity of operations and the requirements of extant AML/ CFT Laws and Regulations in the country.\nSpecifically, the apex stated: “OFIs are required to develop an AML/CFT programme, which at the minimum should contain the following: Board and Senior management oversight; Risk Management; Policies and Procedures; Monitoring and Suspicious Transaction Report; Internal Control; Compliance Function and Training."
  },
  {
    "headline": "GTCO records N54.3bn PBT in Q1",
    "summarized_story": "The Group reported profit before tax of ₦54.3billion, representing an increase of 1.1% over ₦53.7billion recorded in the corresponding period March 2021.\nImportantly, our non-banking businesses including Pension Management, Wealth Management and Payments will serve to diversify our earnings capacity as we look to create a model financial services ecosystem for all of Africa.\nGTCO Plc is a fully-fledged financial services group with banking operations across West and East Africa and the United Kingdom as well as non-banking businesses in several key industry segments including Payment, Funds Management and Pension Fund Management.\nWith over 25 million customers and more than 10,000 employees, the Group remains one of the most profitable and best managed financial services companies out of Nigeria.\nIt also retained its position as Africa’s Most Admired Financial Services Brand in the 2021 ranking of The Brand Africa 100: Africa’s Best Brands."
  },
  {
    "headline": "Gov Ayade Says Insecurity Is Beyond Buhari, Calls For International Partnership",
    "summarized_story": "Governor Ben Ayade of Cross River State has called for international partnerships to tackle the rising levels of insecurity in Nigeria, maintaining that the situation is beyond President Muhammadu Buhari.\nThe governor said this on Thursday, explaining that insecurity is not peculiar to the country.\n“It is a global issue with the focus on keeping Nigeria unstable and so you need some international strategic and security connection to actually address the issue.\nBut while President Buhari met challenging situations, he has been able to tackle them, he said.\n“President Muhammadu Buhari met a challenging situation, held it, and has been able to pull back the terrorist attacks and you judge him based on one occasional incident,” the All Progressives Congress (APC) chieftain said."
  },
  {
    "headline": "2023: Osinbajo Visits Oba Of Benin, Says His Desire Is To Serve Nigeria",
    "summarized_story": "Vice President Yemi Osinbajo on Thursday visited the Oba of Benin, Omo N’Oba Uku Akpolokpolo, Ewuare II where he reiterated his desire to serve the country.\nOsinbajo visited the revered monarch as he continues consultations ahead of the 2023 presidential race.\nThe former lecturer, who said he has been exposed to various areas of governance for years, noted that he is experienced to lead Nigeria.\nThe visit to the palace, the Vice President, explained is to inform the Oba of his intention to run for president in the coming election.\nOn his part, the Oba of Benin said he admires the Vice President’s eloquence, calmness, humility, respect for culture, and fear of God."
  },
  {
    "headline": "Army Officer Dies After Shooting Self With AK-47",
    "summarized_story": "A front-line soldier fighting the Boko Haram and Islamic State in West Africa Province (ISWAP) at Geidam community in Yobe State has committed suicide.\nThe personnel named Lance Corporal Abdullahi Jibrin was allegedly fingered during the attacks in Geidam and was later arrested around the Gashua axis.\nThe Assistant Director, Army Public Relations, Sector 2 Operation Hadin Kai in Damaturu, Lieutenant Anyawu Kennedy, confirmed the incident to Channels Television.\nHe later struggled and forcefully used an AK-47 rifle to kill himself”.\n“A committee has been set up by the army to investigate the root cause of his death before making it public.”Geidam a distance of 177 kilometre away from Damaturu, the state capital, was attacked last week which resulted in the death of nine persons."
  },
  {
    "headline": "Strike: ASUU Cannot Dictate Payment Platform For Their Salaries – Nwajiuba",
    "summarized_story": "﻿The Minister of State for Education, Emeka Nwajiuba, has said the Academic Staff Union of Universities (ASUU) cannot dictate to the Federal Government what platform to be used in paying their salaries.\nWe would like them to go back to classes so that students can go back to class,” Nwajiuba added.\nIt is important that ASUU returns to class.”The minister’s comment adds to the continued debates over the payment systems for lecturers in public universities across the country.\nBut ASUU, which down tools over two months ago, believes the government is paying lip service to the lecturers’ agitation.\nAccording to the union’s president, Emmanuel Osodeke, the government’s budgeting of N4trn for subsidy payment is an indication that it is not ready to resolve the crisis."
  },
  {
    "headline": "‘Put The Cocaine Back In’: Elon Musk Jokes About Buying Coca-Cola",
    "summarized_story": "An apparently emboldened Elon Musk has decided to flex his buying muscles further by joking about buying multinational beverage company, Coca-Cola on Thursday.\nAccording to Forbes, the soft drink giant is valued at $286 billion, while boasting of assets worth $94.35 billion as compared to Musk’s net worth of $240.3 billion as of 2022.\n“Next, I’m buying Coca-Cola to put the cocaine back in,” Musk tweeted in reference to the 1886 discontinued recipe for adding cocaine and kola nuts to give the drink its stimulative effect.\nNext I’m buying Coca-Cola to put the cocaine back in — Elon Musk (@elonmusk) April 28, 2022However, many experts have speculated that this shouldn’t be taken as a bluff as the South African has a notoriety for buying things he has joked about.\nHe had made a joke in 2017 about acquiring Twitter in 2017 in a conversation on the platform with comedian Dave Smith."
  },
  {
    "headline": "Ondo: Angry constituents chase Lawmaker out of community over poor performance",
    "summarized_story": "Angry constituents in Owo, Owo Local Government Region, Ondo state, on Monday, chased out Honourable Oluwole Ogunmolasuyi, the lawmaker representing the area in the State House of Assembly, over alleged poor performance.\nOgunmolasuyi, the Majority Leader of the State Assembly representing Owo Constituency 1, was reported to have just escaped being lynched by the enraged youths who hurled stones and sticks at the lawmaker and his entourage.\nWe held a meeting at Iloro Ward and after I left I was told there was an attack by the PDP people.\nIt was after I left Those people in the video are thugs.\nPDP has failed and they are looking for a way to make themselves popular through me”."
  },
  {
    "headline": "Group berates education minister for purchasing APC presidential form -",
    "summarized_story": "Yoruba youth group, Oodua Youth Coalition, has condemned the Minister of State for Education, Chukwuemeka Nwajiuba, for purchasing the ₦100m APC Presidential Form while the education sector is grounded with Academic Staff Union of Universities (ASUU) and research institutes on strike for the past few months.\nIn a statement released in Akure on Wednesday, the National President of OYC, Comrade Oluyi Tayo described the action of the junior Minister as condemnable and reckless.\n“It is now saddening that instead of us to receive news that ASUU strike is over, what we have heard is the junior education Minister purchasing a ₦100m form to contest for the Nigerian President.\nOYC said the lackadaisical attitude of Nwajiuba to the education sector shows that he is not fit to govern Nigeria.\nThe group urged Nwajiuba to refocus and concentrate his energy on firstly getting Nigerian students back on campus and the education system devoid of disruptive academic calendar before aspiring to lead Nigeria."
  },
  {
    "headline": "Gov Tambuwal accepts resignation of 11 Commissioners, SSG, Chief of Staff",
    "summarized_story": "Sokoto state governor, Aminu Tambuwal has accepted the resignation of thirteen key portfolio holders in his administration.\nAt the top of the list is Honourable Manir Muhammad Dan Iya, who was also the Overseer of the Ministry of Local Government and Chieftaincy Affairs.\nA statement signed by the Special Adviser to the governor on Media and Publicity, Mohammed Bello stated that the remaining Commissioners include the commissioners in charge of the Ministries of Finance, Environment, Youths and Sports, Lands and Housing; as well as Careers and Security: Abdussamad Dasuki, Sagir Bafarawa, Bashir Gorau, Aminu Bala Bodinga and Col. Garba Moyi (rtd).\nOther Commissioners who resigned are those of Commerce, Works, Water Resources, Solid Minerals and Religious Affairs: Bashir Gidado, Salihu Maidaji, Shuaibu Gwanda Gobir, Abubakar Maikudi Ahmad and Abdullahi Maigwandu.\nOthers also include the Secretary to the State Government (SSG), Sa’idu Umar and the Chief of Staff, Mukhtar Umar Magori."
  },
  {
    "headline": "Tambuwal accepts resignation of 11 Commissioners, SSG, Chief of Staff -",
    "summarized_story": "Sokoto state governor, Aminu Tambuwal has accepted the resignation of thirteen key portfolio holders in his administration.\nAt the top of the list is Manir Muhammad Dan Iya, who was also the Overseer of the Ministry of Local Government and Chieftaincy Affairs.\nA statement signed by the Special Adviser to the governor on Media a s Publicity, Mohammed Bello stated that the remaining Commissioners include the commissioners in charge of the Ministries of Finance, Environment, Youths and Sports, Lands and Housing; as well as Careers and Security: Abdussamad Dasuki, Sagir Bafarawa, Bashir Gorau, Aminu Bala Bodinga and Col. Garba Moyi (rtd).\nOther Commissioners who resigned are those of Commerce, Works, Water Resources, Solid Minerals and Religious Affairs: Bashir Gidado, Salihu Maidaji, Shuaibu Gwanda Gobir, Abubakar Maikudi Ahmad and Abdullahi Maigwandu.\nOthers who also resigned include the Secretary to the State Government (SSG), Sa’idu Umar and the Chief of Staff, Mukhtar Umar Magori."
  },
  {
    "headline": "Nigeria: MTN Spent N3.4tn on Capital Investments, Paid N3.5tn in Taxes and Levies in 21 Years, Says Toriola",
    "summarized_story": "MTN Nigeria said it spent N3.4 trillion on capital investments and paid N3.5 trillion in taxes and levies to Nigeria’s federal government since it commenced operations in the country 21 years ago.\nSpeaking on the MTN Nigeria and PAU MIP initiative, Toriola said the programme would be handled by PAU’s School of Media and Communication (SMC).\n“The six-month, fully funded fellowship for Nigerian media practitioners is designed to support the sustainable development of the nation’s changing media scene.\n“It is open to media practitioners across the spectrum, including print, electronic, online platforms and social media content creators.\nThus, it is only fitting that we support developments in the Nigerian media space with our infrastructure and enable capacity building initiatives to enable innovation in media practice."
  },
  {
    "headline": "Nigeria’s Senate Amends Terrorism Act, Prohibits Payment of Ransom to Kidnappers",
    "summarized_story": "The passage of the Terrorism (Prevention) Act 2013 (Amendment) Bill, 2022, followed the consideration of a report by the Committee on Judiciary, Human Rights and Legal Matters.\nTwo months ago, the federal government disclosed that it had uncovered 123 companies and 96 other entities linked to terrorism financing.\nCurbing terrorism financing has remained a hard nut to crack for the Nigerian government either due to lack of political will or gaps in legislation.\nHe prayed God to touch the hearts of the kidnappers to show mercy on their innocent and vulnerable victims.\nThe gunmen had ambushed the train heading for Kaduna from the nation’s capital after bombing its rail track."
  },
  {
    "headline": "Nigeria: Presidential Hopeful Tinubu Joins Political, Business Leaders in Saudi Arabia for Prayers and Networking",
    "summarized_story": "The latest personality and political heavyweight to join other Nigerian leaders in prayer at a high octane networking, is the former governor of Lagos State and frontline presidential hopeful, Bola Ahmed Tinubu, who was though in Mecca for the Umrah as with others, however, found the atmosphere conducive for political networking, as usual.\nParticularly, this has become a political culture in Lagos State, where Tinubu was governor for eight years and has continued to dominate its politics in the last 23 years.\nIt was not surprising, therefore, that for an avowed kingmaker, who decided to throw his hat into the ring, joining other like-minds for Umrah, both for prayers and political networking, was almost a question of when.\nBut, as usual, such a gathering always affords us the opportunity to critically look at the state of the nation, particularly, now being an election season.\nYes, we’re – all networking and programming for the 2023 elections,” said one of the political leaders, who is also in Saudi for Umrah."
  },
  {
    "headline": "THISDAY Presents Video Evidence of Wike’s Unreliability: Praising Amaechi, Obaseki Yesterday, Attacking Them Next Day",
    "summarized_story": "The video further showed that the newspaper’s publication of June 23, 2020, with caption: “With a Friend Like Wike, Obaseki Meets His PDP’s Waterloo; Almost,” was not libelous.\nDuring the cross examination, the witness, Igbanoi, argued that the publication by THISDAY did not make Wike’s political associates and friends to shun or abandon him.\nHe was appointed Director General of Obaseki Campaign Organisation despite the publication an indication that the publication clearly did not injure his public perception.\nLast month, the Rivers State High Court sitting in Port Harcourt had also watched video clips tendered by THISDAY.\nThe governor had claimed during his appearance in court that the publication portrayed him as deceitful, untrustworthy person."
  },
  {
    "headline": "AfDB Mobilises $540m for Nigeria to Develop Special Agro-Industrial Processing Zones – Arise News",
    "summarized_story": "The African Development Bank (AfDB) will support Nigeria to develop Special Agro-Industrial Processing Zones, as part of the quest for food security in the country.\nDr Akinwumi Adesina, President of the Bank and a former Minister of Agriculture, disclosed this while briefing President Muhammadu Buhari at State House, Abuja, on Tuesday.\nThe African Development Bank has approved a total of $210 million.\n“I look forward, Your Excellency, to your formal launch of these Special Agro-Industrial Processing Zones, very soon,” Dr Adesina added.\nPresident Buhari commended AfDB for being foresighted and proactive about food security on the continent, and Nigeria specifically."
  }
]