[
  {
    "headline": "SOKAPU distributes relief materials to Kaduna IDPs",
    "summarized_story": "The Southern Kaduna Peoples Union on Thursday distributed various relief materials to natives of 36 Adara communities in the Kachia Local Government Area of Kaduna State.\nThe natives were recently displaced by armed herdsmen attacks.\nSOKAPU’s National President, Hon Jonathan Asake, told the IDPs that they were people who cared much about their plight and had donated to their welfare.\n“I have followed the cruelty that you have had to face in the hands of marauding armed herdsmen and your subsequent displacements, which has also attracted the sympathy of Gov.\n“But the world is watching this criminality against you and other affected communities of Southern Kaduna and by the grace of God, justice shall come one day."
  },
  {
    "headline": "Sallah: NCDC warns of COVID-19 fifth wave",
    "summarized_story": "As Muslim faithful prepare to mark the 2022 Eid-el-Kabir celebrations, the Nigeria Centre for Disease Control has urged Nigerians to prevent the onset of a full-fledged fifth COVID-19 wave by adhering to recommended public health safety measures.\nThe NCDC noted this in its COVID-19 public health advisory issued on Friday amidst the rising cases of infection in the country.\nThe agency said there is a need for religious organisations, community leaders, and Nigerians, in general, to take necessary precautions ahead of the upcoming Eid-el-Kabir celebrations.\nThe agency added that “In addition to the COVID-19 situation in Nigeria and globally, the upcoming Eid-El-Kabir celebrations against a backdrop of suboptimal COVID-19 vaccination uptake and increasing COVID-19 case numbers calls for increased individual and collective responsibility.\n“As we celebrate, we urge Nigerians to prevent the onset of a full-fledged fifth COVID-19 wave by remaining mindful of the high risk of spread of COVID-19 and acting in tandem by adhering to recommended public health safety measures.”"
  },
  {
    "headline": "Full list: Names of 69 Boko Haram escapees from Kuje prison",
    "summarized_story": "The Nigerian Correctional Service on Friday released the names and images of inmates with cases of terrorism who escaped from the Kuje Medium Custodial Centre in Abuja.\nABUBAKAR MOHAMMED SADIQ5.\nABUBAKAR MOHAMMED MUSA30.\nMUHAMMED SANI ADAMU65.\nYUSUF ALI YUSUF"
  },
  {
    "headline": "Rapper, MI, to change stage name after 15 years",
    "summarized_story": "Ace Nigerian rapper, Jude Abaga, popularly known as MI, has disclosed he is set to drop his stage name for a new one, after fifteen years of being identified with it.\nThe award-winning rapper equally revealed that apart from changing his stage name, which fans have become accustomed to, he will be releasing a new album soon.\nRead Also:Tiwa Savage, MI Abaga, Patoranking to perform at grand finale of BBNaijaWorld Teachers Day: Did MI Abaga school Vector with his diss track?\nThe 40-year-old musician went on to encourage his fans to show up for his concert on Sunday, July 10, as it would be the last time he will be using the stage name ”MI Abaga’.\n“My final act as MI will be a performance at The Vibe on the 10th of July, where I will celebrate my legacy as Africa’s Greatest Rapper."
  },
  {
    "headline": "What to know about assassinated ex-Japanese leader, Shinzo Abe",
    "summarized_story": "What to know about assassinated ex-Japanese leader, Shinzo AbeBy Miftaudeen RajiA former Japan’s Prime Minister, Shinzo Abe has been shot dead.\nAbe, according to reports, had been shot at around 11:30 local time in the morning in the city of Nara.\nThese are some of the keynotes to know about the slain former Japanese leader:Former Japanese PM Shinzo Abe has been assassinated while giving a campaign speech in southern Japan Abe immediately collapsed after being shot in the neck and was rushed to hospital.\nAbe served in office between 2006-07 and 2012-20 and he remains the country’s longest-serving PM and best-known figure internationally.\nWhen Russia invaded Ukraine, Abe called for Japan to increase military spending for Kiyv."
  },
  {
    "headline": "Furore over ‘missing’ 72 tractors in Niger State",
    "summarized_story": "And this possibly explains why within a period of 15 years successive governments in the state had procured about 500 tractors to boost mechanised farming and open up rural roads within the state.\nJust last week, the state House of Assembly set up a seven-man committee to investigate the alleged disappearance of over 72 tractors belonging to the 25 local government areas of the state.\nThis followed a Matter of Urgent Public Importance moved at plenary on Tuesday, last week by Abdulmalik Madaki Bosso, member representing Bosso Constituency in the state House of Assembly.\nMLGCO/N/569/1/3 with caption: “Proposal For Refurbishment of Local Government Tractors,” mandated the 25 local government councils to submit the said over 72 tractors to one Messr Dangaroga Allah for refurbishment.\nIn a swift reaction, the state government declared that there are no missing tractors as being alleged in some quarters."
  },
  {
    "headline": "After spending weeks in UK, Ayu returns to Nigeria",
    "summarized_story": "John Alechenu, AbujaThe PDP National Chairman, Dr Iyorchia Ayu, has returned to Nigeria after a two weeks vacation in the United Kingdom.\nAccording to him, the plane conveying the PDP National Chairman, touched down at the Nnamdi Azikiwe International Airport, Abuja, this (Friday) morning.\n“Before travelling out, the PDP national chairman had handed over to the most senior member of the party’s National Working Committee (NWC) i.e.\nUmar Damagun, who is the Deputy National Chairman (North).\n“Besides handing over the deputy chairman (North), Ayu also notified the Independent National Electoral Commission (INEC) of his brief vacation and the temporary handover to Amb."
  },
  {
    "headline": "Osinbajo receives London-Lagos biker, cautions against polio complacency",
    "summarized_story": "According to him, NEC has a committee which deals with polio alone while the council also receives reports on polio from relevant agencies.\nThe vice president said that Adeyanju’s voyage resonated the African/Nigerian story of resilience, hard work and intelligence.\nAdeyanju said that the polio resurgence was because everybody got relaxed and appealed to the vice president to sustain the support for polio funding.\n“So, Sir, on behalf of the Rotary Foundation, Rotary needs your support towards ending polio in Africa,’’ he said.\nThe biker had earlier presented an “End Polio Now“ flag to the vice president."
  },
  {
    "headline": "Eld-el- Kabir: Pray for Oyo, Nigeria to overcome insecurity – Senator Folarin to residents",
    "summarized_story": "The gubernatorial candidate of the All Progressives Congress (APC) in Oyo State, Senator Teslim Folarin has advised Muslims in the state to use the period of the Eld-Kabir festival to pray for the state and Nigeria to overcome the present challenges.\nThe federal government through the minister of interior had declared Monday and Tuesday as public holidays to celebrate the festival.\n“The sacrifice of Prophet Ibraheem, which we celebrate, must spur us on to sacrifice for the progress and prosperity of Oyo State and Nigeria.\n“Fellow citizens of Oyo State, let us celebrate this Holy Festival with optimism and unflinching hope that a better tomorrow awaits the Pacesetter State.\n“Let us take the opportunity of this Holy occasion to pray for Oyo State and Nigeria to overcome the current security and economic crises”."
  },
  {
    "headline": "2023: Why I accepted to be Peter Obi’s running mate – Dati Baba-Ahmed",
    "summarized_story": "Dati Baba-Ahmed has revealed why he accepted to be the running mate of Peter Obi, Presidential Candidate of the Labour Party (LP) for the 2023 elections.\nDAILY POST earlier reported that Senator Datti Baba-Ahmed was announced as the LP vice-presidential candidate in Abuja on Friday.\nSpeaking when he was formally unveiled, Baba-Ahmed said he accepted to be Obi’s running mate because he “believes in Mr Obi’s capacity to make Nigeria live up to its billing”.\nHe added that he also trusts that Obi would not mismanage the nation’s wealth, adding that the outing of the Labour Party candidate as Anambra governor lends credence to that.\nRecall that Dr. Doyin Okupe who was earlier announced as the LP vice-presidential candidate resigned on Thursday."
  },
  {
    "headline": "Buhari reacts to assassination of ex-Japan PM Shinzo Abe",
    "summarized_story": "President Muhammadu Buhari has extended condolences to the family of former Japanese Prime Minister Shinzo Abe.\nBuhari described Japan’s longest-serving PM as an outstanding leader, assuring the family of the prayers and thoughts of all Nigerians.\nHe said Abe will be remembered for his commitment to strengthening trade and investment between Africa and Japan through various initiatives.\nThe President recalled that Abe used the instrumentality of the Tokyo International Conference on African Development (TICAD) for partnerships.\nBuhari prayed that the memory of the deceased would be a blessing to his nation and people, “whom he served so devotedly”."
  },
  {
    "headline": "Eid-El-Kabir: CP Egbuka assures of adequate security in Kogi",
    "summarized_story": "The Commissioner of Police, Kogi State Police Command, CP Edward Egbuka, has assured the state of sustained efforts by the Command in fighting crimes and criminality and improving public safety and security across the state.\nThis according to the statement will help to prevent any untoward situation in their areas of responsibility throughout the Eid-el-Kabir season and beyond.\nAya added that CP Egbuka further directed the Divisional Police Officers to put in place all necessary security measures to ensure a secure, peaceful and hitch-free celebration.\nThe CP according to the statement, however, admonished the good people of Kogi State to remain security conscious throughout the period.\nHe urged them to continue to collaborate with the security forces with credible and useful information on the activities of criminal elements in order to curtail their acts."
  },
  {
    "headline": "Cleric alerts FG, security agencies of possible terrorist attack on Nigerian airports",
    "summarized_story": "Prophet Ade Ologbonyo of the Planter of Christ Apostolic Church has warned the federal government and security agencies of a possible terrorist attack on three major airports in the country.\nOlogbonyo who alerted the government on the alleged plot said God revealed the scary prophecy to him after a marathon of fasting and prayers.\nThe CAC pastor expressed concern about the safety of Nigerians in a 13 minutes video on his verified Facebook page, saying God revealed to him that the Nnamdi Azikiwe International Airport, Abuja, Kaduna International Airport and the Muritala Mohammed International Airport, Lagos would soon be attacked.\nThey should know that there is a plan of an attack on Nigerian airports.\nGod revealed this secret because He doesn’t want it to happen.”Recall that some months before the Owo Catholic Church attack, Prophet Ologbonyo gave a prophesy that such an attack was looming."
  },
  {
    "headline": "50-year-old to die by hanging for killing wife The Nation Newspaper",
    "summarized_story": "50-year-old to die by hanging for killing wifeAn Ondo State High Court sitting in Akure has sentenced a 50-year-old welder, Daniyan Ojo, to death by hanging for causing the death of his wife.\nOjo committed the offence on September 14, 2019, at lrese Road in Shagari Village, Akure.\nOjo was charged with arson, murder and disabling to commit felony.\nAmong the witnesses that testified in the case were a brother of the deceased, Adeniyi Samuel.\nHe ruled that judging from the evidences and testimonies before it, the accused person was guilty as charged and sentenced him to death by hanging."
  },
  {
    "headline": "BREAKING: FG releases identities of 69 fleeing terrorists The Nation Newspaper",
    "summarized_story": "The authorities of the Nigerian Correctional Service (NCoS) have released the photographs of 69 inmates, including Boko Haram insurgents and others who escaped from the Kuje Medium Custodial Centre on Tuesday following attacks on the facility by insurgents.\nBut the names of Hamisu Wadume, the notorious kidnap kingpin from Taraba and Boko Haram Commander, Al Barnawi were not in the list.\nBut the NCoS only indicated that they are wanted Boko Haram insurgents and inmates who escaped from the custodial centre on Tuesday night.\nAmongst the names are Abdulkareem Musa, Abdulsalami Adamu, Abubakar A Habibu, Abubakar M Sadiq, Abubakar Mohammed, Akibu Musa Danjuma, Amodu Omale Salihu, Ismaila Idris Abdullahi.\nOthers are Suleiman Zacharia, Sunday Micheal, Baluye Modu, Adamu Hagola, Ibrahim Musa, Auwal Abubakar, Muktar Umar and Musa Umar, amongst others."
  },
  {
    "headline": "Five Pastors docked for alleged kidnapping in Ondo The Nation Newspaper",
    "summarized_story": "Five Pastors docked for alleged kidnapping in OndoGeneral Overseer of the Whole Bible Believer Church, Ondo, David Anifowose, and four of his assistants have been docked before an Akure Magistrates’ Court for alleged kidnapping.\nOther pastors docked with Anifowose were Josiah Peter 49, Stephen Olawole 51, Blessing John 60 and Gbenga Ayembo Gbenga 56.\nOmhenimhen said the accused persons also took custody and harboured wife and children of one Patrick Olaniyan and blocked access to them.\nThe accused persons were also alleged to have assaulted, resisted and willfully obstructed Inspector Rotimi Ogunji who was on lawful duty at the church’s premises.\nPresiding Magistrate, O.R Yakubu ordered that the accused persons be remanded in police custody."
  },
  {
    "headline": "JUST IN: Buhari, Service Chiefs hold emergency security meeting The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari is holding an emergency meeting with service chiefs, heads of other security services and some Ministers at the Presidential Villa, Abuja.\nThe meeting, which is coming amidst renewed terrorist activities, including Tuesday night’s attack on the Medium Security Custodial Centre, Kuje, in Abuja, is believed to be reviewing recent developments.\nChief of Defence Staff, General Lucky Irabor, Chief of Army Staff, Lieutenant General Farouk Yahaya; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance.\nAlso in attendance are the Inspector-General of Police, Alkali Baba Usman; the Director-General of the Department of State Service (DSS), Yusuf Bichi; and the Director-General of the National Intelligence Agency (NIA), Ahmed Rufai Abubakar.\nChief of Naval Staff, Vice Admiral Awwal Gambo; is being represented at the meeting."
  },
  {
    "headline": "Kuje Prison Attack: Buhari summons security chiefs, presides over emergency security meeting The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has summoned emergency National Security Council meeting with Vice-President Yemi Osinbajo, some cabinet Ministers and all security and service chiefs in attendance.\nNAN reliably learnt that the meeting would deliberate on nation’s security challenges occasioned by the recent attacks on Medium Security Custodial Centre, Kuje, by suspected terrorists where high profile Boko Haram inmates escaped.\nThe Buhari had on Wednesday visited the Custodial Centre, Kuje attacked by the terrorists, where he expressed disappointment with the nation’s intelligence system.\nAfter inspecting some of the points impacted by the attack, Buhari expressed disappointment with the intelligence system and utilization.\nHe said: “I am disappointed with the intelligence system."
  },
  {
    "headline": "BREAKING: Peter Obi unveils Datti Baba-Ahmed as running mate",
    "summarized_story": "Former Governor of Anambra state and the Labour Party presidential candidate, Peter Obi, has unveiled Datti Baba-Ahmed his running mate in the election schedule for February and March 2023.\nSenator Datti Baba-Ahmed, the founder of Baze University, Abuja, was announced the LP vice-presidential candidate in Abuja on Friday.\nBaba-Ahmed’s announcement was coming barely 24 hours after the Director-General, Peter Obi Campaign Organisation, Doyin Okupe, announced his withdrawal as the vice-presidential candidate of the party.\n“This afternoon I submitted my withdrawal letter from the position of the Vice Presidential candidate of the Labour Party to INEC.\nI feel greatly blessed to have been part of the foundation of success 4 the LP,” Okupe tweeted."
  },
  {
    "headline": "Kuje Prison Break: Buhari meets service chiefs in Aso Rock Villa",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently meeting with security chiefs and ministers at State House, Abuja.\nThe meeting is said to be connected to the prison break which saw over 600 inmates escape including Boko Haram insurgents.\nPresent at the meeting are the service chiefs, inspector general of police and the ministers of interior, police affairs, defence, and justice."
  },
  {
    "headline": "Group blasts Ohuabunwa, tells him to be bold enough to blame Ikpeazu over insecurity",
    "summarized_story": "A socio-political group ,Abia North Peace Foundation, (ANPF) has lambasted Senator Mao Ohuabunwa for attempting to use insecurity in Abia State to score cheap political points.\nThe group while reacting to Ohuabunwa’s attack on Senator Orji Uzor Kalu, accused him of over heating the polity ahead of the 2023 general elections.\nOhuabunwa should be bold enough to tell Abians that his friend, Okezie Ikpeazu is the Chief Security Officer of Abia State.\nOhuabunwa is going to be politically retired in 2023; Senator Orji Uzor Kalu won’t descend into the gutter with him.\nWhy didn’t Ohuabunwa attack Governor Okezie Ikpeazu who is the Chief Security Officer of Abia State in his statement?"
  },
  {
    "headline": "Japan’s ex-leader Shinzo Abe assassinated",
    "summarized_story": "When he resigned as prime minister, Abe said he had a recurrence of the ulcerative colitis he’d had since he was a teenager.\nLoyalists said that his legacy was a stronger U.S.-Japan relationship that was meant to bolster Japan’s defense capability.\nAbe was a political blue blood who was groomed to follow in the footsteps of his grandfather, former Prime Minister Nobusuke Kishi.\nAbe became Japan’s youngest prime minister in 2006, at age 52, but his overly nationalistic first stint abruptly ended a year later, also because of his health.\nHe won six national elections and built a rock-solid grip on power, bolstering Japan’s defense role and capability and its security alliance with the U.S."
  },
  {
    "headline": "Ex-leader Shinzo Abe critically shot in shock Japan attack",
    "summarized_story": "(AP)Former Japanese Prime Minister Shinzo Abe, an arch-conservative and one of the country’s most divisive figures, was shot and critically wounded during a campaign speech Friday in western Japan.\nPrime Minister Fumio Kishida said Abe was in “severe condition” and he hoped Abe will survive.\nLoyalists said that his legacy was a stronger U.S.-Japan relationship that was meant to bolster Japan’s defense capability.\nAbe is a political blue blood who was groomed to follow in the footsteps of his grandfather, former Prime Minister Nobusuke Kishi.\nAbe became Japan’s youngest prime minister in 2006, at age 52, but his overly nationalistic first stint abruptly ended a year later, also because of his health."
  },
  {
    "headline": "We Have Mandate to Deliver Kebbi to PDP, Says Ex-Senate Majority Leader – THISDAYLIVE",
    "summarized_story": "Ismail Adebayo in Birnin KebbiFormer Senate Majority Leader and Peoples’ Democratic Party’s (PDP) Candidate for Kebbi North Senatorial, Dr. Yayaya Abdullahi, has said that Senator Adamu Aliero and other decamping from the All Progressives Congress (APC) would deliver all the senatorial seats, governorship and presidency in Kebbi State to the PDP in coming elections.\nAbdullahi said they had promised the PDP to deliver Kebbi North, Kebbi Central and Kebbi South senatorial seats and as well win the governorship and presidential elections in Kebbi State for the party.\nPDP will win the three senatorial seats, governorship and presidency in Kebbi State.\nHe said he was in the PDP secretariat in Birnin Kebbi to pay courtesy visit to the party officials and supporters.\n“After Sallah all those that decamped to the PDP will converge in Birnin Kebbi with our governorship, presidential and other flag bearers of the party to strategies ahead of the general elections,” he said."
  },
  {
    "headline": "Former Japanese Prime Minister Abe Dies After Shooting – THISDAYLIVE",
    "summarized_story": "Former Japanese prime minister Shinzo Abe is dead, after being shot during an election campaign event on Friday morning.\nAbe was Japan’s longest-serving prime minister, from 2012 to 2020.\nAbe, who served four terms in total and became Japan’s longest-serving prime minister, remained a heavyweight political figure even after he stepped down from his last stint as premier in 2020.\nIn September 2006, Abe became prime minister for the first time, but after a year in office, he resigned for health reasons.\nNotepad Former Japanese prime minister Shinzo Abe, who was shot at a campaign event on Friday, still wielded considerable power even after stepping down as premier in 2020."
  },
  {
    "headline": "Another Catholic Priest of Otukpo Dioceses Kidnapped by Gunmen – THISDAYLIVE",
    "summarized_story": "George Okoh in MakurdiUnknown gunmen on Wednesday kidnapped a Priest of the Otukpo Dioceses of Benue State, Reverend Father Peter Amodu.\nAmodu was kidnapped while on his way to celebrate mass at Okwungaga-Ugbokolo area of Okpokwu LGA.\nThe Diocesan Chancellor of the Otukpo, Rev.\nThe Priest of Holy Ghost Parish, Rev.\nMichael Ekwoyi Apochi, has called on all Christ’s Faithful in the Catholic Diocese of Otukpo and beyond to pray for his quick and safe release as we intensify efforts to ensure his release."
  },
  {
    "headline": "Group Petitions AGF over Unfair Distribution of NLNG Train 7 Projects – THISDAYLIVE",
    "summarized_story": "Gilbert EkugbeThe Northern Voices for Equity and Justice (NVEJ) has petitioned the Attorney General of the Federation and Minister of Justice, Mr. Abubakar Malami over what it called an unfair distribution of the ongoing Nigerian Liquefied Natural Gas (NLNG) Train 7 Project contracts across all regions of the country.\nIn a statement made available to journalists, the group led by Kabir Ahmed, alleged that managers of the NLNG Train 7 Project including the contractors, Saipem and Daewoo and the Nigerian Content Development and Monitoring Board (NCDMB) are deliberately awarding contracts on the project to their proxies, associates and cronies to the exclusion of parts of Nigeria.\nDescribing it as a major missing link that continues to fuel the unending divide within the Nigerian socio-economic and political structure, the group maintained that the project remains in excess of $10 billion (N6 trillion).\nIt stated that this is inclusive of Engineering, Procurement, Construction, Installation and Commission (EPCIC) and is expected to stretch till 2027 or a little beyond if everything goes well.\nIt added that in the area of procurement, which is supposedly the low hanging fruit in project execution, the management team must as a deliberate action, provide opportunities on the project to vendors and contractors alike from the North."
  },
  {
    "headline": "2023 General Election Will Be a Referendum for Kwarans, Says APC House of Reps Candidate – THISDAYLIVE",
    "summarized_story": "He also pledged to create necessary infrastructure to harness public opinion, interest and aspiration that would be properly interpreted and advanced at national assembly.\nSaba said he would make it a mission to engage relevant ministries, agencies and departments to ensure that federal government programmes and initiatives are distributed in line with federal character.\nThe APC House of Representatives candidate also promised to ensure that his constituency’s portion in terms of jobs, projects, empowerment is jealously secured.\nThe APC House of Representatives candidate also promised to ensure that his constituency’s portion in terms of jobs, projects, empowerment is jealously secured.\nThe APC House of Representatives candidate also promised to ensure that his constituency’s portion in terms of jobs, projects, empowerment is jealously secured."
  },
  {
    "headline": "BREAKING: Security Outfit, Amotekun Personnel Go Berserk In Ondo, Kill Polytechnic Student, One Other",
    "summarized_story": "Operatives of the Ondo State Security Network Agency, codenamed Amotekun have killed a student of Rufus Giwa Polytechnic, Owo.\nHe was shot by the operatives of Amotekun corps, who invaded a students’ area around the school last week.\nSources told SaharaReporters that the deceased was rushed to Federal Medical Centre in Owo where he died on Thursday night.\nHe was taken to FMC but died last night,” the source told SaharaReporters on Friday.\nOmotosho said the association henceforth would not tolerate the barbarism and unprofessionalism of Amotekun operatives."
  },
  {
    "headline": "BREAKING: Security Outfit, Amotekun Personnel Go Berserk In Ondo, Kill Polytechnic Student, One Other",
    "summarized_story": "Operatives of the Ondo State Security Network Agency, codenamed Amotekun have killed a student of Rufus Giwa Polytechnic, Owo.\nHe was shot by the operatives of Amotekun corps, who invaded a students’ area around the school last week.\nSources told SaharaReporters that the deceased was rushed to Federal Medical Centre in Owo where he died on Thursday night.\nHe was taken to FMC but died last night,” the source told SaharaReporters on Friday.\nOmotosho said the association henceforth would not tolerate the barbarism and unprofessionalism of Amotekun operatives."
  },
  {
    "headline": "After Terrorist Attack On Convoy, Junketing President Buhari To Depart Senegal Friday, Return To Daura For Salah Celebrations",
    "summarized_story": "President Muhammadu Buhari who is currently in Senegal will on Friday depart the country for Nigeria.\nThe President is scheduled to be in his home state, Katsina for the Eid-El-Kabir celebrations, SaharaReporters learnt on Thursday night.\n“The attackers opened fire on the convoy from ambush positions but were repelled by the military, police and DSS personnel accompanying the convoy.\nHowever, a source on Thursday told SaharaReporters that the President would be in Daura on Friday for the Eid-El-Kabir celebration despite the terrorist attacks.\nKankara is about 190 km (a two and half hours drive) by road from Daura while Abuja is some 384 km away."
  },
  {
    "headline": "After Terrorist Attack On Convoy, Junketing President Buhari To Depart Senegal Friday, Return To Daura For Salah Celebrations",
    "summarized_story": "President Muhammadu Buhari who is currently in Senegal will on Friday depart the country for Nigeria.\nThe President is scheduled to be in his home state, Katsina for the Eid-El-Kabir celebrations, SaharaReporters learnt on Thursday night.\n“The attackers opened fire on the convoy from ambush positions but were repelled by the military, police and DSS personnel accompanying the convoy.\nHowever, a source on Thursday told SaharaReporters that the President would be in Daura on Friday for the Eid-El-Kabir celebration despite the terrorist attacks.\nKankara is about 190 km (a two and half hours drive) by road from Daura while Abuja is some 384 km away."
  },
  {
    "headline": "Peter Obi: Kwankwaso's Utterances On Voting Pattern Insult Northern Nigeria, Portray Us As Insensitive People Incapable Of Using Our Brain –Group",
    "summarized_story": "The group noted that Kwankwaso’s utterances portrayed the North as retrogressive.\n“The former governor of Kano State insults the North by portraying us as some insensitive group of people without the capacity to think for ourselves.\n“If that was true in the past, that is set to change, because we are not slaves.\nBut we are disappointed,” the group added.\n“We want to assure fellow Nigerians that Northern Nigeria is not some kind of slave colony where some elites drag us by the neck to vote on the basis of sectionalism or religion."
  },
  {
    "headline": "Naira falls to N615/$ at parallel market ahead of Eid",
    "summarized_story": "The naira has depreciated to N615 a dollar at the parallel market ahead of a two-day holiday for Eid-el-Kabir.\nBureaux De Change (BDC) operators in Lagos told TheCable on Friday that there is high demand for forex at the street market.\nThe street traders put the buying price of the dollar at N610 and the selling price at N615, leaving a profit margin of N5.\nMost people that buy goods outside the country are buying dollar today.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate."
  },
  {
    "headline": "Naira falls to N615/$ at parallel market ahead of Eid",
    "summarized_story": "The naira has depreciated to N615 a dollar at the parallel market ahead of a two-day holiday for Eid-el-Kabir.\nBureaux De Change (BDC) operators in Lagos told TheCable on Friday that there is high demand for forex at the street market.\nThe street traders put the buying price of the dollar at N610 and the selling price at N615, leaving a profit margin of N5.\nMost people that buy goods outside the country are buying dollar today.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate."
  },
  {
    "headline": "Nigeria's oil production rose by 133,000 to 1.16m bpd in June",
    "summarized_story": "Nigeria’s oil production increased to an average of 1.16 million barrels per day (bpd) in June from 1.02 million recorded in May 2022.\nThe figure rose more than 133,000 bpd, representing a 0.13 percent increase from May 2022 output.\nWith the addition of condensate, oil output grew to a total of 1.40 million bpd from 1.28 million posted last month.\nIn January, February, March and April, the country’s oil production averaged 1.39 million bpd, 1.25 million bpd, 1.24 million bpd and 1.22 million bpd, respectively.\nLack of investment, divestments, operational difficulties and oil theft have been identified as issues bedevilling Nigeria’s oil sector."
  },
  {
    "headline": "Nigeria's oil production rose by 133,000 to 1.16m bpd in June",
    "summarized_story": "Nigeria’s oil production increased to an average of 1.16 million barrels per day (bpd) in June from 1.02 million recorded in May 2022.\nThe figure rose more than 133,000 bpd, representing a 0.13 percent increase from May 2022 output.\nWith the addition of condensate, oil output grew to a total of 1.40 million bpd from 1.28 million posted last month.\nIn January, February, March and April, the country’s oil production averaged 1.39 million bpd, 1.25 million bpd, 1.24 million bpd and 1.22 million bpd, respectively.\nLack of investment, divestments, operational difficulties and oil theft have been identified as issues bedevilling Nigeria’s oil sector."
  },
  {
    "headline": "PHOTOS: Buhari meets ministers, service chiefs over Kuje prison attack",
    "summarized_story": "President Muhammadu Buhari is currently meeting with service chiefs and some ministers.\nThe meeting is being held at the presidential villa in the federal capital territory (FCT).\nThe meeting is said to be about the attack on the Kuje correctional facility.\nThe ministry of interior had said about 600 inmates escaped from the prison which is about 50 kilometers away from the presidential villa.\nShuaib Belgore, permanent secretary, ministry of interior, said Boko Haram was behind the attack."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How Nigerian startups can build healthier cultures",
    "summarized_story": "Earlier in May, TechCabal asked 5 employees at different startups what was important to them when considering a job offer.\nBut they ranked something else even higher: company culture.\nTurnover costs startups up to 20% of an employee’s annual salary, and for managerial roles, the costs will go up.\nBucknor uses the 70–20–10 model to explain why it’s important that startups learn how to give constructive feedback.\nThe way you address those needs impact your relationship with the children.”The right incentives, according to Samson-Grace, can boost a startup’s culture."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Datti Baba-Ahmed, Peter Obi’s running mate",
    "summarized_story": "The Presidential candidate of the Labour Party, Peter Obi, on Friday unveiled Datti Baba-Ahmed as his running mate.\nObi who announced Datti Baba-Ahmed as his running mate at exactly 11.01 am, said both of them have began the process to rescue and rebuild Nigeria, from the ruins of misrule by the All Progressive Congress (APC).\nHe cannot have a P.hD in Economics for nothing”Meet Yusuf Datti Baba-AhmedYusuf Datti Baba-Ahmed is 46 years old, with rich background as an academician, a businessman and politician.\nIn 2011, Datti Baba-Ahmed established Baze University, an independent University located in Abuja, Nigeria.\nIn 2019, he contested the Presidential primaries of the Peoples Democratic Party, which was eventually won by Atiku Abubakar, with Peter Obi as Atiku’s running mate."
  },
  {
    "headline": "Nigerian hospitals explore deceased-donor kidney transplant",
    "summarized_story": "With kidney failure on the rise in Nigeria, hospitals are exploring the deceased-donor transplant option as organ donation, which is often transactional, from living donors remains low.\nAlmost two in every 10 Nigerian adults suffer either chronic or acute kidney failure, according to the Nigerian Association of Nephrology (NAN).\nOnly a few well-heeled patients are able to get kidney donation in a process that some experts worry could have been induced by financial rewards.\nExperts say there is a wave of cadaveric organ donation being explored across the world, and Nigeria can benefit from it.\nShe said the inflammation of the kidney, HIV, hereditary kidney diseases, toxic concoction and obstruction of the urinary tract are also drivers."
  },
  {
    "headline": "Why PIA hasn’t attracted investments to Nigeria – IOCs",
    "summarized_story": "He spent some time lauding the passage of the PIA, saying, however imperfect it was, it had brought some sort of clarity.\nOther international oil companies’ (IOCs) representatives on the panel including Mike Sangster, managing director of TotalEnergies Nigeria, agreed.\n“It’s good that we have the PIA and the full impact on investments will take some time to materialise,” Okunbor said.\nThe Buhari government’s inability to rein in crude theft is the biggest turn-off for investors.\nHeirs Oil & Gas averaged losses of 66 percent from Oil Mining Licence (OML) 17 in 2021, peaking at 97 percent in December."
  },
  {
    "headline": "You have made us proud, Osinbajo tells London-Lagos rider, Adeyanju – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe achievements of the internationally acclaimed Nigerian biker, Mr Kunle Adeyanju has made Nigerians proud and the country is much popular on account of his feat, according to Vice President Yemi Osinbajo, SAN.\nAdeyanju shared his travel experience during the visit to the VP, while speaking later, the Vice President said his stories are those “we must tell and retell.\nAnd all of us have capacity and all of us have everything that it takes to excel,” the Vice President added.\nHe explained that his lifted fist signature while on the journey was copied from the Vice President indicative of Africa’s resilience and strength even in the face of adversity.\nAnother highpoint of the visit was the presentation of the bikers’ regalia to the Vice President and some of the symbolic exercises demonstrated by the bikers."
  },
  {
    "headline": "CSO charges INEC chair, Edo REC on improved voters’ registration in Edo North – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA civil society organisation, the Network of Civil Society Organisations of Nigeria (NOCSON) has urged the Independent National Electoral Commission (INEC) to deploy more registration machines to Edo North Senatorial District to address the insufficiency in human and material resources in the wake of the surge in registrations in the senatorial district.\nAccording to him, “It has come to the attention of NUCSON that the Edo North Senatorial District is lagging behind in the Continuous Voter Registration (CVR).\nThis is evident from the feeders from our foot soldiers and members, signifying strongly that the ongoing INEC registration exercise in the country is not being pursued vigorously in the district.\n“The statistical distribution across the six local government areas of the district reveals that the data from the district is deplorably disproportionate relative to other districts in the state.\nOur findings reveal that there are not enough registration centres, INEC registration machines and personnel available in the district, thereby limiting access for potential voters to register.”“This scenario portends both disenfranchisement of Edo North voters willing to vote in the 2023 general elections and undermining their electoral rights."
  },
  {
    "headline": "Obaseki celebrates Okowa at 63, lauds contributions to national devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has congratulated his Delta State counterpart, Dr. Ifeanyi Okowa, on his 63rd birthday, lauding his contribution to the development of Delta State and Nigeria.\nObaseki said: “On behalf of the Government and people of Edo State, I congratulate my dear brother and friend, Governor Ifeanyi Okowa, as he celebrates his 63rd birthday.\n“Governor Okowa has demonstrated commitment to the betterment of his people and continues to serve as a democrat who believes in the unity and progress of Nigeria.”He added, “As we prepare for the 2023 Presidential election, I am confident that as Vice Presidential candidate of our great party, the Peoples Democratic Party (PDP), Governor Okowa will have the opportunity to extend his impactful programmes across Nigeria.\nI wish you excellent health and God’s continued guidance as we all work to rescue Nigeria.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Okowa Has Redefined Governance In Delta State – BELLO – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – The Financial Secretary of the Peoples Democratic Party ( PDP) in Delta State, Hon.\nCollins Bello, has said that Governor Ifeanyi Okowa had redefined governance in the state.\nAccording to him, “Governor Okowa has fulfilled his promise to Deltans through massive developmental and transformational strides across the state.\n“The Governor of Delta state and Vice-Presidential candidate of the PDP has given us the enablement to give back to our constituents.\nTwo aides to the Delta Governor , Hon."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "PHOTOS: FG discloses identities of terrorists who escaped from Kuje prison",
    "summarized_story": "Nigeria’s federal government has declared wanted all Boko Haram suspects who fled Kuje Security Custodial Centre in Abuja following an attack by terrorists on Tuesday night.\nRecall that several terrorists of the Islamic State of West African Province (ISWAP) had attacked the correctional centre on Tuesday night.\nAccording to the Minister of Defence, Maj. Gen Bashir Magashi, all the Boko Haram terrorists kept in the facility escaped during the attack.\nIn a statement on Friday, the Nigerian Correctional Service (NCoS) revealed the names and photos of the 69 Boko Haram inmates who escaped from the correctional facility following an attack by terrorists on Tuiesday.\n“The following are faces and names of inmates with Boko Haram/ terrorism cases who escaped from Kuje Correctional Centre during the jail attack on 5th July 2022,” it said."
  },
  {
    "headline": "JUST IN: Buhari summons security chiefs over Kuje Prison attack",
    "summarized_story": "Muhammadu Buhari, Nigeria’s president, has summoned an emergency National Security Council meeting with Vice-President Yemi Osinbajo, some cabinet Ministers and all security and service chiefs in attendance.\nNAN reliably learnt that the meeting would deliberate on nation’s security challenges occasioned by the recent attacks on Medium Security Custodial Centre, Kuje, by suspected terrorists where high profile Boko Haram inmates escaped.\nThe Buhari had on Wednesday visited the Custodial Centre, Kuje attacked by the terrorists, where he expressed disappointment with the nation’s intelligence system.\nAfter inspecting some of the points impacted by the attack, Buhari expressed disappointment with the intelligence system and utilization.\nHe said: “I am disappointed with the intelligence system."
  },
  {
    "headline": "BREAKING: Peter Obi unveils Datti Baba-Ahmed as running mate",
    "summarized_story": "Mr. Peter Obi, Labour Party presidential candidate, has unveiled Senator Yusuf Datti Baba-Ahmed as his running mate.\nOkupe who announced his withdrawal via his verified Twitter handle @doyinokupe noted that his party would announce the new running mate to the presidential candidate.\n“This afternoon I submitted my withdrawal letter from the position of the Vice Presidential candidate of the Labour Party to INEC.\nDr. Otti said, “I welcome with excitement Mr. Peter Obi’s choice of Dr. Yusuf Datti Baba-Ahmed, a seasoned economist, as our party’s Vice Presidential flag bearer.\n“The Labour Party has once again affirmed its readiness to do things differently by the calibre and track records of its candidates.”"
  },
  {
    "headline": "Baba-Ahmed: Labour Party has again shown its readiness to do things differently -Alex Otti",
    "summarized_story": "Dr. Alex Otti, candidate of the Labour Party for Abia State governorship election in 2023, has hailed the choice of Yusuf Datti Baba-Ahmed, an economist and businessman as the party’s vice presidential candidate, noting that it is another indication that Labour is ready to do things differently.\nBaba-Ahmed, a philanthropist and politician, was unveiled as Mr. Obi’s running mate on Friday.\nReacting to the development in a post via his twitter handle, Dr. Otti said, “I welcome with excitement Mr. Peter Obi’s choice of Dr. Yusuf Datti Baba-Ahmed, a seasoned economist, as our party’s Vice Presidential flag bearer.\n“The Labour Party has once again affirmed its readiness to do things differently by the calibre and track records of its candidates.”"
  },
  {
    "headline": "Burna Boy releases 6th studio album, ‘Love Damini’",
    "summarized_story": "Damini Ebunoluwa Ogulu, Grammy-winning Afrobeats star, popularly known as Burna Boy, released his sixth studio album, “Love Damini”, at midnight on Friday.\nSpanning 19 tracks, the album features artistes like Ed Sheeran, Victony, and Black Mambazo.\n“Love Damini” comes after his widely acclaimed 2020 album “Twice As Tall”, which in 2021 won the Grammy category of Best Global Music Album.\nIn 2020, he was nominated for the World Music category for his album “African Giant”.\nBurna Boy celebrated his 31st birthday last Saturday, his many fans online sending him their prayers and felicitations."
  },
  {
    "headline": "Odumeje: Soludo Condemns Taskforce’s Action, Promises Sanctions",
    "summarized_story": "“Yesterday’s outing has evoked emotions, not against the decision of government, but the imperfect and unprofessional manner with which one of the task force members discharged his lawful duty.\nI have instructed that the task force personnel involved in the manhandling of Prophet Chukwuemeka Ohanaemere (Odumeje) be treated in accordance with the rules of public conduct which he roundly failed to uphold.\n“Let me sincerely appreciate ndị Anambra for understanding with us as we take audacious steps towards making our Homeland Liveable and Prosperous.\nOn this journey, imperfect steps will be taken, emotions will run wild and opinions will grow thick,” the governor said.\nOn behalf of the government and good people of Anambra State, I condemn the assault, and further ask for your continued support in the fight to restore the dignity of Onitsha, and indeed the totality of our Homeland,” he stated."
  },
  {
    "headline": "Odumeje: Soludo Condemns Taskforce’s Action, Promises Sanctions",
    "summarized_story": "“Yesterday’s outing has evoked emotions, not against the decision of government, but the imperfect and unprofessional manner with which one of the task force members discharged his lawful duty.\nI have instructed that the task force personnel involved in the manhandling of Prophet Chukwuemeka Ohanaemere (Odumeje) be treated in accordance with the rules of public conduct which he roundly failed to uphold.\n“Let me sincerely appreciate ndị Anambra for understanding with us as we take audacious steps towards making our Homeland Liveable and Prosperous.\nOn this journey, imperfect steps will be taken, emotions will run wild and opinions will grow thick,” the governor said.\nOn behalf of the government and good people of Anambra State, I condemn the assault, and further ask for your continued support in the fight to restore the dignity of Onitsha, and indeed the totality of our Homeland,” he stated."
  },
  {
    "headline": "Buhari Commiserates With Japan On Tragic Death Of Ex-Prime Minister Abe",
    "summarized_story": "President Muhammadu Buhari on behalf of the Government and people of Nigeria, has extended heartfelt condolences to the family of former Japanese Prime Minister, Shinzo Abe, and to the Government and people of Japan in the wake of the gruesome assassination of the former Prime Minister.\nThe President in a statement by his media aide, Garba Shehu, joined all Japanese in mourning the loss of the country’s longest serving Prime Minister and outstanding leader, assuring the family of Abe of the prayers and thoughts of all Nigerians during this difficult time.\nPresident Buhari recalled that Abe will be remembered for his unwavering commitment to strengthening trade and investment between Africa and Japan through various initiatives and partnerships, using the instrumentality of Tokyo International Conference on African Development (TICAD).\nBREAKING: Ex-Japanese PM, Shinzo Abe, Is DeadThe President also affirmed that under Abe, Nigeria and Japan enjoyed a strategic partnership, supporting each other’s shared aspirations on economic cooperation, healthcare, human resource development, disaster risk reduction, peace and security.\nThe Nigerian leader prayed that the memory of the Japanese statesman and respected international leader will be a blessing to his nation and people, whom he served so devotedly."
  },
  {
    "headline": "Buhari Commiserates With Japan On Tragic Death Of Ex-Prime Minister Abe",
    "summarized_story": "President Muhammadu Buhari on behalf of the Government and people of Nigeria, has extended heartfelt condolences to the family of former Japanese Prime Minister, Shinzo Abe, and to the Government and people of Japan in the wake of the gruesome assassination of the former Prime Minister.\nThe President in a statement by his media aide, Garba Shehu, joined all Japanese in mourning the loss of the country’s longest serving Prime Minister and outstanding leader, assuring the family of Abe of the prayers and thoughts of all Nigerians during this difficult time.\nPresident Buhari recalled that Abe will be remembered for his unwavering commitment to strengthening trade and investment between Africa and Japan through various initiatives and partnerships, using the instrumentality of Tokyo International Conference on African Development (TICAD).\nBREAKING: Ex-Japanese PM, Shinzo Abe, Is DeadThe President also affirmed that under Abe, Nigeria and Japan enjoyed a strategic partnership, supporting each other’s shared aspirations on economic cooperation, healthcare, human resource development, disaster risk reduction, peace and security.\nThe Nigerian leader prayed that the memory of the Japanese statesman and respected international leader will be a blessing to his nation and people, whom he served so devotedly."
  },
  {
    "headline": "BREAKING: NCoS Declares 69 Terrorist Inmates Wanted After Kuje Jailbreak",
    "summarized_story": "The Nigeria Correctional Service (NCoS) has declared 69 terrorist inmates wanted three days after ISWAP terrorist group attacked the Kuje Medium Security Custodial Centre in Abuja on Tuesday, July 5, 2022.\nHundreds of inmates were freed from the facility after the attack by the terrorist group.\nIn a public notice released on Friday morning by the NCos authorities, it declared 69 inmates with terrorism cases wanted, asking the public to provide useful information which may lead to their recapture.\n“If you see any of these people, or have useful information which may lead to their recapture, Please Call 07000099999, 09060004598 or 08075050006 or Any Law Enforcement Agency nearest to you.\nNCoS also provided its official website, www.corrections.gov.ng/escapees, where all the escapees from the Kuje facility can be viewed."
  },
  {
    "headline": "Flutterwave Co-Founder, Iyin Deactivates Twitter Account Shortly After Kenyan Allegations",
    "summarized_story": "Following allegations of fraud and money laundering by Kenya’s Assets Recovery Agency, Iyin Aboyeji, co-founder of the wave-making business Flutterwave, canceled his Twitter account.\nIyin canceled his Twitter account shortly after Kenyan authorities declared that bank accounts connected to Flutterwave had been blocked, so it looks that he may have given in to pressure from the widely shared David Hundeyin investigation report.\nRecall that a Nigerian journalist named Hundeyin issued an investigation report on Flutterwave’s suspected involvement in several questionable personal and professional behaviors in April 2022.\nShortly after the report was published, Aboyeji, broke silence by distancing himself from different allegations brought against the company he founded in 2016.\n“The attack on my reputation and livelihood by a purveyor of yellow journalism pursuing a mission of personal vendetta is surprising and regrettable but not unexpected."
  },
  {
    "headline": "BREAKING: Peter Obi Unveils Running Mate",
    "summarized_story": "Peter Obi, the Labour Party’s nominee for president, has introduced Datti Baba-Ahmed as his vice presidential candidate.\nBaba-declaration Ahmed’s came just 24 hours after Doyin Okupe, the Director-General of the Peter Obi Campaign Organization, announced his resignation as the party’s vice presidential candidate.\nOkupe said that his party would reveal the replacement running mate for the presidential candidate after announcing his withdrawal via his verified Twitter handle @doyinokupe.\n“This afternoon I submitted my withdrawal letter from the position of the Vice Presidential candidate of the Labour Party to INEC.\nI feel greatly blessed to have been part of the foundation of success 4 the LP,” Okupe tweeted."
  },
  {
    "headline": "Sack Aregbesola Now Over Reoccurring Jailbreaks – HURIWA To Buhari",
    "summarized_story": "A civil rights advocacy group, the Human Rights Writers Association of Nigeria, has demanded that Rauf Aregbesola, the interior minister, be sacked immediately for his failure to address the country’s ongoing attacks on prisons.\nIn a statement issued on Thursday and bearing the signature of its National Coordinator, Emmanuel Onwubiko, HURIWA expressed its disapproval of the jailbreaks that occurred while Aregbesola was in office.\nThe statement reads in part, “The spate of jailbreaks under President Muhammadu Buhari and Minister of Interior, Rauf Aregbesola, is alarming and condemnable.\n“The frequent and recurring jailbreaks show the inefficiency of all those President Buhari appointed into office and his unwillingness to sack them show also that the President tacitly want the situation to continue to fester.\n“HURIWA demands the sacking of the Minister of Interior, Rauf Aregbesola; and his Defence counterpart, Bashir Magashi; for perpetual incompetence."
  },
  {
    "headline": "Notorious kidnap kingpin, Wadume among escapees after Kuje Prison attack",
    "summarized_story": "Hamisu Wadume was arrested by IRT operatives in Takum, Taraba State, for terrorising people of the state with his criminal activities.\nBut the IRT operatives came under heavy fire by soldiers of 93 Battalion, Takum, in Taraba state, killing three police officers and one civilian staff.\nThe soldiers, who also rescued Wadume from the IRT operatives, were said to have carried out the operations on the orders of their Commanding Officer.\nAfter his rescue by the soldiers, Wadume took to his heels and escaped from Taraba State, eliciting public outrage.\nHe was later rearrested by the IRT operatives at Kano, brought to Abuja and charged to court, where he was remanded in prison custody."
  },
  {
    "headline": "Pictures: Weeks after, Ekiti governor- elect, Oyebanji, meets PDP’s Kolawole",
    "summarized_story": "Barely two weeks after the Ekiti State gubernatorial election, governor-elect, Biodun Oyebanji, on Thursday, visited the Ado-Ekiti home of the Peoples Democratic Party governorship candidate, Bisi Kolawole.\nSpeaking during the visit, Kolawole expressed support for Oyebanji, saying, “Until June 18, we were candidates of two different parties but one of us, another respected Ekiti man won the election.\n“In the interest of the state and our people, we must all rally round him, offer necessary advice and move Ekiti forward.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Ex-FIFA, UEFA chiefs cleared of fraud",
    "summarized_story": "Former FIFA president Sepp Blatter and France footballing legend Michel Platini were both cleared of corruption charges by a Swiss court on Friday.\nBlatter, who led FIFA for 17 years, was cleared of fraud by the Federal Criminal Court in the southern city of Bellinzona.\nPlatini, then president of UEFA, was seen as having sway with European members who could influence the vote.\nPlatini, who also lost his job as UEFA president following the ban, said the affair was a deliberate attempt to thwart his attempt to become FIFA president in 2015.\nPlatini signed a contract with FIFA in August 1999 for 300,000 Swiss francs (£245,000) annually and backdated to January."
  },
  {
    "headline": "Popular Nigerian pastor sends message to Soludo over demolition of Odumeje’s church in Anambra",
    "summarized_story": "The Auchi-born cleric, sent a clear message to Governor Charles Soludo of Anambra State, urging him to condemn the manhandling of Pastor Chukwuemeka Ohanaemere, popularly known as Odumeje, by members of the Anambra State taskforce.\nSuleman also said the viral video of Pastor Odumeje being assaulted by the operatives was very primitive and uncalled for, adding that they overstepped their boundaries.\nIn a tweet via his Twitter handle, the cleric said, “I just saw a video of pastor Odumeje being assaulted by operatives.\n“Those operatives over stepped their boundaries and I expect Governor Soludo to condemn it.\nhighly!.”Blueprint reports had earlier reported that the Anambra State Government had demolished Odumeje’s church, the Mountain of Holy Ghost Intervention and Deliverance Ministry, located in the Onitsha area of the state."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "Kuje Prison Attack: FG Declares Fleeing Boko Haram Suspects Wanted, Releases Photos",
    "summarized_story": "The Federal Government has declared all Boko Haram suspects who fled the Medium Security Custodial Centre in Kuje, Abuja, wanted.\n“The following are faces and names of Inmates with Boko Haram/ terrorism cases who escaped from Kuje Correctional Centre during the jail attack on 5th July 2022,” it said.\nWe guarantee to keep your information anonymous.”They include Abdulkareem Musa, Abdusalami Adamu, Abubakar Abdulrahman Habibu, Abubakar Mohammed Sadiq, Abubakar Mohammed, Abubakar Yusuf, Adam Lawal Muhammad, Akibu Musa Danjuma, Amodu Omale Salihu, Bello Haruna, Bilyaminu Usman, Bukar Ali, Ibrahim Mohammed, Ikya Abur, Ismail Idris Abdullahi, Modu Aji, Mohammed Sani, and Musa Abubakar.\nOthers are Mohammed Goni Kyari, Mohammed Guja, Mohammed Saleh Buba, Mohammed Umar, Mukhtar Ussaini Khalidu, Musa Adamu, Musa Umar, Onyemire Asagba, Rabiu Shaibu, Sahabi Ismail, Sani Mohammed, Umar Ahmadu Ladan, Usman Balarebe, Yahaya Adamu Abubakar, Yusuf Yakubu, Abdulazeez Obadaki, Auwal Abubakar, Mansur Mohammed Usman, Mohammed Abubakar, Mohammed Jamiu Eneji Sani, Muazu Abubakar, Muhammed Sani Adamu, Muktar Umar, Nambil Zakari Gambo, Sadiq Garba Abubakar, Yazid Muhammed Usman, Yusuf Ali Yusuf.\nThe fleeing suspects are identified in the photos below:"
  },
  {
    "headline": "Kuje Prison Attack: Buhari Presides Over National Security Council Meeting",
    "summarized_story": "President Muhammadu Buhari is currently holding a closed-door meeting with service chiefs and some members of his cabinet at the State House in Abuja.\nWhile it is unclear what the agenda for the meeting is, many believe it is not unconnected to Tuesday’s attack on the Kuje Correctional facility and other security breaches experienced in recent times.\nREAD ALSO: Kuje Prison Attack: FG Declares Fleeing Boko Haram Suspects Wanted, Releases PhotosFollowing the attack on the Correctional Facility in Kuje, President Buhari expressed disappointment at the nation’s intelligence system.\nSpeaking after his visit to the Medium Security Custodial Centre, the president said, “I am disappointed with the intelligence system.\n“How can terrorists organise, have weapons, attack a security installation and get away with it?” the president questioned."
  },
  {
    "headline": "Terrorists Attacked Kuje Prison Despite Major Security Beef Up, Says Interior Minister",
    "summarized_story": "The Minister of Interior, Rauf Aregbesola, says the Federal Government had fortified security in all correctional centres in the country before the recent attack on the facility in the nation’s capital.\nHe said this in a statement on Thursday by his media adviser, Sola Fasure, in reaction to the attack on the Medium Security Custodial Centre in Kuje, Abuja.\nAregbesola stated that the government had taken the initiative to beef up security at the correctional centres at a time when the country witnessed incessant jailbreaks, including the facility in Oyo State.\nThe minister then directed that the Nigerian Correctional Service (NCoS) urgently works with other security agencies to fortify all correctional centres in the country and insulate them against future attacks, among other measures introduced.\nAregbesola pledged to continue to strengthen all correctional facilities and keep Nigerians safe at all times."
  },
  {
    "headline": "BREAKING: Former Japan PM Shinzo Abe Confirmed Dead After Shooting",
    "summarized_story": "Citing a senior member of Abe’s Liberal Democratic Party, national broadcaster NHK said “former prime minister Abe died at a hospital in Kashihara city, Nara, where he was receiving medical treatment.\nEarlier Prime Minister Fumio Kishida abandoned the campaign trail and flew to Tokyo by helicopter where he addressed reporters in a voice that wavered with emotion.\n“Former prime minister Shinzo Abe was shot in Nara and I have been informed he is in a very grave condition,” he said.\n“I pray that former prime minister Abe will survive,” he added, condemning “a barbaric act during election campaigning, which is the foundation of democracy.”“It is absolutely unforgivable.\nThailand’s Prime Minister Prayut Chan-O-Cha was “very shocked” at Abe’s shooting, while Indian Prime Minister Narendra Modi said he was “deeply distressed” by the news."
  },
  {
    "headline": "‘Sadiq Abubakar, Bassey Kingsley’: Full List Of 69 Wanted Boko Haram Escapees",
    "summarized_story": "Following an attack on the Medium Security Custodial Centre in Kuje, Abuja, the Federal Government on Friday published the identities of 69 Boko Haram suspects who are at large.\nWhile declaring them wanted, the Nigerian Correctional Service (NCoS) confirmed that they all escaped from the correctional facility which was attacked by terrorists on Tuesday night.\nContrary to the widespread belief that members of the terrorist group are northerners, among those declared wanted was Bassey Kingsley from Oron – a coastal city and Local Government Area in Akwa Ibom State.\nOnyemire Asagba, who hails from Warri in Delta State, is another suspected member of the terrorist group declared wanted by the government.\nSee the full details of the fleeing inmates below:"
  },
  {
    "headline": "2023: Labour Party announces Datti Ahmed as Peter Obi's running mate",
    "summarized_story": "The Labour Party has officially announced Datti Ahmed as Peter Obi’s running mate for the 2023 Presidential Election.\nThis follows the withdrawal of Doyin Okupe from the race in a letter he personally signed and sent to the Independent National Electoral Commission.\nAdvertisement"
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "Ekiti 2022: Oni files suit against Oyebanji's victory",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship poll, Segun Oni has filed a petition challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.\nDetails shortlyAdvertisementAdvertisement"
  },
  {
    "headline": "Ondo youths movement drums support for NNPP Assembly Candidate, Kolawole Oluwaseyi -",
    "summarized_story": "AdvertisementAlabi said Akoko North-West youths are backing his candidacy, because of his antecedents and love for development of the youths.\nThe communique reads in part, “Many aspire to lead, even when they don’t have what it takes to lead.\nThe group added that it is time to support a personality with a vision and mission to redefine development in the constituency.\nAdvertisementIt also called on all stakeholders in Akoko North-West beyond party affiliations to support aspiration of Oluwaseyi, so that the constituency can move forward.\n“His antecedents in diverse professions are clear pointers that he is more fit than any other person to lead the constituency”, the group stressed."
  },
  {
    "headline": "Labour Party’s Peter Obi Unveils Yusuf Datti Baba-Ahmed as Running Mate",
    "summarized_story": "The Labour Party (LP) on Friday, unveiled Senator Yusuf Datti Baba-Ahmed as running mate to its presidential candidate, Peter Obi, ahead of Nigeria’s general elections in February next year.\nBaba-Ahmed, the founder of Baze University, Abuja, was announced the vice-presidential candidate in Abuja on Friday.\nBaba-Ahmed’s announcement was coming barely 24 hours after the Director-General, Peter Obi Campaign Organisation, Doyin Okupe, announced his withdrawal as the vice-presidential candidate of the party.\nThe Labour party had named Okupe as the interim vice presidential candidate of the LP in order to beat the deadline by the Independent National Electoral Commission.\nDetails later"
  },
  {
    "headline": "Blatter and Platini: Former Heads of FIFA and UEFA Cleared of Corruption Charges By Swiss Court",
    "summarized_story": "Former FIFA president Sepp Blatter and former UEFA president Michel Platini were both cleared of corruption charges by a Swiss court on Friday.\nBlatter, who led FIFA for 17 years, was cleared of fraud by the Federal Criminal Court in the southern city of Bellinzona.\nThe two, once among the most powerful figures in world football, had denied the charges against them.\nProsecutors had accused Blatter, a Swiss who led FIFA for 17 years, and Platini of unlawfully arranging for FIFA to pay the Frenchman two million Swiss francs (£1.7m) in 2011.\nPlatini, who also lost his job as UEFA president following the ban, said the affair was a deliberate attempt to thwart his attempt to become FIFA president in 2015."
  },
  {
    "headline": "Former Japanese PM Shinzo Abe Assassinated While Making Election Speech",
    "summarized_story": "Former Japanese Prime Minister Shinzo Abe has died after he was shot on Friday while campaigning in the city of Nara.\nAuthorities have arrested a 42-year-old man who appeared to have shot Abe, media reported.\nAbe served two terms as prime minister to become Japan’s longest-serving premier before stepping down in 2020 citing ill health.\nHis protege, Prime Minister Fumio Kishida, goes into Sunday’s upper house election hoping, analysts say, to emerge from Abe’s shadow and define his premiership.\nAbe first took office in 2006 as Japan’s youngest prime minister since World War Two."
  },
  {
    "headline": "Rafael Nadal Pulls Out of Wimbledon Semifinal with Torn Abdominal Muscle",
    "summarized_story": "Rafael Nadal has withdrawn from Wimbledon ahead of Friday’s semifinal match against Nick Kyrgios with a torn abdominal muscle.\nSpanish newspaper Marca reported Thursday that Nadal has a 7-millimeter tear in one of his abdominal muscles but that he intended to play.\n“I made my decision because I believe that I can’t win two matches under these circumstances,” Nadal said.\nNadal, 36, was trying to win Wimbledon for the third time and the first time since 2010.\nThe last man in the Open Era to withdraw before a major semifinal singles match was Richard Krajicek at the 1992 Australian Open."
  },
  {
    "headline": "Nigeria: Insiders Connived with Terrorists to Attack Kuje Prison, Senate President Lawan Alleges",
    "summarized_story": "Dr. Ahmad Lawan, President of Nigeria’s Senate, on Thursday said Tuesday’s attack on the Kuje Medium Security Custodial Centre was successful, because it was done in connivance with insiders at the facility.\nLawan spoke, when he led a delegation of the senate leadership to assess the level of destruction done to the correctional facility by insurgents.\nAccording to the senate president, an attack on the Kuje Medium Security Custodial Centre, could only have been possible with the collaboration of insiders within the nation’s correctional system.\nHe faulted the Nigerian Correctional Service for not providing Closed Circuit Television (CCTV) at the Kuje correctional facility and others across the country.\n“The attack on this correctional facility is symptomatic of the failure of security failure."
  }
]