[
  {
    "headline": "Oriba: Lagos community where women give birth in canoes, residents drink poop water",
    "summarized_story": "Lara AdejoroResidents of Oriba community in the Epe Local Government Area of Lagos State are facing a tough time with the complete absence of basic health facilities.\nLARA ADEJORO reports how residents of this off-grid community across the river are surviving with a century-old abandoned health centre.\nThe corpse was their brother – ShamsudeenYinusa – who had died early that morning, after being rushed in a canoe from Oriba to Agbowa General Hospital, Agbowa, Lagos.\nHealth is no wealth for residents of the Oriba community.\nThe community has no water, no light.”Ilufemiloye also believes a functional health centre might have saved Yinusa that died."
  },
  {
    "headline": "Oriba: Lagos community where women give birth in canoes, residents drink poop water",
    "summarized_story": "Lara AdejoroResidents of Oriba community in the Epe Local Government Area of Lagos State are facing a tough time with the complete absence of basic health facilities.\nLARA ADEJORO reports how residents of this off-grid community across the river are surviving with a century-old abandoned health centre.\nThe corpse was their brother – ShamsudeenYinusa – who had died early that morning, after being rushed in a canoe from Oriba to Agbowa General Hospital, Agbowa, Lagos.\nHealth is no wealth for residents of the Oriba community.\nThe community has no water, no light.”Ilufemiloye also believes a functional health centre might have saved Yinusa that died."
  },
  {
    "headline": "Why we didn’t approve herbal medicine for COVID-19 treatment —NAFDAC",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has given reasons why it has not approved any herbal medicine for the treatment of COVID-19.\nShe warned Nigerian researchers and other herbal medicine practitioners to desist from parading unverified medicine for the virus.\nShe recalled that NAFDAC set up a herbal medicine product committee in March 2019 before the pandemic broke out, to advance research in herbal medicine.\nNAFDAC cannot say herbal medicine can treat COVID -19 until a clinical trial is done.\n“Right now, there is no single herbal medicine that has gone through the full clinical trial the way a clinical trial is supposed to be done,” she said."
  },
  {
    "headline": "Why we didn’t approve herbal medicine for COVID-19 treatment —NAFDAC",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has given reasons why it has not approved any herbal medicine for the treatment of COVID-19.\nShe warned Nigerian researchers and other herbal medicine practitioners to desist from parading unverified medicine for the virus.\nShe recalled that NAFDAC set up a herbal medicine product committee in March 2019 before the pandemic broke out, to advance research in herbal medicine.\nNAFDAC cannot say herbal medicine can treat COVID -19 until a clinical trial is done.\n“Right now, there is no single herbal medicine that has gone through the full clinical trial the way a clinical trial is supposed to be done,” she said."
  },
  {
    "headline": "Katung helps vulnerable Kaduna students to pay school fees",
    "summarized_story": "…Calls on Kaduna Government to reduce school feesBy Ibrahim Wuyo,KadunaThe Marshall Katung Foundation has declared willingness to assist Kaduna students by giving them scholarships to study in Kaduna State higher institutions where tuition fees were hiked recently by the State government.\n“But the Marshall Katung foundation isn’t restricted to only intervening in the tertiary institutions because we have done intervention on a lot of pupils in some secondary schools.\n“Why are we preparing to give scholarships to tertiary students now?\nThe general insecurity in Kaduna state has resulted in the temporary closure or relocation of about two tertiary institutions and about 18 boarding secondary schools.\nAn investment in knowledge always pays the best interest.”“We also want to call on the Kaduna State Government to reduce the school fees being demanded from students of its educational institutions."
  },
  {
    "headline": "Atyap seek government’s help over Zangon Kataf conflicts",
    "summarized_story": "“The attacks spanned across the Atyap dominated districts in the Chiefdom as if it was a deliberate act.\nThese attacks are not mere herders or Banditry, but premeditated attempts to wipe out the Atyap race.\nWe have made efforts to be at peace with all the people in the chiefdom thus the importance of this briefing.\nIt is not only lives and houses that were destroyed, but crops and places of worship inclusive.\nThe Atyap people are law-abiding citizens that have been loyal to all successive governments to date and wonder why we should be left alone to carry our cross now."
  },
  {
    "headline": "El-Amin: Gov Emmanuel charges graduands on academic excellence",
    "summarized_story": "Akwa Ibom State Governor, Mr Udom Emmanuel, stated this on Saturday while speaking at the graduation lecture ceremonies of the 2021 graduating set of El-Amin International School, Minna, Niger State.\nGovernor Emmanuel commended the school for upholding academic excellence over the years and producing great global citizens, charging them not to rest on their oars, as there is still room for improvement.\nEl-Amin International School, Minna, Niger State, was established by Late First Lady of Nigeria, Her Excellency, Hajiya Maryam Babangida and has been in existence for more than two decades.\nAdo Doguwa, Emir of Minna, HRM, Umar Farouk Bahago, the Head of the Civil Service, Commissioner for Education, Niger state.\nThe Governor also visited Former Military President, General Ibrahim Babangida, former Head of State, General Abdulsalam Abubarkar and the Governor of Niger State, HE Abubakar Sani Bello."
  },
  {
    "headline": "Insecurity: Garba Shehu quotes Romans, Galatians to tackle Kukah",
    "summarized_story": "Garba ShehuThe Presidency has described as unfortunate and disappointing the way and manner Bishop Matthew Kukah castigated his country, Nigeria, before the United States Congress.\nA statement by the President’s spokesman, Malam Garba Shehu, on Sunday in Abuja, advised Kukah to desist from sowing discord and strife among Nigerians.\nThe presidential spokesman also frowned at Kukah’s attempt to accuse the Buhari administration of promoting ethnic and religious sentiments in the country.\nShehu also condemned Kukah’s position that only Christian students were largely being targeted or kidnapped by bandits in the Northern part of the country.\nHe added: ”The attack on Christian students is sad and unacceptable; so also is the abduction of students of other faiths."
  },
  {
    "headline": "I never asked Obi Cubana to loan Nigeria money ― Lai Mohammed",
    "summarized_story": "Lai MohammedBy Emmanuel ElebekeThe Minister of Information and Culture, Lai Mohammed, has described as fake the report making rounds that he asked Anambra Obi Cubana, Group Chairman, Obi Iyiegbu, to loan money to Nigeria.\nRecall that the news which was published by an online medium read in part, “Obi Cubana has this kind of money and Nigeria is borrowing money from China.\nCubana should borrow us money, Nigeria is collapsing- Lai Mohammed”.\nALSO READ: Why we didn’t approve herbal medicine for COVID–19 treatment – NAFDACThe social media has been washed with the trending lavish funeral organised by Obi Cubana for his mother in ObaAnambra State.\nThe unprecedented naira rain at the funeral left many mouths wagging and wondering why Federal government would not approach Cubana for loan rather than going offshore with higher interest and burden."
  },
  {
    "headline": "Past govts abandoned 116 water projects",
    "summarized_story": "The Minister of Water Resources, Suleiman Hussein Adamu, has said the Zobe dam commissioned by President Muhammadu Buhari on Thursday in Katsina State is just one out of 116 other water resource projects abandoned by past successive administrations.\nHe made the remark while speaking at the commissioning ceremony of the multibillion Naira water scheme project at Dutsima LGA of Katsina State on Thursday.\n“The case of Zobe water supply project was the direst among the 41 inherited water supply project because of the lingering debt of over N10 billion ductile iron pipe that has been imported and delivered to the site since 2008.\n“The Zobe water scheme draws water from Zobe multipurpose dam that was commissioned way back in 1993 with a reservoir capacity of 177 billion litres of water.\nSpeaking at the commissioning ceremony of the Zobe Water Supply Scheme, President Buhari appealed to the National Assembly, to speed up the passage of the National Water Resources Bill."
  },
  {
    "headline": "Chief of Air Staff pledges support for National Research, Development foundation",
    "summarized_story": "The Chief of Air Staff, Air Marshal Isiaka Oladayo Amao has promised to support the Nigerian Airforce in establishing a National Research and Development Foundation (NRDF), being canvassed by the Research and Development Standing Committee (RDSC) of Tertiary Education Trust Fund (TETFund).\nThe Chief of Air Staff also lauded the Fund for its sincerity in the disbursement of R&D funds.\nIn his remarks, the Executive Secretary of TETFund, Prof. Suleiman Elias Bogoro, who led the delegation on the visit, expressed his appreciation to the Chief of Air Staff for meeting with the Subcommittee.\nThe Executive Secretary commended the Nigerian Airforce for its efforts in the fight against insurgency in the country, even while emphasizing the need to deploy the most precise technology.\n“Nigerian Airforce has been doing a great job."
  },
  {
    "headline": "Do not allow Buhari to censor media",
    "summarized_story": "The All Workers Convergence (AWC), has appealed to Nigerians not to allow President Muhamadu Buhari-led government to censor the media.\nOur correspondent recalls that major newspapers across the country last week kicked against proposed amendments into the NPC and NBC (Media) Act.\nEmelieze while speaking further, noted that members of the labour union joined forces with the media to condemn the attempt to monitor the latter.\n‘We join forces with our media to condemn the attempt to monitor the media and we call on all media personnel to also mobilise massively for the forthcoming mother of all protest which shall help put an end to bad governance in Nigeria.\n“We condemn also the uncivilized way President Buhari and some desperate people have been threatening Nigerians with war sounds."
  },
  {
    "headline": "Code of Conduct chairman, Umar, sues Senate, AGF, assaulted victim, demand halt of investigations",
    "summarized_story": "FHC/ABJ/ CS/671/2021 is challenging the Senate’s constitutional power to conduct an investigation and the purpose for which it is exercisable.\nThe CCT chairman had as widely reported in print and electronic media physically assaulted Sagwak at the Bannex Plaza in Wuse 2, Abuja on March 29, 2021.\nIn seeking redress, the assaultee filed a petition against Umar to the Senate which it gave its Committee on Ethics, Privileges and Public Petitions to investigate.\nThough the embattled CCT chairman had on invitation, appeared before the committee once, he shunned several other invitations thereafter.\nCCT chairman Danladi Umar assaults Abuja mall security staff [Video]"
  },
  {
    "headline": "Research, technology, innovation necessary for local drug production",
    "summarized_story": "The Director-General of the National Institute for Pharmaceutical Research and Development (NIPRD), Dr. Obi Adigwe, has revealed the institute’s new priority on science, technology, innovation as well as local and international partnerships.\nHe informed that the nations’ pharmaceutical research sector has developed three COVID-19 products, while at least 10 other products were awaiting industry take-up.\nThe innovation he said informed the huge investment being deployed at NIPRD to boost Artificial Intelligence and Machine Learning projects in Drug Discovery & Phytomedicinal Development.\nHe said the intervention will exponentially improve relevant outcomes while conserving scarce resources in our Research and Development setting.\nHe called on experts in the pharmaceutical industry to partner with NIPRD’s Active Pharmaceutical Ingredient (API) and Excipients’ Value Chain Production Project."
  },
  {
    "headline": "VIDEO:Speed darlington in dilema after lady charges N14,000 T fare",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Heavy security as anti-Yoruba nation group postpones Lagos rally",
    "summarized_story": "The planned anti-secession rally scheduled for Friday by a group, Yoruba Appraisal Forum (YAF), has been postponed.\nThe Nation reported more than a dozen police vehicles, including armoured tanks and water cannons, were stationed around the Gani Fawehinmi Freedom Park in Ojota, Lagos, ahead of the rally.\nThe Ojota route and surrounding areas witnessed heavy traffic gridlock due to roadblocks mounted at the section leading to the park.\nLagos Police spokesperson, Olumuyiwa Adejobi, in a statement, cited security concerns and third wave of COVID-19 for the action.\nThe rally will eventually hold at a later date that we will decide.”The postponed rally was after Yoruba nation agitators led by Odua Republic umbrella held a rally at the Gani Fawehinmi Freedom Park on July 3, 2021 despite repeated warnings by the police"
  },
  {
    "headline": "I love my husband, he is the best thing for me - BBN Ka3na",
    "summarized_story": "Ka3na Jones of the BBN lock down reality show, has come out to declare her unreserved love for her husband.\nAccording to her, he is the best thing that has happened to her and she will choose him over and over agin.\nWe would recall that while in the house, Ka3na declared her sepaeration from her husband.\nShe had also confessed to have had sex with Praiz, one of the house mates in the house to teach him a lesson.\nIn the picture, she is seen sitting together with her husband"
  },
  {
    "headline": "PHOTOS: Army buries slain General in Abuja",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Reactions over Tonto Dikeh’s before, after cosmetic surgery photos",
    "summarized_story": "Nollywood actress, Tonto Dikeh has elicited reactions from fans with a photo mix of her before body and after a Brazillian butt surgery.\nIn an Instagram post, Tontolet responded with a throwback photo accompanied by the song ‘Coming in Hot’ to an enquiry on why she had the surgery.\nOthers simply noted that the media personality truly needed the procedure as the difference is crystal clear.\nYou say it as it is.”ivyuzokah stated: “Love your sincerity.”dr.mutesi said: “It was a good choice please.”poshb7 wrote: “Chai see why I dey pray to win the body enhancement giveaway.\nBiko surgery went well and it looks good my 3m never complete.”luchs109 stated: “Yes oo."
  },
  {
    "headline": "‘FG should reinstate Alata Oilfield to Bayelsa Oil Company, JV partners’",
    "summarized_story": "By Vincent KaluPromoters of Bayelsa Oil Company Limited alongside its Joint Ventures Partners, Hardy Oil Nigeria Limited and Century Exploration/ Production Limited, have appealed to President Muhammadu Buhari to intervene in their effort to restore Alata Oil Field in (OML 46) belonging to them.\nThe JV Partners further stressed that: “It is pertinent to state here that Atala Marginal Oil field (OML 46) has been developed, crude oil produced and sold from the same field at different stages of test crude production.\nRoyalties on crude oil sold from the field had been paid to the Federal Government severally before the field was revoked under very strange and suspicious circumstances.\nThe revocation of the asset has put into jeopardy the entire efforts and resources pumped into the development of the Field by the JV Partners.\nConsequently, Atala JV Partners executed Crude Handling Agreement (CHA) with Excel Exploration and Production Limited to handle Atala crude, as well as use their pipeline for transporting Atala crude to Shell Petroleum Trans Forcados pipeline."
  },
  {
    "headline": "BREAKING: COVID-19 3rd wave: FG puts Lagos, FCT, five other states on red alert",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has put six States and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against a third wave of the COVID-19 pandemic.\nThis follows the confirmation of the Delta Variant of COVID-19 and the rising number of infections and hospitalization in the country.\nAccording to a statement by Secretary to the Government of the Federation/Chairman Presidential Steering Committee on COVID-19, Boss Mustapha, the states are Lagos, Oyo, Rivers, Kaduna, Kano, Plateau and the FCT.\nMustapha stressed that ‘these steps are critical as we begin to see worrisome early signs of increasing cases in Nigeria.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "I don’t regret my love with my ex-boyfriend in BBNaija –Mercy Eke",
    "summarized_story": "By Agatha EmeadiBig Brother Naija star, Mercy Eke, has continued to shine as a sought-after brand ambassador after winning the BBNaija Reality Show (Pepper Them edition) in 2019.\nAs a sought-after brand ambassador, have you rejected any endorsement since you came out of the House?\nBut recently, Payporte unveiled me as their brand ambassador because we agreed on terms and conditions and I promise to represent them well.\nAs a fashion brand ambassador, tell us about the things you like to wear?\nMy fashion brand, M&M Luxury, which is a fashion brand that everyone can afford to be up there."
  },
  {
    "headline": "BIM-MASSOB to UN: There won’t be peace in Nigeria until you recognise Biafra",
    "summarized_story": "From George Onyejiuwa, OwerriLeader of BIM-MASSOB, Chief Ralph Uwazuruike has told the United Nations that there would be no peace in Nigeria until the sovereign state of Biafra is duly recognised by the world body.\nBut in 1976, immediately after the Biafra-Nigeria civil war, the military government of Nigeria promulgated the Decree of 1976 which invested all lands in Nigeria to the state governors.\nSo, all the 36 governors are owners of the lands in Nigeria and the Federal Government owns the capital territory, Abuja.\nBut because of his position as the president of Nigeria and a Hausa/Fulani man, he wants to enforce it against our will.\n“In Biafra land, which is in the Southern Nigeria, our lands are blessed with crude oil deposits, and fertile."
  },
  {
    "headline": "For The Records: Igbo still surrounded by lingering pain of defeat –Bianca Ojukwu",
    "summarized_story": "This decision was so craftly implemented to neutralize an entire generation of Igbo officers and edge out the Igbo from ever rising within the Army.\nFifty years on, the Igbo remain structurally disadvantaged in the Nigeria Armed Forces as well as inadequately represented.\nWhether this program has achieved its lofty objectives in terms of integration of ethnic groupings or not, has been subject to controversy.\nThe admission guidelines in unity secondary schools and tertiary institutions prescribed certain cutoff marks state to state.\nThe Igbo have become a people denied the cure for the ravages of a war which ended with a ‘No victor, No vanquished’ slogan, but yet a people surrounded by the lingering pain of defeat…."
  },
  {
    "headline": "APC Releases Timetable, Guidelines for July 31 Ward Congresses",
    "summarized_story": "Adedayo AkinwaleThe All Progressives Congress (APC) has released the schedule of activities and guidelines for the conduct of the party’s Ward congresses scheduled for Saturday July 31, 2021.\nHe said screening of aspirants for the Ward party positions was scheduled for July 29th to 30th July, 2021, while Ward Congresses would hold 31st July, 2021, adding that appeals arising from Ward Congresses will hold August 2nd to 7th August, 2021.\nHe noted that the committee would be referred to as the Ward Congress Committee (WCC), adding that members of the committees would be posted to places outside their states of recruitment.\nHe added that the committee would be responsible for the conduct of the Ward congress exercise in their place of posting.\nHe said the general public must be notified of the venue at least 12 hours before the commencement of the congresses."
  },
  {
    "headline": "Presidency Accuses Kukah of Portraying Nigeria in Bad Light Before Foreign Audience",
    "summarized_story": "It also described as unfortunate and disappointing the position of the “so-called” man of God painting his country in bad light before a foreign parliament.\n“To declare to a foreign audience that this government does nothing is an incredible falsehood”.\n“The attack on Christian students is sad and unacceptable; so also is the abduction of students of other faiths.\nThe claim that only Christian schools are being targeted is totally untrue.\n“These are not the views expressed or opinions held by the vast majority of the citizens of Nigeria."
  },
  {
    "headline": "In Paradigm Shift, Women Take Over Banking Sector",
    "summarized_story": "Miriam Olusanya, GTBankMiriam Olusanya has over 23 years banking experience that cuts across Transaction Services, Asset and Liability Management, Financial Markets, Investment Banking, and Investor Relations.\nSomefun is a career professional with 35 years post qualification experience, over 26 of which were in the banking sector, spanning key segments, including Treasury and Investment Banking, Corporate Banking, Retail, and Commercial Banking Operations.\nShe was recently conferred an Honorary Degree of Doctor of Business Administration (D.BA) by the Redeemer’s University, Nigeria.\ndegree in Business Management from the University of Maiduguri and an MBA from the same university.\nIn her most recent role, Smith was responsible for the bank’s 200 branches across the country, as well as the public sector, business banking, agriculture, and transaction banking divisions."
  },
  {
    "headline": "Kukah Writes US House, Alleges Persecution of Christians Based on Faith",
    "summarized_story": "Kukah said the faith-based harassment of Christians posed one of the greatest threats to the country’s existence and common humanity.\nIn the statement to the US House Committee, Kukah urged International Aid Organisations to reset the templates of their engagements with countries in conflict.\nHe stated that Nigeria currently needed support for education, orphans, widows, and other victims of violence.\nSpeaking to the conscience of Muslims, Kukah said good Muslims must rise in defence of their religion by reversing the rising perception of Islam as inhuman.\n“There have been dastardly actions directed at Christians, because of their faith."
  },
  {
    "headline": "FG Puts FCT, Six States on Red Alert over COVID-19 Third Wave",
    "summarized_story": "Olawale AjimotokanThe Federal Government has put six states and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against a third wave of COVID-19.\nIn addition to the FCT, the six states are Lagos, Oyo, Rivers, Kaduna, Kano and Plateau.\nThe Chairman PSC, who also doubles as the Secretary to the Government of the Federation, Mr Boss Mustapha, signed the statement.\nHe said the steps were critical as there were worrisome early signs of increasing cases in the country.\nIt reminded Nigerians and all residents to ensure they stay safe at all time."
  },
  {
    "headline": "EXCLUSIVE: How Nnamdi Kanu Clashed With Department Of State Services Operatives During Interrogation In Custody",
    "summarized_story": "The leader of the Indigenous People of Biafra, Nnamdi Kanu, on Sunday clashed with the operatives of the Department of State Services and refused to answer their questions during another interrogation session by the secret police in Abuja.\nNnamdi KanuSaharaReporters gathered that the DSS panel in turn told him that today (Sunday) was the last interview they would have with him.\n“The DSS interrogated him today again with five officers in the presence of his lawyer, Aloy Ejimakor.\nSaharaReporters had last Wednesday reported that Kanu, for the first time, was interviewed by the DSS officers in Abuja, in the presence of his lawyer, Ejimakor.\nSaharaReporters had on July 7 reported that Kanu told his lawyer that he was “mercilessly beaten and tortured” in the East African country before his extradition to Nigeria."
  },
  {
    "headline": "EXCLUSIVE: How Nnamdi Kanu Clashed With Department Of State Services Operatives During Interrogation In Custody",
    "summarized_story": "The leader of the Indigenous People of Biafra, Nnamdi Kanu, on Sunday clashed with the operatives of the Department of State Services and refused to answer their questions during another interrogation session by the secret police in Abuja.\nNnamdi KanuSaharaReporters gathered that the DSS panel in turn told him that today (Sunday) was the last interview they would have with him.\n“The DSS interrogated him today again with five officers in the presence of his lawyer, Aloy Ejimakor.\nSaharaReporters had last Wednesday reported that Kanu, for the first time, was interviewed by the DSS officers in Abuja, in the presence of his lawyer, Ejimakor.\nSaharaReporters had on July 7 reported that Kanu told his lawyer that he was “mercilessly beaten and tortured” in the East African country before his extradition to Nigeria."
  },
  {
    "headline": "Nigerian Passport Ranks 101 Among 199 Countries, Behind Togo, Chad, Others",
    "summarized_story": "The Nigerian passport is ranked 101st out of 199 countries, according to the ranking done by the Henley Passport Index, described as the original, authoritative ranking of all the world’s passports.\nThe index ranks passports, according to the number of destinations their holders can access without a visa.\nJapan is number one on the list, followed by Singapore in second place, and South Korea and Germany tied for third.\n“While the dominance of European passports in the top 10 has been a given for most of the index’s 16-year history, the pre-eminence of three Asian states — Japan, Singapore, and South Korea — has become the new normal.\nNigeria beat only seven countries on the continent, namely Ethiopia (102nd), South Sudan (103rd), Eritrea and Democratic Republic of the Congo (104th), Sudan (106th), Libya (107th), and Somalia (111th)."
  },
  {
    "headline": "Nigerian Passport Ranks 101 Among 199 Countries, Behind Togo, Chad, Others",
    "summarized_story": "The Nigerian passport is ranked 101st out of 199 countries, according to the ranking done by the Henley Passport Index, described as the original, authoritative ranking of all the world’s passports.\nThe index ranks passports, according to the number of destinations their holders can access without a visa.\nJapan is number one on the list, followed by Singapore in second place, and South Korea and Germany tied for third.\n“While the dominance of European passports in the top 10 has been a given for most of the index’s 16-year history, the pre-eminence of three Asian states — Japan, Singapore, and South Korea — has become the new normal.\nNigeria beat only seven countries on the continent, namely Ethiopia (102nd), South Sudan (103rd), Eritrea and Democratic Republic of the Congo (104th), Sudan (106th), Libya (107th), and Somalia (111th)."
  },
  {
    "headline": "Did Nnamdi Kanu Actually Jump Bail? By Aloy Ejimakor",
    "summarized_story": "In such event, the the promisor or surety in the bail contract will be discharged from his obligation to produce the accused.\nNow, you may ask: what is the position of the promisor- the Nigerian State in this whole saga?\nA Nigerian State that had Kanu on trial, in the course of time released him on bail posted by another.\nThen, the same Nigerian State ordered its army to lethally invade Kanu's home.\nDuring the invasion, Kanu was confirmed to be on location, trapped and in line of fire."
  },
  {
    "headline": "EXCLUSIVE: How NCC recommended e-transmission of results ahead of 2019 elections",
    "summarized_story": "Recommendations were made in 2018 by the Nigerian Communications Commission (NCC) for the adoption of electronic transmission of election results, TheCable can report.\nThe issue of the electoral act amendment bill, which allows for electronic transmission of election results, has been contentious, leading to serious arguments between lawmakers.\nA joint technical committee of INEC and NCC was subsequently formed with a mandate to map out strategies that would reduce human interventions in the transmission of election results.\nThe committee was headed by Maska and co-chaired by Muhammed Lecky, an INEC national commissioner.\nThe committee then suggested three options: national roaming, multi-sim and traditional communication service from MNOs to transmit results."
  },
  {
    "headline": "EXCLUSIVE: How NCC recommended e-transmission of results ahead of 2019 elections",
    "summarized_story": "Recommendations were made in 2018 by the Nigerian Communications Commission (NCC) for the adoption of electronic transmission of election results, TheCable can report.\nThe issue of the electoral act amendment bill, which allows for electronic transmission of election results, has been contentious, leading to serious arguments between lawmakers.\nA joint technical committee of INEC and NCC was subsequently formed with a mandate to map out strategies that would reduce human interventions in the transmission of election results.\nThe committee was headed by Maska and co-chaired by Muhammed Lecky, an INEC national commissioner.\nThe committee then suggested three options: national roaming, multi-sim and traditional communication service from MNOs to transmit results."
  },
  {
    "headline": "'We're awaiting information from other locations' -- NAF says no air crash in Kaduna",
    "summarized_story": "The Nigerian Air Force (NAF) has denied reports that a military aircraft crashed in Kaduna, on Sunday.\nHowever, when contacted, Edward Gabkwet, NAF spokesman, told TheCable that no air crash occurred in Kaduna according to reports made available to the air force at the time.\nAdvertisementThe development comes months after an air crash occurred in Kaduna, which led to the death of Ibrahim Attahiru, chief of army staff.\nAside from Attahiru, the incident which took place near Kaduna international airport, led to the death of 10 other military officers.\nThe defence headquarters had said the air crash, which involved a Beechcraft 350 belonging to the Nigerian Air Force (NAF), was caused by bad weather."
  },
  {
    "headline": "'We're awaiting information from other locations' -- NAF says no air crash in Kaduna",
    "summarized_story": "The Nigerian Air Force (NAF) has denied reports that a military aircraft crashed in Kaduna, on Sunday.\nHowever, when contacted, Edward Gabkwet, NAF spokesman, told TheCable that no air crash occurred in Kaduna according to reports made available to the air force at the time.\nAdvertisementThe development comes months after an air crash occurred in Kaduna, which led to the death of Ibrahim Attahiru, chief of army staff.\nAside from Attahiru, the incident which took place near Kaduna international airport, led to the death of 10 other military officers.\nThe defence headquarters had said the air crash, which involved a Beechcraft 350 belonging to the Nigerian Air Force (NAF), was caused by bad weather."
  },
  {
    "headline": "Police officers killed as gunmen attack Zamfara community",
    "summarized_story": "Some officers of the mobile police unit of the Nigeria Police Force (NPF) have been killed during a raid by gunmen in Kurar-Mota village of Bungudu LGA of Zamfara state.\nAdvertisementMore than 10 officers were said to have been killed during the attack, which occured on Sunday — but there is no official confirmation on the number of fatalities yet.\nThe police officers were reportedly ambushed by the gunmen, when they went to the village in their patrol vehicles.\nMeanwhile, Bello Matawalle, governor of Zamfara, is said to have visited the injured officers at the Yariman Bakura hospital in the state.\nAccording to Aminu Maradun, an aide to the governor, Matawalle also condoled with the NPF over the death of the officers."
  },
  {
    "headline": "Apple’s new MagSafe battery pack just made power banks cool again",
    "summarized_story": "Well, I wonder what they’d say when they see Apple’s new MagSafe Battery Pack.\nThe MagSafe Battery pack sports a battery capacity of 1460mAh at 7.62V.\nCompared to other magsafe power banks, like Anker’s PowerCore Magnetic 5K Wireless with its 5000mAh battery, Apple’ new battery pack just doesn’t cut it.\nAccording to Apple Insider, the MagSafe Battery Pack might fully charge an iPhone 12 or iPhone 12 Pro with little issue.\nIf you charge your iPhone and MagSafe Battery Pack at the same time, your iPhone might charge to 80% or higher before your MagSafe Battery Pack begins charging."
  },
  {
    "headline": "Why food-on-demand can be Gokada’s ticket to super app stardom",
    "summarized_story": "But in its boldest step since it was founded in January 2018 by Fahim Saleh, Gokada now identifies as a super app.\nGokada’s super app is entering the market at a time when Lagos residents are consuming ₦5 trillion ($12 billion) worth of food annually.\nSo why a super app?\nLike Grab in Singapor and Gozem in francophone Africa, Gokada’s super app journey started with transportation | Graphic by Boluwatife Sanso/TC InsightsBut as Yinka Adegoke explained in this insightful piece, apps become super by offering essential services within large markets.\nPerfecting this cycle also means paying attention to renowned global food delivery services like Doordash, Grubhub, UberEats and Deliveroo."
  },
  {
    "headline": "Westa.Solar sets its sights on West Africa after debut in Nigeria",
    "summarized_story": "Westa.Solar was recently launched as a joint venture between Oolu Solar, a solar home systems provider and RP Global, a renewable energy investment company.\nThe new company offers solar systems that range from 50kW to 5MW and has commenced operations in Nigeria.\nThe plant at Petrichor represents a perfect start to life for Westa.Solar, a company that has its sights set on the larger West African market.\n“This is the first of what we hope will be many solar power projects for C&I companies,” Akinboye said.\nOver the next five to ten years, the company aims to become the leading commercial and industrial renewable energy provider in the region."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Smileys, hearts, sad eyes and the rise of a new digital language",
    "summarized_story": "While technology has reduced physical communication, it has also helped us keep in touch where actual meetings are impossible.\nApparently, World Emoji Day is a big deal.\nIntriguingly, World Emoji Day is celebrated on July 17 because Apple’s iOS calendar emoji have the same date.\nSurprisingly, the smiling face emoji symbolises dismissiveness to Chinese people rather than happiness.\n“Although we feel the same things, the way we express them may differ across cultures.”This year’s World Emoji Day promises the release of emoji 14.0."
  },
  {
    "headline": "Nigeria’s PayTV antitrust laws, AIfluence’s $1m seed round, PoS business in Nigeria",
    "summarized_story": "Good day,Today, I’m discussing:Proposed antitrust laws for Nigeria’s PayTV servicesAIfluence’s $1m seed roundPoS business in NigeriaProposed antitrust laws for Nigeria’s PayTV servicesDStv dish.\nThe laws will keep PayTV services in check, regulate their prices, and reduce the possibility of any provider monopolising the market.\nAdvertisementIn Nigeria, the satellite TV sector is dominated by MultiChoice — the South African company that owns DStv and GOtv — and Chinese-owned StarTimes.\nRecall last week, we reported that Nigeria’s Federal Inland Revenue Service (FIRS) directed commercial banks to freeze MultiChoice Nigeria Limited and MultiChoice Africa’s accounts to recover ₦1.8 trillion in taxes from the companies.\nAlso, per Statista, the number of PoS payments increased significantly from 34 million in 2015 to 438.6 million in 2019."
  },
  {
    "headline": "Twitter’s disappearing posts feature, Fleets, fails to catch user attention",
    "summarized_story": "Microblogging platform, Twitter, on Wednesday, July 14, 2021, announced that its disappearing posts feature, Fleets, will no longer be available on the platform.\nLaunched on August 17, 2020, Fleet was Twitter’s way of getting those who don’t tweet regularly to do so.\nSocial media and disappearing postsDisappearing posts was first seen on Snapchat with its introduction of Stories in October 2013.\nStatista also reveals that daily WhatsApp status users were up to 500 million in Q1 2019.\nWith no available data on other platforms’ disappearing posts feature usage, could this mean we’ll see more apps scrap it?"
  },
  {
    "headline": "Edo to issue 10,000 C-of-Os yearly, sets to acquire mobile digital mapper to improve land mgt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has concluded plans to acquire a mobile digital mapper, as part of efforts by the Governor Godwin Obaseki-led administration to improve land management in the stateManaging Director, Edo State Geographic Information Service Agency (EdoGIS), Arch.\nFrank Evbuomwan, disclosed this in a chat with journalists in Benin City, Edo State.\nEvbuomwan also disclosed that the agency plans to open zonal offices in Auchi in Edo North Senatorial District and another in Uromi in Edo Central Senatorial District, before the end of 2021, with a target to issue a minimum of 10, 000 Certificates of Occupancy (C-of-O) yearly.\nAt the end of this year, we hope to have cleared the 10,000 mark, and after that, we will start doing a minimum of 10,000 digital C-of-O yearly.\nWe want to get to a level where every centimetre in the state is carefully and completely mapped with owners information, land use, land size and many more.”..."
  },
  {
    "headline": "Police arrest 2 undergraduates released by kidnappers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestASABA – Operatives of the Delta State Police Command have arrested two undergraduates shortly after they were released by kidnappers in the state.\nMr Divine Omajuwa and Miss Hamza Hussiena were released by their abductors on Wednesday, July 14, 2021.\nThe students arrest came shortly after the university Vice Chancellor, Prof. Andy Egwunyenga announced their release in a statement dated Wednesday, July 14, 2021.\n“They were here after they were released by the kidnappers but they were not detained”.\nChoice Emoese, Counsel to the Divine Omajuwa confirmed the arrest and detention of her clients at the anti-kidnapping unit of the state police command, Asaba."
  },
  {
    "headline": "Edo govt approves construction, renovation of more schools under EdoBEST – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has approved funds for the construction and renovation of more schools across the state as part of efforts to ensure a conducive learning environment for students under the Edo Basic Education Sector Transformation (EdoBEST) programme.\nIn a statement, Executive Chairperson of the Edo State Universal Basic Education Board (EdoSUBEB), Dr. Joan Osa Oviawe, said the board is inviting sealed technical bids from eligible bidders who wish to be pre-qualified for the project.\nAccording to her, “Edo State Universal Basic Education Board on behalf of Edo State Government from its approved Budget for the fiscal year is desirous of carrying out construction and renovation of primary schools under the UBEC/SUBEB Projects and it intends to apply part of the Budget for the payment of the contract.\nShe said “works to be executed under this project would include the construction of Public Primary Schools across the State; Renovation of existing Public Primary School structures across the State.”Oviawe noted that other aspects covered by the project are “Provision of water supply and toilet facilities in Public Primary Schools across the State and Procurement/Supply of Furniture to Public Primary Schools across the State.”..."
  },
  {
    "headline": "Edos in Diaspora laud Obaseki on modular refinery project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State indigenes in Diaspora have applauded Governor Godwin Obaseki on the progress of work on the 6000bpd Edo Modular Refinery, noting that the project will boost industrial growth in the state.\nA graduate of IFP France, Osakpolor Eriyo, said the modular refinery project is a game changer in Nigeria, especially as it was delivered with the active participation of the Edo State Government.\nAccording to him, “I am impressed with the way and manner the Governor drove the process for the realisation of the refinery project.\nIt shows that there was indeed an unwavering commitment to harness the resources in the state for the benefit of the people.\nAsemota Orere, who is based in Ireland, noted that the project is a proof of the dexterity of the Obaseki-led administration in the state, noting that the much anticipated industrial growth expected in the state is finally taking shape."
  },
  {
    "headline": "Airtel yet to renew licence – NCC",
    "summarized_story": "ADVERTISEMENTThe Nigerian Communications Commission (NCC) says it is yet to renew Airtel’s Mobile Operating Licence.\nIkechukwu Adinde, NCC’s Director of Public Affairs, made this known in a statement on Sunday, in Abuja.\nAccording to him, the attention of the NCC was drawn to a recent statement on an online publication, credited to the Managing Director of Airtel Nigeria, Segun Ogunsanya, to the effect that the mobile operating licence of Airtel had been renewed by the Commission, for another period of 10 years.\n“Mr Ogunsanya was said to have made the statement while speaking in Lagos on July 14, 2021, during the media launch of Airtel’s Corporate Social Responsibility programme, ‘Touching Lives 6”.\nALSO READ: Airtel Nigeria appoints CEOThe News Agency of Nigeria (NAN) recalls that Mr Ogunsanya, at the launch of ‘Airtel Touching Lives Season 6’ on Wednesday in Lagos, noted that Airtel earned a ‘Social License’ through its commitment to empowering and uplifting people and making positive and lasting impact on lives of its stakeholders."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ogun Cargo Airport Will Be Ready Next Year – Gov. Abiodun",
    "summarized_story": "Idowu Olakunle, AbeokutaOgun State governor, Prince Dapo Abiodun, yesterday assured that the state Agro-Cargo Airport at Ilishan-Remo currently under construction will be ready for commissioning by the end of next year.\nAbiodun said he remains committed to the project despite negative moves aimed at thwarting his efforts from some quarters.\nWhile Dapo preferred a Cargo airport to be located at Ilishan-Remo, Ikenne Local Government Area, Amosun wanted a passenger airport in Wasimi, Ewekoro Local Government Area of the state.\nSome people are building airport, some ‘airstrip’ and some domestic airport; they are embittered, they are fighting us.\n“Ogun State remains the most peaceful State in Nigeria, and we will not toy with that."
  },
  {
    "headline": "Congo, Cameroon, Togo, other African countries beat Nigeria in passport ranking",
    "summarized_story": "The passport of Nigeria, Africa’s most populous country, ranked 101st out of 199 countries, according to the ranking done by the Henley Passport Index, described as the original, authoritative ranking of all the world’s passports.\nThe index ranks passports, according to the number of destinations their holders can access without a visa.\nJapan is number one on the list, followed by Singapore in second place, and South Korea and Germany tied for third.\n“While the dominance of European passports in the top 10 has been a given for most of the index’s 16-year history, the pre-eminence of three Asian states — Japan, Singapore, and South Korea — has become the new normal.\nNigeria beat only seven countries on the continent, namely Ethiopia (102nd), South Sudan (103rd), Eritrea and Democratic Republic of the Congo (104th), Sudan (106th), Libya (107th), and Somalia (111th)."
  },
  {
    "headline": "INEC counters NASS, insists nationwide electronic transmission of election results possible",
    "summarized_story": "The Independent National Electoral Commission (INEC), has said it is capable of transmitting election results from wards despite the rejection of electronic transmission of election results by the National Assembly in the Electoral Act (Amendment) Bill.\nINEC National Commissioner and Chairman (Information and Voter Education Committee), Festus Okoye, expressed these views in an interview with Sunday PUNCH in Abuja.\nThe clause gives the Independent National Electoral Commission the discretion to determine when, where and how voting and transmission of results will be done.\nAfter the passage of the bill, the Speaker, Mr Femi Gbajabiamila, criticised the proposed electronic transmission of election results, saying it was not feasible in the country for now.\nMany Nigerians criticised the National Assembly for the non-acceptance of the electronic transmission of election results."
  },
  {
    "headline": "NGX, Greenwich Securities, Africa Prudential Collaborate on Retail Investor Workshop",
    "summarized_story": "Nigerian Exchange (NGX) Limited continues to promote investor education with its Retail Investor Workshop, the latest of which held on Wednesday, 14 July 2021.\nThe webinar which was hosted in collaboration with Greenwich Securities Limited and Africa Prudential Plc was themed, Realizing Income from Your Investments, Dividends to Coupons and Everything In-Between.\nWe are, therefore, pleased to collaborate with two institutions that represent important stakeholders in the Nigerian capital market ecosystem – Greenwich Securities Limited and Africa Prudential Plc – representing the brokers and registrar businesses respectively.\nThe event culminated in a presentation from the Head, X-Academy, NGX, Ms. Ugochi Obi on the learning opportunities NGX provides to deepen knowledge about the capital market.\nThe market continues to look forward to initiatives such as this that will ultimately deepen the capital market and improve liquidity."
  },
  {
    "headline": "FCT DRTS Decorates 50 Newly Promoted Senior Officers",
    "summarized_story": "Newly promoted senior officers of the Directorate of Road Traffic Services (DRTS), Federal Capital Territory (FCT) Abuja, otherwise known as VIO, have been urged to rededicate themselves and justify their elevation.\nThe Director of the DRTS, Alhaji Wadata Aliyu Bodinga, gave the charge while decorating the officers with their new ranks.\nA total 50 officers ranging from Chief Executive Officer to deputy director were decorated at the DRTS headquarters at Mabushi in Abuja.\nHe enjoined the officers to intensify the good work they have been doing in ensuring smooth traffic in the Federal Capital Territory.\n“I therefore urge motorists to ensure that their vehicle particulars are up to date and that they also do not infringe on traffic regulations."
  },
  {
    "headline": "FCT DRTS Decorates 50 Newly Promoted Senior Officers",
    "summarized_story": "Newly promoted senior officers of the Directorate of Road Traffic Services (DRTS), Federal Capital Territory (FCT) Abuja, otherwise known as VIO, have been urged to rededicate themselves and justify their elevation.\nThe Director of the DRTS, Alhaji Wadata Aliyu Bodinga, gave the charge while decorating the officers with their new ranks.\nA total 50 officers ranging from Chief Executive Officer to deputy director were decorated at the DRTS headquarters at Mabushi in Abuja.\nHe enjoined the officers to intensify the good work they have been doing in ensuring smooth traffic in the Federal Capital Territory.\n“I therefore urge motorists to ensure that their vehicle particulars are up to date and that they also do not infringe on traffic regulations."
  },
  {
    "headline": "5 Suspected Kidnappers Burnt To Death In Edo",
    "summarized_story": "Five suspected kidnappers were burnt to death at the weekend by locals along the Afuze-Uokha Road in Owan West local government area of Edo State.\nThe suspects were said to have attacked and abducted some travellers who they took into the bush.\nThe locals, on sighting the kidnappers, snatched them from the vigilantes and burnt them to death.\nAs they were coming out in Uokha community on their way to the police station, angry youths in Uokha and adjoining towns took away the suspected kidnappers from the vigilantes.\n“All efforts to get the suspects to the police proved abortive as they were burnt to death."
  },
  {
    "headline": "5 Suspected Kidnappers Burnt To Death In Edo",
    "summarized_story": "Five suspected kidnappers were burnt to death at the weekend by locals along the Afuze-Uokha Road in Owan West local government area of Edo State.\nThe suspects were said to have attacked and abducted some travellers who they took into the bush.\nThe locals, on sighting the kidnappers, snatched them from the vigilantes and burnt them to death.\nAs they were coming out in Uokha community on their way to the police station, angry youths in Uokha and adjoining towns took away the suspected kidnappers from the vigilantes.\n“All efforts to get the suspects to the police proved abortive as they were burnt to death."
  },
  {
    "headline": "Ward Congress: APC Grants Waivers To New Members",
    "summarized_story": "The All Progressives Congress (APC) has released the approved schedule of activities and guidelines for the conduct of its nationwide ward congresses scheduled for July 31.\n“Screening of aspirants for the ward party positions is scheduled for July 29 to July 30, ward congresses will hold July 31, appeals arising from ward congresses will hold August 2 to August 7,” he said.\n“The committee shall be responsible for the conduct of the ward congress exercise in their place of posting,” the APC scribe said.\nHe said the ward congress would consist of all registered party members in the ward, adding that newly registered members from the updated 2021 party membership register were eligible to participate in the ward congress.\nAccording to him,the ward congress would carry out the election of Ward Chairman,Ward Vice Chairman,Ward Secretary,Ward Assistant Secretary, Ward Legal Adviser and Ward Assistant Legal Adviser, among others."
  },
  {
    "headline": "Man stabs wife, Redeemed pastor to death in Imo community",
    "summarized_story": "Residents of Umuokoto town in Umudibia Autonomous Community in Owerri West Local Government Area of Imo State were thrown into mourning when a man identified as Obum stabbed his wife and a pastor of Redeemed Christian Church of God (RCCG) to death on Friday.\nWhile the pastor died immediately, his wife died minutes later from excessive beating and bleeding.\nAccording to eyewitnesses, the incident started around 4pm when Obum’s wife, Ogechi and her one- year- old son were heard screaming for help.\n“As the crowd intensified effort to rescue the woman, Obum with a knife, threatened to kill anyone who tried to stop his action,” one of them said.\nIt gathered the man died on the way to the hospital."
  },
  {
    "headline": "Man stabs wife, Redeemed pastor to death in Imo community",
    "summarized_story": "Residents of Umuokoto town in Umudibia Autonomous Community in Owerri West Local Government Area of Imo State were thrown into mourning when a man identified as Obum stabbed his wife and a pastor of Redeemed Christian Church of God (RCCG) to death on Friday.\nWhile the pastor died immediately, his wife died minutes later from excessive beating and bleeding.\nAccording to eyewitnesses, the incident started around 4pm when Obum’s wife, Ogechi and her one- year- old son were heard screaming for help.\n“As the crowd intensified effort to rescue the woman, Obum with a knife, threatened to kill anyone who tried to stop his action,” one of them said.\nIt gathered the man died on the way to the hospital."
  },
  {
    "headline": "Worsening insecurity: Ibadan traditional council blames Makinde",
    "summarized_story": "Ibadan Traditional Council has blamed Governor Seyi Makinde for worsening insecurity in Oyo State, urging him to change tactics before it is too late..\nThe council gave the advice at its meeting held at the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, at the weekend.\nThe council comprises members of the Olubadan-in-Council, other monarchs in Ibadan land and family heads known as Mogajis.\nTaking turns to speak on the growing security crisis in the State, the council members accused Makinde of running a one-man administration, which they insisted was hurting security.\nHe stressed excluding the traditional institution has not been helpful to security in Ibadan."
  },
  {
    "headline": "Worsening insecurity: Ibadan traditional council blames Makinde",
    "summarized_story": "Ibadan Traditional Council has blamed Governor Seyi Makinde for worsening insecurity in Oyo State, urging him to change tactics before it is too late..\nThe council gave the advice at its meeting held at the palace of the Olubadan of Ibadan, Oba Saliu Adetunji, at the weekend.\nThe council comprises members of the Olubadan-in-Council, other monarchs in Ibadan land and family heads known as Mogajis.\nTaking turns to speak on the growing security crisis in the State, the council members accused Makinde of running a one-man administration, which they insisted was hurting security.\nHe stressed excluding the traditional institution has not been helpful to security in Ibadan."
  },
  {
    "headline": "3,462 Nigerian Christians killed by herdsmen, Jihadists in 200 days",
    "summarized_story": "By AbankulaAn estimated 3,462 Nigerian Christians have been killed this year by Nigerian Jihadists, Fulani herdsmen and state actors up till 18 July.\nThis number further represents daily average Christian deaths of seventeen and second highest since 2014 when over 5000 Christian deaths were recorded in the hands of Boko Haram and Jihadist Fulani Herdsmen.\nWhile Boko Haram killed over 4000 Christians in 2014, the Jihadist Fulani Herdsmen accounted for 1,229 Christian deaths.\nIn recent months’ attacks, Bali recorded 66 Christian deaths with scores of churches burnt; Gassol 56 Christian deaths and 15 churches burnt; Takum 20 Christian deaths and seven churches burnt, Wukari five Christian deaths, Dunga five Christian deaths, Gashaka four Christian deaths and one church burnt and Karimo-Lamido twelve Christian deaths.\nHe was killed days after along with eight of the ten abducted Christians."
  },
  {
    "headline": "Sanwo-Olu pledges more open market access for MSMEs",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu on Sunday said his administration would continue to ensure ease of access to market opportunities for the exposure and viability of Micro, Small and Medium Enterprises (MSMEs) globally.\nSanwo-Olu, represented by Mrs Folasade Jaji, Secretary to the State Government, Lagos, urged MSMEs to leverage the knowledge and network gained at the fair to build better business connections.\n“In line with the THEMES Agenda of making Lagos State a 21st century economy, MSMEs will continue to receive support from the Lagos State Government in various ways.\nThis, she said, would help position the MSMEs for unprecedented growth and continued yield of tangible dividends, long after the fair.\n“The exuberance of the participating MSMEs is a testament to the commitment to the sustainability and inevitable prosperity of your various businesses."
  },
  {
    "headline": "You lied: Presidency fact-checks Bishop Kukah’s speech",
    "summarized_story": "Michael AdeshinaThe presidency has accused Bishop Kukah of spreading falsehood with the intent to discredit President Muhammadu Buhari-led’s administration.\nKukah said: “The whole of the North is being invaded by armed bandits that are launching attacks at will.\nSo, we require practical and measuring assistance that can help us and our children.”However, Presidency replied to Bishop Kukah in a statement released on Sunday.\nThe Presidency described the way and manner Bishop Matthew Kukah “castigated” his country, Nigeria, before the United States Congress as unfortunate and disappointing.\nThe attack on Christian students is sad and unacceptable; so also is the abduction of students of other faiths."
  },
  {
    "headline": "BREAKING: Bandits Kill 13 Policemen In Zamfara",
    "summarized_story": "Armed men suspected to be bandits have attacked the Kurar Mota community in Bungudu Local Government Area of Zamfara State, killing at least 13 police officers.\nIt was gathered that the incident occured on Sunday when the assailants invaded a police formation and gunned down officers on duty.\nThey then rode to a community along Magami – Dankurmi – Dangulbi road and killed one person and torched four shops.”“Thereafter, they moved to the Kurar Mota community and attacked the police formation near the township clinic.\nThe criminals then dashed into the forest”“The slain officers and the injured ones were conveyed to Gusau in a convoy of police vehicles this afternoon.\nWhen contacted by Our correspondent, the state’s Police Public Relations Officer, PPRO, SP Muhammad Shehu said he would inquire and revert."
  },
  {
    "headline": "Lai Mohammed Denies Asking Obi Cubana To Loan Nigeria Money",
    "summarized_story": "Lai Mohammed, the Minister of Information and Culture, has denied requesting Obi Iyiegbu alias Obi Cubana, the Chairman of the Cubana Group, to lend money to Nigeria.\n“Obi Cubana has this type of money, and Nigeria is borrowing money from China,” according to the story, which was published by an internet outlet.\nCubana should lend us money since Nigeria is collapsing, according to Lai Mohammed.”For the past four days, Obi Cubana has been trending on social media for hosting a spectacular burial for his mother in Oba, a town in Anambra State’s Idemili South local government area.\nThe event’s ‘naira rain’ prompted countless memes urging Nigeria to borrow money from Obi Cubana rather than China.\nUnder the 2018-2020 External Borrowing (Rolling) Plan, the Senate approved Buhari’s proposal for ongoing external loans totaling $8.3 billion and €490 million on Thursday."
  },
  {
    "headline": "Presidency Responds To Bishop Kukah’s Alleged Killing, Persecution Of Christians To U.S",
    "summarized_story": "The Presidency has responded to Bishop Matthew Kukah’s recent allegations against the Buhari government before the United States Congress.\n“We are all too familiar with these overseas political tours that opposition politicians take – visiting foreign leaders and legislators in the United States, United Kingdom and Europe.\nBut neither is there anything in our Constitution to state that political posts must be apportioned according to ethnicity or faith.\n“Sad but true that Kankara students in Katsina State were stolen by bandits of the same Islamic faith as those they took away.\n“The attack on Christian students is sad and unacceptable; so also is the abduction of students of other faiths."
  },
  {
    "headline": "Primate Ayodele Replies Femi Adesina After Calling Him Fake Prophet",
    "summarized_story": "Primate Elijah Ayodele, the Leader of INRI Evangelical Spiritual Church, has responded to recent criticism leveled at him by Femi Adesina, President Muhammadu Buhari’s Special Adviser on Media and Publicity.\nIn response to Ayodele’s prediction of the country’s disintegration in 2040, Ayodele advised Adesina to wait till then.\n“Femi Adesina is my son, I can’t join issues with him, I understand he is only trying to defend his paymasters,” he said.\n“On my prophecy about Nigeria’s break up before 2040, Femi Adesina should wait till then before describing this prophecy as false,” he said.\nI can’t join issues with Femi Adesina, he is my son.”"
  },
  {
    "headline": "Pictures: Taekwondo athlete, Elizabeth Anyanacho, in first training session at Kisarazu Japan days to Olympics battle",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: In Tokyo, Elizabeth Anyanacho, officials receive Taekwondo brand new gears, kits for Olympics",
    "summarized_story": "Taekwondo star Elizabeth Anyanacho alongside Olympian Chika Chukwumerije and Secretary General Kabir Yusuf on Friday recieved and unveiled brand new gears and kits from South Korea.\nBranded by Motor company, Olympian to be Anyanacho currently at her training camp in Japan later wore and displayed the wears.\nAn excited Anyanacho while expressing her feeling said, “Yea, it looks good.\nI can’t wait to train and get ready for the contest.”"
  },
  {
    "headline": "Subsidy saga: Govt’s stance, citizens’ dilemma",
    "summarized_story": "Alas, it was not too long before the government reverted to status quo with the NNPC once again funding subsidy.\nThe actual consumption of petroleum products in Nigeria is also not ascertained to determine the amount of subsidy the Nigeria government pays to importers.\n“The NNPC refineries have been running below capacity for over 20 years and the government has not done anything about it.\n“The petroleum products directly impact the daily living of Nigerians and removal of subsidy without commensurate cushion will increase the hardship in the country,” he said.\nRegrettably, the Nigerian State is complicit and remains the number one stumbling block to finding solutions to the subsidy saga."
  },
  {
    "headline": "I have all it takes to be next national chairman of APC – Yari -NigPilot",
    "summarized_story": "“All I know is this: I have the capacity to lead this party, and they know what I can do,” he said.\nAccording to Alhaji Yari, despite its inability to accomplish all the objectives it set for itself in its progressive manifesto, the APC has abundant chances of winning the 2023 elections in a very remarkable way, if the ‘right’ things are done between now and next year.\nHe stressed that one of the right things that APC needs to do is to enable a people-focused party stalwart like him to repeat past electoral successes that he has accomplished even before the beginning of the current democratic dispensation.\n“Some persons can fabricate lies, but at the end of the day, the truth will prevail.\nThere are so many other things they have said that is a mere tissue of lies meant to try to get a good man down, but they will never succeed,” Alhaji Yari stated."
  },
  {
    "headline": "I have all it takes to be next national chairman of APC – Yari -NigPilot",
    "summarized_story": "“All I know is this: I have the capacity to lead this party, and they know what I can do,” he said.\nAccording to Alhaji Yari, despite its inability to accomplish all the objectives it set for itself in its progressive manifesto, the APC has abundant chances of winning the 2023 elections in a very remarkable way, if the ‘right’ things are done between now and next year.\nHe stressed that one of the right things that APC needs to do is to enable a people-focused party stalwart like him to repeat past electoral successes that he has accomplished even before the beginning of the current democratic dispensation.\n“Some persons can fabricate lies, but at the end of the day, the truth will prevail.\nThere are so many other things they have said that is a mere tissue of lies meant to try to get a good man down, but they will never succeed,” Alhaji Yari stated."
  },
  {
    "headline": "I championed e-transmission of elections’ result – Sen Ubah -NigPilot",
    "summarized_story": "The lawmaker emphasized that he “supported the proposed amendment of the Electoral Act to allow for the electronic transmission of results by INEC” as a member of the committee that recommended the reviewed amendment bill.\n“In line with parliamentary practice, I walked out of the Senate chambers in protest to register my displeasure; hence my absence during the voting session.\nBefore walking out of the Senate chambers, I didn’t fail to tell the Senate President how disappointed I was by his action.\n“It is my earnest belief that the use of technology in elections can significantly improve the efficiency and transparency of electoral conducts in Nigeria.\n“Undoubtedly, the adoption of electronic transmission of electoral results can serve as an effective/viable solution to the chaotic, manipulative, and violently disruptive process that has characterized manual collation of votes in Nigeria,” he stressed."
  },
  {
    "headline": "I championed e-transmission of elections’ result – Sen Ubah -NigPilot",
    "summarized_story": "The lawmaker emphasized that he “supported the proposed amendment of the Electoral Act to allow for the electronic transmission of results by INEC” as a member of the committee that recommended the reviewed amendment bill.\n“In line with parliamentary practice, I walked out of the Senate chambers in protest to register my displeasure; hence my absence during the voting session.\nBefore walking out of the Senate chambers, I didn’t fail to tell the Senate President how disappointed I was by his action.\n“It is my earnest belief that the use of technology in elections can significantly improve the efficiency and transparency of electoral conducts in Nigeria.\n“Undoubtedly, the adoption of electronic transmission of electoral results can serve as an effective/viable solution to the chaotic, manipulative, and violently disruptive process that has characterized manual collation of votes in Nigeria,” he stressed."
  },
  {
    "headline": "Kwara APC battle: Lai Mohammed loses 11 loyalists to suspension -NigPilot",
    "summarized_story": "Minister of Information and culture, Lai Mohammed, appears to be on the losing side in the ensuing battle for the leadership of Kwara State chapter of the All Progressives Congress, APC, between his camp and that of the State governor, AbdulRahman AbdulRazaq as the national secretariat of APC has approved the suspension of 11 of his loyalists.\nNigerian Pilot reliably gathered that disciplinary action was taken against the minister for taking legal action against the party and its state chairman, Hon.\nAbdullahi Samari Abubakar.\nThe suspension letter, sighted by our correspondent Thursday, is dated February 5, 2021, signed by Secretary of the APC Caretaker/Extra-ordinary Convention Planning Committee, Sen. James Akpanudoedehe, and addressed to the Kwara State Chairman, Hon.\nAbdullahi Samari Abubakar."
  },
  {
    "headline": "Why We Voted For E-Transmission Of Results With Conditions – Senate President",
    "summarized_story": "President of the Senate, Ahmad Lawan has advanced reasons to justify the position taken by the Senate on the electronic transmission of election results.\n“What I mean here is that you have Senators from the northern part of Nigeria who voted for electronic transmission.\nMaybe that is their belief or their environment is ready for electronic transmission.\nI have seen it reported in the media that only APC Senators voted against the immediate deployment of electronic transmission.\nThe Senate President said it was wrong to conclude that Senators who voted for electronic transmission with conditions did not like the results transmitted electronically."
  },
  {
    "headline": "Eid-El-Kabir: IGP Assures Nigerians Of Sustained Efforts At Improving Security",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba has assured the nation of sustained efforts by the Force in fighting crimes and criminality and improving public safety and security across the country.\nHis assurance on Sunday was contained in a communique titled, ‘Eid-el-Kabir: IGP assures sustained efforts at improving public safety and security, by the Force Public Relations Officer, Frank Mba.\nREAD ALSO: NDLEA Arrests Anambra Drug Kingpin Recovers 548,000 Tramadol TabletsHe particularly directed the Zonal AIGs and State Command CPs to put in place all necessary security measures to ensure a secure, peaceful, and incident-free celebration.\nThe IGP equally warned that personnel deployed must be professional and mindful of the fundamental rights of the citizens, and discharge their responsibilities with all sense of decorum and alertness.\nHe wished all Muslims a happy and peaceful Sallah celebration and enjoined citizens to celebrate and enjoy the beauty of the Eid-el-Kabir while remaining security conscious and compliant with the COVID-19 prevention protocols."
  },
  {
    "headline": "NDLEA Arrests Anambra Drug Kingpin Recovers 548,000 Tramadol Tablets",
    "summarized_story": "A major illicit drug kingpin in Anambra, Okeke Chijioke (44), has been arrested by operatives of the National Drug Law Enforcement Agency, (NDLEA).\nAfter a search of his warehouse, 548,000 tablets of Tarkadol weighing 302.500 kilograms were recovered, with the suspect accepting ownership of the substances recovered.\nThe drug was equally labeled 100mg pain reliever on its packs to avoid scrutiny, while laboratory tests confirmed it’s a 225mg drug.\n“It was further discovered that the drug was manufactured in India and smuggled into Nigeria without NAFDAC number or certification.\nGen. Mohamed Buba Marwa (Retd) charged them to remain unrelenting in the discharge of their duties."
  },
  {
    "headline": "We Have Capacity For Electronic Transmission In Remote Areas – INEC",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) on Saturday suggested it has the capacity to transmit election results electronically from remote areas across the country.\nLawmakers in both chambers of the National Assembly had been at loggerheads over electronic transmission of results earlier in the week.\nThe House was thrown into disarray on Thursday as members debated section 52(2) of the electoral amendment act bill, which deals with electronic transmission.\nAccording to the lawmakers opposed to sacrosanct electronic transmission of results, some parts of the country do not have the required network coverage.\n“We have uploaded results from very remote areas, even from areas where you have to use human carriers to access,” he said."
  },
  {
    "headline": "US Tennis Teen Coco Gauff Tests Positive To COVID-19",
    "summarized_story": "American teen tennis star Coco Gauff will miss the Tokyo Olympics after testing positive for COVID-19, she announced on Sunday.\n“I am so disappointed to share the news that I have tested positive for COVID and won’t be able to play in the Olympic Games in Tokyo,” Gauff tweeted.\nWorld number 25 Gauff will be forced into Covid-19 quarantine and isolation protocols.\n“I want to wish TEAM USA best of luck and a safe games for every Olympian and the entire Olympic family,” Gauff tweeted.\nThe Olympics tennis event in Tokyo is missing a host of big names with major winners Roger Federer, Rafael Nadal, Serena Williams, Victoria Azarenka, Angelique Kerber and Bianca Andreescu all absent."
  },
  {
    "headline": "Burden of leadership requires us to act in faith at all times- Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo, SAN, has said that in the face of adversity, leaders must and are expected to remain calm so that the people they lead will follow in their footsteps.\nHe made this statement at the Redeemed Christian Church of God’s 25th anniversary conference, themed “Winning in Adversity.” on Saturday.\nProf Osinbajo stated that “it is in times of adversity or difficulty, or hardship that leaders are most relevant and most needed.\nBut note that Moses first gave the people confidence in the power of God to deliver and fulfil His promises.\nThis is the burden of leadership, especially leadership according to the principles of scripture.”In attendance at the conference were Pastor A.A Bolarinwa, Assistant Continental Overseer, Research and Development of the RCCG, Pastor Idowu Iluyomade, Intercontinental Overseer for Corporate Social Responsibility and Pastor in Charge, RCCG Region 20 and Pastor Banky Ladele, the Acting Rector RILA."
  },
  {
    "headline": "Ikpeazu prohibits sale of tickets to Okada, Keke riders on public holidays in Abia",
    "summarized_story": "Governor of Abia State, Okezie Ikpeazu, has prohibited the sale of revenue tickets to commercial motorbike and tricycle operators known as Okada and Keke riders.\nA statement by the Commissioner for Information, Chief John Okiyi Kalu, said this was according to a resolution reached after a meeting between the Abia State Internal Revenue Service (AIRS) and major stakeholders in the transport sector, including commercial tricycle (Keke) and motorcycle (Okada) operators.\nMr. Kalu said the governor has directed that the sale of e-tickets on public holidays should cease, effective from Monday, 19th July, 2021.\nHe also announced that the proposed new daily e-ticket charge for commercial tricycle and motorbike operators would be reduced from N240 to N200 on a daily basis.\nHe also announced the reduction of proposed new daily e-ticket rate for commercial tricycle and motorcycle operators from N240 to N200 daily."
  },
  {
    "headline": "Lagos Assembly proposes two-year jail term for obstruction, assault on firefighters",
    "summarized_story": "Mr. Kazeem submitted that the fine for a corporate body should be five million Naira.\n“A charge shall not be made for any service rendered by the service in extinguishing fires and for rescue operations.\nAdvertisement“The service is empowered to cause authorised officers to carry out inspection of any building in the state and the service shall charge fees for inspection of suchbuildings,” he said.\nIn his contribution, a former Head of Lagos State Fire Service, Mr. Aderemi Ajose, said the fire service should be under Lagos State Ministry of Special Duties.\nA former Commissioner for Home Affairs in the state, Mr Oyinlomo Danmole, advised that fire hydrant should be stationed at strategic places across the state to be handy to fire fighters during fire emergencies."
  },
  {
    "headline": "Amid Dispute Between Oba of Benin and Edo Governor, FG to ‘Take Possession’ of Repatriated Benin Artefacts",
    "summarized_story": "The remarks on the heels of the controversy between the Oba of Benin Ewuare II and the Governor of Edo State Mr Godwin Obaseki over who should take possession of the artefacts.\n“Gentlemen, the Federal Government is aware of the widely-reported controversy on who will take possession of the Benin Bronzes when they are returned from Germany.\nHe said the antiquities consisted of two important Benin Bronzes and an exquisite Ife Bronze head.\n– In March 2021, the University of Aberdeen in Scotland agreed to return a Benin Bronze from its collections.\n– The University of Cambridge in the United Kingdom has also agreed to return a disputed Benin artefact."
  },
  {
    "headline": "‘The Town Has Been Destroyed’: Germany Deals with Aftermath of Worst Natural Disaster in 60 Years",
    "summarized_story": "“The town has been destroyed, everything really, streets and houses,” Brandt told Al Jazeera.\nIn Germany, at least 133 people have died, making it the worst natural disaster to hit the country in almost 60 years.\nIn nearby Blessem, the waters filled a gravel quarry, triggering a landslide that collapsed several houses and a historic castle.\nThe disaster has once again forced climate to the front of the political agenda just months before federal elections.\nBut for now campaigning has been suspended and politicians are focused on assisting the victims and mourning the dead."
  },
  {
    "headline": "Martine Moïse, Wife of Slain President, Returns to Haiti",
    "summarized_story": "Martine Moïse, the wife of Haiti’s assassinated president who was injured in the July 7 attack at their private home, returned to the Caribbean nation on Saturday following her release from a Miami hospital.\nShe was greeted by Interim Prime Minister Claude Joseph and other officials.\nJoseph has been leading Haiti with the backing of police and the military despite the fact that Moïse had announced his replacement a day before the president was killed.\nA U.N. spokesman declined comment except to say that the U.N. is part of the group that issued the statement.\nOn July 11, a delegation of representatives from the U.S. Department of Justice, Department of Homeland Security, Department of State, and National Security Council traveled to Haiti."
  },
  {
    "headline": "Europe Flooding Toll Over 180 as Rescuers Dig Deeper",
    "summarized_story": "The death toll from flooding in Western Europe climbed above 180 on Sunday after rescue workers dug deeper into debris left by receding waters.\nPolice put the toll from the hard-hit Ahrweiler area of western Germany’s Rhineland-Palatinate state at 110 and said they feared the number may still rise.\nIn neighboring North Rhine-Westphalia state, Germany’s most populous, 45 people were confirmed dead, including four firefighters.\nChancellor Angela Merkel was due to visit Schuld, a village near Ahrweiler that was devastated by the flooding, later Sunday.\nThere was flooding Saturday night in the German-Czech border area, across the country from where last week’s floods hit, and in Germany’s southeastern corner and over the border in Austria."
  },
  {
    "headline": "Nigeria: Lagos, 5 Other States, Federal Capital on Red Alert Over Third Covid Wave",
    "summarized_story": "Nigeria’s federal government has put six states and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against the third wave of Covid-19.\nIn addition to the FCT, the six states are Lagos, Oyo, Rivers, Kaduna, Kano and Plateau.\nThe Chairman, PSC, who also doubles as the Secretary to the Government of the Federation, Mr Boss Mustapha, signed the statement.\nHe said the steps were critical as there were worrisome early signs of increasing cases in the country.\nIt reminded Nigerians and all residents to ensure they stay safe at all time."
  }
]