[
  {
    "headline": "Borno enrols 5,361 orphans, offers vigilantes’ children scholarships",
    "summarized_story": "The Borno State Governor, Prof. Babagana Umara Zulum, has supervised the enrolment of school-aged children whose parents were killed by Boko Haram.\nThe enrollment was done on Wednesday during a visit of the governor to Monguno, where a total number of 5,361 orphans were registered during the two-day exercise.\nAlthough the enrollment was for orphans, other parents trooped out with their children, demanding enrollment, which Zulum promised to approve.\nThe governor appealed to guardians of all the 5,361 orphans to ensure their wards regularly attended school.\nZulum was supported by the Speaker of the Borno State House of Assembly, Abdulkarim Lawan; commissioners, and other top government officials during the exercise."
  },
  {
    "headline": "NDLEA arrests bandits, arms manufacturer in Katsina, Benue, seizes weapons",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency have arrested three armed bandits, Adamu Shehu, Tukur Mohammed and Ibrahim Suleiman, while on an attack mission in Katsina State, with three AK-47 rifles, among other items recovered from them.\nThe agency also arrested who it described as “a heavy weapon manufacturer,” Celestine Chidiebere, with a high calibre G3 rifle along with 78 rounds of live ammunition of 7.62mm calibre and five empty shells of same in Benue.\nChidiebere was arrested while trying to move the heavy weapon and ammunition to Jos, Plateau State.\nA fabricated high calibre G3 rifle, along with 78 rounds of live ammunition of 7.62mm calibre and five empty shells of same were discovered inside.\n“However, I asked that Celestine Christian be transferred to Abuja because of the calibre of weapon found with him, which he claimed he manufactured.”\\Copyright PUNCH."
  },
  {
    "headline": "NDDC contractors beg Buhari, Akpabio to pay outstanding bills",
    "summarized_story": "Godswill AkapbioA coalition of Niger Delta contractors has beckoned on the Minister of Niger Delta Affairs, Godswill Akpabio and the Interim Administrator of Niger Delta Development Commission, NDDC, Effiong Akwa, to complete the payment for projects done by them in the oil-rich region.\nIn a statement on Wednesday, the coalition said their members “are dying on a daily basis as result of pressure from loans, harassment and intimidation”.\nThe contractors recalled that weeks ago, the NDDC MD assembled some contractors and made some payments below N100million, “assuring them of payment but until now nothing has been paid”.\nWhile making a passionate appeal for the payments to be fast-tracked, they noted that over N5billion are still been owed contractors.\nMeanwhile, the NDDC and the Niger Delta Ministry recently announced that the process of the Forensic Audit as ordered by President Muhammadu Buhari, has been concluded and that the report would be presented to the president soon."
  },
  {
    "headline": "Buni: APC asks Judiciary to punish PDP’s abuse of court processes",
    "summarized_story": "By Omeiza Ajayi – AbujaThe ruling All Progressives Congress APC has expressed confidence in the ability of the nation’s judiciary to punish the Peoples Democratic Party PDP for what it described as abuse of court processes regarding a suit instituted by the opposition party on the legality of Gov.\nMai Mala Buni’s appointment as caretaker chairman of the APC.\nThe statement titled, “Re:PDP’s frivolous court action against the CECPC Chairman, Governor Mai Mala Buni”, reads; “Our attention has been drawn to a purported court action sponsored by the Peoples Democratic Party PDP against His Excellency, Mai Mala Buni, Chairman of the APC Caretaker/Extraordinary Convention Planning Committee CECPC and Governor of Yobe State.\n“There are clearly spelt out punitive measures against abuse of court processes.\nThe PDP had on Wednesday approached the Federal High Court sitting in Abuja, asking it to sack Governor Mai Mala Buni of Yobe State from office."
  },
  {
    "headline": "Buhari meets Tinubu in London",
    "summarized_story": "By Johnbosco Agbakwuru – AbujaPRESIDENT Muhammadu Buhari, Thursday evening, visited the National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, in his London home.\nThe Personal Assistant to the President on New Media, Bashir Ahmad, who confirmed the meeting of President Buhari and Asiwaju Tinubu said the President was the visitor and that he had no details of their discussions.\nRecall that President Buhari traveled to the United Kingdom on July 26, 2021, to take part in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\n“President Muhammadu Buhari will today Monday July 26, 2021, travel to the United Kingdom to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\n“President Buhari will also hold a bilateral meeting with Prime Minister Boris Johnson."
  },
  {
    "headline": "EFCC probe: I have nothing to hide, Dickson tells Bayelsa LGA chairmen",
    "summarized_story": "Dickson spoke while playing the host to the local chairmen from Bayelsa State who paid him a solidarity visit on Thursday following his invitation by the EFCC on allegation on flood funds diversion and undeclared assets.\nWhen the late General Azazi died tragically, Senator Dickson appointed Chief Doukpola to head the committee.\nDickson expressed further shock that he did not contest any reelection in 2019 as alleged in the petition to the EFCC.\nThe council chairmen called on the Federal Government to ensure fairness in the ongoing probe of allegations made against Senator Dickson by a non governmental organization.\nThey pledged their support to Senator Dickson for his unique leadership style which they said created the opportunity for them to be council chairmen."
  },
  {
    "headline": "Nigeria High Commission in London shutdown operations after officials test positive for COVID-19",
    "summarized_story": "The Nigeria High Commission in London has shutdown its operation for 10 days after two of its officials tested positive for Covid-19.\nAs a result, the Mission embarked on testing all officials after which another official tested positive.\nALSO READ: Mohammed Fawehinmi didn’t die of COVID — FamilyIt reads, “This afternoon the Head of Immigration Section and two other officials went for a meeting at the Home Office.\n“At the entrance, Covid test was administered on them and one of them tested positive to Covid-19.\n“In response to the challenge, the Mission embarked on testing all officials of the Mission, after which another official of the Mission tested positive."
  },
  {
    "headline": "Buhari visits Tinubu in London",
    "summarized_story": "President Muhammadu Buhari, Wednesday evening, visited a former Lagos Governor, Bola Tinubu in London.\nBuhari’s show of moral support confirms he’s in good terms with his ally contrary to speculations.\nOn Wednesday, James Faleke, a member of the House of Representatives, visited Tinubu.\nA known protégé, Faleke, representing Ikeja Federal Constituency, is the Chairman, House Committee on Finance.\nTinubu, a.k.a."
  },
  {
    "headline": "Rivers NUJ postpones elections due to unresolved controversies",
    "summarized_story": "The Rivers State council of the Nigeria Union of Journalists has postponed its election.\nA new date, however, is yet to be fixed for the exercise which is expected to produce new executives of the NUJ in Rivers state.\nThe exercise which was expected to hold on Thursday, 12th August was shifted after a controversy broke out during the 7th Triennial Delegate Conference in Port Harcourt.\nIt took the intervention of the Rivers state commissioner of police Friday Eboka to quell the controversy which led to the decision to shift the exercise to a new date.\nThe statement further disclosed that the credentials committee is expected to liaise with the National leadership to resolve all the contending issues in the state council before the election."
  },
  {
    "headline": "Mohammed Fawehinmi will be buried after autopsy – Family",
    "summarized_story": "The family of the late Mohammed Fawehinmi has said that he will be buried following an autopsy and other necessary arrangements.\nMrs Basirat Fawehinmi-Biobaku, the eldest child of Gani Fawehinmi, who spoke on behalf of the family, made the announcement at a news conference on Thursday in Lagos.\nGani Fawehinmi’s son, Mohammed is deadFawehinmi-Biobaku disclosed that the family couldn’t pre-empt the cause of his death until the release of the autopsy result.\nShe added that the deceased would be buried once the family concluded necessary arrangements.\nMohammed was said to have complained of breathing difficulties and was taken to a hospital, where he later died."
  },
  {
    "headline": "Borno EYN demolition: Police arrest suspected shooter of church members",
    "summarized_story": "The Police in Borno State have arrested the shooter of Ekklesiyar Yan’uwa of Nigeria Church (EYN) members.\nThe name of the culprit is Baba Bukar, a member of a joint security team, a government official said.\nThe source told DAILY POST that Bukar fired the bullets that hit church worshippers during a clash with Borno Geographical Information System (BOGIS) officials last Thursday.\nHours after the incident, Governor Babagana Zulum directed the police to investigate, arrest and prosecute anyone connected to the violence and shooting.\nMeanwhile, the Muslim Rights Concern (MURIC) has defended the Borno government over the demolition."
  },
  {
    "headline": "Mpape: FCTA continue raid, demolish worship centres, structures near Abuja roads",
    "summarized_story": "The Federal Capital Territory Administration (FCTA), on Thursday, demolished worship centres, shops, shanties and other illegal structures built on road corridors at Mpape in Abuja.\nIkharo Attah, Chairman, FCTA Ministerial Taskforce on City Sanitation, led the operation.\nAttah confirmed that the exercise would last for the next three weeks.\nHe said most of the affected worship centres extended their buildings and fence to the road shoulders.\nAttah said a number of shanties and containers on the roadside, across and deep inside the Mpape market have been destroyed since yesterday."
  },
  {
    "headline": "Premature testimony attracts evil spirit – Rudeboy",
    "summarized_story": "By Ekaete BasseySinger Rudeboy has stated one should never be too quick in announcing a testimony.\nAccording to the “Audio Money” crooner, any testimony that hasn’t been completely authenticated will always attract evil forces.\nNo form of evil spirit will scatter it.\nWhat evil spirit when God is the baba of them all.\nEnemies no reach.”alenicki_touch said: “Who God bless no man can curse.. dem nor born dat evil spirit well."
  },
  {
    "headline": "Top 10 Instagram earners in Nigeria",
    "summarized_story": "The list of the top 10 Instagram earners in Nigeria is derived by analysing publicly available data.\nAccording to official HopperHQ Instagram Richlist 2021, this is the list of the top 10 Instagram earners in Nigeria:· DavidoMultiple award-winning singer, Davido, with close to 21 million followers is the highest-paid Instagram celebrity from Nigeria and second highest in Africa after Mohammed Salah.\nAccording to the Hopper HQ rich list, Davido earns $128,300 (N64,150,000) per sponsored Instagram post.\nThe creator of Jenifa’s Diary makes an estimated $83,600 as Instagram celebrity per sponsored post according to the Hopper HQ rich list.\nThe sultry movie star is estimated to make estimated $26,700 per sponsored post as an Instagram celebrity."
  },
  {
    "headline": "Why we asked for suspension of sit-at-home order, by Nnamdi Kanu’s family",
    "summarized_story": "By Sunny Nwankwo, UmuahiaThe family of the leader of the Indigenous People of Biafra (IPOB) Nnamdi Kanu has explained why it gave a counter order to suspend the sit-at-home order on Monday.\nThe brother of the leader of IPOB, Emmanuel Kanu, in defending his elder brother Kanunta, who gave the counter order, said he (Kalunta) acted based on instructions from above.\n“There was an instruction passed to Chika Edoziem in charge of the Directorate of State (DOS) through IPOB lawyer, Ifeanyi Ejimofor concerning the sit-at-home order that it should be suspended for reasons meant to be beneficial to our people.\nHe said the family’s position on the sit-at-home order doesn’t translate to abandoning one of IPOB’s strategies in actualising the struggle but a way of giving Biafrans sense of belonging.\nEmmanuel said IPOB would continue to be stronger to face the challenges ahead while wishing its leadership the wisdom to continue to pilot affairs."
  },
  {
    "headline": "PDP wants court to sack Buni, Gubana",
    "summarized_story": "By Eric Ikhilae, AbujaThe opposition Peoples Democratic Party (PDP) has approached the Federal High Court in Abuja for among others, an order sacking Yobe Governor Mai Mala Buni and his deputy, Idi Barde Gubana.\nThe PDD wants Buni and Gubana replaced with its candidates in the last governorship election in Yobe State – Ambassador Umar Iliya and his running mate.\nThe requests by the PDP are contained in a suit, marked FHC/ABJ/CS/885/2021 field by its lawyer, Emeka Etiaba (SAN.\nIt argued that Buni ceased to be the Yobe State Governor from the time he elected to act as Caretaker Committee Chairman of the APC.\nListed as defendants are: Buni, Gubana, APC and the Independent National Electoral Commission (INEC)."
  },
  {
    "headline": "We’re all saddened, still in shock –Fawehinmi Family",
    "summarized_story": "By Lukman Olabiyi and Juliana Taiwo-Obalonye, AbujaThe family of Gani Fawehinmi has expressed sadness and shock over the demise of Mohammed, eldest son of the late activist and legal icon.\nThe late Mohammed obtained a law degree from the University of Buckingham, England and was called to the Nigerian Bar in 1998.\nMohammed Fawehinmi was as consistent as his father, the late Chief Gani Fawehinmi.\nWhile praying to God to grant the deceased eternal, Kalu urged the Fawehinmi family to be comforted in the remarkable life Mohammed Fawehinmi lived.\nHe said, “the death of the eldest child of late legal luminary, Chief Gani Fawehinmi, Mohammed is shocking and painful."
  },
  {
    "headline": "Two Nigeria High Commission staff test positive to COVID-19",
    "summarized_story": "Nigeria High Commission in London, United Kingdom, is shutdown for 10 days as two officials of the high commission have tested positive for the dread coronavirus.\nThe positive status of the official had prompted the testing of other Mission staff resulting in another positive case.\nThis was contained in a statement titled, ‘Closure of Nigerian High Commission, London.’It read, “This afternoon, the Head of Immigration Section and two other officials went for a meeting at the Home Office.\n“At the entrance, COVID-19 test was administered on them and one of them tested positive to COVID-19.\n“In response to this challenge, the Mission embarked on testing all officials of the Mission, after which another official of the Mission tested positive."
  },
  {
    "headline": "Abducted Niger Commissioner regains freedom after four days in captivity",
    "summarized_story": "The Niger state Commissioner for information, Mallam Mohammed Sani Idris who was abducted from his residence barely four days ago has regained his freedom.\nThe Commissioner who regained his freedom at about 6:00pm this evening, arrived his residence in Baban Tunga, in Tafa local government at about 7:30pm to the jubilation of anxious family members and other sympathizers.\nMeanwhile a source close to the Commissioner said he has been taken to a private hospital for medial Examinations and he is expected to meet with the state governor, Alhaji Abubakar Sani Bello tomorrow, Friday.\nIt could be recalled that the Commissioner for Information was abducted from his home on Sunday night by heavily armed men suspected to be bandits and taken to an unknown destination.\nThe gunmen were said to have requested N500million ransom money from the family for his release."
  },
  {
    "headline": "PDP asks court to sack Gov. Buni, deputy",
    "summarized_story": "From Godwin Tsa, AbujaThe Peoples Democratic Party(PDP) has asked a Federal High Court to sack the Governor of Yobe State, Mai Mala Buni and his deputy, Idi Barde Gubana from office and install Ambassador Umar Iliya of the PDP as the state governor.\nThe suit marked FHC/ABJ/CS/885/2021 is predicated upon the judgment of the Supreme Court in Eyitayo Olayinka Jegede and Anor and Independent National Electoral Commission(INEC), in appeal No: SC/448/2021/ delivered on July 28, 2021.\nListed as defendants in the suit are Mai Mala Buni, Idi Barde Gubana, the All Progressive Congress and the Independent National Electoral Commission.\nA declaration that the action of Mai Mala Buni as the Caretaker Committee Chairman of the APC while he remains the governor of the state are wrongful, null and void.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Shagari’s wife, Hadiza, dies of COVID-19 complications",
    "summarized_story": "Hadiza, the wife of former President Shehu Shagari, has died.\nHe said Hadiza died in the early hours of Thursday after battling COVID-19 complications.\nA funeral prayer for Hadiza, aged 80, is expected to be held on Thursday evening at the National Mosque in Abuja.\n“We regret to announce the demise of our beloved mother, Hajiya Hadiza Shehu Shagari, the wife of H.E late President Shehu Usman Aliyu Shagari, GCFR (Turakin Sokoto),” the statement reads.\n“Hajiya Hadiza Shehu Shagari was 80 years old."
  },
  {
    "headline": "Breaking: Abducted Niger Commissioner Regains Freedom",
    "summarized_story": "By Laleye Dipo in MinnaKidnapped Niger state Commissioner for Information Alhaji Mohammed Sani Idris has regained his freedom.\nTHISDAY learnt that he was released Thursday night.\nA reliable source at the Ministry of Information told THISDAY that he was “hale and hearty.”The source did not give details of how the commissioner was released or if ransom was paidDetails later..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Nigeria Shuts High Commission in London as Diplomats Test Positive for COVID-19",
    "summarized_story": "Michael Olugbode in AbujaNigeria High Commission in London has been shut as two officials tested positive for COVID-19.\nThe High Commission, according to a statement on Thursday will remain closed for ten days.\nA statement from the Nigeria High Commission said the closure became imperative after two staff tested positive for COVID-19.\nThe statement read: “This afternoon the Head of Immigration Section and two other officials went for a meeting at the Home Office.\n“At the entrance, COVID test was administered on them and one of them tested positive to COVID-19."
  },
  {
    "headline": "Breaking: PDP Seeks Buni’s Removal as Yobe Governor",
    "summarized_story": "Asks court to order swearing in of PDP’s governorship, deputy guber candidates in last electionBy Alex EnumahThe People’s Democratic Party ( PDP) has commenced legal action for the removal of Yobe State Governor, Mai Buni, from office over alleged breach of constitutional provisions barring a sitting executive from holding two offices at the same time.\nThe PDP in the suit dated and filed August 12, is specifically alleging that Buni violated section 183 of the constitution when as a governor he accepted to serve as Chairman of the Caretaker Committee of the All Progressives Congress (APC).\nThe plaintiffs which include Umar Damagum and Baba Aji in the suit filed by Emeka Etiaba, SAN, insisted that Buni ceases to be a governor from the moment he accepted to act as APC Caretaker Committee Chairman.\nThe plaintiffs therefore asked the court for an order directing the Yobe State Chief Judge or any other senior person next to the Chief Judge to immediately swear in Damagum and Aji as Governor and Deputy Governor of Yobe State being candidates of the party which came second in the 2019 governorship election in Yobe State.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Banks to Blacklist Customers Engaged in FX Manipulation",
    "summarized_story": "Say Post-No-Debit order will be placed on such customers’ accountsBy Nume EkegheBankers Committee has announced that banks would place Post-No-Debit (PND) order on the accounts of customers who use fraudulent means to procure foreign exchange (Fx).\nThe committee also said it had collaborated with Nigerian Interbank Settlement System (NIBBS) to create a portal where information on FX sales can be shared real-time to help checkmate arbitrage and also aid digitisation process of buying invincible.\nAnd the banks are reporting the individuals to the CBN.”“The likely punishment is that your account would be PND.\nAnd if you understand what that means, PND means you would not be able to do anything in the banking system.\nAnd so fraudulent transactions or fraudulent individuals will be reported to the CBN and the portal would help us do this.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Former President Shagari’s Widow, Hadiza, is Dead",
    "summarized_story": "Wife of late former President Shehu Shagari, Hadiza Shagari, is dead.\nAccording to the statement, funeral prayer for the late Hadiza will hold Thursday at the National Mosque in Abuja.\nThe statement read:“We regret to announce the demise of our beloved mother, Hajiya Hadiza Shehu Shagari, the wife of H.E late President Shehu Usman Aliyu Shagari, GCFR (Turakin Sokoto).\n“Hajiya Hadiza Shehu Shagari was 80 years old.\nHer Jana’iza (Funeral Prayer) will take place today, at 4.00pm, immediately after Asr prayer, at the National Mosque, Abuja.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Visits Tinubu in London As Ex-Lagos Governor Recuperates With Use Of Walking Stick After Second Surgery",
    "summarized_story": "Tinubu was seen with a walking stick during Buhari’s visit, confirming SaharaReporters’ story that he underwent a second surgery in the United States.\nSaharaReporters had on Monday reported that Tinubu underwent a knee surgery at the John Hopkins University Hospital in Maryland, US.\nOn Thursday, Tinubu visited Buhari leaning on a walking stick.\nPHOTONEWS: @AsiwajuTinubu Visits @MBuhari Using Walking Stick After Second Surgery In One Month | Sahara Reporters https://t.co/VS59G5y5oN pic.twitter.com/q8HvNvmtIi — Sahara Reporters (@SaharaReporters) August 12, 2021“You see he couldn’t hide that he had difficulty walking after undergoing his second surgery.\n“Tinubu had his second surgery at John Hopkins University in Maryland recently."
  },
  {
    "headline": "Buhari Visits Tinubu in London As Ex-Lagos Governor Recuperates With Use Of Walking Stick After Second Surgery",
    "summarized_story": "Tinubu was seen with a walking stick during Buhari’s visit, confirming SaharaReporters’ story that he underwent a second surgery in the United States.\nSaharaReporters had on Monday reported that Tinubu underwent a knee surgery at the John Hopkins University Hospital in Maryland, US.\nOn Thursday, Tinubu visited Buhari leaning on a walking stick.\nPHOTONEWS: @AsiwajuTinubu Visits @MBuhari Using Walking Stick After Second Surgery In One Month | Sahara Reporters https://t.co/VS59G5y5oN pic.twitter.com/q8HvNvmtIi — Sahara Reporters (@SaharaReporters) August 12, 2021“You see he couldn’t hide that he had difficulty walking after undergoing his second surgery.\n“Tinubu had his second surgery at John Hopkins University in Maryland recently."
  },
  {
    "headline": "BREAKING: Nigeria Shuts High Commission In London Over Continuous Anti-Buhari Protests",
    "summarized_story": "The Nigerian High Commission in London, the United Kingdom, has shut its offices over the continuous protests by Nigerians who joined the #BuhariMustGo and #RevolutionNow struggles and gathered at the commission daily.\nThe affected officer immediately isolated while the other officials, who tested negative will also isolate for the next 10 days.\n“Nigeria has temporarily shut its UK Embassy due to embarrassment by #BuhariMustGo protesters.\nSaharaReporters had obtained a video of the London policemen who chatted with the Nigerian protesters and were reportedly friendly.\n“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London."
  },
  {
    "headline": "BREAKING: Nigeria Shuts High Commission In London Over Continuous Anti-Buhari Protests",
    "summarized_story": "The Nigerian High Commission in London, the United Kingdom, has shut its offices over the continuous protests by Nigerians who joined the #BuhariMustGo and #RevolutionNow struggles and gathered at the commission daily.\nThe affected officer immediately isolated while the other officials, who tested negative will also isolate for the next 10 days.\n“Nigeria has temporarily shut its UK Embassy due to embarrassment by #BuhariMustGo protesters.\nSaharaReporters had obtained a video of the London policemen who chatted with the Nigerian protesters and were reportedly friendly.\n“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London."
  },
  {
    "headline": "BREAKING: Abducted Niger State Information Commissioner Regains Freedom",
    "summarized_story": "Niger State Commissioner for Information, Alhaji Muhammed Idris, has been released by his abductors.\nWATCH: Abducted Niger State Commissioner Of Information and Strategy Regains Freedom After Over 3 Days In Kidnappers' Den pic.twitter.com/EksPPAKxMt — Sahara Reporters (@SaharaReporters) August 12, 2021SaharaReporters learnt the commissioner was released on Thursday night.\nThe Niger state government had insisted it would not pay any ransom to secure the commissioner’s release.\nSee Also Breaking News BREAKING: Bandits Abduct Niger State Information CommissionerBut meetings were held over the commissioner’s abduction on Monday to strategise on how to secure his release.\nIn a video, which was released shortly after Idris regained freedom, the commissioner was seen addressing some persons."
  },
  {
    "headline": "Ndume to troops: End insecurity quickly -- but don't pamper repentant insurgents",
    "summarized_story": "Ali Ndume, senator representing Borno south, has urged security agencies to speed up efforts to end insurgency.\nAdvertisementOn Tuesday, the Nigerian army said over 100 Boko Haram fighters with their families have surrendered to the troops.\nOn Thursday, the army also said troops killed 27 insurgents, while no fewer than 51 others were arrested in the last two weeks.\nSpeaking on the development when he appeared in an interview on Channels Television on Thursday, Ndume commended the security agencies for the feat achieved in the fight against insurgency.\nAdvertisementThe senator noted that the recent development shows that when the military gets the necessary resources, they will achieve results."
  },
  {
    "headline": "Ndume to troops: End insecurity quickly -- but don't pamper repentant insurgents",
    "summarized_story": "Ali Ndume, senator representing Borno south, has urged security agencies to speed up efforts to end insurgency.\nAdvertisementOn Tuesday, the Nigerian army said over 100 Boko Haram fighters with their families have surrendered to the troops.\nOn Thursday, the army also said troops killed 27 insurgents, while no fewer than 51 others were arrested in the last two weeks.\nSpeaking on the development when he appeared in an interview on Channels Television on Thursday, Ndume commended the security agencies for the feat achieved in the fight against insurgency.\nAdvertisementThe senator noted that the recent development shows that when the military gets the necessary resources, they will achieve results."
  },
  {
    "headline": "Nigeria High Commission in London to close for 10 days as officials contract COVID",
    "summarized_story": "The Nigeria High Commission in London, United Kingdom (UK), says its facility will be shut for the next 10 days.\nAdvertisementIn a statement on Thursday, the high commission said the closure was a result of some of its officials who tested positive for COVID-19 at the facility.\nThe high commission added that those who came in contact with the affected officials at the office will also observe mandatory isolation.\n“In response to this challenge, the Mission embarked on testing all officials of the Mission, after which another official of the Mission tested positive.\nAdvertisement“While the High Commission regrets any inconvenience that this may have caused, we solicit the cooperation of the general public.”In 2020, the high commission suspended passport processing services to limit exposure of staff and applicants due to the COVID-19 outbreak."
  },
  {
    "headline": "Nigeria High Commission in London to close for 10 days as officials contract COVID",
    "summarized_story": "The Nigeria High Commission in London, United Kingdom (UK), says its facility will be shut for the next 10 days.\nAdvertisementIn a statement on Thursday, the high commission said the closure was a result of some of its officials who tested positive for COVID-19 at the facility.\nThe high commission added that those who came in contact with the affected officials at the office will also observe mandatory isolation.\n“In response to this challenge, the Mission embarked on testing all officials of the Mission, after which another official of the Mission tested positive.\nAdvertisement“While the High Commission regrets any inconvenience that this may have caused, we solicit the cooperation of the general public.”In 2020, the high commission suspended passport processing services to limit exposure of staff and applicants due to the COVID-19 outbreak."
  },
  {
    "headline": "Bala Mohammed: I’m in talks with stakeholders on contesting 2023 presidential election",
    "summarized_story": "Bala Mohammed, governor of Bauchi state, says he is in talks with stakeholders over calls for him to run for the presidency in 2023.\nAdvertisementThe governor, a member of the Peoples Democratic Party (PDP), disclosed this on Thursday when he received a group of northern youth leaders in Bauchi.\nAccording to him, the youth leaders had endorsed him to run for the highest office in the country, but he is yet to make a decision.\n“Today, I received the Northern Youth Leaders Forum who paid me a solidarity visit at the Government House annex, Bauchi,” he said in a statement.\n“My gratitude also goes to the forum for finding me worthy of contesting for the Nigerian presidency in 2023."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "This is Patricia; a place where convention comes to die",
    "summarized_story": "Our tour guide is Patricia brand manager, Rachael Akalia.\nRachael Akalia, Brand Manager, PatriciaRachael Akalia has been with the company since its humblest beginnings in 2018, when it ran out a cramped boys’ quarters (BQ).\nAn earlier Patricia office (not the BQ), shot in February 2019 — about 3 months before the company moved to its current location in May, 2019.\nWatch video version or continue reading belowFrom the entrance, you are greeted by the customer experience centreTo give customers a feel of the Patricia brand, the walls of the centre are decked with all the company’s products.\nIt is where monthly accolades given to the most outstanding team members are displayed."
  },
  {
    "headline": "Former First Lady Hadiza Shagari dies of COVID-19 in Abuja",
    "summarized_story": "Former First Lady Hadiza Shagari dies of COVID-19 in AbujaHadiza Shagari, wife of Former Nigerian leader, Shehu Shagari is dead.\n“We regret to announce the demise of our beloved mother, Hajiya Hadiza Shehu Shagari, the wife of late President Shehu Usman Aliyu Shagari, GCFR (Turakin Sokoto), one of her grandson said in a statement issued on behalf of the family.\nRead also: Hoping that the COVID–19 pandemic will not be forever“We lost her in the early hours of today, 12th August 2021, at about 3:00 am, after battling Covid-19 at the Gwagwalada Isolation Center in Abuja.\n“Hajiya Hadiza Shehu Shagari was 80 years old.\nHer Jana’iza (Funeral Prayer) will take place today, at 4:00pm, immediately after Asr prayer, at the National Mosque, Abuja.”"
  },
  {
    "headline": "Impressive half-year result shows cinemas rebound",
    "summarized_story": "With a total movie ticket sales of N959.9 million (almost N1bn) from half year of 2021, the Nigerian movie sector is fast recovering from the impact of the coronavirus pandemic that grounded the sector from March ending till September 2020.\nThe 2021 half year result, which is over N500 million less than the N1.5 billion…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lagos to create N5.2trn electricity market from gutting dirty generators",
    "summarized_story": "If residents of Lagos State are provided reliable grid power, they would save over N5.2 trillion currently spent generating 15,000mw of power through dirty generators, an incentive spurring the state government’s independent power market dream.\nOlalere Odusote, Lagos commissioner for energy and mineral resources, in a public consultation forum held virtually on Wednesday, said fresh…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki congratulates Odigie-Oyegun on 82nd birthday, hails contribution to devt of Edo, Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated ex-governor of the state and former national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun on his 82nd birthday, hailing his commitment to Nigeria’s unity and development.\nIn a statement, the governor extolled the virtues of the elder statesman, describing him as an “erudite politician, true democrat and administrator par excellence, whose exemplary leadership has positively impacted the nation’s political space.”Obaseki noted, “On behalf of the government and good people of Edo State, I congratulate you, Chief John Odigie-Oyegun, as you mark your 82nd birthday anniversary.\n“You have continued to lead an enviable life that is worthy of emulation, distinguishing yourself as a role model, true democrat and administrator par excellence.\n“From your early days in the federal public service, where you rose to the peak of your career as a permanent secretary, up to when you got elected as the governor of Edo State, you have carried on with your vision of engendering sustainable development.\n“I applaud your unalloyed dedication and commitment to the Nigerian project and pray that the Almighty God will grant you more years in good health and happiness.”..."
  },
  {
    "headline": "Edo readies to receive second batch of COVID-19 vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state would, by weekend, receive its second batch of the coronavirus (COVID-19) vaccines, to protect the people against the deadly virus.\n“The Edo State COVID-19 response team has been reactivated; l am the chairman of the team and the deputy governor is the chairman of the Technical Committee.\nOko-Oboh noted: “We are receiving about 3.2 million doses of the COVID-19 vaccines, including Moderna, AstraZeneca, as well as Johnson and Johnson.\nIf you take AstraZeneca as the first dose, it must be AstraZeneca for the second dose and not Moderna.\nWe are expecting and encouraging everyone to come forward for the second dose of the AstraZeneca vaccine when it arrives.”..."
  },
  {
    "headline": "When Oredo Corpers Defiled Rain to Keep Benin City Clean – Nigerian Observer",
    "summarized_story": "The disciplinary NYSC officials in Oredo have not doubt instilled discipline in the serving Corps member which has put the Corps members always on the go when duty calls.\nSo when the Corpers’ Liaison Officer (CLO), Afemi Samson posted a reminder on the WhatsApp group that reads:“Attention Corps members, there will be a National Environmental Sanitation Day!\nOn Saturday, 17th July, corpers serving within Benin metropolis were spotted in every nook and cranny of the town carrying out sanitation.\nCorps members are expected to use one day in a week for group CDS activities.\n___________________________________________________________________________________________________________________Sinafi Omanga is a serving Corps member with The Nigerian Observer, Benin City."
  },
  {
    "headline": "NIDO President, Odibo, renowned pharmacist, Prof. Odidi, others make list of steering c’ttee to set up Edo Diaspora Agency – Nigerian Observer",
    "summarized_story": "The governor had, on Thursday, 5th August 2021, inaugurated the Edo State Head of Service, Anthony O. Okungbowa Esq., as the chairman of 8-man Steering Committee for the setting up of the Diaspora agency, while Mr. Isaac Ebewele serves as secretary.\nOdibo, with over 28 years of cross-industry experience in Consulting, IT/Telecom and Finance in Switzerland is currently a senior consultant at Itau Private Bank Zurich.\nProf. Odidi, who trained at Harvard University, University of London, University of Toronto, and Ahmadu Bello University, is an innovator who co-founded Intellipharmaceutical International Inc., which is listed and trading on two international stock exchanges in the USA and Canada.\nHe has a proven track record and experience in innovation, drug development, testing, clinical trials, regulatory and drug manufacturing.\nThe committee is expected to complete its assignment within a period of thirty (30) days and submit a report to the Edo State Government."
  },
  {
    "headline": "CLEEN Foundation appoints Acting Executive Director",
    "summarized_story": "ADVERTISEMENTThe Board of CLEEN Foundation has appointed an Acting Executive Director, Ruth Olofin, who will be taking over from the outgoing Executive Director, Benson Olugbuo, on September 1, this year.\nThis follows the decision of Mr Olugbuo to resign from CLEEN Foundation to take up an appointment with an Abuja based international NGO as a Country Director, which will take effect by the end of August, this year.\nThe Board is satisfied that during his two three-year tenures as the Executive Director of CLEEN Foundation, Mr Olugbuo, sustained the culture of hard work, motivated staff and initiated measures towards maintaining CLEEN Foundation as a leading NGO on security and safety and influencing police reform in Nigeria.\nThe Board thanks Mr Olugbuo for his services to CLEEN Foundation and prays for his success as Country Director.\nThe new Acting Executive Director, Ruth Olofin, has been part of the CLEEN Foundation Management Team and was the Manager in charge of programmes."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari pays surprise visit to Tinubu in London",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, on Thursday, paid a visit to Bola Tinubu, a leader of the All Progressives Congress (APC), in London.\nBoth Buhari and Tinubu are currently in London for a medical reasons.\nThe development comes days after Babajide Sanwo-Olu, governor of Lagos, paid a visit to Tinubu in London."
  },
  {
    "headline": "40% of vehicles imported into Nigeria stolen – finance minister",
    "summarized_story": "Nigeria’s Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed has said about 40 percent of vehicles imported into Nigeria were stolen.\nAhmed who made the claim while delivering a keynote address at the zonal sensitisation seminar on the National Vehicle Registry (VREG) policy in Abuja, Ahmed said yesterday, said NBS figures corroborated her claim.\n“National Bureau of Statistics confirmed that between 2015 and 2019, Nigeria imported an average of 300,000 vehicles with an average of 48 per cent increase in import annually while an additional 45 per cent of vehicles are smuggled into the country annually, thus evading duty payment of which 40 per cent of these vehicles are stolen vehicles,” she said.\n“A case study also revealed that between October 2018 and September 2019, the country recorded over N1.8 trillion value of used vehicle importation.”"
  },
  {
    "headline": "Osun assembly passes anti-open grazing bill",
    "summarized_story": "The Osun House of Assembly, on Thursday, passed the Osun Animal Grazing Regulation and Cattle Ranches Establishment Bill 2021 after its third reading.\nSpeaker of the Assembly, Mr Timothy Owoeye, explained that the bill, when accented to by the state governor, would regulate animal grazing and establishments of cattle ranches in the state.\nOwoeye also added that the bill would also prevent the destruction of farms and farmers’ crops brought about by open rearing and grazing of livestock.\nIt states that a minor is prohibited from grazing, rearing or herding livestock except under the supervision of an adult.\nThe assembly equally passed the Violence against Persons (Prohibition) Bill 2021, after its third reading."
  },
  {
    "headline": "BREAKING: suspected Niger Delta Avengers reportedly launch attack on Nigerian Navy, kill operatives",
    "summarized_story": "Assailants suspected to be Niger Delta Avengers have attacked Nigerian Navy personnel deployed to a waterways security vessel in Bayelsa State, killing some of the military men.\nA video released by the attackers showed about three personnel down as the Niger Delta militants continued the heavy gun battle with the military.\nThe NDA on June 27 had threatened that they would return with “Operation Humble” which is similar to its “Operation Red” of 2016, designed to destroy oil installations.\nIn a statement released on its website on Saturday, the NDA threatened to crash the country’s economy and send it in to a permanent recession, SR reported.\nThe NDA are a militant group in the Niger Delta region"
  },
  {
    "headline": "Mixed Reactions Trail Planned Return Of Toll Gates",
    "summarized_story": "Stakeholders in the transport industry yesterday, reacted differently to the plan by the federal government to reintroduce toll gates on the country’s highways.\nADVERTISEMENTHe said before the banning of toll gates, there was an outcry by the general public on the need to stop it based on several complaints received daily, which were all centred on exploitative tendencies.\nAccording to him, reintroduction of toll gates at a period when people are still feeling the impact of COVID-19, is an act of insensitivity at the highest level.\nMr Josiah Ejimatswa, who runs Kaduna- Abuja routes said, “The toll gate is not the problem, but is the road good enough to warrant collection of such toll gates?\nFor Alhaji Mundi Yahaya, he said,“Government should think of something meaningful to do and not reintroducing toll gates which some people use to enrich themselves through printing of personal receipts."
  },
  {
    "headline": "Mixed Reactions Trail Planned Return Of Toll Gates",
    "summarized_story": "Stakeholders in the transport industry yesterday, reacted differently to the plan by the federal government to reintroduce toll gates on the country’s highways.\nADVERTISEMENTHe said before the banning of toll gates, there was an outcry by the general public on the need to stop it based on several complaints received daily, which were all centred on exploitative tendencies.\nAccording to him, reintroduction of toll gates at a period when people are still feeling the impact of COVID-19, is an act of insensitivity at the highest level.\nMr Josiah Ejimatswa, who runs Kaduna- Abuja routes said, “The toll gate is not the problem, but is the road good enough to warrant collection of such toll gates?\nFor Alhaji Mundi Yahaya, he said,“Government should think of something meaningful to do and not reintroducing toll gates which some people use to enrich themselves through printing of personal receipts."
  },
  {
    "headline": "11 Escape From Bandits’ Camps As Troops Rescue 2 In Kaduna",
    "summarized_story": "Kaduna State government disclosed yesterday that 11 hostages escaped from bandits‘ camps on the outskirts of Sabon Birni town, Igabi local government area.\nAruwan said troops also rescued one Mrs Chioma Amanda Silver in Ungwan Sarki Goza village, Mariri, Lere local government area.\n156 Bandits Killed, 64 Arrested, 1000 Surrender In 2 Week – DHQAlso, the Defence Headquarters (DHQ) yesterday said its troops have killed 156 terrorists and bandits, arrested 64.\nHe said the air strikes resulted in the destruction of bandits’ structures, including the residence of one of their leaders, Halilu Tubali, in which the armed bandits converged for a meeting.\nHe further said troops of Operation WHIRL STROKE raided bandits’ hideouts in Benue and Taraba where eight armed bandits were arrested and victims rescued."
  },
  {
    "headline": "11 Escape From Bandits’ Camps As Troops Rescue 2 In Kaduna",
    "summarized_story": "Kaduna State government disclosed yesterday that 11 hostages escaped from bandits‘ camps on the outskirts of Sabon Birni town, Igabi local government area.\nAruwan said troops also rescued one Mrs Chioma Amanda Silver in Ungwan Sarki Goza village, Mariri, Lere local government area.\n156 Bandits Killed, 64 Arrested, 1000 Surrender In 2 Week – DHQAlso, the Defence Headquarters (DHQ) yesterday said its troops have killed 156 terrorists and bandits, arrested 64.\nHe said the air strikes resulted in the destruction of bandits’ structures, including the residence of one of their leaders, Halilu Tubali, in which the armed bandits converged for a meeting.\nHe further said troops of Operation WHIRL STROKE raided bandits’ hideouts in Benue and Taraba where eight armed bandits were arrested and victims rescued."
  },
  {
    "headline": "BREAKING: Kidnapped Niger Commissioner Regains Freedom",
    "summarized_story": "Niger State Commissioner for Information, Mohammed Sani Idris, abducted last Sunday night has been released on Thursday night five days after he was kidnapped.\nLEADERSHIP gathered from family sources that the Commissioner was released about 9.30pm and was immediately rushed to Suleja General Hospital for medical attention.\nWhile information on his release was not clear at press time, LEADERSHIP gathered earlier in the afternoon that the abductors had reduced the initial ransom of N500 million requested to N180million.\nADVERTISEMENTIt was learnt that the Speaker of the Niger State House of Assembly, Abdullahi Bawa Wuse, and the chairman of Tafa local government area, Hon.\nNamu Tafa, were in the forefront of ensuring the release of the Commissioner."
  },
  {
    "headline": "Baron D thrills fans with Perfect Man single",
    "summarized_story": "By TINA OKOLOFast rising music act, Ike Benjamin famously known as Baron D, has dropped his latest single, titled Perfect Man, to the admiration of his fans.\nPerfect Man was originally produced by FreshKing.\n“The song title, Perfect Man, is about having the feeling of remorse, after offending someone, apologizing and asking to be given a second chance.\nPerfect Man video is on HipTv, Soundcity, Trace Tv, Music Africa, Dstv Urban and many others.\nhttps://youtu.be/Mxci2ThVdwkAmazingly, Perfect Man single is now on the fourth position on the DJ music chart in Germany in the Black Music Genre."
  },
  {
    "headline": "Baron D thrills fans with Perfect Man single",
    "summarized_story": "By TINA OKOLOFast rising music act, Ike Benjamin famously known as Baron D, has dropped his latest single, titled Perfect Man, to the admiration of his fans.\nPerfect Man was originally produced by FreshKing.\n“The song title, Perfect Man, is about having the feeling of remorse, after offending someone, apologizing and asking to be given a second chance.\nPerfect Man video is on HipTv, Soundcity, Trace Tv, Music Africa, Dstv Urban and many others.\nhttps://youtu.be/Mxci2ThVdwkAmazingly, Perfect Man single is now on the fourth position on the DJ music chart in Germany in the Black Music Genre."
  },
  {
    "headline": "EFCC Arrests Son, Mother, Others for Internet Fraud in Kaduna",
    "summarized_story": "The Kaduna Zonal Command of the Economic and Financial Crimes Commission, EFCC, has arrested the quartet of Lucky Ebhogie, Richman Kas Godwin, Israel Justin and Precious Iwuji for internet-related fraud.\nThey were arrested on August 5, 2021 in the Sabo area of Kaduna, Kaduna State following intelligence on their alleged involvement in internet-related fraud activities.\nOne of the suspects, Lucky Ebhogie allegedly recruited his mother into the scam by using her account to launder suspected proceeds of crime.\nOn July, 30, 2021, he purchased a Mercedes Benz GLK car for N7 million through the mother’s bank account.\nAnother suspect, Precious Iwuji was discovered to have sold her photographs and Facebook account to internet fraudsters, which they used to ensnare their victims."
  },
  {
    "headline": "EFCC Arrests Son, Mother, Others for Internet Fraud in Kaduna",
    "summarized_story": "The Kaduna Zonal Command of the Economic and Financial Crimes Commission, EFCC, has arrested the quartet of Lucky Ebhogie, Richman Kas Godwin, Israel Justin and Precious Iwuji for internet-related fraud.\nThey were arrested on August 5, 2021 in the Sabo area of Kaduna, Kaduna State following intelligence on their alleged involvement in internet-related fraud activities.\nOne of the suspects, Lucky Ebhogie allegedly recruited his mother into the scam by using her account to launder suspected proceeds of crime.\nOn July, 30, 2021, he purchased a Mercedes Benz GLK car for N7 million through the mother’s bank account.\nAnother suspect, Precious Iwuji was discovered to have sold her photographs and Facebook account to internet fraudsters, which they used to ensnare their victims."
  },
  {
    "headline": "Buhari pays surprise visit to Tinubu in London",
    "summarized_story": "By AbankulaPresident Muhammadu Buhari on Thursday night surprised former Lagos Governor, Bola Tinubu with a visit in London.\nTinubu left Nigeria early July before Buhari followed, first to attend an international summit on education and also to see his doctors.\nRumours about Tinubu’s health, including wild speculations that he was dead, were debunked quickly by his media aide.\nTinubu later appeared in photographs with Governor Babajide Sanwo-Olu, who confirmed that he is in good shape.\nPresident Buhari, who visited with NTA crew and his photographer must also have confirmed that Tinubu is hale and hearty, contrary to reports that he was dead."
  },
  {
    "headline": "White population shrinks in U.S., first time in 10 years",
    "summarized_story": "Agency ReportsNew census data released on Thursday in the U.S. showed the American white population declined for the first time in history last decade.\nIn contrast, there was population growth for people who identify as multi-racial, Hispanic and Asian between 2010 and 2020.\nThe non-Hispanic white population, which remains the largest race or ethnic group, shrank by 8.6% over the decade and now accounts for 57.8% of the U.S. population – the lowest share on record.\nIn Texas, another large state, the non-Hispanic white population stood at 39.7%, just slightly larger than the Hispanic population at 39.3%.\nThe figures also offered new details on the country’s slowing rate of population growth, which was the lowest of any 10-year period save the Great Depression in the 1930s."
  },
  {
    "headline": "BREAKING: Nigeria Shuts High Commission In London Over Continuous Anti-Buhari Protests",
    "summarized_story": "The Nigerian High Commission in London has ceased operations due to daily protests by Nigerians who have joined the #BuhariMustGo and #RevolutionNow movements and assembled at the commission.\nThe Nigerian Mission, embarrassed by the gatherings that were placing President Muhammadu Buhari and his associates under pressure, declared its closure for ten days, according to SaharaReporters.\n“Nigeria has temporarily shut its UK Embassy due to embarrassment by #BuhariMustGo protesters.\nSaharaReporters were able to capture video showing London police officers chatting with Nigerian demonstrators and appearing to be pleasant.\n“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London."
  },
  {
    "headline": "BREAKING: Abducted Niger Commissioner Regains Freedom",
    "summarized_story": "Alhaji Mohammed Sani Idris, the kidnapped Niger state Commissioner for Information, has been released.\nHe was released on Thursday night, according to THISDAY.\nHe was “hale and hearty,” according to a reputable source at the Ministry of Information.\nThe source did not say how the commissioner was freed or whether a ransom was paid.\nDetails later…"
  },
  {
    "headline": "Ex-Military Leader, Abdulsalami Abubakar Reveals Why Biafra, Yoruba Nation Won’t Succeed",
    "summarized_story": "Abdulsalami Abubakar, a former military commander, has revealed why those pushing for succession will fail.\nAccording to Abubakar, inter-ethnic interactions and marriages among Nigerians would make succession difficult.\nWhen everybody, every Nigerian, anywhere you go in the village, you will find a Hausa man, a Yoruba man, an Igbo man, Itsekiri and so on and so forth.\nIgboho agitated for Yoruba nation while Kanu pushed for Biafra’s realization.\nBoth agitators, however, are currently being held by security agents in Nigeria and Benin Republic."
  },
  {
    "headline": "Fresh FM Reveal Cause Of David Ajiboye’s Death",
    "summarized_story": "Fresh FM’s management has revealed the cause of Mr. David Ajiboye’s death.\nAjiboye died on Sunday in Ibadan, according to NEWS DIRECT.\nHe was the station manager of Fresh FM in Ado Ekiti until his death.\nThe virology department at the University Teaching Hospital (UCH) Ibadan determined the cause of death, according to Akindele’s statement released on Thursday.\n“The real cause of the death has been made known by the Virology Department, University of Ibadan (UI), in the University Teaching Hospital (UCH), Ibadan."
  },
  {
    "headline": "Buhari mourns as ex-President Shehu Shagari ’s widow dies of COVID-19",
    "summarized_story": "Hajia Hadiza Shehu Shagari, widow of late President Shehu Shagari has reportedly died of COVID-19 complications.\nHe said: “We regret to announce the demise of our beloved mother, Hajiya Hadiza Shehu Shagari, the wife of H.E late President Shehu Usman Aliyu Shagari, GCFR (Turakin Sokoto).\n“We lost her in the early hours of today, 12th August 2021, at about 3:00 am, after battling Covid-19 at the Gwagwalada Isolation Center in Abuja.”“Hajiya Hadiza Shehu Shagari was 80 years old.\n“President Muhammadu Buhari commiserates with family of the late former President of Nigeria, Alhaji Shehu Shagari over the transition of his widow, Hajiya Hadiza Shagari, at age 80.\nHe said the dual-purpose facilities were located in 20 local government areas identified as high burden areas for COVID-19 infection."
  },
  {
    "headline": "Pictures: High expectations as Youth and Sports Minister, Sunday Dare, addresses Nigerian Youth on International Youth Day",
    "summarized_story": "NextNDDC: Contractors urge Akpabio, Akwa to pay balance of money owe them"
  },
  {
    "headline": "VIDEO: Watch as Leo Messi meets his new teammates at PSG",
    "summarized_story": ""
  },
  {
    "headline": "Photo Op of the Flag off of construction of access road and car park of the Kagini Train Station -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "ICRAD uncovers imposition of illegal fees in FCT Secondary Schools -NigPilot",
    "summarized_story": "In its petition letter, ICRAD explained that the affected students are being compelled to pay the sum of N1, 500 per session outside the official fees recognized by the Federal Capital Territory Administration FCTA for secondary school students.\n“It has come to our notice that the Senior Secondary School Students in the FCT, particularly those in SS1 and 2 are being forced to pay the sum of N1, 500 per session outside the official fees recognised by the FCTA.\n“This fee surreptitiously tied to School Management Systems, only allow the students to check their results online.\n“Surprisingly is the fact that the fees is not paid into any of the recognised school account linked to government Treasury Single Account TSA, but into a private company’s account.\n“Assuming without conceding that the said fee is for consulting services rendered to FCT secondary school board, it is the responsibility of the board to pay for consultancy under the Public Procurement Act and not the students."
  },
  {
    "headline": "FG laments over 130bn unutilised UBEC counterpart funds -NigPilot",
    "summarized_story": "Federal Government has described as regrettable the inability of some states of the Federation in accessing counterpart funds from the Universal Basic Education Commission, UBEC, for developing primary education in their States.\nEducation Minister, Adamu Adamu, who stated this at this year’s 65th National Council on Education meeting in Jalingo, Taraba State, said, over One Hundred and Thirty Billion Naira (#130,000,000,000)in UBEC custody is still unutilised due to the inability of states to provide their 50 percent counterpart funds.\nSpeaking through the Minister of State for Education, Hon Chukwuemeka Nwajiuba, the Minister said, the affected states need to reprioritize basic education as it is the bedrock for further and continuing education, too strategic to be ignored.\nEmphasising the need for co-operation from the states, Adamu Adamu said the tasks of developing education at all levels, securing our children and ensuring basic sanitation in our schools requires that all hands must be on deck to achieve the desired results.\nPresident of the Association of Proprietors of private schools, Evangelist Ajibade Augustine stated that members of the Association are more than ever before, determined to take more children off the streets in their efforts at eradicating the out of school children phenomenon."
  },
  {
    "headline": "2023: Race for APC Nat. Chairmanship gets tougher as Yuguda throws hat in the ring -NigPilot",
    "summarized_story": "One-time Minister of State for Transport and former governor of Bauchi State, Mallam Isa Yuguda , has joined other top political gladiators from the north in the race for the national chairmanship of the ruling All Progressives Congress, APC.\nHe said, “I was privileged to serve in Nigeria for six years as Minister and eight as governor.\nI think I have served long enough in the Villa to know the dynamism in the power at the center.\nI’m the dullest person, at least I still have to offer something that will be meaningful.\n“I believe we are here to begin a journey we will never regret, a journey that will be sustainable."
  },
  {
    "headline": "Nigerian High Commission In London Closes After Two Officials Test Positive For COVID-19",
    "summarized_story": "The Nigerian High Commission in London has been closed for 10 days after two officials tested positive for COVID-19.\nThe High Commission stated this in a statement on Thursday night.\n“This afternoon, the Head of Immigration Section and two other officials went for a meeting at the Home Office,” it said in the statement.\n“At the entrance, COVID test was administered on them and one of them tested positive to COVID-19.\nThe affected officer was immediately isolated while the other officials who tested negative will also be isolated for the next 10 days.”The Mission explained that, as a result, it began testing all officials after that, leading to another positive case."
  },
  {
    "headline": "Niger State Commissioner Abducted By Bandits Regains Freedom",
    "summarized_story": "The Niger State Commissioner for Information Mohammed Idris has regained freedom from bandits who abducted him on Monday.\nTop government officials in the state confirmed the return of the commissioner to Channels Television on Thursday.\nSpeaking after his release, the commissioner expressed gratitude to God for protecting him during his stay in the bandits’ den.\nLast weekend, a chieftain of the All Progressives Congress (APC) was kidnapped in Mariga Local Government Area of Niger State.\nAminu Bobi who is the Zone C chairman of the ruling party in the state was kidnapped on his farm."
  },
  {
    "headline": "PDP Sues APC And Buni, Asks Court To Remove Him As Yobe Governor",
    "summarized_story": "The Peoples Democratic Party (PDP) has asked the Federal High Court in Abuja to effect the removal of Governor Mai Mala Buni as the governor of Yobe State.\nIt stated that Governor Buni has breached the provision of Section 183 of the Constitution when as a governor, he also serves as the ruling party’s caretaker chairman.\nListed as defendants were Governor Buni, his deputy, Idi Barde Gubana, the APC, and the Independent National Electoral Commission (INEC).\nThis made the appellants seek redress at the Supreme Court.\nThe suit filed by the PDP on Thursday at the Federal High Court in Abuja is the latest among many other reactions triggered by the decision of the apex court."
  },
  {
    "headline": "FG Rules Out Another COVID-19 Lockdown Amid Rising Cases",
    "summarized_story": "The Federal Government on Thursday said it was not considering a lockdown despite rising cases of COVID-19 infections across the country.\nOn Wednesday Nigeria had recorded 790 cases of new COVID-19 infections, according to the Nigeria Centre for Disease Control.\nNigeria is expected to step up its Covid vaccination program after receiving over four million doses of the Moderna vaccine from the US government last week.\nMore vaccines expectedMinister Ehanire also said on Thursday Nigeria is not only relying on donated vaccines from other entities.\nAccording to Ehanire, Nigeria has procured nearly 40 million doses of the Johnson and Johnson vaccine through the African Union."
  },
  {
    "headline": "APC Faults Call For Buni’s Removal, Says PDP Is Desperate",
    "summarized_story": "The All Progressives Congress (APC) has condemned the suit instituted against it and its Caretaker Committee Chairman, Governor Mai Mala Buni, by the Peoples Democratic Party (PDP).\nIn a statement on Thursday, the party’s spokesperson James Akpanudoedehe said the main opposition party was executing desperate and poorly scripted propaganda.\nAlthough he stated that the APC would not comment on the PDP’s court action, he asked the PDP to focus on the crisis in its camp.\nREAD ALSO: PDP Sues APC And Buni, Asks Court To Remove Him As Yobe GovernorThe main opposition party had asked the Federal High Court in Abuja to remove Buni as the Governor Yobe State.\nAkpanudoedehe, however, explained that it would be sub judice to comment on the action of the opposition party."
  },
  {
    "headline": "Breaking: Niger Commissioner for Information. regains freedom",
    "summarized_story": "Kidnapped Niger state commissioner for information has regained his freedom and reunited with his family amidst tears of joy and jubilation.\nThe commissioner, Mohammed Sani Idris said he has forgiven his abductors and those that contracted them.\nHe added that the abductors parted ways with him ways crying, regretting their actions that if they’d known they wouldn’t have abducted him and God willing by his abduction they will desist from the trade of kidnapping.\nHe also added that the bandits confessed they were paid from Zamfara with a photo and description of his house to get him on the information that he receives 200 million from the government monthly."
  },
  {
    "headline": "APC National leader, Tinubu meets President Buhari in London",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu met with President Muhammadu Bubari in London.\nThe President is in the UK for medical check up.\nThe former Governor of Lagos has been out of the country for weeks.\nIt took the Governor of Lagos, Babajide Sanwoolu to douse the rumour that he has died with a picture and at an event.\nWe will update you on this as we get the information."
  },
  {
    "headline": "UPDATED: Troops rescue two kidnap victims in Jema’a, Lere LGAs",
    "summarized_story": "Troops of Operation Safe Haven currently carrying out operations against bandits in Kaduna state have rescued two kidnap victims in Kirti village in Jema’a and Mariri village in Lere local government areas.\nOne of them was abandoned by the bandits in Goza, Mariri village on siting the troops.\nThe rescued victims have been reunited with their families.\nThe escapees were recovered by the troops and have since been reunited with their families.\nHe also commended the swift response of the troops to rescue the kidnapped citizens in Jema’a and Lere LGAs."
  },
  {
    "headline": "Hackers Steal $7m From Crowdfunding DAO Maker, Three Days After Poly Network Attack",
    "summarized_story": "Three days after Poly Network was hacked for $611 million, DAO Maker – another cryptocurrency platform – has been attacked and drained of about $7 million worth of funds overnight.\nDAO Maker describes itself as a “social mining and community incubation” platform, but essentially it’s a crowdfunding site for tokenized startups.\nUnlike a traditional crowdfunding platform like Kickstarter or Indiegogo however, DAO Maker is governed by smart contracts—or bits of code that perform a set of instructions—in the form of a decentralized autonomous organization (DAO).\nAs a CEO, this has always been one of my core principles for DAO Maker.”The DAO Maker attack comes right on the heels of a massive $600 million hack of cross-blockchain interoperability platform Poly Network, the largest cryptocurrency hack to date.\nAs at Thursday morning, some $342 million worth of funds have been returned to Poly Network."
  },
  {
    "headline": "Bill Gates Pledges $1.5bn to Combat Climate Change",
    "summarized_story": "Microsoft co-founder Bill Gates has pledged $1.5 billion for joint projects with the US government to combat climate change if Congress passes a bipartisan infrastructure plan that funds clean energy technologies.\nThe Senate’s $1.2 trillion infrastructure bill, which hasn’t yet passed through the House, provides the Department of Energy with $25 billion for projects that demonstrate the viability of clean-energy technologies for widespread adoption.\nGates’s fund, run by his firm Breakthrough Energy, would spend the money over three years on initiatives to lower emissions.\nWhile the infrastructure plan appears to have enough bipartisan support to pass through the House, Speaker Nancy Pelosi, D-Calif., has repeatedly stressed she won’t hold a vote on the infrastructure bill until the Senate passes a $3.5 trillion spending bill.\nIf the infrastructure plan doesn’t pass, Breakthrough would likely move the funding for larger projects to Europe and Asia, Gates said during an interview with The Wall Street Journal."
  },
  {
    "headline": "Lukaku Rejoins Chelsea for £97.5m from Inter Milan on Five-year Deal",
    "summarized_story": "The former Inter Milan superstar is the world-class striker Blues boss Thomas Tuchel has been hunting all summer.\nThe 28 year old Belgium hero returns to Stamford Bridge seven years after leaving for Everton, Manchester United and then the Serie A giants.\nBefore clinching the second-biggest signing by a British club, Tuchel explained why he rates Lukaku so highly.\nThe sentence is easy to repeat for any coach in the world.\n“It’s still not the moment to talk about names, because we have nobody signed yet and we will show all the respect to other clubs.”"
  },
  {
    "headline": "52 Die in Niger Republic Floods",
    "summarized_story": "Authorities say no less than 52 people have died in Niger floods with 34 being injured and thousands losing their homes.\nThis includes five who died between Tuesday and Wednesday after heavy rains in the capital Niamey, causing significant damage and rendering hundreds homeless.\nSeveral regions of the country have been affected by the floods that have been occurring since the beginning of June.\nThe capital is among the most affected cities – with 144mm of rain recorded between Tuesday and Wednesday.\nAt least 70 people were killed by flooding in Niger last year and 350,000 others were affected."
  },
  {
    "headline": "Covid: Nigeria Has No Plans to Enforce Another Lockdown, Health Minister Ehanire Says",
    "summarized_story": "The Nigerian government says there are no plans to enforce another lockdown as the country records a spike in Covid-19 cases.\nThe country’s Minister of Health, Osagie Ehanire told journalists at the weekly state house briefing that Nigeria is currently battling a third wave of the coronavirus following the emergence of the Delta variant.\nDespite battling a third wave, Mr Ehanire said the country has not reached a threat level that will lead to another lockdown, which if imposed, poses a great threat to business activities in the country.\n“We are not at a level yet where we are feeling that threat to do any lockdown but I tell you many countries are not doing generalised lockdown but precision lockdown,” Mr Ehanire said at the Thursday briefing.\n“As I speak to you now, there are several countries who are on one kind of lockdown or the other, at least if my recollection is correct, six or seven countries are on one form of lockdown or the other."
  }
]