[
  {
    "headline": "Anti-party activities: Kebbi PDP suspends senatorial aspirant",
    "summarized_story": "The People’s Democratic Party in Kebbi State has suspended a senatorial aspirant, Haruna Sa’idu-Dandi’o, for anti-party activities.\nSai’du-Dandi’o was suspended by the executive members of his ward in Birnin Kebbi Local Government Area of the state.\nThe News Agency of Nigeria recalls that Sa’idu-Dandi’o had initially won the party ticket for Kebbi Central Senatorial District unopposed during a primary election earlier conducted.\nThe statement added, “His clandestine activities with the ruling party in the state such that his press interview was conducted in Kebbi State Liaison Office in Abuja and his continued anti-party activities in spite of so many entreaties to him.\n“Therefore, the Nasarawa I Ward Executive Committee hereby resolved as follows: that the State Executive Committee should be duly and adequately informed of the inappropriate conduct and anti-party activities of Malam Haruna Sa’idu Dandi’o for appropriate action."
  },
  {
    "headline": "18 burnt in Niger crash, six drown in Bayelsa",
    "summarized_story": "An auto crash has claimed the lives of all passengers in an 18-seater bus in Gidan Kwano, along Minna-Bida Road, in the Bosso Local Government Area of Niger State.\nThe occupants of the bus, which was said to have taken off from Lagos, were reportedly burnt beyond recognition.\nIn another development, six persons have been feared dead in a boat accident in Bayelsa State.\nI was told a corps member, two children and a woman died.”The state chairman of MWUN, Ipigansi Ogoniba, said six passengers were confirmed dead.\n“The state coordinator told me that the corps member’s name is on the passenger manifest and the said corps member is not at the lodge."
  },
  {
    "headline": "Herdsmen invade Imo community, destroy crops, youths threaten showdown",
    "summarized_story": "The people of Assa community in the Ohaji-Egbema Local Government Area of Imo State are counting their losses after the invasion of their farmlands by suspected herdsmen.\nThey also asked the leadership of the Hausa/ Fulani community in the state to ask the suspects to vacate their community.\nOne of the victims, identified simply as Eddy, said the herdsmen destroyed a lot of crops.\nFulani herdsmen are destroying our farmlands with their cows.\nThe Fulani herdsmen in our community are destroying them."
  },
  {
    "headline": "Deep Blue Project: NIMASA receives 2 UAS, 9 Boats, 10 armoured vehicles",
    "summarized_story": "The Nigerian Maritime Administration and Safety Agency (NIMASA) has taken delivery of additional mobile assets for enhanced maritime security under its deep blue project.\nTwo unmanned aircraft system, nine interceptor patrol boats and 10 armoured vehicles have been added to the existing assets earlier procured by the Federal Government and commissioned by President Muhammadu Buhari.\nDr. Bashir Jamoh, Director General of NIMASA, while thanking President Buhari for his sustained support in the fight against sea piracy and other maritime crimes said the additional equipment will improve on the gains recorded in securing the Gulf of Guinea and Nigerian maritime domain.\nJamoh who described the recently held Gulf of Guinea Maritime Collaboration Forum (GOG-MCF/SHADE) in Abuja as a success in rallying international support in the suppression of maritime insecurity, added that Nigeria’s commitment in regional maritime security will always be sustained.\nHe extolled the Suppression of Piracy and Other Maritime Offences (SPOMO) Act emplaced by Nigeria as a robust statute that supports maritime law enforcement which other countries are considering to replicate."
  },
  {
    "headline": "1.5m persons in IDP camps in Benue – Official",
    "summarized_story": "Samuel Ortom says 1.5 million persons are in various Internally Displaced Peoples (IDPs) camps in the state.\n“Many of our prime farmers are in IDP camps having been rendered homeless by rampaging bandits.\n“Those are the farmers the state and the country rely on for farm produce; they are languishing in camps, being fed with ration by the state government.\nThe News Agency of Nigeria (NAN) reports that the anniversary is a year-long event that will end on June 4, 2023.\nThe theme for the 70th anniversary is: “Appraising the past, redefining the present and reshaping the future."
  },
  {
    "headline": "UNICAL plans Domestication of National Gender Policy — says VC",
    "summarized_story": "Prof. Obi made the revelation when the United Nations Women paid her a courtesy call.\nVanguard learned that the Federal Government approved the Revised National Gender Policy in March 2022.\nShe expressed hope that as soon the strike was suspended, the senate will approve the policy for domestication in the institution.\n“As a university, we are set to domesticate the revised National Gender Policy to help us strengthen our directorate of gender development.\nShe assured the VC that they would do everything to ensure that the programme of enlightening and creating awareness on the dangers of gender based violence in UNICAL is achieved."
  },
  {
    "headline": "Abia APC factions end hostilities, unite behind Emenike",
    "summarized_story": "Former state Chairmen of Abia APC, Hon Donatus Nwankpa, and Fabian Nwankwo were on hand to affirm the reconciliation.\nToday is the end of factionalisation in Abia APC.\nIn their resolution which the party leaders and stakeholders affirmed Chief Emenike as leader and governorship candidate of Abia APC with Dr Kingsley Ononogbu as the State Chairman.\nAddressing the gathering of party leaders, stakeholders, elders and members, Chief Emenike described the reconciliation in the Abia APC as “the first major step in the long journey to Abia government house”.\nOther APC chieftains present at the meeting were House of Representatives Spokesman, Hon Benjamin Kalu; national welfare officer of APC, Hon Friday Nwosu; former Labour Minister, Chief Emeka Wogu; among others."
  },
  {
    "headline": "Osinbajo charges traditional rulers on insecurity",
    "summarized_story": "Vice-President Yemi Osinbajo on Sunday charged traditional rulers to join hands with the state and federal governments to ensure adequate security of lives and property of Nigerians.\nHe said traditional rulers should also prioritise promotion of culture and tradition, saying this would enhance peaceful coexistence and encourage brotherhood.\nLadoja, who was represented by Chief Sarafadeen Ali, congratulated Oba Balogun on his 100 days as Olubadàn of Ibadan.\nAlao said the promotion of Yoruba culture and tradition was capable of creating job opportunities for Yoruba sons and daughters.\nOba Balogun, in his remarks, appreciated the Yoruba World Centre and well-wishers that attended the programme in his honour."
  },
  {
    "headline": "Kaduna govt confirms bandit attack on worshippers, 3 killed, others injured",
    "summarized_story": "The Kaduna State Government (KDSG) has confirmed that bandits attacked worshippers, killed three people and injured two others in Kajuru Local Government Area.\nMr Samuel Aruwan, the Commissioner for Internal Security and Home Affairs, confirmed the incident in a statement issued on Sunday in Kaduna.\nHe explained that in Rubu village, the bandits attacked worshippers in the Maranatha Baptist Church and St. Moses Catholic Church.\n“The bandits looted shops and carted away some valuables from the villages,” Aruwan said.\nThe Kaduna Command Police Public Relations Officer, DSP Mohammad Jalige, also confirmed the incident, disclosing that the attack happened on Sunday while worshippers were in church."
  },
  {
    "headline": "‘Arm yourselves in self defence’ – Omokri tells Christians as terrorists kill worshippers in Kaduna",
    "summarized_story": "A former presidential aide, Reno Omokri, has called on churches across the nation to arm themselves with the right weapons in self defence following a series of attacks by terrorists recently.\nThis is happening barely 48 hours after victims of St. Francis Catholic Church in Owo, Ondo State, who were massacred by terrorists, were given a mass funeral.\nIn reaction to the concurrent attacks on Christian worshippers, Omokri tweeted, “I strongly condemn the killing of worshippers at the St Moses Catholic Church, Robuh, Kaduna.\n“This renewed assault on Christians, and especially the Catholic Church must not stand.\nChurches must arm themselves in self defence, because the FG either will not or cannot defend them.”"
  },
  {
    "headline": "Gov Ugwuanyi sends second batch of 260 Enugu youths to Keffi for modern agricultural training",
    "summarized_story": "The first batch of 260 youths was successfully trained recently at CSS Global Farms, Keffi, under the sponsorship of Gov.\nUgwuanyi was committed to his mission of producing “the next generation of agriculture business men and women in Enugu State”.\nIfeanyi Ugwuanyi, decided to send our 260 youths for the second batch of training, to learn food production, processing, packaging and marketing of agricultural products.\nUgwuanyi has made a mark in achieving food sufficiency and food production in Enugu State.\nUgwuanyi for his vision, benevolence, forthrightness, peace and good governance initiatives, and driving principles in empowering the people of Enugu State."
  },
  {
    "headline": "Mbaka: Ohanaeze urges caution as followers protest Adoration Ministry shutdown",
    "summarized_story": "The youth wing of the apex Igbo social-cultural organization, Ohanaeze Ndigbo Youth Council Worldwide, OYC, has called for restraint in handling the matter involving Enugu Catholic Priest, Rev.\nDAILY POST had reported that thousands of Mbaka’s supporters took to the street on Sunday protesting the closure of the Adoration Ministry.\nMbaka has rendered an unreserved apology to the church and Mr Peter Obi, the Bishop should forgive him.\n“We apologize to Mr Peter Obi and the Catholic Church and urge Peter Obi accept the apology made by Mbaka and address his supporters.\nWe also appeal to the church to lift the ban on the adoration ministry.”While noting that the shutdown of the Adoration had wider implications, the Ohanaeze youths stated that, “Fr."
  },
  {
    "headline": "Senate President Lawan congratulates Ekiti governor-elect",
    "summarized_story": "The Senate President, Dr. Ahmad Lawan, has congratulated the candidate of the All Progressives Congress, APC, Biodun Oyebanji, on his resounding victory in the Ekiti State governorship election, which was held on Saturday.\nLawan congratulated the APC, both at the state and national levels, and the people of Ekiti on the peaceful and successful conduct of the poll.\nThe Senate President, in a statement by his Special Adviser on Media, Ola Awoniyi, said the outcome of the election further demonstrates the trust and confidence of Nigerians across the country in the APC.\nThe Senate President commended the Independent National Electoral Commission, INEC, for delivering a poll that has been widely adjudged as free, fair, transparent, and hitch-free.\nHe wished the governor-elect, Oyebanji, God’s guidance as he prepares for his onerous task ahead."
  },
  {
    "headline": "Kaduna sacks NUT President, 2,356 teachers after competency test The Nation Newspaper",
    "summarized_story": "But Kaduna chairman of the NUT Ibrahim Dalhatu told journalists the competency test and dismissal of the teachers were illegal.\nKADSUBEB in a statement on Sunday said the Board conducted a competency test for over 30,000 teachers in Dec. 2021.\nKADSUBEB said 2,192 primary school teachers, including NUT National President had been dismissed for refusing to sit for the competency test.\nIt said some 165 of the 27,662 teachers that sat for the competency test were also sacked for poor performances.\n“We have secured a court order restraining the Board from conducting the competency test, it conducted the test without recourse to the rule of law."
  },
  {
    "headline": "Kwankwanso won't be running mate to Peter Obi-NNPP The Nation Newspaper",
    "summarized_story": "The New Nigeria Peoples Party (NNPP) has dismissed reports its presidential candidate Engr.\nRabiu Musa Kwankwaso will serve as running mate to the Labour Party (LP) candidate Peter Obi in 2023.\n“NNPP has never at any time said its esteemed presidential candidate, His Excellency, Engr.\nDr. Rabiu Musa kwankwaso, could accept to be Labour Party Presidential Candidate, Peter Obi’s deputy.\n“The report is misleading and embarrassing to our great party, its presidential candidate, Kwankwaso, and millions of supporters in Nigeria and in the diaspora."
  },
  {
    "headline": "Oni rejects Ekiti Gov poll as PDP candidate concedes defeat The Nation Newspaper",
    "summarized_story": "The candidate of the Social Democratic Party (SDP) in the just concluded Ekiti governorship election, Segun Oni, has rejected outcome of the poll.\nThe All Progressive Congress (APC) candidate Biodun Oyebanji emerged the winner with187,057 votes to defeat his main challenger Oni who polled 82, 209.\nThe SDP governorship candidate, who spoke through the party’s agent and former Attorney-General, Barrister Owonseni Ajayi, lamented that the poll was riddled with irregularities and voter’s inducement.\nIn a congratulatory letter he personally signed and addressed to Oyebanji, the PDP candidate thanked the people of Ekiti for trooping out to exercise their franchise.\n“Please take urgent actions aimed at redressing the plights of our people when you fully assume the mantle shortly."
  },
  {
    "headline": "Mad people have taken over politics in Nigeria- Peter Obi The Nation Newspaper",
    "summarized_story": "Presidential candidate of Labour Party (LP) Peter Obi on Sunday evening declared 70% of politicians in Nigeria is lunatic.\nHe said mad people have taken over politics and governance in the nation.\nHe stressed most of the politicians in the corridors of power have no reason to be there, describing politics in Nigeria as a case where lunatics have taken over the asylum.\nI have said it, politics in Nigeria is a case where lunatics have taken over the asylum.\n“Political bandits that have taken over Nigeria, most of them have no business being there."
  },
  {
    "headline": "Mbaka's protest: Security operatives take over Enugu Catholic cathedral The Nation Newspaper",
    "summarized_story": "Security operatives have taken over the entrances of Holy Ghost Cathedral, Enugu and residence of Bishop Callistus Onaga at Independence Layout, Enugu over protest by supporters of Rev Fr Ejike Mbaka.\nOur correspondent learnt the deployment of security operatives to the two premises was to avoid a repeat of last year’s incidents.\nHundreds of the followers of Fr Mbaka last year stormed the Holy Ghost Cathedral, Enugu and destroyed valuables worth millions.\nAt the Old Market Road, Enugu where Holy Ghost Cathedral is situated, security operatives were stationed at various entrances to the church.\nMembers of Mbaka’s Adoration Ministry on Sunday trooped to the streets of Umuchigbo to protest the ban on the Adoration Ministry Enugu, headed by the priest."
  },
  {
    "headline": "3 killed, 2 injured as gunmen attack Kaduna Catholic church",
    "summarized_story": "Gunmen, yesterday, attacked worshippers at a Catholic church in Kajuru Local Government Area of Kaduna State, killing three people and injuring two others.\nHe explained that in Rubu village, the bandits attacked worshippers in the Maranatha Baptist Church and St. Moses Catholic Church.\n“Three locals have been confirmed killed in the attacks, and two people were left injured – one of them a man, and a yet-to-be identified woman.\nHe said the Acting Governor also commiserated with the attacked churches, and prayed for the speedy recovery of the injured.\nWhen contacted, the Kaduna Command Police Public Relations Officer, DSP Mohammad Jalige, also confirmed the incident, saying the attack happened yesterday while worshippers were in church."
  },
  {
    "headline": "Ekiti: Buhari, Kalu, Fayemi, others hail Oyebanji over victory",
    "summarized_story": "From Romanus Ugwu, Juliana Taiwo-Obalonye, Abuja, Laide Raheem, Abeokuta and Priscilla Ediare, Ado-EkitiPresident Muhammadu Buhari, Chief Whip of the Senate, Orji Uzor Kalu, Governors of Ekiti State, Kayode Fayemi, Kebbi State, Atiku Bagudu, Adegboyega Oyetola of Osun and others have congratulated Biodun Oyebanji, Ekiti State Governor-elect.\nWhile commending the people of Ekiti for voting the candidate of the APC, Kalu urged Oyebanji to consolidate on the achievements of Governor Fayemi.\n“The victory of the governorship candidate of the All Progressives Congress (APC), Mr Biodun Oyebanji is timely and well deserved.\n•Fayemi, BaguduIn his reaction, Governor Fayemi said APC won because the party has a sellable product in Oyebanji.\nAdamu said Oyebanji has the pedigree, experience and vision to take Ekiti State to the next level of development."
  },
  {
    "headline": "Uneasy calm in PDP as Wike, others weigh options",
    "summarized_story": "From Ndubuisi Orji, AbujaThe dust raised by the nomination of Delta State Governor, Ifeanyi Okowa as vice presidential candidate of the Peoples Democratic Party (PDP) is yet to settle as aggrieved party leaders are weighing their options.\nSigns of dissent became evident when some of the governors, who rooted for Wike boycotted the unveiling of Okowa in Abuja.\nWhat is paramount to every member of the PDP is not personal interest, but national issues.\nWe recognise that when people feel aggrieved, feel offended, we have to reach out to them,” said the source.\nNevertheless, Daily Sun gathered that the dismal performance of the PDP in the just concluded Ekiti State governorship election is attributable to the indifference of some of the governors to the election."
  },
  {
    "headline": "Group warns INEC against substitution of names of elected candidates",
    "summarized_story": "In a statement by its Director, Dr. Sam Amadi, the group advised INEC to ensure its actions are guided by the Electoral Act to avoid external manipulations by anti-democratic elements.\nIt also urged INEC to reject fraudulent and false submission of candidates by the parties.\nAccording to the group, for anyone to emerge as a candidate based on the provisions of the Electoral Act, the person must have participated in a primary election.\n“Submitting names of persons who did not win duly conducted primaries on INEC portals is contrary to the electoral law.\nThe electoral law requires that only persons who won duly conducted primaries should be submitted as candidates."
  },
  {
    "headline": "70% of Nigerian politicians lunatics –Obi",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresidential candidate of the Labour Party (LP), Peter Obi, has described 70 per cent of Nigerian politicians as lunatics.\nHe said most politicians in corridors of power have no reason to be there, warning that unless lunatics are flushed out and competent people voted in, the country would continue to suffer.\n70 per cent of those who are in politics today should not have any reason to be there.\nI have said it, politics in Nigeria is a case where lunatics have taken over the asylum.\nNational secretary of Young Peoples Party (YPP), Vidiyano Bamaiyi, also claimed 75 per cent of politicians in Nigeria are political bandits."
  },
  {
    "headline": "Terrorists Attack Two Churches in Kaduna Community, Kill Three, Abduct 44",
    "summarized_story": "By John Shiklam in KadunaFour people have been killed while 44 others were abducted by terrorists in an attack on two churches in Rubu community, Kajuru Local Government Area of Kaduna state.\nSources said the terrorists attacked worshipers at St. Moses Catholic Church and Maranatha Baptist Church in the community on Sunday during worship service.\nThree people were said to have been killed in the attack on Catholic Church while 30 people were abducted at Maranatha Babtist Church.\nThose who sustained injuries were said to have been taken to the St. Gerald Catholic Hospital, Kaduna, for treatment.\nIn a statement on Sunday, the Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the bandits attacked three communities, looted shops and carted away some valuables from the villages."
  },
  {
    "headline": "In Landslide Victory, APC Wins Ekiti Governorship Election as Vote-buying Mars Poll",
    "summarized_story": "The governorship election, which was held under a calm and peaceful atmosphere, also recorded a large turnout of voters.\nThe winner of the governorship election, Oyebanji, is a former Secretary to the State Government (SSG), to Governor Kayode Fayemi.\nEFCC Arrests Vote Buyers, Election Calm, PeacefulFollowing the widespread vote-buying, which characterised the governorship election, the operatives of the Economic and Financial Crimes Commission (EFCC) arrested persons suspected to be engaged in vote-buying in the poll.\nSituation Room noted that the election was generally peaceful, with voters civilly conducting themselves in most of the polling units.\nMeanwhile, the Socio-Economic Rights and Accountability Project (SERAP) has asked INEC to prosecute all those involved in vote-buying in the governorship election."
  },
  {
    "headline": "Breaking: APC’s Oyebanji Wins Ekiti Guber Election",
    "summarized_story": "All Progressives Congress Governorship candidate, Biodun Abayomi Oyebanji, has won the Ekiti Governorship Election.\nHe polled 187,057 votes.Oyebanji won in 14 of the 16 local government areas in the election conducted on Saturday.\nHis closest rival, Segun Adebayo Oni of the Social Democratic Party, polled 82,211 votes.\nOni won in Moba local government area.Mr.\nBisi Kolawole of the Peoples Democratic Party scored 67,457 votes to emerge third in the race."
  },
  {
    "headline": "Peter Obi and the Last ‘Big Men’",
    "summarized_story": "Mr. Peter Obi has emerged as both a generational shift and a redefinition of both political message and medium.\nAs a rule, civilian political Big Men and Big Generals do not sleep on the same bed.\nThe real unexpected tale from our season of presidential nomination primaries is the emergence of Mr. Peter Obi.\nThe Peter Obi phenomenon is a timely reversal of the old African Big Man narrative.\nMr. Peter Obi has come to serve notice on our behalf: Bola Tinubu and Atiku Abubakar (whoever wins in 2023) are perhaps the last Big Men that will rule Nigeria."
  },
  {
    "headline": "EKITI GOVERNORSHIP ELECTION RESULTS 2022 (As announced by INEC)",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "#EkitiDecides: Abiodun Oyebanji Of APC Wins Ekiti Governorship Election",
    "summarized_story": "Abiodun Oyebanji, candidate of the All Progressives Congress, has emerged the winner of the 2022 Ekiti governorship election.\nOyebanji was announced as the winner by Kayode Adebowale, returning officer for the election, after amassing a total of 187,057 votes.\n“Oyebanji, having scored the highest number of votes is hereby declared the winner and returned elected as the governor-elect of Ekiti State,\" the returning officer said.\nSee Also Elections Highest Bidder: How Rampant Vote-buying Marred Ekiti Governorship ElectionThe election also saw widespread of vote-buying especially by the APC.\nSee Also Breaking News LIVE UPDATE: Ekiti State Governorship Election"
  },
  {
    "headline": "#EkitiDecides: Abiodun Oyebanji Of APC Wins Ekiti Governorship Election",
    "summarized_story": "Abiodun Oyebanji, candidate of the All Progressives Congress, has emerged the winner of the 2022 Ekiti governorship election.\nOyebanji was announced as the winner by Kayode Adebowale, returning officer for the election, after amassing a total of 187,057 votes.\n“Oyebanji, having scored the highest number of votes is hereby declared the winner and returned elected as the governor-elect of Ekiti State,\" the returning officer said.\nSee Also Elections Highest Bidder: How Rampant Vote-buying Marred Ekiti Governorship ElectionThe election also saw widespread of vote-buying especially by the APC.\nSee Also Breaking News LIVE UPDATE: Ekiti State Governorship Election"
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,445 polling units where voting will take place."
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,445 polling units where voting will take place."
  },
  {
    "headline": "BREAKING: Hoodlums Attack Convoy Of APC Presidential Candidate, Tinubu, In Lagos, Two Injured",
    "summarized_story": "Hoodlums have attacked the convoy of the presidential candidate of the ruling All Progressives Congress, Bola Tinubu in Lagos State.\nTinubu, according to a report by AIT, was attacked at the Adeniji end of Isale Eko after the former Lagos governor paid a visit to the Oba of Lagos.\nAccording to the report, the hoodlums who were wielding swords and cutlasses, threw stones at the convoy as it drove from the palace.\nThough Tinubu was not affected by the attack, the bus conveying journalists and the backup security car on the convoy were the most affected.\nThe former Lagos State Governor arrived in Lagos on Sunday after the Ekiti State governorship election and was received at the Presidential Wing of Murtala Mohammed International Airport in Ikeja before proceeding to the palace of the Oba of Lagos."
  },
  {
    "headline": "'Lunatics have taken over the asylum' -- Peter Obi asks Nigerians to take back their country",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), says Nigerians need to “take back” their country.\nObi, who described Nigeria’s political space as an “asylum”, said Nigerians cannot allow the current status quo to continue.\nAdvertisement“We can’t allow this gangsterism to continue, Nigerians should take back their country.\nI have said it, politics in Nigeria is a case where lunatics have taken over the asylum,” he said.\nWhen I was a governor in Anambra, my party had no state or federal lawmaker,” he said."
  },
  {
    "headline": "'Lunatics have taken over the asylum' -- Peter Obi asks Nigerians to take back their country",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), says Nigerians need to “take back” their country.\nObi, who described Nigeria’s political space as an “asylum”, said Nigerians cannot allow the current status quo to continue.\nAdvertisement“We can’t allow this gangsterism to continue, Nigerians should take back their country.\nI have said it, politics in Nigeria is a case where lunatics have taken over the asylum,” he said.\nWhen I was a governor in Anambra, my party had no state or federal lawmaker,” he said."
  },
  {
    "headline": "'It's embarrassing' -- NNPP denies report on Kwankwaso becoming Obi's running mate",
    "summarized_story": "The New Nigeria Peoples Party (NNPP) has dismissed reports that Rabiu Kwankwaso, presidential candidate of the party, has accepted to be the running mate to Peter Obi, presidential candidate of the Labour Party (LP).\nEarlier on Sunday, there were reports making the rounds on social media that Kwankwaso had accepted to be vice-presidential candidate to Obi.\nThe posts on social media were based on a report in which Agbo Major, NNPP publicity secretary, had spoken on ongoing talks between the LP and the NNPP.\nAdvertisement“NNPP has never at any time said its esteemed Presidential Candidate, His Excellency, Engr.\nDr. Rabiu Musa Kwankwaso, could accept to be Labour Party, Peter Obi’s deputy,” the statement reads."
  },
  {
    "headline": "'It's embarrassing' -- NNPP denies report on Kwankwaso becoming Obi's running mate",
    "summarized_story": "The New Nigeria Peoples Party (NNPP) has dismissed reports that Rabiu Kwankwaso, presidential candidate of the party, has accepted to be the running mate to Peter Obi, presidential candidate of the Labour Party (LP).\nEarlier on Sunday, there were reports making the rounds on social media that Kwankwaso had accepted to be vice-presidential candidate to Obi.\nThe posts on social media were based on a report in which Agbo Major, NNPP publicity secretary, had spoken on ongoing talks between the LP and the NNPP.\nAdvertisement“NNPP has never at any time said its esteemed Presidential Candidate, His Excellency, Engr.\nDr. Rabiu Musa Kwankwaso, could accept to be Labour Party, Peter Obi’s deputy,” the statement reads."
  },
  {
    "headline": "'We'll challenge outcome' -- SDP, ADP reject Ekiti guber poll result",
    "summarized_story": "The Social Democratic Party (SDP) and Action Democratic Party (ADP) have described the results of the just-concluded Ekiti governorship election as “unacceptable”.\nOyebanji secured 187,057 votes, defeating his two closest challengers — Segun Oni of the SDP who polled 82,211 votes, and Bisi Kolawole of the Peoples Democratic Party (PDP) who got 67,457 votes.\nSpeaking on Sunday in Ado-Ekiti Owoseni Ajayi, collation agent of the SDP, said the outcome of the results was rejected by the party.\n“The victory of Mr Biodun Oyebanji in the just concluded governorship election ordinarily would have been accepted by me, if the election had not been fraught by electoral malpractices,” she said.\nAdvertisement“I want to use this medium to urge my followers not to be discouraged about the outcome of the election."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abena, a voice assistant wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "Meet 11 female founders making strides in Africa",
    "summarized_story": "This article aims to recognize some African female founders making great strides across various industries and sectors on the continent.\nMeet 11 African female founders we are rooting:Sethebe Manake – Botswana 🇧🇼Image source: Sethebe ManakeMy name is Sethebe Manake (she/her) and I am a real-estate expert turned tech entrepreneur who enjoys dancing and game nights.\nLinkedIn: Neema IyerTao Laine Boyle – South Africa 🇿🇦Image source: Tao BoyleMy name is Tao Boyle (she/her).\nThato Schermer – South Africa 🇿🇦Image source: Thato SchermerMy Name is Thato Schermer (she/her) and I’m the Founder of Zoie Health Technologies.\nI graduated from the University of Cape Town (South Africa) and the University of California (Los Angeles) with a triple major in computer science, genetics, and biochemistry."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "2023: Five lessons from Ekiti governorship polls",
    "summarized_story": "Following the conclusion of the 2022 gubernatorial election of Ekiti State, the following four points stand out as lessons for the conduct of elections in the country.\nLow voter turnoutTurnout was low despite the noise about voter anger.\nElectronic results transmission is effectiveINEC was fast in vote tallying and subsequent declaration of a governorship election.\nThere was desperation to openly buy votes as other routes of election manipulation especially in votes transmission by INEC appear blocked by e-transmission.\nBallot box snatching reducedFinally no rampant capture of voter ballot boxes and result sheets as this will be useless given e-transmission of results."
  },
  {
    "headline": "Guess work as Fayemi prepares exit note: What future?",
    "summarized_story": "Observers say that the only hope for him to remain politically relevant could be if his party wins the presidential election in which case he could be given a ministerial slot.\nFayemi was minister of Solid Mineral Development before he stepped back to Ekiti to contest the 2018 gubernatorial election and won.\nHaving nursed and helped Oyebanji to win a resounding victory at the election, Fayemi must however, avoid the mistake of his colleagues who failed to realise that yesterday is no longer today.\nAfter his service year, he served as a Research Officer at Development & Management Consultants in Ikeja between 1987-1989.\nNow, with a robust international exposure, would Fayemi return to his forte in the academia of continue to loiter on the corridors of power."
  },
  {
    "headline": "Oyebanji succeeds Fayemi as INEC declares Ekiti guber poll result",
    "summarized_story": "In 1989, he bagged a degree in Political Science from the Ondo State University, now known as Ekiti State University.\nFrom August 1, 2000 to September 2001, he was the special adviser to the Ekiti State Governor.\nFrom September 2001 to May 29, 2003, he became the Chief of Staff to Ekiti state governor.\nThen he became the secretary of the Ekiti state government from 18th October 2018 to 2021.\nHe became an Ekiti state governorship aspirant when he resigned as the SSG on December 7, 2021."
  },
  {
    "headline": "Edo PDP: Obaseki sues for peace, appoints Igbinedion to chair Peace Committee – Nigerian Observer",
    "summarized_story": "The governor disclosed this while meeting with over 135 PDP members drawn from the National Executive Committee, State Executive Committee, and Zonal Committee of the party, at the party Secretariat in Benin City.\nI have consulted and for the time being decided that Chief Lucky Igbinedion, a former Governor of the State to chair the peace committee of the party in the state.\nThe internal wrangling is the only thing that can stop us as it has stopped PDP in Ekiti State.\n“If we sue for peace in the party, we will certainly find one.\nHe called on the party leaders to activate the youths wing to bring youths into the party in preparation for the 2023 general election."
  },
  {
    "headline": "CVR: Ex Edo LG Chairman task stakeholders on mobilization – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu – With 10 days to the end of the Continuous Voters Registration (CVR) by the Independent National Electoral Commission (INEC), a former chairman of Orhionmwon local government, Hon.\nOtamere Aigbogun on Sunday called on political stake holders in the area to mobilize those who are yet to register to visit Esigie college and the Primary Health Center (PHC) at Abudu for registration.\nAigbogun who made the call in message made available to The Nigerian OBSERVER stated that the registration will continue at Abudu (Abiokunla Ward 1) on Monday, 20th June, 2022 through Wednesday, 22nd June 2022.\nThe exercise is expected to move to Ogan community in the area on Thursday 23rd June 2022 and Friday 24th June 2022.\nThe online registration is scheduled to end on 30th June year 2022 with the commission undecided on the issue of extension."
  },
  {
    "headline": "Obaseki inspects ongoing revamp of Abudu College of Education, reassures on September resumption date – Nigerian Observer",
    "summarized_story": "Obaseki, who inspected the demonstration school by the Universal Basic Education Commission (UBEC) and the main campus of the college, said his government is committed to human capacity development.\n“The demonstration school would be like a laboratory for training basic teachers because what we are trying to do is to make these facilities in Abudu another education hub.\n“The college will help in training teachers, particularly those to teach basic education.\nYou can see that the same thing is happening in the school of agriculture, as well as the school of nursing.\nFirst, you have to have quality schools, and then quality teachers to now produce the kind of students you need."
  },
  {
    "headline": "FATHERS DAY: Shaibu Harps on Godly Virtues …Serves as Altar Boy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – As Nigeria joins the rest of the world in celebrating Father Day, Edo State Deputy Governor, Rt.\nHon.Comrade Philip Shaibu,has advocated the need for parents to imbibe and impact the virtues of Godliness andmoral discipline in their homes, by bringing up their children in the way of the Lord.\nAccording to him, “the starting point of building a nation is by building our homes”,while calling on Fathers to amplify issues that will unite the nation.\n“A Father or Leader should not say or do in secret, what he cannot own up to in public, because nothing is secret.\nIf we can act as St. Joseph in the Bible, then the issues of insecurity will be history in Nigeria”, he stated."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "VIDEO: Charly Boy celebrates 72nd birthday in church",
    "summarized_story": "Charles Oputa, popularly known as Charly Boy, today, marked his 72nd birthday in church.\nHe shared a video from the moment he was celebrated in church on his Instagram page.\nHe captioned the video, “Happy birthday to me.\nI’m a year younger.”"
  },
  {
    "headline": "Hoodlums attack Bola Tinubu’s convoy in Lagos, two injured",
    "summarized_story": "Hoodlums, on Sunday, attacked the convoy of Bola Tinubu, the presidential candidate of the All Progressives Congress (APC) in Lagos State.\nThe convoy was attacked at the Adeniji end of Isale Eko after the former Lagos governor paid a visit to the Oba of Lagos.\nThe former Lagos governor was heading to his Bourdillon Avenue, Ikoyi residence from the palace.\nReports said the report, the hoodlums threw stones at the convoy as it drove from the palace, smashing side glasses and front windshields of vehicles in the convoy.\nThough Tinubu was not affected by the attack, the bus conveying journalists and the backup security car on the convoy were the most affected."
  },
  {
    "headline": "JUST IN: No agreement about Kwankwaso serving as Peter Obi’s running mate — NNPP",
    "summarized_story": "The New Nigeria Peoples Party (NNPP), has dismissed reports suggesting that Rabiu Musa Kwankwaso, that its Presidential Candidate, will contest the 2023 Presidential elections as running mate to his counterpart in the Labour Party, Mr Peter Obi.\nAccording to the NNPP, there was never a time such a discussion or negotiation was held.\nAccording to him, “NNPP has never at any time said its esteemed Presidential Candidate, His Excellency, Engr.\nDr. Rabiu Musa kwankwaso could accept to be Labour Party, Peter Obi’s deputy.\nMajor expressed confidence that together with the media, the NNPP “shall build a strong, virile, progressive and egalitarian democratic society.“"
  },
  {
    "headline": "Mbaka’s followers protest in Enugu over ban on Adoration Ministry",
    "summarized_story": "Followers of Ejike Mbaka, a fiery Catholic priest based in Enugu on Sunday, took to the streets to protest the ban on the Adoration Ministry where the priest is the spiritual leader.\nCallistus Onaga, had on Friday banned all priests and Catholic faithful from attending Mbaka’s Adoration Ministry.\nHowever, despite the apology, Bishop Onaga prohibited Catholic faithful from attending Adoration Ministry programmes until the due canonical process initiated by the Diocese was concluded.\nAngered by the ban, Mbaka’s followers gathered on Sunday morning at the Adoration ground and started a massive protest against Bishop Onaga’s directive.\nThey chanted anti-Bishop Onaga songs, calling the Bishop unprintable names and queried his authority for clamping down on Mbaka’s Ministry."
  },
  {
    "headline": "Terrorists attack Catholic Church in Kaduna, kill three, abduct 36",
    "summarized_story": "Terrorists on Sunday, attacked a Catholic Church in Kaduna State killing three worshippers and abducting not less not than 36.\nMr. Reuben Buhari, former Special Adviser on Media to the Governor of Kaduna State, said the attack on Roboh village, Kajuru LGA where 36 people were kidnapped and 3 killed wasn’t the first attack.\nMost go unannounced, unreported.”He said, “The attack on Roboh village, Kajuru LGA today where 36 people were kidnapped and 3 killed wasn’t the first attack.\nIt was some few minutes after 7am today, while both the Catholic and Baptist churches were holding their services when the kidnappers attacked.”“I spoke to a man whose wife, mother and daughter were taken from the Baptist church today.\n“In Rubu village, the bandits attacked worshippers in the Maranatha Baptist Church and St. Moses Catholic Church,” the statement said."
  },
  {
    "headline": "Ekiti Poll Outcome Indicates Total Rejection Of PDP ― APC",
    "summarized_story": "Ekiti Poll Outcome Indicates Total Rejection Of PDP ― The All Progressives Congress (APC) has described the victory of its candidate in the just concluded governorship election in Ekiti State, Biodun Oyebanji, as outright rejection of the People’s Democratic Party (PDP) by Nigerians.\n“It bears mentioning that the towering accomplishments of incumbent Governor of Ekiti State, Dr Kayode John Fayemi, provided a solid predicate for this decisive victory.\n“Unsurprisingly, the opposition Peoples Democratic Party (PDP) finished a distant third position in the just-concluded election.\n“I salute the people of Ekiti State for voting for progressive leadership and continuity.\nI commend the leadership of our party for leading APC to this major victory in Ekiti."
  },
  {
    "headline": "Ekiti Poll Outcome Indicates Total Rejection Of PDP ― APC",
    "summarized_story": "Ekiti Poll Outcome Indicates Total Rejection Of PDP ― The All Progressives Congress (APC) has described the victory of its candidate in the just concluded governorship election in Ekiti State, Biodun Oyebanji, as outright rejection of the People’s Democratic Party (PDP) by Nigerians.\n“It bears mentioning that the towering accomplishments of incumbent Governor of Ekiti State, Dr Kayode John Fayemi, provided a solid predicate for this decisive victory.\n“Unsurprisingly, the opposition Peoples Democratic Party (PDP) finished a distant third position in the just-concluded election.\n“I salute the people of Ekiti State for voting for progressive leadership and continuity.\nI commend the leadership of our party for leading APC to this major victory in Ekiti."
  },
  {
    "headline": "JUST-IN: Former NFF Secretary-General Kidnapped",
    "summarized_story": "A former Secretary-General of the Nigeria Football Federation (NFF), Sani Toro, has been kidnapped on his way to Bauchi State from Abuja.\nI got across to one of his sons, who told me he was abducted around Akwanga road in Nasarawa while returning from Abuja.\nOther details when I get them will be communicated to you,” the PPRO said.\nLEADERSHIP gathererd that the former scribe of the football federation was reportedly kidnapped alongside a former Assistant Coach of the Super Eagles, Garba Yila.\nAs at the time of filing this report, the alleged abductors were yet to communicate with the family."
  },
  {
    "headline": "JUST-IN: Former NFF Secretary-General Kidnapped",
    "summarized_story": "A former Secretary-General of the Nigeria Football Federation (NFF), Sani Toro, has been kidnapped on his way to Bauchi State from Abuja.\nI got across to one of his sons, who told me he was abducted around Akwanga road in Nasarawa while returning from Abuja.\nOther details when I get them will be communicated to you,” the PPRO said.\nLEADERSHIP gathererd that the former scribe of the football federation was reportedly kidnapped alongside a former Assistant Coach of the Super Eagles, Garba Yila.\nAs at the time of filing this report, the alleged abductors were yet to communicate with the family."
  },
  {
    "headline": "Ekiti Guber: Oyebanji’s Victory Affirms APC’s Acceptance – Buhari",
    "summarized_story": "President Muhammadu Buhari has congratulated Biodun Oyebanji, the candidate of the All Progressives Congress (APC) as he is declared governor-elect in Saturday’s Ekiti State gubernatorial election.\nADVERTISEMENTPresident Buhari also rejoiced with the APC national chairman, Abdulahi Adamu, and the National Working Committee (NWC) for the victory, the first under the tenure of the newly elected executives of the party.\nThe victory of our party in Ekiti is an indication of the confidence of Nigerians in the ability of our great party to deliver quality governance to all,” said the President.\nPresident Buhari also felicitated with the people of Ekiti State for the smooth conduct of the election, affirming that they are the real victors as they have been able to freely choose their leader for the next four years.\nHe lauded the Independent National Electoral Commission (INEC) and the law enforcement agencies for the preparations put in place, urging them to keep the momentum for upcoming elections."
  },
  {
    "headline": "What transpired when Tinubu visited Oba Rilwan Akiolu (Photos)",
    "summarized_story": "The APC Presidential candidate, Asiwaju Bola Tinubu visited the Oba of Lagos, Rilwan Akiolu on Sunday after returning from Abuja.\nTinubu’s homecoming turned to a carnival immediately his motorcade rolled into the town.\nCrowd of residents lined up along the the convoy’s route, with Tinubu acknowledging cheers and waving his broom from the window.\nThe convoy moved to the palace of Akiolu, where the APC National Leader received royal blessings.\nThe former governor of Lagos State was accompanied to the palace by Governor Babajide Sanwo-Olu and his deputy, Dr. Kadri Hamzat."
  },
  {
    "headline": "We've recorded unprecedented achievement in last three years",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, on Sunday said his administration has matched words with achievements as far as governance is concerned in the state in the past three years.\nSanwo-Olu spoke at the 3rd year anniversary thanksgiving service of his administration at the Chapel of Christ the Light, Alausa, Ikeja.\nThe theme of the 3rd Year’s thanksgiving is “O God our help in ages past”.\nWe were able to match our words with achievements”, Sanwo-Olu said.\nBy the grace of God, I assure all Lagosians that better times lie ahead”, Sanwo-Olu said."
  },
  {
    "headline": "JUST IN: Two injured as hoodlums attack Tinubu’s convoy in Lagos",
    "summarized_story": "Hoodlums on Sunday, attacked the convoy of the presidential candidate of the ruling All Progressives Congress (APC), Bola Tinubu in Lagos.\nTinubu, was attacked at the Adeniji end of Isale Eko after the former Lagos governor paid a visit to the Oba of Lagos.\nOgunrinde got wounded in the face, while Atsenuwa had his arm hit directly by one of the heavy stones thrown at the press crew bus.\nAccording to the report, the hoodlums who were wielding swords and cutlasses, threw stones at the convoy as it drove from the palace.\nThough Tinubu was not affected by the attack, the bus conveying journalists and the backup security car on the convoy were the most affected."
  },
  {
    "headline": "BREAKING: Kaduna governor, El-Rufai sacks NUT president, 2,356 other teachers",
    "summarized_story": "KADSUBEB’s spokesperson, Hauwa Mohammed, said the board conducted a competency test for over 30,000 teachers in December 2021.\nShe said that 2,192 primary school teachers, including the National President of the Nigeria Union of Teachers (NUT), Audu Amba, had been dismissed for refusing to sit for the competency test.\nReacting, Ibrahim Dalhatu, state chairman, NUT, dismissed the competency test and the sacking of the affected teachers as “illegal”.\n“The competency test should be used to determine teachers’ capacity gap and tailored specific training programmes to improve their capacities,” he said.\nIn 2018, the Kaduna government sacked 21,780 teachers who failed a competency test and replaced them with 25,000 others recruited through robust processes."
  },
  {
    "headline": "BREAKING: Terrorists attack Catholic Church in Kaduna, kill three, abduct many",
    "summarized_story": "A former Special Adviser on Media to the Governor of Kaduna State, Mr. Reuben Buhari said the attack on Roboh village, Kajuru LGA where 36 people were kidnapped and 3 killed wasn’t the first attack.\nMost go unannounced, unreported.”“The attack on Roboh village, Kajuru LGA today where 36 people were kidnapped and 3 killed wasn’t the first attack.\nAccording to a statement issued by Aruwanon Sunday, the bandits stormed the villages on motorcycles, beginning from Ungwan Fada, and moving into Ungwan Turawa, before Ungwan Makama and then Rubu.\n“In Rubu village, the bandits attacked worshippers in the Maranatha Baptist Church and St. Moses Catholic Church,” the statement said.\nThey were identified as“Peter Madaki (Ward head of Ungwan Fada), Elisha Ezekiel (Resident of Ungwan Fada) and Ali Zamani (Youth leader of Rubu).”“Two persons were left injured in the attacks: one Aniro Mai, and a yet-unidentified woman."
  },
  {
    "headline": "Ex- Rivers, Plateau military governor dies in Abuja",
    "summarized_story": "A former Military Administrator of Rivers State, Col. Musa Sheikh Shehu (Rtd) is dead.\nA reliable source told News Direct that the deceased died in the early hours of Sunday.\nThe source added that Colonel Shehu who was also Military Administrator of Plateau had been buried at Gudu cemetery after funeral prayers at Apo Legislative quarters.\nHe was Administrator of Rivers State, from August 1996 to August 1998 during the military regime of General Sani Abacha, and then of Plateau State until the return to democracy in May 1999.\nIn 2010 Shehu was Secretary General of the Arewa Consultative Forum (ACF)."
  },
  {
    "headline": "Competency test: Kaduna sacks NUT President, 2,356 other teachers",
    "summarized_story": "Kaduna state government has confirmed that it has sacked 2,357 teachers in the state.\nOut of the number, 2,192 were eased out for failing to sit for a competency test and 165 for failing the said test, Kaduna State Universal Basic Education Board (KADSUBEB) has said.\nHowever, Chairman of the Nigeria Union of Teachers (NUT), Kaduna state chapter, Ibrahim Dalhatu, told journalists that sacking the teachers based on the competency test was illegal, adding that the test was conducted against court order and the test should not be a basis to sack teachers.\nThe state government conducted a competency test for over 30,000 primary school teachers in December 2021, KADSUBEB said in a statement issued by Hauwa Mohammed in Kaduna on Sunday.\nShe said 2,192 primary school teachers including the National President of the Nigeria Union of Teachers (NUT) Mr Audu Amba had been dismissed for refusing to sit for the competency test."
  },
  {
    "headline": "Breaking: Ex-NFF top official kidnapped",
    "summarized_story": "Unknown gunmen on Saturday night struck and kidnapped former General Secretary of the Nigeria Football Federation (NFF) Sani Ahmed Toro.\nI got across to one of his sons, who told me he was abducted around Akwanga road in Nasarawa while returning from Abuja.\nOther details when I get them will be communicated to you,” Mr Wakili was quoted by Premium Times.\nMr Toro and Mr Yila were kidnapped on their way from Abuja to Bauchi after attending the wedding ceremony of the son of Former NFF President, Aminu Maigari.\nOne of the sons of the victims Nasiru Sani Toro confirmed that his father along two others were kidnapped while returning from Abuja around 7-8pm."
  },
  {
    "headline": "Breaking: INEC declares APC’s Oyebanji winner of Ekiti governorship election *See full results, other details",
    "summarized_story": "Mr. Biodun Oyebanji of the All Progressives Congress has been declared winner of the 2022 Ekiti governorship election by the Independent National Electoral Commission (INEC)Mr Oyebanji polled a total of 187,057 votes to defeat his two closest challengers – Segun Oni of the Social Democratic Party (SDP) and Bisi Kolawole of the People’s Democratic Party.\nThe SDP emerged in second place with total votes of 82,211 while the PDP was third with 67,457 votes.\nMr Oyebanji is now set to replace incumbent Kayode Fayemi in October.\nThe results as announced by INEC:Ekiti East LGAAPC – 12,099PDP – 5,230SDP – 4,982Gbonyin LGAAPC – 11,247PDP – 3,947SDP – 4,059Ikole LGAAPC -16,417PDP – 6,266SDP – 5,736Ado-Ekiti LGAAPC – 23,831PDP – 7,575SDP – 15,214Ise/Orun LGAAPC – 8,074PDP – 2,588SDP – 5,909Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445Ido/Osi LGAAPC – 10,321PDP – 2,871SDP – 9,489Oye LGAAPC – 13,396PDP – 4,122SDP – 3,591Moba LGAAPC – 11,609PDP – 3,530SDP – 4,904Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577Ilejemeje LGAAPC – 4,357PDP – 1,157SDP – 2,344Ikere-Ekiti LGAAPC – 12,086PDP – 3,789SDP – 1,943Irepodun Ifelodun LGAAPC – 13,125PDP – 4,712SDP – 5,010Ekti West LGAAPC – 15,322PDP – 3,386SDP – 3,863Ijero LGAAPC – 13,754PDP – 4,897SDP – 5,006Efon Alaaye LGAAPC – 4,012PDP – 6,303SDP – 339.\nNumber of votes according to political partiesA: 166AAC: 409ADC: 5,997ADP: 3,495APC: 187,057APGA: 376APM – 290LP: 195PRP: 1,980NNPN: 529PDP: 67457SDP: 82,211YPP: 618ZLP: 282Registered voters: 989,224Accredited voters: 365,438Valid votes: 351,865Rejected votes: 8888Total votes cast: 360753."
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "Three Worshippers Killed, Several Missing As Gunmen Attack Two Churches In Kaduna",
    "summarized_story": "Just two weeks after the incident in Owo, gunmen struck again, this time in Kaduna State where they attacked two churches.\nNo fewer than three people were confirmed to have lost their lives to the attacks on three communities – Ungwan Fada, Ungwan Turawa, and Ungwan Makama, all in Rubu general area of Kajuru.\nAccording to him, the terrorists stormed the communities on motorcycles, beginning from Ungwan Fada, and moving into Ungwan Turawa, before Ungwan Makama and then Rubu.\nRecounting the incident, Aruwan said the bandits attacked worshippers at the Maranatha Baptist Church and St Moses Catholic Church in Rubu, killing three worshippers in the attack.\nBalarabe also commiserated with members of the attacked churches and prayed for the speedy recovery of the injured victims."
  },
  {
    "headline": "‘We Are Waiting,’ Oyebanji’s Camp Dares Oni To Challenge Ekiti Election Result",
    "summarized_story": "The Biodun Abayomi Oyebanji (BAO) Campaign Organisation has dared former governor Segun Oni to challenge the outcome of the just concluded governorship election in Ekiti State.\n“It is usual for Engineer Segun Oni and his team,” he said of the reaction from Oni who was the candidate of the Social Democratic Party (SDP) in the election.\nOyebanji polled 187,057 votes – over 100,000 votes more than that of his closest rival, Oni who scored 82,211 votes in the election.\nJolayemi had also accused the APC of hiring hoodlums for vote-buying and snatching of ballot boxes – claims which the APC swiftly denied.\n“There was only one budget to which I was a party and there was no line called vote-buying."
  },
  {
    "headline": "Why Segun Oni Won’t Accept Outcome Of Ekiti Election – Spokesman",
    "summarized_story": "﻿Former governor of Ekiti State, Segun Oni, has rejected the outcome of the just concluded governorship election in the state.\n“We received it with shock,” he said of the new outcome of the poll in which the former governor was the candidate of the Social Democratic Party (SDP).\nOyebanji polled 187,057 votes – over 100,000 votes more than that of his closest rival, Oni who scored 82,211 votes in the election.\nA day after the APC flagbearer was returned elected, Oni who was governor between 2007 and 2010 rejected the outcome of the election, citing electoral malpractices allegedly by the ruling party.\nAccording to him, Mr Oni has rejected the outcome of the governorship poll won by the ruling party in the state."
  },
  {
    "headline": "Ekiti Election: Official Results Consistent With Votes Cast At Polling Units – YIAGA",
    "summarized_story": "YIAGA Africa says official results of the Ekiti governorship election are a reflection of the voters’ choice at the polling units.\nThe Civil Society Organisation said this in a tweet on its official handle on Sunday afternoon, hours after the election results were announced.\n“According to Yiaga Africa’s Parallel Vote Tabulation estimates,” the tweet read, “@inecnigeria official results for the Ekiti Governorship election is CONSISTENT with votes cast at the polling units.”It said the official results would not have tallied with YIAGA Africa’s estimate ranges if they were changed at the ward, local government, or state collation centres.\nWhile the SDP flag bearer had 82,211 votes, his PDP counterpart took the third spot having garnered 67,457 votes.\nFollowing his victory, President Muhammadu Buhari was among the first persons to congratulate Oyebanji on the feat."
  },
  {
    "headline": "APC Ticket: When I Was Almost Fed Up, I Resorted To Prayers – Tinubu",
    "summarized_story": "﻿The presidential candidate of the All Progressives Congress (APC), Bola Tinubu, has recounted the struggle to emerge as the flagbearer of the ruling party in the 2023 general elections.\nEarlier, all roads leading to the presidential wing of the Murtala Mohammed International Airport (MMIA) were a beehive of activities as supporters trooped to the airport to receive Tinubu.\nTinubu’s arrival in the state is the first since he won the APC presidential ticket.\nThose on his entourage included the Governor Abdullahi Ganduje of Kano State; Senator Kashim Ibrahim; former APC national chairman, Adams Oshiomhole; and Kashim Ibrahim-Imam, among others.\nGovernor Hope Uzodimma of Imo State; Senator Solomon Adeola; Senator Tokunbo Abiru; Lagos APC chairman, Cornelius Ojelabi; and members of the Lagos Executive Council led by Governor Sanwo-Olu joined the dignitaries who received the APC presidential flagbearer at the airport."
  },
  {
    "headline": "Ekiti Governor-elect Biodun Oyebanji pledges to build on Fayemi's legacies",
    "summarized_story": "Winner of the June 18 Governorship Election in Ekiti State, Biodun Abayomi Oyebanji has pledged to build on the Legacy of the outgoing administration led by the Governor, John Kayode Fayemi.\nFollowing his declaration as the Governorship Election Winner earlier today, the Ikogosi-born Technocrat hosted three governors and one former governor, who came to congratulate him and present the election results to him.\nThe Governor of Kebbi State, Atiku Bagudu, who also serves as the Chairman of the Ekiti State Governorship Campaign Council, believes that the performance of Ekiti State Governor, Kayode Fayemi, was crucial in Saturday’s victory, which serves as a model for success in the Presidential election in 2023.\nReading his acceptance speech, Biodun Oyebanji expressed gratitude to all who made the mandate possible and promised to build on Governor Kayode Fayemi’s legacies.\nOyebanji won the election with a Margin of over a 100, 000 to his closest Challenger."
  },
  {
    "headline": "BREAKING: APC wins Ekiti Governorship election with audacious margin -",
    "summarized_story": "The governorship candidate of the All Progressives Congress in Ekiti State, Biodun Abayomi Oyebanjo, has been declared the winner of the Saturday governorship election.\nThe People’s Democratic Party came third with 67,457 votes.\nThe APC governorship candidate won 15 out of the 16 local governments in the state to emerge victory at the poll.\nBelow is the breakdown of the results as released by the electoral umpire.\nAdo-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LGRegistration Areas – 12Registered Voters – 61,360Accredited Voters – 24024APC – 12,099PDP – 5,230SDP – 4,982=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904Final ResultsAccredited Voters – 363,468A – 166AAC – 409ADC – 5,597ADP – 3,495APC – 187,057APGA – 376APM – 290APP – 1,980LP – 195NNPP – 529NRM – 347PDP – 67,457PRP – 856SDP – 82,211YPP – 618ZLP – 282Total Vote Cast – 360,753"
  },
  {
    "headline": "Ekiti Governorship Election: Live Collation of Final Results -",
    "summarized_story": "The collation and announcement of results from the sixteen local government areas has commenced at the State Collation Centre in Ado-Ekiti.\n=================================================================Ado-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LGRegistration Areas – 12Registered Voters – 61,360Accredited Voters – 24024APC – 12,099PDP – 5,230SDP – 4,982=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904=================================================================Final ResultsA – 166AAC – 409ADC – 5,597ADP – 3,495APC – 187,057APGA – 376APP – 1,980LP – 195NNPP – 529NRM – 347PDP – 67,457PRP – 856SDP – 82,211YPP – 618ZLP – 282Total Vote Cast – 360,753"
  },
  {
    "headline": "Zamfara declares one week public holiday for civil servants to obtain PVC -",
    "summarized_story": "Zamfara State Government has declared Monday to Friday next week 20th – 21st June, as work free week to allow civil servants travel to their localities and register in the ongoing permanent voter card registration.\nThe state Commissioner for Information, Ibrahim Dosara in press state made available to Newsmen in Gusau, Confirmed the developmentHe says, Commissioners, Special advisers, Tradition rulers and other Political Party Officials are expected to monitor the exercise in their respective areas.\n“By this announcement, all Commissioners, Special Advisers, Permanent Secretaries, other public office holders, party officials and traditional rulers are here by directed to monitor and supervise the on going Voter Registration exercise to ensure that all eligible voters within their wards and local governments register and obtain their Permanent Voter Cards to enable them exercise their fundamental rights and civic responsibilities in the Coming Elections” The statement read."
  },
  {
    "headline": "French President Macron Loses Parliament Majority In Stunning Setback",
    "summarized_story": "French President Emmanuel Macron and his allies on Sunday lost their absolute majority in the National Assembly and with it control of the reform agenda, a crushing outcome for the newly re-elected president.\n“The rout of the presidential party is complete and there is no clear majority in sight,” Melenchon told cheering supporters.\nRachida Dati, from the conservative Les Republicains, called the result “a bitter failure” for Macron and said he should name a new prime minister.\nForecasts by pollster Ifop, OpinionWay, Elabe and Ipsos showed Macron’s Ensemble alliance winning 210-240 seats and Nupes securing 149-188.\n“Nothing would be worse than adding French disorder to the world’s disorder,” the president had said ahead of the second-round vote."
  },
  {
    "headline": "Duterte’s Daughter Sworn in as Philippines Vice President",
    "summarized_story": "Sara Duterte-Carpio, daughter of outgoing Philippine President Rodrigo Duterte, was sworn in as the country’s 15th vice president on Sunday, calling for national unity following a divisive election campaign.\n“The days ahead may be full of challenges that call for us to be more united as a nation,” she said in an inauguration address in her hometown Davao, where she took the oath of office with her parents standing next to her."
  },
  {
    "headline": "Abuja School of Political Thoughts Charges INEC to Reject Fraudulent Submission of Candidates",
    "summarized_story": "The Abuja School of Social and Political Thoughts has called on the Independent National Electoral Commission (INEC), to reject fraudulent and false submissions of candidates by the political parties for the 2023 general elections in the country.\n“The winners of the duly conducted primaries have refused to give up their tickets.\n“Submitting names of persons who did not win duly conducted primaries on INEC portals is contrary to the electoral law.\nThe electoral law requires that only persons who won duly conducted primaries should be submitted as candidates.\nIt is INEC that determines what is a duly conducted primary, based on its guidelines and the electoral law."
  },
  {
    "headline": "Nigeria, China Strengthen Film Industry to Combat Poverty",
    "summarized_story": "Nigeria and China have mapped out ways to strengthen the movie industries of both countries as a collaborative effort at alleviating poverty in the West African country.\nXuda said: “As we know, both China and Nigeria are large countries with developed film and television industries.\nIn 2021, China’s movie industry produced over 700 movies.\nShe said: “China and Nigeria have huge potential for cooperation in the film industry.\nNigeria film production ranks among the best in the world and China is the world’s film industry market and so we can see the collaboration.”She noted that the Nigeria-China collaboration in the industry has a brighter future."
  },
  {
    "headline": "Terrorists Attack Two Churches in Kaduna, Kill Three, Abduct 44",
    "summarized_story": "Four people have been killed while 44 others were abducted by terrorists in an attack on two churches in Rubu community, Kajuru Local Government Area of Kaduna state.\nSources said the terrorists attacked worshipers at St. Moses Catholic Church and Maranatha Baptist Church in the community on Sunday during worship service.\nThree people were said to have been killed in the attack on Catholic Church while 30 people were abducted at Maranatha Babtist Church.\nThose who sustained injuries were said to have been taken to the St. Gerald Catholic Hospital, Kaduna, for treatment.\nIn a statement on Sunday, the Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the bandits attacked three communities, looted shops and carted away some valuables from the villages."
  }
]