[
  {
    "headline": "Nigeria’s pharmaceutical sector going through tough time –Pharmacists",
    "summarized_story": "Yusuff MoshoodNigeria’s pharmaceutical manufacturing sector is going through a tough time, according to the Association of Industrial Pharmacists of Nigeria.\nThe pharmaceutical sector, the association said, is facing serious challenges of infrastructure deficits that players in the industry require government support and intervention to surmount.\nAccording to Anukwu, while the challenges facing the industry are many and complex, they are not insurmountable.\n“NAIP has, however, proposed the establishment of pharmaceutical manufacturing parks as a way of providing these needed infrastructure and industry-specific incentives in a strategic way.\nThe industrial pharmacist also dispelled the fear that the pharmaceutical sector in Nigeria is over-regulate."
  },
  {
    "headline": "Nigeria’s pharmaceutical sector going through tough time –Pharmacists",
    "summarized_story": "Yusuff MoshoodNigeria’s pharmaceutical manufacturing sector is going through a tough time, according to the Association of Industrial Pharmacists of Nigeria.\nThe pharmaceutical sector, the association said, is facing serious challenges of infrastructure deficits that players in the industry require government support and intervention to surmount.\nAccording to Anukwu, while the challenges facing the industry are many and complex, they are not insurmountable.\n“NAIP has, however, proposed the establishment of pharmaceutical manufacturing parks as a way of providing these needed infrastructure and industry-specific incentives in a strategic way.\nThe industrial pharmacist also dispelled the fear that the pharmaceutical sector in Nigeria is over-regulate."
  },
  {
    "headline": "COVID-19 kills over 168,000 in Africa with 5.8 recoveries",
    "summarized_story": "Angela OnwuzooOver 168,000 people have died of COVID-19 on the African continent since the outbreak of the viral infection, according to the Africa Centres for Disease Control and Prevention.\nThe Africa CDC says more than 6.6m COVID-19 cases have been recorded on the continent so far with over 5.8m recoveries.\nEast Africa, according to the report, recorded 794,410 cases; 16,837 deaths, and 710,420 recoveries with Ethiopia leading the region with 279,629 cases; 4,381 deaths, and 263,392 recoveries.\nIn Northern Africa, there are now 1,914,653 cases; 53,806 deaths, and 1,608,035 recoveries while Morocco has the highest figures with 606,871 cases; 9,697 deaths, and 552,983 recoveries.\nI urge African countries to gear up and get ready, as our drought is finally ending.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "COVID-19 kills over 168,000 in Africa with 5.8 recoveries",
    "summarized_story": "Angela OnwuzooOver 168,000 people have died of COVID-19 on the African continent since the outbreak of the viral infection, according to the Africa Centres for Disease Control and Prevention.\nThe Africa CDC says more than 6.6m COVID-19 cases have been recorded on the continent so far with over 5.8m recoveries.\nEast Africa, according to the report, recorded 794,410 cases; 16,837 deaths, and 710,420 recoveries with Ethiopia leading the region with 279,629 cases; 4,381 deaths, and 263,392 recoveries.\nIn Northern Africa, there are now 1,914,653 cases; 53,806 deaths, and 1,608,035 recoveries while Morocco has the highest figures with 606,871 cases; 9,697 deaths, and 552,983 recoveries.\nI urge African countries to gear up and get ready, as our drought is finally ending.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Hushpuppi: It’s deep conspiracy to destroy his career — Fani-Kayode throws weight behind DCP Abba Kyari",
    "summarized_story": "By Idowu BankoleA former Aviation Minister and foremost chieftain of the PDP, Chief Femi Fani-Kayode has backed the embattled DCP Abba Kyari to come out clean from the allegations of fraud levelled against him by a notorious fraudster, Abbas Ramoni, popularly known as Hushpuppi.\nDCP Abba Kyari, a super cop, widely celebrated for his heroics against criminals and bandits was on Thursday alleged to have benefited from a $1.1 million fraud involving a Qatari School Owner and Abbas Hushpuppi.\nThe Federal Bureau of Investigation, FBI, was ordered to immediately arrest and detain DCP Abba Kyari for allegedly benefiting from the proceeds of the fraud.\nFani-Kayode noted that Abba Kyari has proven himself as an excellent cop over time with an impeccable record of fight crime.\nAlso Read: Arrest Abba Kyari now — Reactions trail Abbas Hushpuppi’s ‘bribery’ allegationFani-Kayode expresses sadness on why Nigerians are always hasty to celebrate evils report against their best."
  },
  {
    "headline": "Extradition battle looms over Sunday Igboho’s arrest",
    "summarized_story": "But there are also strong moves by some Yoruba leaders to stop Igboho’s extradition to Nigeria.\nThere are plans to ensure that Igboho’s extradition is stopped.”However, efforts to get the Attorney-General of the Federation and Minister of Justice, Abubakar Malami, last night to confirm this proved abortive as calls made to his telephone lines were unreplied.\nHe expressed shock over the news that the Federal Government arrested Igboho with the help of INTERPOL in the Benin Republic.\nWe all know he has committed no crime.’’We’re still studying situation—AfenifereOn its part, Afenifere said though surprised over the Igboho’s arrest, it was still studying the situation of events before making a formal statement.\nThe earlier this is done the better.”War has been declared on Yoruba people with Igboho’s arrest —AdebanjoBut Afenifere leader, Pa Ayo Adebanjo said war has been declared on Yoruba people following the arrest of Yoruba freedom fighter."
  },
  {
    "headline": "Court nullifies Odey’s certificate of return, declares Jarigbe Agom winner of C’River North Senatorial By- Election",
    "summarized_story": "By Ike UchechukwuThe Court of Appeal sitting in Calabar, Friday declared Hon.\nJarigbe Agom Jarigbe winner of December 5th, 2020, Cross River North senatorial By-election.\nJarigbe Agom is a candidate of the People’s Democratic Party, PDP.\nREAD ALSO: US court orders arrest of DCP Abba Kyari as Hushpuppi fingers himThe three man Appeal Tribunal headed by Hon.\nJustice Chioma I. Nwosu also nullified the certificate of return earlier issued to Dr Steven Odey by the Independent National Electoral Commission, INEC and directed that it be withdrawn immediately."
  },
  {
    "headline": "Ward congress: Lagos APC holds stakeholders’ meeting",
    "summarized_story": "By Olasunkanmi AkoniAhead of the ward congress of the party scheduled for Saturday, July, 31, Lagos State chapter of All Progressives Congress,APC, has held a statewide stakeholders’ meeting across the 20 Local Governments and 37 Local Council Development Areas, LCDAS.\nThe meeting was sequel to the directive of the National Caretaker Committee to bring all party leaders and members together to rub minds on the forthcoming congresses towards achieving cohesion and acceptable consensus.\nThe various meetings agreed on the desirability of a consensus arrangement that will consider all interests and unite the party towards count-down to the next national elections.\nAccording to Caretaker Publicity Secretary of the state party, Mr Seye Oladejo, the carnival like meetings urged all members to participate actively in the congresses and uphold party discipline at all times.\nThe event presented the newly elected Local Government chairmen, vice chairmen and councilors an opportunity to express their commitment appreciation to all and sundry for the mandate to serve the people."
  },
  {
    "headline": "INTELS graduates 11th Batch of women empowerment scheme",
    "summarized_story": "By Godwin OritseIN a bid to enhance its Corporate Social Responsibility, CSR,Nigerua’s oil and gas logistics giant, INTELS Nigeria Limited has graduated 34 beneficiaries of the 11th Batch of its flagship women development programme popularly known as the Women Empowerment Programme Scheme Synergy (WEPSS).\nThe graduation of the 11th Batch brings the total number of beneficiaries in the popular women empowerment scheme to 1,500.\nWEPSS was established by INTELS in 2013 to empower 5,000 Nigerian women over a 20-year period through training in fashion design and tailoring.\nThey were all given start-up tailoring equipment and kits donated by INTELS to kick-start their fashion businesses.\nAn excited Praise-Jah Ufot, who also received an industrial sewing machine in additional to other tailoring items, commended INTELS for “positively changing” her life and the lives of other beneficiaries of the empowerment scheme."
  },
  {
    "headline": "Reno Omokri provides more information about Abba Kyari’s involvement with Hushpuppi",
    "summarized_story": "Reno Omokri, a former aide to ex-President Goodluck Jonathan, has provided more information about Deputy Commissioner of Police Abba Kyari’s link to international fraudster Ramon Abbas, also known as Hushpuppi.\nAs widely reported in Nigeria and beyond, Hushpuppi was arrested in Dubai over a year ago and pleaded guilty to fraud in the U.S. earlier this week.\nThe FBI said Hushpuppi and Kyari have been friends and were both involved in a conspiracy to launder money.\nThe deputy commissioner of police was also indicted of receiving bribes from Hushpuppi to arrest a member of the syndicate in Nigeria.\nReacting to the news, Omokri, via his Twitter handle on Friday, said it would be difficult for Kyari to deny the FBI charges."
  },
  {
    "headline": "Banditry, kidnapping: Ganduje approves N160m for police station, barracks at Kano border town",
    "summarized_story": "Following recent reports of infiltration of some suspected persons from Katsina, Zamfara and other areas notorious for banditry to Kano border communities, the Kano State Government has approved the construction of a N160million fully equipped police barracks, station at Getso town, Gwarzo Local Government Area of the state.\nIn his remarks, the Commissioner of Works who was represented by his Assistant Director, Engr.\nBello Sule, reiterated the government’s commitment towards infrastructural development to promote rural areas in the state.\nHe assured the quality of the project adding that the ministry will give adequate attention to the projects with a view to execute quality and timely work.\nGetso described Getso community as a historic political area which has been contributing to the economic wellbeing of Kano."
  },
  {
    "headline": "Taraba residents groan over bad roads, drainages in capital city",
    "summarized_story": "Vehicular movement in Jalingo, the capital of Taraba, is no doubt presently becoming cumbersome due to absence of motorable roads and drainage.\nA cross section of the residents, who spoke with DAILY POST today in Jalingo metropolis, said the situation has made it impossible for them to ply the various roads leading to their houses.\nThe residents, who cited Gombe State that was created after Taraba as an example, said tarred roads and drainages are lucidly absent in most parts of their city.\nMore to the displeasure of Jalingo residents is the absence of street lights, a situation which they believe often make it possible for hoodlums to carry out their attacks uninterrupted.\nA visit to the premises of the Taraba State Road Maintenance Agency, indicated that like the Jalingo residents, it also needs infrastructural attention."
  },
  {
    "headline": "Nnamdi Kanu seeks speedy trial of treasonable felony charges despite court vacation",
    "summarized_story": "Nnamdi Kanu, leader of the proscribed Indigenous Peoples of Biafra (IPOB), has formally applied for speedy trial of the treasonable felony charges brought against him by the Nigerian government.\nDAILY POST gathered that Kanu’s action may not be unconnected with his wish to be moved out of the detention facility of the Department of the State Service DSS after an order by trial judge, Justice Binta Nyako.\nDependable government officials told our correspondent that there was nothing urgent in the charges to warrant the federal government seeking the prosecution of the defendant during court vacation.\nDAILY POST was also told that the justice ministry has opted to be meticulous and follow sequence order in the trial rather than disrupting the vacation calendar of the court.\nThe Federal Government counsel, Mr Mrohammed Abubakar, of the Federal Ministry of Justice could not be reached for comments on the issue."
  },
  {
    "headline": "APC ward congress: Group accuses Oyetola, state chairman of shielding national officials",
    "summarized_story": "Governor Adegboyega Oyetola of Osun State and the All Progressives Congress (APC) Chairman in the state, Adegboyega Famodun, have been accused of shielding officials who had come to the state to sell forms to aspirants in the Saturday July 31, 2021 ward congress from the party’s National Secretariat.\nAccording to the group, the officials led by one Abdullahi had arrived at Osogbo on Saturday and were quartered at the Government House.\nThey also alleged that the officials were hindered from meeting with other party members including the Secretary, Alhaji Rasaq Salinsile.\n“The Governor has hijacked the forms and other materials meant for the congress for his political group, IleriOluwa,” the statement said.\nHe advised party members to shun unnecessary divisions since the governor has done much for the party and the state in general."
  },
  {
    "headline": "Commission’s relief for North’s six submerged states",
    "summarized_story": "The commission stated that some communities in these states had suffered from the devastating effect of flooding, especially from Shiroro and Kainji dams, leading to the loss of lives and properties.\nHe said: “Niger State is host to Shiroro and Kainji dams.\nManaging Director of the commission, Abubakar Yelwa said HYPPADEC will soon start providing succour to communities in the affected states following the approval of its budget by the National Assembly.\nHe added that the commission would start delivering meaningful projects once it finishes its needs assessment.\nHe said: “We had familiarisation tour to the states to give us an insight into the reconnaissance position of the communities."
  },
  {
    "headline": "N50 Million in 6 months from FOOTBALL Trading starting with N100,000 capital?",
    "summarized_story": "The reason he called his approach FOOTBALL TRADING and not football betting.\nThe strategy is to stake 5% of capital daily and as winnings comes and capital increases, recalculate capital and new 5% daily stake.\nJanuary 2021 ended at N235,000.\nMonth Returns May 2021 170% April 2021 406% March 2021 150% February 2021 263% January 2021 235% December 2020 241% November 2020 562%That’s the break down above.\nJanuary 2021, if N1,354,000 was used as the capital and a 235% return for that month, it means return would be N3,182,000."
  },
  {
    "headline": "How To Detect Scam Gift Cards Platforms in Nigeria",
    "summarized_story": "A gift scam exchange will get your gift card details and not remit payment.\nHOW TO IDENTIFY AND AVOID SCAM GIFT CARD PLATFORMScammers won’t necessarily create a dedicated website for their escapades.\nConfirm the Contact Details Are FunctionalWhen you find a new website you are interested in, ensure that you check their contact details.\nIf, however, you are in a hurry and want instant cash from your gift card, go to platforms like Gift Cards Hub.\nOn Gift Card Hub, you can securely trade whatever gift card you are interested in, at the best rate, without risk of scam."
  },
  {
    "headline": "Jonathan to attend Olu of Warri's coronation",
    "summarized_story": "Our ReporterFormer President Dr. Goodluck Jonathan has sent a congratulatory message to the Olu designate of the Warri Kingdom, Prince Tsola Emiko.\nThe former President also accepted the invitation to attend the coronation ceremony.\nHis congratulatory brimmed with eloquent praise and hope for the future of the people of the Warri Kingdom.\nThe former President also indicated his intention to honor the invitation to the royal coronation to be held on the 21st of August 2021 in Warri.\nPrince Tsola Emiko was chosen by the Ginuwa Ruling house and Warri Council of Chiefs and his people to become the 21st Olu of Warri, his coronation will take place on the August 21."
  },
  {
    "headline": "2020 Olympics: Disqualified Team Nigeria’s athletes protest in Tokyo",
    "summarized_story": "By Bunmi OgunyaleTeam Nigeria camp at the ongoing Tokyo 2020 Olympics is in disarray as athletes are protesting over their disqualification from the Games.\nCompetent source in Tokyo hinted that the athletes, in a peace protest, were sighted in the Games Village with placards to express their grievances.\nThe placards on display have various inscriptions such as; ”All we want to do is to compete.\n“Why should we suffer because of somebody else’s negligence.”Recalled that 10 Nigerian athletes were disqualified from participating in Tokyo due to the Sports federations failure to adhere to the mandatory pre-Olympics conditions.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "JUST IN: New Defence spokesman, Gen Sawyer, assumes duty",
    "summarized_story": "Molly Kilete, AbujaThe newly appointed Director Defence Information(DDI), Major General Benjamin Sawyer has formally assumed office with an appeal to the media to support the military in tackling the security challenges bedeviling the nation.\nSawyer has also promised to run an open door policy to fast track information needed by journalists to carry out their reportage.\nSawyer was handed over the battle of leadership of the directorate by the acting director Air Commodore Maigida, who appealed to the media to support the new director.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Alleged $1.1m bribe: US court orders Abba Kyari’s arrest",
    "summarized_story": "The FBI said Hushpuppi and Kyari, both of whom it alleged had been friends, conspired to launder money.\nThe FBI also indicted Kyari for allegedly receiving bribes from Hushpuppi to arrest a member of the syndicate in Nigeria.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him.\nVincent is alive, he can be contacted.”•IGP orders his probeInspector General of Police(IGP), Usman Alkali Baba, has ordered an investigation into the alleged indictment by the Federal Bureau of Investigation (FBI), against Abba Kyari.\n“Moreover, if this Abba Kyari matter is not well handled, it will be a permanent stain on the reputation of our police, security system and our nation at large,” the PDP said."
  },
  {
    "headline": "2023: Nigerians waiting for PDP to return –Atiku",
    "summarized_story": "Former Vice President Atiku Abubakar, yesterday, decried the poor management of the economy and rising insecurity across states, saying Nigerians are eagerly awaiting the take over of power at the federal level by the Peoples Democratic Party (PDP) in 2023.\nAtiku stated this in an interview with journalists at Rivers State Government House, Port Harcourt, after a meeting with Governor Nyesom Wike.\nHe said his visit to Port Harcourt was to hold discussions with the Rivers governor on how to strengthen the PDP ahead of the 2023 poll.\nI am 70 years plus, I have never seen it this bad in terms of security challenges, in terms of economy, in terms of unemployment.\nThere is no doubt about that in terms of projects, youths and employment, in terms of security."
  },
  {
    "headline": "DSS fails to produce Igboho’s aides in Court",
    "summarized_story": "From Godwin Tsa, AbujaThe Department of State Services (DSS), yesterday, flauted the order of the Federal High Court as it failed to produce 12 of Sunday Igboho’s aides held in their custody.\nHe further ordered the DSS to appear before the court to show why the applicants should not be released unconditionally.\nResponding, Olajeingbesi urged the court to sanction the DSS for disrespecting its lawful order to produce the detainees in court.\nHe faulted the detention order tendered by DSS, adding that the order was not certified as required by law for public documents.\nHe, accordingly, adjourned till August 2 for the DSS to produce the applicants in court."
  },
  {
    "headline": "BREAKING: FBI Agents In Second Meeting This Week With Nigeria's Police IG To Demand Abba Kyari's Arrest, Extradition",
    "summarized_story": "He said, \"FBI agents met with the IGP yesterday (Thursday) to demand Abba Kyari's arrest and extradition to the United States citing the urgency of the case.\nFour FBI agents returned to the IG’s office this morning, they are there asking the IGP to release Kyari for interrogation.\"\nSaharaReporters earlier reported that the United States' Court had issued a warrant of arrest for Kyari, over his role in Hushpuppi’s multi-million naira fraud probe.\nAmerican prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "BREAKING: FBI Agents In Second Meeting This Week With Nigeria's Police IG To Demand Abba Kyari's Arrest, Extradition",
    "summarized_story": "He said, \"FBI agents met with the IGP yesterday (Thursday) to demand Abba Kyari's arrest and extradition to the United States citing the urgency of the case.\nFour FBI agents returned to the IG’s office this morning, they are there asking the IGP to release Kyari for interrogation.\"\nSaharaReporters earlier reported that the United States' Court had issued a warrant of arrest for Kyari, over his role in Hushpuppi’s multi-million naira fraud probe.\nAmerican prosecutors first sought a court warrant to arrest Kyari on February 12, 2021.\nJudge Wright’s permission for the FBI to arrest Mr Kyari and hold him in U.S. custody was unsealed on July 26."
  },
  {
    "headline": "BUSTED: Multi-million Naira UK Schools Buhari’s Children Attended While He ‘Couldn’t Afford’ Presidential Nomination Form",
    "summarized_story": "Fatima Buhari, who was born on March 7, 1975, got a postgraduate degree from Business Academy, Stratford, United Kingdom.\nSafinatu Buhari, born on October 13, 1983, also had her education at Essence International School and Cobham Hall, Kent, United Kingdom.\nShe furthered her studies at the University of Plymouth, United Kingdom, and at Arden University, United Kingdom.\nHalima who was born on October 8, 1990, schooled at the International School, Kaduna, the British School of Lome, and Bellerby’s College, Brighton, United Kingdom.\nShe also attended the University of Leicester, United Kingdom before bagging a degree from Nigeria Law School, Lagos."
  },
  {
    "headline": "BUSTED: Multi-million Naira UK Schools Buhari’s Children Attended While He ‘Couldn’t Afford’ Presidential Nomination Form",
    "summarized_story": "Fatima Buhari, who was born on March 7, 1975, got a postgraduate degree from Business Academy, Stratford, United Kingdom.\nSafinatu Buhari, born on October 13, 1983, also had her education at Essence International School and Cobham Hall, Kent, United Kingdom.\nShe furthered her studies at the University of Plymouth, United Kingdom, and at Arden University, United Kingdom.\nHalima who was born on October 8, 1990, schooled at the International School, Kaduna, the British School of Lome, and Bellerby’s College, Brighton, United Kingdom.\nShe also attended the University of Leicester, United Kingdom before bagging a degree from Nigeria Law School, Lagos."
  },
  {
    "headline": "BUSTED: Multi-million Naira UK Schools Buhari’s Children Attended While He ‘Couldn’t Afford’ Presidential Nomination Form",
    "summarized_story": "Fatima Buhari, who was born on March 7, 1975, got a postgraduate degree from Business Academy, Stratford, United Kingdom.\nSafinatu Buhari, born on October 13, 1983, also had her education at Essence International School and Cobham Hall, Kent, United Kingdom.\nShe furthered her studies at the University of Plymouth, United Kingdom, and at Arden University, United Kingdom.\nHalima who was born on October 8, 1990, schooled at the International School, Kaduna, the British School of Lome, and Bellerby’s College, Brighton, United Kingdom.\nShe also attended the University of Leicester, United Kingdom before bagging a degree from Nigeria Law School, Lagos."
  },
  {
    "headline": "Lagos to build more isolation centres as COVID infections surge",
    "summarized_story": "The Lagos state government says it is creating more isolation centres to address rising cases of COVID-19.\nAdvertisementBabajide Sanwo-Olu, governor of Lagos, disclosed this at the unveiling of MED-IN Pharmaceuticals Intravenous Fluid Factory in Ogun state on Thursday.\nOn Thursday, the Nigeria Centre for Disease Control (NCDC) announced 558 fresh COVID infections.\nAdvertisementSanwo-Olu, who was represented by Akin Abayomi, commissioner for health, said the state is “under severe stress and strain” by the third wave of the infection.\n“Let me remind everybody that in Lagos we are under severe stress and strain of the third wave."
  },
  {
    "headline": "Lagos to build more isolation centres as COVID infections surge",
    "summarized_story": "The Lagos state government says it is creating more isolation centres to address rising cases of COVID-19.\nAdvertisementBabajide Sanwo-Olu, governor of Lagos, disclosed this at the unveiling of MED-IN Pharmaceuticals Intravenous Fluid Factory in Ogun state on Thursday.\nOn Thursday, the Nigeria Centre for Disease Control (NCDC) announced 558 fresh COVID infections.\nAdvertisementSanwo-Olu, who was represented by Akin Abayomi, commissioner for health, said the state is “under severe stress and strain” by the third wave of the infection.\n“Let me remind everybody that in Lagos we are under severe stress and strain of the third wave."
  },
  {
    "headline": "1999 constitution doesn't bar a governor from being party chairman, says Omo-Agege",
    "summarized_story": "Ovie Omo-Agege, deputy president of the senate, says Mai Mala Buni, governor of Yobe, can remain as chairman of the All Progressives Congress (APC) caretaker committee despite contrary positions.\nAdvertisementThe supreme court had in a split judgment on Wednesday, affirmed the election of Rotimi Akeredolu as Ondo governor.\nHe asked the party to sack Buni and anyone holding any executive position on the committee.\n“It does not by any scintilla of imagination, render the appointment of governor Buni as APC caretaker committee chairman incompetent and will not in any way, affect the legality or competence of the APC scheduled congresses,” he said.\nHe said: “Can it be said that a state governor who is the chairman of the governors’ forum of Nigeria is occupying an “executive office”?"
  },
  {
    "headline": "1999 constitution doesn't bar a governor from being party chairman, says Omo-Agege",
    "summarized_story": "Ovie Omo-Agege, deputy president of the senate, says Mai Mala Buni, governor of Yobe, can remain as chairman of the All Progressives Congress (APC) caretaker committee despite contrary positions.\nAdvertisementThe supreme court had in a split judgment on Wednesday, affirmed the election of Rotimi Akeredolu as Ondo governor.\nHe asked the party to sack Buni and anyone holding any executive position on the committee.\n“It does not by any scintilla of imagination, render the appointment of governor Buni as APC caretaker committee chairman incompetent and will not in any way, affect the legality or competence of the APC scheduled congresses,” he said.\nHe said: “Can it be said that a state governor who is the chairman of the governors’ forum of Nigeria is occupying an “executive office”?"
  },
  {
    "headline": "In 2003, south-east voted for Obasanjo against Ojukwu -- why?",
    "summarized_story": "In the 2003 presidential election in which Ojukwu, the famed Igbo leader, vied, the south-east voted tremendously for his rival – Olusegun Obasanjo of the Peoples Democratic Party (PDP).\nIn Abia, Obasanjo had 386,748 votes (51.7 percent) while Ojukwu had 260,899 votes (34.9 percent).\nAnd in Imo, Obasanjo polled 656,861 votes (64.6 percent), but Ojukwu had 281,114 votes (27.7 percent).\nIn a 2017 broadcast, President Buhari revealed his conversation with the late Ojukwu on Nigeria.\nOjukwu’s victory is the personal example he showed by participating in elections and chaperoning a political party — APGA — long after the war."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "Here’s why PiggyVest acquired VFD-owned Savi",
    "summarized_story": "The Nigeria-based wealth management app giant announced in a Medium post that it has acquired a smaller competitor Savi.ng.\nUnder the deal, all existing Savi.ng users will be automatically migrated to Piggyvest.\n“It’s more of a team acquisition,” PiggyVest co-founder, Joshua Chibueze, explained to TechCabal over a call.\nThe team behind Savi are reputed to have solid expertise in finance and are savvy with financial tools.\nPiggyVest did let TechCabal know that there are more acquisition announcements to come in the year."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Who puts out your IT fires when you’ve deleted an entire file from the company’s servers?",
    "summarized_story": "Share this article:Recently, the job of a system administrator — sometimes called a sysadmin or system admin — had begun to fascinate me.\nMy first experience with system administrators was with the technical support staff in the ICTU/CRPU unit of the University of Benin.\nAdvertisementWho are System Administrators?\nSystem Administrators troubleshoot all day, every day.\nHowever, according to Olusegun Balogun, an IT Support Specialist, you don’t necessarily have to have those degrees to become a system administrator."
  },
  {
    "headline": "How LoftyInc Capital invests, Dyslexia and assistive technology, Google’s app update",
    "summarized_story": "How LoftyInc Capital Management invests in Capital investsLoftyInc Capital Management Management Partners.\nThey are all LoftyInc Capital Management (LCM) portfolio companies, one of the oldest venture capital firms in Nigeria.\nThis is an excellent time to revisit it: The unique case of Africans with learning disabilities and assistive technology.\nGoogle has announced a new policy update on the Android Play Store to support user control, privacy, and security, beginning September 1, 2021.\nGoogle claims that with its User Data Policy update, it will be illegal to link persistent device identifiers to personal and sensitive user data or resettable device identifiers unless for pre-approved use cases."
  },
  {
    "headline": "Two souls in one body — a look at friendships in the digital age",
    "summarized_story": "From pen friends in ancient times to cloud friendships of this day and age, solid friendships have always relied on one medium or the other for communication, interaction, and exchange of information.\nFormerly known as ‘World Friendship Day’, the United Nations (UN) in 2011 declared July 30 as the ‘International Day of Friendship’ to celebrate the role that friendship plays in promoting peace across different cultures and backgrounds.\nBut, in this age of constantly evolving technology, the concept of friendship has endured the dynamism of this world.\nTo celebrate this day, Techpoint Africa had a sit-down with varying groups of friends of the same age brackets.\nAnd we hope, like us, you’re reminded that Aristotle’s comparison of friendship to two souls in one body is beyond a saying!"
  },
  {
    "headline": "Five ways to make money using your smartphone",
    "summarized_story": "Five ways to make money using your smartphoneSmartphones are getting more sophisticated with in-built cameras that could rival most traditional cameras.\nStorage has also been getting a lot of attention.\nIn the 2019-2020 period, nearly half of Huawei’s and Apple’s smartphone shipments came from their 128GB and 64GB variants, respectively.\nIn the same period, Huawei’s and Apple’s 128GB variants experienced a yearly…"
  },
  {
    "headline": "Nigeria’s recovery from pandemic is on but there’s one problem",
    "summarized_story": "Nigeria’s recovery from pandemic is on but there’s one problemNigeria’s near-term economic growth is made more uncertain by high inflation which is affecting business sentiments and consumer purchasing power.\nThe Nigerian economy is expected to grow by 1.5 percent in 2021 as the impact of the lockdown in 2020 fades but high inflation could thwart economic recovery, according to a report by the Economist…"
  },
  {
    "headline": "Insecurity to keep food prices surging",
    "summarized_story": "Food prices in Africa’s most populous nation are to keep surging as naira – the country’s currency – has weakened to a three-year low in the parallel market, compounding the challenge of worsening insecurity, which already affects local food production.\nThis was the view of experts who spoke at the 2021 edition of BusinessDay’s Agribusiness…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki unveils plan to make Edo one of Africa’s top 20 economies, rallies United Nations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has unveiled the Making Edo Great Again (MEGA) vision to the United Nations Country Team (UNCT) in Nigeria, outlining the government’s audacious plan to make Edo State one of the 20 top economies in terms of Gross Domestic Product (GDP) in Africa by 2050.\nThe governor, in a presentation titled, ‘The Edo Vision: From Who We Are To Where We Want To Be by 2050’, at the United Nations House, Abuja, noted that the state is harnessing its human and natural resources to place it as a leading destination for investment in Nigeria.\nHe added: “With an estimated population of 10 million residents by 2050, our educational system must be the best in Nigeria and we should boast of one of the best workforce on the continent.\n“This will be achieved through rigorous planning in regional and urban planning, which will point to and emphasize what we must do to attain double-digit growth over the next three decades, and socio-economic master plans to complement the physical master plans.\n“The government will ensure the sustenance of its massive investment in infrastructure to take advantage of the location of Edo."
  },
  {
    "headline": "Obaseki charges citizens on civic duties, obedience to state’s laws – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged citizens to continue to obey laid down laws and regulations, and contribute their quota towards the development of the state.\nObaseki made the call when he received the executive members of the Police Officers Wives Association (POWA), Edo State Chapter, who were on a courtesy visit at the Government House, Benin City.\nObaseki, represented by his Chief of Staff, Hon.\nOsaigbovo Iyoha, noted that in running an open and transparent government, his administration will continue to maintain law and order in the state.\nAccording to him, “The Edo State Government, in all its dealings, is transparent, accountable and open, and will never witch hunt anyone."
  },
  {
    "headline": "PRESCO PLC Holds AGM, Shoots Up Revenue Profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Against the backdrop of the collapse in oil prices coupled with the COVID-19 pandemic, rising inflation, unemployment, infrastructure deficit, among others, PRESCO PLC shot up its revenue profile to N23.89 billion for the year 2020.\nThe highpoint of the AGM was the declaration and approval of a dividend of 200 kobo per share with N2,000,000,000 (Two billion naira only) set aside for shareholders subject to withholding tax.\nIn the Chairman’s statement, the revenue of N23.89 billion, represented a 21 percent increase on N19.72 billion of 2019.\nAccording to him, 52,178 tons of crude and refined products were sold during the year under review and 50,335 tons in 2019 with Fresh Fruit Bunches (FFB) harvest being 214,872 tons while in 2019 it was 200, 163 tons.\nThe Chairman, however observed that while the year under review had been of significant challenges, they were happy that the fundamentals of the company’s business remained strong which enabled them to achieve improved operational and financial results."
  },
  {
    "headline": "Supreme Court Judgment On Akeredolu Vindicated Me Why APC Will Lose Anambra And Others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn June I wrote an article to warn APC that it will lose Anambra, Ekiti and Osun elections.\nIf APC conducts its primaries for Ekiti-2022 and Osun-2022 elections, it will lose because caretaker committee is strange to APC constitution.\nAPC constitution does not recognize caretaker committee talk less of their activities.\nThe practice of democracy in Osun APC is today a mockery to democratic principles.\nMy attention has been drawn to a purported suspension Kolapo Alimi by the APC caretaker committee in Osun State, Elerin, ward 9, Irepodun South LCDA, Erin-Osun, State of Osun."
  },
  {
    "headline": "Chimamanda Adichie speaks at South African university after boycott balls from Students’ Council",
    "summarized_story": "ADVERTISEMENTJohannesburg — On July 28 internationally acclaimed Nigerian author and renowned feminist, Chimamanda Ngozi Adichie presented the second University of Cape Town (UCT) Vice-Chancellor’s Open Lecture titled The Idolatry of Theory: A Defense of Storytelling.\nBut the university’s Students’ Representative Council (SRC) held a parallel lecture to boycott Ngozi Adichie, whom they accused of transphobia, with guest speaker Dr Anastacia Tomson who spoke on “the dangers of sectional feminism in the context of trans women”.\nThey boycotted Ngozi Adichie’s lecture because of an interview with BBC in 2017, where she said “trans women are trans women” in response to a question about whether she considers trans women as real women.\nAccording to News24, UCT viewed the lecture as an opportunity for debate and different perspectives on the same issue.\nLorde @TshepiMamashela The rainbow flag in the Twitter name and CNA as a guest speaker will never make sense."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "BEDC decries vandalism in franchise areas",
    "summarized_story": "BEDC Electricity Plc (BEDC), has decried the rising cases of vandalism across its franchise zone which it says aside being an economic crime is an act of sabotage against the good purpose and intents of the company, canvassing that the effects of vandalism should stimulate tougher laws to be enforced to protect public property, especially electricity infrastructure.\n‘’The recent surge in cases of vandalism within our franchise area calls for greater attention.\nAs a company, we see these as acts of economic sabotage against the good intents of BEDC,” he remarked.\nOn 3rd July 2021, a 2.5MVA, 33/11KV Injection Substation at Igarra near Auchi, in Edo state was vandalized while RUM, upriser cables, incomer cables etc.\nThey were reportedly charged to Ogwuashi-Uku Magistrate Court on early this month and remanded at Ogwuashi-Uku Correctional Center Ogwuashi-Uku."
  },
  {
    "headline": "Osun PDP: The Long Walk to Justice, By Dr. Longe Oyeleye",
    "summarized_story": "The Adeleke Group in their sheer ignorance went into wreck jubilation, without realizing that what they got was a judicial mirage that would soon evaporate.\nIt is very clear that it is the Adeleke Group that is trying to subvert the PDP and waste her chances at the polls.\nIt was the Adeleke Group, who forged signatures of SWC members to pass a vote of no confidence on Hon.\nIt was the Adeleke Group who made a spirited attempt to steal the case file from High Court 4, Osogbo.\nHead or tail, the Osun PDP is in deep shit!"
  },
  {
    "headline": "Osun PDP Chairmanship Tussle: Sunday Bisi hails High Court’s suspension of judgement till Appeal Court decides",
    "summarized_story": "Mr. Bisi stated this in a press briefing shortly after the judgment on Thursday at the party’s secretariat in Osogbo.\n“The intended distraction of dragging us to court in the first place is not an option for us.\n“Our practice since I took charge as chairman of this PDP is all about our people and the overriding interest of Osun State.\n“We have traversed the length and breadth of the state to reawake and reenergize structures and another support base for our party.\nIf there is going to be any change at all, it is our candidate becoming the next governor of Osun come next year."
  },
  {
    "headline": "NERC to fine DisCos to for wrongful disconnection",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC), says it is drafting laws that will enable it to penalise DisCos for wrongful disconnection of power supply to customers.\nAccording to the statement, penalties to DisCos for wrongful disconnection will range from N1,000 for residential buildings to N1500 for commercial and N2000 for Industrial.\n“A DisCo which disconnects a customer supply in violation of these regulators shall compensate the customer on equivalent of 100 per cent daily energy Cap for every day the wrongful disconnection lasts,” the statement said.\n“On the other hand, NERC has proposed that, in the case of undercharge from incorrect billing, the DisCos may establish the undercharge and recover the amount for not less than three months.\n“While the distribution licensee shall be responsible for the connection to the customer’s metering point."
  },
  {
    "headline": "COVID-19: Again, UAE Extends Travel Ban Against Nigeria, S’Africa",
    "summarized_story": "Emirates Airline has extended the suspension of its flights from Nigeria to the United Arab Emirates (UAE) to at least August 7.\nSuspension of flights from South Africa to UAE will also remain in place until the same date.\nThose who have travelled through South Africa and Nigeria in the last 14 days will not also be allowed on any Emirates flights heading to Dubai.\n“Customers who have been to or connected through South Africa or Nigeria in the last 14 days will not be permitted on any Emirates flights bound for Dubai,” the airline said.\nThe airline also extended the suspension of inbound passenger flights from India, Pakistan, Bangladesh and Sri Lanka to the UAE until at least August 7, 2021."
  },
  {
    "headline": "COVID-19: Again, UAE Extends Travel Ban Against Nigeria, S’Africa",
    "summarized_story": "Emirates Airline has extended the suspension of its flights from Nigeria to the United Arab Emirates (UAE) to at least August 7.\nSuspension of flights from South Africa to UAE will also remain in place until the same date.\nThose who have travelled through South Africa and Nigeria in the last 14 days will not also be allowed on any Emirates flights heading to Dubai.\n“Customers who have been to or connected through South Africa or Nigeria in the last 14 days will not be permitted on any Emirates flights bound for Dubai,” the airline said.\nThe airline also extended the suspension of inbound passenger flights from India, Pakistan, Bangladesh and Sri Lanka to the UAE until at least August 7, 2021."
  },
  {
    "headline": "Crush All Drug Cartels, Marwa Orders NDLEA Officers",
    "summarized_story": "BY EJIKE EJIKE, AbujaChairman/chief executive of the National Drug Law Enforcement Agency (NDLEA), Brig Gen Mohammed Buba Marwa (retd) has charged all the newly promoted officers and men of the anti-narcotic agency to go all out and crush drug cartels across Nigeria.\nHe gave the charge during a ceremony to decorate newly promoted Deputy Commanders General of Narcotics (DCGNs) and Assistant Commanders General of Narcotics (ACGNs).\nA total of 630 Superintendents of Narcotics were also moved to the next rank as Chief Superintendent of Narcotics; Deputy Superintendent of Narcotics to Superintendent of Narcotics- 41; Assistant Superintendent of Narcotics I to Superintendent of Narcotics -481; Assistant Superintendent of Narcotics I to Deputy Superintendent of Narcotics -157.\nOthers are Assistant Superintendent of Narcotics II to Assistant Superintendent of Narcotics I -12; Assistant Superintendent of Narcotics II to Deputy Superintendent of Narcotics -187; Chief Narcotic Agent to Assistant Superintendent of Narcotics I -119; Chief Narcotic Agent to Assistant Superintendent of Narcotics II -47; Senior Narcotic Agent to Chief Narcotic Agent – 1,006; Narcotic Agent to Chief Narcotic Agent – 4; Narcotic Agent to Senior Narcotic Agent -68; Narcotic Assistant I to Senior Narcotic Assistant -1 and Narcotic Assistant I to Narcotic Agent -78.\nGen. Marwa had on Thursday 17th June, 2021 approved the immediate promotion of 3,506 officers and men to their next ranks, thus breaking the jinx of long years of stagnation in the agency."
  },
  {
    "headline": "Crush All Drug Cartels, Marwa Orders NDLEA Officers",
    "summarized_story": "BY EJIKE EJIKE, AbujaChairman/chief executive of the National Drug Law Enforcement Agency (NDLEA), Brig Gen Mohammed Buba Marwa (retd) has charged all the newly promoted officers and men of the anti-narcotic agency to go all out and crush drug cartels across Nigeria.\nHe gave the charge during a ceremony to decorate newly promoted Deputy Commanders General of Narcotics (DCGNs) and Assistant Commanders General of Narcotics (ACGNs).\nA total of 630 Superintendents of Narcotics were also moved to the next rank as Chief Superintendent of Narcotics; Deputy Superintendent of Narcotics to Superintendent of Narcotics- 41; Assistant Superintendent of Narcotics I to Superintendent of Narcotics -481; Assistant Superintendent of Narcotics I to Deputy Superintendent of Narcotics -157.\nOthers are Assistant Superintendent of Narcotics II to Assistant Superintendent of Narcotics I -12; Assistant Superintendent of Narcotics II to Deputy Superintendent of Narcotics -187; Chief Narcotic Agent to Assistant Superintendent of Narcotics I -119; Chief Narcotic Agent to Assistant Superintendent of Narcotics II -47; Senior Narcotic Agent to Chief Narcotic Agent – 1,006; Narcotic Agent to Chief Narcotic Agent – 4; Narcotic Agent to Senior Narcotic Agent -68; Narcotic Assistant I to Senior Narcotic Assistant -1 and Narcotic Assistant I to Narcotic Agent -78.\nGen. Marwa had on Thursday 17th June, 2021 approved the immediate promotion of 3,506 officers and men to their next ranks, thus breaking the jinx of long years of stagnation in the agency."
  },
  {
    "headline": "Abe Faults Keyamo’s Position On Buni-led APC Exco",
    "summarized_story": "Former lawmaker representing Rivers South-East Senatorial District, Senator Magnus Abe, has picked holes in the position of the minister of state for Labour and Employment , Mr Festus Keyamo, on the Governor Mala Buni-led All Progressives Congress (APC) committee, saying the senior lawyer’s opinion will lead to “self-immolation’.\nIn a statement he signed yesterday, the board member of the Nigerian National Petroleum Corporation (NNPC) expressed surprise over Keyamo’s stance on the matter, especially his insistence that the APC must immediately halt all preparations for the forthcoming congresses and disband the planning committee.\nHe said Keyamo’s argument premised on his interpretation of the judgement of the Supreme Court in Jegede Vs Akeredolu was baseless since the defence of Buni, who is the National Caretaker/Extraordinary Convention Planning Committee (CECPC) of the APC was never heard.\nADVERTISEMENTAccording to Abe, most members of the APC accepted the reality of the CECPC as a decision of the National Executive Committee (NEC) of the party with President Muhammadu Buhari as leader of the party in attendance.\nAbe explained that ironically, Keyamo was one of the legal luminaries whose stand swayed the president in support of the CECPC option as the only means to save the party from imminent self-destruction at the time."
  },
  {
    "headline": "18,000 candidates to retake UTME on August 6",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has fixed Friday, August 6, 2021, for 18,000 candidates who missed the Unified Tertiary Matriculation Examination (UTME) to retake the examination.\nThe statement said the 18,000 candidates for the examination were being notified through text messages on their designated phone numbers and their JAMB profiles.\nIt directed the affected candidates to print fresh examination notification slips containing the venue and time of the examination from JAMB’s website from August 1.\n“About 18,000 candidates slated for the examination are being notified through both text messages on their designated phone numbers and their JAMB profiles.\nFew candidates who encountered peculiar biometric verification problem, or who failed biometric verification on the examination date (and were recaptured) but were not allowed to partake in the examination."
  },
  {
    "headline": "18,000 candidates to retake UTME on August 6",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has fixed Friday, August 6, 2021, for 18,000 candidates who missed the Unified Tertiary Matriculation Examination (UTME) to retake the examination.\nThe statement said the 18,000 candidates for the examination were being notified through text messages on their designated phone numbers and their JAMB profiles.\nIt directed the affected candidates to print fresh examination notification slips containing the venue and time of the examination from JAMB’s website from August 1.\n“About 18,000 candidates slated for the examination are being notified through both text messages on their designated phone numbers and their JAMB profiles.\nFew candidates who encountered peculiar biometric verification problem, or who failed biometric verification on the examination date (and were recaptured) but were not allowed to partake in the examination."
  },
  {
    "headline": "Anxiety as Cholera kills 169 Kano residents, 5,221 infected",
    "summarized_story": "NO fewer than 169 persons have been confirmed dead in Kano State following the outbreak of cholera that affected 41out of the 44 local government areas of the state.\nThe state Director of Public Health, Dr Ashiru Rajab, confirmed the number of death in a telephone interview with The PUNCH in Kano on Thursday.\nRajab said a total of 5,221 persons were affected with the disease, while about 4,860 had so far been treated and discharged.\nHe added that a total of 191 affected persons were currently receiving treatment in various health facilities across the state.\nCurrently, we have 191 active cases in different facilities across the state, while 169 deaths were recorded across 41 LGAs of the state,” he said."
  },
  {
    "headline": "Anxiety as Cholera kills 169 Kano residents, 5,221 infected",
    "summarized_story": "NO fewer than 169 persons have been confirmed dead in Kano State following the outbreak of cholera that affected 41out of the 44 local government areas of the state.\nThe state Director of Public Health, Dr Ashiru Rajab, confirmed the number of death in a telephone interview with The PUNCH in Kano on Thursday.\nRajab said a total of 5,221 persons were affected with the disease, while about 4,860 had so far been treated and discharged.\nHe added that a total of 191 affected persons were currently receiving treatment in various health facilities across the state.\nCurrently, we have 191 active cases in different facilities across the state, while 169 deaths were recorded across 41 LGAs of the state,” he said."
  },
  {
    "headline": "In 2003, south-east voted for Obasanjo against Ojukwu – why?",
    "summarized_story": "In the 2003 presidential election in which Ojukwu, the famed Igbo leader, vied, the south-east voted tremendously for his rival – Olusegun Obasanjo of the Peoples Democratic Party (PDP).\nIn Abia, Obasanjo had 386,748 votes (51.7 percent) while Ojukwu had 260,899 votes (34.9 percent).\nAnd in Imo, Obasanjo polled 656,861 votes (64.6 percent), but Ojukwu had 281,114 votes (27.7 percent).\nIn a 2017 broadcast, President Buhari revealed his conversation with the late Ojukwu on Nigeria.\nOjukwu’s victory is the personal example he showed by participating in elections and chaperoning a political party — APGA — long after the war."
  },
  {
    "headline": "Aruna Quadri: Minister Dare must address Nigerian athletes now",
    "summarized_story": "Team Nigeria’s captain at the Tokyo 2020 Olympics, Quadri Aruna, is not satisfied with the treatment of athletes at the Tokyo 2020 Olympic Games.\n“If the Minister of Youth and Sports Development, Sunday Dare, don’t come and address the athletes, these officials will spoil all the good things you (Dare) have been doing’’.\nNigeria’s Queen of the track, Blessing Okagbare, expressed her displeasure at sports administrators for the negligence of duty.\nThis is as 10 Nigerian athletes were declared ineligible to compete at the Games’ Track and Field event on Wednesday by the World Athletics for failing to comply with the out-of-competition tests.\n“They were busy fighting over power and exercising their pride over Puma contracts/kits forgetting their major responsibility (the athletes.)"
  },
  {
    "headline": "Abba Kyari caught on tape with Hushpuppi: Damning FBI evidence",
    "summarized_story": "The FBI has the damning phone conversations and WhatsApp exchanges between Hushpuppi and Nigeria’s supercop, Abba Kyari.\nThe tape is just too damning to extricate Abba Kyari as he is declared wanted by the FBI in connection with the $1.1 million scam.\n…On January 20, 2020, KYARI sent to ABBAS biographical, identifying information for CHIBUZO, along with a photograph of him.\nABBAS responded “Ok sir, tomorrow by noon,” indicating that he would make the payment to KYARI’s team by the next day.\nKYARI responded, “Ok bro [¶] We will also keep his phone and other gadgets for some weeks.”ABBAS responded, “Yes those ones they should not give him again, those ones are gone ."
  },
  {
    "headline": "BREAKING: Two Missing, Travelers Stranded As Bridge Collapses In Bauchi",
    "summarized_story": "Two women are said to have drowned after their vehicle was inundated following the collapse of a bridge at Kadan Maiwa, on the always-bustling Bauchi-Ningi-Kano highway.\nOther passengers who were in the car with them were also retrieved alive.\nThe bridge connects Bauchi to the state’s Ningi Local Government Area, as well as the states of Jigawa and Kano.\nAs a result, hundreds of vehicles and passengers are delayed since there is no access from Bauchi to Ningi LGA in Jigawa, Kano State, and vice versa.\nA flood that accompanied a downpour from Thursday night to Friday morning is also claimed to have killed around 250 animals."
  },
  {
    "headline": "Reno Omokri Reveals More Information About Abba Kyari’s Involvement With Hushpuppi",
    "summarized_story": "Reno Omokri, a former assistant to former President Goodluck Jonathan, has revealed new details about Deputy Commissioner of Police Abba Kyari’s connection to international fraudster Ramon Abbas, commonly known as Hushpuppi.\nHushpuppi and Kyari were buddies, according to the FBI, and were both involved in a money laundering scheme.\nHushpuppi bribed the deputy commissioner of police to arrest a member of the syndicate in Nigeria, according to the indictment.\nOmokri, who reacted to the news on Friday through Twitter, said it would be tough for Kyari to dispute the FBI charges.\n“It will be very hard for Abba Kyari to deny the charges in the FBI’s indictment."
  },
  {
    "headline": "Kaduna Files Fresh Charges Against Ibraheem El-Zakzaky",
    "summarized_story": "Following the discharge and acquittal of the leader of the Islamic Movement in Nigeria (IMN), Sheikh Ibraheem El-Zakzaky, and his wife, by the Kaduna State High Court, the state government has filed fresh charges against him.\nRecall that Justice Gideon Kurada of the Kaduna State High Court discharged and acquitted El-Zakzaky and his wife, Zeenat, of all charges leveled against them.\nAccording to Kurada, the charges against El-Zakzaky and his wife were not supposed to be filed, saying that the state government cannot arraign someone for a crime that was not an offence at the time.\nCounsel to the state government, Dari Bayero, explained that fresh charges have been filed against the IMN leader under the Treason and Treasonable Offences Act before a Federal High Court.\nHe explained that it was not in agreement with the reasoning and conclusion of Justice Kurada, saying that the government would appeal the case."
  },
  {
    "headline": "BREAKING: FBI Agents In Second Meeting This Week With Nigeria’s Police IG To Demand Abba Kyari’s Arrest, Extradition",
    "summarized_story": "Officials from the Federal Bureau of Investigation met with Inspector-General of Police (IGP) Usman Alkali Baba to urge that Deputy Commissioner of Police Abba Kyari be arrested and extradited to the United States, according to NEWS DIRECT.\nAccording to the source, the agents returned on Friday (today) to ensure that their requests be honored, citing the case’s importance.\nHe said, “FBI agents met with the IGP yesterday (Thursday) to demand Abba Kyari’s arrest and extradition to the United States citing the urgency of the case.\nThe force also declared that it is dedicated to pursuing justice and improving its professional relationship with the FBI and other international partners.\n“The Nigeria Police Force reaffirms its commitment to the pursuit of justice and the strengthening of its professional relationship with the FBI and other international partners."
  },
  {
    "headline": "Breaking: Again, Nigeria’s D’Tigresses lose Olympics basketball game in Tokyo",
    "summarized_story": "Nigeria’s women basketball team D’Tigresses on Friday lost their second game 87-62 versus France in the ongoing Olympic games in Tokyo Japan.\nThe Nigerian team had lost to USA during their first encounter at the gamesDetails loading…"
  },
  {
    "headline": "Hushpuppi: IGP orders review of Kyari’s indictment, PDP urges probe",
    "summarized_story": "The DCP also allegedly sent a bank account to Hushpuppi reportedly for the payment for Vincent’s arrest and imprisonment.\nAccording to the indictment, “Abbas was assisted in laundering the proceeds of the fraud by Rukayat Motunraya Fashola, a.k.a.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\n“Nobody demanded for a kobo from Abbas Hushpuppi.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "Breaking: History as Nigeria’s Blessing Okagbare, Grace Nwokocha storm 100m semi-final at Tokyo Olympics",
    "summarized_story": "For the first time since 2012, two Nigerian athletes will be running in the semifinals of the women’s 100m after Blessing Okagbare and Nzubechi Grace Nwokocha qualified from their respective heats Friday in Tokyo, Japan.\nNwokocha had to run a new personal best of 11.00 seconds to secure her qualification to the semifinals in her debut at the Games.\nWhile Nwokocha qualified for her first semifinal, Okagbare will be running in her third since she made her debut in the event at the 2012 Olympics in London.\nThe 32-year-old ran 11.05 seconds to win her first round heat.\nThe 2008 Beijing Olympics Long Jump silver medallist will be in action at exactly 11.15 am Nigerian time on Saturday."
  },
  {
    "headline": "Abba Kyrai: PDP demands full investigation -NigPilot",
    "summarized_story": "Peoples Democratic Party, PDP , has demanded a forensic investigation into reports that the United States (US) Federal Bureau of Investigation (FBI) has linked the head of IGP Intelligence Response Team, DCP Abba Kyari, to the international fraudster, Abbas Ramon, popularly known as Hushpuppi.\nAccording to the party, the revelation of the involvement of Kyari, the head of Nigeria’s intelligence response unit, as a receiver of proceeds of international fraud is worrisome, disturbing, and a stain on the integrity of our nation.\n“Our party demands that the APC administration should not sweep this matter under the carpet, given the manifest rapport between Kyari and some top APC leaders.\nWe urge President Buhari not to “ease out” this case of corruption, but should immediately restore the integrity and image of our nation by allowing for a forensic investigation on the suspect.\n“Moreover, if this Abba Kyari matter is not well handled, it will be a permanent stain on the reputation of our police, security system, and our nation at large.”The PDP asked President Buhari to direct the Inspector General of Police to take in Abba Kyari for questioning and if found culpable, he should be handed over to the FBI."
  },
  {
    "headline": "UK global Education summit Photo Op-NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIn accordance with THE LAW, the material on this Website is included for informational and educational purposes.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Akeredolu’s Supreme Court Victory, A Legal Seal On Popular Choice Of The People-Fayemi -NigPilot",
    "summarized_story": "Ekiti State Governor, Dr. Kayode Fayemi , has congratulated his Ondo State counterpart, Arakunrin Oluwarotimi Akeredolu (SAN) on the affirmation of his election by the Supreme Court.\nGovernor Fayemi in a statement by his Chief Press Secretary, Yinka Oyebode, said the apex court in the land has put a legal seal on the popular choice made by the people of Ondo State at the October 10, 2020 election.\n” This is a great news not only for my brother Governor Akeredolu and our party, the All Progressives Congress ( APC), it is victory for democracy.\nI congratulate Govermor Akeredolu and the people of Ondo State for the atmosphere of peace that reigned throughout the period of the judicial process.\nOn behalf of the government and people of Ekiti State I congratulate Governor Akeredolu, the government and people of Ondo State and wish the governor a successful tenure’ he added."
  },
  {
    "headline": "Tenure elongation: CSO calls for respect of Public Service Rules -NigPilot",
    "summarized_story": "The group under the umbrella of the Civil Society Network for Good Governance has called for the respect of Public Service Rules, citing the continuous stay in office of the Accountant General of the Federation, AGFIn a press conference held on Thursday in Abuja, the group’s National President, Barr.\nAdefila Kamal decried that the AGF who ought to have “relinquished his position” was “unilaterally” given a tenure elongation.\nThe group worried that “rampaging corruption” has characterized Nigeria’s public service, adding that laws are manipulated by people in positions of authority.\n“It is the informed position of our organization that there is no guise under which clearly stipulated provisions of our laws should be bent to serve personal interests in institutions owned by the collective powers of Nigerians.\n“The sitting Accountant General of the Federation is a classic case in point of this ill-advised practice of unilaterally subverting the interests of all Nigerians to serve sectional interests."
  },
  {
    "headline": "BREAKING: Kaduna Govt Files Fresh Charges Against El-Zakzaky",
    "summarized_story": "The Kaduna State government has filed fresh charges against the leader of the Islamic Movement in Nigeria, Sheikh Ibrahim El-Zakzaky.\nThis comes less than 48 hours after the embattled IMN leader was discharged and acquitted by a Kaduna State high court.\nHowever, not satisfied with the ruling, the state government on Thursday filed a fresh seven charges against the IMN leader at the Federal High Court.\nHe further explained that some of the actions of the IMN leader upon which he is being charged with fresh allegations, dated back before 2015.\nBayero added that with the fresh charges, the court will consequently issue an order for the arrest of Elzakzaky for him to answer the charges."
  },
  {
    "headline": "JUST IN: Court Sacks Odey, Declares Agom As Senator For Cross River North",
    "summarized_story": "The Court of Appeal sitting in Calabar has declared Mr Jarigbe Agom as the duly elected Senator for Cross River North.\nA three-man panel of justices, led by Justice Chioma Nwosu-Iheme, made the declaration in a ruling on Friday in the Cross River State capital.\nBy the decision, the appellate court sacked Senator Stephen Odey who represents the senatorial district in the National Assembly.\nIt declared Jarigbe as the lawful candidate of the Peoples Democratic Party (PDP) in the Cross River North senatorial district by-election conducted by the Independent National Electoral Commission (INEC) on December 5, 2020.\nThe court also invalidated the Certificate of Return earlier issued to Senator Odey by INEC and directed the electoral empire to withdraw it."
  },
  {
    "headline": "Nigeria Records Highest Daily COVID-19 Cases In Almost Five Months",
    "summarized_story": "The figure was reported by the Nigeria Centre for Disease Control (NCDC) in its latest update on the outbreak of the disease in the country.\nData from the NCDC – the Federal Government agency responsible for the control of disease outbreaks – revealed that the figure reported on July 29 was the highest in almost five months.\nThe last time Nigeria reported a daily figure higher than 558 was on March 4, 2021, when a total of 708 cases were confirmed.\nAmid fears that the country was already slipping into the third wave of the pandemic, Lagos State reported 376 new infections.\nAs Nigeria’s confirmed cases continue to rise with fears and panic from citizens, authorities have yet to officially declare a third wave of the pandemic."
  },
  {
    "headline": "Hushpuppi: IGP Orders Review Of Allegations Against Abba Kyari",
    "summarized_story": "The Inspector-General of Police, Usman Baba, has ordered an “internal review of the allegations” against a Deputy Commissioner of Police, Abba Kyari, by a United States Court.\nKyari also allegedly sent Hushpuppi bank account details for an account into which Hushpuppi could deposit payment for Vincent’s arrest and imprisonment.\nMr Kyari, in a Facebook post on Thursday, denied the allegations.\n“Nobody demanded a kobo from Abbas Hushpuppi,” Mr Kyari said.\nThe clothes “were brought to our office and he sent somebody to collect them in our office,” Mr Kyari said."
  },
  {
    "headline": "Buni’s Appointment As APC Chair Does Not Violate 1999 Constitution, Says Omo-Agege",
    "summarized_story": "Senator Omo-Agege, who represents Delta State Central senatorial district and doubles as the Deputy President of the Senate, believes the law does not forbid a sitting governor from holding another position.\nThis was in reaction to the controversy over the appointment of Yobe State Governor, Mai Mala Buni, as the Chairman of the National Caretaker Committee of the All Progressives Congress (APC).\nOn Wednesday, the Supreme Court affirmed Governor Rotimi Akeredolu of the APC as the winner of the October 2020 governorship election in Ondo State.\nThe appellants had asked the court to sack Governor Akeredolu, saying his nomination form was signed by a sitting governor.\nBut in his legal opinion as a lawyer, Senator Omo-Agege disagreed with the position of the opposition party."
  },
  {
    "headline": "Djokovic loses bid for Golden slam in Tokyo semi finals",
    "summarized_story": "Novak Djokovic’s search for a historic ‘Golden Slam’ has come to an after his loss to Alexander Zverev at Tokyo 2020.\nHe was bidding to become the first men’s player to win a ‘Golden Slam’ — consisting of four grand slams and an Olympic gold medal in the same calendar year.\nAfter the match, Zverev explained what he and Djokovic said as the pair embraced at the net.\n“I told him that he’s the greatest of all time, and he will be,” Zverev told reporters.\nAdvertisementZverev, 24, will now meet the Russian Olympic Committee’s Karen Khachanov in the gold medal match this weekend."
  },
  {
    "headline": "NHRC to integrate formal, traditional justice systems to achieve peace in North East",
    "summarized_story": "The executive secretary of the National Human Rights Commission, Tony Ojukwu is hoping to integrate the formal and traditional justice systems in a bid to achieve sustainable peace in conflict-affected areas in the country.\nHe stated this during a stakeholders consultative meeting on promoting reconciliation, reintegration and transitional justice in Borno, Adamawa and Yobe states.\nThe northeastern states have been hotbeds of insurgency in the last ten years, and the NHRC is hoping the move will help achieve sustainable peace in the region."
  },
  {
    "headline": "Bandits Abduct Former Tsafe LGA Administrator Aminu Mudi Tsafe In Zamfara",
    "summarized_story": "Bandits have abducted the former sole administrator of Tsafe local government council in Zamfara stateThe former sole administration Aminu Mudi Tsafe was kidnapped thursday evening while returning from his farm in sungawa village in Tsafe local government areaSources close the family told TVC NEWS that the bandits in their large number fully armed whisked away Mudi Tsafe alongside his motorcycleThe bandits directed the former sole administrator to ride his motorcycle into the bush while some of them lead as others follow at the backThe kidnappers are yet to reach out to the family of the victimAdvertisementPolice authorities in Zamfara state are yet to speak on the incident as the Spokesperson of the command is not responding to phone calls.\nLOCATION : TSAFE, ZAMFARA"
  },
  {
    "headline": "Trending: Abba Kyari Indicted In Hushpuppi’s Fraud Case",
    "summarized_story": "Reactions continue to trail the indictment of Nigeria’s Deputy Commissioner of Police, Abba Kyari, in the HushPuppi internet fraud case.\nThis is coming after a US court issued a warrant of arrest for Kyari over his role in a series of fraud committed by notorious internet fraudster, Ramon Abbas aka Hushpuppi.\nMeanwhile, a video of a Nigerian federal lawmaker, Honourable Ibrahim Abunna spraying money on members of his constituency has made the rounds.\nThe lawmaker who represents Mafa, Dikwa and Konduga federal constituency, Borno state, in the House of Representatives threw wads of cash from his balcony."
  },
  {
    "headline": "Tokyo 2020: Djokovic’s Golden Slam Bid Dashed, Loses to Zverev in Semis",
    "summarized_story": "There will be no Golden Slam for Novak Djokovic.\nThe top-ranked Serb lost to Alexander Zverev of Germany 1-6, 3-6, 6-1 Friday in the semifinals of the tennis tournament at the Tokyo Olympics.\nDjokovic was attempting to become the first man to win all four Grand Slam tournaments and Olympic gold in the same year.\nSteffi Graf in 1988 remains the only tennis player to achieve the Golden Slam.\nThe Russian beat Pablo Carreno Busta of Spain 6-3, 6-3."
  },
  {
    "headline": "Russian Module Mishap Destabilises International Space Station",
    "summarized_story": "The International Space Station (ISS) was destabilised after engines of a newly-arrived Russian module inadvertently fired up, officials say.\nUS and Russian officials said that the seven crew members aboard the space station were never in any danger.\nCommunications with the ISS crew were lost for several minutes during the incident.\nthey “really didn’t feel any movement” as the space station pitched at half-a-degree a second.\nIn addition, the module carries with it a large robotic arm (ERA) supplied by the European Space Agency (Esa)."
  },
  {
    "headline": "Eritrean Refugees Demand Protection Amid Tigray War",
    "summarized_story": "Eritrean refugees have organised a protest in front of the UN refugee agency (UNHCR) office in the capital, Addis Ababa, demanding the relocation of thousands of refugees from camps in the war-torn Tigray region.\n“We want the world to know that Eritrean refugees are suffering in Ethiopia,” Miku Digaffe, one of the organisers of the rally, told Al Jazeera.\nThe UNHCR said this week that conditions for the refugees in Tigray have become increasingly dire, with about 24,000 Eritrean refugees trapped in the two camps in Tigray.\nThe UN has said the war would affect about 55,000 Eritrean refugees sheltered in the Afar region that borders Tigray.\nThe war and its trauma have made Ethiopia no longer a safe place for Eritrean refugees."
  },
  {
    "headline": "Tokyo Olympics: South African Sets World Swim Record",
    "summarized_story": "South Africa’s Tatjana Schoenmaker was the star of the day, setting the first individual swimming world record at the Tokyo Olympics on Thursday.\nIt was the third world record at the Tokyo Aquatics Centre, with the first two coming in women’s relays.\nThe Australians have won four individual women’s events at the Tokyo Aquatics Centre, in addition to setting a world record in a 4×100 free relay that included both McKeon and Campbell.\n“I thought I did great.”A day after winning its first two golds at the pool, China picked up another victory when Wang Shun touched first in the men’s 200 individual medley.\nIn the preliminaries, Dressel tied the former Olympic record of 50.39 set by Singapore’s Joseph Schooling to win gold at the 2016 Rio Games."
  }
]