[
  {
    "headline": "Reps urge FG to immortalise national pledge author, Adedoyin",
    "summarized_story": "The House of Representatives, on Wednesday, mandated its Committee on Special Duties to liaise with the relevant authorities of the Federal Government to immortalize Prof. Felicia Adebola Adedoyin for her contributions to the advancement of Nigeria.\nThe resolution followed a unanimous adoption of a motion moved by a member from Oyo State, Olajide Olatubosun, which was titled ‘Need to Immortalise the Author of the National Pledge, Late Prof. (Mrs) Felicia Adebola Adedoyin.’At the plenary on Wednesday, Olatubosun recalled that the National Pledge was written in 1976 by Prof Felicia Adebola Adedoyin who was a princess from the Iji Ruling House of Saki, Oyo State.\nThe lawmaker also noted that the motivation for writing the National Pledge was the reality of non-existence of a National Pledge for Nigeria at the time, unlike other nations like the United States of America and Ghana in West Africa.\nThe lawmaker said, “The thoughtful and solemn words of the National Pledge have become an invocation for every Nigerian citizen to serve our fatherland with faithfulness, loyalty and honesty;“The House regrets that the iconic composer of the National Pledge passed away on Saturday, May 1, 2021, after a brief illness.\n“The House is convinced that the contribution of the deceased great Nigerian deserves special acknowledgement by immortalising her to keep her memories alive.”"
  },
  {
    "headline": "Reps demand military presence in Kaduna over bandits’ attacks",
    "summarized_story": "The House of Representatives has decried the incessant attacks by bandits on communities in Kaduna State, urging the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development, and the National Emergency Management Agency as well as other relevant agencies to immediately provide relief materials to the affected victims of the “ceaseless and violent attacks in Zango Kataf Local Government Area.”The House also urged the Federal Government to “immediately deploy more military personnel and intelligence operatives to assist and complement the operations of the ‘Safe Haven’ task force in Zango Kataf and other LGAs in the southern part of Kaduna State.”Furthermore, the House urged the government to establish a military command, battalion and/or brigade in Zango Kataf.\nThe lawmaker representing Zango Kataf/Jaba Federal Constituency in Kaduna State at the House, Amos Magaji, had moved a motion unanimously adopted at the plenary on Wednesday, titled ‘Need to Curtail the Ceaseless Armed Bandit Attacks in Zango Kataf Local Government.’Magaji said, “The House notes the resumed, ceaseless and wanton destruction of properties and farmlands, cold-hearted killings, countless kidnappings, boundless cattle rustling and ferocious burning of houses of residents and communities in Zango Kataf LGA of Kaduna State by alleged bandits.\n“The House also notes that while people of the affected communities were beginning to heave sighs of relief as bandit attacks had gone down considerably, with minor isolated cases carried out, the situation has gone back to its usual dangerous and frightening state of regular and daily incidents.”The lawmaker recalled that on July 4, 2021, bandits attacked Katsit community in Kafanchan, killed two persons, caused severe injuries to not less than 10 others, destroyed farmlands and property in the midnight raid, saying, “Such attacks have been a regular and permanent fixture in the entire Zango Kataf LGA.”He also noted that due to the resumed attacks and nefarious activities of the bandits, the people of Zango Kataf, having lost their kith and kin, farmlands, houses and property worth hundreds of millions of naira, “now live in perpetual fear and anxiety leading to massive economic deprivation, trauma and eventually health challenges.”Magaji added, “The House is worried that the constant invasion of the communities by armed bandits, who maim, brutalise, dehumanise and kill people with reckless and ferocious dimensions, has turned indigenes and residents into destitute in their ancestral homes.\n“The House is disturbed that the attacks on communities in Zango Kataf LGA and other neighbouring communities and towns in the entire Southern Kaduna have been on for over two years and have paralysed commerce and trade as well as food supply, not only in the affected communities but also the entire Kaduna State, North-West and North-Central zones as people from Southern Kaduna no longer go to their farmlands.”"
  },
  {
    "headline": "Kano Assembly suspends investigation of Anti-Corruption chair",
    "summarized_story": "Kano AssemblyBy Bashir Bello – KanoThe Kano State House of Assembly has on Wednesday suspended the investigation of the Kano State Public Complaint and Anti-Corruption Commission Muhyi Magaji Rimingado on the ground of ill health.\nBriefing newsmen at the assembly, the Secretary of the committee and Deputy Director, Legal Services, Kano State House of Assembly, Bar.\nUsman Fari said his client was not present in the assembly on two grounds bothering on his health and other conditions.\nThe only document we have received was the invitation letter sent to him dated July 12th.\n“Our client is very willing and ready to honour the house invitation, however, he must be obliged adequate time in line with medical advice of his physicians,” Barr."
  },
  {
    "headline": "Kukah to US Congress: FG helpless, uninterested in dealing decisively with bandits, insurgents",
    "summarized_story": "He said this during his virtual presentation to the Tom Lantos Human Rights Commission in Washington, DC, on the persecution of Christians in Nigeria by armed extremist groups in the North.\nKukah said the people are yet to see any tangible move towards tackling Nigeria’s insecurity which, according to him, has a religious undertone.\nHe stated that the people were agitated, adding that there was palpable fear and tension across the country.\nThe fact that the government seems to be either helpless or uninterested in dealing decisively with these people has added more confusion.\nSo, we require practical assistance that can help us and our children.”Vanguard News Nigeria"
  },
  {
    "headline": "Plateau: Protest in Riyom as two die in fresh attack",
    "summarized_story": "By Marie-Therese Nanlong, JosThe killing of two people on Tuesday night at Kum community in Riyom District, Riyom local government area of Plateau State has sparked a fresh protest as women and youths march to the headquarters of the local government to register their displeasure.\nThe community where the duo were killed is in Riyom town where many displaced persons are taking refuge after fleeing their ancestral homes due to incessant attacks and forceful taking over of their property by the aggressors in the local government area.\nFormer member of the State House of Assembly and former Caretaker Committee Chairman of the Council, Emmanuel Jugul appealed for calm, urging the people not to take laws into their hands.\nCalm had however returned at the time of this report.\nVanguard News Nigeria"
  },
  {
    "headline": "Katsina Police restrict movement on highways for Buhari’s visit",
    "summarized_story": "By Bashir BelloAs part of measures to provide adequate security during President Muhammadu Buhari’s Thursday’s visit to his home state, Katsina for the commissioning of some projects, the State Police Command has announced restriction of movement of persons, vehicles, motorcycles and herders in some major highways in the state.\nThe highways include Dutsinma – Kankara road, Dutsinma – Tsaskiya road and other roads leading to the event ground.\nThe Command’s Spokesperson, SP Gambo Isah who announced the restriction of the movement said the roads will be temporarily closed for six hours.\nAccording to him, “the Command wishes to announce the temporary closure of Dutsinma – Kankara road, Dutsinma – Tsaskiya road and other adjoining roads to the venue of the two events on 15th July 2021 from 13:00hrs – 18:00hrs.\nThe President is expected to commission the Zobe Regional Water Supply Project in Dutsinma LGA and the newly built Tsaskiya road in Safana LGA of Katsina state."
  },
  {
    "headline": "Ogun gov, Abiodun laments poor condition of Lagos-Ota-Abeokuta expressway",
    "summarized_story": "Governor Dapo AbiodunBy James Ogunnaike, AbeokutaOgun State Governor, Prince Dapo Abiodun on Wednesday, lamented the non-readiness of the federal government to attend to the poor condition of the Lagos-Ota-Abeokuta expressway despite his several appeals for its rehabilitation.\nYou can also see the presence of Julius Berger Construction Company at the old Toll Gate axis of this expressway.\nYou can see that we are already reconstructing the Agbara – Igbesa Industrial highway, which is also a federal road.\nThat one was even worse than this Abeokuta – Ota – Lagos expressway.\nAbiodun said his administration is willing to reconstruct the Lagos-Sango-Abeokuta and Sango-Idiroko expressway, provided the federal government will honour his requests to adopt the roads for rehabilitation."
  },
  {
    "headline": "President Buhari, Aisha hail Folorunsho Alakija",
    "summarized_story": "President Muhammadu Buhari and the First Lady Aisha Buhari have rejoiced with Mrs Folorunsho Alakija, distinguished business leader and philanthropist on her 70th birthday on July 15, 2021, extolling her for dedicating her resources to humanitarian causes.\nThe President and the First Lady thanked Mrs Alakija for being an ardent supporter of many social, economic, religious and health causes, contributing generously to the fight against COVID-19 in the country through her donations.\nBuhari was quoted in a statement signed by Garba Shehu as saying that he and his wife believe that the joyous occasion provides an opportunity for family, friends, associates and well-wishers to reflect on the importance of reaching out to people around with the benevolence God has committed to us.\nAs a successful entrepreneur who has been acknowledged locally and globally, the President also recognises Alakija’s passion in mentoring young people to make informed investments and business decisions, thereby making a difference in their communities and across the nation.\nOn behalf of his family, the President offers his best wishes to this remarkable Nigerian, praying almighty God to grant her more years of robust health and happiness."
  },
  {
    "headline": "One feared dead over oil surveillance contract crisis in Bayelsa",
    "summarized_story": "DAILY POST gathered from sources that the lingering crisis which was ignited by power control led to the killing of a Nembe youths during an attack by unknown gunmen.\nSome youths of the community claimed that the attack was sponsored by some politicians who were chased from the town over the oil surveillance jobs.\nDAILY POST also gathered that the unknown gunmen and their perceived sponsors had also threatened to launch another attack against the community.\nOML29 is a large block containing 11 oil and gas fields which stretches over an area of 983 square kilometres including the Nembe Oil Field, Santa Barbara Oil Field and Okoroba Oil Fields.\nMeanwhile, the state government has halted the spread of the lingering intra-communal clash in Nembe-bassambiri in Nembe Local Government Area of the State with the imposition of a dusk to dawn curfew in the oil rich area."
  },
  {
    "headline": "NUJ declares 3-day mourning in honour of late veteran, Suleiman Yakubu",
    "summarized_story": "He was an outstanding leader and member, whose jovial disposition knows no bounds.\nThough he was in his old age, he never underrated the young and junior journalists.\nThe vacuum created by his death would be difficult to fill judging by his wealth of experience in the media industry, especially electronic media.\nWe pray to God to grant the family the fortitude to bear the loss.\nSuleiman has since been buried at Rigasa Cemetery in Kaduna according to Islamic rites."
  },
  {
    "headline": "EFCC explains operation at Parktonian Hotel, condemns ‘media narrative",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has provided a recount of what happened during the raid at Parktonian Hotel in the Lekki area of Lagos.\nEFCC Head of Media, Wilson Uwujaren in a statement on Wednesday said the sting operation was the culmination of weeks of surveillance during which rooms the suspects occupied were identified.\nUwujaren said the women in some of the rooms pleaded nudity to stop the EFCC from arresting their targets.\nHe said reports against the EFCC quoted the hotel owner and his manager as refusing to speak about what transpired.\n“But the claim is obviously a game of ostrich as their involvement in pushing out the false narrative is discernable."
  },
  {
    "headline": "What Bishop Kukah told US Congress about Buhari govt",
    "summarized_story": "The Bishop of the Catholic Diocese of Sokoto, Matthew Kukah has expressed fear that the Nigerian government under President Muhammadu Buhari is not handling issues concerning religious crisis the right way.\nKukah told Congress that although the attack on Christians in Nigeria have been happening for many years now, it has risen in the last 10 years.\nThey end up converting these children to wives, cooks, spies, sexual slaves and so on,” the Bishop said.\nThe Bishop also complained to Congress that President Buhari is deliberately appointing people of his ethnic group and religion into key political positions.\nSo, we require practical and measuring assistance that can help us and our children,” the cleric cried out."
  },
  {
    "headline": "Wizkid announces ‘Made in Lagos’ London tour",
    "summarized_story": "By Ekaete BasseyGrammy award-winning songster, Wizkidayo has announced the date for the London ‘Made in Lagos’ tour.\nAccording to Big Wiz, the tour titled “The 02 London” is scheduled to hold on November 28, 2021 which falls on a Sunday.\nADVERTISEMENTWhile making the announcement, the “Joro” singer also disclosed where tickets for the event can be procured.\nEarlier in the month, Wizzy had released the scheduled dates and cities for his tour in North America, which will run from September 2021 till January 2022.\nAccording to the “Essence” crooner, the tour will kick off on September 10 with a show at Orpheum Theatre in Boston."
  },
  {
    "headline": "Reps pass eight bills for second reading",
    "summarized_story": "By Tony Akowe AbujaThe House of Representatives on Thursday continued implementation of the report of its security summit requiring legislative actions with passage of eight security related bills for second reading.\nThere was also a Bill for an Act to Amend the Civil Defence Corps Act N0.\nThe security bills also include a Bill for an Act to Amend the Armed Forces Act, Cap.\nHowever, details of the bills were not immediately available as they were not subjected to serious debate by the leadership.\nAll the bills were referred to the relevant committees for further legislative action and public hearing."
  },
  {
    "headline": "Ekiti 2022: APC needs unity to defeat PDP – Ojudu",
    "summarized_story": "By Rasaq Ibrahim, Ado-EkitiThe Special Adviser to the President on Political Matters Babafemi Ojudu has said the ruling All Progressive Congress (APC) in Ekiti State must be united to defeat the People’s Democratic Party (PDP) in the June 18 governorship poll.\nHe underscored the urgent need for unity of purpose among the APC leaders, stressing only tenacity of togetherness can secure victory for the party.\n“Whatever may be our differences we must come together to ensure that the baton is never again passed to a PDP person in Ekiti.\nEnough of clannish groupings such as Tokan Tokan- the self- serving ones who say they are closest to the heart of the Governor even though we know what they say behind him.\nLet us embrace hope- let us preach unity, faith, peace and progress,” he added."
  },
  {
    "headline": "Pandemonium in Abuja over demolition of over 473 illegal structures",
    "summarized_story": "By Gbenga Omokhunu, AbujaThere was tension in some parts of Abuja on Wednesday as residents ran helter-skelter to salvage what they could when officials of the Federal Capital Territory Administration (FCTA) demolished over 473 illegal structures at Iddo Sarki community.\nThe FCTA pulled down no fewer than 137 illegal structures, ranging from blocks of hostels, hotels and others at the weekend.\nWith renewed energy, an apparently strengthened, well-fortified enforcement team, comprising the Nigeria Navy, Nigeria Police Force, DSS, NSCDC, NDLEA, Nigeria Immigration Service and DRTS, working with five bulldozers, levelled 473 illegal buildings in a day.\nAccording to him, leaving the demolition exercise halfway, uncompleted would only encourage reemergence of illegal structures and perpetuation of illegality, which would further deteriorate the abuses of the Abuja Master Plan.\nAttah also sent a warning to owners of illegal structures within Mpape, Dutse Makaranta, Ushafa and areas to either move out or comply, adding they were next in line for similar clean up exercises."
  },
  {
    "headline": "PIB: Northern lawmakers, govs override Southern counterparts",
    "summarized_story": "The Senate, during the consideration of the Bill, crashed the 5% funds earmarked for host communities to 3%.\nThe push for the reduction was spearheaded by Northern senators.\nWhereas, in the House of Representatives, lawmakers passed 5% as recommended by the Joint Committee on Petroleum.\nUnlike the Senate, the House of Representatives didn’t tamper with the recommendation.\nIt was learnt that lawmakers who voted during the Committee meeting, opted for regional interests."
  },
  {
    "headline": "Plateau: Herdsmen kill two as youths protest in Riyom",
    "summarized_story": "From Gyang Bere, JosTwo people are reported to have died in a bloody attack suspected to have been carried out by Fulani herdsmen in Kum village of Riyom Local Government Area of Plateau State.\nDaily Sun gathered that the incident which occurred at about 9 pm Tuesday, left one Mr Titus John and Iliya Dalyop dead.\nA lawmaker representing Riyom Constituency in the Plateau State House of Assembly, Hon Timothy Dantong, confirmed the incident and said the deceased persons were ambushed and killed.\n‘It is true that two persons were killed on Tuesday night in Kum village of Riyom LGA by gunmen.\nThe youths blocked the major Abuja-Jos express route which tempered with the smooth flow of vehicles into Jos, the state capital."
  },
  {
    "headline": "Ataga: Chidimma must not die in custody, Reps warn police",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, yesterday, cautioned the Nigeria Police to ensure that Ms Chidimma Ojukwu, who is being held in connection with the death of late Usifo Ataga, does not die in their custody.\nThe House also urged the police to conduct a thorough investigation into the murder incident and refrain from parading “Ms.\nChidinma around to grant interviews” on a matter under investigation.\nThis followed the adoption of a motion by Tolu Akande-Sadipe, calling for compliance of the police force with extant laws in the investigation into the death of late Ataga.\nThe lawmaker noted that since her arrest, the suspect has been paraded around, granting interviews to several news platforms, including the Nigerian Television Authority (NTA)."
  },
  {
    "headline": "INEC: PDP, Arewa group, CTA hail rejection of Onochie’s nomination",
    "summarized_story": "The nomination of Onochie by the Presidency was trailed by controversy, which reached a climax, yesterday, as the Senate rejected the nomination.\nDelta State where Onochie hails from has a serving national commissioner in INEC.\nThe PDP said the rejection of Onochie has saved the country from a serious crisis and salvaged INEC and the entire Nigerian electoral process.\nThe CTA, in a statement by its Executive Director, Faith Nwadishi, said Onochie’s rejection would augur well for Nigeria’s democracy.\n“We admonish the leaders of the National Assembly to continue to put Nigeria’s democracy first above party/individual sentiments,” he said."
  },
  {
    "headline": "Nigeria lucky to remain united despite challenges –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has said Nigerians should congratulate themselves for remaining one despite ongoing challenges that could have torn us apart.\nThe report was submitted by a team of House members led by Speaker Femi Gbajabiamila.\nPeople wonder why Nigerians accept me, despite not being rich.\n“There are several recommendations; we’ve agreed to establish zonal commissions in all the zones like the North East Development Commission.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "It's A Year After Nigeria's First Female Combat Pilot, Tolulope Arotile Died. Will Justice Be Served?",
    "summarized_story": "A year after the death of Tolulope Arotile, Nigeria's first-ever female combat pilot, justice has not been served.\nArotile died in an accident on July 14, 2020, at the Nigeria Air Force (NAF) base in Kaduna at the age of 24.\nTolulope ArotileHer father, Akintunde Arotile, said if justice could be served as soon as possible, their minds would be put to rest.\n\"She was inadvertently hit by the reversing vehicle of an excited former Air Force Secondary School classmate while trying to greet her,\" Daramola said.\nShe attended the Air Force Primary School, Kaduna (2000 to 2005) and the Air Force Secondary School, Kaduna (2005 to 2011)."
  },
  {
    "headline": "It's A Year After Nigeria's First Female Combat Pilot, Tolulope Arotile Died. Will Justice Be Served?",
    "summarized_story": "A year after the death of Tolulope Arotile, Nigeria's first-ever female combat pilot, justice has not been served.\nArotile died in an accident on July 14, 2020, at the Nigeria Air Force (NAF) base in Kaduna at the age of 24.\nTolulope ArotileHer father, Akintunde Arotile, said if justice could be served as soon as possible, their minds would be put to rest.\n\"She was inadvertently hit by the reversing vehicle of an excited former Air Force Secondary School classmate while trying to greet her,\" Daramola said.\nShe attended the Air Force Primary School, Kaduna (2000 to 2005) and the Air Force Secondary School, Kaduna (2005 to 2011)."
  },
  {
    "headline": "BREAKING: University Of Lagos Shuts Campus Over COVID-19 Scare",
    "summarized_story": "The management of University of Lagos has asked students to vacate hostels on campus over COVID-19 concerns.\nProf Oluwatoyin Ogundipe, the Vice-Chancellor, had summoned an emergency senate meeting over the potential third wave of COVID-19.\nThe university had earlier confirmed that the medical centre had recorded an increase in the number of patients with COVID-19 symptoms.\nThis is with a concurrent increase in the occupancy rate at Lagos State isolation centres.\n“The University of Lagos community has also been affected by this potential 3rd wave, with an increase in the number of patients presented to the University of Lagos Medical Centre with flu-like symptoms which are similar to COVID-19."
  },
  {
    "headline": "BREAKING: University Of Lagos Shuts Campus Over COVID-19 Scare",
    "summarized_story": "The management of University of Lagos has asked students to vacate hostels on campus over COVID-19 concerns.\nProf Oluwatoyin Ogundipe, the Vice-Chancellor, had summoned an emergency senate meeting over the potential third wave of COVID-19.\nThe university had earlier confirmed that the medical centre had recorded an increase in the number of patients with COVID-19 symptoms.\nThis is with a concurrent increase in the occupancy rate at Lagos State isolation centres.\n“The University of Lagos community has also been affected by this potential 3rd wave, with an increase in the number of patients presented to the University of Lagos Medical Centre with flu-like symptoms which are similar to COVID-19."
  },
  {
    "headline": "Suspected Kidnappers Kill 40-Year-Old Businessman In Bauchi",
    "summarized_story": "A 40-year-old Bauchi businessman, Tasiu Tilde, has been killed by unknown gunmen suspected to be kidnappers.\nTasiu was killed when the gunmen attempted to abduct him at his pharmacy on Tuesday evening in Tilden Fulani, the Toro Local Government Area of Bauchi State.\nTilden Fulani is about 100 kilometers from Bauchi.\nThe Police Public Relations Officer, Bauchi State Police Command, Ahmed Wakil, who confirmed the incident to newsmen, said “Some yet-to-be-identified gunmen stormed Tilden Fulani in Toro LGA on Tuesday.\n“The patrol team immediately evacuated him to the nearest Toro General Hospital where, on arrival, a medical doctor on duty certified him dead."
  },
  {
    "headline": "'Many can't make it to hospitals' -- panic in Kano as cholera outbreak worsens",
    "summarized_story": "AdvertisementIn a bid to ascertain the magnitude of the outbreak, TheCable visited some Kano communities and the reality was stark; the outbreak is spreading faster than health workers and facilities can handle.\nAt Bichi General Hospital, some patients, especially women and children, are starting to recover from the disease.\nAdvertisement“I was vomiting and purging uncontrollably that when I came to the hospital, I had to be placed on drips.\nSamaila Tsoho Ado, a farmer, wants the state government to take quick action before the situation gets out of control.\nWhile the infectious disease continues to spread, the actual number of cases in the state is yet to be ascertained."
  },
  {
    "headline": "'Many can't make it to hospitals' -- panic in Kano as cholera outbreak worsens",
    "summarized_story": "AdvertisementIn a bid to ascertain the magnitude of the outbreak, TheCable visited some Kano communities and the reality was stark; the outbreak is spreading faster than health workers and facilities can handle.\nAt Bichi General Hospital, some patients, especially women and children, are starting to recover from the disease.\nAdvertisement“I was vomiting and purging uncontrollably that when I came to the hospital, I had to be placed on drips.\nSamaila Tsoho Ado, a farmer, wants the state government to take quick action before the situation gets out of control.\nWhile the infectious disease continues to spread, the actual number of cases in the state is yet to be ascertained."
  },
  {
    "headline": "Saraki hindering us from probing him, EFCC tells court",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has asked a federal high court to vacate an order made restraining the commission from probing Bukola Saraki, former senate president.\nWhen the case was called on Wednesday, Sunday Onubi, Saraki’s counsel, told the court that the matter was slated for mention.\nHowever, Chile Okoronkwo, counsel to EFCC, informed the court that he had an application to make.\nHe stated that Saraki has continued to hinge on the order of the court any time he is invited by the commission for interrogation.\nThe lawyer urged the court to vacate the order."
  },
  {
    "headline": "Saraki hindering us from probing him, EFCC tells court",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has asked a federal high court to vacate an order made restraining the commission from probing Bukola Saraki, former senate president.\nWhen the case was called on Wednesday, Sunday Onubi, Saraki’s counsel, told the court that the matter was slated for mention.\nHowever, Chile Okoronkwo, counsel to EFCC, informed the court that he had an application to make.\nHe stated that Saraki has continued to hinge on the order of the court any time he is invited by the commission for interrogation.\nThe lawyer urged the court to vacate the order."
  },
  {
    "headline": "Boundary dispute: Supreme court stops FG from ceding 17 oil wells to Imo",
    "summarized_story": "The supreme court has issued an order restraining the federal government and its agencies from ceding 17 oil wells to Imo state.\nAdvertisementThe oil wells are located in Akri and Mgbede communities, where the Rivers and Imo state governments are disputing boundaries.\nAdvertisementRivers state, through its attorney-general, had dragged the AGF and the Imo state attorney-general before the supreme court over the boundaries.\nThe supreme court has fixed September 21 for the hearing of the substantive suit.\nIn 2020, Rivers state won a boundary dispute involving the return of the Soku oil fields from Bayelsa state."
  },
  {
    "headline": "Safaricom to pay blind man $56,000 for refusing to hire him",
    "summarized_story": "A High Court in Kenya has ordered Safaricom to pay a blind man KSh6 million ($56,000) for failing to hire him after he had gone through the entire recruitment process.\nWilson Macharia sued the network operator to seek compensation because his rights were violated, BusinessDaily reported.\nHe told Justice James Makau that Safaricom declined to employ him as a customer care executive on grounds that it did not have specialised software to help him with his work.\nAlong with other persons living with disabilities, Macharia was shortlisted for the job, went through the oral interview and medical test, after which he was invited to sign the contract in July 2017.\nThere’s a long history of discrimination and exclusion of persons with disabilities around the world."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "Central bank digital currencies differ from crypto. Here’s how they work",
    "summarized_story": "With cryptocurrencies like Bitcoin becoming increasingly popular, central banks across the world have been working towards developing digital currencies of their own.\nOnly two countries have officially launched digital fiat currency.\nNigeria and Ghana plan to pilot an official digital currency (e-naira and e-cedi respectively) later this year.\nA Central Bank Digital Currency (CBDC) is a country’s official currency in digital form.\nWith their values pegged, a digital currency will fall and rise in line with general swings in the value of the national currency."
  },
  {
    "headline": "Flutterwave lands Visa and MTN veteran to lead government and regulatory affairs",
    "summarized_story": "Before IHS, he spent 10 years at MTN in various government and regulatory advisory roles, and four years representing VISA in conversations with West African regulators.\nIn appointing a regulatory lead with broad industry experience, Flutterwave expresses an enthusiasm for deeper engagement with African governments.\nFlutterwave’s payments processing business is live in 33 African countries.\nThat spread commands a regulatory burden similar to what multinational financial services companies and telecommunications networks have to contend with.\nIt may have figured in their selection process for a regulatory lead, choosing someone with experience spanning these sectors."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Spazio Ideale designs iconic workspaces for tech companies like Paystack, uLesson, others",
    "summarized_story": "The acceptance of space design in Nigeria coincided with the coming of interior design startups like Spazio Ideale — an Italian expression loosely translated as ‘Ideal Space’.\nTomi Bamgbelu, Founder and Creative Director of Spazio Ideale, has always had a flair for architecture and computers.\nSpazio Ideale team.\nThat’s the only way we can add value.”Bamgbelu gives her take on why people reach out to Spazio Ideale.\nAlthough uncommon at that time, the founder decided to do something different with the office space design."
  },
  {
    "headline": "Flutterwave’s regulatory officer, VerifyMe digital address system, Mobile app downloads skyrocket",
    "summarized_story": "Good day,Today I’m discussing:Flutterwave’s new appointmentVerifyMe’s VeriFind launchMobile app downloads skyrocketFlutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations OfficerFlutterwave’s new Chief Regulatory and Government Relations Officer, Oluwabankole Falade.\nThe story: Nigerian fintech unicorn, Flutterwave, has announced Oluwabankole Falade as its Chief Regulatory and Government Relations Officer.\nFor more context: Flutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations Officer.\nWell, VerifyMe Nigeria, an identity verification startup, wants to change that with its geotagging solution, VeriFind.\nNigeria leads mobile app downloads in AfricaSmartphone userMobile app installs in Nigeria grew by 43% between Q1 2020 and Q1 2021, according to a report by Appflyer and Google."
  },
  {
    "headline": "Flutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations Officer",
    "summarized_story": "Online payments solution platform, Flutterwave has appointed former MTN and Visa executive, Oluwabankole Falade as its new Chief Regulatory and Government Relations Officer.\nFalade, who has worked in similar roles in companies like MTN and Visa, brings a wealth of legal, regulatory, business development, and government relations experience from a 16-year stint in the financial and telecoms industries.\nFalade’s regulatory experience with global giants like MTN and Visa should serve as good reference points in his new role.\nA trend that has seen Chaka bag the Securities Exchange Commissions’ (SEC) first digital stock trading licence.\nDo you think we will see more appointments like this in fintech companies?"
  },
  {
    "headline": "50 years after, OPEC gains still evade Nigeria",
    "summarized_story": "A country celebrating 50 years of its Organisation of Petroleum Exporting Countries (OPEC) membership, Nigeria is a clear example that a natural resource such as oil is not necessarily a blessing.\nEndowed with some of the world’s biggest oil reserves, plenty of arable lands, Nigeria had the potential to break onto the global stage by…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Fintech attraction: Investors find benefits outweigh costs in Nigeria",
    "summarized_story": "Nigeria’s financial technology (Fintech) companies have increasingly become a top investment destination for foreign investors.\nTo have a piece of the industry’s cake, investors are queuing and waiting for a window of entry.\nConsidered a ‘goldmine’, the opportunities foreign investors see in Nigeria’s Fintech industry has forced them to turn a blind eye to the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "NEITI reveals revenue leakages in Nigeria’s extractive sector",
    "summarized_story": "The Nigerian Extractive Industries Transparency Initiative (NEITI), a transparency watchdog, has published its 2019 report on Nigeria’s extractive sector showing a disturbing pattern of poor practices fostering revenue leakage to the Federation.\nNEITI observed that some companies reported crude losses due to metering error, theft and sabotage that were higher than the volume of production…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Human Trafficking/Forced Migration: Foundation Holds Workshop For Community-Based Women Led Organisations In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In its resolved to curb Human Trafficking and Forced Migration in Edo State, CLEEN Foundation, a non-profit and governmental organisation in the country has organised a 2-Day Capacity Building Workshop for Community-Based Women Led Organisations In the State.\nHe disclosed that the program was conceptualised following failure of various institutional and legal frameworks to address human trafficking, forced migration, gender and non-gender related crime in Nigeria.\nSpeaking with The NIGERIAN OBSERVER during the workshop, the Edo State Coordinator of CLEEN Foundation, Mrs.\nBlessing Eromon, said that the foundation has taken the fight against human trafficking and forced migration in Edo State as one of his core mandates.\nShe revealed that forced migration is the push that makes one to leave the present place of habitation to a different place as a result of conflict, insecurity, disaster, persecution and government authority, adding that the underlying reason for forced migration is to seek better living condition."
  },
  {
    "headline": "Edo govt rallies stakeholders, targets top spot as world’s leading producer of oil palm – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has partnered the Initiatief Duurzame Handel (IDH), an international organisation, to initiate a Multi-Stakeholders Platform (MSP) aimed at ensuring that the state regains its leading position in oil palm production in Africa.\nPermanent Secretary, Edo State Ministry of Communication and Orientation, Mr. Joses Isede disclosed this to journalists in Benin City when he received the MSP facilitator from IDH, Mrs. Ngozi Unuigbe, who was on a courtesy visit.\nIsede said Edo is leveraging on the investment-friendly environment provided by the Governor Godwin Obaseki-led administration to drive agricultural development in the state.\nThe Permanent Secretary expressed satisfaction with the import of the collaboration which he added was in tune with the state government’s Making Edo Great Again (MEGA) Agenda.\nOn her part, Unuigbe said IDH was supporting Edo State to improve oil palm production by smallholder farmers, adding, “Not just improvement, but in a sustainable way that is environmentally friendly.”..."
  },
  {
    "headline": "Electoral Act Amendment : Lobby lawmakers, Don’t Blackmail NASS leadership – Lawan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President of the Senate, Ahmad Lawan, has kicked against what he described as the ‘calculated blackmail’ against the leadership of the National Assembly over the Electoral Act (Amendment) Bill 2021, presently before both chambers.\nThe report on the Electoral Act (Amendment) Bill, 2021, was laid by the Chairman of the Committee on Independent National Electoral Commission (INEC), Senator Kabiru Gaya.\nThe Senate President, therefore, advised Nigerians to lobby lawmakers on any aspect of the bill they feel strongly about, insisting that the National Assembly would do only what is right when it eventually considers the bill.\nLawan said,there are various accusations, insinuations that the leadership of the Senate, sometimes the leadership of the National Assembly have tampered with the report of the committee on INEC of both chambers.\nThe Senate President, however, maintained that the National Assembly can only consider aspects of the amendment bill contained in the Committee’s report presented to the upper chamber for consideration."
  },
  {
    "headline": "Edojobs flags-off onramp program for third cohorts of Edo Tech Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Skills Development Agency (EdoJobs) has kicked off an intensive training that prepares beneficiaries to gain sponsored entry positions as software engineers in the Edo Tech Park, an initiative of the Governor Godwin Obaseki-led administration.\nThe Managing Director, EdoJobs, Ukinebo Dare, in a chat with journalists on Wednesday, said the 30-day remedial training programme, ‘Edojobs on-ramped,’ will prepare the youths ahead of the six-month programme with Decagon, which is billed to commence in August.\nGovernor Obaseki had on December 14, 2020 launched the Edo Tech Park, in partnership with Decagon, an elite software engineering and leadership training institute.\nThe Edo Tech Park is a technology hub that aims to train at least 15,000 software engineers in Edo State and position them to work remotely in the state for high-paying global clients.\nAccording to Dare, “The Edo State Government through Edojobs has commenced an intensive training to prepare beneficiaries to gain sponsored entry into the Edo Tech Park, as the third cohort of its software engineers’ training programme, in partnership with Decagon."
  },
  {
    "headline": "‘Man beats wife to death for denying him sex’ – Police",
    "summarized_story": "ADVERTISEMENTThe police in Edo State have arrested a man who allegedly beat his wife to death for denying him sex.\n“The man was said to have demanded sex from the deceased around 11p.m.\nGiving a breakdown of the lives lost, the sector commander disclosed that 24 persons died in January; 13 in February and 14 in March.\nHe added that 19 people lost their lives in April, four in May, and 11 in the month of June.\nThe sector commander also disclosed that of the 114 road traffic crashes recorded, 23 occurred in January, 18 in February, and 17 in March."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Supreme Court stops Malami, 3 others from ceding ‘Rivers’ oil well to Imo",
    "summarized_story": "The Supreme Court has granted an order of injunction restraining the federal government from ceding 17 disputed oil wells located at Akri and Mbede in Rivers to Imo.\nMr Ukala prayed the court to stop the alleged implementation of the ceding of the 17 oil wells to Imo pending the determination of the suit filed by Rivers government, NAN reported.\nThe letter is said to have cancelled the equal sharing of proceeds from the 17 oil wells by Rivers and Imo.\nThe Rivers government dragged the AGF and the Attorney-General of Imo to the Supreme Court over disagreement on boundaries.\nThe plaintiff also sought a declaration that all the oil wells within Akri and Mbede communities were wrongly attributed to Imo and that they were all oil wells within the territory of Rivers."
  },
  {
    "headline": "I got 900 text messages in a day over alleged tampering with electoral act – Lawan",
    "summarized_story": "Nigeria’s Senate President, Ahmad Lawan, has said that he received over 900 text messages in one day over allegations of tampering with the report of the Electoral Act.\nHe described those accusing the leaders of the National Assembly of removing electronic transmission of results from the report as mischievous and rabble-rousers.\nLawan who stated this shortly after the Chairman of the committee on Independent National Electoral Commission (INEC), Senator Kabiru Gaya, submitted a report of the committee, explained that this is the first time the committee is submitting its report on the Electoral Act to the Senate.\n“There are various accusations and insinuations that leaders of the National Assembly have tempered with the report of the INEC committee.\nIn one day, I received 900 text messages,” he said."
  },
  {
    "headline": "Osun: Oyetola swears in 69 newly-appointed LGA, LCDA caretaker chairmen",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola, on Monday swore in newly-appointed Local Government Caretaker Committees in all the Local Government Areas, Local Council Development Areas, Area Councils and Administrative Offices, in the State.\n“You will recall that since our assumption of office, we have run an Administration that is transparent, inclusive, purposeful and absolutely pro-people.\nGovernor was able to bring out 69 out of millions of people of the State to serve.\nDon’t disappoint Mr Governor.\nSamuel Abiodun Idowu, hailed the Governor for counting them worthy to serve their people just as he promised their commitment to deliver."
  },
  {
    "headline": "Ifelodun North LCDA Boss, Olaniyan promises all-inclusive government, appreciates Oyetola, others",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe newly sworn in caretaker chairman of Ifelodun North Local Council Development Area in Ikinrun, Prince Adeniyi Olaniyan, has assured the people of the council area that he will run an all-inclusive government, just as he said, his intention is to build a local government that everyone will all be proud of.\nPrince Olaniyan gave the assurance at the council secretariat, Eweta, Ikinrun during the swearing in ceremony of other caretaker members of the local council.\nAccording to him, “it is important to emphasis the importance of local government, not only because it is the third tier of government in our dear country, but due to the fact that it is the closest to the people, hence, it plays a very strategic and pivotal role in the implementation of programmes and policies that are relevant to the socioeconomic and political development of our people.”He implored the party leaders, members of APC and people of Ifelodun North L.C.D.A.\nto let the ingenuity of their hands, the sweat of their labour and the compassion that resides in the hearts be committed to the common goal of building a formidable and united party structure that is capable of delivering peoples mandate, for Governor Adegboyegba Oyetola’s second term.\nThe council boss also enjoined all the caretaker members to work as a team in delivering divideds of democracy to the people of the council area."
  },
  {
    "headline": "Senate Faults NNPC Over Non-remittance Of N3.87trn Crude Oil Proceeds",
    "summarized_story": "The Senate has faulted the Nigerian National Petroleum Corporation (NNPC) for under-remitting the sum of N3,878,955,039,855.73 trillion revenue from domestic crude oil sales to the Federation Account for the period of January to December, 2015.\nAccordingly, the upper chamber called on the Corporation to desist from further deduction at source as this contravenes Section 162(1) of the 1999 Constitution (as amended).\nIt also mandated the Federation Accounts Allocation Committee (FAAC) or any other approving authority to, as a matter of urgency, approve agreed percentage which should be allocated to NNPC monthly as operational cost to ensure that their operations are not adversely affected.\nADVERTISEMENTThe Accountant General is expected to report back to the Senate Committee on Public Accounts within ninety days.\nIn meting further disciplinary actions, the chamber called on the EFCC to prosecute within thirty days, officers of the Nigeria Bulk Electricity Trading PLC (NBET) who were behind the non-remittance of accrued interest on investment in Nigeria Treasury Bills."
  },
  {
    "headline": "Senate Faults NNPC Over Non-remittance Of N3.87trn Crude Oil Proceeds",
    "summarized_story": "The Senate has faulted the Nigerian National Petroleum Corporation (NNPC) for under-remitting the sum of N3,878,955,039,855.73 trillion revenue from domestic crude oil sales to the Federation Account for the period of January to December, 2015.\nAccordingly, the upper chamber called on the Corporation to desist from further deduction at source as this contravenes Section 162(1) of the 1999 Constitution (as amended).\nIt also mandated the Federation Accounts Allocation Committee (FAAC) or any other approving authority to, as a matter of urgency, approve agreed percentage which should be allocated to NNPC monthly as operational cost to ensure that their operations are not adversely affected.\nADVERTISEMENTThe Accountant General is expected to report back to the Senate Committee on Public Accounts within ninety days.\nIn meting further disciplinary actions, the chamber called on the EFCC to prosecute within thirty days, officers of the Nigeria Bulk Electricity Trading PLC (NBET) who were behind the non-remittance of accrued interest on investment in Nigeria Treasury Bills."
  },
  {
    "headline": "Man’s Attempt To ‘Inherit’ Brother’s Widow Ignites Bloody Clash In Kwara",
    "summarized_story": "The attempt by a man to marry the widow of his late brother in Ikoroku area, Kaiama local government area of Kwara State, has led to a bloody clash amongst family members.\nThe children of the deceased were said to have accused their uncle of complicity in the death of their father.\nThe spokesman of the state command of the Nigeria Security and Civil Defence Corps (NSCDC), Babawale Afolabi, confirmed the incident.\nThe children of late Alhaji Bello vowed to take back their father’s wife from their uncle and this later ensued in a bloody free for all fight.\nADVERTISEMENTAfolabi added that the victim was rushed to Kaiama General Hospital from where he was transfered to the University of Ilorin Teaching Hospital."
  },
  {
    "headline": "Man’s Attempt To ‘Inherit’ Brother’s Widow Ignites Bloody Clash In Kwara",
    "summarized_story": "The attempt by a man to marry the widow of his late brother in Ikoroku area, Kaiama local government area of Kwara State, has led to a bloody clash amongst family members.\nThe children of the deceased were said to have accused their uncle of complicity in the death of their father.\nThe spokesman of the state command of the Nigeria Security and Civil Defence Corps (NSCDC), Babawale Afolabi, confirmed the incident.\nThe children of late Alhaji Bello vowed to take back their father’s wife from their uncle and this later ensued in a bloody free for all fight.\nADVERTISEMENTAfolabi added that the victim was rushed to Kaiama General Hospital from where he was transfered to the University of Ilorin Teaching Hospital."
  },
  {
    "headline": "Reps Seek Establishment Of Council For Climate Change",
    "summarized_story": "The House of Representatives is seeking the establishment of a National Council on Climate Change to be headed by the President of the Federal Republic of Nigeria.\nThe Bill to the effect is also seeking to establish a secretariat for the proposed council to be headed by a Director-General.\n“It will also achieve the CarbonBudget, there will be yearly and five-yearly carbon reduction targets for private and public entities, as will be captured in the National Climate Change Action Plan.\n“Setting up of the Climate Change Fund to provide funding for activities geared towards attaining Nigeria’s Climate Change obligations,” he said.\n“Provision for Climate Change education and awareness creation."
  },
  {
    "headline": "Crisis brews as Reps allege lopsidedness in Navy recruitment, demand suspension of exercise",
    "summarized_story": "The House of Representatives has said the ongoing recruitment exercise by the Nigerian Navy is unfair and not in compliance with the federal character principle in the Constitution, asking the military outfit to suspend the process.\nAccording to him, the principle is also aimed at preventing the domination by one or some ethnic groups in the affairs of the country and the exclusion of other ethnic groups.\nIgbakpa said, “The House is worried that, however, in practice, the principle appears to have been observed more in breach.\n“The House is further worried that this recruitment Supplementary list of 44 candidates, since it became public knowledge, has created a lot of tension, apprehension and discourse within the young and old from the deprived section.\n“The House believes that adequate observance and implementation of the federal character principle will in no small measure allay fears of domination and denial by the ethnic minorities and invariably foster national unity.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Crisis brews as Reps allege lopsidedness in Navy recruitment, demand suspension of exercise",
    "summarized_story": "The House of Representatives has said the ongoing recruitment exercise by the Nigerian Navy is unfair and not in compliance with the federal character principle in the Constitution, asking the military outfit to suspend the process.\nAccording to him, the principle is also aimed at preventing the domination by one or some ethnic groups in the affairs of the country and the exclusion of other ethnic groups.\nIgbakpa said, “The House is worried that, however, in practice, the principle appears to have been observed more in breach.\n“The House is further worried that this recruitment Supplementary list of 44 candidates, since it became public knowledge, has created a lot of tension, apprehension and discourse within the young and old from the deprived section.\n“The House believes that adequate observance and implementation of the federal character principle will in no small measure allay fears of domination and denial by the ethnic minorities and invariably foster national unity.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Sanwo-Olu congratulates Osoba at 82",
    "summarized_story": "By CHIKA CHIMEZIEFelicitates Babatunde Ogala at 60Lagos State Governor, Mr. Babajide Sanwo-Olu, has congratulated former Governor of Ogun State, Chief Olusegun Osoba on his 82 years birthday celebration.\nHe also congratulated ex-National Legal Adviser of the All Progressives Congress (APC) and former member of the Lagos State House of Assembly, Mr. Babatunde Ogala (SAN) on his 60th birthday.\nGovernor Sanwo-Olu in a statement issued by his Chief Press Secretary, Mr. Gboyega Akosile, described Osoba and Ogala who clock 82 and 60 respectively on Thursday, as Democrats and good ambassadors of the ruling party, APC.\n“Chief Olusegun Osoba is a true democrat and member of the progressive camp, who has been playing active roles in party politics and governance in Nigeria.\nHe also commended Ogala’s selfless service and dedication to the growth and development of Lagos State as a member of the State House of Assembly."
  },
  {
    "headline": "Sanwo-Olu congratulates Osoba at 82",
    "summarized_story": "By CHIKA CHIMEZIEFelicitates Babatunde Ogala at 60Lagos State Governor, Mr. Babajide Sanwo-Olu, has congratulated former Governor of Ogun State, Chief Olusegun Osoba on his 82 years birthday celebration.\nHe also congratulated ex-National Legal Adviser of the All Progressives Congress (APC) and former member of the Lagos State House of Assembly, Mr. Babatunde Ogala (SAN) on his 60th birthday.\nGovernor Sanwo-Olu in a statement issued by his Chief Press Secretary, Mr. Gboyega Akosile, described Osoba and Ogala who clock 82 and 60 respectively on Thursday, as Democrats and good ambassadors of the ruling party, APC.\n“Chief Olusegun Osoba is a true democrat and member of the progressive camp, who has been playing active roles in party politics and governance in Nigeria.\nHe also commended Ogala’s selfless service and dedication to the growth and development of Lagos State as a member of the State House of Assembly."
  },
  {
    "headline": "Massive fraud: NNPC failed to remit N3.88trn from crude oil sales in 2015 – Senate",
    "summarized_story": "By Kazeem UgbodagaThe Senate has faulted the Nigerian National Petroleum Corporation (NNPC) for under remitting the sum of N3.88 trillion revenue from domestic crude oil sales to the Federation Account for the period of January to December, 2015.\nAccordingly, the upper chamber called on the Corporation to desist from further deduction at source as this contravenes Section 162(1) of the 1999 Constitution (as amended).\nIt also mandated the Federation Accounts Allocation Committee (FAAC) or any other approving authority to, as a matter of urgency, approve agreed percentage which should be allocated to NNPC monthly as operational cost to ensure that their operations are not adversely affected.\nThe Accountant General is expected to report back to the Senate Committee on Public Accounts within ninety days.\nThe upper chamber queried the sums of N46,645,000.00 and N56,418,135.00 for the printing of the Ministry’s letter-headed paper, and demanded that the sum be recovered and paid back to the treasury."
  },
  {
    "headline": "What Buhari, Aisha told Alakija on her 70th birthday",
    "summarized_story": "Nigerian billionaire Folorunsho Alakija dedicated her resources to humanitarian causes, says President Muhammadu Buhari and his wife Aisha.\nAlakija will hit 70 years on July 15, 2021.\nBuhari and his wife chose to celebrate her exploit by extolling her qualities.\nThe President and the First Lady in a statement thanked Alakija for being an ardent supporter of many social, economic, religious and health causes, contributing generously to the fight against COVID-19 in the country through her donations.\nOn behalf of his family, the President offers his best wishes to this remarkable Nigerian, praying almighty God to grant her more years of robust health and happiness."
  },
  {
    "headline": "Delta Variant: UNILAG shut, orders students to vacate",
    "summarized_story": "By Chinyere NwachukwuThe University of Lagos (UNILAG) has directed its students to vacate the various halls of residence on campus with immediate effect.\nMrs Nonye Oguama, the Principal Assistant Registrar, Corporate Affairs, gave the directive in a statement on Wednesday in Lagos.\n‘’To check the spread of the dreaded disease on campus, the University Senate has directed that all students vacate the halls of residence latest by 12.00 noon on Thursday 15 July.\n“The situation is indeed worrisome, especially noting the reluctance of the majority of students to comply with the COVID-19 prevention protocols.\n“To avoid the escalation of cases on campus, the Senate at an emergency meeting held on Wednesday, July 14, approved that all students vacate the halls of residence by 12.00 pm on Thursday indefinitely,’’ Oguama said."
  },
  {
    "headline": "Gunmen Abduct First-Class Kogi Monarch, Demand N30m Ransom",
    "summarized_story": "Mohammed Adembe, a first-class traditional ruler in Kogi State and Adogu of Eganyi in Ajaokuta Local Government Area, was kidnapped by mysterious abductors along the Okene-Adogo route on Tuesday evening.\nThe kidnapping, which was one of many in recent months, happened just three days after the kidnapping of AbdulAzeez Obajimoh, the Managing Director of AZECO Pharmaceutical Company, in Ozuwaya in the state’s Okene district.\nObajimoh’s abduction was attended by gunshots that killed one Habeeb Anda and injured two others before the kidnappers escaped.\nConfirming the incident, the Police Public Relation Officer , Kogi State Police Command, Mr. William Ayah, said the monarch was kidnapped and that the police command has deployed special squad to trail the abductors.\nHe called on the general public to assist the police with useful information to enable security agents rescue the royal father."
  },
  {
    "headline": "President Buhari Removes Mask In Public, Flouts COVID-19 Regulations (Photo)",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), removed his protective mask in public on Tuesday evening, just days after the Nigeria Centre for Disease Control confirmed a case of Delta COVID-19 variant in Nigeria.\nThis was in violation of the Coronavirus Disease Health Protection Regulations (2021) he signed in January.\nThe President had attended a meal with members of the National Assembly at the State House Conference Centre in Abuja on Tuesday evening.\nThe President came at the occasion wearing his mask on, but later removed it inside the conference hall, according to photos released by Buhari Sallau, the President’s Personal Assistant on Broadcast Media."
  },
  {
    "headline": "Nigerian Government Asked Us To Abduct You – Kenya Operatives Told Nnamdi Kanu, Chained Him To Floor For Six Days",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra, was abducted in Kenya by security operatives who confessed to him that they were ordered by the Nigerian government to abduct him.\nAccording to report, Kenyan operatives tied Kanu to the floor for six days without knowing who he was until rumors of his capture began to circulate.\nThe revelations about what happened to Kanu in Kenya came out throughout the interview.\nKanu informed his lawyer, Ejiofor, that he was “mercilessly assaulted and tortured” in the East African country before his extradition to Nigeria, according to SaharaReporters on July 7.\nAt that level, we will confront an international court.”"
  },
  {
    "headline": "I May Die In DSS Custody Over ‘Worsening’ Health Issues – Nnamdi Kanu",
    "summarized_story": "“That on 30th June 2021, the Applicant’s Solicitors formally wrote to the State Security Service to allow the Applicant solicitors have access to the Applicant.\nThat the health personnel attending to the Defendant in the custody of the State Security Service is not adequate considering the circumstances of the Defendant’s health condition.\n“That if the health condition of the Defendant is not addressed most promptly, the Defendant may die in custody, even before his trial.\n“That the Defendant needs regular medical observation/attention by the Defendant’s Medical specialists/Consultants in Cardiology.\nThat the State Security Service is not a detention Centre, neither does it have the requisite custodial facilities to enhance the conditions of the occupants/inmates."
  },
  {
    "headline": "VIDEO: Barely 24 hours after, Team Nigeria second batch land in Tokyo ahead Olympic Games",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Nigeria’s female basketball team, D’Tigresses, in special display ahead USA exhibition match enroute Tokyo Olympics",
    "summarized_story": "PreviousINEC: Why we threw out Buhari’s nominee Onochie – Senate"
  },
  {
    "headline": "VIDEO – En route to Tokyo: Olympic-bound Taekwondo athlete, officials share flight experience",
    "summarized_story": ""
  },
  {
    "headline": "My one year journey in the office is rewarding-Pam -NigPilot",
    "summarized_story": "As the Executive Secretary, Nigeria Christian Pilgrims Commission, NCPC, Rev.\nPam assumed office as the 3rd executive secretary on July 7, 2020, a few months after President Muhammadu Buhari sacked the former executive Secretary, Rev Uja Tor Uja from office.\nAppreciating God for one year in the office, Pam said, “I thank God a year has rolled by, we are marching forward to fulfill the mandate of the NCPC.\nAlso, the Head, Media, and Public Relations Nigeria Pilgrim Commission, Mr. Celestine Toruka lauded the executive secretary for the indelible marks he has achieve in one year in the office.\n“He plays a fatherly role to all staff, no matter their status in the office."
  },
  {
    "headline": "Insecurity:NEMA distributes relief items to 2, 238 affected persons in Dabna -NigPilot",
    "summarized_story": "National Emergency Management Agency, NEMA, has delivered relief items approved for 2, 238 persons affected by the recent attack on the Dabna Community in Hong Local Government Area of Adamawa State.\nDirector-General of NEMA Alhaji Mustapha Habib Ahmed who delivered the items also sympathized with them over the unfortunate incident.\nResponding on behalf of Dabna Community, the District Head of Dugwaba Chief Simon Buba appreciated the Federal Government for the relief items delivered through NEMA.\nHowever, he appealed for more support to safeguard the community and enable the affected persons to rebuild their damaged homes to restore their livelihoods.\nThe relief materials were distributed to the 2, 238 persons comprising 373 households."
  },
  {
    "headline": "2023: Nigerians yearn for Owelle Rochas Okorocha’s presidency -NigPilot",
    "summarized_story": "The Nigerian political arena is currently agog with declarations and bids of many political heavyweights to succeed the incumbent President Mohammadu Buhari who will step aside in 2023 after his mandatory eight years in office.\nThat is why his office, the Nigerian Unity House, is currently besieged by multifarious groups to endorse the presidential ambition of the Ogboko born charismatic politician.\nWhy are so many groups from the Nigerian six geo-political zones drumming support for Owelle Rochas?\nToday, with the numerous visitations and endorsement from Nigerians at his unity house, the coast is clear for Owelle to emerge as Nigerian President in 2023.\nLong live Excellency Owelle Rochas Ehelbert Anayo Okorocha, Nigerian detribalized servant leader with the Midas touch to take Nigeria to the NEXT level as President in 2023."
  },
  {
    "headline": "Fire Outbreak: Gov. Yahaya pledges commitment to safeguard lives, property -NigPilot",
    "summarized_story": "Gombe State Governor, Inuwa Yahaya has stated his administration’s commitment to safeguarding the lives and property of citizens as an effort to combat fire outbreaks in the state.\nThe Governor said he was ready to double efforts to assist the fire service at the Federal and state levels to ensure the safety of lives and property.\nThe Governor acknowledged that the state fire service was in need of more firefighters hence the need for recruitment of more men.\nYahaya, however, stated that there would be more demands by the state government to the Federal Fire Service, FFS, to ensure that the state attends to fire incidents efficiently.\nLiman requested sponsorship of state fire service personnel in local and foreign training in view of emerging firefighting trends."
  },
  {
    "headline": "COVID-19 Third Wave: UNILAG Asks Students To Vacate Hostels",
    "summarized_story": "The management of the University of Lagos (UNILAG) has ordered students to vacate hostels on campus over fears of COVID-19.\nThere were fears in the university community on Tuesday after a number of students contracted the disease.\nThe development led the school management to convey an emergency Senate meeting on Wednesday.\nIn a statement issued after the meeting, the Senate said the students who tested positive for the disease, are being treated, and contact tracing already in place.\n“The situation is, indeed, worrisome especially noting the reluctance of themajority of students to comply with the COV1D-19 prevention protocols,” the statement read."
  },
  {
    "headline": "Supreme Court Orders FG To Refrain From Ceding Oil Wells To Imo",
    "summarized_story": "The Supreme Court has granted an order of injunction refraining the Federal Government and its agencies from ceding oil wells at Akri and Mbede communities, to Imo State.\nThe order was granted on Wednesday to stop a purported implementation of the ceding of about 17 oil wells to Imo State, pending the determination of a suit brought before the court by the Rivers State Government.\nIn the ruling, the Supreme Court restrained the Attorney General of the Federation and the Attorney General of Imo State, from taking further action on the ownership of the Oil Wells, till the disputes surrounding them are resolved.\nThe Rivers State government through its Attorney General had dragged the AGF and the Attorney of Imo State before the Supreme Court over the disputed oil wells.\nRivers State, therefore, urged the Supreme Court to declare that the correct instrument, maps and documents to be relied on in determining the boundary between Rivers and Imo State are those used by the plaintiff in delineating the boundary lines between Rivers and Imo."
  },
  {
    "headline": "Nigeria Confirms 154 More COVID-19 Cases As Third Wave Fears Rise",
    "summarized_story": "COVID-19 cases have continued to soar in Nigeria as 154 more infections were confirmed in the country on Tuesday, raising further concerns about the third wave of the pandemic which was first detected in the West African nation in February 2020.\nNigeria Centre for Disease Control (NCDC), the agency spearheading the fight against the pandemic, announced the latest figures in its daily update late Tuesday.\nOf the number of confirmed infections for the day under review, Lagos State had 119 new cases, while Akwa Ibom followed with 11 more persons contracting the disease.\nAs of the time of this report, Nigeria has confirmed 168,867 cases while 164,623 have been discharged.\nDespite fears over the spike in cases and the confirmation of the highly contagious Delta strain, many Nigerians have abandoned safety protocols recommended by health authorities."
  },
  {
    "headline": "Two Soldiers Killed As Troops Repel ESN Attack In Enugu",
    "summarized_story": "Two soldiers were killed during a firefight between troops of the Nigerian Army and Eastern Security Network (ESN) members at Adani community of Uzo-Uwani Local Government Area of Enugu State.\nThis was contained in a statement signed on Wednesday by Director Army Public Relations, Brigadier General Onyema Nwachukwu.\nThe incident occurred when the troops were trying to repel an attack by the ESN on troops’ location at Iggah/Asaba checkpoint.\nTroops are currently on the trail of the criminals,” Nwachukwu said in the statement.\nThe Nigeria Army, therefore, assured the general public of its commitment to provide adequate security in the general area in collaboration with other security agencies."
  },
  {
    "headline": "Pop Star Olivia Rodrigo Pushes Biden’s Youth Vaccination Drive",
    "summarized_story": "Teen pop sensation Olivia Rodrigo said Wednesday she is “in awe” of White House efforts to get Americans vaccinated against COVID-19 and said getting the shot was “easy.”Rodrigo, who has some 28 million social media followers, is adding star power to the Biden administration attempt to lure young people to vaccination centers.\nThe singer and Disney actress was meeting President Joe Biden and his top coronavirus advisor Anthony Fauci and will record videos to encourage youth vaccinations.\n“I’m in awe of the work President Biden and Dr Fauci have done,” Rodrigo, 18, said alongside Press Secretary Jen Psaki at the start of the daily White House media briefing.\n“It’s important to have conversations with friends and family members, encouraging all communities to get vaccinated,” she said.\nAccording to the Centers for Disease Control and Prevention, 48 percent of the US population has been fully vaccinated and 55.5 percent have received at least one dose."
  },
  {
    "headline": "EU commission unveils extensive climate crisis plan that could transform economy",
    "summarized_story": "The European Commission has made historic recommendations to establish a zero-carbon economy, including a special tariff on polluting imports, according to authorities.\nOn Wednesday, the EU executive proposed establishing a separate carbon market, which would result in higher consumer prices for gasoline and heating oil.\nThe bloc proposed the world’s first carbon border tariff, which would impose emissions costs on steel, cement, and aluminum imports.\nThe measure is intended to shield European industries from foreign competitors who do not face the same carbon costs.\nThe EU executive, the European Commission, proposed a 55 percent cut in CO2 emissions from cars by 2030 versus 2021 levels, much higher than the existing target of a 37.5 percent reduction in CO2 emissions by that time."
  },
  {
    "headline": "Third Wave of COVID-19: UNILAG asks students to vacate hostels immediately",
    "summarized_story": "The Senate of the University of Lagos (UNILAG), Akoka, has mandated the institution’s management to ask all students to vacate hostels “with immediate effect.”“The Senate at its meeting held today, Wednesday considered the situation of third wave of COVID-19 in Lagos State and its implications for the university.\nThe Senate resolved that all students should vacate the halls of residence immediately,” the source said.\nThe Senate also approved commencement of virtual lectures from July 26.\nThe Senate, which comprises professors, heads of the departments and other lecturers, is the supreme organ of a university on academic matters including approval of results and award of certificates"
  },
  {
    "headline": "Pope Francis leaves hospital ten days after colon surgery",
    "summarized_story": "More than a week after undergoing surgery, Pope Francis has returned to the Vatican.\nThe pope was released from a hospital in Rome on Wednesday, ten days after undergoing surgery to have half of his colon removed.\nA Vatican official said, Francis stopped by the Santa Maria Maggiore church and “expressed his thankfulness for the success of his surgery and offered a prayer for all the sick, especially those he had met during his stay in hospital”.\nFrancis was in “excellent, overall condition, awake, and breathing spontaneously” after undergoing surgery for a blockage in his large intestine, according to the Vatican.\n“During these days in the hospital, I’ve realised how important good health care is — accessible to all, as it is in Italy and other countries."
  },
  {
    "headline": "Buhari Excited Nigerians Voted For Him Despite Being Poor – Trending With Ojy Okpe",
    "summarized_story": "Arise News celebrates the Chairman and Editor-in-Chief of THISDAY ARISE Media Group Prince Nduka Obaigbena who turned 62 today.\nReactions have trailed President Muhammadu Buhari’s comment about being excited that Nigerians voted for him despite not being richThe senate on Tuesday prescribed a 20 year jail term for persons caught snatching ballot materials and a fifteen year jail term for those who influence the out come of electionsGhanian first lady Rebecca Akufo-Addo has offered to refund all the allowances she has received amounting to 899, thousand Ghanaian cedes, since the her husband president Nana Akufo Addo assumed office in 2017 following a public outcry over salaries"
  },
  {
    "headline": "Messi Agrees Five-year Barcelona Contract, Takes Huge Pay Cut: ESPN",
    "summarized_story": "The 34-year-old’s previous contract was worth over €500 million over four years and that expired at the stroke of midnight on June 30.\nHowever, with the return of Joan Laporta as president in March, Messi grew more open to staying at Camp Nou.\nHe will link up with Ronald Koeman’s squad later in the summer, with Barca’s league campaign kicking off on August 15 against Real Sociedad at Camp Nou.\nHe was Barca’s president when Messi made his first-team debut and when he signed his first professional contract with the club.\nIn public and in private, Laporta had always maintained that he was “convinced” he could persuade Messi to stay."
  },
  {
    "headline": "ICC to Consider Yoruba Secessionist Sunday Igboho’s Petition Against President Buhari",
    "summarized_story": "The International Criminal Court (ICC) says it will consider a petition filed by Yoruba Nation separatist agitator Sunday Adeyemo, popularly known as Sunday Igboho; Banji Akintoye, leader of Ilana Omo Oodua, and 49 other Yoruba self-determination groups against Nigeria’s President Muhammadu Buhari.\nThe Yoruba nation agitators are demanding the secession of the southwestern states from Nigeria and is in tune with the demands of the governors of the region.\n“In Nigeria, there are ongoing violations of Human Rights, as expressed specifically in the Rome Statute, being perpetrated against the Yoruba People, particularly genocide under Article 6, and Crimes Against Humanity under Article 7, of the Rome Statute,” the petition read in part.\n“This communication has been duly entered in the Communications Register of the Office,” Dilon said in a letter to the petitioners’ lawyer.\n“We will give consideration to this communication, as appropriate, in accordance with the provisions of the Rome Statute of the International Criminal Court."
  },
  {
    "headline": "Burna Boy, Tiwa Savage, Ed Sheeran, Others to Perform in Global Citizen Concert to Unite the World, Defeat Poverty",
    "summarized_story": "Nigerian grammy award winning Burna Boy alongside Ed Sheeran will lead a group of artistes to perform at the Global Citizen live concert aimed at uniting the world, defending the planet and defeating poverty.\nGlobal Citizen Live is powered by citizens around the world who are taking action together with governments, corporations and philanthropists to make change.\nSpace can wait!”“I am very excited to perform at the Global Citizen Live concert this year.\nAccess Bank, will also support the Global Citizen Live campaign as a partner in Nigeria.\nSince March 2020, Global Citizen has mobilized $2 billion in cash grants to fund global pandemic relief efforts, and over 26 million COVID-19 vaccine doses."
  },
  {
    "headline": "Pope Francis Returns to Vatican 10 days after Surgery",
    "summarized_story": "Pope Francis was discharged from a Rome hospital and returned home to the Vatican on Wednesday, 10 days after undergoing surgery to remove half his colon.\nAfter the brief stop, Francis’ small motorcade approached a side entrance to the Vatican.\nFrancis had half of his colon removed for a severe narrowing of his large intestine on July 4, his first major surgery since he became pope in 2013.\nThe Vatican spokesman, Matteo Bruni, confirmed Francis’ return from the hospital and visit to the Rome basilica.\nThe Vatican had originally said Francis could be discharged last weekend, but later said he would stay a few days extra for further recovery and rehabilitation therapy."
  }
]