[
  {
    "headline": "Assembly worries over students’ clashes, police invite parents",
    "summarized_story": "The Ogun State Police Command said it had invited the parents of the students who allegedly unleashed mayhem in some parts of Abeokuta, the state capital.\nThe students were alleged to have caused violence after a gambling competition went awry between two public schools in Abeokuta.\nThe state Police Public Relations Officer, DSP Abimbola Oyeyemi, said the command could not arrest the students because they were underage.\nHe, however, said the command had invited their parents.\nWe are making efforts jointly with the school authorities and the parents to make sure that such an ugly incident does not recur.”Meanwhile, the state House of Assembly has expressed concern over the spate of violent clashes involving secondary school students in the state."
  },
  {
    "headline": "FG team, NARD in three-hour meeting to avert doctors strike",
    "summarized_story": "The Minister of Health, Dr Osagie Ehanire, was absent on Tuesday as the Federal Government delegation and the leadership of the National Association of Resident Doctors met to iron out issues in a bid to forestall a fresh strike by the association.\nIn a bid to prevent a fresh strike, Ehanire had reached out to the association and fixed a meeting for Tuesday.\nAccording to the NARD president, the meeting, which lasted three hours, saw the Federal Government and NARD’s delegates ironing out issues affecting resident doctors across the country.\n“For the hazard allowance, we were told that it does not only concern the resident doctors but all doctors in Nigeria.\n“We also spoke on the minimum wage, they promised to write to the institutions owing minimum wage and also the Budget office."
  },
  {
    "headline": "Retrenchment protest: We will vehemently oppose victimisation, says Kaduna NLC chairman",
    "summarized_story": "In my position as the chairman of the NLC in Kaduna State, we represented the congress at the said public hearing.\nWe are not comfortable with what is happening at the moment as regards how some state governments are treating their local governments.\nIt will also interest you to know that Coca-Cola, Pepsi and their likes are no longer doing production in Kaduna State.\nI am calling on both the federal and Kaduna State governments to look into this issue with interest and revive the said industries.\nThe situation that Kaduna State civil servants are going through is not palatable; they are getting afraid of losing their jobs and they are no longer their usual selves."
  },
  {
    "headline": "Nnamdi Kanu's rearrest: 'Nigeria in its last breath'",
    "summarized_story": "The Alaigbo Development Foundation, ADF, has warned that the Federal Republic of Nigeria is reaching its last breath.\nADF issued the warning in reaction to the rearrest of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, by the Nigerian government.\nADF said that Kanu’s rearrest may lead to an unfortunate developement for Nigeria.\n“Earlier in the day, we saw a social media news item with the headline: “Nnamdi Kanu arrested and Boko Haram fighters released”.\n“We call on the International Community not to turn its back on the horrors taking place in Nigeria, especially in Igboland."
  },
  {
    "headline": "Nnamdi Kanu was rearrested in Kenya, detained illegally",
    "summarized_story": "Reno Omokri, a former aide to ex-President Goodluck Jonathan, has hinted that Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, was rearrested in Kenya.\nIn a tweet, Omokri said the government official disclosed that Kanu’s detention was illegal.\nNnamdi Kanu was NOT arrested or extradited by the British.\n“According to this official, Kanu was “almost definitely arrested in KENYA” and “it was an illegal detention”.\nNigerian govt rearrest IPOB leader, Nnamdi Kanu"
  },
  {
    "headline": "Makinde sacks commissioners in Oyo",
    "summarized_story": "Governor Seyi Makinde of Oyo State has sacked some of his commissioners.\nDAILY POST gathered that the sack of the commissioners is coming two years after they were appointed.\nThe announcement was made few minutes ago during the state executive meeting in Ibadan held on Tuesday.\nDAILY POST gathered that the termination of the appointments of the state executive council takes effect from today, July 29.\nDetails later…Gov Uzodinma fires 20 commissioners"
  },
  {
    "headline": "Alleged N220m scam: Saraki's cousin, Ope converted 13 buses to ambulances",
    "summarized_story": "The trial of a former Special Assistant to Kwara Governor Abdulfatah Ahmed on Millennium Development Goals, Ope Saraki, resumed on Tuesday.\nThe third prosecution witness (PW3) Dr. John Adeyeye Abiodun, told the court of how the defendant introduced him to Chemiroy Nigeria Limited.\nHe recalled that they both agreed to refurbish and convert thirteen Toyota Hiace buses to ambulances.\nThe contract involved purchase of 13 units of ambulances for General/Specialist Hospitals in Kwara.\nWhile some were paid through bank transfer some were paid to the defendant in cash”."
  },
  {
    "headline": "Nnamdi Kanu's rearrest: Nigerians now understand why Buhari postponed UK trip",
    "summarized_story": "Joe Igbokwe, a chieftain of the All Progressives Congress, APC, has celebrated the rearrest of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB.\nIgbokwe, who said Kanu’s arrest indicated that it’s all over, said Nigerians now understand why President Muhammadu Buhari postponed his medical trip to London.\nThe Special Adviser to Lagos State Governor, Babajide Sanwo-Olu on Drainage and Water Resources made the remark while celebrating the rearrest of Kanu.\nMay the souls of hundreds of young men who lost their lives in the Southeast rest in perfect peace.\n“You can now understand why PMB postponed his UK visit last week.”Kanu was arrested on Sunday and extradited to Nigeria to continue his trial."
  },
  {
    "headline": "VIDEO: How FG re-arrested IPOB’s leader Nnamdi Kanu, by AGF Malami",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "We are yet to resume Dubai flights because Emirates and other airlines gave us conditions that were not acceptable to us - Sirika",
    "summarized_story": "Aviation Minister, Hadi Sirika has explained why the country is yet to resume flights to United Arab Emirates.\nSpeaking during the briefing by the Presidential Steering Committee on COVID-19, Hadi Sirika said Emirates and other airlines gave the federal government conditions that were not acceptable.\nAccording to the Minister, Dubai authorities insisted that all passengers intending to visit the country must use Emirates airline or spend two weeks in the alternative carrier’s country before entering Dubai.\nHe stated that the protocol appeared to be targeted at only Nigerians and was not backed up by scientific reasons.\nSirika said;"
  },
  {
    "headline": "‘Wrong syllabus’ not responsible for mass failure in 2021 UTME – JAMB",
    "summarized_story": "Some candidates who wrote the UTME examination had alleged that they were given old syllabus of 2015-2020 for Literature – in English text as against the one of 2020 – 2025.\nThe candidates said the mix-up in the syllabus was responsible for their failure in the examination.\nBut JAMB in the statement argued that all UTME questions are based on texts prescribed for the UTME in its syllabus.\nIt is not automatic that the NECO/WAEC syllabus should transform into JAMB’s otherwise there would not have been a need for a separate syllabus for the UTME.\nOut of this figure, 1,340,003 candidates registered for UTME and 75, 498 registered for DE."
  },
  {
    "headline": "Nine things to know about Nnamdi kanu’s rearrest",
    "summarized_story": "The Federal Government on Tuesday presented the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu before Federal High Court in Abuja.\nThe Attorney General and Minister of Justice, Abubakar Malami said: “Self-acclaimed leader of the proscribed secessionist Indigenous People of Biafra (IPOB), Nnamdi Kanu, hasbeen intercepted through the collaborative efforts of Nigerian intelligence and Security Services.”Here are nine things to know about Nnamdi kanu’s rearrest1.\nAlthough there are no details on where he was re-arrested, Malami said he was re-arrested on Sunday July 273.\nHe was re-arrested and bought back to Nigeria to continue facing trial after disappearing while on bail regarding 11 count charge against him.\nHe was advised to get in touch with his lawyers on what happened in the case since he has been away."
  },
  {
    "headline": "Woman finds love, marries and gives birth between 47-50 years of age",
    "summarized_story": "A Nigerian woman, Ladunni Idowu Giwa-Osagie has welcomed her first child at almost the age of 50.\nLadun met her husband, Aigbovo-Giwa-Osagie when she turned 47, they got married at 48, she became pregnant at 49 and on June 25th, 2021, just before her 50th birthday, shegave birth to a baby boy named Osarumuwese Oluwaseyitanfunmi Nosakhare.\nHer heartwarming testimony and inspiring personal story was shared by a friend, Ifeanyi Omeni on Monday, June 28."
  },
  {
    "headline": "Anambra guber: Moghalu assembles legal team, vows to seek legal redress",
    "summarized_story": "Warning that he will explore every opportunity to seek redress the charade primaries in the state last weekend, he promised to appear and follow the Appeal processes.\n“The arrogant incompetence of the farce orchestrated by the primary committee chairman, Prince (Dr.) Dapo Abiodun, his team and the people they answer to, insult every man and woman in Anambra State.\nThey have sought to rubbish the hard work and sacrifice that has gone into building the APC in Anambra State.\nUnleashing his evidence for the battle ahead, he said: “In the 2017 election for Governor of Anambra State, a total of 448, 771 people voted in Anambra State in an election that was keenly contested by 37 political parties and their candidates.\n“As we speak, no major television station in the country has one recorded video clip of elections taking place anywhere in Anambra State."
  },
  {
    "headline": "BREAKING: IPOB leader Nnamdi Kanu re-arrested",
    "summarized_story": "From Godwin Tsa, AbujaThe Federal Government has intercepted the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, and has produced him before a Federal High Court for the continuation of his trial.\nKanu is facing trial for alleged treason and was granted bail in April 2017 by a federal high court sitting in Abuja.\nAttorney General of the Federation, Abubakar Malami who announced this on Tuesday said the fleeing IPOB leader was intercepted on Sunday and brought back to the country for the continuation of his trial.\nMalami who was accompanied by the Inspector General of Police, Usman Baba Ahmed, disclosed that Kanu was intercepted and brought to the country on Sunday.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "NYSC determined to take unemployed Nigerians out of labour markets, DG tells Sun management",
    "summarized_story": "From Romanus Ugwu, AbujaThe Director-General, National Youth Service Corps (NYSC), Brigadier General Shuaibu Ibrahim, has said that the scheme is determined to take unemployed Nigerians out of labour markets.\nWith integration there will be unity, peace, development and with these, corps members can be mobilised year in year out.\n“In the course of mobilising the corps members, we have come to realise that skill acquisition is very germain because white cola jobs are not readily available anywhere.\n“I am happy to inform you that the corps members that took advantage of our skills acquisition training are doing wonderfully well.\n“I want to urge Nigerians to take interest in what the NYSC is doing."
  },
  {
    "headline": "FG laments Nigeria’s low level education ranking in Africa",
    "summarized_story": "From Agaju Madugba, KatsinaThe Federal Government has described as unacceptable, the nation’s low level education ranking in Africa, arguing that if not redressed the country may not produce the necessary manpower to compete with the rest of the world in the 21st century global economy.\nMinister of State for Education, Chukwuemeka Nwajiubu, who stated this, yesterday, in Katsina, lamented that Nigeria had the highest number of out-of-school children in sub-Saharan Africa.\nHe listed some of the issues hampering the development of education in the country to include, infrastructure decay, inadequate number of qualified teachers and inadequate instructional facilities.\nHe spoke at the launch of the Better Education Service Delivery for All (BEDSA) programme, a World Bank-assisted project in collaboration with the Federal Ministry of Education.\n“Education is critical for national development as it is the only way we can produce adequate manpower to run the country."
  },
  {
    "headline": "ACF places lawmakers on alert over expected PIB",
    "summarized_story": "Chairman of the ACF, Audu Ogbe, gave the charge, yesterday, in Abuja, at a retreat organised for Northern lawmakers on the Petroleum Industry Bill (PIB).\nHe explained that President Buhari’s statement indicated that a bill on the restructuring of the country may be before the National Assembly anytime from now.\nConsequently, the ACF chairman stated that it is imperative for the Northern lawmakers to be adequately prepared.\nBesides, Ogbe said the northern body, after a meeting to discuss the issue would present “something” to the lawmakers to work on.\nAt our last meeting in Kaduna, we extended an invitation to Ohanaeze, Afenifere and the South South Peoples Congress that we want to engage them and have a conversation on the subject."
  },
  {
    "headline": "Court Orders Nnamdi Kanu’s Remand in DSS Custody",
    "summarized_story": "By Alex EnumahJustice Binta Nyako of the Abuja Division of the Federal High Court on Tuesday ordered the remand of fugitive leader of the indigenous People of Biafra (IPOB) Nnamdi Kanu in the custody of the department of State services (DSS).\nThe remand order was sequel to an application by federal government lawyer, Shuaibu labaran.\nRuling on the request for remand in the custody of the DSS, Justice Nyako, held that the Prosecution should inform Kanu’s lawyer of his rearrest and remand in the custody of the DSS.\nKanu was granted bail in 2017 and subsequently jumped bail and was declared wanted by the government.\nApart from jumping his bail, the federal government is also holding Kanu responsible for recent acts of violence in the Southeast."
  },
  {
    "headline": "News in Photographs: Nnamdi Kanu in Handcuffs",
    "summarized_story": "The leader of the indigenous People of Biafra, Nnamdi Kanu, has been arrested by security agencies.\nHe was said to have been arrested on Sunday.\nThe Attorney General of the Federation and Minister of Justice, Abubakar Malami, announced his arrest at a joint press briefing with heads of security agencies on Tuesday.\nSee photos of the IPOB leader in handcuffs.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: IPOB Leader, Nnamdi Kanu, Arrested",
    "summarized_story": "The federal government on Tuesday said leader of indigenous People of Biafra, Nnamdi Kanu, has been arrested by security agencies.\nHe was said to have been arrested on Sunday.\nAttorney General of the Federation and Minister of Justice, Abubakar Malami, who made the disclosure at a joint press briefing with heads of the department of security services and the police, said Kanu would be taken to court to continue with his trial.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "House to Pass PIB, Electoral Act, Supplementary Budget in 2 Weeks",
    "summarized_story": "Femi Gbajabiamila, has announced that the lawmakers will pass the long awaited Petroleum Industry Bill, Electoral Act and Supplementary Budget in two weeks.\nHe tasked the lawmakers to put all hands on deck to ensure these key legislations were passed within two weeks before embarking on their summer break mid July.\nHe said, “I will be meeting with the adhoc committee on PIB today by 3pm to tidy up somethings.\nWe need to pass these legislations before we go on summer break.\nThese are landmark legislations, including the supplementary budget.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "CBN Releases 50,000mt of Maize to Curb Price Arbitrage",
    "summarized_story": "By James EmejoThe Central Bank of Nigeria (CBN) has approved the release of 50,000 metric tonnes of maize to 12 major producers to control the price of the commodity.\nEarlier in February, maize farmers had criticised agitations by some groups for the importation of the commodity, describing it as a calculated attempt to further hinder maize production in the country.\nAlso, the National President of MAGPAMAN, Dr. Edwin Oche, had stated that the CBN’s massive investment in ABP had boosted maize production from eight million metric tonnes to about 20 million metric tonnes within three years.\nHe said local farmers had the capacity to grow enough maize to support both industrial use and local consumption.\nWe will not be talking about the increase in feeds, flour and all the derivatives from maize and others."
  },
  {
    "headline": "EXCLUSIVE: How IPOB Leader, Nnamdi Kanu Was Arrested By Nigerian Government",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous Peoples of Biafra (IPOB), was picked up at a location in Africa, a top source in the Nigerian government has revealed to SaharaReporters.\nSaharaReporters had earlier reported that the family of Nnamdi Kanu asked the Federal Government not to manhandle their son, who is currently in the custody of the Department of State Services (DSS).\nSpeaking in Umuahia, the Abia state capital, Nnamdi Kanu's younger brother, Emmanuel Kanu said the IPOB leader stood on the path of truth and committed no crime to deserve any persecution.\nHe said the whole world is watching how the Nigerian Government will handle Kanu.\n\"My brother stood for the truth, and Heaven is on the part of anyone standing for the truth."
  },
  {
    "headline": "EXCLUSIVE: How IPOB Leader, Nnamdi Kanu Was Arrested By Nigerian Government",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous Peoples of Biafra (IPOB), was picked up at a location in Africa, a top source in the Nigerian government has revealed to SaharaReporters.\nSaharaReporters had earlier reported that the family of Nnamdi Kanu asked the Federal Government not to manhandle their son, who is currently in the custody of the Department of State Services (DSS).\nSpeaking in Umuahia, the Abia state capital, Nnamdi Kanu's younger brother, Emmanuel Kanu said the IPOB leader stood on the path of truth and committed no crime to deserve any persecution.\nHe said the whole world is watching how the Nigerian Government will handle Kanu.\n\"My brother stood for the truth, and Heaven is on the part of anyone standing for the truth."
  },
  {
    "headline": "How IPOB Leader, Nnamdi Kanu Was Blindfolded, Handcuffed, Sneaked Into Abuja Court",
    "summarized_story": "The leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has been arrested in the United Kingdom and brought to the Federal High Court, Abuja by heavy security operatives.\nKanu was blindfolded and sneaked into the courtroom by operatives of the Department of State Services (DSS) in handcuffs while his legs were also chained.\nThe prosecution applied that Kanu jumped bail and wanted him to be remanded at DSS custody.\nKanu was on October 14, 2015, arraigned by the Nigerian Government over allegations of terrorism, money laundering, treason, etc.\nOn March 28, 2019, his bail condition was revoked by Justice Binta Nyako of the Federal High Court."
  },
  {
    "headline": "How IPOB Leader, Nnamdi Kanu Was Blindfolded, Handcuffed, Sneaked Into Abuja Court",
    "summarized_story": "The leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has been arrested in the United Kingdom and brought to the Federal High Court, Abuja by heavy security operatives.\nKanu was blindfolded and sneaked into the courtroom by operatives of the Department of State Services (DSS) in handcuffs while his legs were also chained.\nThe prosecution applied that Kanu jumped bail and wanted him to be remanded at DSS custody.\nKanu was on October 14, 2015, arraigned by the Nigerian Government over allegations of terrorism, money laundering, treason, etc.\nOn March 28, 2019, his bail condition was revoked by Justice Binta Nyako of the Federal High Court."
  },
  {
    "headline": "WikiTimes’ Publisher, Family Threatened, After Dogara’s Constituency Story",
    "summarized_story": "Haruna Mohammed Salisu, publisher of WikkiTimes, an online news platform, and his family have been threatened following the publication of an investigative report exposing how Yakubu Dogara, a former speaker of the House of Representative and Universal Basic Education Commission (UBEC) squandered N1 billion constituency school project.\nThe investigation revealed that the former Speaker squandered N1 billion allocated to building model schools in Bauchi South Federal Constituency.\n“He told them that I have travelled, and they asked if he was aware of a ‘damaging’ story I did about Yakubu Dogara, he told them that he was not aware of anything.\nThe threats came hours after a group, Dogara Digital Media Support Team wrote and circulated a purported rejoinder debunking WikkiTimes’ Investigation.\nAccording to CPJ, between 1992 to 2021, at least 24 Nigerian journalists have either died or got missing while doing their jobs."
  },
  {
    "headline": "TIMELINE: After almost 4 years of hide-and-seek, Nnamdi Kanu back in DSS net",
    "summarized_story": "AdvertisementLater that year, several courts ordered the release of the IPOB leader, but the DSS failed to comply.\nOn April 25, 2017, the federal high court in Abuja granted Kanu bail on “health grounds”, and three days later he became a free man once again after being detained for 18 months.\nBut the IPOB leader had retorted that “any person who comes to arrest Nnamdi Kanu in Biafra land will die here”.\nSPOTTED IN GHANAMonths after he failed to appear at the resumed trial, TheCable reported that the IPOB leader was spotted in Ghana alongside his wife in February 2018.\nIt appeared nothing much was done with the information by security operatives, but afterwards, the IPOB leader wasn’t seen in public for a while."
  },
  {
    "headline": "TIMELINE: After almost 4 years of hide-and-seek, Nnamdi Kanu back in DSS net",
    "summarized_story": "AdvertisementLater that year, several courts ordered the release of the IPOB leader, but the DSS failed to comply.\nOn April 25, 2017, the federal high court in Abuja granted Kanu bail on “health grounds”, and three days later he became a free man once again after being detained for 18 months.\nBut the IPOB leader had retorted that “any person who comes to arrest Nnamdi Kanu in Biafra land will die here”.\nSPOTTED IN GHANAMonths after he failed to appear at the resumed trial, TheCable reported that the IPOB leader was spotted in Ghana alongside his wife in February 2018.\nIt appeared nothing much was done with the information by security operatives, but afterwards, the IPOB leader wasn’t seen in public for a while."
  },
  {
    "headline": "British High Commission speaks on Nnamdi Kanu's arrest",
    "summarized_story": "The British High Commission has spoken on the arrest of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nAdvertisementDean Hurlock, a spokesperson of the British High Commission, told TheCable that while they can confirm Kanu’s arrest, he was not picked up in the UK where he is based.\nThe IPOB leader, who is also a UK citizen, had been in the UK since 2017 when he fled Nigeria.\nAdvertisementThe AGF did not say where exactly the secessionist leader was arrested, but Hurlock told TheCable when contacted that it was outside of the UK.\n“We can confirm that Nnamdi Kanu was not arrested in the UK for extradition purposes,” he said via text message."
  },
  {
    "headline": "British High Commission speaks on Nnamdi Kanu's arrest",
    "summarized_story": "The British High Commission has spoken on the arrest of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nAdvertisementDean Hurlock, a spokesperson of the British High Commission, told TheCable that while they can confirm Kanu’s arrest, he was not picked up in the UK where he is based.\nThe IPOB leader, who is also a UK citizen, had been in the UK since 2017 when he fled Nigeria.\nAdvertisementThe AGF did not say where exactly the secessionist leader was arrested, but Hurlock told TheCable when contacted that it was outside of the UK.\n“We can confirm that Nnamdi Kanu was not arrested in the UK for extradition purposes,” he said via text message."
  },
  {
    "headline": "REWIND: How Nnamdi Kanu hired American firm to help promote IPOB in $750k deal",
    "summarized_story": "On Tuesday, Abubakar Malami, attorney-general of the federation, announced the arrest and extradition of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nAdvertisementThe IPOB leader was subsequently re-arraigned before a federal high court in Abuja for charges bordering on alleged treason.\nIn April 2017, the IPOB leader was granted bail by the court on charges bordering on treasonable felony but later skipped the bail.\nDuring his sojourn abroad, Kanu had reportedly signed some deals and formed alliances in a bid to achieve the Biafra goal.\nAdvertisementTHE $750,000 IPOB DEAL WITH AMERICAN FIRMAccording to a report from Foreign Lobby, Kanu signed a contract with BW Global Group, an American lobbying firm, to help promote IPOB in a bid to achieve the secession objective of Biafra."
  },
  {
    "headline": "Ghana kicks off first fully digital census in West Africa",
    "summarized_story": "Ghana has started its long-awaited fully-digital national census; the first-ever in West Africa.\nThe country has, every 10 years since 1981, conducted the Population and Housing Census (PHC) but was forced to postpone the 2020 census due to the outbreak of the Covid-19 pandemic.\nThe fully digital PHC is said to have cost the government $84 million, around 50% more than the last census.\nIt sees the West African nation join the list of African countries to collect national data electronically, an exclusive club that includes only Swaziland, Malawi, and Kenya.\nMeanwhile, South Africa is in line for its first-ever digital census."
  },
  {
    "headline": "Nigeria’s electoral umpire commences voter registration. Here’s what you need to know",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Monday, June 28, 2021, commenced the continuous voter registration (CVR) exercise nationwide.\nAs the voter registration exercise kicks off, INEC has announced guidelines to help people understand how the new process will work.\nThe INEC voter registration exercise will be done both online and in-person, according to Obo Effanga, Resident Electoral Commissioner at INEC in Rivers State.\nOnline registration: This can be done on a new INEC portal, where Nigerians can fill in all their details and print out the slip.\nWho can participate in the Voter Registration?"
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Ghana-based Jetstream raises $3m to build tech solutions for Africa’s trade corridors",
    "summarized_story": "Ghana’s Jetstream has closed a $3 million seed round as it aims to build digital infrastructure for Africa’s trade corridors.\nPreviously, the company received pre-seed funding from Hustle Fund in San Francisco and C5 Capital in London through the PeaceTech accelerator.\nAs Addy told attendees at AB2020’s 2019 Tech in Ghana Accra event, Jetstream was initially started as a logistics company for cosmetics manufacturers in South Africa.\nIn November 2020, Jetstream added trade finance for customers who found it difficult to fill large purchase orders.\nAdvertisementIn addition to Port Tema, Jetstream counts an unnamed Asia-based global shipping line as a major customer and early adopter of its technology."
  },
  {
    "headline": "Nigerian fintech, Cowrywise, secures SEC’s licence to digitise investments in Nigeria",
    "summarized_story": "Nigerian Wealth management startup, Cowrywise Financial Technology Limited “Cowrywise”, has secured an asset management licence from the Securities and Exchange Commission (SEC).\nThe licence, dubbed the “Fund/Portfolio Management Licence”, gives companies the right to manage funds and investment portfolios on behalf of retail investors.\nWe’ve been developing this for some time and the SEC licence eliminates the regulatory obstacles to launching such a product,” he says.\nHowever, the requirements for SEC’s fund manager licence are more capital intensive.\nConsidering Cowrywise’s position as a constantly innovative fintech company, it is not clear if this rule would be adjusted specifically for fintech companies."
  },
  {
    "headline": "Jiji acquires Cars45, Nigeria’s e-voting process, extinction of bank branches predicted",
    "summarized_story": "This acquisition could see Jiji strengthen trust amongst buyers as both companies’ business models will be integrated.\nFind out more about the details of this acquisition and what it could mean for eCommerce in Africa.\nRead here: Jiji reportedly acquires Cars45 for an undisclosed amountLikely sign?\nIn line with that announcement, an online Continuous Voter Registration (CVR) action is ongoing on INEC’s continuous voter registration portal.\nThis registration is open to eligible voting citizens who want to get a voter’s card for the first time or registered voters who need to review their voter registration, update information, or transfer voter registration to another polling unit."
  },
  {
    "headline": "Nigerians bypass Dubai ban, travel through Ghana",
    "summarized_story": "Since the suspension of flight operations between Nigeria and the United Arab Emirates (UAE), some Nigerians have been exploring other options of travelling to Dubai or any of the United Arab Emirates states.\nNigerians, who can no longer wait for Dubai to lift its flight ban, are now seeking other alternative by first going to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s power sector needs infrastructure investment model to unlock liquidity",
    "summarized_story": "In order to unlock liquidity in Nigeria’s power sector, the country must completely jettison its subsidy system and switch its investment model from consumption to infrastructure assets, leading power sector players said on Tuesday.\nAt BusinessDay’s 2021 future of power conference, private investors and government officials said Nigeria must switch from investment in wasteful subsidies…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Zuma, former South African president gets 15-month jail term for contempt",
    "summarized_story": "He failed to comply with an order of the Constitutional Court.\nA cohesive order that is again defied would only further impune the integrity of the Constitutional Court.\nAdvocate Tembeka Ngcukaitobi for the commission urged the court to sentence Zuma to two years in jail.\nZuma has not opposed these contempt of court proceedings and has indicated no intention of participating in those proceedings.\nOn January 28, the Constitutional Court ordered Zuma to comply with summonses to testify before Deputy Chief Justice Raymond Zondo."
  },
  {
    "headline": "Obaseki inaugurates 15-man c’ttee to screen political nominees, gives two weeks ultimatum – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated a 15-man committee, charged with the responsibility of screening political nominees that will be appointed into his cabinet.\nObaseki, during the inauguration ceremony at the Government House, Benin City, urged the committee, headed by Prof. Dennis Agbonlahhor, to submit its report on or before 15th of July, 2021.\nOthers are, Osayamwanbor Agbons; Matthew Iduoriyekemwen; Dr. (Mrs.) Bob Osazee; Prof Maureen Isoken Ebomoyi; Prof. Ahmed Uwubamwen; Hillary Otsu and Pastor Osagiede Joseph.\nWe believe that in the next two to three weeks, you will come with what we can work with,” he added.\nIn his response, the Chairman of the Committee, Prof. Agbonlahor said, “We will try as much as possible to deliver on our mandate within the stipulated time.”..."
  },
  {
    "headline": "Obaseki signs audit bill into law, to establish Audit Service Commission, Office of Auditor-General – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, signed the Edo State Audit Bill 2021 into law to ensure accountability and transparency in governance.\nObaseki, while signing the bill at the Government House in Benin City, thanked the State House of Assembly for expeditiously passing the amendment bill into law.\n“So, the Audit Service Commission, when established, will be made up of reputable and credible persons who will ensure the right thing is done,” he added.\nEarlier, the Speaker of Edo State House of Assembly (EDHA), Hon.\nMarcus Onobun said, “We have passed the bill to repeal the Edo State Audit Law 2019 and enact the Edo State Audit Law 2021, which provides for the establishment of the Audit Service Commission and the Office of the Auditor-General of Edo State and Local Governments and other connected purposes.”..."
  },
  {
    "headline": "New Traffic Directive: EDSTMA Sends out Parking purview, modalities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Poised to make Edo State a dream state, devoid of traffic buildup, the Edo State Traffic Control and Management Agency (EDSTMA) has put out a parking purview/modalities to guide against random parking of vehicles by motorists.\nSpeaking with the Nigerian Observer Newspaper on the road traffic law which comes into immediate effect in the state, Head of Enlightenment, EDSTMA, OMORUYI EGUAVOEN, appealed to motorists to comply with the directive to make for the ease of driving.\nRoutes where cars are to be parked on the right side of the road from Ring Road are – the New Lagos road on Forestry road; from Sapele road on the First East Circular; from Sapele road on the Third East Circular; from Sakponmba road to First East Circular on Igun Street and from Mission road to Akpakpava on Cook road.\nOthers are- Mission road to Akpakpava on James Watt road; to Oba Palace on Plymouth road; from Airport road on Akenzua street; from Akenzua street to Ekenwan road on Stadium road; from Oba Market road up till Isekhere Junction on Ibiwe Street.\nAlso, up to Mission road on Navis Road; from Urubi to Upper Lawani on Lawani Street; from Urubi to New Lagos Road on 3rd Cemetery Street; up to Sapele Road on Adesuwa Grammar School Road and from Sapele Road to Upper Sakponmba on Erediawa Street."
  },
  {
    "headline": "Ondo Riverine Communities Come Alive With Electricity Courtesy CNL, PIND, IRDC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The hitherto electricity elusive riverine Communities in Ondo State, recently came alive with sustainable electricity as NNPC/ Chevron Nigeria Limited(CNL) Joint Venture in conjunction with Partnership Initiative for Niger Delta ( PIND), Ilaje Rural Electricity Development Committee (IRDC) inaugurated a solar power electricity project.\nThe project, a Solar Power Mini Grid Energy Cabins’’ which would benefit no fewer than 200 residents in the communities was initiated by the IRDC and funded by NNPC/Chevron.\n“The communities should prioritise these projects and guarantee its security in order to charge the government to do more and extend such to other riverine communities to bring succour to them.\nNigerian Observer gathered that IRDC was a community-based organisation solely funded by NNPC/Chevron Nigeria Ltd.\nAt the moment, PIND is also working with other private sector investors interested in providing solar energy in the riverine communities (as a for-profit business) using this model for scale up."
  },
  {
    "headline": "Groups seek women’s inclusion in reconciliation, reintegration in Northern Nigeria",
    "summarized_story": "ADVERTISEMENTThe UN Women, International Organisation for Migration and the Centre for Humanitarian Dialogue have called for the in­clu­sion of women in the rein­te­gra­tion, rec­on­cil­i­a­tion and re­ha­bil­i­ta­tion process in the North-east.\nThey stressed the need for women’s participation in the states rav­aged by the Boko Haram in­sur­gency to achieve bet­ter re­sults.\nThe organisations made the call in Abuja at a dialogue on women’s inclusion in reintegration and reconciliation in North-eastern Nigeria.\nThe discussion comes amidst clamour for women inclusion as well as active roles in key sectors, leadership positions and important conversations.\nThe HD country and programme manager, Millicent Lewis-Ojumu, had emphasised the importance of women inclusion in conflict resolution."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NIDCOM Reacts To UAE’s Employment Visa Restriction",
    "summarized_story": "Nigerians in the Diaspora Commission (NIDCOM) has reacted to the alleged suspension of Direct Visa Employment for Nigerians by the authorities of the United Arab Emirates (UAE) over rising crime perpetrated by Nigerians in the Middle East country.\n“We all are shouting that our country is bad, and that our government is not rising to our needs, which is true, but our reputation abroad is also fast declining due to our character.\n“The UAE government is now tracking every Nigerian in Abu Dhabi and they have also banned every Direct Employment Visa from Nigeria until further notice,” the source said.\nADVERTISEMENT“We had warned severally that they were determined to take stern measures and the activities of a few may affect the generality of the many Nigerians going about their stay lawfully.\nWhile we will continue to advocate non generalization of us as a people, we must condemn bad behavior and those who commit a crime will face the penalty,” Odu told LEADERSHIP yesterday."
  },
  {
    "headline": "NIDCOM Reacts To UAE’s Employment Visa Restriction",
    "summarized_story": "Nigerians in the Diaspora Commission (NIDCOM) has reacted to the alleged suspension of Direct Visa Employment for Nigerians by the authorities of the United Arab Emirates (UAE) over rising crime perpetrated by Nigerians in the Middle East country.\n“We all are shouting that our country is bad, and that our government is not rising to our needs, which is true, but our reputation abroad is also fast declining due to our character.\n“The UAE government is now tracking every Nigerian in Abu Dhabi and they have also banned every Direct Employment Visa from Nigeria until further notice,” the source said.\nADVERTISEMENT“We had warned severally that they were determined to take stern measures and the activities of a few may affect the generality of the many Nigerians going about their stay lawfully.\nWhile we will continue to advocate non generalization of us as a people, we must condemn bad behavior and those who commit a crime will face the penalty,” Odu told LEADERSHIP yesterday."
  },
  {
    "headline": "Poor Preparation Cause Of Mass Failure – JAMB",
    "summarized_story": "Joint Admissions and Matriculation Board (JAMB) has said the mass failure recorded in the 2021 Unified Tertiary Matriculation Examination (UTME) is as a result of the poor preparations of candidates who sat for the exams.\nADVERTISEMENT“The truth of the matter is that all Unified Tertiary Matriculation Examination (UTME) questions are based on texts prescribed for the UTME in its syllabus.\n“To ensure that its syllabus is accessible to all candidates sitting its examination, the Board has made the material available on three platforms.\n“The rumour of mass failure is a fluke and a campaign by those whose source of illicit income has been further blocked.\n“The total number of candidates who took the UTME are 1,300,722 with 78,389 candidates absent."
  },
  {
    "headline": "Poor Preparation Cause Of Mass Failure – JAMB",
    "summarized_story": "Joint Admissions and Matriculation Board (JAMB) has said the mass failure recorded in the 2021 Unified Tertiary Matriculation Examination (UTME) is as a result of the poor preparations of candidates who sat for the exams.\nADVERTISEMENT“The truth of the matter is that all Unified Tertiary Matriculation Examination (UTME) questions are based on texts prescribed for the UTME in its syllabus.\n“To ensure that its syllabus is accessible to all candidates sitting its examination, the Board has made the material available on three platforms.\n“The rumour of mass failure is a fluke and a campaign by those whose source of illicit income has been further blocked.\n“The total number of candidates who took the UTME are 1,300,722 with 78,389 candidates absent."
  },
  {
    "headline": "Davido’s Close Ally, Obama, Dies Of Heart Related Ailment",
    "summarized_story": "Top Nigerian singer, Davido, has lost his ally, Obama DMW, to the close hands of death.\nObama DMW whose real name is Habeeb Uthman, was said to have died of suspected heart failure.\nSadly, Obama died a few hours later.\nKnown to be an associate of Davido, Obama DMW has been around the singer since 2017.\nObama DMW was also a music executive and founded his music label named Obama Music Worldwide (OMW)."
  },
  {
    "headline": "Buhari welcomes Matawalle into APC, says its performance makes it more popular",
    "summarized_story": "Buhari welcomes Matawalle into APC, says its performance makes it more popularBuhari welcomes Matawalle into APC, says its performance makes it more popularBy TANKO ALIPresident Muhammadu Buhari has congratulated the Governor of Zamfara State, Bello Matawalle, on his defection from thePeoples Democratic Party (PDP) to the All Progressives Congress (APC), saying that the ruling party “is becoming more popular because of its impressive performance record and commitment to good governance.”In a message delivered on his behalf by Boss Mustapha, the Secretary to Government of the Federation (SGF) at the defection ceremony in Gusau on Tuesday, President Buhari said:“I’m proud of your timely and wise decision to join the governing party and our doors are wide open to other politicians who believe in our vision to rebuild Nigeria.\n“Your voluntary decision to join our party confirms the fact that our agenda for good governance is the only reason why Nigerians are getting attracted to the APC because the other alternative didn’t work.”The President used the occasion to urge APC Governors and elected lawmakers across the country “to continue to work harder to ensure our party maintains its popularity and retains power beyond 2023.”He reminded all elected party officials of the fact that “your performance at all levels will impact significantly on the fortunes of the party”, adding that “party leaders should avoid complacency at all times in order to build the APC from strength to strength.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari welcomes Matawalle into APC, says its performance makes it more popular",
    "summarized_story": "Buhari welcomes Matawalle into APC, says its performance makes it more popularBuhari welcomes Matawalle into APC, says its performance makes it more popularBy TANKO ALIPresident Muhammadu Buhari has congratulated the Governor of Zamfara State, Bello Matawalle, on his defection from thePeoples Democratic Party (PDP) to the All Progressives Congress (APC), saying that the ruling party “is becoming more popular because of its impressive performance record and commitment to good governance.”In a message delivered on his behalf by Boss Mustapha, the Secretary to Government of the Federation (SGF) at the defection ceremony in Gusau on Tuesday, President Buhari said:“I’m proud of your timely and wise decision to join the governing party and our doors are wide open to other politicians who believe in our vision to rebuild Nigeria.\n“Your voluntary decision to join our party confirms the fact that our agenda for good governance is the only reason why Nigerians are getting attracted to the APC because the other alternative didn’t work.”The President used the occasion to urge APC Governors and elected lawmakers across the country “to continue to work harder to ensure our party maintains its popularity and retains power beyond 2023.”He reminded all elected party officials of the fact that “your performance at all levels will impact significantly on the fortunes of the party”, adding that “party leaders should avoid complacency at all times in order to build the APC from strength to strength.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nnamdi Kanu to court: I fled Nigeria to save my life",
    "summarized_story": "Leader of the proscribed Indigenous People of Biafra, IPOB, Nnamdi Kanu, on Tuesday, gave reasons why he abandoned his trial and escaped out of the country in 2017.\nKanu, who was re-arrested and brought back to Nigeria last Sunday, told the Federal High Court in Abuja that he fled the country to save his life.\nHe sought permission of the court to speak, shortly after he was docked before trial Justice Binta Nyako by the Federal Government.\nThe IPOB leader explained that he did not deliberately abscond from the court to avoid trial.\n“I would have been killed the way others were killed when my house was invaded,” Kanu added."
  },
  {
    "headline": "Nnamdi Kanu to court: I fled Nigeria to save my life",
    "summarized_story": "Leader of the proscribed Indigenous People of Biafra, IPOB, Nnamdi Kanu, on Tuesday, gave reasons why he abandoned his trial and escaped out of the country in 2017.\nKanu, who was re-arrested and brought back to Nigeria last Sunday, told the Federal High Court in Abuja that he fled the country to save his life.\nHe sought permission of the court to speak, shortly after he was docked before trial Justice Binta Nyako by the Federal Government.\nThe IPOB leader explained that he did not deliberately abscond from the court to avoid trial.\n“I would have been killed the way others were killed when my house was invaded,” Kanu added."
  },
  {
    "headline": "Fani-Kayode warns FG: ‘Nnamdi Kanu must not die in custody’",
    "summarized_story": "By Kazeem UgbodagaFormer Aviation Minister, Femi Fani-Kayode has warned the Federal Government not to allow leader of the Indigenous People of Biafra (POB), Nnamdi Kanu die in custody.\nReacting to Kanu’s arrest on Tuesday, Fani-Kayode advised the Federal Government to ensure he did not die in custody.\nHe said Kanu should be treated with decency, decorum and respect.\nIn his words: “It is no longer news that Mazi Nnamdi Kanu has been arrested and detained.\n“I advise the Federal Government to ensure that he does not die in custody and that he is treated with decency, decorum and respect.”"
  },
  {
    "headline": "Eric Adam’s lead shrinks in New York mayoral race",
    "summarized_story": "Agency ReportsNew vote totals released on Tuesday in New York City’s Democratic mayoral contest sharply narrowed the lead for Eric Adams, the Brooklyn borough president.\nThe additional votes left the outcome even more uncertain with thousands of absentee ballots still to be counted over the coming weeks.\nTuesday’s count, however, did not include any of the approximately 125,000 absentee ballots that have been received, which could easily alter the final results.\nElections officials plan to rerun the ranked-choice voting tabulation next week, this time with at least some absentee ballots included.\nLast week, Adams had 32% of first-choice ballots, based on the incomplete results released on Election Day."
  },
  {
    "headline": "Makinde sacks 17 commissioners, Chief of Staff",
    "summarized_story": "Governor Seyi Makinde of Oyo State has dissolved his cabinet, sacking the Chief of Staff (CoS) and 17 Commissioners.\nThe remaining cabinet members who were not sacked were the Secretary to the State Government (SSG), Head of Service (HOS) and the Director General of Due Process office.\nA statement by the Chief Press Secretary to the governor, Mr. Taiwo Adisa, indicated that Makinde announced the dissolution of the Executive Council after a meeting of the body on Tuesday.\nMakinde told the sacked cabinet members it was time to retool after two years.\nGovernor Makinde thanked the commissioners and the chief of staff for their contributions and wished them well in the future."
  },
  {
    "headline": "Oyo Governor, Seyi Makinde Dissolves Cabinet",
    "summarized_story": "The State Executive Council meeting in Oyo has been dissolved by Governor Seyi Makinde.\nThe breakup was reportedly revealed at the Executive Council Chamber, Agodi Secretariat, Ibadan, during the weekly Council meeting on Tuesday.\nMr Taiwo Adisa, the Governor’s Chief Press Secretary, verified the dismissal.\nHe vowed to provide comprehensive details on the political appointees who will be affected.\nAccording to unconfirmed accounts, all of the commissioners were impacted."
  },
  {
    "headline": "In Ogun, Police Arrest Two Persons For Impersonation",
    "summarized_story": "The police in Ogun State have arrested two suspects for impersonating police officers and carrying fake warrant cards.\nAbimbola Oyeyemi, the Ogun police spokesperson, disclosed this in a statement on Tuesday.\nMr Oyeyemi said the arrested suspects portrayed themselves to be police officers in Ibogun town, Ifo local government area of Ogun State and attempted to defraud a hotel owner.\n“He stated further that the two men were threatening to bundle him into their motor if he refused to meet their demands.\nMr Oyeyemi said two forged police warrant cards were recovered from the suspects."
  },
  {
    "headline": "Ortom Opens Up On Reviewing Open Grazing Law In Benue",
    "summarized_story": "Governor of Benue State, Samuel Ortom, has stated that there is no policy reversal on the state’s Open Grazing Prohibition and Ranches Establishment Law.\nOn Tuesday, the Governor talked with journalists after reviewing completed and ongoing projects in Makurdi, the state capital, amid media reports that the state has reconsidered its stance on open grazing.\nThe Apir-Tse-Poor road project and electrification spanning 12 Kilometres according to the Governor costs N1.4 billion to execute.\nGovernor Ortom directed the SUBEB Chairman to ensure that all primary schools in Makurdi metropolis and other major towns are provided with customised desks and chairs.\nBenue Television, renovation work on the Administrative Block of Benue Peoples House, Arabic Primary School, Central Primary School and Holy Ghost Primary School all in Wadata were also inspected."
  },
  {
    "headline": "Court Sends LASU Student To 21 Years In Prison For Raping Fellow Student",
    "summarized_story": "Afeez Ogunbowale, a student at Lagos State University (LASU), was sentenced to 21 years in jail on Tuesday by an Ikeja Special Offences Court for his role in the armed robbery and rape of two fellow LASU students.\nJustice Oluwatoyin Taiwo condemned Ogunbowale after finding him guilty of five counts including conspiracy, rape, and armed robbery, according to the Nigerian News Agency (NAN).\n“The defendant is hereby sentenced to five years’ imprisonment for conspiracy, 21 years’ imprisonment each for counts of armed robbery and 21 years’ imprisonment each for counts of rape.\nOn hearing the sentence, Ogunbowale who has been suspended by LASU over the case, wept profusely at the dock.\n“The defendant and one of his accomplices who is still at large had unlawful sexual intercourse with the complainants."
  },
  {
    "headline": "Breaking: In Oyo, Makinde sacks Commissioners, others",
    "summarized_story": "Oyo state Governor Seyi Makinde on Tuesday announced the immediate dissolution of his cabinet.\nThose affected include according to the governor’s Chief Press Secretary include Chief of Staff (CoS) and 17 Commissioners.\nGovernor Makinde, then, expressed the gratitude of the government and the people of Oyo State to the Council members, and wished them well in their future endeavours.\nThe statement said: “His Excellency, the Governor of Oyo State, ‘Seyi Makinde, announced the dissolution of the State Executive Council, with effect from Tuesday June 29, 2021.\n“Governor Makinde, after a prolonged meeting of the Council, told members it was time to retool after two years."
  },
  {
    "headline": "Breaking: Call Gernot Rohr to order, he must stop discrimination among Super Eagles, FG tells NFF",
    "summarized_story": "The federal government has directed the Nigeria Football Federation (NFF) to call Super Eagles technical Gernot Rohr to order and ensure the Franco-German handler perform his duties optimally.\nMinister of Youth and Sports Development Sunday Dare who was visibly surprise that coach Rohr was not present with the home-based Super Eagles team when he visited on Tuesday evening wondered why Rohr will discriminate the class of Nigerians to coach in the team.\nThe Minister said, “Gernot Rohr was employed by Nigerians, therefore, he should not discriminate those he wants to coach.\nBoth home-based and foreign-based players exhibit great talents and they all must be respected and treated well.\n“NFF must call him to order and ensure he abides by the contract he signed.”Prior to the commencement of Super team B camp ahead of Mexico friendly clash few days ago, serving national technical director Austin Eguaveon was drafted by NFF to coach the home-based players, a development that has unsettled the country’s football community."
  },
  {
    "headline": "Breaking: Bandits free Niger district head, wives, Islamiyya school student escape",
    "summarized_story": "The District Head of Zungeru in the Wushishi local government of Niger state, Alhaji Alamu Mustapha Madaki, kidnapped along with his two wives in his palace about 23 days ago has regained freedom from abductors.\nThe source who pleaded anonymity said, “The relations of the now free district head must have paid the N10 million ransom demanded by the bandits before he was released”.\nIn another development, one of the abducted students of Salihu Tanko Islamiyya school in Tegina escaped from her captives on Monday.\n“Zaynab is undergoing medical treatment and profiling before she will be handed over to her parents,” the source said.\nFifteen of the adults abducted from the school had escaped from their captives and reunited with their families."
  },
  {
    "headline": "Defection: Gov Matawalle has lost his memory – PDP Chairman -NigPilot",
    "summarized_story": "…Says PDP will bounce back in 2023National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Tuesday said Governor Bello Matawalle of Zamfara State must have lost his memory on how he came into office despite the fact that he lost the 2019 governorship election in the state.\nAddressing a press conference at the PDP national secretariat in Abuja, Prince Secondus said Governor Matawalle, who is on the verge of defecting to the ruling All Progressives Congress, APC, came into office on a statutory mandate given to the PDP by the Supreme Court.\nThe governors have one vote but we are after the people, the masses, the people who are suffering under this government.\n“It is a shame for all the governors that left the PDP for fear.\nThey were intimidated by the instrument of this government but am happy that the masses in their state especially in Zamfara none of them left.”"
  },
  {
    "headline": "Terrorism: NAF advocates for regional collaboration -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Air Force (NAF) on Tuesday said that there is a need for enhanced regional cooperation in the fight against insurgency and terrorism in the West African sub-region.\nIt added that the Armed Forces of Nigeria (AFN) and other armed forces in the region must synergize their efforts in view of the transnational nature of terrorism and its impact on the security of the entire region.\nHe applauded the Senegalese Armed Forces for always being on hand to collaborate with the Nigerian Air Force (NAF) whenever the need arises.\nThe Inspector-General of Senegalese Armed Forces (SAF), General El hadji Daouda Niang said he was in Nigeria to seek collaboration as well as strengthen cooperation between the SAF and the AFN.\nHe commended the NAF and other Services for their commitment to Nigeria’s internal security as well as the regional security of West Africa."
  },
  {
    "headline": "2021 UTME: JAMB denies using wrong syllabus, links performance to ill-preparation -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB, has said that all the 2021 Unified Tertiary Matriculation Examination, UTME, were based on texts prescribed for the examination in its syllabus.\nJAMB was reacting to the candidates’ allegation that the mass failure in the 2021 UTME was as a result of the Board using the old syllabus in setting its questions.\n“The truth of the matter is that all Unified Tertiary Matriculation Examination (UTME) questions are based on texts prescribed for the UTME in its syllabus.\n“For instance, in the 2021 UTME, 1, 415,501 registered for both UTME/DE.\nOut of this figure, 1,340,003 candidates registered for UTME and 75, 498 registered for DE."
  },
  {
    "headline": "OLED TVS perfect for cinema, sports/ gaming- GM -NigPilot",
    "summarized_story": "With Dolby Vision® ultra-vivid high dynamic range imaging, Dolby Atmos® immersive sound, and for the first time ever, Dolby Vision IQ, LG OLED TVs deliver a truly spectacular video-audio experience.\nWith stellar picture quality and newly added gaming features, LG TVs are ideal for serious gamers, delivering the most seamless, immersive big-screen gaming experiences available anywhere.\nWith unparalleled variable refresh rate and ultra-fast response time, LG OLED TV is considered the most advanced gaming TV on the market today.\nWith the extremely low input lag of expensive desktop gaming monitors, detail-packed visuals of today’s games are simply jaw-dropping on LG OLED TVs.\nIn another industry-first, LG OLED TVs feature the HDR Gaming Interest Group’s HGiG Mode, so gamers can enjoy high-quality visuals as game creators and developers intended when playing HDR games via consoles on their LG TVs."
  },
  {
    "headline": "Nnamdi Kanu Rearrested, Brought Back To Nigeria",
    "summarized_story": "﻿Leader of the Indigenous People of Biafra, Nnamdi Kanu has been rearrested and brought back to Nigeria.\nKanu is expected to be re-arraigned before the Federal High Court for the continuation of his trial.\nMr Kanu has repeatedly called for the breakaway of a significant chunk of southern Nigeria to form the Republic of Biafra.\nHowever, Mr Kanu fled the country in September 2017 after an invasion of his home by the military in Afara-Ukwu, near Umuahia, Abia State.\nSince then he has been sighted in Israel and has continued to rally his supporters in Nigeria to employ violence in achieving secession."
  },
  {
    "headline": "Supplementary Budget: Senate President Turns Down Committee’s Request For More Time",
    "summarized_story": "Emperor Simon, AbujaSenate President Ahmad Lawan on Tuesday turned down a request from the Senate Committee on Appropriations for an extension of two weeks to enable it submit its report on the supplementary budget requested by President Muhammadu Buhari.\nThe proposed supplementary budget is intended to be used to equip the military, fund Covid-19 vaccination programs and the management of HIV.\nThis is a very straightforward supplementary budget request.\nSo you submit tomorrow please.”Meanwhile, the House of Representatives on Tuesday also received a request for the consideration of the supplementary budget.\nApproved by FECPresident Muhammadu Buhari transmitted the supplementary budget of N895.8 billion to the Senate for approval last Tuesday."
  },
  {
    "headline": "Why NNPC Is Borrowing To Acquire 20 Percent Equity In Dangote Refinery – Mele Kyari",
    "summarized_story": "﻿Solomon Elusoji, LagosThe Managing Director of the Nigerian National Petroleum Corporation, Mele Kyari, on Tuesday explained why the national oil company is purchasing a stake in Dangote oil refinery.\nHe argued that the decision was also driven by the profit potential of the refinery business.\nIt has a cash-flow that is sustainable because refinery business, in the short term, will continue to be sustainable.\n“That’s why banks have come forward to lend to us, so we can take equity in this.”What Mr Kyari Said“Dangote refinery will come into production by 2022.\nIt has a cash-flow that is sustainable because refinery business, in the short term, will continue to be sustainable."
  },
  {
    "headline": "FG Extends NIN-SIM Verification To July 26",
    "summarized_story": "The Federal Government on Monday said it has approved the extension of the deadline for NIN-SIM data verification to July 26.\nThis was communicated via a statement signed jointly by spokespersons of the Nigerian Communications Commission (NCC) and the Nigeria Identity Management Commission (NIMC).\n“The decision to extend the deadline was made after a request by stakeholders on the need to consolidate the enrolment and NIN-SIM verification process following the rapid increase in the number of enrolment systems across the country,” the statement said.\nThe agencies also noted that as of June 28, a total of 5,410 enrollment systems have been made available nationwide to “significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM.\n“It is worthy of note that there were only about 800 such enrolment systems as at December 2020."
  },
  {
    "headline": "Ukraine Beat Sweden To Set Up Quarter-Final Tie With England",
    "summarized_story": "Artem Dovbyk scored in the 121st minute as Ukraine beat 10-man Sweden 2-1 after extra time on Tuesday to book a quarter-final tie with England at Euro 2020.\nOleksandr Zinchenko put Ukraine ahead on 27 minutes in Glasgow but Emil Forsberg equalised for Sweden before half-time with his fourth goal of the tournament.\nMarcus Danielson was sent off for Sweden in extra time before Dovbyk headed in a Zinchenko cross in stoppage time to send Ukraine through to face England in Rome on July 3."
  },
  {
    "headline": "President Buhari welcomes Governor Matawalle into APC",
    "summarized_story": "President Muhammadu Buhari has congratulated the Governor of Zamfara State, Bello Matawalle, on his defection from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC), saying that the ruling party “is becoming more popular because of its impressive performance record and commitment to good governance.”In a message delivered on his behalf by Boss Mustapha, the Secretary to Government of the Federation (SGF) at the defection ceremony from the PDP in Gusau on Tuesday, President Muhammadu Buhari said:“I’m proud of your timely and wise decision to join the governing party and our doors are wide open to other politicians who believe in our vision to rebuild Nigeria.\n“Your voluntary decision to join our party confirms the fact that our agenda for good governance is the only reason why Nigerians are getting attracted to the APC because the other alternative didn’t work.”AdvertisementThe President used the occasion to urge APC Governors and elected lawmakers across the country “to continue to work harder to ensure our party maintains its popularity and retains power beyond 2023.”He reminded all elected party officials of the fact that “your performance at all levels will impact significantly on the fortunes of the party”, adding that “party leaders should avoid complacency at all times in order to build the APC from strength to strength.”"
  },
  {
    "headline": "Sowore faults “hurried” arraignment of Nnamdi Kanu",
    "summarized_story": "Leader and convener of the Revolution Now Movement, Omoyele Sowore has faulted what he called the hurried arraignment of the leader of the Independent Peoples of Biafra, Nnamdi Kanu before a Federal High Court in Abuja.\nOmoyele Sowore himself was at another court for another matter when he got information that Nnamdi Kanu had been brought to court and was to be arraigned.\n“I came down here but to my surprise, he had been brought here and they have taken him away.” Sowore said.\nI came here to ensure that everything goes well with him.” he said complaining that not allowing Kanu the opportunity of a lawyer was a major minus on the part of the Federal Government.\nAdvertisementHe also alleged that Kanu was hooded as no one was able to see his face both in and out of the court."
  },
  {
    "headline": "Governor of Oyo state, Seyi Makinde dissolves cabinet",
    "summarized_story": "The Oyo state Governor Seyi Makinde has dissolved the state’s Executive Council.\nThe dissolution was confirmed through a press statement issued by the Chief Press Secretary to Governor Seyi Makinde, Taiwo Adisa.\nAccording the statement, those affected include Chief of Staff to the Governor Bisi Ilaka and 17 other commissioners.\nAdvertisementThe governor commended the former executive members for their commitment to the development of the state.\nAccording to the statement, the governor therefore wished the ex-commissioners the best in their future endeavours"
  },
  {
    "headline": "Nigeria Senate to Debate Report on Petroleum Industry Bill Thursday",
    "summarized_story": "The Nigerian Senate will on Thursday debate the report of its joint committees on Petroleum (Upstream, Downstream and Gas) on the Petroleum Industry Bill (PIB).\nPresident of the Senate, Ahmad Lawan stated this on Tuesday after the chairman of the committee, Senator Mohammed Sabo submitted the committees’ report.\nHe said, “We will be considering the report on Thursday.\nWe have today, tomorrow and Thursday to look at the report so that when we consider the report, we will be doing so on the basis of what we have been able to read from this very important report.”Successive sessions of the legislature had failed to pass the PIB since it was first introduced in 2008 under the Olusegun Obasanjo administration.\nBy Abel Ejikeme"
  },
  {
    "headline": "Nigeria: Court Orders Detention of Separatist IPOB Leader Kanu in DSS Custody",
    "summarized_story": "A Nigerian court has ordered the detention of Nnamdi Kanu, the leader of a separatist group, Indigenous People of Biafra (IPOB) in the custody of the Department of State services (DSS).\nJustice Binta Nyako of the Abuja Division of the Federal High Court gave the order on Tuesday and is sequel to an application by counsel to the federal government, Shuaibu labaran.\nKanu was said to have been intercepted by joint security operatives of the government.\nRuling on the request for remand in the custody of the DSS, Justice Nyako, held that the Prosecution should inform Kanu’s lawyer of his rearrest and remand in the custody of the DSS.\nMr Kanu was arrested in October 2015 on charges of criminal conspiracy and belonging to an illegal society."
  },
  {
    "headline": "Nigeria Government Announces Re-arrest of Separatist Leader Nnamdi Kanu",
    "summarized_story": "The Nigerian government says it’s rearrested Nnamdi Kanu, a self acclaimed leader of a group seeking the secession of the southeastern region.\nThe federal government on Tuesday said the separatist leader of the Indigenous People of Biafra was intercepted by security agencies on Sunday June 27.\nMr Malami said he’s being arraigned at the Federal High Court in Abuja, but refused to disclose where the separatist leader was arrested.\nSecessionist feeling has simmered in the southeast since the Biafra separatist rebellion of 1967-70 that tipped Nigeria into civil war and killed around 1 million people.\nMr Kanu was arrested in October 2015 on charges of criminal conspiracy and belonging to an illegal society."
  },
  {
    "headline": "Yoruba Nation Rally In Lagos – Trending With Ojy Okpe",
    "summarized_story": "A coalition chaired by renowned historian Professor Banji Akintoye has declared full support for the Yoruba Nation rally to be led by Sunday Adeyemo popularly Known as Sunday Igboho on July 3rd in Lagos State.\nFollowing the suspension of Emirates flights to Nigeria, by the federal government, the minister of Aviation , Hadi Sirika on Monday accused the Airline of discriminating against Nigerian travellers .\nFollowing the Murder saga of television executive, Micheal Usifo Ataga, On Monday the television executives’ brother Dr. Isi Ataga in a statement titled, ‘Who will speak for Usifo Ataga ?’Expressed doubt that the murder was carried out by a single person owing to the manner the murder was committed."
  },
  {
    "headline": "Nigeria: Looking Beyond the Distractions, Ozigbo, Uba Call For Unity in Anambra PDP Ahead of November Guber Polls – Arise News",
    "summarized_story": "The two candidates produced by separate governorship primary elections of the Peoples Democratic Party in Anambra state have called for unity within the party and figure out how to tackle the dislocations and distractions the party is experiencing.\nMr Valentine Ozigbo and Senator Ugochukwu Uba both made the appeals on Tuesday when they featured on an ARISE News programme, The Morning Show.\nThe aim for the party according to the candidates should be how to defeat the governing All Progressives Grand Alliance in the state, the All Progressives Congress and the Young Progressives Party.\nWatch the interview for more."
  }
]