[
  {
    "headline": "Israel foils weekend terror attack as anxiety waxes",
    "summarized_story": "Israeli forces foiled a major terror attack over the weekend as Prime Minister Naftali Bennett warned of “many more” attempted attacks in the coming days, CBN News confirmed this on its verified Twitter page on Monday.\nIsraeli police said members of its counter-terrorism forces killed three Palestinian suspects during a raid on a terror cell in the West Bank on Saturday.\n“Information was received of a terror squad on its way to commit an attack,” police said, adding that the group was involved in recent attacks against Israeli forces.\nBennett said the police’s actions prevented an “imminent attack”, and warned citizens to be vigilant as Israel faces a new wave of terror.\n“We are now entering a period of ‘alert routine’ when we want the citizens of Israel and the security forces to be on high alert,” the PM said on Sunday."
  },
  {
    "headline": "Sri Lankan president invites political parties to form new government",
    "summarized_story": "Sri Lankan President, Gotabaya Rajapaksa, on Monday, extended an invitation to all political parties to join the government to find solutions to the ongoing crisis in the country.\n“The president invites all political parties represented in the parliament to come together to accept ministerial portfolios in order to find solutions to this national crisis,” the statement said.\nSri Lanka’s Central Bank Governor, Ajith Nivard Cabraal, also tendered his resignation to President Rajapaksa on Monday.\nSri Lanka had, for days, been facing public protests calling on immediate measures to be taken by the government to solve the economic crisis.\nA state of emergency was declared in Sri Lanka on Friday and a 36-hour curfew came into place in the evening the next day, which was, however, lifted on Monday morning."
  },
  {
    "headline": "DIABETIC KETOACIDOSIS (DKA)",
    "summarized_story": "This build up of Ketones give rise to Diabetic Ketoacidosis.\nDiabetic Ketoacidosis can occur in a space of 24 hours.\nA woman that has been emotionally abused will have her body produce some hormones that antagonize insulin, and Ketoacidosis can occur.\nDKA can also lead to brain swelling that can eventually cause a Coma and fluid build up in the Lungs.\nDKA can also lead to brain swelling that can eventually cause a Coma and fluid build up in the Lungs."
  },
  {
    "headline": "APM Terminals Apapa unveils smart office building as part of $438m investment in Lagos",
    "summarized_story": "By Godwin OritseNigeria’s largest container terminal, APM Terminals Apapa has commissioned a new digital administrative building as part of its $438 million investment in port development in Nigeria.\nAlso speaking, the Country Managing Director of APM Terminals Nigeria, Klaus Laursen, said APM Terminals Apapa has invested a total of $438 million on enabling developing infrastructure, acquiring equipment and improving processes at the terminal.\n“In APM Terminals, we have led with a strong ambition to become a world-class terminal operator.\n“The aim is to make APM Terminals Apapa a better trade and logistics zone.\nThe Port Manager, Lagos Port Complex Apapa, Olufunmilayo Olotu; the Commissioner of Police Apapa Port, Jonathan Towuru, the chief executive"
  },
  {
    "headline": "Why I’m leading Yahaya Bello’s campaign organisation —Hafsat Abiola",
    "summarized_story": "The Director-General, DG, of the Yahaya Bello Presidential Campaign Organisation, Hafsat Abiola, has said she is leading the campaign efforts of Governor Yahaya Bello because she has studied the aspirant and has seen in him the qualities needed to take Nigeria to its right destination.\nHafsat Abiola, daughter of the winner of the 1993 presidential election, late MKO Abiola, said one of the similarities between her late philanthropist father and the Governor of Kogi State, Yahaya Bello, was that they both refused to have political godfathers.\n“These are the same qualities I have seen in Governor Bello.\n“Yahaya Bello is the best man for the job.\nThousands of Nigerians from all walks of life had stormed the Eagle Square at the nation’s capital on Saturday to witness the official acceptance of Governor Yahaya Bello to vie for the 2023 Presidency."
  },
  {
    "headline": "Katsina 2023: I won’t buy form for N21m, It’s teaching aspirants to steal — PDP guber aspirant",
    "summarized_story": "According to Muttaqha, the announcement is invariably telling aspirants to steal if they eventually occupy the office.\nIn his words:“How can you ask aspirants to pay N21 million just to contest for governorship.\nN21 million is 10 months salary of a Governor.\nHowever, if you manage to pay the money and you lose in the election, you will become impoverished.\nAccording to Muttaqha, only government workers or politicians who are thieves or involved in shady deals will be able to afford N21 million to purchase the governorship form."
  },
  {
    "headline": "eNaira pushes through difficult environment",
    "summarized_story": "But he disclosed that Person-to-Bank and Bank-to-Person have remained upbeat constituting about 90% eNaira transactions so far.\nCBN has stated that the eNaira transactions recorded range from P2P; Person to Merchant, P2M; Bank to Person; Person to Bank and Bank to Merchants and Merchants to Bank.\nFor instance, the eNaira is a mobile-first digital currency, living in wallets that can only function in places with reliable access to mobile data.\nThat’s partly down to a problem with promoting the eNaira, says some experts, which has largely been left to the CBN.\nThat also needs to be matched by a sustained effort at making the digital currency relevant to those who regularly receive remittances."
  },
  {
    "headline": "Insecurity: Akwa Ibom govt evacuates stranded indigenes in Kaduna",
    "summarized_story": "Following the rising cases of insurgency and banditry in some parts of Kaduna State, Akwa Ibom State Government has evacuated 34 of its indigenes from the state.\nSpeaking, the President of Akwa Ibom Community in Katsina, and a lecturer in the Department of Mathematics, Federal College of Education, Katsina State, Chief Effiom Williams, said he got distress calls from members that their houses and shops were burnt adding that he quickly mobilised them into safety in his house.\n“We got back home and started hearing loud shooting at night, and we all started running for our dear lives.\nAll I could take out from our house are my children and a few clothes.\nLuckily for us, we were escorted to the IDP camp by soldiers.”She narrated that they were, however, linked to the President of the Akwa Ibom Community in Katsina by a fellow Akwa Ibomite in the camp."
  },
  {
    "headline": "Bucha: Russia investigates killing of civilians in Kyiv suburb",
    "summarized_story": "Russia’s Investigative Committee has instructed its agents to analyze reports of civilian killings in the Kyiv suburb of Bucha.\nThe Chairman of the Committee, Alexander Bastrykin, gave the instruction echoing the Russian Defense Ministry’s denial of any involvement in the killings.\nAddressing reporters on Monday, Ukraine’s interior minister said more bodies of civilians were expected to be recovered in the Kyiv region, citing preliminary information.\nThe Russian Defense Ministry claimed Sunday that allegations of civilian killings in Bucha were “fake,” without presenting any credible evidence.\nWestern leaders have called for war crime investigations and fresh sanctions on Russia over the incident in Bucha."
  },
  {
    "headline": "EFCC seizes ASCSN officials’ passports over alleged financial fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has seized the passports of some officials of the Association of Senior Civil Servants of Nigeria (ASCSN), DAILY POST has gathered.\nDAILY POST recalls that the union has in the last few months been engulfed by a series of crises.\nOur correspondent also gathered that some officials of the union had been invited by the EFCC over alleged financial fraud.\nHe told DAILY POST on Monday, “I don’t know what they are saying.\nBut all efforts made by DAILY POST to get the reaction of Lawal to speak on the matter proved to be abortive."
  },
  {
    "headline": "Bucha: We’ll take greater action against Russia soon – US",
    "summarized_story": "The United States of America has vowed to hit Russia with more sanctions soon.\nState Department spokesperson Ned Price said that additional action against Russia is coming “very soon.”He stated this when asked about Ukrainian President Vladimir Zelensky’s request for greater G7 actions against Russia in response to the latest alleged war crime in Bucha.\nSo I suspect you will very soon see additional pressure applied,” Price told MSNBC Sunday.\n“When it comes to these images out of Bucha, we have already assessed that Russia’s forces have committed war crimes.\nAsked about peace talks, Price said, “We have not seen any indication yet that the Russians are truly serious about de-escalating this war.”"
  },
  {
    "headline": "Ayade approves nine-man committee to disburse N200m gratuities to Cross River retirees",
    "summarized_story": "Governor Benedict Ayade of Cross River State has constituted a nine-member committee, comprising of labour stakeholders to verify retirees due for gratuities and disburse N200 million to settle their outstanding payments.\nThe nine-man Committee which is made up of both Government and Labour is headed by Joseph Adie, state Accountant General as Chairman.\nHead of Service in the state, Mr. Timothy Ogbang Akwaji, had inaugurated the committee on behalf of Governor Ayade and listed their terms of reference.\nHe charged the Committee to place integrity and transparency as top priorities as they come up with an equitable template for payment.\nThe state governor had released the sum of N200 million to commence payment of gratuities to retirees in the state last week."
  },
  {
    "headline": "Abuja-Kaduna train: 146 passengers unreachable – NRC",
    "summarized_story": "One hundred and forty six out of the 362 passengers on the ill-fated Abuja-Kaduna train are unreachable six days after the train was attacked by terrorists.\nOkhiria said 51 phone numbers on the manifest are either switched off or unreachable since Tuesday morning, 35 phone numbers on the manifest are ringing without response from the other end while the number of safe passengers had risen to 186.\nHe noted that 60 phone numbers on the manifest when called, responded non-existent.\nThe NRC boss clarified that 22 persons are reported missing by their relatives and eight persons were confirmed dead.\n60 phone numbers on the manifest when called, responded non-existent."
  },
  {
    "headline": "Nowhere is safe any longer for Nigerians, says Obasanjo",
    "summarized_story": "Nowhere is safe any longer for Nigerians, says ObasanjoFormer President Olusegun Obasanjo has said the Muhammadu Buhari administration is overwhelmed by rising insecurity across the country.\nHe said the development showed that no part of the country or place where Nigerians are safe: in vehicles, on the train or on an aircraft.\n“Nigerians are no longer safe on the road, on the train and at the airport,” Obasanjo said.\n“A situation where you are not safe on the road, you are not safe in the train, you are not safe at the airport, shows a very serious situation.\nRead Also: Osinbajo, Obasanjo, Jonathan condemn coups in Africa“Two coaches (SP 00016 and SP 00017) earlier re-railed were safely moved to Rigasa Station."
  },
  {
    "headline": "Presidency attacks PDP governors for twisting facts about Buhari’s govt",
    "summarized_story": "The Presidency has berated the main opposition party, Peoples Democratic Party (PDP), for allegedly misrepresenting facts about the country’s economic and sociopolitical history.\nThe opposition governors concluded that the ruling party is not fit to run the country any further.\n“We cannot forget that under the PDP, the nation had an army full of phantom soldiers whose pay went to PDP politicians’ pockets while our under-resourced real soldiers died in the fight against terrorist, insurgents, and our international allies refused to supply Nigeria kit and military aid.\n“We will always know how PDP politicians raided the Nigerian National Petroleum Company (NNPC), consistently failed to pay into the Federation Account and, in the last year of PDP misrule, $20 billion was simply found ‘missing’.\nIt said they have for long profited from playing divisive politics, setting the nation up in flames by promoting hate."
  },
  {
    "headline": "Bola Ige murder: Omisore replies Soyinka",
    "summarized_story": "All Progressives Congress (APC) National Secretary Senator Iyiola Omisore yesterday accused people he described as “drowning politicians” of spreading propaganda against him.\nHe lamented that a decade after the Bola Ige murder case, Nobel Laureate Prof. Wole Soyinka still referred to him as a prime suspect, despite being cleared by the court.\nOmisore said “as brilliant as Prof. Soyinka is, he, no doubt, has monopoly of knowledge.\nOmisore said: “The recent volte face of Soyinka on the Bola Ige matter gives one a cause for concern.\n“Or, are some people who are worried by the erudite and strong personality and capacity of Omisore as National Secretary using Soyinka to settle scores or pursue their political ambitions?"
  },
  {
    "headline": "VIDEO: Nine questions FG must answer, by Adeboye",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Police kill 1 kidnapper, rescue 13 victims in Delta",
    "summarized_story": "By Christopher OjiDelta State Police command has shot dead a suspected kidnapper and rescued 13 victims in Aniagbala Community via Ubulu-uku express road in Aniocha South Local Government Area of the state.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“Delta State Commissioner of Police CP Ari Muhammed Ali, directed that the DPO Ogwashi-Uku Division to lead men into the bush and ensure that the victims were rescued unhurt and also arrest the suspects.\nAll thirteen kidnapped victims were rescued alive and unhurt and One AK47 rifle was recovered.\nThe bush is still being combed with a view to arresting the other fleeing members of the gang”."
  },
  {
    "headline": "NIN-SIM link: FG directs telcos to bar outgoing calls on unlinked lines",
    "summarized_story": "From Adanna Nnamani, AbujaThe federal government has directed telcos to bar outgoing calls on unlinked lines from 4th April, 2022.\nAccording to the statement, over 125 million SIMs have had their NINs submitted for immediate linkage, verification and authentication and over 78 Million unique NINs issued till date.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\nSubscribers of such lines are hereby advised to link their SIMs to their NINs before the Telcos can lift the restriction on their lines.\n“As of date, over 125 Million SIMs have had their NINs submitted for immediate linkage, verification and authentication."
  },
  {
    "headline": "Zoning: Atiku, Wike, Anyim, Obi, others know fate tomorrow",
    "summarized_story": "From Ndubuisi Orji, Abuja and Chinelo ObogoThere is growing anxiety in the Peoples Democratic Party (PDP) as stakeholders await the decision of the party’s panel on zoning of the 2023 presidential ticket of the party.\nThe 2023 PDP zoning committee headed by Benue State Governor, Samuel Ortom, was set up by party’s National Executive Committee (NEC) last month to come up with a formula for the zoning of its 2023 presidential ticket.\nThe outcome of the panel’s report would determine the fate of former vice president Atiku Abubakar, Rivers State Governor, Nyesom Wike, former secretary to the Government of the Federation (SGF), Anyim Pius Anyim, and former Anambra State governor, Peter Obi, in the PDP presidential primary scheduled for May 28 and 29.\nThe PDP committee on the review of the 2019 general election had recommended that the 2023 presidential ticket be thrown open to all qualified aspirants.\nWe are ready to take it back because the power belongs to PDP,” Wike said."
  },
  {
    "headline": "2023: Elections may not hold – Adeboye",
    "summarized_story": "By Amechi Ogbonna and Adewale SanyaoluNigeria’s worsening economic and security challenges, yesterday, caught the attention of the General Overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, who warned that the trend could truncate the conduct of the 2023 general elections.\nHe also urged Christians to participate actively in the electoral process, denying ever dictating to his members candidates to vote or not vote for.\nAs I speak, God has not told me if there will be election in 2023 or not.\nThe year 2023 is still far away from now; He may decide to speak tomorrow, but as of now he has not told me anything about 2023.\nOn why he is urging Christians to participate in politics, Adeboye said: “Christians should participate in elections by voting and ensuring that their votes count."
  },
  {
    "headline": "CBN to penalise banks for depositing mutilated notes",
    "summarized_story": "The Central Bank of Nigeria (CBN), at the weekend, warned Deposit Money Banks (DMBs) to immediately desist from bringing mutilated banknotes as part of their deposits.\nComposed banknotes or mutilated Naira notes comprise several parts of different banknotes of the same denomination.\nThe parts of such currency notes are usually put together with the intention of receiving value.\nAccording to him, having mutilated banknotes in the economy completely distorts the true value of currency in circulation, aside from being a fulcrum for fraudulent activities.\n“The existence of composed banknotes in the economy falsifies the true value of currency in circulation, and can also be an avenue for fraudulent activities”."
  },
  {
    "headline": "Breaking: FG Bars Outgoing Calls on SIM Cards not Linked to NIN",
    "summarized_story": "Emma OkonjiThe federal government has barred all outgoing calls on every SIM card that is not linked to the National Identification Number (NIN) of the SIM card owner.\n“As of date, over 125 Million SIMs have had their NINs submitted for immediate linkage, verification and authentication.\nSimilarly, the National Identity Management Commission (NIMC) has issued over 78 million unique NINs till date,” Pantami said.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\nOutgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage Policy from the 4th of April, 2022."
  },
  {
    "headline": "Obasanjo: Buhari is Overwhelmed, Nigeria in Serious Situation",
    "summarized_story": "The former president said the present government was overwhelmed by the situation, cautioning, however, that Nigerians must not allow the problem to overcome the country.\n“A situation where you are not safe on the road, you are not safe on the train, you are not safe at the airport, shows a very serious situation.\n“For, hiring the services of foreign mercenary is certainly beyond the power of any state governor, according to the Constitution of the Federal Republic of Nigeria.\n“There are dangers in bringing in foreign mercenaries by these governors, because their antecedents in the recent past do not give us reasons to trust them.\nPDP told El-Rufai that his suggestion or threats to import foreign mercenaries was counter-productive and capable of compounding the already dire security situation in the country."
  },
  {
    "headline": "FG Banks on Shell, TotalEnergies’ Projects to Add 800,000 Barrels to Daily Production",
    "summarized_story": "Discovered in 2003, Preowei has a subsea tank with over 150 million barrels of oil and gas equivalent and is expected to pump about 50,000 barrels of oil per day at peak.\nShell’s Bonga South West FPSO, with the capacity to pump 150,000 barrels per day, is another project government is relying on to boost daily oil production by 800,000 barrels.\nNigeria has been grossly underperforming in oil production, with Africa’s largest oil producer failing to meet its production quota by the Organisation of Petroleum Exporting Countries (OPEC) for many months running.\nAfter its meeting last week, the cartel raised Nigeria’s production quota from April’s 1.735 million barrels per day to 1.753 million barrels per day in May, even though the country has been struggling to meet lower production allocations.\nThe Biden administration’s giant oil release contrasts sharply with OPEC+, which on Thursday ratified a planned, modest production increase of about 430,000 barrels a day."
  },
  {
    "headline": "Uzo Uwani Indigenes Allege Marginalisation, Seek Ugwuanyi’s Intervention",
    "summarized_story": "“Enugu state as it is today was created out of Anambra state in 1991.\n“In 1996, Abakaliki zone of Enugu state was carved out to fuse with Afikpo zone of Abia state to become Ebonyi state.\nThis left, in Enugu state, Nsukka zone and Enugu zone.\nSince the return of democracy in 1999, Enugu zone has produced all the Ministers from Enugu state.\nOn the basis that Enugu zone did 16 years, we ask that Nsukka zone be allowed to complete its 16 years as governor."
  },
  {
    "headline": "Obasanjo: Security Challenges Have Overwhelmed Buhari’s Govt, Nigerians No Longer Safe Anywhere",
    "summarized_story": "James Sowole in AbeokutaFormer President Olusegun Obasanjo has said security challenges have overwhelmed the government of President Muhammadu Buhari.\nObasanjo said the development had shown that Nigerians were not safe anywhere – in vehicles, on the train or on aircraft.\nThe former president said the present regime had been overwhelmed by the situation, but Nigerians must not allow the situation to overwhelm the country.\nHe however, cautioned Nigerians not to allow themselves to be overwhelmed by the security challenges.\n“A situation where you are not safe on the road, you are not safe on the train, you are not safe at the airport, shows a very serious situation."
  },
  {
    "headline": "BREAKING: Buhari Laments Ill-Treatment Of Nigerians, Other Africans In Ukraine, Alleges Racism",
    "summarized_story": "President Muhammadu Buhari has lamented the ill-treatment being meted out to Nigerian nationals, and citizens of other African countries in Ukraine amid the ongoing war in the country.\nThere have been reports, along with videos of Nigerians being turned back at Ukraine's borders in their attempt to exit the troubled country for neighbouring ones.\nThe majority of Nigerian citizens in the country today are university-enrolled students.\n“There are also separate reports of Polish officials simply refusing Nigerian citizens’ entry into Poland from Ukraine.\n“Nigeria, with our 200 million people, support all and every diplomatic effort to bring this war to an end.”"
  },
  {
    "headline": "BREAKING: Buhari Laments Ill-Treatment Of Nigerians, Other Africans In Ukraine, Alleges Racism",
    "summarized_story": "President Muhammadu Buhari has lamented the ill-treatment being meted out to Nigerian nationals, and citizens of other African countries in Ukraine amid the ongoing war in the country.\nThere have been reports, along with videos of Nigerians being turned back at Ukraine's borders in their attempt to exit the troubled country for neighbouring ones.\nThe majority of Nigerian citizens in the country today are university-enrolled students.\n“There are also separate reports of Polish officials simply refusing Nigerian citizens’ entry into Poland from Ukraine.\n“Nigeria, with our 200 million people, support all and every diplomatic effort to bring this war to an end.”"
  },
  {
    "headline": "BREAKING: 40 Ukrainian Civil Society Groups Sign Kyiv Declaration, Issue Six Appeals To World Leaders",
    "summarized_story": "As the Russia-Ukraine crisis rages on, 40 Ukrainian civil society organisations have issued the Kyiv Declaration, putting six urgent appeals before the international community.\nThis six-point appeal has been signed by 40 Ukrainian civil society organisations in Kyiv and other cities under siege.\nUkrainian Helsinki Group for Human Rights, Oleksandr Pavlichenko4.\nZMINA Centre for Human Rights, Tetyana Pechonchyk7.\nUkrainian Centre for Independent Policy Research, Yuliya Tyshchenko12."
  },
  {
    "headline": "BREAKING: 40 Ukrainian Civil Society Groups Sign Kyiv Declaration, Issue Six Appeals To World Leaders",
    "summarized_story": "As the Russia-Ukraine crisis rages on, 40 Ukrainian civil society organisations have issued the Kyiv Declaration, putting six urgent appeals before the international community.\nThis six-point appeal has been signed by 40 Ukrainian civil society organisations in Kyiv and other cities under siege.\nUkrainian Helsinki Group for Human Rights, Oleksandr Pavlichenko4.\nZMINA Centre for Human Rights, Tetyana Pechonchyk7.\nUkrainian Centre for Independent Policy Research, Yuliya Tyshchenko12."
  },
  {
    "headline": "War: Dead Bodies Of Civilians Litter Street Of Death In Ukraine Town, ‘Victims Shot In The Head’",
    "summarized_story": "The bodies are strewn across the quiet tree-lined street in the town of Bucha as far as the eye can see.\nAnother lies next to a yellow hoarding spray-painted with happy and sad emojis and the words \"Live Fast\", Times of Malta reports.\n\"All these people were shot, killed, in the back of the head,\" mayor Anatoly Fedoruk told AFP.\nYet the horrors of war have become so routine in Bucha that the remaining residents walk down the street past the bodies, barely casting a glance.\nIt is the first such delivery in more than a month, after Ukraine said Saturday that Russian forces were making a \"rapid retreat\" from Kyiv."
  },
  {
    "headline": "INTERVIEW: We want to help pharmacists digitise patients' records, says Samuel Okwuada, CEO of Remedial Health",
    "summarized_story": "In Nigeria, pharmaceutical stores are the first point of contact for many people.\nThe pharmaceutical sector is one integral part of the health sector that needs attention in the areas of service delivery as well as the product standard.\nOkwuada: Remedial Health was established out of the desire to promote and revamp the pharmaceutical industry as well as the healthcare services.\nWe need to make our health sectors easier and more profitable for private investors to invest in the public health sector.\nThat will help our health sector a lot."
  },
  {
    "headline": "INTERVIEW: We want to help pharmacists digitise patients' records, says Samuel Okwuada, CEO of Remedial Health",
    "summarized_story": "In Nigeria, pharmaceutical stores are the first point of contact for many people.\nThe pharmaceutical sector is one integral part of the health sector that needs attention in the areas of service delivery as well as the product standard.\nOkwuada: Remedial Health was established out of the desire to promote and revamp the pharmaceutical industry as well as the healthcare services.\nWe need to make our health sectors easier and more profitable for private investors to invest in the public health sector.\nThat will help our health sector a lot."
  },
  {
    "headline": "Kaduna, Enugu… 24 states attracted zero foreign investments in 2021",
    "summarized_story": "AdvertisementOf the 24 states, ten also failed to attract foreign investments in the last three years.\nAdvertisementLAGOS REMAINS INVESTORS’ FAVOURITELagos outshined other states and the federal capital territory (FCT) to top the list of states that attracted the most investments in 2021.\nOther states that attracted foreign investments in 2021 are Osun ($29.9 million), Anambra ($4.7 million), Kano ($2.55 million), Oyo ($2.0 million) and Ogun ($1.06 million).\nLai Mohammed, minister of information and culture, explained that the Presidential Enabling Business Environment Council (PEBEC) has implemented over 150 ease of doing business reforms.\nPEBEC was set up in July 2016 by President Muhammadu Buhari to remove bureaucratic constraints on doing business in Nigeria."
  },
  {
    "headline": "Kaduna, Enugu… 24 states attracted zero foreign investments in 2021",
    "summarized_story": "AdvertisementOf the 24 states, ten also failed to attract foreign investments in the last three years.\nAdvertisementLAGOS REMAINS INVESTORS’ FAVOURITELagos outshined other states and the federal capital territory (FCT) to top the list of states that attracted the most investments in 2021.\nOther states that attracted foreign investments in 2021 are Osun ($29.9 million), Anambra ($4.7 million), Kano ($2.55 million), Oyo ($2.0 million) and Ogun ($1.06 million).\nLai Mohammed, minister of information and culture, explained that the Presidential Enabling Business Environment Council (PEBEC) has implemented over 150 ease of doing business reforms.\nPEBEC was set up in July 2016 by President Muhammadu Buhari to remove bureaucratic constraints on doing business in Nigeria."
  },
  {
    "headline": "NCDC records 127 Lassa fever deaths as cases hit 681",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says 127 people have died of Lassa fever in 2022.\nThe agency said this in its latest Lassa fever report for week 12 covering March 21 to March 27.\nIt said in the reporting week, the number of new confirmed cases decreased from 29 in week 11, to 22 cases.\nAdvertisementAccording to the report, from the beginning of the year, 3,542 suspected cases of Lassa fever were reported across the country, of which 681 were confirmed positive.\nAdvertisement“National Lassa fever multi-partner, multi-sectoral Emergency Coordination Centre (EOC) activated to coordinate response activities at all levels.”"
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "13 years, $10bn processed. How has Paga evolved over the years?",
    "summarized_story": "After considering several ideas for a couple of months, Oviosu came up with what is now Paga.\nPaga was arguably the first fintech company in Nigeria to popularise mobile money among the unbanked.\nIn 2021, Paga opened up its platform to more businesses through Collect APIs, which more than 200 businesses currently use.\nExpansion“The vision is still the same—to solve payments for individuals and businesses,” Oviosu said.\nTayo Oviosu, Paga co-founder and CEO."
  },
  {
    "headline": "Peace Itimi: From Nigeria to the UK in search of peace",
    "summarized_story": "Peace Itimi has spent 9 months away from Nigeria but doesn’t miss the country.\nShe said university had been one of the most definitive phases of her life because it was where she found God, found herself, and digital marketing.\nFresh from school, she launched a digital marketing agency with a friend in 2016.\nIn 2018, she joined Wild Fusion, another digital marketing agency, where she trained people on digital marketing, branding, Google Ads, and SEO.\nDuring one of her travels for digital marketing training in Accra, she realised that even though she loved travelling, her physical reach was limited."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Stax is levelling the playing field between USSD and bank apps",
    "summarized_story": "According to the Global System for Mobile Communications Association (GSMA), nine in 10 mobile money transactions in sub-Saharan Africa are done through USSD.\nLyon described Stax as an online payment super app for Africa that brings together all USSD based services in one place.\nWhat Stax does is run the USSD in the background and reduce the USSD menus to fewer taps within the app.\nThe Stax app works almost like any bank app, but offline.\nHow Stax makes moneyFree to use, Stax only takes a USSD telco session charge."
  },
  {
    "headline": "King MTN and the tax collector",
    "summarized_story": "Even though I’ve been a football fan for the last 13 years, I’ve never understood the craze behind fantasy football.\nSo imagine my surprise when I heard African football fantasy startup, Eksab had raised $3million in funding on Monday, March 28, 2022.\nWhat’s fantasy football, though?\nBut what does a fantasy football startup raising money mean for the “ecosystem”?\nApart from this, however, is one crucial fact: MTN contributes double-digit percentages to Nigeria’s tax revenue."
  },
  {
    "headline": "NowNow reaffirms commitment to driving financial inclusion in Nigeria",
    "summarized_story": "The company has built an ecosystem that digitises payments and creates access to financial services for Agents, Consumers and Businesses.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos.\nLekan Akinjide, the Partnership Director of NowNow Digital Services, said, “We are a leading fintech and financial services enabler.\nNowNow offers more than financial inclusion; we want to educate Nigerians about Financial services by teaching them how to manage their money to help them achieve financial independence.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis; Head of Marketing & Communications, NowNow, Tasyana Bouran; and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo partners GIZ, Swiss agency on 3 job centre projects – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has entered into partnership with the Deutsche Gesellschaft Für Internationale Zusammenarbeit (GIZ) and Swiss Agency for Development Corporation (SDC) on the establishment of three jobcentres across the state.\nThe new job centres are to be established across the three senatorial districts of the state, including Uromi, Esan North West Local Government Area (LGA); Auchi in Etsako West LGA, and Usen in Ovia South East LGA.\n“We launched the existing centres in September 2021, at the Edo Innovation Hub, at Wire Road and Edo Production Centre at Sapele Road.\nDare noted: “Solving the issue of unskilled graduates, unemployment and under-employment in one swoop, since 2017, EdoJobs has recruited workers for over 200 firms within and outside the state.\n“With a mission to provide a highly skilled workforce in Edo State, EdoJobs has also birthed other initiatives."
  },
  {
    "headline": "Obaseki recommits to free, credible LG polls, harps on responsibility, accountability in politics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has pledged to work with the electoral body and all other relevant stakeholders to ensure that the forthcoming local government election in the state is free, fair and credible.\nObaseki gave the assurance when he received the executive members of the Edo State chapter of the Inter-Party Advisory Council of Nigeria (IPAC) who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha said the country is in tough and perilous times, charging government officials on the need to be responsible and accountable to the people.\nHe noted, “With the local government elections soon approaching, we need to sit and brainstorm on how to ensure that the election is free, fair and credible.\nWe thank you for your courage as we assure you of this administration’s open-door policy.”Earlier, the Chairman of Edo IPAC, Hon."
  },
  {
    "headline": "More hardship ahead as energy, forex crisis worsens",
    "summarized_story": "On the international front, the prices of oil and gas have risen sharply after Russia invaded Ukraine on February 24.\nHe said, Companies are shutting down their businesses as a result of the increase in the price of diesel.\nAnd the new prices for GOtv package will now be: Gotv Max for N4,150, GOtv Jolli for N2,800, GOtv Jinja for N1,900, GOtv Lite for N900.\nDisturbingly, there are no signals that the nations forex crisis may be abating anytime soon.\n“This model would enhance liquidity in the foreign exchange market, reduce uncertainty in the forex market and enhance investors confidence,” Yusuf argued."
  },
  {
    "headline": "GTCO makes ambitious forecast, targets N243bn in PBT",
    "summarized_story": "GT Holding Company has set its target on achieving a whooping N243billion in profit before tax for the year ended 2022.\nThis represents a growth of 10 per cent over the N221.5bn the holdco achieved in the corresponding period of 2021.\nFor liquidity ratio, the holdco targets a growth of 38%, capital adequacy Ratio by 23% and cost to income ratio to increase by 35%.\nGTCO, however, grew its income from commission and fees rising 40 per cent to N65.65 billion in 2021 from N46.94billion in 2020.\nIt also raked in N22.39 billion in net trading income representing a 8.56 per cent decrease in 2021."
  },
  {
    "headline": "Cutix Plc, Total Energies, Red Star make top gainers in Q1 2022",
    "summarized_story": "Similarly, Total Energies markets appreciated 11.06 per cent from N238.50 per share on January 4, 2022 to N264.90 per share in March 31, 2022.\nRed star express inched up 11.1 per cent from 2.70kobo per share early in the year 2022 to close at 3.00kobo per share.\nThe Nigerian Stock Exchange (NSE) has joined the league of Johannesburg Stock Exchange and Nairobi Stock Exchange, which are already publicly listed companies.\nUnder the demutualization plan of the Nigerian Stock Exchange, a new non-operating holding company, the Nigerian Exchange Group Plc (NGX Group), has been created.\nThe Group has three operating subsidiaries, namely: Nigerian Exchange Limited (NGX Limited), the operating exchange; NGX Regulation Limited (NGX REGCO), the independent regulation company; and NGX Real Estate Limited (NGX RELCO), the real estate company."
  },
  {
    "headline": "Alfred Rewane: Nigeria’s new real estate capital",
    "summarized_story": "Alfred Rewane Way!\nHeritage PlaceLocated on the intersection between Alfred Rewane Way and Luggard Avenue in Ikoyi, Heritage Place is Nigeria’s first green office building.\nBAT Rising SunOwned by tobacco giant, British American Tobacco (BAT), the Rising Sun is situated on Alfred Rewane Way, spreading over 4,056 square metre.\nKing’s TowersAnother iconic building on the popular Alfred Rewane Way is the King’s Tower (formerly Kingsway Tower).\nThe new building which is still under construction is located on the corner of Club and Alfred Rewane Way."
  },
  {
    "headline": "10 Boko Haram/ISWAP Terrorists Surrender With Weapons In Borno",
    "summarized_story": "10 Boko Haram/Islamic State of West Africa Province (ISWAP ) terrorists with their children, on Sunday, surrendered to troops in Borno State, an intelligence source has revealed.\nAccording to the source, the surrendered insurgents, comprising 10 male and 5 children, came out from their hiding enclaves around Jango village and Mandara Mountain in Gwoza and surrendered to troops of 151 Battalion in Banki, Bama local government area on April 3, 2022.\nThe terrorists were said to be those loyal to the Boko Haram faction of Jama’tu Ahlis Sunna Lidda’awati wal-Jihad (JAS), Malam Bakura Salaba, who was recently killed by Bakura Buduma, a leader of Boko Haram, who replaced Abubakar Shekau.\nHe noted that the suspects and their family members would recieve medical attention at a military medical facility, after which they would undergo thorough profiling and investigation in line with global best practices in handling such cases.\nADVERTISEMENTLEADERSHIP recall that over 50,000 Boko Haram/ISWAP terrorists and their families have so far surrendered to the troops of the Operation Hadin Kai in the North-East between September 2021 and April 2022."
  },
  {
    "headline": "CBN Reversing Nigeria’s Over-reliance On Imports – Emefiele",
    "summarized_story": "The apex bank said its 100-for-100 Policy on Production and Productivity (PPP) is gradually reversing Nigeria’s over-reliance on imports.\nThe governor of the CBN, Godwin Emefiele, stated this during the ‘CBN Day’ at the ongoing Enugu International Trade Fair in Enugu.\nUnder the CBN targeted Credit Facility designed to cushion the effect of the Coronavirus pandemic, Emefiele said that the apex bank had disbursed N368.79 billion to 778, 000 beneficiaries.\nEmefiele stated that the CBN did it through its developmental role as enshrined in the CBN Act 2007 (as amended).\nEarlier, the president, Enugu Chamber of Commerce Industries, Mines and Agriculture (ECCIMA), Mr Jasper Nduagwuike, applauded the CBN for its various intervention efforts."
  },
  {
    "headline": "Mercenaries: Our Military Can Defeat Bandits, PDP Replies El-Rufai",
    "summarized_story": "Peoples Democratic Party (PDP) has said it believes in the competence and capability of the armed forces to defend Nigeria against acts of terror just as it said the comments and actions of All Progressives Congress (APC) leaders since 2015 fueled terrorism in the country.\nThe opposition party which reacted to Kaduna State Governor Nasir El-Rufai’s call for use of mercenaries to address the banditry in the country, said his suggestion or threats to import foreign mercenaries is counter-productive and capable of compounding the already dire security situation in the country.\n“They are only being encumbered by manifest complicity, conspiracy, incompetence and failure of the Security Command and Control Coordination structure of the APC administration,” PDP national publicity secretary, Hon Debo Ologunagba, said.\n“Nigerians can also recall how ahead of the 2019 general elections, Governor el-Rufai threatened that “those that are calling for anyone to come and intervene in Nigeria, we are waiting for the persons that will come and intervene, they will go back in body bags”.\n“Such comments and actions by Governor el-Rufai, the Buhari Presidency and other APC leaders have the propensity to embolden terrorists to unleash violence on innocent people, the result of which are now apparent and living with us,” he said."
  },
  {
    "headline": "Mercenaries: Our Military Can Defeat Bandits, PDP Replies El-Rufai",
    "summarized_story": "Peoples Democratic Party (PDP) has said it believes in the competence and capability of the armed forces to defend Nigeria against acts of terror just as it said the comments and actions of All Progressives Congress (APC) leaders since 2015 fueled terrorism in the country.\nThe opposition party which reacted to Kaduna State Governor Nasir El-Rufai’s call for use of mercenaries to address the banditry in the country, said his suggestion or threats to import foreign mercenaries is counter-productive and capable of compounding the already dire security situation in the country.\n“They are only being encumbered by manifest complicity, conspiracy, incompetence and failure of the Security Command and Control Coordination structure of the APC administration,” PDP national publicity secretary, Hon Debo Ologunagba, said.\n“Nigerians can also recall how ahead of the 2019 general elections, Governor el-Rufai threatened that “those that are calling for anyone to come and intervene in Nigeria, we are waiting for the persons that will come and intervene, they will go back in body bags”.\n“Such comments and actions by Governor el-Rufai, the Buhari Presidency and other APC leaders have the propensity to embolden terrorists to unleash violence on innocent people, the result of which are now apparent and living with us,” he said."
  },
  {
    "headline": "Innovate UK Knowledge Transfer Network Puts Women Innovators In Spotlight",
    "summarized_story": "The opportunities, as well as challenges facing women innovators in Nigeria, came under the spotlight at the first of the Women in Innovation session of the Equality, Diversity and Inclusion (EDI) Innovation Media Series.\nWomen in Innovation, a virtual event held on Tuesday hosted by Innovate UK KTN’s Global Alliance Africa project.\nEquality, Diversity and Inclusion programme lead, Innovate UK, Rachel Obrike, underscored the importance of amplifying women’s voices and showing women innovators that are making a difference in the community.\n“One thing about the Women in Innovation Programme and the Young Innovators Programme is around the role model aspects,” she said.\nA lot of people believe that women should take less intellectually challenging roles.”A key challenge facing women innovators is a dearth of access to venture capital funds, compared to their male counterparts."
  },
  {
    "headline": "Why I Don’t Vote, Pastor Adeboye Opens Up",
    "summarized_story": "Pastor Enoch Adeboye, the General Overseer of the Redeemed Christian Church of God, has stated why he does not vote, claiming that it would be an injustice to the rest of his political children if he did.\nI have never told you the candidate to vote or party to belong to because every party is heavily represented here.\n“You are first a Nigerian before a member of a party; you have a duty to register, vote, and make sure your vote counts, you have a duty to belong to a party.\nHe said, “Talking about myself as I’m standing before you, I still don’t know whether or not there will be election next year (2023).\nAdeboye added, “I will pray and I have only one prayer point for everyone; father let your perfect will for this fellow be done.”"
  },
  {
    "headline": "NIN: Bar Outgoing Calls From Unlinked SIMs, FG Orders Telcos",
    "summarized_story": "The statement was titled, ‘NIN-SIM Linkage: Federal Government Commends Compliance and Directs Telcos to Bar Outgoing Calls on Unlinked Lines from 4th April, 2022’.\nIt partly read, “Accordingly, Mr. President graciously approved the many requests to extend deadlines for the NIN-SIM linkage.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\n“Outgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage Policy from the 4th of April, 2022.\n“Subscribers of such lines are hereby advised to link their SIMs to their NINs before the Telcos can lift the restriction on their lines."
  },
  {
    "headline": "BREAKING: 146 Abuja-Kaduna train passengers unreachable -NRC",
    "summarized_story": "One hundred and forty-six of the 362 passengers on the ill-fated Abuja-Kaduna train are unreachable six days after the train was attacked by terrorists.\nHe, however, said the number of safe passengers had risen to 186.\nOkhiria said 51 phone numbers on the manifest are either switched off or unreachable since Tuesday morning and 35 phone numbers on the manifest are ringing, but no response from the other end.\nHe also noted that 60 phone numbers on the manifest when called, responded non-existent.\n”NRC will continue to update the general public of developments to prevent misleading information and falsehood.”Following the attack, the NRC suspended train operations along the Abuja-Kaduna route indefinitely."
  },
  {
    "headline": "APC Chairman, Adamu Tells Amaechi, El-Rufai To Stop Criticising Buhari Government Over Insecurity",
    "summarized_story": "The National Chairman of the APC, however, said they would work assiduously and round the clock to ensure victory for the ruling party come 2023.\n“We should win, win again, this is the task ahead of us.\nWhoever believes in this would not be worried if he vied to be Chairman, Secretary, etc., but couldn’t be successful.\nI know of a person that is principled, with a clear mission that is on the path of Allah.\n“We know, human beings have their weakness."
  },
  {
    "headline": "Breaking: At last, FG bars sim cards without NIN linkage, gives MTN, airtel, others marching order",
    "summarized_story": "The directive was issued via a joint press statement by Ikechukwu Adinde, Director, Public Affairs, the National Communication Commission (NCC), and Kayode Adegoke, Head, Corporate Communications, National Identity Management Commission (NIMC) on Monday morning.\nThe deadlines for the NIN-SIM linkage has been extended on multiple occasions to allow Nigerians to freely comply with the Policy.\n“Accordingly, Mr. President graciously approved the many requests to extend deadlines for the NIN-SIM linkage.\nAt this point however, Government has determined that the NIN-SIM Policy implementation can proceed, as machinery has already been put in place to ensure compliance by citizens and legal residents.\nThe implementation impacts on Government’s strategic planning, particularly in the areas of security and socio-economic projections.”"
  },
  {
    "headline": "Grammys 2022: Cece Winans, Angélique Kidjo, Kanye West, other winners emerge *See full list",
    "summarized_story": "After months of delay, the 64th Annual Grammy Awards took place on Sunday night, at the MGM Grand Garden Arena in Las Vegas.\nThe Grammys were initially scheduled to take place on January 31 at the Crypto.com Arena in Los Angeles.\nHowever, due to the omicron surge in late 2021, the event was postponed until spring and moved to the MGM Arena, which has housed the Latin Grammy Awards for six years.\nFull Grammys 2022 winnersAlbum of the yearJon Batiste – We AreRecord of the yearSilk Sonic – Leave the Door OpenBest pop/duo group performanceDoja Cat featuring SZA – Kiss Me MoreBest pop vocal albumOlivia Rodrigo – SourBest R&B albumJazmine Sullivan – Heaux TalesBest rap performanceBaby Keem featuring Kendrick Lamar – Family TiesBest new artistOlivia RodrigoSong of the yearSilk Sonic – Leave the Door OpenBest country albumChris Stapleton – Starting OverBest pop solo performanceOlivia Rodrigo – Drivers LicenseBest dance/electronic recordingRüfüs Du Sol – AliveBest dance/electronic albumBlack Coffee – SubconsciouslyBest country duo/group performanceBrothers Osborne – Younger MeBest rock performanceFoo Fighters – Making a FireBest metal performanceDream Theater – The AlienBest rock songFoo Fighters – Waiting on a WarBest rock albumFoo Fighters – Medicine at MidnightBest alternative music albumSt Vincent – Daddy’s HomeBest R&B performanceSilk Sonic – Leave the Door Open – WINNER (TIE)Jazmine Sullivan – Pick Up Your Feelings – WINNER (TIE)Best traditional R&B performanceHER – Fight for YouBest R&B songSilk Sonic – Leave the Door OpenBest rap albumTyler, the Creator – Call Me If You Get LostBest rap songKanye West featuring Jay-Z – JailBest melodic rap performanceKanye West featuring the Weeknd and Lil Baby – HurricaneBest country songChris Stapleton – ColdBest country solo performanceChris Stapleton – You Should Probably LeaveBest Latin pop albumAlex Cuba – MendóBest música urbana albumBad Bunny – El Último Tour del MundoBest Latin rock or alternative albumJuanes – OrigenBest tropical Latin albumRubén Blades y Roberto Delgado & Orquesta – Salswing!\nBest American roots performanceJon Batiste – CryBest American roots songJon Batiste – CryBest Americana albumLos Lobos – Native SonsBest contemporary blues albumChristone “Kingfish” Ingram – 662Best traditional blues albumCedric Burnside – I Be TryingBest bluegrass albumBéla Fleck – My Bluegrass HeartBest folk albumRhiannon Giddens with Francesco Turrisi – They’re Calling Me HomeBest reggae albumSoja – Beauty in the SilenceBest jazz vocal albumEsperanza Spalding – Songwrights Apothecary LabBest jazz instrumental albumRon Carter, Jack DeJohnette and Gonzalo Rubalcaba – SkylineBest Latin jazz albumEliane Elias With Chick Corea and Chucho Valdés – Mirror MirrorBest new age albumStewart Copeland and Ricky Kej – Divine TidesBest global music albumAngélique Kidjo – Mother NatureBest global music performanceArooj Aftab – MohabbatBest regional Mexican music albumVicente Fernández – A Mis 80’sBest gospel albumCeCe Winans – Believe for ItBest roots gospel albumCarrie Underwood – My SaviorBest gospel performance/songCeCe Winans – Never LostBest contemporary Christian albumElevation Worship and Maverick City Music – Old Church BasementBest contemporary Christian music performance/songCeCe Winans – Believe for ItProducer of the year, non-classicalJack AntonoffBest comedy albumLouis CK – Sincerely Louis CKBest spoken word albumDon Cheadle – Carry On: Reflections for a New Generation From John LewisBest music filmVarious Artists – Summer of SoulBest song written for visual mediaBo Burnham – All Eyes on MeBest compilation soundtrack for visual mediaAndra Day – The United States vs. Billie HolidayBest score soundtrack for visual mediaCarlos Rafael Rivera – The Queen’s Gambit – WINNER (TIE)Jon Batiste, Trent Reznor and Atticus Ross – Soul – WINNER (TIE)"
  },
  {
    "headline": "Grammys 2022: 3 Nigerian artists lose out",
    "summarized_story": "One time Grammy winner, Wizkid, Femi Kuti and son Made Kuti, have lost out to win the 64th Grammy award in Las Vegas.\nAll the Nigerian stars missed out in two categories, Best Global Music Performance and Best Global Music Album, while the Beninese singer-songwriter, and actress, Angelique Kidjo, emerges the winner of the Global Music Performance in her hit song ‘Mohabbat‘In 2021, Wizkid got his first Grammy award for a feature on Beyonce’s song, ‘Brown Skin Girl,’ while Burna Boy won the Best Global Music Album category after losing out in 2020."
  },
  {
    "headline": "Social Media Marketing for Franchises is Meant for Women",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Radio Air Time Marketing: A New Strategy for the Economy",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Shop The Best Street Style From Paris Fashion Week Shows",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Style Spy: Fashion Model Goes Casual in Faux Furr and Plaid",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Now Is the Time to Think About Your Small-Business Success",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "NIN: Millions At Risk As FG Orders Telcos To Bar Outgoing Calls On Unlinked SIMs",
    "summarized_story": "The Federal Government has directed telecommunication companies in the country to bar all outgoing calls on unlinked lines from Monday, April 4, 2022.\nUnlinked lines are Subscriber Identity Modules (SIMS) not yet registered and linked with the National Identification Number (NIN) by users.\nOver 125 million SIMs, according to the statement, have had their NINs submitted for linkage, verification, and authentication and NIMC has issued over 78 million unique NINs to date.\nREAD ALSO: FG Urges Nigerians To Complete NIN-SIM Linkage ‘Without Delay’The government explained that NIN-SIM linkage had been extended on multiple occasions to allow Nigerians to freely comply with the policy.\nAccording to the NCC, at least 72.8 million subscribers risk being disconnected from telecommunication services following the latest directive."
  },
  {
    "headline": "Lassa Fever Toll Hits 127 As Nigeria Records Four New Deaths",
    "summarized_story": "Nigeria’s death toll from Lassa fever has risen to 127 after four more infected patients lost the battle to the disease.\nAs a result, Nigeria has confirmed a total of 681 infections out of the 3,542 suspected cases reported from 92 local government areas across 23 states, since the beginning of the year.\n“Of all confirmed cases, 67% are from Ondo (28%), Edo (24%) and Bauchi (15%) States.\nThe male to female ratio for confirmed cases is 1:0.8.\nAccording to the agency, the Lassa fever molecular laboratories in its network have increased to eight and are working at full capacity to ensure all samples are tested, and results are provided within the shortest turnaround time."
  },
  {
    "headline": "UPDATE: Zamfara Commissioner’s Son, Two Others Killed In Attack On Tsafe – Police",
    "summarized_story": "Police authorities in Zamfara have confirmed the attack on Tsafe town, the headquarters of Tsafe Local Government Area of the state.\nHe added that the assailants killed three persons, including the son of Mamman Tsafe, the Commissioner for Security and Home Affairs in Zamfara and a retired Deputy Inspector General of Police (DIG).\nChannels Television had reported that the bandits invaded Tsafe at about 8:30pm on Sunday and began to fire sporadic gunshots to cause panic among residents.\n“We got the information that the bandits were gathering to attack Tsafe; they even invited some other groups in order to attack the town,” a resident of Tsafe town said.\nWhile the police said 13 persons were killed in the attacks on Thursday last week, locals insisted that 15 people lost their lives."
  },
  {
    "headline": "More Than 150 Still Missing After Kaduna Train Attack",
    "summarized_story": "One week after gunmen attacked a train with explosives in Kaduna State, the whereabouts of 168 passengers are still unknown, the Nigerian Railway Corporation (NRC) has said.\nAt least eight people were killed and others missing on March 28 when gunmen detonated a bomb on the track and opened fire on the train linking the capital Abuja with the northwestern city of Kaduna.\nRELATEDAbuja-Kaduna Train Attack: ‘I Warned That Lives Will Be Lost’ – AmaechiKaduna Train Attack Questions Our Collective Ability To Govern – Nigerian GovernorsKaduna Train Attack: FG To Begin Repair Works, Recruit Locals For SecurityIt was the latest deadly assault blamed on heavily armed criminal gangs known locally as bandits in the region.\nIn a statement late Sunday, the NRC said of the 362 passengers on board the train when it was attacked, 186 had been confirmed safe.\nTwo days earlier, gunmen killed a perimeter security guard in an attack at Kaduna airport before armed forces intervened."
  },
  {
    "headline": "Gunmen Abduct Police Inspector, Two Others From Ogun Mosque",
    "summarized_story": "Gunmen have reportedly invaded a mosque at Soyoye in Abeokuta North Local Government Area of Ogun State, where they kidnapped a police Inspector and two other worshippers.\nThe police officer, Inspector Kamarudeen Bello, who is also said to be the chief imam of the mosque, was abducted alongside others while praying at about 8pm on Sunday.\nAccording to a source, the police officer is attached to one of the divisional police headquarters in the Ogun State capital.\nChannels Television gathered that the police officer and the other kidnapped victims have been released by their abductors after the payment of a ransom.\nWhen contacted, the spokesman for the Ogun State, Abimbola Oyeyemi, confirmed the abduction and release of the victims, although he stated that they were not aware of any ransom paid to the kidnappers."
  },
  {
    "headline": "APC Leadership has not been fair to Zamfara",
    "summarized_story": "Senator Kabiru Marafa says the All Progressives Congress has not been fair and just to the people of Zamfara StateHe says he and other party chieftains in the state are among the founding fathers of the APC but the party under the Mai Mala Buni led administration was not fair to them.\nSenator Kabiru Marafa stated this while speaking to Newsmen in Gusau, the Zamfara State CapitalThe former two term red Chamber lawmaker adds that he and former Abdul’azeez Yari remain in the APC to prove that they are card carrying and duly registered members of the party as against the stories making the round that they are notSenator Marafa further says if the people of Zamfara State decided not to continue to support the ruling APC is vase in the fact that they were not treated fairlyOver Seven hundred and fifty thousand APC Members according to him were registered before the registration was cancelled"
  },
  {
    "headline": "Gunmen attack Ondo lawmaker, Olugbenga Omole",
    "summarized_story": "Unknown gunmen have attacked the chairman, Ondo State House of assembly Committee on Information, Olugbenga Omole on Thursday.\nOmole who is representing Akoko Southwest Constituency 1, narrowly escaped assassination attempt on his life .\nHe escaped multiple gunshots were fired at his car by unknown gunmen in the heart of Akure, the state capital.\nThe lawmaker confirmed the incident to journalists."
  },
  {
    "headline": "Babangida pledges support for PDP consensus arrangement",
    "summarized_story": "Former Military President, Ibrahim Badamasi Babangida has met with some aspirants contesting for the office of the president on the platform of the Peoples’ Democratic Party (PDP) for the forthcoming general.\nWhile briefing Journalists on Thursday after a closed door meeting with the three PDP Presidential aspirants for 2023 elections, former Senate President, Dr. Abubakar Bukola Saraki, Governor Aminu Waziri Tambuwal of Sokoto State and Bauchi State Governor, Senator Bala Mohammed.\nSpeaking on behalf of other Aspirants, Senator Abubakar Bukola Saraki said the visit to the former General Babangida was to seek his advice and guidance on the way to go and to achieve the planned consensus in the PDP."
  },
  {
    "headline": "Why Kwara House declared lawmaker’s seat vacant",
    "summarized_story": "Kwara State House of Assembly has declared the seat of Hon.\nSaheed Popoola vacant after he officially announced his defection from the All Progressive Congress (APC).\nIn a letter addressed to the INEC and dated March 28, 2022, Speaker of the Kwara State House of Assembly Rt.\nYakubu Danladi Salihu said the decision to declare the seat vacant is in line with the provisions of Section 109 (1) (g) of the Constitution.\nThe declaration of the seat as vacant joins several of such developments across the country, including recent court judgments on the issue."
  },
  {
    "headline": "Twitter Stock Soars As Tesla CEO Elon Musk Reveals 9.2% Stake",
    "summarized_story": "Tesla Inc Chief Executive Officer Elon Musk has built a 9.2% stake in Twitter Inc, a regulatory filing showed on Monday, potentially making him the biggest stakeholder in the micro-blogging site.\nTwitter shares soared 26% in premarket trading after the filing, which comes close on the heels of Musk tweeting that he was giving “serious thought” to building a new social media platform.\nShares of other social media firms, including Meta Platforms and Snapchat owner Snap Inc, were also trading higher.\nMusk owns 73.5 million Twitter shares, valuing his passive stake in the company at up to $2.9 billion based on the stock’s Friday close.\nMusk is also the founder and CEO of SpaceX, and leads brain-chip startup Neuralink and infrastructure firm The Boring Company."
  },
  {
    "headline": "Nigeria Banks on Shell, TotalEnergies’ Projects to Add 800,000 Barrels to Daily Production",
    "summarized_story": "Nigeria’s federal government is hoping to add 800,000 barrels to Nigeria’s daily oil production from some important upstream projects being executed by Shell, TotalEnergies, and other oil companies, which had stalled due to funding and other reasons.\nDiscovered in 2003, Preowei has a subsea tank with over 150 million barrels of oil and gas equivalent and is expected to pump about 50,000 barrels of oil per day at peak.\nShell’s Bonga South West FPSO, with the capacity to pump 150,000 barrels per day, is another project government is relying on to boost daily oil production by 800,000 barrels.\nBonga South-west was planned to add around one billion barrels to Nigeria’s oil reserves.\nAfter its meeting last week, the cartel raised Nigeria’s production quota from April’s 1.735 million barrels per day to 1.753 million barrels per day in May, even though the country has been struggling to meet lower production allocations."
  },
  {
    "headline": "Nigeria: PDP Governors Delusional, Presidency Says",
    "summarized_story": "The Presidency, Sunday night, lambasted the 13 opposition Peoples Democratic Party (PDP) governors over their position a fortnight ago that the ruling All Progressives Congress (APC) was unfit to participate in the 2023 general election.\nAPC said the governors were delusional and only sought to cover up their criminal failures and damaging PDP years.\nPDP governors had passed a damning verdict on the APC administration of President Muhammadu Buhari at a meeting on March 24, at the Umuobiakwa country home of their Vice Chairman and Abia State Governor, Okezie Ikpeazu.\nThe presidency alleged that the PDP governors were persons who had long profited from playing divisive politics, and fanning hate.\n“We will always know how PDP politicians raided the NNPC, consistently failed to pay into the Federation Account and, in the last year of PDP misrule, $20 billion dollars was simply found ‘missing’."
  },
  {
    "headline": "Nigeria: APC Leaders Fuelling Terrorism, PDP Tells Kaduna Governor El-Rufai",
    "summarized_story": "The PDP maintained that El-Rufai could not distance himself from those fuelling and aiding insecurity in the country.\n“Such comments and actions by Governor El-Rufai, the Buhari presidency, and other APC leaders have the propensity to embolden terrorists to unleash violence on innocent people, the results of which are now apparent and living with us.\nOkhiria stated, “We did also state that 170 of the passengers onboard the train are safe while 21 passengers are reported missing.\n“This brings the total coaches so far re-railed to seven, but only five successfully moved to the stations.\nOkhiria expressed gratitude to the security agencies, particularly, Nigerian Army, Nigerian Air force, Nigeria Police, and Nigeria Security and Civil Defence Corps, for their support and cooperation."
  },
  {
    "headline": "Buhari is Overwhelmed, Nigeria in Serious Situation, Obasanjo Says",
    "summarized_story": "Former Nigerian President Olusegun Obasanjo, on Sunday, said Nigeria’s security crisis was reaching a tipping point, stressing that the situation is made even more serious as President Muhammadu Buhari seems overwhelmed by the country’s problems.\nThe former president said the present government was overwhelmed by the situation, cautioning, however, that Nigerians must not allow the problem to overcome the country.\n“A situation where you are not safe on the road, you are not safe on the train, you are not safe at the airport, shows a very serious situation.\n“For, hiring the services of foreign mercenary is certainly beyond the power of any state governor, according to the Constitution of the Federal Republic of Nigeria.\n“There are dangers in bringing in foreign mercenaries by these governors, because their antecedents in the recent past do not give us reasons to trust them."
  }
]