[
  {
    "headline": "Tinubu attributes Oyetola’s primary victory to remarkable performance",
    "summarized_story": "A national leader of the All Progressives Congress, Asiwaju Bola Tinubu, has congratulated Osun State Governor, Adegboyega Oyetola, on his victory in the party’s governorship primary.\nTinubu, in a statement on Monday from his media office signed by Tunde Rahman, attributed Oyetola’s victory to his remarkable performance during his first term.\nHe said, “Last Saturday, February 19, 2022, the All Progressives Congress members in Osun State rose in their large numbers to exercise their democratic rights.\nFor this overwhelming victory in the APC primary election, I wholeheartedly congratulate and rejoice with Governor Oyetola.\n“This electoral victory is not only for him (Oyetola), but also for the APC and the APC members in Osun."
  },
  {
    "headline": "APC governors meet on consensus, zoning",
    "summarized_story": "Governors elected on the platform of the All Progressives Congress on Monday evening met behind closed-door at the Kebbi Governors’ Lodge, Abuja.\nThe meeting came a few hours after the Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee postponed the party’s national convention earlier slated for February 26 by another one month; the third time since December 2021.\nAlthough the Progressives Governors’ Forum Chairman, Abubakar Bagudu, did not state the specific issues to be discussed at the meeting, it is believed that the meeting will discuss a consensus chairmanship candidate ahead of March 26.\nThe meeting was also meant to enable the governors to take common positions on issues like zoning ahead of Tuesday’s meeting with the President, Major General Muhammadu Buhari (retd.\nAs the time of filing this report, the meeting was still ongoing as governors of Katsina, Aminu Masari; Zamfara, Bello Matawalle; and Cross River, Ben Ayade were yet to arrive."
  },
  {
    "headline": "Abia 2023: Ikwuano PDP stakeholders disown purported communique on guber zoning",
    "summarized_story": "In the purported communique, stakeholders from Ikwuano/Umuahia federal constituency were said to have endorsed a power shift to Abia North in 2023.\nBut Ikwuano PDP stakeholders who said they were in the said meeting distanced themselves from the purported governoship zoning which according to them was never mentioned at the meeting.\nClement Onukwue; and read by the Chairman Ikwuano PDP stakeholders, Rear Admiral Ralph Osondu (retd.\n“That any communique, being circulated and containing the support for zoning of governorship position to any zone does not have the endorsement of Ikwuano PDP Stakeholders.\n” That Ikwuano PDP Stakeholders hereby STRONGLY DISSOCIATE _ itself from the obnoxious communique in circulation.”The stakeholders restated their loyalty to Gov."
  },
  {
    "headline": "2023: Bolaji Abdullahi joins Kwara Central Senatorial District race",
    "summarized_story": "Former Minister of Youths and Sports, Mallam Bolaji Abdullahi on Monday declared his interest to vie for Kwara Central senatorial election in 2023 on the platform of the Peoples Democratic Party (PDP).\nBolaji,a former National Spokesman of All Progressives Congress,(APC) and former Commissioner for Education and Human Capital Development in Kwara state made his intention known amidst pomp and pageantry at the State party secretariat in Ilorin.\nHe said,”No matter what may have happened in the past, 2023 provides us yet another opportunity to hit the reset button and rededicate ourselves to the great task of nation-building.\n“He however noted that “Our dear country Nigeria is at the moment faced with numerous challenges, some of them unprecedented in nature and in scale.\nHe stressed among others that, “insecurity has its iron knees firmly planted on the throat of our nation."
  },
  {
    "headline": "We’ve returned APC to Imo people, Uzodimma assures stakeholders",
    "summarized_story": "Begs stakeholders to market APCThe Imo state governor, Hope Uzodimma, has pleaded with his members of the All Progressives Congress, APC, to market the party in the state.\nThe governor stated this through his Chief Press Secretary, CPS, Oguike Nwachukwu, on Monday in Owerri, at the APC, stakeholders meeting held at the party secretariat.\nAccording to the governor’s CPS, “His Excellency, Distinguished Senator Hope Uzodimma has assured Stakeholders of the All Progressives Congress (APC), Imo State of returning the ruling party to the people.\n“Governor Uzodimma used the opportunity to inform intending party members that the door of the APC in Imo State is open and that the Party is more united than it had ever been.\nSpeaking earlier, the Imo APC Chairman, Dr Ebere Macdonald, commended Governor Uzodimma for the massive support and unity that he inspires within the Party."
  },
  {
    "headline": "Man docked for allegedly stealing pharmaceutical products, car worth N3.96m",
    "summarized_story": "A 39-year-old man, Mr Offiah Chiedozie, on Monday appeared before an Ikeja Magistrates’ Court for allegedly stealing pharmaceutical products worth N2.88 million and a Toyota Camry worth N1.8 million.\nThe prosecutor, Insp Funmi Akinleye, alleged that the defendant committed the offences between Jan. 4, 2021 and October 2021, at Opebi area of Lagos State.\nALSO READ: Why unmarried female police officers are not allowed to get pregnant ―CourtThe prosecutor said that the defendant stole the products from Olpharm Nig.\nAkinyele also told the court that sometime in January 2021, the defendant stole a green Toyota Camry with Reg.\nFST 357 FM worth N1.8 million, also from the company."
  },
  {
    "headline": "Spouses, children, siblings, parents that benefit from corruption must be punished — SENATE",
    "summarized_story": "By Henry Umoru, ABUJACHAIRMAN, Senate Committee on Special Duties, Senator Yusuf Abubakar Yusuf, All Progressives Congress, APC, Taraba Central has called on the Federal Government to ensure that spouses, children, siblings, parents and all other beneficiaries of corruption proceeds must be punished along side the major actor in the crime.\nSpeaking with journalists in Abuja, Senator Yusuf called for the immediate creation of an agency that would be saddled with the responsibilities of confiscating proceeds of corruption.\n“President Muhammadu Buhari has warned us that if we do not fight corruption, corruption would definitely not only fight us, but kill us a nation.\n“His spouse, children, siblings and parents are all beneficiaries of corruption.\n“So, while the law is criminalising an individual for corruption, and he is in jail, his wife, children, siblings and parents would all be enjoying the fruits of his corruption."
  },
  {
    "headline": "Buhari demands return of more Nigeria’s artefacts abroad",
    "summarized_story": "President Muhammadu Buhari has urged nations, institutions, private and public bodies, to return Nigeria’s artefacts in their possession.\nBuhari made the call on Monday in reaction to Britain’s handover of Okukur and the Head of Oba of Benin bronzes, to the monarch, HRH Oba Ewuare II.\nThe artefacts were taken away by British soldiers in 1897 when they attacked the ancient Benin Kingdom.\n”These are unprecedented moves worth emulating by others”, the President said while encouraging Britain to return others.\nBuhari also commended Germany which is in the process of repatriating 1,130 Benin bronzes this year."
  },
  {
    "headline": "Why Kano will host biggest rail station in Nigeria – Amaechi",
    "summarized_story": "Minister of Transportation, Rotimi Amaechi, says Kano State will house the biggest rail station in the country because it will combine two rail lines.\nAmaechi stated this when a delegation from Kano State, led by Gov.\n”We are applying to the Kano State Government to give us land to build the biggest station in Nigeria.\n”Don’t forget the station we are building in Kano will be the station that will take passengers from Lagos to Kano.\nAccording to the minister, there will be an expansion in the concept of the Kano Station, which is largely the same framework as the Lagos Station but has more space than the Lagos Station."
  },
  {
    "headline": "IPPIS: FG suspends salaries of 243 workers for shunning verification exercise",
    "summarized_story": "The salaries of 243 workers have been suspended for failing to update their records online on the Integrated Payroll and Personnel Information System, IPPIS.\nRecall that the Federal Government directed workers to update their records online on IPPIS platform and had promised to suspend the salaries of 1,173 of its workers by January if they fail to comply with the directives.\nGhost workers were also discovered in the office of the Auditor-General of the Federation, some federal government colleges and Office of the Accountant-General of the Federation.\nThe circular partly read, “Despite all the publicity and circulars to Ministries, Department and Agencies, some employees in the core MDAs did not comply with this directive and were suspected as ‘ghost’ workers.\n“The salaries of 243 officers in the attached list have been suspended from the IPPIS platform immediately."
  },
  {
    "headline": "Dapo Abiodun shuts down schools for installation of new Oba in Ogun",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has ordered that all schools in Ijebu-Igbo and its environ should be shut down on Wednesday over the installation of a new Orimolusi.\nRecently, the Dapo Abiodun-ked government approved the nomination of Prince Lawrence Jaiyeoba Adebajo as the new Oba of the community.\nAs the Oba is to be crowned on Wednesday, Abiodun said all academic activities should be halted as a mark of honour for the new monarch.\nThis, he said, was also done to allow teachers, parents and students participate in the event.\n“Therefore, as a mark of honour for the new monarch and to ensure a memorable event, the Governor of Ogun State, His Excellency, Prince Dapo Abiodun, MFR, has directed that all schools in Ijebu-Igbo and its environ should not open on Wednesday, 23rd February, 2022."
  },
  {
    "headline": "Nigeria’s insecurity: Obasanjo recalls meeting with Boko Haram, laments 15m out-of-school children",
    "summarized_story": "Former Nigeria’s President, Olusegun Obasanjo, has recalled his private meeting with the deadly Boko Haram in 2011.\nThe retired General warns that Nigeria must address the challenge of 15 million out-of-school children or face more problems in future.\nHis speech was on the theme “Beyond Boko Haram: Addressing Insurgency, Banditry and Kidnapping across Nigeria”.\nObasanjo, MMF Board of Trustees Chairman, noted that with Nigeria’s population of 215 million, 15 million out-of-school kids pose a serious problem.\n“But if we don’t do anything about those 15 million out-of-school children, we are already in more trouble with Boko Haram of the future."
  },
  {
    "headline": "FAAN orders AIB, Caverton, others to relocate",
    "summarized_story": "Other organisations that will be affected by this order include Caverton, Dominion, Evergreen Apple Nigeria and ExecuJet hangars.\nNnolim Nnaji Aviation, warned FAAN against demolishing the affected offices and private hangars at Lagos Airport, because it would cost the country billions of naira.\nFAAN stated that the agency would not compensate the affected organisations but that it would provide them land.\nShe explained that FAAN would give the affected organisations new land within the airport.\nShe added that the affected organisations were not given two weeks to relocate as being speculated."
  },
  {
    "headline": "NBS: Kerosene price declined by 6.60% in January",
    "summarized_story": "The National Bureau of Statistics (NBS) has said the average retail price of household kerosene fell by 6.60 per cent last month.\nNBS said the average price per gallon of kerosene paid by consumers decreased to N1528.74 last month from N1582.73 last December, indicating a decline in average retail price by 3.41 percent monthly.\n- Advertisement -On a year-on-year, according to the Bureau, the average price per gallon of kerosene increased by 28.34 percent from N1191.13 in January 2021.\nNBS said the zone with the lowest average retail price was the North-west with N243.62.\nThe NBS also said in another document entitled: “Liquefied Petroleum Gas (Cooking Gas) Price Watch (January 2022),” that the average price for refilling a 5kg cylinder of Liquefied Petroleum Gas (Cooking Gas) stood at N3657.57 in January 2022."
  },
  {
    "headline": "Protesters block Ughelli-Asaba road over neglect",
    "summarized_story": "Commuters plying the Asaba- Ughelli Expressway were stranded for several hours after a protest by Ovrode Community in Isoko North Local Government Area over alleged neglect of the community.\nHe went on: “Ovrode as an Oil producing Community since 1963 till date, has no federal or state government projects in the community, not even DESOPADEC or NDDC project since 1999 till date.\n“Ovrode Community is seriously bleeding.\n- Advertisement -“Since two weeks ago that we made the first protest, could you believe that we have not hear from the State or Federal Government.\n“Not even a response from the Honourable Member representing Isoko North Constituency at the Delta State House of Assembly."
  },
  {
    "headline": "Assembly issues ultimatum to Nasarawa over teachers’ salaries",
    "summarized_story": "Nasarawa State House of Assembly has issued a two-week ultimatum to the state government to pay the three months salaries of 496 newly employed secondary school teachers.\nSpeaker of the Assembly, Ibrahim Balarabe Abdullahi, gave the directive when five senior government officials appeared before the House yesterday in Lafia, the state capital to clarify issues with the House regarding the teachers’ salaries.\n“We are giving you from now and the end of the working hours of next week to pay the teachers their salaries,” he said.\nMr Nicholas Abari Aboki, the Head of Service confirmed the employment of 496 teachers.\nHe assured the lawmakers that he would write a memo to Governor Abdullahi Sule for approval on the payment of the teachers’ salaries."
  },
  {
    "headline": "Fed Govt to meet ASUU Tuesday over strike",
    "summarized_story": "The Federal Government has said it will meet today with the leadership of the Academic Staff Union of University (ASUU) over the one-month warning strike embarked by its members.\nThe Deputy Director of Press and Public Relations in the Ministry of Labour and Employment, Mr. Charles Akpan, announced this in a statement yesterday in Abuja.\n- Advertisement -Also, the National Association of Nigerian Students (NANS) has threatened to block Federal roads nationwide over the ongoing ASUU strike.\nNANS National President Sunday Asefon announced this in a statement yesterday in Abuja.\nAsefon said the decision to block major Federal roads was taken at the association’s congress in Sokoto."
  },
  {
    "headline": "APC governors in close-door meeting in Abuja",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) Progressive Governors Forum (PGF) are currently at Kebbi State Governor’s Lodge, Abuja, for the all-important meeting to deliberate on the challenges confronting the National Convention of the party.\nThe governors of Lagos, Babajide Sanwo-Olu, Ebonyi, Engr Dave Umahi, Ekiti, Kayode Fayemi, Kebbi, Abubakar Atiku Bagudu, Gombe, Yahaya Inuwa and Anambra State deputy governor, Nkem Okeke were the early birds.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nOthers in attendance include Borno State governor, Prof Babagana Zulum, Kaduna, Nasir El-Rufai, Ogun, Dapo Abiodun, Niger, Abubakar Bello, Plateau, Simon Lalong, Ondo, Rotimi Akeredolu, Kano, Umar Ganduje and Yobe State Governor who doubles as the chairman APC Caretaker/Extraordinary Convention Planning Committee, Mai Mala Buni among others."
  },
  {
    "headline": "Drug scandal: Kyari sues FG, fails in bid to regain freedom",
    "summarized_story": "From Godwin Tsa, AbujaAttempts by the detained Deputy Commissioner of Police, DCP, Abba Kyari, to regain his freedom from the custody of the National Drug Law Enforcement Agency, NDLEA, on health grounds has failed before the Abuja division of the Federal High Court.\nKyari, has however filed a suit against the Federal Republic of Nigeria ((FRN), marked FHC/ABJ/CS/182/22, challenging his continued detention.\nIn the fundamental right enforcement suit, Kyari is praying the court to compel the NDLEA to grant him bail on health grounds, pending the hearing and determination of his motion on notice.\n“That since he was receiving medical treatment on daily basis due to the seriousness of the illness and that since February 12, 2023, he has not access any medical treatment which is dangerous to his health.\nKyari further told the court that he was being held “on the basis of a false allegation that was levelled against him”."
  },
  {
    "headline": "DISCLAIMER NOTICE: CIRCULATION OF CLONED AND FAKE SUNDAY SUN E-PAPER",
    "summarized_story": "Nigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nMeanwhile, our Company is not taking this infraction lightly as necessary steps are being taken in collaboration with law enforcement agencies to unmask the criminal elements behind it and ensure that justice is served.\nFor the avoidance of doubt and being misled, readers, advertises and the public are advised to subscribe for the authentic Daily Sun, Saturday Sun and Sunday Sun e-papers via https//app.thenewspaperstand.com/publication/daily-sun.\nSignedObinna Kalu, EsqGeneral Counsel/Company SecretaryFor: ManagementDated this 21st day of February, 2022"
  },
  {
    "headline": "BREAKING: APC postpones National Convention indefinitely",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) has postponed its much-awaited national convention indefinitely, writing to the Independent National Electoral Commission (INEC) to notify it of its arrangement to conduct zonal congresses on Saturday, March 26, 2022.\nRegular individuals can earn as low as $300 daily Find out how it works.\nTitled: “Notice for the conduct of zonal congresses”, the letter read: “The notice supercedes our earlier notice for National Convention referenced APC/NHDQ/INEC/019/22/14 this is predicated on the evaluation of our party constitution.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nWhile hoping to receive your cooperation, please accept the assurances of our highest esteem,” the notification letter read."
  },
  {
    "headline": "BREAKING: Court dismisses suit challenging Atiku’s Nigerian citizenship",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court has struck out a suit challenging the Nigerian citizenship of former Vice President, Alhaji Atiku Abubakar.\nSpecifically, the plaintiff had approached the court for an interpretation of Sections 25(1) & (2) and 131(a) of the 1999 Constitution.\n“In other words, the plaintiff lacks the requisite locus standi to bring this action against the defendants.\nOnce the court finds that the plaintiff lacks locus standi, then the court lacks jurisdiction to consider or decide any other issue in the suit and this is the case here.\n“The consequence of lack of locus standi is dire and the courts have been unwavering in making pronouncements on it."
  },
  {
    "headline": "Breaking: APC Holds National Convention March 26",
    "summarized_story": "By Adedayo AkinwaleThe All Progressives Congress (APC) has resolved to hold its national convention on March 26, 2022.\nInitially, the ruling party scheduled its convention to hold on February 26 before it was postponed.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari May Sign Electoral Bill Today, Seeks Lawmakers’ Assurances to Amend Clause 84",
    "summarized_story": "There had been misgivings about the new amendment, which had also fuelled speculations on whether or not the president would sign it into law.\n“Where a political party fails to comply with the provisions of this Act in the conduct of its primaries, its candidate for election shall not be included in the election for the particular position in issue.\n“Notwithstanding the provisions of this Act or rules of a political party, an aspirant, who complains that any of the provisions of this Act and guidelines of a political party have not been complied with in the selection or nomination of a candidate of a political party for election, may apply to the Federal High Court for redress.\nHe, however, maintained that, “The country is watching, and Mr. President has been promised a date of February 26th, 2022, for the APC National Convention.\n“As Nigeria’s biggest political party shops for a new Chairman, we hereby examine some factors that may determine, who wears the crown from the North Central zone,” the stakeholders said."
  },
  {
    "headline": "How Presidency’s Intervention Speeded up Kyari’s Arrest",
    "summarized_story": "Micheal Olugbode in AbujaFresh facts have emerged on the process leading to the arrest of “super cop” Deputy Commissioner of Police (DCP) Abba Kyari and his subsequent hand over to the National Drug Law Enforcement Agency (NDLEA) last week.\nAfter securing the nod of the presidency to move against Kyari, the drug agency approached the Inspector General of Police.\nThe IG was presented some of the damning evidence gathered against Kyari and his co-conspirators, urging him to release Kyari to the agency for interrogation.\n“The IGP promised the NDLEA that Kyari was going to be handed over to them on Thursday, February 10, but that did not happen.\nThe drug agency waited all through that weekend, but nothing happened."
  },
  {
    "headline": "From $380bn Loss in 50 Years, Nigeria’s Oil Industry Begins In-country Annual Retention of $8bn",
    "summarized_story": "•50,000 jobs created since creation of NOGICD Act, says Wabote•Local oil firms now produce 60% of Nigeria’s domestic gasEmmanuel Addeh in AbujaFrom a whopping $380 billion loss in capital flight due to the absence of an enabling law for retention of capital in the oil and gas industry, Nigeria currently has an annual in-country retention of $8 billion under the Nigerian Oil and Gas Industry Content Development (NOGICD) Act.\nExecutive Secretary of Nigerian Content Development and Monitoring Board (NCDMB), Mr. Simbi Wabote, stated this in Lagos during a meeting with editors.\nWabote revealed that about two million jobs were also lost during the 50 years that the country’s oil and industry operated without a capital retention law.\nBut he said at least 50,000 jobs had so far been created with the implementation of the NOGICD Act.\nAs part of this goal, the board, he noted, would catalyse the creation of 300, 000 direct jobs in the oil and gas industry and linkage sectors and enable the retention of $13 billion out of the estimated annual $20 billion spend in the oil and gas industry."
  },
  {
    "headline": "Tinubu Floors Aregbesola as Oyetola Wins Osun APC Primary",
    "summarized_story": "The Osun State governor won in Aregbesola’s ward with 309 votes against 146 recorded for Adeoti, the aspirant anointed by Aregbesola.\nHowever, Aregbesola was absent from the primary election and was said to have left Ilesa for Abuja yesterday morning for unspecified official duty.\nAdeoti said the ugly development in Osun APC has sent a wrong signal as to whether the APC has a future in the state.\nHe also accused Oyetola of using intimidation and violence to ensure that the primary election was not free and fair.\n“We are reliably informed that Governor Oyetola is the one who hand-picked the Chairman and members of the primary election committee."
  },
  {
    "headline": "BREAKING: Court Declines Disgraced 'Supercop', Abba Kyari's Bail Application As Lawyer Says He Is Diabetic, Hypertensive",
    "summarized_story": "A Federal High Court in Abuja has refused to hear an application filed by the disgraced Deputy Commissioner of Police, Abba Kyari, seeking bail.\nKyari, accused of drug trafficking, has been in the custody of the National Drug Law Enforcement Agency (NDLEA).\nHowever, he filed an application asking the court to grant him bail on the grounds of ill health.\nIn an ex parte application brought before the court on Monday, Kyari through his counsel, Cynthia Obianuju, told the court that his health was suffering.\nHis counsel, Cynthia described his client as diabetic and hypertensive, thereby praying the court to grant him bail pending the determination of the substantive suit."
  },
  {
    "headline": "BREAKING: Court Declines Disgraced 'Supercop', Abba Kyari's Bail Application As Lawyer Says He Is Diabetic, Hypertensive",
    "summarized_story": "A Federal High Court in Abuja has refused to hear an application filed by the disgraced Deputy Commissioner of Police, Abba Kyari, seeking bail.\nKyari, accused of drug trafficking, has been in the custody of the National Drug Law Enforcement Agency (NDLEA).\nHowever, he filed an application asking the court to grant him bail on the grounds of ill health.\nIn an ex parte application brought before the court on Monday, Kyari through his counsel, Cynthia Obianuju, told the court that his health was suffering.\nHis counsel, Cynthia described his client as diabetic and hypertensive, thereby praying the court to grant him bail pending the determination of the substantive suit."
  },
  {
    "headline": "Terror-linked Minister, Pantami Had Poor Record Of Service As Abubakar Tafawa Balewa University Lecturer — Nigerian Lecturers’ Union, ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has indicted Minister of Communications and Digital Economy, Isa Pantami, over his appointment as a professor of Cybersecurity by the Federal University of Technology, (FUTO), Owerri in Imo State.\nAccording to a report by the National Executive Committee of the union, Pantami had a poor record of service during his stint as a lecturer in Abubakar Tafawa Balewa University hence does not qualify to be appointed as a professor.\nThe Minister reportedly got the fellowship with the condition to work for the University (ATBU) upon return for twice the period of the study.\n“After obtaining his PhD, he picked up an appointment with Medinah University as Assistant Professor before returning to ATBU, Bauchi.\nBefore his resignation in 2015, he had picked up an appointment as Assistant Professor with the University of Medinah in 2014."
  },
  {
    "headline": "Terror-linked Minister, Pantami Had Poor Record Of Service As Abubakar Tafawa Balewa University Lecturer — Nigerian Lecturers’ Union, ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has indicted Minister of Communications and Digital Economy, Isa Pantami, over his appointment as a professor of Cybersecurity by the Federal University of Technology, (FUTO), Owerri in Imo State.\nAccording to a report by the National Executive Committee of the union, Pantami had a poor record of service during his stint as a lecturer in Abubakar Tafawa Balewa University hence does not qualify to be appointed as a professor.\nThe Minister reportedly got the fellowship with the condition to work for the University (ATBU) upon return for twice the period of the study.\n“After obtaining his PhD, he picked up an appointment with Medinah University as Assistant Professor before returning to ATBU, Bauchi.\nBefore his resignation in 2015, he had picked up an appointment as Assistant Professor with the University of Medinah in 2014."
  },
  {
    "headline": "Nine Ghanaians Arrested in Lagos For Allegedly Smuggling N200million Indian Hemp Into Nigeria",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC), Lagos State Command, on Monday, paraded nine Ghanaians for allegedly smuggling about 201 bags of Indian hemp (cannabis sativa) valued at N200m into the country.\nThe suspects are Musa, Gasie, Adotete, Sottie, Tette, Okonipa, Stephen, Toyokpti and Natte all Ghanaians fishermen.\nParading the suspects at the Command’s headquarters in Ikeja, Lagos State, the state commandant, Edenabu Okoro Eweka, said the suspects were arrested through the support of the Nigerian Navy.\nNarrating how the suspects were arrested, Eweka said: “The suspects loaded the products in a shop with the hope of smuggling them into the country.\n“They were apprehended when they ran out of fuel and one of them strolled into the country to get fuel."
  },
  {
    "headline": "2023: 'He was misunderstood’ — aide clarifies Tinubu's ‘fight dirty’ comment",
    "summarized_story": "Tunde Rahman, media aide to Bola Tinubu, a chieftain of the All Progressives Congress (APC), says his principal’s comment on being “ready to get dirty” over his presidential bid was misunderstood.\nI have read about a Greek philosopher that if you want to fight a pig, you must be ready to be smeared and I’m ready to be dirty,” Tinubu had said.\nBut in a statement issued on Monday, Rahman said Tinubu’s statement was misunderstood.\n“Sadly, the wrong headline and story have been latched on by some online platforms/blogs and commentators to pour invective on Asiwaju Tinubu.\nThere is a wise saying that if you want to wrestle with the pig, be ready to get dirty and deal with the poo-poo."
  },
  {
    "headline": "2023: 'He was misunderstood’ — aide clarifies Tinubu's ‘fight dirty’ comment",
    "summarized_story": "Tunde Rahman, media aide to Bola Tinubu, a chieftain of the All Progressives Congress (APC), says his principal’s comment on being “ready to get dirty” over his presidential bid was misunderstood.\nI have read about a Greek philosopher that if you want to fight a pig, you must be ready to be smeared and I’m ready to be dirty,” Tinubu had said.\nBut in a statement issued on Monday, Rahman said Tinubu’s statement was misunderstood.\n“Sadly, the wrong headline and story have been latched on by some online platforms/blogs and commentators to pour invective on Asiwaju Tinubu.\nThere is a wise saying that if you want to wrestle with the pig, be ready to get dirty and deal with the poo-poo."
  },
  {
    "headline": "Report: Despite petrol subsidy, transport fares increased by 283% in five years",
    "summarized_story": "SBM Intelligence, a geopolitical research firm, says despite petrol subsidy payments, transport costs and petrol prices increased disproportionally from 2017 to 2021.\nSBM said this in a new report by the research firm titled ‘Growing Fuel Subsidy and Transport Costs: Which Way Forward, Nigeria?’It said over five years, petrol prices increased by 12.1%, petrol subsidy by 890% and transport cost by 283%.\nAnd the answer wasn’t far-fetched in the huge amounts that went into fuel subsidy for the period,” SBM Intel said.\nAdvertisement“Around this time (April to June 2020), petrol price was reduced to N125, yet transport cost didn’t reduce.\nBetween 2020 and 2021, fuel subsidy cost increased by almost 20%, transport cost increased by a corresponding 33% while fuel price increased at a meagre 1.8%.”"
  },
  {
    "headline": "Report: Despite petrol subsidy, transport fares increased by 283% in five years",
    "summarized_story": "SBM Intelligence, a geopolitical research firm, says despite petrol subsidy payments, transport costs and petrol prices increased disproportionally from 2017 to 2021.\nSBM said this in a new report by the research firm titled ‘Growing Fuel Subsidy and Transport Costs: Which Way Forward, Nigeria?’It said over five years, petrol prices increased by 12.1%, petrol subsidy by 890% and transport cost by 283%.\nAnd the answer wasn’t far-fetched in the huge amounts that went into fuel subsidy for the period,” SBM Intel said.\nAdvertisement“Around this time (April to June 2020), petrol price was reduced to N125, yet transport cost didn’t reduce.\nBetween 2020 and 2021, fuel subsidy cost increased by almost 20%, transport cost increased by a corresponding 33% while fuel price increased at a meagre 1.8%.”"
  },
  {
    "headline": "APC postpones convention to March 26",
    "summarized_story": "The All Progressives Congress (APC) has fixed March 26 for its national convention.\nThe development comes weeks after the party announced that the national convention would hold on February 26.\nThe zonal congresses would be held alongside preparations for the party’s convention.\n“The convention activities will commence on February 24 and terminate at Eagle Square on 26th of March.\nIn between the convention, we have agreed to have zonal congresses.”The development comes days after Hope Uzodimma, governor of Imo, had said although there were no plans by the APC to postpone the convention, the date wasn’t sacrosanct."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "Crypto crime grows to $14 billion as crypto popularity increases",
    "summarized_story": "In 2021, crypto criminals made a killing, as illicit crypto transactions hit $14 billion, a 79% jump from the $7.8 billion recorded in 2020, according to a report by US-based blockchain analytics company, Chainalysis.\nThe growth in illicit crypto transactions is attributed to a 567% jump in overall transaction volume in 2021.\nGiven that overall crypto transactions grew to $15.8 trillion in 2021, it is not surprising that cybercriminals are increasingly using crypto.\nDespite the increase in the total volume of illicit transactions, illicit transactions represented just 0.15% of the total cryptocurrency transaction volume in 2021—its lowest ever.\nWhat this means is that legitimate crypto transactions far outstrip illegal transactions."
  },
  {
    "headline": "From telecoms to tech: MTN changes logo to look the part",
    "summarized_story": "Africa’s biggest telecom company MTN is preparing for a brand refresh that’ll position it as a technology company, rather than a telecommunications company.\nThe brand refresh includes forgoing the white, yellow and red lettering in favour of a black lettered MTN logo surrounded by an oval, similar in shape to a rugby ball.\nThe new look is “aligned to our evolution from a telecommunications company to a technology company underpinned by one simple and consistent yet striking brand”, Morafo said.\nCurrent MTN logoNew MTN LogoMTN’s expansion drive to become a fully-fledged technology services company also means that it’s on a hiring drive to hire 150 digital experts in South Africa.\nThis rebrand will help shift public perception of the MTN brand and also influence its market valuation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Flutterwave 3.0, Google’s Android Privacy Sandbox, Africa-produced mRNA vaccines",
    "summarized_story": "Meanwhile, on Friday, February 18, 2022, the World Health Organization (WHO) announced the first six countries to receive the technology needed to produce mRNA vaccines in Africa.\nAfrica-produced mRNA vaccinesWe’ve all probably heard a lot more about vaccines in the last couple of years than we thought we would in our lifetime.\nCurrently, two of the world’s most effective COVID-19 vaccines are messenger RNA (mRNA) vaccines.\nmRNA vaccines use mRNA created in a laboratory to teach our cells how to make a protein — or even just a piece of a protein — that triggers an immune response inside our bodies.\nOn Friday, February 18, 2022, the World Health Organization (WHO) announced the first six countries to receive the technology needed to produce mRNA vaccines in Africa."
  },
  {
    "headline": "It’s all about seed rounds",
    "summarized_story": "For example, some freight companies in Africa still manage their shipments using outdated methods like spreadsheets, phone calls, and emails.\nAnd this company has announced $4 million in seed funding to expand across the country and into neighbouring regions.\nIt also saw participation from XYZ Ventures, Village Global, Musha Ventures, Ventures Platform, Voltron Capital, and Paystack CEO Shola Akinlade.\nNonso Onwuzulike officially launched the company in January 2022 to improve employees’ financial well-being.\nWhat’s more, the company will use the seed funding to speed up the development of its platform to serve large enterprise employers."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Nigerian Women get huge boost as U.K. Backs First Bank With $100 Million Credit",
    "summarized_story": "CDC Group, the U.K.’s development-finance arm, will provide a $100 million credit facility to First Bank of Nigeria Ltd. to help support women-owned businesses and small companies in Africa’s largest economy, reports Bloomberg.\nA minimum of $30 million will be allocated in the form of credit lines to women entrepreneurs, it said.\n“If you don’t support women and girls, you’re locking out half your country,” U.K. Minister for Africa Vicky Ford said in an interview in Nigeria’s capital, Abuja.\nThe facility will use First Bank’s 700 branches and 150,000 banking agents in Africa’s most-populous country to improve credit access.\nThe facility will help “unlock the potential for entrepreneurial success and economic growth across the country,” he said."
  },
  {
    "headline": "Unceasing import substitution policy worsens Nigeria’s economic woes",
    "summarized_story": "The industrial revolution of the 18th and 19th centuries was accompanied by Britain’s unilateral free trade policy.\n“Sri Lanka’s agricultural sector recorded increased production due to import substitution policies.\nThus, in all, the LCCI noted that there was a negative impact of CBN’s restrictive foreign policy.\n“The current import substitution strategy in Nigeria seems to be borne out of fear and capricious thinking rather than clear economic rationalization.\nIn essence, a temporary import substitution for select commodities in which Nigeria has potential comparative advantage should be pursued.” The FDC Says."
  },
  {
    "headline": "APC zeros in on Al’Makura, Akume, Bwari for chairman",
    "summarized_story": "They also narrowed the choice of preferred candidates to three aspirants, namely, Tanko Al’Makura (Nasarawa State), George Akume (Benue State) and Abubakar Bawa Bwari (Niger State) in that order.\nThe meeting also agreed to zone the office of National Secretary to the South-South; Deputy National Chairman (South) to the South West; Deputy National Chairman (North) North-West; National Treasurer (South East) and National Financial Secretary (North East).\n“Top on our priority in the choice of a national chairman that is loyalty to the party, with pedigree and patriotic to the country.\nIn 1980, Almakura became the youth leader of the National Party of Nigeria (NPN) in the old Plateau State.\nHe was elected to the Constitution Assembly of 1988–89, representing the Lafia–Obi Federal Constituency of what is now Nasarawa State."
  },
  {
    "headline": "Stakeholders commit to success of Edo Anti Corruption Strategy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Media and Civil Society stakeholders in Edo state have expressed their commitment to the actualization of the objectives of the Edo State Integrity and Accountability Strategy (EDSIAS) to promote transparency in governance.\nOther areas of intervention the stakeholders said would include the formation of coalition and platforms in support of the fight against corruption and being anti-corruption champions themselves by refusing to participate in corrupt practices.\nProf Onyukwu said critical stakeholders like the Media and CSOs were needed to create the needed synergy with the public with the aim of moderating their psyche against glorifying corrupt practices as currently being observed among some segments of our society.\n“Corruption is gradually being considered as a necessary evil in the sharing of the proverbial national cake.\nCritical attitude of citizens against corruption is getting weakened and we have got no choice other than to do everything to revalidate it” Prof Onyukwu said."
  },
  {
    "headline": "Archbishop Idahosa Inaugurates All Nations For Christ Bible Institute’s Alumni – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – THE Archbishop, Church of God Mission, Dr (Mrs) Margaret Benson-Idahosa, yesterday inaugurated the All Nations for Christ Bible International Institute’s Alumni Association (ANFCBIIAA), charging them to go forth and raise men and women to propagate the message of Christianity to all nationals of the globe.\nThe alumni are made up of graduates of the All Nations For Christ Bible International Institute, founded by the late Archbishop Benson Idahosa in 1968 to groom budding evangelists to propagate the message of Christianity.\n“Today, God is telling me to tell you that you are not strangers to Him.\nI thank all of you who have worked for the All Nations for Christ Bible International Institute.\nAccording to him, “that is why we asked Mama Idahosa to validate the bible institute’s alumni association to give it more authority as sons and daughters of the late archbishop Benson Idahosa who have decided from across the globe to come together as alumni."
  },
  {
    "headline": "U-17 Wins Edo Cricket League Title, As NCF President Splash Cash, Gifts On Deserving Cricketers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – THE 2021/22 Season of the Edo Cricket was rounded off last weekend as the Edo Under-17 Cricket Team retained the title they won last year with 62 runs win over Ambrose Alli University Cricket Club, Ekpoma.\nUyi Akptata, the President of the Nigeria Cricket Federation who is also the Chairman of Edo State Cricket Club, speaking to Sports Writers shortly after the game commended the two teams for given good account of themselves.\nAmbrose Alli University Cricket Club edged Dolphins Cricket Club by six wickets on the opening day of the event, while No Limit Cricket Club fell by nine wickets to the U-17 side to set up the finals on Sunday.\nHigh points of the event was the presentation of Trophiea and Individuals awards to deserving players, as David Abiebhode of U-17 cricket club bagged three awards.\nProsper Useni also of U-17 team being the youngest player to play for the national team and national under-19 team won the National breakthrough of the year award."
  },
  {
    "headline": "NNL WK 2: Bendel Insurance beat J. Atete FC 2-0 as Benin Arsenals encourage fans with free jerseys – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Bendel Insurance FC of Benin on Saturday evening defeated J. Atete FC of Delta state 2-0 to steady their sailing in the new football season of the Nigeria National League(NNL).\nThe visiting J. Atete FC who looked defensive in their approach to the game were yet to recover from shock before the referee signalled his whistle for halftime break.\nSpeaking during the post match interview, Bendel Insurance FC coach Monday Odigie expressed joy over their first victory in the new season.\nJ. Atete FC coach Emakpo Akpoguma on the other hand praised his boys efforts,but however admitted that they lost to a better side.\nMeanwhile, Insurance players while celebrating their victory gave out their Sterling Bank Jerseys to their supporters and fans in appreciation of their steadfastness."
  },
  {
    "headline": "Young entrepreneurs laud Osun Food Support Scheme",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe monthly Food Support Scheme initiated by the Administration of Osun State Governor, Adegboyega Oyetola aimed at cushioning the socio-economic effects of COVID-19 pandemic has once again been commended by young entrepreneurs who are into local production of stable foods in the State.\nThe highly-excited young entrepreneurs also extolled government for providing an enabling environment and sustainable template for their businesses to thrive, saying the gesture has rekindled their hope for a better tomorrow.\nThe young entrepreneurs had been contracted to make the supply specialised in the production of food commodities such as garri, cassava/yam flours, banana flours, pando-yam among other stable foods.\nOlalekan Badmus said the Administration of Governor Oyetola would continue to sustain the scheme.\n“To arrive at this noble gesture, we are able to identify young entrepreneurs who are into various staple foods productionsm."
  },
  {
    "headline": "Osun APC Primary: Aregbesola’s Camp Rejects Oyetola’s Victory, Heads to Court",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Minister of Interior, Rauf Aregbesola’s faction of All Progressives Congress, APC, in Osun State, has rejected the result of last Saturday’s governorship primary election in the state, vowing to seek redress in court.\nHe stated that the primary election was fraught with fraud and manipulation.\n“Contrary to the guidelines, accreditation did not take place in many election centres while result sheets were unavailable.\n“The appointees of Governor Gboyega Oyetola were the appointed electoral officers and supervisors of the exercise.\n“That position was used by Governor Oyetola to get so many things manipulated in the process leading to conduct of the primary, including the furtive change of date of the exercise."
  },
  {
    "headline": "UNN to establish Research Centre on African Philosophy in honour of Prof Uzodinma Nwala",
    "summarized_story": "OBINNA EZUGWUThe Department of Philosophy at the University of Nigeria, Nsukka (UNN), has concluded plans for the establishment of a Research Centre on African Philosophy, to mark the birthing of the study of African Philosophy as a field of study in the curriculum of the global University system.\nThe event is one of the activities lined up to celebrate the 80th birthday of Prof. Timothy Uzodinma Nwala who pioneered the teaching of African Philosophy in UNN and made it an internationally recognised discipline.\nNwala, an eminent Professor of Philosophy and the first Nigerian to take a degree in Philosophy from an indigenous Nigerian university, taught at UNN for 30 years before he left to go and teach/establish the Philosophy Department in other universities such as University of Abuja, Benue State University, Nasarawa State University and Kogi State University.\nA former President of the Nigerian Philosophical Association (NPA), Prof. Nwala is generally regarded in the academia as the father of African Philosophy.\nNwala is currently the President of Alaigbo Development Foundation (ADF), a Frontline pan-Igbo organization."
  },
  {
    "headline": "APC postpones national convention indefinitely, to hold zonal congresses March 26",
    "summarized_story": "Nigeria’s ruling party, the All Progressives Congress (APC) has postponed its convention indefinitely.\nThe party had initially scheduled the convention for February 26, 2022, but apparently couldn’t hold on account of crisis.\n“This notice supersedes our earlier notice for the National Convention referenced APC/NHDQ/INEC/019/22/14.\nWhile hoping to receive your cooperation, please accept the assurances of our highest esteem.”Th party is however, yet to communicate a new date for the convention.\nSources at the ruling party’s national secretariat had earlier informed Daily Trust that March was being considered for the conventionFacebook Notice for EU!"
  },
  {
    "headline": "2023: South-West Youths Rally Support For Atiku’s Presidential Ambition",
    "summarized_story": "Youths from across the six South-Western states of Nigeria, on Monday, staged a rally to drum support for the presidential ambition of former Vice President Atiku Abubakar in 2023.\n“We believe that there is absolutely nothing wrong in whether it is an old person or a younger person.\nThere could be other wants, but we believe that what we need should trump what we want!\nWe need someone that has the experience, as an elder person to take the step so that we youths can learn from them.\nI will believe that he is a coward if he is not declaring himself to contest the elections as the next president of this country,” Ismaheel stated."
  },
  {
    "headline": "BREAKING: Abba Kyari Sues Federal Govt, Seeks Bail On Health Grounds",
    "summarized_story": "The suspended Deputy Commissioner of Police and former head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, currently being detained by the National Drug Law Enforcement Agency (NDLEA), over his alleged involvement in drug trafficking, has dragged the federal government to court.\nIn the suit marked FHC/ABJ/CS/182/22, the embattled police officer is praying the court to compel the NDLEA to grant him bail on health grounds, pending the hearing and determination of his fundamental rights enforcement application.\nADVERTISEMENT“Upon studying the process of the Applicant and averments in support thereon, I am of the opinion that the Respondent should be put on notice,” the Judge held.\nEffort by counsel to the Applicant to persuade the court to order Kyari’s release on the ground that “his health has deteriorated badly,” failed.\nRather, Justice Ekwo ordered that all the relevant processes should be served on the Federal Government, which was cited as the sole Respondent, even as he adjourned the case till February 24 for hearing."
  },
  {
    "headline": "Group, Analyst Decry Delay In NDDC Board Inauguration",
    "summarized_story": "Anti-corruption group, Act for Positive Transformation Initiative (APTI), and a renowned TV analyst, Babajide Kolade-Otitoju, have joined the ranks of stakeholders to decry the delay by President Muhammadu Buhari in inaugurating the substantive Board of the Niger Delta Development Commission (NDDC).\nAccording to Kolade-Otitoju, a journalist, polemicist, and historian, who was awarded Political Analyst of 2019, the delay in inaugurating the NDDC board shows that the government was not prepared to do anything about the reported ongoing corruption in NDDC.\nADVERTISEMENT“If we were prepared, by now we would have put a board in place just as the President (Buhari) had promised.\nSo other Niger Delta states are effectively shut out of the running of the place (NDDC),” he said.\nKolade-Otitoju, therefore, urged President Buhari to implement the recommendations of the Senate in the June/July 2020 probe of NDDC."
  },
  {
    "headline": "4 Years After: Parents Seek Leah Sharibu’s Release Alive",
    "summarized_story": "Parents of the abducted Dapchi schoolgirl in Yobe State, Leah Sharibu, have called for her immediately release from captivity four years after she was kidnapped alongside with others.\nRecall that in February 2018, Boko Haram terrorists abducted 110 schoolgirls from a secondary school in Dapchi, Yobe State, North-East Nigeria.\nWhile others were released, one girl, Leah Sharibu, remains in captivity.\nHer parents remain hopeful that she will be released but said the government was doing nothing to ensure her release.\nHe also appealed to President Buhari, Governor Mai Mala Buni and Nigeria security agencies to do all within their powers to secure Leah’s release and other abducted students."
  },
  {
    "headline": "BREAKING: Court Strikes Out Suit Seeking To Disqualify Atiku From 2023 Contest",
    "summarized_story": "A Federal High Court in Abuja, on Monday, struck out a suit seeking the disqualification of former Vice President Atiku Abubakar, from contesting the 2023 presidential election.\nThe suit, marked FHC/ABJ/CS/177, challenged Atiku’s eligibility on the premise that he is not a Nigerian by birth.\nThe Adamawa State government, through its Attorney-General (AG), had on July 27, 2021, sought an order of the court to be joined in the suit.\nThe state government told the court that Atiku was eligible to vie for the office of the president.\nDelivering judgement on the case, Justice Inyang Ekwo struck out the suit for want of merit."
  },
  {
    "headline": "Appeal Court judge, Justice Pemu escapes from kidnappers in forest",
    "summarized_story": "The Presiding judge of the Court of Appeal, Owerri Division, Justice Rita Pemu has escaped from kidnappers after she was abducted and taken into the forest.\nA statement issued by the Secretary, Nigeria Bar Association, Owerri Branch, Chinedu Agu, on Monday, said the incident occurred on Sunday while the 68 year-old judge was travelling to Owerri from Benin City.\nThe statement said the judge was kidnapped along Azia-Orsumoghu-Ihiala Road by kidnappers at about 11 am.\nThe statement explained further that while she was matched into a thick forest, one of the kidnappers, the Secretariat gathered, was boasting that he would have wasted their oga if he were there.\nThe statement added that as of the time of this report, His Lordship’s official cars, her driver, her personal property inside the car were yet to be found."
  },
  {
    "headline": "Ex-minister Bolaji Abdullahi declares senatorial ambition",
    "summarized_story": "By Olayinka OwolewaA former minister of Sports and Youth Development, Malam Bolaji Abdullahi, has declared his intention to contest the Kwara Central senatorial seat in 2023.\nAbdullahi made his ambition public at the secretariat of the Peoples Democratic Party (PDP) in Ilorin on Monday.\nAbdullahi said 2023 provides another opportunity for patriotic Nigerians to make themselves available for service to salvage the country.\nResponding, the PDP state chairman acknowledged Abdullahi’s contribution to the development of Kwara in particular and Nigeria as a whole.\nMuhammed said the party’s leadership is delighted about the intention of Abdullahi to vie for the senatorial seat, describing him as a man of impeccable character and proven track records of achievements."
  },
  {
    "headline": "Lady attacked by policeman with burning stove vows not to stop case",
    "summarized_story": "They don’t know that the intention throwing burning Kerosene stove at me was not only permanently disfigure me, but to kill me.\nMiss Amos noted that it is a clear case of attempted murder.\nIt would be recalled that CP Eboka Friday, ordered the arrest and detention of one Police Inspector Eze Agbelu for allegedly inflicting sever burns on one Jane Amos over failed love advances and physical fight.\nHe allegedly threw burning stove on her in their resident at Rumukwuota a month ago.\nMiss Amos alleged that as fight ensued,the officer later threw away the food she was cooking and carried the burning stove and threw on her which resulted to severe burns."
  },
  {
    "headline": "UPDATE: APC Backtracks, Slates National Convention For March 26",
    "summarized_story": "The Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee Monday evening announced that it would conduct the national Convention on March 26, 2022.\nThe party said it intends to conduct its zonal congress on March 26, 2022.\nIt also informed the commission that the earlier Convention slated for February 26, 2022, will no longer hold.\nIn between the Convention, we have agreed to have zonal congresses.”Meanwhile, the APC has updated its schedule of activities ahead of the new date of March 26 for the National Convention.\nAccording to the new timetable, the Publication of National Convention Sub-Committees now holds on February 28, 2022."
  },
  {
    "headline": "NPA: Mohammed Bello-Koko’s Appointment Questions Buhari’s Anti-corruption Stance",
    "summarized_story": "The second charge leveled against Mr Bello-Koko is that after being hired as the executive director of Finance and Administration, he purchased a fifth London home.\nThe fourth charge leveled against Mr Bello-Koko is that he was involved in offshore deals prior to joining the government.\nMr Bello-Koko, was an unknown maritime person before his appointment as ED F&A.\nMaking Mr Bello-Koko MD/CEO of NPA in such controversial circumstances amounts to an indictment on President Buhari’s anti-corruption crusade.\nMr Bello-Koko clearly lacks the requisite credibility and integrity for that exalted and sensitive office to the Nigerian economy."
  },
  {
    "headline": "Unknown Gunmen Ambush Convoy Of Enugu Commissioner, Kill Two Policemen",
    "summarized_story": "Unknown gunmen have opened fire on the convoy of Enugu State Commissioner for Lands, Hon.\nThe officers killed were identified as Inspector David Adabu and Inspector Solomon.\nThe ambush it was learnt, happened in a community in Anambra State with the gunmen engaging the escort of the commissioner in a gun battle.\nAroh however escaped with his driver while the two policemen were killed.\nWhen contacted, the commissioner promised to get back to SaharaReporters as he was in a meeting."
  },
  {
    "headline": "Kwara 2023: Ex-Deputy Speaker, Minister’s Aide, Others Dump APC for PDP",
    "summarized_story": "Ahead of the 2023 general elections, former Deputy Speaker of Kwara State House of Assembly and a serving member of the federal board, Rt.\nAbubakar Shuka Baba, and other leaders of the All Progressives Congress (APC) in Kaima Local Government Area of the state yesterday dumped the party for Peoples Democratic Party (PDP).\nOther APC leaders who dumped the party for PDP included the aide to Senator Gbemisola Saraki, Alhaji Aliyu Ibrahim Wure; former Chairman of the LGA, Alhaji Haliru Madugu; the former Vice Chairman of the LGA, Alhaji Usman Yusuf, and Alhaji Dantalo Yaro.\nAlso, many members of the APC in Womi/Ayaki ward in Moro LGA of the state have dumped the party for the PDP.\nThe defection of the APC chieftains to PDP might not be unconnected with the recent zoning of the PDP ticket to the Kwara North senatorial district in next elections."
  },
  {
    "headline": "[Breaking] ‘Drug trafficking’: Abba Kyari fights back, drags FG to court",
    "summarized_story": "DCP Abba Kyari, the suspended Police officer on Monday sued the federal government to the court over his alleged involvement in drug trafficking.\nKyari is currently in the custody of the National Drug Law Enforcement Agency (NDLEA).\nPending the hearing and determination of his fundamental right enforcement application, the detained Police officer in his suit marked FHC/ABJ/CS/182/22, is praying the court to compel NDLEA to grant him bail on health grounds.\nDetails loading…"
  },
  {
    "headline": "Breaking: Court throws out suit challenging Atiku’s citizenship",
    "summarized_story": "A Federal High Court in Abuja Monday struck out a suit challenging the Nigerian citizenship of former Vice President, Alhaji Atiku Abubakar.\nJustice Inyang Eden Ekwo struck out the suit instituted by the Incorporated Trustees of Egalitarian Mission for Africa challenging the Nigerian citizenship of former number two man in Nigeria.\nThe court held that the Non Governmental Organisation (NGO) had no legal right in the first instance to query the citizenship of the former Vice President.\nThe suit which was filed on 11th February, 2019, has Atiku, PDP, the Independent National Electoral Commission, the Attorney-General of the Federation and Minister of Justice as well as the Attorney General of Adamawa state as defendants.\nSpecifically, the plaintiff had approached the court for an interpretation of Sections 25(1) & (2) and 131(a) of the 1999 Constitution."
  },
  {
    "headline": "Bad fuel: Tension as probe panel uncovers 3rd party involvement",
    "summarized_story": "There is palpable fear and tension in the oil and gas sector as security agencies commenced investigation into the importation of adulterated Premium Motor Spirit (PMS), also known as petrol into the country.\nThis is not unconnected with the findings of the investigation by security agencies, a source conversant with the probe told Blueprint in Abuja weekend.\nAccording to a source in one of the security agencies who asked not to be named as he was not permitted to speak, “findings of the probe indicate that heads would roll.\nHe said it should be investigated and that has put all security agencies on their toes.\nAccording to the official, who asked not to be named, the probe was getting complicated and technical, especially with the establishment of third party involvement in the supply of the bad products."
  },
  {
    "headline": "APC Postpones National Convention To March 26",
    "summarized_story": "﻿The All Progressives Congress has fixed its National Convention for March 26.\nThe party’s National Convention had been a subject of debate for weeks as usual pre-convention activities failed to hold.\nMonths after it assumed the leadership of the party, the tenure of the Caretaker and Extraordinary Convention Planning Committee (CECPC) was extended to better plan a national convention.\nLast year, APC Governors proposed that the national convention be conducted in February to elect a new set of NWC members.\nAmid reports over the uncertainty of conducting the national convention on Saturday, the party affirmed that it had postponed the exercise by one month."
  },
  {
    "headline": "Four NSCDC Officials Killed, One Person Injured As Bomb Explodes In Niger State",
    "summarized_story": "Four members of the Nigeria Security and Civil Defence Corps (NSCDC) have been reportedly killed after a bomb suspected to be planted by Boko Haram fighters exploded at Galadima Kogo in Shiroro local government council of Niger State.\nAuthorities say one person was also left severely injured following the blast.\nThe incident which occurred early on Monday, forced many villagers to flee the area, for fear that another attack might be imminent.\nWhen contacted with regards to the development, the Niger State Commissioner of Local Government Chieftaincy Affairs and Internal Security, Mr Emmanuel Umar, said the assault was a reprisal.\nMr Umar narrated that about two days ago there was an intelligence operation within the area where the gunmen have a stronghold."
  },
  {
    "headline": "Zamfara Deputy Governor Absent As Impeachment Proceedings Begin",
    "summarized_story": "﻿The Deputy Governor of Zamfara State Mahadi Aliyu was absent – alongside his lawyer – to stand in for him at the impeachment proceedings as a seven-man panel set up by the Zamfara State Chief Judge Kulu Aliyu to investigate the allegations leveled against him.\nThe deputy governor, who doubles as the respondent, is absent at the first sitting, and no counsel or person representing the deputy governor.\nOne of the documents was the notice of meetings served to the deputy governor.\nAnother witness Shehu Mainasara, who is a retired Permanent Secretary at the office of the deputy governor, testified that the deputy governor has not been coming to office within the stipulated period.\nHe said the deputy governor had been given “oral” directives through a telephone call."
  },
  {
    "headline": "Court Refuses Kyari’s Application Seeking Bail On Health Grounds",
    "summarized_story": "﻿Justice Inyang Eden Ekwo of the Federal High Court in Abuja has refused to order the Federal Government to release the detained Deputy Commissioner of Police (DCP), Abba Kyari, from the custody of the National Drug Law Enforcement Agency (NDLEA).\nThe judge rather ordered that Kyari put the Federal Government on notice of the existence of the suit he instituted against it.\nThe suspended DCP had taken the Federal Government before the court, challenging his continued detention by the agency.\nIn an ex-parte application by his counsel, Cynthia Ikena, Kyari claimed to be suffering from diabetes and hypertension and needs urgent medical attention.\nThe judge ordered him to go and serve all processes he filed on the Federal Government."
  },
  {
    "headline": "US Announces First Sanctions After Russia Recognizes Ukraine Separatists",
    "summarized_story": "The United States announced financial sanctions Monday against rebel territories in eastern Ukraine freshly recognized by Russia and warned that more were ready if necessary.\nHowever, the sanctions herald a new phase in what could soon become the most dangerous East-West confrontation since the collapse of the Soviet Union.\nUS Secretary of State Antony Blinken slammed Russia’s recognition of the separatist regions as a sign President Vladimir Putin had no interest in diplomacy.\nShortly after recognizing their independence, Putin ordered troops into the two breakwaway regions as part of a “peacekeeping” operation.\nHe also detailed the plan for sanctions on Russia."
  },
  {
    "headline": "APC Governors meeting in Abuja at Kebbi Governors Lodge",
    "summarized_story": "The APC governors forum meeting is currently ongoing at the Kebbi State government lodge in Abuja.\nThis meeting is considered to be a reaction to the latest decision of the governing party to hold zonal congresses on the 26th of this month and postpone the earlier scheduled national convention to the 26th of next month.\nAdvertisementResolutions reached at this crucial meeting will help the party walk a tight rope as intense politicking have raised the stakes and the latest decision of the party to hold zonal congresses have changed political calculations and caused a setback to certain interests within the APC.\nAdvertisementThe governors forum which is a major power bloc within the party will deliberate on maters arising and attempt to point the party in a direction they consider to be in the interest of all."
  },
  {
    "headline": "BREAKING: APC shifts National Convention to March 26",
    "summarized_story": "The Caretaker Extraordinary Convention Planning Committee (CECPC) has just announced that it will conduct the national convention on the 26th of March.\nThis is contrary to a letter sent to the Independent National Electoral Commission (INEC) on the conduct of zonal congresses for same date.\nAdvertisementThe Mai Mala Buni Committee has been in a closed-door meeting since 11am today.\nSecretary of the caretaker committee, John AkpanUdoedehe addressing newsmen after the meeting says preparations for the Convention will commence on the 24th of March.\nMonday 28th February, 2022Publication of National Convention Sub-Committees2."
  },
  {
    "headline": "Former Sports minister, Bolaji Abdullahi joins Kwara Senatorial race -",
    "summarized_story": "A former minister of Sports and Youth Development, Mallam Bolaji Abdullahi has declared his intention to vie for the senate seat.\nHe is planning to contest for Kwara central senatorial seat on the platform of the Peoples Democratic Party.\nAdvertisementThe former minister said there is the need to move away from politics of big men to politics of big ideas.\nHe promised to bring to the national assembly a wide range of experience as a journalist, a civil society activist and a development expert.\nAdvertisementBolaji Abdullahi is planning to replace Senator Ibrahim Oloriegbe who was elected in 2019 on the platform of the All Progressives Congress."
  },
  {
    "headline": "2023 elections will be credible despite fear of likely violence",
    "summarized_story": "Former President Goodluck Jonathan says the 2023 general election will be credible and violence-free despite fears of likely unrest in some places.\nDr Jonathan made this known at an even in Lagos on Monday.\nAdvertisementAccording to him, it is normal that periods leading to election year are always characterised by tension, but he remains optimistic that the period will come and go and the elections will be peaceful."
  },
  {
    "headline": "Nigeria: Court Rejects Detained ‘Super Cop’ Abba Kyari’s Suit Demanding Freedom",
    "summarized_story": "Justice Inyang Eden Ekwo of the Federal High Court in Abuja on Monday refused to order Nigeria’s Federal Government to release the detained Deputy Commissioner of Police, Abba Kyari from custody.\nThe suspended DCP had dragged the Federal Government before the court challenging his continued detention by an agency of government.\nThe anti-narcotics agency had on February 14, 2022, indicted Kyari, ex-head of the police Intelligence Response Team, in alleged drug trafficking and related offences.\nThe NDLEA said Kyari, the suspended IRT head, belonged to a drug cartel that operates the Brazil-Ethiopia-Nigeria illicit drug pipeline.\nThe IGP in a statement had corroborated the NDLEA’s findings, saying incontrovertible evidence indicted Kyari in the drug crimes."
  },
  {
    "headline": "Detained ‘Super Cop’ Abba Kyari Sues Nigerian Government, Demands Release",
    "summarized_story": "Suspended Deputy Commissioner of Police, Abba Kyari, has dragged the Nigerian Government to court to seek release from the custody of the National Drug Law Enforcement Agency.\nThe anti-narcotics agency had on February 14, 2022, indicted Kyari, ex-head of the police Intelligence Response Team, in alleged drug trafficking and related offences.\nThe NDLEA said Kyari, the suspended IRT head, belonged to a drug cartel that operates the Brazil-Ethiopia-Nigeria illicit drug pipeline.\nThe IGP in a statement had corroborated the NDLEA’s findings, saying incontrovertible evidence indicted Kyari in the drug crimes.\nThe United States Attorney’s Office at the Central District of California declared Kyari wanted for the alleged offence."
  },
  {
    "headline": "Tinubu Says He Is Ready To Get Dirty To Become Nigeria’s President – Trending With Ojy Okpe",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu, presidential aspirant on the platform of the All Progressives Congress has been trending on Twitter for saying he’s ready to get dirty in order to become President of Nigeria.\nCampaign posters, and souvenirs of the Apc chieftain have been circulating on social media since he declared his intention to run for the 2023 presidential election.\nThe latest is a video of paper cups allegedly manufactured at a factory overseas.\nReactions are trailing Former President Olusegun Obasanjo’s comment which he made over the weekend suggesting that Nigeria needs more rebels who can speak uncomfortable truths.\nPolice Constable, Mary Yetunde Aina over the weekend clinched the World Boxing Foundation International Super Bantamweight title."
  },
  {
    "headline": "Nigeria Air Strike Targeting Terrorists Kills Children in Niger Republic, Official Says",
    "summarized_story": "The Nigerian military has killed and wounded children in an air attack in neighbouring Niger, according to a local governor in Niger, state television and an aid agency.\nThe attack took place in the village of Nachade in the region of Maradi, Niger, on Friday, a few kilometres from the border with Nigeria, said Chaibou Aboubacar, the governor of Maradi.\n“There was a mistake with the Nigerian strikes on the border that resulted in victims on our territory in the village of Nachade,” said the official.\n“The victims are 12 children, seven of them dead and five wounded.”According to the governor, “the parents were attending a ceremony and the children were probably playing when the strikes” hit them.\nFour children died instantly and three others succumbed “to their injuries while being transported to hospital”, he said."
  },
  {
    "headline": "Nigeria: Tinubu Ready to ‘Get Dirty’, Says No Amount of Intimidation Can Stop 2023 Presidential Bid",
    "summarized_story": "Tinubu at the palace of Alaafin said, “I cannot embark on a project of such magnitude without seeking prayers and cooperation of the traditional rulers.\n“I am here today to inform our fathers of my decision to run for the position of the president of this country in 2023.\nWhat I need from our highly referred traditional rulers is their prayers and cooperation.\nAt the residence of Olubadan designate, the monarch said, “We have known you and we know your antecedents.\nWe need a leader that will have a national focus and national acceptability."
  }
]