[
  {
    "headline": "More defections loom in APC as PDP woos Yari, Marafa",
    "summarized_story": "In Zamfara State, a former Governor, Abdul’Aziz Yari; an ex-lawmaker, Senator Kabiru Mafara; and other top APC members have almost finalised plans to join the PDP.\nBriefing journalists in Gusau on Sunday, the PDP chairman, Colonel Bala Mande (retd.\n), said the party had received Yari, Marafa and other top APC members who have joined the party together with their supporters.\nMande said, “Gentlemen of the press, we have called you to brief you on the joining of our great party the PDP by former Governor Yari, Senator Kabiru Mafara and their supporters.\nWhen asked if there is likelihood of him and Yari joining the PDP, Marafa said, “There is a probability of going."
  },
  {
    "headline": "Aribo, Bassey shine as Rangers reach Scottish Cup final",
    "summarized_story": "Nigerian duo Joe Aribo and Calvin Bassey were impressive for Glasgow Rangers as they came from behind to beat Old Firm rivals Celtic 2-1 in the Scottish Cup semi-final after extra-time in Hampden Park on Sunday, The PUNCH reports.\nCeltic went into the game hoping to keep their hopes of a fifth domestic treble in six seasons alive, after winning the Scottish League Cup in December and establishing a six-point lead at the top of the Scottish Premiership.\nIn the absence of the injured Ramsey, Aribo took charge of play in the midfield and was at the heart of every move made by Rangers.\nDespite their dominance, Celtic took the lead in the 63 minutes after Greg Taylor fired a low finish beyond Jon McLaughlin.\nWith a penalty shoot-out on the horizon, Rangers found time for a winner as Bassey’s left-wing cutback was diverted into his own net by Starfelt, ending Celtic’s treble hopes and booking Rangers’ cup final spot where Hearts lie in wait after overcoming Hibernian on Saturday."
  },
  {
    "headline": "NPFL: Pillars condemn fans attack on Katsina United",
    "summarized_story": "Kano Pillars have condemned the action of violent fans in their NPFL match-day 23 clash against Katsina United at the Sani Abacha Stadium, Kano on Saturday.\nFans suspected to be supporters of Pillars invaded the pitch in the 82nd minute of the match, as the visiting Katsina United held the hosts 0-0, damaging their team bus and carting away valuables on Saturday.\n“The management of Kano Pillars suspects that the undesirable fans’ attitude is a gang up of some saboteurs who do not want the progress of the club,’’ the statement read.\nIt added that the club management, Kano FA and the executives of Pillars fans club would not fold their arms and allow anybody found wanting to go unpunished.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Patrick ‘Dr P’ Omoyeni, FIXIT Founder celebrates birthday, returns glory to God",
    "summarized_story": "Lagos (GPP), Patrick “Dr.\nAccording to verified sources, the multiple award-winning Dr Patrick Omoyeni grew up in a very poor background, where sometimes he and his siblings would go to school without breakfast.\nWhen asked to comment on his graced milestone, Dr. Patrick Omoyeni emphatically returned all glory to God saying,“I must say the grace of God brought me this far, everything around my life points to God as the one behind them.\nDr. Patrick “Dr.\nFrom Godspowerproject/ Fixit/ Palmadex/ Eiawithbenard."
  },
  {
    "headline": "Easter Retreat: lmmorality angers God – Muoka",
    "summarized_story": "Mouka spoke on Sunday at the Church’s 2022 Easter Retreat with the theme: “Convenant of Peace and Blessing”.\nAccording to him, immorality in the world may compel God to destroy humanity if people do not repent from evil.\n“This generation has angered God too much to the extent that through their conduct, people are calling God to destory the world and humanity.\n“Every bad thing that Satan meted to humanity, God allows it for a purpose,” he said.\nThe gospel preacher tasked world leaders, especially Nigerian leaders, to turn to God in repentance."
  },
  {
    "headline": "50,000 people now use ‘Xend Finance’, Nigerian Crypto bank",
    "summarized_story": "By Emmanuel ElebekeNigerian Crypto bank, Xend Finance has announced that over 50-thousand people now use their savings platform in the country.\nXend Finance is a Nigerian Crypto bank designed for those in underserved areas.\nThe bank had earlier announced 10-thousand users at the end of January, following the release of their free mobile app on Android and Apple devices in December.\nUsers can convert their local fiat currency to stablecoins and U.S.\nDollars to access the highest APYs across Binance Smart Chain (BSC) and Polygon by staking, or locking up their cryptocurrency for a period of time."
  },
  {
    "headline": "Withdraw pardon for Dariye, Nyame, uphold oath of office, SERAP tells Buhari",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to use his “good offices to urgently review and withdraw the pardon granted to former governors of Plateau State, Senator Joshua Dariye, and Taraba State, Rev Jolly Nyame who are serving jail terms for corruption.”SERAP is also urging him to “propose constitutional amendment to the National Assembly to reform the provisions on the exercise of the prerogative of mercy to make the provisions more transparent, and consistent and compatible with Nigeria’s international anti-corruption obligations.”Mr Dariye and Mr Nyame were jailed for stealing N1.16bn and N1.6bn, respectively.\nHowever, the National Council of State last week endorsed the pardon of Mr Dariye, Mr Nyame and 157 others serving jail terms following the recommendations of the Presidential Advisory Committee on the Prerogative of Mercy.\nIn the letter dated 16 April, 2022 and signed by SERAP deputy director Kolawole Oluwadare, the organisation said: “Impunity for corruption will continue as long as influential politicians escape justice for their crimes.\nThe exercise of the presidential pardon in their cases would seem to be unfair and undeserving.”“The investigation and prosecution of the corruption cases involving the pardoned former governors Dariye and Nyame reportedly cost over N300 millions of taxpayers’ money.\nNigerians will not regret that they have entrusted national responsibility to us.’”“However, the latest Transparency International’s Corruption Perception Index shows that Nigeria scored 24 out of 100 points, and ranked 154 out of 180 countries surveyed, falling back five places from the rank of 149 in 2020."
  },
  {
    "headline": "Nigerians‘ll be Bello’s godfather when elected President – Hafsat Abiola",
    "summarized_story": "By Dirisu YakubuDirector-General, Yahaya Bello Presidential Campaign Organisation, Hafsat Abiola-Costello, has said Nigerians of all walks of life would play the godfather role to Governor Yahaya Bello of Kogi state when he is elected President of Nigeria in the 2023 election.\nThe people that will be the godfathers of Governor Yahaya Bello when he becomes President are the people of Nigeria,” she said.\nShe, however, said though Bello had resisted the influence of godfathers for long, he would accommodate old when he becomes the President of Nigeria.\n“Young Nigerians are ready to take more responsibilities in the governing of our affairs and this is the young people’s candidate.\nIt belongs to the tested politicians and most especially, the young people of Nigeria,” the Campaign DG added."
  },
  {
    "headline": "Imo: Security agents, unknown gunmen engage in gun battle",
    "summarized_story": "There was pandemonium in some parts of Orlu and Orsu local government areas of Imo State as gunmen and security agents engaged in a gun battle.\nThe security operatives were said to have stormed the affected areas based on the report that the unknown gunmen were regrouping to launch attacks.\nA guest house, Inland Guest House or Ukwu Aki Guest House, was razed down on Sunday morning, as a result of the incident.\nAreas affected by the incident include Amanachi, Awo-Idemili in Orsu Local Government Area of the state.\nThe Imo State Police Command, Public Relations Officer, PPRO, Mike Abattam, is yet to react to the incident."
  },
  {
    "headline": "Osinachi went through hell, her pastor husband possessed her – Mother",
    "summarized_story": "Mrs Oriaku Nmadu, the mother of the late gospel singer, Osinachi Nwachukwu, has opened up about the death of her daughter.\nNmadu lamented that her daughter went through hell while married to Pastor Peter Nwachukwu.\nShe said Mr Nwachukwu who presented himself as a pastor, maltreated Osinachi when she was alive.\nBut shortly after the marriage, Nwachukwu shut the doors to our entire family and completely possessed my daughter.\n“My daughter went through hell in the hands of Nwachukwu."
  },
  {
    "headline": "Nigeria under Buhari a big emergency national hospital – Bishop Kukah",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Mathew Kukah, on Sunday said President Muhammadu Buhari has destroyed every aspect of life in the country but has allowed corruption to thrive and grow.\nBishop Kukah said this in an Easter message to his congregation in Sokoto state, adding that Nigeria has become one big emergency national hospital with full occupancy and the government seems to be on hibernate mode.\n“Our children’s lives and future are broken politics, economy, energy system is also broken.\n“One would be tempted to ask, what is there to say about our tragic situation today that has not been said?\nEither way, from this crossroad, we must make a choice, to go forward, turn left or right or return home."
  },
  {
    "headline": "Easter: Acts of terrorism by unknown gunmen in Anambra, exercise in futility – Soludo",
    "summarized_story": "Anambra State Governor, Prof. Chukwuma Soludo, on Sunday, used his message for the Easter to warn unknown gunmen terrorising the state, saying no inch of Anambra space will be won by them, irrespective of their atrocities.\nHe said they must therefore use Easter as an opportunity to embrace peace in their own interest.\nSoludo gave a subtle warning in his Easter message to the people of the state, which was made available to the media by his aide, Joe Anatune.\nThe irrepressible spirit of the good people of Anambra State shall always triumph,” he said.\nSoludo also said coincidentally that Easter Sunday marks exactly a month he assumed office as Governor of Anambra State."
  },
  {
    "headline": "Easter: Osinbajo reveals his prayer for Nigeria",
    "summarized_story": "Vice President Yemi Osinbajo has revealed his prayer for Nigeria as the country celebrates Easter.\nOsinbajo assured Nigerians of the restoration of peace and a more prosperous future for all regardless of current challenges.\nHe spoke with State House correspondents immediately after the Easter Sunday service at the State House Chapel, Aso Villa, Abuja.\nThe Vice President said Easter is a key celebration for Christians because of its significance.\n“Where there is despair, I pray that hope would be restored, where there is fear, I pray that there is courage and confidence."
  },
  {
    "headline": "Kidnapped FCT monarch, two others regain freedom",
    "summarized_story": "The traditional ruler of Bukpe community in Kwali Area Council, Abuja, Hassan Shamidozhi, has regained freedom 18 days after some bandits abducted him.\nThey invaded his palace in Bukpe community and took him away with two others in the community.\nThe Nation learnt the other two residents, Ahmad Joel and his daughter, Precious Joel,also regained freedom on Saturday.\nHe said before his release, his family members, relatives and friends contributed to raise N4 million after intense negotiations.\nAll efforts to get the reaction of the Federal Capital Territory (FCT) Police Public Relations Officer, DSP Josephine Adeh were futile."
  },
  {
    "headline": "Tinubu is God’s choice for 2023 presidency – Bishop Kayode Williams",
    "summarized_story": "Excerpts:Can you shed more light on the message from God about Asiwaju Bola Tinubu winning the 2023 presidential elections?\nLater God told me that Buhari would defeat the incumbent president, the person there.\nThat was what God told me.\nAs I told you earlier, God told us in 2016 that He was going to raise Bola Ahmed Tinubu for Nigeria; you will all see.\nSo when this message came, God told me to take it to Odumbaku."
  },
  {
    "headline": "Tinubu to youths: With you on my side, we’ll make Nigeria excel",
    "summarized_story": "Tinubu to youths: With you on my side, we’ll make Nigeria excelAll Progressives Congress (APC) National Leader, Asiwaju Bola Tinubu, yesterday sought the support of Nigerian youths in his bid for the presidency, saying together, they could change the story of the country for the better.\n“If YouTube alone has 2.9 billion people following it, including you all standing here, then Nigeria can excel.\nNigeria, Tinubu said, has all it requires to conveniently feed its citizens “by being creative, visionary and committed.”Continuing, he said: “Anybody who says we cannot, they can get out, because it is voluntary.\nTinubu, addressing the crowd of youths he described as the brightest, urged them to team up with him in his bid to change the story of Nigeria for the youths and tomorrow which they represent.\n“I have no doubt that Bola Tinubu is capable of this, which is why I support his campaign to lead Nigeria."
  },
  {
    "headline": "I’m sad my sisters are still in captivity, says rescued Chibok girl Grace Dauda",
    "summarized_story": "One of the liberated girls, Grace Dauda, was there to share her experience.\nLooking pretty and well-kept, Dauda recalled her experience in the three years she spent in captivity saying: “Imagine yourself living in the forest, no freedom and fighter jets hovering around.\nI no longer hear anything about my sisters in captivity.\nShe said all Nigerians are now a metaphor for Chibok girls, stressing that the series of abductions and attacks, including the recent Kaduna-Abuja train bombing and abduction more than underline this.\nShe, however, that they are still being processed, which is why they have not released their names."
  },
  {
    "headline": "FULL TEXT: Kukah’s Easter message to Buhari",
    "summarized_story": "Easter is a metaphor for how shame, scandal, powerlessness, weakness, and opprobrium suddenly transform into glory, honour, pre-eminence, laudation and applause.\n15: The challenge of fixing this broken nation is enormous and, as I have said, requires joint efforts.\nWe need someone who can fix our broken nation, rid our people of the looming dangers of hunger and destitution.\nNo country anywhere in the world is undergoing these self-inflicted wounds, citizens randomly murdering innocent citizens and getting away with it.\nWe know He can heal out broken nation."
  },
  {
    "headline": "2023: Bello’ll clinch APC ticket in free, fair contest –Abiola-Costello",
    "summarized_story": "From Ndubuisi Orji, AbujaDirector General of the Yahaya Bello Presidential Campaign Organisation, Hafsat Abiola-Costello, has said Governor Yahaya Bello of Kogi State will clinch the All Progressives Congress (APC) 2023 presidential ticket in a free and fair contest.\nShe stated this, yesterday, in response to questions on the ability of the governor to match older politicians seeking the APC presidential ticket.\nBut he will win in a free and fair contest.\n“There have been a ground swell in our country by young people to play a bigger role in our political affairs.\nShe said: “At this time, the APC has said all candidates are free to contest."
  },
  {
    "headline": "NDLEA intercepts Cocaine consignments at Port Harcourt, Abuja, Lagos airports, arrests 7 traffickers",
    "summarized_story": "From Godwin Tsa, AbujaOperatives of the National Drug Law Enforcement Agency(NDLEA) have foiled attempts by Brazil based drug cartels to smuggle large consignments of Cocaine into Nigeria through three major international airports in Port Harcourt, Abuja and Lagos.\nWhile seven traffickers were arrsseted during the operation, five other suspects were arrested by the agency in Port Harcourt International Airport by the agency.\nThe three suspects departed Sao Paulo, Brazil on board same Qatar flight, en-route Doha to Abuja and Port Harcourt with a total of 24.96 kilograms of cocaine.\nHe was arrested with 5.48kg of cocaine concealed in lotion plastic bottles sealed with candle wax.\nThe father of one who claims he’s a motor spare parts dealer is from Ezeagu in Ezeagu LGA, Enugu state."
  },
  {
    "headline": "Navy clamps down on oil thieves in Bayelsa, Delta, Akwa-Ibom, Rivers states",
    "summarized_story": "From Femi Folaranmi, YenagoaThe Nigerian Navy is clamping down on crude oil thieves in the Niger Delta as part of a massive operation to mitigate the effect of crude oil theft on the economy.\nThe Navy’s operation tagged Operation DAKATAR DA BARAWO(OPDDB) has recorded large success in Bayelsa, Delta, Akwa- Ibom and Rivers States.\nDuring the raid it uncovered a dugout pit containing about 1,258bbls of stolen crude oil and immediately deactivated it.\nSimilarly Nigerian Navy Ship (NNS), Soroh in Yenagoa, Yenagoa Local Government Area following a tip off uncovered two stores and assembly points used by illegal oil bunkerers at Onimbu and Ayama communities.\nAlso another naval ship MV Aba intercepted a Motor Vessel (MV) Royal Diadem loaded with suspected illegal refined AGO."
  },
  {
    "headline": "Under Buhari, Corruption is enthroned-Bishop Kukah",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Most Rev Matthew Kukah, has criticised the President Muhammadu Buhari , over his regime’s inability to tackle insecurity and corruption in Nigeria.\nBishop Kukah in his Easter message titled, ‘To mend a broken nation: The Easter metaphor’ said every aspect of life in Nigeria has been destroyed while corruption is enthroned.\nHe words: “Our dear country, Nigeria, still totters and wobbles as we screech towards a dangerous and avoidable canyon of dry bones.\nLike the friends of Job, we stare at an imponderable tragedy as the nation unravels from all sides.\n“The challenge of fixing this broken nation is enormous and, as I have said, requires joint efforts."
  },
  {
    "headline": "Nigerians will soon rise against corrupt leaders, Archbishop Kaigama predicts",
    "summarized_story": "Ignatius Kaigama, has predicted that Nigerians of different faith and ethnic differences, will soon unleash their anger on corrupt leaders whose actions had led to the precarious state of affairs in Nigeria.\nHe informed the political leaders that Nigerians are tired of poor governance, excuses, insecurity, and several other socioeconomic challenges that have reduced the standard of living in Nigeria, and many of have complained and lamented about it through different platforms.\n“It is encouraging that people are taking on leaders irrespective of whether they are of similar religious or ethnic affiliation and challenging their lacklustre performance.\nUndoubtedly, there is anger across religious and ethnic lines against leaders who milk the country dry and rob the citizens of a decent life.\nNigerians want selfless and empathetic leaders, not those paranoid, defensive and antagonistic towards critics."
  },
  {
    "headline": "Tinubu: A Banditry-free, United Nigeria is Possible",
    "summarized_story": "This is as the Plateau State Governor, Hon.\nTinubu urged them to team up with him in his bid to change the story of Nigeria for the youths of today and tomorrow, which they represent.\n“Nigeria, it is about time we have enough gas to fire up electricity and supply the rest of Europe and make money, long term from it.\nThe South-west youth leaders at the event took their turns to speak on why they are promoting Tinubu to become the next president of Nigeria, come 2023.\nHe said he was not only worried about Plateau State, adding that as Chairman of NGF, but he was also worried about a region devastated by the terrorists."
  },
  {
    "headline": "PDP NEC Takes Final Decision on Zoning of Presidential Ticket Thursday",
    "summarized_story": "THISDAY gathered that the National Working Committee (NWC) would also meet on Tuesday.\nAyu promised that the committee’s recommendations would be transmitted to the NEC, which would take a final decision.\nHowever, the governors of the party from the South rose from their meeting last week, insisting that the presidential ticket of the party must be zoned to the South.\n“After our NWC meeting immediately after the Easter break, we meet to fix the date for the NEC meeting for the primary duty of receiving the report of the zoning committee and take a final decision on the zoning of the presidential ticket”.\nThe statement added that all duly completed forms for state Houses of Assembly are to be submitted to the various state secretariat of the party."
  },
  {
    "headline": "Nigeria to Benefit as IMF Approves $45bn for Low, Middle-income Countries",
    "summarized_story": "*World Bank increases mineral survey aircraft in South-west•Survey to be extended to 121 LGAs in 19 statesFestus AkanbiThe International Monetary Fund (IMF) has approved a $45billion trust fund to help low and vulnerable middle-income countries, including Nigeria to build resilience and sustainability.\nNigeria is among lower-middle-income countries with a gross national income (GNI) per capita of $2,157 in 2019, according to the World Bank collection of development indicators.\nThe fund is part of IMF’s $650 billion special drawing rights (SDRs) issued in August 2021 to vulnerable countries to boost liquidity through Resilience and Sustainability Trust (RST).\n“The Trust aims to help low-income and vulnerable middle-income countries address longer-term structural challenges that pose macroeconomic risks, including climate change and pandemics.\nMinDiver is a World Bank project under the Ministry of Mines and Steel Development to enhance the mining sector’s contribution to the economy by strengthening key government institutions."
  },
  {
    "headline": "At Easter, Govs, PDP Urge Nigerians to Pray against Insecurity",
    "summarized_story": "Obaseki, in his Easter message, urged Christians to reflect on the purpose of the Easter celebration with a renewed hope for a better Nigeria, and be a part of the process of rebuilding the country.\nOyo State Governor, Mr Seyi Makinde, urged Christians to imbibe the lessons of love, sacrificial living and peaceful co-existence.\nOkowa made the call in his Easter message contained in a statement by his Chief Press Secretary, Mr Olisa Ifeajika.\nIn his Easter message, Ugwuanyi applauded Christians for the successful conclusion of the forty-day long Lenten season.\nOn its part, PDP has urged Nigerians to use the occasion of Easter to rekindle their hope for a brighter future and a national rebirth under a coming democratic and people-oriented government."
  },
  {
    "headline": "Pardon All Thieves in Prison, SANs Tell Buhari, Knock President over Dariye, Nyame",
    "summarized_story": "He said: “By granting pardon to these treasury looters, Buhari is reviving, nurturing and watering corruption with state powers”.\nHe stressed that it was wrong to grant state pardon to the two of them who were convicted for stealing state funds.\nThe so-called 1999 constitution is really decree 24 of 1999.\nHe wondered why president Buhari granted the pardon despite his lamentations that corruption is affecting Nigeria’s growth.\nI am so upset by the decision because the ex-governor of Plateau State has his appeal dismissed in March 2021 by the Supreme Court."
  },
  {
    "headline": "Bank Documents Expose How Akwa Ibom Governor, Emmanuel Wired N110 Million From State Account To PDP Chieftain Before 2019 Election",
    "summarized_story": "Bank documents have shown how Governor Udom Emmanuel of Akwa Ibom State authorised the transfer of N110 million from the state treasury to the personal account of one Obong Akpabong Moffat UdoEkpo, a chieftain of the Peoples Democratic Party (PDP) in the Oruk Anam Local Government Area of the state.\nThe bank documents showing the transactions from Zenith Bank, which were obtained by SaharaReporters revealed that the money was paid in tranches between 05/02/2019 and 22/03/2019 to the personal account of UdoEkpo.\nAkwa Ibom Governor Udom EmmanuelAbout N80 million of the fund was transferred to the PDP chieftain a few days before the March 9, 2019 governorship election in the state, following which Emmanuel secured a second term in office.\nUdoEkpo was a grassroots mobiliser and a strong supporter of the governor’s second term bid.\nUdoEkpo is also contesting to represent the Oruk Anam constituency in the Akwa Ibom State House of Assembly."
  },
  {
    "headline": "Bank Documents Expose How Akwa Ibom Governor, Emmanuel Wired N110 Million From State Account To PDP Chieftain Before 2019 Election",
    "summarized_story": "Bank documents have shown how Governor Udom Emmanuel of Akwa Ibom State authorised the transfer of N110 million from the state treasury to the personal account of one Obong Akpabong Moffat UdoEkpo, a chieftain of the Peoples Democratic Party (PDP) in the Oruk Anam Local Government Area of the state.\nThe bank documents showing the transactions from Zenith Bank, which were obtained by SaharaReporters revealed that the money was paid in tranches between 05/02/2019 and 22/03/2019 to the personal account of UdoEkpo.\nAkwa Ibom Governor Udom EmmanuelAbout N80 million of the fund was transferred to the PDP chieftain a few days before the March 9, 2019 governorship election in the state, following which Emmanuel secured a second term in office.\nUdoEkpo was a grassroots mobiliser and a strong supporter of the governor’s second term bid.\nUdoEkpo is also contesting to represent the Oruk Anam constituency in the Akwa Ibom State House of Assembly."
  },
  {
    "headline": "EXCLUSIVE: APC Senator, Stella Oduah Secretly Obtains PDP Senatorial Nomination Form After Tricking Attorney General, Malami To Frustrate N7.9billion Fraud Trial",
    "summarized_story": "Stella Oduah, a Nigerian Senator and former Minister of Aviation has finalised her defection from the ruling All Progressives Congress (APC) to the Peoples Democratic Party (PDP), SaharaReporters has gathered.\nStella OduahA source told SaharaReporters that the Senator returned to the PDP and secretly obtained the party’s nomination form to return to the Senate.\n“Senator Stella Oduah has finally dumped the APC and moved to the PDP after days of playing hide and seek game.\nSaharaReporters on Tuesday, March 29, 2022 reported that the former aviation minister had concluded plans to dump the ruling APC for the PDP.\nSee Also Politics After Tricking Nigeria’s Attorney General, Malami To Frustrate N7.9bn Fraud Trial, Stella Oduah Moves To Dump APC For PDPSaharaReporters reported that the Senator had held a closed-door meeting with Anyim Pius Anyim, a PDP presidential aspirant and some party leaders."
  },
  {
    "headline": "EXCLUSIVE: APC Senator, Stella Oduah Secretly Obtains PDP Senatorial Nomination Form After Tricking Attorney General, Malami To Frustrate N7.9billion Fraud Trial",
    "summarized_story": "Stella Oduah, a Nigerian Senator and former Minister of Aviation has finalised her defection from the ruling All Progressives Congress (APC) to the Peoples Democratic Party (PDP), SaharaReporters has gathered.\nStella OduahA source told SaharaReporters that the Senator returned to the PDP and secretly obtained the party’s nomination form to return to the Senate.\n“Senator Stella Oduah has finally dumped the APC and moved to the PDP after days of playing hide and seek game.\nSaharaReporters on Tuesday, March 29, 2022 reported that the former aviation minister had concluded plans to dump the ruling APC for the PDP.\nSee Also Politics After Tricking Nigeria’s Attorney General, Malami To Frustrate N7.9bn Fraud Trial, Stella Oduah Moves To Dump APC For PDPSaharaReporters reported that the Senator had held a closed-door meeting with Anyim Pius Anyim, a PDP presidential aspirant and some party leaders."
  },
  {
    "headline": "Nigerian Man Arrested In India With Cocaine, Mephedrone Worth N16.4 Million",
    "summarized_story": "The police in Mumbai, India have arrested a Nigerian man identified as Oliver Diba Nikki with hard drugs worth Rs 30.20 lakh (N16.4 million).\nNikki, according to a report by the Times of India, was arrested in Andheri West in Mumbai with 200 grammes of mephedrone and 34 grammes of cocaine.\nThe 42-year-old Nigerian, police sources said was arrested on Friday evening from a bus stop near Azad Nagar metro station by the Marol unit of the Anti-Narcotics Cell.\n\"He has told us he was released in December 2021 in an NDPS Act case and had gone back to drug peddling.\nWe seized 200 grammes of mephedrone and 34 grammes of cocaine cumulatively valued at Rs 30.20 lakh from him,\" the policeman added."
  },
  {
    "headline": "Joint task force kills '10 Boko Haram commanders' in Lake Chad region",
    "summarized_story": "The multinational joint task force (MNJTF) says its troops have killed 10 Boko Haram commanders in the Lake Chad region.\nThe MNJTF operates in the Lake Chad basin of Nigeria, Chad, Cameroon and Nigeria.\nMuhammad Dole, MNJTF spokesperson, in a statement on Sunday, said the offensives were conducted under ‘Operation Lake Sanity’, a joint operation involving the MNJTF troops from Nigeria, Niger and Cameroon and troops from operation Hadin Kai.\nDole said the MNJTF troops on clearance patrols in Kimeguna, near Lake Chad, in Niger Republic accosted insurgents’ logisticians ferrying 457 bags of fish in several carts.\nDole added that one member of the civilian joint task force, however, “paid the supreme sacrifice”."
  },
  {
    "headline": "Joint task force kills '10 Boko Haram commanders' in Lake Chad region",
    "summarized_story": "The multinational joint task force (MNJTF) says its troops have killed 10 Boko Haram commanders in the Lake Chad region.\nThe MNJTF operates in the Lake Chad basin of Nigeria, Chad, Cameroon and Nigeria.\nMuhammad Dole, MNJTF spokesperson, in a statement on Sunday, said the offensives were conducted under ‘Operation Lake Sanity’, a joint operation involving the MNJTF troops from Nigeria, Niger and Cameroon and troops from operation Hadin Kai.\nDole said the MNJTF troops on clearance patrols in Kimeguna, near Lake Chad, in Niger Republic accosted insurgents’ logisticians ferrying 457 bags of fish in several carts.\nDole added that one member of the civilian joint task force, however, “paid the supreme sacrifice”."
  },
  {
    "headline": "Archbishop of Canterbury: UK's plan to send asylum seekers to Rwanda raises ethical questions",
    "summarized_story": "Justin Welby, Archbishop of Canterbury, says the United Kingdom’s plan to send asylum seekers to Rwanda for processing raises “serious ethical questions”.\nAdvertisementIn his Easter sermon on Sunday, Welby criticised the UK government for “subcontracting” its responsibilities.\n“And this season is also why there are such serious ethical questions about sending asylum seekers overseas,” he said.\nIt cannot carry the weight of resurrection justice, of life conquering death.\nAdvertisement“It cannot carry the weight of the resurrection that was announced first to the least valued, for it privileges the rich and strong."
  },
  {
    "headline": "Archbishop of Canterbury: UK's plan to send asylum seekers to Rwanda raises ethical questions",
    "summarized_story": "Justin Welby, Archbishop of Canterbury, says the United Kingdom’s plan to send asylum seekers to Rwanda for processing raises “serious ethical questions”.\nAdvertisementIn his Easter sermon on Sunday, Welby criticised the UK government for “subcontracting” its responsibilities.\n“And this season is also why there are such serious ethical questions about sending asylum seekers overseas,” he said.\nIt cannot carry the weight of resurrection justice, of life conquering death.\nAdvertisement“It cannot carry the weight of the resurrection that was announced first to the least valued, for it privileges the rich and strong."
  },
  {
    "headline": "Yari, Marafa finally dump APC for PDP — after months of speculation",
    "summarized_story": "Abdulaziz Yari, former governor of Zamfara, and Kabiru Marafa, a former senator, have joined the Peoples Democratic Party from the All Progressives Congress (APC).\nBala Mande, Zamfara PDP chairman, announced the defection of the two former APC chieftains on Sunday after a meeting in Gusau, state capital.\nThe development put an end to the speculation surrounding the rumoured defection of Yari and Marafa from the APC to the PDP.\nOwing to Matawalle’s defection, Marafa and Yari lost their leadership grip in the Zamfara APC.\nRecently, Yari lost out of the APC national chairmanship race after key leaders of the party, including President Muhammadu Buhari, favoured the candidacy of Abdullahi Adamu."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Digital Nomads: Julian Owusu’s journey from football to fintech",
    "summarized_story": "Even though football held a promising future for Julian, it was only one of his dreams.\n“I grew up playing football,” he says, “But I’ve always been interested in tech, even long before I started playing professionally.”At the beginning of his football career, Julian knew he wanted to tell a different story with his journey.\nI wanted to be different.”He started his professional journey at 16 when he joined Eleven Wise—a Division One football league club based in Ghana—as a striker.\nWhen football players on defining paths, such as Julian, retire, it’s often because of injury.\n“It was difficult at the beginning, but all the skills I’d learnt playing football were transferrable."
  },
  {
    "headline": "In the wake of explosive accusations against Africa’s most valuable startup, Flutterwave co-founder speaks",
    "summarized_story": "Africa Fintech Foundry is an initiative by Access Bank that nurtures and accelerates the growth of fintech startups in Africa.\nAccess Bank was the budding fintech’s banking partner and Flutterwave helped introduce the bank to its Silicon Valley network.\nOtherwise, as a result of the hostility among banks, other banks can just say, ‘You’re from Access Bank, we will not use you.’ While we’re not Access Bank.\nWe’re Flutterwave,” Aboyeji said.\nFuture Africa, which Iyin Aboyeji leads, and Gbenga Agboola, Flutterwave CEO, are investors in Big Cabal Media, parent company of TechCabal."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Uber doesn’t want to Friyay",
    "summarized_story": "Uber Tanzania suspends operationsYesterday, Thursday, April 14, 2022, ride-hailing company, Uber, suspended operations in Tanzania until further notice after six years in the country.\nIn Nigeria, Uber increased rates on its UberX platform by 13% in Lagos and 20% in Nigeria’s capital, Abuja.\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nIt means that OPay cards will be linked to OPay’s mobile app, allowing users to request the issuance or cancellation of prepaid cards.\nThe prepaid cards will be distributed in collaboration with Egyptian Cards Company, the largest card distributor in the local and regional markets."
  },
  {
    "headline": "Can embedded finance drive financial inclusion in Nigeria?",
    "summarized_story": "An embedded finance play involves a company, usually not a financial institution, offering a financial service in addition to its existing offers.\nWhichever way you look at it, embedded finance seems like a good deal for everyone involved, so how does that affect financial inclusion in Nigeria?\nAccording to the World Bank, financial inclusion means that businesses and individuals have access to financial products and services that meet their needs responsibly and sustainably.\nHowever, considering financial inclusion can be achieved in other ways besides using a bank account, this may not be an accurate representation of financial inclusion in Nigeria.\nAdvertisementBy integrating financial services into non-financial solutions, more Nigerians can be integrated into the financial system without requiring a bank account."
  },
  {
    "headline": "Is Flutterwave’s CEO guilty of insider trading or not?",
    "summarized_story": "Anyway, today, I’ll be discussing:Flutterwave CEO’s insider trading allegationHow VC firm, Katapult, investsUmba’s $15 million Series AIs Flutterwave’s CEO guilty of insider trading or not?\nSince then, the phrase “insider trading” has topped my Twitter trend tables.\nIf Chimgozirim’s informant uses this insider information to profit in the stock market, all three involved are guilty and can be prosecuted.\nWhat does the law say about insider trading?\nInsider trading laws apply to private and public companies and transactions involving employees, employee stock plans, and third-party shareholders."
  },
  {
    "headline": "Lagos warns tenants as property fraud surges",
    "summarized_story": "Lagos State government has raised red flag for prospective tenants, advising them to beware of quacks and fake professionals in the state’s rental market who claim to be landlords and genuine estate agents.\n“This is a state where, according to report, there is a housing deficit that is in excess of 3million.\n“Real estate transactions have relevant processes with necessary documents required for the preparation of specific property business transaction in the sector,” she noted, adding that, in real estate transactions, lawyers and real estate agents offer completely different services.\n“A real estate agent is involved in the process of buying and selling properties or rental services while all paper works are handled by a lawyer as prescribed by law,” she said.\nThe agency, she added, would register and update that register of all people that are practising in the real estate sector and also people involved in real estate management, including Lawyers and estate managers."
  },
  {
    "headline": "Explainer: What to know about the $1bn attack helicopters US sold to Nigeria",
    "summarized_story": "Explainer: What to know about the $1bn attack helicopters US sold to NigeriaIn a bid to address the insecurity crisis in Nigeria, the United States State Department has cleared the sale of 12 AH-1Z Cobra attack helicopters worth nearly $1bn to Nigeria.\nAbout Bell AH-1 CobraThe Bell AH-1 Cobra is a single-engined attack helicopter developed and manufactured by the American rotorcraft manufacturer, Bell Helicopter.\nDesign and featuresThe AH-1 is a dedicated attack helicopter, featuring a tandem cockpit, stub wings for weapons, and a chin-mounted gun turret.\nFor several decades, the AH-1 formed the core of the US Army’s attack helicopter fleet, seeing combat in Vietnam, Grenada, Panama, and Iraq.\nBefore signing, we must be sure of the terms of use.”According to him, the attack aircraft can only be effective if handled by well-trained personnel that can maximise its features."
  },
  {
    "headline": "Flutterwave allegations: How Uber overcame the Kalanick palaver",
    "summarized_story": "Uber may not be a core payment company like Flutterwave, but it shares some similarities with the Nigerian-founded company.\nIn the middle of the allegations was Uber’s CEO and co-founder, Travis Kalanick.\nAfter Kalanick’s ouster, the new CEO had a mandate to move Uber beyond Kalanick’s legacy.\nKalanick aggressively turned the company into the world’s dominant ride-hailing service and upended the transportation industry around the globe.\nOne thing the response of Uber investors and board achieved was to detach Uber’s future from Kalanick’s legacies."
  },
  {
    "headline": "500 widows empowered in Kwara – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIlorin – No fewer than 500 widows from across the 16 local government areas of Kwara state have been empowered with various working tools, including cash donations, worth millions of Naira.\nSpeaking while distributing the cash donations and working tools in Ilorin, the state capital, the sponsor of the empowerment programme, Mr. Kolo Baba Jiyah, said the spirit behind the empowerment is to support the widows to enable them meet up with the life challenges.\n“I know what life means for a widow to maintain herself and care for the children’s going by the prevailing economic situation in the country.\nHe urged the beneficiaries to make judicious use of the tools to improve their lives, urging them not to sell them as doing that would not be beneficial to them.\nEarlier, an associate of the philanthropist, Alatare Suleiman Musa, lauded Jiyah for his kind gesture, noting that his empowerment programme has touched so many lives in Kwara state, adding that Nigeria needs people like Jiyah to reduce the poverty among the citizenry."
  },
  {
    "headline": "Edo govt, firm synergize on transparency, performance metrics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPoised to ensure transparency and performance-based service delivery, the Edo State Government has said it is instituting measures and metrics for evaluating activities of civil and public servants so as to meet set targets.\nThis was disclosed by the Commissioner for Finance, Joseph Eboigbe during the ongoing performance management capacity building workshop, organized for Heads of Ministries, Departments and Agencies (MDAs).\nThe workshop is expected to ensure quarterly feedback from MDAs on their performance and identify current gaps.\n“Security is also a huge priority as the state is strengthening its security architecture in partnership with security agencies.\nShe said the government has made immense contributions towards the development of human capital, noting “I want to see Nigeria working again."
  },
  {
    "headline": "Easter: Obaseki urges hope, sacrifice to rebuild nation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged Christian faithful to emulate Jesus Christ by making sacrifices that would engender development and ensure lasting peace and unity in the country.\nObaseki, in his Easter Message, urged Christians to reflect on the purpose of Easter celebration with a renewed hope for a better Nigeria, and be a part of the process of rebuilding the country.\nHe noted, “I felicitate with Christian faithful as we celebrate the sacrifice of the death and resurrection of our Lord Jesus and urge that we use the opportunity to reflect on the purpose of the celebration and renew our hopes towards achieving a better Nigeria.\n“We may have been stretched beyond limits considering the myriad of challenges that we currently face as a people, but there’s hope.\nThe good news is that our dear country, irrespective of these glaring challenges, is not beyond redemption."
  },
  {
    "headline": "Edo rallies stakeholders, assures programmes to preserve, promote cultural heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged for the collaboration of all stakeholders to preserve and promote the state’s rich cultural heritage, reassuring that the government will sustain efforts at preserving the state’s cultural assets and drive growth in the arts, culture and tourism sector.\nThe Edo State Commissioner for Arts, Culture and Diaspora Affairs, Hon.\nBamidele Obaitan, made the call during a meeting with stakeholders in the arts and culture sector, in Benin City, the Edo State capital.\nHe, however, advised heads of social and cultural departments in the local councils to collate the data of all cultural and tourism sites as well as a compendium of all festivals at the grassroots for effective documentation.\nHe further revealed the government’s plan to assist self-employed youths with grants through the African Development Bank (AfDB)."
  },
  {
    "headline": "Kukah Bombs Buhari: You Have Destroyed Nigeria",
    "summarized_story": "Bishop Matthew Kukah, the Catholic Bishop of Sokoto Diocese, has accused President Muhammadu Buhari of destroying Nigeria, noting that Nigerians no longer recognise their country which has been battered and buffeted by men and women from the dark womb of time.\nYet, we ask, ascend to where?”“With everything literally broken down, our country has become one big emergency national hospital with full occupancy.\nAccording to the bishop, every aspect of life in Nigeria has been destroyed while corruption is enthroned.\nHe said, “Our dear country, Nigeria, still totters and wobbles as we screech towards a dangerous and avoidable canyon of dry bones.\nKukah said, “We need to start thinking of a Nigeria beyond banditry and kidnapping and the endless circles of violence that have engulfed our communities and nation."
  },
  {
    "headline": "BREAKING: Alex Otti declares for governor, proclaims end to Abia crucifixion",
    "summarized_story": "Dr. Alex Otti, former bank CEO and public intellectual, has declared his intention to run for governor of Abia State in 2023 under the platform for the All Progressives Congress (APC).\nThe ace economist who decried the state of Abia’s economy, promised to grow the economy, provide jobs for youths and provide enabling environment for businesses to thrive.\nHe also promised to tackle corruption, which according to him, has become endemic in the state.\nOtti who likened the state of Abia to the crucifixion of Jesus Christ, whose resurrection is celebrated today, proclaimed an end to the the crucifixion, noting that the state must begin to move forward.\nHe emphasized that he is in the race for all Abians, and will ensure that his government impacts on all."
  },
  {
    "headline": "Zamfara bandit leader Nasanda, vows to kill 300 people over death of bride",
    "summarized_story": "Nasanda, a notorious bandit in Zamfara, has vowed to kill 300 people in the Northwest state over the death his bride, her uncle and aunt whom he said were allegedly killed by some vigilante men in the state.\nNasanda disclosed how his bride, her uncle, and aunt were allegedly killed by the vigilante.\nIn the audio, the bandit said he was being realistic and not greedy in asking for the N30 million compensation.\nThat is I will take the life of 300 people to avenge the death of my bride and two of her relations.\nIn 2021 a bandit kingpin murdered about 100 people to avenge the death of his son."
  },
  {
    "headline": "Access Bank moves beyond banking, becomes financial services holding company from May 1",
    "summarized_story": "Access Bank Plc, a leading Nigerian lender, has said it is transforming from core banking into a full financial services holding company from 1 May, 2022.\nHerbert Wigwe, the managing director of the bank, in a notice to shareholders on Saturday said the new company will be known as Access Holdings, PIc, but trading as Access Corporation.\nThe products on offer will include buy-now-pay-later loans, car loans, small mortgages, salary-based loans, working capital loans, durable goods loans, point of sale loans and much more.\n“Payment Company: a Payment Services Company that will drive payments domestically, across the African continent and beyond.\nPrimarily a business services company, the Payco will make payments simpler, faster and more efficiently."
  },
  {
    "headline": "2023 Gov’ship: I Have Something Different From Others, Ikonne Tells Abians",
    "summarized_story": "A former Vice Chancellor of Abia State University, Uturu, and Peoples Democratic Party (PDP) 2023 governorship aspirant, Prof. Uche Ikonne, has said that he has something extra to offer than the other aspirants.\nIkonne, who stated this at the weekend while declaring his aspiration for the office of Abia State governor in Umuahia, the state capital, said the extra things are his virtues, which include experience, commitment, maturity, and excellence.\nHe said the virtues were gathered through his discipleship of notable past leaders of the state both in the academics and the society as well as his headship of the State University and Polytechnic.\nADVERTISEMENTIn his response, Abia State PDP chairman, Rt.\nAlwell Asiforo Okere, said with Ikonne’s governorship declaration, the party has been witnessing quality aspirants in the race, describing it as a welcome development."
  },
  {
    "headline": "Easter: Abia APC Chairman Felicitates With Christians",
    "summarized_story": "The chairman of the All Progressives Congress in Abia State, Dr Kingsley Ononogbu, has felicitated with Christians in the state on the ocassion of this year’s Easter celebration.\nOnonogbu, in a statement made available to journalists in Umuahia, the state capital, on Sunday, noted that the occasion is a period for spiritual rejuvination for Christians.\nHe reminded Christian faithful of the place and importance of the ocassion which marks the crucification and resurrection of Jesus Christ to save mankind from eternal condemnation.\n“For this and more reasons, we should be guided by the lessons, ideals and virtues He stood for.\nThis is the sure way to make meaning out of the supreme sacrifice He made to redeem us,” the party Chairman stated."
  },
  {
    "headline": "Nigerian Aminu Audu Appointed Into UK Advisory Group",
    "summarized_story": "A Nigerian, Aminu Audu, has been appointed into the Merseyside Independent Advisory Group in the United Kingdom.\nThe group advises the UK Police on matters, including stop and search practices, training and crime statistics.\nA statement by the chair of the Advisory Group, Sharon Williams, said Audu’s appointment was based on his rich research in community policing that has impacted on the UK.\nADVERTISEMENT“Members of the group have different specialisations and life experience, from working with the homeless to representing hard to reach communities,” she said.\nHis book, ‘Police Corruption and Community Policing in Nigeria: A Sociological Case Study’, was based on his Ph.D research at Liverpool, UK."
  },
  {
    "headline": "Nigerian Aminu Audu Appointed Into UK Advisory Group",
    "summarized_story": "A Nigerian, Aminu Audu, has been appointed into the Merseyside Independent Advisory Group in the United Kingdom.\nThe group advises the UK Police on matters, including stop and search practices, training and crime statistics.\nA statement by the chair of the Advisory Group, Sharon Williams, said Audu’s appointment was based on his rich research in community policing that has impacted on the UK.\nADVERTISEMENT“Members of the group have different specialisations and life experience, from working with the homeless to representing hard to reach communities,” she said.\nHis book, ‘Police Corruption and Community Policing in Nigeria: A Sociological Case Study’, was based on his Ph.D research at Liverpool, UK."
  },
  {
    "headline": "Borno: Zulum Offers 30% Salary Increase For Medical Doctors In 7 Liberated Local Govts",
    "summarized_story": "Borno State governor, Babagana Umara Zulum, during a late night visit to the General Hospital in Monguno, on Saturday, announced the approval of 30% salary increase for medical doctors in seven Local Government Areas of the State with peculiarities.\nApart from the medical doctors, nurses, midwives, lab technicians, pharmacists and other health workers in the seven local government areas will also benefit from 20% salary increase aimed at motivating them to deliver quality and affordable healthcare services.\nZulum had in January 2022, raised the salaries of all medical doctors in Borno State to the level paid by the Federal Government to stop rampant cases of state doctors moving to federal healthcare institutions for better pay.\nThe governor had in the last three years approved the recruitment of a combined total of 676 medical workers made up of over 40 medical doctors and 241 nurses, midwives and other health workers.\nOthers in the governor’s entourage include the Commissioner for Reconstruction, Rehabilitation and Resettlement, Engr Mustapha Gubio; Commissioner for Justice, Bar."
  },
  {
    "headline": "Zamfara drama: Ex-gov Yari, Senator Marafa dump APC for PDP",
    "summarized_story": "Former Zamfara state Governor, Alhaji Abdulaziz Yari who is facing several graft cases and former Senator Kabiru Garba Marafa have dumped the ruling All Progressives Congress (APC) for the Peoples Democratic Party (PDP).\nThe dramatic switch of the politicians, who were former enemies was announced today by Zamfara PDP chairman, retired Colonel Bala Mande.\n“We have all agreed to work for the development of the party and the PDP in the state has welcome them to its fold.\nYari and Marafa lost control of Zamfara APC after Governor Bello Matawalle defected to the party last year.\nMatawalle, who had the backing of the national leadership of the party, had told those who could not recognise him as Zamfara APC leader to leave."
  },
  {
    "headline": "Ozigbo joins race for Senate",
    "summarized_story": "By Chimezie AnasoMr Valentine Ozigbo, Peoples Democratic Party’s (PDP) candidate who lost the Nov. 6, 2021 governorship election in Anambra, has declared his intention to contest in the Anambra South Senatorial District election in 2023.\nOzigbo’s intention was made known in Awka on Sunday by Mrs Aziza Uko, Director of Media and Communications at Valentine Ozigbo Campaign Organisation.\nOzigbo was runner-up in the governorship election won by incumbent Prof. Chukwuma Soludo of the All Progressives Grand Alliance (APGA) in 2021.\n“Mr Valentine Chineto Ozigbo has accepted the call by his people, the people of Anambra South, and influential voices across Anambra to run for the seat of Anambra Senatorial District in the Senate.\nHis shot at the governorship seat in Anambra was his first attempt to get into an elective office."
  },
  {
    "headline": "Tinubu: I’m not running for president for eba, garri, beans and dodo; I’m running for you — APC leader, tells Nigerian youth (Video)",
    "summarized_story": "Tinubu: I’m not running for president for eba, garri, beans and dodo; I’m running for you — APC leader, tells Nigerian youth (Video)I’m not running for president for eba, garri, beans and dodo; I’m running for you — APC leader, Asiwaju Bola Ahmed Tinubu, tells Nigerian youthThe former Lagos governor said the government cannot give Nigerian youth epileptic power supply and turn around to label them ‘lazy’.\nHe said if he’s elected, free university education could be possible.\nTinubu made the comments at a Southwest youth rally organised for his campaign in Onikan, Lagos, on Saturday.\nWatch Video:"
  },
  {
    "headline": "We must change Nigeria’s story, Tinubu tells youths",
    "summarized_story": "The National Leader of the All Progressives Congress and presidential aspirant, Asiwaju Bola Tinubu, has called on the youths to change Nigeria’s story and desist from lamenting on the past.\nTinubu spoke on Saturday during a rally organised by youths, under the aegis of Progressive Youth of South-West, to support his presidential bid in Onikan, Lagos.\nHe added, “We as a nation can conveniently feed ourselves by being creative, visionary and committed.\nGive us power and if we cannot be successful then you can abuse us; you cannot give us an erratic power supply that is undependable and then blame us again that we are lazy.\nThe state youth leader, Dr Muritala Seriki, applauded the achievements of Tinubu whom he described as a detribalised Nigerian."
  },
  {
    "headline": "Breaking: Bandit Terrorists Again Kill Two In Fresh Southern Kaduna Attack",
    "summarized_story": "Scores have been reportedly injured by bandit terrorists in a fresh Southern Kaduna attack.\nMeanwhile, the Chief of Defence Staff, Gen. Lucky Irabor, has said that putting an end to terrorist attacks in the Southern part of Kaduna State is beyond military deployment.\nNews Direct reports that terrorists have launched a series of deadly attacks on some areas in Kaduna State.\nThe bloodshed in Southern Kaduna has become a thing of concern for the nation as the terrorists are not slowing down in their invasions.\nReacting, however, to the sad developments, Irabor while addressing newsmen in Kafanchan, said Nigeria’s military has resolved to restore peace in Southern Kaduna."
  },
  {
    "headline": "Extend presidential pardon to petty thieves, Falana urges FG",
    "summarized_story": "Rights activist Femi Falana, SAN, on Friday in Ikeja urged the Federal Government to extend Thursday’s presidential pardon granted some top Nigerians, to people serving terms for petty offences.\nThe News Agency of Nigeria reports that the Council of State granted presidential pardon to 159 convicts on Thursday.\n“When we are talking of justice and fair play, if you want to pardon some set of people, then you must also extend presidential pardon to petty thieves in the prisons.\nSpeaking on the passing of late Odumakin after a year, Falana described his loss as a monumental tragedy.\nNAN reports that late Odumakin, died in April 2, 2021, after battling with respiratory problems, occasioned by COVID-19 complications."
  },
  {
    "headline": "Breaking: Yari, I have not joined PDP, but… – Marafa",
    "summarized_story": "Former Senator Kabiru Marafa on Sunday denied reports suggesting that he has together with former Zamfara state governor Abdulaziz Yari decamped to the People’s Democratic Party (PDP).\nOn Sunday, PDP chairman in Zamfara said the opposition party has reached agreement with both APC stalwarts and that their formal declaration would happen soon.\n“…It is not true that we have decamped to the PDP, whoever said so has erred.\n“We have no choice than to move out of the APC.”Senator Marafa said the new national chairman of the APC, Senator Abdullahi Adamu, did not look for him.\n“Abdulaziz Yari, has told me that he (Abdullahi Adamu), has looked for him, they have discussed and I was told about the level of their discussion."
  },
  {
    "headline": "After years of unresolved differences, ex- Zamfara gov Yari, Marafa drop crucial hint, dump APC ￼",
    "summarized_story": "After years of unresolved differences and failed attempt at reconciliation, former Zamfara state Governor Abdul Aziz Yari, Senator Kabiru Garba Marafa and other top members of the All Progressives Congress (APC) have finally defected to the opposition Peoples Democratic Party (PDP).\nBriefing journalists Sunday in Gusau, Zamfara state PDP Chairman, Colonel Bala Mande (rtd), confirmed that the party received Yari, Marafa and other top APC members into the PDP fold.\nWe have agreed to be together in one party, the PDP and work together for the success of the party.\n“We have also agreed to work extra hard in order to reclaim Zamfara state in 2023 and save its people from their present predicament.\n‘APC not Islam’Earlier, Senator Marafa had hinted on their planned move to join the PDP, citing injustice."
  },
  {
    "headline": "20 years after ICJ’s ruling on Bakassi: Language barrier stalls boundary demarcation – Blueprint Newspapers Limited",
    "summarized_story": "“It is not only Nigeria but both countries differ in their understanding and interpretations of some of the texts.\nAreas of conflicting interpretationsTwenty of such areas of discrepancies were observed and deliberated upon by the United Nations Cameroon- Nigeria Mixed Commission.\nNigeria demands Cameroon concessionLast November (2021), Nigeria had asked the Cameroonian government to make some compromise in its ongoing boundary demarcation issue with her.\nThe areas of dispute between Nigeria and Cameroon include the Bakassi Peninsula and stretches up to Lake Chad areas.\nSince then, conflicting understanding and interpretations as well as demand for compromise across board have hindered speedy conclusion of the implementation of the ruling."
  },
  {
    "headline": "Minister applauds Sen. Kyari’s commitment to development of FCT",
    "summarized_story": "By Kingsley MadakiMinister of the FCT, Malam Muhammad Musa Bello has expressed the appreciation of the FCT Administration to Senator Abubakar Kyari for his commitment to the development of the the capity city while he served as Chairman, Senate Committee on FCT.\nMinister of State, the Permanent Secretary, the Chief of Staff, and all the senior management staff.\n“In all our official encounters with you, you did it with dedication to duty and passion for the development of the Federal Capital Territory.\nMinister and staff of the FCTA and FCDA”.\nThe APC Deputy National Chairman, however, pointed out that the population explosion challenge which forced relocation of capital out of Lagos was currently facing the FCT and exerting undue pressure on existing facilities."
  },
  {
    "headline": "Bashir Nura Alkali resumes Office as New Permanent Secretary for Works Ministry – NigPilot",
    "summarized_story": "Newly appointed Permanent Secretary of the Federal Ministry of Works and Housing, Mr. Bashir Nura Alkali has resumed duty following the recent approval and redeployment of Permanent Secretaries in the Federal Civil Service by His Excellency, President Muhammadu Buhari.\nEarlier in his remarks, Director Overseeing the Office of the Permanent Secretary, Engr.\nThat tells you the kind of person the new Permanent Secretary is.\nBut it is a gain to us in the Federal Ministry of Works and Housing,’’ Uzo said.\nUzo handed over two sets of handover notes, that of the former Permanent Secretary and that of when he acted as the Director Overseeing the Permanent Secretary’s Office."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Christians Celebrate Easter Amid Calls For Hope, Unity",
    "summarized_story": "﻿Christians in Nigeria and across the world are celebrating Easter, commemorating the resurrection of Jesus Christ from the dead.\nTo mark Easter, Christians thronged churches for special services, prayers and thanksgiving.\nIn its Easter message, the Christian Association of Nigeria (CAN) said Easter called for celebration despite the challenges bedeviling the country.\n“As we approach another season of electioneering, let the security and unity of the nation guide our actions and utterances,” Buhari said in a statement on Thursday.\nPope Francis, who has repeatedly condemned the conflict in Ukraine, and has called for an Easter ceasefire, prayed that the “adversaries shake hands” and “taste mutual forgiveness”."
  },
  {
    "headline": "Russian Invasion: Pope Calls For Peace In ‘Easter Of War’",
    "summarized_story": "Pope Francis on Sunday called for peace in Ukraine during this “Easter of war” as he delivered the traditional Easter Sunday Urbi et Orbi address on St. Peter’s Square at the Vatican.\n“May there be peace for war-torn Ukraine, so sorely tried by the violence and destruction of the cruel and senseless war into which it was dragged,” the pontiff said.\n“Our eyes, too, are incredulous on this Easter of war,” he said.\n“May the leaders of nations hear people’s plea for peace.”“Let there be a decision for peace.\nThe pontiff pointed that two years of the coronavirus pandemic had taken “a heavy toll.”“It was time to come out of the tunnel together, hand in hand, pooling our strengths and resources."
  },
  {
    "headline": "Easter: Osinbajo Prays For Restoration, Prosperity In Nigeria",
    "summarized_story": "As Christians in Nigeria join other faithful worldwide to celebrate Easter Sunday, Vice President Yemi Osinbajo (SAN), has assured Nigerians of the restoration of peace and a more prosperous future for all regardless of current challenges.\nProf. Osinbajo stated this on Sunday in a chat with journalists shortly after the Easter Sunday service at the State House Chapel, Aso Villa, Abuja.\nRead Also: ‘The President Should Sit Up’; Anglican Bishop Slams Buhari Over Insecurity“My message is really a prayer.\n“Where there is despair, I pray that hope would be restored, where there is fear, I pray that there is courage and confidence.\nJoining the VP and his wife, Mrs Dolapo Osinbajo at the Aso Villa Chapel for the service were Sen. Emmanuel Bwacha and Hon."
  },
  {
    "headline": "NDLEA Intercepts Cocaine Hidden In Footwears, Toothpaste Tubes",
    "summarized_story": "﻿The National Drug Law Enforcement Agency (NDLEA), has intercepted large consignments of Cocaine smuggled into the country through three major international airports in Port Harcourt, Abuja and Lagos.\nThis was disclosed in a statement signed by the Director, Media & Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi on Sunday.\nAccording to the statement, seven traffickers were also arrested in connection to the smuggling by Brazil-based drug cartels.\nThe Cocaine was hidden and smuggled using unconventional methods like inside toothpaste tubes and footwear.\n“The father of one who claimed he’s a motor spare parts dealer is from Ezeagu in Ezeagu LGA, Enugu state."
  },
  {
    "headline": "World Cup Qualifier: Nigeria Thrash Egypt In First Leg",
    "summarized_story": "Nigeria’s U-17 girls on Sunday maintained a good position for the final round of the African qualification series for this year’s FIFA U-17 Women’s World Cup after a convincing 4-0 victory over Egypt at the MKO Abiola National Stadium, Abuja.\nNigeria would not relent and forward Omowunmi Bello headed home the second goal in the 39th minute from a corner kick by Tumininu Adeshina.\nEight minutes later, defender Miracle Usani found herself with the ball just outside the Egyptian box after everyone had missed from a corner kick and slammed past goalkeeper El Taher for Nigeria’s third.\nIn the 62nd minute, Bello again showed immense composure to lift the ball above onrushing El Taher, after she had been brilliantly played-in by the excellent Taiwo Afolabi on a counterattack.\nThe winner will most likely play Ethiopia in the final round of the series for a ticket to the FIFA World Cup in India."
  },
  {
    "headline": "Former Governor Yari, Senator Marafa, Supporters join PDP -",
    "summarized_story": "Addressing Newsmen shortly after the State executive council meeting of the party in Gusau, Chairman of the party Bala Mande says the party is set to formally recieve the former governor and his teamHe says the Defection of the top Zamfara Politicians to the PDP will further boost the strength of the party especially as the 2023 election approachesBala Mande expresses Confidence that the PDP will take over power in Zamfara come 2023The Zamfara PDP enjoin it’s members to embrace All Politicians willing to join the party in it’s quest to rescue the state from what it describe as total collapseThe Defection of former Governor Abdul’azeez Yari and Senator Kabiru Marafa among other top Zamfara Politicians is coming after months of Speculation."
  },
  {
    "headline": "Senator Akpanudoedehe declares for Akwa Ibom Gov race -",
    "summarized_story": "The Former National Secretary of the dissolved Caretaker/Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC) Senator John James Akpanudoedehe has joined the Akwa Ibom governorship race.\nHe promised to lead the State out of poverty, ensure even development and bring prosperity to his people.\nHe declared on Saturday at a grand reception to receive him to the State after his service as the National Secretary of the party’s CECPC at Ibom Hall, Uyo, Akwa Ibom.\nThe former CECPC Secretary accepted and agreed to carry the flag of the party at the 2023 governorship election in the State.\nAkwa Ibom APC chairman, Obong Augustine Ekanem, insisted the party was intact under his leadership and ready to take over government from the ruling Peoples Democratic Party (PDP) in the State."
  },
  {
    "headline": "2023 Presidency: Gov Yahaya Bello is APC’s best bet",
    "summarized_story": "The Yahaya Bello Presidential Campaign Organisation says the governor Yahaya Bello possesses all the attributes that can retain the presidency for the ruling All Progressives Congress in 2023.\nOf the pool of aspirants, as the country stands today, even across party lines, Governor Yahaya Bello is the best bet for the younger generation if this dream must be actualized.\nBeing the strongest contender from the region places Governor Bello in a vantage position to clinch the presidential ticket.\nTherefore, in terms of the main issues confronting the nation, Governor Yahaya Bello has excelled remarkably in Kogi State.\nThey will rally round Governor Yahaya Bello and retain the presidency with a wide margin come 2023.”"
  },
  {
    "headline": "APC Holds Maiden Post-Convention NEC Meeting on April 20, 2022 -",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) has called the maiden post-National Convention meeting of the National Executive Committee (NEC) to be held on Wednesday, 20th April, 2022.\nThe emergency NEC meeting which will take place at the Congress Hall of Transcorp Hilton Hotel in Abuja will commence at 10am.\n“Pursuant to Article 25.2.ii of the Constitution of the All Progressives Congress (APC), the National Working Committee (NWC) hereby invites members of the National Executive Committee (NEC) of our great Party to a meeting to consider the Party’s Timetable/Schedule of Activities for Primaries for the nomination of candidates for the 2023 General Elections and other relevant business of the Party.\n“All members of the NEC are by this invitation to take notice of the meeting in accordance with Article 12.3 of the APC Constitution, please,” the official notice/invitation for the NEC meeting stated."
  },
  {
    "headline": "Russia Sets Deadline for Ukraine Troops in Mariupol to Surrender",
    "summarized_story": "It would be the first major city to have fallen to Russian forces since the Feb. 24 invasion.\nThe Russian defence ministry said its troops had “completely cleared” Mariupol’s urban area of Ukrainian forces and blockaded the “remnants” in the Azovstal steelworks, RIA news agency said.\nIt said that as of Saturday, Ukrainian forces in the city had lost more than 4,000 personnel.\nHe did not address Moscow’s claim that Ukrainian forces were no longer in urban districts.\nKyiv and Washington say the ship, whose sinking has become a symbol of Ukrainian defiance, was hit by Ukrainian missiles."
  },
  {
    "headline": "Pardon All Thieves in Prison, SANs Tell Buhari, Knock President Over Dariye, Nyame",
    "summarized_story": "He said: “By granting pardon to these treasury looters, Buhari is reviving, nurturing and watering corruption with state powers”.\nHe stressed that it was wrong to grant state pardon to the two of them who were convicted for stealing state funds.\nThe so-called 1999 constitution is really decree 24 of 1999.\nHe wondered why president Buhari granted the pardon despite his lamentations that corruption is affecting Nigeria’s growth.\nI am so upset by the decision because the ex-governor of Plateau State has his appeal dismissed in March 2021 by the Supreme Court."
  },
  {
    "headline": "Nigeria: Talks Between Government and Striking Lecturers Hit Brick Wall",
    "summarized_story": "Why not take N200 billion out of the N4 trillion fuel subsidy money and end this strike?” he queried.\nOsodeke however said that the most critical issue is the payment of the revitalisation fund and the salary of the lecturers.\n“So, we are still waiting for them to bring their proposal of the conditions of salaries of lecturers,” he added.\nHe said that based on the recommendations, the Jonathan-led administration had released N200 billion.\n“Since that time, this government has only released N70 billion, when they were to release N200 billion every year."
  },
  {
    "headline": "Nigeria: VP Osinbajo ‘Declined Ex-President Obasanjo’s Offer to Become AGF’ in 2005",
    "summarized_story": "A veteran journalist, Mr. Mustapha Ogunsakin, has revealed how Vice President Yemi Osinbajo turned down President Olusegun Obasanjo’s offer to become the Attorney-General of the Federation and Minister of Justice in 2005.\n“The president without informing Bola Tinubu, the then Lagos State Governor, offered the post to Osinbajo who was then Lagos State Attorney-General.\nRelatedStories No Content AvailableHe said that Osinbajo made a request to Obasanjo to release Lagos State Council funds.\n“Osinbajo rejected the position of Attorney-General of the Federation and Minister of Justice and stayed with Tinubu; nobody complained then,” he said.\nOgunsakin said Osinbajo not only stood with Tinubu, but stayed loyal to Lagos State, adding that” he did not betray Tinubu then.’’He cautioned those calling Osinbajo a betrayer."
  },
  {
    "headline": "Nigeria to Benefit as IMF Approves $45bn for Low, Middle-Income Countries",
    "summarized_story": "The International Monetary Fund (IMF) has approved a $45billion trust fund to help low and vulnerable middle-income countries, including Nigeria to build resilience and sustainability.\nNigeria is among lower-middle-income countries with a gross national income (GNI) per capita of $2,157 in 2019, according to the World Bank collection of development indicators.\nThe fund is part of IMF’s $650 billion special drawing rights (SDRs) issued in August 2021 to vulnerable countries to boost liquidity through Resilience and Sustainability Trust (RST).\n“The Trust aims to help low-income and vulnerable middle-income countries address longer-term structural challenges that pose macroeconomic risks, including climate change and pandemics.\nThe aircraft would be flying at a low altitude, 50 meters above ground level, about the height of a 15-storey building."
  }
]