[
  {
    "headline": "NDLEA warns intending Hajj pilgrims against drug trafficking",
    "summarized_story": "An official of the agency, Habiba Zubair, gave the warning in Ilorin while addressing those travelling to Saudi Arabia to perform the 2022 Hajj.\nShe warned that pilgrims could take only prescription drugs to Saudi Arabia as the government there would not tolerate anything outside that.\nZubair also admonished the pilgrims not to take kolanuts or ground pepper to Saudi Arabia as they would be confiscated.\n“Do not take any luggage from strangers in any circumstance as you may be tricked into taking on prohibitive substances,’’ she warned.\nThe NDLEA official also told the intending pilgrims to always wear the state’s uniform while in Saudi Arabia for easy identification."
  },
  {
    "headline": "Osun 2022: INEC’ll be fair, votes’ll count, REC says",
    "summarized_story": "The Resident Electoral Commissioner of the Independent National Electoral Commission in Osun State, Prof. Abdulganiy Raji, has assured all candidates and parties, participating in the July 16 governorship poll in the state that the Commission will be fair.\nThe REC spoke in Osogbo on Friday at the opening session of two-day capacity building for Civil Society Organisations/Non-Governmental Organisations, and People With Disabilities.\nProf. Raji, who also assured that votes would count during the poll, said the Commission had engaged various stakeholders, including royal fathers as part of measures to ensure a free and fair poll.\nHe, however, charged the participants to assist the Commission to conduct voter education in every part of the state for the peaceful conduct of the governorship poll.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Democracy Day: 2023 polls, new opportunity to build on hope, potential of June 12, 1993 – Sanwo-Olu",
    "summarized_story": "“Let Democracy Day be a reminder of the importance of joining hands to build the future we want.\n“We have since been blessed with a new opportunity to build on the hope and the potential of June 12, 1993.\n“Indeed, Bashorun Moshood Kasimawo Olawale, MKO Abiola, the winner of the June 12, 1993 election, lived and worked in Lagos.\n“What we are doing is celebrating and appreciating the positive side of June 12, 1993.\n“It is perhaps fitting that we are celebrating this year’s Democracy Day in the immediate aftermath of the first phase of the 2023 political season."
  },
  {
    "headline": "2022 Guber: Ekiti teachers affirm support for Kolawole, says ‘We ‘ll support him because of Fayose’",
    "summarized_story": "Teachers in Ekiti State have affirmed their support for the People’s Democratic Party (PDP) governorship candidate in the June 18 election in the State, Hon Bisi Kolawole.\n“For us teachers in Ekiti, PDP has paid its dues through Fayose, and for this, we will support Bisi Kolawole,” they said.\nThis was part of the requests contained in a document signed by the Kolawole with the Ekiti State Chapter of the NUT during the interactive session.\nThe interactive session, which had former Governor of Ekiti State, Mr. Ayodele Fayose in attendance saw the former two term governor go memory lane on how his administration, in no small measure benefitted the teachers.\nFayose thanked the teachers for always standing by him in and out of government, saying; “I thank you for your support during the 2018 election."
  },
  {
    "headline": "Mixed reactions trail older women dating younger men",
    "summarized_story": "Some respondents in separate interviews with the News Agency of Nigeria (NAN) in Lagos on Sunday expressed divergent views on the idea of women dating and marrying men younger than them.\nAdeola Kolade, a fashion designer, said that younger men had more energy and life span to satisfy older women sexually.\nIt’s just my taste; women who date younger men spend more in relationships, especially in Nigeria.\n“I don’t believe younger men date older women just because of money, there are lots of young men who love the peace of mind that comes with being with someone who’s mature and older.\n“I love being married to a woman older than me, satisfying a woman younger than me is something I can’t think of, younger women have a strong sexual appetite than a woman older than you."
  },
  {
    "headline": "Democracy Day: Jealously guard our democracy – Ortom tells Nigerians",
    "summarized_story": "Governor Samuel OrtomBy Peter Duru, MakurdiGovernor Samuel Ortom of Benue state has urged Nigerians to always be on the alert to jealousy guard the nation’s democracy against anti democratic forces.\n“This is why the federal government must wake up to its responsibility and tackle the menace headlong.\n“We therefore appreciate the people of Benue State for the support given us and assure them that our administration will not waver.\nWe will sustain the tempo in this remaining year.”While paying glowing tribute to the June 12, 1993 Democracy martyr Chief M.K.O .\nAbiola, Governor Ortom prayed that what led to the ill-fated third republic would never reoccur in the country."
  },
  {
    "headline": "2023 polls: Nigerian youths have power to make real change happen – EU",
    "summarized_story": "By Gabriel OlawaleThe European Union, EU, has admonished Nigerian youths to be part of the electoral process in the country, saying their voters’ card is the only power they have to make the real change happen in 2023.\nThis is why we are here, we need to change this trend, to mobilise the youths.\n“You have the power to make change happen, you have the power to make the difference, therefore, dont give up your power because your vote is your power.\nThe awareness campaign, held at Tafawa Balewa Square, TBS, aims to mobilise and get youths registered in the Continuous Voters’ Registration (CVR).\nNext, you want to hear from INEC, if we register and vote, will our votes count?"
  },
  {
    "headline": "Kwara Customs command takes anti-smuggling campaign to border communities",
    "summarized_story": "In a bid to combat small arms and light weapons smuggling into the country, the Kwara State Customs command has solicited the assistance of traditional rulers in Baruten Local Government Area of Kwara North Senatorial District.\nThe Customs Area Comptroller, H.B.\nAhmed made the appeal while speaking during a sensitisation visit to the palace of District of Bukura, in Baruten Local Government Area of the State.\nHe acknowledged the critical role traditional rulers and institutions could play, especially in the areas of sensitisation and enlightenment of their subjects, critical stakeholders and the society at large in the concerted effort to curtail the menace of smuggling across the borders.\nThe Customs Area Comptroller also visited other security agencies in the area, including Benin Republic Customs, Nigeria immigration Service, the police force and the Joint Border Patrol Team, among others, emphasising the need for synergy and collaboration as no agency could operate in isolation and succeed without the support of others."
  },
  {
    "headline": "2022 Democracy Day: Full text of Buhari’s address to Nigerians",
    "summarized_story": "President Muhammadu Buhari on Sunday in his Democracy Day broadcast urged Nigerians to pray for all victims of terrorists attacks across the nation.\nFull text of his speech:“Fellow Nigerians, Today, June The 12th, marks another Democracy Day anniversary and an occasion to celebrate freedom and unity of our Nation.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nFellow Nigerians this is my last Democracy Day speech as your President."
  },
  {
    "headline": "2023: Publish your assets, reject vote-buying – SERAP challenges Atiku, Tinubu, Obi, others",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has sent an open letter to presidential candidates ahead of the 2023 presidential election, urging them to immediately publish details of their assets and liabilities.\nIt also asked them to publicly commit to rejecting vote-buying and electoral bribery before and during the elections.\n“It would also show that you would be accountable to the public for your actions and submit yourself to the scrutiny necessary to ensure this.\n“Vote buying amounts to undue influence and improper electoral influence.\nOthers are Omoyele Sowore of Africa Action Congress (AAC); Prince Malik Ado-Ibrahim of Young Progressive Party (YPP); Professor Christopher Imumulen of Accord Party (AP); Kola Abiola of Peoples Redemption Party (PRP); Prince Adewole Adebayo of Social Democratic Party (SDP); Yusuf Mamman Dan Talle of Allied Peoples Movement (APM) and Dumebi Kachikwu of African Democratic Congress (ADC)."
  },
  {
    "headline": "Democracy Day: Fintiri sets six convicts free",
    "summarized_story": "Adamawa State Governor, Ahmadu Fintiri has freed six inmates serving various prison terms in five Correctional Centres across the State.\nThe Governor did this in commemoration of this year’s June 12 Democracy Day, according to a statement from the Government House, Yola.\nWonosikou added that Governor Fintiri also commuted the death sentence of another inmate to life imprisonment.\nHe said the seven inmates are serving their terms in Yola old, Jada, Numan, Mubi, and Jimeta Correctional facilities.\nThe Governor’s Press Secretary added that Fintiri acted in line with recommendations of the Council on the Prerogative of Mercy, and that it was part of efforts to decongest some of the overburdened Correctional Centres as Nigeria marks Democracy Day."
  },
  {
    "headline": "MKO Abiola: Real reasons my govt changed Democracy Day to June 12 – Buhari",
    "summarized_story": "President Muhammadu Buhari has adduced reasons the Federal Government reviewed the Democracy Day from May 29 to June 12.\nBuhari said his government reviewed Democracy Day from May 29 to June 12 to honour the late MKO Abiola.\nThe President disclosed this during his nationwide broadcast to mark 2022 Democracy Day on SundayBuhari said Democracy Day was a time to celebrate the freedom and unity of Nigeria.\n“In 2018, we moved Democracy Day from 29th of May to the 12th of June.\n“On June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully."
  },
  {
    "headline": "Muslim-Muslim ticket targeted at denting Tinubu, says Pastor",
    "summarized_story": "The leader of Young Professionals of Nigeria Pastor John Desmond has earned political hawks to stop peddling rumour of a Muslim-Muslim in the ruling All Progressives Congress(APC).\nHe said the speculation is targeted at denting the image of APC presidential candidate Asiwaju Bola Ahmed Tinubu and tagging him as a religious fanatic.\n“The Muslim-Muslim ticket issue is dead on arrival and those speculate are out to cast aspersion on the person of Asiwaju Bola Ahmed Tinubu.\n“Asiwaju having being a bridge builder knows the implication of Muslim-Muslim ticket.\nDesmond urged Tinubu to choose a northern Christian to put his political detractors to shame."
  },
  {
    "headline": "Democracy Day: Fintiri pardons six convicts",
    "summarized_story": "Adamawa Governor Ahmadu Fintiri has pardoned six inmates serving various prison terms in five Correctional institutions across the State.\nThe Governor did this in commemoration of this year’s Democracy Day, according to a statement from Government House, Yola.\nThe statement by Humwashi Wonosikou, Fintiri’s Press Secretary, said the Governor exercised the powers conferred on him by section 212 (i)(b) of Nigeria’s Constitution.\nWonosikou said Governor Fintiri also commuted the death sentence of another inmate to life imprisonment.\nThe Governor’s press secretary added that Governor Fintiri acted in line with the recommendation of the Council on the Prerogative of Mercy as part of efforts to decongest some of the overburdened Correctional Centres."
  },
  {
    "headline": "Lawan preaches, equity, justice on Democracy Day",
    "summarized_story": "Senate President Ahmad Lawan has called on Nigerians to enthrone equity, fairness and justice in their efforts at nation building.\nLawan, in a statement to mark Democracy Day, described June 12 as “more than just a date.”The statement reads: “I heartily felicitate fellow Nigerians on the occasion of this year’s Democracy Day.\n“This is the fourth time that we are celebrating the Day on June 12 since President Muhammadu Buhari made the change from May 29.\n“The statement of that day propelled us into the longest period of democracy in our nation’s history.\n“Our goal should be to build our nation with the bricks of equity, fairness and justice, so that it can withstand challenges as they may come."
  },
  {
    "headline": "Full text of President Buhari’s Democracy Day speech",
    "summarized_story": "From 1999, we consistently celebrated Democracy Day to mark the end of military rule and the return of power and control into the hands of those freely elected by the people.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nFellow Nigerians this is my last Democracy Day speech as your President.\nI will conclude this Democracy Day speech, my last as President, by assuring you of my commitment to protect Nigeria and Nigerians from all enemies from within and outside."
  },
  {
    "headline": "OAU VC: As Ogunbodede bows out",
    "summarized_story": "Prof. Ogunbodede is one of the few incorruptible chief executives who will never ask any contractor to give him kickbacks or bribes.\nProf Ogunbodede really won my heart and that of others with the way he related to contractors with absolute transparency .\nClearly, Prof. Ogunbodede is a beacon and blistering light in usually impossible tunnels, whose temper constitutes the template for enviable conducts.\nWhat Prof. Ogunmodede did yesterday as OAU VC is what we are talking about today.\nProf. Ogunbodede was born 23 January 1957."
  },
  {
    "headline": "Democracy Day: In honour of Abiola, 2023 transition must be peaceful- Buhari",
    "summarized_story": "The President made the call in his national address to the on the occasion of commemoration and celebration of Democracy Day, June 12, 2022.\nAccording to him, “On June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nOn June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nBy June 12th, 2023, exactly one year from today, you will already have a new President.\nThe Executive, Legislature and Judiciary were and still remain united and committed to ensure these reforms are fully implemented in the 2023 general elections."
  },
  {
    "headline": "Democracy Day: President Buhari bids Nigerians goodbye",
    "summarized_story": "The president made the call in his national address in commemoration and celebration of Democracy Day today, June 12, 2022.\nHe said: “On June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nOn June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully."
  },
  {
    "headline": "2023 presidency: Furore over Muslim-Muslim ticket",
    "summarized_story": "…We’ve not forgiven el-Rufai over Muslim-Muslim ticket in Kaduna –SOKAPUSouthern Kaduna People’s Union (SOKAPU) has said that any political party that fields a Muslim-Muslim or Christian-Christian ticket in the 2023 Kaduna State governorship polls will fail because the people have not forgiven Governor el-Rufai for introducing a Muslim-Muslim ticket in Kaduna.\n“On a good day, in 2023, Muslim-Muslim ticket or Christian-Christian ticket is dead on arrival in Kaduna State,” Asake vowed.\nOn current Muslim-Muslim ticket in Kaduna State, he alleged that Governor el-Rufai brought in the ticket to get in tune with the idea he nurtured as a divisive governor.\nWhen el-Rufai said Christians population were 30 per cent and Muslim 70 per cent on a national television, it was a precursor to introducing Muslim-Muslim ticket.\nTinubu knows that Muslim-Muslim ticket will spell doom for him and APC in 2023”."
  },
  {
    "headline": "Why I’m scared of settling down –Peju Johnson, actress – The Sun Nigeria",
    "summarized_story": "By Rita OkoyeSince actress Peju Johnson made her debut in Nollywood, she has continued to soar like the eagle.\nMost importantly, he must be God fearing because if a man can fear God, the rest is simple.\nIt’s working, working and working without getting paid, all because you’re an upcoming actress.\nI don’t love often.\nBut once I do, I really love the person."
  },
  {
    "headline": "June 12: Kalu advocates youth inclusiveness in politics",
    "summarized_story": "Stressing that democracy has come to stay in Nigeria, Kalu commended the President Muhammadu Buhari-led Federal Government for providing dividends of democracy to Nigerians, adding that the current administration had sustained democratic virtues in all ramifications.\nKalu, while admonishing Nigerians, especially the younger generation, to take active part in the political process, cautioned against violence in politics, noting that politics is not a do-or-die affair.\nThe milestone attained in sustaining democratic process in Nigeria is impressive and encouraging.\n“The political class must live up to expectations by embracing democratic virtues in their endeavours.\n“Politics should be seen as a clarion call to serve the people and not an opportunity for self aggrandisement."
  },
  {
    "headline": "Buhari: We Must Never Forget the Sacrifices of Heroes of Nigeria’s Democracy",
    "summarized_story": "On this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nWe must never forget the sacrifices of the heroes of Nigeria’s democracy during 1993.\nIt is important for all of us to remember that June 12th, 2023 will be exactly 30 years from the 1993 Presidential elections.\nGod bless the Federal Republic of Nigeria• Being an address by President Muhammadu Buhari on the occasion of the commemoration and celebration of Democracy Day 2022Share this: FacebookRedditTwitterPrintPinterestWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "At Democracy Day, Buhari Promises Nigerians Free, Fair, Transparent Elections in 2023",
    "summarized_story": "In a national broadcast this morning to commemorate the celebration of this year’s Democracy Day, President Buhari assured Nigerians of a free, fair and transparent electoral process come 2023, while also pleading with all citizens to come together and work with the government to build a peaceful and prosperous nation.\nPresident Buhari also charged politicians and their followers to run their campaigns with a high sense of maturity and dignity, which had been sustained throughout the various parties’ primaries.\nCommenting on security challenges facing the nation and how they could affect the coming elections, President Buhari said the government was working to contain the issues so that the 2023 elections could be preserved and secure.\n“On June 12, 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nAkeredolu Cancels Democracy Day Celebration over Owo CarnageIn another development, Ondo State Governor, Akeredolu has cancelled the celebration of Democracy Day in the state due to last Sunday’s attack on the St Francis Xavier Catholic Church in Owo."
  },
  {
    "headline": "PDP Moves to Unveil Vice Presidential Candidate on Tuesday as APC Considers New Options",
    "summarized_story": "The leadership of the PDP had after the emergence of Atiku as the presidential candidate of the party set up a high-powered committee to drive a rancour-free emergence of his running mate.\n“Though the leaders of the party believe that the conduct of the unnamed governor is not befitting of a vice presidential candidate, he is being considered because it is believed that he has enormous financial prowess to finance the PDP presidential campaigns.\nThe PDP stakeholders are said to be concerned that the emergence of Senator Rabiu Musa Kwankwaso as the presidential candidate of the New Nigeria Peoples Party (NNPP) would erode APC and PDP votes in the North-west.\nPohu said, “APC is not the only party that has elected a southern candidate; there are other political parties with Southern candidates.\nBut the Kaduna State Governor, Nasir el-Rufai believed that competence should be a major consideration and not religion."
  },
  {
    "headline": "Don’t Present Muslim Running Mates, CAN, Northern Christian Elders Warn Tinubu, Atiku",
    "summarized_story": "But Governor Nasir El-rufai of Kaduna State stressed yesterday that competence should determine his party’s choice of presidential running mate instead of religion.\n“We do not subscribe to Christian/Christian ticket or Muslim/Muslim ticket.\nThose who are planning Muslim/Muslim ticket should also find out what was the outcome of MKO Abiola and Kingibe ticket in 1993.\nIf they try Muslim/Muslim ticket this time around, the outcome will be worse because our fault lines are very visible.\n“Now, extending that consideration to the Muslim-Muslim ticket, I have lived among the Christians and I know that among the Christians, the question of a Muslim-Muslim ticket is a no-go area."
  },
  {
    "headline": "Alleged $50m Fraud/Sale of Assets: Wike Orders Trial of Amaechi, Cole",
    "summarized_story": "The Rivers State Governor had in 2015 set up a Judicial Panel of Inquiry to investigate the activities of the Amaechi administration and the panel thereafter indicted Amaechi, Cole and some others for corruption.\nHowever, analysts are of the view that the drive to prosecute Amaechi and Cole is aimed at making the APC governorship candidate unelectable.\n“Once Cole is put on trial, and obviously will be convicted, his drive to become Rivers State governor ends,” said the analysts.\nLuckily, you came at the right time when we had preferred criminal charges against the former governor (Amaechi), Sahara Energy’s Tonye Cole and the rest of them.\nWike, who spoke during a media parley in Abuja, said the judgement had vindicated the Rivers State Government."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "ISWAP Terrorists Responsible For Ondo State Catholic Church Attack – Nigerian Government",
    "summarized_story": "The Nigerian government says the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād is responsible for the attack on St. Francis Catholic Church, Owo, Ondo State.\nThe Minister of Interior, Rauf Aregbesola disclosed this on Thursday while briefing State House Correspondents after the National Security Council meeting in Abuja.\nThe minister equally noted that the attack had no ethnic-religious connection as he asserted ISWAP activity was unrelated to any religious doctrines.\nSaharaReporters had earlier reported that ISWAP claimed responsibility for an attack on Kabba as the terror group kept moving towards the Southern part of Nigeria.\nThe community is about 95 kilometres and less than two hours to Owo in Ondo State where over 50 worshippers were recently killed during an attack by gunmen on St Francis Catholic Church."
  },
  {
    "headline": "BREAKING: Many Worshippers Killed As Terrorists Attack Ondo Church",
    "summarized_story": "Suspected terrorists have attacked a church in Ondo State, with a yet-to-be-ascertained number of people killed while scores were injured.\nThe incident was said to have occurred at St Francis Catholic Church, Owa-luwa Street, in Owo Local Government Area of Ondo State.\nSaharaReporters gathered that the church is behind Olowo of Owo palace.\nOne of the videos of the incident obtained by SaharaReporters shows that children were also killed in the attack.\nShe also did not reply to a text message sent to her."
  },
  {
    "headline": "BREAKING: Many Worshippers Killed As Terrorists Attack Ondo Church",
    "summarized_story": "Suspected terrorists have attacked a church in Ondo State, with a yet-to-be-ascertained number of people killed while scores were injured.\nThe incident was said to have occurred at St Francis Catholic Church, Owa-luwa Street, in Owo Local Government Area of Ondo State.\nSaharaReporters gathered that the church is behind Olowo of Owo palace.\nOne of the videos of the incident obtained by SaharaReporters shows that children were also killed in the attack.\nShe also did not reply to a text message sent to her."
  },
  {
    "headline": "Gunmen ‘abduct 50 passengers’ along Sokoto-Gusau road",
    "summarized_story": "At least 50 persons have been reportedly abducted by gunmen following an attack on vehicles along Sokoto-Gusau road.\nAccording to Premium Times, the victims were returning from a wedding in Tambuwal, Sokoto state, on Saturday evening, when the gunmen attacked their vehicles.\nThe gunmen were said to have attacked a coaster bus and one other vehicle conveying the wedding guests as well as two private vehicles.\nAdvertisementAccording to him, “we started hearing the sounds of gunshots before the first vehicle was hit”, adding that over 50 people were whisked away.\nAfter we heard the arrival of security men, we came out of the bush and identified ourselves,” Premium Times quoted Ja’o as saying."
  },
  {
    "headline": "Gunmen ‘abduct 50 passengers’ along Sokoto-Gusau road",
    "summarized_story": "At least 50 persons have been reportedly abducted by gunmen following an attack on vehicles along Sokoto-Gusau road.\nAccording to Premium Times, the victims were returning from a wedding in Tambuwal, Sokoto state, on Saturday evening, when the gunmen attacked their vehicles.\nThe gunmen were said to have attacked a coaster bus and one other vehicle conveying the wedding guests as well as two private vehicles.\nAdvertisementAccording to him, “we started hearing the sounds of gunshots before the first vehicle was hit”, adding that over 50 people were whisked away.\nAfter we heard the arrival of security men, we came out of the bush and identified ourselves,” Premium Times quoted Ja’o as saying."
  },
  {
    "headline": "We must ensure 2023 elections are peaceful in honour of Abiola, says Buhari",
    "summarized_story": "President Muhammadu Buhari says Nigerians must ensure that the 2023 elections are peaceful in honour of MKO Abiola, the presumed winner of the 1993 presidential election.\nIn his June 12 commemoration speech, the president said Nigerians must all work together to ensure a smooth transition when his tenure elapses.\nBuhari said he is delighted about the conduct of the presidential primaries across all political parties, adding that this momentum must be sustained in the general election.\nHe asked candidates in the election to be fair and ensure dignity in their dealings with opponents.\nAdvertisement“It is important for all of us to remember that June 12th, 2023 will be exactly 30 years from the 1993 Presidential elections,” he said."
  },
  {
    "headline": "We must ensure 2023 elections are peaceful in honour of Abiola, says Buhari",
    "summarized_story": "President Muhammadu Buhari says Nigerians must ensure that the 2023 elections are peaceful in honour of MKO Abiola, the presumed winner of the 1993 presidential election.\nIn his June 12 commemoration speech, the president said Nigerians must all work together to ensure a smooth transition when his tenure elapses.\nBuhari said he is delighted about the conduct of the presidential primaries across all political parties, adding that this momentum must be sustained in the general election.\nHe asked candidates in the election to be fair and ensure dignity in their dealings with opponents.\nAdvertisement“It is important for all of us to remember that June 12th, 2023 will be exactly 30 years from the 1993 Presidential elections,” he said."
  },
  {
    "headline": "'I live daily in grief, worry' -- Buhari talks pain of insecurity in Democracy Day speech",
    "summarized_story": "President Muhammadu Buhari has expressed his concern over the unabating security challenges being experienced across the country.\nIn a nationwide broadcast to commemorate Democracy Day on Sunday, Buhari said he is living with grief and worry for all those who are victims and prisoners of terrorism and kidnapping.\nThe president said he and the security agencies are working to ensure that all citizens that are in captivity are freed.\nAdvertisement“I am living daily with the grief and worry for all those victims and prisoners of terrorism and kidnapping.\nI and the security agencies are doing all we can to free those unfortunate countrymen and countrywomen safely."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "How Tijan Watt is building a pan-African VC from Dakar",
    "summarized_story": "In 2019, they incorporated Wuri Ventures, and within a year, the duo made 6 investments.\nWuri Venture also provides incubating programs for founders to learn the ropes of the startup world.\nTijan Watt, co-founder and general partner at Wuri Ventures, stands on a makeshift podium to address the guests at the launch event.\nAfter spending a year playing with ideas, he started his own flavoured sugar company in 2002.\nWatt told the abridged version of his entrepreneurial journey, and attempted to sell the crowd on Wuri Venture’s dream, especially its subscription plan, urging them to join Wuri Ventures in building a prosperous Africa one startup at a time."
  },
  {
    "headline": "Moroccan Chari acquires Ivorian B2B e-commerce startup Diago",
    "summarized_story": "Chari, a Moroccan B2B e-commerce and fintech startup, today announced that it has acquired a 100% stake in Diago, an Ivorian app that connects neighborhood shops to FMCG producers and importers.\nThe all-stock transaction was facilitated by AF Legal and RBB International firms, representing Chari, and Houda Law Firm, representing the Ivorian upstart.\nThis acquisition is coming only 3 months after Chari acquired Axa Credit, the credit arm of Axa Assurance Maroc, for $22 million.\nJust last month, a Nigerian autotech startup Autochek travelled up north to acquire Moroccan KIFAL Auto.\nNow, Chari is acquiring a West African startup."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "CVR deadline: You’ll hear from us soon – INEC – Nigerian Observer",
    "summarized_story": "The exercise started on Monday with the deployment of 50 INEC Voter Enrolment Devices (IVED) to capture youths in the CVR, culminated in the concert which featured several youth-inspiring musicians, comedians and celebrities.\n“I know you want to hear from INEC if we are ending the registration on June 30.\nWe have heard you loudly and clearly, You want time until all Nigerians register for PVCs: you will hear from INEC very soon on that.\n“You want to hear from INEC if you register and vote: will your vote count?\nHe encouraged the youths to know that there were reforms within the electoral system that would make their votes to count."
  },
  {
    "headline": "Obaseki mourns passing of music maestro, Osayomore Joseph – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of music maestro, Osayomore Joseph.\nIn a statement, Obaseki, described the late Osayomore as an enigmatic and versatile musician.\nHe was a crucial voice in the quest to make society better and more livable with his music which focused on serious issues.\n“His long music career, which started in the 1970s, was very productive and enriched the lives of many.\nThe boldness and candour enmeshed in his rhythmic melodies earned him local and international acclaim.”“I commiserate with the Osayomore family, fans and friends of the illustrious musician and pray that God will grant all the fortitude to bear this irreparable loss,” Obaseki noted."
  },
  {
    "headline": "2022 Democracy Day: Obaseki tasks on unity, urges Nigerians to uphold ideals of founding fathers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has tasked Nigerians to uphold the ideals of the nation’s founding fathers, who fought assiduously for the realisation of an independent country rooted in the values of justice and equity.\nThe governor, in his 2022 Democracy Day message, urged citizens to recommit to the process of “renewing ourselves and work in unison to make our country live up to its promise as the greatest black nation on earth.”Obaseki said, “As we mark the 2022 Democracy Day, I enjoin Nigerians to uphold the ideals of our nation’s founding fathers, who fought assiduously for the realisation of an independent country rooted in the values of justice and equity.\n“Our democratic sojourn has taught us deep lessons on the centrality of freedom and unity to coexist despite our differences.\n“We are at crossroads, as it appears we are yet to get the full dividend of democracy and feel unsure sometimes of the gains of democracy.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo takes ‘Operation Plan Edo’ to Ohoghobi community, as residents laud govt’s masterplan initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced the Operation Plan Edo exercise in Ohoghobi Community, in Ikpoba-Okha Local Government Area of the state, as part of its ongoing efforts to generate a database to ensure development adheres to the state’s urban and regional development plans.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, while flagging off the exercise, said that the initiative would provide data to ensure equitable distribution of government projects across the state.\nThis is to help the Edo State Government in planning for the community’s needs.\nThis includes the number of schools, roads, access to potable water, electricity, and medical services, among others.\n“The data collected will be collated for the planning of Edo."
  },
  {
    "headline": "Super Eagles arrive Morocco for Nations Cup qualifier against Sao Tome",
    "summarized_story": "Super Eagles players have arrived Morocco ahead of their 2023 Africa Cup of Nations qualifying encounter against the Falcons of Sao Tome and Principe.\nThe players and officials of the team who departed for Morocco via the Nnamdi Azikiwe International Airport, Abuja, at about 12:44 a.m. (Sunday morning) have since arrived and will train Sunday evening.\nThe Jose Peseiro coached side will train inside the Adrar Stadium, Agadir, Morocco at 4pm after the team’s pre-match press conference scheduled for 1.30 p.m.Nigeria, three-time African champions, will slug it out against Sao Tome and Príncipe on Monday as the Eagles press on in their quest to qualify for next year’s Africa Cup of Nations billed to take place in Cote D’Ivoire.\nIn their opening match in the qualifying campaign, the Super Eagles got off to a positive start as they came from behind to beat Sierra Leone 2-1 on Thursday at the MKO Abiola Stadium, Abuja.\nFor São Tomé and Principe, it was not the best of starts in the qualifiers as they were hammered 5-1 by Guinea-Bissau."
  },
  {
    "headline": "Ebonyi 2023: PDP guber candidate, Odii flays Ogba’s ‘false’ claims, seeks unity ahead of polls",
    "summarized_story": "Meanwhile, a federal high court sitting in Abakaliki, had on Tuesday, June 7, nullified the rescheduled primary election, which was boycotted by ad-hoc party delegates, pronouncing it illegal, unconstitutional, null and void.\nAddressing Ogba’s claims in a statement on Sunday by its director of media and publicity, Abia Onyike, the AnyiChucks Campaign Organization maintained that the Lagos-based industrialist is the only PDP governorship candidate whose name has since been submitted to the Independent National Electoral Commission (INEC).\n“The PDP Governorship Candidate today is Dr Ifeanyi Chukwuma Odi.\nHe won the Primary Election conducted by the PDP on 28 and 29 of May, 2022.\nThe 3-man Delegates List used for the Primary Election was the outcome of the State PDP Congress of 7th May, 2022 which was eventually recognised by the PDP National Working Committee(NWC)."
  },
  {
    "headline": "Democracy Day: Buhari assures citizens of protection from enemies- Full Speech",
    "summarized_story": "Full Speech Below:Fellow Nigerians, Today, June the 12th, marks another Democracy Day anniversary and an occasion to celebrate freedom and unity of our nation.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nFellow Nigerians this is my last Democracy Day speech as your President.\nGod bless the Federal Republic of Nigeria• Being an address by President Muhammadu Buhari on the occasion of the commemoration and celebration of Democracy Day 2022"
  },
  {
    "headline": "MultiChoice subscriber base reaches 21.8m households",
    "summarized_story": "The MultiChoice Group has released its financial results for the year ended March 31, 2022.\nThe results show that the group’s linear pay-TV subscriber base (measured on a 90-day active basis) increased by 0.9 million to reach 21.8 million households, comprising 9 million in South Africa and 12.8 million in the Rest of Africa (RoA), led by Nigeria.\nThe Group said the 5% growth year-on-year (YoY) is subdued due to the tough economic environment and elevated subscriber growth during COVID-19-related lockdowns in the previous year.\nMore specifically, the year ahead will see the group increasing its investment in local content, targeting an allocation of 50% of total general entertainment spend by FY24,” he added.\nThe company adds that the Rest of Africa (RoA) business benefited from the popularity of local content such as Big Brother Naija and live sporting events."
  },
  {
    "headline": "Justin Bieber illness video heartbreaking, says UK patient with same condition",
    "summarized_story": "“I’ve watched his video and I’m not going to lie, I shed a couple of tears.\nI never thought that I would relate to someone so much that I didn’t know,” Nicoya Rescorla told Reuters.\nFormer teen star Bieber, 28, disclosed on Friday that he had been diagnosed with a virus that left half of his face paralysed and forced him to cancel some upcoming performances.\n“I think personally for me stress was a huge factor, a huge factor,” said Rescorla, who is also 28 and has three children.\nObviously, Justin Bieber … he’s a huge celebrity, and I also felt so proud that he was spreading awareness of Ramsay Hunt syndrome."
  },
  {
    "headline": "12 Ga Yun,i Sam Bata Dace Da Ranar Dimokradiyyah Ba A Nijeriya —Ra’ayin Najib Sani",
    "summarized_story": ""
  },
  {
    "headline": "12 Ga Yuni: Muhimman Abubuwan Da Buhari Ya Fada A Jawabinsa Na Ranar Dimokuradiyya",
    "summarized_story": ""
  },
  {
    "headline": "2023: An Bukaci Tinubu Ya Dora Kan Irin Salon Mulkin Buhari Kwabo Da Kwabo",
    "summarized_story": ""
  },
  {
    "headline": "12 Ga Yuni: Atiku, Tinubu Da Obi Da Ragowar Wasu Za Su Sanya Furanni A Kabarin Abiola",
    "summarized_story": ""
  },
  {
    "headline": "‘Yan Majalisar APC Takwas Sun Sauya Sheka Zuwa PDP A Jihar Kebbi",
    "summarized_story": ""
  },
  {
    "headline": "2023: SERAP asks Atiku, Tinubu, Obi, others to publish assets",
    "summarized_story": "“It would also show that you would be accountable to the public for your actions and submit yourself to the scrutiny necessary to ensure this.\n“Widely publishing your assets before the elections would also show your principled stand on transparency and accountability in the management of the country’s resources.\nIf leaders are seen to live beyond their means, an asset declaration can be a starting point for investigations.\n“Impunity for corruption and grave human rights violations is widely prevalent in Nigeria, as perpetrators are rarely brought to justice.\nIn fact, the misuse and embezzlement of public funds in the name of security votes is widely recognized as a major cause of the ongoing security challenges in several parts of the country."
  },
  {
    "headline": "NDLEA sends warning to intending Hajj pilgrims",
    "summarized_story": "The NDLEA on Sunday warned intending Hajj pilgrims against drug trafficking.\nHajia Habiba Zubair, an official of the agency gave the warning in Ilorin while addressing those traveling to Saudi Arabia to perform the 2022 Hajj.\nShe warned that pilgrims could take only prescription drugs to Saudi Arabia as the government there would not tolerate anything outside that.\nZubair also admonished the pilgrims not to take kola nuts or ground pepper to Saudi Arabia as they would be confiscated.\nThe NDLEA official also told the intending pilgrims to always wear the state’s uniform while in Saudi Arabia for easy identification."
  },
  {
    "headline": "Running Mate: Tinubu’s Men Rule Out Lalong, SGF, Consider Shettima, Ganduje, El-Rufai",
    "summarized_story": "One of those involved in the consultation for Tinubu’s running mate pointed out that the party might settle for a Muslim-Muslim ticket.\nShettima is a strong supporter of the APC candidate and he spoke out in Tinubu’s defence after his Abeokuta outburst.\nI want you to pay attention to my state and also consider my principal, Senator Shettima, as your running mate.\nThe same set of people should be able to decide who will be the running mate.\n“We will pick the best (running mate) for our party who can deliver the election for us; they should allow the people to decide what they want.”(PUNCH)"
  },
  {
    "headline": "BREAKING: Terrorists Release 11 Kidnapped Train Passengers",
    "summarized_story": "The terrorists freed 11 kidnapped train passengers on Saturday after intense discussions between the FG and the terrorists, according to Malam Tukur Mamu, Sheikh Ahmad Gumi’s communications consultant.\nAccording to him, the 11 victims who were released were transported to Abuja on President Buhari’s orders for medical evaluation and treatment before being reunited with their bereaved relatives.\nSome retired Army Generals and a well-known academic, he claims, also assisted in the passengers’ release.\nDetails later…"
  },
  {
    "headline": "Alleged N2bn Fraud: Pastor, Wife Sue As EFCC Declares Them Wanted",
    "summarized_story": "Pastor Oyinmiebi Bribena, the President of Baraza Multipurpose Cooperative Society Limited (BMCSL), and his wife, Beatrice, say that the Economic and Financial Crimes Commission (EFCC) never invited them for questioning or interrogation before declaring them wanted.\nThe EFCC’s Head of Media and Publicity, Wilson Uwujaren, issued a statement declaring the pair wanted for allegedly scamming Nigerians of N2 billion.\nHe had requested answers to some queries about the EFCC’s abilities to intervene in conflicts between cooperative society members, based on the terms of the Nigerian Cooperative Societies Act of 2004.\nReacting to the declaration, Bribena, who is also pastor in a popular church, stated: “We did not receive any invitation letter from the EFCC and were not aware of any summons or pending charge against us by the EFCC.\nBribena, who assured contributors that all hope was not lost, stated that he would not relent in the efforts being made to clear his name."
  },
  {
    "headline": "Sanwo-Olu has abandoned governance for Tinubu’s campaign -Adegboruwa",
    "summarized_story": "Adegboruwa, who was one of the members of the Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS-Related Abuses, warned the governor on spending the state’s resources on Tinubu’s campaign.\n“Since the declaration of the presidential aspiration of Asiwaju Bola Ahmed Tinubu, Governor Babajide Sanwoolu has abandoned governance in Lagos State.\nNine aspirants had earlier stepped down, eight of whom asked their supporters to vote for Tinubu, while one asked his supporters to vote for Osinbajo.\nThose who stepped down before voting began are Governor Abubakar Badaru of Jigawa, Robert Boroffice, Ken Nnamani, Ibikunle Amosun, Dimeji Bankole, Ekiti State Governor Kayode Fayemi and Godswill Akpabio.\nPastor Felix Nicholas, the United States of America-based aspirant also stepped down and asked his supporters to vote for Osinbajo."
  },
  {
    "headline": "Buhari reveals how FG is tackling insecurity, other talking points from President’s Democracy Day speech *Read full address",
    "summarized_story": "I ask all citizens to support and cooperate with our security agencies by reporting any suspicious characters and activities to law enforcement agencies.\nI and the security agencies are doing all we can to free those unfortunate countrymen and countrywomen safely.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nI ask all citizens to support and cooperate with our security agencies by reporting any suspicious characters and activities to law enforcement agencies.\nI and the security agencies are doing all we can to free those unfortunate countrymen and countrywomen safely."
  },
  {
    "headline": "Breaking: Buhari vows peaceful, transparent process ahead 2023 presidential election in Democracy Day message",
    "summarized_story": "Ahead of the 2023 presidential election, President Muhammadu Buhari said Sunday that he remains committed and determined to ensure that the new President is elected through a peaceful and transparent process.\nThe President said this in a nationwide broadcast to mark this year’s Democracy Day anniversary in honour of the presumed winner of the June 12, 1993, presidential election, Chief Moshood Kashimawo Abiola.\nI remain committed and determined to ensure that the new President is elected through a peaceful and transparent process.\n“As we move into the general election campaign season, we must sustain this mature attitude to campaigning and ultimately, voting.\n“On June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully."
  },
  {
    "headline": "Terrorists release 11 kidnapped Abuja-Kaduna train passengers *See full names",
    "summarized_story": "After many weeks, terrorists have released 11 out of 61 kidnapped passengers on Abuja-Kaduna train.\nThe attack on the train happened on March 28, 2022.\nAmong those who regained their freedom are six females and five males who have now been flown to the nation’s capital, Abuja.\nThey are Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari and Hannah Ajewole.\nHe further explained that the 11 victims were freed on health grounds in order to enable them undergo urgent medical treatment."
  },
  {
    "headline": "FIRS Pledges Collaboration with KW-IRS on Improved Revenue Generation",
    "summarized_story": "By Kayode AbdulazeezFederal Inland Revenue Service (FIRS) has pledged to collaborate with the Kwara State Internal Revenue Service (KW-IRS) to improve revenue generation in the state.\nThe FIRS official also said that the courtesy visit was aimed at strengthening the long-standing institutional relationship between FIRS and KW-IRS.\nAdama, who applauded the data-sharing liaison between both revenue agencies, pledged continual collaboration in ensuring eligible taxpayers in the State are adequately and appropriately captured into the tax net.\nThe team also discussed several areas of interest and concerns as they relate to revenue enhancement for Kwara State.\nAlso speaking, the Executive Chairman, KW-IRS, Shade Omoniyi, commended FIRS for the support towards achieving seamless tax administration."
  },
  {
    "headline": "NBC Celebrates DG Ilelah as he marks one year in office",
    "summarized_story": "By Friday ObandeAs he marks one year in office, the Management and Staff of National Broadcasting Commission, have felicitated with Director General of the commission, Mallam Balarabe Shehu Ilelah.\nIn a congratulatory message by the commission’s management, it said Ilelah, has on assumption in office, brought his wealth of experience into the running of the NBC.\nAlso, in the course of carrying out the commission’s regulatory functions, the management noted that the DG has continued to stress on professionalism on the part of broadcasters.\nThe Director General implored Broadcasters to engender the unity, peace and progress of our dear country,” they added.\nIlelah, a veteran international broadcaster, was appointed DG of the commission on June 7, 2021 by President Muhamadu Buhari."
  },
  {
    "headline": "Jos Disco urges BIRS to unseal office",
    "summarized_story": "By Sunday Ogli, MakurdiManagement of Jos Electricity Distribution, JED, Plc, has called on the Management of BIRS to swap its tax liability by deducting it from the state government’s indebtedness to the company.\nBenue State Government is indebted to Jos Disco as at 31st December, 2021 to the tune of ₦157,943,414.14 million while Jos Disco owes state’s tax agency; BIRS ₦156,515,414.47 million.\nHowever, BIRS, as a result of the debt, sealed off the operational office of Jos Disco in Gboko and Makurdi on Wednesday.\n“This could be gleaned from several correspondences and meetings to this effect”, the press release stated.\nDr Elijah further disclosed that to resolve the impasse, the two bodies had mandated their tax consultants to ascertain the true situation of things."
  },
  {
    "headline": "NACC urges Nigerian exporters to take advantage of AGOA",
    "summarized_story": "Nigerian American Chamber of Commerce (NACC) Abuja Chapter has called on all Shippers to take advantage of the window provided by the African Growth and Opportunity Act (AGOA) Programme to boost trade between Nigeria and the United States of AmericaThe Executive Secretary of NACC Abuja Chapter, Mr. Ayo Salaam disclosed that Nigerian companies have not taken advantage of the AGOA because they export mainly oil to the United States.\nThe AGOA forum is one of the key components of U.S African strategy that focuses on increasing the United States Trade and Investment in Africa as a mechanism for job creation within the continent.\n“The AGOA project initiated by the United States of America in 2000 was to help develop trade and facilitate exporting over 6000 goods into America with no tariff.\nSpeaking at the event, a diplomat, Ambassador Bayo Idowu, encouraged all shippers to leverage on the AGOA partnership.\n“We are readily available to provide assistance and advice on how Nigerian products can be accepted in the American market."
  },
  {
    "headline": "NDE uplifts 630 Anambra youths on vocational skills",
    "summarized_story": "Tony Oraeki, AwkaThe National Directorate of Employment, NDE, has commenced the training of 630 unemployed youths in Anambra state on various vocational skills.\nThe training would be on two categories which are Basic National Open Apprenticeship Scheme, B-NOAS, and Advanced National Open Apprenticeship Scheme, A-NOAS, with 420 and 210 beneficiaries respectively.\nAddressing the beneficiaries at the orientation ceremony in Awka yesterday, the NDE State Coordinator, Mrs. Chika Ufelle said that B-NOAS is a scheme through which the unemployed youths both male and female are recruited to acquire marketable vocational skills for decent job opportunities.\nShe also said the trainees under A-NOAS are designed for artisans who graduated from B-NOAS with an aim to upgrade their skills to higher levels of competence.\n” I very much appreciate the effort of NDE to avail me this opportunity to be trained in Computer Appreciation.” She said."
  },
  {
    "headline": "Full Text: Buhari Speaks About Honouring MKO, 2023 Elections, Victims Of Terrorism In Last Democracy Day Broadcast – Channels Television",
    "summarized_story": "On this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nIn 2018, we moved Democracy Day from 29th of May to the 12th of June.\nFellow Nigerians this is my last Democracy Day speech as your President.\nBy June 12th, 2023, exactly one year from today, you will already have a new President.\nIt is important for all of us to remember that June 12th, 2023 will be exactly 30 years from the 1993 Presidential elections."
  },
  {
    "headline": "We Must Ensure A Peaceful Transition Of Power To Honour MKO Abiola – Buhari",
    "summarized_story": "﻿It is important to ensure a peaceful transition of power in 2023 in honour of the late M.K.O.\nAbiola, President Muhammadu Buhari said on Sunday.\n“It is important for all of us to remember that June 12, 2023 will be exactly 30 years from the 1993 presidential elections,” President Buhari stated.\n“In honour and memory of one of our national heroes of democracy, Chief M.K.O Abiola, GCFR, we must all work together to ensure this transition is done in a peaceful manner.\nPresident Buhari added that while those who lost were gracious in defeat, the aggrieved ones opted to seek judicial justice as opposed to jungle justice."
  },
  {
    "headline": "Senate President Advocates Equity, Fairness, Justice On Democracy Day",
    "summarized_story": "The Senate President, Ahmad Lawan, has called on Nigerians to focus on building the nation with the bricks of equity, fairness, and justice.\nIn his Democracy Day message on Sunday, he explained that such qualities were important to help the nation withstand challenges as they may come.\nLawan stated that it would be the fourth time Nigeria would celebrate the day on June 12 since President Muhammadu Buhari made the change from May 29.\nHe described democracy as a process that required popular participation, tolerance of the views and rights of others, and the spirit of sportsmanship for its sustenance.\nRead the full text of Lawan’s Democracy Day message below:"
  },
  {
    "headline": "Democracy Day: Buhari Assures Nigerians Of Peaceful, Transparent 2023 Elections",
    "summarized_story": "President Muhammadu Buhari has assured Nigerians of a peaceful and transparent process of electing a new leader when the people go to the polls next year.\nHe gave the assurance on Sunday while addressing the nation as part of activities lined up to commemorate this year’s Democracy Day.\n“I remain committed and determined to ensure that a new president is elected through a peaceful and transparent process,” he said.\nHe, however, stressed the need to ensure a peaceful transition of power in 2023 in honour of the late M.K.O.\nPresident Buhari appealed to the electorate to ensure that Abiola’s sacrifices and that of other heroes of democracy were not allowed to go in vain."
  },
  {
    "headline": "Peace, Prosperity Shall Outlast Violence, Poverty – Tinubu Assures Nigerians",
    "summarized_story": "The presidential candidate of the All Progressives Congress (APC), Bola Tinubu, has asked Nigerians not to lose faith in the nation as it will surely overcome its challenges.\nIn his Democracy Day message on Sunday, he assured them that just like democracy finally won against dictatorship, prosperity shall overcome poverty, peace shall outlast violence, compassion will conquer hatred, and good will defeat evil.\nHe added that the spirit of June 12 would expand to become the spirit of Nigeria and the people’s national greatness and destiny.\nHe relived the events of the 1993 presidential election which he said showed Nigerians were capable of democratic excellence and conducting elections as good as anywhere else on earth.\nAccording to Tinubu, late MKO Abiola won a truly national mandate, and his victory shows Nigeria’s unity is not an impractical dream."
  },
  {
    "headline": "Full text of President Buhari's 2022 Democracy Day Speech",
    "summarized_story": "He made this remark on Sunday during a statewide broadcast to mark this year’s democracy day celebration.\nRead the full text belowTHIS DEMOCRACY DAY, 2022 SPEECH IS RELEASED TO YOU STRICTLY UNDER EMBARGO UNTIL 7.30 AM, JUNE 12, 2022 AFTER THE PRESIDENT HAS READ IT.\nOn this day, Nigerians recommit themselves to ensuring we protect and preserve the ideals of democracy.\nOn June 12th 1993, Nigerians saw the best in our citizens as we all went out to vote peacefully.\nFellow Nigerians this is my last Democracy Day speech as your President."
  },
  {
    "headline": "Tinubu visits Lawan, Okorocha, Nnamani, Jack Rich, seeks collaborations -",
    "summarized_story": "Presidential candidate of the All Progressives Congress, Asiwaju Bola Tinubu has visited more aspirants of the party’s primary that produced him as the flagbearer.\nThe former governor of Lagos continued the consultation as he visited Senate President, Ahmed Lawan, former Governor of Imo State, Rochas Okorocha, former Senate President Ken Nnamani and Jack Rich.\nHe said the visit is to seek collaborations from the aspirants in the interest of building the party and the nation.\nAll the aspirants visited promised to support Asiwaju tinubu to ensure victory for the party in the 2023 elections."
  },
  {
    "headline": "Two shot, one feared killed as APC, SDP supporters clash in Ekiti -",
    "summarized_story": "At least two persons have been reportedly shot on Saturday in Itaji Ekiti, Oye local Government area of Ekiti state during a Political rally ahead of the June 18 Governorship ElectionAccording to an eye-witness, trouble started when suspected Political thugs attacked the campaign train of the Governorship candidate of the Social democratic party, Segun Oni, even though it is not yet clear what transpired before the altercationsA chieftain of the Social Democratic party, Bimbo Daramola who was on the campaign train of the SDP Candidate, accused certain interest groups in the state of interfering in a Peaceful campaign by opening Fire on SupportersReacting, the Governorship candidate of the APC, Biodun Oyebanji ,condemned violence in all forms and appealed to his supporters to exercise refrain in the face of Provocation.\nThe Police Public Relations officer in Ekiti State Sunday Abutu confirmed the incidence of violence however could not confirm if anyone was killed at the time of Filing this report and Says normalcy has since returned to the area."
  },
  {
    "headline": "Democracy Day: Nigeria on pathway to greatness, says Lagos Speaker -",
    "summarized_story": "The Speaker of the Lagos State House of Assembly, Mudashiru Obasa, has described Nigeria as a country currently on a track to greatness just as he urged the citizens to play active roles for this to be fully achieved.\nDr. Obasa said this in a statement at the weekend to commemorate Nigeria’s Democracy Day which coincides with the 29th anniversary of the June 12, 1993 elections claimed to have been won by the late Chief Moshood Abiola.\nAccording to the Speaker, Nigeria had, since 1999, experienced what could best be described as the teething stage of its democratic journey with the need for unity taking the centre-stage of public discourse.\n“History will forever be kind to those who made Nigeria’s democracy possible.\n“We are honoured to be the current bearers of the baton of democracy and we look forward to upholding the labour of these heroes.”"
  },
  {
    "headline": "Nigeria: University Students Lament as Lecturers’ Strike Enters Fourth Month",
    "summarized_story": "Some students of Nigerian public universities have expressed frustration over the lingering strike by the Academic Staff Union of Universities (ASUU).\nA third-year student of the University of Port Harcourt, Greatness Nnamdi, who is studying gas engineering, said that the ongoing strike was impacting negatively on the plans of Nigerian students.\nNwafor expressed displeasure at the ongoing strike, saying that the action was leading some students into crime.\nASUU Chairman at the Abia State University, Mr. victor Nkemdirim, attributed the strike to the non-revitalisation of public universities in the country.\nNkemdirim said if not for ASUU’s continued struggles, most of the states and federal universities would have gone under by now."
  },
  {
    "headline": "Nigeria’s 2023 Elections Can’t Be Rigged, INEC Says as It Considers Voter Registration Extention",
    "summarized_story": "He debunked the claim that the Permanent Voters’ Cards (PVCs) would expire, clarifying that the PVCs have no expiry date.\nOn the fears being expressed in certain quarters that elections could be rigged, the INEC Chairman said the commission would do everything in its power to protect the sanctity of the ballot.\n“The best way to protect the sanctity of the ballot is what happens at the polling unit.\nYou can’t go to the polling unit on election day and say – here I come INEC, I’ve registered.\nYakubu also debunked another rumour that the PVCs would expire, insisting that the PVCs have no expiration date."
  },
  {
    "headline": "CBN Unveils Plans to Introduce USSD Code to Improve eNaira",
    "summarized_story": "The Central Bank of Nigeria (CBN) has said it is set to introduce the Unstructured Supplementary Service Data (USSD) code as part of steps to improve the Central Bank Digital Currency (CBDC).\nObiora said the introduction of the USSD code became necessary to improve financial inclusion in the country and to ensure people without smartphones could still transact on the eNaira platform.\nHe said that the CBDC had significant benefits for Nigeria, which was why the CBN decided to introduce it.\nThe report stated that the total RSA Transfer was 7,663, which was concluded in the first week of April 2022.\n“This covered RSA transfer requests, submitted by PFAs between January 1, and March 31, which were eligible for RSA transfer in the first quarter of 2022."
  },
  {
    "headline": "Religion Should Not Be a Factor in Choosing VP Candidate, Say APC Chieftains",
    "summarized_story": "Some chieftains of the ruling All Progressives Congress, have argued that religion should not be a factor in the consideration of the party’s vice-presidential candidate.\nBut the Kaduna State Governor, Nasir el-Rufai believed that competence should be a major consideration and not religion.\nA National Vice Chairman of the party, Dr Salihu Lukman, in a statement issued Saturday said kicking against the Muslim-Muslim ticket was a backward national mindset, which must be changed.\nOn his part, former National Vice Chairman of APC, South-south, Hilliard Etta, said he did not predicate his politics on religion or ethnic consideration.\nIn his contribution, the former Deputy National Publicity Secretary of the party, Yekini Nabena, stated that the important factor is the personality involved and not his religion."
  },
  {
    "headline": "Nigeria: Delta Governor Okowa Tops List as PDP Moves to Unveil VP Candidate on Tuesday, APC Considers New Options",
    "summarized_story": "Barring any last-minute changes, the Peoples Democratic Party (PDP) and its vice presidential candidate, former Vice President Atiku Abubakar will on Tuesday unveil the party’s vice-presidential candidate for the 2023 general election, THISDAY has learnt.\nSome chieftains of the ruling APC have argued that religion should not be a factor in determining the party’s vice-presidential ticket.\nThe governor is unfit for the job and that is why Okowa is at the top of the list,” the source added.\nThe PDP stakeholders are said to be concerned that the emergence of Senator Rabiu Musa Kwankwaso as the presidential candidate of the New Nigeria Peoples Party (NNPP) would erode APC and PDP votes in the North-west.\nPohu said, “APC is not the only party that has elected a southern candidate; there are other political parties with Southern candidates."
  }
]