[
  {
    "headline": "Killings: IG reads the Riot Act to commanders in Anambra",
    "summarized_story": "THE Inspector-General of Police, Usman Baba, has ordered Police Mobile Force commanders to deal ruthlessly with political thugs, who may work against a transparent and credible governorship election in Anambra State.\nThe police chief also read the riot act to squadron commanders, vowing to deal decisively with any commander that lacked command capacity or failed to key into the reform agenda of his administration.\nElements of the outlawed Indigenous People of Biafra had vowed not to allow the November 6 governorship election to hold in the state.\nOn Tuesday, armed men attacked the All Progressives Grand Alliance campaign rally in the state during which a soldier was reportedly killed.\nBut speaking at a meeting with Police Mobile Force Squadron Commanders in Abuja on Wednesday, the IG said the election security action plan would revolve around the police mobile units."
  },
  {
    "headline": "Buhari receives defected Anambra deputy governor in Aso Villa",
    "summarized_story": "), on Wednesday received the Deputy Governor of Anambra State, Nkem Okeke, at the Presidential Villa, Abuja.\nOkeke was presented to Buhari by the APC Caretaker Committee Chairman, who is also the Governor of Yobe State, Mai Mala Buni, alongside the Chairman of APC Campaign Organisation for the November 6 governorship election in Anambra State and Governor of Imo State, Hope Uzodimma.\nUzodimma, who spoke to State House Correspondents after the meeting confirmed that the deputy governor of Anambra state had joined the APC.\nHe expressed optimism that the APC would win the November 6 governorship election in Anambra State because of what the President has done for the South-East zone.\n“Just this afternoon, the Deputy Governor of Anambra State joined the APC and has been presented to the President."
  },
  {
    "headline": "ABCON advocates measures to curb naira depreciation",
    "summarized_story": "By Babajide KomolafeTo address the continued depreciation of the naira in the parallel market, the Association of Bureaux De Change Operators of Nigeria (ABCON) has called on the Central Bank of Nigeria (CBN) to restructure the BDC sub-sector.\n“The refined outfits can effectively operate on independent transparent platforms dealing in autonomous funds in the economy.\nThey should be permitted to operate as a fully independent foreign exchange professional under the best practices in international foreign exchange operations.\nMedium scale dealers in foreign exchange should be permitted to operate a lower platform to the Investors and Exporters (I&E) market under a transparent clearing house modalities.\n“The market or platform will compete for funds in the global foreign exchange market thereby deriving a merger and stability in exchange rate in the economy."
  },
  {
    "headline": "Nigeria’s rig count rises 20.8% to 29 in Q3’21",
    "summarized_story": "*As OPEC puts oil output at 1.2 mb/dBy Udeme AkpanNIGERIA’s rig count, a global index for measuring activities in the upstream sector, has increased by 20.8 per cent Year-on-Year, YoY, to 29 in the third quarter 2021(Q3’21) from 24 recorded in the corresponding period of 2020, according to the reports of the Organisation of Petroleum Exporting Countries, OPEC.\nHowever, when data obtained from indirect sources were considered, the organization, which has already increased Nigeria’s quota to 1.8 mb/d from 2022, puts the nation’s output at 1.271 mb/d.\nIn the budget presentation to the National Assembly, President Muhammadu Buhari had said: “The 2022 to 2024 Medium Term Expenditure Framework and Fiscal Strategy Paper sets out the parameters for the 2022 Budget.\n“Based on these fiscal assumptions and parameters, total federally-collectible revenue is estimated at N17.70 trillion in 2022.\n“Total federally distributable revenue is estimated at N12.72 trillion in 2022 while total revenue available to fund the 2022 Federal Budget is estimated at N10.13 trillion."
  },
  {
    "headline": "Gov Emmanuel’s health care investments critical to national security, citizens welfare — Ex-President Jonathan",
    "summarized_story": "We have to commend Governor Udom Emmanuel because health is key and whenever you talk about national security, the health security aspect is quite prominent.\nWe are grateful that former President Goodluck Jonathan consented to help commission this project, phase 1 of our reconstructed General Hospital, Ikot Ekpene”.\nNsikak Ekong, and the Chairman of Ikot Ekpene, Hon.\nUyime Etim, thanked Governor Emmanuel for revisiting the 117-year-old health facility, giving it modern equipment and personnel that will serve the people.\nHe thanked Governor Emmanuel for renovating and refurbishing nine General Hospitals in the state including the provision of manpower in the hospitals."
  },
  {
    "headline": "TUC tasks shipping companies on improved workers’ welfare",
    "summarized_story": "By Godfrey Bivbere & Prisca AchonuThe Trade Union Congress, TUC, Monday visited some shipping companies in Lagos where it tasked the management of these companies to improve the welfare of their workers.\nDuring the visit, the President of the TUC, Quadri Olaleye, urged shipping companies to pay more attention to the welfare of their members.\nREAD ALSO:Reps want oil benchmark at US$60 per barrelHe charged the management of the shipping companies to expand their operations to create room for more employment opportunities for Nigerians.\nHe stated: “Expansion means the creation of opportunities in different organisations for the employment of more workers thereby providing more job opportunities for individuals who will in turn result to an expansion in the businesses.\n‘‘It is not the responsibility of the Government to create job opportunities, the responsibility of the Government is to provide an enabling environment that will aid the creation of these job opportunities by these companies”."
  },
  {
    "headline": "Ember months: FG to spend N75.8bn on road rehabilitation",
    "summarized_story": "READ ALSO:2022 Budget Debate: N3.9trn for debt servicing worrisome – RepsThose who attended the stakeholders’ meeting include the representatives from the National Road Transport Owners, NARTO, National Union of Petroleum and Natural Gas Workers, NUPENG, National Union of Road Transport Workers, NURTW, Federal Road Safety Corps, FRSC.\nFederal Road Maintenance Agency, FERMA, and contractor handling the various road projects in the country, where they are promised to fix failed portions of critical roads across the Federation.\nHe hinted that there is need for urgent palliative works on such roads to avoid further deterioration, adding that such roads were identified.\nAccording to him, the total cost for the repair works is estimated to cost N75,765,087,178.28 to carry out palliative works on those road.\n“I want to appeal to road users, NUPENG, NATO, NURTW and FRSC that we have to works together."
  },
  {
    "headline": "Nigeria, Germany sign agreement on return of 1,130 Benin bronzes",
    "summarized_story": "Nigeria and Germany have signed a Memorandum of Understanding (MoU) for the repatriation of hundreds of Benin bronzes from 2022.\nNigeria is expecting about 1,130 pieces of artifacts from the world power.\nMohammed said a team of experts will leave Nigeria soon to engage with stakeholders in Germany on the return of the artifacts.\n“The return of the artifacts will further cementrelationship between Nigeria and Germany.\nOn the delegation were Director of the Museum at Rothenbaum, Prof. Barbara Plankensteiner; President, Prussian Cultural Heritage Foundation, Prof. Hermann Parzinger and German Ambassador to Nigeria, Birgitt Ory."
  },
  {
    "headline": "COVID-19: World Bank provides 250m doses, says 100m people in poverty",
    "summarized_story": "The World Bank is providing 250 million doses of COVID-19 vaccine with Bank financing, Group President David Malpass announced.\nThe meetings will discuss a range of development issues including the economic outlook, growth, vaccines, debt, climate, trade, among others.\nMalpass noted that the world is suffering from a dramatically uneven recovery while Inequality is worsening across countries.\nThere’s high inflation, there’s too few jobs, there’s shortages that extend to food, water, and electricity”, he observed.\nThese disruptions are placing sharp price increases on shipping fees, and the final costs of goods.”The World Bank chief lamented that the COVID-19 outbreak already pushed nearly 100 million people into extreme poverty."
  },
  {
    "headline": "Nnamdi Kanu: IPOB agitation politicised, Igbos no longer obey sit-at-home – Uzodinma",
    "summarized_story": "Governor Hope Uzodinma of Imo State has said the agitation by the proscribed Indigenous People of Biafra (IPOB) has been politicised.\nUzodinma also insisted that the sit-at-home order by IPOB has been politicized.\nThe governor also noted that people of the Southeast are no longer obeying the sit-at-home order.\n“The sit-at-home order is also being politicised because those issuing the order are faceless.\n“As I speak to you, the sit-at-home order is not being obeyed in Imo state.”"
  },
  {
    "headline": "Abia Govt to honour ex-Imo, Lagos Military Gov, Ndubuisi Kanu as Ikpeazu mourns",
    "summarized_story": "DAILY POST reported that the retired Rear Admiral, Ndubuisi Kanu passed away at the age of 78 after a brief illness and hailed from Isiukwato Local government area of Abia state.\nMeanwhile, Governor Okezie Ikpeazu, has expressed sadness on the passage of the ex-military Governor, Rear Admiral Ndubuisi Kanu (Rtd).\nHe described the death of Kanu as a huge loss to the people of Abia State and Nigeria as a whole.\n“Upon his retirement from the military, Kanu immersed himself in pro-democracy struggles and made massive contributions to the fight for the enthronement of democracy in our country through his involvement with NADECO.\n“The Late Rear Admiral Ndubuisi Kanu never forgot his roots and made solid contributions to the political development of Abia, his home state."
  },
  {
    "headline": "MBA Forex: Investors stage fresh protest in Port Harcourt",
    "summarized_story": "Aggrieved investors of MBA forex on Tuesday staged a fresh protest in Port Harcourt, the Rivers State capital.\nThis time, the protesters marched to the palace of the paramount ruler of Elekahia community, His Royal Highness A.W Akarolo, where the CEO of MBA forex, Maxwell Odum hailed from.\nSpeaking earlier, the paramount ruler of Elekahia community expressed commitment to ensuring that the matter will be dealt with.\nDAILYPOST gathered that over 40,000 of the 125, 000 investors in the MBA Forex are resident in Rivers State.\nThe latest protest is one of a series of protests that have been embarked on by the investors against the scheme."
  },
  {
    "headline": "Public Complaint Commission urges EFCC to investigate ponzi schemes",
    "summarized_story": "The Public Complaint Commission (PCC) on Wednesday called on the Economic and Financial Crimes Commission (EFCC) to investigate the activities of ponzi scheme operators in the country.\nHe said: “The issue of the ponzi scheme is a perennial problem in Nigeria and Rivers state in particular which EFCC should urgently save the situation.\n- Advertisement -“The EFCC should be more drastic in handling the operators as Nigerians are groaning under the yoke of fraudulent practices of ponzi scheme operators,” he said.\nResponding, Naibi restated the commitment of the EFCC to finding practical solutions to tackling the menace of ponzi scheme operations in the country.\n“The EFCC is taking the ponzi scheme very seriously, and as such, I can assure you that we are working frantically on it."
  },
  {
    "headline": "Okonjo-Iweala to Fed Govt: cut trade, infrastructure costs",
    "summarized_story": "For Nigeria to attract more investors, it must cut down on trade and infrastructure costs, Director General of the World Trade Organization (WTO) Ngozi Okonjo-Iweala, has advised.\n”To complement investment facilitation, Nigeria has to cut down on trade cost, infrastructure cost, linkage cost, regulatory cost, customs cost, basically, all costs associated with moving goods from tie factory or farm gate to the final consumer.\nAccording to the World Bank-ESCAP trade costs for 2019, trade costs for African countries are on the average equivalent of a 304% tariff and for Nigeria, it’s even slightly higher at 306%.\n”These numbers are one and half times higher than trade cost in high-income countries.\nSuch high costs are not conducive to forming a regional value chain."
  },
  {
    "headline": "‘Ex-NIMASA DG, others spent intelligence gathering funds on massage chairs’",
    "summarized_story": "A Federal High Court sitting in Lagos yesterday heard that a former Director General of the Nigeria Maritime and Administration Agency (NIMASA), Patrick Akpobolokemi, and his management team spent the agency’s N18 million meant for intelligence gathering, on massage chairs for themselves.\nA prosecution witness, Mrs. Margaret Ekong, told Justice Ayokunle Faji that she supplied the chairs to Akpobolokemi and that he took delivery of the three chairs allotted to him.\nShe added that funds voted for intelligence gathering were used to pay for them.\n- Advertisement -Agaba, who was at the NIMASA Directorate of intelligence gathering at the time, is serving a seven-year jail term on another charge bordering on breach of trust.\nWhen Oyedepo asked the witness where she got payment for the chairs from, she said it was from NIMASA."
  },
  {
    "headline": "EFCC has remitted N1.66b since 2017, says AMCON",
    "summarized_story": "The Assets Management Corporation of Nigeria (AMCON) has said it got N1,667,582,605.04 recovered by the Economic and Financial Crimes Commission (EFCC) between 2017 and July 5, 2021.\n- Advertisement -The letter was signed by AMCON Managing Director Ahmed Lawan Kuru and Group Head of Enforcement, Joshua Ikioda.\nGiving a synopsis of the payment, AMCON explained that remittances to the corporation in 2017 amounted to N1,178,764,500 for the credit of nine debtors.\n- Advertisement -- Advertisement -The corporation said the notes were returned to the EFCC through a letter, dated October 28, 2019, as they were made out by the Debt Management Office.\nThe letter showed that the schedule forwarded to the corporation by the committee indicated remittances by EFCC on N87,495,087.50 in 2020."
  },
  {
    "headline": "Tin Can Port e-call-up infrastructure destroyed by hoodlums, truck drivers",
    "summarized_story": "By Steve Agbota, LagosThe management of Truck Transit Park (TTP) Limited has decried the destruction of infrastructure being used for the electronic call-up system at Tin Can Port, Lagos by hoodlums and truck drivers.\nThe electronic truck call-up system, known as ètò, was introduced by the Nigerian Ports Authority (NPA) in February to manage the movement of trucks around the port corridors in Apapa.\nHowever, despite the sensitisation, the management of the TTP has complained that touts and malicious actors have continued to sabotage the ètò system.\nThe TPP has also lamented that the open sabotage of the call-up system is a sad development and a stark reminder of the prevalence of corruption.\nThe TTP management has confirmed that the Caterpillar truck driver has been apprehended and handed over to the police, describing the open sabotage of the call-up system as a sad development."
  },
  {
    "headline": "Breaking: Anambra deputy Governor Okeke, dumps APGA for APC",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAnambra State Deputy Governor Nkem Okeke has dumped All Progressives Grand Alliance (APGA), for All Progressive Congress (APC).\nHe was presented to President Muhammadu Buhari at Presidential Villa by National Chairman of the All Progressives Congress, and Yobe State Governor, Mai Mala Buni and Imo State Governor, Hope Uzodinma.\nDetails later…100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "E-transmission of election results: Senate removes condition, gives INEC power to decide",
    "summarized_story": "The decision of the Senate, followed the re-committal of some clauses of the Electoral Act 2010 to the Committee of the Whole.\nIn July, the Senate, rejected its committee’s report, which had approved electronic transmission of results by INEC.\nThe Senate, had in July, while rejecting the position of its Committee on INEC, opted for a position, which was outrightly rejected by Nigerians.\nManipulation of election results, ballot box snatching, violence, vote buying and selling are the bane of the nation’s electoral process.\nEkweremadu said the Senate’s action justified his assurances to Nigerians in July that all hope was not lost for electronic transmission of 2023 election results despite the initial setback."
  },
  {
    "headline": "The Sun awards great honour to us –Orji, Okafor",
    "summarized_story": "The Speaker, Abia State House of Assembly, Rt.\nHon Chinedum Orji and Chairman/CEO, Marco Polo Group of Companies, Chief Frank Okafor, have described The Sun awards as a great honour to them and their organisations.\nThe Sun Awards, Abia Speaker said, will spur him to further contribute more to the development of the state.\nOrji said he had declined several awards offered him by some organisations, but said he had to accept that of The Sun because of the credibility and reputation of the newspaper.\nThe Sun management seems to know me more than myself.” Earlier, Ukeh praised Orji and Okafor for excelling in their different areas of focus ."
  },
  {
    "headline": "Appointments of service chiefs should be representative –Gov Mohammed",
    "summarized_story": "Bauchi State Governor, Bala Mohammed, yesterday carpeted the All Progressives Congress (APC) over the spate of insecurity, poverty and unemployment in the country.\nThe governor who spoke at a book launch: “Scents of Power” written by Amanze Obi, in Abuja, said the flagrant marginalisation of some regions would continue to embolden agitations across the country.\nHe advised Nigerians to “collectively prioritise national security over sectional interests, in so far that by exercising such restraints, the requirements of justice are not sacrificed.\nSecond, we must sacrifice national survival over corporate profit and personal aggrandisement.\nProfit and individual comfort only exist where there is peace and security.”"
  },
  {
    "headline": "FG Makes Covid-19 Vaccination Card Mandatory for Civil Servants from Dec 1",
    "summarized_story": "Olawale AjimotokanThe federal government has said that all its workers will be required to show proof of COVID-19 vaccination with effect from December 1, 2021.\nThe Secretary to the Government of the Federation/Chairman Presidential Steering Committee on COVID-19, Mr Boss Mustapha announced the new policy decision on Wednesday at the PSC briefing.\nHe said alternatively, public servants will have to present a negative COVID-19 PCR test result done within 72 hours, to gain access to their offices, in all locations within Nigeria and the country’s foreign Missions.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "FG Removes South Africa, Turkey, Brazil from Travel Restriction List",
    "summarized_story": "Olawale AjimotokanThe federal government has removed South Africa, Turkey and Brazil from the list of countries where high level restriction was placed on travelers from visiting to prevent the spread of COVID-19.\nThe Secretary to the Government of the Federation/Chairman Presidential Steering Committee on COVID-19, Mr Boss Mustapha announced the decision in Abuja on Wednesday.\nThe three countries were among the worst hit by the deadly COVID-19 Delta strain that claimed many lives.\nMustapha said the decision to ease the restriction was taken by the PSC after a marathon session on Wednesday after the PSC reviewed the developments in the affected countries.\nIndian was removed from the list on September 13 by the federal government in response to the improved situation in the country."
  },
  {
    "headline": "Senate Suspends Plenary for Consideration of 2022 Budget",
    "summarized_story": "Appropriation bill passes second readingBy Deji Elumoye and Juliet Akoje in AbuThe Senate on Wednesday suspended its plenary till November 9, 2021 to enable it consider the 2022 Appropriation Bill presented to the National Assembly last Thursday by President Muhammadu Buhari.\nThe upper chamber took the decision after the general principles of the budget proposal had been discussed by senators before passing for second reading.\nThe Senate Leader, Senator Yahaya Abdullahi, moved the motion for the suspension of plenary to enable the heads of ministries, departments and agencies (MDAs) appear before the relevant committees of the upper chamber to defend their 2022 budget estimates.\nThe motion was seconded by Senate Minority, Senator Enyinnaya Abaribe, after which the Senate rose for the day.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "North Central PDP Stakesholders Endorse Iyorchia Ayu for National Chair",
    "summarized_story": "The North central stakeholders meeting held Tuesday at Benue State Governor’s Lodge in Abuja commenced late in the night and lasted for fours hours.\nThe following have been mentioned as vying for the position of PDP National Chairman from North Central zone: Former Senate President David Mark, former Senate President Ayu Iyorchia, former Minister of information,l Professor Jerry Gana, former Kogi State governor Ibrahim Idris and former Niger State Governor Babangida Aliyu.\nIt was leant that after hours of deliberations among party stakeholders from North Central, the stakeholders adopted former Senate President Iyorchia Ayu.\nBriefing newsmen after the meeting, Governor Samuel Ortom said, “This is stakeholders meeting of North Central PDP in continuation of finding consensus candidates for the national chairmanship of the party.\n“Amongst the five persons that were contesting, the leadership of our party from North Central, we unanimously agreed to sponsor former Senate President Dr Iyorchia Ayu to be national chairman of our party from the north central."
  },
  {
    "headline": "19 Months to Go, Buhari Urges Ministers to Pace Up on Goals",
    "summarized_story": "She pointed out that Nigeria’s trade cost was equivalent of 306 per cent tariff, one and half times higher than the cost in high income countries.\n“Nigeria’s trade costs are too high.\nAccording to the World Bank-ESCAP trade costs for 2019, trade costs for African countries are on average equivalent of a 304% tariff and for Nigeria, it’s even slightly higher at 306 per cent.\n“These numbers are one and half times higher than trade cost in high income countries.\nSuch high costs are not conducive to forming regional value chain."
  },
  {
    "headline": "EXCLUSIVE Boko Haram Terrorists Kill Six Soldiers, Injure Army General, Capture Military Vehicles, Arms In Borno",
    "summarized_story": "A source said about six Nigerian soldiers were killed, while others including the Brigadier General in-charge of the camp, were injured.\nThe attack comes a few weeks after the insurgents killed over 25 soldiers who were also on patrol in Monguno area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nAt least 33 soldiers were killed early in the year when two vehicles loaded with explosives rammed into a military convoy in Wulgo.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "EXCLUSIVE Boko Haram Terrorists Kill Six Soldiers, Injure Army General, Capture Military Vehicles, Arms In Borno",
    "summarized_story": "A source said about six Nigerian soldiers were killed, while others including the Brigadier General in-charge of the camp, were injured.\nThe attack comes a few weeks after the insurgents killed over 25 soldiers who were also on patrol in Monguno area of Borno state.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nAt least 33 soldiers were killed early in the year when two vehicles loaded with explosives rammed into a military convoy in Wulgo.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo",
    "summarized_story": "According to presidential sources, Buhari has asked Vice-President Yemi Osinbajo to represent him.\nMultiple presidential sources, however, told SaharaReporters that Buhari had cancelled the trip after seeing the need for rest.\n“The Scotland trip is now for Vice President Osinbajo, the President won't go again.\nSaharaReporters had exclusively reported that Buhari would this weekend depart Abuja for Daura, Katsina State to take some rest.\nAccording to presidential sources, the President wants to go to his hometown, just to get some rest."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo",
    "summarized_story": "According to presidential sources, Buhari has asked Vice-President Yemi Osinbajo to represent him.\nMultiple presidential sources, however, told SaharaReporters that Buhari had cancelled the trip after seeing the need for rest.\n“The Scotland trip is now for Vice President Osinbajo, the President won't go again.\nSaharaReporters had exclusively reported that Buhari would this weekend depart Abuja for Daura, Katsina State to take some rest.\nAccording to presidential sources, the President wants to go to his hometown, just to get some rest."
  },
  {
    "headline": "Anambra Deputy Governor Dumps APGA, Joins APC",
    "summarized_story": "The Deputy Governor of Anambra State, Nkem Okeke, has dumped the All Progressive Grand Alliance (APGA) for the ruling All Progressives Congress (APC).\nOkeke was on Wednesday received by President Muhammadu Buhari at the Presidential Villa in Abuja.\nOkeke was led to the President by the APC Caretaker Committee Chairman and Yobe State Governor, Mai Mala Buni, and Imo State Governor, Hope Uzodinma.\nUzodinma is the chairman of the APC campaign council for the Anambra governorship election coming up in November.\nA photo of the meeting at the villa showed Buhari, Governor Uzodinma, and Okeke jointly holding a flag of the APC."
  },
  {
    "headline": "COVID: FG removes South Africa, Brazil, Turkey from travel restriction list",
    "summarized_story": "The federal government says it has taken South Africa, Brazil and Turkey off the list of countries from which travellers are restricted from entering Nigeria.\nAdvertisementBoss Mustapha, chairman of the presidential steering committee (PSC) on COVID-19, disclosed this on Wednesday at a media briefing in Abuja.\nThe federal government had, in June, added South Africa to the list of countries from which travellers are restricted from entering Nigeria — over the high infection rates recorded in the affected countries.\nThe PSC has, after a review of the developments in these countries, decided to remove South Africa, Turkey, and Brazil from the restricted list,” he said.\n“A revised protocol will be issued in the next 24 hours.”AdvertisementWith the development, only India is left on the list."
  },
  {
    "headline": "COVID: FG removes South Africa, Brazil, Turkey from travel restriction list",
    "summarized_story": "The federal government says it has taken South Africa, Brazil and Turkey off the list of countries from which travellers are restricted from entering Nigeria.\nAdvertisementBoss Mustapha, chairman of the presidential steering committee (PSC) on COVID-19, disclosed this on Wednesday at a media briefing in Abuja.\nThe federal government had, in June, added South Africa to the list of countries from which travellers are restricted from entering Nigeria — over the high infection rates recorded in the affected countries.\nThe PSC has, after a review of the developments in these countries, decided to remove South Africa, Turkey, and Brazil from the restricted list,” he said.\n“A revised protocol will be issued in the next 24 hours.”AdvertisementWith the development, only India is left on the list."
  },
  {
    "headline": "WHO: Global COVID death toll at lowest in almost a year",
    "summarized_story": "The World Health Organisation (WHO) says the death toll from COVID-19 is now at its lowest level in almost one year.\nAdvertisementSpeaking on Wednesday at a media briefing in Geneva, Tedros Ghebreyesus, WHO director-general, said although the deaths are now at its lowest level, the numbers are still unacceptably high.\n“The number of weekly reported deaths from COVID-19 continues to decline, and is now at the lowest level in almost a year,” he said.\n“But it’s still an unacceptably high level – almost 50,000 deaths a week, and the real number is certainly higher.\nAdvertisement“Deaths are declining in every region except Europe, where several countries are facing fresh waves of cases and deaths."
  },
  {
    "headline": "WHO: Global COVID death toll at lowest in almost a year",
    "summarized_story": "The World Health Organisation (WHO) says the death toll from COVID-19 is now at its lowest level in almost one year.\nAdvertisementSpeaking on Wednesday at a media briefing in Geneva, Tedros Ghebreyesus, WHO director-general, said although the deaths are now at its lowest level, the numbers are still unacceptably high.\n“The number of weekly reported deaths from COVID-19 continues to decline, and is now at the lowest level in almost a year,” he said.\n“But it’s still an unacceptably high level – almost 50,000 deaths a week, and the real number is certainly higher.\nAdvertisement“Deaths are declining in every region except Europe, where several countries are facing fresh waves of cases and deaths."
  },
  {
    "headline": "Ghana's president warns ECOWAS leaders against sit-tight syndrome",
    "summarized_story": "President Nana Akufo-Addo of Ghana has warned leaders of West African countries against staying in office beyond the provisions of their constitutions.\nAdvertisementAkufo-Addo, who is also the chair of the Economic Community of West African States (ECOWAS), gave the warning on Wednesday, during the opening of the ECOWAS high-level parliamentary seminar in Winneba, Ghana.\nAccording to him, leaders staying in power beyond the limits of the constitution is the major cause of political instability in the sub-region.\nHe noted that if firm and decisive actions are not urgently taken against the trend, ECOWAS will become a failed state.\n“If we do not take firm and very decisive actions against this ugly trend, ECOWAS will not only be perceived as a body of failed states, but will indeed fail.”"
  },
  {
    "headline": "Kenya’s high court issues landmark ruling against Uber",
    "summarized_story": "Under this agreement, Uber Kenya Limited retained a 25% cut of overall profits from each ride.\nBecause of this, Uber Kenya Limited said they were not liable for the breach of contractual obligations.\nUber Kenya Limited acts as a subsidiary that contracts Uber drivers in Kenya.\nWhile Uber BV claimed it was a separate entity from Uber Kenya Limited, the High Court of Kenya concluded that there was an intricate link between both companies.\nThis, stated Milimani court justice, Francis Tuiyott, lifted the “corporate veil” off of the conglomerate, making Uber Kenya Limited and Uber BV liable to the plaintiffs."
  },
  {
    "headline": "China’s growing influence is transforming African tech",
    "summarized_story": "The African market offers Chinese companies and investors a growing young population expected to reach 1.7 billion by 2030.\nThese Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\n“Until African countries manufacture their own equipment, they’ll always be susceptible to international organisations having access to their data,” Tugendhat said.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "Pan-African venture capital firm, Savannah Fund wants to help African startups go global",
    "summarized_story": "In the nine years since its founding, Savannah Fund-backed startups have raised follow-on funding of over $200 million.\nHe helped source deals, incubate startups, and provide strategic directions for the venture’s portfolio companies.\nSo far, none of the firm’s portfolio companies has failed.\nBefore joining Sendy, she was a mentor at Savannah Fund, leading the firm’s investment in Nigerian logistics company, African Courier Express (ACE).\nDespite being Tanzanian, Savannah Fund has not funded any Tanzanian startup; Alliy hopes to change this soon."
  },
  {
    "headline": "Why Techpoint Africa is making all its past premium reports free",
    "summarized_story": "Share this article:In 2018, Techpoint Africa started the Nigerian Startup Funding Report (NSFR) as a detailed and comprehensive periodic account of the funding activities of the Nigerian Internet startup space.\nThese people are getting part of the credit for making the decade report available for free.\nBeyond making all our past reports available for free, most (if not all) of our subsequent reports will also be available for free as well.\nTo every brand and person mentioned above (and those not mentioned), we say thank you for believing in the Techpoint Africa dream once again.\nThe only change is that we will be releasing only a single annual edition of the Nigerian Startup Funding Report."
  },
  {
    "headline": "Healthtracka’s lab testing solution, Klasha’s Ghanaian expansion, Fawry’s investment in alsoug",
    "summarized_story": "She started healthtech startup, Healthtracka, following the avoidable death of her father from several illnesses.\nAdvertisementWhat Healthtracka does: Easing the process of conducting laboratory tests, the startup allows people to get tested without leaving their homes or offices.\nEgyptian payments company, Fawry has announced its investment in alsoug, Sudan’s largest online classifieds marketplace, to help build out the latter’s new fintech platform, Cashi.\nWhat does alsoug do?\nWith a population of 43.8 million, Sudan represents a large market for any startup to play in."
  },
  {
    "headline": "Here’s why Nigerians may pay more for cooking gas in festive period",
    "summarized_story": "Here’s why Nigerians may pay more for cooking gas in festive periodWith the festive season less than six weeks away, there are indications the soaring cost of cooking gas may extend beyond December 2021, a development that will compound what has been a terrible year for Nigerians’ disposable income.\nAs the yuletide season approaches, here are four reasons why Nigerians may pay more for cooking gas.\nThe marketers union warned that the 12.5kg cylinder of cooking gas, which currently sells between N7,500 and N8,000 could rise to N10,000 by December if the government fails to address the crisis.\nThe government had in 2019 gazetted the removal of VAT on cooking gas, as a product to increase its domestic utilization.\nHe noted that as long as the dollar was appreciating against the naira, the price of cooking gas would keep increasing."
  },
  {
    "headline": "Nigeria’s economy to grow on oil boost but won’t outpace poverty",
    "summarized_story": "The growth revision was made in the IMF’s October 2021 World Economic Outlook Report, which was released Tuesday.\nThe IMF’s growth outlook for Nigeria is more optimistic than the World Bank’s 2.4 percent estimate but lower than the government’s 3 percent target.\nAyodeji Ebo, head, retail investment, Chapel Hill Denham also said the IMF’s projection is achievable given the increase in business activities so far this year.\nElsewhere, the global growth projection for 2021 was downgraded by 0.1 percentage points to 5.9 per cent, while the global growth forecast for 2022 remained unchanged at 4.9 per cent.\nThe IMF’s Gopinath said “Pandemic outbreaks in critical links of global supply chains have resulted in longer-than-expected supply disruptions, further feeding inflation in many countries."
  },
  {
    "headline": "Nigeria’s poor feel pain of soaring price of cooking gas",
    "summarized_story": "She has run the food business for over 25 years, alternating between firewood and cooking gas.\nShe told BusinessDay that the incessant increase in the price of Liquified Petroleum Gas (LPG) also called cooking gas, has made life more difficult for her.\n“I alternate between cooking gas and firewood because I have to factor my children’s school fees into the business.\nThe current rising price of cooking gas won’t allow me to consider it as an option,” Abbas said.\n“Many of us can’t buy cooking gas anymore; the government should do something about it."
  },
  {
    "headline": "Edo Youth Parliament Speaker seeks public support for Edo Govt’s COVID-19 vaccination campaign – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Speaker of the Edo State Youth Parliament, Rt Hon.\nOsawemwenhio Uwagboe, has urged residents in Edo State to complement the state government effort to contain the third wave of the COVID-19 pandemic, by ensuring they take the COVID-19 vaccines.\nAddressing journalists in Benin City, the Speaker of Edo State Youth Parliament, said members of the Parliament have taken the vaccines to encourage youths and other residents in the state to go for the vaccines.\nIn her remarks, Deputy Speaker, Edo Youth Parliament, Hon.\nShe added that the parliament will also support the state government sensitisation campaign on waste management in the state."
  },
  {
    "headline": "Delta Police Arrest Man With A Gun Concealed In Garri Sack – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command said it has arrested a middle aged man with a locally madebarrel gun concealed in a bag of garri while traveling in a commercial bus.\nAccording to a press release signed by the Delta Police spokesperson, DSP Bright Edafe,“At about 1030 hrs,20/10/21, patrol team attached to Ovwian Aladja Division while on stop and search duty intercepted a commercial bus carrying some passengers, the operatives upon searching the passengers recovered one locally made single barrel gun concealed in a bag of Garri.\nThe suspect one Pigi Kelvin ‘m’ of Ututuoama town Ughelli South LGA age 42yrs was arrested.\nInvestigation is ongoing”.\n“Also, men of Ovwian Aladja Division raided criminal hideout/black spots in Ujvwu Community the suspects who gathered in a large number smoking Indian Hemp took to their heels on sighting the police, they were chased and two of them namely Godspower Alfred age 23yrs and Destiny Akwara 34yrs were arrested and upon search, a locally made cut to size gun and some wraps of weeds suspected to be Indian hemp were recovered from them."
  },
  {
    "headline": "Shun Corruption And Incivility To Members Of The Public, Delta CP Warns – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Commissioner, CP Ari Mohammed Ali, FCIA, Psc+, has warned officers and men of the Delta State Police Command against all forms of corruption and incivility to members of the public.\nGiving the warning at a well attended meeting with the Area commanders, DPO’S, Tactical commanders and other officers in the Command on 8th October 2021,the CP reiterated the fact that the command under his watch will not tolerate such, mercenaries have been put in place to check the activities of men posted and any erring officer will be dealt with accordingly, citing the two officers dismissed recently as an example to all.\nThe CP also ordered that stop and search should be intensified, while constant raiding of black spot/criminal hideout should be sustained."
  },
  {
    "headline": "Governor Okowa Gets Royal Commendation On Trans-Warri Ode-Itsekiri Project – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – THE Governor of Delta State, Dr. Ifeanyi Okowa has been commended for paying N8 billion out of the N9billionowed to Setraco Construction Company handling the Trans-Warri Ode-Itsekiri bridges and access road project to enable continuous work on the road.\n“I want to thank the Governor for his kind disposition towards us, we all know the existing economic situation.\nChief Adams Otimeyin, Special Project Director, Trans-Warri Ode-Itsekiri Bridges and Access Roads thanked the Olu of Warri for exhibiting uncommon leadership by visiting the site to ascertain the work done.\nOtimeyin also thanked Okowa for Keeping to his promise and paying the huge backlog owed the contractor.\nJose Cosme, Area Manager Setraco thanked the Olu of Warri and promised that with adequate funding the project will be completed before his first coronation anniversary."
  },
  {
    "headline": "Three kidnapped Catholic seminarians freed in Kaduna",
    "summarized_story": "The three Catholic seminarians kidnapped on Monday have been freed by their abductors.\nPREMIUM TIMES reported how the three men were kidnapped during an attack on Monday at the Christ the King Major Seminary in Kafanchan, Kaduna State.\nA statement from the Chancellor of the Catholic Diocese of Kafanchan, Emmanuel Okolo, said they were released on Wednesday, about 48 hours after their abduction.\nThe statement also urged Catholic churches to organise Thanksgiving masses for the successful release of the abducted people.\nEmmanuel Uchechukwu Okolo,Chancellor, Catholic Diocese Of Kafanchan"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "SEC partners EFCC to curb financial crimes in capital market",
    "summarized_story": "OBINNA EZUGWUIn a bid to check financial crimes in the capital market, the Securities and Exchange Commission has engaged staff of the Economic and Financial Crimes Commission (EFCC) on capital market training.\nMr. Falomo stated that the special enlightenment program is aimed at intimating the officers of EFCC on the workings of the Capital Market in general and enhancing the investigative skills you might require to handle Capital Market related complaints.\nIt is empowered by the Investment and Securities Act (ISA) of 2007 to regulate and develop the Capital Market.\n“We are all aware that the EFCC is responsible for the investigation and prosecution of Financial Crimes and that a large chunk of complaints and infractions in the Capital Market can be deemed to be financial crimes.\nIt is therefore imperative that the SEC supports the EFCC with up-to-date knowledge of the intricate workings of the Capital Market and some useful information on the investigations of financial crimes emanating from players in the Capital Market space."
  },
  {
    "headline": "Photos: Nigerian officials stage Eurobond Roadshow in New York, United States",
    "summarized_story": "OBINNA EZUGWUOfficials of Nigeria’s Central Bank, Debt Management Office (DMO), Budget Office, among others, today, staged Eurobond Roadshow in New York, United States.\nNigeria had last month, raised $4 billion through Eurobonds, an amount that was raised after an intensive two days of virtual meetings with investors across the globe.\nIt further explained that when Nigeria raised funds externally through Eurobonds, it freed up space in the domestic market for private sector and sub-national borrowers.\nThe debt management body stated, “In effect, it helps the sovereign not to crowd out other borrowers in the domestic market.\nThe issuance of Eurobonds by Nigeria has opened up opportunities for Nigeria’s corporate sector, notably banks, to issue Eurobonds to raise capital in the ICM.”"
  },
  {
    "headline": "Sports ministry denies diverting female basketball players’ funds",
    "summarized_story": "Nigeria’s Ministry of Youth and Sports Development has denied diverting funds meant for the payment of the country’s female basketball team, D’Tigress’ allowances, noting that the funds are intact.\nThe basketball players had in a now viral video, lamented that they are being owed allowances and bonuses by the Nigeria Basketball Federation (NBBF).\nThe women’s basketball team had also threatened to boycott future call-ups to represent Nigeria for the 2022 World Cup qualification series if all outstanding allowances are not paid.\n“The Ministry has requested the CBN to commence the processing of the payment to the Female Basketball Players immediately.\n“Ministry wishes to state further that all outstanding -Olympics and Paralympics Games allowances and bonuses are being processed and only slowed down by funds availability."
  },
  {
    "headline": "Anambra deputy governor, Nkem Okeke joins APC",
    "summarized_story": "The deputy governor of Anambra State, Dr. Nkem Okeke, has joined the All Progressive Congress (APC), abandoning the All Progressive Grand Alliance (APGA).\nOkeke was on Wednesday received by President Muhammadu Buhari at the State House in Abuja on Wednesday.\nAPC Caretaker Committee Chairman and Yobe State Governor, Mai Mala Buni, and the Governor of Imo State, Senator Hope Uzodinma were present during the meeting.\nThis is happening ahead of the November 6 governorship election in Anambra State.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "COVID-19: Federal Govt To Make Vaccination Compulsory For Civil Servants",
    "summarized_story": "The Presidential Steering Committee (PSC) on COVID-19 has said that civil servants would be required to present proof of vaccination or negative polymerase chain reaction (PCR) tests conducted within 72 hours to enable access to government offices from December 1, 2021.\nThis is even as the PSC said South Africa, Turkey and Brazil have been removed from restriction list for travellers.\nThe chairman, PSC on COVID-19, Boss Mustapha, stated this during the presidential press briefing on COVID-19 on Wednesday in Abuja.\nThe PSC has after a review of the developments in these countries, decided to remove South Africa, Turkey, and Brazil from the restricted list.\n“With effect from 1st December, 2021, federal government employees shall be required to show proof of COVID-19 vaccination or present a negative COVID-19 PCR test result done within 72 hours, to gain access to their offices, in all locations within Nigeria and our Missions."
  },
  {
    "headline": "COVID-19: Federal Govt To Make Vaccination Compulsory For Civil Servants",
    "summarized_story": "The Presidential Steering Committee (PSC) on COVID-19 has said that civil servants would be required to present proof of vaccination or negative polymerase chain reaction (PCR) tests conducted within 72 hours to enable access to government offices from December 1, 2021.\nThis is even as the PSC said South Africa, Turkey and Brazil have been removed from restriction list for travellers.\nThe chairman, PSC on COVID-19, Boss Mustapha, stated this during the presidential press briefing on COVID-19 on Wednesday in Abuja.\nThe PSC has after a review of the developments in these countries, decided to remove South Africa, Turkey, and Brazil from the restricted list.\n“With effect from 1st December, 2021, federal government employees shall be required to show proof of COVID-19 vaccination or present a negative COVID-19 PCR test result done within 72 hours, to gain access to their offices, in all locations within Nigeria and our Missions."
  },
  {
    "headline": "MDAs Sabotaging Buhari’s Efforts To Provide Critical Infrastructure – Senate President",
    "summarized_story": "President of the Senate, Ahmad Lawan, has raised the alarm that some Ministries, Departments and Agencies of government (MDAs) were out to sabotage the efforts of President Muhammadu Buhari to provide critical infrastructure across the country.\nRecall that the Senate on July 15, 2021, approved President Buhari’s external loan requests to the tune of $8,325,526,537 (USD) and €490,000,000 (Euros) under the 2018-2020 External Borrowing (Rolling) Plan.\nBuhari explained that the loan was needed to fund projects listed in the addendum to the 2018 to 2021 Federal Government external borrowing plan.\nHe listed the erring MDAs to include the Federal Ministry of Power, Ministry of Heath, Ministry of Women Affairs, Ministry of Petroleum Resources, National Agency for Science and Engineering Infrastructure, Ministry of Water Resources, and Ministry of Environment.\n“[And] if the fail to appear, we will take appropriate and prompt action, because this Senate will not condone any sabotage to the efforts of this administration to provide infrastructure to this country.”"
  },
  {
    "headline": "MDAs Sabotaging Buhari’s Efforts To Provide Critical Infrastructure – Senate President",
    "summarized_story": "President of the Senate, Ahmad Lawan, has raised the alarm that some Ministries, Departments and Agencies of government (MDAs) were out to sabotage the efforts of President Muhammadu Buhari to provide critical infrastructure across the country.\nRecall that the Senate on July 15, 2021, approved President Buhari’s external loan requests to the tune of $8,325,526,537 (USD) and €490,000,000 (Euros) under the 2018-2020 External Borrowing (Rolling) Plan.\nBuhari explained that the loan was needed to fund projects listed in the addendum to the 2018 to 2021 Federal Government external borrowing plan.\nHe listed the erring MDAs to include the Federal Ministry of Power, Ministry of Heath, Ministry of Women Affairs, Ministry of Petroleum Resources, National Agency for Science and Engineering Infrastructure, Ministry of Water Resources, and Ministry of Environment.\n“[And] if the fail to appear, we will take appropriate and prompt action, because this Senate will not condone any sabotage to the efforts of this administration to provide infrastructure to this country.”"
  },
  {
    "headline": "Facebook Post: Ebonyi Group Demands Release Of Journalist",
    "summarized_story": "The Association of Ebonyi State Indigenes in the Diaspora (AESID) has faulted the state governor, David Umahi, for implementing Cybercrime Prohibition Law in the state without a public hearing.\nThe group also demanded the immediate release of a Radio presenter, Godfrey Chikwere, arrested and detained over a Facebook post on the order of the state government.\nPaschal Oluchukwu, gave Ebonyi State government 24 hours ultimatum to release the said journalist from detention and apologise to him for violation of his fundamental human rights.\nWe ask; Assuming without even conceding that the army was assaulted or libeled, when did it cede the powers to restore its image on the Ebonyi State government or empowered them to act on its behalf?\nOne; Was there any public debate before the Ebonyi State House of Assembly to enable the masses make submissions before this law was passed and assented to by the governor?"
  },
  {
    "headline": "FG to bar unvaccinated workers from work by Dec 1",
    "summarized_story": "Chairman of the Presidential Steering Committee PSC on COVID-19 and Secretary to the Government of the Federation SGF, Mr Boss Mustapha announced this at Wednesday’s briefing of the committee.\n“The combined total for testing by PCR and RDT now stands at about 3.141, 795 million persons.\n“The Aviation authorities in collaboration with the diplomatic sector have made reasonable progress in collaboration with the Ministry of Foreign Affairs.\n“As you are aware, the UK has eased restrictions on fully vaccinated travelers from Nigeria to the UK with effect from 11th October.\nNigeria welcomes this development and assures that the PSC shall continue to review Nigeria’s protocols based on global developments, science and national experience."
  },
  {
    "headline": "FG to bar unvaccinated workers from work by Dec 1",
    "summarized_story": "Chairman of the Presidential Steering Committee PSC on COVID-19 and Secretary to the Government of the Federation SGF, Mr Boss Mustapha announced this at Wednesday’s briefing of the committee.\n“The combined total for testing by PCR and RDT now stands at about 3.141, 795 million persons.\n“The Aviation authorities in collaboration with the diplomatic sector have made reasonable progress in collaboration with the Ministry of Foreign Affairs.\n“As you are aware, the UK has eased restrictions on fully vaccinated travelers from Nigeria to the UK with effect from 11th October.\nNigeria welcomes this development and assures that the PSC shall continue to review Nigeria’s protocols based on global developments, science and national experience."
  },
  {
    "headline": "Unity Bank Boosts Capacity Building on Blue Economy, Empowers 3,000 Girls",
    "summarized_story": "By KEN EMORDINo fewer than three thousand girls drawn from Senior Secondary Schools across Nigeria have benefitted from a 3-day capacity building initiative on maritime commerce and National Virtual Maritime Quiz powered by Unity Bank Plc.\nThe Managing Director/CEO of Unity Bank Plc, Mrs. Tomi Somefun represented by the Chief Customer Service Officer, Mrs. Titilayo Abraham officially opened the event.\nCommenting on the initiative, she stated that: “Unity Bank has maintained its commitment to supporting the girl child by supporting several advocacy initiatives and investing in the education sector.\nOne of the Bank’s flagship initiatives – One Minute Genius (OMG) and others such as Unity Bank Spelling B Competition, One Day CEO, are annual educational platforms of the Bank aimed at boosting financial literacy among Nigerian children.\nThe organisers, Ocean Ambassadors Foundation commended Unity Bank, adding that “the sensitization for the Girl-Child to take advantage of career opportunities in the ICT and maritime cannot be over-emphasized."
  },
  {
    "headline": "Minister Hails MoU on Repatriation of Benin Bronzes From Germany",
    "summarized_story": "By GBENGA ADEOLAThe Minister of Information and Culture, Alhaji Lai Mohammed, hasdescribed the Memorandum of Understanding (MoU), signed betweenNigeria and Germany in Abuja on Wednesday, as a major step toward therepatriation of hundreds of Benin Bronzes from Germany next year.\nHe said a team of experts will leave Nigeria very soon to engage withstakeholders in Germany on the repatriation of the artifacts.\nAlhaji Mohammed said even though Germany acquired the artifactsthrough global trading in artifacts, it had voluntarily agreed torelinquished them in order to further strengthen the bilateral tiesbetween Nigeria and Germany.\nBecause what the return of theartifacts will do is that it’s going to really cement furtherrelationship between Nigeria and Germany.\n“The return of the artifacts should not be an end of an era but ratherthe beginning of further cooperation between the two parties,” hesaid."
  },
  {
    "headline": "He is Deadwood: APGA speaks on Nkem Okeke who joined APC",
    "summarized_story": "By Chimezie Anaso/AwkaThe All Progressives Grand Alliance (APGA) has dismissed as inconsequential, the defection of Dr Nkem Okeke, the Deputy Governor of Anambra to the All Progressives Congress (APC).\nHope Uzodimma of Imo and Governor Mai Mala Buni at the State House, Abuja on Wednesday.\nIn a statement issued in Awka by Mr Tex Okechukwu, APGA National Publicity Secretary, the party said the defection was long expected.\nAPGA said the deputy governor left the party without formally notifying the party or the state governor, adding that the move was uncalled for, ill-timed and ill-advised.\nThe governor faulted that claims by APGA and Governor Willie Obiano that members of the State House of Assembly who defected from the All Progressives Grand Alliance (APGA) were financially induced to join the APC."
  },
  {
    "headline": "Katsina's Kankara faces crisis of out-of-school children",
    "summarized_story": "By Abbas Bamalli/KankaraKankara, the local council of Katsina state where more than 300 students were kidnapped by terrorists in December 2020, is facing a crisis of out-of-school children.\nA report just released has indicated that 75 per cent of children in the council area drop out of school upon completing primary school.\nAlhaji Isa Muhammad, Secretary of the Katsina state Universal Basic Education Board (SUBEB), disclosed this on Wednesday, while quoting the report of a survey conducted by UNICEF.\nMuhammed said that the data had revealed that only 82 per cent of children aged between 6 and 11 attend primary school, while 28 per cent were out of primary school.\n“Similarly, 25 per cent of the children between the ages of 12 to 14, were those in Secondary schools, and 75 per cent are out-of-school."
  },
  {
    "headline": "I Facilitated Nnamdi Kanu’s Release In 2017 — Soludo",
    "summarized_story": "Prof Chukwuma Soludo, the All Progressives Grand Alliance (APGA) gubernatorial candidate in Anambra State, stated on Tuesday that he and a few other famous Igbo Indigenes facilitated the release of Mazi Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB), in 2017.\nSoludo stated that he brought 12 notable Igbos to Abuja in 2017 for Kanu’s release, and that he will continue to protect Igbo interests in all their endeavors and include them in his administration, particularly in the formulation of public policies.\nThe former governor of the Central Bank of Nigeria (CBN) spoke during an APGA political event in Attani, Ogbaru Local Government Area (LGA), Anambra State, to party members and supporters.\nIn 2017, when Nnamdi Kanu was refused bail; I led 12-prominent personalities from Igboland to Kuje Prison, where we facilitated his release.\n“We need a platform, where Igbos will be in the forefront and not at the rear, and APGA is the platform."
  },
  {
    "headline": "BREAKING: Anambra Deputy Governor, Nkem Okeke Defects To APC",
    "summarized_story": "Dr. Nkem Okeke, the Deputy Governor of Anambra State, has defected to the ruling All Progressives Congress, APC.\nDr. Okeke, who previously served as the Commissioner for Economic Planning in the state of Anambra, was welcomed into the party by President Muhammadu Buhari during a meeting in Abuja on Wednesday.\nThe APC Caretaker Committee Chairman Mai Mala Buni, Imo State Governor Hope Uzodinma, and other party members were also present.\nPrior to his defection, Okeke served as the Commissioner for Works and Transport in Governor Peter Obi’s administration in Anambra State.\nDetails later…"
  },
  {
    "headline": "BREAKING: Senate Passes 2022 Budget For Second Reading, Adjourns For Its Defence",
    "summarized_story": "The Senate passed the 2022 Appropriation Bill for a second reading on Wednesday and adjourned plenary until November 9 for budget defense.\nDuring plenary, Senate President Ahmad Lawan declared the adjournment.\nHe forwarded the Appropriation Bill to the Appropriations Committee and asked them to report back in four weeks.\nThe development came after the conclusion of the budget’s main principles, with each senator expressing his or her thoughts on the document’s contents."
  },
  {
    "headline": "Sunday Igboho Down With Kidney, Lung Illness In Beninese Prison, Needs Urgent Medical Care — Lawyer, Alliyu",
    "summarized_story": "Yomi Alliyu, lawyer to Yoruba Nation activist, Sunday Adeyemo (Igboho) has again pleaded with the government of Benin Republic to immediately release the activist for urgent medical attention overseas.\nIn an interview with BBC Yoruba, Alliyu said the Beninese government needed to allow the activist to seek medical treatment due to ill health.\nAlliyu added that the sickness troubling Igboho was not of little measure and he needed both prayers and medical attention.\nMeanwhile, Igboho’s lawyer in the Benin Republic, Ibrahim Salami, confirmed Igboho got injured during the DSS raid.\nA statement by Koiki titled ‘On behalf of Chief Sunday Adeyemo, aka Igboho’, called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention."
  },
  {
    "headline": "Global economic recovery still under threat – IMF",
    "summarized_story": "The International Monetary Fund (IMF) has warned that the threats to economic recovery from last year’s COVID-19 disruptions are growing, along with a “dangerous divergence” between richer and poorer countries.\nThis position contradicts the belief in some quarters that global economies were beginning to recover from the weight of the pandemic which brought the world to its knees in 2020.\nThe IMF revised its headline forecast for global growth this year down slightly by 0.1 per cent to 5.9 per cent while leaving its projections for 2022 unchanged at 4.9 per cent.\nAt the same time, roughly 96 per cent of the population in low-income countries have yet to receive a single COVID jab,” the IMF noted.\nFor advanced economies, the fund believed headline inflation would peak in the final months of this year and decline to about two per cent by mid-2022."
  },
  {
    "headline": "Senate on 2022 budget: MDAs sabotaging Buhari’s infrastructure loan requests",
    "summarized_story": "The Senate Wednesday raised the alarm over alleged plans by some Ministries, Departments and Agencies (MDAs) to sabotage President Muhammadu Buhari’s loan request to fund the nation’s infrastructure.\nThe loan requestsThe Senate, July 15, 2021, had approved Buhari’s $8,325,526,537 (USD) and €490,000,000 (Euros) external loan request under the 2018-2020 External Borrowing (Rolling) Plan.\nThese MDAs failed to appear.\nThese MDAs failed to appear.\nAlready, the National Assembly has approved the loan requests but there is need for clarifications by the affected agencies."
  },
  {
    "headline": "Flying Officers Cup 2021: With maximum points from 2 games, Confluence queens zoom into quarterfinal as action hits up (Pictures)",
    "summarized_story": "The Flying Officers Cup 2021 Matchday 4 continued on wednesday as groups take shape ahead of their final group game.\nHoney Badgers FC held Ghana Police Ladies FC to a 1-1 draw in the first game of the day.\nGhana Police Ladies with the result occupy the second position in Group A with two points from two games, a point behind leaders, Royal Queens FC.\nIn the 25th minute, Bayelsa Queens doubled their lead with Sunday Juliet’s second goal of the game.\nConfluence Queens with a maximum of six points from two games qualify for the quarter final."
  },
  {
    "headline": "Coalition Applauds PMB on Proposed tax increase on soft drinks -NigPilot",
    "summarized_story": "A coalition of public health organizations under the aegis, the National Action on Sugar Reduction, has applauded President Muhammadu Buhari for the proposed “pro-health” tax increase on soft drinks in the 2022 budget.\nAccording to the group, the proposed tax policy as announced by the Minister of Finance, Mrs. Hadiza Ahmed, in her budget breakdown, would boost non-communicable diseases prevention in Nigeria.\n‘‘We are advocating for health and fiscal policy measures to combat the devastating impact of Non-Communicable Diseases (NCDs) in the country.\n“The proposed increase in the taxation of sugar-sweetened beverages by 2022 is a step in the right direction.\n“In addition to the economic benefits of the tax, the coalition recognizes the positive effect this will have on the health of Nigerians."
  },
  {
    "headline": "Chairmanship aspirant calls for consensus in APC state congress -NigPilot",
    "summarized_story": "As the ruling All Progressives Congress, APC, is set to conduct its State Congress across the nation on Saturday, October 16, 2021, Lagos State, Nigeria’s commercial capital, is not left out in this all-important exercise.\nMrs. Beatrice Omotayo Tugbobo is strategically poised to take out the Tunde Balogun-led Exco to a higher level if elected as the state chairman of the party in the state.\nMrs. Tugbobo parades a rich and intimidating professional and politicalprofile; she was once the chairman of Mushin Local Government of the state.\n“I am bringing my wealth of expertise, experience, contacts, and motherly touch to further advance the political fortunes and causes of the Lagos State Chapter of our great party the APC, without leaving any member behind,” she said.\nShe is an advent believer in the consensus arrangement being preached by the Chairman of the Caretaker Committee and the present Governor of Yobe State H.E."
  },
  {
    "headline": "Crown University International Chartered Inc.’s outlines mode of operation -NigPilot",
    "summarized_story": "Crown University International Chartered Inc ., has outlined its mode of operation saying that it is a private, global research University in Santa Cruz Province, Argentina, South America.\nThe institution also noted that its affiliations are Research and Training in Africa, based in Asia and associates worldwide such as; Mother Theresa Women’s University in India, Ambrose Alli University, Edo State, Nigeria, University of Kara, Kara City, Republic of Togo (Government University in Togo), Afriford University Republic of Benin, Bharat University in India, Kaduna State University, Kaduna, Nigeria, CEPRES International University, Liberia and others worldwide.\n“The Crown University Int’l Chartered Inc. is an innovative University, notable for ‘Research and Training Initiatives, with many government and non-government universities worldwide.\nHe also added that Crown University has affiliations with various public, private and non-profit organizations including; Chartered World Institute for Encyclopedia of Books Inc., West Coast University, International Chartered World Learned Society, Chartered World Order of the Knights of Justice of Peace, International Centre for Eye Research and Education, the Prof. Sir Bashiru Aremu Intl.\nFoundation Inc., Africa International Institute for Professional Training and Research Intl Chartered, amongst others."
  },
  {
    "headline": "Poultry farmers lament high cost of eggs’ production -NigPilot",
    "summarized_story": "Poultry Farmers Association of Nigeria, PFAN in Kwara State has raised the alarm that the high cost of eggs production, particularly the raising of chicken, has discouraged a lot of poultry farmers from being in the business.\nSpeaking at an event to mark World Egg Day and the 20th anniversary of the global event, the state chairman of PFAN, Mr. Ojo Akinwumi Richard lamented that poultry farmers are presently running at loss.\nHe, therefore, appealed to the federal government to allow the importation of poultry feeds into the country, noting that Nigerian farmers cannot produce enough grains to meet poultry feeds production.\nThe chairman, however, assured at this year’s event, tagged: “Eat your egg today and every day” that the association would continue to do its best in making eggs available for Nigerians.\nSola-Ojo said: “Egg is highly nutritious with about 13 vitamins, except Vitamin C. It has Omega 3 Fatty Acids and all the essential Amino Acids."
  },
  {
    "headline": "FG Sets December 1st Deadline For Civil Servants To Take COVID-19 Vaccine",
    "summarized_story": "The Federal Government has set a deadline of December 1 for civil servants to take the COVID-19 vaccine.\n“As you are aware, the UK has eased restrictions on fully vaccinated travellers from Nigeria to the UK with effect from 11th October.\nNigeria welcomes this development and assures that the PSC shall continue to review Nigeria’s protocols based on global developments, science, and national experience.\nNigeria welcomes this development and assures that the PSC shall continue to review Nigeria’s protocols based on global developments, science and national experience.\nThe PSC shall be elaborating on all these at our next regular briefing."
  },
  {
    "headline": "2022 Budget Proposal Passes Second Reading In Senate",
    "summarized_story": "The 2022 budget proposal has passed the second reading in the Senate.\nThe passage through the second reading follows a debate by federal legislators on the budget.\nPresident Buhari had on Thursday last week presented an N16.39 trillion budget proposal for the 2022 fiscal year.\nOut of the total expenditure of N16.39 trillion naira proposed for the Federal Government in 2022, N768.28 is for statutory transfers; N6.83 trillion is for non-debt recurrent costs; and N4.11 trillion.\nThey are also seeking more information from MDA’s on the use of service-wide votes in the budget which they say is mostly hidden."
  },
  {
    "headline": "Anambra Deputy Governor Defects To APC",
    "summarized_story": "The Deputy Governor of Anambra State, Dr Nkem Okeke, has defected to the ruling All Progressives Congress (APC).\nOkeke was led to the President by the APC Caretaker Committee Chairman and Yobe State Governor, Mai Mala Buni, and Imo State Governor, Hope Uzodinma.\nGovernor Uzodinma briefed State House correspondents shortly after the new APC member was presented to the President.\nMeanwhile, the leadership of the APC has inaugurated the party’s State Congress Committee chairmen and secretaries.\nHe also appealed to the newly inaugurated party officials to work hard and prevent disagreements that could affect the party’s fortunes in 2023."
  },
  {
    "headline": "Court Slams N200,000 Fine On Fani-Kayode, Threatens To Revoke His Bail",
    "summarized_story": "The prosecutor told the court that on July 15, the prosecution had moved the court to adjourn the matter for a re-arraignment of the defendants.\nShe said that on October 11, the prosecution received a letter from the second defendant informing them that he had been given bed rest.\nThe prosecutor told the court that these letters by the second defendant had become numerous and had also become an excuse for him to evade court.\nHe urged the court to kindly grant an adjournment in favour of the second defendant.\nThe court then asked the defense counsel to take one of two options which were: to either revoke the bail of the second defendant or to impose a fine of N200,000 to be paid before the next trial date."
  },
  {
    "headline": "Northern PDP Leaders Hold Consensus Meeting Ahead Of National Convention",
    "summarized_story": "Leaders of the Peoples Democratic Party (PDP) from the North have held a consensus meeting ahead of the party’s forthcoming national convention.\nThe meeting held on Wednesday at the Bauchi State Governor’s Lodge in the Asokoro area of the Federal Capital Territory (FCT).\nChairman of the Convention Organising Committee and Adamawa State Governor, Umaru Fintiri, disclosed that the meeting had been adjourned till Thursday to allow for further consultations.\nOn September 9, the PDP leadership set up a national zoning committee to zone national offices to be contested by all PDP members.\nThe recommendations of the committee were later ratified by the PDP’s National Executive Committee at its meeting held on Thursday last week."
  },
  {
    "headline": "CBN warns financial institutions against BVN violations, sets N2m fine",
    "summarized_story": "Financial institutions and consumers who violate Bank Verification Numbers (BVN) will face consequences, the Central Bank of Nigeria said on Wednesday.\nThis was stated in a circular sent to all deposit money banks, mobile money operators, super agents, and payment service providers on Tuesday, headlined “Issuance of the updated regulatory framework for Bank Verification Number operations and watch-list for the Nigerian banking industry.”The CBN said it would ensure all operated accounts/wallets (except Tier 1) (including accounts/wallets (except Tier 1) opened through agents) were linked with the signatories’ BVNs within 24 hours of NIBSS making BVN available.\n“Misuse of the BVN watch-listing process for victimisation; improper linking of accounts/wallets (except Tier 1); and other infraction(s), as may be determined by the CBN.”Within 180 days of the issuance of this framework, operators must “enroll all mobile money wallets (excluding Tier 1) users on the BVN database and link their wallets (except Tier 1) with their BVNs.\n“Ensure that BVN details of all signatories, directors, and beneficial owners are linked to their respective non-individual accounts/wallets (except Tier 1).”Non-resident non-Nigerian directors of corporate accounts must also obtain a BVN, according to the CBN."
  },
  {
    "headline": "Sports ministry denies sharing of NBBF's donation, says money is intact -",
    "summarized_story": "The Ministry wishes to make the following clarifications :1.The $230,000 Dollars donated to the Basketball teams by the Banks under the Adopt-a-Team programme of the Ministry is intact in the Nigeria Basketball Federation’s (NBBF) official domiciliary account domiciled with the Central Bank of Nigeria (CBN).\n2.That only the 12 female Team members of D’Tigress have supplied their foreign account numbers.\nThe Ministry waited for the account numbers of the Male Team to be supplied so that the processing of payments can be one off as requested by the CBN.\n3.The Ministry has requested the CBN to commence the processing of the payment to the Female Basketball Players immediately.\nMinistry wishes to state further that all outstanding -Olympics and Paralympics Games allowances and bonuses are being processed and only slowed down by funds availability."
  },
  {
    "headline": "'No APC contestant in Kano will be screened without undergoing drug test'- Ganduje",
    "summarized_story": "Governor of Kano state has ordered that all candidates for APC executive council positions take a mandatory drug test.\nThirteen candidates for councillorship in Kano tested positive for hard drugs earlier this year.\nOn January 8, 13 councillorship aspirants in Kano tested positive for hard drugs.\nAccording to the APC secretary in Kano, Ibrahim Sarina, the ruling party had, through the NDLEA, conducted tests on the candidates.\nMr. Sarina had disclosed that the 13 councillorship candidates who tested positive were replaced."
  },
  {
    "headline": "Court fines Fani-kayode N200,000 for stalling re-arraignment",
    "summarized_story": "Their trial had initially commenced in 2016, before Justice Muslim Hassan, who has now been elevated to the Court of Appeal.\nAnother plea was then taken before the second judge, Justice Aikawa.\nBut, the case file was again transferred to a third judge, Justice Osiagor, for the matter to start afresh, as Justice Aikawa was transfered to the Akure division of the court.\nAt the resumed hearing of the matter in Wednesday, the prosecutor, Bilikisu Buhari, applied for the bail initially granted Femi Fani-kayode to be revoked, as he was not in court to take his plea before Justice Osiagor.\nThe trial judge, upon perusing the Court’s records, discovered that the defendant in question had been absent from previous sittings for five times, and noted that this stalled the smooth hearing of the charge."
  },
  {
    "headline": "Fashola Decries Nigeria’s Dependence on Foreign Vaccines – Trending with Ojy Okpe",
    "summarized_story": "Meanwhile, Nigeria’s female basketball team D’Tigress accused the Minister of Youth and Sports Sunday Dare of diverting $100,000 dollars that was donated to the team .\nThe players also accused the president of the Nigeria Basketball Federation Musa Kida of not paying them their allowances.\nIn another development, Minister of Works and Housing, Babatunde Fashola, has come under fire on social media for saying that Nigeria cannot continue to depend on other nations for vaccines during outbreak of pandemics.\nAn appointment letter that is now circulating on social media, issued by the Vice President of the University of Uyo’s Student Union, Blessing Jaja, reveals that she approved the appointment of 18 aides for the smooth running of activities in her office.\nThe letter which has since gone viral has generated a debate on social media with many saying that students are already emulating the political ethos in Nigeria"
  },
  {
    "headline": "‘Biggest Series Launch’: Squid Game Knocks Bridgerton off Netflix Top Spot",
    "summarized_story": "We all knew it was coming, but now it’s official: Squid Game has become Netflix’s biggest ever series launch.\nFrom celebrities to sports stars, everyone’s been talking about Squid Game.\nWarning – the rest of this article contains some mild spoilers…Why is Squid Game so popular?\nChloe Henry is a fan of Korean shows and says Squid Game stands out from the others.\n“Other Korean shows can be quite modest, they don’t show blood, nudity and they blur out weapons."
  },
  {
    "headline": "Rebuffing Texas Governor, American Airlines, Southwest Airlines Stand By Vaccine Mandate",
    "summarized_story": "American Airlines and Southwest Airlines both say they’ll defy Texas’ new COVID-19 vaccine mandate ban and adhere to the federal mandate from President Biden, Bloomberg reports.\nAfter Texas Gov.\nGreg Abbott (R) on Monday issued a new executive order banning “any entity” from imposing COVID-19 vaccine mandates, American Airlines said, “We believe the federal vaccine mandate supersedes any conflicting state laws, and this does not change anything for American,” per Bloomberg.\nSimilarly, Southwest said, “We would be expected to comply with the president’s order to remain compliant as a federal contractor.” Both airlines have their headquarters in Texas and are requiring employees to get vaccinated against COVID-19.\nAmerican will require its workers to get vaccinated by Nov. 24, while Southwest workers have until Dec. 8."
  },
  {
    "headline": "Top UN Court Sides with Somalia in Sea Border Dispute with Kenya",
    "summarized_story": "The United Nations’ top court has awarded Somalia control of most of a potentially oil- and gas-rich chunk of the Indian Ocean after a bitter legal battle with neighbouring Kenya over their sea border.\nThe court rejected Kenya’s claim of the maritime boundary it sought, saying Kenya had not consistently maintained it.\nBut the court rejected Somalia’s pursuit of reparations after the country alleged that some of Kenya’s maritime activities had violated its sovereignty.\nSomalia filed the ICJ case over the countries’ maritime boundary in 2014, contributing to their strained relations.\nIt also found “no compelling evidence that Somalia has acquiesced” to Kenya’s claim of a maritime boundary along a parallel line of latitude."
  },
  {
    "headline": "Ronaldo Grabs Hattrick as Portugal Thump Luxemburg",
    "summarized_story": "Cristiano Ronaldo scored a hat-trick as Portugal recorded an emphatic World Cup qualifying win over Luxembourg at the Estadio Algarve.\nThe victory leaves Portugal second in Group A, a point behind Serbia who they host in their final game.\nRonaldo knocked in two penalties and rounded off the scoring with a header as he recorded his 58th hat-trick for club and country.\nFernandes superbly drove a low shot into the bottom-right corner as the hosts went 3-0 up inside 18 minutes.\nPortugal travel to the Republic of Ireland in their penultimate Group A match before facing Serbia."
  }
]