[
  {
    "headline": "South-East presidential aspirants not assertive, need to work harder – Ohanaeze",
    "summarized_story": "The apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, has called on presidential aspirants from the South-East to be more assertive and work harder in order to brighten the chances of the region to produce the next president of the country in 2023.\nFormer Senate President, Senator Anyim Pius Anyim; pharmacist, Sam Ohuabunwa, ex-governor of Anambra State, Peter Obi, are among presidential aspirant from the region.\nHe explained that the insinuation that Igbo presidential aspirants were not assertive and losing steam in their campaign was unfounded, adding that he would become the nation’s president, come 2023.\nHe said, “It’s not true, that Igbo presidential aspirants have lost steam and are not consulting and campaigning again.\nIt’s not true that Igbo presidential aspirants are not doing anything about their ambition."
  },
  {
    "headline": "Ekiti moves to rid streets of miscreants, mentally ill persons",
    "summarized_story": "Ekiti State Commissioner for Women Affairs and Social Development, Maryam Ogunlade, says no fewer than 11 mentally challenged persons and miscreants have been removed from the streets of Ado and Ikere Ekiti for rehabilitation by the state government.\nThe commissioner, in a statement titled, ‘Ekiti rounds up mentally challenged for rehabilitation’, added, “The move is also targeted at boosting security of lives and property of the people.\nInvestigations have shown that kidnappers and miscreants sometimes disguise as beggars and lunatics to carry out their nefarious activities.\nAccording to her, categories of persons targeted during the exercise included street beggars, destitute persons, miscreants.\n“The exercise is also aimed at providing proper care as well as psycho-social support for genuine beggars, miscreants and mentally challenged persons."
  },
  {
    "headline": "Group petitions FG over ritual killings, 7,000 signatures signed",
    "summarized_story": "The Nigerian Global Affairs Council has petitioned the Federal Government, asking it to sentence to death by hanging without the option of fine, anyone found guilty by a court for ritual killings.\nIn their petition on change.org, the group suggested that an Anti-Ritual Activities Bill be put in place to curb the spate of the killings which it said, had made women endangered species.\n“Ritual activities that include the administrator (babalawo or herbalist) of such ritual killings, the accomplice to such ritual killings, and the beneficiary of such ritual killings will be sentenced to immediate death by hanging without with an option for an appeal if their murderous crime of ritual killings is proved beyond every reasonable doubt.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Ensuring gender budgeting for sustainable, inclusive growth in Nigeria",
    "summarized_story": "Introducing gender budgeting at the federal government level is important because budgetary decisions on both revenue and expenditure are made at this level.\nAt these levels, there is great potential to use participatory gender budgeting approaches involving the local population.\nIndeed, the effective implementation of gender budgeting requires political commitment matched with a technical capacity for gender mainstreaming.\nResearchers therefore consider gender budgeting to be ‘a mechanism for establishing whether a Government’s gender equality commitments translate into budgetary commitments’.\nMore so, a true performance-oriented approach to budgeting only happens when gender budgeting is integrated in performance budgeting."
  },
  {
    "headline": "MeCure, Quickraiz partners to provide affordable cancer care",
    "summarized_story": "By Chioma ObinnaLeading diagnostic and healthcare company, Me Cure Healthcare Ltd, has its partnership with Quickraiz, a donation-based crowdfunding platform to provide accessible funding and treatment to cancer patients in need of PET/CT treatment in Nigeria.\nWith this partnership, patients seeking cancer treatment and management at Me Cure’s PET/CT Centre in Lagos who cannot afford it would be provided with alternative financing options one of which is a crowdfunding drive on the Quickraiz platform to raise funds for their care at a discounted rate.\nMeCure recently launched their Tomography and Computed Tomography (PET/CT) Centre in Lagos, Nigeria, the first PET/CT Centre in West Africa with Discovery IQ 3-Ring imaging technology for accurate diagnosis and to enhance cancer treatment for patients.\nPET/CT, which is a combination of PET and CT scan, treatment outcomes will be enhanced and survival rate will be increased as the machine can help to detect cancer cells at a very early stage.\n“It is a secure, user-friendly platform which allows fundraisers receive donations both in local and foreign currencies”"
  },
  {
    "headline": "9mobile canvasses Fact-Based approach to mental health issues",
    "summarized_story": "By Chioma ObinnaIn continuation of its sustained efforts towards creating awareness and sensitizing the public on health-related issues, the 5th edition 9mobile health talk series tagged: “Mental health; the myth, the challenge & recovery” is calling for a fact-checked approach to mental health-related issues.\nKadiri highlighted the myths around mental health challenges and more importantly, what the recovery process entails, describing mental health as the ability to be productive, fruitful and be able to give back to society.\nShe noted that 1 in every 5 persons in Nigeria has a mental illness; with data showing that mental illness starts before the age of 14 in some instances.\n“Everybody has mental health but not everybody has a mental illness which is a medical condition as it were.\nIt will therefore be correct to conclude that nobody has immunity against mental health disorder,” she stated."
  },
  {
    "headline": "2023: Nigeria needs pundits in economy — Expert",
    "summarized_story": "By Fortune Eromosele, AbujaAhead of the 2023 general elections, an expert in economy, Executive Director, Initiative for Leadership and Economic Watch in Nigeria, ILEWN, Agbongbolor Splendour, has said Nigerians need leaders who are professionals in handling economic issues.\nAccording to him, Nigeria is at a critical stage of electing leaders who would alleviate the issues bedevilling the country as well as needing experts in the economy.\nHe said, “The call for sound leadership that can take the nation from this point is very sacrosanct at this moment.\nWe as civil society practitioners feel we should be contributing to their mandates.\nOn his part, Executive Director of the National Lottery Trust Fund, Bello Maigari, said, the Lottery Trust Fund remains an integral fragment in Nigeria’s quest for economic development."
  },
  {
    "headline": "2023: Youths declare Karma for Taraba House of Assembly",
    "summarized_story": "By Fortune Eromosele, AbujaAs the 2023 general election gathers momentum, a group, Ussa Youth in Diaspora, has endorsed Rimamsikwe Karma for the Taraba State House of Assembly to represent the Ussa local government area.\nRimamsikwe Karma to Contest for the State House of Assembly,” in Abuja.\nHe said: “It is on record that despite the challenges the Ussa Local Government Executive chairman, Hon.\nRimamsikwe H. Karma (JP) into the state House of Assembly when he picks our calls.\nKarma who is also known as the Village Chairman and the grassroot Ambassador accepts our request for the betterment of Ussa Local Government Area.”"
  },
  {
    "headline": "FAAN gives update on bandits attack at Kaduna airport",
    "summarized_story": "The Federal Airports Authority of Nigeria (FAAN) has expressed regrets as bandits attacked the Runway 05 axis of Kaduna airport on Saturday.\nRecall that bandits on Saturday stormed Kaduna State Airport, stopping an aircraft from taking off.\nA statement issued on FAAN’s Twitter handle said, a combined team of anti-banditry military personnel and Crime investigation unit of FAAN Aviation Security Department swiftly intervened for rescue operation.\nFAAN said normalcy has since been restored at the airport and it recovered two motorbikes abandoned by the bandits.\n“Additionally, a heavy reinforcement team from the Nigerian Defence Academy is on ground to ensure safety and security of airport workers/users."
  },
  {
    "headline": "White collar jobs unavailable, go for skills acquisition – NYSC DG tells corps members",
    "summarized_story": "According to the DG, through programmes such as SAED, corps members can acquire skills that will sustain them in their future endeavors after completing their one year mandatory service to the nation.\nHe reminded the corps members that they were not only representing themselves but also their parents as well as their various institutions of learning.\nThe NYSC DG made the call at the swearing-in program of the corps members in Katsina state.\nHe admonished the corps members to take the NYSC SAED in-camp training seriously.\nThe DG also drew the attention of corps members to the existence of COVID-19 pandemic, urging all corps members to take the vaccine and adhere strictly to the COVID-19 safety protocols."
  },
  {
    "headline": "Omokri blasts El-Rufai, APC as bandits storm Kaduna Airport, stop plane from taking off",
    "summarized_story": "Reno Omokri, a socio-political activist, has reacted to bandits’ attack at Kaduna Airport on Saturday.\nOmokri lamented that bandits were taking over Kaduna Airport while the All Progressives Congress, APC, embarked on its national convention.\nIn a tweet, the former aide to ex-President Goodluck Jonathan, also berated Governor Nasir El-Rufai of Kaduna, following the attack.\nHe wrote: “Can you imagine bandits taking over the Kaduna airport and preventing planes from taking off?\nThe same man who was paying these bandits?”Reports had it that bandits on Saturday stormed Kaduna State Airport, stopping an aircraft from taking off."
  },
  {
    "headline": "Soun stool: Group accuses kingmakers, LG officials of bribery to influence selection of new monarch",
    "summarized_story": "DAILY POST gathered that over 12 candidates have already indicated interest to emerge as the next Soun of Ogbomoso.\nARG has, however, accused the kingmakers and the LG officials of collecting money in order to influence the selection of the new monarch.\nOyedepo on behalf of ARG urged governor Seyi Makinde of the state to, without wasting more time, stop the selection process of the new monarch.\n“It is sad that the selection process is taking this questionable and ignominious dimension.\n“There is another rumor making the rounds that the said Prince also bought a brand new car for the arrowhead of the Ogbomoso Kingmakers."
  },
  {
    "headline": "War: You’re not our enemies – Biden tells Russians",
    "summarized_story": "US President, Joe Biden, has told Russians that they are not the enemies, but their President, Vladimir Putin.\nBiden delivered a speech at the Royal Castle in Warsaw, Poland on Saturday where he also called for the removal of Vladimir Putin as Russian President.\nBiden also said Putin’s actions in Ukraine are “not the actions of a great nation” and called on Russians who were alive during the Soviet Union and heard of it from their families to speak up.\n“This is exactly what the Russian army is doing in Ukraine right now.”“This is not who you are.\nThis war is not worthy of you, the Russian people,” Biden said."
  },
  {
    "headline": "Ensure most popular candidates emerge, de-emphasise money politics, Buhari tells APC",
    "summarized_story": "President Muhammadu Buhari, Saturday night, admonished the new National Working Committee (NWC) of the All Progressives Congress (APC) de-emphasise money politics and always allow the most popular candidates to emerge.\n“However, I wish to enjoin the incoming National Working Committee to as a matter of policy, promote internal democracy and always respect the wishes of the people.\nWe must de-emphasize money politics, and subject party primary and elections into public offices, to the highest bidder syndrome.\nWe should also promote equal opportunities and respect for the laws guiding the elections to stand us out as Nigeria’s ruling Party.\n“l passionately appeal to you all to support the incoming National Working Committee (NWC) to promote unity and avoid sentiments that are capable of causing disaffection and disunity."
  },
  {
    "headline": "APC convention: Buni Caretaker members missing on unity list",
    "summarized_story": "Two members of the Caretaker/Extra-Ordinary Convention Planning Committee (CECPC), contesting for National Working Committee (NWC) positions at the National Convention of the ruling All Progressives Congress (APC) are missing from the final unity list of the party.\nFrom the unity list sighted by The Nation, Senator Abdullahi Adamu (Nasarawa) becomes the National Chairman, Otunba Iyiola Omisore (Osun) becomes the National Secretary.\nChief Enaukwu was the National Vice Chairman (South East) of the party under the Chief John Oyegun and Comrade Adams Oshiomhole leadership.\nMuazu Bawa Rijau of Niger state made the list as National Vice Chairman, North Central and ComradeMustapha Salihu (Adamawa), National Vice Chairman, North East, Isaacs Kekemeke, (Ondo) National Vice Chairman, South West, Victor Giadom, (Rivers) national vice Chairman, South South while the immediate past Director General of the Progressive Governors Forum (PGF), Salihu Lukman (Kaduna) becomes the National Vice Chairman, North West.\nDr Ijeoma Arodiogbu (Imo) will serve as the new national vice Chairman,South East."
  },
  {
    "headline": "Police gun down four bandits in Benue community",
    "summarized_story": "Police gun down four bandits in Benue communityThe Benue State Police Command has said it gunned down four bandits in Ukum Local Government Area of the state during an operation on Saturday.\nAccording to him, the weapons recovered from them included one Ak47 rifle, a G3 rifle, a locally made pistol as well as ammunitions and charms.\nSpeaking to journalists at the state police headquarters in Makurdi, Abass pledged to rid the state of crime, with Governor Samuel Ortom’s support.\nREAD ALSO: Herdsmen kill four in Benue communityThe corpses of the four were displayed at the command headquarters in the presence of Benue State Governor Samuel Ortom.\nCP Abbass disclosed that the bandits were ambushed and killed while on their way to attack a village called Gbagire, in Ukum."
  },
  {
    "headline": "APC convention: Fears over consensus target failure",
    "summarized_story": "There were fears on Saturday that the ruling All Progressives Congress (APC) may not have been able to fully realise its consensus targets as some of its aspirants were seen rigorously lobbying and campaigning at the Convention ground, Eagle Square, Abuja.\nPresident Muhammadu Buhari had solicited party leaders and members to strive to achieve consensus for all positions in the party ahead of the convention.\nHe held meetings with various critical stakeholder groups within the party, including the Progressive Governors Forum (PGF), founding fathers of the party, chairmanship aspirants, among others, in the days leading to the all-important convention."
  },
  {
    "headline": "BREAKING: One killed as bandits attack Kaduna Airport, ground Lagos-bound aircraft",
    "summarized_story": "Armed bandits numbering over 200 invaded the Kaduna International Airport on Saturday, shooting dead a security officer of the Nigerian Airspace Management Agency (NAMA).\nThe Nation gathered that the attack forced the authorities to temporarily shut down the Airport, while the military battled the gunmen.\nA source at the Airport told Our Correspondent that the bandits had vowed to keep the airport shut.\nAccording to the source, “the bandit’s attack started around 12:00am today (Saturday).\nThe bandits were alleging that the military personnel took away their cattle."
  },
  {
    "headline": "Falconets defeat Senegal 4-1 to qualify for Female U20 World Cup in Costa Rica",
    "summarized_story": "From Tony Osauzo, BeninThe Falconets of Nigeria have defeated the Under 20 female team from Senegal 4 goals to 1 at the Samuel Ogbemudia Stadium in Benin to qualify for the under 20 world cup holding in Costa Rica in August this year.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe technical crew will review the plan and make changes where necessary as we are going to a bigger stage.\n‘I believe the goal of the under 18 and Under 20 team is to groom players for the National team.\nIf you look at this team and the Flamingos, they are all home-based players or at least 90 per cent home-based players."
  },
  {
    "headline": "Bandits shut down Kaduna airport, kill NAMA security personnel",
    "summarized_story": "From Noah Ebije, KadunaBandits said to number over 200 on Saturday afternoon took over the runway of the Kaduna International Airport, killing security personnel of the Nigerian Airspace Management Agency (NAMA).\nThe bandits reportedly forced the agency to temporarily shut down activities at the airport while the military battled the gunmen.\nThe bandits were alleging that the military personnel took away their cattle.\n‘Then, shortly after that, some NAMA staff went to check some of their equipment, then these people (bandits) appeared and started shooting.\nNow, they had shut down the airport.’Many of the staff reportedly fled the airport, as extra military personnel were deployed to the scene on clearance operation with an Armoured Personnel Carrier."
  },
  {
    "headline": "APC Convention: Clash between Okorocha and Uzodinma supporters averted",
    "summarized_story": "From Romanus Ugwu, AbujaA potential face-off between former governor of Imo State, Senator Rochas Okorocha and agitated supporters of his successor and incumbent governor, Hope Uzodinma, was tactically averted at the Abuja venue of the National Convention of the All Progressives Congress (APC).\nSenator Okorocha, who arrived at the Eagle Square venue of the convention at around 2:53 pm, was given a rousing welcome as he moved from one state pavilion to the other.\nAcknowledging the cheers from delegates, especially from the North, the senator’s smile had dimmed on getting close to his home state’s stand, where Governor Uzodinma was addressing Imo delegates.\nSensing trouble from supporters loyal to the governor, Senator Okorocha was shielded by his security details and supporters to make a detour to the Enugu stand.\nShortly after avoiding the agitated supporters of the Imo governor, the senator did not return to sit with the state delegates."
  },
  {
    "headline": "Explosion rocks Kaduna community, 2 injured",
    "summarized_story": "From Noah Ebije, KadunaA suspected Improvised Explosive Device (IED) exploded on Saturday and injured two persons in Yazufa Junction, Hayin Danmani, Igabi local government area of Kaduna State.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThey were also said to have disabled a second device found planted in a motorcycle in the area.\nThey also disabled a second device found planted in the motorcycle.\n“Governor Nasir El-Rufa’i expressed shock and sadness at the report, and wished the injured persons a speedy recovery."
  },
  {
    "headline": "BREAKING: APC Convention turns rowdy, crowd mobs Amaechi",
    "summarized_story": "From Romanus Ugwu, AbujaThe national convention of the All Progressives Congress (APC) in the afternoon turned very rowdy with certain youths using cutlass and sticks freely at the attendees outside the Eagle Square, venue of the exercise.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nRegrettably, it took the intervention of combined team of security agents to shield the former governor of Rivers State, Hon Rotimi Amaechi and bring him into the venue.\nMeanwhile, former governor of Edo State, Comrade Adams Oshiomhole, received an overwhelming cheers and standing ovation from the delegates on arrival into the venue of the convention.\nComrade Oshiomhole, who made a triumphant entry inside the venue at exactly 2.50pm, acknowledged cheers from the crowd of supporters until he got to Edo State pavilion."
  },
  {
    "headline": "Buhari Arrives Eagle Square, APC Convention Commences",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has arrived the Eagles Square, Abuja, venue of the extra ordinary national convention of the ruling All Progressives Congress (APC).The President whose official car got to the VIP wing of the convention venue at about 8.23pmmade straight to the bullet proof wing of the Eagles where the Vice President Yemi Osinbajo who had earlier arrived at 8pm and other top government officials were seated.Others in the VIP wing include Senate President, Dr Ahmad Lawan; Speaker of the House of Representatives, Hon Femi Gbajabiamila; former governor of Lagos State and Presidential aspirant of the APC, Senator Bola Ahmed Tinubu, 22 state governors and party members from the two chambers of the National Assembly.With the arrival of President Buhari about five hours behind schedule, the APC convention, during which new set of national leaders to run the affairs of the party for the next four years will be elected, will start in earnest.\nDetails Shortly…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Updated: APC Consensus Candidates’ List Emerges",
    "summarized_story": "The list of consensus candidates seen by THISDAY Saturday night was signed by all the APC governors.\nTop on the list is Senator Abdullahi Adamu (Nasarawa State) who emerged as the consensus candidate for the position of national chairman.\nOther consensus candidates are Senator Abubakar Kyari (Borno), Deputy National Chairman North; Chief Emma Eneukwu (Enugu), Deputy National Chairman South); Otunba Iyiola Omisore (Osun), National Secretary; Barrister Festus Fuanter (Plateau), Deputy National Secretary; ; Muhazu Bawa), National Vice Chairman North Central; and Mustapha Salihu (Adamawa), National Vice Chairman NorthEast).\nDiriwari Akedewei (Bayelsa), National Ex-officio South South; Mrs Bunmi Oriniowo (Ekiti), National Ex-officio South West; Yakubu Mohammed Adamu (FCT), Zonal Secretary North Central; Mohammed Wali Shettima (Yobe), Zonal Secretary North East; and Barrister Bello Goronyo (Sokoto), Zonal Secretary North West.\nAlso on the consensus candidates’ list are: Lamido Mohammed (Gombe), Zonal Secretary North East; Musa Makafiya (Zamfara), Zonal Secretary North West; Mr Augustine Onyedebelu (Imo), Zonal Secretary South East; Ayo Afolabi (Osun), Zonal Secretary South West; Oluwatoyin Opawuye (Kwara), Zonal Secretary North Central; Hon."
  },
  {
    "headline": "Live Updates: APC National Convention 2022",
    "summarized_story": "Buni, also the outgoing Chairman, APC Caretaker/ Extra Ordinary Convention Committee (CECPC) said this at the APC National Convention on Saturday in Eagle Square, Abuja.\nOther consensus candidates are Senator Abubakar Kyari (Borno), Deputy National Chairman North; Chief Emma Eneukwu (Enugu), Deputy National Chairman South); Otunba Iyiola Omisore (Osun), National Secretary; Barrister Festus Fuanter (Plateau), Deputy National Secretary; ; Muhazu Bawa), National Vice Chairman North Central; and Mustapha Salihu (Adamawa), National Vice Chairman NorthEast).\nAlso on the consensus candidates’ list are: Lamido Mohammed (Gombe), Zonal Secretary North East; Musa Makafiya (Zamfara), Zonal Secretary North West; Mr Augustine Onyedebelu (Imo), Zonal Secretary South East; Ayo Afolabi (Osun), Zonal Secretary South West; Oluwatoyin Opawuye (Kwara), Zonal Secretary North Central; Hon.\nAhmed Attah (Kogi), Zonal Organising Secretary North Central; Abubakar Adamu Musa (Taraba), Zonal Organising Secretary North East; Salisu Uba (Zamfara), Zonal Organising Secretary North West; Dozie Ikedife (Anambra), Zonal Organising Secretary South East; Hon Blessing Agbome (Edo), Zonal Organising Secretary South South; Lateef Ibirogba (Lagos), Zonal Organising Secretary South West; Barrister John Okoho (Benue), Zonal Publicity Secretary North Central; Azobu Innocent Itapa (Ebonyi), Zonal Secretary South East; Dr. Ita Udosen (Akwa Ibom), Zonal Secretary South South; Vincent Bewaji (Ekiti), Zonal Secretary South West; Barrister Hadiza Aliyu (Kogi), Zonal Legal Adviser North Central; Barrister Dauda Chakpo (Taraba), Zonal Legal Adviser North East; Barrister Bashir Usaini Dutse (Jigawa), Zonal Legal Adviser North West; and Barrister Mayor Ogbona Earnest (Ebonyi), Zonal Legal Adviser South East.\n7:32pmThree Hours after, APC National Convention Yet to Take offDeji Elumoye in AbujaThe much-awaited national convention of the ruling All Progressives Congress (APC) billed for Saturday at the Eagles Square in Abuja is yet to commence more than three hours behind schedule."
  },
  {
    "headline": "Breaking: Terrorists Attack Kaduna Airport, Kill Security Guard",
    "summarized_story": "The terrorists reportedly shot and killed one of the airport’s security guards who was on the runway.\nAccording to her, “What happened was that, whether they wanted to come into the airport, but they shot a security guard on runway 05.\nUnfortunately they shot at the (runway), unfortunately their bullet hit the security guard on the head.\nThe military succeeded in chasing them away.”On Friday, terrorists reportedly attacked and killed about 50 people in nine villages in Giwa LGA.\n“I cannot confirm any death figure until we receive security reports from security agencies because they are our source of information."
  },
  {
    "headline": "Breaking: Akume, Yari, Al-Makura, Others Step down for Adamu",
    "summarized_story": "In line with President Muhammadu Buhari’s advice, six aspirants contesting the national chairmanship position of the All Progressives Congress (APC) have withdrawn from the race.\nIn a letter dated 25th March, which was signed by Senator George Akume, the aspirants said their decision was premised on the advice of the leadership of the party to pick Abdullahi Adamu as a cencensus candidate for the position.\nThe aspirants are: Senator George Akume, Senator Tanko Al-Makura, Abdilalziz Yari, Etsu Muhammed, Sani Musa Muhammed and Turaki Salifu Mustapha.\nSee the LetterShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "UK Government Freezes Chelsea Club Owner, Abramovich’s Assets",
    "summarized_story": "Abramovich is the owner of the English Premier League club, Chelsea, which is the current champion of FIFA Club World Cup and European Champions League.\nMarket Watch reports that other billionaires targeted by U.K. sanctions include Oleg Deripaska and Igor Sechin in the U.K.'s most high-profile sanctions sweep to date.\nMr. Abramovich has already said he is in the process of trying to sell his soccer club Chelsea FC and his London home.\nThe U.K. government said it will provide a special license that will allow Chelsea FC to continue to operate despite the sanctions.\n\"The U.K. will continue to lead global efforts to provide Ukraine with economic, diplomatic, humanitarian and defensive support,\" the U.K. government said."
  },
  {
    "headline": "VC protest: We don’t dialogue with touts, says OAU",
    "summarized_story": "The Obafemi Awolowo University (OAU) says it didn’t dialogue with those protesting against the appointment of its new vice-chancellor (VC) because it doesn’t engage with touts.\nBut locals in the varsity’s host community who favoured the installation of an Ife indigene had started a protest.\nAdvertisementThe protesters had shut OAU’s two major gates, preventing staff and students from either coming into or leaving the university.\nWe’re not supposed to engage anybody because we don’t engage touts,” he said.\nWe’re more enlightened than that.”A students union executive at OAU, who also spoke with TheCable Lifestyle, confirmed that activities had returned to the campus."
  },
  {
    "headline": "'Corps member wearing skirt not in our camp' -- Oyo NYSC reacts",
    "summarized_story": "The National Youth Service Corps (NYSC) in Oyo state has dismissed a viral video purportedly showing a corps member wearing a long skirt in its orientation camp.\nBut in the now-viral clip, the female corps member was seen donning a long white skirt.\nReacting in a statement, Olatoye Christy, the Oyo NYSC spokesperson, said the scene was not from the orientation camp in the state.\nAdvertisement“The attention of the management of the NYSC Oyo State has been drawn to the video that has gone viral in the social media showing an unidentified corps member that was purportedly spotted in NYSC Oyo State camp wearing a long white skirt instead of the conventional white short,” it read.\n“It is important to set the record straight that the scene was never captured in Oyo State camp."
  },
  {
    "headline": "NYSC kicks as lady claims Lagos camp rejected her over marital status",
    "summarized_story": "The National Youth Service Corps (NYSC) has dismissed a claim by Chidinma Simeon, a prospective corps member, that its orientation camp in Lagos rejected her due to her marital status.\n“Lagos camp wh(y) me, I was rejected to camp after registration because am married.\nMgbemena said there is no policy that prohibits married corps members from staying in the NYSC orientation camp.\nThere is no policy that stipulates that married corps member should not be in camp,” he said.\nAdvertisementThe NYSC spokesman added that corps members can only be excused from the camp if they are nursing mothers or pregnant."
  },
  {
    "headline": "NUC upgrades Sokoto college of education to varsity",
    "summarized_story": "The National Universities Commission (NUC) has upgraded the Shehu Shagari College of Education, Sokoto to a university.\nWith the upgrade, the institution will now be known as the Shehu Shagari University of Education.\n“This university is the first university of education in the entire northern states and number four in the country.\n“Tai Solarin University of Education, Ogun as the first, Delta State University of Education, Lagos State University of Education and now the Shehu Shagari University of Education.”AdvertisementAbubakar said that other education agencies such as JAMB, TETFund, and NYSC would be notified accordingly for the establishment of the new university.\n“We have been managing our resources as a state but we know how difficult it is to fund state university."
  },
  {
    "headline": "VIDEO: Man United legend Patrice Evra visits Oshodi under bridge, plays chess with children",
    "summarized_story": "Patrice Evra, the Manchester United football legend, on Saturday visited the under bridge axis of Oshodi in Lagos.\nAdvertisementDuring the surprise visit, the 40-year-old was seen playing chess with students of Chess in slums Africa.\nChess in slums Africa is a non-profit organisation known for using the game as a framework to promote education and raise champions from low communities.\nAdvertisementTunde Onakayo, founder of Chess in slums Africa, had earlier teased fans about his visit but did not disclose his name.\nOnakoya has become a viral sensation across social media platforms since he initiated Chess in slums Africa."
  },
  {
    "headline": "Digital Nomads: The pastor turned tech bro",
    "summarized_story": "The reason, Jay says, was that the lecturers in charge, at the time, knew nothing about the applications of tech.\nThis was 2018, mind you, but they said that tech wasn’t that important in the country, and that I should research something else.\nFor Jay, this event pushed him towards putting his degree to good use and becoming an all-round tech bro.\nHe doesn’t think his lecturers meant any harm, but he believes their lack of knowledge on the impact of tech will have damning consequences on the students they teach.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Okubanjo to step back from people decisions at Bento Africa",
    "summarized_story": "Bento’s board’s decision comes a few days after TechCabal exposed the harrowing experiences of ex-employees of payroll startup Bento Africa and how Okubanjo had allegedly been the orchestrator of that through direct and indirect bullying, verbal abuse, and threats to employees.\nOur responsibility and charter is to the Company, not the founders we invest in,” the board said in an email sent to all Bento employees, past and present.\nFurthermore, the board said that while Okubanjo is taking a back seat with immediate effect, an internal investigation into Bento’s workplace culture has begun.\nThe board claimed to have “…ensured that the current team is safe and free to speak freely.\nWith Love, Okubanjo admits to encouraging a work culture of “long workdays and weeks” and apologised for his abusive outbursts."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Oil price surges, as fire razes Saudi Aramco oil storage facility",
    "summarized_story": "The global oil price has risen as a new social media video shows a large fire outbreak at a Saudi Aramco storage tank facility in the Red Sea port of Jeddah.\nAs of 5:40 p.m. Nigerian time, Brent, the international benchmark against which Nigeria is measured, was $1.37 higher at $120.4 per barrel, while WTI was $1.28 higher at $113.6.\nThe blaze at the Aramco site, a competitor of Nigeria National Petroleum Company Ltd (NNPC) was captured on video and shared on Twitter and other social media platforms, and it is being blamed on an attack, but company officials were unavailable for immediate comment.\nRead also: OPEC+ pact helped stabilise oil prices, then Russia invaded UkraineHowever, since the beginning of the year, Houthi militants in Yemen have been heavily targeting the kingdom’s energy infrastructure.\nHowever, Riyadh has rejected calls from the United States and Europe’s consumer nations to increase oil production in response to higher prices caused by Russia’s invasion of Ukraine."
  },
  {
    "headline": "Bandits attack Kaduna airport, kill Navaids guard",
    "summarized_story": "Bandits on Saturday, attacked Kaduna airport, killing the guard at the site of Very high frequency omni-directional range (VOR), a Navigational Aids equipment belonging to the Nigerian Airspace Management Agency (NAMA).\nIt was also learnt that the attack, which happened at about 12 noon, prevented smooth take off of flights as staff scamper for safety.\nRead also: World Bank Group expresses investment interest in Lekki, Tin-Can PortsMatthew Pwajok, Managing director of NAMA who confirmed the attack said the guard of the site of the Navigational aids (Navaids) which is a kilometer away from the runway, was killed, adding that the technical staff ran for safety after guard was killed.\nIn March last year, staff quarters of the Federal Airports Authority of Nigeria (FAAN) at the Kaduna airport was attacked by gunmen who abducted some families in the process.\nAbout 12 people, including a staff of the Nigerian Airspace Management Agency (NAMA) and his entire family, together with a wife and kid of staff of Nigeria Meteorological Agency, NiMET, were kidnapped last year."
  },
  {
    "headline": "In memoriam: Grace Alele-Williams in five quotes",
    "summarized_story": "Grace Awani Alele-Williams, Nigeria’s first female university vice-chancellor of the University Of Benin, has passed on at the age of 89.\nBorn in Warri, Alele-Williams attended Government School, Warri, and Queen’s College, Lagos, graduating in 1949.\nFrom 1979 to 1985, she served as chairman of the Lagos State curriculum review committee and Lagos State examinations boards.\nRead also: Obaseki, UNIBEN mourn Grace Alele-Williams, Nigeria’s first female Vice ChancellorShe became Vice-Chancellor of the University of Benin in 1985 and ended in 1992.\nGrace Alele-Williams immortalised in five quotes“To the elderly ones, you are retired but not tired."
  },
  {
    "headline": "Putin And The Corruption Of Power – Nigerian Observer",
    "summarized_story": "We are all creatures of emotions, we are as regulated by primordial instincts and idiosyncratic biases as by reason.\nThe argument today is that democracy and freedom are out of sync with the realities of modern states.\nDoes it not portend universal danger that one man could rally a military power like Russia into war?\nDoes it not bother a sane man that there are no institutions inside Russia that can checkmate or even mildly regulate Putin?\nPutin is pure, unadulterated evil and trying to defend him amounts to demons in search of logic and trying cosmos out of chaos."
  },
  {
    "headline": "Obaseki mourns passing of renowned mathematician, UNIBEN ex-VC, Prof. Alele-Williams – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of renowned mathematician and former Vice Chancellor of the University of Benin (UNIBEN), Prof. Grace Alele-Williams.\nThe governor, in a statement, described Prof. Alele-Williams as an Amazon, who tread where others dreaded, hailing her unmatched devotion to national development.\nAccording to him, “It is with a heavy heart that I received the sad news of the passing of renowned academic and administrator, Prof. Grace Alele-Williams.\nThe governor said Prof. Alele-Williams was a thoroughbred academician who throughout her life left an indelible mark of dutiful service, hard work, diligence and determination.\nHe said, “As the first female Nigerian to earn a doctorate degree in mathematics, Prof. Alele-Williams was a woman of many firsts."
  },
  {
    "headline": "Obaseki reforms: $500m investment in oil palm plantations boosts Edo’s agric sector – Nigerian Observer",
    "summarized_story": "This was disclosed by the Edo State Governor, Mr. Godwin Obaseki, during a chat with journalists, noting that the reforms initiated by the state government have led to an improved business environment.\nAccording to him, “In agriculture, we have attracted almost $500 million investment into palm oil cultivation having allocated the first phase of 60,000 hectares of land under the Edo State Oil Palm Production Programme (ESOPP).\n“There has been a deliberate emphasis on strengthening partnership with the private sector, from which we have reaped the immense benefit.\nWe signed a Power Purchase Agreement (PPA) with Ossiomo Power Company to provide stable power to government institutions and to also drive the state’s industrial sector.\nCurrently, there is stable electricity to power public institutions and infrastructure in metropolitan Benin City.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki, others celebrate Prince Okojie at 100 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki and his Chief of Staff, Hon.\nOsaigbovo Iyoha led other top government functionaries to the 100th birthday celebration of Prince (Hon.)\nThe governor noted, “We are celebrating you today because you are a very special person.\n“You supported me during my election, you prayed for me, encouraged and stood by me during and after the election.\nI am happy that we are celebrating you today at 100 years.”He further added, “There are not so many people in Edo State and Nigeria that have attained 100 years."
  },
  {
    "headline": "APC Convention: Adamu gets nod of other candidates, as Lagos draws consensus list",
    "summarized_story": "Abdullahi Adamu, former Nasarawa State governor, has gotten all clear to emerge as the national chairman of the All Progressive Congress (APC).\nThis is as six other six candidates vying for the position at the party’s ongoing convention, have stepped down from the contest.\nThe former candidates said they decided to back Adamu, who is the candidate of President, Muhammdu Buhari, as their consensus candidate.\nThe decision of the Lagos APC was announced by the party chairman, Pastor Cornelius Ojebabi, during a meeting organised for party chieftains and delegates at the Lagos Governor’s Lodge, Abuja by Governor Babajide Sanwo-Olu.\nThe dinner was attended by Sanwo-Olu, his deputy, Dr. Obafemi Hamzat; Ojelabi; members of the Governance Advisory Council, the apex leadership body of Lagos APC; members of National Assembly from Lagos State; Lagos State House of Assembly members; State Executive Council members and Chairmen of the Local Governments in Lagos State, among others."
  },
  {
    "headline": "Now that Peter Obi has declared for President, By Moses Ochonu",
    "summarized_story": "You say the Igbo are not united, as if the other groups that have produced presidents are united.\nWhat you didn’t say is that you’re campaigning for a non-Igbo president.\nNothing wrong with that, but be honest and don’t knock the nation-building imperative of having a competent Igbo as president in order to make the case for your preferred non-Igbo candidate.\nNow that Peter Obi, a competent, credible Igbo politician with national appeal, has declared for the presidential contest, I wonder what your new talking points will be.\nYou say you don’t just want an Igbo president but that you’d be happy with a president of Igbo extraction who is competent."
  },
  {
    "headline": "Second Niger Bridge at 91% completion — FG",
    "summarized_story": "Babatunde Fashola, minister of works and housing has said the Second Niger Bridge is now at 91 per cent completion.\nHe said the Second Niger Bridge was one of the cardinal projects of President Muhammadu Buhari’s-led administration.\nThe Minister said that 1,486 people have been directly employed for the Second Niger Bridge while another 8,110 indirect jobs have been created.\nThe projects are Abuja-Kaduna-Zaria-Kano Expressway (375km): N797 billion, Second Niger Bridge (11.59km): N206 billion and Lagos-Ibadan Expressway (127km): N310 billion.\nMeanwhile, the minister has warned motorists to shelve the temptation to exceed 100km/h on completed roads, to avoid crashes."
  },
  {
    "headline": "Customs confiscates truckload of donkey meat, cannabis in Kaduna",
    "summarized_story": "The Nigeria Customs Service in Kaduna has disclosed it seized a truck loaded with donkey meat and 12 sacks of cannabis worth more than N250 million in just a month.\nHamisu, according to NAN, disclosed that the service had similar recorded 144 seizures between February 24 and March 23, 2022.\nHe listed other items seized within the period including 3,700 sachets of tramadol and 460 sachets of D6 tablets.\n“The service also seized 13 sacks of foreign new shoes, 514 cartons of foreign spaghetti, 18 cartons of milky creamer, and 11 cartons of foreign expired biscuits,” the official added.\nHe said that one suspect had been arrested in connection with the donkey meat smuggling and had since been handed over to the police command in Kaduna for further investigation and prosecution."
  },
  {
    "headline": "BREAKING: APC Affirms Abdullahi Adamu As National Chairman",
    "summarized_story": "The Senator representing Nasarawa North, Abdullahi Adamu, has been affirmed as the new national chairman of the ruling All Progressives Congress (APC).\nADVERTISEMENTChairman of the Election Sub-Committee of the ongoing APC national convention in Abuja, Governor Abubakar Badaru of Jigawa State, made the announcement after a voice vote by delegates to affirm Senator Abdullahi, who was a consensus candidate for the position.\nAs at the time of this report, the affirmation of other members of the party’s National Working Committee (NWC) was ongoing including other officials of the party.\nADVERTISEMENT"
  },
  {
    "headline": "Troops Repel Bandits At Kaduna Airport, Flight Operations Resume",
    "summarized_story": "Kaduna State government has said that security forces repelled attacked in the vicinity of the Kaduna International Airport on Saturday.\nThe Commissioner, Ministry of Internal Security and Home Affairs, Samuel Aruwan, in a statement, said the security operatives attached to the airport responded and repelled the attackers.\nAruwan said airport operations resumed with scheduled flights departing after the incident.\nADVERTISEMENTThe statement also noted that security forces were conducting operations in the airport general area.\nADVERTISEMENTHe also said that Governor Nasir El-Rufa’i commended the security forces for their prompt response to the attack, and for repelling the attackers."
  },
  {
    "headline": "With 41m Members, APC Will Remain In Power – Buni",
    "summarized_story": "The outgoing chairman, Caretaker/Extraordinary Convention Planning Committee (CECC) of the ruling All Progressives Congress (APC), Mai Mala Buni, has said that with 41 million membership base, APC will remain in power beyond 2023.\nBuni stated this while giving his speech as the interim chairman of the party at the Eagle Square venue of the 2022 APC national convention ongoing in Abuja on Saturday.\nAccording to Buni, his leadership helped in rescuing the party from collapse and improved its fortune.\n“I am glad to state with all sense of fulfilment that we registered new members and raised the membership from 11 million members to over 41 million members in the country.\nOn the 2023 general election, Buni said internal disputes were normal and common, calling on all members of the party to support the new leaders."
  },
  {
    "headline": "With 41m Members, APC Will Remain In Power – Buni",
    "summarized_story": "The outgoing chairman, Caretaker/Extraordinary Convention Planning Committee (CECC) of the ruling All Progressives Congress (APC), Mai Mala Buni, has said that with 41 million membership base, APC will remain in power beyond 2023.\nBuni stated this while giving his speech as the interim chairman of the party at the Eagle Square venue of the 2022 APC national convention ongoing in Abuja on Saturday.\nAccording to Buni, his leadership helped in rescuing the party from collapse and improved its fortune.\n“I am glad to state with all sense of fulfilment that we registered new members and raised the membership from 11 million members to over 41 million members in the country.\nOn the 2023 general election, Buni said internal disputes were normal and common, calling on all members of the party to support the new leaders."
  },
  {
    "headline": "APC Convention: Buhari Arrives Eagle Square",
    "summarized_story": "President Muhammadu Buhari has arrived Eagles Square venue of the national convention of the All Progressives Congress (APC).\nThe President arrived at 8:23pm.\nHe was initially scheduled to arrive the venue at 2.45pm as contained in the programme of events of the convention.\nVice president Prof Yemi Osinbajo earlier arrived the venue of the convenrion at 8pm.\nFemi Gbajabiamila, had arrived one hour earlier before the vice president."
  },
  {
    "headline": "Buhari, others at APC's colourful National Convention (Photos)",
    "summarized_story": "President Muhammadu Buhari on Saturday attended the All Progressives Congress (APC) National Convention at the Eagles Square, Abuja.\nAt the convention were Vice President Yemi Osinbajo, Senate President, Dr. Ahmad Lawan; former APC Chairmen, John Odigie-Oyegun and Adams Oshiomhole; Senator Abdullahi Adamu, Governor Mai Mala Buni; Governor Babajide Sanwo-Olu, among others.\nAt the convention, Senator Adamu was elected new National Chairman of the APC."
  },
  {
    "headline": "Buhari at Convention: APC must remain strong, united to remain in power",
    "summarized_story": "President Muhammadu Buhari on Saturday called on members of the All Progressives Congress (APC) to remain united and strong and also support the incoming leadership of the party.\nSpeaking at the Eagle Square, Abuja, venue of the National Convention of the party, the President said: “This Convention is coming at a crucial time when we prepare for another round of a general election.\n“Therefore, the need to remain strong and united for the Party to exploit the rich and abundant potentials at its disposal cannot be overemphasized.\nWe appreciate the right to hold different opinions and aspirations, however, such differences must not be to the detriment of the Party.\n“l passionately appeal to you all to support the incoming National Working Committee (NWC) to promote unity and avoid sentiments that are capable of causing disaffection and disunity."
  },
  {
    "headline": "BREAKING: Abdullahi Adamu Emerges APC National Chairman, Enukwu Takes Deputy Chair, South",
    "summarized_story": "Senator Abdullahi Adamu, the former governor of Nasarawa State, has been elected as the next National Chairman of the All Progressives Congress, APC.\nAccording to the DAILY POST, he was elected through a consensus agreement after other contenders withdrew from the campaign.\nEmma Enukwu of Enugu State was also elected as the Deputy National Chairman, South, by consensus.\nAt the party’s ongoing national convention, the consensus candidates were ratified by voice vote.\nMore officials of the party who ran unopposed have been announced as of the time of posting this article."
  },
  {
    "headline": "Court Orders AMCON To Seize Babatunde Folawiyo’s Assets Over N727.9m Debt",
    "summarized_story": "Tijani Babatunde Folawiyo, a Lagos millionaire businessman, is having a bad time, as a Federal High Court in the state has granted an order for the Asset Management Corporation of Nigeria (AMCON) to seize his precious assets due to an outstanding N727.9 million debt.\nThe court order came after the law firm of Seun Omotoba filed an application with the court.\n“An order of the Honourable Court freezing the Bank accounts of the Respondent maintained with the following banks: Access Bank Plc, Citibank of Nigeria Limited; Diamond Bank Nigeria Plc; Ecobank Nigeria Limited; Enterprise Bank Limited; Fidelity Bank Plc; First Bank of Nigeria Limited, First City Monument Bank Plc, Guaranty Trust Bank Plc, Keystone Bank Limited, Skye Bank Plc, Stanbic IBTC Bank Plc, Standard Chartered Bank Nigeria Plc, Sterling Bank Plc, Union Bank of Nigeria Plc, United Bank for Africa Plc, Wema Bank Plc and Zenith Bank Plc.\nAnd for such further order or other orders as this Honourable Court may deem fit to make in the circumstances.”The presiding Judge, Lewis Allagoa after listening to the submission and written address filed before the court by Barrister Amobi Agu, granted the orders as prayed.\nThe Judgment Sum due from Folawiyo to AMCON as at February, 2020 was N=727, 967,870.03, being the outstanding judgment sum delivered by the Court on the 30th October, 2017 when the interest element is applied on the judgment sum."
  },
  {
    "headline": "Grace Alele-Williams, First Female VC In Nigeria, Dies At 89",
    "summarized_story": "Grace Alele-Williams, First Female VC In Nigeria, Dies At 89Grace Alele-Williams, Nigeria’s first female vice-chancellor, has passed away.\nAlele-Williams was a thoroughbred academician who throughout her life left an indelible mark of dutiful service, hard work, diligence and determination.\n“As the first female Nigerian to earn a doctorate degree in mathematics, Prof. Alele-Williams was a woman of many firsts.\n“When she became the Vice Chancellor of the University of Benin (UNIBEN) – at the time the first ever female Vice Chancellor of a Nigerian university – she shone brightly as a fearless administrator and restored sanity to the higher institution during a period of social upheaval.\n“I commiserate with the Alele-Williams family, praying that God will grant all the fortitude to bear this irreparable loss.”"
  },
  {
    "headline": "Fuel Souvenir: Court Sentences Erelu Okin To 27 Months In Prison",
    "summarized_story": "A Lagos Special Offences Mobile Court sitting at Oshodi, has convicted a socialite Ms. Ogbulu Pearl for distributing Premium Motor Spirit, PMS, as souvenir at a party.\nThe defendant was earlier arraigned on March 14, for the offence of distributing PMS as souvenir during her installation party on March 5.\nThe offences violates section 251(1), 168 (1), 244 of the Criminal Law of Lagos State, 2015 and Section 195 (2)(b) of the Environmental Management Protection Law of Lagos State 2017.\nThe magistrate also ordered the defendant to pay N1 million fine on the second and third count of the charge or face two years imprisonment.\nMagistrate Ogundare held that the prosecution has successfully proven the charge against the defendant beyond a reasonable doubt and thereby convicted and sentenced her accordingly."
  },
  {
    "headline": "APC convention: Allow candidates to emerge through votes, Coomassie tells party leaders",
    "summarized_story": "Hussaini H. Coomassie has criticised what he described as “the disenfranchisement of other candidates”.\nHe made the call in far away Paris where he is representing his organisation at the ongoing peace & conflict resolution meeting on Russia/Ukraine war.\nCoomassie, the immediate past deputy national coordinator, North & Diaspora, Buhari Campaign Organisation called on party leaders to be open minded when it comes to electioneering so that Nigerians won’t see 2023 election as a charade.\nHe also advocated that the candidates be given benefit of the doubt to try their popularity in every primary election.\n“As a matter of fact, with the way things are going with my party now, I’m afraid I can only see cloudy weather for the rulling APC in 2023 as far as Sen. Abdullahi Adamu’s leadership is concerned.”"
  },
  {
    "headline": "Revealed! Criteria for CBN Npower exit entrepreneurship loan",
    "summarized_story": "As effort is being intensified to reduce unemployment rate among Nigerian youth, the National Social Investment Management System, (NASIMS) has rolled out criteria for all exited batch A and B Npower beneficiaries to be eligible for the N 3,000,000 Central Bank of Nigeria, CBN, entrepreneurship loan.\nAccording to him, the certificate is supposed to be given to each beneficiary after the training like some training agencies are doing.\n“However, if you completed your training without getting a certificate, kindly call your EDI training agency to request your certificate.\n“You might need your certificate number to access the CBN 3,000,000 Nexit entrepreneurship Loan since Nexit training is one of the criteria that qualified an applicant for the loan,” he said.\nThe management of the Nexit programme has said that qualified Nexit applicants can get up to 3,000,000 CBN entrepreneurship loan."
  },
  {
    "headline": "[Breaking] 2022 FIFA World Cup playoffs: Ghana 0-0 Super Eagles",
    "summarized_story": "Nigeria’s Super Eagles a while ago on Friday played a goalless draw with the black stars of Ghana at the first leg of the 2022 FIFA World Cup playoffs decided at Baba Yara stadium Kumasi.\nThe second leg will be played at the Moshood Abiola National stadium Abuja on Tuesday."
  },
  {
    "headline": "UPDATED: Abdullahi Adamu Emerges APC National Chairman",
    "summarized_story": "﻿Senator Abdullahi Adamu has emerged as the national chairman of the All Progressives Congress (APC), about a year and nine months after the Adams Oshiomhole led National Working Committee (NWC) was dissolved.\nHe was returned unopposed on Saturday at the party’s national convention held at the Eagle Square in Abuja, the nation’s capital.\nAdamu, a serving member of the Senate representing Nasarawa West and former governor of the state, is President Muhammadu Buhari’s choice for the job.\nAdamu replaces Oshiomhole as the substantive APC national chairman after the NWC chaired by the former was sacked in June 2020.\nSen. Abdullahi Adamu is made our consensus candidate for the chairmanship position and forward letters of withdrawal from the underlisted aspirants,” said the letter signed by Senator Akume."
  },
  {
    "headline": "APC National Convention In Pictures",
    "summarized_story": "As the All Progressives Congress (APC) holds its national convention, thousands of party leaders and faithful thronged the Eagle Square for the exercise.\nAccording to the party, 7,584 delegates are expected to vote in the election that will produce a substantive national chairman and other members of the APC National Working Committee (NWC).\nHighlights of the convention are captured in the photos below:"
  },
  {
    "headline": "LIVE UPDATES: Over 7,000 Delegates Present As APC Holds National Convention",
    "summarized_story": "﻿About a year and nine months after its National Working Committee (NWC) was dissolved, the stage is set for the ruling All Progressives Congress (APC) to finally hold its national convention.\n1:33 am: Temidayo Israel Abdullahi confirmed as National Youth LeaderChristopher Akpan confirmed as Deputy National Welfare SecretaryAgunwa Anekwe confirmed as national ex-officio (south-east)1:30 am: Senator Iyiola Omisore confirmed as National Secretary.\nJamaluddeen Kabir (Zamfara) as deputy national youth leader Yakubu Murtala Ajaka (Kogi) as deputy national publicity secretary Hamma-Adama Ali Kumo (Gombe) as deputy national financial secretary Omorede Osifo (Edo) as deputy national treasurer Bashir Usman Gumel (Jigawa) as national financial secretary Ahmed El-Marzuk (Katsina) as national legal adviser Fetus Fuanter (Plateau) as deputy national secretary Emma Eneukwu (Enugu) confirmed as deputy national chairman (south)23:12 pm: BREAKING!\n#APCNationalConvention pic.twitter.com/4gsU7VNDjj — APC National Convention 2022 (@APCNatConv22) March 26, 20224:50 pm: Six contestants for the APC National Chairman position are said to have stepped down for the party’s consensus pick, Abdullahi Adamu, according to this letter signed by George Akume.\nFollowing the announcement of the March 26 date, the party zoned the positions of its national chairman and national secretary to the north-central and south-west regions respectively."
  },
  {
    "headline": "Wreckage Of Military Jet That Disappeared In 2021 Found In Sambisa Forest",
    "summarized_story": "The Army on Saturday said it has uncovered the wreckage of the crashed Alpha Jet aircraft (NAF475) that went off the radar in 2021.\nAccording to a notice on its verified Facebook page, the Army said the wreckage was found during a clearance patrol of troops of Operation Desert Sanity.\nREAD ALSO: Bandits Attack Kaduna Airport, Kill NAMA Staff“Further exploitation ongoing,” the army notice said.\nThe jet had crashed on March 31, 2021, with two crew members onboard.\nAccording to air force spokesperson, Edward Gabkwet, the jet had gone missing while on an operation in the north-east."
  },
  {
    "headline": "Eriksen Scores On Denmark Return After Cardiac Arrest",
    "summarized_story": "Denmark’s Christian Eriksen scored on his return to international football after suffering a cardiac arrest last year in a 4-2 friendly defeat against the Netherlands on Saturday.\nEriksen was clearly delighted with his strike which cut the Dutch lead to 3-2.\nHe was congratulated by his team-mates, many of whom were there when he suffered his cardiac arrest.\nEriksen spent several days in hospital and had a pacemaker implanted to regulate his heartbeat.\nEriksen came through the ranks at the Dutch side, making 162 appearances for the club and winning five trophies, including three consecutive league titles between 2011 and 2013."
  },
  {
    "headline": "Full List of Confirmed Unity Candidates for the APC National Convention -",
    "summarized_story": "Deputy National Chairman (North): Senator Abubakar Kyari (Borno State)3.\nDeputy National Chairman (South): Emma Eneukwu (Enugu State)4.\nNational Vice Chairman (South South): Victor Ton Giadom (Rivers State)11.\nZonal Secretary (South South): Ita Udosen (Akwa Ibom State)42.\nZonal Youth Leader (South South): Ebimobowe (Delta State)72."
  },
  {
    "headline": "APC Unity List Finally Out",
    "summarized_story": "APC Unity List for the National Working Committee is out with all Governors elected under the platform of the party signed on the names agreed on."
  },
  {
    "headline": "APC Unity list out as President Buhari arrives for APC Convention -",
    "summarized_story": "The unity list of the ruling All Progressives Congress seems to be finally out, TVC NEWS gathered.\nThose on the list have the support of major stakeholders in the ruling party to form the next crop of National Working Committee (NWC) of the APC.\nformer governor of Nasarawa State, Abdullahi Adamu has emerged national chairman of the party while Senator Iyiola Omisore (Osun State) would be national secretary.\nSenator Abubakar Kyari (Borno State) has been penned as Deputy National Chairman (North) while Chief Emma Eneukwu (Enugu) would be deputy national chairman (South).\nPresident Muhammadu Buhari has also arrived just when the Unity list seems to have been revealed."
  },
  {
    "headline": "We have upgraded our 'Rescue Me' Application",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba, has confirmed an upgrade of the Nigeria Police Force crime reporting mobile application known as ‘NPF Rescue Me’ application which is valuable to effectively report emergencies, criminal activities, and professional misconducts of police officers, for rapid and immediate reaction by operatives of the Nigeria Police Force.\nThe IGP emphasizes that the NPF Rescue Me App, which is a great improvement, redefines security and personalizes policing, enabling android and ios users to download the app from the various app stores, registering with their details and having access to a variety of features including emergency services, crime reporting, navigation, ambulances services, amongst others.\nThe application also has an emergency button which when depressed alerts operatives at the Nigeria Police National Command and Control Centre who would immediately send out the required assistance to victims irrespective of their locations within the country.\nThe Inspector-General of Police while encouraging members of the public to download the application into their carry along gadgets, and input some required information for improved services and their personal safety, reiterates that his administration is poised to exploring the use of cutting-edge technology to take combatting crime and responding to emergency situations to an entirely new level."
  },
  {
    "headline": "Nigeria: Terrorists Reportedly Kill 50 in Kaduna, Houses Razed, Dozens Abducted",
    "summarized_story": "About 50 people have been reportedly killed by terrorists in nine communities in Giwa Local Government Area of Kaduna state.\nSamuel Aruwan, the Kaduna state Commissioner for Internal Security and Home Affairs, confirmed the attacks.\nHe however said did not confirm the number of deaths, saying the state government was expecting security reports from security agencies.\n“I cannot confirm any death figure until we received security reports from security agencies because they are our source of information.\nWhen contacted, Mohammed Jalige, spokesman of the Kaduna state police command promised to call back after his prayers as he was about to pray."
  },
  {
    "headline": "US Urges China and Russia to Send Strong Message to North Korea after Missile Launch",
    "summarized_story": "China and Russia should tell North Korea to avoid more “provocations” after it resumed intercontinental ballistic missile testing this week, U.S. State Department spokesperson Jalina Porter said on Friday.\n“China and Russia should send a strong message to (North Korea) to refrain from additional provocations,” Porter told a regular news briefing ahead of a U.N. Security Council meeting to discuss the launch later on Friday.\nIt was the nuclear-armed country’s first full ICBM test since 2017.\nReferring to North Korea by the initials of its official name, Porter called the launch a “brazen” violation of U.N. Security Council resolutions.\nShe said she was unable comment on the position China and Russia might take at the Security Council, but added:“We are in the early stages of consulting on this issue."
  },
  {
    "headline": "Rotimi Amaechi: The People That Want Me to Run For The Presidency In 2023 Should Just Give Me The Money",
    "summarized_story": "Minister of Transportation Rotimi Amaechi debunks interest in the 2023 presidential race.\nHe also speaks about President Buhari and the APC’s legacy."
  },
  {
    "headline": "Russian Strike Killed 300 in Mariupol Theatre, Ukraine Says",
    "summarized_story": "However, British defense officials reported Saturday that the Russian military continues to besiege a number of other major Ukrainian cities, including Kharkiv and Chernihiv in the north.\n“The territorial integrity of Ukraine should be guaranteed,” he said in a nightly video address to the nation.\nFor days, the Mariupol government was unable to give a casualty count for the March 16 bombardment of the grand, columned Mariupol Drama Theater.\nEarlier this week, NATO estimated that 7,000 to 15,000 Russian soldiers have been killed in four weeks of fighting.\nAnd the northern city of Chernihiv is all but cut off after Russian forces destroyed bridges, leaving people without power, water and heat, authorities said."
  },
  {
    "headline": "Nigeria: Rivers Governor Wike Changes Positions Randomly and Unpredictably, THISDAY Says in Court",
    "summarized_story": "In the video clips, Wike was sighted in a campaign speaking about Obaseki as televised on Channels and TVC News.\nIgbanoi also told the court that the publication had no intention to damage the image of the governor but was only being professional.\nHe also pointed out that Edo State Governor Godwin Obaseki, whose campaign organisation he chaired, was now his number one enemy to the dismay of the public.\nHe stated that Wike has since been apologising to the former Edo State Governor and former APC National Chairman, Adams Oshiomhole openly in the media.\nThe governor claimed during his appearance in court that the publication portrayed him as a deceitful, untrustworthy person."
  }
]