[
  {
    "headline": "Adamant minister stops FIIRO DG’s appointment over demoted officer",
    "summarized_story": "The minister was said to have to stop the appointment of a substantive DG until Igwe was cleared.\nThe PUNCH had reported happenings at FIIRO since 2019 when Igwe was appointed the acting director general under controversial circumstances.\nThe minister, Onu, however, instructed the board to reinstate Igwe as the acting DG, a request that was rejected by the board Chairman, Alhaji Ibrahim Gwarzo.\nSeveral attempts by the board to begin the process of installing a substantive director-general were allegedly rebuffed by the minister.\n“Onu wrote to the Minister of Justice again, who directed an investigation and it was discovered that there was no wrongdoing."
  },
  {
    "headline": "I led attacks on policemen, stations, INEC facilities– Ebonyi teenager",
    "summarized_story": "A 17-year-old teenager, Elom Daniel has confessed that he gave information that led to the killing of police personnel and as well as attacks on facilities belonging to the Independent National Electoral Commission and other national assets in Ebonyi State.\nDaniel, who is at the headquarters of the Ebonyi State Police Command for alleged offences bothering on conspiracy, arson and murder, pointed out that he had never handled any rifle, but only gave information on places for attacks and how best to achieve the attacks.\nDaniel stated this when he was paraded alongside 59 others on Tuesday at the Command’s Headquarters, Abakaliki, the state capital.\nAfter that, I will draw the map for attack on the police station and give to the Eastern Security Network.\nHe is from Izzi Local Government Area of Ebonyi State, while I am from Ohaukwu LGA."
  },
  {
    "headline": "TRCN intensifies action to clamp down unqualified teachers",
    "summarized_story": "The Teachers Registration Council of Nigeria(TRCN) is strengthening capacity of its members of staff across Nigeria as part of effort to intensify clamp down on unqualified teachers.\nAjiboye said that one of the cardinal points of the workshop was to give the necessary training, to intensify clampdown on unqualified teachers across the country.\n“That is one of the major reasons we are having this training, to swing into action against unqualified teachers.\n“We want to make sure that TRCN staff are up to date on activities of the organisation, in terms of career path development for teachers.\n“UNESCO’s continued collaboration with TRCN is in line with its mandate of coordinating and leading action towards the achievement of the SDG 4."
  },
  {
    "headline": "We’ll regulate drones to ensure safety and security, NCAA boss",
    "summarized_story": "Musa Nuhu, said there was a need for strong regulatory framework for the deployment of drones to ensure safety and security.\nHe said the huge demand for drones and the pace of development of the market was incredibly fast, hence the need for regulation.\nNuhu said the NCAA and the Office of the National Security Adviser (ONSA) would synergise with the government and stakeholders to mitigate risks to national security and public safety, posed by people who were wrongly deploying drones.\n“Drones can be referred to as the following; Unmanned Aerial Vehicles (UAVs), Remotely Piloted Aircraft Systems (RPAS), Unmanned Aircraft Systems (UASs).\nOur goal for unmanned aircraft remains complete and total integration of safety and security is a shared responsibility for stakeholders and UAV operators."
  },
  {
    "headline": "CSOs blast NASS over embarrassing leaking roof, flood during sitting",
    "summarized_story": "By Gabriel Ewepu – AbujaCivil Society Organisations, CSOs, Wednesday, blasted members of the National Assembly over leaking roof and flood during sitting.\nThe CSOs reacted over Tuesday’s heavy rainfall that halted sitting at lower and upper chambers of the National Assembly that also caused flooding in the complex due to leakage from the roof.\nSpeaking with Vanguard on the issue, CSOs called for stringent measures to ensure there is no recurrence of the embarrassment witnessed at NASS complex on Tuesday.\n“For our National legislative complex (NASS) to be leaking during raining season is a monumental disgrace to us as Nation; and all these brouhaha is happening under the watch of ‘Mr.\n“It is a national embarrassment to see that the National Assembly has no maintenance regime in place or a likely breach of arrangement with a facility maintenance firm."
  },
  {
    "headline": "The Dot Nation: You’re ethnic bigot, elder for nothing — Igbokwe berates Abaribe",
    "summarized_story": "By Olayinka AjayiThe Special Adviser to the Lagos State Governor, Babajide Sanwo-Olu on Drainage and Water Resources, Joe Igbokwe has berated the Senate Minority Leader, Enyinnaya Abaribe over his customised shirt “The Dot Nation”.\nIgbokwe said this on his social media page, Facebook, while reacting to the senator’s display of a T shirt with inscription of “The Dot Nation”, saying he would soon write a book on the senate minority leader.\nIgbokwe who was apparently peeved by Abaribe’s display of the Dot Nation’s T shirt on social media described the senate minority leader as “an elder for nothing and an ethnic bigot”.\nHe insisted that the blood of the policemen and the uninformed youths killed would be accounted for in the fullness of time.\nThe special adviser to governor Sanwo-Olu , vow to write on the minority leader saying: “ I will soon write a book on Abaribe."
  },
  {
    "headline": "Rivers youths protest alleged abandonment of state’s skill training centre",
    "summarized_story": "…Accuses education Commissioner of frustrating programmesBy Davies Iheamnachor, Port-HarcourtYouths said to be students of Port Harcourt Technical and Vocational Center, PHTVC, have staged a peaceful protest against the Rivers State Government over alleged abandament of the skills training centre.\nOluchi said: “We are begin the Governor to talk talk to the Commissioner of Education to allow go into this training.\nWagor mentioned that over 10,000 youths would benefit from the programme, but maintained that the education commissioner does not want to programme to survive.\nHe said: “We the staff went ahead to source for donors through the World Bank, and they have accepted to bring their money to train Rivers State Youths.\n“Does he need the people what want to sponsor Rivers State programme for free to give him money?"
  },
  {
    "headline": "Protest: Senator Uba threatens to sue Heritage bank, demands N5bn for damages",
    "summarized_story": "An aspirant in the forthcoming governorship election in Anambra State, Senator Andy Uba has threatened to sue Heritage Bank over a viral video showing its staff protesting at the entrance of his residence.\nFew days ago, a video emerged online of bank staff protesting at the gate of Uba’s house, demanding he should repay the loan he was allegedly owing the bank.\nUba, reacting in a letter signed by his lawyer, Ahmed Raji, SAN, threatened to sue the bank, describing the actions of its staff as shameful and embarrassing.\nUba threatened to take the case to court if the bank refused to tender an apology with payment of N5b for damages to his name.\n”We hope that this bank will take benefit of the olive branch offered in this letter; the gamble, otherwise, is yours to suffer,” the letter read."
  },
  {
    "headline": "Tension in Benue, Ebonyi over Effiom, Ezza renewed hostility",
    "summarized_story": "The hostility between Effiom and Ezza in Ado and Ohaukwu Local Government Areas of Benue and Ebonyi States has indicated that a major crisis between the two neighbouring states is likely, DAILY POST observed.\nAttack on Ebonyi community not by Fulani herdsmen – Deputy GovernorRecall also that on Monday, April 2021, armed men invaded Umuogudu Akpu Community, Ngbo, in Ohaukwu LGA of Ebonyi State and gruesomely killed over 12 innocent indigenes, burnt and destroyed over 56 houses and kidnapped 5 persons.\nReacting, Governor Ortom’s Deputy and Chairman of the Benue Boundary Committee, Engr Benson Abounu in a statement, urged Umahi to leave Benue out of attacks in Ebonyi communities.\nAccording to him, “What our people are suffering here is as a result of Effiom and Ezza crisis which escalated from Ebonyi to Ado LGA.\nHowever, the Ebonyi State Police Command refuted the recent attack that reportedly led to the death of 10 persons in Ado and Ohaukwu LGs."
  },
  {
    "headline": "Insecurity: Ondo goes spiritual, invites traditional worshippers to invoke spiritual powers",
    "summarized_story": "The Oyo State government has invited some traditional worshippers in the State to invoke spiritual powers as a means of tackling insecurity ravaging the State.\nThe Commissioner for Information, Culture and Tourism, Dr. Wasiu Olatubosun made this known to newsmen on Wednesday in Akure, the State capital.\nHe made the disclosure shortly after meeting with traditional worshipers at his ministry on “Community and Public Enlightenment on Security and Peaceful Coexistence”.\nDrama as traditional worshippers invade, disrupt govt’s housing project in OndoAccording to the Commissioner, the government is collaborating with the traditional worshippers to offer sacrifices and other spiritual exercises to curb the security crisis bedeviling the State.\nDAILY POST reports that the State had in recent time witnessed unrest birthed by the activities of Fulani herdsmen and farmers, kidnappers and other criminal elements disturbing the peace of the State."
  },
  {
    "headline": "Food prices: Ekiti Assembly mulls consumer protection bill, others",
    "summarized_story": "As the prices of food and other products increase unabated, the Ekiti State House of Assembly, is to pass a bill to check the extortionate activities of traders and suppliers of goods in the state.\nThe bill tagged : ” Ekiti State Consumer Protection Bill, according to the Speaker, Hon Funminiyi Afuye, would help in checkmating the activities of extortionists and shylocks in the system when passed and assented to.\nExplaining the values interest in the bills, the Speaker remarked that the Consumer Protection bill was aimed at protecting the masses of Ekiti from shylock marketers, who usually hiked prices of foodstuffs and other commodities .\n“I urge the Committees to speedily work on the Consumer Protection bill and that of the Economic Development Council bill, and report back to the whole House within two weeks.\nThe three other bills committed at the House plenary after successfully passing through the second reading are the Ekiti State Consumer Protection Bill, 2021, Ekiti State Victims Charter Bill, 2021, and Ekiti State Economic Development Council Bill, 2021."
  },
  {
    "headline": "Middle Belt not part of Biafra, they supported Nigeria during civil war",
    "summarized_story": "The Biafra Nations League, BNL, has said that Igala and entire Middle Belt, should not included in the map of Biafra unless they show interest to be part of it.\nSome groups in the Middle Belt are agitating against being included in the Biafra map and are warning Biafra separatists to delist Igala from the map.\nThe Igala groups are of the opinion that late Biafran leader, Ikemba Chukwyemeka Odumegwu Ojukwu attacked Igala land during the 1967 civil war.\n“It Is against the general interest of Biafra to be dragging those who fought on Nigeria side as mafians.\nThe group blamed other pro Biafra groups for failing to reach out to other areas of the Eastern Region to enlighten them about the struggle but dragging middle belt, adding “We won’t participate in the fight for annexation”."
  },
  {
    "headline": "Afe Babalola: ABUAD will be best in the world",
    "summarized_story": "Since its inception, Afe Babalola University, Ado-Ekiti (ABUAD), Ekiti State, has been growing in leaps and bounds.\nLaying that of Bottle Recycling Factory, Ekiti State Governor Fayemi said Babalola’s ideas were worthy of commendation.\nABUAD is fast becoming a state within a state as manifested by the presence of the best hospital and IPP on campus.\nFayemi said he wished that the promising lawyer and scholar, who is from Fiditi, Oyo State, were from Ekiti State.\nFlaunting the achievements of the university, Babalola said:””Education is power."
  },
  {
    "headline": "School reminds pupils of Nigeria’s cultural heritage",
    "summarized_story": "The Language, Arts and Culture Day at Chrisland Schools, Lagos, provides an opportunity to remind its pupils of Nigeria’s rich cultural heritage, says its Principal, Mr. Eric Van Der Merwe.\nSpeaking at the event held at the school’s premises in Opebi, Merwe lamented that many pupils were not in touch with their culture.\nAs a school, we have discovered that a lot of students are not in touch with their background and culture, hence the reason for this occasion.\nThis is an event the school has successfully done each year as a way of keeping students in touch with their roots,” he said.\nI applaud the organisers, Chrisland Schools, for serving as custodians of our rich cultural legacy, which is one of our resources,’ she said."
  },
  {
    "headline": "Okebukola, others to lead varsity’s board, council",
    "summarized_story": "By Kofoworola Belo-OsagieIn four years, the distinguished professor of Science Education, Peter Okebukola, has promised to strengthen the Samuel Adegboyega University, Ogwa, Edo State.\nThe university owned by The Apostolic Church Nigeria (TACN), LAWNA Territory, will keep Okebukola who retired from the Lagos State University (LASU) in February after clocking 70 busy as Pro-chancellor/Chairman of Governing Council.\nSpeaking after the inauguration of the council, Board of Trustees(BoT) and Resource Mobilisation Committee for the university at TACN Council Hall in Ketu, Lagos, Okebukola said the Council would collaborate with the university management and BoT to improve the university.\nOkebukola said: “God will give us the enabling to move Samuel Adegboyega University higher.\nThe Board and the Governing Council should raise the standard of accountability and probity in the university,” he said."
  },
  {
    "headline": "Safety experts gift e-library to PTI",
    "summarized_story": "The American Society of Safety Professionals (ASSP) Nigerian Chapter has donated an Occupational Safety and Health Electronics (IOSH) library to the Petroleum Training Institute (PTI), Effurun, Delta State.\nDescribed as the first of its kind in the country, the library was inaugurated last weekend.\nThe Society’s President, Mrs. Mercy Omoifo lrefo, said the PTI leadership provided the venue for ASSP to site the library after Memorandum of Understanding was signed by both.\nADVERTISEMENTShe said the project was the signature project for her and other executives during their tenure.\nShe said: “The passion to establish an e-library came after identifying this gap and considering what to do in my tenure as the President of ASSP, NC."
  },
  {
    "headline": "Anambra Election: How Soludo emerged APGA candidate",
    "summarized_story": "FORMER governor of the Central Bank of Nigeria, CBN, Professor Charles Soludo has won the ticket of the All Progressives Grand Alliance, APGA, for the November 6 governorship election in Anambra State.\nFinal Results Of 2021 APGA Governorship Primaries indicates that Professor Soludo won the 2021 APGA governorship primaries overwhelmingly.\nResult SummarySoludo: 740 votesEzenwankwo: 41 votesOkolo: 7 votesIbeh : 4 votesLocal Government BreakdownAguata LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 44Anambra East LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 40Anambra West LGASoludo; 25Ezenwankwo; 1Anaocha LGA:Ezenwankwo 4.\nSoludo: 40Ibeh: 1Okolo: 1Awka North LGAEzenwankwo 4.\nSoludo: 29Ibeh: 0Okolo: 0Awka South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 46Ayamelum LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 28Dunukofia LGAEzenwankwo – 1Damian – NilIbe – 1Soludo – 32Ekwusigo LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 29Idemili North LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 29Idemili South LGAEzenwankwo – 1Damian – NilIbe – NilSoludo – 30Ihiala LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 45Njikoka LGAEzenwankwo – 2Damian – NilIbe – 1Soludo – 41Nnewi North LGAEzenwankwo – 2Damian – 5Ibe – NilSoludo – 19Nnewi South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 45Ogbaru LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 38Onitsha North LGAEzenwankwo – NilDamian – NilIbe – NilSoludo – 35Onitsha South LGAEzenwankwo – 2Damian – NilIbe – NilSoludo – 40Orumba North LGAEzenwankwo – 4Damian – NilIbe – 1Soludo – 38Orumba South LGAEzenwankwo – 5Damian – NilIbe – NilSoludo – 37Oyi LGAEzenwankwo – 5Damian – NilIbe – 1Soludo – 30"
  },
  {
    "headline": "We’ve no hand in controversial media bills –Presidency",
    "summarized_story": "Adesina said that President Muhammadu Buhari has approved that the Second Peer Review Country Self-assessment Report should be done.\n“The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\n“Nigeria is ready for the second Peer Review Country Self -assessment Report to be done by AUDA-NEPAD.\nNow, Nigeria is ready for the second review self-assessment report.\n“So, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today."
  },
  {
    "headline": "Anambra guber: Crisis in APGA, PDP’ll give us victory- APC",
    "summarized_story": "A leading pressure group, APC Patriots, Anambra has charged aspirants of the All Progressives Congress to close ranks in order for the party to win the November 6, 2021 gubernatorial election.\nSpeaking against the backdrop of intense crisis currently rocking the ruling All Progressives Grand Alliance, APGA and the People’s Democratic Party, PDD, the APC Patriots said that the discordant tunes emerging from both parties leaves the state open for APC to take.\nPart of its strategies included the April 27, 2021 Interactive Session which it convoked at the Transcorp Hilton, Abuja.\nThe event was attended by Vice President Yemi Osinbajo, all the aspirants, ministers, and leading political figures from the South east, including former Senate President, Ken Nnamani.\nAt that epochal event, the aspirants had pledged to go about seeking the party’s ticket in an atmosphere of camaraderie – a pledge, which the APC Patriots noted they have sustained till date."
  },
  {
    "headline": "N37bn NASS renovation budget: We’re vindicated –Lawan",
    "summarized_story": "From Fred Itua, AbujaSenate President, Ahmad Lawan, has said the reported roof leakage at the National Assembly has vindicated its request for the approval of N37 billion for the renovation of the complex.\nIt obstructed Senate plenary sessionIn his remarks, Lawan said media reports that the money had been approved and siphoned by the leadership of the National Assembly was false.\n“The fact that there was a leakage, to me it is a clear testimony, confirmation and vindication of the position the National Assembly took initially.\n“For emphasis, when we approved the budget of N37 billion for the rehabilitation of this complex, it was not a National Assembly budget, it was an FCDA budget, we have nothing to do with this,’’ Lawan said.\nThe National Assembly approved the N37 billion in the 2020 budget."
  },
  {
    "headline": "2023: Arewa group endorses Gov Mohammed for president",
    "summarized_story": "A pan-Arewa group, Northern Youth Elders Forum (NYEF), has endorsed Bauchi State Governor, Bala Mohammed, for 2023 presidency.\nSpeaking during a meeting in Bauchi, yesterday, National Chairman of the group, Eliot Afiyo, said Mohammed was picked from among 27 prominent Nigerians who were considered as possible presidential candidates for 2023.\nThe NYEF chairman said the group took interest in Mohammed when he defeated a sitting Bauchi governor in 2007 to emerge senator.\nHe said Mohammed again proved his popularity in 2019 when he defeated an incumbent to become Governor of Bauchi State.\nAfiyo said the group, which also endorsed President Olusegun Obasanjo, Umar Yar’Adua, Goodluck Jonathan and Muhammadu Buhari when they vied for president in 1999, 2003, 2007, 2011 and 2015, will mobilise for Governor Mohammed to emerge victorious in 2023."
  },
  {
    "headline": "Presidency Replies Critics, Washes Hands off Media Bills",
    "summarized_story": "The spokesman, however, revealed that the president has approved that the Second Peer Review Country Self-assessment Report should be done.\nHe said: “The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\nNow, Nigeria is ready for the second review self-assessment report.\nSo, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today.\nNUJ President, Mr. Chris Isiguzo, spoke while reacting to the denial by the presidency that they had no hand in the plot."
  },
  {
    "headline": "Petrol Smuggling Rises to 42m Litres Daily, NNPC Cries Out",
    "summarized_story": "•Says subsidy hits N150bn monthlyEmmanuel AddehNigerian National Petroleum Corporation (NNPC) yesterday lamented the escalating incidence of petrol smuggling across Nigeria’s borders, which it puts at a whopping 42 million litres per day.\nThe corporation said the unbridled smuggling has increased Nigeria’s estimated daily consumption of 60 million litres to 102 million litres.\nHe urged all industry stakeholders to collaborate with the NNPC to ensure that the daily national petroleum products consumption, which shot up to 102 million litres in May, is reduced to about 60 million litres.\n“We all know that our daily consumption is not up to 60 million litres.\nHe stated that whatever is being done in the area of deregulation will not make any impact without Nigeria knowing exactly its actual daily consumption of petrol."
  },
  {
    "headline": "Senate May Pass 2021 Supplementary Appropriation Bill Tuesday",
    "summarized_story": "Refers bill to appropriate committeeBy Deji Elumoye and Juliet AkojeThe President of the Senate, Dr Ahmad Lawan, has hinted that the 2021 Appropriation Bill sent to the Senate by President Muhammadu Buhari for approval may be passed next Tuesday.\nHe, therefore, referred the Appropriation Bill sent to the Senate by the president on June 15 to the Senate Committee on Appropriation headed by Senator Jibril Barau.\nPresident Buhari had on Tuesday, June 15 transmitted the 2021 Supplementary Appropriation Bill to the National Assembly for consideration and approval.\nThe supplementary budget bill was transmitted via a letter dated 15th June, 2021, and addressed to the President of the Senate, Lawan.\n“It has become necessary to prepare the 2021 Supplementary Appropriation Bill considering the urgent need to make provision for procurement and administration of COVlD-19 vaccines."
  },
  {
    "headline": "Adesina: Presidency has no Input in Media Bills before N’ Assembly",
    "summarized_story": "The spokesman, however, revealed that President Muhammadu Buhari has given approval that the Second Peer Review Country Self-assessment Report should be done.\nAccording to him, “The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\nNigeria is ready for the second Peer Review Country Self -assessment Report to be done by AUDA-NEPAD.\nNow, Nigeria is ready for the second review self-assessment report.\nSo, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today."
  },
  {
    "headline": "US Blocks Iran-affiliated News Sites",
    "summarized_story": "The US has taken down dozens of Iranian and Iran-linked news sites which it accuses of spreading disinformation.\nThe sites were replaced on Tuesday with notices saying they had been “seized” as part of a law enforcement action.\nThe sites had been used by components of the Iranian government “disguised as news organizations or media outlets” to target the US “with disinformation campaigns and malign influence operations”, it alleged.\nYemen’s rebel Houthi movement confirmed that a domain of its news channel, Al-Masirah TV, had been blocked.\nThe .tv domain is owned by the Pacific nation of Tuvalu but is run by the US firm Verisign."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "#LekkiMassacre: How Nigerian Army, Lagos Government Secretly Took 20 Corpses To State Pathologist",
    "summarized_story": "The Nigerian Army and the Lagos State Government connived and secretly took 20 bodies from the Lekki Tollgate to the state pathologist for autopsies after the October 20, 2020 shootings, SaharaReporters has learnt.\nSaharaReporters gathered from a top source that the Lagos State Pathologist, Prof John Obafunwa, made this revelation secretly to members of the Lagos State EndSARS panel sitting in Lekki.\n\"The pathologist in Lagos has secretly revealed that the Nigerian Army and the Lagos state government brought 20 Lekki massacre victims on October 24, to him but they claimed they were people trying to break out of Ikoyi prisons.\nThis is in addition to the 99 bodies which they confessed were taken to the pathologist earlier, saying three were from Lekki Tollgate,\" the source stated.\nHowever, on October 20, soldiers from the Bonny Camp, 81 division, invaded the Lekki tollgate, where some demonstrators had gathered, and fired gunshots."
  },
  {
    "headline": "#LekkiMassacre: How Nigerian Army, Lagos Government Secretly Took 20 Corpses To State Pathologist",
    "summarized_story": "The Nigerian Army and the Lagos State Government connived and secretly took 20 bodies from the Lekki Tollgate to the state pathologist for autopsies after the October 20, 2020 shootings, SaharaReporters has learnt.\nSaharaReporters gathered from a top source that the Lagos State Pathologist, Prof John Obafunwa, made this revelation secretly to members of the Lagos State EndSARS panel sitting in Lekki.\n\"The pathologist in Lagos has secretly revealed that the Nigerian Army and the Lagos state government brought 20 Lekki massacre victims on October 24, to him but they claimed they were people trying to break out of Ikoyi prisons.\nThis is in addition to the 99 bodies which they confessed were taken to the pathologist earlier, saying three were from Lekki Tollgate,\" the source stated.\nHowever, on October 20, soldiers from the Bonny Camp, 81 division, invaded the Lekki tollgate, where some demonstrators had gathered, and fired gunshots."
  },
  {
    "headline": "‘N600m debt’: AMCON takes over Oyo senator’s properties in Abuja",
    "summarized_story": "AMCON said a federal high court had graciously directed police, court bailiffs and other security agencies to assist the agency in securing the assets.\n“The enforced properties include property situate at No 12, St, Petersburg Street, Wuse II, Abuja and Plot 516, (also known as No 2.\nAdvertisement“The non-performing loan (NPL) of Abadat Ventures Limited was purchased by AMCON from Guaranty Trust Bank (GTBank) Plc., during the second phase of eligible bank asset purchases in 2021.\nThe senate had passed the AMCON amendment bill in April 2021 strengthening the agency in the area of loan recovery.\nThe amendment bill empowers AMCON to, amongst others, take possession, manage or sell all properties traced to debtors, whether or not such assets or property is used as security/collateral for obtaining the loan in particular."
  },
  {
    "headline": "‘N600m debt’: AMCON takes over Oyo senator’s properties in Abuja",
    "summarized_story": "AMCON said a federal high court had graciously directed police, court bailiffs and other security agencies to assist the agency in securing the assets.\n“The enforced properties include property situate at No 12, St, Petersburg Street, Wuse II, Abuja and Plot 516, (also known as No 2.\nAdvertisement“The non-performing loan (NPL) of Abadat Ventures Limited was purchased by AMCON from Guaranty Trust Bank (GTBank) Plc., during the second phase of eligible bank asset purchases in 2021.\nThe senate had passed the AMCON amendment bill in April 2021 strengthening the agency in the area of loan recovery.\nThe amendment bill empowers AMCON to, amongst others, take possession, manage or sell all properties traced to debtors, whether or not such assets or property is used as security/collateral for obtaining the loan in particular."
  },
  {
    "headline": "I'm a poor boy whom God has lifted, says Soludo after winning Anambra APGA guber primary",
    "summarized_story": "Charles Soludo, former governor of the Central Bank of Nigeria (CBN), says he is a “poor boy” that has been favoured by God.\nAdvertisementSoludo stated this during his acceptance speech on Wednesday, after winning the Anambra governorship primary election of the All Progressives Grand Alliance (APGA).\nI’m a poor boy whom God has lifted and gifted.\n“As members of APGA, we should be very proud of moving Anambra from level to level.\n“At the last election, APGA won 21 out of 21 LGAs, and 80 percent of the seats at the state house of assembly."
  },
  {
    "headline": "I'm a poor boy whom God has lifted, says Soludo after winning Anambra APGA guber primary",
    "summarized_story": "Charles Soludo, former governor of the Central Bank of Nigeria (CBN), says he is a “poor boy” that has been favoured by God.\nAdvertisementSoludo stated this during his acceptance speech on Wednesday, after winning the Anambra governorship primary election of the All Progressives Grand Alliance (APGA).\nI’m a poor boy whom God has lifted and gifted.\n“As members of APGA, we should be very proud of moving Anambra from level to level.\n“At the last election, APGA won 21 out of 21 LGAs, and 80 percent of the seats at the state house of assembly."
  },
  {
    "headline": "Army replies Gumi: Soldiers risk their lives to confront bandits -- we don't condone sabotage",
    "summarized_story": "The Nigerian Army has kicked against the allegation that soldiers work with bandits.\nAdvertisementAhmad Gumi, a cleric who is known to have access to bandits, had accused security personnel of colluding with bandits in the northern part of the country.\nBut reacting in a statement on Wednesday, Onyema Nwachukwu, army’s spokesperson, said while there may be some officers guilty of such accusations, the army doesn’t condone acts sabotaging its efforts.\nHe reassured Nigerians that troops will continue to conduct themselves professionally in consonance with the code guiding their operations in all combat engagements, as well as in line with global best practices.\n“Citizens are enjoined to continue to support military operations by providing useful information to defence and security agencies, and together we shall rid our society of these criminal elements,” he added."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "From Konga to mPharma, logistics for health products is growing in Africa",
    "summarized_story": "These health logistics companies include e-commerce players like Jumia, Copia and Konga, and also core health startups like mPharma, Lifestores Pharmacy, Chekkit and Sproxil.\nSnapshot of innovators in the health products distribution space in Africa.\nKonga.com is a marketplace where pharmaceutical companies can list health products like medicines.\nSalient Advisory’s report notes that “clear and harmonised regulations” could boost this entry of e-commerce players into the health products distribution space.\nImudia declines to share what health products logistics currently contributes to Konga’s overall business."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "Chaos at Lagos airport as infrastructure crumbles",
    "summarized_story": "The worsening state of infrastructure at the Lagos airport is increasingly affecting flight operations and passenger facilitation.\nAs international airports across the world continually work to modernise their infrastructure to improve passenger experience and spur more airline competition, the Murtala Muhammed International Airport (MMIA), which handles 65 percent of the country’s passenger traffic, still battles…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why Nigeria may buck trend of record-low interest rates on African Eurobonds",
    "summarized_story": "Why Nigeria may buck trend of record-low interest rates on African EurobondsIncreased investors’ appetite for African Eurobonds is spurring record low-interest rates, but Nigeria may miss out when it visits the international market later this year.\nDeclining external reserves, insecurity, policy inconsistency and the recent Twitter ban, which heightened the risk premium of Africa’s largest economy, are top reasons why Nigeria is unlikely to follow the…"
  },
  {
    "headline": "Why luxury real estate still finds buyers amid economic downturn",
    "summarized_story": "In a curious case of twisted law of economics, luxury real estate still finds buyers in the Nigerian property market despite the downturn in economy that has seen incomes drop and consumer purchasing power shrink considerably.\nA luxury real estate or home is one that is valued within the top 10 of such properties on the local market.\nAnother reason for the curious rise in demand for luxury real estate is corruption in governmental systems where public office holders who embezzle public funds find real estate a ready haven for the stolen money.\nCompared to other investment assets like bonds and stocks, real estate has lower risk.\nIn Victoria Island, for instance, luxury real estate is limited in supply due to a fixed amount of land."
  },
  {
    "headline": "Obaseki pledges more support for widows, to set up trust fund to cater for widow’s welfare – Nigerian Observer",
    "summarized_story": "Obaseki pledges more support for widows, to set up trust fund to cater for widow’s welfareShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has reassured of more support for widows in the state, noting that his government will sustain programmes and policies aimed at improving their livelihoods, ensuring that widows and other vulnerable persons are well catered for.\nThe governor gave the assurance in commemoration of the International Widows Day, marked every June 23 by the United Nations and its sister agencies.\nObaseki noted that as part of efforts to ensure the welfare of widows in the state, his government has concluded plans to constitute the Edo State Widow Endowment Trust Fund Committee to ensure that widows and other vulnerable persons in the state are well taken care of.\nAccording to the UN, “For many women around the world, the devastating loss of a partner is magnified by a long-term fight for their basic rights and dignity.\nDespite the fact that there are more than 258 million widows around the world, widows have historically been left unseen, unsupported, and unmeasured in our societies."
  },
  {
    "headline": "Edo launches e-procurement work station, to run digital procurement system – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government will on Wednesday, June 30, 2021, migrate to an e-procurement system, in line with the vision of the Governor Godwin Obaseki-led administration to run a digitally-driven, simple and transparent procurement process.\nThe government, ahead of the move, launched an e-procurement workstation in Benin City and presented high-end laptops to staff and management of the state’s Public Procurement Agency.\nSpeaking to journalists after the launch of the workstation, Managing Director of the Edo State Public Procurement Agency, Henry Idogun, said the implementation of a new e-procurement system would commence with four pilot Ministries, Departments and Agencies (MDAs) in the State.\nIn Edo State, we have embraced procurement reforms in the past eight years and conducted procurements manually.\nBut from 30th of June, 2021, we would be able to go through a procurement process electronically, using technology in some selected MDAs in Edo State.”Idogun added that “there will be more efficiency in our procurement process in the state, using ICT.”..."
  },
  {
    "headline": "Edo honours EDSTMA official for dedication to duty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has rewarded an official of Edo State Traffic Management Agency (EDSTMA), Obass Philip, for his commitment and dedication to duty.\nObass Philip, whose video went viral on social media, was seen controlling traffic during a heavy downpour in the Benin metropolis.\n“I was touched by the video and invited the MD to bring him to my office, for the state government to appreciate him for his dedication to duty.\nHe has done something extraordinary and we will duly reward him.”“The government is watching and will always reward dedication to duty.\nEarlier, the EDSTMA MD, Oloriegbe, said the video of the traffic official went viral on social media and calls came from across the globe, with many impressed citizens contributing to appreciate him."
  },
  {
    "headline": "EDITORIAL: In praise of demolition of illegal structures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State government, weekend commenced the demolition of illegal structures in Benin City in line with the present administration’s urban renewal agenda.\nThe demolition is predicated on Section 7 (5)(I)(III) of the Town and Country Planning Law Cap 165 of Bendel State as applicable to Edo State, as amended by the Town and Country Planning Edit No.\nBesides aesthetics, The Nigerian OBSERVER sees the demolition of illegal structures as an indication that it is no longer business as usual.\nThe Nigerian OBSERVER commends Governor Godwin Obaseki for not lacking in the courage and political will to do what is necessary in the overall interest of Edo people.\nThe state government deserves all the cooperation and support to sustain the laudable initiative which is aimed at restoring the state master plan."
  },
  {
    "headline": "Nigeria’s human rights record ‘very poor’, worse than average in sub-Saharan Africa",
    "summarized_story": "Nigeria’s human rights record is “very poor” and is “worse than [the] average in sub-Saharan Africa,” a new report by an international organisation states.\nThe Human Rights Measurement Initiative (HRMI) said, in the report, that Nigeria’s score for economic and social rights falls within a ‘very bad’ range.\nThe report, which tracked the human rights performance of most countries, stated that Nigeria’s mismanagement of resources is largely responsible for the country’s unfortunate human rights crises.\nEach assessment standard uses a set of indicators that are commonly available and most relevant for these countries, HRMI said.\nADVERTISEMENTFor all the four rights, Nigeria performed worse than most countries in Sub-Saharan Africa."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Lagos Water Transportation Commuters Insured – Balogun",
    "summarized_story": "Fresh facts have emerged that commuters using Lagos water transportation are now fully insured as part of measures to encourage Lagosians to embrace water transportation.\nAdvertisementsThe managing director, chief executive officer of LAGFerry, Mr. Ladi Balogun disclosed this at commissioning seven new high capacity boats and launch of Cowry Cards for water transportation in Lagos, saying the government is determined to harness the potential of water transportation and reduce traffic congestion on roads.\nAccording to him, Lagos was turning to a modern water transportation system as part of an integrated transport system to unclog the city’s roads.\nGovernor, all passengers on the boats of LAGFerry can now enjoy insurance cover on all trips.\n‘’A total of our 12 passenger boats have collectively run 7061 hours spanning 286,280 kilometers for 10,182 trips."
  },
  {
    "headline": "EndSARS Destruction: It Will Take Time To Rebuild Lagos, Says HoS",
    "summarized_story": "Lagos State government has told the state’s Judicial Panel on Restitution for victims of Special Anti-Robbery Squad and other Related matters that it will take the government a long time to rebuild the state from the destruction witnessed in the state during #EndSARS protest said to have been hijacked by hoodlums from legitimate protesters.\nAdvertisementsThe Lagos State Head of Service, Hakeem Muri-Okunola stated this while testifying before the panel presided over by retired Justice Doris Okuwobi.\nLed in evidence by the lead counsel to the government, Abiodun Owonikoko (SAN), the Head of Service gave a chronological account of the protests in Lagos from October 8, 2020.\nAccording to him, the #EndSARS protesters initially gathered at two main points in the state, that is, the Lagos House at Alausa and the lekki toll gate.\n“The Oba of Lagos Palace, City Hall, Igbosere High Court and others were attacked."
  },
  {
    "headline": "UniAbuja, ACCI Partner On Research, Development",
    "summarized_story": "The University of Abuja has entered into a partnership with the Abuja Chamber of Commerce and Industry (ACCI) to enhance knowledge sharing, promote innovation and capacity building.\nThe head, Information and University Relations, Dr Habib Yakoob said the areas of collaboration include research and development, technology transfer, commercialization of research outputs, training programmes, internship and industrial attachment placements, creating linkages with relevant industries, mentorship programmes, research funding and policy advocacy.\nProfessor Na’Allah assured ACCI that the University was ready to play its role in accordance with world best practices to ensure that the partnership would have significant impact on the Nigerian economy.\n‘’I assure you that I will give this collaboration my total support.\nI want to make sure that our students benefit tremendously from the initiative and even more than that, that our nation benefits tremendously from its implementation,” Na’Allah said."
  },
  {
    "headline": "TETFund : PhD Scholars In Morgan Varsity To Prioritise Public Health, Others",
    "summarized_story": "The Tertiary Education Trust Fund (TETFund) has said Nigerian academics undertaking PhD studies at Morgan State University (MSU) in Maryland, USA will, henceforth, prioritise three key areas of specialties, namely; Public Health, climate change and Computer Technology.\nSpeaking on public health, he noted that “this is very important, not just for the state of Maryland but for the United States and perhaps, even more profound, for us back in Nigeria.\nThe issues of public health are so obvious.\nAnd if the provision for infrastructure and interventions cannot catch up with the increasing population it is a problem.\nAdvertisements“And in the case of public health it is very obvious; the challenges for public health are very obvious."
  },
  {
    "headline": "ASUU Laments Non-payment Of Staff Salaries",
    "summarized_story": "Academic Staff Union of Universities (ASUU), university of Abuja branch has raised the alarm over non-payment of salaries of up to 16 months of its members.\nHe said the victimisation of the University lecturers and their families by the AGF through continuous withholding salaries of members and check off dues since February 2020 is a clear indication to kill ASUU.\n“In the same vein, over 38 of our members are owed arrears of eight months salaries.\nWhere salaries were paid to some members, it was not accompanied with pay advice or pay slip.\nIn addition, check off of the branch was amputated with payment of 5% as check off dues, and 95% balance unaccounted for 19 months."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "I regret nothing: John McAfee’s parting shot to U.S. government",
    "summarized_story": "British-born U.S. technology entrepreneur John McAfee who died on Wednesday by suicide in a Barcelona prison left a damning note to the U.S. government on Twitter.\nMcAfee wanted in the U.S. for tax evasion, died today after the Spanish high court authorised his extradition to the United States.\nSpain’s high court said on Wednesday it agreed to extradite McAfee to the United States.\nThat year, he left the United States to avoid trial, largely living on a megayacht with his wife, four large dogs, two security guards and seven staff.\nIn his last public tweet on June 18, McAfee wrote: “All power corrupts."
  },
  {
    "headline": "2023 Presidency: Gov. Bala Mohammed begins consultation",
    "summarized_story": "Bauchi State Governor, Bala Mohammed, has said he will announce his decision on the 2023 Presidency in the next three weeks.\nHe noted: “During our last meeting in Gombe, we scrutinised 47 people across the country and Mohammed was one of the leading names that came up.\nIn 2019, Bala Mohammed defeated an incumbent Governor to become Governor of Bauchi State.\nBesides, his performance as Governor of Bauchi State has also been unprecedented.”Afiyo declared that the NYLF was, therefore, announcing its endorsement of Governor Mohammed to run for the 2023 presidential election on the platform of any party of his choice.\nHowever, responding to the youths, Bala Mohammed thanked them for finding him worthy."
  },
  {
    "headline": "FG meeting with Twitter is like putting the cart before the horse – Falana",
    "summarized_story": "Human rights activist, Femi Falana has said the Federal Government’s planned meeting with Twitter is like putting the cart before the horse.\nFG banned Twitter in Nigeria last month, drawing criticism and anger of Nigerians.\nFalana, in an interview on Channels TV’s Politics Today said the federal Government should have met with Twitter in the first instance before clamping down on microblogging platform.\n“The Federal Government meeting with Twitter is a good development but in many instances, they put the cart before the horse.\n“But I think it is a good development that both sides are going to meet,” he said."
  },
  {
    "headline": "BREAKING: Soludo Emerges APGA Governorship Candidate In Anambra",
    "summarized_story": "The election was organized by the party’s Chief Victor Oye faction, which is backed by the party’s only governor, Chief Willie Obiano of Anambra State.\nSoludo received 740 votes out of the total 792 votes cast in the primary election, where he contested with four other candidates: Hon ThankGod Ibe, Hon Okwudili Ezenwankwo, and Barr Damian Okolo.\nOkwudili Ezenwankwo, Soludo’s rival, received 41 votes, ThankGod Ibe received 10 votes, and Okolo Damian received seven votes.\nDuring his acceptance speech, Soludo congratulated the party’s members and accepted the position of candidate, pledging to present his electoral program in August.\nAccording to NEWS DIRECT, five rejected party aspirant, Akachukwu Nwankpo, Nonso Okafor, Carter Dike, Chuma Umeoji, and Ifeanyi Ozoka, skipped the exercise, indicating that they may run in the Jude Okeke faction of the party primary election."
  },
  {
    "headline": "BREAKING: Army Reacts To Gumi’s Allegations Of Nigerian Military Supporting Bandits",
    "summarized_story": "Sheikh Ahmad Gumi said that the Nigerian military was collaborating with bandits responsible for different crimes and atrocities across the country, and the Nigerian Army has responded.\nThe claims were made by the Islamic scholar during his appearance on the ARISE TV Morning Show on Wednesday.\nGumi’s charges were denounced by Brigadier General Onyema Nwachukwu, Director of Army Public Relations, in a statement.\nAccording to Nwachukwu, the military arm has carried out its constitutional responsibilities in the most professional manner, adhering to worldwide best practices in terms of adherence to engagement norms and safeguarding of fundamental human rights.\nGumi’s remark, he said, was a planned attempt to discredit the Nigerian military and diminish the sacrifices of patriotic troops fighting relentlessly to restore peace and stability across the country."
  },
  {
    "headline": "#LekkiMassacre: How Nigerian Army, Lagos Government Secretly Took 20 Corpses To State Pathologist",
    "summarized_story": "Following the October 20, 2020 gunshots, the Nigerian Army and the Lagos State Government conspired and surreptitiously transported 20 dead from the Lekki Tollgate to the state pathologist for autopsy, according to SaharaReporters.\nThe Lagos State Pathologist, Prof John Obafunwa, conveyed this revelation confidentially to members of the Lagos State EndSARS panel sitting in Lekki, according to a top source.\nThis is in addition to the 99 bodies they admitted to taking to the pathologist previously, three of which were from Lekki Tollgate, according to the source.\nOn June 5, Obafunwa, the Lagos State government’s consultant pathologist, first stated that between October 20 and 24, last year, 99 bodies were deposited in the mortuary of the Lagos State University Teaching Hospital.\nSoldiers from the 81 division’s Bonny Camp, however, attacked the Lekki tollgate, where some demonstrators had congregated, and fired rounds on October 20."
  },
  {
    "headline": "JUST IN: ISWAP attacks army base in Borno, takes over military weapons",
    "summarized_story": "Suspected Islamic fighters stormed into an army base in Maiduguri, Borno State to attack soldiers in a fresh attack.\nJihadists from the Islamic State West Africa Province (ISWAP) rolled up in a dozen gun trucks to attack the military base.\nThe attack NEWS DIRECT gathered occurred at Chobol town, Borno State.\n“Attackers can be seen with standard weapons (RPG-7 w/ OG-7V, AKM/S, Type 56 variants, Type 88 HMG, etc.\nThe operation carried out at the military base includes the capture and burning of at least 1 DICON Ezugwu MRAP."
  },
  {
    "headline": "ACF to Ohaneze, Afenifere: Protect northerners in Southeast, Southwest",
    "summarized_story": "He said the ACF would soon convene a meeting with the other socio-cultural organisations to address challenges facing all parts of the country.\n“ACF wishes to assure that all Ibos who are living in the North are guaranteed their personal security.\nAnimal husbandry alone accounts for 6% of our Gross Domestic Product (GDP).\nIf animal husbandry is well harnessed it will save Nigeria, this large expenditure.\n“Nigerians are not aware that those involved in the business of animal husbandry are themselves victims of insecurity their cattle are often rustled and they are kidnapped for ransom too."
  },
  {
    "headline": "Attacks on schools: NSCDC releases survey on nationwide vulnerability",
    "summarized_story": "Following the spate of attacks and kidnapping of students in schools across the country, the Nigeria Security and Civil Defence Corps (NSCDC) has conducted a vulnerability survey of all schools in the country across the six geopolitical zones, states, senatorial districts and local governments.\nNSCDC Commandant General Dr Ahmed Audi stated this while briefing corps personnel at the National Headquarters Abuja on his policies and programs to reenergise the service.\nIn a statement released Wednesday in Abuja by Director, Public Relations, DCC Olusola Odumosu, said the Corps Female Squad unveiled recently had been deployed to patrol different schools to curtail the attack.\nThe statement said the CG also ordered all State Commandants to set up the female squad in all the 36 state commands and the Federal Capital Territory.\nI will make sure that all entitlements and operational allowances for the Rapid Response Squad, Female squad and any other assignments given to any personnel are paid so that we can prove to Nigerians that we are back again."
  },
  {
    "headline": "Breaking: Ronaldo, Benzema strike brace as Portugal, France, Germany book Euro 2020 Round 16 places",
    "summarized_story": "Both Cristiano Ronaldo and Karim Benzema produced a brace each to enable their countries – Portugal and France share honours, both top strikers converting from the spot (Ronaldo twice and Benzema once) during the final group matches on Wednesday night.\nRonaldo and Benzema were teammates at Real Madrid before the former moved to Juventus in Italy.\nIn the other fixture, Germany saved themselves from group phase exit with their second equaliser in the 84th minute through Leon Goretzka.\nAll three top sides in the “group of death” – France, Germany and defending champions Portugal – progress to the Round of 16.\nFrance will face Switzerland in the second round, while Germany take on England and Portugal challenge Belgium."
  },
  {
    "headline": "Insurgency: COAS task soldiers to redouble effort in Southeast -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS) Maj Gen Farouk Yahaya , has tasked troops in the Southeast to redouble their effort in order to consolidate on their successes in curtailing insurgency in the zone.\nThe COAS expressed delight in the successes so far recorded by the troops in the Southeast.\nGen Yahaya gave this task at Obinze Barracks, Owerri Imo state while addressing the troops during his maiden operational visit to Headquarters 34 Brigade.\nHe pointed out, that more successes would be recorded through compliance to instructions and loyalty to a superior authority.\nHe appreciated them for their spirit of jointness and synergy towards tackling insecurity in the state."
  },
  {
    "headline": "We would not condone reckless comments, Army replies Gumi -NigPilot",
    "summarized_story": "The Nigerian Army on Wednesday evening warned Sheik Ahmad Gumi to desist from reckless comment capable of causing disaffection or dampening the morale of troops as it would not condone such extreme comments.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu gave this warning in a statement in Abuja.\nHe said: “The Nigerian Army has just been alerted to a submission by Sheikh Ahmad Abubakar Gumi when he featured on ARISE TV Morning Show on Wednesday, 23 June 2021 alleging that the Nigerian Military is colluding with marauding bandits who have been responsible for various crimes and atrocities against Nigerians and the Nigerian state.\nIt is also necessary to reiterate that patriotism must be taken to a trajectory where subversive conversations on the state are brought to the barest minimum.\n“Opinion leaders are enjoined to demonstrate patriotism in building the peace, rather than being agents of distabilization, thereby aggravating the current security challenges facing the nation”."
  },
  {
    "headline": "NIN has no deleterious effect on JAMB’s financial base-Official -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB, has said that introduction of National Identity Number, NIN, as one of the requirements for 2021 Unified Tertiary Matriculation Examination, UTME has no deleterious effect on the financial base of the Board.\nThe Head Media, JAMB, Dr. Fabian Benjamin was reacting to a recent publication alleging that JAMB blames NIN requirement for revenue drops to N5.8bn.\nOn the contrary, the Board greatly appreciates the partnership with NIMC which has led to the inadvertent benefit of revealing the actual number of candidates registered annually.\nHe however said the introduction of NIN has helped in addressing one of the fundamental channels of perpetrating examination malpractice by way of multiple applications, among others.\nTherefore, the Board affirms its resolve not to ever compromise on the integrity of its processes on account of generating fat operating surpluses,” he said."
  },
  {
    "headline": "Senate may pass N895.8bn supplementary budget next week -NigPilot",
    "summarized_story": "Senate President, Dr. Ahmad Lawan, has hinted that the 2021 supplementary Appropriation Bill sent to the upper legislative chamber by President Muhammadu Buhari for approval may be passed next Tuesday.\nThe Supplementary Appropriation Bill of N895,842,465,917 passed the second reading in the upper legislative chamber following the presentation of the lead debate by the Senate Leader, Senator Yahaya Abdullahi during the plenary.\nPresident Muhammadu Buhari had on Tuesday, requested the Senate to consider and approves the supplementary budget to help fight insecurity and purchase vaccines in tackling COVID- 19 pandemic.\nIn line with the request, the Senate President, therefore, referred the Appropriation Bill sent by Buhari on June 15 to the Senate Committee on Appropriation, chaired by Senator Jibrin Barau (APC Kano North) and asked the committee to submit its report Tuesday next week.\nHe said that the 2021 Supplementary Budget was needed to fund defence, security and health-related expenditure."
  },
  {
    "headline": "Soludo Emerges APGA Governorship Candidate In Anambra",
    "summarized_story": "﻿Professor Charles Chukwuma Soludo has emerged as the governorship candidate for the All Progressives Grand Alliance in Anambra State.\nHe was announced as the winner on Wednesday night after the keenly contested primary held at the Professor Dora Akunyili Development Centre, Akwa, the state capital.\nProfessor Soludo, polled 740 votes, which represented more than 90 per cent of the votes cast, to defeat other candidates.\n“It is with humility, gratitude and total submission to the will of God that I hereby accept your nomination as the gubernatorial candidate of APGA in the November 6 governorship election,” he said as he gave an acceptance speech.\n“I want to thank the Alpha and the Omega, who in his infinite wisdom, decided that I should come from Anambra state of Nigeria."
  },
  {
    "headline": "Roof Leakage: No Money Released For Renovation Of National Assembly – Senate",
    "summarized_story": "The National Assembly has explained that no money was released for the renovation of the National Assembly complex.\nAlso, the lawmakers said the National Assembly and its leadership is not responsible for the maintenance and renovation of the National Assembly Complex and they have not received a sum of N37 billion or any amount for the renovation of the Complex.\nEven with this reduction, the sum of 9 billion or any amount is yet to be cash backed or released to the National Assembly.\nNone of this amount is even appropriated for the National Assembly bureaucracy or its leadership.\nIt must be reiterated that the National Assembly Complex is a National Monument which falls under the purview of control of the Federal Capital Development Agency."
  },
  {
    "headline": "Senate Threatens To Publish Names Of MDAs Who Failed To Appear Before Committee",
    "summarized_story": "The Senate has threatened to publish the names of government Ministries, Departments and Agencies who failed to appear before its public accounts committee to defend queries issued by the Auditor-General of the Federation.\nSenate President Ahmed Lawan issued the threat on Wednesday after the Chairman of the public accounts committee submitted the annual report of the Auditor-General of the Federation on the accounts of the federation for the year ended 31st December 2015.\nAccording to the report, the agencies which did not respond to the committee are the Nigeria Maritime Administration and Safety Agency (NIMASA), Federal Ministry of Health, Nigeria Police Force, Federal Fire Service, Ahmadu Bello University Teaching Hospital Zaria, Ministry of Police Affairs and Federal Ministry of Information.\nRead Also: ‘They Are Taking Us For Granted,’ Lawmaker Fumes Over Refusal Of IGP, CBN Gov, NSA Others To Appear Before NASSSome of the infractions in the report observed by the committee include withdrawal of funds from the executive from special fund accounts for purposes other than the objectives for which the funds were created, the prevalence of unwholesome financial practices by some principal revenue-generating agencies, deliberate delay in the submission of financial transcripts by the Accountant General of the Federation to the Auditor-General of the Federation and habitual late or non-submission of financial reports to the office of the Accountant-General of the Federation by MDA’s."
  },
  {
    "headline": "Akpabio Gives Date For Submission Of NDDC Forensic Audit To President Buhari",
    "summarized_story": "Minister of Niger Delta, Godswill Akpabio has revealed that President Muhammadu Buhari will receive the report of the ongoing forensic audit of the Niger Delta Development Commission (NDDC) next month.\nAkpabio indicated this while responding to questions from State House correspondents after a meeting with the Chief of Staff to the President, Ibrahim Gambari at the State House on Wednesday.\n﻿The Minister said much progress has been made on the forensic audit.\nAkpabio equally noted that he has been meeting with stakeholders in the region as a way of calming tension.\nHe also recommended that political leaders from other crisis-prone regions do the same to curb restiveness."
  },
  {
    "headline": "Falana Faults FG, Says Decision To Meet With Twitter Should Have Come Earlier",
    "summarized_story": "﻿Senior Advocate of Nigeria, Mr Femi Falana, has faulted the Federal Government’s suspension of Twitter in Nigeria and its recent decision to hold talks with the company.\nSpeaking on Channels TV’s Politics Today on Wednesday, the SAN said the decision to meet should have been planned before the suspension was done.\n“The Federal Government meeting with Twitter is a good development but in many instances, they put the cart before the horse.\nThe Federal Government has since come under fire for its decision to ban the social media platform in the country both from citizens and the international community.\nBut on Tuesday, the ECOWAS Court of Justice joined the call to condemn the decisions."
  },
  {
    "headline": "Ooni’s wife attends ENDSARS suspect baby’s naming",
    "summarized_story": "The baby delivered in prison by Kemisola Ogunniyi, the EndSARS protester in prison has been christened in Akure, the Ondo state capital.\nShe was arrested and charged to court alongside three others, for vandalising a property during the last October EndSARS protest in Akure.\nThe naming ceremony which took place at a church was attendedby the wife of the Ooni of Ife, Naomi Adeyeye Ogunwusi.\nShe presented the baby and her mother with various items and foodstuffsAdvertisementSome of the names given to the baby boy include, Elijah, Eriaanu, Oluwadarasimi, Okikiaanu, Oluwajomiloju Temitope.\nThe mother of the baby thanked the people for their support"
  },
  {
    "headline": "Antivirus magnate John McAfee dies in Spanish Jail",
    "summarized_story": "John McAfee, the controversial antivirus software magnate who has had multiple recent run-ins with the US law, has died at 75.\nMcAfee was awaiting extradition to the United States in a Spanish prison after being charged with tax evasion in last year.\nMcAfee was found dead in his cell in a prison near Barcelona on Wednesday around 1 p.m.\nET and a medical examiner is on the scene, a spokeswoman for the Superior Court of Catalonia told CNN.\nThe statement said “everything indicates” that McAfee could have died by suicide."
  },
  {
    "headline": "Ogun State Governor, Dapo Abiodun, heads Anambra APC governorship primaries committee",
    "summarized_story": "Chairman of the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC), Governor Mai Mala Buni has approved the appointment of Ogun Governor Prince Dapo Abiodun as chairman of the Primary Committee for Anambra Governorship Election.\nThe Ogun State governor heads a seven-man Committee with Senator John Enoh as Secretary.\nA statement by the party’s Caretaker Committee Secretary, Senator John James Akpanduoehehe on Wednesday in Abuja said the primary election is scheduled for Saturday, June 26th, 2021.\nThe statement reads: “In this capacity, the seven-member committee is expected to conduct the Primary Election to elect the Party’s Candidate for the Governorship Election for Anambra State in line with the provisions of our Party’s Constitution and Guidelines for the nomination of candidates.”Other members of the committee are Barrister Uba Maigari Ahmadu, Rt.\nGoodluck Opiah, Cathleen Oby Nwofor, Alhaji Shitu Muhammed and Barrister Sylvester Imohanobe"
  },
  {
    "headline": "Euro 2020: Germany to Play England in Second Round After Late Draw with Hungary",
    "summarized_story": "Germany have edged their way into the Euro 2020 knockout stages after managing a late 2-2 draw to Hungary at the Allianz Arena on Wednesday.The 2016 World Cup champions finished second in Group F after a dramatic evening of action that saw France draw 2-2 to Portugal.\nGermany’s Kai Havertz looked to have bought his side a lifeline on 66 minutes when he scored his second goal of the tournament.\nThe Chelsea midfielder headed the ball home into an empty net after a goalkeeping error from Hungary’s Peter Gulacsi.\nBut Hungary struck back moments later as midfielder Andras Schafer nodded the ball past as an on-rushing Manuel Neuer.\nGermany midfielder Leon Goretzka levelled the match once more on 85 minutes to secure his side through to the knockout stages."
  },
  {
    "headline": "Euro 2020: France, Portugal Advance as Ronaldo Ties International Goals Record in Draw",
    "summarized_story": "Portugal’s Cristiano Ronaldo tied the all-time men’s record for international goals with a pair of penalties in a 2-2 draw with France in Group F in Budapest on Wednesday.\nThe result sees both teams advance to the round of 16 at the 2020 European Championship.\nIn his storied career, Ronaldo had done it all for club and country, so this was surprisingly his first goal against France in his career.\nHowever, Ronaldo wasn’t done for Portugal, drawing his team back to level terms with another goal from the penalty spot following a whistle for handball on France’s Jules Kounde in the area.\nThe goal put Ronaldo on 109 goals for his career, level with Ali Daei’s record set during his long career with Iran’s national team."
  },
  {
    "headline": "Nigerian Military Replies Gumi, Says Army Not Colluding With Bandits – Arise News",
    "summarized_story": "The Nigerian Army has denied claims it’s colluding with marauding bandits who have been responsible for various crimes and atrocities against Nigerians and the Nigerian state.\nThe Army was reacting to a submission by Sheikh Ahmad Gumi who had told ARISE News on Wednesday that the Nigerian Military is colluding with bandits responsible for crimes including murder, rape and the kidnapping of schoolchildren.\nIt is also necessary to reiterate that patriotism must be taken to a trajectory where subversive conversations on the state are brought to the barest minimum.\n“Opinion leaders are enjoined to demonstrate patriotism in building the peace, rather than being agents of destabilization, thereby aggravating the current security challenges facing the nation.\nCitizens are enjoined to continue to support military operations by providing useful information to defence and security agencies and together we shall rid our society of these criminal elements.”By Abel Ejikeme"
  },
  {
    "headline": "McAfee Antivirus Software Creator Dead in Spanish Prison",
    "summarized_story": "John McAfee, the creator of the McAfee antivirus software, has been found dead in his cell in a jail near Barcelona, a government official told The Associated Press on Wednesday.\nHours earlier, a Spanish court issued a preliminary ruling in favour of the 75-year-old tycoon’s extradition to the United States to face tax-related criminal charges.\nThe statement didn’t identify McAfee by name, but said he was a 75-year-old U.S. citizen awaiting extradition to his country.\nAny final extradition order would also need to get approval from the Spanish Cabinet.\nA judge ordered at that time that McAfee should be held in jail while awaiting the outcome of a hearing on extradition."
  },
  {
    "headline": "Biggest Crypto Heist: South African Brothers Vanish With $3.6bn of Bitcoin",
    "summarized_story": "Two South African brothers who ran a cryptocurrency investment platform called Africypt have vanished with $3.6 billion worth of bitcoin in what could potentially be the biggest cryptocurrency heist in history.\nThe law firm says it’s also told crypto exchanges across the globe should any attempt be made to convert the digital coins.\nSome skeptical investors roped in the law firm, Hanekom Attorneys, and a separate group started liquidation proceedings against Africrypt.\nThe saga is unfolding after last year’s collapse of another South African Bitcoin trader, Mirror Trading International.\nAfricrypt investors stand to lose three times as much."
  }
]