[
  {
    "headline": "VAT crisis: We are confused over remittance, says private sector",
    "summarized_story": "The Organised Private Sector of Nigeria has said fulfilling of tax obligations, especially remitting Value Added Tax, has become confusing as businesses did not know the actual authority to relate with.\nThe Organised Private Sector of Nigeria comprises of Manufacturers Association of Nigeria, Nigeria Association of Chambers of Commerce, Industry, Mines and Agriculture, Nigeria Employers Consultative Association, Nigeria Association of Small Scale Industries and Nigeria Association of Small and Medium Enterprises.\nSome state governments and the Federal Inland Revenue Services are currently slugging it out in court over who should VAT in their states.\n“More so, as the deadline for remittance of VAT collection falls due on 21st of every month.\n“We appreciate the Lagos and Rivers state governments for the platform created to engage organised businesses in the course of this controversy."
  },
  {
    "headline": "Tin-Can, Onne, Warri, Calabar ports on verge of collapse – NPA",
    "summarized_story": "The Acting Managing Director of the Nigerian Ports Authority, Mohammed Bello-Koko, has said that the infrastructure of ports in the country including Tin Can Island, Onne, Delta, and Calabar are on the verge of collapse while calling for the release of funds for repairs.\nIn a statement by the NPA’s General Manager, Corporate and Strategic Communications, attributed to Bello-Koko, he called for infrastructural funding at the first retreat for the constituted board of directors of NPA.\nBello-Koko noted that Francophone African countries were funding dredging of their ports, whereas, in Nigeria, the NPA is responsible for funding the ports which he said puts ‘a lot of strain on our resources and capacity to invest in critical port infrastructure.’Bello-Koko said, “We are facing decaying port infrastructure, for example, sections of the quay aprons or walls at Tin Can Island Port, Onne, Delta, and Calabar ports are collapsing and require huge funds to repair them.\n“With the increasing pressure to remit more revenue to the Consolidated Revenue Fund of the Federation, it has become very difficult to have sufficient funds to attend to these decaying facilities, hence the need to explore alternative funding sources outside the traditional port service offerings.\n“NPA has a lot of high value landed properties in Onne, Snake Island, and Takwa Bay that are designated free trade zones and mostly allocated but with there is a poor arterial road network and other infrastructure to make them attractive for private investments which would bring good revenue to the Authority and Federal Government.”He disclosed that the NPA is in talks with various multilateral institutions including the French Development Agency, African Development Bank, European Investment Bank, and Sanlam Infraworks (a Central Bank of Nigeria approved fund manager for InfraCorp) to access long term low-interest credit for port infrastructure upgrades and expansion."
  },
  {
    "headline": "VAT: FIRS Amendment move futile, dead on arrival – Southern Governors declare",
    "summarized_story": "Akeredolu said the law does not give power to the federal government to collect VAT and share to the states, adding that the VAT should be under the state.\nThe FIRS seeking for amendment is a confirmation that they don’t have the power.\nThe amendment will be dead on arrival.\n“You can only collect VAT on behalf of the states and hand their money over to them.\nAkeredolu clarified that his visit to the former Lagos State Governor and National Leader of the All Progressives Congress (APC) has nothing to do with the 2023 election."
  },
  {
    "headline": "Tinubu is Capone of the South — Southern governors",
    "summarized_story": "By Dayo Johnson, AKUREThe Chairman of the Southern Nigeria Governors’ Forum, Rotimi Akeredolu, said weekend that Bola Ahmed Tinubu is the Capone in the South, and that he, Akeredolu, visited Tinubu to see how he was faring and not concerning 2023 elections.\nAkeredolu spoke about Tinubu, the former Lagos State governor and national leader of the All Progressives Congress, APC, on Arise TV ‘Sunday Talk Show’ hosted by Reuben Abati.\nDescribing the former Lagos State governor as the ‘capone’ in the South, Akeredolu said he is expected to return to the country soon, so as to meet with him and be able to take certain critical decisions.\nAsked if he will support Tinubu as the presidential candidate of the party in 2023, Governor Akeredolu said: “APC is a party.\n“But it can’t be as many as it was in the first term because the finances of the state is badly affected,” the Southern governors’ leader added."
  },
  {
    "headline": "VAT: FIRS amendment move futile, dead on arrival — Southern governors",
    "summarized_story": "The southern governors.\nBy Dayo Johnson, AKUREThe Chairman of the Southern Nigeria Governors’ Forum, Rotimi Akeredolu, said weekend that the amendments sought by the Federal Inland Revenue Service, FIRS, at the National Assembly on the controversial Value Added Tax, VAT, was futile and dead on arrival.\nAkeredolu said the law does not give power to the Federal Government to collect VAT and share to the states, adding that the VAT should be under the state.\nThe FIRS seeking for amendment is a confirmation that they don’t have the power.\n“You can only collect VAT on behalf of the states and hand their money over to them."
  },
  {
    "headline": "Vacinne equity, only way to end COVID-19 pandenmic-Sanwo-Olu harps",
    "summarized_story": "On the vaccine equity, the Governor said, the world must ensure that vaccines were available to all, especially poorer countries that had struggled with supply.\nAt the current rate, it would take about three years to achieve our herd immunity target.\n“One of the objectives of attaining herd immunity is to prevent mutations from emerging leading to more aggressive strains.\nIt is important that Lagos achieves herd immunity at the same time with all countries together.\n“This will put us on a better and more sustainable path towards herd immunity."
  },
  {
    "headline": "Man in police net for allegedly impregnating daughter in Ogun",
    "summarized_story": "The police in Ogun have arrested a 45-year-old man, Olaoluwa Jimoh, for allegedly impregnating his daughter, in Ode-Remo area of the state.\nThis is contained in a statement issued by the Police Spokesman in Ogun, DSP Abimbola Oyeyemi.\n”The command arrested Jimoh, on Sept.16, for allegedly impregnating his 19-year-old daughter.\n”The randy father was arrested following a complaint lodged at the Ode Remo Divisional Headquarters by the victim.\n“Upon the report, the DPO in Ode Remo division, CSP Fasogbon Olayemi quickly detailed his detectives to go after the suspect and he was promptly arrested."
  },
  {
    "headline": "Police arrest 1,146 suspects, get 426 convicted in Adamawa",
    "summarized_story": "The Adamawa State Police Command has arrested 1,146 suspects who are members of various high-profile criminal gangs.\nOf the number, 446 have been convicted by courts while 720 others are awaiting trial.\nGiving a breakdown of the arrests, the CP said they included 21 suspects in connection with the recent killings of seven persons in Dasin Bwate, in Fufore LGA.\n“The Command was able to dislodge and apprehend over 400 radical armed Shilla Boys and were charged to court.\n“The Command apprehended the notorious receiver of stolen properties, Alhaji Halilu Lafiya, alias SYB, and he has since been prosecuted and convicted,” the CP added."
  },
  {
    "headline": "Nigerian govt empowers police to prosecute travellers with fake COVID-19 PCR results",
    "summarized_story": "The Federal Government of Nigeria has given the police powers to prosecute passengers with forged COVID-19 Polymerase Chain Reaction (PCR) results.\nDAILY POST gathered that the amended protocol, signed by Secretary to the Government of the Federation, Boss Mustapha, became effective September 14, 2021.\nThe government took the decision after discovering some passengers either claim to be diplomats or ignore testing before trips.\nAlso, travellers found to have filled false information on the travel portal and online health declaration form would be liable to prosecution.\nNon-Nigerian passport holders and non-residents who visited Brazil, Turkey or South Africa within 14 days before their travel to Nigeria would be denied entry."
  },
  {
    "headline": "Middle Belt Forum mourns Mailafia, reveals events that led to his death",
    "summarized_story": "The forum also described Mailafia as a man that was completely dedicated to the emancipation of ethnic nationalities from the clutches of oppression.\nA statement issued by its National Publicity Secretary, Dr Isuwa Dogo, said, “While the above narration sums up the circumstances under which Dr Mailafia died, we still await the result of the actual cause of his death.\nAs a nationalist and patriot that he was, Dr. Mailafia was completely dedicated to the emancipation of ethnic nationalities from the clutches of oppression.\nArising from various inquiries from Nigerians over the circumstances of his death, the forum stated that Dr Mailafia arrived in Abuja last Sunday, September 12, 2021 from Akure and was received at the Nnamdi Azikiwe International Airport by his wife.\nIt added that Dr Mailafia was later given the option of choosing three hospitals at Gwagwalada Hospital, National Hospital and EHA Clinics, but his wife opted for the third choice."
  },
  {
    "headline": "Imo lawyers embark on three-day court boycott over colleague’s killing",
    "summarized_story": "Lawyers under the aegis of the Nigerian Bar Association in Imo State have announced that they will stay away from courts in the state between Monday the 19th to Wednesday the 21st of September 2021.\nThe lawyers, who made this announcement on Sunday evening, said the court boycott was a sequel to the gruesome murder of Barr.\nMunonye, Esq., that there shall be a boycott of all courts in the State by all lawyers from Monday the 19th to Wednesday the 21st days of September 2021.\n“The Notice reads: A. C. Emenyonu, secretary to the Imo Acting CJ has conveyed to me the CJ’s approval of a state-wide boycott of all courts in Imo state by Imo Lawyers till Wednesday, the 22nd day of September 2021.\n“To that effect, all courts in Imo State shall not sit on Monday, Tuesday and Wednesday the 20th, 21st and 22nd days of September 2021, respectively.”"
  },
  {
    "headline": "Stop borrowing to save Nigeria’s future – Journalists tell Buhari",
    "summarized_story": "Journalists under the auspices of the Nigeria Union of Journalists (NUJ) have cautioned President Muhamadu Buhari against further borrowing of loans from foreign agencies.\nThe journalists noted that this advice is necessary in order to save the future of the country.\nBut, NUJ Oyo State council while reacting noted that continuous borrowing is dangerous for the future of the country.\nIt noted with dismay the continuous borrowing culture of President Buhari.\n“The union also noted with dismay the continuous borrowing culture of Mr. President, Muhammed Buhari,” it said."
  },
  {
    "headline": "How Mailafia died, by Middle Belt Forum",
    "summarized_story": "Mailafia’s was later given the option of choosing three hospitals: Gwagwalada Hospital, National Hospital and EHA Clinics.\nOn arrival, the name of the doctor that was billed to attend to Dr. Mailafia was not on duty.\nAt a point, Dr. Mailafia complained over his breathing problems and pleaded with the doctors to place him in a ventilator.\n“While the above narration sums up the circumstances under which Dr. Mailafia died, we still await the result of the actual cause of his death.\nAs a nationalist and patriot that he was, Dr. Mailafia was completely dedicated to the emancipation of ethnic nationalities from the clutches of oppression."
  },
  {
    "headline": "Go back to work, Ngige urges doctors",
    "summarized_story": "Our Reporter- Advertisement -The Minister of Labour and Employment, Dr Chris Ngige, has appealed to the National Association of Resident Doctors (NARD) to shelve their industrial action while negotiation continues.\nNgige made the appeal during an interview on Channels Television’s Sunday Politics, as the resident doctors’ strike enters Day 59.\nRead Also: Court orders resident doctors to suspend strike“I have nephews who are resident doctors.\nI cannot destroy the profession, I have to protect the profession too.”The minister reacted to the court case filed by the Federal Government against the striking doctors.\n“The court has ruled and said ‘Go and do some more settlement but meanwhile, you go back to work and continue the settlement’,” he added."
  },
  {
    "headline": "Private business groups on VAT status: we are confused",
    "summarized_story": "Akeredolu said the law does not empower the Federal Government to collect VAT and share with the states, adding that the VAT should be under the states.\n“You can only collect VAT on behalf of the states and hand their money over to them.\nFollowing the judgment, Rivers and Lagos states passed laws empowering them to collect VAT.\nA Senior Advocate of Nigeria (SAN), Chief Mike Ozekhome, had argued that the Court of Appeal order on status quo empowered Rivers to collect VAT.\n“The law (Rivers VAT law) was already in operation before the FIRS challenged the validity of the judgment that had given the Rivers State Government the power to collect the VAT."
  },
  {
    "headline": "My husband beats me, says I eat too much – Woman tells court",
    "summarized_story": "By Agency ReporterA 23-year-old woman, Firdausi Sulaiman on Monday dragged her husband, Haruna Haruna, before a Sharia Court sitting in Magajin Gari, Kaduna State, seeking divorce on grounds that he beats her and says she eats too much.\nIn her petition, Suleiman, who lives in Rigasa in Kaduna, also told the court that her husband, Haruna, locks up the kitchen in the night.\n”In our seven years of marriage, I have not spent a complete year without him sending me back to my parent’s house.\nShe prayed the court to terminate the marriage and give her custody of their one daughter.\nHe ordered Haruna’s counsel to invite the couple’s parents or guardians to explore an amicable solution."
  },
  {
    "headline": "Army Chief addresses soldiers in Lagos today",
    "summarized_story": "The Chief of Army Staff, Lieutenant General Faruk Yahaya will today address troops in Lagos on the need to conform to the dictates of democracy and ensure loyalty to the government of the day.\nHe also commissioned multimillion Naira projects and opened up a new barrack for the force at the Epe area of Lagos.\nThe projects includes the administrative and classroom block of the Nigerian Army School of Ordnance which was formerly inside the Ojo Cantonment, but will be relocated to the Nigerian Army Cantonment in Epe.\nThe Chief of Army Staff is also schedule to meet with the Lagos State governor today and will commission some project in Lagos.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Ohanaeze, Afenifere, others fault NEF’s stand on power shift",
    "summarized_story": "By Sunday Ani, Chukwudi Nweje and Chinelo ObogoMixed reactions have trailed the position of the Northern Elders Forum (NEF) that power would remain in the north after 2023.\nNEF’s spokesman, Hakeem Baba-Ahmed, had said since the region control majority of the votes, it should not play the second fiddle.\nSo, those northern elders saying this (power will remain in the north) will definitely be in the minority because there was a gentleman’s agreement that power should be rotating between north and south.\nSo, whatever happens, truth will always prevail over falsehood.”National president, Middle Belt Forum (MBF), Pogu Bitrus, said power shift is determined by political parties and not northern elders.\nSo, they are just making a political statement that is neither here nor there,” he said."
  },
  {
    "headline": "FG insincere with fight against insecurity –Archbishop Martins",
    "summarized_story": "By Lawrence EnyoghasuCatholic Archbishop of Lagos, Alfred Adewale Martins, has accused President Muhammadu Buhari’s administration of insincerity in the fight against insecurity.\n“Insecurity is the major problem we have in Nigeria today; even the church is not safe.\nWhen you hear the kind of complains and dissatisfaction from the military, you will know that there is inadequate sincerity.\n“One of the things about Nigerian politicians is inconsistency in goals and principles.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Secession not solution to Nigeria’s problem –Gbajabiamila, Obi, Ribadu, others – The Sun Nigeria",
    "summarized_story": "They said what every citizen needs and cares for is level playing field, justice, equity, fairness and good governance.\nObi said the country cannot stay united unless there was equity and justice.\nIf Nigeria was a productive country, our diversity could have been a source of strength but we are a sharing country’.\n“Our country is not a productive country but a country of consumption and sharing.\nRibadu said Nigeria is work in progress, stressing that Nigerians needs to do their best to keep the country united."
  },
  {
    "headline": "11 bandits killed, others arrested in Kogi",
    "summarized_story": "A group of bandits terrorising some parts of Koton Karfe Local Government Area (LGA) of Kogi State have met their Waterloo as officers of the State Vigilante Group killed 11 of them and arrested others.\nThe successful operation by the security operatives was carried out in series working with credible intelligence.\nA source within the Kogi State Vigilante Service said, ”Alaidi is their ring leader.\nHe reiterated that governments at all levels would continue to make efforts towards sustaining the drive for a peaceful Kogi state, by making every nook and cranny of the state unsafe for criminal elements and their sponsors.\nA source within the Kogi state security circles, who doesn’t want his name in print, said they were getting “encouraging headway” in their operations against the kidnappers."
  },
  {
    "headline": "Akeredolu: Plan to Amend Constitution over VAT Will Be Dead on Arrival",
    "summarized_story": "The governor said, “The issue of VAT, looking at the constitution, is under the purview of the states.\nSouthern governors have taken a decision to pursue fiscal federalism.\n“We, the southern governors, clamour for true federalism and true federalism includes fiscal federalism.\nEven if the governors agree to amend the constitution, the House of Assembly in the various southern states will never approve it.\nAkeredolu insisted that the southern governors were united in their resolve to push for states’ collection of tax."
  },
  {
    "headline": "Nigeria’s Rig Count Soars as NNPC, Partners Set to Pump More Oil",
    "summarized_story": "This was just as President Muhammadu Buhari, in his capacity as Minister of Petroleum Resources, yesterday triggered Section 53(1) of the new Petroleum Industry Act (PIA) by directing the incorporation of the Nigerian National Petroleum Company (NNPC) Limited under the new law.\nThe other board members are Dr. Tajudeen Umar (North-east), Mallam Mohammed Lawal (North-west) and Chief Pius Akinyelure (South-west).\nThe previous month, a document obtained by THISDAY showed that the NNPC and its partners lost 6.035 million barrels of crude oil to emergency shutdowns.\nThe statement said, “President Buhari has also approved the appointment of the board and management of the NNPC Limited, with effect from the date of incorporation of the company.\nEventually, the commercialised NNPC would witness the sale of shares to Nigerians, while any assets, interest and liabilities not transferred to NNPC Limited would remain with NNPC until extinguished or transferred to the government after which NNPC shall cease to exist."
  },
  {
    "headline": "Emefiele: CBN to Okay Legitimate FX Demand Exceeding Approved Cap",
    "summarized_story": "James Emejo in AbujaThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele has said the apex bank is ready to approve legitimate foreign exchange (FX) demand that exceeds the approved transaction cap if such applications meet stipulated requirements.\nThe CBN governor gave the assurance against the backdrop of complaints that the current FX policy which limits transactions to $5,000 may not fulfil consumers’ actual needs.\nBut Emefiele, while addressing journalists over the weekend, said the CBN was ready to approve requests from commercial banks to go beyond the caps if it is proven that the extra demand for FX is for legitimate purposes.\nWe can decide that out of the N10 billion we move N2 billion into an electronic wallet for the bank.\nWe will look at the various products, determine the risks, determine the best way to mitigate the risks before opening it up."
  },
  {
    "headline": "PDP Zoning C’ttee Meets Wednesday to Take Critical Decisions",
    "summarized_story": "THISDAY, however, learnt last night that the zoning committee would meet Wednesday in Enugu and possibly come with the zoning of the offices of the National Working Committee.\nThis latest development, THISDAY learnt, might have followed new calculations on the zoning of the office of the leadership of the party.\n“The PDP as a political party cannot force any politician from the South to contest for the presidential ticket of the party.\nIt also contended that the presidential ticket should be left to those who are interested, andnot what would be forced on those who are not ready to do the job.\nWe cannot force any one, who is not prepared to come and be the PDP presidential candidate."
  },
  {
    "headline": "Moghalu Urges FG to Target FDIs that Impact Human, Infrastructure Devt",
    "summarized_story": "“The most important requirements for FDI to successfully contribute to real development in a country like Nigeria (depends on) the presence of a well-educated workforce, and infrastructure.\nHe also advised the government to develop factor endowment that would have skilled human capital as a priority need.\nHe also enjoined the government to evolve an FDI paradigm shift away from extractive industries to value-added derivatives of such industries.\nMoghalu also said Nigeria should evolve a legal regime that would offer strong investor protections in order to facilitate increased flows of high quality investment.\n“Improve the quality of governance and institutions: assessments of governance and institutional capacity to create a sustainable investment environment play an important role in attracting quality investment,” he said."
  },
  {
    "headline": "TIMELINE: Four Staunch Critics Of Lawless Buhari-led Government Who Have Died Within Eight Months",
    "summarized_story": "Four staunch critics of the Muhammadu Buhari-led government have died in the last eight months.\n“In addition, Mamman Daura was the one who singlehandedly brought up Abba Kyari, the current Chief of Staff to the President.\nIn fact, Abba Kyari knows Mamman Daura more than he knows his own father.\nNext, we have the woman who represents Kaduna in the Federal Executive Council, she is a cousin to Kaduna State governor, Nasir el-Rufai.\nWe have been told that they are so-called bandits, who should not be called bandits because bandits do not bring down military aircraft."
  },
  {
    "headline": "TIMELINE: Four Staunch Critics Of Lawless Buhari-led Government Who Have Died Within Eight Months",
    "summarized_story": "Four staunch critics of the Muhammadu Buhari-led government have died in the last eight months.\n“In addition, Mamman Daura was the one who singlehandedly brought up Abba Kyari, the current Chief of Staff to the President.\nIn fact, Abba Kyari knows Mamman Daura more than he knows his own father.\nNext, we have the woman who represents Kaduna in the Federal Executive Council, she is a cousin to Kaduna State governor, Nasir el-Rufai.\nWe have been told that they are so-called bandits, who should not be called bandits because bandits do not bring down military aircraft."
  },
  {
    "headline": "BREAKING: Former Nigeria's Central Bank Deputy Governor Vocal On Alleged 'Islamisation' Agenda Of Buhari Regime, Is Dead",
    "summarized_story": "A former Deputy Governor of the Central Bank of Nigeria (CBN), Dr Obadiah Mailafia, is dead.\nSaharaReporters gathered that Mailafia died on Sunday morning at the National Hospital, Abuja from a yet-to-be disclosed illness.\nWe have been told that the so call bandits, who should not be called bandits because bandits do not bring down military aircraft.\nNo bandit has the power to attack Nigeria Defence Academy which is the premier institution for the training of armed forces.\nNo bandit has the capacity to do that, only terrorists have the capacity to do that."
  },
  {
    "headline": "BREAKING: Former Nigeria's Central Bank Deputy Governor Vocal On Alleged 'Islamisation' Agenda Of Buhari Regime, Is Dead",
    "summarized_story": "A former Deputy Governor of the Central Bank of Nigeria (CBN), Dr Obadiah Mailafia, is dead.\nSaharaReporters gathered that Mailafia died on Sunday morning at the National Hospital, Abuja from a yet-to-be disclosed illness.\nWe have been told that the so call bandits, who should not be called bandits because bandits do not bring down military aircraft.\nNo bandit has the power to attack Nigeria Defence Academy which is the premier institution for the training of armed forces.\nNo bandit has the capacity to do that, only terrorists have the capacity to do that."
  },
  {
    "headline": "North Inherited Nigeria’s Leadership, Won't Be Intimidated To Leave Power In 2023 –Northern Elders",
    "summarized_story": "The Northern Elders Forum (NEF) has said Northern Nigeria inherited leadership, insinuating that the British colonial administrators handed over the leadership of the country to the North in 1960.\nThe group said, for this reason, the North will not succumb to intimidation to give up the presidency in 2023.\nMuhammadu Buhari, a northerner, has been Nigeria's President since 2015, winning the election in 2019 for a second term in office.\nMeanwhile, the Northern group also stated that the region will fix its economy so as not to depend on other regions which it accused of intimidating the North.\nWe are in the process of rebuilding the North and we will rebuild the North from 2023."
  },
  {
    "headline": "VAT collection: FIRS' move to amend constitution dead on arrival, says Akeredolu",
    "summarized_story": "TheCable had exclusively reported moves by the revenue agency to demand the inclusion of VAT collection in the exclusive legislative list.\nThe FIRS and some state governments are currently embroiled in a legal tussle over VAT collection.\nLast week, the court of appeal directed states to maintain status quo on VAT collection pending the determination of an appeal filed by the FIRS.\nAdvertisementAccording to him, the law does not give power to the FG to collect VAT and share it with the states.\n“You can only collect VAT on behalf of the states and hand their money over to them."
  },
  {
    "headline": "VAT collection: FIRS' move to amend constitution dead on arrival, says Akeredolu",
    "summarized_story": "TheCable had exclusively reported moves by the revenue agency to demand the inclusion of VAT collection in the exclusive legislative list.\nThe FIRS and some state governments are currently embroiled in a legal tussle over VAT collection.\nLast week, the court of appeal directed states to maintain status quo on VAT collection pending the determination of an appeal filed by the FIRS.\nAdvertisementAccording to him, the law does not give power to the FG to collect VAT and share it with the states.\n“You can only collect VAT on behalf of the states and hand their money over to them."
  },
  {
    "headline": "ISWAP has embarked on massive recruitment, says army",
    "summarized_story": "Onyema Nwachukwu, spokesperson of the Nigerian Army, says the Islamic State in West Africa Province (ISWAP) has embarked on a massive recruitment of members.\nAdvertisementThe army recently launched a series of offensives against the insurgents in its ongoing Operation Hadin Kai in the north-east.\nHundreds of the insurgents, including some of the top commanders surrendered to troops of the army a few weeks ago.\nDuring a tour of the Hadin Kai theatre command in Maiduguri, Borno state on Sunday, Nwachukwu called on the media to help block the recruitment.\n“They have embarked on what I will call a massive recruitment drive and I consider it very important to engage the media to block this recruitment."
  },
  {
    "headline": "ISWAP has embarked on massive recruitment, says army",
    "summarized_story": "Onyema Nwachukwu, spokesperson of the Nigerian Army, says the Islamic State in West Africa Province (ISWAP) has embarked on a massive recruitment of members.\nAdvertisementThe army recently launched a series of offensives against the insurgents in its ongoing Operation Hadin Kai in the north-east.\nHundreds of the insurgents, including some of the top commanders surrendered to troops of the army a few weeks ago.\nDuring a tour of the Hadin Kai theatre command in Maiduguri, Borno state on Sunday, Nwachukwu called on the media to help block the recruitment.\n“They have embarked on what I will call a massive recruitment drive and I consider it very important to engage the media to block this recruitment."
  },
  {
    "headline": "NPA: Tin Can Island, Onne ports infrastructure collapsing",
    "summarized_story": "Mohammed Bello-Koko, acting managing director of the Nigerian Ports Authority (NPA), says Tin Can Island, Onne, Delta, and Calabar ports infrastructure are collapsing and require funds for repair.\nAdvertisementOlaseni Alakija, NPA general manager, corporate and strategic communications, in a statement on Sunday, said Bello-Koko expressed the funding needs at the first retreat for the constituted board of directors of NPA.\nAccording to Bello-Koko, the governments of French-speaking countries in Africa fund dredging of their ports, whereas in Nigeria, “we (NPA) are responsible for funding ours which put a lot of strain on our resources and capacity to invest in critical port infrastructure.\n“We are facing decaying port infrastructure, for example, sections of the quay aprons or walls at Tin Can Island Port, Onne, Delta, and Calabar ports are collapsing and require huge funds to repair them,” he said.\nAdvertisement“With the increasing pressure to remit more revenue to the Consolidated Revenue Fund (CRF) of the Federation, it has become very difficult to have sufficient funds to attend to these decaying facilities, hence the need to explore alternative funding sources outside the traditional port service offerings.”To address this, Bello-Koko said NPA’s management has started to explore alternative ways to boost the revenue performance of the agency."
  },
  {
    "headline": "A backstory to the tussle between CBN and popular website abokiFX",
    "summarized_story": "abokiFX, a popular mobile and web-based platform that collates the black market foreign exchange rates in Nigeria, on Friday announced it will temporarily suspend the publishing of rates on all its platforms, hours after receiving threats from the Central Bank of Nigeria (CBN).\nWhy Nigeria has different exchange ratesNigeria is Africa’s largest producer of oil, a commodity that brings in more than 90% of the country’s foreign exchange earnings.\nBut rather than an outright devaluation of the naira, the CBN adopted a multiple exchange-rate regime.\nThat left Nigeria with only two rates – the NAFEX rate and the parallel market rate – from almost five different rates as of early 2020.\n“All allegations against our director are yet to be confirmed but we at abokiFX DO NOT trade FX nor do we manipulate parallel market rates,” the statement reads."
  },
  {
    "headline": "Africell exits Ugandan telecom market due to fierce competition",
    "summarized_story": "The remaining 10% is split between three or four other nationwide operators including Africell and Uganda Telecom.\nIt appeared Africell was entering an untapped market and the company bet on data services to eat into the market share of incumbents.\nBut like its predecessors, the company struggled to make a notable impact in a mobile market reputedly hostile to new entrants.\nUganda has over 24 million mobile subscribers with MTN controlling 50% of the market while Airtel Uganda accounts for 43%.\nWhile it struggled to grow its market share, Africell also grappled with high operating costs and debt burden, part of which was inherited from Orange."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Inside story of electronic bank fraud in Nigeria",
    "summarized_story": "More than six high-profile electronic bank fraud cases took place in Nigeria between February and July this year.\nHe asks me if I have ever heard of a BDC owner jailed for abetting bank fraud.\nOperational teamThere is no specific number of persons required to undertake an electronic bank fraud.\nEach ‘specialist’ in the team for a specific bank fraud has a specific role to play.\nPublic holidays that begin on Thursdays are the most welcome period for bank fraud."
  },
  {
    "headline": "Inside story of electronic bank fraud in Nigeria",
    "summarized_story": "More than six high-profile electronic bank fraud cases took place in Nigeria between February and July this year.\nHe asks me if I have ever heard of a BDC owner jailed for abetting bank fraud.\nOperational teamThere is no specific number of persons required to undertake an electronic bank fraud.\nEach ‘specialist’ in the team for a specific bank fraud has a specific role to play.\nPublic holidays that begin on Thursdays are the most welcome period for bank fraud."
  },
  {
    "headline": "Internet banking fraud victims recall experience",
    "summarized_story": "“I became nervous,” she said, “when I neither received alerts nor emails on my phone alerting me to these deposits.\nThey had also changed her daily transfer limits of ten million naira.\n“They stole ninety-nine million naira from my account!” she said agonizingly.\nHer bank replaced her money after they pleaded with her not to publicise her experience.\nHe remembers the day they discovered that over three hundred million naira had been stolen from their account."
  },
  {
    "headline": "Edo, Swiss govt, IOM, others partner to tackle unemployment, irregular migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Government through the state’s skills development agency, EdoJobs has partnered the International Organisation for Migration (IOM) and the Swiss Government to launch a community-based reintegration programme to tackle unemployment and irregular migration in Edo.\nLaunching the programme with the theme, “Promoting Resilience and Sustainable Livelihood for Returned Migrants and Unemployed Youths Through Community-Based Reintegration,” the Managing Director of EdoJobs, Mrs. Ukinebo Dare, said the government will sustain partnerships to guarantee a prosperous Edo State.\nAccording to her, “Everything that we do is about attracting the demand for highly skilled talents in Edo State and providing the demands for that talent.\nThis project sits very much at the center of what we like to do.\n“For us, the major thing that we celebrate about this programme is that it has a lot of elements that we are passionate about including skill transfer, engagement with the private sector and collaboration among various partners.”Also speaking, the Senior Programme Manager, IOM, Lagos, Saskia Kok, said the programme will contribute to improved and sustainable reintegration of returned migrants and create livelihood opportunities for local communities."
  },
  {
    "headline": "IGP Confirms DSP Edafe As PPRO Delta State Command – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The Inspector General of Police (IGP) Usman Baba Alikali Psc+ FDC, NPM has approved the appointment of DSP Edafe Bright as the new Police Public Relations Officer (PPRO) of Delta State Police Command with immediate effect.\nThis was contained in a statement signed by ASP Edna Bassey 2IC PPRO, Delts State Command.\nBefore his current posting, Edafe was the acting image maker of the command.\nHe holds a National Diploma (HND) from Federal Polytechnic Ado-Ekiti, he was one time the Administrative Officer Area Command Asaba and he has also served in Ekiti State Police Command.\nThe newly appointed police spokesperson however, appeals to the general public and journalists to accord him same support to that was given to him predecessors."
  },
  {
    "headline": "COVID-19: Edo urges vaccination, compliance with preventive protocols amid rising infections, deaths – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents to complement the government’s efforts at containing the COVID-19 pandemic by coming out to get vaccinated against the deadly virus.\nThe state’s COVID-19 Incident Manager, Dr. Andrew Obi gave the charge while addressing journalists in Benin City at the weekend.\nObi, who decried the rise in the number of infections and deaths in the state, reiterated the need for all citizens to continue to comply with preventive protocols against the spread of the virus in order to remain healthy and protected against the deadly virus.\nHe noted that it is imperative for all residents to be vaccinated to stay alive and healthy, as more unvaccinated persons continue to die from the virus.\nHe restated that all persons who have died from the virus in the third wave of the pandemic in the state were unvaccinated, while over 96 percent of confirmed cases are those who were never vaccinated."
  },
  {
    "headline": "Hoodlums attacks INEC local government office in Enugu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Independent National Electoral Commission Office at Agwu Local Government Area of Enugu state has been attacked by hoodlums in the early hours of Sunday, 19th September, 2021, setting the building ablaze resulting in extensive damage to mainly the stores section where election materials are kept.\nThis was made known by the Resident Electoral Commissioner for Enugu State, Mr. Emeka Ononamadu, who reported the attack on the INEC office in Awgu Local Government Area of the State.\nHe also noted that, the identity or motives of attackers are unknown while the incident has been reported to the Nigeria Police Force for investigation.\n“The Commission appreciates the prompt response of the security agencies comprising the Nigeria Police Force, the Nigerian Army, the Department of State Services (DSS) and the Nigerian Security and Civil Defence Corps (NSCDC) as well the Enugu State Fire Service and the Awgu Local Government Neighbourhood Watch”.\n“This unfortunate incident is the first since the last attack on our facilities four months ago in May 2021”, he added."
  },
  {
    "headline": "Caverton, Axa Mansard, FBN Holdings top stocks to watch this week",
    "summarized_story": "It closed the last trading session at N1.72 per unit, with Earnings Per Share (EPS) of N0.35 and a Price-to-Earnings (PE) ratio of 4.85.\nAXA MANSARD INSURANCEAXA Mansard, Nigeria’s biggest insurance company by market value, makes the selection for trading close to its lowest price in 52 weeks at the moment.\nIt opens on Monday at N7.5 per share and EPS of N2.11 as well as a PE ratio of 3.56.\nIt closed at N3.04 per unit at the last trading session, has EPS of N0.60 and a PE ratio of 5.28.\nThe PE ratio is 6.89."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Abia, Anambra states in darkness as Aba transmission station explodes",
    "summarized_story": "The Enugu Electricity Distribution Company (EEDC) has said an explosion at the Aba transmission station is responsible for the power outage experienced in Abia and Anambra.\nThe Disco which stated this in a statement by its spokesman Emeka Ezeh in Awka, noted that there was an explosion at the Aba transmission station switchyard in the early hours of Sunday, resulting in loss of supply to Alaoji Line 1.\nThe electricity firm pleaded for the understanding and patience of its customers currently without a power supply.\n“EEDC management regrets that most electricity customers in parts of Abia and Anambra have been without power supply for days due to series of faults recorded on some of the TCN networks,” he said.\n“We owe our customers this information and also appeal for their patience and understanding"
  },
  {
    "headline": "NBRP demands passage of Library Bill of Rights, seek promotion of reading culture, others at Uyo conference",
    "summarized_story": "“Emphasize the urgent need for value reorientation, and aggressive readership promotion to entrench the reading culture in all communities within the Nigerian Society.\n“Advocate voluntary citizens and Community initiatives and involvement in book clubs establishment and libraries management.\n“Endorse that Uyo will be the National Book Clubs City for a second year, commencing from April 23rd 2022 and that Lagos would take over as National Book Clubs City from April 23rd 2023 through April 22, 2024.\nAccordingly also, Uyo would host the 2022 National Conference and AGM of the Network of Book Clubs and Reading Promoters in Nigeria.\n“Thank Watbridge Hotel, Uyo and Ibom Air for their gracious sponsorship and support towards the successful hosting of the event.”"
  },
  {
    "headline": "Obasanjo attacks Buhari over borrowing spree, says it’s criminal to accumulate debt for future generation",
    "summarized_story": "Nigeria’s former president, Chief Olusegun Obasanjo has berated the President Muhammadu Buhari administration over its continued accumulation of debt through borrowing, noting that piling up debt for future generation is foolish and criminal.\nObasanjo who spoke in a video shared by Channels TV Sunday night, said it’s the height of folly to borrow to fund recurrent expenditure.\n“But if you are borrowing and you are accumulating debt for the next generation and the generation after them, it is criminal to put it mildly.”Obasanjo’s administration is lauded for clearing Nigeria’s foreign debt.\nWhen I came in as an elected President we were spending $3.5 billion to service debt and even with that our quantum of debt was not going down,” Obasanjo said.\nPresently, Nigeria’s Domestic and Foreign Debt Profile stands at N35.47 trillion according to latest figures from the Debt Management Office."
  },
  {
    "headline": "How Obadiah Mailafia Died- Middle Belt Forum",
    "summarized_story": "Adebayo ObajemuContrary to speculations that the former Deputy Governor of the Central Bank of Nigeria, Dr. Obadiah Mailafia, died at the National Hospital, the National Publicity Secretary of the Middle Belt Forum, Dr. Isuwa Dogo has disclosed that he died at the University of Abuja Teaching Hospital, Gwagwalada, Abuja.\nRecall that the Middle Belt Forum was championed by Mailafia.\nA statement issued by Dr. Dogo on behalf of the Middle Belt Forum said as someone who relentlessly participated in the activities of the Middle Belt Forum, his untimely death had dealt a deadly blow on ethnic nationalities of not only the Middle Belt but the country at large.\nDr.Dogo stated that Mailafia was later given the option of choosing three hospitals: Gwagwalada Hospital, National Hospital and EHA Clinics.\n“While the above narration sums up the circumstances under which Dr. Mailafia died, we still await the result of the actual cause of his death."
  },
  {
    "headline": "KADINVEST 6.0: Kaduna Is Still Investors’ Destination Of Choice – KADIPA",
    "summarized_story": "For us as a state, the Kaduna Investment Summit (KADINVEST) has helped showcase the state to the world.\nI think the Kaduna Investment Agency (KADIPA) gets many proposals for one project or the other.\nHow was KADIPA able to earn investors’ confidence in the last five years, so much that it is an investment destination of choice?\nIn a pre-event press briefing, you said that KADINVEST has so far attracted about $2 billion worth of investments into Kaduna state.\nWhen the governor assumed office, the first thing he did was convert Kaduna state into an e-governance state."
  },
  {
    "headline": "KADINVEST 6.0: Kaduna Is Still Investors’ Destination Of Choice – KADIPA",
    "summarized_story": "For us as a state, the Kaduna Investment Summit (KADINVEST) has helped showcase the state to the world.\nI think the Kaduna Investment Agency (KADIPA) gets many proposals for one project or the other.\nHow was KADIPA able to earn investors’ confidence in the last five years, so much that it is an investment destination of choice?\nIn a pre-event press briefing, you said that KADINVEST has so far attracted about $2 billion worth of investments into Kaduna state.\nWhen the governor assumed office, the first thing he did was convert Kaduna state into an e-governance state."
  },
  {
    "headline": "Stakeholders Caution Northern Youths Against Political Violence",
    "summarized_story": "Disturbed by the prevailing political unrest and insecurity in the northern part of Nigeria, stakeholders in the region have cautioned Arewa youths to redefine their orientation for better future.\nThe northern youths were also urged to desist from allowing themselves to be used as destructive tools of violence during political campaign.\nThe admonition came from some northern leaders who spoke yesterday at the National Youth Conference 2021 organised by Arewa Youth Consultative Council in Kano.\nThey said it was high time the Northern youth charted a new beginning for brighter tomorrow.\nADVERTISEMENTThe chairman of the occasion and vice-chancellor, Yusuf Maitama Sule University, Kano, Prof Muktar Atiku Kurawa, identified illiteracy, unemployment and drug abuse as major menace eliciting security challenges in the North."
  },
  {
    "headline": "Stakeholders Caution Northern Youths Against Political Violence",
    "summarized_story": "Disturbed by the prevailing political unrest and insecurity in the northern part of Nigeria, stakeholders in the region have cautioned Arewa youths to redefine their orientation for better future.\nThe northern youths were also urged to desist from allowing themselves to be used as destructive tools of violence during political campaign.\nThe admonition came from some northern leaders who spoke yesterday at the National Youth Conference 2021 organised by Arewa Youth Consultative Council in Kano.\nThey said it was high time the Northern youth charted a new beginning for brighter tomorrow.\nADVERTISEMENTThe chairman of the occasion and vice-chancellor, Yusuf Maitama Sule University, Kano, Prof Muktar Atiku Kurawa, identified illiteracy, unemployment and drug abuse as major menace eliciting security challenges in the North."
  },
  {
    "headline": "Police Arrest 2 ‘One Chance’ Robbers, Recover N401,000",
    "summarized_story": "Police in the FCT said they have arrested two suspects in Abuja over “one chance’’ con trap, rescued a female victim and recovered N401,000.\nThe command’s public relations officer, DSP Josephine Adeh, made the disclosure in a statement she issued in Abuja yesterday.\n“One chance’’ is a crime in which assailants pose as cab drivers and passengers, take victims, particularly female commuters into their cabs and dispossess them of their valuables.\n“In this instance, the suspects picked up the victim who had just closed from work.\n“On their way to her destination, the assailants locked the car, changed the route, tied her up and demanded her ATM card."
  },
  {
    "headline": "BBNaija6: I’m not happy Queen wants to sleep with Cross, Whitemoney cries",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Whitemoney, stated that he felt hurt that Queen wanted to sleep with Cross.\nApparently, Queen had stated that she would want to sleep with Whitemoney and Cross, a statement that hurt Whitemoney, so he confronted her.\nBut I said I should be patient and see how it goes.”Queen, however, apologised for her statement saying, “I’m sorry.\nThis is not the first time Whitemoney confronted Queen because of Cross.\nSince Queen got into the house, she had been really close to Whitemoney and even referred to him as her ‘acting boyfriend’."
  },
  {
    "headline": "BBNaija6: I’m not happy Queen wants to sleep with Cross, Whitemoney cries",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Whitemoney, stated that he felt hurt that Queen wanted to sleep with Cross.\nApparently, Queen had stated that she would want to sleep with Whitemoney and Cross, a statement that hurt Whitemoney, so he confronted her.\nBut I said I should be patient and see how it goes.”Queen, however, apologised for her statement saying, “I’m sorry.\nThis is not the first time Whitemoney confronted Queen because of Cross.\nSince Queen got into the house, she had been really close to Whitemoney and even referred to him as her ‘acting boyfriend’."
  },
  {
    "headline": "N11bn police equipment contract fraud: How infighting within NPTF management led to ICPC’s petition, investigation",
    "summarized_story": "Following the invitation of Management staff of the Nigerian Police Trust Fund (NPTF), by ICPC over investigations into the N11 billion sub standard equipment fraudulent purchase for the Nigerian Police, it has emerged that in-fighting among management staff over sharing formula of money acquired from the contract led to the petition.\n“In all my interactions with the management, I always start my address by harping on transparency and due process.\n“The truth of the matter is that the Federal government meant well by creating this Trust Fund to improve the Nigerian Police Force.\n”Approving the disbursement of money from the Trust Fund to finance projects or activities of the Nigerian Police Force and Police Institutions beneficiaries of the Proceeds of Trust Fund.\nRegarding the role of management, Section 15 states that the Executive Secretary is the Chief Executive and Accounting Officer of the Trust Fund and is responsible for the administration of the Trust Fund."
  },
  {
    "headline": "N11bn police equipment contract fraud: How infighting within NPTF management led to ICPC’s petition, investigation",
    "summarized_story": "Following the invitation of Management staff of the Nigerian Police Trust Fund (NPTF), by ICPC over investigations into the N11 billion sub standard equipment fraudulent purchase for the Nigerian Police, it has emerged that in-fighting among management staff over sharing formula of money acquired from the contract led to the petition.\n“In all my interactions with the management, I always start my address by harping on transparency and due process.\n“The truth of the matter is that the Federal government meant well by creating this Trust Fund to improve the Nigerian Police Force.\n”Approving the disbursement of money from the Trust Fund to finance projects or activities of the Nigerian Police Force and Police Institutions beneficiaries of the Proceeds of Trust Fund.\nRegarding the role of management, Section 15 states that the Executive Secretary is the Chief Executive and Accounting Officer of the Trust Fund and is responsible for the administration of the Trust Fund."
  },
  {
    "headline": "Obasanjo calls Buhari's mounting debts criminal",
    "summarized_story": "Former President Olusegun Obasanjo has questioned President Buhari’s plan to borrow more money, declaring that borrowing to accumulate debt for the next generation is criminal.\nObasanjo gave his opinion in an interview with Channels Television on the sidelines of an event in South Africa.\nObasanjo cautioned that if the existing debt is left unserviced or unpaid, it might become a problem for successive administrations.\n“But if you are borrowing and accumulating debts for the next generation and the next generation after them, it is criminal.\n“When I came into government as elected President, we were spending $3.5 billion to service debts."
  },
  {
    "headline": "Israel DMW reunites with Davido",
    "summarized_story": "Nigerian singer Davido has lifted the suspension on his aide and personal logistics manager, Isreal Afeare also known as Israel DMW.\nIsrael DMW was suspended over his recent comments on social media in the wake of Abba Kyari’s indictment on fraud.\nIn the video, Israel couldn’t hold back his excitement as he reunited with his boss and friend.\nIsrael had openly declared support for embattled Deputy Commissioner of Police, Abba Kyari.\nIsrael DMW openly declared support for embattled Deputy Commissioner of Police, Abba Kyari."
  },
  {
    "headline": "JUST IN: Hotel Rwanda hero Rusesabagina found guilty of terrorism",
    "summarized_story": "A Kigali court on Monday found Paul Rusesabagina, a one-time Rwanda hotel manager portrayed as a hero in a Hollywood film about the 1994 genocide, guilty of being part of a group responsible for terrorist attacks.\n“They should be found guilty for being part of this terror group – MRCD-FLN,” judge Beatrice Mukamurenzi said of 20 defendants including Rusesabagina.\nSince being portrayed by actor Don Cheadle as the hero of the 2004 film “Hotel Rwanda”, Rusesabagina emerged as a prominent critic of President Paul Kagame, based in the United States.\nProsecutors had sought a life sentence on nine charges, including terrorism, arson, taking hostages and forming an armed rebel group which he directed from abroad.\nHis supporters say he was kidnapped; the Rwandan government suggested he was tricked into boarding a private plane."
  },
  {
    "headline": "Terrorist Group, ISWAP Is Massively Recruiting To Replace ‘Repentant’ Members — Nigerian Army Spokesman",
    "summarized_story": "The terrorist group Islamic State of West African Province (ISWAP) has begun a large recruitment drive.\nThis follows the killing of Boko Haram commander Abubakar Shekau and thousands of Boko Haram insurgents’ subsequent’repentance.’Army Public Relations Director Brig.\n“The Boko Haram insurgents have been surrendering.\nPeople have questioned the authenticity of the surrendering of these insurgents and why they are surrendering at this time.\nSome three years back, Boko Haram was advancing towards the Federal Capital Territory."
  },
  {
    "headline": "Borrowing To Accumulate Debt For Next Generations Is Criminal — Obasanjo Tells Buhari Govt",
    "summarized_story": "Former Nigerian President Olusegun Obasanjo has reacted to the Federal Government’s decision to seek more loans, despite public outcry over the current administration’s continual borrowing.\nIn an interview with Channels Television in South Africa, Obasanjo branded the suspected plan to accrue debt for the next generation to pay as criminal.\nObasanjo voiced concern that if President Muhammadu Buhari’s administration fails to service or pay the present debt, it will become a significant burden for future governments.\nHe said, “But if you are borrowing and accumulating debts for the next generation and the next generation after them, it is criminal.\nIf we are borrowing for development that can pay for itself, that is understandable."
  },
  {
    "headline": "Defection: APC Governors Forum Reject Femi-Fani-Kayode",
    "summarized_story": "Salihu Lukman, director-general of the Progressive Governors Forum (PGF), has explained why some All Progressives Congress (APC) members are against the defection of Femi Fani-Kayode.\nThe defection of the former minister stirred critical reactions from many Nigerians, including APC members.\nLukman, however, advised APC members to show understanding, adding that the decision of the party’s leadership should be accepted.\nThis is made worse by the red carpet reception given to him, which he doesn’t deserve.\nBe that as it may, members need to move forward with every confidence and commitment to engage our leaders."
  },
  {
    "headline": "Heaven Won’t Fall If Another Northerner Is Elected President – NEF",
    "summarized_story": "Spokesman of the Northern Elders Forum (NEF), Hakeem Baba-Ahmed, has said heaven will not fall if a northerner is elected the next Nigerian President adding that the north is not prepared to play second fiddle in a nation where it clearly enjoys numerical strength.\nHe said, “We will lead Nigeria the way we have led Nigeria before whether we are President or Vice President, we will lead Nigeria.\nWe will get that power but be humble because power comes from God.\n“Whether the North holds power in 2023 or not anybody who wants to break up in this country will say so, they are just looking for excuses.\nThe NEF’s spokesman added, “If the majority of Nigeria voters vote for a candidate from the North and he becomes the President and somebody doesn’t want to live under the Nigeria President, the person can leave.”"
  },
  {
    "headline": "VIDEO: Civil Defence official arrested in Kogi over kidnapping",
    "summarized_story": ""
  },
  {
    "headline": "NEF to Nigerians on 2023: North won’t play second fiddle",
    "summarized_story": "Akeredolu, who described Tinubu as our ‘capon’ (leader), said the former Lagos state governor would give the direction to people of the South.\nFor instance while Kaduna state Governor Nasir El-Rufai backs power shift to the South in 2023, a lawmaker and former governor of Nasarawa state, Senator Adamu Abdullahi, believes the north won’t back down on its bid for the nation’s top seat in 2023.\nNEFAnd joining the controversy, the NEF said heaven won’t fall if another northerner emerges Buhari’s successor.\nWhile charging the youths to stay relevant in politics, he said: “Don’t accept second class status because you are a northerner, no northerner is a second-class citizen in this country.\nOn whether he would back the APC national leader on 2023, the governor said: “APC is a party."
  },
  {
    "headline": "How mob sacked Sokoto police station, killed 13 bandits – Locals",
    "summarized_story": "An angry mob in Tangaza town attacked the Tangaza Divisional Police headquarters in Sokoto state, killed 13 suspected bandits and burnt them to ashes.\nA report from the area indicated that the suspected bandits were said to be among those that attacked the town Friday evening, killing two people.\nYouth, security agents collaborateBut after ransacking the town, the suspected bandits forced two young boys of the area to carry their looted items into the bush and thereafter killed them.\nUpon handing over the suspected hoodlums, the mob, in anger, overpowered the police personnel on duty, killed the suspects and set them ablaze.\nIt was further gathered that five of the arrested kidnappers, including the civil defence operative, were in the custody of the Department of State Security for further investigations."
  },
  {
    "headline": "Senate President, Ahmed Lawan Conferred With Chieftaincy Tittle In Ekiti -NigPilot",
    "summarized_story": "…….Describes Tittle As Show of UnityIyin-Ekiti was agog during the weekend as President of Nigerian Senate, Ahmad Ibrahim Lawan was conferred with the chieftaincy title of Aare Akerewolu of Iyin-Ekiti by His Royal Majesty, Oba Adebola Adeniyi Ajakaiye Oyinyosaiyeuyin III, the Oluyin of Iyin-Ekiti.\n“I believe that what Kabiyesi did is to recognise someone from Yobe State.\nMember Representing Ekiti Central Federal Constituency 1, Hon.\nOther important dignitaries that graced the occasion yesterday include, the wife of Ekiti state governor, H.E, Erelu Bisi Fayemi, the SSG to Ekiti state government, Paramount rulers from the north, high ranking govt Offiicials, Special Adviser to FCT Minister of State, Barrister Kingsley Ade Ogunmiloyo and other personalities.\nThe conferment ceremony was part of the activities to celebrate the first coronation anniversary of the Oluyin of Iyin-Ekiti."
  },
  {
    "headline": "Nigeria needs comprehensive data to curb effects of climate change – Fmr NiMet boss",
    "summarized_story": "As part of measures to ascertain a comprehensive data to work out effective measures to check the impact of climate change, the country needs to integrate climate change education into the school curriculum.\nAccording to Anuforom integration of Climate Change education into school curriculum as envisaged in the National Policy on Climate Change, would reduce the impact, especially in states that are vulnerable to flood disasters.\nHe therefore advised State governments to liaise with NiMet to disseminate whether forecast in local languages as part of the Climate Change education Programme.\nTo treat the issues of climate change you have to go back to the history.\nHe stressed that there were few comprehensive reports and papers that provided useful evidence and discussion of the various impacts of climate change throughout Nigeria."
  },
  {
    "headline": "US to invest $6.8 million to fight human trafficking in Nigeria -NigPilot",
    "summarized_story": "The United States has expressed commitment to investing $6.8 million to fight human trafficking in Nigeria.\nA data in US embassy website disclosed that the U.S. Department of State’s Bureau of International Narcotics and Law Enforcement Affairs (INL) is pleased to announce approximately $6.8 million in contributions to the United Nations Office for Drugs and Crime (UNODC) for projects in Nigeria to combat trafficking in persons.\n“The INL donation will fund UNODC to train the Nigeria Correctional Service in the northeastern states of Borno, Gombe, and Adamawa.\n“The United States values its relationship with Nigeria and, through our partnership with the UNODC, provides support to its work combatting drugs, crime, and corruption, and building the capacity of the Nigerian National Agency for the Prohibition of Trafficking in Persons (NAPTIP)”.\nThe data concluded that, “INL funds were made possible through appropriations made by Congress to the U.S. Department of State to support efforts in the fight against organized crime and drug trafficking worldwide”."
  },
  {
    "headline": "Defection: We shouldn’t blindly trust Fani-Kayode, APC chieftain warns",
    "summarized_story": "Chieftain of the ruling All Progressives Congress, APC, Salihu Moh.\nLukman has warned leaders and members of his party to be circumspect in reposing their trust in Femi Fani-Kayode following his defection to the party.\nFor Mr. Fani-Kayode to talk of the unity of Nigeria at this time, shortly after he supported and promoted secessionist campaigns of Nnamdi Kanu and Sunday Igboho is a remarkable departure.\n“However, recognising such a departure shouldn’t be interpreted to mean that we should blindly trust Mr. Fani-Kayode,” he averred.\nThis made many party members to protest the plan by party leaders to admit FFK as fondly called into the APC, a rumour which Mr. Fani-Kayode himself denied vowing never to join the party in his “natural life”."
  },
  {
    "headline": "Gunmen Kill Police Officer, Two Others In Anambra State",
    "summarized_story": "Gunmen have killed a police officer and two civilians in an attack at the Ukaegbu Junction by Ezeiweka Road, Awada Obosi Layout in Idemili North Local Government Area of Anambra state.\nThe incident, which happened on Sunday, also saw the attackers setting fire on the police patrol van before leaving the area.\nDuring the attack, the officer, a tricycle rider and a resident of the area lost their lives.\nThe Anambra State Police Public Relations Officer, Mr. Tochukwu Ikenga in a press release also confirmed the attack.\n“The attackers drove in a Sienna vehicle… and started shooting at the patrol vehicle along Ukegbu Junction,” he said."
  },
  {
    "headline": "2023: We Will Lead Nigeria, We Have Majority Of The Votes – Northern Elders",
    "summarized_story": "﻿The Northern Elders Forum (NEF) has vowed that the north will continue leading Nigeria, arguing that the region has the majority to produce a leader through the ballot.\nBut NEF, in its most recent submission on the nation’s polity, rejected the push to have Nigeria’s next president come from the southern region.\n“We will lead Nigeria the way we have led Nigeria before.\nWhether we are president or vice president or whatever, we will lead Nigeria,” NEF spokesman, Hakeem Baba-Ahmed, said on Sunday at a lecture in memory of the late Maitama Sule in Zaria Kaduna State.\nThe NEF spokesman’s comments came a few days after governors from the southern region of Nigeria declared their support to have the 2023 presidency zoned to their region."
  },
  {
    "headline": "Buhari Appoints NNPC Board Members, Approves Incorporation Of Agency",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of the Board and Management of the Nigerian National Petroleum Company Limited with Senator Ifeanyi Ararume as Chairman.\nThis is even as he directed that the Nigerian National Petroleum Company Limited be incorporated, the Special Adviser to the President on Media and Publicity, Femi Adesina, announced via a statement on Sunday.\nAdesina said the President appointed the Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mr Mele Kyari, as the Chief Executive Officer, adding that his principal acted in accordance with the Petroleum Industry Act 2021.\nAdesina explained that Senator Ifeanyi Ararume will serve as the Chairman of the Board, with Umar I. Ajiya being the Chief Financial Officer.\nApart from Kyari, other board members are; Dr Tajudeen Umar (North East), Mrs Lami O. Ahmed (North Central), Mallam Mohammed Lawal (North West), Senator Margaret Chuba Okadigbo (South East), Barrister Constance Harry Marshal (South South), and Chief Pius Akinyelure (South West)."
  },
  {
    "headline": "Go Back To Work While We Continue Negotiations, Ngige Urges Striking Doctors",
    "summarized_story": "Ngige made the appeal during an interview on Channels Television’s Sunday Politics, as the resident doctors strike enters Day 59.\n“I have nephews who are resident doctors.\nAccording to Ngige, it is the Federal Ministry of Health and the office of the Attorney General of the Federation that can withdraw the case from court.\nNgige’s comments come two days after the National Industrial Court ordered resident doctors to suspend their strike action and go back to work, pending the determination of the substantive suit.\nBut the striking doctors have faulted the court’s ruling, vowing to appeal the order."
  },
  {
    "headline": "Osaka Drops Out Of Top Five In WTA Rankings",
    "summarized_story": "Naomi Osaka slipped out of the top five in the WTA rankings on Monday while Simona Halep, another former world number one, continued her slide by also dropping three places.\nDanish teenager Clara Tauson rose 18 places to 52nd after capturing her second title of the year in Luxembourg.\nItaly’s Jasmine Paolini jumped from 87th to 64th following her first WTA title at Portoroz, Slovenia.\nWTA rankings as of September 20:1.\nSimona Halep (ROM) 3152 (-3)15."
  },
  {
    "headline": "NCFront mourns Obadiah Mailafia, promises to investigate death -",
    "summarized_story": "National Leaders of Conscience under the auspices of the National Consultative Front, NCFront, has expressed deep shock and sadness over the passing of an associate and founding member of the Front, Dr Obadiah Mailafia, former presidential candidate of the African Democratic Congress, ADC in the 2019 general elections in Nigeria.\nMailafia until his death earlier on Sunday was a member of the National Steering Council and the North Central Facilitator of the NCFront, who raised the bar of commitment to the tasks of the movement, constantly advocating a fair, just and equitable governance of Nigeria.\nMemories of his various endeavors and contributions will be remembered and honoured by the NCFront during the 2nd National Rescue Summit being planned by the NCFront to commemorate Nigeria’s 61st Independence Anniversary on 1st October, 2021.\nThe movement condoled and commiserated with the family of its departed Leader, Obadiah Mailafia, praying for the repose of his soul and fortitude and strength for members of his family and promising an investigation into his sudden death.\nAs an indomitable Icon of the NCFront rescue mission, Dr Obadiah Mailafia will be greatly missed by the leadership of the NCFront."
  },
  {
    "headline": "President Buhari appoints Ararume as Board Chairman of NNPC Ltd -",
    "summarized_story": "Other Board Members are; Dr Tajudeen Umar (North East), Mrs Lami O. Ahmed (North Central), Mallam Mohammed Lawal (North West), Senator Margaret Chuba Okadigbo (South East), Barrister Constance Harry Marshal (South South), and Chief Pius Akinyelure (South West).\nChairman of the Board is Senator Ifeanyi Ararume, while Mele Kolo Kyari and Umar I. Ajiya are Chief Executive Officer, and Chief Financial Officer, respectively.\nAlso, by the power vested in him under Section 59(2) of the PIA 2021, President Buhari has approved the appointment of the Board and Management of the NNPC Limited, with effect from the date of incorporation of the Company.\nPresident Muhammadu Buhari, in his capacity as Minister of Petroleum Resources, has directed the incorporation of the Nigerian National Petroleum Company Limited.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided."
  },
  {
    "headline": "Unknown Gunmen disrupt political meeting in Enugu",
    "summarized_story": "Unidentified gunmen have invaded a political gathering at Nenwe community in Aniri local Government Area of Enugu state,threatening that no election will hold in any part of “Biafra land” again.\nIn a video that went viral, on Sunday, revealed how the gunmen were seen shooting repeatedly at people at the political gathering, while some fled for their lives.\nA few men, who could not escape at the time of the invasion, were captured and asked to lie down in the mud.\nThey were beaten, molested and harassed amidst allegation that they were trying to “bring back Fulani” into Enugu West.\nIn the 4:50 minutes video, it could be seen that vehicles and motorbikes were smashed by the gunmen, who threatened to deal with anyone organising a political gathering on Biafra land."
  },
  {
    "headline": "Gunmen kill Secondary School student, abduct ABSU Students -",
    "summarized_story": "According to Abattam the incident was a robbery attack and not a kidnap operation.\nThe incident which happened at the failed spot on the Road which is in Ihibe community in the Okigwe Local Government Area of Imo state, threw the community in a state of panic.\nThe armed men also robbed motorists and passengers who were en route Port Harcourt from Enugu and from Okigwe town to Enugu.\nThe suspects also shot and killed one Donald Edeh a student of Marist Comprehensive Academy, Uturu.\nGunmen suspected to be herdsmen Saturday evening allegedly kidnapped students of Abia State University, Uturu."
  },
  {
    "headline": "China Evergrande Shares Dive to 11-year Low as Default Risks Grow",
    "summarized_story": "Shares of Evergrande on Monday plunged to over 11-year lows, extending losses as executives try to salvage its business prospects and as default fears grow over a looming deadline for payment obligations this week.\nAs of 0740GMT, the stock was off 12.2% to HK$2.23, after earlier plummeting 19% to its weakest level since May 2010.\nIt has another $47.5 million interest payment due on Sept 29 for the March 2024 notes.\nBoth bonds would default if Evergrande fails to settle the interest within 30 days of the scheduled payment dates.\nIn any default scenario, Evergrande will need to restructure the bonds but analysts expect a low recovery ratio for investors."
  },
  {
    "headline": "Kingsley Moghalu: Nigeria’s Economy Can’t Be Transformed By Incompetent Leaders",
    "summarized_story": "A former Deputy Governor of the Central Bank of Nigeria (CBN) has said the country’s economy cannot be transformed for as long as the West African country is being controlled by politically and economically incompetent people.\nMoghalu, a professor of International Business and Public Policy stated this on Monday when he featured on an ARISE News program, The Morning Show.\nHe said Nigerian politicians do not understand the economics of the country and cannot tackle the economic challenges with knowledge.\nWatch the interview for more…"
  },
  {
    "headline": "France Pulls Out of UK Defence Talks Amid Submarine Row",
    "summarized_story": "France’s defence minister has cancelled talks with her UK counterpart amid the row prompted by a new security deal between Britain, the US and Australia.\nUK PM Boris Johnson said France had nothing to worry about from the deal.\nBut Florence Parly’s meeting with UK Defence Secretary Ben Wallace in London this week has been called off.\nFrench foreign minister Jean-Yves Le Drian has described it as a “stab in the back” that constituted “unacceptable behaviour between allies and partners”.\nThe prime minister said Britain and France have a “very friendly relationship”, which he described as being of “huge importance”."
  },
  {
    "headline": "UN Chief Warns China, US to Avoid New Cold War",
    "summarized_story": "Warning of a potential new Cold War, the head of the United Nations implored China and the United States to repair their “completely dysfunctional” relationship before problems between the two large and deeply influential countries spill over even further into the rest of the planet.\n“We need to avoid at all cost a Cold War that would be different from the past one, and probably more dangerous and more difficult to manage,” Guterres said.\nThe so-called Cold War between the Soviet Union and its East bloc allies and the United States and its Western allies began immediately after World War II and ended with the breakup of the Soviet Union in 1991.\nThe U.N. chief said a new Cold War could be more perilous because the Soviet-U.S. antipathy created clear rules, and both sides were conscious of the risk of nuclear destruction.\nThat, he says, has produced frustration and mistrust in parts of the developing world that have received neither vaccines nor recovery assistance."
  },
  {
    "headline": "CBN to Okay Legitimate FX Demand Exceeding Approved Cap, Emefiele Says",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele has said the apex bank is ready to approve legitimate foreign exchange (FX) demand that exceeds the approved transaction cap if such applications meet stipulated requirements.\nThe CBN governor gave the assurance against the backdrop of complaints that the current FX policy which limits transactions to $5,000 may not fulfil consumers’ actual needs.\nBut Emefiele, while addressing journalists over the weekend, said the CBN was ready to approve requests from commercial banks to go beyond the caps if it is proven that the extra demand for FX is for legitimate purposes.\nWe can decide that out of the N10 billion we move N2 billion into an electronic wallet for the bank.\nWe will look at the various products, determine the risks, determine the best way to mitigate the risks before opening it up."
  }
]