[
  {
    "headline": "‘Buhari’s successor can come from any region’",
    "summarized_story": "A former Borno State Governor, Ali Modu Sheriff, has said Nigerians must avoid the pitfalls of ethno-religious politics in order to choose the right leader come 2023.\nSheriff spoke while receiving members of an All Progressives Congress pressure group, Frontier for Equality Leadership and Good Governance, in his office, in Abuja, on Thursday.\nHe said competence should be the main focus of Nigerians in making a choice.\n“If it is in the extreme end of Adamawa, we should go and look for him.\nIf he is coming from the end of Anambra, we should go and look for him."
  },
  {
    "headline": "Group protests cop’s alleged invasion of woman’s privacy",
    "summarized_story": "A group, Centre for Basic Rights Protection and Accountability Campaign, has petitioned the Rivers State Commissioner of Police, Friday Eboka, over an alleged invasion of the privacy of a 20-year-old woman by a police officer.\nWiro said the cop had refused to leave the room even when she asked him to leave to enable her to dress up.\nWiro said, “We wrote a petition on behalf of a 20-year-old young lady whose privacy was allegedly invaded by a police officer.\n“We are demanding that the Commissioner of Police should do a thorough investigation into the alleged invasion of the young lady’s privacy and the alleged refusal of the officer to leave the woman’s room even when the woman was naked as of the time he invaded the room.\n“We see the alleged action as a professional misconduct and we ask for a thorough investigation to prove if the officer is culpable or not."
  },
  {
    "headline": "Buni assures police of support, as IGP visits Yobe",
    "summarized_story": "Mail Mala BuniGovernor Mai Mala Buni of Yobe has assured the Inspector General of Police (IGP), Usman Alkali-Baba, of maximum support and cooperation to enable the police to tackle insurgency in the state.\nBuni made the pledged when the IGP paid him a courtesy visit on Thursday in Damaturu.\nHe said that such support to security agencies was critical towards ending the decade-long insurgency that claimed many lives and destroyed property in the North East.\nBuni, however, appealed to the IGP to deploy more policemen and Armoured Personnel Carriers to the state, to augment clearance operation against remnants of the insurgents.\nAccording to him, the visit is part of the official function to interact with men and officers of the Command in the state."
  },
  {
    "headline": "NGX shareholders endorse equity-based incentives to employees’ remuneration",
    "summarized_story": "By Peter EgwuatuShareholders of Nigerian Exchange Group Plc, NGX, yesterday, at its 60th Annual General Meeting (AGM), approved the proposal by its Board of Directors to introduce equity-based incentives to employees’ remuneration, including an Employee Share Ownership Plan and a Long-Term Incentive Plan.\nIn addition to the re-election of the Non-Executive Directors who were retiring by rotation and the election of the members of the Audit Committee, shareholders also approved the proposed remuneration for the Board and non-executive members of the erstwhile National Council of the former Nigerian Stock Exchange (NSE).\nREAD ALSO2023: Stakeholders make case for increased voters’ registration in EbonyiCommenting at the virtual AGM, Group Chairman, NGX Group Plc, Otunba Abimbola Ogunbanjo, stated: “This meeting is also historic in that it marks the first time in the history of the NGX Group that its AGM will hold outside the hallowed confines of the Exchange House in Lagos and we have chosen the Federal Capital Territory – Abuja – in recognition of the integral role the Federal Government of Nigeria played in actualising the demutualisation of NSE and its support in establishing NGX Group.\n“Despite the global pandemic and other economic shocks, it is indeed noteworthy that we have already begun to actualise the benefits of demutualization, including the alignment of stakeholders’ interests in the value created by the new Group under a revised Corporate Governance framework.”Speaking on the outcome of the AGM, Ogunbanjo further said: “We received approval of new equity-based incentive schemes for employees which are in line with the authority granted to directors by then members of NSE at an Extraordinary General Meeting (EGM) conducted in March 2020 and adhere to global best practices allowing us to attract and retain the best talent.”Also speaking, Group Managing Director/Chief Executive Officer, NGX Group Plc, Oscar N. Onyema, said: “Our 2020 results reflect the challenging macroeconomic and market conditions, as well as operational resilience of the Group with income and resulting surplus after tax valued at N6.02 billion and N1.84 billion respectively.”"
  },
  {
    "headline": "Constituency Project: Two projects allegedly abandoned by contractors in Imo",
    "summarized_story": "…as contractor claims 17 KV generator stolen in Imo communityBy Chinonso Alozie, OwerriA team of the Independent Corrupt Practices Commission, ICPC, has uncovered two federal constituency projects awarded in 2019 in the Ezinihitte/Ahiazu Mbaise Federal constituency that was allegedly abandoned by the contractors after they were paid money.\nVanguard yesterday monitored the visit of the ICPC team led by Obi Steven, to the various project sites.\nOne of the projects was awarded on 20 December 2019, the construction of Amudi, a 1-kilometre road, in Ezinihitte Mbaise, in Ahiazu/Ezinihitte Federal Constituency, the ICPC team uncovered among other things that the contractor allegedly abandoned the project last year, after 200 kilometres of coverage of sand filling.\nHowever, the ICPC team noticed cracks around the foundation of the classroom block and advised the contractor to do reinforcement construction on the affected areas.\nAmudi road, a 1-kilometre road in Ezinihitte Mbaise Local Government Area of Imo State allegedly abandoned."
  },
  {
    "headline": "Female fire boss assures Lagosians of improved service delivery",
    "summarized_story": "By Ebunoluwa SessouDirector of the Lagos State Fire and Rescue Service, Mrs. Margaret Adeseye has assured improved, effective and efficient service delivery to Lagosians.\nSaying the organization will make use of the government’s investment on infrastructure to its maximum use.\nAdeseye disclosed this during a strategic meeting held at the Ikeja Fire Station with officers and men of the Agency to chart a way forward on efficient service delivery to achieve the Key Performance Indicators, KPIs, set towards making Lagos a 21st-century economy.\nAdeseye hinted that the new Fire and Rescue Service Bill 2021, among other things would address the welfare of the firefighters as officers reciprocate the government’s gesture with optimal dedication to duty.\n“You should bear in mind that your job to save lives and property is service to mankind and humanity and no strings should be attached”, she said."
  },
  {
    "headline": "Call for secession, fastest way to extinction ― Osinbajo",
    "summarized_story": "Professor Yemi OsinbajoBy Omeiza Ajayi – AbujaThe Federal Government has again kicked against calls for secession by separatists in some parts of the country warning that such would be the surest way to extinction.\nWe must be able to say to them that that is the way to extinction not development”.\nNigeria and Africa must put in place a health security defence system.\nHealth security is only assured by being self reliant.\nHealth security cannot be outsourced."
  },
  {
    "headline": "Obasanjo, Osinbajo, Amosun, Adeboye, Oshiomhole, Fayemi, others meet Abiodun in Ogun",
    "summarized_story": "Dignitaries from across the nation on Thursday, thronged the Iperu hometown of Governor Dapo Abiodun to join him in bidding his late father, Pa Emmanuel Abiodun, farewell.\nDAILY POST recalls that the governor’s father passed away on August 2 at 89.\nThe event was also attended by Governors Babajide Sanwo-Olu (Lagos), Rotimi Akeredolu (Ondo), Kayode Fayemi (Ekiti), Godwin Obaseki (Edo), Abdul-Rahman AbdulRazaq (Kwara) and Abubakar Atiku Bagudu (Kebbi).\nSpeaking, Vice President Osinbajo delivered the message of President Muhammadu Buhari to the governor and the entire Abiodun family, noting that the governor’s father enjoyed the grace of God.\nOsinbajo said the late retired teacher did not take the grace of God for granted, saying that he rather he gave back to his community by becoming a teacher of teachers."
  },
  {
    "headline": "Police uncover popular Church used as baby factory, arrest pastor, others in Imo",
    "summarized_story": "The Imo State Police Command has arrested a 47-year-old woman, Evangelist Ugochi Orisakwe and four others, for allegedly using a church premises as a baby factory.\nThe suspect was arrested by the operatives of the command, alongside her gang members namely, Chidi Orisakwe, 34, Pauline Nwagbunwanne, 42, Elizabeth Uzoma, 61, Chibueze Joy, 31.\nThe Commissioner of Police CP Rabiu Hussaini confirmed the crime on Thursday in a release signed by the command spokesperson, Micheal Abattam.\n“The Commissioner of Police, immediately dispatched the command’s Anti kidnapping unit, stormed and condoned the church, Jesus Life Assembly, located at School Garden, Uratta in Owerri North LGA of Imo State, where the prime suspect and resident Evangelist of the church, Evangelist Ugochi Orisakwe was arrested.\nHe then warns all persons or groups, who indulge in kidnapping and child-trafficking to leave the state as the Command has put in a robust strategy that will lead to their arrest forthwith."
  },
  {
    "headline": "Kogi govt set date to shut down all unregistered schools",
    "summarized_story": "The Kogi State Government has vowed to shut down all unregistered schools in the state at the resumption of the 2021/2022 academic session.\nThe State Commissioner for Education, Science and Technology, Wemi Ojo Jones, who disclosed this on Thursday while fielding questions from newsmen, said allowing unregistered schools to operate in the state would amount to mortgaging the future of the children.\nThe Commissioner urged both the registered and unregistered schools to come to the Ministry to authenticate their papers following which an inspection would be conducted to the schools by the ministry.\nWhile pointing out that the State Government is passionate about shutting down of unregistered schools, the Commissioner said the government will not fold its hands and watch substandard schools operating in the state.\nThe Commissioner maintained that the State Government would not allow people run their business at the detriment of the state future Leaders, urging operators of unregistered and illegal schools to cease the window of opportunity to register their schools before the commencement of the new academic session."
  },
  {
    "headline": "Yobe govt suspends 5 secondary schools principals over gross misconducts",
    "summarized_story": "Principals of five boarding senior secondary schools in Yobe State have been suspended for various gross offences by the State Commissioner of Basic and Secondary Education, Mohammed Sani Idriss.\nHe said, “Senior Vice Principals of the five schools have been directed to take charge of running the affairs of the schools with immediate effect.\n“While the Teaching Service Board and the mother Ministry have deployed competent staff to assist in smooth running of the schools, and especially to ensure successful completion of the ongoing WAEC exams.\n“The affected Principals would know their fate after facing a disciplinary committee to be constituted soon”, he posted.\nDAILY POST gathered that, the affected principals were not in their various schools when the commissioner paid an unscheduled visits and that the Commissioner was unhappy with their attitudes."
  },
  {
    "headline": "Bauchi govt conducts hearings on 2022 budget ahead of presentation",
    "summarized_story": "As parts of its efforts aimed at preparing all inclusive 2022 budget, the Bauchi State Government has conducted public hearings across the three senatorial zones in the state with a view to getting citizens’ inputs ahead of presentation of the proposed budget before the state House of Assembly for passage.\nAccording to him, the state government planned to consolidate on the gains of its budget preparation such that the next budget would be demand driven.\n“The process has started in line with the provision of the law in the preparation for the budget.\nHe, therefore, urged participants to provide useful inputs and advice in line with development objectives of the state government and its funding constraint.\nThis, Zaki said, was to ensure that the government improved the living conditions of the people in the state through putting their inputs in the budget process."
  },
  {
    "headline": "Mobile Marketing is Said to Be the Future of E-Commerce",
    "summarized_story": "The main thing that you have to remember on this journey is just be nice to everyone and always smile.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nWe were making our way to the Rila Mountains, where we were visiting the Rila Monastery.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city despite its ugly, staunch and stolid communist-built surrounds."
  },
  {
    "headline": "Gumi relocating fleeing northern terrorists to Oyo State, Group alleges",
    "summarized_story": "From Oluseye Ojo, IbadanIslamic scholar, Sheikh Ahmad Gumi, is attempting to relocate fleeing terrorists that are being smoked out of the Northern Nigeria via military operations to Oke-Ogun, which is a political division of Oyo State, with 10 local government areas.\nThis allegation was made by a socio-political group, under the aegis of Alliance for Oke-Ogun Development (A.O.D), following Gumi’s recent visitation to Igboho, headquarters of Orelope Local Government Area of Oyo State.\nFasasi stated: “It is rather mindboggling to hear that Sheikh Gumi and his co-travelers were in Igboho, Oke-Ogun.\nSheikh Gumi is known all over the world as the harbinger, mastermind, mouthpiece, solicitor and patron of banditry in Nigeria.\nIt’s unacceptable for Gumi and his bandits to see Oke-Ogun, Oyo State as their haven.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Court okays T B Joshua’s wife as SCOAN trustee",
    "summarized_story": "By Lukman OlabiyiJustice Tijjani Ringim of the Federal High Court, Lagos, has affirmed Mrs Evelyn Joshua as a trustee of Synagogue Church Of All Nations (SCOAN), in line with the church’s Constitution which prescribes a minimum of three trustees for the church.\nThe judge affirmed Mrs Joshua as a trustee of the church, while ruling on an application brought before the court.\nThe respondents, through their said Counsel, told the court they were not opposed to the petition made under Section 839(6)(B) of the Companies and Allied Matters Act (CAMA) 2020 (as Amended).\nThe church has been in a limbo since the passing of Prophet TB Joshua who was the founder, over the leadership succession in the church.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "BREAKING: Police uncover Church used as baby factory in Imo",
    "summarized_story": "From Stanley Uzoaru, OwerriThe Imo State command of the Nigeria Police has uncovered a church at MCC, Uratta in Owerri north council area of the state, new born babies are sold to willing buyers.\nWitnesses said young pregnant girls are kept in the church till they give birth and the babies sold to intending buyers.\nAbattam said intelligence report revealed that she was sighted at the church known as Jesus Life Assembly Church located also at Uratta.\nAccording to the statement ,the Commissioner of Police, Imo State Command, Rabiu Hussaini immediately dispatched the command’s Anti kidnapping unit, who mobilised and stormed the church.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Buhari in Imo: Uzodinma’s vision aligns with mine – President",
    "summarized_story": "From George Onyejiuwa, OwerriPresident Muhammadu Buhari has said that the policies of the Imo State Governor Hope Uzodinma are in tandem with his administration’s vision of providing critical infrastructure and a safe environment for economic growth.\nThe president also said that he would continue to assist the Imo State Government in its area of need within the ambit of the constitution of the Federal Republic of Nigeria.\nPresident Buhari made the remarks Thursday while commissioning the Owerri-Onitsha road bypass at Egbeada completed by Governor Uzodinma as part of his one-day working visit to the state.\nThe Naze-Nekede-Ihiagwa Road was pitiable, but today the president has commissioned the first phase of the Naze-Nekede-Ihiagwa Road and the second phase will be completed before the end of the year.\nGovernor Uzodinma also thanked the president for his commitment to ensuring that the insecurity in the state was brought to an end."
  },
  {
    "headline": "How I want to be remembered in South East – Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has told South East elders that he would want to be remembered as the President who stabilised Nigeria in the area of security, economic prosperity and triumph over corruption.\nHe spoke in Owerri at a town hall meeting with South East leaders during his one-day official visit to Imo State, said with less than two years left in his eight-year tenure as President, security still remains a major priority for his administration.\n“Therefore, it is unthinkable for me that any Igbo man would consider himself not to be a part of Nigeria.\nHe promised that the Federal Government would complete ongoing key projects in the South East, including the 2nd Niger Bridge as well as the railway lines and routes linking the region with other parts of the country.\nIn his remarks, the President-General, Ohaneze Ndigbo Worldwide, Prof. George Obiozor assured the President of the continuous support of Ndigbo."
  },
  {
    "headline": "Buhari: I Want to Be Remembered as President that Stabilized Nigeria’s Security, Economy",
    "summarized_story": "He has, therefore, said he would want to be remembered as the president who stabilised Nigeria in the area of security, economic prosperity and triumph over corruption.\nPresident Buhari, who spoke Thursday in Owerri at a town hall meeting with South-east leaders during his one-day official visit to Imo State, said with less than two years left in his eight-year tenure as president, security still remains a major priority for his administration.\nAccording to him, ‘‘If there is no security, there is nothing anyone can do no matter how much you try or the initiative you have.\n‘‘Therefore, it is unthinkable for me that any Igbo man would consider himself not to be a part of Nigeria.\nAlso speaking, the President-General, Ohaneze Ndigbo Worldwide, Prof. George Obiozor, assured the president of the continuous support of Ndigbo."
  },
  {
    "headline": "FCT, Six States Parley over Banditry, Kidnapping",
    "summarized_story": "By Olawale AjimotokanThe Federal Capital Territory (FCT) Administration and six states, under the aegis of G7, Thursday held a security summit in Abuja on presenting a common response to the escalating insecurity in the country.\nThe FCT Police Commissioner and his counterparts from Benue, Kogi, Plateau, Nasarawa, Kaduna and Niger States attended the G7 Security Summit held at the Nigeria Police Officers Mess.\nOthers at the parley included senior officers from the Army, Air Force, representatives of the Department of State Services from Kogi and Benue, as well as the Director Security Service, FCTA and FCT Commandant, Nigeria Security and Civil Defence Corps (NSCDC).\nThe FCT Commissioner of Police, Babaji Sunday, who is the Chairman of the G7 Technical Committee, said the meeting was to address kidnapping, banditry, cattle rustling and other criminality.\nThe FCT Commandant, NSCDC, Dr. Peter Maigari, said the meeting will focus on collaboration with other agencies through synergy building."
  },
  {
    "headline": "Buhari in Imo, Inaugurates Projects, Assures Residents of More FG’s Presence",
    "summarized_story": "President Mohammadu Buhari on Thursday inaugurated four key projects in Imo and assured the people of more Federal Government’s presence in the state.\nAddressing the people on the occasion in Owerri, Buhari said he was delighted to see the projects executed by Gov.\nHe recalled that his administration commenced virtual commissioning of projects in March by Buhari.\nHe said his administration had done 46 roads, including the Mohammadu Buhari Avenue, housing the Federal Secretariat.\nHe said the Egbeada Bypass, also inaugurated by Buhari, would help to ease traffic in the city."
  },
  {
    "headline": "Weekly COVID-19 Cases in Africa Drops by More than 20%, Says WHO",
    "summarized_story": "Africa received 5.5m vaccine doses in SeptemberS/Africa hosts regional genomic surveillance centreBy Onyebuchi EzigboThe weekly COVID-19 cases in Africa have fallen by more than 20 per cent, the sharpest seven-day decline in two months, the World Health Organization (WHO) has said.\nIt disclosed that a total of 5.5 million doses were received through COVAX in the first week of September by countries in Africa.\nMoeti recalled that last year, WHO and partners established a COVID-19 sequencing laboratory network in Africa which has to date produced nearly 40,000 sequencing data.\nThe C.1.2 variant initially identified in South Africa has so far been detected in 130 cases in 10 countries globally, including five in Africa.\nAs Africa’s third COVID-19 pandemic wave eases off, vaccine shipments to the continent continue to grow, with around 5.5 million doses received through COVAX in the first week of September."
  },
  {
    "headline": "Breaking: PDP Names Adamawa Gov Convention Committee Chair",
    "summarized_story": "Enugu gov heads zoning committeeBy Chuks OkochaRising from its 93rd National executive committee meeting, the PDP has appointed the governor of Adamawa state, Ahmadu Fintiri, as the chairman of its convention committee.\nAlso, the meeting appointed the Enugu state governor, Ifeanyi Ugwuanyi, as the chairman of the party’s zoning committee.\nDetails later.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Bandits Invade Sokoto Community, Kill Six, Abduct Many Residents Despite Military Strikes",
    "summarized_story": "Six people have been killed and many others abducted by suspected bandits in the Tureta Local Government Area of Sokoto State.\nTureta shares a border with Zamfara State where military bombardments in a continuous operation have been taking place.\nThey were said to have deceived the unsuspecting members of the community using the Muslim’s call for prayer.\nSokoto, Niger, Katsina, Zamfara and many other states in North-West and North-Central Nigeria are bedevilled by bandits’ attacks.\nThe bandits kill and kidnap at will despite the large deployment of police officers and soldiers to the affected states."
  },
  {
    "headline": "BREAKING: Bandits Invade Sokoto Community, Kill Six, Abduct Many Residents Despite Military Strikes",
    "summarized_story": "Six people have been killed and many others abducted by suspected bandits in the Tureta Local Government Area of Sokoto State.\nTureta shares a border with Zamfara State where military bombardments in a continuous operation have been taking place.\nThey were said to have deceived the unsuspecting members of the community using the Muslim’s call for prayer.\nSokoto, Niger, Katsina, Zamfara and many other states in North-West and North-Central Nigeria are bedevilled by bandits’ attacks.\nThe bandits kill and kidnap at will despite the large deployment of police officers and soldiers to the affected states."
  },
  {
    "headline": "BREAKING: State Attorneys General Sue Nigeria's Attorney-General Malami Over Non-remittance Of N176billion From Stamp Duties",
    "summarized_story": "The attorneys general in Nigeria's 36 States have sued the Attorney General of the Federation and Minister of Justice, Abubakar Malami, for non-remittance of stamp duties fund generated from the states.\nAccording to a court document, the attorneys sued Malami because funds generated from stamp duties are not remitted into states’ coffers, People's Gazette reports.\nAbubakar MalamiThey sought an order of the court to mandate Malami to pay N176 billion for the backlog of stamp duties received between 2015 and 2020.\nIn the document, they argued that Malami should not be allowed to collect, administer or collect stamp duties.\nThey sought the court to declare their entitlement to receive 85 per cent of stamp duties generated from electronic money transfer levies and others."
  },
  {
    "headline": "BREAKING: State Attorneys General Sue Nigeria's Attorney-General Malami Over Non-remittance Of N176billion From Stamp Duties",
    "summarized_story": "The attorneys general in Nigeria's 36 States have sued the Attorney General of the Federation and Minister of Justice, Abubakar Malami, for non-remittance of stamp duties fund generated from the states.\nAccording to a court document, the attorneys sued Malami because funds generated from stamp duties are not remitted into states’ coffers, People's Gazette reports.\nAbubakar MalamiThey sought an order of the court to mandate Malami to pay N176 billion for the backlog of stamp duties received between 2015 and 2020.\nIn the document, they argued that Malami should not be allowed to collect, administer or collect stamp duties.\nThey sought the court to declare their entitlement to receive 85 per cent of stamp duties generated from electronic money transfer levies and others."
  },
  {
    "headline": "Bandits Are Going To Hell — Femi Adesina Tackles Sheikh Gumi Over Calls For Amnesty",
    "summarized_story": "Femi Adesina, Special Adviser to President Muhammadu Buhari on Media and Publicity, has taken a swipe at the controversial Islamic scholar, Sheikh Ahmad Gumi, over the latter's comment that military onslaught would worsen banditry in Nigeria.\nAdesina, in an article on his Facebook wall on Thursday titled, “I like this pampering.\nFemi AdesinaHe quoted the cleric’s statement verbatim, noting that Gumi’s position on the military bombardment of the bandits is “false”.\nGumi, on Monday, asked the Nigerian government to grant amnesty to bandits like it gave to Niger Delta militants.\nA bandit-lover is on record as saying military offensive would not work, and that the bandits “are going nowhere.” True?"
  },
  {
    "headline": "Nigeria’s oil production drops to 1.2m b/d in August -- lowest in 2021",
    "summarized_story": "Nigeria’s oil production dropped to an average 1.23 million barrels per day in August, representing the lowest figure recorded yet in 2021.\nAdvertisementThis is according to the 2021 crude oil and condensate production report released by the Department of Petroleum Resources (DPR).\nAdvertisementChecks by TheCable showed that difficulties in some oil terminals caused the decline in Nigeria’s oil output.\nForcados pipeline, which exports an average of 240,000 barrels of crude oil daily, is one of Nigeria’s main crude oil terminals.\nWith the decline in oil production, Nigeria falls below the production cap under the OPEC+ deal at 1.596 million b/d for the month under review."
  },
  {
    "headline": "Nigeria’s oil production drops to 1.2m b/d in August -- lowest in 2021",
    "summarized_story": "Nigeria’s oil production dropped to an average 1.23 million barrels per day in August, representing the lowest figure recorded yet in 2021.\nAdvertisementThis is according to the 2021 crude oil and condensate production report released by the Department of Petroleum Resources (DPR).\nAdvertisementChecks by TheCable showed that difficulties in some oil terminals caused the decline in Nigeria’s oil output.\nForcados pipeline, which exports an average of 240,000 barrels of crude oil daily, is one of Nigeria’s main crude oil terminals.\nWith the decline in oil production, Nigeria falls below the production cap under the OPEC+ deal at 1.596 million b/d for the month under review."
  },
  {
    "headline": "Judge berates lawyer for misleading court, vacates order restoring Secondus as PDP chairman",
    "summarized_story": "A Kebbi state high court has vacated the order it made returning Uche Secondus as national chairman of the Peoples Democratic Party (PDP).\nAdvertisementOn August 23, a high court in Rivers state granted an interim order restraining Secondus from parading himself as the national chairman of the party.\nUmar had given the order while delivering ruling in a motion ex parte brought in a suit marked KB/AC/M.170/2021.\nShe rebuked counsel to the claimants/applicants, whom she said concealed important facts from the court when the ex parte motion was heard.\nI hereby set aside the order ex parte application granted on the 26/08/2021 in motion no KB/HC/M.170/2021."
  },
  {
    "headline": "Judge berates lawyer for misleading court, vacates order restoring Secondus as PDP chairman",
    "summarized_story": "A Kebbi state high court has vacated the order it made returning Uche Secondus as national chairman of the Peoples Democratic Party (PDP).\nAdvertisementOn August 23, a high court in Rivers state granted an interim order restraining Secondus from parading himself as the national chairman of the party.\nUmar had given the order while delivering ruling in a motion ex parte brought in a suit marked KB/AC/M.170/2021.\nShe rebuked counsel to the claimants/applicants, whom she said concealed important facts from the court when the ex parte motion was heard.\nI hereby set aside the order ex parte application granted on the 26/08/2021 in motion no KB/HC/M.170/2021."
  },
  {
    "headline": "Uzodimma on Buhari's visit: IPOB's sit-at-home order only on social media — Imo people came out",
    "summarized_story": "AdvertisementBuhari, on Thursday, visited Imo state to commission some projects executed by the Uzodimma administration.\n“What is important to me is that Mr President visited and you could see the excitement of the entire Igbo nation.\nThe leadership received Mr President, commended Mr President, pledged to support Mr President’s government and policies,” he said.\nYou could see that with the sit-at-home order, which is only a social media sit-at-home order.\nThe sit-at-home order is not in Imo state, because we never issued any sit-at-home order."
  },
  {
    "headline": "Why Nigeria’s vehicle financing culture is struggling to take flight",
    "summarized_story": "But insufficient purchasing power among middle-class Nigerians coupled with limited or no access to vehicle financing puts cars out of reach for over 90% of the population.\nIn developed economies, car loans and vehicle financing schemes help people spread out vehicle payments over several months or even years.\nGbenro Dara, the Managing Director of Olist Nigeria, explains to TechCabal some of the reasons behind Nigeria’s significantly costly and inaccessible vehicle financing schemes.\nAccording to Dara, the latter factor is the biggest drawback when it comes to vehicle financing in Nigeria.\nSeveral microlenders have developed vehicle financing programs, which take the asset as collateral."
  },
  {
    "headline": "MTN Group, Africa’s largest telecom, reportedly in talks to sell Afghanistan arm",
    "summarized_story": "Africa’s largest telecom company MTN Group is reportedly in talks with potential international buyers for its wireless business in Afghanistan per Bloomberg.\nThe South Africa headquartered company is currently the market leader in Afghanistan with a 40% share and is in discussions with several parties in ongoing negotiations to sell its Afghanistan arm.\nA writedown of MTN’s Afghanistan business without any proceeds from disposal is estimated to cost about R700 million ($49 million) according to undisclosed sources familiar with the negotiations.\nThe sale of its Afghanistan unit is crucial to MTN as it plans to raise about R15 billion ($1 billion) from shareholding sales in markets outside Africa.\nMTN currently serves over six million customers in Afghanistan, its planned exit could serve as an opportunity for other Afghanistan telecom players to expand their market share, while MTN does the same in Africa."
  },
  {
    "headline": "How Wave became Francophone Africa’s first unicorn startup with \"radically affordable\" money transfers",
    "summarized_story": "Taking on incumbentsSenegal is one of Africa’s fastest-growing mobile money markets, according to a 2020 GSMA report.\nExpresso Telecom, a unit of the UAE’s Expresso Telecom Group Limited, holds 22% of the market share, with over 3 million subscribers.\nAll three telecom firms provide mobile money services under the Orange Money, Free Money, and E-Money brands respectively, and along with banks, dominate the digital financial services space.\nAccording to co-founder Drew Durbin, Wave is building a mobile money service that is “radically affordable”.\nThe startup’s low-cost transaction service has helped it take on incumbents, eat into their market share, and turn the entire mobile money industry on its head."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Mobile phones and illiteracy, storytelling for all kids, Prospa’s $3.8m raise, and MNT-Halan’s $120m investment",
    "summarized_story": "AdvertisementHowever, there are mobile phone applications that can help an individual with literacy delay learn to read and write.\nAmerican nonprofit organisation, The Borgen Project, reports that mobile phones “help thousands of people in developing countries learn to read.”Techpoint Africa’s Victoria Fakiya, tells us about the problem with illiteracy in Africa and how mobile phones can help.\nRead here: Improving literacy with mobile phones and tech tools in Africa.\nStorytelling for minority kids on AkiddieAkiddie’s teamNigerian startup, Akiddie, has gone from giving African kids more culturally inclusive stories to catering for all minority kids across the globe.\nOur Senior Reporter, Emmanuel Paul, reveals more on Akiddie’s mission to become a storytelling platform for minority kids globally."
  },
  {
    "headline": "Improving literacy with mobile phones and tech tools in Africa",
    "summarized_story": "AdvertisementPer Statista, 66.8% of Africans aged 15 and above could read, write, and understand a simple statement in 2019.\nHowever, it’s important to note that a developmental delay, such as a literacy delay, is not the same as a developmental disability.\nDistinguishing development delays from developmental disabilitiesA developmental delay simply means that a child is behind on some developmental milestones; it does not indicate a specific health problem.\nDespite Emeka’s literacy delay, he could have improved significantly in a better school environment, with supportive parents and early intervention using tech tools.\nThese and other tech tools have revealed the importance of technology on literacy as these tools are available to everyone, regardless of age."
  },
  {
    "headline": "Nigeria’s Akiddie is scaling to become a storytelling platform for minority kids worldwide",
    "summarized_story": "Until recently, most children’s literature from popular culture has mainly featured Western civilisations, and there was a distinct lack of diversity.\nA 2019 survey in the UK also reveals that just 10% of children’s literature published that year had a minority character.\nSource; SuppliedIn Donna Norton’s 2010 book, Through the Eyes of a Child: An Introduction to Children’s Literature, she argues that children’s literature helps them appreciate their and other people’s cultural heritage and helps them develop emotional intelligence and creativity.\nOn further research, we discovered that the main reason why there wasn’t a lot of minority children’s content was that it was difficult to monetise,” he says.\nBesides minority children, Onyekachi believes this new model will cater favourably to minority content creators across the globe."
  },
  {
    "headline": "Nigeria’s broadband target years behind SA, Egypt’s rapid rollout",
    "summarized_story": "Nigeria’s National Broadband Plan set a supposedly ambitious target for the country to attain 70 percent broadband penetration by 2025.\nNigeria is not only behind South Africa and Egypt; it also trails Kenya, which has achieved 48 percent so far.\nAt 39 percent, Nigeria accounts for less than 40 percent of South Africa’s broadband penetration and about 55 percent of Egypt’s penetration numbers.\nOn the other hand, operators in South Africa made good use of the pandemic to deepen investment in high-speed internet infrastructure.\n“Studies by the ITU suggest that a 10 percent increase in broadband penetration is likely to translate to increases of 2 percent and 1.8 percent in GDP for low-income and middle-income countries."
  },
  {
    "headline": "How NNPC manicured its books to extract N287bn profit",
    "summarized_story": "Since the Corporation released its financial statements Wednesday night many doubts have greeted its N287 billion declared as 2020 profit.\nTo arrive at a profit in 2020, the NNPC declared a net impairment reversal of N713 billion in 2020 compared with a loss of N273 billion in 2019.\n“One assumption I can make from the disclosure on the impairment reversal and other notes to the accounts is that the Federal Government must have injected funds into NNPC in 2021.\nIn 2020, a detailed breakdown showed NNPC recorded group current liabilities of N10.8 trillion, which outweighed the firm current assets of N6.2 trillion.\nThe report also explained how NNPC had been sustaining recurring losses over the years, culminating into N1.5 trillion as of December 2020."
  },
  {
    "headline": "Businesses grieve over soaring cost, poor services at inland ports",
    "summarized_story": "Importers and manufacturers are now counting losses due to the high cost of doing business and poor service delivery at inland dry ports, popularly known as bonded terminals or inland container depots (ICDs).\nConsequently, importers that have their containers transferred to these terminals end up experiencing delays that result in payment of extra cost as demurrage to shipping companies.\nThis is such that an importer could pay as much as N3 million per container to cover transfer charges and demurrage to shipping companies due to the longer dwell time of the container.\nGiving an insight into the problems associated with doing business at inland ports, Tony Anakebe, a maritime analyst, says it takes time for containers to be assigned from the mother port to inland ports.\nWhen they finally do, they charge transfer charges to cargoes, which is an extra cost to the importer."
  },
  {
    "headline": "Obaseki, Osinbajo, Obasanjo, others extol exemplary life of Dapo Abiodun’s late father – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki; his Ekiti, Lagos, Ondo, Kebbi and Kwara State counterparts, Kayode Fayemi, Babajide Sanwoolu, Rotimi Akeredolu, Sen. Abubakar Bagudu and AbdulRahman AbdulRazaq, respectively, have extolled the life of service of late Pa Emmanuel Adesanya Abiodun, the father of Ogun State Governor, Dapo Abiodun, who died aged 89.\nObaseki, who spoke to journalists, described the late Adesanya Abiodun as a teacher of teachers who impacted knowledge not only on his children but his entire family, society, community, state and the nation at large.\nAccording to him, “the life and time of late Pa Emmanuel Adesanya Abiodun is that of life of service to the people.\nHe contributed a lot to humanity; impacting positively his family, church, society, community, state and nation at large.\nOlusina Fade, described the late Abiodun as a true and complete Christian who never faked Christianity, but followed the tenets of Christ, focusing on heaven as the home for the righteous."
  },
  {
    "headline": "JARA stores sets to open second outlet in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Nigeria’s foremost discount retail outlet, JARA stores, has concluded plans to open its second retail store in Benin City, at the Ugbowo axis of Benin City, the Edo State capital.\nAccording to her, “We are excited to be opening a new store in Benin City.\nThis will be the second store in Benin in less than two years of commencing operations in Edo State.\nIt is a testament to the faith that we have in the retail sector in Edo State and our commitment to the partnership with the Edo State Government through the EDPA.\nWe now want to extend our amazing offers to more people in Edo State with the opening of this new store."
  },
  {
    "headline": "Edo College of Education: Ultra modern Abudu campus completed – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu – The transformation of the educational sector by the governor Godwin Obaseki-led administration in Edo State has taken a serious leap with the completion of the multi-million-naira ultra modern College of Education, Abudu Campus in Orhionmiron local government area of the state.\nAccording to a source at the ministry of education, the college will commence academic activities in Abudu, Afuze and Igueben Campuses simultaneously as soon as Governor Obaseki approve the report on recruitment into the institution.\nRecall Obaseki had last year revealed that the National Commission for Colleges of Education (NCCE) gave approval for the establishment of the College of Education, with three campuses, to cater for the three senatorial districts of the state.\n“Each school is specializing in a specific aspect of teacher education.\nThe one in Abudu will have a digital training centre to train primary school teachers; the school in Igueben will focus on secondary school and science teachers, while the one in Afuze will specialise in training teachers in Technical Education, Physical Education and Special Education”, Obaseki noted..."
  },
  {
    "headline": "Obaseki pledges support for Made in Edo products – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In an effort to encourage local production thereby working towards realization of the industrialization revolution agenda of the Edo State Government, the state Governor, Mr. Godwin Obaseki has pledged to support and promote made in Edo products.\nAccording to him, “Nigeria is the third largest producer of cocoa in Africa and Edo State is among the fifth.\n“For those who have made in Edo products, be assured that we are ready to support you so that you can make more profits.\nWe want to be able to support businesses in the state.\nAs you know, Edo is becoming a retail hub for super markets and super malls; Hallmark, Market Square, Jara supermarket are in Edo."
  },
  {
    "headline": "Weekly COVID-19 cases in Africa fall by more than 20% – WHO",
    "summarized_story": "The World Health Organisation (WHO) says that weekly COVID-19 cases in Africa fell by more than 20 per cent, the sharpest seven-day decline in two months as the third wave pandemic tapers off.\nAccording to her, in Southern Africa, for instance, more than 4000 COVID-19 genome sequencing data was produced in August.\nREAD ALSO:According to her, while COVID-19 cases have declined appreciably, the downward trend is frustratingly slow due to the lingering effects of the more infectious Delta variant.\nMrs Moeti said that in 2020, WHO and partners established a COVID-19 sequencing laboratory network in Africa which has to date produced nearly 40,000 sequencing data.\nADVERTISEMENT“The C.1.2 variant, initially identified in South Africa, has so far been detected in 130 cases in 10 countries globally, including five in Africa."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NGX Group Shareholders Back All Resolutions at the 60th Annual General Meeting",
    "summarized_story": "Shareholders of Nigerian Exchange Group Plc (NGX Group or the Group), formerly The Nigerian Stock Exchange (NSE), today, 9 September 2021, voted in support of the resolutions presented by the Group at its 60th Annual General Meeting (AGM).\nThe meeting, which is the first AGM of the Group as a demutualised, shareholder-owned, for-profit entity, further to previous shareholder and regulatory approvals, marked a historic moment.\nI am both thankful for the invaluable support of our stakeholders and proud of the resilience NGX Group continues to demonstrate after over six decades.\nToday, I am more confident than ever that the Group is well-positioned to deliver value to shareholders as we move into a new growth phase.”The Group Managing Director/Chief Executive Officer, NGX Group Plc, Oscar N. Onyema, OON, said, “We thank our shareholders for their support of the resolutions proposed at today’s meeting.\nAs the Group progresses its plans to list on Nigerian Exchange, we look forward to welcoming a broader group of investors to share in our journey."
  },
  {
    "headline": "Naira plunges to N543 per $1 at parallel market",
    "summarized_story": "The Nigerian naira, has hit a new low exchanging for N540 against the dollar, at the parallel market on Thursday.\nThis is barely a week after the naira exchanged for N530 against the dollar, at the parallel market.\nThe naira also dipped to 720 against the pound at the parallel market from 717/£1 last week Wednesday, while the euro rose to N620 from N616.\nOn June 27, 2021, the CBN ended the sales of Forex to BDCs saying the parallel market had become a conduit for illicit Forex flows and graft.\nWeekly sales of foreign exchange by the CBN will henceforth go directly to commercial banks, the CBN governor, Godwin Emefiele, said."
  },
  {
    "headline": "Anambra guber: INEC lists Valentine Ozigbo as PDP candidate",
    "summarized_story": "The Independent National Electoral Commission (INEC) has listed Valentine Ozigbo as the candidate of the Peoples Democratic Party (PDP) for the Anambra governorship election in obedience of appeal Court judgement that validated his his candidacy.\nINEC also published the name of Lilian Enemo as the PDP’s deputy governorship candidate.\nIn the list published on July 16, INEC had excluded the candidate of the Peoples Democratic Party (PDP).\nSimilarly, on September 3, a court of appeal in Abuja declared Valentine Ozigbo as the validly nominated PDP candidate.\n“The court has ordered the commission to recognise and publish the name of Mr. Valentine Ozigbo as the governorship candidate."
  },
  {
    "headline": "Buhari: Igbo are everywhere in Nigeria, it’s unthinkable for anyone Igbo man to consider himself as not part of Nigeria",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has argued that it would out of place for any Igbo person to consider himself as not being part of Nigeria, given that Igbo people are scattered in every part of the country.\nPresident Buhari also told the people that he would want to be remembered as the President who stabilised Nigeria in the area of security, economic prosperity and triumph over corruption.\n‘‘Therefore, it is unthinkable for me that any Igbo man would consider himself not to be a part of Nigeria.\nIn his remarks, the President-General, Ohaneze Ndigbo Worldwide, Prof. George Obiozor assured the President of the continuous support of Ndigbo.\n‘‘Ndigbo is committed to Nigerian unity and there is news for those trying to push us out of Nigeria."
  },
  {
    "headline": "Court Okays T.B. Joshua’s Wife As Trustee Of SCOAN",
    "summarized_story": "Justice Tijjani Ringim of the Federal High Court in Lagos has approved the appointment of Mrs Evelyn Joshua as a trustee of Synagogue Church Of All Nations (SCOAN) in line with the constitution of the Church.\nThey had urged the court to appoint the widow of the deceased founder of the church, Prophet TB Joshua as a member of the trustees in line with the constitution of the Church which prescribes a minimum of three trustees for SCOAN.\nADVERTISEMENTThey claimed that their petition followed the sudden demise of the late General Overseer of SCOAN, fondly called Prophet T. B. Joshua, who was also a Church trustee.\nThe petitioners were represented in court by Emeka Ekweozor while Ossazu Owie represented first and second Respondents; and O.N Chukwu appeared for the CAC.\nThe church has been in limbo since the passing of Prophet TB Joshua over the leadership succession in the church."
  },
  {
    "headline": "Court Okays T.B. Joshua’s Wife As Trustee Of SCOAN",
    "summarized_story": "Justice Tijjani Ringim of the Federal High Court in Lagos has approved the appointment of Mrs Evelyn Joshua as a trustee of Synagogue Church Of All Nations (SCOAN) in line with the constitution of the Church.\nThey had urged the court to appoint the widow of the deceased founder of the church, Prophet TB Joshua as a member of the trustees in line with the constitution of the Church which prescribes a minimum of three trustees for SCOAN.\nADVERTISEMENTThey claimed that their petition followed the sudden demise of the late General Overseer of SCOAN, fondly called Prophet T. B. Joshua, who was also a Church trustee.\nThe petitioners were represented in court by Emeka Ekweozor while Ossazu Owie represented first and second Respondents; and O.N Chukwu appeared for the CAC.\nThe church has been in limbo since the passing of Prophet TB Joshua over the leadership succession in the church."
  },
  {
    "headline": "BREAKING: Amotekun Corps Rescues 9 Travellers Abducted In Ondo",
    "summarized_story": "Operatives of the Ondo State security network codenamed Amotekun Corps, have rescued nine of the 12 passengers abducted in the state on Wednesday evening on Ifira Akoko-Idoani road.\nHowever, the Commander of Amotekun Corps in the state, Chief Adetunji Adeleye, said the victims were rescued after his men responded to a distress call from concerned citizens from the area.\nAccording to him, “Our men responded to the gunshots and a distress call.\nAmotekun Rescues Lagos Teenager From Suspected Ritualist In Ondo”The vehicle and its driver have also been released to the Police.\nWe are now on the trail of the kidnappers to rescue the remaining three victims.”"
  },
  {
    "headline": "BREAKING: Amotekun Corps Rescues 9 Travellers Abducted In Ondo",
    "summarized_story": "Operatives of the Ondo State security network codenamed Amotekun Corps, have rescued nine of the 12 passengers abducted in the state on Wednesday evening on Ifira Akoko-Idoani road.\nHowever, the Commander of Amotekun Corps in the state, Chief Adetunji Adeleye, said the victims were rescued after his men responded to a distress call from concerned citizens from the area.\nAccording to him, “Our men responded to the gunshots and a distress call.\nAmotekun Rescues Lagos Teenager From Suspected Ritualist In Ondo”The vehicle and its driver have also been released to the Police.\nWe are now on the trail of the kidnappers to rescue the remaining three victims.”"
  },
  {
    "headline": "Northern States To Boycott DSTV Over Non-enlistment Of Stations – Group",
    "summarized_story": "Five months after MultiChoice’s failure to change its position and consider transmitting northern-based television stations, the Coalition of Northern Groups (CNG) has said that the 19 northern states may enforce a regionwide boycott.\nRecall that following an intervention by CNG via a letter of complaint dated January 10, 2021, over the non-inclusion of Northern-based television stations on the DSTV platform, the Nigerian Broadcasting Corporation (NBC) arranged a meeting with the DSTV on March 18, 2021 to change its position and consider carrying northern based television stations that could meet the laid down procedures.\nADVERTISEMENTCNG, however, urged NBC to act to get the MultiChoice to keep its obligation agreed to at th last meeting before considering the next line of action which may not preclude the enforcement of a regionwide boycott.\nThe coalition recalled that while it was asked to submit a list of five qualified television stations from the North for consideration by the MultiChoice, which was done immediately, it was yet to fulfill its part of the agreement.\n“While we await an update on the situation from you on the matter Sir, we remain, as usual, faithful in your commitment,” the statement added."
  },
  {
    "headline": "BBNaija 6: Why I kissed, went under the duvet with Boma, embattled Tega",
    "summarized_story": "BBNaija 6: Why I kissed, went under the duvet with Boma, embattled TegaBBNaija 6: Why I kissed, went under the duvet with Boma, embattled TegaA former Big Brother Naija Season 6 housemate, Tega, has explained what happened under the duvet with a male housemate, Boma.\nNo sex,” Tega explained in PUNCH Live on Wednesday.\nBoth Boma and Tega were evicted on Sunday, alongside Peace and Michael during the King Size eviction night.\nAfter her eviction, Tega made several efforts to clarify that despite her romance with Boma, they never had sex.\nA viral video clip had shown Boma kissing Tega passionately in the executive lounge; and another scene showing erotic movements under the duvet."
  },
  {
    "headline": "BBNaija 6: Why I kissed, went under the duvet with Boma, embattled Tega",
    "summarized_story": "BBNaija 6: Why I kissed, went under the duvet with Boma, embattled TegaBBNaija 6: Why I kissed, went under the duvet with Boma, embattled TegaA former Big Brother Naija Season 6 housemate, Tega, has explained what happened under the duvet with a male housemate, Boma.\nNo sex,” Tega explained in PUNCH Live on Wednesday.\nBoth Boma and Tega were evicted on Sunday, alongside Peace and Michael during the King Size eviction night.\nAfter her eviction, Tega made several efforts to clarify that despite her romance with Boma, they never had sex.\nA viral video clip had shown Boma kissing Tega passionately in the executive lounge; and another scene showing erotic movements under the duvet."
  },
  {
    "headline": "I like this pampering. Don’t you? By FEMI ADESINA – Daylight",
    "summarized_story": "In their scores, scores upon scores, they are being spoken to in the language they understand, and sent to God to answer for their sins.\nYou love the pampering being handed out simultaneously from the air and the ground by the troops, don’t you?\nBut a government exists to solve problems, and that is what President Buhari had been committed to doing.\nDr Okolo Oteri Eme is one of the women who love Buhari.\n*Adesina is Special Adviser to President Buhari on Media and PublicityShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "I like this pampering. Don’t you? By FEMI ADESINA – Daylight",
    "summarized_story": "In their scores, scores upon scores, they are being spoken to in the language they understand, and sent to God to answer for their sins.\nYou love the pampering being handed out simultaneously from the air and the ground by the troops, don’t you?\nBut a government exists to solve problems, and that is what President Buhari had been committed to doing.\nDr Okolo Oteri Eme is one of the women who love Buhari.\n*Adesina is Special Adviser to President Buhari on Media and PublicityShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ladipoe only Nigerian singer nominated for BET Hip Hop awards",
    "summarized_story": "The nominations for the BET Best Hip Hop awards are out, but it was only Ladipoe, the Mavin Record artiste that made it.\nHe is up for awards including Hip Hop Artist of the Year and Song of the Year.\nLil Durk)“Up,” Produced by Yung DZA, Sean Island, DJ Swanqo (Cardi B)“WAP,” Produced by Ayo & Keyz (Cardi B Feat.\nNicki Minaj)Hip hop artist of the yearCardi BDrakeJ. ColeLil BabyMegan Thee StallionTyler, the CreatorBest Hip Hop VideoCardi B, “Up”Cardi B feat.\nDoja Cat, “Best FriendBest new hip hop artistBlxstCoi LerayDon ToliverMorrayPooh ShiestyYung Bleu Best collaboration21 Savage & Metro Boomin Feat."
  },
  {
    "headline": "Telecom services shut down in Katsina",
    "summarized_story": "Telecommunication services have been shut down in 13 local government areas of Katsina State following the incessant attacks by bandits in the areas.\nThe shutdown of the telecommunication services is speculated to be a move by security operatives to clamp down on bandits in the state, Daily Trust reports.\nFew days ago, the National Communications Commission (NCC) debunked reports that it planned to shut down telecom services in the Northwestern state.\nNCC had refuted a trending social media story claiming that the commission had ordered telecom service providers to shut down their sites in Katsina.\nNCC had issued a directive to telecom operators to shut down their services in the neighbouring Zamfara State as from September 3, to enable security agencies carry out required operations in relation to the pervasive security challenges."
  },
  {
    "headline": "Imo Visit: Nigerians Mock President Buhari’s Igbo Outfit",
    "summarized_story": "Nigerians on social media have berated President Muhammadu Buhari’s Igbo outfit while he visited Imo state on Thursday.\nEarlier today, President Buhari arrived Imo state where he commissioned several projects done by the state governor, Hope Uzodinma.\nBuhari was received by dignitaries at the Sam Mbakwe Airport in Imo state.\nSee some reactions gathered below:@Heisjoseph wrote, “Unrelated, but the tailor that styled President Buhari no fit make heaven.”Another Twitter user named @VictorIsrael_ wrote,“It’s so Obvious that President Buhari isn’t welcomed to Imo state because even his Trouser refuse to touch the ground.”@realDewoye tweeted, “Muhammadu Buhari is the only person I know who can wear what is supposed to be a special attire in the Igbo culture & still look like an almajiri in the dress.”@ICON wrote, “DSS should arrest the tailor.”"
  },
  {
    "headline": "BREAKING: Olu Of Warri Disrobes One Chief In Ongoing Title Revalidation Exercise",
    "summarized_story": "In the ongoing Chieftaincy title revalidation process in his Warri kingdom, Olu of Warri, Ogiame Atuwatse III, has disrobed one of the chiefs (name withheld).\nThe afflicted is no longer a chief in the Itsekiri nation as a result of the incident.\nIt would be recalled that the monarch dissolved the Warri Council of Chiefs around two weeks ago and began the process of readmission, with Iyatsere Chief Johnson Amatserunleghe emerging as the most senior Chief and Chairman of the Warri Council of Chiefs.\nIn the previous two weeks, the Itsekiri nation’s ancestral home, Ode Itsekiri, has been undergoing readmission into the Council of Chiefs.\nChief Yaya Pessu, Chief Brown Mene, Chief G. T. Grant, and Chief Felix Esisi were among those readmitted to Ode Itsekiri yesterday."
  },
  {
    "headline": "Troops Arrest High Profile Boko Haram Member On Wanted List",
    "summarized_story": "Yawi Modu, a high-profile Boko Haram member, has been apprehended by Operation Hadin Kai (OPHK) forces.\nBrig-Gen Onyema Nwachukwu, a spokesman for the Nigerian Army, said the Boko Haram member who had been on the security wanted list had been apprehended during a recent raid on terrorist hideouts in the North East.\nNwachukwu said in a statement on Thursday that Modu and his associates were apprehended along the Damboa-Wajiroko route by Sector 2 OPHK troops.\nDuring the operations in the Damboa and Gashua Local Government Areas of Borno and Yobe States, the military raided Boko Haram’s Improvised Explosive Devices, or IEDs, and materials hub, according to Nwachukwu.\n“The suspects and materials recovered are currently undergoing preliminary investigation.”"
  },
  {
    "headline": "VAT: Buhari Govt Must Stop Policies Impeding True Federalism – Afenifere",
    "summarized_story": "Afenifere, a Yoruba socio-political organization, has challenged the Federal Government to halt its actions and policies that are preventing Nigeria from practicing true federalism.\nAfenifere was reacting to the ruling by the Federal High Court sitting in Port Harcourt, Rivers State on Value Added Tax, VAT.\nReacting, Afenifere commended the judge for the ruling and the Rivers State government for initiating the legal process.\nAccording to Ajayi: “Afenifere observes that the manner of distributing VAT revenue is patently unfair, unjust and is pitched against the hardworking while rewarding the indolent by a manner of speaking.\n“They should rest assured of Afenifere support as they give vent to power devolution and entrenchment of true federalism in Nigeria.”"
  },
  {
    "headline": "Breaking: Fear grips residents as another fuel tanker explodes in Lokoja (VIDEO)",
    "summarized_story": "Fear has gripped many residents and passersby after tanker filled with fuel exploded in Felele area of lokoja, Kogi state capital on Thursday night.\nThe cause of the fire is yet unknown.\nAs at the time of filling this report, the state fire service were yet to visit the scene.\nSimilar incidence had happened some months ago.\nDetails loading…"
  },
  {
    "headline": "NPower batch C employment: How to download PPA deployment letter successfully ahead of verification",
    "summarized_story": "Here is a quick guide on how you can easily login to Npower NASIMS portal and download the Npower Batch C PPA deployment letter.\nThe deployment letter is now available for download for those who have been cleared to be deployed by Npower NASIMS Team.\nNpower PPA letter Not Downloading SolvedIs your NPower PPA Letter Not Downloading?\nFollow the steps below to download your Npower PPA letter.\n(As usual, an error message pops up)Here is where the solutions is-Ignore the error message and keep tapping the download button nonstop for some time."
  },
  {
    "headline": "Breaking: Like Ondo, Lagos assembly passes anti-open grazing bill",
    "summarized_story": "From Lagos comes a report that the Lagos state House of Assembly on Thursday passed passed the bill that prohibits open cattle grazing in the state.\nAlso, the state assembly passed Value Added Tax (VAT) on the same day.\nThe two bills were passed after unanimous votes by the lawmakers at the sitting where they were read the third time.\nThe passage of the anti-open grazing bill is happening in Lagos after their Ondo counterparts did same.\nDetails loading…"
  },
  {
    "headline": "PFN urges Christians to leverage on electronic process",
    "summarized_story": "The Pentecostal Fellowship of Nigeria (PFN) has called on Christians to take advantage of the electronic voting system introduced by Independent National Electoral Commission to elect credible members to power.\nThe PFN Chairman South-South, Apostle Zilly Aggrey of Royal House of Grace made the call at the Social Security Outreach program, at Greater Evangelism worldwide Crusade, Opolo Yenagoa.\nHe said, “the christians should take advantage of having a voters card, most especially now, they have started electronic registration of voters card, and INEC came to explain point by point how our people can access the site and the form is registration.\nI want to appreciate the INEC for this initiative."
  },
  {
    "headline": "Fulani group dares southern governors, says anti opening grazing law satanic – NigPilot",
    "summarized_story": "Fulani socio-cultural group, Miyetti Allah Kautal Hore has described the anti-opening grazing law as satanic and a unanimous decision of southern governors to destroy pastoralists means of livelihood.\nMiyetti Allah group disclosed this in Masaka community, Abuja suburb on Monday at a press briefing, jointly delivered by its national president, Alh.\nHe further called for proper funding of the National Commission for Nomadic Education and the expansion of its mandate.\n“This oppressive laws and hostile policies being enacted by state governors are fundamentally going against the Fulani Pastoralist culture, economic interest and constitutional rights.\n“To this effect any action taken by any state Assembly that is in conflict with an above section of the 1999 Constitution as amended is null and void."
  },
  {
    "headline": "NITDA graduates 200 kids in emerging technologies – NigPilot",
    "summarized_story": "National Information Technology Development Agency, NITDA has graduated 200 kids from its Science, Technology, Engineering and Mathematics (STEM) Boot Camp for Kids (SB4KIDS) 2021 edition to further ensure that Nigeria becomes a digitally proficient economy.\nKashifu said NITDA had through its National Centre for Artificial Intelligence and Robotics (NCAIR) embarked on a two weeks training for kids on STEM Education, which is a yearly initiative, normally conducted during the summer school holidays.\n‘‘We at NITDA believe that the early involvement of youngsters in technology and innovation will accelerate the development of the technology sector and create future technology leaders who will transform the Nigerian technology space and boost the Nigerian Digital Economy.\nThe first three (3) from each batch will receive a laptop, while all the twenty (20) selected winners will receive a STEM kit that will help them with their STEM education journeys.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Katsina Banditry: 19 LGA flashpoints identified as phone charging business outlets suspended – NigPilot",
    "summarized_story": "AS part of continuous measures in tackling insecurity, Governor Aminu Bello Masari of Katsina State has an Executive order No 4, announced the suspension of business outlets engaging in phone charging business in the banditry prone areas of the state.\nHe also identified Nineteen, 19, local government areas as bandit’s flashpoints.\nThe Governor made this known while inaugurating the committee on Monitoring and Enforcement of the Security Challenges (Containment) Order today, Monday.\nThe Nineteen local government areas that were identified by Governor Masari as the flashpoint areas are where the committee is expected to beam their searchlight.\nThe Katsina State Commissioner of Police, CP Sanusi Buba is the Chairman while the Secretary to the State Government, Mustapha Inuwa will serve as secretary of the committee respectively."
  },
  {
    "headline": "Lagos Assembly Passes VAT, Anti-Open Grazing Bills",
    "summarized_story": "The Lagos State House of Assembly has passed the Value Added Tax (VAT) bill, along with a bill that prohibits the open grazing of cattle in the state.\nThe two bills were passed after unanimous votes by the lawmakers during Thursday’s plenary after they were read for the third time.\nFollowing the passage of the bills, the Speaker of the House, Mudashiru Obasa, commended his colleagues for their passion to see that the state continues to grow.\nObasa also directed the Acting Clerk of the House, Mr Olalekan Onafeko, to transmit clean copies of the bills to the state governor, Babajide Sanwo-Olu, for assent.\nThe passage comes a day after the lawmakers held separate public hearings on the bills with stakeholders who declared their support for them."
  },
  {
    "headline": "Buhari Visits Imo, Commissions Projects",
    "summarized_story": "President Muhammadu Buhari on Thursday visited Imo State where he commissioned four newly executed projects.\nAt a ceremony to commission one of the projects, the President praised the governor for his development strides which he described as visible.\n“I have seen enough that justifies his (Uzodinma’s) integrity in making sure that he is working very hard to make sure that you get the structures necessary,” President Buhari said.\nHe also noted that Imo has gotten additional support from the President on the management of some ecological problems in the state.\nSee more pictures capturing the visit of the President to Imo State below:"
  },
  {
    "headline": "Gunmen Kidnap 18 Travellers In Ondo",
    "summarized_story": "Gunmen have abducted 18 travellers in Ondo State.\nThe victims were abducted on Wednesday night along the Ifira-Akoko/Idoani road in Akoko South East Local Government Area of the state.\nThe abductors were said to have fired gunshots into the air to scare the passengers before taking them into a nearby forest.\nThe Commander of Ondo State Security Outfit, codenamed Amotekun, Adetunji Adeleye, confirmed the incident to Channels Television on Thursday.\nREAD ALSO: Gunmen Kill Three Police Officers In DeltaAdeleye, however, said 14 of the victims have been rescued by men of the agency while efforts are ongoing to rescue the rest."
  },
  {
    "headline": "Bandits Kill Police Officer, Abduct 23 Others In Kaduna",
    "summarized_story": "A police officer has been killed with 23 others abducted when bandits attacked Ungwan Maje and Ungwan Laka villages in the Chikun Local Government Area of Kaduna State.\nEyewitnesses told Channels Television that the gunmen first attacked Ungwan Maje where they abducted 16 persons, majorly women and children.\nThey later proceeded to the Ungwan Laka community where they killed a mobile police officer identified as Joshua Markus.\nThe spokesman of the Kaduna State Police Command, Mohammed Jalige, also confirmed the incident to Channels Television.\nHe said security operatives were on the trail of the bandits with a view to arresting them and rescuing the kidnapped victims."
  },
  {
    "headline": "Our Commitment To Nigeria’s Unity, Peace Is Irrevocable – Uzodinma",
    "summarized_story": "Imo State Governor, Hope Uzodinma, says his administration and the people of the state are committed to the peace of Nigeria.\n“Our commitment to the unity and peace of Nigeria is irrevocable,” the governor asserted in Owerri, the state capital.\nHe further stated that through inclusive governance, his administration has accommodated every Nigerian resident in Imo State.\nThe governor thanked President Buhari for honouring the invitation to commission the projects put together by the ‘Shared Prosperity Administration’.\nWhile in Imo, President Buhari commissioned a balloon technology-driven underground tunnel with surface drainage (Chukwuka Nwoha), Naze Road, and Nekede/Ihiagwa Road."
  },
  {
    "headline": "Political parties are the most important democratic bodies to facilitate nation building",
    "summarized_story": "Director General of the Progressives Governors Forum, Salihu Lukman has attributed the major problem of leadership in Nigeria, on skewed inclination of nation building.\nHe says Visionary and purposeful leadership are expected to facilitate the emergence of nations, leveraging on strong national institutions, good governance, equity and justice, which enable everyone to fulfill their aspirations.\nHe believes Successful nations have common purpose and strong national bond especially when they’re created out of multiple ethnic and religious identities.\nHe says therefore, a major challenge of nation building in Nigeria revolves around how to produce a set of true national leaders.\nHe added that It is necessary Nigerians recognise that political parties are the most important democratic bodies to facilitate processes of nation building."
  },
  {
    "headline": "Kaduna Govt reopens primary, Secondary Schools",
    "summarized_story": "Kaduna state Ministry of Education has announced plans to reopen Primary and Secondary schools in the state after two month of shutdown.\nIt has also released a new resumption schedule for its schools after months of disruption in the academic calendar due to attacks by bandits and military operations against them.\nCommissioner of Education in the state, Shehu Makarfi, made the announcement in a statement on Thursday in Kaduna.\nThe commissioner said rather than resume for the third term, schools will instead resume the first term for the 2021/2022 academic calendar.\nHe added that the state has worked out strategies towards ensuring the completion of the third term through online platforms."
  },
  {
    "headline": "I want to be remembered as President who stabilised Nigeria, Buhari tells South East leaders",
    "summarized_story": "President Muhammadu Buhari on Thursday disclosed to the leaders and elders in the South East that his greatest legacy is to be remembered as the president who stabilised the country.\n‘‘Therefore, it is unthinkable for me that any Igbo man would consider himself not to be a part of Nigeria.\n‘‘The evidence is there for everyone to see that Igbos are in charge of Nigeria’s economy.’’============================================================Read the full statement belowSTATE HOUSE PRESS RELEASEI WANT TO BE REMEMBERED AS A PRESIDENT WHO STABILISED NIGERIA, PRESIDENT BUHARI TELLS SOUTH EAST LEADERSPresident Muhammadu Buhari Thursday in Owerri said that he would want to be remembered as the President who stabilised Nigeria in the area of security, economic prosperity and triumph over corruption.\n‘‘Therefore, it is unthinkable for me that any Igbo man would consider himself not to be a part of Nigeria.\n‘‘Ndigbo are committed to Nigerian unity and there is news for those trying to push us out of Nigeria."
  },
  {
    "headline": "Breaking: Amotekun rescues 9 out of 12 kidnaped passengers in Ondo -",
    "summarized_story": "Operatives of the Ondo state command of the southwest security network code-named Amotekun have rescued nine out of the twelve victims abducted by some bandits in the state.\nThe passengers were abducted on Wednesday.\nThe passengers heading from Abuja to Lagos in an 18 seater bus, were attacked by the armed men between Idoani Ifira axis of the state.\nThe incident occurred on the failed portion of the Idoani-Ifira road in Akoko Southeast local government area of the state.\nThe Commander of Amotekun in the state, Adetunji Adeleye said the victims were rescued after his men responded to a distress call from concerned citizens."
  },
  {
    "headline": "US: Biden to Require All Federal Employees, Government Contractors to Vaccinate Against Covid-19",
    "summarized_story": "US President Joe Biden plans to require all federal employees and government contractors to get vaccinated against COVID-19.\nJust weeks after he mandated federal workers get a shot or face rigorous testing and masking protocols, Biden will sign a new executive order to require vaccination for employees of the executive branch and contractors who do business with the federal government, according to a person familiar with the matter.\nIt wasn’t immediately clear if Biden’s order includes exceptions for workers or contractors seeking religious or medical exemptions from vaccination.\nBiden has encouraged COVID-19 vaccine requirements in settings like schools, workplaces and university campuses, and the White House hopes the strengthened federal mandate will inspire more businesses to follow suit.\nFederal regulators are seeking additional data from Moderna that will likely delay its booster approval until October."
  },
  {
    "headline": "Scores of Westerners, Including Americans, Fly Out of Kabul",
    "summarized_story": "Some 200 foreigners, including Americans, flew out of Afghanistan on an international commercial flight from Kabul airport on Thursday, the first such large-scale departure since U.S and foreign forces concluded their frantic withdrawal at the end of last month.\nAmericans, green card holders and other nationalities including Germans, Hungarians and Canadians were on the flight, the official said.\n“I can clearly say that this is a historic day in the history of Afghanistan as Kabul airport is now operational,” said Qatari special envoy Mutlaq bin Majed al-Qahtani.\n“Call it what you want, a charter or a commercial flight, everyone has tickets and boarding passes,” al-Qahtani added, noting that another commercial flight would take off on Friday.\nA foreign diplomat, likewise speaking on condition of anonymity because he wasn’t authorized to brief the media, said another 200 foreigners, including Americans, would depart in the next couple of days."
  },
  {
    "headline": "Flutterwave, MTN Partner On Mobile Money To Ease Payment Across Africa",
    "summarized_story": "Flutterwave, a leading payments technology company in Africa, is collaborating with MTN Group to enable businesses operating Flutterwave in some African nations to receive payments via MTN Mobile Money called MoMo.\nThe coming together of the two companies would allow Flutterwave to offer MTN Mobile Money as a payment method to its business customers in Cameroon, Côte d’Ivoire, Rwanda, Uganda and Zambia and enable them receive payments through MTN MoMo.\nMTN and Flutterwave partnership would also positively contribute to this trend by increasing mobile money usage and penetration in Africa to improve local economies and livelihoods as well as create opportunities for individuals and businesses across the continent.\nCommenting on the partnership, Olugbenga “GB” Agboola, Founder and CEO of Flutterwave, said: “Africa has one of the highest growth rates for mobile money adoption and e-commerce in the world.\nSub-Saharan Africa alone is responsible for more than 45% of the world’s mobile money accounts with the number of account holders exceeding half a billion by 2020, as shared on Statista."
  },
  {
    "headline": "Nigeria VP Osinbajo Forecasts $450bn Boost In African Economy Via AfCFTA",
    "summarized_story": "The Nigerian Vice President, Yemi Osinbajo has forecasted a potential income gain of about $450 billion in the country’s economy through the African Continental Free Trade Area (AfCFTA).\nThe VP stated while delivering a message, at the closing of the 2021 Conference of African Insurance Practitioners on Wednesday.\n“How about Insurance companies?\nWe should now be looking at developing homegrown international African insurance conglomerates.\n“This means that we cannot accept a defunding of gas projects when gas is an important transition fuel for us,” the VP explained."
  },
  {
    "headline": "Northeast Nigeria’s Adamawa State Engages Vigilantes to Protect Schools Against Abduction",
    "summarized_story": "In an effort to prevent the incessant abductions bedivilling students across s hools in Northern Nigeria, the Adamawa State Government has engaged local hunters and vigilantes to protect schools and prevent the abduction of students.\nThe Commissioner of Ministry of Education and Human Service Mrs Wilbina Jackson made the disclosure on Thursday in Yola, the state capital, in an event organized by Education in Emergencies Working Group to commemorate the International Day to protect Education in the state.\n“The measure was a followup to suspension of boarding in schools so that students will attend schools from the safety of thier homes,” she said.\nThe event, Commemoration of International Day to Protect Education Against Attack in Adamawa State, which was organized by Education in Emergencies Working Group Nigeria, in collaboration with the Adamawa State Ministry of Education, featured student representatives from the Federal Government Girls College (FGGC), Yola, who made a speech and staged a drama.\nEarlier during the ceremony, Miss Wusayamba Markus who delivered a speech on behalf of the students from the FGGC Yola, urged the building of fence around all schools in the country to protect students against abduction."
  }
]