[
  {
    "headline": "BREAKING: Chidinma in court over alleged murder of Super TV boss",
    "summarized_story": "The arraignment of 21-year-old Chidinma Ojukwu, the prime suspect in the murder of Super TV Chief Executive Officer, Usifo Ataga, is set to begin at the Yaba Magistrate Court in Lagos State, The PUNCH has learnt.\nOjukwu, a 300-level Mass Communication student at the University of Lagos, is presently in court and would be arraigned with two other suspects in the case.\nOjukwu was consequently arrested on June 23 in her father’s house in Yaba and paraded at the Lagos State Police Command headquarters in Ikeja.\nShe, however, backtracked later in a video, absolving herself from the murder.\nUsifo, aged 50, was buried on July 30 in a low-key ceremony attended by his family members, including his wife, and friends."
  },
  {
    "headline": "Agitators for NDDC board sponsored to cause crisis in Niger Delta -Administrator",
    "summarized_story": "The sole administrator Niger Delta Development Commission, Mr. Efiong Akwa said on Saturday that those who were pushing for the inauguration of a substantive board for the commission were sponsored to cause crisis in the region.\nAccording to him, some elements outside the regions were hiding under agitations for the constitution of a substantive board of the NDDC to throw the region into crisis.\nAkwa said these during the inauguration of the Progressives Patriots Initiative, a pressure group within the All Progressives Congress.\n”The only peaceful region we have in Nigeria is the South-South because we are peaceful people and that is why peaceful things will follow you.\nEarlier, a member of the Board of Trustees of the APC and former military administrator of Ogun and Rivers State, Group Capt."
  },
  {
    "headline": "NDDC forensic auditors to submit final report today",
    "summarized_story": "Senator Godswill Akpabio, Minister of Niger DeltaBy Chris Ochayi, ABUJABaring last-minute alteration in the arrangement, the forensic audit firms, which carried out physical verification of projects execution and other activities of Niger Delta Development Commission, NDDC, will submit the final audit report today.\nVanguard learned that the report would be submitted to the Minister of Niger Delta Affairs, Godswill Akpabio, on behalf of the Federal Government at the ministry’s conference room in Abuja.\nIt was gathered that heads of the forensic audit firms had met with Akpabio last Friday in Abuja, where they briefed him on the successful conclusion of the exercise.\nThis is coming few days after the expiration of the July ending dateline earlier announced by the minister that the final report of the forensic audit would be presented to President Muhammadu Buhari for implementation.\nIt would be recalled that the Federal Executive Council had in February 2020 approved the appointment of a lead consultant for the forensic audit of the NDDC."
  },
  {
    "headline": "Sit-at-home ignored in Owerri, tension in Mbaise, Orlu",
    "summarized_story": "Movements of vehicular and human activities on Monday continued in Owerri capital of Imo State.\nVanguard at about 09:54 am in Owerri, visited major streets, market places and it was observed that business premises were opened.\nEven food vendors were seen in the major streets of Owerri doing their selling.\nAlso, the story was not different from Orlu area, where shops, banks were shutdown even at about 10:30am.\nIt was only around 11:30 am that human and vehicular movements were seen in the Orlu town."
  },
  {
    "headline": "IPOB Sit-at-Home: No disruption of examinations in South-East, says NECO",
    "summarized_story": "Compliance in EnuguBy Adesina WahabThe National Examinations Council, NECO, on Monday afternoon, said it had not recorded any case of the disruption of its ongoing examinations in the South-East or any part of the country, following the activities of the Indigenous People of Biafra, IPOB.\nRecall that members of the Indigenous People of Biafra, IPOB, had declared Monday a sit-at-home day for people of the region in solidarity with their leader, Nnamdi Kanu, who is facing trial.\n“The candidates are writing Mathematics exam today (Monday) and so far we have not got any report of any candidate being stopped from sitting for the NECO exam in the South-East or any part of the country.\n“We are concluding the examinations next week with some papers,” he said.\nWhen asked what would happen if the candidates are unable to write today’s paper because of the IPOB stance, Sanni said if it happens, “the council would handle the situation appropriately”."
  },
  {
    "headline": "Ebonyi citizens to lose C of Os, undeveloped lands — State govt",
    "summarized_story": "By Peter Okutu, AbakalikiEBONYI State Government, Monday said it would revoke all Certificate of Occupancy, C of Os belonging to citizens of the State who failed to obey Government’s directives on recertification of all documents relating to their landed properties in the State.\nIt further threatened that defaulters would also have their undeveloped lands reallocated to other willing developers in the State.\n“Any C of O whether it was issued in 1960 till date is now invalid until it is recertified by the office of the SA to the Governor on Lands and Survey.\nThat’s why the new recertification is necessary at this time.\n“Failure to abide by this notice will result to revocation and reallocation of the said property.”"
  },
  {
    "headline": "Nigerian Army winning war on terror, banditry, says traditional ruler",
    "summarized_story": "Oba Adekunle Makama, the Olowu of Owu-Kuta, in Ayedire Local Government Area of Osun, says the Nigerian Army is winning the war on terror and banditry.\nOba Makama, who is also the Chairman of Council of Owu Obas, in a statement on Monday, expressed satisfaction with the number of insurgents’ surrendering to the Nigerian military powers.\nThe Olowu recalled that the Nigerian army recently announced that over 200 insurgents surrendered weapons in Borno.\n“We are all happy with the development and the sustained military onslaught on the shores of the Lake Chad and Sambisa Forest.\nThe traditional ruler urged the Nigerian Military to continue to rise above the situation for them to meet the expectations of Nigerians."
  },
  {
    "headline": "Banditry: NUJ urges Niger govt to ensure release of kidnap victims",
    "summarized_story": "Journalists in Niger State have tasked the state government and security agencies to secure the freedom of kidnap victims.\nIt prayed the government and relevant agencies to beef up its strategy to ensure the timely release of the state Commissioner for Information, Mohammed Sani Idris, who was picked from his Tafa home on Sunday night.\nAlso, it urged the government to secure the freedom of Niger State Zone C Chairman of All Progressives Congress (APC), Mallam Aminu Bobi, who was abducted on Saturday in his farm in Mariga Local Government Area.\nThe statement however commended the government and joint task force for the success stories so far in repelling armed bandits.\nWhile calling on everyone to be more vigilant, the Correspondents Chapel tasked residents to report any strange moves and suspected persons to the relevant agencies."
  },
  {
    "headline": "2023: Yahaya Bello shouldn’t even govern hellfire, he’s worst gov ever – Adeyanju",
    "summarized_story": "Abuja-based rights activist, Deji Adeyanju, has rubbished the endorsement of Governor Yahaya Bello of Kogi State for the presidency in 2023.\nYahaya Bello should not be allowed to govern even hellfire.\nThe Christian Youth Leadership Network had identified Bello as the right candidate to succeed President Muhammadu Buhari in 2023.\n“Governor Yahaya Bello, considering his leadership strides in Kogi State, fits in perfectly for such a role.\nTo this end, some presidential campaign posters of the Kogi State governor had been sighted in some states."
  },
  {
    "headline": "IPOB sit-at-home: Banks, schools, markets shut in Ebonyi as security operatives patrol",
    "summarized_story": "Ebonyi State has recorded an 80 percent compliance to the sit-at-home order declared by the Indigenous People of Biafra, IPOB, as banks and schools were shut down.\nDAILY POST gathered that major streets in Abakaliki metropolis were deserted by shop owners to avoid being hurt and property looted by hoodlums.\nAlso, transport depots located along afikpo road, fuel stations located along Enugu/Abakaliki expressway and many government and private institutions located at unity square were equally shut down.\n“This sit-at-home they are talking about has affected everything, as you can see, many people are going home and they are trying to avoid being hurt.\nDSP Loveth Odah, the Police Public Relations Officer, Ebonyi State Police Command, said “we have been on patrol since morning to make sure that there is no breakdown of law and order."
  },
  {
    "headline": "Sit-at-home order witnesses partial compliance in parts of Rivers",
    "summarized_story": "The sit-at-home order issued by the Indigenous people of Biafra witnessed a partial compliance in parts of Rivers State.\nIn Oyigbo local government area of the state, DAILY POST gathered that schools and businesses were under lock in compliance with the order.\nA reasident of the area who spoke to our correspondent said they were shocked to learn this morning that “economic activities were shut down with scanty movement of humans and vehicles”.\nOyigbo which is a border town between Rivers and Abia States is predominately occupied by the Igbo people.\nHowever, in Obio Akpor local government area of the state, there appeared to be no compliance as business activities were ongoing and schools opened for activities."
  },
  {
    "headline": "Ortom grants scholarship to four-year-old kidnap victim in Benue",
    "summarized_story": "The Benue State Government has offered a scholarship to a four-year-old boy, Eje Moses Alia Eloneje, from nursery to university level.\nGovernor Samuel Ortom made this known on Sunday at the Benue Peoples House, Makurdi, when Eloneje, kidnapped from Ochouri village in Konshisha Local Government Area of the state, was presented to him.\nWhile directing the State Commissioner for Education, Professor Dennis Ityavyar, to process the scholarship for immediate action, Governor Ortom said the child was a miracle, having been kidnapped and released unhurt.\nGovernor Ortom condemned the abduction and reaffirmed the resolve of his administration to fight crime in all ramifications.\nSenator representing Benue North East, Dr Gabriel Suswam, who was also present, condemned the act, describing it as unacceptable and pledged his support to Ortom to continue providing security for lives and property of Benue people."
  },
  {
    "headline": "BREAKING: U.S court postpones trial of suspended Abiodun’s aide to 2022",
    "summarized_story": "By Alao AbiodunThe fraud trial of suspended aide to Ogun Governor Abidemi Rufai, who was indicted for alleged conspiracy, wire fraud and aggravated identity theft, has been postponed to 2022, The Nation has gathered.\nA fresh ruling of the court has postponed the commencement of Rufai’s trial by five months.\nADVERTISEMENTRufai was arrested at the JFK airport in New York on May 14 over alleged $350,000 COVID-19 unemployment fraud in the United States.\nThe Nation had reported the prosecutor submitted 97,000-page materials at the U.S. District for the Western District of Washington at Tacoma, on July 26.\nThe trial, earlier scheduled to commence on August 31, has now been postponed to February 1, 2022."
  },
  {
    "headline": "BREAKING: Police bring Chidinma to magistrates' court",
    "summarized_story": "By Robert EgbeThe Lagos State Police Command has brought Chidinma Ojukwu, prime suspect in the murder of the Chief Executive Officer of Super TV, Usifo Ataga, to the Yaba Magistrates’ Court in Sabo, Lagos.\nOjukwu, a 21-year-old Mass Communication student of the University of Lagos, is being held in one of the courtroom holding cells.\nHowever, a court source told The Nation that the case is yet to be assigned and that the application might be heard in another courtroom.\nRead Also: Slain Super TV boss Usifo Ataga laid to rest amid tearsShe had been in a romantic relationship with 50-year-old Ataga for about four months before the incident.\nShe said someone probably entered the apartment when she left to get the things they needed, killed Ataga, scattered the place and left before her arrival."
  },
  {
    "headline": "Orji Kalu mourns business mogul, Okunbo",
    "summarized_story": "Agency ReporterThe Chief Whip of the Senate, Sen. Orji Kalu, has described the death of business mogul and chieftain of the APC, Idahosa Okunbo as a painful loss.\nKalu, in a condolence message issued on Monday in Abuja, acknowledged the contributions of the late philanthropist to the social, economic and political development of the country.\nWhile advising the family of the deceased to uphold the legacies of Okunbo, Kalu prayed for strength and peace for the deceased’s family.\nKalu noted that the late Okunbo was successful in all facets of life.\n“He will be greatly missed.”Kalu prayed to God to grant the late businessman eternal rest."
  },
  {
    "headline": "COVID-19: FG sets Aug 16 for phase 2 vaccination, gives reason",
    "summarized_story": "Agency ReporterThe Federal Government has announced a new date of Aug. 16 to begin administering the second batch of COVID-19 Moderna vaccines doses donated by the U.S.\nSpeaking on the programme monitored by the News Agency of Nigeria (NAN) in Abuja, the minister said the postponement of the vaccination exercise from Aug. 10 to Aug. 16 was “purely administrative’’.\n“We have received 4,80,000 doses of the Moderna vaccine and we will commence administering the doses on Monday Aug. 16.\n“The exercise was supposed to commence tomorrow Aug. 10, but we suspended it till Monday, and the reason is purely administrative.\n“I want to encourage Nigerians to come out also to take the Moderna vaccine."
  },
  {
    "headline": "BREAKING: IPOB sit-at-home cripples activities in Ebonyi",
    "summarized_story": "From Chijioke Agwu, AbakalikiThe sit at home order of the Indigenous People of Biafra(IPOB),to protest the detention of it’s leader, Mazi Nnamdi Kanu,by the DSS has crippled activities in Abakaliki.\nOur Correspondent who visited some parts of the state at about 10:am observed that people were complying to the order.\nSecurity agents in patrol vans have been patroling the town to ensure that people were not harrased for coming out for their normal businesses even as some parts of the city were totally deserted.\nBellow are pictures of Margret Umahi International Market and a section of the Abakaliki-Ogoja highway looking completely deserted.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Police take over APC headquarters",
    "summarized_story": "From Romanus Ugwu, AbujaThe headquarters of the All Progressives Congress (APC) was practically a battlefield in the early hours of Monday, as policemen, loaded in over five Hillux Patrol Vans took over the party secretariat.\nThe police team numbering over 30 had strategically positioned themselves within the secretariat along Blantyre street, without harassing passersby and the motorists using the street.\nOn inquiry from one of the security details attached to the party secretariat, our correspondent gathered that the security agents acted on security report that certain persons have been mobilised to stage demonstration at the party secretariat on Monday.\n“You don’t expect the party’s national leadership to fold their hands in the face of such threatening security report.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Sit-at-home: 2 killed in Nnewi",
    "summarized_story": "From David Onwuchekwa, NnewiTwo persons were reportedly killed in Nnewi, Anambra State on Monday as there was one hundred percent compliance to the Indigenous People of Biafra (IPOB)’s ordered sit-at-home.\nEyewitnesses said they heard gun shots at Izuchukwu Junction as early as 6:00 am only to come out to see two lifeless bodies of young men.\nBut nobody could explain who shot them.\nEven the roads and major streets are vacated.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Gunmen abduct Niger State Commissioner for Information",
    "summarized_story": "From John Adams, MinnaNiger State Commissioner for Information and Strategy, Mallam Idris Mohammed has been abducted by gunmen and taken to an unknown destination.\nThe Commissioner was abducted by heavily armed men suspected to be bandits from his residence at Baban Tunga, Tafa local government area of the state on Sunday night.\nThe gunmen said to be numbering about 20, stormed the residence of the Commissioner at about 11;00am under a heavily downpour and shot sporadically into the air before abducting their victim in front of his second wife.\nAccording to a source close to the family, the commissioner was whisked away under the heavily rain, and abductors are yet to make any contact with the family as at the time of filing this report.\nDetail Shortly…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Judgment day for Secondus as govs, elders decide fate",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaIt’s judgment day for embattled National Chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, as governors and elders of the party meet to iron out grey areas rocking the opposition party, including calls for his sack by some party faithful.\nDaily Sun gathered that the governors would, however, go into the meeting, sharply divided on the calls for his removal.\nYet, another set of governors, with presidential ambitions in 2023, want the national chairmanship position zoned out of their regions.\n“With a divided house, the governors are expected to meet this evening, brief concerned elders peers of the party.\nHowever, a member of the Concerned Elders forum of the PDP, who also spoke on the condition of anonymity, yesterday, said even the forum is also divided on Secondus’ stay as national chairman."
  },
  {
    "headline": "Breaking: Gunmen Kidnap Niger Information Commissioner",
    "summarized_story": "By Laleye DipoUnknown gunmen have kidnapped the Niger state Commissioner for Information Alhaji Mohammed Sani Idris.\nIdris was kidnapped on Sunday in his countryhome in the Tafa local government Area of Niger state.\nDetails of his abduction are still sketchy but the Secretary to the state government Alhaji Ibrahim Ahmed Matane confirmed the incident saying the commissioner was picked from his house.\n“The gunmen forced themselves into his house at Babantunga in Tafa local government area from where he was abducted.\nBobi was picked by yet unknown gunmen from his farm in Mariga local government area of the state."
  },
  {
    "headline": "2023: Who Leads Nigeria?",
    "summarized_story": "He is the first Nigeria to be elected AfDB President and hails from Ogun State in South-west Nigeria.\nSaraki worked as a medical officer at Rush Green Hospital, Essex and had been a Director of Société Générale Bank (Nigeria) Limited.\nAn economics professor and former Central Bank of Nigeria Governor, he is presently the factional gubernatorial candidate of the All Progressives Grand Alliance.\nHe also attended Kellogg graduate school of Management, USA, Oxford University: Said business school and Cambridge University’s George business school.\nBut, again, apart from fitting the bill of the president Nigeria needs, Amaechi is one of the few actors, who have not hidden their desire to be president."
  },
  {
    "headline": "Ogala: Why APC Congresses Remain a Nullity in Eyes of Law",
    "summarized_story": "In his first view, he recommended the reinstatement of the dissolved National Working Committee (NWC) without the former National Chairman, Adams Oshiomhole, because his suspension followed due process.\nYet, in his second legal opinion, he reiterated his conviction that the congresses of APC remained a nullity in the eyes of the law.\n“In another breath, those who compare APC to a club, or an association of elected officers miss the point completely.\n“Without a doubt, many may feel they maintain an advantage today, because of their access and control of levers of the APC.\nThe PDP constitution clearly stated that the tenure of all NWC members are four years guaranteed."
  },
  {
    "headline": "With Planned Dividend Payout, NNPC Prepares for Life Outside FG’s Control",
    "summarized_story": "“And I can tell you, within the next month or two maximum, we will publish our statement of accounts for 2020.\n“Only a discerning analyst would have raised his eyebrow when the NNPC announced its intention to pay its first dividend in September 2021.\nFor the period of April 2020 to April 2021, NNPC noted that a total of 2,902.52bcf of gas was produced, representing an average daily production of 7,369.76mmscfd during the period.\n“Period-to-date production from Joint Ventures (JVs), Production Sharing Contracts (PSCs) and NPDC contributed about 62.07 per cent, 19.95 per cent and 17.98 per cent respectively to the total national gas production.\nAccording to the national oil company, a total of 795mmscfd was delivered to gas-fired power plants in the month of April 2021 to generate an average power of about 3,416 MW."
  },
  {
    "headline": "FG Begins Implementation of CBN’s N250bn Gas Expansion Fund",
    "summarized_story": "He stated that the fund was available to finance the establishment of gas processing plants and small-scale petrochemical plants, gas cylinder manufacturing plants, Compressed Natural Gas (CNG) regasification modular systems, automatic conversion kits or components manufacturing plants, CNG primary and secondary compression stations, as well as micro distribution outlets and service centres of liquefied petroleum gas (LPG) sales.\nAccording to Nabasu, the fund would equally provide leverage for additional private sector investments in the domestic gas market, boost employment across the countrh and fast-track the development of gas-based industries, particularly petrochemical (fertiliser and methanol, among others).\nThis is with a view to supporting large industries such as agriculture, textile and related industries.\nThe SMEs support portion, she disclosed, has a limit of N50 million, broken into start-ups and experienced applicants.\nAccording to her, some preferential treatment would be accorded indigenous companies as well as gender-based considerations for companies in the SMEs’ category."
  },
  {
    "headline": "BREAKING: Son Of Nigeria's Ex-President Yar'Adua Remanded For Killing Four Persons, Secretly Released From Prison",
    "summarized_story": "Aminu Yar'Adua, son of Nigeria's former president, the late Umar Yar'Adua, who was recently remanded in prison for killing four persons, has been secretly released.\nSaharaReporters had reported that Aminu was remanded in prison custody last Thursday, after he was arraigned following charges bordering on dangerous driving.\nHe was alleged to have knocked down six persons, killing four, including a two-year-old boy on June 23, 2021.\nHowever, SaharaReporters reliably gathered that Aminu was secretly released from the Yola Correctional facility on Friday, the following day.\nThe late Aisha Umar, one of the victims, was a journalist with the Voice of Arewa, an online radio and television platform."
  },
  {
    "headline": "BREAKING: Son Of Nigeria's Ex-President Yar'Adua Remanded For Killing Four Persons, Secretly Released From Prison",
    "summarized_story": "Aminu Yar'Adua, son of Nigeria's former president, the late Umar Yar'Adua, who was recently remanded in prison for killing four persons, has been secretly released.\nSaharaReporters had reported that Aminu was remanded in prison custody last Thursday, after he was arraigned following charges bordering on dangerous driving.\nHe was alleged to have knocked down six persons, killing four, including a two-year-old boy on June 23, 2021.\nHowever, SaharaReporters reliably gathered that Aminu was secretly released from the Yola Correctional facility on Friday, the following day.\nThe late Aisha Umar, one of the victims, was a journalist with the Voice of Arewa, an online radio and television platform."
  },
  {
    "headline": "VIDEO: What IPOB Leader, Nnamdi Kanu Told Us In DSS Custody—#Dunamis5 Activist Opens Up",
    "summarized_story": "You may also like"
  },
  {
    "headline": "VIDEO: What IPOB Leader, Nnamdi Kanu Told Us In DSS Custody—#Dunamis5 Activist Opens Up",
    "summarized_story": "You may also like"
  },
  {
    "headline": "VIDEO: What IPOB Leader, Nnamdi Kanu Told Us In DSS Custody—#Dunamis5 Activist Opens Up",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Tension as police surround APC HQ in Abuja",
    "summarized_story": "The police have deployed their personnel in the headquarters of the All Progressives Congress (APC) in the federal capital territory (FCT).\nAdvertisementThe development sparked tension around the APC national secretariat, recently christened Muhammadu Buhari House.\nAdvertisementAfterwards, the ruling party issued a notice, saying John Akpanudoedehe, national secretary of the caretaker, will explain to journalists why there is a heightened security presence at the secretariat.\n“NOTICE: The National Secretary will brief the media on increased security presence at the Party’s National Secretariat.\nAccording to him, the apex court queried the legality of Buni to lead the party, nominate candidates for elections and conduct the just-concluded congresses."
  },
  {
    "headline": "Tension as police surround APC HQ in Abuja",
    "summarized_story": "The police have deployed their personnel in the headquarters of the All Progressives Congress (APC) in the federal capital territory (FCT).\nAdvertisementThe development sparked tension around the APC national secretariat, recently christened Muhammadu Buhari House.\nAdvertisementAfterwards, the ruling party issued a notice, saying John Akpanudoedehe, national secretary of the caretaker, will explain to journalists why there is a heightened security presence at the secretariat.\n“NOTICE: The National Secretary will brief the media on increased security presence at the Party’s National Secretariat.\nAccording to him, the apex court queried the legality of Buni to lead the party, nominate candidates for elections and conduct the just-concluded congresses."
  },
  {
    "headline": "FG to begin phase two of COVID-19 vaccination August 16",
    "summarized_story": "The federal government says it will begin administering the second batch of COVID-19 vaccine doses on August 16.\nThe federal government received over four million doses of the Moderna COVID-19 vaccine from the United States on August 1.\nAdvertisementSpeaking on the programme, the minister said the vaccination exercise will now begin on August 16, adding that the postponement was “purely administrative’’.\n“We have received 4,80,000 doses of the Moderna vaccine and we will commence administering the doses on Monday Aug. 16,” he said.\n“I want to encourage Nigerians to come out also to take the Moderna vaccine.”"
  },
  {
    "headline": "FG to begin phase two of COVID-19 vaccination August 16",
    "summarized_story": "The federal government says it will begin administering the second batch of COVID-19 vaccine doses on August 16.\nThe federal government received over four million doses of the Moderna COVID-19 vaccine from the United States on August 1.\nAdvertisementSpeaking on the programme, the minister said the vaccination exercise will now begin on August 16, adding that the postponement was “purely administrative’’.\n“We have received 4,80,000 doses of the Moderna vaccine and we will commence administering the doses on Monday Aug. 16,” he said.\n“I want to encourage Nigerians to come out also to take the Moderna vaccine.”"
  },
  {
    "headline": "Peter Obi: South-east needs to convince Nigeria why it should produce Nigeria's next president",
    "summarized_story": "Peter Obi, vice-presidential candidate in the 2019 general election, says the south-east needs to present a “convincing argument” to the rest of Nigeria on why the region should produce the next president.\nAdvertisementAfter a meeting in Lagos in July, southern governors resolved that the country’s next president should come from the region.\nSpeaking with Arise TV on Monday, Obi said though the south-east has compelling points, it must embrace the politics of “engagement and consultation, and not confrontation”.\nWe are not going to hold a gun in their head and say you must come here,” he said.\nBecause these are major parties with a lot of members and stakeholders who will sit down and discuss at round tables."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "The Ghanaian attraction, Decagon’s seed round, yet another name change, MTN Nigeria at 20",
    "summarized_story": "With that move, the company signalled its intentions to increase its sphere of influence outside the shores of Nigeria.\nPer TechCrunch, Nwobi says the company aims to address the underrepresentation of black people in tech globally, starting with Nigeria.\nAccording to Premium Times, Onu says it was necessitated by Buhari’s approval of the National Science, Technology and Innovation Roadmap (NSTIR 2017-2030).\nThe new name is to reflect the spirit of the document — driving positive socio-economic outcomes through science, technology, and innovation in all activities of the economy.\nHe said the name change was to facilitate economic growth and global competitiveness and make Nigeria a nation of innovators."
  },
  {
    "headline": "Nigerian IT company, Decagon, raises $1.5 million seed round to train software engineers",
    "summarized_story": "Share this article:Nigerian IT company, Decagon, has raised $1.5 million in a seed round to support its mission of transforming exceptional software engineers, many of whom come from underrepresented backgrounds.\nKepple Africa and Timon Capital led the round, with investments from Paul Kokoricha — ACA Managing Partner — and Tokyo-based UNITED Inc.Additionally, it has raised a $25 million student loan financing facility.\nAdvertisementFounded in 2018 by Chika Nwobi (CEO), Decagon trains and connects engineers to work remotely with local and international companies.\nHowever, if the trainees cannot afford the programme, student loan financing will cover the cost.\nDecagon claims to be the first in Nigeria to provide students with such merit-based loan financing."
  },
  {
    "headline": "MainOne’s new data centre could usher in exciting connectivity age in Ghana",
    "summarized_story": "MainOne is not resting on its laurels, as MDXi announced its data centre facility expansion to Appolonia City in Greater Accra, Ghana.\nMainOne’s data centre launch in GhanaMainOne’s past initiatives suggest launching its data centre in Ghana as a natural progression that aligns with its connectivity ambitions.\nIt reportedly features private data centre suites, precision cooling, and enterprise-grade 24×7 multi-level security and video surveillance.\nAfricanus Mensah, Chairman, MainOne Ghana, believes that the data centre will impact Ghana’s business growth and human capital development.\nWhile MainOne’s data centre could offer several benefits for businesses and individuals in Ghana, this is only one part of the puzzle."
  },
  {
    "headline": "Obaseki celebrates Urhoghide at 66, says Senator was instrumental to his re-election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has hailed the Senator representing Edo South Senatorial District, Senator Matthew Urhoghide, for his role in his re-election.\nThe governor made the remarks at a reception in celebration of Senator Urhoghide’s 66th birthday anniversary in Benin City.\nI am in the Peoples Democratic Party (PDP) and the governor of Edo State today largely because of his efforts and persuasion.\n“Senator Urhoghide said to me, because of you, I am not going to contest.\n“For the first time in our history, every local government in Edo South came together and voted as one."
  },
  {
    "headline": "Obaseki hails Archbishop Akubeze, salutes contribution to state’s devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has celebrated the Catholic Archbishop of Benin Archdiocese, His Grace, Most Rev.\nDr. Augustine O. Akubeze on his tenth year anniversary as an Archbishop, saluting his contributions to the development of Edo State and Nigeria.\nPhilip Shaibu; Secretary to the State Government, Osarodion Ogie, former Governor of Cross Rivers State, Donald Duke; Chief of Staff to Edo State Governor, Osaigbovo Iyoha and the Esama of Benin, Chief Gabriel Igbinedion.\nOgbeide Ihama and a former National Chairman of the All Progressives Congress (APC), Chief John Odigie Oyegun, among others.\nUnveiling the book titled, “Exercise of Prophetic Ministry, selected Homilies and Addresses of Archbishop Akubeze,” the governor hailed the Archbishop for his sacrifice and selfless service to God and humanity."
  },
  {
    "headline": "World Breastfeeding Week: Edo mobilizes community leaders, caregivers, others on sensitization drive – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged community leaders and caregivers to intensify efforts in raising awareness on the importance of breastfeeding, which provides infants with best start to life.\nAddressing journalists in Benin City, the Executive Secretary, Edo State Primary Health Care Development Agency (EDSPHCDA), Dr. (Mrs).\nBreastfeeding is a fundamental intervention for growth and development of children,” the health expert added.\nErhabor further urged parents, caregivers, and community leaders to make the breastfeeding week celebration count for every mother and child in the community, noting, “Breastfeeding is of great benefit to the baby, the mother, family, community and the nation.\n“At the community level, breastfeeding helps to reduce poverty which is in line with UN SDGs for 2030 – No poverty."
  },
  {
    "headline": "Obaseki constitutes 8-man steering c’ttee to establish Edo Diaspora Agency – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has constituted an 8-man steering committee chaired by the State Head of Service, Anthony O. Okungbowa Esq., to oversee the establishment of the Edo State Diaspora Agency.\nIn a statement, Secretary to Edo State Government, Osarodion Ogie Esq., said Governor Obaseki approved the appointment of the State Head of Service, Anthony O. Okungbowa Esq.\nas Chairman of the Steering Committee, while Mr. Isaac Ebewele will serve as Secretary.\nOther members of the committee are: the Ambassador of the African Bar Association for East, Central and Southern Africa, Ambassador Adesuwa Matthew Beeki Uwaifo; Dr. Loretta Oduware Ogboro-Okor; Mr. Chris Osarumwense, and Mr. Soni Irabor.\nOthers include President, Nigerians in Diaspora Organisation (NIDO), Dr. Johnson Odibo and Prof. Isa Odili."
  },
  {
    "headline": "Kidnappers raid Kwara communities, escape with six victims",
    "summarized_story": "Six persons were kidnapped in two incidents on Saturday in Kwara, with the kidnappers escaping with the victims despite being chased by the police, local hunters and vigilantes.\nThe police spokesperson in the state, Ajayi Okasanmi, confirmed the development in a press statement on Sunday.\nAnxiety in Kwara SouthKwara State is relatively safer than neighbouring Niger State, where mass abduction and kidnapping are rampant.\nSituation is under control, the good people of Kwara State are advised to go about their lawful businesses without any fear of molestation and atttack.\nSp Okasanmi AjayiPolice Public Relations OfficerKwara State Police CommandFOR: COMMISSIONER OF POLICEKWARA STATE COMMAND."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Bandits kidnap Niger commissioner, Sanni Idris from his home",
    "summarized_story": "Bandits have kidnapped Niger state Commissioner for information, Alhaji Muhammed Sanni Idris.\nReports say he was taken from his home town Baban Tunga in Tafa local government area of the state, in the early hours of Monday.\nSecretary to the Government of Niger state, Alhaji Ahmed Ibrahim Matane, confirmed the abduction, saying it happened around 1am.\n“He was kidnapped in the early hours of today around 1am at Baban tunga in Tafa local government.\nPolice spokesperson in Ekiti State, Sunday Abutu, confirmed the incident and said one suspect has been arrested."
  },
  {
    "headline": "APC convention fallout How much can Osinbajo do?",
    "summarized_story": "The crisis since the ward congress has heightened and it has further divided the party.\nWhat actually saved the APC in that judgment was that technical ground that Jegede had failed to join Buni in the suit.\nMai Mala Buni as a sitting Governor to run the affairs of the APC as Chairman of the Caretaker Committee.\nIt was said that Professor Osinbajo took an informed position after analysing the Supreme Court judgement on the Ondo governorship election and his stand has remained the same.\nIn his reaction to the legality of Buni’s leadership of the party David Umahi, governor of Ebonyi state, has said the caretaker committee of the All Progressives Congress (APC) is constitutional."
  },
  {
    "headline": "Anambra 2021: Determined Ozigbo pushes to upstage troubled APGA",
    "summarized_story": "“Ozigbo is another Peter Obi,” said Mr. Oliver Nwafor, a political enthusiast based in Awka, the state capital.\nThe PDP candidate, barring other intra-party controversies, will now focus on the ultimate prize; the goal of beating other candidates on November 6.\n“Ozigbo is popular, also based on the popularity of his party, the PDP,” said Chidi Odogwu, a business owner in Onitsha.\nBut it is one which Soludo and Ozigbo stand shoulders higher above the rest, as the two leading candidates.\n“I think the battle is actually going to be between Soludo and the Ozigbo; that is between APGA and PDP,” said Mr. Okeke."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "JUST-IN: Troops Foil Terrorists Attack On Damboa",
    "summarized_story": "The Nigerian Army said troops of 25 Task Force Brigade, Operation HADIN KAI in the North-East successfully foiled a dawn attack by Boko Haram and Islamic State of West Africa Province terrorists on Damboa town on Sunday.\nHe said the terrorists suffered debilitating gunshot wounds from troops’ fire while attempting to infiltrate the town with unconfirmed numbers of foot soldiers and some mounted on motorcycles, forcing them to beat the retreat in disarray.\nADVERTISEMENTHe said while the troops were currently on the trail of the fleeing terrorists, however, in the exchange of fire that ensued, two vehicles belonging to the Civilian Joint Task Force were razed by fire.\nThe Army spokesperson, therefore, assured the law abiding people of North-East of the Chief of Army Staff’s determination to finally rout the Boko Haram/Islamic State West Africa Province criminals from their hideouts.\nHe further called on the people of the region to continue to avail the troops with actionable information that will enhance the execution of the ongoing Counter Terrorism/Insurgency operations in the area."
  },
  {
    "headline": "JUST-IN: Troops Foil Terrorists Attack On Damboa",
    "summarized_story": "The Nigerian Army said troops of 25 Task Force Brigade, Operation HADIN KAI in the North-East successfully foiled a dawn attack by Boko Haram and Islamic State of West Africa Province terrorists on Damboa town on Sunday.\nHe said the terrorists suffered debilitating gunshot wounds from troops’ fire while attempting to infiltrate the town with unconfirmed numbers of foot soldiers and some mounted on motorcycles, forcing them to beat the retreat in disarray.\nADVERTISEMENTHe said while the troops were currently on the trail of the fleeing terrorists, however, in the exchange of fire that ensued, two vehicles belonging to the Civilian Joint Task Force were razed by fire.\nThe Army spokesperson, therefore, assured the law abiding people of North-East of the Chief of Army Staff’s determination to finally rout the Boko Haram/Islamic State West Africa Province criminals from their hideouts.\nHe further called on the people of the region to continue to avail the troops with actionable information that will enhance the execution of the ongoing Counter Terrorism/Insurgency operations in the area."
  },
  {
    "headline": "APC Chairmanship: Gololo Warns Against Choice Of Yari, Sheriff",
    "summarized_story": "A chieftain of the All Progressives Congress (APC), Dr Garus Gololo, has cautioned the party’s leadership and other stakeholders to be on their guard as the party’s national convention approaches.\nGololo said that the warning has become necessary in view of the calibre of people rooting for the position of the national chairman of the APC.\nADVERTISEMENTHe noted that it was morally wrong for a former Zamfara State governor, Abdulaziz Yari, to aspire to be the national chairman of the party after “refusing” to recognise the tenure of the former national chairman, Adams Oshiomole.\nHe’s no good news for APC if the party is to retain power in 2023,” Gololo said.\nIs he aiming to repeat in APC what he did in PDP?,” Gololo queried."
  },
  {
    "headline": "APC Chairmanship: Gololo Warns Against Choice Of Yari, Sheriff",
    "summarized_story": "A chieftain of the All Progressives Congress (APC), Dr Garus Gololo, has cautioned the party’s leadership and other stakeholders to be on their guard as the party’s national convention approaches.\nGololo said that the warning has become necessary in view of the calibre of people rooting for the position of the national chairman of the APC.\nADVERTISEMENTHe noted that it was morally wrong for a former Zamfara State governor, Abdulaziz Yari, to aspire to be the national chairman of the party after “refusing” to recognise the tenure of the former national chairman, Adams Oshiomole.\nHe’s no good news for APC if the party is to retain power in 2023,” Gololo said.\nIs he aiming to repeat in APC what he did in PDP?,” Gololo queried."
  },
  {
    "headline": "APC Govs Pass Vote Of Confidence On Buni-led CECPC",
    "summarized_story": "Governors elected on the platform of the All Progressives Congress (APC) rose from a meeting late Sunday night, where issues affecting the party were on the front burners.\nTop on the list was the recent Supreme Court judgement on the Ondo governorship poll, which received commendation from the APC governors.\nADVERTISEMENTThe meeting, which took place at the Kebbi Governor’s Lodge, Asokoro, Abuja, was chaired by the chairman of the Forum, Governor Atiku Bagudu of Kebbi State.\nThe APC governors further commended the Supreme Court on the historic judgement which has given an expected legal backing to the CECPC of the party.\nThe all-important backing by the Progressives Governors Forum will serve as confirmation of the governors’ determination to back the party through repositioning and strengthening it as its structures are taking shape through the ongoing gongresses."
  },
  {
    "headline": "VIDEO: BBNAIJA6: YERINS, NIYI, BEATRICE EVICTED, AS FOUR NEW HOUSEMATES MAKE SURPRISE ENTRY",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: BBNAIJA6: YERINS, NIYI, BEATRICE EVICTED, AS FOUR NEW HOUSEMATES MAKE SURPRISE ENTRY",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Again, seven wedding guests, six others abducted in Kwara",
    "summarized_story": "No fewer than 13 people, including seven wedding guests, a pastor and his wife were abducted in two kidnapping incidents that occurred between Kwara-Ekiti axis on Saturday evening.\nPolice sources said that seven guests who were returning to Ilorin from a wedding in Ekiti State in a Sienna bus were accosted by kidnappers at a point between Oke-Onigbin and Omu-Aran in Irepodun Local Government Area of Kwara State about 5.35pm on Saturday.\nThe second incident happened between Ekan-Meje in Oke-Ero Local Government Area of Kwara State and Ekiti State which involved a pastor and his wife as well as four other persons.\nPublic Relations Officer in Kwara State Police Command, SP Ajayi Okasanmi, confirmed the two kidnapping incidents but said that nine victims of the two incidents were rescued.\n“The abductors were instantly chased into the bushes, four out of the seven abducted persons were rescued, efforts are still in top gear to get the remaining three rescued."
  },
  {
    "headline": "Again, seven wedding guests, six others abducted in Kwara",
    "summarized_story": "No fewer than 13 people, including seven wedding guests, a pastor and his wife were abducted in two kidnapping incidents that occurred between Kwara-Ekiti axis on Saturday evening.\nPolice sources said that seven guests who were returning to Ilorin from a wedding in Ekiti State in a Sienna bus were accosted by kidnappers at a point between Oke-Onigbin and Omu-Aran in Irepodun Local Government Area of Kwara State about 5.35pm on Saturday.\nThe second incident happened between Ekan-Meje in Oke-Ero Local Government Area of Kwara State and Ekiti State which involved a pastor and his wife as well as four other persons.\nPublic Relations Officer in Kwara State Police Command, SP Ajayi Okasanmi, confirmed the two kidnapping incidents but said that nine victims of the two incidents were rescued.\n“The abductors were instantly chased into the bushes, four out of the seven abducted persons were rescued, efforts are still in top gear to get the remaining three rescued."
  },
  {
    "headline": "New UN climate report hits Nigeria's economic jugular",
    "summarized_story": "Agency ReportThe UN new climate report has flagged two major sectors of Nigeria’s economy: cattle farming and the oil and gas industry.\nTo save the planet, scientists want countries involved in the two sectors to curb methane gas emission associated with them.\nThey also declared that cutting methane emissions is a much faster route to reduce global warming than cutting carbon emissions.\nThis year, scientists are urging a focus on another potent greenhouse gas – methane – as the planet’s best hope for staving off catastrophic global warming.\nThe EU is proposing laws this year that will force oil and gas companies to monitor and report methane emissions and to repair any leaks."
  },
  {
    "headline": "Edo Deputy Governor Shaibu: I'm sad, in great shock",
    "summarized_story": "By Imelda OsayandeEdo Deputy Governor, Comrade Philip Shaibu, has expressed sadness over the demise of business mogul, Capt.\nShaibu in a statement he personally signed on Sunday in Benin said he received the news of Okunbo’s demise with sadness and great shock.\nShaibu described Okunbo as a renowned business guru who made a remarkable impact that earned him recognition across the worldAccording to the deputy governor, Edo had lost a treasure.\nShaibu said the late Okunbo was a true son of the soil who stood for what he believed in and left no stone unturned in his determination to making life better for his people.\nLate Okunbo, father-in-law to the Olu of Warri-designate succumbed to pancreatic cancer in a London hospital in the early hours of Sunday."
  },
  {
    "headline": "Why Kenya ‘Extradited’ Nnamdi Kanu To Nigeria Instead Of UK -Lawyer",
    "summarized_story": "Aloy Ejimakor, the lawyer for Nnamdi Kanu, the leader of the Indigenous People of Biafra, has complained that Nigeria tricked Kenya into expelling the separatist.\nEjimakor, in a statement he signed entitled: “Kanu is technically still in Kenya,” said it was dubious that Kenya attributed Kanu’s citizenship to Nigeria because it’s his place of birth.\nDual national or not, Kanu departed Britain and travelled to Kenya as a British citizen and Kenya admitted him as such.\nBecause Kanu presented himself to Kenya as a British citizen, not a Nigerian citizen or even a dual citizen.\nIn international law, it was clearly a three-way immigration contract between Kanu, Britain and Kenya."
  },
  {
    "headline": "BREAKING: Chidinma In Court Over Alleged Murder Of Super TV Boss",
    "summarized_story": "NEWS DIRECT has learned that the arraignment of Chidinma Ojukwu, 21, the principal suspect in the murder of Super TV Chief Executive Officer Usifo Ataga, would begin at the Yaba Magistrate Court in Lagos State.\nOjukwu, a University of Lagos 300-level Mass Communication student, is currently in court and will be arraigned alongside two other defendants in the case.\nShe confessed to stabbing Usifo with a knife under the influence of alcohol and withdrawing N380,000 from the victim’s account with his ATM card.\nShe, however, backtracked later in a video, absolving herself from the murder.\nUsifo, aged 50, was buried on July 30 in a low-key ceremony attended by his family members, including his wife, and friends."
  },
  {
    "headline": "2 Dead As IPOB’s Sit-At-Home Turns Bloody In Nnewi",
    "summarized_story": "Early Monday, the IPOB-led sit-in turned murderous in Nnewi, with two individuals killed in a fight between the Army and suspected IPOB members.\nAccording to an eyewitness, the terrible tragedy occurred at the Izuchukwu junction region of the Nnewi roundabout, where the fatalities included an IPOB leader and a commercial biker.\nThe eyewitness said that the two victims were actually killed by gunshots from the unidentified soldiers, who quickly took off immediately after they fell to their bullets.\nSome vehicles were also smashed by aggrieved persons over the attack on the civilians by armed soldiers.\nThe Police Public Relations Officer, PPRO, for Anambra State command Mr. Tochukwu Ikenga, could not be reached to confirm the deaths."
  },
  {
    "headline": "BREAKING: Police Take Over APC Headquarters In Abuja",
    "summarized_story": "The All Progressives Congress (APC) secretariat was turned into a battleground in the early hours of Monday, as policemen arrived in over five Hillux Patrol Vans to take control of the party’s headquarters.\nThe police force, which numbered over 30 officers, had deliberately positioned itself within the secretariat along Blantyre Street to avoid bothering passers-by and cars.\nAlthough the presence of the police brought back memories of Comrade Adams Oshiomhole’s dark days as the previous National Chairman of the APC National Working Committee (NWC), the difference is that they were not subjected to any excessive harassment by security officers.\nOur correspondent learned from one of the party secretariat’s security details that the security agents acted on a security report that some individuals had been mobilized to organize a demonstration at the party secretariat on Monday.\n“You don’t expect the party’s national leadership to fold their hands in the face of such threatening security report."
  },
  {
    "headline": "Breaking: 2 dead, 3 vehicles burnt over IPOB’s sit-at-home order in Imo, Aba grounded",
    "summarized_story": "Blueprint gathered that two of the vehicles were inter state mass transit buses owned by a company, while the other was a Siena vehicle which were identified as the only vehicles plying the Mbaise-Umuahia road early morning.\nAs at the time of filing this report, the Imo state Police Command had not responded to this development but the video has continued to go viral.\nMeanwhile, the stay-at-home order has partially grounded the state.\nAlso on the roads in Southeast cities, a few vehicles were plying the road while many people were seen walking on the roads and streets amidst fear and anxiety.\nFrom, Aba, comes a report that the sit-at-home order has grounded the commercial city located in Abia state, home state of acclaimed IPOB leader, Nnamdi Kanu."
  },
  {
    "headline": "VIDEO: What Beatrice said after exiting BBNaija season 6 show",
    "summarized_story": "NextKyari: Left on the brink for too long"
  },
  {
    "headline": "VIDEO: Watch as evicted BBNaija ‘s Yerins speaks",
    "summarized_story": "NextVIDEO: What Beatrice said after exiting BBNaija season 6 show"
  },
  {
    "headline": "No instruction to repel invaders allegation in Plateau is false, malicious -NigPilot",
    "summarized_story": "The allegation that troops of OPSH told residents that they had no instruction to repel invaders during attacks on some communities in Bassa LGA of Plateau State is false, unfounded, and malicious.\n“For the records, OPSH deploys in a joint operation involving all security agencies whose mandate is to bring lasting peace on the Plateau and environs.\n“It is also important to stress that prior to deployment, troops are adequately briefed on their expectations for operations in the realization of OPSH mandate.\nCurrently, the Commander OPSH has ordered the beefing up of security and increased patrols to safeguard all troubled areas to prevent recurrence of such sad incidents”.\nThe statement, therefore, enjoined all law-abiding citizens to cooperate with the security agencies by providing credible information that would aid the security agencies in performing their duties."
  },
  {
    "headline": "FG inducts over 3000 environmental Health officers to improve services -NigPilot",
    "summarized_story": "Minister, Federal Ministry of Environment, Dr. Mohammad Mahmood Abubakar has inducted over 3000 Environmental Health personnel to enhance environmental services and improve the general health condition of Nigerians.\nThe Minister said the profession of Environmental Health is important to Nigeria’s quest of meeting the targets of the Sustainable Development Goals, adding that every professional must ensure contributing their quota in the nation-building.\nAccording to him, the relevance of Environmental Health in controlling communicable and contagious diseases in Nigeria cannot be over-emphasized.\nAmong the officers inducted include Environmental Health officers, Environmental health technicians, Environmental Health assistance, cleaning services, waste control services, sewage collection and disposal services, and pest control.\nNigerian Pilot, gathered that the Minister of Environment during the Summit, performed three tasks which include: The flag-off of the Environmental Health practice monitoring program; the launch of the Environmental Health Emergency Response Volunteer Scheme, and the unveiling of the Digital-based Service Delivery portal."
  },
  {
    "headline": "AA denies Etiaba as Anambra guber candidate -NigPilot",
    "summarized_story": "Action Alliance, AA, has denied Chief Ben Etiaba as its governorship candidate for November 6, 2021, Anambra governorship election.\nAccording to the statement, “The attention of the National leadership of our great Party Action Alliance AA has been drawn to fake news going round that one CHIEF BEN ETIABA is the candidate of Action Alliance AA for the upcoming November 2021 Anambra state governorship elections.\n“That is not correct; it’s misleading and should be disregarded by the party faithful across Nigeria and the general public.\nThe “Only legitimate and authentic Action Alliance, AA, governorship candidate for the upcoming Anambra State governorship elections remains John Okechukwu Ikeotuonye, and the party has not substituted him with anybody because John Okechukwu Ikeotuonye has the capacity to deliver the dividend of democracy to the good people of Anambra state and Action Alliance AA leadership at all levels have confidence in him.\n“We vehemently disclaim one Chief Ben Etiaba as the candidate of Action Alliance for the upcoming Anambra State governorship elections because he is Not a member of our party.”"
  },
  {
    "headline": "Ahead of A/Court verdict: History beckons as renowned academic set to become Anambra Deputy Governor",
    "summarized_story": "People of Anambra State are hopeful and praying that the Court of Appeal, Kano, will affirm Jude Okeke as the national chairman of the All Progressives Grand Alliance, APGA.\nChukwuma Umeoji will be further confirmed as the governorship candidate of the party in the election slated for November 6.\n“A favourable verdict of the Court of Appeal for Okeke will in no small measure consolidate Umeoji’s candidature.\n“That favourable judgement will offer the people of the state the opportunity of having a beautiful, youthful, charming and intelligent university don and widow from Awka South as their next deputy governor.\n“He is therefore expected to bring his business acumen to bear on the economy of Anambra State by the time he emerges the governor."
  },
  {
    "headline": "Secondus Asked To Resign As PDP Governors Meet In Abuja",
    "summarized_story": "A caucus of the Peoples Democratic Party at the House of Representatives have asked their party’s National Chairman, Uche Secondus, to “honourably” resign from his position.\nAt the PDP National Secretariat on Monday, some party members also held placards calling for Secondus’ resignation.\nThe calls for Secondus’ resignation come as PDP Governors met in Abuja on Monday to discuss recent events that threaten the unity and existence of the party.\nAt least seven principal officers of the party have resigned from the party in recent weeks, although two later withdrew their resignation letters after a meeting of the Board of Trustees.\nThe PDP has also lost the Governors of Ebonyi, Cross River, and Zamfara to the All Progressives Congress (APC)."
  },
  {
    "headline": "Nigeria Records 471 New COVID-19 Cases As Doctors’ Strike Lingers",
    "summarized_story": "Nigeria has recorded 471 fresh cases of the novel coronavirus as resident doctors across the country continue to strike over unpaid benefits.\nTill date, Nigeria has recorded 178,086 cases of the virus with 165,763 of them discharged and 2,187 deaths.\nDoctors’ strikeNigeria has recently seen an uptick in new cases of COVID-19 as fears of a third wave continues to loom amid a doctors’ strike which commenced on August 2.\nLatin America and the Caribbean overall has 1,390,154 deaths from 41,489,417 cases, Europe 1,211,528 deaths from 59,486,360 infections, and Asia 699,596 deaths from 46,115,997 cases.\nThe United States and Canada has reported 643,381 deaths from 37,177,857 cases, Africa 176,624 deaths from 6,985,972 cases, the Middle East 164,695 deaths from 10,925,737 cases, and Oceania 1,449 deaths from 93,054 cases."
  },
  {
    "headline": "Troops Repel Dawn Attack On Borno Town – Army Spokesperson",
    "summarized_story": "The Nigerian Army on Monday said troops of 25 Task Force Brigade have successfully quelled a dawn attack attempted on Damboa town in Borno State.\nThe attempted attack took place on Sunday, army spokesperson Onyema Nwachukwu said in a statement.\nAccording to the army, the criminals approached on foot and motorcycles but were forced to retreat after troops opened fire.\nHowever, two vehicles belonging to the Civilian Joint Task Force were razed by fire.\nThe army said it is currently on the trail of the “fleeing terrorists”."
  },
  {
    "headline": "Bandits Kidnap Commissioner For Information In Niger",
    "summarized_story": "Bandits have kidnapped the Commissioner for Information in Niger State, Mohammed Idris.\nThis was confirmed by the state government on Monday in a statement through its Chief Press Secretary, Mary Noel-Berje.\nThe Commissioner was said to have been kidnaped by bandits at about one o’clock in the early hours of today from his home at Baban Tunga village in Tafa local government of the State.\nSecurity agencies are however already on the trail of the bandits, the government’s statement added."
  },
  {
    "headline": "Court Orders Final Forfeiture Of Properties Linked To Okorocha",
    "summarized_story": "A State High Court in Owerri has ordered the final and absolute forfeiture of Royal Palm Springs Hotel and other properties said to belong to Senator Rochas Okorocha and other members of his family.\nJustice Njemanze added that the suit filed against Imo state Government by Okorocha’s counsel was not properly filed.\nJustice Njemanze maintained that the white paper gazette by the Imo state Government is a legal binding document.\nHowever, the properties as at today have been returned to the Imo state Government.\nThis prompted Okorocha’s counsel to file a preliminary injunction to stop the final forfeiture citing forceful eviction and that the suit by the Imo state Government was not properly Instituted."
  },
  {
    "headline": "Oyo FOMWAN urges Nigerians to migrate from vices",
    "summarized_story": "The Federation of Muslim Women Associations in Nigeria, FOMWAN Oyo State Chapter has urged the people to move away from all forms of social vices, and allow the high level of religiosity and spirituality of Nigerians to manifest in their character, conduct and dealings with one another as Muslims observe the celebration of the new Islamic year.\nOyo FOMWAN made the appeal in a New Hijrah 1443 message issued and signed by its Amirah, Alhaja (Dr) B.B Oloso in Ibadan.\nThe statement rejoiced with the millions of Muslims across the world and especially the Islamic faithful in Nigeria on the very auspicious occasion of the beginning of another twelve months of the Lunar calendar (Hijrah 1443).\nThe FOMWAN Amirah who applauded the decision of the Oyo State Governor, Engr Seyi Makinde to return Hijrah Holiday, described the announcement of Tuesday (Muharram 1st, 1443) as public holiday for the Muslims in the State as a gesture capable of portraying the Governor as an unbiased Leader while it will also help to further enhance and promote peaceful co-existence amongst adherents of different faiths.\nWhile wishing all members of FOMWAN in Nigeria and particularly Oyo State a happy new Islamic year, Alhaja Oloso also extended same to all members of other Islamic Organizations and prayed to Allah to fill the new year with His mercy, favor, peace and security for the entire nation."
  },
  {
    "headline": "Imo State High Court orders forfeiture of Senator Okorocha’s Property",
    "summarized_story": "A State high court sitting in Owerri the Imo State capital has ordered final forfeiture of all properties of Former Governor Rochas Okorocha gazetted in Imo State white Paper on recovery of lands and properties belonging to the state.\nThe court presided over by Justice Fred Njamanze in his ruling maintained that Senator Rochas Okorocha failed to give concrete and verifiable reasons why a final and absolute forfeiture order should not be given in favour of the state governmentThe Judge noted that there is no reason before it why the forfeiture should not be made absolute and final.\nTo this end every property on pages 226 to 272 of the white paper has been forfeited to the Imo state Government and they can do with it whatever they deem fit.\nAs for those who had made purchase on such properties the court said they are at liberty to approach the court to prove their titles, however the properties as at today have been returned to the Imo state Government.\nThe properties to be forfeited include:“Eastern Palm University, Ogboko;Royal Spring Palm Hotels and Apartments;IBC staff quarters said to have been illegally acquired for the purpose of Rochas Foundation College among others."
  },
  {
    "headline": "IPOB Sit-at-Home Order cripples business activities in Anambra, Enugu, Imo",
    "summarized_story": "Shops, businesses, offices and filling stations are currently shutdown in Anambra, Enugu and Imo states in the South eastern part of Nigeria.\nThis is in compliance with proscribed Indigenous People of Biafra (IPOB) Stay-at-Home order.\nTVC News observed that most people complied with the order as streets are near deserted and few vehicles are seen moving.\nAdvertisementThe proscribed Indigenous People of Biafra had earlier issued the sit-at-home order as a mark of protest from the South East region, demanding for the release of their leader, Nnamdi Kanu.\nAlso in Owerri, the Imo State capital most shops are under lock and keys as few vehicles are seen on the major roads."
  },
  {
    "headline": "Sudan Recalls Ambassador to Ethiopia Amid Frayed Ties",
    "summarized_story": "The tensions began after Sudan deployed troops to its border with Ethiopia late last year.\nSudan said it reclaimed most of its territory and called on Ethiopia to withdraw troops from at least two points it says are inside Sudan.\nEthiopian officials, however, accused Sudan of taking advantage of the Tigray conflict region to enter Ethiopian territory.\nThe border tensions come at a time when Ethiopia, Sudan and Egypt are also trying to resolve a three-way dispute over Ethiopia’s Grand Ethiopian Renaissance Dam.\nIn February, Sudan ordered Ambassador Gamal al-Sheikh home from Ethiopia after it accused Ethiopian troops of crossing into Sudan and warned of “grave repercussions” on the region’s security and stability."
  },
  {
    "headline": "Nigeria’s Search for a New President Begins; Meet Possible Contenders as 2023 Beckons",
    "summarized_story": "He is the first Nigeria to be elected AfDB President and hails from Ogun State in South-west Nigeria.\nSaraki worked as a medical officer at Rush Green Hospital, Essex and had been a Director of Société Générale Bank (Nigeria) Limited.\nAn economics professor and former Central Bank of Nigeria Governor, he is presently the factional gubernatorial candidate of the All Progressives Grand Alliance.\nHe also attended Kellogg graduate school of Management, USA, Oxford University: Said business school and Cambridge University’s George business school.\nBut, again, apart from fitting the bill of the president Nigeria needs, Amaechi is one of the few actors, who have not hidden their desire to be president."
  },
  {
    "headline": "Weapons Sale Suspension: US Security Cooperation with Nigeria Not Affected, Says Consul General",
    "summarized_story": "Security cooperation between the United States and Nigeria has neither been halted nor frozen by the recent suspension of weapons sale to Nigeria by the US Congress.\nNo military sale can go forward without that being done and no military sale will ever be delivered or scheduled whilst subject to any kind of congressional hold or any statutory restrictions.\nShe added that the Nigerian Navy had indicated interest in a number of equipment, explaining that they are eligible to request.\nThe consul general stated, “The Nigerian Navy has expressed great interest in receiving ships from the Excess Defence Article programme.\nWe are delighted that Nigeria is hosting this engagement, as we firmly believe that maritime security in Nigeria will lead to greater regional prosperity."
  },
  {
    "headline": "Nigeria Begins Implementation of Central Bank’s $600m Gas Expansion Fund",
    "summarized_story": "Nigeria’s federal government has commenced the implementation of the Central Bank of Nigeria’s (CBN) N250 billion intervention fund for the National Gas Expansion Programme (NGEP), which is expected to create about three million direct and indirect jobs.\nHe stated that the fund was available to finance the establishment of gas processing plants and small-scale petrochemical plants, gas cylinder manufacturing plants, Compressed Natural Gas (CNG) regasification modular systems, automatic conversion kits or components manufacturing plants, CNG primary and secondary compression stations, as well as micro distribution outlets and service centres of liquefied petroleum gas (LPG) sales.\nAccording to Nabasu, the fund would equally provide leverage for additional private sector investments in the domestic gas market, boost employment across the countrh and fast-track the development of gas-based industries, particularly petrochemical (fertiliser and methanol, among others).\nThe SMEs support portion, she disclosed, has a limit of N50 million, broken into start-ups and experienced applicants.\nStating that SMEs will prove that they are registered in Nigeria, pay their taxes, prove affiliation to first-class companies which are already established businesses with good track records within the gas value chain, she pointed out that there was no deadline for filing of applications."
  },
  {
    "headline": "Nigeria: With Planned Dividend Payout, NNPC Prepares for Life Outside FG’s Control",
    "summarized_story": "“And I can tell you, within the next month or two maximum, we will publish our statement of accounts for 2020.\n“Only a discerning analyst would have raised his eyebrow when the NNPC announced its intention to pay its first dividend in September 2021.\nFor the period of April 2020 to April 2021, NNPC noted that a total of 2,902.52bcf of gas was produced, representing an average daily production of 7,369.76mmscfd during the period.\n“Period-to-date production from Joint Ventures (JVs), Production Sharing Contracts (PSCs) and NPDC contributed about 62.07 per cent, 19.95 per cent and 17.98 per cent respectively to the total national gas production.\nAccording to the national oil company, a total of 795mmscfd was delivered to gas-fired power plants in the month of April 2021 to generate an average power of about 3,416 MW."
  }
]