[
  {
    "headline": "NANS president on his own, June 12 protest holds —South-West students",
    "summarized_story": "The National Association of Nigerian Students, Zone D (South-West), has dissociated itself from a statement by the National President, Sunday Asefon, which announced the suspension of a protest the Association planned for June 12.\nThe statement was signed by the Coordinator, NANS Zone D, Kowe Odunayo Amos; and Secretary-General, NANS Zone D, Giwa Yisa Temitope.\nIt read, “It is most pathetic to read the statement issued by the President of NANS, Sunday Asefon calling for the cancellation of the June 12 protest which had been planned for and which has had preparations at top-gear for the execution of such.\n“As a Zone, we totally dissociate ourselves from the statement of the NANS President and call on SU bodies throughout the South West campuses to maintain the mobilisation which is on the ground.\nJune 12 day of action is sacrosanct and we shall never for any reason succumb to blackmail of any sort."
  },
  {
    "headline": "Twitter suspension: US, UK, EU, others are hypocrites, says Lai Mohammed",
    "summarized_story": "The Minister of Information and Culture, Lai Mohammed, has slammed the United States, the United Kingdom, the European Union and other countries that criticised the suspension of social media giant, Twitter.\nMohammed, who described the foreign countries as hypocrites, said their views were purely based on economic reasons and not because they loved Nigeria.\nMohammed said both the EU and the UK were already working on social media regulations and wondered why Nigeria was being accused of stifling free speech.\nHe added, “The EU has recommended the same thing and Britain only on Wednesday spoke about a law that would regulate the social media.\nOn the issue of Nigerians losing money to the Twitter suspension, Mohammed downplayed the complaints, saying that the Nigerian government was not generating any money in tax from the social media platform."
  },
  {
    "headline": "Wike orders demolition of East-West road shanties",
    "summarized_story": "WikeBy Egufe Yafugborhi, Port-HarcourtGovernor Nyesom Wike has ordered occupants of shanties sprouting from various points of Rivers State axis of the East-West road to vacate and remove such structures or have them demolished in two weeks.\nThe Governor had declared that, “We ordered ordered destruction of all the shanties and makeshift structures located along Elele to Ahoada expanse of the East West Road to deny criminals opportunity to continue to undermine our security from these hideouts.\n“Consequently, I hereby direct owners of such shanties and illegal structures along the Eleme – Onne axis of the East-West road to vacate the area within two weeks from today 11th June 2021 as the State Government will go ahead to destroy these structures without any further notice.\n“These target structures established along the East West Road are too open, bubbling with daily lawful commerce that sustains majority in the Hausa community in the state cannot be labelled criminal hideouts.\n“At least these settlements of ours are not known theatres of the frequent fatal cult wars and attacks in Rivers."
  },
  {
    "headline": "State of the nation: Report of our meeting won't be made public until we meet Buhari",
    "summarized_story": "He, however, did not disclose when the participants will meet with the president, saying the public will know when the president chooses to see meet with them to hear them out.\n“We decided that our communique won’t be issued until after submitting our report to the President”, he said.\nSpeaking to reporters, Friday, at Transcorp Hotel where the meeting was previously held, the former president said the participants to the meeting resolved in principle to formally present the resolutions to President Buhari before they get to public knowledge.\nAmong all the participants approached to speak, was Emeritus John Cardinal Onaiyekan,who told reporters that “we discussed everything”, refusing to speak further.\nIt was gathered that the resolutions of the ongoing meeting would be presented to President Muhammadu Buhari on Friday,at the Presidential Villa,as participants are expected to meet with the president after the meeting."
  },
  {
    "headline": "Buhari's 1999-2014 $100 crude oil sale claim inaccurate",
    "summarized_story": "From 1999 to 2014, our production (if you check you will find out that) every production was 2.1 million barrel per day.\nAccording to him:“President Muhammadu Buhari, in a bid to defend his administration, has again spread misinformation regarding the records of crude oil prices under past administrations.\nCLAIM: Crude oil sold for $100 from 1999 to 2014: In an interview with Arise Television aired in the early hours of Thursday, Buhari said Nigeria’s Brent crude oil sold for $100 between 1999 and 2014.\nSo, from 1999 to 2014, we were earning 2.1 million times 100 dollar per day.”“Look at the state of infrastructure.\nVERDICT: Since records and POLITICS NIGERIA’s analysis showed that crude oil sold for an average of $61.7 per barrel between 1999 to 2014, the President’s claim of $100 per barrel is inacurrate.”"
  },
  {
    "headline": "Police deny report of influx of suspected herdsmen into Oyo",
    "summarized_story": "By Adeola BadruThe Oyo State Police Command has dispelled the report of influx of suspected herders into the state with specific references to Akinyele, Ona-Ara, Oluyole, Monatan, Akobo and Egbeda areas of the state.\nThe command, in statement made available to Vanguard on Friday evening by the Police Public Relations Officer in the state, DSP Adewale Osifeso, stated that the rumour mill also spanned towards Ido Local Government Area, sharing boundaries with Ibarapa North and East Local Government, where some strangers in their numbers allegedly believed to be herders stormed the community leading to closure of schools and business activities.\nThe statement added that the Commissioner of Police in the state, Ngozi Onadeko, in her due diligence, had hitherto deployed intelligence assets across the nooks and crannies of the state, especially those areas reportedly troubled, which in turn has produced facts that negated the reported assertions.\nThe command commenced a sensitization and awareness patrol on Thursday around the state in a bid to sensitize the general public on the need to shun any form of involvement in unpatriotic acts and criminal activities, which it said to be counterproductive to the current level of peace enjoyed during and beyond the June 12, democracy day celebration.\nVanguard News Nigeria"
  },
  {
    "headline": "Ogun community leader clears air on alleged kidnap",
    "summarized_story": "By Evelyn UsmanFresh facts have emerged on the circumstances surrounding the alleged disappearance of some residents of Abaren community in Owode Local Government Area of Ogun State by unknown gunmen two weeks ago.\nReports of invasion of the community and abduction of some of the residents went viral on social media, with calls to Police authorities to beam their searchlight to Abaren, owing to the state of insecurity.\nHowever, when the Ogun State Community leader and Baale in Council, Chief Olukayode Akoni was contacted, he described as untrue report of the invasion of the community and subsequent abduction of some persons.\nALSO READ: ‘Made in Nigeria phones to hit market soon’Rather, he clarified that operatives of the Special Weapons and Tactics, SWAT team from Abuja were in the community to effect the arrest of some persons, following a petition to that effect.\n“ The SWAT team mediated because of the judiciary workers’ strike."
  },
  {
    "headline": "Insecurity: Defence Minister, Service Chiefs, others meet South-East stakeholders in Enugu",
    "summarized_story": "A Federal Government delegation, on Friday, met with Southeast stakeholders over the prevailing security situation in the zone.\nThe delegation, led by the country’s Defence Minister, Retired Maj. Gen. Bashir Magashi, had his Interior Ministry counterpart, H.E.\nRaul Adesoji Aregbesola, the Service Chiefs, Governors of the South-East geo-political zone and other leaders of political, religious and traditional institutions in the zone, at the Enugu Government House.\nSpeaking, the chairman, South-East Governors’ Forum, Chief David Umahi thanked the Federation Government the delegation for their concern towards addressing the insecurity in the zone.\nAccording to him, “Our people are excited with this commitment and sacrifices and we thank you so much.”He noted that that stakeholders discussed issues on open grazing and that the delegates were in support of it."
  },
  {
    "headline": "June 12: Stand against anything hindering democracy",
    "summarized_story": "As Nigeria marks Democracy Day on June 12, 2021, the All Progressives Congress (APC) National Leader, Bola Tinubu, has urged Nigerians to stand for democracy.\nHe urged Nigerians to stand for democracy despite the challenges they were going through.\nThe former governor of Lagos State also urged Nigerians to stand against whatever could hinder democracy.\n“I wish all of you a meaningful and happy Democracy Day,” he said.\nEmmanuel Onwubiko: Suspend Children’s, Democracy Day ceremonies"
  },
  {
    "headline": "June 12: Be fair to all Nigerians",
    "summarized_story": "The Christian Association of Nigeria (CAN), has advised Nigerians to continue praying for peace for the well-being of the nation.\nThe National President, Bishop Samson Ayokunle gave the advice on Friday while speaking to journalists in Enugu State.\nAyokunle, who was represented by the Director of Planning and Social Welfare, Bishop Stephen Adegbite urged the government to be fair to all Nigerians.\nHe reiterated that cattle rearing was a private business, insisting that nobody should destroy the business of another while carrying its own business.\nAyokunle noted that the decision would help to check those hiding under cattle grazing to unleash terror on the residents of the region."
  },
  {
    "headline": "Nigerians with unauthorised govt plate numbers will be arrested",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has warned that those found with unauthorised government number plates attached to them will, henceforth, be arrested and persecuted.\nAladenika said vehicles with unauthorized plate numbers will also be impounded.\nThe FRSC Commander disclosed that some criminals were fond of using the vehicle number plates belonging to either the Federal or state governments to perpetrate crimes across the country.\nAladenika said, “We have discovered that criminals now hide under the guise of using either state or government number plates to perpetrate crimes.\n“Any vehicle found not to have a corresponding or authorised government number plate will be impounded and the drivers arrested and prosecuted."
  },
  {
    "headline": "June 12: US sends message to citizens in Nigeria over tension",
    "summarized_story": "The United States Mission in Nigeria on Friday warned its citizens in the country against careless movements as groups threaten protests across the country.\nRecall that the Nation Association of Nigerian Students, NANS have planned to stage a nationwide protest on June 12 to decry the high level of insecurity in the country.\nThe association has, however, suspended the planned protest over the fear of attacks by hoodlums.\nFollowing the palpable fear, the US embassy, in a demonstration alert posted on its website on Friday, urged its citizens to avoid areas where the protest would take place.\nIt read, “Several groups have announced their intentions to protest nationwide on June 12, Democracy Day."
  },
  {
    "headline": "June 12: Disregard sit-at-home order, police tell Lagos residents",
    "summarized_story": "By Precious IgbonwelunduThe Lagos Police Command has urged residents to disregard sit-at-home order by various groups to protest bad governance and other issues plaguing the country.\nCoalition of Civil Society groups had since last month rallied Nigerians across social media platforms for street protests in major cities and towns in the country.\nAs the day drew closer, there were fears of possible confrontation between security forces and protesters, necessitating warning that people should rather sit-at-home.\nBut the Police Command on Friday evening assured residents of their safety, urging them to go about their lawful businesses.\nADVERTISEMENTCommissioner of Police (CP) Hakeem Odumosu in a statement by spokesman, Olumuyiwa Adejobi, said the command was not aware of any planned protest in Lagos on Saturday to commemorate June 12."
  },
  {
    "headline": "FG, Buhari’s aides abandon Twitter for Indian app, Koo",
    "summarized_story": "By Alao AbiodunFollowing suspension of Twitter operations in Nigeria, the Federal Government has joined Koo, an Indian microblogging platform, The Nation has learnt.\nThe suspension of the platform since last Friday forced some Presidential aides and agencies to join Koo.\nFollow me,” Ahmad wroteMeanwhile, Koo has announced its availability in Nigeria and readiness to add local languages on its platform.\nKoo co-Founder, Aprameya Radhakrishna, who confirmed the platform is now available in Nigeria, said they are working on adding local languages.\nWe are thinking of enabling the local language there as well."
  },
  {
    "headline": "We’re ready to meet FG over ban — Twitter",
    "summarized_story": "By Samuel OamenMicro blogging and social network service platform Twitter stated it has informed the Federal Government of its willingness to meet over the suspension of its operations in Nigeria.\nThe Federal Government last Friday suspended Twitter’s operation in Nigeria on the basis accusing the social media giant of allowing its platform to be used to threaten the country’s cooperate existence.\nADVERTISEMENTMinister of Information and Culture, Lai Mohammed told reporters on Wednesday that Twitter’s management is seeking a “high-level discussion” to resolve the issue that led to the suspension.\nConfirming the Minister’s comment, Twitter said on Friday: “Today marks one week since Twitter was blocked in Nigeria.\nWe have informed the Nigerian government that we are ready to meet for an open discussion to address mutual concerns and see the service restored."
  },
  {
    "headline": "Democracy Day: Buhari to address Nigerians on Saturday",
    "summarized_story": "By Bolaji Ogundele, AbujaAs part of this year’s Democracy Day celebration, President Muhammadu Buhari will on Saturday address Nigerians in a television and radio broadcast.\nAccording to a statement by Special Adviser to the President on Media and Publicity, Femi Adesina, Buhari will reach out to Nigerians through the Nigerian Television Authority (NTA) and Radio Nigeria from 7am.\nADVERTISEMENT“To commemorate Nigeria’s Democracy Day, June 12, 2021, President Muhammadu Buhari will address the nation on Saturday June 12, 2021, at 7am.\n“Television, radio stations and other electronic media outlets are enjoined to hook up to the network services of the Nigerian Television Authority and Radio Nigeria for the broadcast,” the statement said."
  },
  {
    "headline": "Insecurity: FG, S/E Govs, leaders in crucial meeting in Enugu",
    "summarized_story": "Geoffrey Anyanwu, EnuguA crucial meeting is going on now at the Enugu State Government House between representatives of the federal government led by the Defence Minister, Maj. Gen. Bashir Magashi (rtd.)\nand Governors of the South East geo-political zone and other leaders of the zone.\nThe closed-door meeting is on on security challenges in the country especially as it concerns the South East zone.\nWhile the South East team comprised all the Governors of the geo-political zone and other leaders of the political, religious and traditional institutions in the zone.\nGovernor Ifeanyi Ugwuanyi, in his welcome address, described the Town Hall meeting as timely and apt and expressed optimism that the outcome would engender the watershed to the security challenges in the South East zone."
  },
  {
    "headline": "Governorship Election: Court nullifies PDP Congress in Anambra",
    "summarized_story": "From Godwin Tsa, AbujaA High Court of the Federal Capital Territory (FCT) has set aside all congresses of the Peoples Democratic Party, PDP, in respect of the Anambra state governorship election.\nIn his judgment delivered by Justice Adegbola Adeniyi held that the arbitrary of the state chairmen, Executive Council members of the party as well as local government chairmen and delegates memberswas unlawful, illegal, thanks and void.\nThe suit marked HC/CV/774/2021 was filed by Samuel Anyakorah, for himself and on behalf of local government chairmen and others who emerged from the state PDP congresses conducted on November 2017 also restrained the party from further dealing with the sacked Executives of the party in the state.\nThe plaintiff, apart from the PDP also joined Chief Ndubuisi Nwobu and Barrister Uchenna Obiora as defendants."
  },
  {
    "headline": "Again, Buhari restates shoot-on-sight order",
    "summarized_story": "‘‘As Commander-in-Chief, my primary responsibility remains the security of the country and the safety of all citizens.\nDespite the many challenges we are facing, I want Nigerians to rest assured that we will secure this country.\n‘‘I acknowledge the initiative taken to kick-start the rebuilding process, through the establishment of the Lagos State Rebuild Trust Fund, and through this very laudable effort by the Lagos State Security Trust Fund.\nBuhari declared that no federal government, since 1999, had been as committed as his administration toward reforming and repositioning the Nigeria Police Force and national policing architecture.\n‘‘In 2020, I assented to the Bill amending the Nigeria Police Act, which was originally enacted in 1943."
  },
  {
    "headline": "…Vows to restore cattle routes, grazing areas across the country",
    "summarized_story": "President Muhammadu Buhari has said his administration would reinstate cattle routes and grazing areas across the country to ensure that herders have free access for their animals.\nIn apparent response to the ban on open cattle grazing by the 17 Southern governors, he said when the governors gave the directive that open grazing would be banned, he referred them to the gazette that makes provisions for cattle routes and open grazing areas.\nThere are certain routes and grazing areas so that when cattle rearers were moving from the north to the west, they were allowed to go through there.\nThose who encroach on these cattle routes and grazing areas would be dispossessed.\nHe said the local governments which are under the control of state governors are dead, which he says is bad for the country."
  },
  {
    "headline": "PDP, Ohanaeze, MBF, MASSOB, Kokori, Kanu, others react",
    "summarized_story": "The Peoples Democratic Party (PDP) accused President Muhammadu Buhari of attempting to claim projects executed by previous administration headed by the opposition party .\nThe PDP noted that President Buhari bulged an opportunity to address salient issues confronting the country, by allegedly being evasive during the Arise interview.\nReacting, Ohanaeze Ndigbo said Buhari has a choice between dialogue and waging an avoidable war against Ndigbo.\n“President Buhari has a choice between dialogue on one hand and an avoidable war against the Igbo on the other.\nReacting in a statement through the group’s media and publicity secretary, Emma Powerful, Kanu: “The earth is also a dot within the galaxy."
  },
  {
    "headline": "Buhari Approves More Personnel, Salary Increase for Police Force",
    "summarized_story": "Buhari added that the controversial railway to the Niger Republic will be of immense economic benefits to Nigeria.\nThere are Kanuris, there are Hausas, there are Fulanis in Niger Republic, just as there are Yorubas in Republic of Benin.\nAccording to him, the land will be recovered from persons who have converted cattle grazing routes to personal use.\nCattle routes were for when they (herdsmen) are moving up country, north to south or east to west, they had to go through there.\nIt added: “President Buhari has a choice between dialogue on one hand and an avoidable war against the Igbo on the other."
  },
  {
    "headline": "FG Exceeding Borrowing Threshold for 2021, Says Ahmed",
    "summarized_story": "• Defends suspension of Twitter’s operationsEmmanuel Addeh in AbujaMinister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, yesterday admitted that the federal government is exceeding its borrowing plan for 2021, blaming the development on the COVID-19 pandemic and the fall in oil prices.\nHowever, she said the economic sustainability plan was targeting massive recruitment, health insurance, and a review of the poverty indices, to redress the setback COVID-19.\n“You cannot shut out the president of a country and not expect consequences,” the minister added.\nShe described the suspension of Twitter as a well-thought-out decision, saying it shouldn’t affect the country’s image in the eyes of international investors.\nThe minister identified accessing available doses as the biggest challenge facing the country’s COVID-19 vaccination programme."
  },
  {
    "headline": "Pompeo Tackles FG, Says 1,500 Christians Killed in 2021",
    "summarized_story": "Ejiofor AlikeThe immediate past United States Secretary of State, Mr. Mike Pompeo, has said that no fewer than 1,500 Christians have been killed in Nigeria since the beginning of 2021, while others are being held hostage.\n“At least 1,500 Christians have already been killed in Nigeria during 2021, and even more, have been kidnapped and are either being held hostage or trafficked.\nPompeo said: “Where religious freedom is denied or ignored, you can be sure that tyranny and oppression are soon to follow.\nThat is why a foreign policy that takes seriously the issue of ensuring religious freedom around the world is critical to serving America’s interests.\nPompeo described Sharibu’s story as tragic, infuriating, and emblematic of a troubling trend of Christian persecution in Nigeria."
  },
  {
    "headline": "The Return to Igangan",
    "summarized_story": "There was a time that some of our leaders especially in the military era would glibly tell us that Nigerian unity is non-negotiable.\nO. AnyaWhatever becomes of the spiralling inter-ethnic (mutually assured destruction) cycle of violence in Nigeria, Igangan, Ibarapa in Oyo State, will be remembered as a turning point.\nSymbolically, Igangan has always been associated with critical phases of Yoruba history.\nThe question then arises, is the Seriki Fulani of Igangan a foreigner?\nThat any evil is justified in the self-serving pursuit of the distorted notion of national unity as an end unto itself?"
  },
  {
    "headline": "Buhari: My Order to Security Operatives to Shoot Anybody Carrying AK47 Stands",
    "summarized_story": "President Muhammadu Buhari Thursday said his order to security agencies to shoot at anyone carrying AK47 or any assault rifle remains in place.\nPresident Buhari said this at the Nigeria Police College, Ikeja where he commissioned security equipment bought for the Lagos State Command of the Nigeria Police by the state government.\nDetals later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Buhari-led Government To Pay Nigerian Students' Leader, Asefon N40million To Mobilise Thugs, Disrupt June 12 Protests",
    "summarized_story": "The Muhammadu Buhari-led government has concluded plans to pay the President of the National Association of Nigerian Students (NANS), Sunday Asefon N40 million to mobilise thugs in major cities and disrupt the planned June 12 Democracy Day nationwide protest, SaharaReporters has gathered.\nAsefon had in meeting with Nigeria's Inspector of General of Police, Usman Alkali Baba on Tuesday promised to mobilise against those planning protest using his power as NANS President.\n“Asefon then told him he is the original President with the structure of the students’ body.\nCivil society organisations and human rights activists have called for a nationwide protest on June 12 against the Muhammadu Buhari-led administration.\n“The money was to compensate him for calling off his planned protest and also mobilise thugs in major cities with police cover to unleash terror on genuine protesters tomorrow."
  },
  {
    "headline": "EXCLUSIVE: Buhari-led Government To Pay Nigerian Students' Leader, Asefon N40million To Mobilise Thugs, Disrupt June 12 Protests",
    "summarized_story": "The Muhammadu Buhari-led government has concluded plans to pay the President of the National Association of Nigerian Students (NANS), Sunday Asefon N40 million to mobilise thugs in major cities and disrupt the planned June 12 Democracy Day nationwide protest, SaharaReporters has gathered.\nAsefon had in meeting with Nigeria's Inspector of General of Police, Usman Alkali Baba on Tuesday promised to mobilise against those planning protest using his power as NANS President.\n“Asefon then told him he is the original President with the structure of the students’ body.\nCivil society organisations and human rights activists have called for a nationwide protest on June 12 against the Muhammadu Buhari-led administration.\n“The money was to compensate him for calling off his planned protest and also mobilise thugs in major cities with police cover to unleash terror on genuine protesters tomorrow."
  },
  {
    "headline": "BREAKING: June 12: Newspaper Editor, Agba Jalingo Arrested Over Fake Petition Claiming He Is An Arms Dealer",
    "summarized_story": "CrossRiverWatch Editor in Chief and rights activist, Citizen Agba Jalingo has been arrested by the Cross River State command of the Nigeria Police Force over a fake petition that he is an arms dealer.\nHe is currently being questioned at the State Criminal Investigation Department (CIID) of the Cross River Police Command.\nThe Commissioner of Police, Mr. Kayode Sikiru had invited Mr. Jalingo to his office for an interview over the planned #June12 protests.\nAfter the meeting, he asked the duo of Mr. Jalingo and CrossRiverWatch News Editor, Jonathan Ugbal to ensure the planned action was peaceful as the command will not fold its arms and watch it degenerate into a riot.\nJalingo is still facing trial for alleged acts of terrorism, treasonable felony and attempts to topple the Cross River State Government over an article he wrote in June 2019, asking for the whereabouts of the N500 million approved and released for the floating of the Cross River State Microfinance Bank."
  },
  {
    "headline": "BREAKING: June 12: Newspaper Editor, Agba Jalingo Arrested Over Fake Petition Claiming He Is An Arms Dealer",
    "summarized_story": "CrossRiverWatch Editor in Chief and rights activist, Citizen Agba Jalingo has been arrested by the Cross River State command of the Nigeria Police Force over a fake petition that he is an arms dealer.\nHe is currently being questioned at the State Criminal Investigation Department (CIID) of the Cross River Police Command.\nThe Commissioner of Police, Mr. Kayode Sikiru had invited Mr. Jalingo to his office for an interview over the planned #June12 protests.\nAfter the meeting, he asked the duo of Mr. Jalingo and CrossRiverWatch News Editor, Jonathan Ugbal to ensure the planned action was peaceful as the command will not fold its arms and watch it degenerate into a riot.\nJalingo is still facing trial for alleged acts of terrorism, treasonable felony and attempts to topple the Cross River State Government over an article he wrote in June 2019, asking for the whereabouts of the N500 million approved and released for the floating of the Cross River State Microfinance Bank."
  },
  {
    "headline": "International Press Centre Condemns DSS, Police' Assault On Two Journalists In Abuja",
    "summarized_story": "The International Press Centre (IPC), Lagos has condemned the attack by operatives of the Department of State Services (DSS) and the police on two journalists in the nation's capital, Abuja.\nGiving the two names of the journalists as Friday Olokor, a senior correspondent with The Punch newspapers and Patience Ihejirika of the Leadership newspapers in Abuja, IPC said it has confirmed that the journalists were molested on Thursday while trying to gain access to M & M Events Centre, Abuja.\nIPC said the journalists had gone to cover the ongoing African Women Conference organised by dRPC (Development Research and Projects Centre) with the support of Ford Foundation.\n\"This detestable act is very worrisome and totally against the fundamental human rights of Olokor and Ihejirika who identified themselves as journalists.\nThe continuous attacks on journalists in Nigeria is particularly worrisome, especially when the perpetrators are security operatives whose main function is to protect lives and property,\" the statement said."
  },
  {
    "headline": "Lai: It's unfair to say Twitter ban was because Buhari's tweet was deleted",
    "summarized_story": "Lai Mohammed, minister of information, says it is “unfair” for people to say the suspension of Twitter’s operations in Nigeria is because the president’s tweet was deleted.\nAdvertisementThe minister had announced the suspension on June 4, stating that the decision was because Twitter allowed its platform to be used for activities that “undermine Nigeria’s corporate existence”.\nThe Twitter suspension, however, came days after a tweet by Buhari, which cited a reference to the civil war experience, was deleted by the social media platform.\nAdvertisement“People have tried to say Twitter was suspended because they deleted the president’s message.\nWe were very unambiguous that if any platform continues to promote the views of those who want Nigeria to be divided, we will suspend their operations,” he said."
  },
  {
    "headline": "Lai: It's unfair to say Twitter ban was because Buhari's tweet was deleted",
    "summarized_story": "Lai Mohammed, minister of information, says it is “unfair” for people to say the suspension of Twitter’s operations in Nigeria is because the president’s tweet was deleted.\nAdvertisementThe minister had announced the suspension on June 4, stating that the decision was because Twitter allowed its platform to be used for activities that “undermine Nigeria’s corporate existence”.\nThe Twitter suspension, however, came days after a tweet by Buhari, which cited a reference to the civil war experience, was deleted by the social media platform.\nAdvertisement“People have tried to say Twitter was suspended because they deleted the president’s message.\nWe were very unambiguous that if any platform continues to promote the views of those who want Nigeria to be divided, we will suspend their operations,” he said."
  },
  {
    "headline": "Buhari to hold 'revealing' second interview in two days",
    "summarized_story": "President Muhammadu Buhari will grant an interview to the Nigerian Television Authority (NTA) later tonight.\nAdvertisementIn a statement on Friday, Femi Adesina, presidential spokesman, said the interview will be “revealing”.\n“President Muhammadu Buhari grants Nigerian Television Authority (NTA) an exclusive interview, from 8.30 pm, Friday, June 11, 2021,” the statement reads.\nKindly keep a date.”This will be the second interview the president is granting in two days.\nBuhari had sat down talk to Arise News in an interview aired on Thursday morning."
  },
  {
    "headline": "Buhari to hold 'revealing' second interview in two days",
    "summarized_story": "President Muhammadu Buhari will grant an interview to the Nigerian Television Authority (NTA) later tonight.\nAdvertisementIn a statement on Friday, Femi Adesina, presidential spokesman, said the interview will be “revealing”.\n“President Muhammadu Buhari grants Nigerian Television Authority (NTA) an exclusive interview, from 8.30 pm, Friday, June 11, 2021,” the statement reads.\nKindly keep a date.”This will be the second interview the president is granting in two days.\nBuhari had sat down talk to Arise News in an interview aired on Thursday morning."
  },
  {
    "headline": "Kaduna: Two lecturers, 8 students kidnapped from Nuhu Bamalli Polytechnic",
    "summarized_story": "The Kaduna state government says 10 persons were kidnapped from Nuhu Bamalli Polytechnic, Zaria on Thursday.\nAdvertisementTheCable had reported how gunmen invaded the school on Thursday night, shooting sporadically upon entering the premises.\nIn a statement on Friday, Samuel Aruwan, the state commissioner for internal security and home affairs, said two lecturers and eight students were abducted from the institution.\nAdvertisementAruwan said the security briefings indicate that “the bandits invaded the staff quarters of the campus, shooting sporadically”.\nHe said in the process, two students — Ahmad Muhammad and Haruna Duniya — were hit and both sustained gunshot injuries."
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "What is a VPN and how does it work in Nigeria?",
    "summarized_story": "On the internet, different computers send and receive information between Internet Protocol (IP) addresses.\nBefore turning on my VPN, my device was in Lagos, NigeriaAfter turning on my VPN, my device is in Santo Domingo, Dominican RepublicThe images above show how my location changed from Nigeria to Dominican Republic after turning on my VPN.\nNo monitoring: As we mentioned earlier, your internet service provider (ISP) can see your internet traffic and probably log your browsing history.\nWhat is the difference between a VPN app, a VPN plugin, and a VPN browser?\nAlso, some sites and services look at VPN traffic as suspicious and won’t let you connect."
  },
  {
    "headline": "Fostering Gender Inclusion in Technology with the Bolt Drive4WITech Initiative",
    "summarized_story": "The journey into tech for women in Africa is an ongoing discussion largely influenced by cultural norms and societal expectations concerning gender.\nBolt, an inclusive mobility company, recognises this and as part of efforts to drive participation and inclusion for women in technology, launched the #Drive4WITech (Drive for Women in Tech) initiative to support young women in Africa.\nQ: Among the many applications received, you were selected to intern with Bolt in the #Drive4WITech initiative.\nOluwakorede: I supported the marketing team at Bolt Nigeria.\nI am more equipped to confidently make significant contributions to my future work team."
  },
  {
    "headline": "A Global Tech Review on the New Infinix Note 10",
    "summarized_story": "The latest smartphone in the product line of the Note series, the Infinix Note 10, is a device that was built to ‘Meet Beauty with Strength’.\nThe elements of the new Note 10 are Speed, Beauty, Power, and Strength.\nInfinix has gone a step further to bring upgraded and improved features to the new Note 10, while still maintaining affordable pricing for consumers.\nThe Infinix Note 10 Pro won the IF design award 2021 for its iconic design and flattering colour variants.\nThe Infinix Note 10 Pro will certainly satisfy with its whopper of a 6.95inch IPS display."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Increase in fintech app installations, Apple Health new features, Plentywaka partners with GUO",
    "summarized_story": "Today, I’m discussingIncrease in fintech app installationsApple Health features for the elderlyPlentywaka partners with GUOIncrease in fintech app installations in Nigeria, South Africa, and KenyaThe global fintech industry recorded impressive growth in 2020.\nThe report reveals that beyond funding, fintech app installations grew by160% in the last quarter of 2020.\nSimilarly, Kenya saw 100% growth, and South Africa 52% growth, in fintech app installations.\nThe economic effects of COVID-19 led to the rise in fintech app installations.\nSource: PlentyWaka TwitterPlentywaka, a Nigerian bus-hailing tech company, has announced its partnership with interstate bus company, GUO Transport, to expand its reach."
  },
  {
    "headline": "An insight into how Texas-based VC, Sputnik ATX, invests in African startups",
    "summarized_story": "In May 2021, CribMD, a Nigerian healthtech startup, closed a $2.6 million seed round led by US-based venture capital firm, Sputnik ATX.\nTell us how Sputnik ATX came aboutMy business partner, Oksana Malysheva, and I founded ATX in 2017 after we had managed a fund together.\nWe founded Sputnik ATX so that we could do that.\nWhat does VC investment mean to Sputnik ATX?\nTell us what market(s) Sputnik ATX is interested in and why?"
  },
  {
    "headline": "#TechpointDigest 100th edition, More on #TwitterBan, iOS, Android’s new features",
    "summarized_story": "Good day,Today marks the 100th edition of Techpoint Digest, Techpoint Africa‘s daily newsletter.\nMention two.”On a non-Twitter related note, Apple has announced the new features coming to its new iOS 15.\nThe event, dedicated to software, is held annually to showcase new features coming to operating systems across Apple’s ecosystem.\nAnother interesting feature coming to the new iOS is Live Text.\nWhat else I’m readingHow to install the developer beta of iOS 15."
  },
  {
    "headline": "Parents’ retirement plan in jeopardy as youth unemployment worsen",
    "summarized_story": "Four in every 10 Nigerian parents depend on their children to meet their needs when they are old and cannot work.\nThe problem with that is that their retirement plan may be in jeopardy as unemployment in Africa’s most populous nation rose to its highest in at least 13 years and the world’s second-highest in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Struggling with your financials? These steps can help",
    "summarized_story": "They either provide or help SMEs with seamless sources of finance.\nBookkeeping, as she explains, is about recording, tracking, following the money, and identifying what the money is doing for the business.\n“The first thing is the mind-set of the business owner.\nThe business owner needs to understand that the business is different from him or her.\n“Also, as a business owner, constantly lookout for better deals in terms of dealing with vendors."
  },
  {
    "headline": "June 12: Inconsistent regulation in Nigeria stifling $8bn telecom market",
    "summarized_story": "Fast forward to 2021, the sector operators are no longer certain about what the outlook for the second quarter of 2021 would look like, having suffered a historic decline in the first quarter.\nA target of 90 percent would mean the country plans to add about 49 percent broadband penetration to the current 41 percent in 2 years.\nAdditionally, this increases the cost of service delivery.”Poor fibre infrastructure deployment is responsible for the cost of data in the country.\nIt is perhaps why the Lagos State government has embarked on an ambitious plan of deploying about 3500km of fibre infrastructure around the state.\nThe absence of a unified RoW fee across states within the country continuously stalls the advancement of broadband fibre networks,” the researchers said."
  },
  {
    "headline": "Obaseki approves redeployment of all health workers in local councils – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…begins physical verification Monday, June 15BENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the transfer of all Primary Health Care Staff of the Local Government Service Commission to the Edo State Primary Health Care Development Agency, as part of ongoing reforms to improve access to quality healthcare services across the state.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie Esq., said all the affected staff are to present themselves for physical verification exercise from Monday, June 15 to Friday, June 18, 2021.\nHe said, “In line with the Health Sector Reform Agenda of the Government of Edo State, which is anchored on its commitment to effective service delivery and in accordance with the Edo State Primary Health Care Development Agency Law, the Governor of Edo State, Mr. Godwin Nogheghase Obaseki, has approved with effect from 1st of June, 2021, the transfer of all Primary Health Care Staff of the Local Government Service Commission to the Edo State Primary Health Care Development Agency.\n“Pursuant to the foregoing, the Primary Health Care Agency will, in conjunction with the Local Government Service Commission, carry out physical verification of all affected staff from Monday 15 to Friday, 18 June, 2021.”Ogie said the verification exercise will take place in the three Senatorial Districts of Edo State.\nHe added that the exercise for Edo South Senatorial District will hold at the John Odigie Oyegun Public Service Academy (Staff Training Centre) Benin City as folllows, “Egor 16/06/2021; Ikpoba-Okha 17/06/2021; Oredo 18/06/2021; Orhionmwon 16/06/2021; Ovia North East 15/06/2021; Ovia South West 15/06/2021; Uhunmwode 17/06/2021.”According to him, the verification exercise for staff in Edo Central Senatorial will take place at the Esan Central Local Government Council Hall, Irrua, with the schedule slated as follows, “Esan Central LGA 18/06/21; Esan North East 16/06/21; Esan South East 17/06/21; Esan West 15/06/21; Igueben 18/06/21.”He said in Edo North, the verification of the staff will hold at the Etsako West Local Government Council Hall, Auchi, in the following order: “Etsako Central LGA 15/06/21; Etsako East 15/06/21; Etsako West 18/06/21; Owan East 16/06/21; Owan West 16/06/21; Akoko Edo 17/06/21.”..."
  },
  {
    "headline": "CBN may launch digital currency end of 2021 – official – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Central Bank of Nigeria (CBN) on Thursday in Lagos said that its digital currency might be launched by the end of 2021.\nMrs Rakiya Mohammed, an Information Technology Specialist with CBN, made the disclosure at an online news briefing at the end of Bankers Committee meeting.\nAccording to Muhammed, another reason the apex bank plans to come up with digital currency is to make remittances travel easier from abroad to Nigeria.\nShe said that digital currency would accelerate the ability to meet the target, regardless of one’s country of residence.\nOthers are: Nneka Onyeali-Ikpe, Managing Director/CEO, Fidelity Bank; Mr Abubakar Suleiman, Managing Director/CEO, Sterling Bank Plc; Mr Haruna Mustafa, Director, Banking Supervision, CBN, and Mr Osita Nwanisobi, Acting Director, Corporate Communication Department, CBN."
  },
  {
    "headline": "Scrapping of NYSC: Scapegoating Only Aggravates Our Woes – Nigerian Observer",
    "summarized_story": "The activities of these anti-state actors have imperiled farmers, traders, students, political leaders, travelers and ofcourse corps members who are entrusted with the patriotic mandate of rendering selfless service to the motherland.\nIt is this existential question that has birthed a precipitous bill seeking to scrap National Youth Service Corps (NYSC).\nSponsored by Awayi Abiante from Rivers State, the bill has now reached the second reading at the Green Chamber.\nIt is worthy to note that since the inception of nysc itself in 1973 the program has been trailed by waves of protest .\n___________________________________________________________________________________________________________________Sinafi Omanga is a serving corps member with the Nigerian Observer."
  },
  {
    "headline": "We’re in govt to midwife process of change in Edo politics – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has posited that his involvement in politics is a divine arrangement by God, to help drive the process of change in Edo politics.\nObaseki, who spoke to journalists in Benin City, said the last seven months of his second term has been spent on separating governance from politics and re-strategizing to ensure that the state works better for citizens.\n“I am into politics in the state, to midwife the process of change, as change is a constant thing in life.\nTherefore, the politics of Edo State must change: The narrative must change.\nThe governor further stated that the connection between politics and development is in fulfilling the promises made to the electorate during our electioneering campaign."
  },
  {
    "headline": "Democracy Day: Southern senators canvass united Nigeria",
    "summarized_story": "ADVERTISEMENTThe Southern Senators Forum (SSF) has called on Nigerians to strengthen the unity of the nation irrespective of their ethnic and religious affiliation.\nThe forum made the call in a statement in Ado-Ekiti on Friday by its Chairman, Opeyemi Bamidele, while congratulating Nigerians on the celebration of the 2021 Democracy Day.\n“Time has come for all Nigerians to strengthen the nexus of unity among ethnic nationalities and religious boundaries in the country.\nThe forum congratulated all Nigerians on the heart-warming feat, saying since Nigeria Independence in 1960, the nation had not practiced democracy this long.\n“We appeal to Nigerians to take ownership of this democracy as a baby that must survive at all cost."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "We’re committed to one Nigeria where there is justice, equity, equality – Igbo leaders",
    "summarized_story": "OBINNA EZUGWUThe leaders of the South East geopolitical zone have reaffirmed their commitment to the sustenance of a united Nigeria where there is justice, equity and equality of all Nigerians.\nThe leaders stated this today after their meeting with representatives of the Federal Government held at the Government House, Enugu.\nSpeaking through the Chairman of the South East Governors’ Forum, Governor Dave Umahi of Ebonyi State, the South East leaders stated clearly that the people of the South East are not disposed to secession from Nigeria because no other tribe has demonstrated belief and commitment to the unity of the country more than our people.\nThe leaders also condemned the unjustified attacks on security formations in the region and assured that another meeting of the leaders will hold later this month after which the leadership of Ndigbo will meet with the President.\nAll the Governors of the South East were present, except for Anambra State which was represented by the Deputy Governor."
  },
  {
    "headline": "Osun Civil Societies Coalition to Celebrate June 12",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Civil Societies Coalition in Osun State will tomorrow celebrate June 12 as Nigeria Democracy Day.\nThe Chairman of the occasion, according to the statement, is Comrade Hassan Sunmonu, former Chairman of the Nigeria Labour Congress (NLC).\nThe Civil Societies Coalition will also use this year’s June 12 celebration to renew the call for true Federalism and provision of adequate security for lives and property of the entire citizens of the country.\n“We believe that only true federalism which is coming in the name of Restructuring can address the challenges facing Nigeria as a country.\nThe current government structure is responsible for the myriad of problems which is choking the country’s development,” the statement said."
  },
  {
    "headline": "June 12: US asks citizens in Nigeria to avoid protest grounds",
    "summarized_story": "The United States embassy in Nigeria has advised its citizens to avoid the protest grounds across major cities in the country ahead of the planned protest by different groups on Saturday, June 12.\n“Several groups have announced their intentions to protest nationwide on June 12, Democracy Day,” the embassy said.\nIn Lagos, the likely locations for protests will be Lekki Toll Gate and Gani Fawehinmi Park.\nCalls for the protests suggest they may begin as early as 07:00 a.m.”Advising on actions to take by its citizens in the country over the planned nationwide protest, the US said, “Avoid the areas of the demonstrations.\nKeep a low profile.”In case of any emergency, the statement added that the citizens could contact their offices in Lagos and Abuja, the nation’s capital."
  },
  {
    "headline": "Gov Abiodun debates 55 patrol vehicles, bullet proof vests, helmets to police",
    "summarized_story": "Idowu Olakunle, AbeokutaOgun State governor, Prince Dapo Abiodun, has handed over 55 patrol vehicles, motorcycles, 200 bullet proof vests, a number of helmets and communication equipment to the Inspector General of the Police, Usman Alkali Baba to assist the force in its assignments.\nAbiodun noted that the gesture was part of his government’s continued collaboration and cooperation with the security agencies, to improve security of lives and property in Ogun.\n“Let me use this opportunity to commend all men and officers of security agencies in Ogun State for their professionalism, commitment and dedication.\nWe must continue to cooperate with our security agencies in fishing out those criminals”.\nHe further enjoined officers of all security agencies to utilize the provided materials for improved security, saying “this is how the public and private sectors will be further encouraged to support the security agencies”."
  },
  {
    "headline": "Nigeria needs role of traditional leaders in governance – NCPC",
    "summarized_story": "Tom Okpe, AbujaThe Executive Secretary Nigeria Christian Pilgrim Commission, Rev.\nYakubu Pam has said that Nigeria would bounce back if only the Country respects roles of our Royal Fathers in governance.\nRev Pam made this disclosure on Friday in his office, while recieving delegation from the Uke Kingdom of Nassarawa State, led by His Royal Highness, the Yakanaje of Uke Kingdom, Alhaji (Dr) Ahmed Hassan.\nHe said the Royal Fathers are custodians of our cultural heritage, pointing that if the royal fathers are allowed to play the role they were playing in the past, they would certainly make difference, especially in addressing the present security challenges in the country.\nThe Royal father further lauded the NCPC Boss for his effective leadership as the Chairman of the Christian Association of Nigeria (CAN) 19 Northern States, including FCT."
  },
  {
    "headline": "Mixed reactions as Prophet, Odumeje climbs Rev. sister to conduct deliverance in his church",
    "summarized_story": "Deliverance is in another level as popularly known Prophet, Odumeje Climbs A Catholic Reverend Sister In His Church to conduct spiritual prayer.\nREAD ALSO: June 12: We won’t allow EndSARS experience – Police"
  },
  {
    "headline": "Fani-Kayode Knocks Okotie For Insulting TB Joshua",
    "summarized_story": "Former Aviation Minister, Femi Fani-Kayode, has slammed the senior pastor of the Household of God Church, Chris Okotie, for insulting the late Prophet T.B Joshua.\nDays after Joshua who is the founder of the Synagogue Church of Nation died last Sunday, June 6, Okotie shared a cryptic post many interpreted to be an attack on TB Joshua’s memory.\nNaija News understands that Okotie and Joshua were never best of friends as the former had always suspected the latter’s source of power.\nIn a statement shared on his social media handle on Friday, Fani-Kayode slammed Okotie for speaking ill of the late clergyman.\nThe former minister also described Okotie as a coward, wizard, fake pastor, and magician."
  },
  {
    "headline": "Bobrisky cries bitterly after undergoing plastic surgery",
    "summarized_story": "Controversial crossdresser, Okuneye Idris Olarenwaju better known as Bobrisky has cried out yet again in pains following his successful Brazzillian Butt-lift surgery.\nDaily Times that the Nigerian barbie recently underwent butt-lift surgery to enhance his buttock.\nThe controversial crossdresser who had taken to his social media to share photos and video via an Instagram Live session inside the operating theatre room have continued to update his fans about every stage of his surgery.\nBobrisky also disclosed that he’s been sleeping in one position, thankig his housemaid for her support and care.\nI cant hold d aim no more."
  },
  {
    "headline": "Poor welfare: Ondo doctors begin two-week strike",
    "summarized_story": "DOCTORS in Ondo State under the auspices of the National Association of Government General Medical and Dental Practitioners have embarked on a two-week warning strike, alleging that the state government is not taking their welfare seriously.\nSpecifically, the doctors accused the government of failing to pay their salary arrears for some months, failed to resolve the issue of exodus of doctors and other health workers among other matters, hence their service was withdrawn.\nThe association stated this in a letter sent to Governor Rotimi Akeredolu.\nIt read, “With due respect to your office, we write to notify your office of the immediate withdrawal of service by our members working under Ondo State Government Civil Service.\nGovernor which is contained in the letter written to the Nigerian Medical Association Ondo State in March, 2021, among others."
  },
  {
    "headline": "Poor welfare: Ondo doctors begin two-week strike",
    "summarized_story": "DOCTORS in Ondo State under the auspices of the National Association of Government General Medical and Dental Practitioners have embarked on a two-week warning strike, alleging that the state government is not taking their welfare seriously.\nSpecifically, the doctors accused the government of failing to pay their salary arrears for some months, failed to resolve the issue of exodus of doctors and other health workers among other matters, hence their service was withdrawn.\nThe association stated this in a letter sent to Governor Rotimi Akeredolu.\nIt read, “With due respect to your office, we write to notify your office of the immediate withdrawal of service by our members working under Ondo State Government Civil Service.\nGovernor which is contained in the letter written to the Nigerian Medical Association Ondo State in March, 2021, among others."
  },
  {
    "headline": "Tears, tension as suspected herders ambush farmers in Benue, kill 11",
    "summarized_story": "SUSPECTED Fulani herdsmen again struck in Benue State, killing 11 persons in some communities in two local government areas of the state.\nAccording to locals, the suspected herders attacked Anyom community of Mbatyula council ward in Katsina-Ala on Wednesday, while some herdsmen also invaded Zongo-Akiki village in Mbalagh council ward in Makurdi Local Government Areas.\nOne of the locals in Makurdi LGA said that the suspected herdsmen stormed Zongo-Akiki community in the early hours of Thursday where they killed five persons.\nThe Chairman of Makurdi LGA, Anthony Dyegeh, who confirmed the killing of the persons, said the youths were still searching for the missing persons.\nAccording to the media aide to the chairman of Katsina Ala LGA, Tertsea Benga, six persons were reportedly killed."
  },
  {
    "headline": "Tears, tension as suspected herders ambush farmers in Benue, kill 11",
    "summarized_story": "SUSPECTED Fulani herdsmen again struck in Benue State, killing 11 persons in some communities in two local government areas of the state.\nAccording to locals, the suspected herders attacked Anyom community of Mbatyula council ward in Katsina-Ala on Wednesday, while some herdsmen also invaded Zongo-Akiki village in Mbalagh council ward in Makurdi Local Government Areas.\nOne of the locals in Makurdi LGA said that the suspected herdsmen stormed Zongo-Akiki community in the early hours of Thursday where they killed five persons.\nThe Chairman of Makurdi LGA, Anthony Dyegeh, who confirmed the killing of the persons, said the youths were still searching for the missing persons.\nAccording to the media aide to the chairman of Katsina Ala LGA, Tertsea Benga, six persons were reportedly killed."
  },
  {
    "headline": "June 12: Nigerians must stand against those engaging in insurrection, violence",
    "summarized_story": "National Leader, All Progressives Congress, APC, Asiwaju Bola Tinubu has called on Nigerians to stand against those engaging in insurrection and violence as well as those trading in bigotry and hatred.\nHe also urged Nigerians to stand for democracy, saying democratic good governance offered solutions to national challenges.\nThe former governor of Lagos State also urged Nigerians to stand against whatever could hinder democracy.\nI wish all of you a meaningful and happy Democracy Day,” he said.\nThe News Agency of Nigeria (NAN) reports that Nigeria now marks its Democracy Day on June 12 annually instead of May 29."
  },
  {
    "headline": "Sanwo-Olu tasks public officers on dividends of democracy",
    "summarized_story": "By Nimot SulaimonLagos State Governor, Mr Babajide Sanwo-Olu on Friday urged public office holders to deliver dividends of democracy to the citizens.\nThe governor gave the advice on Friday during his Democracy Day message to Lagosians.\nSpeaking to journalists in Lagos, Governor Sanwo-Olu said the ongoing constitutional reform should be a true representation and reflection of what Nigerians are agitating for.\nIt is a day that we will continue to remember as our Democracy Day.\nHow well have we kept to the tenets of real and true democracy?"
  },
  {
    "headline": "June 12: We’ll crush any protest in Lagos – Police",
    "summarized_story": "By Kazeem UgbodagaThe Lagos State Police Command on Friday said it was not aware of any planned protest to commemorate 2021 Democracy Day on June 12 and vowed to quell any of such.\nAcclaimed Yoruba activist, Sunday Igboho has told his members to be ready for massive protest on June 12, 2021 to demand for Yoruba nation.\nBut the police said the public should disregard any sit-at-home order called by certain groups which is being circulated in the social media.\n“The Lagos State Police Command wishes to state clearly that it is not aware of any planned protest in Lagos State to commemorate the 2021 Democracy Day on Saturday, 12th June, 2021.\n“In this regard, the Commissioner of Police, Lagos State, CP Hakeem Odumosu, therefore appeals to members of the public to disregard any sit-at-home order called by certain groups which is being circulated in the social media."
  },
  {
    "headline": "June 12: We Are Not Aware Of Any Planned Protest In Lagos – Police",
    "summarized_story": "The Lagos State Police Command wishes to state clearly that it is not aware of any planned protest in Lagos State to commemorate the 2021 Democracy Day on Saturday, 12th June, 2021.\nIn another development, the Commissioner of Police has formed special Squads to go after traffic robbers who have been terrorising innocent Lagosians and get the state rid of such miscreants.\nThe police boss formed the Squads today Friday 11th June, 2021, at the Command Headquarters.\nCP Hakeem Odumosu equally released some crime fighting equipment and modern communication gadgets to the Squads for efficiency and better service delivery as some of the identified areas like Eko Bridge, Apongbon, Cele, Ijora, Ojota/7up, Mike 12, Surulere etc, must be cleared of miscreants and traffic robbers with immediate effect.\nWhile assuring the general public of adequate security of lives and property in Lagos State, the Commissioner of Police, reiterated that police personnel in the command will religiously discharge their duties within the ambit of the law."
  },
  {
    "headline": "Nigeria Needs Twitter – Senate President, Lawan",
    "summarized_story": "According to Senate President Ahmad Lawan, requires Twitter just as much as it requires the country.\nHe stated that the Senate was confident that the Federal Government and Twitter would work out their differences in the end.\n“In our opinion, Nigeria requires Twitter just as much as Twitter requires Nigeria.\n“Our belief is that Nigeria needs Twitter just as much as Twitter needs Nigeria.\n“We believe that the matter between Twitter and the Federal Government of Nigeria will be resolved."
  },
  {
    "headline": "June 12: Be Fair To All Nigerians – CAN Tells FG",
    "summarized_story": "Nigerians should continue to pray for peace for the country’s well-being, according to the Christian Association of Nigeria (CAN).\nAyokunle, who was represented by the Director of Planning and Social Welfare, Bishop Stephen Adegbite urged the government to be fair to all Nigerians.\nHe reiterated that cattle rearing was a private business, insisting that nobody should destroy the business of another while carrying its own business.\nAyokunle noted that the decision would help to check those hiding under cattle grazing to unleash terror on the residents of the region.\nMeanwhile, the newly elected Chairman of CAN, Southeast zone, Very Rev."
  },
  {
    "headline": "June 12: US Advises Citizens In Nigeria Ahead Of Nationwide Protests",
    "summarized_story": "Several groups have announced their intentions to protest nationwide on June 12, Democracy Day.\nPolice presence and response can be expected nationwide, including in Abuja where Government events are scheduled to celebrate the national holiday and in Lagos where simultaneous protests are planned.\nThe likely locations for the protests in Abuja will be at Unity Fountain (Hilton Hotel area), Wuse, Berger Roundabout, Aguiyi Ironsi Way, Airport Road, and British Circle.\nIn Lagos, the likely locations for protests will be Lekki Toll Gate and Gani Fawehinmi Park.\n· Exercise caution if unexpectedly in the vicinity of large gatherings or protests."
  },
  {
    "headline": "Breaking: Again, Buhari addresses Nigerians ahead June 12",
    "summarized_story": "President Muhammadu Buhari will again on Friday evening feature in an exclusive interview on the Nigerian Television Authority (NTA).\nThe session will be played barely 48 hours after he spoke to Nigerians via Arise Arise TV.\nA statement by Special Adviser to Buhari, Mr. Femi Adesina, said the interview session, is expected to be on air from about 8:30pm.\nDetails loading…"
  },
  {
    "headline": "Breaking: Wrestling champion, Odunayo Adekuoroye, knocks on Olympics gate with gold at Poland Open",
    "summarized_story": "Nigeria’s serial wrestling champion Odunayo Adekuoroye has gold medal at the ongoing at in the women’s 57kg at the Poland Open ranking series in Warsaw ahead next Tokyo 2020 Olympic Games.\nAdekuoroye was awarded the gold after her Belarusian opponent Iryna Kurachkina forfeited the final match following the injury she sustained during her semifinal fight.\nIn the quarter final match against world and Olympic champion American Helen Maroulis, the Nigeria champion avenged her two previous loss as chalked out a shutout 13-0 win over Maroulis.\nAdekuoroye was dominant that she finished the bout with a minute and 32 seconds remaining.\nUnfazed by her opponent’s stardom, Adekuoroye paced the bout according to herself and both wrestlers waited for an opening for the first two minutes of the bout."
  },
  {
    "headline": "Twitter ban, in Nigeria’s or other nation’s interest?",
    "summarized_story": "In this report, BENJAMIN SAMSON and TOPE SUNDAY seek whose interest the ban will serve.\nThe federal government on Friday last week suspended indefinitely the operations of micro-blogging and social networking service, Twitter, in Nigeria.\nAccording to BMO, the decision to temporarily suspend Twitter in the country is in line with the country’s interest.\nIn 2011, David Cameron threatened to shut down Twitter; Twitter had to comply.\nIsrael threatened to shut down Twitter, Twitter had to comply."
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "AMAC: Candido disburses N28.7m scholarships to students -NigPilot",
    "summarized_story": "Executive chairman of Abuja Municipal Area Council, AMAC, Hon.\nAbdullahi Adamu Candido on Thursday disbursed the total sum of N28,750,000 as a scholarship to 1,000 students from the area council to studying in various tertiary institutions across the country.\nHe noted that the scholarship awards were part of his administration’s commitment to support education and encourage students to excel.\nHe added that of the 1,400 applications received, 1,000 candidates were found eligible and selected for the scholarship awards.\nSpeaking to newsmen, some of the award beneficiaries expressed delight and gratitude to the AMAC chairman for the gesture which they described as the first in the area council."
  },
  {
    "headline": "AMAC: Candido disburses N28.7m scholarships to students -NigPilot",
    "summarized_story": "Executive chairman of Abuja Municipal Area Council, AMAC, Hon.\nAbdullahi Adamu Candido on Thursday disbursed the total sum of N28,750,000 as a scholarship to 1,000 students from the area council to studying in various tertiary institutions across the country.\nHe noted that the scholarship awards were part of his administration’s commitment to support education and encourage students to excel.\nHe added that of the 1,400 applications received, 1,000 candidates were found eligible and selected for the scholarship awards.\nSpeaking to newsmen, some of the award beneficiaries expressed delight and gratitude to the AMAC chairman for the gesture which they described as the first in the area council."
  },
  {
    "headline": "2023 Presidency: There are plots to demarket S/East – Dan Nwanyanwu -NigPilot",
    "summarized_story": "He declared that the legitimate agitation for an equitable and fair society in Nigeria and the anger against marginalization against the Igbo people can never be resolved through violence.\n“There is also the dimension of possible sponsorship of “unknown gunmen” to carry out attacks in Igbo land in order to demarket the zone against the 2023 general election.\n“There is no justification in any civilized society for policemen and soldiers to round up unarmed and innocent young men and women for slaughter.\nMany have been abducted from their residences, some woken up from their sleep, taken away and eliminated.\n“It is important to caution that there is a limit to which these genocidal conducts can be endured."
  },
  {
    "headline": "Only National Assembly Can Deal With Restructuring – Buhari",
    "summarized_story": "President Muhammadu Buhari on Friday said only the National Assembly can tackle issues relating to restructuring, true federalism or devolution of powers.\nHe made the remark while receiving members of the Nigerian Inter-Religious Council (NIREC) at the State House in Abuja.\nAccording to the President, the ongoing constitutional review process being conducted by the National Assembly will hopefully address the agitations of those calling for the restructuring of the country.\n“On the contentious issue of restructuring or true federalism or devolution of powers, like you all know, this is a constitutional matter with which only the National Assembly can deal,” the President said, according to a statement signed by his spokesman Femi Adesina.\nAccording to the National Bureau of Statistics, the unemployment rate stands at 33.3%."
  },
  {
    "headline": "VIDEO: Eight Students, Two Lecturers Kidnapped As Gunmen Attack Nuhu Bamali Polytechnic",
    "summarized_story": "Eight students and two lecturers have been kidnapped after gunmen invaded Nuhu Bamali Polytechnic in the Zaria Local Government Area of Kaduna State.\nThe bandits attacked the school located along the Kaduna- Zaria road last night, shooting at students and leaving several others injured.\nThe Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan confirmed this incident to Channels Television early on Friday.\nREAD ALSO: Army Releases New Postings, Appointments Of Senior OfficersAruwan disclosed that one student who was shot died on the spot.\nThe latest incident comes barely three months after bandits attacked the Federal College of Forestry Mechanization Afaka in Igabi local government area of Kaduna state and Greenfield University in Chikun local government areas, where they kidnapped over fifty students and killed five others."
  },
  {
    "headline": "Security Agencies Carrying Out ‘Genocide’ In South-East – Igbo Elders",
    "summarized_story": "The Igbo Elders Council in the Federal Capital Territory (FCT) on Friday accused security agencies of indiscriminately killing Igbo youths in the South-East, in the guise of fighting IPOB and ESN, two separatist groups.\n“We condemn without any reservation the destruction of public properties in the South-East, because it is not in our character to indulge in arson, brigandage,” Ezeife said.\n“Security agencies now indiscriminately invade private homes at odd hours, in the same guise of fishing out presumed IPOB and ESN members.\nHowever, the Muhammadu Buhari administration has since doubled down on its decision to go on the offensive against IPOB members, who have been designated as terrorists.\n“A terrorist organisation (IPOB) poses a significant threat to the safety and security of Nigerian citizens,” the Presidency said in a statement on Saturday."
  },
  {
    "headline": "Nigeria And Twitter Need Each Other – Senate President",
    "summarized_story": "The Senate President, Ahmed Lawan has called for a resolution of the disagreement between Twitter and the Federal Government, stressing that Nigeria and the social media platform need each other.\nLawan said this during a press conference on Friday in Abuja following the Federal Government’s suspension of Twitter’s operations in Nigeria.\n“Nigeria needs Twitter just as Twitter needs Nigeria,” he said, one week after the suspension which has triggered an outcry in the country.\nThe Federal Government of Nigeria had last week announced the indefinite suspension of Twitter in the country.\nHe maintained that the National Assembly is genuine in its intention to amend a constitution to meet the aspirations of Nigerians."
  },
  {
    "headline": "President Buhari To Address Nigerians On June 12",
    "summarized_story": "President Muhammadu Buhari will address Nigerians on the morning of June 12, the presidency said in a statement on Friday.\n“To commemorate Nigeria’s Democracy Day, June 12, 2021, President Muhammadu Buhari will address the nation on Saturday June 12, 2021, at 7am,” a statement signed by spokesman Femi Adesina said.\n“Television, radio stations and other electronic media outlets are enjoined to hook up to the network services of the Nigerian Television Authority and Radio Nigeria for the broadcast.”Earlier on Friday, the Presidency had announced an exclusive interview between the President and the Nigerian Television Authority.\n“President Muhammadu Buhari grants Nigerian Television Authority (NTA) an exclusive interview, from 8.30 pm, Friday, June 11, 2021,” the statement said.\n“It promises to be revealing and educating."
  },
  {
    "headline": "G7 pledges to donate 1 billion Covid-19 Vaccine to poor countries",
    "summarized_story": "G7 leaders are meeting for their first in-person talks in nearly two years, with an expected pledge to donate one billion COVID-19 vaccine doses to the world’s poorest countries.\nThe club of leading economies – Canada, France, Germany, Italy, Japan, the United Kingdom and the United States – say a joint approach is the world’s best chance for recovering from the global health crisis and tackling climate change.\nAdvertisementBut regarding the plan to donate vaccines, campaigners said the pledge – which includes 500 million US doses and 100 million from the UK – does not go far enough.\n“The G7 should break the pharmaceutical monopolies and insist that the vaccine science and know-how is shared with qualified manufacturers around the world.\nAt this historic moment, the G7 must show the political leadership our crisis demands … We urge G7 leaders to raise their ambition."
  },
  {
    "headline": "Bandits kill 14 in Kadawa, Zamfara State",
    "summarized_story": "Police in Zamfara has confirmed the killing of fourteen persons in kadawa village of Zurmi local government area of Zamfara stateThe Community was attacked Thursday night by armed Bandits who stormed the village with sophisticated weapons on motorcyclesConfirming the incidents to TVC NEWS, the spokesperson of the Zamfara state Police Command Supritendant Shehu Mohammed says troops have been deployed the affected communityHe appeal to the people to remain calm and assist security operatives with useful and timely information to clampdown on criminalsCommunities in Zamfara has in recent times experienced attack by armed Bandits leading to the loss of lives and properties.\nAdvertisementThis attack is coming few hours after the state Governor Bello Matawalle directed citizens to protect their community against attack from armed Bandits and other criminals."
  },
  {
    "headline": "PDP Chairman, Ogundele leads protest against OGSIEC",
    "summarized_story": "The Ogun State chapter of the People’s Democratic Party (PDP) has accused the Ogun State Independent Electoral Commission (OGSIEC) of plans to disenfranchise members of the party from participating in the forthcoming local government elections in the state.\nThe party equally alleged the state electoral umpire of interfering in the internal affairs of the party in the state, pointing out that OGSIEC is aiding the ruling All Progressives Congress in the state in avoiding healthy political competition during the council elections.\nThe Ogun State PDP Chairman, Hon.\nSikirulahi Ogundele, raised these allegations during a protest by members of the party to the Iwe Iroyin secretariat of the Nigeria Union of Journalists, Oke Ilewo, Abeokuta, the Ogun State capitalThe protesters were armed with placards with various inscriptions such and maintained that the party has no faction again and claims that the party is divided is part of antics of the opposition to disenfranchise the party’s members."
  },
  {
    "headline": "Twitter Says it’s Ready For Open Discussions With Nigeria",
    "summarized_story": "Twitter says it’s informed the Nigerian government that it’s ready for an open discussion to address mutual concerns and see the microblogging service restored.\nThe comments of the American company comes two days after information minister Lai Mohammed said Twitter had reached out to discuss the possibilities of lifting the ban, without giving further details..“Today marks it one week sine Twitter was blocked in Nigeria, We have informed the Nigerian government that we are ready to meet for an open discussion to address mutual concerns and see the service restored,” Twitter Public Policy said in a statement.\nIt added further that, “we remain advocates for the free and #OpenInternet everywhere.”"
  },
  {
    "headline": "Nigeria: President Buhari Dismisses Idachaba as Broadcasting Commission DG, Appoints Balarabe Ilelah",
    "summarized_story": "President Muhammadu Buhari has sacked Armstrong Idachaba as the Director-General of Nigeria’s National Broadcasting Commission (NBC).\nMr Armstrong’s dismissal comes amidst the frenzy that’s enveloped the ban on Twitter and plots to regulate social media.\nNBC, in a newspaper advertorial on Thursday, asked all social media platforms and online broadcasting service providers in Nigeria to apply for broadcast licences.\nThe Nigerian Minister of Information and Culture, Lai Mohammed, announced the appointment in a statement issued in Abuja on Friday and also announced the appointment of Balarabe Shehu Ilelah, a broadcaster, as the new Director-General of the NBC.\nMr Idachaba was appointed acting Director-General of the commission replacing Modibbo Kawu who was suspended for alleged financial impropriety in February 2020."
  },
  {
    "headline": "Buhari’s Narrative On Terrorists: ‘Treat Them In The Language They Understand’ -Trending With Ojy Okpe",
    "summarized_story": "Nigerians have reacted to the exclusive interview President, Muhammadu Buhari granted to Arise TV, many Nigerians shared mixed reactions on social media as the interview was granted at a time the country yarned for the presidents comment amid wide spread agitations across the country.\nThe Nigerian presidency says a documentary titled Nigeria: Consolidating Democracy and National Unity’ in recognition of Moshood Kashimawo Abiola, as winner of the 1993 presidential election, will premiere tomorrow, June 12th .\nThe federal government of Nigeria has opened an official account on the Indian micro blogging platform Koo.\nIn the meantime, the Attorney General of the Federation and Minister of justice Abubakar Malami has denied asking the Directorate of Public Prosecutions to file charges against Nigerians who were using Twitter to express their views, but to prosecute those who aid and abet the micro blogging platform to circumvent the controversial ban."
  },
  {
    "headline": "Twitter Ban: Nigeria Government Accounts Migrate to Indian Microblogging Platform Koo",
    "summarized_story": "The suspension of Twitter by the Nigerian government has forced the federal government and some agencies of government to move to Koo, an Indian microblogging platform, to keep in touch with the public.\nBarely a week after banning the tech giant over the deletion of a tweet on President Muhammadu Buhari’s account, the federal government has joined the Indian microblogging site.\nIt has already opened an official account on the platform with the handle @nigeriagov and had above 10,000 followers as at Thursday night.\nKoo co-Founder Aprameya Radhakrishna, who confirmed that the platform is now available in Nigeria, said they are working on adding Nigeria’s local languages.\nWe are thinking of enabling the local language there as well."
  },
  {
    "headline": "Nigeria Plans to Launch Digital Currency Before December",
    "summarized_story": "The Central Bank of Nigeria (CBN) has unveiled plans to launch a digital currency before December.\nBut Mohammed added that just like everybody has access to cash, everyone would also have access to the central bank’s digital currency.\n“We have spent over two years studying this concept of central bank’s digital currency and we have identified the risks.\nSo, the central bank’s digital currency is the third form of fiat money.\n“The central bank digital currency will just be as good as you having cash in your pocket."
  }
]