[
  {
    "headline": "Qatar Airways resumes flight to Abuja",
    "summarized_story": "Qatar Airways has commenced a direct flight to Abuja, the Nigerian capital, effective December 1, 2021.\nThe direct flights to the Nigerian capital will no longer be linked to Lagos, offering direct connectivity between Abuja and Doha.\nQatar Airways now offers 100 weekly flights to 27 destinations in Africa.\nAfter just under a year of resuming flights to Lagos and launching to Abuja, following the challenges imposed by the pandemic, it is a testament to the resilience of the African region that we have now introduced direct flights to Abuja.\nQatar Airways also offers strong connectivity to Asia-Pacific with destinations such as Kuala Lumpur, Singapore, Jakarta and Manila among many others."
  },
  {
    "headline": "Edo gets FG’s approval to build new airport",
    "summarized_story": "The Edo State Government has secured the approval of Federal Ministry of Aviation to construct an airport in the Etsako West Local Government Area of the state.\nIn a letter signed by the ministry’s Director of Aerodrome Development, Eng.\nC.O Awogbami, and made available to The PUNCH, the approval was given after due consideration by the agency.\n“The state is also expected to pay the statutory fee, get security clearance from the Director of State Security, Site Survey data in accordance with WGS B4 specification should be done, while the Perimeter Survey of the airport is required.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Massilia Motors plans more high-performance vehicles, transport solutions",
    "summarized_story": "More high-performance models of Mitsubishi brand of vehicles will be introduced to Nigeria in the coming year, Managing Director of Massilia Motors, Mr Patrice Porte, has said.\nHe stated this in Lagos after receiving an award of the most innovative auto company of the year.\nCorps Marshal of the Federal Road Safety Corps, Dr Boboye Oyeyemi, presented the award on behalf of Naja to Massilia Motors.\nWe put in place measures to understand their expectations and to respond to their requests in a timely manner.\nMassilia Motors had earlier been recognised as the most innovative auto company in Nigeria by Marketing Edge magazine."
  },
  {
    "headline": "Araraume disowns composition of Imo Council of Elders",
    "summarized_story": "Says I wasn’t consultedBy Chris OchayiABUJA: Senator Ifeanyi Araraume has washed his hands off the newly-constituted Imo State Elders Council put together by the Imo State Government.\nAraraume announced his decision in a statement issued in Owerri, Imo State Capital by his Media Adviser, Dr. James Okoroma.\nREAD ALSO Detained Soldier: Why NYSC may not interfere with Army’s in-house policy — NYSC staffSenator Araraume who is the Chairman of the Board of the Nigerian National Petroleum Company Limited maintained that it was procedurally wrong for the Imo State Government to have first listed and published his name as a member of the Council without consulting him.\nHe added that while he was not averse to any genuine effort at peace-making and consensus-building in the State, he would not cave in to under-hand tactics meant to blackmail and take advantage of Leaders who are never taken into confidence on the way Imo State is governed.\nHe further disclosed that as one of the leaders of Imo State and the All Progressives Congress, APC, he was praying for the restoration of peace and security in the State, insisting that God would not abandon Imo people in the current economic and security challenge confronting them."
  },
  {
    "headline": "Iwuoha’s death, rude shock – Abia govt",
    "summarized_story": "He said the incident had thrown the Ministry of Information and the entire state into a mournful mood.\nChikamnayo described Iwuoha as “a very unassuming man, a seasoned Editor and Media administrator”.\nBonnie Iwuoha was the pioneer NUJ President of Igbo extraction who faught a lot of battle to get to that exalted position.\nHis death came as a rude shock to the state.\n“He was an unassuming man, and and dogged fighter in any cause he believed in."
  },
  {
    "headline": "Power Shift advocacy group honours Ugwuanyi as ‘Most Youth-friendly Governor in Nigeria’",
    "summarized_story": "Presenting the award alongside the National Publicity Secretary of PSM, Bright Uyiosa Omoruyi and the Enugu State Deputy Director, Mrs. Onyinye Mamah, the National Coordinator, Nonso Nnamani, told Gov.\nUgwuanyi that the recognition was also “for your exemplary leadership qualities and your administration’s remarkable, sterling and matchless achievements in youth inclusion and as the Best Youth-friendly Governor in Nigeria”.\nNnamani added: “You have set the legacy of bringing young and credible youths to centre politics to showcase their capabilities and potentials.\n“Therefore, on behalf of the Nigerian youths and members of Power Shift Movement, it is with great pride and honour that we present this National Ambassador Honour to His Excellency, Rt.\nDr. Ifeanyi Ugwuanyi (Executive Governor, Enugu State).”Speaking further the leader of the movement pointed out that the award will spur Gov."
  },
  {
    "headline": "East West road to gulp over a half Trillion Naira when completed —FG",
    "summarized_story": "By Chris OchayiABUJA: The Federal Government has said that the Sections I-V of the East West highway dualisation project would cost above half a Trillion Naira when completed.\nThe Section I-V of the road project span across five States of the region, including Delta, Bayelsa, Rivers, Akwa Ibom and Cross River.\nThe Permanent Secretary, Ministry of Niger Delta Affairs Dr. Babayo Ardo made the disclosure at the Stakeholders’ validation workshop on “Access Management and Mitigation Action Plan” held on Monday in Uyo, Akwa Ibom State capital.\nBabayo Ardo further stated that the East-West road corridor, like most other Federal roads in Nigeria is being impacted by settlement developments in many towns and cities along it, which includes Ughelli, Patani, Port Harcourt and Eket.\nAccording to him, “It is for this reason that the Ministry birthed the complementary programme to rally collective efforts to plan, protect and manage the road corridor to curtail the natural tendencies of settlement growths towards it."
  },
  {
    "headline": "20 yrs after: Publicise your investigations on Bola Ige’s death, Soyinka asks Buhari",
    "summarized_story": "By Nwafor Sunday“Unsolved crimes only lead to a culture of impunity”, said Professor Wole Soyinka, on the 20th anniversary of Chief Bola Ige, the former Attorney General of the Federation and Minister of Justice.\nHowever, 20 years later, Soyinka queried President Muhammadu Buhari to make public the outcome of his investigations on Bola Ige’s death.\nWith the theme “20TH YEAR OF BOLA IGE MEMORIAL SYMPOSIUM, 2 DECADES OF INJUSTICE: WHAT ARE THE IMPLICATIONS ON NIGERIAN DEMOCRACY” organised by the BOLA IGE FOR JUSTICE CENTRE, the event witnessed prominent personalities that spoke against injustices in the country.\nBOLA IGE, AS THE NATION’S MINISTER OF JUSTICE, AND UNITED NATIONS’ CIVIL SERVANT DESIGNATE, WAS UNARGUABLY ONE SUCH.\nPRESIDENT BUHARI, SHARE THE REWARDS OF YOUR INVESTIGATIONS – IF ANY!!!"
  },
  {
    "headline": "Jigawa assembly rejects marriage age limit, passes Child Rights Bill",
    "summarized_story": "A bill to protect children from abuse has been passed into law by the Jigawa State House of Assembly.\nHowever, the bill excluded the regulation of underage marriage in the state due to its religious inclination and other controversy.\nMr Muhammad further said that the bill was designed in compliance with the Islamic model of the child protection bill.\nIn his words: “The issue of underage marriage is totally expunged in the bill.\nJigawa State is said to have one of the highest rates of child marriage and street children (Almajiri) in the country with more than 80 percent of its girls married before their 18th birthday."
  },
  {
    "headline": "2023: Why I want Atiku Abubakar to be next president of Nigeria – Reno Omokri [VIDEO]",
    "summarized_story": "Former presidential aide, Reno Omokri has revealed why he wants former Vice President, Alhaji Atiku Abubakar to be the next Nigerian President.\nReno claimed that Atiku currently has about 5,000 employees, noting that he pays them about the national minimum wage.\nHe said, “Earlier today, I called on Alhaji Atiku Abubakar to contest for the 2023 presidential election and to declare on the platform of the People’s Democratic Party, PDP.\n“Atiku Abubakar currently employs 50,000 people and he is paying them above minimum wage.\nThis is the man that has throughout his life shown that he knows how to create jobs and that is what the Nigerian Young people need."
  },
  {
    "headline": "AuGF’s audit report on N375.8 million vehicle purchase misleading – NILDS",
    "summarized_story": "The National Institute for Legislative and Democratic Studies (NILDS), has reacted to a report by the Office of the Auditor General of the Federation on alleged purchase of N375.8 million vehicle sometime in 2016.\nIn the report, the erstwhile Director General of NILDS, Prof. Ladi Hamalal suspiciously paid another sum of N67 million into another account with a commercial bank.\nReacting, NILDS faulted the report, saying the Auditor General wasn’t detailed before rushing to submit the controversial report to the Senate Committee on Public Accounts chaired by Senator Mathew Uroghide.\nWhen NILDS was contacted, it was found out that the issues had been addressed in 2018 when they were first raised.\nA source in the institute explained that “NILDS had in 2018 responded by giving all the information to the public Accounts Committee and the matter was cleared."
  },
  {
    "headline": "Aisha Buhari sends her staff on indefinite leave amid pregnancy rumours",
    "summarized_story": "President Muhammadu Buhari’s wife, Aisha, has ordered all her staff to proceed on an indefinite leave, amid rumours she is pregnant.\nPictures of Buhari, 79, Aisha, 50, in Turkey between December 16 and 19, 2021 sparked pregnancy rumours, as she was pictured to have cradled what looked like a bump.\nIn the statement, Kamal noted that the First Lady ordered the members of staff in her office to proceed on an indefinite leave and continue work virtually.\n“This serves to inform all members of staff that the office of the First Lady will be closed for the upcoming festive period of Christmas and New Year.\n“To this end, all staff members are requested to proceed on leave, until further notice."
  },
  {
    "headline": "Buhari govt has disbursed N100bn to unemployed Nigerians – Keyamo",
    "summarized_story": "Festus Keyamo, the Minister for Labour and Employment, has disclosed that the Federal Government has disbursed N100 billion to unemployed youths and small businesses.\nKeyamo disclosed that the money was disbursed to Nigerians in the last five years.\nRepresented by Abubakar Nuhu Fikpo, Director-General of the National Directorate of Employment, NDE, Keyamo said the money was disbursed through the Development Bank of Nigeria.\nAccording to Keyamo: “Let me inform you all that the Federal Government has put all plans in place to ensure that businesses succeed in Nigeria.\n“It is heartwarming to note that 52 percent of loans disbursed in 2019 and 2020 were to youths and women-owned businesses.”"
  },
  {
    "headline": "‘Monarch accused me of being too stingy with money’",
    "summarized_story": "‘Monarch accused me of being too stingy with money’As governor of Osun State, Chief Bisi Akande had problems with the immediate past Ooni of Ife, Oba Okuade Sijuwade, and the Owa-Obokun of Ijeshaland, Oba Adekunle Aromolaran.\nHe also said Oba Aromolaran was always saying bad things about him because of his belief that he was stingy.\nI told him that Osun State had no money now to buy cars for traditional rulers.\n- Advertisement -“But his pestering was too much and I secretly sent money to him to buy a car.\nHe explained that the late Ooni wanted him to renew the Ede-Osogbo Waterworks which was to be repaired with $300 million."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Kalu mourns demise of ex-NUJ president Bonnie Iwuoha",
    "summarized_story": "By Iheanacho Nwosu, LagosFormer Governor of Abia State and Chief Whip of the Senate Dr Orji Kalu has commiserated with the Nigeria Union of Journalists (NUJ) over the demise of its former president, Mr Bonnie Iwuoha.\nDescribing his demise as a big loss to the media profession, Kalu acknowledged the contributions of the late journalist to the media industry.\nKalu said ‘the demise of former President of the Nigeria Union of Journalists (NUJ), Mr Bonnie Iwuoha is painful.\n‘The late journalist upheld the ethics of the media profession in his lifetime.\n‘The late journalist will be sorely missed.’Kalu prayed to God to grant the deceased eternal rest and give the Iwuoha family the fortitude and to bear the loss."
  },
  {
    "headline": "BREAKING: Court slams N2 million fine on NIS over Odili’s seized passport",
    "summarized_story": "From Godwin Tsa, AbujaJustice Inyang Ekwo of the Abuja Division of the Federal High Court on Tuesday slammed a fine of N2 million against the Nigeria Immigration Service (NIS) for refusing to appear in court on two occasions in the hearing of the seized passport of former Rivers State Governor Peter Odili.\nJustice Inyang Ekwo, who frowned at the action of the NIS and its lawyer, Mr JA Adamu, described the Service’s action as unprofessional and gross disregard for the court.\nJustice Ekwo ordered the Attorney General of the Federation (AGF) and Minister of Justice to ‘take disciplinary action against JA Adamu, who has been appearing in court for the respondent/applicant for his unprofessional conduct.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nFollowing the action of the NIS, Odili had approached the court to order the release of his passport as the action of the NIS, without any reasonable excuse, violated his fundamental human rights."
  },
  {
    "headline": "Lawan confirms Buhari’s rejection of Electoral Amendment Bill",
    "summarized_story": "From Fred Itua, AbujaPresident of the Senate, Ahmad Lawan, on Tuesday, acknowledged the receipt of a letter from President Muhammadu Buhari, rejecting the Electoral Amendment Bill, 2021.\nHe further cited lack of funds on the part of the Independent National Electoral Commission (INEC), to monitor direct primaries across the country in 2023 and going forward.\nSpeaker of the House of Representatives, Femi Gbajabiamila, is the arrowhead behind the removal of indirect primaries and imposition of direct primaries.\nGbajabiamila had claimed in November that Buhari was in support of direct primaries.\nHe had also claimed that they had his blessing to settle for direct primaries only."
  },
  {
    "headline": "Electoral Bill: Senate receives Buhari’s letter declining assent, to discuss it this morning",
    "summarized_story": "The Senate President, Ahmad Lawan, has received President Muhammadu Buhari’s letter informing the National Assembly of his decision not to assent to the Electoral Amendment Bill.\nAs reported by Daily Sun on December 9, 2021, President Buhari declined to assent to the Bill citing reasons.\nSome of the reasons President Buhari gave in the letter to the National Assembly include the provision making direct primaries compulsory for political parties and insecurity.\nDaily Sun gathered that the letter from Buhari will be read on the floor of the Senate as soon as senators resume sitting any moment from now.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood."
  },
  {
    "headline": "Buhari withholds assent from electoral bill",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAs exclusively reported by the Daily Sun on Wednesday December 9, President Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021.\nBuhari also noted that adopting direct primaries has implications on the rights of citizens to participate in the government, as constitutionally insured.\nHe further stated that security agencies will also be overstretched, as direct primaries will be open to participation from all and sundry.\nMeanwhile, the Presidency has said the National Assembly is free to make public President Buhari’s reasons for withholding assent to the Electoral Act Amendment Bill 2021.\n“The President has sent a letter to the National Assembly stating his position on the bill amending the electoral act."
  },
  {
    "headline": "Breaking: House Passes 2022 Budget, Raises Sum to N17trn",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives at the plenary, Tuesday passed the 2022 appropriation Bill sent to it by President Muhammadu Buhari, raising the sum to N17.126 trillion.\nRecall that Buhari had in October presented to both chambers of National Assembly, the Appropriation bill tagged a “Budget of Economic Growth and Sustainability.” estimated at ₦16.39trillion.\nThe passage of the budget followed the consideration and adoption of clauses in the Bill’s report presented by the Chairman Appropriation Committee, Hon.\nMuktar Betara.\nDetails later………Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: FG Restores Emirates’ Flight Schedule",
    "summarized_story": "Chinedu EzeThe Federal government has reinstated Emirates Airlines daily schedule to Nigeria.\nThis was contained in a letter signed by Musa Nuhu, director general, Nigeria Civil Aviation Authority, (NCAA), addressed to the country manager, Emirates Airlines.\nIt will be recalled that Hadi Sirika, the minister of aviation, and Musa Nuhu, the Director-General of Nigerian Civil Aviation Authority (NCAA), restricted Emirates to just one weekly flight to Abuja after discussions broke down over restriction of Nigerian flag carrier Air Peace to just one flight to Sharjah by UAE.\nIn response, Emirates withdrew flight services to Nigeria in what led to a diplomatic row between the two countries.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Withholds Assent to Electoral Bill, Says Imposing Direct Primaries Undemocratic",
    "summarized_story": "He argued that direct primaries as envisaged by the Electoral Act (Amendment) Bill 2021 would significantly raise the cost of conducting primary elections by political parties and could have negative implications on the outcome of elections.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\n“It is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\nWike: N’Assembly Can’t Veto Buhari’s Refusal to Sign Electoral BillRivers State Governor, Mr. Nyesom Wike, has said the National Assembly lacked the temerity to veto President Muhammadu Buhari’s withholding of assent tp the Electoral Act amendment bill.\nHis words: “What APC resolved in the meeting they had was that their problem is not necessarily direct primaries, but the electronic transmission of result in 2023."
  },
  {
    "headline": "Lagos Raises N137.3bn Through Bond to Finance Infrastructure Projects",
    "summarized_story": "These he listed to include the Lagos-Badagry Expressway, Lekki Regional Road, Rehabilitation of Ijeododo road and Rehabilitation of the alternative route to Admiralty Circle Toll Plaza.\n“The conclusion of this process will bring to N377.715 billion the total value of bond issued from the Lagos State N500 billion debt issuance programme.\n“In line with the state’s vision to build a Greater Lagos, the proceeds of the Bond will be used to finance key infrastructure projects, primarily in roads and healthcare.\nThese include the Lekki Regional Road, Rehabilitation of Ijeododo road and Rehabilitation of the alternative route to Admiralty Circle Toll Plaza.\n“We equally thank the investing community for their sustained support of Lagos State and our efforts to improve the social and economic welfare of all residents in Lagos."
  },
  {
    "headline": "NCDC Begins Campaign to Curb Omicron, Delta Variants’ Spread",
    "summarized_story": "According to the NCDC, Nigeria has recorded a 500 per cent increase in the number of confirmed COVID-19 cases over the past two weeks across the country due to the Delta and Omicron variants.\nA statement by the centre yesterday said the campaign tagged, “#TakeResponsibility campaign” first began in February, 2020It focuses specifically on measures Nigerians needed to take to protect themselves and loved ones from COVID-19 during this period.\n“Therefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures.\n“Critically, Nigerians are urged to adhere to recommended measures by NCDC and other public health authorities, as they celebrate Christmas and New Year,” it added.\nHe pleaded with residents of the Federal Capital Territory to minimise physical contacts and other non-pharmaceutical measures to control the spread of the virus."
  },
  {
    "headline": "Leaked Audio From Anti-graft Agency EFCC Operative Exposes How Attorney-General, Malami Ordered Unfreezing Of ‘Big Cases’ Bank Accounts",
    "summarized_story": "“If he has money in any account linked with his BVN (Bank Verification Number), he should quickly evacuate them.\nYusuf had also specifically mentioned Malami as the one in charge of the EFCC, and the minister had ordered the unfreezing of “big accounts” investigated by the commission.\nThey are unfreezing suspects’ accounts, including the big cases,” the EFCC operative was heard saying in the audio.\nAlso his account was recently unfrozen to enable them to quickly move out the money as advised by the EFCC operative.\nTwo other accounts – 2120012772 ($57,080.38) and 1060100885 (N2,390,987.69) – were held in Skye Bank in Mr Yusuf’s name."
  },
  {
    "headline": "Leaked Audio From Anti-graft Agency EFCC Operative Exposes How Attorney-General, Malami Ordered Unfreezing Of ‘Big Cases’ Bank Accounts",
    "summarized_story": "“If he has money in any account linked with his BVN (Bank Verification Number), he should quickly evacuate them.\nYusuf had also specifically mentioned Malami as the one in charge of the EFCC, and the minister had ordered the unfreezing of “big accounts” investigated by the commission.\nThey are unfreezing suspects’ accounts, including the big cases,” the EFCC operative was heard saying in the audio.\nAlso his account was recently unfrozen to enable them to quickly move out the money as advised by the EFCC operative.\nTwo other accounts – 2120012772 ($57,080.38) and 1060100885 (N2,390,987.69) – were held in Skye Bank in Mr Yusuf’s name."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Gets New Senior Attorney To Lead Defence Against Nigerian Government",
    "summarized_story": "Ifeanyi Ejiofor, the lead counsel to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has said that an undisclosed senior attorney will henceforth lead the defence team of the pro-Biafra separatist leader.\nThe statement read, “We paid our routine visit to our untiring, unwavering, unrelenting, rock-solid and noble client, Onyendu Mazi Nnamdi Kanu, yesterday, at the DSS detention facility at Abuja.\nAlthough he was not oblivious of my arrangement to enlist the assistance and co-operation of a Senior attorney, he did not know that I could get a Senior attorney of the rarest breed.\n“I must state here and now that the Senior attorney involved has been my mentor over the years.\nHe has worked from the sidelines with our legal team since 2016."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Gets New Senior Attorney To Lead Defence Against Nigerian Government",
    "summarized_story": "Ifeanyi Ejiofor, the lead counsel to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has said that an undisclosed senior attorney will henceforth lead the defence team of the pro-Biafra separatist leader.\nThe statement read, “We paid our routine visit to our untiring, unwavering, unrelenting, rock-solid and noble client, Onyendu Mazi Nnamdi Kanu, yesterday, at the DSS detention facility at Abuja.\nAlthough he was not oblivious of my arrangement to enlist the assistance and co-operation of a Senior attorney, he did not know that I could get a Senior attorney of the rarest breed.\n“I must state here and now that the Senior attorney involved has been my mentor over the years.\nHe has worked from the sidelines with our legal team since 2016."
  },
  {
    "headline": "Court Declares Nigerian Actress, Ronke Odusanya's Baby Daddy Wanted",
    "summarized_story": "Meanwhile, a magistrate court in Lagos State has declared Saheed wanted following his failure to show up in court.\nSome months ago, the social media space was saturated with the sudden break-up of Odusanya and her baby daddy, Saheed.\nOn February 10, 2021, Saheed stood before the court and requested a DNA test of their daughter to determine paternity before carrying on with proceedings.\nOn the last court date early December 2021, he was declared wanted by the court.\nDOCUMENTS: Court Declares Nigerian Actress, Ronke Odusanya's Baby Daddy Wanted by Sahara Reporters on Scribd"
  },
  {
    "headline": "ICYMI: 45 farmers killed in attacks on Nasarawa communities",
    "summarized_story": "A total of 45 farmers have been killed following attacks in communities across LGAs in Nasarawa state.\nAdvertisementThe farmers were said to have been killed following clashes that led to attacks on Lafia, Obi and Awe LGA areas of the state over the weekend.\nThe killings were said to have been reprisal attacks in renewed hostilities between farmers and herders in the three LGAs.\nAdvertisementSpeaking on the attacks, Ramhan Nansel, the Nasarawa police spokesman, said a complaint was made on Friday that one Umaru Idrisu of Gidan Washi village in Obi LGA was killed by armed men.\n“While the investigation was ongoing, a suspected reprisal attack was carried out by unknown persons in Hangara village, Lafia east development area in Lafia LGA and crossed over to the neighbouring Kwayero village of Obi LGA,” Nansel said."
  },
  {
    "headline": "ICYMI: 45 farmers killed in attacks on Nasarawa communities",
    "summarized_story": "A total of 45 farmers have been killed following attacks in communities across LGAs in Nasarawa state.\nAdvertisementThe farmers were said to have been killed following clashes that led to attacks on Lafia, Obi and Awe LGA areas of the state over the weekend.\nThe killings were said to have been reprisal attacks in renewed hostilities between farmers and herders in the three LGAs.\nAdvertisementSpeaking on the attacks, Ramhan Nansel, the Nasarawa police spokesman, said a complaint was made on Friday that one Umaru Idrisu of Gidan Washi village in Obi LGA was killed by armed men.\n“While the investigation was ongoing, a suspected reprisal attack was carried out by unknown persons in Hangara village, Lafia east development area in Lafia LGA and crossed over to the neighbouring Kwayero village of Obi LGA,” Nansel said."
  },
  {
    "headline": "Senate spokesman: It's presumptuous for Buhari to reject electoral bill over cost of direct primary",
    "summarized_story": "Ajibola Basiru, spokesperson of the senate, says the argument of President Muhammadu Buhari on the issue of cost of direct primary in the electoral act amendment bill is “totally fallacious”.\nCompulsory direct primaries for political parties and electronic transmission of election results are among the amendments proposed by the national assembly.\nBut Buhari rejected the bill on the grounds of insecurity and cost of conducting direct primaries, adding that the recommendation “violates the spirit of democracy”.\nAnd I believe the national assembly, at the fullest of time, will be able to take those options,” he said.\nAdvertisement“As regards argument on smaller political parties, smaller political parties may decide to even organise their direct primary at the state level."
  },
  {
    "headline": "Senate spokesman: It's presumptuous for Buhari to reject electoral bill over cost of direct primary",
    "summarized_story": "Ajibola Basiru, spokesperson of the senate, says the argument of President Muhammadu Buhari on the issue of cost of direct primary in the electoral act amendment bill is “totally fallacious”.\nCompulsory direct primaries for political parties and electronic transmission of election results are among the amendments proposed by the national assembly.\nBut Buhari rejected the bill on the grounds of insecurity and cost of conducting direct primaries, adding that the recommendation “violates the spirit of democracy”.\nAnd I believe the national assembly, at the fullest of time, will be able to take those options,” he said.\nAdvertisement“As regards argument on smaller political parties, smaller political parties may decide to even organise their direct primary at the state level."
  },
  {
    "headline": "Electoral bill: Buhari's courage should be commended, says Fayemi",
    "summarized_story": "Kayode Fayemi, governor of Ekiti, says President Muhammadu Buhari should be commended for the decision he took on the electoral act amendment bill.\nThe legislation provides for the electronic transmission of election results and the compulsory use of direct primary to pick candidates by all political parties.\nBut Buhari rejected the bill, saying the amendment may open up the electoral system to litigations, adding that adopting direct primary “violates the spirit of democracy”.\nAnd my election to my second term in office was via an indirect primary,” Fayemi said.\n“Direct primaries have their own challenges; indirect primaries have their own challenges."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "New AIG assumes duty in zone 5, Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A new Assistant Inspector General of Police has assumed duty in zone 5 Command headquarters, Benin City.\nThe new AIG assumed duty on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia.\nDC Operations, Kaduna State Command.\nCommissioner of Police, Special Fraud Unit, FCID, FHQ, Abuja; Commissioner of Police, Ekiti State Command; CP.\nKaduna State Command; CP."
  },
  {
    "headline": "Obaseki to increase Edo workforce, deepen ongoing reforms in civil, public service in 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government will, in 2022, sustain ongoing transformation in the state’s civil and public service, enhancing the work environment and boosting the capacity of the workers for optimal service delivery.\nObaseki, who spoke to journalists in Benin City, said his administration will in the forthcoming year commence phase two of the ongoing recruitment exercise and expand in-service training opportunities for public and civil servants.\nSpeaking to journalists, Obaseki said his government is committed to retooling the civil service and equipping workers with the right skills to deliver efficient and effective service to the Edo people.\nAccording to him, “In the new year, we would deepen the ongoing public/civil service transformation through increased process enhancement and automation.\n“We launched the Edo State Public/Civil Service Transformation Program (EdoSTEP) to institutionalise and monitor this process, just as continuous in-service capacity enhancement programmes are ongoing at the John Odigie-Oyegun Public Service Academy.”..."
  },
  {
    "headline": "Edo explores investment opportunities in LGAs, surveys three councils – Nigerian Observer",
    "summarized_story": "Managing Director, Edo Investment Promotion Office (ESIPO), Mr. Kelvin Uwaibi, disclosed this at the Validation of Areas Potential Survey Report, held in Benin City.\nI am quite happy about the three LGAs selected for this pilot survey because in each, there are tertiary institutions, which also brings huge opportunities.\nSo, the potentials in these tertiary institutions in the LGAs would be utilized optimally.\nIn her remarks, Edo State Coordinator for GIZ-SEDEN, Blessing Ajimoti, noted, “We want to get data and meet the stakeholders.\nWe want to know what the investment opportunities that exist in the various local governments to positively impact on the state’s economy.”..."
  },
  {
    "headline": "Senate confirms Engr Muazu. Sambo as Minister of Power – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The confirmation came when the appointee appeared before senate chamber for screening in Abuja.\nEngr Muazu Sambo who has served in several capacities for 35 years, such as Nigeria Port Authority and Banking sector said he has sufficient knowledge in the infrastructural development sector and assured Nigerians of his ability to deliver.\nAsked how he would use his wealth of experience to make Mambila power project work, Looking at the myriad of problems associated to the power project including court cases, Engr Muazu Sambo said the problem of Mambila is Human and having come from Taraba he would be able to solve the problems of Mambila in a short time.\nSpeaking to National Assembly correspondents soon after the confirmation, Engr Muazu Sambo appealed for prayer from the public while assuring Nigerians that he would do his best, the confidence repose in him by Mr president.\nRecalled that the Ministers of power and Agriculture were sacked recently by Mr president for poor performance and immediately appointed Muazu Sambo and that of Agriculture as ministers designate subject to senate confirmation."
  },
  {
    "headline": "US secret service says criminals have stolen nearly $100bn in Covid-19 relief funds",
    "summarized_story": "The United States Secret Service said on Tuesday that criminals have stolen close to $100 billion in Covid-19 pandemic relief funds.\nThe stolen funds, the service said, were diverted by fraudsters from the Small Business Administration’s Paycheck Protection Program, the Economic Injury Disaster Loan program and a another program set up to dole out unemployment assistance funds nationwide.\nThe agency, however, said more than $2.3 billion in stolen funds have been recovered so far, resulting in the arrest of more than 100 suspects who span the spectrum from individuals to organized groups.\nDotson, in an interview with CNBC, said the ease of obtaining the funds has made it easier for criminals.\nThe fast rollout of the Pandemic Unemployment Assistance program made it easy prey for fraudsters."
  },
  {
    "headline": "Reps approve N17.1trn 2022 budget",
    "summarized_story": "Nigeria’s House of Representatives today, Tuesday, approved the sum of N17.127 trillion budget for 2022 fiscal year, against the sum of N16.391 trillion proposed in the budget estimates submitted by President Muhammadu Buhari.\nBreakdown of the budget showed that Statutory transfer will take N869.667 billion; Recurrent Expenditure of N6.910 trillion; Capital expenditure of N5.467 trillion and Debt Services of N3.870 trillion.\nThe House also approved the 1.88mbpd as daily oil production; $62 oil benchmark price; N410/$ exchange rate; 4.2% GDP growth rate and 13% inflation rate for the 2022 fiscal year.\nAlso approved is an increase in the oil price benchmark from $57 to $62; increased the deficit by N98 billion to accommodate some other requests of national importance not provides for inthe budget estimates and which could not be covered by the revenue increaseFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "For the Record: Text of Buhari’s letter withholding assent to electoral act amendment bill",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari on sent his letter to the National Assembly to communicate his decision not to assent to the electoral act amendment bill passed by the assembly in November.\nTitled, ‘Withholding of Assent to Electoral Act Amendment Bill 2021,’ the letter read:“Further to the fetter dated 18th November, 2021, forwarded for presidential assent, the Electoral Act (Amendment) Bill 2021, as passed by the National Assembly, I have received informed advice from relevant ministries, departments and agencies of the government, and have also carefully reviewed the bill in light of the current realities prevalent in the Federal Republic of Nigeria in the circumstances.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "NCC sets new Mobile International Termination Rate for voice services paid by overseas telco carriers",
    "summarized_story": "The Nigerian Communications Commission (NCC), has determined the new International Termination Rate (ITR) for voice services paid by overseas telecom carriers for terminating international calls on local networks in Nigeria at $0.045.\nAccording to him, “The new rate is contained in the ‘Determination of Mobile International Termination Rate’ issued by the Commission on November 25, 2021.\n“No licensee shall charge and or receive effective rate per minute below determined ITR floor rate.\n“However, while the ITR only pertains to the cost of bringing traffic into Nigeria, Nigerian operators will continue to pay the regulated Mobile Termination Rate (MTR), the local termination rate among themselves.\n“The subsisting regime of interconnection rates was sustained by the Commission’s Mobile (voice) termination rate issued on June 1, 2018."
  },
  {
    "headline": "Me Ya Faru A wajan Gudanar Da Taron Addu’a Da Karrama Bala Abu Musawa A Dandume?",
    "summarized_story": ""
  },
  {
    "headline": "Zimbabwe Ta Karbi Sabon Tallafin Alluran Rigakafin COVID-19 Daga Sin",
    "summarized_story": ""
  },
  {
    "headline": "Kasar Sin Ta Kafa Cibiyar Kula Da Iskar Gas",
    "summarized_story": ""
  },
  {
    "headline": "Wane Ne Ke Lalata Dimokuradiyyar Hong Kong?",
    "summarized_story": ""
  },
  {
    "headline": "“Ayyuka 9” Za Su Amfani Jama’ar Kasashen Afirka Da Sin",
    "summarized_story": ""
  },
  {
    "headline": "National HQs of APC Uphold Position of Uba-led Anambra Stakeholders",
    "summarized_story": "By TONY ADAMS…declare Basil Ejidike as authentic state chairman…shun Minister Ngige’s demand for dissolution of state caretaker committee; describing activities of his group as “dissidents” actionThe battle for the soul of the All Progressives Congress, APC in Anambra State has moved up a notch higher with the decision of the national secretariat of the party reaffirming Hon.\nBasil Ejidike as Chairman of the state chapter.\nBut in a move which apparently aligns with the position of critical stakeholders from the state, led by Senator Andy Uba, the national headquarters of the APC rather than heed the Minister’s advise, described the activities of his group as that of “dissidents” and went ahead to concretize Ejidike’s position as Anambra State Chairman of the Party.\n(Sir) Basil Ejidike is the State Chairman of APC in Anambra State and has the mandate of the National Secretariat to relate with the security agencies on our behalf on all matters pertaining to his State Chapter,” the APC scribe stated.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "National HQs of APC Uphold Position of Uba-led Anambra Stakeholders",
    "summarized_story": "By TONY ADAMS…declare Basil Ejidike as authentic state chairman…shun Minister Ngige’s demand for dissolution of state caretaker committee; describing activities of his group as “dissidents” actionThe battle for the soul of the All Progressives Congress, APC in Anambra State has moved up a notch higher with the decision of the national secretariat of the party reaffirming Hon.\nBasil Ejidike as Chairman of the state chapter.\nBut in a move which apparently aligns with the position of critical stakeholders from the state, led by Senator Andy Uba, the national headquarters of the APC rather than heed the Minister’s advise, described the activities of his group as that of “dissidents” and went ahead to concretize Ejidike’s position as Anambra State Chairman of the Party.\n(Sir) Basil Ejidike is the State Chairman of APC in Anambra State and has the mandate of the National Secretariat to relate with the security agencies on our behalf on all matters pertaining to his State Chapter,” the APC scribe stated.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Reps pass 2022 budget, raises it from N16trn to N17trn",
    "summarized_story": "Reps pass 2022 budget, raises it from N16trn to N17trnReps pass 2022 budget, raises it from N16trn to N17trnThe House of Representatives has passed the 2022 budget into law.\n“In the same vein, on conclusion of work on the 2022 budget engagement/defense with MDAs under their jurisdiction, Sub-Committees submitted and defended their reports before the Appropriations Committee from Wednesday 10th to Friday, November 26.\nRevenue projection for the 2022 budget“The 2022 Budget Report is predicated on the Medium-Term Expenditure Framework/Fiscal Strategy Paper (MTEF/FSP) approved by the National Assembly.\nThe SenateMeanwhile, the Senate did not consider the report of the 2022 Appropriation Bill.\nBut sources said the Upper Chamber will deliberate on the report and probably pass the 2022 budget tomorrow (Wednesday)."
  },
  {
    "headline": "Reps pass 2022 budget, raises it from N16trn to N17trn",
    "summarized_story": "Reps pass 2022 budget, raises it from N16trn to N17trnReps pass 2022 budget, raises it from N16trn to N17trnThe House of Representatives has passed the 2022 budget into law.\n“In the same vein, on conclusion of work on the 2022 budget engagement/defense with MDAs under their jurisdiction, Sub-Committees submitted and defended their reports before the Appropriations Committee from Wednesday 10th to Friday, November 26.\nRevenue projection for the 2022 budget“The 2022 Budget Report is predicated on the Medium-Term Expenditure Framework/Fiscal Strategy Paper (MTEF/FSP) approved by the National Assembly.\nThe SenateMeanwhile, the Senate did not consider the report of the 2022 Appropriation Bill.\nBut sources said the Upper Chamber will deliberate on the report and probably pass the 2022 budget tomorrow (Wednesday)."
  },
  {
    "headline": "How I killed Maria Igbinedion – Housemaid Dominion Okoro",
    "summarized_story": "A 25-year-old housemaid Dominion Okoro has revealed how she killed Madam Maria Oredola Igbinedion, the mother of a former Governor of Edo State, Chief Lucky Igbinedion.\nOkoro made the startling revelation when she was paraded at Edo State Police headquarters in Benin on Tuesday.\nShe said, “I killed Mama (Madam Maria Igbinedion) to carry her money.\nHe noted that no fewer than 20 persons were first arrested before Dominion was arrested in her hometown in Calabar.\nOgbadu also stated the Edo State Police Command recovered 452 arms and ammunition from suspects between August and Dec. 21."
  },
  {
    "headline": "NNPC presents N621.24bn cheque for reconstruction of 21 roads",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), on Tuesday handed over a symbolic cheque of N621.24 billion for the rehabilitation of 21 critical roads across the country through the Tax Credit Scheme under the Executive Order 7 signed by President Muhammadu Buhari in 2019.\n“The Tax Credit Scheme is a policy that we inherited from the previous administration.\nSo we had to come out to explain that it was meant for all the companies that have tax credit”.\nHe added, “All of these were then factored into the recommendations that were passed to the President which was signed as the Executive Order 7”.\nThe roads chosen in the South East, aggregating to122 kilometres, include rehabilitation of Umuahia (Ikwuano)-Ikot Ekpene Road: Umuahia-Umudike in Abia State and the dualization of Aba-Ikot Ekpene Road in Abia/Akwa Ibom States."
  },
  {
    "headline": "Crypto Giant FTX, Reaches Out To Pre-Tertiary Institutions of Learning",
    "summarized_story": "Africa’s most popular cryptocurrency exchange FTX, has been in the news on a regular for some time now; all as a result of churning out one innovative idea or the other.\nThe cryptocurrency exchange giant is leveraging on this to help provide services beneficial to a number of formative educational institutions.\nFTX.COM is a cryptocurrency exchange built for traders as an intuitive yet powerful platform for all users.\nAsides its educational outreach, FTX also runs a crypto tour aimed at educating both seasoned experts as well as interested newbies on the opportunities available in the cryptocurrency industry.\nIn the last few months alone, FTX has impacted knowledge on over 1500 individuals across the country and now is taking the charge to secondary schools."
  },
  {
    "headline": "Aisha Buhari Sends Her Staff On Indefinite Leave Amid Pregnancy Rumours",
    "summarized_story": "Aisha Buhari, the wife of President Muhammadu Buhari, has ordered all of her employees to go on indefinite leave amid rumors that she is pregnant.\nPictures of Buhari, 79, and Aisha, 50, taken in Turkey between December 16 and 19, 2021, fueled pregnancy rumors because she was seen cradling what appeared to be a bump.\nIn the statement, Kamal stated that the First Lady had instructed her office workers to take an indefinite leave of absence and work remotely.\n“This serves to inform all members of staff that the office of the First Lady will be closed for the upcoming festive period of Christmas and New Year.\n“To this end, all staff members are requested to proceed on leave, until further notice."
  },
  {
    "headline": "President Buhari receives COVID19 vaccine booster shot [Photos]",
    "summarized_story": "President Buhari on Tuesday, December 20 received a COVID19 booster shot at the State House in Abuja.\nThe Federal Government had commenced the administration of booster shots to Nigerians as part of measures to stop the spread of Omicron, a relatively new variant of the COVID-19 virus.\nPersons eligible for the booster dose must be 18 years and above, fully vaccinated with either two doses of AstraZeneca, Moderna, or Pfizer Bio-N-Tech or a single dose of the Johnson and Johnson vaccine.\nSee more photos of the President receiving the shot below"
  },
  {
    "headline": "I’m Not Pregnant – Aisha Buhari Debunks Pregnancy Rumour",
    "summarized_story": "Media aide to first lady Aisha Buhari, Sulaiman Haruna, has dismissed reports that the first lady is pregnant.\nSome alleged that she might be sick causing her to have a bloated stomach.\nHowever, in a chat with BBC Pidgin, Haruna denied the claims about the first lady being pregnant or sick.\nShe is neither sick nor pregnant as some reports claim.\nMeanwhile, the First lady has ordered all staff to go on leave till further notice."
  },
  {
    "headline": "Dumped Electoral Act Amendment Bill: Fayemi backs Buhari as senators move to override veto",
    "summarized_story": "Strong indication emerged Tuesday that the Senate may override President Muhammadu Buhari’s refusal of assent to the 2010 Electoral Act (Amendment) Bill 2021 at plenary Wednesday.\n“The members of the National Assembly consulted with a cross section of their constituents to reach an informed position on any matter of national interest and development.\n“I urge my colleagues in the National Assembly to do the needful by overriding the veto and make the bill law.\nThe NASS should extricate itself from public odium and disrespect by going ahead to override President Buhari who is APC.\nHistory stares NASS in the face if indeed it is not a rubber stamp.”Many other Senators who pleaded anonymity strongly expressed their readiness to override President Buhari on the rejected bill."
  },
  {
    "headline": "Why we eliminate bandits – El-Rufai",
    "summarized_story": "Kaduna state Governor Nasir Ahmed El-Rufai has said there is nothing like repentant bandits.\nThe governor said this Tuesday while briefing State House correspondents after a meeting with President Muhammadu Buhari in Abuja.\nAnswering a question on his stance on repentant bandits, the governor said: “There is nothing like repentant terrorists.\n“If the security forces cannot go to the bandits’ location, the state was helpless,” he said.\nThe governor said he asked for the intervention of the president for more deployment of security forces and a comprehensive operation."
  },
  {
    "headline": "INEC to distribute 39,208 PVCs to FCT registrants",
    "summarized_story": "He disclosed that 39,208 new PVCs were be printed arising from the CVR exercise in the FCT.\n“Added to this figure are requests for transfer of registrations to FCT, replacement of lost or damaged PVCs and update of voter records, making an overall total of 39,208 new PVCs to be printed, he said.\nPolitical parties must therefore hold themselves to the same high standard of free, fair, transparent and credible elections that they expect from INEC during general elections.\nIn addition, and for the first time in the history of the Commission, the accreditation of polling and collation agents nominated by political parties was done online.\n“In all, the commission issued 63,745 identification tags to agents of the 18 political parties that sponsored candidates for the election."
  },
  {
    "headline": "Electoral Bill: Fayemi, Ortom Back Buhari As CSOs, Others Question Decision",
    "summarized_story": "In his letter, President Buhari cited several issues with the bill’s clause on direct primaries.\nThe Nigerian leader equally fears that with direct primaries, citizens’ rights will be violated while smaller political parties may face marginalisation.\nBy law, the National Assembly can bypass presidential assent of a bill into law through a two-third majority vote.\nHe stated that the new bill introduced several innovations, besides direct primaries, to help advance the country’s democracy.\nIn fact, the APC used direct primary for the emergence of its presidential candidate in 2019."
  },
  {
    "headline": "Electoral Amendment Bill: Some Senators Gathering Signatures To Veto Buhari, Says Sekibo",
    "summarized_story": "A federal lawmaker Senator George Sekibo confirmed to Channels Television on Tuesday that some senators are planning to veto President Muhammadu Buhari on the electoral act amendment bill.\nThe 109-member Senate will require a two-thirds majority to veto the bill into law.\nPresident Buhari had written the National Assembly to inform them of his decision to withhold his assent on the bill.\nThe letter was read on the Senate floor on Tuesday prompting the Senate to go into a closed-door session requested by Senator Sekibo.\nSekibo confirmed the planned veto after the end of the closed-door session."
  },
  {
    "headline": "Reps Pass 2022 Budget Of N17.126trn",
    "summarized_story": "The House of Representatives on Tuesday passed a 2022 budget of N17.126 trillion against the N16.391 trillion sum presented by the president.\nThe Senate is also expected to pass the appropriation bill on Tuesday.\nIn passing the bill, the House increased the benchmark price for crude from $57 to $62 per barrel, from which a proposed increase in revenue is expected.\nREAD ALSO: Buhari Writes NASS, Declines Assent To Electoral Act Amendment BillThe lawmakers also made provision for 10 percent of monies recovered by EFCC and the National Financial Intelligence Unit to be utilised by the agencies for their operations, to strengthen their fight against corruption.\nThe budget deficit was increased by N98 billion to accommodate some other requests of national importance which have not been captured in the budget estimates and which could not be covered by the revenue increase."
  },
  {
    "headline": "COVID-19 Cases On The Rise As Nigeria Enters Fourth Wave",
    "summarized_story": "Nigeria on Monday recorded 1,368 more COVID-19 cases, hours after the country confirmed that it had entered the fourth wave of the pandemic.\nA breakdown of the daily infection rate showed that the new cases were confirmed in 19 states and the Federal Capital Territory (FCT) Abuja.\nMonday’s update takes the number of COVID-19 infections in Nigeria to 225,255 out of which 211,660 have been discharged.\n“Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants,” the NCDC boss added.\n“The country is now in a fourth COVID-19 wave."
  },
  {
    "headline": "Ikoyi Registry Marriages Are Constitutional, Legal – FG",
    "summarized_story": "The Federal Government via the Ministry of Interior on Tuesday reiterated that marriages formalised at the Ikoyi registry in Lagos are constitutional and legal.\nSeveral reports had claimed marriages conducted at federal registries were illegal as local governments are responsible for that aspect of public life.\nHe further stated that there should be no cause for apprehension to all intending couples who have planned to be married during this festive period-and at any other time at the Ikoyi Marriage Registry in Lagos or at any other Federal Marriage Registry.\nShuaib Belgore therefore wishes to again reassure the general public, especially intending couples that the contraction of all Marriages at the Ikoyi Marriage Registry is constitutional and Valid.\n“The Permanent Secretary wishes all prospective couples planning their marriages during this yuletide a pleasant ceremony.”"
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "FULL TEXT: President Buhari’s letter on withholding assent to electoral bill -",
    "summarized_story": "The President of the Senate, Ahmad Lawan; and Speaker of House of Representatives, Femi Gbajabiamila, on Tuesday, at the opening of plenary read the communication from President Muhammadu Buhari on his rejection of the Electoral Act 2010 (Amendment) Bill.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Just In: Reps raise 2022 budget by N200bn, extend 2021 budget lifespan by 90 days -",
    "summarized_story": "The House of Representatives has extended the lifespan of the 2021 Appropriation act by nine months to enable it run concurrently with the 2022 appropriation.\nMeanwhile, the house of representatives has raised the budget by N200b and passed N17.126 billion as 2022 Spending plan.\nStill in the house of representatives, the lawmakers have approved N215.81b for the Federal Inland Revenue Service in 2022Also, the Senate has approved the nomination of Muazu Sambo as the new minister of Power.\nRecall that President Muhammadu Buhari had few months ago sacked the former minister over failure to improve the sector."
  },
  {
    "headline": "Buhari gives reasons for not signing Electoral Act Amendment Bill -",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila has read President Muhammadu Buhari’s letter explaining why he declined to sign the Electoral Act Amendment bill.\nAccording to the president, direct primaries an affront to the right to freedom of association."
  },
  {
    "headline": "Madagascar Minister, 57, Swims 12 Hours to Shore after Helicopter Crash",
    "summarized_story": "A Madagascan minister was one of two survivors to have swum some 12 hours to shore Tuesday after their helicopter crashed off the island’s northeastern coast, authorities said.\nA search was still ongoing for two other passengers after the crash on Monday, the cause not immediately clear, said police and port authorities.\nGelle became minister as part of a cabinet reshuffle in August after serving in the police for three decades.\nZafisambatra Ravoavy, another police general, said Gelle had used one of the helicopter’s seats as a flotation device.\n“He has always had great stamina in sport, and he’s kept up this rhythm as minister, just like a thirty-year-old,” he said."
  },
  {
    "headline": "Peter Obi: Nigeria Needs a Competent Leader Ahead Of 2023",
    "summarized_story": "Despite the pressure mounted by the National Assembly, civil society groups and many well-meaning Nigerians on President Muhammadu Buhari to assent to the Electoral Act (Amendment) Bill, the president acted true to type on Monday by rejecting the bill.\nThe president has elected to deflect the blame for withholding his assent to the bill on others, citing the need for political parties to be allowed to freely exercise the choice of deciding the mode of primaries to adopt for the selection of candidates seeking elective office.\nIn so doing, Buhari threw away the baby with the bath water and possibly dashed all hopes for the conduct of transparent elections in 2023.\nPeter Obi, former Governor of Anambra State, joins The Morning Show to give us his perspective on the underlying reasons for the rejection of the Electoral Bill, what can be done to salvage it in ample time before the forthcoming general election, and other issues of national importance."
  },
  {
    "headline": "Electoral Bill Amendment: Buhari Withholding Assent is Unreasonable",
    "summarized_story": "Following President Muhammadu Buhari’s rejection of the Electoral Act (Amendment) Bill, all eyes will now be diverted to the National Assembly to override his veto.\nBut only a few are confident that Nigeria’s rubber stamp legislature, led by Dr Ahmad Lawan, can muster the two-thirds majority required in both Houses to override the president.\nWeighing in on the issue Monday, Governor Nyesom Wike of Rivers State said the National Assembly lacked the temerity to overturn the presidential veto.\nGiving reasons for his verdict, Wike explained that it was part of the scheming of the ruling All Progressives Congress to deny Nigerians free and fair elections in 2023.\nNow, joining us to discuss the legislative and political fireworks expected to ensue after the rejection of the Electoral Bill, is Norrison Quakers, a Senior Advocate of Nigeria."
  },
  {
    "headline": "Bishop Kukah Speaks on Nigeria’s Diversity – Trending with Ojy Okpe",
    "summarized_story": "Some Nigerians have reacted to the Bishop of Sokoto Diocese Matthew Kukah who on Sunday said God did not make a mistake in making Nigeria a nation with diversity.\nIn the video, the pastor said even a footballer who dies on the field will go straight to hell.\nFinally, 18-year-old Shatu Garko on Friday became the first Northerner to win the Miss Nigeria beauty pageant.\nShatu Garko hails from Kano State and represented the northwest geo-political zone at the competition where she defeated 17 other contestants at the grand finale.\nHer emergence makes her the first hijab model and the youngest contestant to win the pageant since its debut edition took place in 1957."
  },
  {
    "headline": "Oil Prices Steady as Omicron Worries Linger",
    "summarized_story": "Oil prices steadied on Tuesday after a sharp fall in the previous session as investors worried about the rapid spread of the Omicron coronavirus variant and the impact of renewed restrictions on fuel demand.\nBrent crude was down 8 cents, or 0.1%, at $71.44 a barrel by 0903 GMT, while U.S. West Texas Intermediate (WTI) crude rose 5 cents, or 0.1%, to $68.66 a barrel.\nNew Zealand delayed the planned reopening of its international border because of the sweeping spread of Omicron around the world on Tuesday, as several other countries reimposed social distancing measures.\nStill, Moderna Inc said on Monday that a booster dose of its COVID-19 vaccine appeared to be protective against the fast-spreading Omicron variant in laboratory testing, providing some hope to investors.\nIn the United States, crude oil inventories were expected to have fallen for a fourth consecutive week, while distillate and gasoline stockpiles likely rose last week, a preliminary Reuters poll showed on Monday."
  }
]