[
  {
    "headline": "Smaller breasts can produce more milk for babies, physician says",
    "summarized_story": "SHe said, “In fact, a small breast can produce more milk than a big breast.”Speaking with PUNCH HealthWise in an interview, Kuku explained that “Usually, we would say genetic and other factors are what affects breast milk production after birth.\nThe article explained that “The size of your breasts mostly depends on how much fatty tissue they contain.\nBut fatty tissue doesn’t have anything to do with how your breasts make milk.\n“As your baby suckles, the hormone prolactin stimulates the mammary glands in your breasts to secrete milk.\nThis places the order to your breasts to make enough milk for your baby’s next feed,” the article explained."
  },
  {
    "headline": "Smaller breasts can produce more milk for babies, physician says",
    "summarized_story": "SHe said, “In fact, a small breast can produce more milk than a big breast.”Speaking with PUNCH HealthWise in an interview, Kuku explained that “Usually, we would say genetic and other factors are what affects breast milk production after birth.\nThe article explained that “The size of your breasts mostly depends on how much fatty tissue they contain.\nBut fatty tissue doesn’t have anything to do with how your breasts make milk.\n“As your baby suckles, the hormone prolactin stimulates the mammary glands in your breasts to secrete milk.\nThis places the order to your breasts to make enough milk for your baby’s next feed,” the article explained."
  },
  {
    "headline": "Shun drug abuse, addiction, NDLEA urges youths",
    "summarized_story": "The Deputy Superintendent of Narcotics, National Drug Law Enforcement Agency, Mrs. Fatima Dauda, has urged youths to shun drug abuse and addiction for a greater and better future.\n“Drug abuse destroys destiny, and dreams and makes the user useless for life if care is not taken,” she said.\nAccording to her, good parenting can help to curb the alarming rate of drug abuse.\nEarlier, the Vice Chairman of NYCN, Mr. Ademosu Jamiu, decried the negative effects of drug abuse on most Nigerian youths.\nIn his welcome address, Jamiu said that drug has destroyed the future of most youths, advising them to shun drug abuse and addiction."
  },
  {
    "headline": "Shun drug abuse, addiction, NDLEA urges youths",
    "summarized_story": "The Deputy Superintendent of Narcotics, National Drug Law Enforcement Agency, Mrs. Fatima Dauda, has urged youths to shun drug abuse and addiction for a greater and better future.\n“Drug abuse destroys destiny, and dreams and makes the user useless for life if care is not taken,” she said.\nAccording to her, good parenting can help to curb the alarming rate of drug abuse.\nEarlier, the Vice Chairman of NYCN, Mr. Ademosu Jamiu, decried the negative effects of drug abuse on most Nigerian youths.\nIn his welcome address, Jamiu said that drug has destroyed the future of most youths, advising them to shun drug abuse and addiction."
  },
  {
    "headline": "Obi to PDP delegates: Vote for your children’s future, not money",
    "summarized_story": "A Peoples Democratic Party (PDP) presidential aspirant, Mr Peter Obi, has appealed to the party’s delegates to vote wisely during the upcoming national convention.\nObi, a former governor of Anambra, urged them to be guided by their conscience and vote in the interest of the country’s future and that of their children.\n“For the sake of your children and future of Nigeria vote wisely.\n“Do you want to collect money and bequeath a society of hopelessness, kidnapping, banditry and poverty to future generations?\nOkupe, who likened Obi to late MKO Abiola, called on the delegates not to deny Nigerians the opportunity to vote the candidate they yearned for."
  },
  {
    "headline": "Kukah, Adeyanju commend Gov Tambuwal over protection of Christians in Sokoto",
    "summarized_story": "Activist and convener of Concerned Nigerians, Deji Adeyanju has joined Father Kukah to commend Sokoto’s Governor, Tambuwal for the protection of Christians in the state.\nThe activist took to his Facebook page to share a letter by Father Kukah concerning the ongoing act of some extremists in Sokoto.\nHe wrote, “I must take out time to join Father Kukah in commending Sokoto State Governor, Tambuwal for doing everything to protect Christians in the state after the satanic acts of some extremists.\nThis letter by Father Kukah is how leaders should speak.”."
  },
  {
    "headline": "APC: Former Edo council V/C requests automatic ticket for state assembly",
    "summarized_story": "He told Vanguard in Benin City on Sunday that “I am believe I should be a beneficiary of the right of first refusal generously granted by our party for the members of the state house of assembly.\nI think and I believe that the party should extend the same gesture to somebody like me who lost out completely as the Vice Chairman of Akoko-Edo local government area because I decided to be a loyal party man.\n“I was first suspended unceremoniously for an offence that I never committed and I was eventually restored by the House of Assembly with Rt.\nHon Francis Okiye as Speaker.\nI was unjustly denied access to my office as the Vice Chairman of Akoko-Edo local government area and then replaced illegally till the end of that administration."
  },
  {
    "headline": "Water Resources Ministry charges staff on value addition to service delivery",
    "summarized_story": "By Gabriel Ewepu – AbujaThe Federal Ministry of Water Resources, weekend, charged staff on value addition to service delivery in the sector following the vastness use of water resources and also in generating revenue for the country.\nRead Also:Why we’re insisting on passage of Water Resources bill – FGCAPPA, AUPCTRE, others meet on Water Resources BillFCTA vows to demolish estates, structures obstructing waterwaysWalson-Jack pointed that Institutionalizing Performance Management System’ (PMS) is one of the key building blocks for repositioning the Federal Public Service.\nShe further stated that the new Performance Management System is anchored on the principles of accountability, transparency, equity, and ownership and when fully operational would ensure that national development goals are achieved.\nShe said: “Institutionalizing Performance Management System (PMS) is one of the key building blocks for repositioning the Federal Public Service.\nEarlier, In an address of welcome, Director, Human Resource, Federal Ministry of Water Resources, Jummai Idakwo, noted that PMS contributes to the effective management of individuals and teams in order to achieve high levels of organizational performance."
  },
  {
    "headline": "What I will do differently as Akoko-Edo representative in NASS – Bankole-Balogun",
    "summarized_story": "Hon Oladele Bankole-Balogun was one time Federal Commissioner that represented Edo State at the Public Complaints Commission (PCC) and the candidate of the Peoples Democratic Party (PDP) for Akoko-Edo Federal Constituency in 2019.\nHe is today an aspirant for the same ticket and in this interview spoke on his chances and what he will do differently if he gets the party’s nomination and wins the election:What is your view on the coming PDP primary election?\nI am sure if you are to answer that question you will say Dan Orbih is loyal to the party, the PDP.\nWhat makes you confident that you will win the PDP primary for the House of Representatives?\nI think the delegates have a once in a lifetime opportunity to do the right thing and I think they will do it"
  },
  {
    "headline": "Nigeria gets £600,000 UK grant for 20 institutions, organisations",
    "summarized_story": "The British Council has announced the sum of £600,000 UK-Nigeria grant funded partnerships earmarked to support systemic change between 20 institutions and organisations.\nThe Chief Executive of British Council Scott McDonald stated this Tuesday in Abuja during the presentation of an overview of Transnational Education in Nigeria by the National Universities Council (NUC).\n“Through our regional HE programme, Innovation for African Universities (IAU), we have established UK-Nigeria grant funded partnerships worth £600,000, to support systemic change between 20 institutions and organisations.\n“IAU was designed and developed by the British Council as part of our Going Global Partnerships programme.\nThrough the IAU platform, the British Council also funds a cohort of six partnerships that host a total of 20 enterprise support organisations and universities.”"
  },
  {
    "headline": "2021 recruitment: Police release date for medical screening in Yobe",
    "summarized_story": "The Yobe State Police Command has set a date for medical screening of successful candidates who sat in the just concluded Computer Based Test (CBT).\nAbdulkarim in the statement, said “Shortlisted Candidates are to check their status on the following website (https://www.policerecruitment.gov.ng), while those who qualified should print out their medical screening slips.\n“The Medical Screening Exercise will hold at the police clinic, Damaturu.\n“DATE: 24th 27th May, 2022“TIME: 8:30 AM to 2:45 PM Daily”, the statement added.\nThe State Commissioner of Police, Haruna Garba, who congratulated all the successful candidates, enjoined them to conduct themselves in a most orderly manner during the exercise."
  },
  {
    "headline": "Buhari’s aide, Senator Ita Enang resigns",
    "summarized_story": "Senator Ita Enang, President Muhammadu Buhari’s Senior Special Adviser on Niger Delta Affairs has resignedEnang announced his resignation in a statement he personally signed on Monday.\nAccording to him, he is resigning his position to contest the Akwa Ibom State governorship election, Tribune reports.\nIn his resignation letter addressed to Buhari on Monday, Enang thanked the president for the opportunities to serve in his government.\nHe said he will be contesting the governorship position of Akwa Ibom State on the platform of the All Progressives Congress (APC).\n“I served in this capacity managing what turned out to be the toughest Executive – Legislative Liaison assignment in the Nation’s democratic history.”"
  },
  {
    "headline": "2023: We must take over presidency or remain in opposition – Atiku, Ikpeazu",
    "summarized_story": "The Abia State Governor, Okezie Ikpeazu has re-echoed the call on the Peoples Democratic Party, PDP, to strengthen itself in order to take over the presidency of Nigeria in 2023 and rescue the country from the current grave insecurity and socio-economic challenges facing her.\nHe made the call while welcoming one of the PDP Presidential aspirants and former Vice President of Nigeria, Alhaji Atiku Abubakar, who paid him a courtesy visit in Government House, Umuahia.\nIt was contained in a statement by Onyebuchi Ememanka, the Chief Press Secretary to the Governor and issued to newsmen in Umuahia, the state capital on Monday.\nIkpeazu appreciated the support of the former Nigeria Vice President for the democratic ideals, as well as the major part he has played to unify the country.\n“The 2023 election is crucial as the party must decide whether to take over power at the centre or remain in the opposition,” he added."
  },
  {
    "headline": "Taraba: Gov Ishaku orders suspension of recruitment into state civil service",
    "summarized_story": "Governor Darius Dickson Ishaku of Taraba State, on Monday, ordered the immediate suspension of recruitment into the state civil service.\nIt would be recalled that over 2,000 applicants were recently recruited into the state civil service by the Governor Ishaku-led administration.\nApart from the recruitment, letters of employment, as noticed by DAILY POST, were also observed to have been personally distributed to the applicants at the Jolly Nyame Stadium by the governor.\nAside from the aforementioned, the Chairman of the state’s Civil Service Commission (CSC), John Mamman, was also noticed to have applauded the governor for “bringing in young and vibrant officers into the state civil service for continuity and effective service delivery.”He said the screening and employment were done based on the principle of equal representation, reflecting state character as embedded in the federal character.\nThe decision of the governor to suspend the recruitment which he earlier adjudged as one of the best recruitment exercises carried out in the state, was observed to have not gone down well with the successful applicants."
  },
  {
    "headline": "My experience under Buhari places me ahead of others, says Osinbajo",
    "summarized_story": "My experience under Buhari places me ahead of others, says OsinbajoProf. Yemi Osinbajo has said his experience as the vice-president in the last seven years under President Muhammadu Buhari has placed him in high pedestal to lead the country in 2023.\nOsinbajo stated this during a visit to the Emir of Ilorin, Alhaji Ibrahim Sulu-Gambari, yesterday.\nHe was in Kwara State to address All Progressives Congress (APC) delegates ahead of the May 30 scheduled APC presidential primaries.\nThe vice-president said the experience had placed him in a better position to address them due to exposure and opportunities given to him by the Buhari administration.\nOsinbajo said his respect and regard for the Emir and the Emirate informed his visit to the palace to seek his fatherly support."
  },
  {
    "headline": "Why I will stand with Yahaya Bello, by Hafsat Abiola",
    "summarized_story": "The Director General of the Yahaya Bello Presidential Campaign Organisation, Hafsat Abiola-Costello, has said she is standing with Kogi State Governor Yahaya Bello in the race for the All Progressives Congress’ (APC’s) presidential ticket because she has seen in him, the qualities of leader Nigeria needs this time.\nAbiola-Costello spoke yesterday while addressing reporters in Lagos ahead of the APC presidential primaries slated for May 30 and 31 in Abuja.\nShe said Bello was a loyal and respectful person, who would carry everyone along after emerging as the president.\n“I am proud of Governor Yahaya Bello (GYB) because of his development records in Kogi.\n“Going into the presidential primaries, we are on a good footing."
  },
  {
    "headline": "APC clears Adegoke for Oyo South primaries",
    "summarized_story": "The All Progressives Congress (APC) senatorial screening committee under the chairmanship of former governor of Zamfara State, Mahmood Shinkafi, has screened and cleared a senatorial aspirant for Oyo South District, Olooye Adegboyega Adegoke, for the primary election slated for May 24.\nThe senatorial hopeful pledged good and equal representation for the nine local governments that made up the senatorial district.\nOther members of the screening committee are Chief Peter Ojie, Miss Busari Abisayo and Prince Abdullahi Yau, while Chief Ejike Nwosu is the secretary.\nThe nine councils are Ibadan North, Ibadan North East, Ibadan North West, Ibadan South East, Ibadan South West, Ibarapa Central, Ibarapa East, Ibarapa North and Ido.\nSpeaking after his screening, Adegoke, a Fellow of the Institute of Chartered Accountants of Nigeria (FCA) and business turnaround expert, said the first hurdle had been scaled."
  },
  {
    "headline": "SWAGA’23 set for launch in Kwara",
    "summarized_story": "The auspicious ceremony will span three days, covering morning and afternoon sessions.\nAsiwaju Tinubu, a national leader in the ruling All Progressives Congress (APC) and frontline presidential aspirant, was governor of Lagos State between 1999 and 2007.\nAccording to a statement by ‘Bosun Oladele (MHR) national secretary of SWAGA’23 through Rotimi Makinde, the group would accordingly launch the Kwara chapter in less than 48 hours in the state.\nIn the team are the Chairman, Senator Dayo Adeyeye, Senator Adesoji Akanbi (Deputy Chairman), Hon.\nIfedayo Abegunde, Apostle Oloruntoba Oke, Hon Mukaila Musa and the NCA North Central Coordinator, Alhaji Ibrahim Raji, among others."
  },
  {
    "headline": "EFCC arrests Accountant General of the Federation",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission (EFCC) have arrested the Accountant General of the Federation Ahmed Idris over alleged diversion of N80 billion.\nThe agency, confirmed his arrest on Monday night on its Twitter handle.\nIt said Idris was arrested in connection with diversion of funds and money laundering activities to the tune of N80 billion.\nRead Also: EFCC arrests 23 suspected internet fraudsters in IbadanAccording to the EFCC, the AGF allegedly raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associatesIt added the funds were laundered through real estate investments in Kano and Abuja.\nIdris was arrested after failing to honour invitations by the EFCC to respond to issues connected to the fraudulent acts,” the agency noted."
  },
  {
    "headline": "Umeh to PDP: You’re finished without South East candidate",
    "summarized_story": "He said PDP would pay dearly if it denied the South East the presidential ticket.\nIn 2019, they brought Atiku and the South East supported the PDP because they used former governor Peter Obi as vice presidential candidate.\n“But if they don’t do it, I tell you nobody in the South East will vote for them.\nWe will make it impossible for them to get any vote from the South East because they have taken us for a ride.\nLet them save themselves of this embarrassment by nominating someone from the South East as their presidential candidate."
  },
  {
    "headline": "2023 presidency: Anambra PDP delegates adopt Obi as preferred choice",
    "summarized_story": "From Obinna Odogwu, AwkaThe People’s Democratic Party (PDP) delegates for the May 28 and 29 national convention of the party from Anambra State, on Monday, adopted Mr Peter Obi as their preferred choice for the party’s presidential ticket.\nObi, a former governor of the state and 2019 vice presidential candidate of the party, is seeking to represent the party in the 2023 election as a presidential candidate.\nThe delegates made known their stand during a meeting with the presidential hopeful in Awka, the state capital.\nIn his speech, Obi told the delegates that he was all out to repair and reposition Nigeria for the good of everybody.\nThe former governor appealed to the party’s delegates to give him maximum support to be able to clinch the presidential ticket of their party."
  },
  {
    "headline": "N80 billion fraud: EFCC arrests AGF",
    "summarized_story": "From Fred Itua, AbujaOperatives of the Economic and Financial Crimes Commission (EFCC) on Monday arrested the Accountant General of the Federation (AGF), Mr Ahmed Idris, in connection with an alleged diversion of funds and money laundering activities to the tune of N80 billion.\nThe anti-graft agency’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nThe funds, according to the EFCC, were laundered through real estate investments in Kano and Abuja.\nMr. Idris was arrested after failing to honour invitations by the EFCC to respond to issues connected to the fraudulent acts."
  },
  {
    "headline": "Amadi replaces late DIG Egbunike, Magu promoted to AIG",
    "summarized_story": "By Christopher Oji, LagosThe Police Service Commission (PSC) has approved the promotion of Deputy Inspector-General of Police, John Ogbonnaya Amadi, to a substantive DiG to replace late DIG Joseph Egbunike, and will be representing the South East in the Force Management team.\nAlso promoted were eight Assistant Inspector-General of Police from the rank of Commissioners of Police among them is the former Chairman of the Economic and Financial Crimes Commission (EFCC), Mr Ibrahim Magu.\nDIG Amadi, currently acting, replaced late DIG Joseph Egbunike, and will be representing the South East in the Force Management team while DIG Senchi was the most senior in the AIG cadre.\nThe Commission also promoted 1698 Assistant Superintendents of Police (ASP) to Deputy Superintendents of Police, 6119 Inspectors who attended the recent Departmental Selection Board (DSB) were promoted to ASP11 while 1965 ASP11 were confirmed ASPs.\nChairman of the Commission, Musiliu Smith congratulated the promoted officers and charged them to redouble their efforts in the service of their fatherland."
  },
  {
    "headline": "PDP may lose 2023 in election if… – Bode George",
    "summarized_story": "By Chinelo Obogo, LagosFormer National Vice Chairman (South West) of the People’s Democratic Party (PDP), Bode George, has warned the party against accepting the congress carried out by its former Lagos State chairman, Deji Doherty, saying the court ruling against him may cost the party the elections.\nHe said if the party accepts the executive produced at the congress carried out by Doherty, it risks losing the election.\nPeople would arrive for the PDP convention two or three days before the day and APC delegates would also arrive a few days before theirs.\nHolding it in Lagos would completely cut off any plans by the APC to want to scuttle our convention.\n“On the issue of zoning, a memo was done and the first paragraph of that communique identified that zoning and rotation remain absolutely sacrosanct in PDP."
  },
  {
    "headline": "EFCC Confirms Arrest of Accountant-General of the Federation, Ahmed Idris",
    "summarized_story": "Kingsley NwezehThe Economic and Financial Crimes Commission has confirmed the arrest the of the Accountant General of the Federation, Mr. Ahmed Idris, in connection with diversion of funds and money laundering activities to the tune of N80 billion.THISDAY, quoting sources, had earlier reported the arrest of Idris by the anti-graft agency.A statement by EFCC Monday night said “its verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates”.It said the funds were laundered through real estate investments in Kano and Abuja.The anti-graft agency said Mr. Idris was arrested after failing to honour invitations by the EFCC to respond to issues connected to the fraudulent acts.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: EFCC Arrests Accountant General of the Federation.",
    "summarized_story": "The Economic and Financial Crimes Commision has arrested the Accountant General of the Federation, Mr. Ahmed Idris, over alleged mismanagement of N80billion, THISDAY has learnt.\nSources said the arrest was made in Kano and he was currently being moved to Abuja.\nThe commission is expected to issue a statement shortly.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Northern Governors, Gumi Condemn Murder of Deborah, Appeal for Calm",
    "summarized_story": "In its own reaction, the umbrella organisation of all Christians in Northern Nigeria at the weekend condemned what it described as gruesome and barbaric murder of Deborah.\nAbubakar came under fire for a statement he made via his Twitter handle, defending the killing of Deborah.\nHe maintained that Nigeria was not an Islamic state, adding that Muslims in the country have agreement with people of other faiths to live together peacefully.\n“Even after killing Deborah the miscreants continued to destroy people’s properties, burning of church facilities, and going from house to house intimidating peaceful Christians.\nIt also called on the federal and Sokoto State governments to rise up to the occasion by doing the needful, saying the world is watching."
  },
  {
    "headline": "Adesina Meets Mamman Daura, Intensifies Lobby of Buhari’s Circle",
    "summarized_story": "A source told THISDAY that the meeting held behind closed doors as Adesina continues to lobby of Buhari’s circle.\nBeyond Mamman Daura, he is also reaching out to Buhari’s relatives in Niger Republic, to see if they can convince Buhari to back him,” the source who pleaded to remain anonymous added.\nTHISDAY had reported last week that some African leaders have mounted pressure on Buhari to anoint Adesina, as the presidential candidate of the APC in the 2023 general election.\nTo this end, former President Olusegun Obasanjo, is said to have given Adesina his full backing.\nLast week, a coalition made up of 28 groups bought the form for Adesina worth N100 million."
  },
  {
    "headline": "FG: TotalEnergies Has Invested Almost $30bn in Nigeria within Eight Years",
    "summarized_story": "Wabote said TotalEnergies had invested immensely in Nigeria and deserved commendation for remaining consistent in investing in the country’s oil sector.\nWabote stated, “Total has invested so much in Nigeria since the last 60 years.\nTerraz expressed excitement at the opportunities that abounded in Nigeria, and indicated the intention of TotalEnergies to expand into the Nigerian electricity sector.\nSangster said TotalEnergies was proud to be the second largest oil and gas producer in Nigeria, contributing 20 per cent of Nigeria’s oil production.\nSangster added that the partnership between TotalEnergies and Nigeria had been a very successful one, pointing out, however, that the journey has not always been smooth."
  },
  {
    "headline": "How Accountant-General, Idris Acquired Multi-Billion Naira Properties, Shared To Family Members, Secretly Married Teenage Girl Before Eventual Arrest By Anti-graft Agency, EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Monday arrested the Accountant-General of the Federation, Ahmed Idris, over alleged mismanagement of N80billion.\n“The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.\nThe shareholdings of both firms indicate a spread of Idris family members on the official board.\nSaharaReporters gathered that Idris upon acquiring the hotel, ordered its immediate demolition with the intention to build a multi-billion naira shopping mall on the property.\nHe started meeting different people that he wanted to know the girl’s family; he married the girl, just like that."
  },
  {
    "headline": "How Accountant-General, Idris Acquired Multi-Billion Naira Properties, Shared To Family Members, Secretly Married Teenage Girl Before Eventual Arrest By Anti-graft Agency, EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Monday arrested the Accountant-General of the Federation, Ahmed Idris, over alleged mismanagement of N80billion.\n“The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.\nThe shareholdings of both firms indicate a spread of Idris family members on the official board.\nSaharaReporters gathered that Idris upon acquiring the hotel, ordered its immediate demolition with the intention to build a multi-billion naira shopping mall on the property.\nHe started meeting different people that he wanted to know the girl’s family; he married the girl, just like that."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Arrests Accountant-General, Idris Over N80billion Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over N80billion fraud.\nThe EFCC spokesman Wilson Uwujaren confirmed his arrest in a statement issued on Monday evening.\nAhmed IdrisHe said Idris was arrested after failing to honour the commission’s invitations to respond to issues connected to the fraudulent act.\n“Operatives of the Economic and Financial Crimes Commission, EFCC, on Monday, May 16, 2022, arrested serving Accountant General of the Federation, Mr. Ahmed Idris in connection with diversion of funds and money laundering activities to the tune of N80 billion( Eighty Billion Naira only),” Uwujaren’s statement read.\n“The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.”According to the EFCC, the funds were laundered via real estate investments in Kano and Abuja."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Arrests Accountant-General, Idris Over N80billion Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over N80billion fraud.\nThe EFCC spokesman Wilson Uwujaren confirmed his arrest in a statement issued on Monday evening.\nAhmed IdrisHe said Idris was arrested after failing to honour the commission’s invitations to respond to issues connected to the fraudulent act.\n“Operatives of the Economic and Financial Crimes Commission, EFCC, on Monday, May 16, 2022, arrested serving Accountant General of the Federation, Mr. Ahmed Idris in connection with diversion of funds and money laundering activities to the tune of N80 billion( Eighty Billion Naira only),” Uwujaren’s statement read.\n“The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.”According to the EFCC, the funds were laundered via real estate investments in Kano and Abuja."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Arrests Accountant-General, Idris Over N80billion Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested the Accountant-General of the Federation (AGF), Ahmed Idris, over N80billion fraud.\nThe EFCC spokesman Wilson Uwujaren confirmed his arrest in a statement issued on Monday evening.\nAhmed IdrisHe said Idris was arrested after failing to honour the commission’s invitations to respond to issues connected to the fraudulent act.\n“Operatives of the Economic and Financial Crimes Commission, EFCC, on Monday, May 16, 2022, arrested serving Accountant General of the Federation, Mr. Ahmed Idris in connection with diversion of funds and money laundering activities to the tune of N80 billion( Eighty Billion Naira only),” Uwujaren’s statement read.\n“The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.”According to the EFCC, the funds were laundered via real estate investments in Kano and Abuja."
  },
  {
    "headline": "FG: Abuja-Kaduna train service to resume May 23",
    "summarized_story": "The federal government says the Abuja-Kaduna train service will resume operations on May 23.\nYakubu Mahmood, spokesperson, Nigerian Railway Corporation (NRC), said this in a statement on Monday.\nIn March, the government suspended operations on the route after an attack on the train by gunmen.\nAdvertisementMahmood said the decision to resume operations does not mean efforts to secure the safe release of those abducted would be shelved.\nRelatives of the abducted passengers had warned the federal government against resuming operations along the route until their loved ones were rescued."
  },
  {
    "headline": "FG: Abuja-Kaduna train service to resume May 23",
    "summarized_story": "The federal government says the Abuja-Kaduna train service will resume operations on May 23.\nYakubu Mahmood, spokesperson, Nigerian Railway Corporation (NRC), said this in a statement on Monday.\nIn March, the government suspended operations on the route after an attack on the train by gunmen.\nAdvertisementMahmood said the decision to resume operations does not mean efforts to secure the safe release of those abducted would be shelved.\nRelatives of the abducted passengers had warned the federal government against resuming operations along the route until their loved ones were rescued."
  },
  {
    "headline": "We were counting on Deborah to support her siblings after school, says mother",
    "summarized_story": "Alheri Emmanuel, mother of Deborah, a college student killed over alleged blasphemy, says the family was counting on her to support the education of her siblings.\nDeborah, a student of Shehu Shagari College of Education, Sokoto, was killed by a mob over alleged blasphemy.\nShe said Deborah’s siblings have been inconsolable since the incident happened, adding that she was the hope of the family.\nAdvertisement“When we heard the information, we were told that she got into trouble in school.\n“We were hoping that when she completes school, she would be able to get a job and assist the remaining younger ones through school."
  },
  {
    "headline": "We were counting on Deborah to support her siblings after school, says mother",
    "summarized_story": "Alheri Emmanuel, mother of Deborah, a college student killed over alleged blasphemy, says the family was counting on her to support the education of her siblings.\nDeborah, a student of Shehu Shagari College of Education, Sokoto, was killed by a mob over alleged blasphemy.\nShe said Deborah’s siblings have been inconsolable since the incident happened, adding that she was the hope of the family.\nAdvertisement“When we heard the information, we were told that she got into trouble in school.\n“We were hoping that when she completes school, she would be able to get a job and assist the remaining younger ones through school."
  },
  {
    "headline": "Deborah: 'Respect other religious beliefs' -- CAN appeals to Christians",
    "summarized_story": "The Christian Association of Nigeria (CAN) has appealed to Christians in the country to respect the beliefs of other religious groups.\nAyokunle, while condemning the act, said there is a need for religious education in order to ensure mutual respect among people of different beliefs.\nThere is a need for religious education so you know what those around you don’t want and respect them.\nIf there is mutual respect in this nation, there will be peace,” he said.\nAdvertisement“In a situation where there is no mutual respect, it also does not also call for anybody to take unilateral action against anybody that has offended them."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Safaricom declares $2.42 billion revenue, plans to launch commercial operations in Ethiopia this year",
    "summarized_story": "Safaricom, the largest telecommunications provider in Kenya, is set to launch commercial operations in Ethiopia later this year.\n#SafaricomFYResults pic.twitter.com/oJPgGSVJfw — Peter Ndegwa (@PeterNdegwa_) May 12, 2022Safaricom increased its service revenue by 12.3% to KES 281.11 billion ($2.42 billion) and profit by 13.5% to KES 109.13 billion ($940 million), according to its latest financial report.\nVoice service revenue grew by 0.8% to KES 83.21 billion ($720 million); mobile data revenue grew by 8.1% to KES 48.44 billion ($420 million), while M-PESA revenue grew by 30.3% to KES 107.69 billion ($930,000).\nSafaricom Ethiopia’s plans to bring mobile financial services to Ethiopia.\nIn April, Ethiopia started changing its national payments law to enable Safaricom to introduce M-PESA in the country."
  },
  {
    "headline": "New crypto rules",
    "summarized_story": "That is when the highly anticipated Techpoint Africa Blockchain Summit will take place.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than five days!\nCentral African Bank warns Central Africa RepublicRemember that the Central African Republic (CAR) announced its plan to adopt Bitcoin as a reference currency in April 2022.\nNow, the Banking Commission of Central Africa (COBAC) is cracking down on Bitcoin transactions, issuing a reminder of its crypto ban on Friday, May 13, 2022.\nIt also warned that its decision could be at odds with the region’s France-backed currency, the Central African Franc (CFA)."
  },
  {
    "headline": "Nigeria’s Central Bank edges close to eNaira use case with much-needed upgrade",
    "summarized_story": "Share this article:Nigeria’s central bank digital currency (CBDC), eNaira, will get an update that will allow it to perform more functions such as bill payment and USSD access.\n“Fundamentally, there were faults that would not have allowed the eNaira to achieve its full potential.”There were issues with setting up the eNaira Speed Wallet application at launch.\nOnly 1.3% had completed a transaction with the eNaira Wallet, while 34.4% were indifferent about the CBDC project.\nHow eNaira USSD could workWhile there’s little detail on how the eNaira will work with USSD, we can make educated guesses on how the service will work based on our understanding of the eNaira and USSD protocols in Nigeria.\nAccording to the CBN, the first tier of Speed Wallet users can set up a wallet without a Bank Verification Number (BVN)."
  },
  {
    "headline": "Interswitch raises $110m",
    "summarized_story": "Perhaps now’s a good time to ask how many fintech startups you know do not provide lending and payment options in Nigeria.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, has partnered with YC to give an account of its activities in Africa since 2009.\nThe fintech company is well known for its Point-of-Sale terminals and online consumer payment platforms like Quickteller and Verve.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in less than nine days!\nPolygon is sponsoring 50 free tickets to Techpoint Africa Blockchain Summit (TABS), holding on May 21, 2022."
  },
  {
    "headline": "Binance Hosts Nigerian Idol Street Edition On Nigerian University Campuses",
    "summarized_story": "Earlier in the year, Binance announced its sponsorship of the Nigerian Idol, continuing its mission to drive mainstream crypto adoption in Africa.\nFor the street edition, the blockchain giant hosted entertainment competitions in university campuses across Nigeria including Lagos State University, Rivers State University of Technology, Institute of Management Technology and Igbenidion University.\nThe street edition featured musical performances with judges ranking contestants based on their creativity, the strength of voice and stage performances, mirroring the Nigerian Idol show.\nWatch the first video snippet of the Binance Nigerian Idol street edition, as well as great commentary from the participants HERE.\nFor more information, visit: https://www.binance.comBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Cybersecurity Advisory Firm for 2021; Infoprive, the leading Cybersecurity services provider and trusted advisor in Sub-Sahara Africa, wins the Prestigious MEA Business Award for “Best Cybersecurity A",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Opportunities beckon for Nigeria’s palm oil producers",
    "summarized_story": "In the last five years, palm oil producers in Nigeria have been posting record revenues and profits, largely on account of import restrictions that more or less guaranteed their position as suppliers of last resort to diverse commercial and individual users.\nRead also: Nigeria’s palm oil imports from Malaysian dip 8.2% in 11-monthWith data, as reported by BusinessDay, showing Nigeria importing less palm oil as local producers report expansions, there are also opportunities in the global multibillion-dollar industry, and locally too, where supply has not completely met demand.\nWhen Indonesia, the world’s largest exporter of palm oil, banned exports of the commodity, to safeguard its own domestic consumption on account of increasing uncertainties and disruptions due to the Russia-Ukraine crisis, it put pressure on edible oil prices globally.\nWhile Ijewere advocates more support and enabling environment for local producers, there are also concerns that interventions in recent years may have gone to unqualified persons.\nHe said for the country to take advantage of the opportunities in the palm oil industry, support to players in the industry must be holistic and go to the right people."
  },
  {
    "headline": "Opportunities beckon for Nigeria’s palm oil producers",
    "summarized_story": "In the last five years, palm oil producers in Nigeria have been posting record revenues and profits, largely on account of import restrictions that more or less guaranteed their position as suppliers of last resort to diverse commercial and individual users.\nRead also: Nigeria’s palm oil imports from Malaysian dip 8.2% in 11-monthWith data, as reported by BusinessDay, showing Nigeria importing less palm oil as local producers report expansions, there are also opportunities in the global multibillion-dollar industry, and locally too, where supply has not completely met demand.\nWhen Indonesia, the world’s largest exporter of palm oil, banned exports of the commodity, to safeguard its own domestic consumption on account of increasing uncertainties and disruptions due to the Russia-Ukraine crisis, it put pressure on edible oil prices globally.\nWhile Ijewere advocates more support and enabling environment for local producers, there are also concerns that interventions in recent years may have gone to unqualified persons.\nHe said for the country to take advantage of the opportunities in the palm oil industry, support to players in the industry must be holistic and go to the right people."
  },
  {
    "headline": "Nigeria’s palm oil imports decline on backward integration policy",
    "summarized_story": "Nigeria has seen its importation of crude palm oil decline steadily in the last three years thanks to rising local production.\nThis has spurred massive investments from PZ Wilmar, Dufil Prima Foods, Agric Palm Limited, Presco, and Okomu Oil Palm Company, among others, in developing backward integration projects.\nCurrently, there are no reliable figures for Nigeria’s palm oil production and imports.\nIn 2021, it dropped by 15.8 percent from 368,313MT in 2020 to 309,911MT, according to data from Malaysian Palm Oil Council.\n“There is no doubt that Nigeria’s palm oil production is increasing and will continue to be on the rise owing to the backward integration projects by many producers."
  },
  {
    "headline": "NUJ Warri Correspondents Chapel Boycotts Delta Govt Activities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The Nigeria Union of Journalists (NUJ), Warri Correspondents Chapel, has resolved to boycott all Delta State government’s activities.\nThe decision was made during its monthly Congress held on Monday, May 16, 2022, at the Warri Correspondents Chapel Press Centre, Warri, Delta State.\nCongress, in the communique, decried a situation whereby Journalists from the chapel are in kept in the dark as to government functions and activities within these senatorial districts.\nThe Delta State government appeared far from the people in Warri, the Congress lamented, saying that there were a lot of issues that needed government’s attention that were left unattended to.\n“Since we’re not accessible to government’s policies, challenges and programmes except what is contained in its press releases, we’ve been finding it difficult to meet the expectations of the people."
  },
  {
    "headline": "Obaseki: We’re revolutionizing our healthcare system – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his administration is revolutionizing the healthcare sector, pursuing a holistic decentralization of the system and upgrading primary healthcare centres, equipping them with world-class equipment and manpower to guarantee the delivery of efficient, affordable and quality healthcare services to Edo people.\nThe governor, who noted that the COVID-19 outbreak exposed the weaknesses in global health systems, said his government is focused on fixing the healthcare system in Edo State, ensuring sustained investment to rebuild the sectorHe said, “We have started a revolution in our healthcare system.\nWe are working tirelessly to ensure that you will wake up one day and see our healthcare system becoming second to none in Nigeria.\nIt’s about the quality of the training and professionalism of those who administer healthcare services to the people.\nThe lesson of this medical mission is that we can build our own healthcare system to any standard in the world.”He added, “We don’t need to have a Central Hospital but we have decentralized our healthcare system and have a clinic or primary healthcare centre in every ward."
  },
  {
    "headline": "FG hails Edo NEWMAP, commends quality of infrastructure – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Nigeria Erosion and Watershed Management Project (NEWMAP) has received the commendation of the federal government for its durable and quality infrastructural projects in the state.\nThe federal government’s Environmental and Social Management Plan (ESMP) Audit Team of NEWMAP gave the commendation after assessing the quality of work at Edo NEWMAP’s intervention sites.\nBriefing journalists at NEWMAP’s Secretariat in Benin City, the ESMP Lead Auditor, Ita Valentine, commended the compliance level of the State Project Management Unit (SPMU) in the implementation of its intervention programmes in Edo State.\nEarlier, in his welcome remark, Coordinator, Edo NEWMAP, Dr. Tom Obaseki, said the government of Governor Godwin Obaseki will ensure quality projects so as to adequately check the problem of flooding and erosion across all Edo communities and improve the living standards of the people.\nReiterating the state government’s commitment to tackling erosion in the state, Obaseki said that the state government has built a total length of over 40kms of secondary drains."
  },
  {
    "headline": "Edo PUWOV says traders on Lagos Street not compelled to shutdown over Chief Osula’s death – Nigerian Observer",
    "summarized_story": "Edo PUWOV says traders on Lagos Street not compelled to shutdown over Chief Osula’s deathShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Public Works Volunteers (PUWOV) has said traders on Lagos Street axis within the Benin metropolis were not compelled by the family of late Chief Arala Osula to shutdown their shops and stalls.\nThe Commander, Edo PUWOV, Mukhtar Yusuf-Osagie said some traders within the axis voluntarily shut down their businesses to honour the late Benin Chief.\nHe said claims that the Osula family compelled traders to shut down their stalls was the handiwork of mischief makers who are intent on stirring crisis in the area.\nYusuf-Osagie however noted that a joint team comprising PUWOV officials, the Police and members of Edo Security Network has been fully deployed to the area to ensure the maintenance of law and order.\n“We have spoken to Traders Union Chairman in Lagos Street, Mr. Odion Uwugiamen who said some of the traders voluntarily decided to lock their shops in honour of Benin Chief who they consider as a father and patron."
  },
  {
    "headline": "2023: Amaechi resigns as transportation minister",
    "summarized_story": "Former Rivers State governor and presidential hopeful, Rotimi Amaechi, on Monday, officially resigned his position as minister of transportation.\nIn a press statement issued by the Amaechi Presidential Media Committee (APMC) signed by Kingsley Wali, in Abuja, Amaechi in his resignation letter expressed profound gratitude to President Muhammadu Buhari for considering him fit to serve in his administration.\nThe statement quoted Amaechi as saying in his resignation letter: “It is with mixed feelings that I tender my resignation as the Minister of Transportation of the Federal Republic of Nigeria to contest for the Presidential ticket of our great party, the All Progressives Congress.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem."
  },
  {
    "headline": "Twitter deal at lower price ‘not out of the question’ – Elon Musk",
    "summarized_story": "Tesla CEO, Elon Musk has hinted that he would be looking to renegotiate his $44bn deal to acquire Twitter.\nThe world’s richest man may have proved skeptics right, with his suggestion that a viable Twitter deal is “not out of the question” at a lower price, while speaking at the 2022 All-In Summit on Monday.\nThis is even as he’s continued to express skepticism about the company’s estimate of spam and fake accounts.\nMusk went further at the All-In Summit, saying without providing evidence that it “seems beyond unreasonable” that Twitter’s number of human accounts is at over 95%.\nMusk said that there is probably four to five times the number of bots compared to what Twitter said."
  },
  {
    "headline": "It’s all in Tottenham’s hands now: Newcastle beat Arsenal 2-0 to dent gunners champions",
    "summarized_story": "Arsenal, on Monday night, lost 2-0 away at Newcastle to hand Tottenham a chance to qualify for Champions League football next season at their own expense.\nWith the result, Tottenham remain two points above their north London rivals in fourth place in the Premier League.\nArsenal’s defeat also guaranteed third-place Chelsea’s place in the Champions League next season.\nBen White’s own goal and Bruno Guimaraes’ late strike was the difference between the sides on the scoreboard.\nBut Tottenham’s 3-0 derby win on Thursday cranked up the pressure on the young Gunners who failed to respond."
  },
  {
    "headline": "EFCC confirms arrest of Ahmed Idris, accountant-general of the federation for N80bn fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has confirmed that its operatives on Monday, May 16, 2022, arrested the serving accountant general of the federation, Mr. Ahmed Idris in connection with diversion of funds and money laundering activities to the tune of N80 billion.\nThe commission in a statement on Monday, said its verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.\nThe funds, it said, were laundered through real estate investments in Kano and Abuja.\nMr. Idris was arrested after failing to honour invitations by the EFCC to respond to issues connected to the fraudulent"
  },
  {
    "headline": "Osun Not For Sale, Oyetola Campaign Council Replies Adeleke, PDP",
    "summarized_story": "Senator Ademola, the PDP candidate had over the weekend during the party’s Osun Central Campaign rally, said “Osun people, you are the ones to decide.\nThis time around in Osun, it is fire for fire.”Reacting to Ademola’s comment, the Oyetola Campaign Council said: “Osun people are not gullible.\nThis explains why in spite of the way the 2018 election went, our administration began infrastructure intervention from Ede, the hometown of the PDP candidate.\nTherefore, the PDP candidate should keep his money.\nThe Campaign Council also cautioned Adeleke against overheating the polity with his incendiary comments and violent tendencies, wondering what he meant by saying ‘it’s fire for fire this time around’."
  },
  {
    "headline": "2023: INEC, IPAC, Seek Inclusion, Bridging Of Gender Gaps",
    "summarized_story": "The Independent National Electoral Commission (INEC) and the Inter-Party Advisory Council (IPAC) have called for the inclusion of the female gender in all the processes leading to the 2023 general elections.\nThey also stressed the need to close the gender gaps between men and women to create more sustainable and inclusive economies and societies.\nShe added that the factors which constitute impediments to women’s efforts at winning elective offices and enduring genuine political representation were numerous.\nFor his part, IPAC chairman, Engr Yabagi Sani, saluted the courage of women in politics, he also stressed the need to respect and honour “mothers” as written in the Holy Books.\nHe also urged women gunning for elective positions in the country not to be discouraged, adding that “all power belongs to God.”"
  },
  {
    "headline": "Deborah: Nasarawa Gov Appeals To CAN To Shelve Planned Protest",
    "summarized_story": "Nasarawa State governor, Engineer Abdullahi Sule, has added his voice to condemn the unfortunate killing of Deborah Samuel, a 200-level student of Shehu Shagari College of Education (COE) in Sokoto, describing the act as a crime against humanity.\nGovernor Sule made this known in his opening remarks during a security meeting that held at the Government House, Lafia on Monday.\nIt’s unfortunate, very very unfortunate, the way and the manner, that the promising girl was killed,” the governor said.\nOn the planned peaceful protest by CAN to show displeasure over the killing, he appealed to leaders of CAN in the state not to join the protest because of the fragile nature of Nasarawa State and the fear that hoodlums may eventually hijack the peaceful protest and to throw the state in chaos.\n“I will like to appeal to our leaders, to ensure that we don’t join this peaceful protest, especially because of the fragile nature of our state."
  },
  {
    "headline": "Deborah: Nasarawa Gov Appeals To CAN To Shelve Planned Protest",
    "summarized_story": "Nasarawa State governor, Engineer Abdullahi Sule, has added his voice to condemn the unfortunate killing of Deborah Samuel, a 200-level student of Shehu Shagari College of Education (COE) in Sokoto, describing the act as a crime against humanity.\nGovernor Sule made this known in his opening remarks during a security meeting that held at the Government House, Lafia on Monday.\nIt’s unfortunate, very very unfortunate, the way and the manner, that the promising girl was killed,” the governor said.\nOn the planned peaceful protest by CAN to show displeasure over the killing, he appealed to leaders of CAN in the state not to join the protest because of the fragile nature of Nasarawa State and the fear that hoodlums may eventually hijack the peaceful protest and to throw the state in chaos.\n“I will like to appeal to our leaders, to ensure that we don’t join this peaceful protest, especially because of the fragile nature of our state."
  },
  {
    "headline": "Professor Leads 33 Lawyers To Defend Suspected Killers Of Sokoto College Student In Court",
    "summarized_story": "The team of 34 lawyers who appeared in court on Monday to defend two suspects arrested over the killing of Deborah Samuel, a student of Shehu Shagari College of Education in Sokoto over alleged blasphemy, were led by a Professor, Mansur Ibrahim.\nThe suspects were arraigned in court following their arrest last week over their roles in the gruesome murder of Miss Deborah.\nShe was stoned to death and then burnt by a mob over alleged blasphemy against Prophet Muhammad (SAW) on a WhatsApp group.\nThe suspects, Bilyaminu Aliyu and Aminu Hukunci, were brought before a Sokoto Chief Magistrate’s Court for their alleged participation in the crime.\nThe court, thereafter, adjourned ruling on the application to a later date which would be communicated to the lawyers."
  },
  {
    "headline": "Ex-EFCC's boss Ibrahim Magu promoted to AIG",
    "summarized_story": "Former Acting Chairman of the Economic and Financial Crimes Commission (EFCC), Ibrahim Magu has been promoted to the rank of Assistant Inspector-General (AIG) of Police.\nMagu was promoted along with some others by the Police Service Commission (PSC).\nThe Commission also approved the promotion of another set of 55 CSPs to ACPs, which included; Janet Ademuyiwa Salami, Oyo State Command; Francis Ebhuoma, Lagos State Command; Iliyasu Tanko Doma X Squad, SCID, Kaduna and Ogonnaya Okpara, DPO, Ogui road, Enugu State Command,” it said.\nThey include; ASP Ajama Samuel Timi; Inspector Haliru Badamasi, Inspector Erigbara Franklin; Inspector Ihukor Sixtus Valentine; Inspector Kanja Victor; Inspector Jimoh Samuel; Inspector Ezeme Charles; Inspector Aruleba Kayode and Inspector Adedosu Adeyemi.\nThey include Egbo Obianuju Rosemary, Department of Operations, Delta State Command; Sanusi Hammari, Sokoto state Command; Zakka Bulus, FCT Command; Elegbe Kudirat Omolola, Lagos Command and Okpaleke Felix, Police Staff College Jos amongst others."
  },
  {
    "headline": "Naira loses serious ground against dollar",
    "summarized_story": "By Lydia NgwakweThe Naira on Monday depreciated at the Investors and Exporters window, exchanging at 421.50 to the dollar, representing 0.60 per cent, compared to 419 traded on Friday.\nThe open indicative rate closed at N417.30 to the dollar on Monday.\nAn exchange rate of N444.00 to the dollar was the highest rate recorded within the day’s trading before it settled at N421.50.\nThe Naira sold for as low as 410 to the dollar within the day’s trading.\nA total of 70.68 million dollars was traded in foreign exchange at the official Investors and Exporters window on Monday."
  },
  {
    "headline": "BREAKING: Accountant-General Of The Federation, Ahmed Idris, Arrested",
    "summarized_story": "According to PREMIUM TIMES, Nigeria’s Accountant-General, Ahmed Idris, has been arrested for alleged money laundering and misuse of state monies.\nAccording to sources familiar with the situation, Mr Idris was apprehended in Kano by EFCC operatives on Monday evening and is being taken to Abuja, the country’s capital, for questioning.\nOur sources further said after progress was made in the investigation, Mr Idris was summoned repeatedly for interrogation but he failed to honour the invitations.\nPresident Muhammed Buhari appointed Mr Idris accountant-general on June 25, 2015.\nPresident Buhari reappointed Mr Idris for a second four-year term in June 2019, amid criticisms from labour groups who said the accountant-general should retire after turning 60."
  },
  {
    "headline": "BREAKING: Magu Promoted To AIG Before Retirement From Police Force",
    "summarized_story": "Ibrahim Magu, the former interim chairman of the Economic and Financial Crimes Commission (EFCC), has been promoted to assistant inspector-general of police by the police service commission (PSC) (AIG).\nIn a statement released on Monday, PSC spokesperson Ikechukwu Ani revealed the development.\n“The eight Commissioners of Police promoted to AIGs were; CP Mustafa Magu Ibrahim who is the most senior in the CP cadre and who missed the last two promotions after returning to the Police; Abraham Egong Ayim; Okunlola Kola Kamaldeen; Andrew Amieengheme; Akeera Mohammed Younous; Celestine Amechi Elumelu; Ngozi Vivian Onadeko and Danladi Bitrus Lalas (Airwing),” the statement reads.\nThe news comes as Magu prepares to leave the Nigeria Police Force (NPF) after reaching the required retirement age of 60 on May 5.\nMore to come…"
  },
  {
    "headline": "BREAKING: Tension As Irate Youths Protest In Borno Over Alleged ‘Blasphemous Post’ By Young Woman",
    "summarized_story": "Palpable fear has enveloped Maiduguri town, Borno State, as some irate youths, in their hundreds trooped to the streets to express their displeasure over an alleged blasphemous statement by a lady, identified as Naomi Goni.\n“Protest ongoing in Maiduguri over Naomi; reports available indicate that protesters have moved from the Nigerian Army, 7 Division bypass to Gubio Camp.\nWriting partly in Hausa, Tanko Izge had said, “A message to Government of Borno State.\n#Findnaomigoni.”“A Gaskiya Tura yakai Bango A gari Irin Borno wata Ta Zage ma aiki Amma gwamnati Bawani feed Back.\nThe incident has continued to attract nationwide condemnation and the police arrested two suspects – although a protest by some Muslim youths over the arrest on Saturday turned violent in the state."
  },
  {
    "headline": "BREAKING: Amaechi Finally Resigns From Buhari’s Cabinet, Attorney-General, Malami, Refuses To Leave On Deadline Day",
    "summarized_story": "BREAKING: Amaechi Finally Resigns From Buhari’s Cabinet, Attorney-General, Malami, Refuses To Leave On Deadline DayThe Nigerian Minister of Transportation, Rotimi Amaechi, has finally resigned from office.\nThe minister’s resignation is in line with the directive by President Muhammadu Buhari to cabinet members with political ambitions.\n“Amaechi has finally resigned from office,” a top source told SaharaReporters.\nMalami, who is also the Attorney-General of Federation (AGF), had in April declared interest in the Kebbi State governorship race.\nHowever, last Friday, he pulled out of the Kebbi State governorship race, multiple sources had told SaharaReporters."
  },
  {
    "headline": "Breaking: EFCC nabs AGF, Ahmed Idris, for N80bn ‘fraud’",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission (EFCC), Monday, arrested the Accountant General of the Federation (AGF), Mr. Ahmed Idris, in connection with diversion of funds and money laundering activities to the tune of N80billiong.\nA press statement by the EFCC, Head, Media & Publicity, Wilson Uwujaren, in Abuja, said, “The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.\n“The funds were laundered through real estate investments in Kano and Abuja.\nMr. Idris was arrested after failing to honour invitations by the EFCC to respond to issues connected to the fraudulent acts.”Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Newcastle deal big blow on Arsenal’s Champions League hopes as Tottenham consolidate",
    "summarized_story": "Arsenal’s hopes of finishing in the Premier League top four were dealt a huge blow as they were well beaten by Newcastle at St James’ Park.\nMikel Arteta’s side needed a win to move above Tottenham into fourth and put them in the driving seat to secure a Champions League spot heading into the final weekend of the season.\nNewcastle, meanwhile, round off a season that provides encouragement for the future with a trip to Burnley.\nWilson had been a menace throughout as he showed no signs of rustiness on his return to the first team.\nIt was no surprise he was involved in the opener as White turned the ball into his own net as he attempted to prevent the Newcastle forward from getting a shot off."
  },
  {
    "headline": "Breaking: Ex-EFCC chairman, Magu, now AIG, Police commission’s new promotion reveals",
    "summarized_story": "The immediate past acting Chairman of the Economic and Financial Crimes Commission (EFCC), Ibrahim Magu, has been promoted to the level of Assistant Inspector-General of Police, the Police Service Commission (PSC) has eventually revealed.\nThe PSC also confirmed the appointment of Deputy Inspector Genreal of Police (DIG) John Ogbonnaya Amadi, just as the commission approved the appointment of Zama Bala Senchi as a DIG.\nThe PSC, alongside promoted seven other Commissioners of Police (CPs) have been promoted to the next rank of Assistant Inspectors General of Police (AIG).\nThe Commission also approved the promotion of another set of 55 CSPs to ACPs; two SP skipped in the earlier promotion, Adebayo Olayinka and Abdulrazaq Bello, were promoted to the next rank of CSP.\nhas congratulated the promoted OOfficers and charged them to redouble their efforts in the service of their fatherland."
  },
  {
    "headline": "TCN reconstructs vandalized transmission tower in Uyo",
    "summarized_story": "… Set to energise transmission line soonBy Onu OkorieTransmission Company of Nigeria TCN has disclossed that the reconstruction works on the vandalized transmission Tower Number 104 on Odukpani – Ikot Ekpene 330kV double-circuit transmission line in Akwa Ibom has been completed, while work is ongoing to fortify other towers minimally vandalized along the same line route, to enable the restringing and tensioning of the 330kV DC transmission line, before it is energized.\nThe Executive Director, Transmission Service Provider (TSP) at TCN, Engr.\nAdewumi, who briefed newsmen at the site, said the tower has been reconstructed and work has reached an advanced stage after three weeks, even with difficulties posed by the terrain.\nAdewumi appealed to the public to help TCN in the fight against the vandalism of power infrastructure, saying that such acts are detrimental to Nigerians and the expansion of power infrastructure in Nigeria.\nHe also assured residents of Cross River State and parts of Akwa Ibom State that the company was fast-tracking the completion and restoration process."
  },
  {
    "headline": "Mastercard Foundation subsidized loans will break barriers to MSMEs productivity in Nigeria – Mrs Edu",
    "summarized_story": "By Onu OkorieThe Managing Director, First City Monument Bank FCMB, Yemisi Edun has described the Mastercard Foundation subsidized loans to 100,000 Micro, Small, and Medium Enterprises MSMEs as a purpose-driven intervention that would further help break the barriers that limit MSMEs’ productivity and overall success in Nigeria.\nThe program, which is part of the Mastercard Foundation’s Young Africa Works strategy in Nigeria, aims to sustainably move Nigerian youth out of poverty.\nThe remaining 30 percent will be deployed to meet the funding needs of youth-owned enterprises and businesses run by vulnerable members within Nigeria.\nShe said, “The past few years have been very challenging for individuals, households, and businesses in Nigeria.\n“We are proud to partner with the Mastercard Foundation to rebuild businesses, drive recovery, and stimulate economic growth by providing the much-needed support to Nigerians to engage in productive activities."
  },
  {
    "headline": "ABCON unveils roadmap on ‘save naira’ campaign",
    "summarized_story": "By Kehinde Ibrahim, LagosAssociation of Bureaux De Change Operators of Nigeria (ABCON) has developed a roadmap campaign plan needed to save the naira from further decline and enhance exchange rate stability.\nThe ABCON National Executive Council said the move to save the naira was agreed by the body at the conclusion of its meeting in Lagos, where it unveiled strategies for save the local currency, bridge the exchange rate gaps and curb volatility in the forex market.\nThe naira exchanges at N596 to dollar at the parallel market and N415.83 to dollar at the official market creating a rate gap of N180.17 per dollar.\nGwadabe insisted that now is the time to break the current industry monopoly that puts the remittances market in the hands of few players depriving others from tapping into the plan.\nThe ABCON can also be recognized as self-regulatory organization to enable it operate effectively and sanction erring members,” he stated."
  },
  {
    "headline": "Nigeria set to become destination for medical tourism, reverse brain drain – Mohammed",
    "summarized_story": "By Palma IleyeMinister of Information and Culture, Alhaji Lai Mohammed, has said that with the establishment of world class healthcare facilities in Nigeria, the country was set to become a destination for medical tourism, in addition to reversing the brain drain in the health sector.\nMohammed who spoke after a media tour of Duchess International Hospital in Lagos, said the world class healthcare facilities springing up in Nigeria will also curb medical tourism abroad, conserve foreign reserves and create jobs.\n“Today, we are here at the Duchess International Hospital.\nThe Minister said the Federal Government, through the Central Bank of Nigeria and the Bank of Industry, provided financial support for Duchess International Hospital, as part of its intervention in the health sector.\n“With that, we can conserve our foreign reserves, earn foreign exchange for the country, create jobs, reverse brain drain, become a destination for medical tourists and also ensure affordable and standard healthcare for Nigerians,” he said."
  },
  {
    "headline": "Halo financial services launches into Nigeria Fintech space",
    "summarized_story": "By Kehinde Ibrahim, LagosHALO Financial Services Ltd, a fintech start-up has launched with an innovative approach to help Nigerians manage and grow their money.\nSpeaking at a media round table to introduce the company, the Chief Executive Officer and co-founder, Chidimma Onyeokoro disclosed that Halo enables communities to provide financial services to their members.\nCommunity members are able to leverage the strength of their union for better financial returns.\nBy focusing on communities, Halo will be able to scale faster.\nThis allows us to offer a full spectrum of financial services from basic banking to sophisticated investments."
  },
  {
    "headline": "EFCC Arrests Accountant-General Over N80bn Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested the Accountant-General of the Federation (AGF) Ahmed Idris over an N80 billion fraud.\nEFCC spokesman Wilson Uwujaren confirmed his arrest in a statement issued on Monday evening.\nHe said Idris was arrested after failing to honour the commission’s invitations to respond to issues connected to the fraudulent act.\nREAD ALSO: Sexual Assault: Court Sentences School Bus Driver To Life Imprisonment“Operatives of the Economic and Financial Crimes Commission, EFCC, on Monday, May 16, 2022, arrested serving Accountant General of the Federation, Mr. Ahmed Idris in connection with diversion of funds and money laundering activities to the tune of N80 billion( Eighty Billion Naira only),” Uwujaren’s statement read.\n“The Commission’s verified intelligence showed that the AGF raked off the funds through bogus consultancies and other illegal activities using proxies, family members and close associates.”According to the EFCC, the funds were laundered via real estate investments in Kano and Abuja."
  },
  {
    "headline": "Former EFCC Boss Magu Promoted To AIG Rank",
    "summarized_story": "Former acting Chairman of the Economic and Financial Crimes Commission, Ibrahim Magu, has been promoted to the rank of Assistant Inspector General of Police, the Police Service Commission said on Monday.\nMagu served as acting Chairman of the EFCC from 2015 to 2020.\nREAD ALSO: EFCC Arrests Accountant-General For N80bn FraudThe Senate twice refused to confirm him his appointment.\nMagu was later suspended along with several others for allegedly mismanaging funds of the commission, an allegation he repeatedly denied.\nHe was probed for over three months by a judicial panel of inquiry led by a former President of the Court of Appeal, Justice Ayo Salami."
  },
  {
    "headline": "FG Orders Resumption Of Abuja-Kaduna Train Service",
    "summarized_story": "The Abuja-Kaduna train service will resume on May 23, the Federal Government said on Monday.\nTrain services had been suspended on the route after terrorists attacked a train, fatally shot several persons, and abducted scores of passengers in March.\nREAD ALSO: Airlines Warn Of Imminent Disruptions To FlightsThe families of those abducted have threatened to resist the reopening of the train service.\n“These measures are not only for the Abuja-Kaduna Train Service (AKTS) but also for all the passenger train services especially on the standard gauge railway lines,” the statement said.\nOnline and offline purchase of tickets must contain the passengers individual profile or identification data, the NRC said."
  },
  {
    "headline": "Sokoto Alleged Blasphemy: Police Arraign Suspects In Court",
    "summarized_story": "The Police on Monday arraigned two suspects, Bilyaminu Aliyu and Aminu Hukunci before a Chief Magistrate Court in Sokoto over the killing of a student, Deborah Samuel.\nThe suspects, alongside the victim, were students of Shehu Shagari College of Education, Sokoto.\nKhalil Musa told the court that the suspects were accused of participating in a disturbance act that led to the death of Samuel on May 12.\nREAD ALSO: Sexual Assault: Court Sentences School Bus Driver To Life ImprisonmentMusa said an investigation was in progress.\nIbrahim urged the court to grant the accused persons bail on liberal terms, citing constitutional provisions and sections of the Administration of Criminal Justice Law."
  },
  {
    "headline": "2023: I Will Make Nigeria’s Economy Productive – Peter Obi",
    "summarized_story": "A presidential aspirant on the platform of the Peoples Democratic Party (PDP), Peter Obi has pledged to turn Nigeria from a consuming nation to a producing economy if he is elected the president of the country in the 2023 presidential election.\nObi, a former Governor of Anambra State, made the pledge when he met with PDP delegates in Kaduna State to solicit for their support and vote during the forthcoming primary.\nAddressing the delegates, Obi who lamented the rising insecurity in the country, said his administration will tackle insecurity by pulling millions of citizens out of poverty through job creation and providing a conducive environment for businesses to thrive.\nREAD ALSO: Buhari Surrounds Himself With Liars, Sycophants – Bala MohammedHe also said that his administration will revive the moribund textile industries that used to be one of the nation’s revenue earner and also improve the agricultural sector for farmers in the north through the provision of incentives and other farming implements to farmers.\nHe however appealed to Kaduna PDP delegates to vote wisely and ensure they elect a presidential candidate that has the capacity to address the numerous socioeconomic and developmental challenges confronting the country, adding that he is best man for the job."
  },
  {
    "headline": "Zamfara APC Lawmaker Returns to PDP",
    "summarized_story": "A federal lawmaker in Zamfara Suleiman Abubakar Gummi representing Gummi/Bukuyyum federal Constituency at the House of Representatives has left the ruling All Progressive Congress APC to return to the People’s Democratic Party PDPThe green chamber lawmaker said the party in Zamfara has not been honest and fair to it Members and necessitated his defection to the PDPhttps://www.tvcnews.tv/purplegold/post-new.php#Suleiman Gummi was elected Member of the House of representatives under the platform of the People’s Democratic Party in 2019 but defected to the APC alongside governor Bello Matawalle and other top Government Officials in June 2021Ten months later, the Green Chamber lawmaker defected back to the PDPhttps://www.tvcnews.tv/purplegold/post-new.php#This decision he said was as a result of the sharing of elected political offices by the state Governor Bello Matawalle and former Governor Abdul’azeez Yari among other top APC Bigwigs ahead of the 2023 General elections which has affected his seatSuleiman Gummi announced his move and his supporters to the PDP at Political Gathering in Gummi, Local Government area of Zamfara State.\n“We cannot Continue to remain in APC especially the way the party is going in Zamfara State.\nLet them use the money and build our bridge, equipt and supply drugs to our Hospitals etc” .\nHe advised the GovernorSuleiman Gummi appeal to his supporters to remain calm and peaceful and assured them of Victory at the polls.\nPeople’s Democratic Party according to him bounce back stronger in Zamfara."
  },
  {
    "headline": "Timipre Slyva withdraws from Presidential race -",
    "summarized_story": "Minister of State for Petroleum, Chief Timipre Sylva, has withdrawn from the presidential race in the All Progressives Congress and has returned to work.\nMr Sylva reportedly withdrew having considered the enormous work at hand at the ministry of Petroleum Resources.\nThe Northern Solidarity Group had on May 9, presented the APC’s Expression of Interest and Nomination forms to the minister to enable him to contest the party’s 2023 presidential primaries.\n“He believes that concentrating on his work will attract more investments for the oil and gas sector.\nMeanwhile, Mr Horatius Egua, Senior Adviser, Media and Communications to the minister, when contacted, confirmed to NAN that the minister was back to work."
  },
  {
    "headline": "2023: Wike visits Lagos, seeks support of PDP delegates",
    "summarized_story": "Governor of Rivers State and PDP presidential aspirant, Nyesom Wike, says he will end injustice in the country and initiate measures to fight poverty among Nigerians if elected president.\nMr. Wike stated this at a meeting with national delegates of the People’s Democratic Party in Lagos State.\nGovernor Wike highlighted his plans for the country, harping on the need to end insecurity and poverty bedevilling the nation.\nBut in a quick twist, the Rivers state Governor said if he doesn’t win the ticket, he would support anyone who wins to ensure that the party returns to power.\nThe PDP’s national convention to nominate its Presidential candidate for the 2023 general elections is slated for the 28 and 29 of May 2022."
  },
  {
    "headline": "Why I'll stand with Yahaya Bello, not S'West aspirants",
    "summarized_story": "She said this on Monday while addressing journalists in Lagos ahead of the APC presidential primaries slated for May 30 and 31, in Abuja.\nAbiola-Costello, however, said Bello was a loyal and respectful person, who would carry everyone along after he emerges.\nThe World Bank accountability ranking of states in Nigeria evaluated Kogi as 2nd in 2017, 1st in 2018 and 2019.\nAbiola-Costello said the campaign team of Governor Bello had been interfacing with critical stakeholders of APC to present his development credentials, which would be replicated at the federal level.\n“Going into the presidential primaries, we are on a good footing."
  },
  {
    "headline": "Nigeria’s Accountant General Ahmed Idris Arrested By EFCC Over N80bn Fraud",
    "summarized_story": "Nigeria’s Accountant-General, Ahmed Idris, has been arrested over alleged money laundering and diversion of public funds.\nThose familiar with the development said Mr Idris was intercepted in Kano by operatives of the Economic and Financial Crimes Commission (EFCC) on Monday evening and is being flown to Abuja, the nation’s capital, for interrogation.\nSources said the EFCC has for sometime now been investigating a case of diversion of at least N80 billion in public funds which was allegedly laundered through some bogus contracts.\nThe companies used in laundering the funds have allegedly been linked to family members and associates of the accountant-general, investigators said.\nA source said after progress was made in the investigation, Mr Idris was summoned repeatedly for interrogation but he failed to honour the invitations."
  },
  {
    "headline": "Deborah Never Made Any Blasphemous Comment Towards The Prophet – Reverend Samson Ayokunle",
    "summarized_story": "The Christian Association of Nigeria has called on all its members to embark on a peaceful protest nationwide to demand justice for late Deborah Yakubu, the slain Shehu Shagari College of Education student who was stoned by a mob and set ablaze for alleged blasphemy in the school premises, last week.\nRelatedStories No Content AvailableIn a statement signed by the General Secretary, Joseph Daramola, on Saturday, CAN President, Rev Dr Samson Ayokunle, directed all secretariats to stage the protest on Saturday, May 22, 2022.\nThe statement titled, ‘A Request for Nationwide Peaceful Protests, Calling for Justice for Deborah Yakubu’, urged Nigerians in the diaspora to also stage protests at Nigerian embassies worldwide.\nAccording to CAN the occasion can also be used to pray for Deborah’s family and friends, peace for the country, victory for the Church and godly political leaders in the coming general election slated for next year.\nFrom Ibadan in Oyo State, is Rev Dr Samson Ayokunle, the President of the Christian Association of Nigeria is our guest."
  },
  {
    "headline": "Soludo Visits Nnamdi Kanu In Detention + Deborah’s Parents Share Their Grief- Trending With Ojy Okpe",
    "summarized_story": "The parents of Deborah Samuel, the 22 year old student of Shehu Shagari College of Education in Sokoto state who was set ablaze by a mob over comments considered to be an insult to Prophet Mohammed have opened up about their grief in the gruesome Murder of their daughter.\nIn another development, a pregnant woman who was kidnapped by terrorists from the ill fated Abuja – Kaduna train on March 28th has regained her freedom.\nReactions have trailed the submission of the expression of interest and presidential nomination forms of Akinwumi Adesinathe president of the African Development Bank.\nFinally, Professor Charles Chukwuma Soludo the governor of Anambra state over the weekend, visited the leader of the Indigenous People of Biafra Nnamdi Kanu in detention."
  },
  {
    "headline": "Ukraine Forces Reach Border Near Kharkiv as Russians Fall Back",
    "summarized_story": "Ukrainian troops counter-attacking against Russian forces in the country’s northeast have pushed them back from the city of Kharkiv and advanced as far as the border with Russia, Ukrainian officials said on Monday.\nFighting was reported near Kharkiv, Ukraine’s second-largest city, on Monday in what interior ministry adviser Vadym Denisenko said was “our counter-offensive”.\nKharkiv, lying about 30 miles (50 km) from the border with Russia, had endured weeks of heavy bombardments from Russian artillery.\nSince mid-April, Russian forces have focused much of their firepower on trying to capture the Donbas.\nUkraine’s military also acknowledged setbacks, saying Russian forces “continue to advance” in several areas in the Donbas region."
  },
  {
    "headline": "TotalEnergies Invests Almost $30bn in Nigeria Within Eight Years, Government Says",
    "summarized_story": "Nigeria’s federal government has disclosed that French oil major, TotalEnergies EP Nigeria Limited, has invested almost $30 billion in Nigeria’s oil and gas sector within the space of eight years.\nWabote said TotalEnergies had invested immensely in Nigeria and deserved commendation for remaining consistent in investing in the country’s oil sector.\nTerraz expressed excitement at the opportunities that abounded in Nigeria, and indicated the intention of TotalEnergies to expand into the Nigerian electricity sector.\nSangster said TotalEnergies was proud to be the second largest oil and gas producer in Nigeria, contributing 20 per cent of Nigeria’s oil production.\nSangster added that the partnership between TotalEnergies and Nigeria had been a very successful one, pointing out, however, that the journey has not always been smooth."
  }
]