[
  {
    "headline": "Cholera killed 175 Kaduna residents in 2021 – Govt",
    "summarized_story": "The Kaduna State Commissioner for Health, Dr Amina Muhammed-Baloni, has said cholera claimed about 175 lives across the 23 Local Government Areas of the state last year.\nThe commissioner disclosed this while receiving cholera testing equipments donated by the World Health Organisation to the state in Kaduna on Thursday.\nThe items donated included sero-type reagents among others for the zonal cholera laboratory located at the late Yusuf Dantsofo Memorial Hospital, Tudun-Wada, in the state capital.\nSpeaking to journalists shortly after receiving the items, Muhammed-Baloni, said the state witnessed high cases of cholera in 2021 with a casualty figure of 175.\nWe thank WHO for the support to Kaduna State."
  },
  {
    "headline": "Agbekoya threatens to free Igboho through ‘traditional means’",
    "summarized_story": "He also called for improvement in security across the country, saying increase in the rate of violent crimes should be of concern to government.\nWe know that it is the Federal Government that is holding Igboho in Benin Republic, but we are telling Benin Republic authorities now to legally release him using their court.\n“They should release him legally and quickly because they are not taking him to court again, or we will use our traditional means and powers to take Igboho out of the court.\n“We are Agbekoya, if they don’t release Sunday Igboho legally, we are going to take him out of Benin Republic.\nThey will just see that Sunday Igboho is out of their prison.”Copyright PUNCH."
  },
  {
    "headline": "Reps committee seeks state of emergency on schools infrastructure",
    "summarized_story": "*Says COVID-19 awareness campaign in schools without water, sanitizers is exercise in futilityBy Joseph ErunkeABUJA– THE House of Representatives Committee on Basic Education, has called for declaration of state of emergency on schools’ infrastructure in the country, saying the condition where children were being subjected to learn under was unacceptable.\nThe committee also called for digitalisation of all basic schools in the country, tasking authorities to fashion out policies that would ensure all headmasters and teachers were computer literate.\nREAD ALSO:Sterling Bank set to reward young tech founders in HEART sectorsThis came as stakeholders in education sector claimed authorities at different levels have not lived up to expectations in repositioning basic education.\nHe frowned that some state governments had abandoned their counterpart funds with the Universal Basic Education Commission while some diverted the money to other areas outside education.\nSo those coming after will repeat the same mistake.How can a governor stay in office for eight years and not access his state’s money with UBEC?"
  },
  {
    "headline": "Sterling Bank set to reward young tech founders in HEART sectors",
    "summarized_story": "By Peter EgwuatuSterling Bank Plc, has concluded arrangement to organise an award, known as the Sterling Heart Fellowship Award, for young tech founders whose businesses employ innovative solutions to tackle challenges in the HEART sectors.\nThe award is targeted at tech founders within the age bracket of 14 and 16 and will hold in February under the Founder Institute Lagos Virtual Spring programme.\nREAD ALSO:Police arrest 2 NAF personnel, civilian over invasion of Abuja estateThe HEART sectors include health, education, agriculture, renewable energy and transportation.\nThey represent the sectors where the bank is focusing investments on under its HEART’s of Sterling strategy.\nThe applicants must be young tech founders and tech enthusiasts, especially those with ideas and initiatives within the HEART sectors."
  },
  {
    "headline": "FCT Fire service challenges state governors to equip states’ fire stations with hi-techs",
    "summarized_story": "“I’m calling all the state governors to do same because they should copy from what the Minister of FCT is doing in the FCT.\nSo we actually told them that we are going to come back and introduce more to them using the medium of fire safety club.\n“Immediately after dry season campaign we are certain to go back to our fire safety in schools and some other organizations.\n“We’re actually doing that in pari pass with the dry season campaign.\nSo, that’s why we said we would take the dry season campaign seriously”, he added."
  },
  {
    "headline": "Police arrest 2 NAF personnel, civilian over invasion of Abuja estate",
    "summarized_story": "Omeiza Ajayi, AbujaThe Nigerian Police have arrested a tenant and two personnel of the Nigerian Air Force for invading the Mab Global Estate, Gwarinpa, Abuja and beating up the security men on duty.\nThe police are also interrogating a tenant in the estate who was reported to have invited the NAF personnel to attack the security personnel in guard duty comprising policemen and operatives of a private guard company.\nWhile the estate security personnel thought the matter had been settled, the tenant was said to have returned with two airmen to beat up the security men on duty around 12 am.\nFollowing the intervention of the General, the two airmen and the tenant were promptly arrested and taken to the nearby Efab Police Station.\nHe urged the police to investigate the suspects to ascertain whether they are indeed personel of the Air Force."
  },
  {
    "headline": "PDP faults APC’s scorecard, labels Buhari administration govt of liars by liars",
    "summarized_story": "By Dirisu YakubuThe Peoples Democratic Party, PDP, yesterday described the President Muhammadu Buhari-led All Progressives Congress, APC, administration as a government of liars by liars and for liars.\n“The statement read, “In its ludicrous anti-corruption scorecard, the APC government has no response to the reported looting of $25 billion under its watch as detailed in the Nigeria National Petroleum Corporation, NNPC, leaked memo under its watch.\nThe PDP restates its demand to the APC to publish the names and details of those it claims to be sponsors of terrorism and those it claims to have been arrested.\n“Nigerians have decoded the lying propensity of the APC and can no longer be hoodwinked.\nLike everything in life, the lies and propaganda of the APC at every election cycle has expiry date and as such the APC should expect the inevitable crushing verdict of the people in the 2023 elections.”"
  },
  {
    "headline": "Asset recovery drive: Group backs AGF Malami",
    "summarized_story": "The Coalition for Human Rights and Rule of Law, on Thursday, threw its weight behind the assets recovery drive of the Minister of Justice and Attorney-General of the Federation (AGF), Mr. Abubakar Malami (SAN).\nThe AGF had been in the media recently over an alleged award of “a multi billion naira assets recovery contract to a company and its lawyers secretly”.\n“As stakeholders in the justice sector, we are tempted to believe that the stance of the AGF with regards to asset recovery has not gone down well with some individuals hence the puerile attempt at blackmail and intimidation”, the group alleged.\nThe coalition said it was aware that the asset recovery drive of the Federal Government had indeed “ruffled some feathers”, hence the target of the AGF, whose responsibility it was to ensure the successful implementation of the asset recovery drive.\n“As stakeholders in the justice sector, we are tempted to believe that the stance of the AGF with regards to asset recovery has not gone down well with some individuals, hence the puerile attempt at blackmail and intimidation."
  },
  {
    "headline": "Vision FM: NBC sanction over NIA needless, Nigeria gagging press – CISLAC",
    "summarized_story": "The Civil Society Legislative Advocacy Centre (CISLAC), has condemned the “needless clampdown” on Vision FM.\nThe Hausa programme talked about the reappointment of Ahmed Rufai Abubakar as Director-General of the National Intelligence Agency (NIA).\n“He was compulsorily retired after failing his promotion examinations, from Deputy Director to Director, three (3) times consecutively.\nIrked by the deliberation on Idon Mikiya, the National Broadcasting Commission (NBC) slammed a N5million fine on Vision FM.\nRafsanjani, Head of Transparency International, Nigeria and Chairman of Amnesty International, Nigeria, advised the NBC to handle its regulatory role professionally and with restraint."
  },
  {
    "headline": "Insecurity: Umahi orders immediate arrest of killers of soldier in Ebonyi",
    "summarized_story": "Ebonyi State Governor, David Umahi, on Thursday, ordered immediate investigation and possible arrest of gunmen who allegedly killed a soldier whose name is yet to be identified at the time of filing this report at the Banditary between Ebonyi and Enugu States.\nUmahi spoke to journalists through the Commissioner of Information and State Orientation, Mr. Uchenna Orji, shortly after an executive council meeting.\nAccording to him, “Today, the executive council was briefed on the killing of a soldier on duty by yet to identify gunmen in a boundary between Uburu community in Ebonyi and Mpu in Enugu State.\n“The executive council condemned in totality the killing and urged the security operatives to intensify efforts to bring the perpetrators to justice.\n“The executive council also noted the renewed hostilities in Abaomege/Ishinkwo communities over their disputed land and directed stakeholders from the area to work closely with the security agencies, with a view to identifying those who are responsible for the renewed attacks despite the state government’s resolution on the disputed land."
  },
  {
    "headline": "ECOWAS against military takeovers – Osinbajo to coup plotters",
    "summarized_story": "Vice President Yemi Osinbajo on Thursday said the Economic Community of West African States (ECOWAS) remains opposed to military takeovers.\nThe VP insisted the only way of changing government, acceptable to all protocols and political rights of the people, are elections.\nHe spoke after attending the ECOWAS Extraordinary Summit on the political situations in Burkina Faso, Mali and Guinea in Accra, Ghana.\nHe said leaders reiterated their position that there is absolutely no excuse for a change of government by coup d’etat.\n“What happened in Burkina Faso was considered and has been condemned by all Heads of State."
  },
  {
    "headline": "ISIS leader, Ibrahim Qurayshi killed in raid by US special forces",
    "summarized_story": "Ibrahim Qurayshi, leader of the Islamic State of Iraq and Syria (ISIS) has been killed by US special operations forces.\nAccording to Biden, Qurayshi was “removed” in a counterterrorism mission that happened overnight in north-western Syria.\n“Last night at my direction, U.S. military forces in northwest Syria successfully undertook a counterterrorism operation to protect the American people and our Allies, and make the world a safer place.\n“Thanks to the skill and bravery of our Armed Forces, we have taken off the battlefield Abu Ibrahim al-Hashimi al-Qurayshi — the leader of ISIS.\nQurayshi was named as ISIS leader, after the killing of Abu Bakr al-Baghdadi in October 2019 by US troops."
  },
  {
    "headline": "Sule releases N340m for retirees’ gratuity",
    "summarized_story": "In his commitment to ensuring the welfare of senior citizens of Nasarawa State, Governor Abdullahi Sule has released the sum of N340 million for the payment of gratuity of 1,193 state and local government retirees.\nThe Director-General, State Pension Bureau, Sulieman Nagogo disclosed this at a briefing yesterday in Lafia, the state capital.\nThe D-G said the approval of the N340 million was to offset the gratuity of 576 and 614 local government and state retirees respectively.\nHe added that the gesture was aimed at alleviating the plights of retirees in the state.\nNagogo explained that the administration inherited a backlog of debt of gratuity and pension benefits of retirees at the state and local government levels from successive administrations in the state."
  },
  {
    "headline": "Sule inaugurates N2b Karu retail, recreational centre",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has performed the groundbreaking ceremony of the Karu Retail and Recreational Centre, estimated to cost N2 billion.\nSule performed the groundbreaking at the site of the project at Karu, Karu Local Government Area yesterday.\nThe Karu Retail and Recreational Centre is a joint venture between the Nasarawa State Government and the Barlow and Barrow International Nigeria Limited.\nChief Executive Officer of the Karu Retail and Recreational Centre, Yahaya Yahaya, said Nasarawa State has become an investment destination, with the Karu Retail and Recreational Centre which is a well-thought-out development and business model that promises to deliver a sustainable return on investment for the parties involved.\nThe Managing Director and CEO of the Nasarawa Investment Development Agency, Ibrahim Abdullahi, described the event as a landmark partnership for the retail sector in the state."
  },
  {
    "headline": "CNPP to Buhari: Sign re-amended Electoral Bill",
    "summarized_story": "The Conference of Nigeria Political Parties (CNPP) yesterday called on President Muhammadu Buhari to assent to the Electoral Bill without further delay as lawmakers have removed the contentious clause on direct party primary elections.\nBuhari’s Senior Special Assistant on National Assembly Matters (Senate), Senator Babajide Omoworare had, on Monday, confirmed the transmission of the re-amended bill to the President.\nHe had explained that the transmission of the bill to Mr President was in line with the provisions of Section 58 (3) of the 1999 Constitution and the Acts Authentication Act Cap A2 LFN 2004.\nHowever, in a statement signed by its Secretary-General, Chief Willy Ezugwu, the CNPP said “nothing should be a stumbling block to the assent of the bill by Mr President as the National Assembly has done his bidding.\n- Advertisement -“We, hereby, join other well-meaning Nigerians to call on Mr President to immediately sign the re-amended Electoral Bill in demonstration of a genuine commitment to electoral reform; as a victim of electoral manipulation and a beneficiary of improved electoral system under the President Goodluck Jonathan administration in 2015.”"
  },
  {
    "headline": "Plateau primary: Lawmaker emerges PDP candidate",
    "summarized_story": "The Peoples Democratic Party (PDP), Plateau State has concluded its primary for the forthcoming Jos North/Bassa Federal House of Representatives by-election Musa Agah emerged as the flag bearer of the party.\nMusa scored 152 votes, while Jonathan Dabo polled 127 votes.\nDeclaring the results yesterday at Lamonde Hotel in Jos, the state capital, Chairman of the PDP Primaries Committee, Francis Orogu said the third aspirant David Racha got only one vote out of 281 total votes cast by the delegates of the party.\nHe urged the aspirants to take advantage of the rancour in the ruling All Progressives Congress (APC) primary for a sound victory on February 26, 2022.\n- Advertisement -“If we did not unite and corporate, and only look at a technical issue that will suit our personal interest having gone this far, then we should know that we have ourselves to blame.”"
  },
  {
    "headline": "Three policemen feared killed, villagers abducted as gunmen storm station",
    "summarized_story": "Gunmen have killed three police officers in a raid on a Police station in Ishau under the Kafin-koro Police Division of Paikoro local government area of Niger State.\nIt was gathered thee gunmen invaded the police station in large numbers to free an informant who was ain custody.\nRead Also; Gunmen kill soldier at Ebonyi checkpointIt was learnt that the gunmen also conducted a village-to-village raid in Kafin-koro area as 11 communities, including Zubakpere, Kuna, Aboloso, Kudami, Dakolon Daji, Nugwazi, Amale, Adunu, Ishau and parts of Beni were attacked.\n- Advertisement -Several others, including a village head, four of his children and five women were abducted across six communities in the local government.\nNiger Police spokesman DSP Wasiu Abiodun did not pick his call or respond to SMS when contacted on the incident."
  },
  {
    "headline": "Moments Egypt’s coach was sent out",
    "summarized_story": "A hot-headed Carlos Queiroz was sent off in the closing stages of normal time in Egypt’s African Cup of Nations clash against Cameroon, after pointing to the referee that one of his players was punched.\nReplays did not appear to show contact, however, and Queiroz was shown a red card, meaning that he will now miss the final or third place play-off.\nQueiroz’s assistant, Roger De Sa, was almost made to suffer the same fate – but was only handed a yellow card shortly after the manager was punished for dissent.\nNotably, the man at the helm was seen regularly questioning the referee’s choices throughout the clash.\nMeanwhile, it was sensationally revealed after his red card that no Egypt player has received more cards at the tournament than their manager, who now has three."
  },
  {
    "headline": "AFCON 2021: It’s Senegal, Egypt final",
    "summarized_story": "Mohamed Salah will take on Liverpool teammate Sadio Mane in the Africa Cup of Nations final after Egypt booked their spot with a penalty shootout victory over hosts Cameroon.\nEgypt goalkeeper Gabaski denied Harold Moukoudi and James Lea Siliki before Clinton Njie floated his effort way wide of the goal while needing to convert.\nCameroon’s woes after a disastrous shootout will be compounded by the knowledge they had the lion’s share of chances throughout the match.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nDefender Michael Ngadeu-Ngadjui saw his header cannon back off the woodwork on 18 minutes and captain Vincent Aboubakar would have diverted the rebound goalwards but for last-ditch defending from men in white."
  },
  {
    "headline": "3 dead, 7 missing after FPSO vessel explosion in Delta state",
    "summarized_story": "By Steve AgbotaThree persons have been confirmed dead while seven others are missing after a Floating Production, Storage and Off loading (FPSO) vessel, Trinity Spirit, located at the Ukpokiti Terminal, Escravos, exploded Warri, Delta state.\nThe explosion said to have triggered raging fire and threatened fishing activities in some of Nigeria’s riverine communities in the Niger Delta area of the country.\nSources said a lurid explosion was heard around 1:00 a.m. on Wednesday around Meren oil facility offshore Escravos.\nThe source hinted that the explosion has allegedly caused serious fear among workers manning oil facilities close by, including fishermen around the area.\nMeanwhile, in a statement by the management of the oil and gas company’s offshore facility, Shebah Exploration & Production Company Ltd (SEPCOL) confirmed the fire incident."
  },
  {
    "headline": "FG uncovers 96 financiers of terrorism",
    "summarized_story": "The Federal Government said it has uncovered 96 financiers of terrorism, among whom, 424 associates/supporters of the financiers.\nThe minister also said the fraud unit unmasked 123 companies and 33 bureaux de change linked with terrorism in the country.\nHowever, Mohammed did not give the names of the sponsors and companies linked with terrorism.\nHe said: “For its part, the analysis by the Nigerian Financial Intelligence Unit, in 2020-2021, revealed 96 financiers of terrorism in Nigeria, 424 associates/supporters of the financiers, involvement of about 123 companies and 33 bureaux de change, in addition to identifying 26 suspected bandits/kidnappers and 7 co-conspirators.\n“On terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries."
  },
  {
    "headline": "WACT MD commends Customs for acquiring scanner at Onne Port",
    "summarized_story": "By Steve Agbota, LagosThe Managing Director of West Africa Container Terminal Nigeria (WACT), Naved Zafar has commended the Nigeria Customs Service (NCS) for installing a new scanning machine at the Onne Port Complex.\nAli said the scanner will facilitate trade, ensure security and drastically reduce the importation of illicit goods by unscrupulous persons.\nWACT Managing Director, Naved Zafar, who attended the commissioning ceremony alongside other dignitaries at the port, said the scanner will aid manifest verification, Customs tariff collection and the identification of contraband.\nOn the ongoing upgrade of WACT, he said: “The terminal upgrade is on course.\nIt is the first Greenfield container terminal in Nigeria to be built under a Public-Private Partnership (PPP) model."
  },
  {
    "headline": "Breaking: 22,000B/D Floating Oil Platform Explodes in Niger Delta",
    "summarized_story": "THISDAY checks showed that the huge facility, TRINITY SPIRIT, was built in 1976 (46 years ago), with a carrying capacity of 274774 Dead Weight Tonnage (DWT) and overall length of 337.05 meters as well as a width of 54.5 meters.\nThe asset is owned by Shebah Exploration and Production Company Limited (SEPCOL) which in 2004 acquired all of 40 per cent of ConocoPhillips equity interest in OML 108.\nThe FPSO serves as the primary production facility of for OML 108 and is also a government approved terminal for lifting operations for all OML 108 production.\nIn the release titled: “Fire Incident On The Trinity Spirit FPSO,” the company announced that the incident happened in the early hours of Wednesday.\n“The cause of the explosion is currently being investigated and we are working with necessary parties to contain the situation."
  },
  {
    "headline": "FEC Okays $329m for Railway Consultancy Supervision Services Nationwide",
    "summarized_story": "•Approves N115bn to dualise Katsina roadDeji Elumoye in AbujaThe Federal Executive Council (FEC) has approved contracts worth $328.87 million in consultancy services for the supervision of the various railway projects in the country.\nThe minister said, “Ministry of Transportation presented two memos and the first one has to do with the contract for consultancy services for the supervision of the various railway projects.\n“For the consultancy services, the following contractors were approved, with the total cost of $183.7 million: GIX Engineers Infrastructure Excellence/Yaroso & Partnership Ltd, Core Consulting Engineering Plc.\n“The last one is consultancy services for the supervision of Kano-Katsina-Jibia-Maradi Rail-line to TEAM (Technics Engineering Architecture Marketing Nigeria Limited) and that is for $47,670,000 million.\nSo, council approved that proposal at a cost of N115,425, 896,907.15 kobo (in billion) over 48months."
  },
  {
    "headline": "Our 2023 Presidential Ticket Open to All, Says PDP",
    "summarized_story": "The party stated this position when it received a letter from a group, Northern Advocate for Good Governance (NAFGG), which advocated a presidential candidate of northern Nigeria origin in the 2023 presidential election.\nIt was the first time the main opposition party would be stating its position on the presidency clearly ahead of the next general election.\nPDP maintained that no zone would be denied the opportunity of contesting in the election.\nNAFGG echoed PDP’s position, saying all the geopolitical zones, including those that had produced the president before, should be eligible to vie for the presidential ticket.\nFrom 1999 to 2023, the south would have ruled Nigeria for 14 years, while the north for 10 years."
  },
  {
    "headline": "Sylva Doubts Nigeria’s Petrol Consumption Figures, Says Numbers Crazy, Opaque",
    "summarized_story": "•Elumelu raises concerns over $4bn oil theft, insists its national disgraceJames Emejo and Emmanuel Addeh in AbujaThe Minister of Petroleum Resources, Mr Timipre Sylva, yesterday expressed doubts over Nigeria’s daily petrol consumption figures, describing them as crazy and opaque.\nI mean, when they tell you 90 million litres a day, I mean, they’re crazy figures.\n“We continue to interrogate these figures because we all know that there is a problem here, it’s opaque .\n“I know when people say the figures are… I mean, we agree that the figures are all opaque.\nBut we should just sit down and interrogate that subsidy, subsidy price and see what we are paying for it and what’s in the landing costs."
  },
  {
    "headline": "Attempted Coup in Guinea-Bissau Sends Jitters Across Africa",
    "summarized_story": "It was also learnt that Sissoco Embalo held an extraordinary cabinet meeting at around 10 a.m., entering the building with a heavy security detail.\nThe West Africa region has been mired by military take-over in the last 18 months with military take over in Mali, Guinea and Burkina Faso.\nGuinea-Bissau is not new to coup d’etat as for decades, there has been history of nine coups or attempted coups since independence from Portugal in 1974.\nThe ECOWAS Monitoring Group (ECOMOG) which some analysts are calling for, was a West African multilateral armed force established by the sub-regional body.\nECOMOG had been described as the first credible attempt at a regional security initiative in Africa.. Its establishment was spearheaded by Nigeria’s then military President, Ibrahim Babangida."
  },
  {
    "headline": "BREAKING: Nineteen Travellers Feared Killed In Auto Crash In Yobe State",
    "summarized_story": "Nineteen travellers are feared dead following a ghastly motor accident along Potisku-Damaturu Road in Yobe State, Saharaeporters has learnt.\nSaharaReporters learnt that the accident occurred some 50 kilometers from Damaturu, the state capital, around Fune in the Fune Local Government Area.\nSpokesperson for the police in the state, Dungus Abdulkarim, confirmed the incident but could not ascertain its cause or number of fatalities.\nHe said, \"I've dispatched men to the area, so give me some time, like 30 minutes or one hour to give you proper confirmation.\""
  },
  {
    "headline": "BREAKING: Nineteen Travellers Feared Killed In Auto Crash In Yobe State",
    "summarized_story": "Nineteen travellers are feared dead following a ghastly motor accident along Potisku-Damaturu Road in Yobe State, Saharaeporters has learnt.\nSaharaReporters learnt that the accident occurred some 50 kilometers from Damaturu, the state capital, around Fune in the Fune Local Government Area.\nSpokesperson for the police in the state, Dungus Abdulkarim, confirmed the incident but could not ascertain its cause or number of fatalities.\nHe said, \"I've dispatched men to the area, so give me some time, like 30 minutes or one hour to give you proper confirmation.\""
  },
  {
    "headline": "BREAKING: Nigerian Government Uncovers 96 Boko Haram, ISWAP Sponsors, 123 Companies Linked To Terrorism",
    "summarized_story": "The Nigerian Financial Intelligence Unit (NFIU) has uncovered 96 financiers of terrorism, especially those backing Boko Haram and the Islamic State of West Africa Province (ISWAP).\nThe Nigerian government also said NFIU has unmasked 424 associates/supporters of the financiers, about 123 companies and 33 bureaux de change linked with terrorism.\nAlso, from its analysis of tax evasion and tax avoidance linked to corruption, NFIU has identified N3,909,707,678,112.43 in VAT and N3,737,918,335,785.82 in Withholding Tax due to the Government.\n“On terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries.\nConfirming the report a few days later, Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), said the Nigerian government embarked on “a wider and far-reaching investigations” into terrorism financing after the conviction of Boko Haram financiers in the United Arab Emirates."
  },
  {
    "headline": "BREAKING: Nigerian Government Uncovers 96 Boko Haram, ISWAP Sponsors, 123 Companies Linked To Terrorism",
    "summarized_story": "The Nigerian Financial Intelligence Unit (NFIU) has uncovered 96 financiers of terrorism, especially those backing Boko Haram and the Islamic State of West Africa Province (ISWAP).\nThe Nigerian government also said NFIU has unmasked 424 associates/supporters of the financiers, about 123 companies and 33 bureaux de change linked with terrorism.\nAlso, from its analysis of tax evasion and tax avoidance linked to corruption, NFIU has identified N3,909,707,678,112.43 in VAT and N3,737,918,335,785.82 in Withholding Tax due to the Government.\n“On terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries.\nConfirming the report a few days later, Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), said the Nigerian government embarked on “a wider and far-reaching investigations” into terrorism financing after the conviction of Boko Haram financiers in the United Arab Emirates."
  },
  {
    "headline": "Australians Stealing Body Parts From Cemeteries For ‘Satanic Ritual’ – Police",
    "summarized_story": "It added that the second incident was said to have taken place between 6:00pm on January 31, and 10:00am on February 1.\nVictoria Police said in a statement that officers found the plaque and plasterboard inside a mausoleum had been removed and partial human remains had also been stolen.\nPolice believe that unknown offenders broke into a mausoleum before stealing partial human remains where two human heads were stolen.\n“It is interesting some of the symbols that have been left around these mausoleums appear to be satanic in nature.\nI have seen that in the UK, but I have never seen any satanic cult activity in Australia.”"
  },
  {
    "headline": "FULL LIST: Kano, Sokoto excluded as APC inaugurates state chairpersons",
    "summarized_story": "The national caretaker committee of the All Progressives Congress (APC), on Thursday, inaugurated party chairpersons for 34 states and the federal capital territory (FCT).\nMai Mala Buni, chairman of the caretaker/extraordinary convention planning committee (CECPC) — represented by John Akpanudoedehe, secretary of the committee — inaugurated the state chairpersons, excluding those of Kano and Sokoto.\nAdvertisementThe party didn’t state exact reasons for excluding Sokoto and Kano.\nHowever, while there is an ongoing court case involving the APC in Kano, party crisis in Sokoto had resulted in parallel congresses.\nSee the full list of the APC state chairpersons who were inaugurated below:Advertisement"
  },
  {
    "headline": "FULL LIST: Kano, Sokoto excluded as APC inaugurates state chairpersons",
    "summarized_story": "The national caretaker committee of the All Progressives Congress (APC), on Thursday, inaugurated party chairpersons for 34 states and the federal capital territory (FCT).\nMai Mala Buni, chairman of the caretaker/extraordinary convention planning committee (CECPC) — represented by John Akpanudoedehe, secretary of the committee — inaugurated the state chairpersons, excluding those of Kano and Sokoto.\nAdvertisementThe party didn’t state exact reasons for excluding Sokoto and Kano.\nHowever, while there is an ongoing court case involving the APC in Kano, party crisis in Sokoto had resulted in parallel congresses.\nSee the full list of the APC state chairpersons who were inaugurated below:Advertisement"
  },
  {
    "headline": "'I'm the Nigerian for all Nigerians' -- Saraki indicates interest in contesting presidency",
    "summarized_story": "Bukola Saraki, former senate president, says if he is allowed to lead, Nigerians will “have a greater sense of what it means to be truly Nigerian”.\nWhy should we allow past issues to drag us back and define us?\nWhy do we focus on the old issues that do not define our future?\nWhy do we focus on the old issues that do not define our future?\nAdvertisement — Dr. Abubakar Bukola Saraki (@bukolasaraki) February 3, 2022Advertisement"
  },
  {
    "headline": "'I'm the Nigerian for all Nigerians' -- Saraki indicates interest in contesting presidency",
    "summarized_story": "Bukola Saraki, former senate president, says if he is allowed to lead, Nigerians will “have a greater sense of what it means to be truly Nigerian”.\nWhy should we allow past issues to drag us back and define us?\nWhy do we focus on the old issues that do not define our future?\nWhy do we focus on the old issues that do not define our future?\nAdvertisement — Dr. Abubakar Bukola Saraki (@bukolasaraki) February 3, 2022Advertisement"
  },
  {
    "headline": "Okorocha: EFCC case against me politically-motivated -- I've asked Buhari to intervene",
    "summarized_story": "Rochas Okorocha, senator representing Imo west, says President Muhammadu Buhari has promised to look into the criminal charges preferred against him by the Economic and Financial Crimes Commission (EFCC).\nThe charge against Okorocha came hours after he formally declared his intention to run for president.\nAll I’m asking from the EFCC is to please obey the law,” he added.\nAdvertisement“And you cannot refuse to obey the law on one side, and then go for the law on the other side.\nWhat is more important is that the EFCC should obey a simple court judgment and court order, as the case may be.”"
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "Acuity founder, Lexi Novitske, discusses the $200m Norrsken22 Africa fund",
    "summarized_story": "Norrsken is now working with Hans Otterling, partner at Northzone, and an investment team led by Natalie Kolbe, ex global head of private equity at Actis in South Africa; Actis colleague Ngetha Waithaka in Kenya; and Lexi Novitske, founder of Acuity Venture Partners, on the new Norrsken22 Africa Tech Growth Fund.\nGet the best African tech newsletters in your inboxMichael: What inspired the move to back growth-stage startups in Africa?\nNovitske: Through my firm Acuity (and its predecessor Singularity Investments) we were active investors in early-stage companies across Africa.\nWhat we saw was that, as our companies scaled across the continent there was not sufficient local capital to back these growth-stage rounds.\nLocal investors have insights from doing businesses on the continent or networks that no international investor can have, even if they have the deepest pockets."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Merging crypto with logistics: How GIGL is preparing for the future of payments",
    "summarized_story": "GIGL has integrated a crypto wallet into its proprietary delivery app, GIGGO.\nThe first beta phase will see the crypto wallet opened to 2,000 users, with up to 10,000 users having access in the second phase.\nXPAD users can import their XPAD wallet into the GIGGO crypto wallet.\nAdvertisementSince the creation of Bitcoin, the crypto space has been associated with scams, making crypto users wary of the crypto platforms they use.\nThe wallet, which currently supports only Bitcoin, USDT and CFX might also be GIGL’s way of preparing its users for crypto payments."
  },
  {
    "headline": "An untapped investment style and insurance penetration in Nigeria",
    "summarized_story": "AdvertisementBut Untapped Global knows startups with promising futures might not always have impressive balance sheets or assets.\nUntapped Global could, for example, loan out a bicycle to Chimgozirim (who I doubt knows how to ride a bicycle) to deliver puff puffs.\nWell, Chimgozirim had a chat with Jim Chu, Founder of Untapped Global, and he revealed the details of the VC’s unconventional investment style.\nThere’s an opportunity here: With very few people insured in the country, there is an untapped insurance market to take advantage of.\nCasava has raised $4 million in pre-seed funding to take advantage of Nigeria’s untapped insurance market."
  },
  {
    "headline": "How Untapped Global backs growth stage African startups by using smart asset financing",
    "summarized_story": "That realisation led him to start Untapped Global in 2020.\nUntapped Global was founded to fill this gap.\nUntapped Global invests in these companies and, in return, receives a percentage of the business’ revenue.\nWhile Untapped Global has been funding startups for barely two years, Chu lists FlexClub, Paga, and Asaak as some of their biggest successes.\nMost investors in Africa invest in various industries, but Chu says Untapped Global is focused on mobility, water infrastructure, and energy."
  },
  {
    "headline": "Nigeria’s young drive gaming market revolution",
    "summarized_story": "As Africa’s gaming industry sees continuous growth, Nigeria happens to be one of the leading nations in terms of gaming activities, revenues, and the number of people playing games.\nThe trends seen in Nigeria’s gaming industry are another reason for traction.\nAs everyone is conscious of their data, no one wants to play a game that will burn all their data,” Vrakas said.\nThere has been a forecast of how the gaming industry will yield more revenue as the year unfolds.\nAccording to public sources, gaming content providers like Gameloft, Intralot, and Sirplay have partnered local gaming companies to participate in the growing success of the gaming industry by providing technology services and support."
  },
  {
    "headline": "Retail rebounds after 7-year decline",
    "summarized_story": "After recording seven straight years of decline, Nigeria’s total retail sales improved marginally by 3 percent to $108 billion in 2021, according to a new report.\nThe index ranks 35 emerging countries based on a set of 26 factors, including four key variables: country risk, market attractiveness, market saturation, and sales growth.\nUzo also adds that since the pandemic, new forms of retail have developed such as retail on demand and On-the-Go type, which has now become more accessible to people.\nBefore the two recessions experienced in the last five years, Nigeria’s retail sector was once a formidable consumer market due to a fast-growing middle class, rising consumer income and urbanisation, which made it an attractive retail investment destination for local and foreign investors.\n“Consumer demand is the fulcrum of retail performance and this had impacted adversely on their performance,” Damilola Adewale, a Lagos-based economic analyst, says."
  },
  {
    "headline": "Nigeria’s broadband vision needs $3bn fibre investment to take off",
    "summarized_story": "Nigeria would need three times more fiber infrastructure than it currently has to reach the Nation Broadband Plan (NBP) target set by 2025.\nTo meet the target, the country needs roughly between 120,000 to 167,000 km of fiber infrastructure, in addition to the 55,000 km set at the cost of $3.4 billion.\nUrgent deployment of fibre infrastructure is critical to the success of upcoming national events like the 2023 elections and the successful commercialisation of 5G technology.\nAbout 23 percent of Nigerians use broadband services and 36 percent of the population has internet access, according to reports.\nExcessive rights of way (ROW) fees, as well as federal and state levies from a variety of government agencies and departments, have artificially raised the price of this much-needed deployment."
  },
  {
    "headline": "Digital Broadcasting: Ministry of Communication and Orientation to Partner Edo State University, Uzairue – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUZAIRUE- – Edo State Ministry of Communication and Orientation will partner with Edo State University Uzairue in raising a new set of professionals that will drive the progress that Nigeria needs in the Broadcasting industry, just as the Ministry work towards having a new digital broadcasting sector.\nAndrew Adaze Emwanta during a facility tour of the Edo state University Uzairue, Etsako West Local Government area of Edo State.\nHe disclosed that the Ministry of Communication and Orientation is working towards having a new digital broadcasting sector to be controlled by the state.\nAccording to him, “Broadcasting has gone beyond analogue and the Ministry is working towards having a new digital broadcasting sector that we as a state can control.\n“The Nigeria University Commission, NUC ranking has placed Edo University 10th best in Nigeria, 2nd best in the state and the best in the South South region."
  },
  {
    "headline": "Edo Cricket Teams Win PWC National U-17 South-South Qualifiers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State male and female U-17 cricket teams, emerged champions respectively, at the PWC national cricket under 17 South-South zonal qualifiers, which took place in Benin City.\nIn the male category of the qualifiers, that took place at the Edo boys high school Cricket pitch, in Benin City, the Edo State defeated Akwa Ibom by 10 wickets.\nIn the first innings, the Edo State team had chased down their 51 runs target in the 15th over having run the Akwa Ibom team out for 50.\nEarlier in the qualifiers, the Edo State team defeated Delta state by 2 wickets in the preliminary round (Super Knockout) that took place yesterday.\nAt the Iyoba girls college where the female qualifiers took place, the Edo State team led by Coach Guobadia Esewi Peter also became champions."
  },
  {
    "headline": "NBBF: Kida vows to build solid,sustainable Domestic leagues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After a successful elective Congress of the Nigeria Basketball Federation (NBBF) in Benin City, the leadership of the NBBF board led by Engr Musa Kida has expressed its determination to build a domestic league structure that will reflect the immense potentials that abound in Nigeria.\nThe reelected NBBF President Musa Kida gave the assurance while entertaining questions from Journalists in Benin.\nEngr Musa Kida who was unanimously returned as the NBBF’s president said the symbolic election heralds a new dawn with the domestic league at the front burner of the board’s plan.\n“We are hoping that all these stakeholders will come on board so that together we have a verile and enviable domestic league”.\nNigeria basketball election into its federation was conducted in the most democratic way with 27 states out of the 36 and the Federal Capital Territory present”."
  },
  {
    "headline": "Voters Registration: INEC meets stakeholders in Oredo LGA tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Independent Electoral Commission (INEC) in Oredo Local Government Area of Edo State, will tomorrow, Thursday, February 3, 2022, meet with stakeholders in the local council, as part of ongoing drive for the Continuous Voters Registration (CVR) exercise across the country.\nIn a statement by the Electoral Officer, Oredo LGA, Ikpe Emmanuel Benson, and signed by the Assistant Electoral Officer, Admin, Mrs. Osakue N.S, the electoral body said the stakeholders’ meeting will take place at INEC Office, along Ekenwan Road, by 11. am.\nShe noted, “As you are aware, the Independent National Electoral Commission is undergoing the Continuous Voters Registration exercise nationwide, in preparation for the 2023 General Elections and Issuing of Permanent Voters Card (PVC).\n“As a result, the electoral body will meet with the major stakeholders in the LGA at the INEC Office, Ekenwan Road by Asoro Slope, Benin City on 3rd February 2022 by 11 am.”..."
  },
  {
    "headline": "TotalEnergies Expresses Commitment To Waste Management In Nigeria",
    "summarized_story": "TotalEnergies has declared that it established a pilot plastic recycling plant in Port Harcourt, to actualise its vision of facilitating waste management in Nigeria through economic empowerment.\nSangster said: “In establishing this plant, our vision is to facilitate waste management in Nigeria through economic empowerment, which is in line with our core values as a Company.\nADVERTISEMENT“Feedstock will be supplied by a network of collectors, waste generated by corporate organisations like TotalEnergies, and from dealers.\nThe final resin pellets produced from various non-toxic waste sources will be sold to plastic converters in Nigeria.\nAlso speaking, Minister of State for Environment, Lady Sharon Ikeazor, represented by Mr. Olubunmi Olusanya, challenged the private sector to actively participate in plastic waste collection, transportation and recycling."
  },
  {
    "headline": "Hijab Crisis: Kwara Shuts Govt-owned Baptist High School",
    "summarized_story": "Following outbreak of violence at Oyun Baptist High School, Ijagbo in Oyun local government area of Kwara State over wearing of hijab by Muslim schoolgirls on Thursday, the state government has shut down the school.\nThe statement reads: “The Kwara State Government totally condemns the resort to violence in the government-owned Oyun Baptist Secondary School, Ijagbo, on Thursday.\nADVERTISEMENT“The Kwara State Government unreservedly condemns the flagrant act of discrimination against anyone, especially children, on religious grounds.\n“While the government and the security agencies continue to work with leaders on all sides, it hereby directs the immediate shutdown of the school pending resolution of the issue.\n“The government commends the security agencies for their prompt action that has restored calm in the area."
  },
  {
    "headline": "Hijab Crisis: Kwara Shuts Govt-owned Baptist High School",
    "summarized_story": "Following outbreak of violence at Oyun Baptist High School, Ijagbo in Oyun local government area of Kwara State over wearing of hijab by Muslim schoolgirls on Thursday, the state government has shut down the school.\nThe statement reads: “The Kwara State Government totally condemns the resort to violence in the government-owned Oyun Baptist Secondary School, Ijagbo, on Thursday.\nADVERTISEMENT“The Kwara State Government unreservedly condemns the flagrant act of discrimination against anyone, especially children, on religious grounds.\n“While the government and the security agencies continue to work with leaders on all sides, it hereby directs the immediate shutdown of the school pending resolution of the issue.\n“The government commends the security agencies for their prompt action that has restored calm in the area."
  },
  {
    "headline": "Nigeria Lost $3.5bn Revenue To Crude Oil Theft In 2021 – CISLAC",
    "summarized_story": "The Civil Society Legislative Advocacy Centre (CISLAC), has revealed that Nigeria lost at least $3.5billion revenue to crude oil theft in the year 2021.\nIn 2021, Nigeria lost at least $3.5 billion revenue to crude oil theft, a figure that represents 10 per cent of Nigeria’s foreign reserves.\nADVERTISEMENT“Oil theft and pipeline vandalism threaten oil exploration and accruable revenue.\nIn 2019, the Nigerian National Petroleum Corporation (NNPC) announced that it lost ₦159 billion to oil theft and pipeline vandalisation.”The CISLAC executive director expressed worry over the involvement of military and other security forces in oil theft, describing the development as a ‘problem’.\nHe added: “Military and other security agencies involvement in oil theft remains a problem, with armed forces either turning a blind eye or actively profiting from the illegal oil trade throughout the process."
  },
  {
    "headline": "Nigeria Lost $3.5bn Revenue To Crude Oil Theft In 2021 – CISLAC",
    "summarized_story": "The Civil Society Legislative Advocacy Centre (CISLAC), has revealed that Nigeria lost at least $3.5billion revenue to crude oil theft in the year 2021.\nIn 2021, Nigeria lost at least $3.5 billion revenue to crude oil theft, a figure that represents 10 per cent of Nigeria’s foreign reserves.\nADVERTISEMENT“Oil theft and pipeline vandalism threaten oil exploration and accruable revenue.\nIn 2019, the Nigerian National Petroleum Corporation (NNPC) announced that it lost ₦159 billion to oil theft and pipeline vandalisation.”The CISLAC executive director expressed worry over the involvement of military and other security forces in oil theft, describing the development as a ‘problem’.\nHe added: “Military and other security agencies involvement in oil theft remains a problem, with armed forces either turning a blind eye or actively profiting from the illegal oil trade throughout the process."
  },
  {
    "headline": "FG says 123 companies, 33 BDCs linked to terrorism financing",
    "summarized_story": "The Federal Government has uncovered 123 companies, and 96 others linked to terrorism financing, the Minister of Information and Culture, Lai Mohammed, has said.\nHe stated this on Thursday at a press conference, saying that the suspected companies and individuals were uncovered by the Nigerian Financial Intelligence Unit.\nAlso, from its analysis of tax evasion and tax avoidance linked to corruption, NFIU has identified N3,909,707,678,112.43 in VAT and N3,737,918,335,785.82 in Withholding Tax due to the Government.\n“NFIU has also sent 1,165 intelligence reports on cases of corruption, money laundering and other serious offences to 27 domestic agencies for investigation, prosecution and asset recovery.\nOn terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries."
  },
  {
    "headline": "FG says 123 companies, 33 BDCs linked to terrorism financing",
    "summarized_story": "The Federal Government has uncovered 123 companies, and 96 others linked to terrorism financing, the Minister of Information and Culture, Lai Mohammed, has said.\nHe stated this on Thursday at a press conference, saying that the suspected companies and individuals were uncovered by the Nigerian Financial Intelligence Unit.\nAlso, from its analysis of tax evasion and tax avoidance linked to corruption, NFIU has identified N3,909,707,678,112.43 in VAT and N3,737,918,335,785.82 in Withholding Tax due to the Government.\n“NFIU has also sent 1,165 intelligence reports on cases of corruption, money laundering and other serious offences to 27 domestic agencies for investigation, prosecution and asset recovery.\nOn terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries."
  },
  {
    "headline": "ISIS leader Al-Qurashi killed during US raid in Syria -Biden",
    "summarized_story": "US President Joe Biden described the death of the Islamic State leader Abu Ibrahim al-Hashimi al-Qurashi, who blew himself up during a US raid in Syria, an “act of desperate cowardice.”“As our troops approached to capture the terrorist, in a final act of desperate cowardice, with no regard to the lives of his own family or others in the building, he chose to blow himself up… rather than face justice for the crimes he has committed,” Biden said in remarks from the White House.\nBiden also said the death of the Islamic State leader in a US raid in Syria “removed a major terrorist threat.”“The United States military forces successfully removed a major terrorist threat to the world, the global leader of ISIS,” Abu Ibrahim al-Hashimi al-Qurashi, Biden said at a press conference on the overnight raid.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "ISIS leader Al-Qurashi killed during US raid in Syria -Biden",
    "summarized_story": "US President Joe Biden described the death of the Islamic State leader Abu Ibrahim al-Hashimi al-Qurashi, who blew himself up during a US raid in Syria, an “act of desperate cowardice.”“As our troops approached to capture the terrorist, in a final act of desperate cowardice, with no regard to the lives of his own family or others in the building, he chose to blow himself up… rather than face justice for the crimes he has committed,” Biden said in remarks from the White House.\nBiden also said the death of the Islamic State leader in a US raid in Syria “removed a major terrorist threat.”“The United States military forces successfully removed a major terrorist threat to the world, the global leader of ISIS,” Abu Ibrahim al-Hashimi al-Qurashi, Biden said at a press conference on the overnight raid.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Release Sunday Igboho Or We’ll Deploy ‘Juju’ To Free Him — Group",
    "summarized_story": "Agbekoya farmers society of Nigeria has disclosed that it will deploy traditional means to free detained Yoruba nation agitator, Sunday Adeyemo alias Sunday Igboho, if the government of Benin Republic continues to hold him illegally.\nSpeaking during a peaceful rally on “State of the Nation” in Osogbo, Osun State capital on Thursday, the association’s President, Chief Kamorudeen Okikiola said Igboho is not criminal, but a freedom fighter and he is been held illegally through the influence of Nigerian Government on Benin Republic.\n“Sunday Igboho is not a criminal and we know he is being held illegally, Benin Republic Government has stopped taking him to court, hence, we demand that he should be released through legal means, if they refuse, we will use our magical power to get him out of the prison.\nI repeat, we Agbekoya, will get him out of Benin Republic detention and bring him back home”, he said."
  },
  {
    "headline": "BREAKING: Ladoja, Other Kingmakers Nominate Lekan Balogun As New Olubadan",
    "summarized_story": "Former Governor Rashidi Ladoja of Oyo State and other Ibadan kingmakers have officially nominated the Otun Olubadan, Senator Lekan Balogun, as the new Olubadan of Ibadan to Oyo State Government.\nThe kingmakers were said to have held a meeting in Ibadan on Thursday where they nominated Lekan Balogun to succeed Oba Saliu Adetunji, who died on January 2 at the age of 93.\nLadoja, who is the Osi-Olubadan, confirmed the nomination of Lekan Balogun as the new Olubadan to Punch correspondent.\nHe said, ” We, the kingmakers, held a meeting in Ibadan and nominated the Otun Olubadan to be the new Olubadan.”The development came following the dismissal of the suit instituted by Lekan Balogun and other High Chiefs against the consent judgment.\nBut the judge said on Tuesday that the Olubadan Chieftaincy Declaration of 1957 remained unchanged with the dismissal of the suit."
  },
  {
    "headline": "BREAKING: Hoodlums Attack Aregbesola’s Campaign Office In Osogbo",
    "summarized_story": "Hoodlums suspected to be political thugs, on Thursday evening, attacked Oranmiyan House, the Minister of Interior, Rauf Aregbesola’s campaign office located in Osogbo, Osun State capital.\nThe thugs, according to eyewitnesses, about five in number with guns, were allegedly shooting directly into the four-storey building.\nThe incident, according to eyewitnesses, happened around 5:20 pm on Thursday.\nOne of the local security operatives at the campaign house told DAILY POST that the hoodlums came with a Sienna vehicle shot rapidly and also attempted to set the building on fire.\nDetails shortly…"
  },
  {
    "headline": "Despite Denials, Bank Documents Link Osinbajo’s SimmonsCooper To Tinubu’s Money Laundering Venture",
    "summarized_story": "Peoples Gazette has discovered connections between Vice President Yemi Osinbajo’s law firm SimmonsCooper Partners and Bola Tinubu’s money-laundering front, Ocean Trust Limited, according to bank data obtained by the publication.\nDapo Apara, the former managing director of Alpha Beta Consulting, accused Mr Tinubu, the ruling party’s leader and a presidential candidate in 2023, of corruption and money laundering in 2018.\nBetween 1999 through 2007, Mr. Tinubu was governor of Lagos, while Mr. Osinbajo served as the state’s attorney general.\nAbout a week earlier, Mr Osinbajo also informed the president of his intention to take the top job.\nHis loyalty was rewarded in 2015 when Mr Tinubu nominated him as running mate to Mr Buhari."
  },
  {
    "headline": "Breaking: At last, CAF approves Moshood Abiola stadium Abuja for Super Eagles vs Ghana’s black stars World Cup playoff",
    "summarized_story": "The Confederation of Africa Football (CAF) has finally approved Abuja’s Moshood Abiola National stadium for return leg World Cup qualifier playoff between Super Eagles and Black Stars of Ghana in March.\nToyin Ibitoye, Special Assistant to the Minister of Youth and Sports development Sunday Dare revealed this to newsmen in Abuja on Thursday.\nIbitoye also said both Super Falcons Africa Women Cup of Nations qualifier and Falconets World Cup qualifier would be played on same pitch which was recently renovated under the Public-Private partnership initiative.\nThe pitch of Abuja National stadium has been without action until Minister Dare approached the private sector under the Adopt-A-Pitch initiative.\nThe rehabilitation project funded by Africa’s richest man Alhaji Aliko Dangote include regrassing of the pitch and installation of state-of-the-art digital scoreboard."
  },
  {
    "headline": "Breaking: Serving Senator dumps PDP, joins APC",
    "summarized_story": "A serving Senator representing Taraba South, and Senate Deputy Minority Leader, Senator Emmanuel Bwacha, has decamped to the All Progressives Congress (APC).\nBwacha who was with the Peoples Democratic Party (PDP) was received into the ruling APC by President Muhammadu Buhari and the interim party chairman Mai Buni inside Presidential Villa on Thursday.\nBwacha been in the Red chamber since 2011.\nDetails loading…"
  },
  {
    "headline": "Breaking: 19 passengers dead as vehicles crash in Yobe",
    "summarized_story": "Up to 19 persons mostly women have lost their lives in a road accident alone Potiskum-Damaturu highway.\nThe accident occured in a Fune in Fune local government area, 50 kilometres to Damaturu,Yobe state capital.\nDetails loading…"
  },
  {
    "headline": "FG Uncovers 96 Financiers Of Boko Haram, ISWAP",
    "summarized_story": "The Federal Government says it has uncovered 96 financiers of terrorism across the country, especially those backing Boko Haram and the Islamic State of West Africa Province (ISWAP).\nStill, on terrorism financing, Lai Mohammed said the NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping, and others with 19 countries.\nIt is common knowledge that one of the most difficult tasks for any government is to fight corruption, because when you fight corruption, corruption will fight you back!\nAlso, from its analysis of tax evasion and tax avoidance linked to corruption, NFIU has identified N3,909,707,678,112.43 in VAT and N3,737,918,335,785.82 in WithholdingTax due to the Government.\nOn terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries."
  },
  {
    "headline": "Alleged N2.9bn Fraud: Call EFCC To Order, Okorocha Urges Buhari",
    "summarized_story": "The former Governor of Imo State, Rochas Okorocha has asked President Muhammadu Buhari to call the EFCC to order, appealing that the president intervenes by stopping the EFCC from constantly harassing and intimidating him over allegations of a N2.9 billion fraud case.\nIn a chat with State House correspondents after a visit to the president, Senator Okorocha explained that there has been a court judgment and two court orders for different judgments issued at different forums, stopping the EFCC from further interrogating him.\nOkorocha described the EFCC’s actions as biased, pre-judgmental, and politically motivated.\nThe former governor called on the president as one who upholds the law to speak out on the matter.\nGovernor Okorocha equally underscored the need to strengthen the ruling party from the grassroots."
  },
  {
    "headline": "Oil Vessel With 10 Persons On Board Explodes Off Delta State",
    "summarized_story": "An oil vessel belonging to Shebah Exploration & Production Company Ltd (SEPCOL) has exploded in Delta State.\nThe cause of the explosion is being investigated and SEPCOL said they are working with necessary parties to contain the situation.\nThe facility has a processing capacity of 22,000 barrels per day and a storage capacity of two million barrels.\nAlthough Nigeria is Africa’s largest crude producer, production costs there are high due to frequent accidents and insecurity.\nMilitants have frequently attacked oil installations in the past and pirates are active across the wider Gulf of Guinea region."
  },
  {
    "headline": "UPDATED: Reps Fail To Sit As Speaker Angrily Adjourns Plenary",
    "summarized_story": "﻿ ﻿Lawmakers at the House of Representatives failed to sit on Thursday after Speaker of the House, Femi Gbajabiamila, angrily adjourned plenary till next week.\nThe Speaker who arrived at the Chamber around 11.20 a.m., furiously adjourned plenary over the absence of order paper.\nHe was also unhappy with the Clerk of the House for not being in his seat when he arrived.\nEverybody should see me in my office, House adjourned till Tuesday,” Gbajabiamila said angrily as adjourned plenary till next week.\nThe speaker arrived at the chamber at about 11.20 am, which for many is slightly early than the usual commencement time for plenary, even though plenary is scheduled to commence at 11:00 a.m."
  },
  {
    "headline": "Egypt Beat Cameroon On Penalties To Reach AFCON Final",
    "summarized_story": "Egypt beat Cameroon 3-1 on penalties to reach the Africa Cup of Nations final on Thursday after their last-four tie in Yaounde finished goalless at the end of extra time.\nEgypt goalkeeper Mohamed Abou Gabal saved two spot-kicks in the shoot-out before Cameroon’s Clinton Njie missed, sending the record seven-time African champions through to Sunday’s final against Senegal."
  },
  {
    "headline": "APC CECPC approves schedule of activities for 2022 National Convention -",
    "summarized_story": "The All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has adopted the timetable/schedule of activities for the 26th February, 2022 APC National Convention.\nThe adoption was taken at its 19th regular meeting on Wednesday 19th January, 2022 at the Party’s National Secretariat (Buhari House)AdvertisementThe approved schedule of activities is as follow***Receiving of the Interim Report of the National Reconciliation Committee – 31/01/2022Advertisement***Consideration and adoption of Reports of State Congresses – 02/02/2022***Inauguration of the State Executives – 03/02/2022Advertisement***Sales of Forms to all aspirants vying for National Offices (APC National Secretariat) – 14/02/2022***Submission of completed forms and accompanying documents (APC National Secretariat) – On or before 19/02/2022Advertisement***Publication of Sub-Committees – 19/02/2022***Screening of all aspirants vying for National Offices – 20th – 22nd of February.\n2022Advertisement***Screening Appeals to hear and resolve complaints arising from the screening exercise – 23/02/2022***Accreditation of all statutory and elected delegates to the National Convention – 24th – 25th of February 2022Advertisement***National Convention to elect National Officers to the National Executive Committee (NEC) – 26/02/2022***National Convention Appeal to hear and resolve complaints arising from the National Convention – 28/02/2022Advertisement"
  },
  {
    "headline": "Party supporters troop to APC secretariat as State chairmen inaugurated -",
    "summarized_story": "Party supporters on Thursday trooped to the All Progressives Congress secretariat for the inauguration of the states chairmen.\nThe supporters of the various state’s chairmen across the state made it difficult for members of Caretaker/Extra-ordinary Convention Planning Committee(CECPC) of the All Progressives Congress(APC) as well as the elected chairmen get access to the secretariat.\nAdvertisementHowever, the intervention of security returned normalcy shortly after.\nThe committee members are currently having a close door meeting before commencement of the inauguration"
  },
  {
    "headline": "Ondo by-election: Olumuyiwa Adu emerges as PDP candidate",
    "summarized_story": "Olumuyiwa Adu has emerged as the People’s Democratic Party candidate for the Akure South/North Federal Constituency by-election.\nMr. Adu scored 98 votes to beat its closest rival Kemisola Adesanya who scored 70 votesAdvertisementA total of 233 delegates participated in the primary election."
  },
  {
    "headline": "Gbajabiamila angrily adjourns plenary over absence of Order Paper",
    "summarized_story": "Plenary activities at the House of Representatives were stalled on Thursday following absence of Order Paper.\nThe Speaker who came in at about 11.20 am with some principal officers, became angry when the Clerk, his Deputy and other key officers in the chamber were not on their seats.\nAdvertisementHe directed the immediate transfer of the Clerk to the Rules and Business Committee over non availability of order paper and votes of proceedings.\nA visibly angry Speaker Femi Gbajabiamila directed the immediate transfer of the officer in charge before adjourning the sitting to Tuesday."
  },
  {
    "headline": "AFCON: Salah’s Egypt Defeat Hosts Cameroon on Penalties, to Play Mane’s Senegal in Final",
    "summarized_story": "Egypt beat Cameroon 3-1 on penalties to reach the Africa Cup of Nations final, ending the hosts’ hopes of glory on home soil.\nThursday’s second semi-final finished goalless after 120 minutes but it was Egypt who prevailed in the shootout, just as they had in the last-16 against Ivory Coast, and they will now face Senegal at the Olembe Stadium on Sunday.\nThe match was the first to be held at the Olembe Stadium since last week’s crush which killed at least eight people, CAF having received assurances over increased security and additional safety precautions.\nCameroon dominated much of the first-half and went closest to an opener when Michael Ngadeu-Ngadjui headed Moumi Ngamaleu’s corner against the crossbar.\nThe victory keeps Egypt on course for a record-extending eighth AFCON title, while pre-tournament favourites Senegal are seeking a first title."
  },
  {
    "headline": "Tunji Funsho: We Paused Polio Vaccination Because of Covid19",
    "summarized_story": "Dr. Tunji Funsho, Chairman, Nigeria Polio Plus Committee, Rotary International, in an interview with ARISE Newsday says Nigeria is facing an outbreak of polio cases especially in the north as a result of the mutation of the virus.\naccording to Dr. Funsho, Covid19 has been a big challenge and has halted the administration of the vaccine resulting in the relapse of the virus."
  },
  {
    "headline": "Nigeria Needs a President of Igbo Extraction in 2023 Says Okwesilieze Nwodo",
    "summarized_story": "Unmoved by the loud agitation for power shift to the south in the 2023 Presidential election, the main opposition party, Peoples Democratic Party says it will open up the contest for its presidential ticket to the six geo-political zones in the country.\nThis has caused agitation from the Igbo extraction of the nation who feel it would be unjust not to zone power to the east.\nTo continue the debate on this hot button issue and the position taken by the PDP, is Dr Okwesilieze Nwodo, former Governor of Enugu State and National Chairman of the Peoples Democratic Party in 2010."
  },
  {
    "headline": "Nigeria: 22,000 Barrels Per Day Floating Oil Platform Explodes in Niger Delta",
    "summarized_story": "A Floating Production, Storage and Offloading (FPSO) vessel with a capacity to process up to 22,000 barrels of oil per day, inject up to 40,000 barrels of water per day and store 2 million barrels of oil, has exploded and sunk at the Ukpokiti Terminal, around Excravos, Delta State, in Nigeria’s South-South.\nChecks showed that the huge facility, TRINITY SPIRIT, was built in 1976 (46 years ago), with a carrying capacity of 274774 Dead Weight Tonnage (DWT) and overall length of 337.05 meters as well as a width of 54.5 meters.\nThe asset is owned by Shebah Exploration and Production Company Limited (SEPCOL) which in 2004 acquired all of 40 per cent of ConocoPhillips equity interest in OML 108.\nThe FPSO serves as the primary production facility of for OML 108 and is also a government approved terminal for lifting operations for all OML 108 production.\nIn the release titled: “Fire Incident On The Trinity Spirit FPSO,” the company announced that the incident happened in the early hours of Wednesday."
  },
  {
    "headline": "US Forces Launch Counterterrorism Raid in Syria, Civilians Reported Dead",
    "summarized_story": "U.S. special forces carried out what the Pentagon said was a successful, large-scale counterterrorism raid in northwestern Syria early Thursday.\nFirst responders at the scene reported 13 people had been killed, including six children and four women.\nThey spoke on condition of anonymity for fear of reprisals, and said the raid involved helicopters, explosions and machine-gun fire.\nThe Pentagon provided no details on who was the target of the raid, or if any combatants or civilians on the ground were killed or injured.\nA U.S. airstrike killed al-Qaida’s second in command, former bin Laden aide Abu al-Kheir al-Masri, in Syria earlier this year."
  }
]