[
  {
    "headline": "I’m ‘somehow’ related to Tinubu, says female presidential candidate, Khadija Okunnu-Lamidi",
    "summarized_story": "This is as she revealed that she’s “somehow related” to Tinubu who recently declared his ambition to run for the presidency in 2023.\nSpeaking to BBC Pidgin, Okunnu-Lamidi said, “He’s the national leader of the APC; he has contributed to national politics and I have great respect for him.\nBut that doesn’t change the fact that Nigerians are looking for a young person with vibrancy.\nI’ve learnt the work and seen how others do it, which I don’t find satisfying, it gives me stomach ache.\nOn if women will vote for her, she said, “I’ve never seen a woman who doesn’t want to support another woman."
  },
  {
    "headline": "COVID-19: FCTA bars unvaccinated civil servants, visitors from offices",
    "summarized_story": "The Federal Capital Territory Administration, on Monday, began enforcement of no vaccination no entry into the Area 11 Garki Secretariat.\nHe said there was no going back on enforcement of the directive, adding that pictures of vaccination cards on phones and photocopies would not be accepted.\nAttah said that an enforcement team had been deployed at the premises of the FCTA, secretariats and departments to monitor compliance.\nOthers are FCT Water Board, Secondary Education Board, FCT Primary Health Care Board, Public Health Department, Rural Water Supply and Sanitation Agency and FCT Area Council Staff Pension Board.\nSani explained that the warning is contained in a circular signed by the FCTA Permanent Secretary, Olusade Adesola."
  },
  {
    "headline": "Nnamdi Kanu, Igboho: Deploy political solution, Nzuko Umunna urges Buhari",
    "summarized_story": "By Clifford NdujiheTO douse the building tension in the polity especially in the South-East, the Igbo Think-Tank group, Nzuko Umunna, has once again called on President Muhammadu Buhari to release Mazi Nnamdi Kanu and seek political solution to every other issue preceding or arising from his abduction.\nKanu had challenged what he called a violation of his human rights and the 2017 alleged military invasion of his Afaraukwu, Umuahi, family home.\nIPOB had, in a statement, insisted there would not be sit-at-home in South-East on that day but urged all members to storm the court.\nThe statement, which was signed by Ngozi Odumuko, the executive secretary of Nzuko Umunna, in seeking immediate and political resolution, cited the earlier requests made by Igbo Traditional Rulers, Representatives of Igbo Archbishops, Bishops and other Igbo leaders in that regard.\nThe group said that “political solution will lead to permanent peace and sense of nationhood, as the country will only experience true progress in an atmosphere of peace and tranquility.”Vanguard News Nigeria"
  },
  {
    "headline": "Plateau university begs ASUU, SSANU to suspend strike action",
    "summarized_story": "By Marie-Therese NanlongThe Management of the Plateau State University, PLASU, Bokkos has commended the local chapter of the Non-Academic Staff Union of Nigeria Universities, NASU and National Association of Academic Technologists of Nigeria, NAAT for suspending the strike action it earlier embarked on.\nThis is even as the Management appeals to the institution’s chapter of the Academic Staff Union of Universities, ASUU and the Senior Staff Association of Nigerian Universities, SSANU to suspend their ongoing strike action so that academic activities can resume in the institution.\nNASU and NAAT suspended their strike because it was gathered that the state government has intervened to defray the arrears of Earned Allowances owed Unions in the University.\nHis words, “The Management of Plateau State University, Bokkos has commended the Non-Academic Staff Union of Nigeria Universities and National Association of Academic Technologists of Nigeria, Plateau State University Chapter for suspending the option of strike in appreciation of the state government’s intervention towards defraying the arrears of Earned Allowances owed Unions in the University.\n“This will be in line with the University’s strategic vision and the Federal and Plateau State Governments fulcrum on Agriculture development to stimulate food supply, community service and research.”"
  },
  {
    "headline": "Ezeagu Leaders of Thought, Monarchs laud Ugwuanyi’s commitment to equitable zoning",
    "summarized_story": "Ugwuanyi at the Government House, Enugu, yesterday, for the amicable resolution of the issues surrounding the zoning of the Ezeagu LGA Chairmanship position under the arrangement of the Peoples Democratic Party (PDP) in Enugu State.\nHe therefore advised the people of Ezeagu LGA to officially document their zoning arrangement for posterity.\nThe Deputy Governor of Enugu State, an indigene of Ezeagu LGA, Hon.\nFestus Uzor; the State Commissioner for Budget, Dr. David Ugwunta; the former Chairman of Ezeagu LGA and Senior Special Assistant (SSA) to the Governor, Hon.\nChukwudi Fred Ezinwa; the Chairman, Enugu State Council of Traditional Rulers, HRH Igwe Amb."
  },
  {
    "headline": "Bad economy forced us out of towns, cities, Anambra residents complain",
    "summarized_story": "Two years later, the rent was increased to N200000 and to N250000 after another two years.\nIn 2017, the landlord said he would renovate the house and after the exercise, he increased the rent to N400000 per annum.\nIt was then I discovered that the average house rent in Awka had become N450000 and I had to make a decision.\n” My wife who teaches in a private school does not earn much and our combined salaries are not enough to pay rent, eat and pay school fees for our three children”.\nAnother resident of Awka, Mr. Modestus Obiorah said he had to become an artisan when urban authorities demolished his shop and he had no money to pay for a shop."
  },
  {
    "headline": "BREAKING: Again, gunmen abduct traditional ruler in Plateau",
    "summarized_story": "By Marie-Therese Nanlong, JosThe District Head of Vwang, Jos South local government area of Plateau State, Da Gyang Balak has been kidnapped.\nDa Balak is the second traditional ruler to be kidnapped in the State in less than a month.\nRecall that the Sum Pyem, HRH Charles Dakat was kidnapped during the Christmas period in 2021 but has since regained his freedom.\nHe was said to be returning to Vom where his palace is located before he was intercepted on the way.\nGod’s willing, the security agencies will soon close up on the criminals.”Details later…Vanguard News Nigeria"
  },
  {
    "headline": "Tension as kidnappers abduct more motorists on Lagos-Ibadan Expressway",
    "summarized_story": "Our correspondent gathered that there had been several cases of kidnapping of motorists along the Lagos-Ibadan Expressway.\nIt was gathered that the major area where the kidnappers had been abducting motorists plying the Lagos-Ibadan Expressway is a location after Abule Onigaari.\nDAILY POST learnt that the kidnappers on Saturday 8th January abducted five passengers, while another person, Ibrahim Tiamiyu, was shot in the thigh.\nDAILY POST gathered that the kidnappers made an attempt to kidnap more people on Sunday (yesterday) at the same location.\nThe program, which was aired in Yoruba language, was monitored by DAILY POST correspondent on Sunday."
  },
  {
    "headline": "How I aborted unlawful search of Justice Odili’s Abuja house – Police chief tells court",
    "summarized_story": "An Assistant Superintendent of Police, ASP, Madaki Chidawa, on Monday, in Abuja narrated to the Federal High Court how he aborted the unlawful search of the Abuja residence of the Supreme Court Justice, Mary Peter Odili on October 29 last year.\nHe gave evidence in the trial of 15 persons, including a housewife, accused of perpetrating the unlawful act at No, 7, Imo Rivers Street, Maitama official residence of the apex court Justice.\nHe told the court that he demanded for the search warrant and upon going through, he discovered the search warrant signed by a Chief Magistrate was addressed to No 9, Imo Crescent, Abuja.\nASP Chidawa explained that he used the wrong address on the search warrant to resist the execution of the warrant since the house of Justice Mary Peter Odili is No 7, Imo Rivers Street.\nThe witness further informed the court that he subsequently ran to Justice Mary Odili, who promptly made some phone calls that eventually nailed and aborted the unlawful mission of the defendants."
  },
  {
    "headline": "COVID-19: FCTA bars unvaccinated civil servants, visitors",
    "summarized_story": "The Federal Capital Territory Administration (FCTA), on Monday, began enforcement of ‘no vaccination, no entry’ into the Area 11 Garki Secretariat.\nA NAN correspondent, who monitored the enforcement exercise, observed that many staff and visitors were being turned back.\nHe said there was no going back on enforcement of the directive, adding that pictures of vaccination cards on phones and photocopies would not be accepted.\nAttah said that an enforcement team had been deployed at the premises of FCTA and secretariats and departments to monitor compliance.\nOthers are FCT Water Board, Secondary Education Board, FCT Primary Health Care Board, Public Health Department, Rural Water Supply and Sanitation Agency (RUWASA) and FCT Area Council Staff Pension Board."
  },
  {
    "headline": "Nnamdi Kanu’s trial: Umahi warns Ebonyi residents against obeying IPOB sit-at-home order",
    "summarized_story": "The Ebonyi State Government has warned residents of the state against obeying the sit-at-home order by the Indigenous People of Biafra (IPOB), ahead of its leader, Nnamdi Kanu’s court outing.\nNwachukwu Eze, the state’s Commissioner for Markets and Parks, warned that residents who obey the sit-at-home would be severely punished.\nRecall that IPOB’s spokesperson, Emma Powerful, had announced the sit-at-home for Tuesday in protest of Kanu’s continued trial.\n“The state is not in any way part of the sit-at-home order by IPOB.\nPlease note that strict compliance to this directive is very important as failure to do so will attract severe punishment.”"
  },
  {
    "headline": "FG applauds NCC’s commitment to enhancing digital skill in youths as Danbatta vows to deepen access",
    "summarized_story": "The Federal Government has applauded the commitment and dedication of the Nigerian Communications Commission (NCC) towards enhancing digital skills development among youths through implementation of various Information and Communication Technology skill acquisition programmes.\nPantami stated that the Federal Government is focused on promoting the digital economy across the country and that this had informed the renaming of the Ministry of Communications to the Ministry of Communications and Digital Economy.\nVery central among the policies is the National Digital Economy Policy and Strategy (NDEPS) 2020-2030, a 10-year, eight-pillar focused blueprint for actualising the Federal Government’s digital economy agenda unveiled in November, 2019.\nPantami asserted that the DNC inaugurated at Ilesa was a concrete implementation of the Digital Literacy and Skills, the second pillar of NDEPS.\nAccording to Pantami, the overarching objective of the DNC project is to facilitate adoption of digital lifestyle in the schools as well as in the school communities."
  },
  {
    "headline": "Masked gunmen attack Enugu community for ‘disobeying’ sit-at-home",
    "summarized_story": "There was pandemonium on Monday morning in Obollo-Afor town in Udenu Local Government Area of Enugu State when hooded gunmen, enforcing the suspended IPOB sit-at-home order, attacked residents of the community for disobeying the order.\nThe incident, which happened around 8am, saw the masked gunmen flogging traders and destroying their ware.\nThe hoodlums, who came into the commercial town on motorcycles, were seen beating traders who opened shops for business.\nA Sienna vehicle belonging to the Udenu Central Neighbourhood Watch was also destroyed in the attack.\n- Advertisement -Villagers told The Nation that members of the Udenu Central Neighbourhood Watch took to their heels on sighting the gunmen before their vehicle was destroyed."
  },
  {
    "headline": "Govt cuts gas price to GenCos",
    "summarized_story": "The Federal Government is set to reduce electricity tariffs this year while improving the power supply.\nTo achieve this, the government said it has cut down the price at which gas – a major component of power generation – is being sold to Generating Companies (GenCos).\nThe member said the government has reduced the cost of gas sold to GenCos to $2.18.\n“Government has also implemented reductions in gas price and optimisation to keep tariffs low despite forex and inflationary pressures.\n“The $2.18 cent reduction in the price of gas was already effected as it was announced."
  },
  {
    "headline": "UPDATED: FCTA locks out unvaccinated workers, visitors",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) on Monday morning barred unvaccinated workers and visitors from its premises.\nMany of the workers and visitors were stranded at the gate grumbling and begging to gain access from as early as 8am.\nThis warning was contained in a circular signed by the FCTA Permanent Secretary Olusade Adesola on Monday January 10, 2022.\n“We are also elated because we are seeing a large number of people taking their jab, some are taking their second jab and some are taking a booster jab.\nOn Monday morning, security operatives were positioned at all FCTA and SDAs premises, checking vaccination cards and carrying out enforcement."
  },
  {
    "headline": "BREAKING: Gunmen abduct another Plateau monarch",
    "summarized_story": "Suspected gunmen have kidnapped HRH.\nDa Gyang Balak Gut, the Da Gwom Rwei of Vwang District of Jos-South Local Government Area of Plateau State.\nThe Nation reports the incident is less than one month after the abduction of HRH Charles Dakat, who is the Paramount Ruler of Gindiri, in Mangu Local Government Area in Plateau State.\nSpokesman for the Plateau State Police Command ASP Gabriel Ubah Confirmed the incident.\n- Advertisement -Vwang District is where the famous National Veterinary Research Institute (NVRI), Vom is located in Plateau State."
  },
  {
    "headline": "BREAKING: FCTA locks out unvaccinated workers, others",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) on Monday morning barred all unvaccinated workers and visitors from its premises.\nMany of the workers and visitors were seen stranded at the gate grumbling and begging to gain access as early as 8am.\nRead Also: BioNTech and Pfizer to develop vaccine against shinglesThe administration issued a memo last week advising staff to go and take their COVID-19 vaccines to avoid the latest development.\nThe Senior Special Assistant on Monitoring, Inspection and Enforcement to the FCT Minister, Ikharo Attah, who heads the surveillance team, vowed the enforcement will be sustained to ensure maximum compliance.\n- Advertisement -Details Shortly…"
  },
  {
    "headline": "BREAKING: FIBA throws out Nigeria from BAL Final Round",
    "summarized_story": "By Joe ApuNigeria has been delisted from the Final Round of this year’s Basketball African League, BAL by FIBA Africa with immediate effect.\nThe basketball ruling body in a letter dated January 14, 2022, signed by the Secretary General, Alphonse Bile and addressed to the President of the Nigeria Basketball Federation, Engr.\nAhmadu Musa Kida stated that Nigeria’s Rivers Hoopers cannot participate in this year’s Final Round.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nReason for FIBA Africa’s sanction according to a document available to Daily SunSports is that Nigeria did not conclude its League."
  },
  {
    "headline": "BREAKING: Kidnappers abduct Plateau traditional ruler, Da. Gyang Balak, demand N10m ransom",
    "summarized_story": "From Gyang Bere, JosGunmen suspected to be kidnappers on Sunday night abducted Da.\nGyang Balak Gut, the Gwom Rwei Vwang in Jos South Local Government Area of Plateau State.\nThe source said the kidnappers have established contact with the family and demanding for a ransom of N10 million.\n“Troops of Operation SAFE HAVEN in conjunction with other security agencies are on the trail of the kidnappers.\nSince then, prominent personalities which includes Ex-Plateau Governorship Aspirant, Kemi Nshe, lecturer with Plateau State University Bokkos and students of Plateau State Polytechnic Barkin-Ladi have all been kidnapped within the duration of less than one month."
  },
  {
    "headline": "National Convention: February date sacrosanct–APC Governors",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) governors, under the aegis of Progressive Governors Forum (PGF), have declared, as sacrosanct, the February date for the conduct of the party’s National Convention.\nProgressive Governors Forum (PGF) Chairman, Abubakar Atiku Bagudu, dropped the hint after the Governors’ marathon meeting in Abuja on Sunday night, passing a vote of confidence in the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC).\nAsked if the initially proposed February date for the convention is still realistic, he replied: “Yes.\n“The President visited Ogun where he commended and inaugurated projects, he visited Borno State.\n“We are united behind Mr. President and we thank him and we are united and solidly behind the Caretaker Committee,” he noted."
  },
  {
    "headline": "Insecurity: Farms, streams no longer safe, laments ￼Archbishop Kaigama",
    "summarized_story": "From Fred Ezeh and Aidoghie Paulinus, Abuja AbujaArchbishop of Abuja Catholic Archdiocese, Ignatius Kaigama, has lamented that rising insecurity across Nigeria has made farms, streams and other places unsafe.\nHe said the situation has affected food productions, people’s sources of livelihood and could be responsible for high cost of food items.\nHe reminded governments of their constitutional responsibility and challenged them to rise to the occasion to salvage Nigeria from imminent problem.\nYet, the assurances of political leaders and security operatives always leave more to be desired.\nWe joined millions of Nigerians to appreciate the sacrifices of our fallen and living heroes."
  },
  {
    "headline": "NDLEA intercepts 1.5m tramadol tablets en route Kebbi, Kano at Lagos airport, seaport",
    "summarized_story": "The banned substances were loaded in Onitsha, Anambra State, heading to Yauri, Kebbi State.\nThis is even as a total of 425,000 Diazepam tablets were recovered at Segemu, Kano.\nThe drugs seized included: 394,480 capsules and 3,000 tablets of Tramadol weighing 83.707kg; Exol-5: 647,500 tablets weighing 203.315kg; Diazepam: 12,500 tablets weighing 2.05kg; Bromazepam: 1,500 tablets weighing 0.45kg; Codeine based syrup: 999 bottles weighing 134.865kg; Pentazocine injections: 4,000 ampoules weighing 16.64kg.\n“In Plateau state, a fake security agent, Babagana Maaji has been arrested through a controlled delivery of 5.6kg cannabis from Lagos.\n“While commending the officers and men of the various commands for their remarkable efforts, Chairman and Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Farmers Count Gains of Anchor Borrowers Scheme, to Unveil Mega Rice Pyramid",
    "summarized_story": "Obinna ChimaThe Anchor Borrowers’ Programme (ABP), an initiative of the Central Bank of Nigeria (CBN), has been described as a major agricultural breakthrough and a source of pride to the country, as rice farmers continue to count gains under the scheme.\nTo mark the successes recorded under the programme, particularly, in the area of rice cultivation, the Rice Farmers Association of Nigeria (RIFAN), in collaboration with the CBN, would tomorrow unveil the world’s largest rice pyramid in Abuja.\nRIFAN stated in a publication to announce tomorrow’s programme, “RIFAN will also use the occasion to flag off its 2021 – 2022 Dry Season Farming activities and celebrate the Annual Rice Festival.\nRIFAN has been the major driver of the rice value chain under the ABP for the past six years.\nIt is also a loan to farmers without collateral and the benefitting farmers are given farm input and cash to cultivate their farms, including the experiment on rice."
  },
  {
    "headline": "Abiodun Pledges Improved IGR in 2022",
    "summarized_story": "Ogun State Governor, Dapo Abiodun has said his administration would continue to work assiduously to improve the state’s internally generated revenue (IGR).\nAbiodun stressed that the incumbent government would continue to do all it can to increase the state IGR.\n“Last year, the National Bureau of Statistics came up with a report that showed Ogun State was the state with the highest improved Internally Generated Revenue.\nThis is unprecedented in the history of this state; our state had been number three last year.\nWe are very proud that this is happening right here in Ogun State."
  },
  {
    "headline": "N2.4bn Judgment Debt: Supreme Court Reverses Self, Restores GTBank’s Appeal against Innoson Motors",
    "summarized_story": "Alex Enumah in AbujaThe Supreme Court has set aside its earlier ruling which dismissed Guaranty Trust Bank’s (GTB) appeal against a N2.4 billion judgment in favour of Innoson Motors Nigeria Limited.\nThe apex court set aside its own decision on Friday, while delivering judgment in an application by GTB seeking the re-listing of the appeal on the grounds that it was wrongly dismissed.\nThe apex court in reversing itself relied on Order 8 Rules 16 of the Supreme Court’s rules that empowers it to set aside its decision in certain circumstances, like any other court.\n“It will be unjust to visit the sin of the court’s Registry on an innocent, vigilant, proactive and diligent litigant.\nThe application is therefore, meritorious and hereby succeeds,” the apex court held."
  },
  {
    "headline": "N’Delta Communities Drag National Assembly to Court over Ownership of Nigeria’s Crude Oil",
    "summarized_story": "The monarchs and civil society groups who alleged rights violations, urged the Federal High Court to direct and mandate the use of 1963 constitution in the adjudication and operations of crude oil in the oil rich Niger Delta area.\nThe suit which filed on January 10, 2022, by the Peoples Confederal Constituents Assembly Of Nigeria (PECCAN) before the Federal High Court, Abuja with Suit No.\nFHC/ABJ/CS/18/2022 and a motion restraining the defendants – President of the National Assembly, Clerk of the National Assembly and the Chairman Senate Committee on Constitution Amendment, from further engaging and using amendment of the 1999 constitution in the present democratic setting.\n“A declaration that the respondents continued use operation and further amendments of the military decreed transitional constitution of No.\n“A declaration that the respondents continued amendment of the military decreed transitional constitution of Decree No."
  },
  {
    "headline": "Still Evasive About Date, APC Govs Maintain Party’s Convention will Hold February",
    "summarized_story": "The governors, who met last night in Abuja after weeks of immense pressure mounted on the Caretaker/Extraordinary Convention Planning Committee (CECPC) of APC to fix a specific date for the party’s national convention, held their meeting behind closed-doors and wrapped it up early this morning.\nDirector General of the Progressives Governors Forum (PGF), Dr. Salihu Lukman, had equally called on members of the committee to honourably resign their positions if the February date for the national convention failed.\nHowever, addressing journalists after their meeting, which lasted for more than two and a half hours, Chairman of the Forum and Governor of Kebbi State, Atiku Bagudu, refused to give a specific date for the convention.\nBut he insisted that the February date was still feasible, adding that the caretaker committee as the organ of the party was in the best position to announce the specific date for the national convention.\nWe are united behind Mr. President and we thank him and we are united behind the caretaker committee."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Establish Two Markets In Controlled Territories In Borno",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) has established two open markets in Borno State.\nSaharaReporters gathered that the markets are established in Daban Gajere, located very close to Bulwa Bakin Dam and Tamfalla in the Marte Local Government Area.\nSaharaReporters also reported how ISWAP established two Wilaya’s (Caliphates) at Lake Chad and Sambisa forest to sustain its war against countries in Sub-Saharan Africa.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Establish Two Markets In Controlled Territories In Borno",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) has established two open markets in Borno State.\nSaharaReporters gathered that the markets are established in Daban Gajere, located very close to Bulwa Bakin Dam and Tamfalla in the Marte Local Government Area.\nSaharaReporters also reported how ISWAP established two Wilaya’s (Caliphates) at Lake Chad and Sambisa forest to sustain its war against countries in Sub-Saharan Africa.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "Mali's Former President, Ibrahim Boubacar Keita, Is Dead",
    "summarized_story": "Ex-Malian President, Ibrahim Boubacar Keita, has passed on at the age of 76.\nThe family on Sunday announced the death of the former leader, who led the West African country from 2013 until he was ousted in a coup in 2020, AFP reports.\nIbrahim Keita, Ex-Mali President“President IBK died this morning at 0900 GMT in his home” in Bamako, a family member was quoted as saying.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the West African bloc ECOWAS, the junta that emerged from the rebellion released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Mali's Former President, Ibrahim Boubacar Keita, Is Dead",
    "summarized_story": "Ex-Malian President, Ibrahim Boubacar Keita, has passed on at the age of 76.\nThe family on Sunday announced the death of the former leader, who led the West African country from 2013 until he was ousted in a coup in 2020, AFP reports.\nIbrahim Keita, Ex-Mali President“President IBK died this morning at 0900 GMT in his home” in Bamako, a family member was quoted as saying.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the West African bloc ECOWAS, the junta that emerged from the rebellion released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Reduce Governance Costs, Implement Petroleum Act – Youth Party Tells Buhari Government",
    "summarized_story": "The Youth Party has urged President Muhammadu Buhari’s government to speedily adopt and implement the \"Bold Revenue Plan\" in order to avoid further plunging the nation into debt and economic crisis.\nThe party's National Publicity Secretary, Ayodele Adio, disclosed this in a statement in its reaction to the 2022 Budget, obtained by SaharaReporters on Monday.\nIt rebuked the Nigerian government for lacking no strategic economic road map to help the country, while lamenting the mounting debts.\nIt stated that, \"Given Nigeria's current fiscal state, the Federal Government must speedily adopt and implement the Bold Revenue Plan in other to avoid debt and economic crisis.\n\"There is no evidence of a coherent strategy by the Federal Government to improve our revenue substantially and to manage our debts."
  },
  {
    "headline": "BREAKING: Nigeria's inflation rate rises to 15.63%",
    "summarized_story": "The consumer price index, which measures the rate of increase in the price of goods and services, increased to 15.63 percent in December 2021.\nThe rate is 0.23 percent points higher than the 15.40 percent recorded in November 2021.\nThis implies that prices showed an uptick in December 2021 — but dropped when compared to the corresponding period of 2020.\n“On month-on-month basis, the Headline index increased by 1.82 percent in December 2021 — this is 0.74 percent rate higher than the rate recorded in November 2021 (1.08) percent,” the report reads.\n“The percentage change in the average composite CPI for the twelve-month period ending December 2021 increased by 16.95 percent from 16.98 percent over the average of the CPI for the previous twelve-month period recorded in November 2021 down by 0.03 percent points.”AdvertisementMore to follow…"
  },
  {
    "headline": "BREAKING: Nigeria's inflation rate rises to 15.63%",
    "summarized_story": "The consumer price index, which measures the rate of increase in the price of goods and services, increased to 15.63 percent in December 2021.\nThe rate is 0.23 percent points higher than the 15.40 percent recorded in November 2021.\nThis implies that prices showed an uptick in December 2021 — but dropped when compared to the corresponding period of 2020.\n“On month-on-month basis, the Headline index increased by 1.82 percent in December 2021 — this is 0.74 percent rate higher than the rate recorded in November 2021 (1.08) percent,” the report reads.\n“The percentage change in the average composite CPI for the twelve-month period ending December 2021 increased by 16.95 percent from 16.98 percent over the average of the CPI for the previous twelve-month period recorded in November 2021 down by 0.03 percent points.”AdvertisementMore to follow…"
  },
  {
    "headline": "Banker 'commits suicide' hours after Facebook post on mind struggle",
    "summarized_story": "A Delta-based banker has been found dead — less than 24 hours after his disturbing Facebook post on his mental health struggle.\nHe said the case of the deceased, named Nworie Nnamdi Godson, is being investigated for any possible foul play.\nIt looks like a suicide case but we’re trying to see if there’s anything [more].\nWe can’t rule out the possibility of foul play.”A disturbing Facebook post about mental health was attributed to Godson on Saturday.\n“When he posted this there was no comment but, now that he committed suicide, everyone is here to shed crocodile tears,” one Facebook user wrote."
  },
  {
    "headline": "Banker 'commits suicide' hours after Facebook post on mind struggle",
    "summarized_story": "A Delta-based banker has been found dead — less than 24 hours after his disturbing Facebook post on his mental health struggle.\nHe said the case of the deceased, named Nworie Nnamdi Godson, is being investigated for any possible foul play.\nIt looks like a suicide case but we’re trying to see if there’s anything [more].\nWe can’t rule out the possibility of foul play.”A disturbing Facebook post about mental health was attributed to Godson on Saturday.\n“When he posted this there was no comment but, now that he committed suicide, everyone is here to shed crocodile tears,” one Facebook user wrote."
  },
  {
    "headline": "PDP: Imo has collapsed under Uzodimma -- residents in misery",
    "summarized_story": "The Imo state chapter of the Peoples Democratic Party (PDP) says the state has collapsed under the administration of Hope Uzodimma, the governor.\n“Our party and indeed the people of Imo State regret that Senator Uzodinma suspended and summarily dismantled all the foundations and programmes our Rebuild Imo administration painstakingly put in place in all the sectors towards the rebuilding of Imo State.\nIn the past two years, Senator Uzodinma has willfully denied workers and retirees their salaries and pensions.\n“This is obviously not the Imo State we envisioned for our children.\nAdvertisement“We wish to encourage the people of Imo State to keep the spirit alive."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "What YCombinator’s new $500,000 deal means for African startups",
    "summarized_story": "Considering that in its 17 years of existence, this is the fourth time the accelerator—which has funded 3,306 startups and 66 African startups—is changing its standard deal, it’s worth looking into what the change means.\nFor an investor, investing with a SAFE option means putting money into a startup without a set valuation.\nThis is beneficial to founders as they are not pressured early on to give their startups a valuation.\nIn the case of YC’s new deal, the accelerator is investing $375,000 at an agreement that it’ll own a future part of a startup.\nThis means Y Combinator still has the right to defend 4% of their stake in companies by investing at a follow-up round."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "How Wiicreate is helping African startups improve brand visibility with branded merchandise",
    "summarized_story": "However, Oreoluwa Shonibare, Co-founder and CEO of Wiicreate, saw an opportunity to help startups improve their offline marketing campaigns using branded merchandise.\nHe sold over 100 T-shirts and, in the process, learnt how merchandise could be used to communicate a brand’s value proposition.\nOver the next two years, they designed T-shirts for students and over 30 Nigerian startups, including fintech startups, Cowrywise and PiggyVest.\nA screenshot of the Wiicreate website“We basically help companies curate, ship, and brand merchandise ranging from T-shirts to water bottles, hoodies and thank you cards, just name it.\nWith Qwiik, users can print and have their A4 documents delivered to any part of the country."
  },
  {
    "headline": "The WiiCreate story, investing in Morocco",
    "summarized_story": "AdvertisementThe brainchild of Oreoluwa Shonibare and David Onwochie, WiiCreate was founded in 2017 after a tweet by the latter.\nOnwochie was looking for a co-founder with a graphic design background, and Shonibare fit the bill to a tee.\nAccording to Mezzour, it is the national brand to promote the Moroccan digital sector.\nIn 2021, Moroccan startups hit a record-high of $29 million in funding, perhaps an indication of the country’s burgeoning tech ecosystem.\nTL;DR: Morocco is looking for outside investments into its tech ecosystem."
  },
  {
    "headline": "Real estate as NFTs, social media in the metaverse: Projections for blockchain in Africa",
    "summarized_story": "However, Buchi Okoro, CEO of crypto exchange, Quidax, doesn’t think so.\nSocial media is going to the metaverseThe metaverse, NFT, and Web3 were some of the biggest buzzwords of 2021 in the crypto sphere.\nSource: TechnextHanu Fejiro Abodje, CEO of alternative payments solution company, Patricia, has indicated an interest in the Solana blockchain, which has been touted as the Ethereum killer.\nIt brings ease and simplicity to using crypto platforms, reducing the financial barrier of participating in activities such as NFTs and decentralised finance (DeFI).\nAfrican NFT project, Afrobubble, was created on the Solana blockchain because of the ease the chain brings to buying and selling NFTs."
  },
  {
    "headline": "Nigeria’s 3 presidents since 1999 have mixed legacies",
    "summarized_story": "After eight tumultuous years of social, political and economic experimentation on Nigeria and its citizens, General Ibrahim Babangida was forced to leave office.\nNigeria’s economy, argued Kayode Fayemi in 1999, did not escape Abacha’s grip.\nThe great debt reliefPerhaps, Nigeria’s most consequential president, Obasanjo, a former military Head of State, retired general and political prisoner under General Abacha assumed office on May 29, 1999.\nPeace in the deltaOn May 29, 2007, Umaru Musa Yar’Adua, then governor of Katsina State, succeeded Obasanjo as president.\nVictory in defeatGoodluck Jonathan had been personally handpicked by former President Obasanjo as vice-president to Yar’Adua."
  },
  {
    "headline": "Nigeria’s 3 presidents since 1999 have mixed legacies",
    "summarized_story": "After eight tumultuous years of social, political and economic experimentation on Nigeria and its citizens, General Ibrahim Babangida was forced to leave office.\nNigeria’s economy, argued Kayode Fayemi in 1999, did not escape Abacha’s grip.\nThe great debt reliefPerhaps, Nigeria’s most consequential president, Obasanjo, a former military Head of State, retired general and political prisoner under General Abacha assumed office on May 29, 1999.\nPeace in the deltaOn May 29, 2007, Umaru Musa Yar’Adua, then governor of Katsina State, succeeded Obasanjo as president.\nVictory in defeatGoodluck Jonathan had been personally handpicked by former President Obasanjo as vice-president to Yar’Adua."
  },
  {
    "headline": "The “BMC” phenomenon – Buhari’s worst legacy",
    "summarized_story": "The table in question was a corporate table given to a radio station that was a media partner to this event.\nThe Buhari New Media Centre, or Buhari Media Centre, according to these rumours, was an entity spun out of the Buhari Media Organisation, which primarily worked from locations in Lagos and Abuja, with strong funding and logistical support from people inside and close to the Buhari administration.\nWhy BMC is Buhari’s worst legacyGeneral Buhari has done some terrible things over the past 6 and a half years.\nThe reason why the BMC phenomenon is so much worse than all these is the sheer scale of it.\nMore importantly, what happens to the infrastructure built around the BMC phenomenon when General Buhari leaves power?"
  },
  {
    "headline": "How we’re impacting lives, rebuilding Edo communities with interventions to check erosion menace – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration will intensify work on intervention programmes to check the menace of gully erosion as part of effort to alleviate the sufferings of residents in erosion-prone communities in the state.\nAddressing journalists after inspecting gully erosion sites in Ogiso Quarters and Urora in Ikpoba-Okha Local Government Area of the state, Obaseki said, “We have started addressing the flood challenges in these areas because before now, this place would be devastated after a rainstorm.\n“For us, it is about rebuilding our communities and improving the lives of our citizens.\nBut let’s not forget that all these won’t have happened without the assistance of the World Bank under the Nigeria Erosion and Watershed Management Project (NEWMAP).\nAn 83-year-old resident in the area, Madam Clara Uhunwonse, praised the governor for the intervention project, which she said has made life better for them."
  },
  {
    "headline": "PDP GOVERNORS MEET IN PORT HARCOURT TO CONSOLIDATE ON RESCUE AND REBUILD NIGERIA PROJECT – Nigerian Observer",
    "summarized_story": "PDP GOVERNORS MEET IN PORT HARCOURT TO CONSOLIDATE ON RESCUE AND REBUILD NIGERIA PROJECTShare FacebookTwitterStumbleuponLinkedInPinterestPORT HARCOURT – The Peoples Democratic Party, PDP Governors Forum will hold a special meeting on Monday 17th January 2022 at the Rivers State Government House, Port Harcourt.\nThe director general, PDP Governors Forum, Hon.\nMaduabum, said the meeting will review the state of the States, the state of the nation and readiness of the PDP to provide the necessary leadership to rescue and rebuild Nigeria.\n“All the elected PDP Governors are expected to attend the meeting to be presided over by the Chairman of the Forum, Rt Hon Aminu Waziri Tambuwal, CFR.\n“The meeting will be preceded by a Gala night to be hosted by the Chief Host, His Excellency, Governor Nyesom Ezenwo Wike, CON."
  },
  {
    "headline": "Obaseki: Decentralised healthcare system ‘ll improve efficient, quality healthcare delivery to Edo people – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured Edo residents that the state government’s policy on decentralising healthcare system will enhance the efficiency, accessibility and quality of healthcare service delivery in the state.\nThe governor said this after inspecting ongoing construction work at the Stella Obasanjo Hospital in Benin City, Edo State capital.\n“It is only based on reference from these units that you now come to a specialist hospital.\n“The Stella Obasanjo Hospital was a mother and child hospital before the outbreak of the COVID-19, but has been expanded to provide other services.\nWe are not phasing out the specialist hospital but upgrading the hospital,” the commissioner said."
  },
  {
    "headline": "Governor Obaseki Receives Award of Honor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Centre for Edo Delta Development Initiative (CEDDI) has bestowed an award of honor on the Governor of Edo State, Mr. Godwin Obaseki in recognition of his humanitarian activities in the state.\nAndrew Emwanta received the award on behalf of the Governor at CEDDI’s 6th graduation, 7th matriculation ceremony and 10th anniversary which held in Benin City.\nEmwanta reinstated the commitment of the Obaseki’s administration to youth empowerment which he said was the reason the Governor has partnered with CEDDI.\n“This award is in recognition of what the People’s Governor, Mr. Godwin Obaseki is doing and is because he believes in initiatives like this that he’s supported the activities of CEDDI.\nEarlier, the founder of CEDDI, Chief Sam Igbe, the Iyase of Benin appreciated the Governor for supporting and partnering with centre."
  },
  {
    "headline": "Nigeria’s LNG export hit 17.9MMT in 2021, highest in Africa",
    "summarized_story": "Nigeria exported 17.9 million metric tons (MMT) of Liquefied Natural Gas (LNG) in 2021 to top African exporters chart.\nThe report tipped U.S. and China to represent the top export and import markets, respectively, for Liquefied Natural Gas (LNG) in 2022.\nFor the U.S., the position represents a shift upward from being the third-largest LNG exporter in 2021 at 73.6 million metric tons (MMt), following Australia (83 MMt) and Qatar (81.3 MMt).\nOn its part, China already represented the top importer of LNG in 2021, importing 81 MMt in 2021 and replacing Japan as the largest LNG importer globally.\nThe IHS report stressed that, “LNG Trade in 2021: Runaway Recovery,” over 65 MTPA of long-term contracts were signed in 2021, rebounding to an all-time high after pausing in 2020."
  },
  {
    "headline": "Nigeria’s debt stock hits N39.6tn in 11 months",
    "summarized_story": "The Nigeria’s total debt stock rose from N32.9tn as of December 2020 to N39.6tn in November 2021, Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, has disclosed.\nThe Debt Management Office (DMO) had In March 2021, disclosed that the country’s total public debt stock was N32.9tn as of December 2020.\nAn additional N6.7tn loan means the total public debt stock would be about N39.6tn as of November 2021.\nIn Q2 2021, the total debt stock rose by N2.4tn to N35.5tn by June 2021.\nThe World Bank had recently said Nigeria’s debt was vulnerable and costly, adding that the country’s debt was at risk of becoming unsustainable in the event of macro-fiscal shocks."
  },
  {
    "headline": "Buhari to unveil CBN, RIFAN mega rice pyramids in Abuja",
    "summarized_story": "President Muhammadu Buhari will on Tuesday, unveil the Central Bank of Nigeria (CBN) huge Rice Pyramids, a major outcome of the Anchor Borrowers Programme (ABP) in Abuja.\nAccording to The News Agency of Nigeria (NAN), the mega rice pyramids project is a collaboration of the CBN with Rice Farmers Association of Nigeria (RIFAN).\nIt stated that the ABP, since inauguration in November, 2015, had increased the average yield of rice per hectare from 1.8 metric tonnes to five metric tonnes, while discouraging importation of the commodity.\n“The ABP has enabled 95 per cent reduction of Nigeria’s annual rice import bill from 1.5 billion dollars in 2015 to 18.5 million dollars.\nIt added that similar rice and maize pyramids had been unveiled in states like Kebbi, Niger, Gombe, Ekiti, among others."
  },
  {
    "headline": "Lagos to close Dopemu Road in Agege for three months",
    "summarized_story": "The government of Lagos State has said it will divert traffic on Dopemu Road in Agege area of the state for a duration of three months.\nThe diversion which starts by 10pm on Friday, January 21, 2022, is for the rehabilitation and upgrade of Babajide Sanwo-Olu Road.\nAccording to the state Commissioner for Transportation, Dr Frederic Oladeinde, the repair works will be executed in three phasesHe added that the first phase of the project will focus on Ipaja Road to Adealu Street junction which will last for three months.\nThe Transport Commissioner advised motorists inbound Dopemu Bridge from Iyana Ipaja/Alagba axis to go through Ipaja Road to connect Oyewole Street into Seriki Street to link Kolawole and Adebambo Streets in order to access Adealu Road for their desired destination.\nIn the same vein, he implored motorists heading towards Dopemu Bridge from Ipaja (Oke-Koto) to utilise Markaz Road to connect Awori Street and link Sarumi Alawo Street/Oniwaya and Surulere to continue their journey or alternately go through Alfa Nla from Old Ipaja Road to connect Oniwaya/Surulere axis to reach Dopemu Bridge."
  },
  {
    "headline": "Buni Hails Buhari, Lawan For Improved Security In N’East, Synergy In Governance",
    "summarized_story": "The governor of Yobe State, Hon.\nBuni acknowledged that there is now a significant improvement in the security situation in the North-East particularly in Yobe State.\nThe Yobe governor also commended the Senate President, Ahmad Lawan.\nHe thanked President Buhari for providing the security personnel the required resources to secure lives and property in the country.\nLawan was once Danmasani Bade but having been elevated by the Bade Emirate Council in Yobe State as Sardaunan Bade, his first son, Ibrahim Ahmad Lawan now bears the title."
  },
  {
    "headline": "Akpabio Group Empowers 1,500 In Gombe",
    "summarized_story": "Senator Godswill Akpabio for Common Good (SGACG), a group calling on the Minister of Niger Delta Affairs, Senator Godswill Akpabio, to contest for the office of president of Nigeria in 2023, has empowered about 1,500 people in Gombe State.\nAccording to the group, the empowerment was part of its commitment to putting Nigerians first and garnering support for Senator Godswill Akpabio, and to persuade him to participate in the 2023 general elections.\nThe empowerment took place Saturday, January 15, 2022 at the second Senator Akpabio Youth Empowerment Programme (SAYEP) in Gombe.\nThe programme attracted youths and well-skilled individuals from North-East region who benefited from the gesture of the Minister’s supporters.\nTafida, who thanked Nigerians for their continued support for Akpabio, added: “the measure of what the group is doing is a small replica of the good intentions of the Minister for Nigerians."
  },
  {
    "headline": "Ousted Malian President, Keita, Dies At 76",
    "summarized_story": "Former president of Mali, Ibrahim Boubacar Keita, who was sacked by the military, is dead.\nKeita, who led Mali from 2013 until he was ousted in a coup in 2020, died yesterday at the age of 76 in Bamako, the nation’s capital.\nHis family said, “President IBK died this morning at 0900 GMT in his home” in Bamako.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the Economic Community of West African States (ECOWAS), the junta released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Ousted Malian President, Keita, Dies At 76",
    "summarized_story": "Former president of Mali, Ibrahim Boubacar Keita, who was sacked by the military, is dead.\nKeita, who led Mali from 2013 until he was ousted in a coup in 2020, died yesterday at the age of 76 in Bamako, the nation’s capital.\nHis family said, “President IBK died this morning at 0900 GMT in his home” in Bamako.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the Economic Community of West African States (ECOWAS), the junta released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Tension as gunmen kidnap two NCRIB staff, one other",
    "summarized_story": "Gunmen in the early hours of Sunday abducted two staff of the Nigerian Council of Registered Insurance Brokers (NCRIB), alongside another victim, in Isara axis of Lagos-Ibadan expressway end of Ogun State.\nThe Executive Secretary of Nigerian Council of Registered Insurance Brokers (NCRIB), Tope Adaramola, who confirmed the incident, said the victims were abducted while in the process of fixing the car.\nHe said a similar report was made by the management of the company to Ogun State Police Headquarters.\nAbimbola Oyeyemi, the police spokesperson in Ogun State, confirmed the incident when contacted.\nHe said the Special Anti-Kidnapping Unit of the State was already tracking the kidnappers and making efforts to rescue the victims unhurt."
  },
  {
    "headline": "Tension as gunmen kidnap two NCRIB staff, one other",
    "summarized_story": "Gunmen in the early hours of Sunday abducted two staff of the Nigerian Council of Registered Insurance Brokers (NCRIB), alongside another victim, in Isara axis of Lagos-Ibadan expressway end of Ogun State.\nThe Executive Secretary of Nigerian Council of Registered Insurance Brokers (NCRIB), Tope Adaramola, who confirmed the incident, said the victims were abducted while in the process of fixing the car.\nHe said a similar report was made by the management of the company to Ogun State Police Headquarters.\nAbimbola Oyeyemi, the police spokesperson in Ogun State, confirmed the incident when contacted.\nHe said the Special Anti-Kidnapping Unit of the State was already tracking the kidnappers and making efforts to rescue the victims unhurt."
  },
  {
    "headline": "Again, Naira declines amid devaluation concerns",
    "summarized_story": "The Naira depreciated at the official and parallel markets amid growing concerns that oil revenue fluctuation and global monetary tightening would lead to further devaluation of the currency.\nOfficial data and trading reports showed that the Naira depreciated by 0.12 per cent at the official Investors and Exporters (I & E) Window to close at N416.50 per dollar.\nIt also depreciated by 0.65 percent to close at N575.90 per dollar at the parallel market.\nThe Naira, however, closed flat at N430 per dollar at the Interbank Foreign Exchange market (IFEM).\nAnalysts said insecurity, high costs of doing business and multiple foreign exchange windows have done disservice to foreign investment into the country, thus its relatively low capital inflow from foreign investors."
  },
  {
    "headline": "Again, Naira declines amid devaluation concerns",
    "summarized_story": "The Naira depreciated at the official and parallel markets amid growing concerns that oil revenue fluctuation and global monetary tightening would lead to further devaluation of the currency.\nOfficial data and trading reports showed that the Naira depreciated by 0.12 per cent at the official Investors and Exporters (I & E) Window to close at N416.50 per dollar.\nIt also depreciated by 0.65 percent to close at N575.90 per dollar at the parallel market.\nThe Naira, however, closed flat at N430 per dollar at the Interbank Foreign Exchange market (IFEM).\nAnalysts said insecurity, high costs of doing business and multiple foreign exchange windows have done disservice to foreign investment into the country, thus its relatively low capital inflow from foreign investors."
  },
  {
    "headline": "JUST IN: Aregbesola Orders Officers To Shoot Dead Any Prison Attackers",
    "summarized_story": "JUST IN: Aregbesola Orders Officers To Shoot Dead Any Prison AttackersRauf Aregbesola, the Minister of the Interior, issued a directive on Monday ordering prison personnel to shoot anyone who attempts to attack any correctional facility in the country.\nHe said the officer must make it impossible for anyone to penetrate the facility because it is a red zone.\nAregbesola said any attack on any correctional centre is an attack on the state and such must never be allowed again.\nThe minister said any attempt to attack correctional centres should be a suicide attempt and perpetrators must not be allowed to live to tell the story.\nDon’t shoot to disable, shoot to kill."
  },
  {
    "headline": "Gunmen Kidnap Another Traditional Ruler In Plateau State",
    "summarized_story": "Da Gyang Balak Gut, the Da Gwom Rwei of Vwang District in Plateau State’s Jos-South Local Government Area, has been kidnapped by gunmen.\nThe monarch was reportedly kidnapped on Sunday night, just a few meters from the National Institute for Policy and Strategic Studies’ Kuru gate in Jos.\nThe tragedy occurs just a few weeks after another traditional ruler, Charles Mato, the Sum Pyem and paramount monarch of Gindri, was kidnapped in Plateau State’s Mangu Local Government Area.\nMore details later…"
  },
  {
    "headline": "BREAKING: Scores Reported Dead In Kebbi As Bandits Attack, Burn Corpses",
    "summarized_story": "Hundreds of people are said to have been slaughtered in a nighttime raid by bandits in Kebbi State, according to SaharaReporters.\nAccording to reports, bandits in huge numbers attacked Dan-Kade community in the Zuru chiefdom’s Unashi area on Sunday night, killing an unidentified number of people.\nBello Dankade, a resident of the hamlet, informed SaharaReporters that groups of bandits raided Dan-Kade in southern Kebbi State and slaughtered a large number of people.\nResidents of Dan-Kade village have left their homes after bandits allegedly set fire to a number of homes in the vicinity.\nAs of the time of reporting this story, the Kebbi State Police Command could not be reached for comment."
  },
  {
    "headline": "2023: Buhari Must Sign Electoral Bill Immediately — Jega",
    "summarized_story": "Professor Attahiru Jega, a former Chairman of the Independent National Electoral Commission (INEC), has encouraged President Muhammadu Buhari and the National Assembly to swiftly pass the Electoral Act Amendment Bill 2021.\nThe bill’s passage, according to Jega, would improve the integrity of Nigeria’s elections.\nThe former INEC Chairman urged the Buhari administration to do all possible to guarantee that Nigeria’s future elections be held under new legislation.\n“This country will be better off if we go into the next election with a new electoral law which will enhance the integrity of the preparations and conduct of the elections,” Jega said during a Townhall Meeting on the Electoral bill on Sunday.\nProfessor Jega explained that the bill contains a lot of fresh revisions while the discussion over direct and indirect primaries continues."
  },
  {
    "headline": "Buhari set to unveil CBN’s rice pyramids",
    "summarized_story": "President Muhammadu Buhari will Tuesday unveil the Central Bank of Nigeria (CBN)’s huge Rice Pyramids in Abuja.\nThe News Agency of Nigeria (NAN) reports that the mega rice pyramids project is a collaboration of the CBN with Rice Farmers Association of Nigeria (RIFAN).\nAccording to Hussein Ibrahim, the unveiling of rice pyramids across the country, which indicates improved capacity to cultivate rice, should also make it cheap and affordable to the common man.\nNAN) reports the Abuja mega rice pyramids are located at the Abuja Chamber of Commerce and Industry, Trade Fair Complex, Abuja.\nThe intervention of the Central Bank of Nigeria is gradually returning Nigeria to the era of the Rice Pyramid."
  },
  {
    "headline": "Nine days after Gazette on bandits: Buhari orders major military operations in Niger",
    "summarized_story": "President Muhammadu Buhari has ordered major military operations in Niger state to ward off ceaseless attacks by terrorists on its communities.\nThe order is coming barely nine days after the federal government formally gazetted bandits, kidnappers and related criminals as terrorists.\n(NAN)Commander arrestedIn a related development, a stalwart of the All Progressives Congress (APC) in Zamfara state, Dr. Sani Abdullahi Shinkafi, has said a notorious bandit identified as Katare was arrested Saturday.\n“The security challenges faced by Zamfara state is a collective concern of all-inclusive of Ulama, politicians including those in the PDP, APC, APGA regardless of what political ideologies we all belong in Zamfara state,” Shinkafi stated.\nHe thanked President Muhammadu Buhari for providing the security personnel the required resources to secure lives and property in the country."
  },
  {
    "headline": "[Breaking] AFCON 2021: Great upset as Equitorial Guinea end Algeria ‘s 35-match unbeaten run",
    "summarized_story": "Algeria’s 35-match unbeaten streak was ended in stunning fashion by Equatorial Guinea to leave the defending champions in real danger of crashing out in the group stage of the Africa Cup of Nations.\nEsteban Obono’s back post finish on 70 minutes proved the only goal of the game as the side ranked 114th in the world became the first side to beat Algeria since Benin did so back in October 2018, the run ending two short of Italy’s world record 37 games without loss.\nThe result leaves the holders rock bottom of Group E on just one point, having been held to a goalless draw by Sierra Leone in their opening fixture.\nThey must now beat Ivory Coast – who are top on four points – in their final game to keep alive their hopes of retaining the trophy they won in Egypt three years ago.\nAlgeria thought they had taken the lead midway through a scrappy first half when Baghdad Bounedjah tapped in the rebound after Riyad Mahrez’s header had been saved but the flag was raised against the Manchester City winger."
  },
  {
    "headline": "2023: I Am Not Threatened By Govs Defecting To APC, Power Belongs To God",
    "summarized_story": "The governor said this on Monday during an interview on Channels Television breakfast programme, Sunrise Daily.\nMy ambition is in the hand of God, power, and might belong to God.\n“The more we have governors in the APC, the more chance we have to win the election.\n“I went there to discuss solutions to our insecurity in the Southeast, and on our airport project.\nHis declaration came about 24 hours after former Governor of Lagos State, Bola Ahmed Tinubu, also indicated an interest in the race."
  },
  {
    "headline": "Another Traditional Ruler Kidnapped in Plateau",
    "summarized_story": "The District Head of Vwang in Jos South Local Government Area of Plateau State, Da Gyang Balak Gut, has been abducted by yet to be identified gunmen.\nVwang district in Jos South Local Government hosts the National Institute for Policy and Strategic Studies (NIPSS), the National Veterinary Research Institute (NVRI), as well as the College of Soil Science Technology among others.\nThe abduction of the Gwom Rwei is coming barely a month after the kidnapping of another traditional ruler in the state, Charles Mato Dakat.\nHowever, Dakat, who is the paramount ruler of Gindir in Mangu Local Government Area was released five days after his abduction.\nIt is, however, not clear if the transaction was made; it is also unclear what role the security operatives played in the release of the traditional ruler."
  },
  {
    "headline": "Electoral Bill: It’s Incorrect To Say NASS Did Shoddy Job – Senate Spokesman",
    "summarized_story": "﻿The Senate spokesman, Ajibola Basiru, has faulted claims that the National Assembly did a poor job with the Electoral Act Amendment BillHe made the comment during a town hall meeting organised by a civil society body, Yiaga Africa, on Sunday.\nPresident Muhammadu Buhari had declined assent to the bill citing the direct primaries clause which he said goes against the “spirit of democracy” while some civil society organisations had also faulted the bill.\nBut the Senate spokesman said claims of errors in the bill are incorrect.\n“I want to also say that it is not correct that the National Assembly has done shoddy work on the electoral bill and I take that with seriousness to say that out of 185 sections of the bill, we have a problem with one section.\nFor the main opposition Peoples Democratic Party (PDP), the President’s decline of assent is a setback to the country’s democracy."
  },
  {
    "headline": "Why Electoral Bill Should Be Passed Immediately – Jega",
    "summarized_story": "﻿Former Chairman of the Independent National Electoral Commission (INEC), Professor Attahiru Jega, has urged the National Assembly and President Muhammadu Buhari to immediately pass the Electoral Act Amendment Bill 2021.\nAccording to him, the passage of the bill will go a long way in improving the integrity of Nigeria’s elections.\nThe former INEC Chairman, therefore, asked the government to do everything possible to ensure that the country goes into the next election with a new bill.\n“A good legal framework helps to create elections with integrity and electoral integrity helps to enhance democratic consolidation and the preparation and conduct of elections democratically.\n“We already have some fundamental elements that can improve the integrity of the elections, let this be passed immediately, drop this issue of direct primaries, think more seriously about it."
  },
  {
    "headline": "Nigeria Confirms 48 New Lassa Fever Cases",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed 48 cases of Lassa fever in the country in 2022.\nAccording to the update, the new cases were confirmed in 10 states and 22 local government areas in Nigeria.\nREAD ALSO: NCDC Alerts States As Lassa Fever Death Toll Hits 102“In week 1, the number of new confirmed cases increased from 28 in week 52, 2021 to 48 cases.\nThe male to female ratio for confirmed cases is 1:0.9.\nThe number of suspected cases has increased compared to that reported for the same period in 2021."
  },
  {
    "headline": "Aggrieved PDP Governorship aspirants protest in Ado Ekiti -",
    "summarized_story": "PDP Governorship Aspirants,Biodun Olujimi and Segun Oni Leads Protest Against Former Governor Ayodele Fayose Accusing him of Hijacking the Ward Congress Held on Saturday 15th January 2022.\nSome Party Faithfuls Joined the Protest this morning calling for the indefinite Suspension of Fayose from the PDP.\nThe Party Leaders accused Fayose of Sabotaging the Efforts of the Party by collating Ward Excos at a Private Event Center Owned by Him while the real Congress was ongoing in the 177 Wards of the State.\nThey Therefore Urged the National Working Committee to disregard any Purported List sent by Ayodele Fayose to the Party Secretariat in Abuja as they declared that there is no Congress Held in the State."
  },
  {
    "headline": "Group commends Taraba for implementing people-oriented projects -",
    "summarized_story": "A Coalition of Hausa-Fulani socio-cultural groups in Taraba state has passed a vote of confidence in Governor Darius Ishaku’s government for implementing people-oriented projects."
  },
  {
    "headline": "APC Govs confirm February sacrosanct for national convention -",
    "summarized_story": "Governors of the ruling All Progressives Congress APC on Sunday night met in Abuja to chart a way forward for the conduct of the long-awaited national convention.\nAt the end of the meeting, the governors upheld the February date for the national convention and passed a vote of confidence in the Caretaker Extraordinary Convention Planning Committee"
  },
  {
    "headline": "PDP Govs strategise on how to knock out APC",
    "summarized_story": "In this video, Political Technocrat, Dr Dayo Kayode and Public Affairs Analyst Ambrose Igboke.\nreview the top headlines from the Nigerian Newspapers for the 17th of January 2022."
  },
  {
    "headline": "Omicron Went Through Lagos ‘Like a Wildfire’ During Christmas, Says Health Chief Abayomi",
    "summarized_story": "Lagos State Commisioner for Health Prof Akin Abayomi spoke exclusively to ARISE News on various subjects, especially on the Omicron Covid variant which he says is now dominant in Lagos.\nWatch this snippet…For full interview, see link:"
  },
  {
    "headline": "AFCON: Algeria’s 35-Match Undefeated Run Ends after Equatorial Guinea Loss",
    "summarized_story": "Equatorial Guinea have caused the greatest upset so far at this year’s Africa Cup of Nations (AFCON), defeating continental champions Algeria 1-0.\nThis was the second disappointment for the Algerian side in the tournament, held in Cameroon, having tied with Sierra Leone in their opening match last week.\nThe holders now need a win in their final group game against Ivory Coast on Thursday to have a chance of reaching the round of 16.\nSierra Leone has now drawn against two heavyweights in Algeria and Ivory Coast to be unbeaten on its first AFCON appearance in 26 years.\nThe Gambia is unbeaten in its first two games at a major tournament, having won against Mauritania in its opener."
  },
  {
    "headline": "Former Israel PM Netanyahu Negotiating Plea Bargain",
    "summarized_story": "Former Israeli Prime Minister Benjamin Netanyahu is negotiating a plea bargain to end his corruption trial, news agencies have reported.\nThe deal could be signed as early as this week, a person involved in the talks told The Associated Press news agency on Sunday.\nAny deal could spare Netanyahu an embarrassing and protracted trial over an issue that has gripped the nation.\nA source briefed on the matter told the Reuters news agency that talks have snagged over a condition that would remove Netanyahu from politics.\nThe idea of a plea bargain was promoted by a former Supreme Court president, Aharon Barak."
  },
  {
    "headline": "North Korea Fires Two Suspected Ballistic Missiles from Airport, Seoul Says",
    "summarized_story": "Nobuo Kishi, the Japanese defence minister, said the missiles appeared to have landed in the ocean near North Korea’s east coast.\n“It is self-evident that the aim of North Korea’s frequent missile launches is to improve their missile technology,” he told reporters.\n“The repeated launching of North Korea’s ballistic missiles is a grave problem for the international community, including Japan,” Kishi added.\nThe US is also urging the UN to take firmer action against North Korea over the latest tests.\nBut that has never really come through… North Korea has been dependent on food aid now at least since the 1990s, arguably going back further than that."
  },
  {
    "headline": "Overseas Tongans Wait Anxiously for News after Volcano Eruption",
    "summarized_story": "Overseas Tongans are waiting anxiously for news of loved ones after a powerful volcanic eruption and tsunami severed communications with the kingdom in the southwestern Pacific Ocean.\nConcerns among the 85,000-strong Tongan community in New Zealand were heightened on Monday by news it could be two weeks before communications are restored following the eruption of Hunga Tonga–Hunga Haʻapai on Saturday.\nBesides leaving people in the dark about the fate of their loved ones, the lack of internet threatens Tongans reliant on money transfers from relatives overseas.\n“I think the worst part is the blackout and the fact that we know nothing,” said Filipo Motulalo, a New Zealand-based journalist with Pacific Media Network.\nAnd our concern is for children who would obviously have had mental trauma because of this once-in-a-lifetime event.”"
  }
]