[
  {
    "headline": "How corporate tenants shun Lagos high-rise office spaces amid harsh economy",
    "summarized_story": "It is no longer business as usual for prime office space owners in the high-brow areas of Lagos.\nIn 2021, it was reported that the average cost of renting an office space in Lagos Island stood at N3.6m per annum.\nRentals for prime office space in Lagos (Ikoyi) had skyrocketed as at 2004 to $90 per sq.\nmeters) of prime office space in fewer than 10 high-rise office buildings in Victoria Island and Ikoyi existed in Lagos prior to 2010.\nThis, he said, had played a contributory role in shrinking demand for prime office spaces in the high-brow areas of Lagos State."
  },
  {
    "headline": "Hajj 2022: Kebbi to airlift 2,128 intending pilgrims to Saudi Arabia",
    "summarized_story": "By Haruna Aliyu,Birnin KebbiThe Kebbi state chairman of pilgrims welfare agency(PWA)Alhaji Haruna Abubakar Mai tandu has said that, the maiden flight from Kebbi state is expected to take off on June the 23rd 2022 and some 2,128 will be airlifted to Saudi Arabia for this year’s Hajj.\nAccording to him no pregnant women will be allowed to board the plane as all female pilgrims will be screened and tested on pregnancy therefore none will evade.\nHe explained that, part of the safety measures taken to protect pilgrims and officials of the agency include the presentation of yellow card by each pilgrim across the genders which is the evidence of covid19 vaccination otherwise no pilgrim will be allowed into the camp.\nHaruna stressed that a habitable accommodation has been secured for all the pilgrims including transport arrangements from Jeddah airport to Mecca city and other be places designated for Hajj rituals.\nHe urged them to be good ambassadors of Nigeria while in the holy Land “I enjoy you all to exhibit good morals,keep off crimes and other social vices."
  },
  {
    "headline": "Aregbesola reads the riot act to Immigration officers into passport racketeering",
    "summarized_story": "By Ozioruva AliuBENIN CITY – THE Minister of Interior, Ogbeni Rauf Aregbesola on Tuesday threatened to sanction without delay any Nigerian Immigration Service (NIS) personnel involved in passport racketeering.\nHe gave the warning in Benin City, Edo State when he launched the Enhanced e-Passport and the Commissioning of the Central Passport Production Centre which would serve Edo and Delta states.\nHe said: ““President Muhammadu Buhari’s charge is very explicit to make life easy on getting a passport.\nWe have 10, 000 passports on this platform so every Nigerians desirous should be able to get it.\n“For our men who are quick to tell people that there are no passports just to exploit them, those who give unkind and harsh treatment to passport seekers will be dealt with henceforth."
  },
  {
    "headline": "Suspected homosexual nabbed for allegedly molesting 19 minors in Abuja",
    "summarized_story": "The FCT Administration (FCTA), Social Development Secretariat (SDS), has nabbed a suspected homosexual, who allegedly molested no fewer than 19 minors, at Karmajiji village located at the Airport road, Abuja.\nThe Acting Director, Social Welfare Services of SDS, Alhaji Sani Amar, made the disclosure at a news conference on Tuesday in Abuja.\nHe emphasised that the social development secretariat was duty-bound to ensure that the rights of the less-privileged, vulnerable groups including children and women were protected.\n“This happened as a result of one of the affected children whom the man reportedly lured into his room with sweet and orange.\nHe said he was delighted that the officers of the FCT Police Command “are men of integrity and non compromising”."
  },
  {
    "headline": "48 million Nigerians still defecate openly- Report",
    "summarized_story": "No fewer than 48 million Nigerians still practice open defecation, according to the newly released 2021 Water, Sanitation and Hygiene National Outcome Routine Mapping (WASH-NORM) III Report.\nThis is the thrust at the inauguration of the 2021 WASH-NORM III Report in Abuja on Tuesday.\nQuoting the report, the minister said poorest households were 48 times more likely to practice open defecation than the richest households.\n“Evidently, 23 per cent of the population (48 million people) still defecate in the open.\n“Open defecation remains a challenge in the country with data from the WASHNORM 2021 survey showing that as many as 48 million Nigerians practise open defecation, representing 23 per cent of the population."
  },
  {
    "headline": "Banks, stockbroking firms are our partners in progress – DMO",
    "summarized_story": "The Debt Management Office (DMO) says Deposit Money Banks (DMBs) and Stockbroking firms are integral to delivering its national mandate of debt management.\nMr Monday Usiade, Director, Business Development Department of the DMO, said this in an interview with the News Agency of Nigeria (NAN) on Tuesday in Ibadan.\nHe spoke against the backdrop of the the Federal Government Securities Issuance Awareness programme being organised by the DMO and CSL Stockbrokers Limited in different parts of the country.\nUsiade said that the impression that the DMO and its partner stockbroking firms were in competition with the DMBs was not correct.\nUsiade said that the awareness programme was part of DMO’s market development initiative."
  },
  {
    "headline": "Petrol remains N165, Russia-Ukraine war increased diesel cost – Nigerian govt",
    "summarized_story": "The Federal Government of Nigeria has stated that the pump price of Premium Motor Spirit (PMS) remains N165 per litre.\nThe government also advised Nigerians against panic buying of petrol, assuring that over 2 billion litres were in various depots.\nOn Tuesday, the Nigerian Midstream and Downstream Petroleum Regulatory Authority, the Nigerian National Petroleum Company, and the Pipelines and Product Marketing Company visited jetties in Apapa, Lagos.\nThey explained that the move was necessitated by the increment in the ex-depot price of PMS by some private depots.\nThe pump price remains N165 and the authority is ever ready to enforce those rules”, NAN quoted him saying."
  },
  {
    "headline": "Buhari reveals plans to resolve collapse of national grid",
    "summarized_story": "President Muhammadu Buhari on Tuesday said his administration is decentralising the nation’s national grid through renewable mini-grids to address the challenges of electricity supply across the country.\nBuhari said this during an interview with Bloomberg News, adding that his Government had earmarked 550 million dollars to provide 20,000 Standalone Solar Systems (SHS), as well as Solar Hybrid mini-grids in over 250 locations in the country.\nDAILY POST recalls that power outages had become a frequent trend in Nigeria for the past few weeks, following the collapse of the national grid.\nSpeaking on plans to solve the collapse of the national grid, the President said: “We’re also decentralising the national grid through renewable driven mini-grids.\n“Once signed into law the constitutional amendment bill recently voted through parliament will allow state governments to generate and transmit their own electricity, further facilitating investor participation in our market and enabling states and local businesses to transmit excess supply to the grid,” Buhari said."
  },
  {
    "headline": "Gov Tambuwal reinstates Chief of Staff, nominates 9 commissioners",
    "summarized_story": "Sokoto State Governor, Aminu Tambuwal, has reinstated his former Chief of Staff, Alhaji Mukhtar Magori.\nTambuwal also nominated nine commissioners to the State House of Assembly for screening and confirmation.\nBello stated that six of the nominated commissioners were reappointed to fill the vacancies.\nThe reappointed commissioners had voluntarily withdrawn from the Senatorial race of the Peoples Democratic Party (PDP) in their various constituencies.\nBello said the re-appointed commissioners included Aminu Bodinga, retired Col. Garba Moyi, Bashir Gidado, Salihu Maidaji, Abdullahi Maigwandu and Abubakar Maikudi."
  },
  {
    "headline": "War: Sanctions against Russia are hurting us – Germany",
    "summarized_story": "German Chancellor Olaf Scholz has said that sanctions against Russia by western countries were hurting his country and other allies.\nHe, however, maintained that Europe and its allies would have to pay the price since freedom, democracy, solidarity with friends and partners have their prices.\n“Unprecedentedly tough sanctions” were imposed on Russia.\nYes, these sanctions are hurting ourselves as well.\nAnd we are prepared to pay this price,” Scholz said."
  },
  {
    "headline": "Gov AbdulRazaq forwards five new Commissioner-nominees to state assembly",
    "summarized_story": "Governor AbdulRahman AbdulRazaq of Kwara State, has forwarded the names of five new commissioner-nominees to the State House of Assembly for approval.\nThey are former House of Representatives aspirant Dr. Afeez Abolore Alabi (Ilorin East); Adenike Afolabi-Oshatimehin (Ifelodun; and Wahab Femi Agbaje (Offa).\nThe nominees’ names and profiles have been sent to the House of Assembly for legislative screening and approval, according to the Chief Press Secretary to the governor, Rafiu Ajakaye, in a statement in Ilorin on Tuesday.\nDAILY POST reports that some cabinet members of the state resigned their appointments to contest elective positions for the 2023 general elections in the state and national assemblies.\nAt least two of the five nominees either withdrew or failed in the primary elections for their chosen elective positions."
  },
  {
    "headline": "We'll fix Justices' complaints on work conditions",
    "summarized_story": "The Chief Justice of Nigeria (CJN) Justice Ibrahim Muhammad has confirmed that some of his brother Justices have expressed displeasure about their current conditions of service and were demanding improvement.\nThe statement reads: “Re: State of affairs in the Supreme Court and demand by Justices of the Supreme Court.\n“Besides, two Supreme Court Justices died, while four retired within the period under consideration.\nThere is none of the apex court Justices without SUV and back up cars.\n“Within the three years his brother Justices mentioned came the pandemic and the judiciary workers’ strike."
  },
  {
    "headline": "Remaining kidnapped railway passengers must be rescued alive, Buhari orders The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has again directed that the remaining kidnapped railway passengers must be brought home alive.\nThe President gave the directive in a statement by his media aide, Malam Garba Shehu, on Tuesday in Abuja.\nShehu said the president directed increased efforts – kinetic and non-kinetic to bring the case to a closure.\n“Upon the President’s approval, the Government is continuing on the two-lane approach, kinetic and non-kinetic to secure the passengers’ safe release.\nAccording to him, the government is also mindful of the efforts of some patriotic and influential persons and institutions that are helping in securing the safe release of the hostages."
  },
  {
    "headline": "Sadio Mane in Munich ahead €41 million move from Liverpool The Nation Newspaper",
    "summarized_story": "Senegalese forward Sadio Mane has been pictured in Germany as he prepares to take in medical examinations ahead of a proposed move to Bayern.\nThe 30-year-old informed Liverpool of his desire to leave after their Champions League final defeat against Real Madrid in May.\nMane is ready for a new challenge after six years at Anfield and hinted before the Champions League final that he would be making an announcement on his future.\nThe agreement between Liverpool and Bayern will bring an end to six successful years on Merseyside for Mane.\nThe forward won the Champions League, Premier League, FA Cup, Carabao Cup, UEFA Super Cup and Club World Cup in his time at the Reds."
  },
  {
    "headline": "15 things to know about Patrice Lumumba The Nation Newspaper",
    "summarized_story": "Sixty-one years after Belgian authorities have finally returned a tooth belonging to freedom fighter, Patrice Lumumba, who was murdered gruesomely by separatists and Belgian mercenaries in 1961, as an anti-colonial hero.\nBelow are 15 things to know about assassinated Congolese independence hero, Patrice Lumumba.\n· Patrice Lumumba was born on July 3, 1925 to Julienne Wamato Lomendja and her husband, François Tolenga Otetshima, a farmer, in Onalua, in the Katakokombe region of the Kasai province of the Belgian Congo.\n· He was handed over to Katangan authorities and executed in the presence of Katangan and Belgian officials and officers.\n· Belgium, on Monday, handed over the last remains of the slain Congolese leader Patrice Lumumba, a tooth, to his family, turning a page on a grim chapter in its colonial past."
  },
  {
    "headline": "Former NFF Scribe, two others freed in Bauchi The Nation Newspaper",
    "summarized_story": "Former NFF Scribe, two others freed in BauchiThe Bauchi Police Command has confirmed the release of former Secretary-General of the defunct Nigeria Football Association (NFA) now Nigeria Football Federation (NFF), Sani Ahmed Toro, who was abducted by gunmen last Tuesday in Nassarawa State.\nToro was released with his two other friends Sani Ahmed Toro and Garba Yila.\nBauchi police spokesman SP Ahmed Wakil, said they were released around 5 am on Tuesday and are in good health.\nBut he did not disclose whether ransom was paid to secure their release or not.\nThe Nation reports the trio was kidnapped at a village around Akwanga in Nasarawa State."
  },
  {
    "headline": "Presidential ambition: Buhari breaks silence on CBN gov, Emefiele",
    "summarized_story": "The suit was seeking to restrain the Independent National Electoral Commission (INEC) and the country’s attorney general from disqualifying him from pursuing his presidential ambition.\nIn an interview with Bloomberg, asked if he he was concerned about the debate around the central bank’s independence following Emefiele’s interest in running for president, Buhari replied: “The CBN governor is appointed by the president.\nWhat our western allies are learning the hard way is what looks good on paper and the human consequences are two different things.\nChristianity and Islam, our two great faiths and their great books have far more in common than they have apart.\nNigeria has a long tradition of tolerance that we must draw on, and we must strive to find common ground."
  },
  {
    "headline": "INEC shuns court order on voter registration",
    "summarized_story": "From Romanus Ugwu, AbujaIndependent National Electoral Commission (INEC) has said there was no going back on its June 30 deadline for registration of voters.\nThis is as it has tasked Nigerian youths to translate their social media revolution into active participation in politics, especially going out to vote during elections.\nINEC Resident Electoral commissioner (REC) for Abuja, Yahaya Bello, spoke during Continuous Voter Registration (CVR) campaign organised by INEC in conjunction with the European Union (EU) in Abuja, yesterday.\n“Ending the registration exercise on June 30 will help us commence the process of printing the PVCs which the owners will continue to collect till early next year,” he said.\nEU representative at the event, Omowuni Laolu, regretted that the high number of youths in the country does not translate to effective participation in elections."
  },
  {
    "headline": "Fuel Scarcity: Ex-depot price hits N161",
    "summarized_story": "By Adewale SanyaoluCurrent economic variables, including the Russian-Ukraine crisis and hyper inflation among other distortions have pushed the ex-depot price of Premium Motor Spirit to N161 per liter, Daily Sun findings have revealed.\nThis implies that when other ancillary costs like diesel cost and union dues are added to the ex-depot price of N161 per litre, the landing cost at the filling stations would be in the range of N180-N185 per litre.\nCuriously, the NNPC filling station on College Road in Ogba as at 4.10pm yesterday, sold a litre of petrol at N180 as against the official price of N165.\nCuriously, since the fuel scarcity started on Sunday, the Nigerian National Petroleum Company Limited(NNPC) which is the importer of last resort has kept mum on what has led to the disruption in supply.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Ekiti: Prosecute perpetrators of vote-buying, NPC tells security agencies",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe National Peace Committee (NPC) has asked security agencies to ensure perpetrators of vote-buying during last Saturday’s governorship election in Ekiti State are investigated, prosecuted and brought to justice.\nAbubakar said the practice of vote-buying undermined the values which underpinned the democratic life of the country.\n“The practice of vote-buying undermines the values which underpin our democratic life.\n“We want to particularly thank the people of Ekiti for the turnout recorded during the election, despite recent increasing levels of insecurity.\nThese include INEC and security agencies for facilitating an electoral process, where people were not disenfranchised because of their party affiliation, gender, religious or ethnic affiliations and/or disability."
  },
  {
    "headline": "NGE, NPAN, NUJ, Other stakeholders Insist On Self-Regulatory Framework",
    "summarized_story": "A media regulatory framework led and driven by media professionals represents the most effective guarantee of media freedom and the independence of the media, in line with with regional and international norms and standards.\nThe communique said: “The meeting agreed that consistent with regional and international norms and standards, a media regulatory framework led and driven by media professionals represents the most effective guarantee of media freedom and the independence of the media.\n“The stakeholders also resolved to effectively implement the existing Code of Ethics for Nigerian journalists while the process of updating same is on.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Insecurity: Buhari Says Trust Has Been Rebuilt with Traditional Western Allies",
    "summarized_story": "Today they are close to extinct as a military force.\nThe leader of ISWAP was eliminated by a Nigerian Airforce airstrike in March.\nThis must stop”, he said.”My administration is the only in Nigeria’s history to implement a solution to decades-long herder-farmer conflicts, exacerbated by desertification and demographic growth.\nThe National Livestock Transformation Plan, putting ranching at its core, is the only way to deplete the competition for resources at the core of the clashes.\n“Governors from some individual states have sought to play politics where ranches have been established; but where they have been disputes have dramatically reduced”, he said."
  },
  {
    "headline": "Buhari: My Govt Recovered N152bn Looted Funds in 2021",
    "summarized_story": "*Other recoveries include $386m, £1.1m, €157,000Kingsley Nwezeh in AbujaPresident Muhammadu Buhari has said that his administration’s anti-corruption drive led to the recovery of N152 billion between January and December, 2021.Other recoveries include $386 million, 1.1 million pounds and 1.7 million Saudi Riyals.\nIn an interview with Bloomberg, President Buhari said such recoveries was not possible with previous administration because there was palpable fear that the looted funds may be relooted.”Starting with our whistleblowing policy enacted in my first year in office, hundreds of millions in stolen funds have been returned.\nDollar recoveries for the year amount to over USD 386 million; GBP, more than 1.1 million; Euro, about 157,000; Saudi Riyals about 1.7 million, some more in digital and other currencies”, he said.”Those partners refused to return these monies held for decades to previous Nigerian administrations in the certainty they would simply be re-stolen.\nThey changed their approach with us because they knew my administration could be trusted”, he said.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: We’ll Use Kinetic, Non-Kinetic Means to Secure Release of 51 Kidnapped Train Passengers",
    "summarized_story": "Government is also mindful of efforts of some patriotic and influential persons and institutions that are helping in securing the safe release of the hostages.\n“President Buhari welcomes the return of the recently released passengers back to their families and loved ones, while expressing his solemn commitment to the families of those still in captivity, assuring that there will be no let-up until they are reunited with their families in the shortest time possible.\n“The President’s clear directive on the issue is that the hostages must be brought home alive.\nThe country’s military and security agencies are aware of their duty to the nation and are determined to give effect to the President’s charge with increased urgency”.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: House Steps down Motion to Override Buhari’s Veto on Statutory Delegates",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives has stepped down a motion seeking to override President Muhammadu Buhari for failing to assent to the Section 84(8) of the Electoral Act (Amendment) bill, 2022, which provides for Statutory Delegates.\nThe Speaker, Hon.\nHowever, after presenting the motion at the resumption of plenary Tuesday, the Deputy Speaker, Wase who presided over the session said a motion cannot be used to override a Bill.\n“You don’t come with a motion to override a bill.\nAsk the rules, for a bill seeking for that to happen and then we will go through the normal procedure as enshrined in all standing orders,” Wase saidDetails later……………Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Buhari Seeks Senate’s Nod for Seven Ministerial Nominees",
    "summarized_story": "* Senate gets new minority leader, whip* Bauchi, Katsina, Edo senator dump APC for PDPSunday Aborisade in AbujaPresident Muhammadu Buhari has sent a letter to the Senate asking the red chamber to confirm the appointment of seven new ministerial nominees.\nThey are: Henry Ikechukwu Iko (Abia State); Umana Okon Umana (Akwa Ibom State); Ekuma Joseph (Ebonyi State); Goodluck Opia (Imo State); Umar Ibrahim El-Yakukub, (Kano State), Ademola Adewale Adegoroye, (Ondo State) and Odum Odi (Rivers State).\nThey replaced ministers who resigned their appointments at the wake of the All Progressives Congress (APC) presidential primary election recently.\nThe Senate President, Ahmad Lawan, read Buhari’s letter on the floor of the Senate during plenary Tuesday.\nAlso at plenary on Tuesday, three APC senators official defected to the PDP."
  },
  {
    "headline": "Why I Didn’t Sack Central Bank Governor, Emefiele Despite His Interest In 2023 Presidency – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the Governor of the Central Bank, Godwin Emefiele, can seek elective positions without resigning from his position.\nSpeaking in the interview, Buhari said the CBN Act had not listed political participation as part of the grounds for the removal of a CBN governor.\n“The CBN governor is appointed by the President.\nA group was said to have purchased the expression of interest and nomination forms for Emefiele to partake in the contest.\nThe CBN governor had come under heavy criticism over the APC Presidential Expression of Interest and Nomination forms reportedly obtained for him."
  },
  {
    "headline": "Why I Didn’t Sack Central Bank Governor, Emefiele Despite His Interest In 2023 Presidency – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the Governor of the Central Bank, Godwin Emefiele, can seek elective positions without resigning from his position.\nSpeaking in the interview, Buhari said the CBN Act had not listed political participation as part of the grounds for the removal of a CBN governor.\n“The CBN governor is appointed by the President.\nA group was said to have purchased the expression of interest and nomination forms for Emefiele to partake in the contest.\nThe CBN governor had come under heavy criticism over the APC Presidential Expression of Interest and Nomination forms reportedly obtained for him."
  },
  {
    "headline": "Why I Didn’t Sack Central Bank Governor, Emefiele Despite His Interest In 2023 Presidency – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the Governor of the Central Bank, Godwin Emefiele, can seek elective positions without resigning from his position.\nSpeaking in the interview, Buhari said the CBN Act had not listed political participation as part of the grounds for the removal of a CBN governor.\n“The CBN governor is appointed by the President.\nA group was said to have purchased the expression of interest and nomination forms for Emefiele to partake in the contest.\nThe CBN governor had come under heavy criticism over the APC Presidential Expression of Interest and Nomination forms reportedly obtained for him."
  },
  {
    "headline": "It May Be Your Turn In APC Presidency But Not For Nigerians – Ex-Governor, Babangida Aliyu Scolds Tinubu",
    "summarized_story": "A former Governor of Niger State, Babangida Aliyu, has said that the Presidential candidate of the All Progressives Congress, APC, Bola Tinubu, should not waste his time and resources in contesting for president.\nAliyu also reiterated that the Vice President, Prof Yemi Osinbajo, would have been the best candidate for the APC presidential ticket because he had learnt enough lessons as the Vice President.\nThere was no evidence that there was an agreement that was written for somebody to say it's my turn.\n“If it's your turn in the APC that's your own problem but that's not for Nigerians.\nNigerians will come to decide what is best for them given what we have gone through,” Babangida noted."
  },
  {
    "headline": "It May Be Your Turn In APC Presidency But Not For Nigerians – Ex-Governor, Babangida Aliyu Scolds Tinubu",
    "summarized_story": "A former Governor of Niger State, Babangida Aliyu, has said that the Presidential candidate of the All Progressives Congress, APC, Bola Tinubu, should not waste his time and resources in contesting for president.\nAliyu also reiterated that the Vice President, Prof Yemi Osinbajo, would have been the best candidate for the APC presidential ticket because he had learnt enough lessons as the Vice President.\nThere was no evidence that there was an agreement that was written for somebody to say it's my turn.\n“If it's your turn in the APC that's your own problem but that's not for Nigerians.\nNigerians will come to decide what is best for them given what we have gone through,” Babangida noted."
  },
  {
    "headline": "'Applicant was uncouth' -- Anambra reacts as commissioner calls jobseeker 'idiot'",
    "summarized_story": "The Anambra government says an insulting statement made by Ngozi Chuma-Udeh, the commissioner for education, was provoked by an applicant’s “uncouth” language.\nA voice recording, which has now gone viral, is said to be that of the commissioner speaking to an applicant for the teaching position on the exercise.\n“The Commissioner’s comments were as a result of the uncouth language used by the applicant against the person of the Governor of Anambra State and other unprintable words hurled at the Commissioner.\nAdvertisement“As public officers operating in the public space, the Commissioner has apologised for her inappropriate choice of words used in the said voice note.\n“However, it is pertinent to reiterate that Governor Chukwuma Charles Soludo remains committed to the well being of Ndi Anambra and will not be distracted in availing deserving qualified teachers the opportunity to serve Anambra State and contribute in shaping the future of our children.”"
  },
  {
    "headline": "'Applicant was uncouth' -- Anambra reacts as commissioner calls jobseeker 'idiot'",
    "summarized_story": "The Anambra government says an insulting statement made by Ngozi Chuma-Udeh, the commissioner for education, was provoked by an applicant’s “uncouth” language.\nA voice recording, which has now gone viral, is said to be that of the commissioner speaking to an applicant for the teaching position on the exercise.\n“The Commissioner’s comments were as a result of the uncouth language used by the applicant against the person of the Governor of Anambra State and other unprintable words hurled at the Commissioner.\nAdvertisement“As public officers operating in the public space, the Commissioner has apologised for her inappropriate choice of words used in the said voice note.\n“However, it is pertinent to reiterate that Governor Chukwuma Charles Soludo remains committed to the well being of Ndi Anambra and will not be distracted in availing deserving qualified teachers the opportunity to serve Anambra State and contribute in shaping the future of our children.”"
  },
  {
    "headline": "Obaseki: Many Nigerians now Peter Obi supporters... they want alternatives to PDP, APC",
    "summarized_story": "Godwin Obaseki, governor of Edo, says “many” Nigerians are looking for alternatives to the Peoples Democratic Party (PDP) and the All Progressives Congress (APC).\nIn a video posted by AIT on Tuesday, while explaining why PDP lost the recent Ekiti governorship election, Obaseki said many Nigerians no longer want APC and PDP and have now become ‘Obidients’.\nSupporters of Peter Obi, presidential candidate of the Labour Party (LP), identify themselves as ‘Obidients’.\nAccording to Obaseki, the PDP must find a way to make Nigerians more interested in the party .\nThey do not want us; they are not talking about PDP or APC."
  },
  {
    "headline": "Obaseki: Many Nigerians now Peter Obi supporters... they want alternatives to PDP, APC",
    "summarized_story": "Godwin Obaseki, governor of Edo, says “many” Nigerians are looking for alternatives to the Peoples Democratic Party (PDP) and the All Progressives Congress (APC).\nIn a video posted by AIT on Tuesday, while explaining why PDP lost the recent Ekiti governorship election, Obaseki said many Nigerians no longer want APC and PDP and have now become ‘Obidients’.\nSupporters of Peter Obi, presidential candidate of the Labour Party (LP), identify themselves as ‘Obidients’.\nAccording to Obaseki, the PDP must find a way to make Nigerians more interested in the party .\nThey do not want us; they are not talking about PDP or APC."
  },
  {
    "headline": "PHOTOS: 3 Nigerians bag internship at JP Morgan",
    "summarized_story": "Three Nigerians have bagged an internship at JP Morgan, the US multinational investment bank and financial services holding company.\nRotibi also shared photos of the trio at the bank which is headquartered in New York City, the United States.\nAdvertisement“Day 1 as a summer intern @J.P. Morgan in London and I’d be working as a software engineer,” he wrote.\nA Twitter user named Wálé Akínfadérìn insinuated that the University of Lagos (UNILAG) students are always beneficiaries of such internships.\nAdvertisement“Looks like there’s an ongoing solid pipeline that takes UNILAG undergraduate students (Comp Sci, Sys Engr, Comp Engr, EE) to London for internship at JP Morgan Chase and Facebook,” the user wrote."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Healthtracka raises money to expand at-home lab testing",
    "summarized_story": "Healthtracka, a Nigerian startup that offers convenient at-home lab tests, has raised $1.5 million in pre-seed funding, according to a statement shared with TechCabal today.\nThis is because doctor consultations, even virtual ones, end with patients being required to take a lab test at a hospital.\nNow they can now order lab tests for the patient using Healthtracka’s API.\nUsers can go on Healthtracka’s website and book lab tests ranging from fertility and STD tests to full blood count and COVID tests.\nIt also wants to expand its offering by launching an API that will allow both telemedicine services and traditional healthcare providers to offer at-home lab testing."
  },
  {
    "headline": "Inside Amazon Prime Video's first Nollywood film production deal",
    "summarized_story": "On Tuesday, Nollywood production house, Nemsia Films, announced that it closed an exclusive slate deal for 3 commissioned feature films with American streaming giant, Amazon Prime Video, which made its foray into Nollywood in December last year.\nIn practice, Amazon is reserving the IP rights of the 3 films on the slate deal, and will cover their production costs.\nLoup Garou is a small production company focused mostly on music video production.\nMore skin in the gameIt’s no more news that Amazon Prime Video is not only keen on entering the second biggest film industry in the world, Nollywood, but wants to build a formidable local content bank.\nWould Amazon Prime Video’s entry into Nigeria intensify the competition, and would it dominate the market?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Edo PDP: Kassim Afegbua not our member – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State chapter of the Peoples Democratic Party (PDP), on Tuesday, said Prince Kassim Afegbua, a former Presidential Campaign spokesman of the party, has long been expelled from the party and no longer a bonafide member of the PDP in the state.\nIn a statement, the State Publicity Secretary of the PDP, Ogie Aigbe Vasco, said Kassim Afegbua was expelled from the party for anti-party activities.\nHe said, “The Edo State Chapter of the PDP wishes to notify its members, supporters and critical stakeholders that Prince Kassim Afegbua, a former Presidential Campaign spokesman of our dear party, has long ceased to be a bonafide member of the PDP in Edo State.\n“Our attention has been drawn to the numerous media showmanship being put up by a former member of the PDP family in Edo State, Prince Kassim Afegbua in the past few days.\nHe is not a member of the PDP Edo State family and should stop deceiving himself to be one,” he added."
  },
  {
    "headline": "Edo extends ‘Operation Plan Edo’ exercise, seals gas, petrol stations, hotels, others in Benin – Nigerian Observer",
    "summarized_story": "The Ministry continued the recertification exercise and sealed gas and petroleum stations, schools, hotels, event centres, guest houses and other public spaces operating without permits in parts of Benin City, the Edo State capital.\nThe exercise took off at Saint Saviour Road and extended to parts of Upper Sokponba Road in Benin City, where officials served Contravention Notices and sealed gas and petrol stations, event centres, guest houses and schools which were built without approvals.\nMost of the gas stations in Saint Saviour Road were located in clusters around residential areas.\nAbout seven gas stations were on a segment of the road.\n“Government encourages intending owners of gas and petrol stations to come to the Edo State Ministry of Physical Planning, Urban and Regional Development, to get their building permits approved before siting gas and petrol stations.”Some of the gas and petrol stations sealed include Ledor Filling/Gas station, Small Market Filling Station, BW Cooking Gas Station, LPG Gas Station, Oboye Gas Station and two other unnamed gas stations, all situated in the Saint Saviour Road in Benin City."
  },
  {
    "headline": "Edo to make Abudu, others cities by 2024 – Obaseki – Nigerian Observer",
    "summarized_story": "The governor made the disclosure after an inspection of the revamped multi million naira college at Abudu on Sunday.\nAccording to Obaseki, the state government is in talks with an undisclosed energy company that would power Abudu and other 14 towns in the state billed to upgraded to cities.\nObaseki told journalists that Benin City, the state capital was over populated hence the need to decongest it by creating activities outside the metropolis.\n“I want to see how we can begin to disperse population, create activities outside Benin City.\nWe promise to have about 10 to 15 other mini cities outside Benin by the time we are leaving office, so Abudu is going to be one of them”, The governor saidShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Autonomous Dispute: Community Appeals For Benin Monarch’s Intervention – Nigerian Observer",
    "summarized_story": "The people of Okhiaro in their large numbers, comprising of the Odionwere, Elders, Market women and youths maintained that the village Okhiaro known for peaceful and development have been an independent village from Evbuotubu over the years.\nHe recounted that over seven Odionwere have ruled over Okhiaro and wondered why some alleged mischief makers are hell-bent in causing avoidable crisis by laying claim to Okhiaro village as part of their community.\n‘We want to sincerely commended the Oba of Benin for bringing peace and development to the entire Edo State as his reign has continued to bring unprecedented developmental strides to Edo State and beyond.\n” It is a known fact that Okhiaro Village is not under Evbuotubu as I grew up and attended Useh Primary School from Okhiaro village.\nThey people who disclosed that the village over the years has functional market and other features of a true autonomous village, however, appealed for the intervention of the Oba in the dispute."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Ebonyi PDP: AnyiChucks wins as Appeal Court rejects Ogba’s request for stay of execution",
    "summarized_story": "Recall that the federal high court had on Tuesday, June 7, upheld the May 28 primary election of the PDP in the state that produced Dr Odii as governorship candidate.\nFollowing the court decision, the PDP national working committee on Monday, gave Dr Odii his certificate of return as the authentic governorship candidate for the state’s governorship election.\nBut the Appeal Court on Tuesday, declined his request, meaning that Dr. Odii is all clear to proceed with his governorship contest.\n“The Appeal Court decision means that the matter has now been settled, and that we can focus on the campaign to take back Ebonyi from the APC,” Onyike said.\n“This is very important, and I appeal to all PDP stakeholders to come together at this point."
  },
  {
    "headline": "Nigeria’s aviation sector may soon collapse – Dana Air CEO, Mann",
    "summarized_story": "Sukhjinder Mann, CEO, Dana air has said Nigeria’s aviation sector may not survive its current crisis, as according to him some airlines will shut down operations soon.\nAirline Chief who spoke on Arise TV on Tuesday, said he foresees collapse of sector, as crisis may last beyond a year.\nAccording to him, the jet A1 crisis in the aviation sector will take up to a year to resolve, “and we believe that before then, some airlines will drop.”He explained further that, “Airlines are already overstretched and it will be difficult to survive the next few months.”He, however, noted that the crisis did not originate from Nigeria, but blamed some aspects on the devaluation of the naira.\n“The problem is not Nigerian in origin because it is caused by the Russian war, but the Nigerian aspect is the devaluation of the naira, because we buy in naira but at dollar cost and when the naira falls, it affect the cost,” he noted."
  },
  {
    "headline": "84-year-old retired Methodist Archbishop says he wants to be next Alaafin",
    "summarized_story": "Adebayo ObajemuIn a move surprising to many observers, a retired Methodist Archbishop of Ilesa and Ibadan, Ayo Ladigbolu, has publicly stated his desire to become the next Alaafin of Oyo, even as his aspiration is drowned in a sea of criticisms over his age and Christian background.\n84- year -old Ladigbolu said he threw his hat in the ring to pacify numerous admirers following their “countless appeals and pleas from far and near.”“Especially those who are knowledgeable about my devotion to, and undying commitments to the greater progress and prosperity of Oyo Town, and my undeniable records of current contributions to uplifting the Yoruba culture as well as the honour, glory and splendour of the Alaafin both here at home and in the global community.”Recall that as the race to succeed the deceased ex Alafin Adeyemi gathered steam, on June 10, the Agunloye ruling house submitted the names of 48 princes to the Baba Iyaji of Oyo land, including that of archbishop Ladigbolu.\nFrom this point, the Baba Iyaji and the Alaafin Chieftaincy Declaration will forward the names to the Oyo Mesi, the kingmakers.\nThe name of the chosen prince one will then be forwarded to governor of Oyo State for assent"
  },
  {
    "headline": "Why Peter Obi should rather be minister of economy – Ned Nwoko",
    "summarized_story": "Business mogul and politician, Ned Nwoko has stated that the presidential flag bearer of the Labour Party, Peter Obi lacks the structure required to lead the countryMr Nwoko, who spoke with BBC on Tuesday, praised the former Anambra state governor’s demeanour in the business sphere, but noted that certain factors in the Labour Party would hinder Obi from unseating the ruling the party.\nThe former House of Representatives member argued that as a president, one must have the majority of the Labour Party in the House of Representatives and Senate, which Obi does not have any chance of having.\n“Peter Obi is a good man and has impressed me.\n“Labour Party does not have the structure to win but they have a support base.\n“As a president, you must have the majority of the Labour Party in the House of Representatives and Senate."
  },
  {
    "headline": "Despite CBN’s ban, Nigerians double Bitcoin transactions in May",
    "summarized_story": "Despite the Central Bank of Nigeria (CBN) ’s restrictions on cryptocurrency transactions in the country and the crashing prices of cryptocurrencies globally, Pasful, a cryptocurrency trading platform, has reported a surge in weekly transactions on its Lightning Network.\nAccording to the trading platform, the volume of money sent by Nigerians via the network doubled from October 2021 to May 2022.\nAccording to the firm, Nigeria was its largest trading country in 2021 with 16,000 daily trades.\nAccording to a 2021 report by Chainalysis, the nation is the sixth leading nation in the world in terms of crypto adoption.\nA recent report by KuCoin, a crypto exchange with over 10 million registered users, disclosed that about 33.4 million Nigerians traded or owned crypto assets."
  },
  {
    "headline": "Buhari Directs Urgency In Dealing With Kidnapped Railway Passengers",
    "summarized_story": "Upon the President’s approval, presidential spokesman, Garba Shehu, said the Government was continuing on the two-lane approach, kinetic and non-kinetic to secure the passengers’ safe release.\nHe said the setback notwithstanding, the Government was not leaving any stone unturned in the efforts to bring all of the hostages back.\nGovernment is also mindful of efforts of some patriotic and influential persons and institutions that are helping in securing the safe release of the hostages.\n“The President’s clear directive on the issue is that the hostages must be brought home alive.\nThe country’s military and security agencies are aware of their duty to the nation and are determined to give effect to the President’s charge with increased urgency,” Buhari added."
  },
  {
    "headline": "Buhari Directs Urgency In Dealing With Kidnapped Railway Passengers",
    "summarized_story": "Upon the President’s approval, presidential spokesman, Garba Shehu, said the Government was continuing on the two-lane approach, kinetic and non-kinetic to secure the passengers’ safe release.\nHe said the setback notwithstanding, the Government was not leaving any stone unturned in the efforts to bring all of the hostages back.\nGovernment is also mindful of efforts of some patriotic and influential persons and institutions that are helping in securing the safe release of the hostages.\n“The President’s clear directive on the issue is that the hostages must be brought home alive.\nThe country’s military and security agencies are aware of their duty to the nation and are determined to give effect to the President’s charge with increased urgency,” Buhari added."
  },
  {
    "headline": "Mudiame Varsity Holds Maiden Matriculation, Promises Employment For Students",
    "summarized_story": "Sunny Eromosele, and the Vice Chancellor of the University, Prof. Ernest Izevbigie, have said that the institution will keep to the promise of offering automatic employment to all its first-class graduates.\n“Today marks another milestone in our quest to create a Nigeria and an African continent of our dream.\n“Let me assure you that we will keep our promise on granting employment to all our outstanding students.\nAlso speaking, the acting Registrar of the school, Olusegun Johnson, said the school presented a new beginning, standard, orientations, outlooks, philosophies and value.\nJohnson added that the university also created a shift from the state of un-employability of graduates to a realm of uniquely breaded employable graduates."
  },
  {
    "headline": "Mudiame Varsity Holds Maiden Matriculation, Promises Employment For Students",
    "summarized_story": "Sunny Eromosele, and the Vice Chancellor of the University, Prof. Ernest Izevbigie, have said that the institution will keep to the promise of offering automatic employment to all its first-class graduates.\n“Today marks another milestone in our quest to create a Nigeria and an African continent of our dream.\n“Let me assure you that we will keep our promise on granting employment to all our outstanding students.\nAlso speaking, the acting Registrar of the school, Olusegun Johnson, said the school presented a new beginning, standard, orientations, outlooks, philosophies and value.\nJohnson added that the university also created a shift from the state of un-employability of graduates to a realm of uniquely breaded employable graduates."
  },
  {
    "headline": "Senate Alerts Military On Terrorists’ Enclaves In Kwara, Niger",
    "summarized_story": "The Senate has identified terrorists’ enclaves in communities within three local government areas of Kwara and Niger States, respectively.\nThe names of communities given by the chamber include Kaiama, Karonzi-Yashikira in Baruten local government of Kwara State, and Wawa and Babanna areas in Niger State.\nIn his presentation, Senator Umar noted that, “kidnapping and other forms of criminality is becoming a recurrent decimal in communities close to Kainji Lake National Park particularly Nanu.\nNuku, Woro, Kale in Kaiama and Yashikira in Baruten local Government of Kwara State and some part of Borgu Local Government in Niger State.\n“Further notes that Kainji Lake National Park covers an area of about 5,341km square with deep forest Vegetation."
  },
  {
    "headline": "Buhari begs international partners to declare IPOB terrorist organisation",
    "summarized_story": "President Muhammadu Buhari has appealed to international partners to declare the Indigenous People of Biafra (IPOB) a terrorist organisation.\nThe president, in an interview with Bloomberg, said in 2015, Boko Haram held territory the size of Belgium within the borders of Nigeria.\n“We urge those same international partners to take additional steps costing them nothing, by proscribing another group – IPOB – as a terrorist organization.\nBuhari stated that his administration was the only one in Nigeria’s history to implement a solution to decades-long herder-farmer conflicts, exacerbated by desertification and demographic growth.\n“The National Livestock Transformation Plan, putting ranching at its core, is the only way to deplete the competition for resources at the core of the clashes."
  },
  {
    "headline": "Bill Cosby found liable in 47 year-old sexual assault case",
    "summarized_story": "Comedian Bill Cosby has been found liable for sexually assaulting a woman at the Playboy Mansion in 1975 when she was a teenager.\nShe told jurors that Cosby took her hand and used it to masturbate his penis.\nIn video of a deposition shown to jurors, Cosby said he did not remember Huth.\nShe told jurors she recently concluded that she had been mistaken about the year and now believes it happened in 1975.\nThe civil trial in California took place 11 months after Cosby was freed from prison when Pennsylvania’s highest court threw out his sexual assault conviction in a different criminal case there."
  },
  {
    "headline": "NITDA’s Code Of Practice Will Tackle Fake News, Hate Speech — NADIR",
    "summarized_story": "The Network of Advocates for Digital Reporting (NADIR) has lauded the National Information Technology Development Agency (NITDA) for drafting a ‘Code of Practice for Interactive Computer Service Platforms/Internet Internet Intermediaries’.\nAt a press conference in Kano, the group said the code will not only strengthen press freedom and maintain the dignity of information but will also curtail fake news and hate speech before and during the 2023 elections.\nThe Coordinator, Dahiru Mohammed Lawal noted that the online space needed to be made comfortable for everyone to address issues that cause panic in society and infringe on laws.\n“An unregulated online space remains a recipe for civil unrest.\nNADIR recalled that on June 16, Meta (Facebook), Google, Twitter and Microsoft agreed to take a tougher line against disinformation, deep fakes and fake accounts, under an updated European Union (EU) Code of Practice or face hefty fines."
  },
  {
    "headline": "JUST IN: Amaechi, Onu Not Returning As Buhari Nominates New Ministers",
    "summarized_story": "JUST IN: Amaechi, Onu Not Returning As Buhari Nominates New MinistersPresident Muhammadu Buhari has requested that the Senate confirm seven ministerial nominees.\nOn Tuesday, Senate President Ahmad Lawan read two letters containing Buhari’s request on the floor of the upper legislative body.\nDespite earlier conjecture, Rotimi Amaechi, Ogbonnaya Onu, Godswill Akpabio, and Emeka Nwajiuba, who all left to pursue presidential campaigns, will not return.\nMore to come…"
  },
  {
    "headline": "BREAKING: Buhari replaces ex-ministers, sends nominees list to Senate",
    "summarized_story": "The Nigerian Senate has received the executive communication with the nomination of six names as replacements for ministers that resigned to contest the presidential election.\nIn a letter that was read by the Senate President, Dr Ahmad Ibrahim Lawa,n on Tuesday, President Muhammadu Buhari said the nominees would replace the former ministers that resigned from his cabinet.\nThe letter read: “In accordance with Section 8 Subsection 2 of the Constitution of the Federal Republic of Nigeria as amended, I hereby forward the underlisted ministerial nominees for your confirmation.”The nominees are:Henry Ikechukwu Ikoh – Abia StateUmana Okon Umana – Akwa Ibom StateEgwumakama Joseph Nkama – Ebonyi StateGoodluck Nnana Opiah – Imo StateUmar Ibrahim El-Yakub – Kano StateAdemola Adewole Adegoroye – Ondo StateOdum Odih – Rivers State"
  },
  {
    "headline": "Health Concern: ‘I’m Out Of Hospital And Doing Well’ — Abdulsalami",
    "summarized_story": "Health Concern: ‘I’m Out Of Hospital And Doing Well’ — AbdulsalamiAbdulsalami Abubakar, former head of state, says there’s no cause for alarm over his health as his medical condition has improved significantly.\n“I had a swollen knee and was unable to walk for days in the last week of May,” he said.\n“After initial care by my doctors, they advised that I should seek further expert care abroad.\nThat was why I had to cancel my birthday programme”He also extended his gratitude to Nigerians for their concern and care.\n“I appreciate the support, love and care that Nigerians have been showing since the story went on social media."
  },
  {
    "headline": "Breaking [2022 Electoral Act]: Reps step down motion to override Buhari on statutory delegates",
    "summarized_story": "The House of Representatives on Tuesday, stepped down a motion seeking a resolution to override President Muhammadu Buhari on his failure to assent to amendment of the 2022 Electoral Act, to allow statutory delegates participate in congresses and conventions of their respective political parties.\nFailure of the assent had denied elected public office holders the chances of participating in the recently concluded primary elections of political parties in the country, as build up to the 2023 elections thickens.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Buhari names new ministers-designate, to replace Amaechi, others *See full list",
    "summarized_story": "The Senate has received the names of seven Ministerial nominees from President Muhammadu Buhari for confirmation as Ministers of the Federal Republic of Nigeria.\nThe confirmation request was contained in a letter addressed to the Senate President, Ahmad Lawan, and read on the floor at the start of plenary onnTuesday.\nPresident Buhari, in the letter, explained that the confirmation request was in accordance with the provisions of Section 147 subsection 2 of the 1999 Constitution of the Federal Republic of Nigeria as amended.\nThe nominees for confirmation include: Henry Ikechukwu Ikoh – Abia State; Umana Okon Umana – Akwa Ibom State; Ekumankama Joseph Nkama- Ebonyi State; and Goodluck Nana Opiah – Imo State.\nOthers are Umar Ibrahim El-Yakub – Kano State; Ademola Adewole Adegoroye – Ondo State; and Odum Odi – Rivers State."
  },
  {
    "headline": "Breaking: Kidnapped ex-NFF General Secretary Sani Toro, 2 others regain freedom",
    "summarized_story": "Armed kidnappers in Nigeria have released three men including Ahmed Sani Toro, a former secretary-general of the then Nigeria Football Association (NFA).\nToro’s son told BBC Sport Africa that his father is on his way home after the ordeal.\nNigeria is facing a worsening spate of kidnappings for ransom by armed gangs who frequently attack travellers and rural communities.\nToro spent six years in his role at what is now known as the Nigeria Football Federation (NFF) between 1993 and 1999.\nToro played a huge administrative role – including during bonus rows involving the NFA and players – at the 1996 Olympics football event and the 1998 World Cup in France."
  },
  {
    "headline": "Coalition Calls For Implementation Of Sugar-Sweetened Beverages Tax",
    "summarized_story": "This, comes as the federal government failed to meet its June 1st takeoff of the Sugar Tax Regulation.\nRecall that the Ministry of Finance, Budget and National Planning was supposed to announce the framework for enforcement and the timeline for the implementation of the sugar tax that was introduced late last year.\nThe coalition also applauded the swift action of the Nigeria Customs Service for taking initiative towards enforcing the tax by reaching out to the beverage industries to begin the implementation of the SSB Tax.\nWith the coalition increasingly worried about the tax being fully jeopardized due to delay, Zacks Onwe of TalkHealth Nigeria urged the coalition to activate community stakeholders to call out the government for refusing to implement the tax.\nAlso, the Executive Director of the Nigerian Heart Foundation, Dr. Kingsley Akinroye, called on stakeholders, including civil society organizations, to work with government to enforce the implementation of the tax."
  },
  {
    "headline": "Tedious verification process for pensioners must end – PTAD",
    "summarized_story": "Dr Ejikeme said this will put an end to the tedious, challenging and expensive field verification exercises of the past embarked by pensioners under the Defined Benefit Scheme.\nWe will also explain the role we believe that Union Executives and Pension Desk Officers should play.\n“The tedious, challenging and expensive field verification exercises of the past must end.\n“We want them to be able to contact PTAD with ease, and to be treated with respect and dignity.\nThis project, and all others we have implemented in the past, have been designed towards this end goal.”"
  },
  {
    "headline": "ITPN FCT Chapter set to hold maiden edition of interactive workshop for industry players",
    "summarized_story": "By Palma IleyeFCT Chapter of Institute for Tourism Professionals of Nigeria, ITPN, has said it was set to organize a One-Day Interactive Workshop with industry players aimed at fostering the growth and development of the sector.\nIn a press release issued by the Chairman of the FCT Chapter of the Institute, Dr. Mrs. Ebikaboere Seimodei, stated that the one-day event being the first to be organized by the Chapter, will create a platform to brainstorm on harnessing the benefits of the sector adding that it promises to be insightful, engaging and beneficial for critical industry players and stakeholders of the tourism industry in the country.\nSeimodei who is also the Technical Adviser to the Bayelsa State Governor on Tourism and Hospitality, asserted that for the growth and development of the industry, such occasion that brings relevant stakeholders in all facets of the industry together was imperative to be able to rub minds, wear the proverbial thinking caps and come up with laudable ideas and innovations that will move the industry forward in line with best global practices.\nAccording to her, the workshop with the theme: ‘Effective Customer Service for Tourism and Hospitality Professionals’ scheduled to hold on Thursday, 23rd June, 2022 at White Hart Hotel & Apartments, Wuye District, Abuja beginning from 10:00am, is expected to feature activities such as Discourse Sessions by stakeholders of the Travel Tourism and Hospitality Industry; Capacity Training and Development for practitioners in the sector; Networking among attendees from the public and private sectors of the industry as well as registration of new members into the Institute.\nShe explained that the FCT Chapter of the Institute for Tourism Professionals of Nigeria came into existence in 2016 with a membership of about a hundred, and as the Chapter of the nation’s capital, it was challenged as a fore-runner to galvanize all key players in the industry so that the FCT and indeed the Nigeria as a whole, will have a purposeful and well guided direction to position the tourism and hospitality industry as a viable economic sector that has a vital role to play for the socio-economic benefits of the country."
  },
  {
    "headline": "FG reaffirms commitment to complete Idukpani- Itu – Ikot Ekpene road in 2023",
    "summarized_story": "Chioma NnodimThe Federal Government has reaffirmed its commitment to completing the ongoing dualization and rehabilitation of the Odukpani – Itu – Ikot Ekpene road in Cross River and Akwa Ibom States.\nHe disclosed that funding is not a problem as the road is being funded by the Nigerian National Petroleun Company ( NNPC) under the Federal Government Tax Credit Scheme.\nThe Director expressed satisfaction at the pace of work by Julius Berger and SERMATECK companies while urging CCECC to improve on its pace of work.\nThe Federal Controller of Works in Cross River State, Engineer Bassey Nsentip said the contractors have the equipments and are willing to work, adding that the road project include five bridges and several culverts.\nEngineer Bakari Kehinde and EngineerJoseph Ukpata, site engineers of Julius Berger and SERMATECK respectively also called on the state governments to help in resolving the problem of the right of way."
  },
  {
    "headline": "Honeywell group partners Lagos innovates to upskill young tech entrepreneurs",
    "summarized_story": "Kehinde Ibrahim, LagosLEADING Nigerian investment holding company, Honeywell Group (HGL), has partnered with the Lagos State Government and Lagos Innovates, the tech arm of Lagos State Employment Trust Fund (LSETF) to support the growth of one of Africa’s most exciting tech ecosystems.\nThe partnership is executed via a talent development programme under ‘Lagos Innovates’ – a training project conceptualised to ease the process of building successful tech start-ups in Lagos State.\nCommenting on the partnership, Head of Corporate Services, Honeywell Group, Tomi Otudeko said: “Creating long-term value for Nigeria and its people has always been at the heart of Honeywell Group’s mission.\nLSETF and Honeywell Group are committed to ensuring that young people are equipped to drive the growing tech ecosystem in Lagos and Nigeria at large, in addition to positioning themselves for the gig economy.\nIn partnership with HGL, Lagos Innovates is supporting capacity development in Lagos State by facilitating access to an integrated development environment (IDE) or tech-focused entrepreneurship content and programming."
  },
  {
    "headline": "CJN Replies Aggrieved Justices, Says No Hostility In Supreme Court",
    "summarized_story": "The Chief Justice of Nigeria, Justice Ibrahim Tanko Mohammad, has responded to a letter signed by 14 justices of the Supreme Court.\nThe Supreme Court justices had lamented the decrepit state of affairs in the court.\nThe aggrieved justices accused the CJN of refusing to address the issues despite drawing his attention to them.\nREAD ALSO: Supreme Court Sets Aside Ban On Use Of Hijabs In Lagos SchoolsThe justices further accused the CJN of gallivanting with his “spouse, children and personal staff,” while not allowing them to travel with an assistant on foreign trips.\nIn his response, the CJN, in a statement signed by his spokesperson, Ahuraka Yusuf Isah, said the court is also “affected by the economic and socio-political climate prevailing in the country."
  },
  {
    "headline": "President Buhari Sends Ministerial List To Senate For Screening",
    "summarized_story": "﻿President Muhammadu Buhari has written to the Senate seeking the confirmation of seven ministerial nominees.\nThe nominees are: Henry Ikechukwu – Abia State, Umana Okon Umana – Akwa-Ibom State; Ekuma Joseph – Ebonyi State; Goodluck Nana Obia – Imo State; Umar Ibrahim Yakub – Kano State; Ademola Adewole Adegorioye – Ondo State; Odo Udi – Rivers State.\nThe Senate has, however, not fixed a date yet for the screening exercise.\nMeanwhile, the Peoples Democratic Party (PDP) has nominated Senator Philip Aduda as the new minority leader to fill the vacant seat created by Senator Enyinnaya Abariba’s defection.\nAlso, the party nominated Senator Chukwuka Utazi as the new senate minority whip."
  },
  {
    "headline": "Electoral Act Amendment: Bill To Override Buhari Stepped Down",
    "summarized_story": "﻿A bill to override President Muhammadu Buhari over his delay in signing the amendment to the Electoral Act 2022, has been stepped down at the House of Representatives.\nThe bill was stepped down on Tuesday after the Deputy Speaker faulted it, stating that any move to override requires 2/3rd of members.\nRead Also: President Buhari Sends Ministerial List To Senate For ScreeningIt’s been over 30 days since the Minority Caucus in the House of Representatives had asked President Muhammadu Buhari to sign the one-item amendment to the Electoral Act 2022.\nBut the President has yet to sign it or communicate a decision to the National Assembly about the bill.\nBelow are details of the motion:Need to Invoke Section 58(5) of the Constitution of the Federal Republic of Nigeria, 1999 to Pass Again the Electoral Act, 2022: Hon."
  },
  {
    "headline": "Bayelsa Boat Accident: Corpses Of Corps Members Found, Two Toddlers Still Missing",
    "summarized_story": "The corpses of the four out of six victims of a boat accident along the Otuan and Ayama communities of Southern Ijaw Local Government council in Bayelsa State, have been found.\nChannels Television gathered that the boat accident, which occurred on Saturday at about 4:00 pm, was reportedly caused by bad weather, poor visibility and lack of life jackets for the passengers.\nOgoniba also said the the National Youths Service Corps (NYSC) authorities have been notified of the recovery of the corpses of the deceased female corps member.\nMeanwhile, the spokesman of the Bayelsa State Police Command, Asinim Butswat, has denied the reported arrest of the boat rider, Lucky Christopher.\nAccording to Butswat, Lucky Christopher was only invited as part of procedures into investigations over the accident."
  },
  {
    "headline": "Why Nigeria Has Not Removed Fuel Subsidy – Buhari",
    "summarized_story": "President Muhamamdu Buhari has defended the federal government’s decision to keep paying fuel subsidies.\nIn a response to Bloomberg, the President said the effects of removing fuel subsidies would have been too harsh on the Nigerian people.\n“Most western countries are today implementing fuel subsidies.\nWhy would we remove ours now?” What is good for the goose is good for the gander!” The President said.\nREAD ALSO: Buhari Asks US, UK, Others To Ban IPOB“My government set in motion plans to remove the subsidy late last year."
  },
  {
    "headline": "Kwara Governor, Abdulrahman, nominates new commissioners -",
    "summarized_story": "Kwara State Governor AbdulRahman AbdulRazaq has forwarded the names of five new commissioner-nominees to the State House of Assembly for approval.\nThe nominees are former House of Representatives aspirant Dr. Afeez Abolore Alabi (Ilorin East); Adenike Afolabi-Oshatimehin (Ifelodun; and Wahab Femi Agbaje (Offa).\nThe two other nominees are Gidado Lateef Alakawa (Asa) and Ibrahim Akaje (Ilorin West).\nThe nominees’ names and profiles have been sent to the House of Assembly for legislative screening and ap\\proval."
  },
  {
    "headline": "House of Reps member, Shina Peller, joins Accord Party -",
    "summarized_story": "A member of the House of Representatives from Iseyin/Itesiwaju/Kajola/Iwajowa federal constituency, Oyo State, Honourable Shina Peller, has named Accord as his new political https://www.tvcnews.tv/purplegold/post-new.php#party.\nThe statement read in full:“Earlier today on the floor of the house of representatives, I announced my defection from the All Progressives Congress to Accord Party.\n“Accord party happens to be the first party in Oyo state to zone Oyo North Senatorial ticket to Oke Ogun considering that Ogbomosho Zone had done two terms.\n“In Oyo State, the Accord party is a force to reckon with, it’s internal democracy mechanism is intact, a component lacking in other parties.\n“Today, I would like to inform the general public that I am now with Accord party."
  },
  {
    "headline": "Oyo Deputy Governor resumes new office at Ministry of Environment -",
    "summarized_story": "The embattled Deputy Governor of Oyo state, Rauf Olaniyan has resumed at his new office which was recently relocated to the state’s ministry of Environment.\nThe Deputy Governor while speaking with newsmen at the new work space said his resumption was in compliance with the directive of the constituted authority.\nThe Oyo state governor Seyi Makinde had some weeks ago ordered the relocation of the number two citizen to the Ministry of Environment thereby serving him letter to that regard.\nA sitting governor served me a letter of relocation, why should this be an exception?\nThere had been several controversies linked to the deputy Governor since his defection to the All progressives Congress from the Peoples’Democratic Party."
  },
  {
    "headline": "APC loses three Senators to opposition parties",
    "summarized_story": "Three Senators elected on the platform of the All Progressives Congress have resigned their membership of the ruling party.\nThe lawmakers are Senators Ahmad Babba Kaita (Katsina North), Lawal Yahaya Gumau (Bauchi South), and Francis Alimikhena (Edo North).\nWhilst Babba Kaita and Alimikhena defected to the opposition People’s Democratic Party (PDP), Gumau, on the other hand, defected to the New Nigeria Peoples Party (NNPP).\nThe notice of their resignation and defection was contained in three separate letters read during plenary by the Senate President, Ahmad Lawan, on Tuesday.\nThe defection by the three lawmakers reduces the total number of APC Senators from 70 to 67 in the upper chamber."
  },
  {
    "headline": "Biggest Railway Strike in 30 Years Leaves Commuters Stranded in UK",
    "summarized_story": "Tens of thousands of the UK’s railway workers began the network’s biggest strike action in more than 30 years, leaving commuters facing chaos.\nThere were almost 1 billion train journeys in the UK in the year to March.\nThe union accuses the Conservative government of refusing to give rail firms enough flexibility to offer a substantial pay increase.\nThe strikes are the biggest dispute on the UK’s railway network since 1989, according to the RMT.\nAl Jazeera’s Paul Brennan reported from the UK’s biggest and busiest station Waterloo, saying “extraordinary sight compared to normal” day."
  },
  {
    "headline": "Russia Threatens Retaliation Against Lithuania Following EU Rail ‘Blockade’",
    "summarized_story": "Moscow has threatened to retaliate against Lithuania after the Baltic state halted the rail transport of Russian goods under EU sanctions to the exclave of Kaliningrad.\nLithuania, which controls the only overland rail route linking Kaliningrad with mainland Russia, at the weekend began limiting the export of goods covered by EU sanctions in retaliation for president Vladimir Putin’s invasion of Ukraine.\n“Lithuania has not taken any unilateral national restrictions and only applies EU sanctions,” he told reporters.\nRussia’s Baltic fleet, which has almost 80 warships and submarines, is headquartered there.\nIt’s the EU sanctions,” said Gabrielius Landsbergis, Lithuania’s foreign minister."
  },
  {
    "headline": "Soludo Warns Peter Obi’s Followers + Belgium Returns Lumumba’s Tooth – Trending With Ojy Okpe",
    "summarized_story": "The Governor of Anambra state, Chukwuma Soludo, has debunked a statement credited to him, that a purported investment of Peter Obi, the presidential candidate of Labour Party, in the state has yielded returns.\nSixty One years after the gruesome murder of DRC’s First Prime minister Patrice Lumumba by Belgian mercenaries, his “gold-capped” tooth which was all that remained after his body was dissolved in acid by his killers, has finally been returned to his family."
  },
  {
    "headline": "The Presidential Candidate Has No Power to Remove a Placeholder – Inibehe Effiong",
    "summarized_story": "Lawyer and analyst, Inibehe Effiong, speaks on the loophole in the placeholder candidate arrangement adopted by Nigerian political parties ahead of the 2023 elections."
  },
  {
    "headline": "Burna Boy’s Crew Shot at Us, Victim of Cubana Club Shooting Reveals",
    "summarized_story": "A victim of the shooting at Cubana Club Lagos indicts Nigerian artist, Burna Boy’s crew, for attempted murder after they shot sporadically in the club as a result of a squabble emanating from the singer’s advances at his friend’s wife.\nWatch the video for full details"
  }
]