[
  {
    "headline": "Hearing strange voices sign of schizophrenia, not madness –Mental health experts",
    "summarized_story": "The experts also stated that a recent study suggested that about 1.86 million people suffer from schizophrenia in Nigeria.\nThe experts were reacting to recent reports that hardship and frustrations are fuelling schizophrenia and other mental health challenges in the country.\nAccording to the experts, a recent study by the World Health Organisation has confirmed that schizophrenia is a chronic and severe mental disorder affecting 20 million people worldwide.\nThe health condition, they said, is characterised by distortions in thinking, perception, emotions and language, as well as hallucinations and delusions.\nIn some cases patients may exhibit a deficit of functions such as lack of motivation, reduced speech, social withdrawal, or bluntness of effect,” Peters said."
  },
  {
    "headline": "Hearing strange voices sign of schizophrenia, not madness –Mental health experts",
    "summarized_story": "The experts also stated that a recent study suggested that about 1.86 million people suffer from schizophrenia in Nigeria.\nThe experts were reacting to recent reports that hardship and frustrations are fuelling schizophrenia and other mental health challenges in the country.\nAccording to the experts, a recent study by the World Health Organisation has confirmed that schizophrenia is a chronic and severe mental disorder affecting 20 million people worldwide.\nThe health condition, they said, is characterised by distortions in thinking, perception, emotions and language, as well as hallucinations and delusions.\nIn some cases patients may exhibit a deficit of functions such as lack of motivation, reduced speech, social withdrawal, or bluntness of effect,” Peters said."
  },
  {
    "headline": "Lagos, two others report 11 new COVID-19 cases",
    "summarized_story": "The Nigeria Centre for Disease Control has recorded 11 new cases of COVID-19, bringing the total number of infections in the country to 166, 767.\nAccording to the NCDC, the 11 new infections were recorded in Lagos with nine cases, the Federal Capital Territory-one and Kano-one.\nThe agency also said that there are 1, 544 active cases of COVID-19 in Nigeria.\nThe centre said that out of the 166, 767 cases, 163, 096 people have been treated and discharged.\nThe News Agency of Nigeria, reports that Nigeria started its COVID-19 vaccination campaign in March."
  },
  {
    "headline": "Lagos, two others report 11 new COVID-19 cases",
    "summarized_story": "The Nigeria Centre for Disease Control has recorded 11 new cases of COVID-19, bringing the total number of infections in the country to 166, 767.\nAccording to the NCDC, the 11 new infections were recorded in Lagos with nine cases, the Federal Capital Territory-one and Kano-one.\nThe agency also said that there are 1, 544 active cases of COVID-19 in Nigeria.\nThe centre said that out of the 166, 767 cases, 163, 096 people have been treated and discharged.\nThe News Agency of Nigeria, reports that Nigeria started its COVID-19 vaccination campaign in March."
  },
  {
    "headline": "Police confirm 11 deaths in Igangan Community attack",
    "summarized_story": "The Police Command in Oyo State has confirmed the death of 11 people in Saturday’s night attack in Igangan Community, a town in Ibarapa North Local Government Area.\nThe News Agency of Nigeria (NAN) reports that suspected gunmen had invaded the town on Saturday around 11:10 p.m on motorcycles, and allegedly opened fire on innocents citizens and burnt some property.\nOsifeso said that a total of 11 people, including some of the assailants were confirmed dead in the incident.\nThe PPRO said that a number of vehicles and buildings, including the Palace of the Asigangan of Igangan Town and a filling station were razed.\nHe then, appealed to Igangan community to trust the system, and shun self help in obtaining justice."
  },
  {
    "headline": "New NEMA D-G assumes office in Abuja",
    "summarized_story": "Mr Mustapha Ahmed, newly appointed Director-General of National Emergency Management Agency (NEMA), has assumed office in Abuja.\nMr Manzo Ezekiel, Head of Media and Public Relations, NEMA, said this in a statement on Sunday in Abuja.\nEzekiel said the new D-G was received by management staff of the agency at the headquarters in Abuja.\nEarlier in his valedictory speech, the immediate past NEMA D-G retired Muhammadu Muhammed thanked the president for the opportunity to serve at the agency.\nHe took over from retired AVM Muhammadu Muhammed, who has been appointed as the chairman of the newly created National Senior Citizens Centre."
  },
  {
    "headline": "Road crash leaves many dead on Zaria-Kano Road",
    "summarized_story": "The Kaduna State Government on Sunday said that a road crash that occurred on the Zaria-Kano Road left many dead.\nAruwan said, “Security agencies have reported that several persons lost their lives in a ghastly road crash on Kauran Wali axis of the Zaria-Kano Road.\nAccording to him, the fatal crash occurred in the afternoon of Saturday, June 5 and involved a Hummer bus, belonging to Kano Line and a private Toyota Rav4 SUV.\n“More than 20 people were involved in the crash, 10 died on the spot and others died later at the Ahmadu Bello University Teaching Hospital (ABUTH), Zaria.\nHe said the governor thanked officials of the Federal Road Safety Corps who swiftly evacuated the injured and cleared the obstructions."
  },
  {
    "headline": "Igangan killings: Horrendous, callous, highly provocative — South West Govs",
    "summarized_story": "—- its an assault on decency, communal harmony, cowardly onslaught on a peaceful community— Amotekun to commence joint operations in the regionDayo Johnson AkureChairman South West Governors Forum, Rotimi Akeredolu has described the killings in lgangan, lbarapa, Oyo state as horrendous, callous, and highly provocative.\nAkeredolu in a statement he personally signed in Akure said that ” All well-meaning Nigerians must condemn, in the strongest term possible, this latest assault on decency and communal harmony.\n” It is horrendous, callous, and highly provocative.\nAll well-meaning Nigerians must condemn, in the strongest term possible, this latest assault on decency and communal harmony.\n“While we will encourage the security agencies to get to the root of this latest act of provocation, we have directed the Commanders of the South West Security Network, Amotekun, to convoke a joint security meeting of all Commanders in the South West with a view to commencing joint operations in the regionimmediately."
  },
  {
    "headline": "Twitter Ban: Nigerians cannot be prosecuted for offence unknown to Constitution — Ajulo",
    "summarized_story": "“Without prejudice to the rationale for the ban of the blogging site, it must be noted that the Nigerian democracy is a constitutional democracy based on the rule of law.\n” The Constitution of a nation is the fons et origo, not only of the jurisprudence but also of the legal system of the nation.\nIn Greek language, it is the alpha and the omega and the barometer with which Government actions are measured.\n“Without prejudice to the rationale for the ban of the blogging site in Nigeria, it is imperative to note that the provisions of Section 36(12) of the 1999 Constitution are clear to the effect no one shall be prosecuted for an offence not known to Law, Ajulo submitted..\n” I have carefully spectated the contents of our various penal laws and nowhere is a Citizen of the Country prohibited from receiving or disseminating information which as a right guaranteed under Section 39 of the Constitution,” Ajulo pointed out."
  },
  {
    "headline": "Ohanaeze youths talk tough as Mbaka gets DSS invitation",
    "summarized_story": "The Ohanaeze Ndigbo Youth Council, OYC, on Monday warned against what it called another onslaught against the Charismatic Enugu Priest, Rev.\n“I condemn the invitation because it is a plan by the Federal Government to silence Fr.\nMbaka: Don’t truncate peace in Enugu – Ohanaeze warns“But we warn that any plot against Mbaka must be resisted by Igbo youths, let nothing happen to him.\nWe are in the know that the FG is on the neck of Onaga to silence Mbaka.\nMbaka have not given up – Ohanaeze youths claim"
  },
  {
    "headline": "Ifa told us about COVID-19 pandemic, current agitations, now warning politicians",
    "summarized_story": "The Ooni of Ife, Adeyeye Enitan Ogunwusi Ojaja II, has warned politicians to desist from bad practices like lying, corruption and other vices that could ruin the country.\nOoni Ogunwusi sounded the warning on Sunday, during the activities marking the end of the 2021 World Ifa Festival.\nAccording to him, “In 2019, Ifa said there would be a pandemic but the world paid little or no attention, tagging it as idol worshiping.\n“In the corpus named OseKaran, Ifa revealed that most of our challenges are the handiwork of desperate politicians.\nIfa warned them sternly to desist from their evil ways or wait to face the wrath of Olodumare."
  },
  {
    "headline": "TB Joshua’s wife recounts last moment, how prophet was found unconscious",
    "summarized_story": "Wife of popular televangelist, Prophet Temitope Balogun Joshua also known as TB Joshua, Evelyn, has recounted her husband’s last moment.\nEvelyn disclosed that TB Joshua spent his last moments prayerfully and was concerned about India, following the cases of COVID-19.\nShe disclosed that the popular prophet was found dead in his office after conducting a service in the church.\nA source close to TB Joshua disclosed to DAILY POST that Evelyn recounted this during a meeting with some foreign visitors.\nOnly God can lessen our heartache – TB Joshua’s wife speaks“Afterward, he came up to shower and she left him to have some time to prepare for service as worship had started."
  },
  {
    "headline": "Fr. Mbaka defies Bishop Onaga’s order, cries out over DSS invitation",
    "summarized_story": "Ejike Mbaka resumed his Adoration Ministry yesterday, Sunday, after serving a 30-day ban.\nThis is coming amid reports that officials of the Department of State Services, DSS, were at the Adoration Ministry to invite the Clergyman to Abuja.\nDSS denies arresting Fr Mbaka after calls for Buhari’s sack“What will be, will be, it is a matter of time.\nMbaka under Bishop Gbuji, who went to Obasanjo in Aso Rock, face to face and spoke to him.\nMbaka will soon be quiet, you are wasting your time…”Insecurity: Fr Mbaka under attack for calling for Buhari’s impeachment"
  },
  {
    "headline": "Igangan killings: Convoke security summit now",
    "summarized_story": "The All Progressives Congress (APC) in Oyo State has described Saturday’s killings in Igangan, Ibarapa North Local Government Area, as one too many, and urged Governor Seyi Makinde to promptly convoke a security summit.\nThe APC said the summit would seek to find a lasting solution to the security challenges facing the state.\nRecall that several people were killed in Igangan, Ibarapa area of Oyo State on Saturday night when unknown gunmen invaded the community.\n“The excuse of general security issues has been with us in Nigeria since 2009 even before Ajimobi took over the mantle of governance in 2011.\nIn spite of the issues, Ajimobi secured Oyo State,” it said."
  },
  {
    "headline": "Truck kills final-year student in Delta",
    "summarized_story": "By Elo Edremoda, WarriA tipper truck at the weekend crushed a final-year female student of the Petroleum Training Institute, Effurun, Uvwie council area of Delta State.\nIt was learnt that the student, identified simply as Uwa, was trying to cross the road when the truck, without headlights and driving against traffic, knocked her down.\nUwa was an HND 2 student of the institution.\nThe driver of the truck was reported to have taken off after the incident to avoid a mob attack, but was held by some security officers.\nFollowing news of her death, angry students blocked the PTI Road in protest for several hours on Saturday."
  },
  {
    "headline": "Six robbery suspects arrested in Delta, Lagos",
    "summarized_story": "By Precious IgbonwelunduPolice have arrested six suspected robbers in Delta and Lagos states.\nFour of the suspects were apprehended in Delta, where some guns were also reportedly recovered, while two suspects were held in Lagos.\nDelta police spokesman Edafe Bright yesterday identified the suspects as Efe Oyenikoro, Felix George, Emmanuel Job and Joan Yapiteghe.\nADVERTISEMENTHe said the suspects were arrested on June 5 by the police who were on a stop and search on the busy Patani-Bayelsa Expressway.\nThe two suspects held in Lagos were alleged to have attempted to rob students writing Common Entrance examination at Amuwo Odofin Senior Grammar School, Old Ojo Road, Agboju."
  },
  {
    "headline": "Teen arrested on defilement charges in Adamawa",
    "summarized_story": "By Onimisi Alao, YolaADVERTISEMENTPolice in Adamawa State have arrested an 18-year-old boy for allegedly defiling a four-year-old girl.\nThe teenager took advantage of the minor being a close neighbour living with her grandmother, police said.\n“The Adamawa State Police Command, on 4/6/2021, apprehended an 18-year-old suspect for sexually assaulting a four-year-old baby,” the command said in a statement by spokesman Suleiman Nguroje.\nRead Also: Nollywood actor arrested on defilement chargesAccording to Nguroje, “The suspect, Ayuba Hamza, a resident of Jabbi Lamba village in Girei, took the advantage of the baby following the separation of her parents that brought her under the care and custody of her grandmother.\n“The grandmother who caught the suspect in the act, cried and attracted the attention of some neighbours.”He said the state Commissioner of Police, Aliyu Adamu Alhaji, had directed “discreet investigations into the case as the victim is under medical attention.”"
  },
  {
    "headline": "‘NIN, SIM incapable of tackling kidnapping, others’",
    "summarized_story": "He said the efficacy of using telephone numbers to track criminals was on the front burner of a conversation in 2019.\nLike Prof Sodiya, Teniola said satellite technology should be deployed along side location based service (LBS) which can monitor the signal of the kidnappers’ phone if they have one in close proximity with the victims.\n“When you have a SIM linked to a NIN, it is the information that is in the hands of the intelligence community that can be used to solve a crime.\nSo if the information is not being provided by the criminals in terms of registering NIN, how do you know who these criminals are?\nADVERTISEMENT“You can see we need more infrastructure; we need satellite imaging; we need CCTvs; we need other forms of technology combined holistically to be able to solve this problem."
  },
  {
    "headline": "Massacre in Oyo: 45 dead bodies recovered, Oba’s palace, 60 houses burnt, over 160 vehicles destroyed",
    "summarized_story": "From Oluseye Ojo, IbadanBlood flowed freely in Igangan, one of the seven principal towns of Ibarapaland in Oyo State, on Saturday night, as gunmen dispatched over 45 persons to their early graves in the town.\nSalihu was evicted from the town based on allegations of aiding and abeitting killings, kidnapping and destruction of farmland in the area.\nThe bandits, according to sources, were about 50 and they invaded the town on more than 20 motorcycles.\nWe are assembled here.”Police confirm incident, begin investigationThe Oyo State Police Command has confirmed the invasion of Igangan in Ibarapa zone of the state by unknown assailants during which many lives and property were destroyed.\nAlso, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, condemned the and call on residents of Igangan and the entire state to be calm."
  },
  {
    "headline": "Nigeria at crossroads as oil price nears $75 per barrel",
    "summarized_story": "Brent crude, the global oil price benchmark is gradually making a rebound with a barrel of oil likely to hit $75 in the weeks ahead and probably above, a development that signaled a ray of hope for the troubled sector which has battled a low price regime occasioned by the coronavirus pandemic since last year.\nIronically, while other oil producing countries with robust refining capacity are anxious to reap the gains of higher oil prices, Nigeria seems to be fretting because a higher price regime will definitely translate to increased cost of refining and higher fuel subsidy.\nOn the other hand, gains will be reaped for the country as its 2021 oil price projection was based on an estimate of $40 per barrel, indicating a daily gain of $57.6 daily for the country at 1.8 million barrels of oil production per day.\nWhile pump price steadily rose, the face-off between labour and Federal Government kept the latter in a tight corner.\nThe unions had earlier forced the government to reverse the pump price from N168 per litre last year to N162."
  },
  {
    "headline": "T.B Joshua: Buhari, Jonathan, govs, Kalu, others mourn",
    "summarized_story": "Condolence messages have been pouring in following the demise of Prophet TB Joshua.\n“Prophet Joshua was committed to giving and was more often, inexorably imbued with calmness while lifting the downtrodden.\nHe said he was saddened to hear about the death of T.B Joshua, at a young age of 57.\n“TB Joshua was a devout man of God who served God and humanity with relentless passion.\nProphet T.B."
  },
  {
    "headline": "How TB Joshua predicted his death",
    "summarized_story": "The statement titled Prophet TB Joshua – June 12th 1963 to June 5th 2021, read: “Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: ‘Time for everything – time to come here for prayer and time to return home after the service.’ God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, ‘The greatest way to use life is to spend it on something that will outlive it.’ Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\nHe cannot die like that, even in the next 10 to 20 years, TB Joshua cannot die.\nThe described TB Joshua as a man who was not tired of giving them food and making them happy.\nHe placed our children on scholarship and took care of them.”Mama Ezekiel’s said the late TB Joshua has been supportive since the demise of her husband."
  },
  {
    "headline": "Wike commissions 132-bed Mother and Child Hospital",
    "summarized_story": "From Tony John, Port HarcourtRivers State Government will, today, commission the Mother and Child Hospital.\nCommissioner for Information and Communications, Paulinus Nsirim, in a statement, yesterday, said the hospital was a bold attempt by Governor Nyesom Wike to boost infant and maternal health in the South South zone.\nThe 132-bed hospital has 50 delivery rooms, six modular operating theatres, in-vitro fertilisation, fluoroscopic and mammography equipment.\nNsirim said the foundation stone for Dr. Peter Odili Cancer and Cardiovascular Disease Treatment Centre to be located at Rumuokwuta,in Obio/Akpor Local Government Area, would be laid.\nBoth events, according to Nsirim, would have the Minister of Health, Osagie Ehanire, as special guest of honour."
  },
  {
    "headline": "SANs Fault Malami, Say No Legal Basis for Prosecuting Twitter Users",
    "summarized_story": "Chief Godwin Obla (SAN) described the suspension of Twitter as senseless and not legally justiciable because there is no order proscribing Twitter in Nigeria.\nIn effect, the digital world has become the new frontier for both good and evil.\nThis means majority of Nigeria’s one hundred and ninety million citizens are fully connected to this new digital world; especially our youth.\nFrom procurement to payroll to revenue collections, we are using digital platforms to reinforce our objectives of improving efficiency, accountability and transparency in governance.\nAs earlier observed, the digital world is borderless."
  },
  {
    "headline": "Despite Ban, Open Grazing Persists in Southern States",
    "summarized_story": "Onobus said Governor Godwin Obaseki was yet to come up with a bill to legalise open grazing.\nIn Delta State, open grazing persists in the forest, particularly in Ughelli, Abraka, Oghara in Delta South and Central Senatorial zones.\nDespite the anti-open grazing law in Oyo State, herders are still openly grazing their cattle in most areas of the state.\nThe ban on open cattle grazing was yet to be enforced in Imo State.\nEven in the Owerri, the capital city, as well as in other various villages and communities, open grazing still goes on unchecked."
  },
  {
    "headline": "CBN Increases Forex Allocation to Banks",
    "summarized_story": "Obinna ChimaThe Central Bank of Nigeria (CBN) yesterday announced the increase of foreign exchange (forex) allocations to banks to meet the requests of customers, particularly travellers, seeking forex for travel allowances, payment of tuition and medical fees, among other invisibles.\nHe added: “The CBN agreed to increase the amount allocated to banks for travellers, Small and Medium Enterprises among others.\nAccording to the source, Emefiele said the CBN management frowned upon the seeming difficulty customers experienced in accessing foreign exchange through the banks, particularly for Invisibles such as PTA and requests bordering on tuition and healthcare needs.\nEmefiele had last week reiterated the bank’s commitment to ensuring steady availability of foreign exchange for manufacturers.\nEmefiele had also urged banks as well as Nigerians to strive to end environmental pollution and ensure sustenance of banking principles."
  },
  {
    "headline": "Buhari, Jonathan, Akeredolu, Fayemi, Senators, Others Mourn TB Joshua",
    "summarized_story": "“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.\n“God has taken His servant, Prophet TB Joshua home – as it should be by divine will.\nBuhari, in a statement yesterday by his media adviser, Mr. Femi Adesina, said Joshua would be missed by his global followers.\n“TB Joshua was a devout man of God who served God and humanity with relentless passion.\nProphet TB Joshua lived and died for God."
  },
  {
    "headline": "Oyo Killings: South West Govs Urge People to be Vigilant, United in Defending Lives, Property",
    "summarized_story": "*Direct Amotekun to hold joint security meetingJames Sowole in AkureThe Governor of Ondo State and Chairman of South West Governors Forum, Mr Oluwarotimi Akeredolu, said the governors of the zone, have directed commanders of the zonal Security Network, Amotekun, to convoke a joint security meeting.\nAkeredolu said the convocation of the joint meeting became neccessary, so that they could discuss how to embark on joint patrol.\nThe governor stated this in a statement he personnaly signed in reaction to attack by bandits on Igangan Community in Ibarapa, Oyo State.\nAkeredolu’ said “This cowardly onslaught on a peaceful community has occasioned loss of lives and property on a large scale.\nIn addition, they must be united in the task of defending our lives and properties."
  },
  {
    "headline": "DSS Operatives Storm Adoration Ministry, Summon Father Mbaka To Abuja",
    "summarized_story": "Operatives of the Department of State Services have summoned controversial priest, Ejike Mbaka, to Abuja for questioning.\nSaharaReporters gathered that the operatives visited the church to drop the letter of invitation.\nMbaka, the Spiritual Director, Adoration Ministry Enugu, has attracted attention lately with his criticism of President Muhammadu Buhari government.\nIt will be recalled that the priest recently said God had rejected the President and unhappy with his leadership.\nReacting to the summon in a video obtained by SaharaReporters, Mbaka said, \"I got a call that the DSS people from Abuja came here (Enugu) with a letter of invitation to Abuja."
  },
  {
    "headline": "DSS Operatives Storm Adoration Ministry, Summon Father Mbaka To Abuja",
    "summarized_story": "Operatives of the Department of State Services have summoned controversial priest, Ejike Mbaka, to Abuja for questioning.\nSaharaReporters gathered that the operatives visited the church to drop the letter of invitation.\nMbaka, the Spiritual Director, Adoration Ministry Enugu, has attracted attention lately with his criticism of President Muhammadu Buhari government.\nIt will be recalled that the priest recently said God had rejected the President and unhappy with his leadership.\nReacting to the summon in a video obtained by SaharaReporters, Mbaka said, \"I got a call that the DSS people from Abuja came here (Enugu) with a letter of invitation to Abuja."
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "Nigerian Leaders Greedy, Clueless, Power-Drunk— Ex-INEC Chairman, Jega",
    "summarized_story": "Former Chairman of the Independent National Electoral Commission (INEC), Prof. Attahiru Jega says Nigeria has been plagued with the misfortune of leaders who are greedy for power and money.\nHe noted that Nigeria's present crop of leaders are not selfless in offering services to the country and also lack vision in leading their people.\n“One of the major challenges of good democratic governance in Nigeria is that of having selfless, patriotic, inclusive and effective leadership in order to drive Nigeria national affairs and the development of the political economy towards the goal of democratic governance.\nGetting things right would require selfless and visionary leadership.”He asserted that the late Jakande was undoubtedly a selfless leader.\nFrom his first day in office, he fulfilled his promises, his real world was a world of integrity.\""
  },
  {
    "headline": "Newspaper Headlines: Twitter ban worsens economic problems",
    "summarized_story": "The killing of at least 11 persons in Igangan, Ibarapa north LGA, Oyo state by herdsmen dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Newspaper Headlines: Twitter ban worsens economic problems",
    "summarized_story": "The killing of at least 11 persons in Igangan, Ibarapa north LGA, Oyo state by herdsmen dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Daily COVID Tracker: Infections decline as NCDC records 11 cases in three states",
    "summarized_story": "Nigeria on Sunday recorded 11 cases of COVID-19.\nJuliet Ogoh, disease surveillance and notification officer in Enugu South, said it was essential for residents to know their health status.\nAdvertisementTaiwan has seen a surge in COVID cases and has accused China of blocking its efforts to secure vaccines — a claim Beijing has repeatedly denied.\nNCDC confirms 11 COVID infectionsThe Nigeria Centre for Disease Control (NCDC) says 11 people tested positive for coronavirus on Sunday.\nArvind Kejriwal, Delhi chief minister of the national capital territory, said it is important to reopen the economy as COVID cases decrease."
  },
  {
    "headline": "Daily COVID Tracker: Infections decline as NCDC records 11 cases in three states",
    "summarized_story": "Nigeria on Sunday recorded 11 cases of COVID-19.\nJuliet Ogoh, disease surveillance and notification officer in Enugu South, said it was essential for residents to know their health status.\nAdvertisementTaiwan has seen a surge in COVID cases and has accused China of blocking its efforts to secure vaccines — a claim Beijing has repeatedly denied.\nNCDC confirms 11 COVID infectionsThe Nigeria Centre for Disease Control (NCDC) says 11 people tested positive for coronavirus on Sunday.\nArvind Kejriwal, Delhi chief minister of the national capital territory, said it is important to reopen the economy as COVID cases decrease."
  },
  {
    "headline": "Report: ISWAP confirms Shekau's death, accuses him of corruption",
    "summarized_story": "AdvertisementA police intelligence report shared with TheCable had quoted top commanders of ISWAP as saying Shekau blew himself up on May 19 following a confrontation.\nThe Boko Haram leader was said to have killed himself with a bomb “when he observed that the ISWAP fighters wanted to capture him alive”.\nIn a message obtained by HumAngle, Abu Musab Albarnawi, ISWAP leader, confirmed the death of Shekau.\nThe ISWAP leader said Shekau committed “unimaginable terrorism”, adding that he was apprehended “in the most humiliating manner”.\nTheCable has not independently verified Shekau’s death as the Boko Haram leader has been pronounced dead on at least four occasions, usually by the military."
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "WHY AGRO-CROWDFUNDING PLATFORM FARM SPONSOR IS RESCHEDULING SHORT-TERM PAYMENTS DESPITE INSURED OPERATIONS",
    "summarized_story": "The past few days has been quite a challenge as the company has been facing some difficulties which has destabilized our crowd funding operations.\nWe are taking appropriate measures to see that all funds collected from every sponsor will be paid back accordingly.\n• 128,000 birds per week state of the art hatchery.\nOur mid term strategy is through equity investment from institutional investors and we are willing to relinquish 30-50% of directors shares in the company.\nOur long term strategy would be direct revenue from the business, hence the 18-24 months."
  },
  {
    "headline": "FX trade doubles as Nigeria’s central bank restores market transparency",
    "summarized_story": "The Central Bank of Nigeria (CBN) is demonstrating its commitment towards the deepening of the foreign exchange (FX) market and the Nigerian financial market, as the apex bank, in collaboration with FMDQ Securities Exchange Limited (FMDQ) and FX authorised dealers (banks), activate an on-system trading and reporting of all FX transactions on the FMDQ-advised FX…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "How Nigeria’s 1999 Constitution is stifling economy",
    "summarized_story": "Nigeria’s 1999 Constitution began with a lie.\n“We the people of the Federal Republic of Nigeria having firmly and solemnly resolved, to live in unity and harmony as one indivisible and indissoluble sovereign nation under God…” But Nigerians were never consulted in the negotiation for this ‘indissoluble union’ now hurtling towards implosion.\nThe disparate groups…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigerian Banks FX trade turnover declines by 14.49%",
    "summarized_story": "The foreign exchange (FX) trade turnover between Nigerian banks in the Spot, Forwards and Futures markets for the week-ended June 4, 2021, declined by 14.49 percent to $1,069.71 million from $1,250.97 million reported for the week-ended May 28, 2021, according to FMDQ.\nThe week-on-week (WoW) decrease in turnover was driven by the 24.75% ($222.62 million)…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo to strengthen tax laws, eliminate cash payment to tackle evasion, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has said his government will enact new laws and strengthen existing laws to improve revenue collection, and address tax evasion and other corrupt practices in the system.\nObaseki disclosed this while addressing participants during a stakeholders’ engagement of the Edo State Transition Committee with artisan groups at the New Festival Hall, Government House, Benin City.\nHe said his government is working to eliminate all forms of cash payment for taxes across the State as it will minimise corrupt practices in the system.\nObaseki noted: “As a government, we are looking at all the processes of tax collection; we will ensure no more cash tax payment, as it will enable us to check corruption in the system.\n“We are simplifying the tax system in the State to encourage more people to key into the system."
  },
  {
    "headline": "ppointments: We‘ll select the best, tech savvy persons to drive our government’s vision – Obaseki – Nigerian Observer",
    "summarized_story": "I will get Special Assistants (SAs) from each ward across the six local government areas.\nLeaders must sit down to nominate qualified and the best people that will represent them well in government.\n“I will appoint three persons per ward, and one of them must be a woman.\nObaseki continued: “Leaders must meet at the local government level to nominate four persons each that will be appointed as Senior Special Assistants (SSAs).\n“I urge all the leaders in these council areas and wards to give me their very best as I thrive to build a world-class government."
  },
  {
    "headline": "Migration and IOM Perspective – Nigerian Observer",
    "summarized_story": "Recently, the International Organisation for Migration (IOM) organised a training programme for selected journalists in the print, radio, television and digital media spread across different states of Nigeria.\nIOM offers Technical Support for the implementation of Labour Migration policy Action Plan which aims at managing labour migration and mobilising diaspora for international development.\nIt helped review the National Labour Migration Policy and the National Policy on Migration to ensure that emerging migration issues were well captured and facilitated the high level meeting that led to the adoption of draft and final policies.\nIts migration policy based research contributes to evidenced-based policies on migration that address the needs of migrants and supports the national capacity to address them.\nIt is well positioned to build on its grassroots experience and provide guidance on migration policy."
  },
  {
    "headline": "Obaseki mourns death of Pastor TB Joshua – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of the General Overseer of Synagogue Church of All Nations, Pastor Temitope Balogun Joshua.\nIn a statement, the governor said he was saddened by the pastor’s death, noting that the deceased impacted the lives of millions of people across the world.\nAccording to him, “I am saddened by the news of the passing of Pastor Temitope Balogun Joshua, a great preacher of the gospel who impacted the lives of millions of people across the world.\n“Pastor Joshua deployed his gift of delivering the word of God in relatable terms to advance the church of Christ and brought laughter, solace and comfort to many with Christ’s message of love.”He added: “The Synagogue Church of All Nations, which Pastor Joshua superintended, was a home of refuge for those desirous of God’s word and also for the desolate, providing a beacon of hope to many worshippers from across the globe.\n“Pastor Joshua would be remembered for his devotion to God, the feisty manner he delivered Christ’s message of love and his commitment to community and the upliftment of mankind.”The governor commiserated with the Christian community, the Synagogue Church of All Nations and his family, and prayed that God grants all the fortitude to bear the irreparable loss."
  },
  {
    "headline": "Igangan Attack: Police confirm 11 people killed in Oyo community",
    "summarized_story": "The police in Oyo State have confirmed the death of 11 people in an attack on Igangan community in Ibarapa area of the state.\n“On 5th June 2021 at about 2310hrs, suspected armed bandits in their numbers invaded Igangan Community in the dead of the night to unleash mayhem on unsuspecting members therein.\n“This is one killing too many, I will not fold my arms seeing the blood of innocent people being shed like it is in Igangan,” Mr Adams said in his statement.\nThe federal and Oyo State governments frowned at the development, saying no citizen has the right to eject other citizens from wherever they wished to reside in the country.\nIn spite of the issues, Ajimobi secured Oyo State,” it said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anxiety as extrajudicial killings in S/East escalates",
    "summarized_story": "Gun-wielding troops of the Nigerian army had mounted various check points causing heavy traffic gridlocks that verged total standstill.\nNot too long ago, a group,Coalition of South East Youth Leaders (COSEYL) accused the military of extra judicial killings of youths in the zone.\nAnother is the unlawful killing of a first-year student, Divine Nwaneri, at a military checkpoint close to Imo Governor’s office.\n“These killings and more that happened in recent times are tangible proof that the military are on a secret mission to exterminate Igbo youths in the South East.\nThe Nigerian army claimed the group prompted a confrontation after blocking the motorcade of Nigeria’s army chief."
  },
  {
    "headline": "Nigerians groan as cost of living soars to record high",
    "summarized_story": "For months, Nigerians have been lamenting a steady increase in prices of goods and services.\nShe complained of low sales, as she said Nigerians are not to blame for this downturn, but the president.\n“The cost of pepper and tomatoes is as high as N18,000 this year compared to 2015 when a basket was sold for N4,000.\nThe traders also complained of over taxation and the high cost of transportation to Lagos.\n“President Buhari should come to our aid."
  },
  {
    "headline": "Controversies trail forceful opening of Idiroko border by Odua self determination agitators",
    "summarized_story": "OlusesanLaoyeControversies are still trailing the forceful open of the Idiroko border in Ogun State, South West of Nigeria by some angry youths, who claimed to be part of the groups agitating for the self determination of the Yoruba to have Oduduwa Republic.\nHowever, their jubilation was short lived as the security operatives launched a severe attack to repel the protesting youths, who forcefully opened the border.\nAlthough they were repelled at Idiroko, they informed journalists that the exercise would be a continuous one and they would from time to time, move from one border to the other in the South West.\nHe argued that the closure has affected the people of the state and those living at the border towns.\nWe do not support the forceful opening of the Idiroko border and we hope the Federal government would consider the plights of people who do legitimate business to open the borders”"
  },
  {
    "headline": "Dangote Refinery gets $10bn investment from banks",
    "summarized_story": "Adebayo ObajemuThe Central Bank of Nigeria (CBN) Governor, Godwin Emefiele, last week Friday disclosed that Nigerian banks and their foreign counterparts has invested between $9 billion and $10 billion in the Dangote Refinery, Fertilizer Plant and Petrochemical Company projects worth $17 billion.\nSpeaking during an assessment tour of the company in Ibeju-Lekki, Lagos, Emefiele said Dangote Industries contributed the rest as its own equity and capital.\nEmefiele said he was happy that one of the projects that were nurtured together with the bankers during his seven years at the apex bank is coming out successful.\nHe listed the local banks involved in the funding as Access Bank Plc, Zenith Bank Plc, United Bank for Africa Plc, First Bank of Nigeria Limited and Guaranty Trust Bank Plc"
  },
  {
    "headline": "Musabbabin Asarar Naira Miliyan 216 Da Masu Kiwon Kaji Na Katsina Suka Yi",
    "summarized_story": ""
  },
  {
    "headline": "Hadakar NEPC Da Jihar Ekiti Don Fitar Da Ayaba Kasar Waje Na Da Alfanu – Kwamishina",
    "summarized_story": ""
  },
  {
    "headline": "Abin Da Ya Sa Farashin Kayan Abinci Ya Ragu A Taraba",
    "summarized_story": ""
  },
  {
    "headline": "Tsarin Gwamnatin Tarayya Na Fitar Da Amfanin Gona Waje Zai Taimaka, Cewar Masani",
    "summarized_story": ""
  },
  {
    "headline": "Abinda Ya Sa Muke Son Gwamna Yahaya Bello Ya Shugabanci Nijeriya –YAP",
    "summarized_story": ""
  },
  {
    "headline": "World mourns cleric, philanthropist TB Joshua — Daily Times Nigeria",
    "summarized_story": "Joshua, pastor and founder of The Synagogue, Church of All Nations (SCOAN) passed on at the age of 57.\nJoshua, born on June 12, 1963 in Ondo State, Nigeria, reportedly stayed 15 months in his mother’s womb before he was born.\nAccording to the SCOAN website, Joshua attended St. Stephen’s Anglican Primary School, Ikare-Akoko, Ondo State, 1971-1977.\nIn 1987, Joshua founded SCOAN under the bridge that links Ejigbo and Egbe in Lagos State with just a few members.\nHe later established the Emmanuel TV station from Lagos which has wide viewership especially as it is on cable television."
  },
  {
    "headline": "Again, suspected herdsmen attack Igangan in Oyo, kill scores, burn...",
    "summarized_story": "*Gov, Speaker call for calmStephen Gbadamosi, IbadanSuspected herdsmen have, again, attacked the ancient town of Igangan in Ibarapa North Local Government Area of Oyo State,, killing many residents.\nThe bandits also burnt down the palace of the Asigangan of Igangan, Oba Lasisi Adeoye, as well as many vehicles, including a truck loaded with cassava tubers, and a fuel station.\nThe governor said: “I have received the shocking news of the attacks on residents of Igangan, Ibarapaland, in the early hours of this morning.\n“I condemn this unfortunate attack and sympathise with the families who lost their loved ones and properties.\n“These murderers are not tired and it is our collective responsibility to protect our lives, women, children and communities from these evil doers,” he said."
  },
  {
    "headline": "Gunmen raze police station in Delta, six robbery suspects felled —",
    "summarized_story": "By Nosa Akenzua, AsabaThe pervasive trend of burning of police stations, killing of officers, kidnappings and other heinous crimes by unknown gunmen across the states continued at the weekend.\nIn the early hours of Sunday, unidentified gunmen reportedly numbering about twenty razed down Ashaka Police Station in Delta State after sporadic shootings that saw policemen including residents of the community scampering for safety.\nIn the same vein, on the same Saturday, the men of Delta State Command while on stop and search duty along Patani-Bayelsa road intercepted A Sienna bus with Reg.\nSpeaking to Journalists in the area, an elderstateman, Chief Ezikiel Nwakaego said “We are seriously facing difficult times in Nigeria.\nNow it is Ashaka community, infact our police station has been set ablaze by these same rampaging gunmen who have been burning down police stations and killing policemen."
  },
  {
    "headline": "Bandits assault the birthplace of Nigeria’s first president, Nnamdi Azikiwe, capture chiefs and two wives",
    "summarized_story": "Armed robbers have kidnapped a traditional title holder and his two wives in Zungeru, Niger State, the birthplace of Nigeria’s first President, Dr. Nnamdi Azikiwe.\nSenator for Kaduna Central in the 8th Senate, Shehu Sani took to Twitter to lament the abductions on Sunday.\nHe wrote, “Bandits stormed Zungeru, Niger State the birthplace of Nigeria’s first President Zik and kidnapped a businessman and a traditional title holder and his two wives.\nA tragedy, a day.”READ ALSO: Breaking: Meghan Markle and Prince Harry welcomes Baby Girl, who will be named DianaSee tweet:Earlier, another Twitter user, @Sallamzy50, wrote, “Madakin Zungeru and his two wives kidnapped!\nYa Allah save our people”The Niger State Police Command has yet to confirm the abductions."
  },
  {
    "headline": "Twitter suspension: Job losses loom, economic woes to worsen, experts warn",
    "summarized_story": "The Nigerian Economic Summit Group and economic experts on Sunday described the Federal Government’s ban on a social media network, Twitter, as ill-advised.\nHe said, “The impact of Twitter ban on Nigerian economy is not good.\nHe said, “It (digital economy) is not just an enabler to the economy but a sector that we must mine to grow.\n“In a way, it is going to affect the digital economy.\nAccording to the statement by his Chief Press Secretary, Terver Akase, Ortom said, “The Twitter ban offers no solution to any of the myriad of problems facing the country."
  },
  {
    "headline": "Twitter suspension: Job losses loom, economic woes to worsen, experts warn",
    "summarized_story": "The Nigerian Economic Summit Group and economic experts on Sunday described the Federal Government’s ban on a social media network, Twitter, as ill-advised.\nHe said, “The impact of Twitter ban on Nigerian economy is not good.\nHe said, “It (digital economy) is not just an enabler to the economy but a sector that we must mine to grow.\n“In a way, it is going to affect the digital economy.\nAccording to the statement by his Chief Press Secretary, Terver Akase, Ortom said, “The Twitter ban offers no solution to any of the myriad of problems facing the country."
  },
  {
    "headline": "Bandits attack Katsina village, kill six, steal animals",
    "summarized_story": "Bandits on a reprisal on Saturday killed six villagers and injured no fewer than three others at Kanawa, in the Danmusa Local Government Area of Katsina State.\nIt was learnt that the bandits, said to be members of one Sani Doro group, invaded the village to retaliate the recent killing of one of them.\nSources said the bandits rode on 60 motorcycles to the village shortly after the 7pm Islamic prayers and started shooting.\nSome of the villagers reportedly fled and hid inside a bush during the attack.\nThe bandits reportedly ransacked the village and killed the six victims, while many others were reportedly injured."
  },
  {
    "headline": "Bandits attack Katsina village, kill six, steal animals",
    "summarized_story": "Bandits on a reprisal on Saturday killed six villagers and injured no fewer than three others at Kanawa, in the Danmusa Local Government Area of Katsina State.\nIt was learnt that the bandits, said to be members of one Sani Doro group, invaded the village to retaliate the recent killing of one of them.\nSources said the bandits rode on 60 motorcycles to the village shortly after the 7pm Islamic prayers and started shooting.\nSome of the villagers reportedly fled and hid inside a bush during the attack.\nThe bandits reportedly ransacked the village and killed the six victims, while many others were reportedly injured."
  },
  {
    "headline": "Rejected Cornerstone: How Adeboye, Oritsejafor, CAN, PFN blacklisted T.B. Joshua",
    "summarized_story": "Joshua is dead, one thing that he took to the grave was that he was rejected in the Christendom in Nigeria.\nThe likes of Pastor Enoch Adeboye, General Overseer, Redeemed Christian Church of Nigeria (RCCG), Pastor Ayo Oritsejafor, Bishop David Oyedepo and many others rejected Joshua until his death.\nJoshua can show me his pastor who pastored him before he said he was called into the ministry; if T.B.\nAccording to Oritsejafor, “We are not taking T.B Joshua but like I said, he too can repent and be converted tomorrow.\nT.B Joshua can say I accept Jesus Christ as my Lord and personal saviour; I repent of my sins."
  },
  {
    "headline": "Igangan: Southwest Governors tell all Amotekun corps to begin joint operations",
    "summarized_story": "The Southwest Governors have described as rude shock the attack on Igangan in Ibarapa LGA of Oyo state by suspected herdsmen.\nThey said the Igangan attack was a provocative onslaught, one too many.\nIn the aftermath, the governors have asked for a joint meeting of all the commanders of Amotekun now in five states, to enable them plot a synergy in terms of immediate joint operations.\n“We have just received with rude shock premeditated attack on our people at Igangan, Ibarapa, Oyo State, in the early hours of today.\n“While we will encourage the security agencies to get to the root of this latest act of provocation, we have directed the Commanders of the South West Security Network, Amotekun, to convoke a joint security meeting of all Commanders in the South West with a view to commencing joint operations in the region immediately."
  },
  {
    "headline": "Nigerian footballer Kelvin Odenigbo drowns in Belarus",
    "summarized_story": "By Kazeem UgbodagaTwenty-year-old Nigerian footballer, Kelvin Odenigbo who plied his trade at FC Vitebsk in Belarus has drowned in Lake Beloye.\nThe incident occurred on June 5, 2021 on the Lake Beloye in the area of ​​the tourist base “Verasy”OSVOD employees found the drowned Kelvin Odenigbo in the Lake.\nA statement issued by the club, Vitebsk on its website expressed condolences to the family and friends of the football player.\nThe statement reads: “We express our sincere condolences to the family and friends of the football player.\nThe football club “Vitebsk” reports that on June 5, 2021, on the lake “Beloye”, in the area of ​​the tourist base “Verasy”, OSVOD employees found the drowned Kelvin Odenigbo."
  },
  {
    "headline": "TB Joshua’s Wife Speaks On husband’s Death",
    "summarized_story": "Evelyn Joshua, wife of the founder of Synagogue Church of All Nations, Prophet T.B.\nShe told the public to seek refuge in God because losing a loved one can be heartbreaking.\nSeek refuge in him.”Last year, Joshua said he does not put his wife on the spotlight because only God could do so.\n“I would have loved my wife to be like me but I cannot make her what I am; it is God.\nAs much as you are ready for God, God will display you.”The couple wedded in 1990 and have three daughters together."
  },
  {
    "headline": "Rejected Cornerstone ; How Prophet TB Joshua Was Blacklisted By Adeboye, Oritsejafor, CAN, PFN",
    "summarized_story": "Pastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of Nigeria (RCCG), Pastor Ayo Oritsejafor, Bishop David Oyedepo, and many others all turned their backs on Joshua till he died.\nJoshua can show me his pastor who pastored him before he said he was called into the ministry; if T.B.\nJoshua can tell me when he got converted and how he got converted, then we would consider him.\nAccording to Oritsejafor, “We are not taking T.B Joshua but like I said, he too can repent and be converted tomorrow.\nT.B Joshua can say I accept Jesus Christ as my Lord and personal saviour; I repent of my sins."
  },
  {
    "headline": "DSS Operatives Storm Adoration Ministry, Summon Father Mbaka To Abuja",
    "summarized_story": "Ejike Mbaka, a controversial clergyman, has been called to Abuja for questioning.\nAccording to News Direct, the operatives went to the church to send off the invitation letter.\nMbaka, the Spiritual Director of the Adoration Ministry in Enugu, has recently drawn notice for his criticism of President Muhammadu Buhari’s administration.\nThe priest recently stated that God had rejected the President and was dissatisfied with his leadership.\n“I got a call that the DSS personnel from Abuja arrived here (Enugu) with a letter of invitation to Abuja,” Mbaka said in a video acquired by SaharaReporters in response to the summons."
  },
  {
    "headline": "BREAKING: DSS Operatives Storm Rev Father Mbaka’s Church, Summon Him To Abuja",
    "summarized_story": "It was gathered that the operatives visited the church to drop the letter of invitation.\nMbaka, the Spiritual Director, Adoration Ministry Enugu, has attracted attention lately with his criticism of President Muhammadu Buhari government.\nIt will be recalled that the priest recently said God had rejected the President and unhappy with his leadership.\nReacting to the summon in a video obtained by SaharaReporters, Mbaka said, “I got a call that the DSS people from Abuja came here (Enugu) with a letter of invitation to Abuja.\nWhat I cannot understand is that the mother church in Nigeria should be “cowed down” to lilliputian."
  },
  {
    "headline": "Amidst tension, security operatives kill 11 gunmen in Delta, Imo",
    "summarized_story": "And in yet another attack in Delta state, a police station was set ablaze with police killing six suspected kidnappers in a fierce gun duel.\nFive of the hoodlums were killed in action (KIA) including Joseph Uka Nnachi alias King of Dragons.\nDeltaMeanwhile, the Delta state Police command Sunday killed six suspected armed robbers and kidnappers terrorising the state.\nUnprovoked attacks on the police will not deter the police from providing the needed security in any community in Delta state,” the statement said.\nThe PPRO also said: “On 5/6/21 at about 2130hours, the men of Delta state command while on stop and search duty along Patani-Bayelsa road intercepted a sienna bus with Reg."
  },
  {
    "headline": "Senate probes Maritime Academy over ‘N1.05bn fraud’",
    "summarized_story": "The Senate, through its Committee on Public Accounts, has commenced investigation into alleged diversion and irregular withdrawal of N1.05 billion from United Bank of Africa by the Maritime Academy.\nHe told the Senator Mathew Urhoghide-led committee that the alleged diversion and withdrawals were made before he assumed office.\nI want an Ad-hoc Committee to be set up and get to the root of the matter,” he said.\nThe queryIn the query, the “Audit observed that the sum of N457 million released to the Academy on 13th December, 2012 was irregularly diverted to UBA account number; 1006476693.\nWas management as at the time of this report Risk Diversion of public fund for purposes other than intended?”"
  },
  {
    "headline": "Breaking: Day after T.B Joshua ‘s demise, another popular cleric is dead",
    "summarized_story": "Day after the founder of Synagogue Church of All Nations passed on, another popular cleric and General Superintendent of Redemption Ministries, Reverend Stephen Akinola is dead.\nAccording to BBC, one of the church Pastors confirmed the demise of Rev.\nAkinola on Sunday.\nAkinola was incharge of the Port Harcourt-based church.\nDetails loading…."
  },
  {
    "headline": "Groups advocate cancer teachings in school curriculum -NigPilot",
    "summarized_story": "International nongovernmental organizations, NGOs, the OCI Foundation, and the Nigeria Cancer Society, NCS have advocated the introduction of anti-breast and Anti-cervical cancer teachings into the curriculum of all senior secondary schools in Nigeria.\nSpecifically, the two organizations are collaborating to reduce the impact of cancer in the country through the Arm Our Youths, ArOY Health campaign which was started in 2019 and meant to cover all the states of the federation by 2025.\nThe decision was reached after a virtual meeting and award ceremony, organized by the Nigerian Medical Students Association, NIMSA, and sponsored by the President, OCI Foundation, Professor Chris Ifediora, who is also a Family Physician, Fellow of the Royal Australian College of General Practitioners.\nSpeaking at the meeting, the President, Nigeria Cancer Society, NCS, Dr. Adamu Al-Hassan disclosed that the group would also partner the First Ladies Against Cancer, FLAC with a view to addressing cancer related issues in Nigeria, especially through the health campaign.\nAccording to him, the virtual meeting is being worked out where all the first ladies involved, can participate in."
  },
  {
    "headline": "NSA orders for the dismantling of Illegal security outfits -NigPilot",
    "summarized_story": "The Office of the National Security Adviser has ordered the immediate dismantling of all illegal security outfits in the country.\nHead, Strategic Communication,Office of the National Security Adviser, Mr. Zakari Usman conveyed this order in a statement in Abuja.\nThe statement reads: “The Office of the National Security Adviser has observed with concern the proliferation of illegal security outfits in the country.\n“These illegal outfits have been masquerading and acting as part of the Nigerian security architecture while extorting, harassing and intimidating Nigerians.\n“One of such groups is NATFORCE which seeks to combat illegal importation of Arms, Ammunition, Light Weapons, Chemical Weapons and Pipeline Vandalism and has been involved in mounting of illegal roadblocks, conducting illegal searches, seizures and recruitment."
  },
  {
    "headline": "Anambra guber: I’ll emerge APC consensus candidate if any, Moghalu boasts",
    "summarized_story": "Prominent contender in the November 6 governorship election in Anambra State, Chief George Moghalu, has expressed confidence he’ll emerge as the preferred All Progressives Congress, APC, candidate should the party go for consensus.\nThere is presently no sign of the party adopting the consensus option but Moghalu remains upbeat there is possibility of discussion in that direction.\n“Since Consensus is not the only option, it is either direct primary, indirect primary or consensus.\n“I’m coming to the business with experience, with knowledge, with capacity, with integrity, with courage and determination to win the election.\nUdoedehe maintained that the party has no anointed candidate and it is ready to work with who ever emerge at the primary."
  },
  {
    "headline": "FG suspension of Twitter operations violates rights of citizens -NigPilot",
    "summarized_story": "Digital Rights Advocay Group under the aegis of Paradigm Initiative has said that the Federal Government’s (FG), s uspension of Twitter operations in Nigeria violates the rights of citizens.\nAccording to the statement, “The Federal Government of Nigeria announced its suspension of Twitter operations, that the application can be used as a platform for activities capable of undermining Nigeria’s corporate existence.\n“Many Nigerians read the announcement of the ban on Twitter as a reflection of the importance of the platform and other digital (social media) platforms to Nigerians in accessing information and disseminating the same.\n“A 2016 United Nations resolution affirms that the rights that citizens have offline must apply online.\nWe urge the Nigerian authorities to respect and enforce citizens’ fundamental rights as provided for by the Nigerian constitution and International human rights treaties that Nigeria is a party to”."
  },
  {
    "headline": "Prophet TB Joshua Dies At 57",
    "summarized_story": "﻿Popular Nigerian prophet and televangelist TB Joshua has died.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nREAD ALSO: TB Joshua Will Be Missed For His Spiritual Contributions, Philanthropic Gestures – BuhariPROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021“Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "20 Killed In Car Crash Along Kaduna-Kano Highway",
    "summarized_story": "No fewer than 20 people have lost their lives in an accident along the Kaduna-Kano road.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, confirmed this in a statement issued on Sunday.\nAccording to Aruwan, the bus was Kano-bound, while the SUV was headed for Zaria.\nEye-witness reports also confirmed that the crash was a head-on collision between the two vehicles, due to bad driving at a diversion point on the highway.\nGovernor Nasir El-Rufai who was saddened by the incident prayed for the repose of the souls of the deceased and also wished the injured quick recovery."
  },
  {
    "headline": "Security Agents Repel Attack On Imo Police HQ, Kill Five Gunmen",
    "summarized_story": "Security agents on Sunday repelled an attack on the Imo State Police Command Headquarters in Owerri and killed one Joseph Uka Nnachi alias King of Dragons, the suspected mastermind of series of attacks on police stations in the state.\nIn a statement issued by the Public Relations Officer of the Imo Police Command, Bala Elkana, the security operatives who repelled the attack comprised of men of the Army, Police Special Forces, and other supporting security agencies.\n“He confirmed that Dragon is the leader of the gang in Imo State reporting to their supreme leader Nnamdi Kanu.\nOther exhibits recovered from the gang are Assualt (AR) Rifle breach N0: 03018058; Assualt (AR) Rifle breach N0: 070007055; Assualt (AR) Rifle breach N0: 5801297; six locally fabricated Explosive Devices; Police beret cap; 7 AK47 Magazines fully loaded; one military cap; one military cardigan (Polo); one silver-coloured minibus with Reg N0: WAM-8673 B ABD and one Hummer Bus with Reg N0: KED-382 X laden with Explosive Devices.\n“So, the people who threatened me that they will make Imo ungovernable before Imo becomes ungovernable, they will be ungovernable themselves.”"
  },
  {
    "headline": "11 Killed As Gunmen Invade Igangan Community",
    "summarized_story": "Eleven people including some of the assailants have been killed with houses and vehicles burnt during an attack within Igangan community in the Ibarapa Area of Oyo State.\n“On 5th June 2021 at about 2310hrs (22:10 GMT), suspected armed bandits… invaded Igangan Community in the dead of the night,” Osifeso said in a statement.\n“In the process, eleven persons including some of the assailants were confirmed dead,” he added.\nEthnic tensions are not uncommon in Nigeria where more than 250 ethnic and linguistic groups live side by side.\nFiery rhetoric from some southern officials blaming northern Fulani for a surge in crime and kidnappings in their regions has stoked tensions."
  },
  {
    "headline": "PDP Caucus Threatens Legal Action Against FG Over Twitter Ban",
    "summarized_story": "The Peoples Democratic Party (PDP) caucus in the House of Representatives has threatened legal action against the Federal Government over its ban of Twitter operations in Nigeria.\nA statement by the leader of the caucus Kingsley Chinda on Sunday noted that the Nigerian government does not have the power to ban the social media platform, arguing that the action lowers the country’s image in the eyes of other democratic nations.\nREAD ALSO: Twitter Ban: There Is No Constitutional Authority To Support FG’s Peremptory Action – NBAThe caucus faulted the directive to the National Broadcasting Commission to license social media operators in the country, describing it as an attempt to introduce the ‘Social Media Bill’ by mere executive fiat.\nAccording to them, the move is a violation of the doctrine of separation of powers and an erosion of the rule of law.\n“Whilst, these manifestly undemocratic actions of government on its own is grave enough, we fear that it may be a precursor to more ominous actions of blotting out dissenting voices,” the lawmakers explained."
  },
  {
    "headline": "President Buhari mourns T.B Joshua, says he will be greatly missed all over the world",
    "summarized_story": "President Muhammadu Buhari has commiserated with the family and members of The Synagogue, Church of All Nations (SCOAN) on the passing of their father and founder, Pastor Temitope Balogun, popularly known as TB Joshua.\nIn a statement released by Special Adviser to the President, Femi Adesina, Buhari noted that the renowned televangelist will be missed by his followers all over the world not only for his spiritual contributions, but for touching many lives through philanthropic gestures.\nPresident Buhari urged Pastor Joshua’s followers to take solace in the knowledge that life is not measured and defined by chronological longevity but by enduring legacies and lives touched positively.\nHe also condoles with the government and people of Ondo State and prayed that God Almighty will accept the soul of the departed pastor."
  },
  {
    "headline": "Buhari, Osinbajo, Tinubu, others to speak at Book launch titled “APC’s Litmus Tests”",
    "summarized_story": "President Muhammadu Buhari, Vice President Yemi Osibanjo, Mr Bola Ahmed Tinubu, and other leaders of the All Progressives Congress, APC, are to speak at the public launch of a book titled “APC’s Litmus Tests,” written by Mr Salihu Lukman, Director-General of the Progressive Governors Forum.\nThis was contained in a press statement signed by APC’s former National Publicity Secretary, Mr Lanre Issa-Onilu on behalf of the Organising Committee.\nThe book, according to the statement, will help the APC strengthen its democratic credentials by promoting political stability, best practices, and good governance in Nigeria.\nAdvertisement“There is no better time to put this book together as APC grapples with the nitty-gritty of formative challenges.\nIts main agenda is to assist APC leaders and, indeed, all stakeholders in negotiating the next bend,” the statement read."
  },
  {
    "headline": "Mixed reactions as Church members, sympathisers mourn T.B Joshua",
    "summarized_story": "Hours after news broke that popular clergyman and founder of the Synagogue Church of All Nations (SCOAN), Temitope Joshua is dead, members of his church are yet to come to terms with the news.\nHundreds of sympathisers, some church members and other acquaintances thronged the area.\nThough there are conflicting reports on how he died, TVC news gathered that the popular clergyman had taken a break at about 2am, during a church service that started at 6pm on Saturday.\nBorn on June 12, 1963, Prophet TB Joshua, he had released a video few days ahead his 58th birthday.\nThe church also released a communique earlier announcing news of his death."
  },
  {
    "headline": "Nigeria: Central Bank Increases Forex Allocation to Banks",
    "summarized_story": "The Central Bank of Nigeria (CBN) on Sunday announced the increase of foreign exchange (forex) allocations to banks to meet the requests of customers, particularly travellers, seeking forex for travel allowances, payment of tuition and medical fees, among other invisibles.\nHe added: “The CBN agreed to increase the amount allocated to banks for travellers, Small and Medium Enterprises among others.\nSources at the meeting with the bank CEOs held to address the challenge faced by customers in accessing forex from their banks, said Emefiele warned that the CBN would deal with any bank that denies customers the opportunity to purchase foreign exchange for legitimate purposes.\nEmefiele had last week reiterated the bank’s commitment to ensuring steady availability of foreign exchange for manufacturers.\nEmefiele had also urged banks as well as Nigerians to strive to end environmental pollution and ensure sustenance of banking principles."
  },
  {
    "headline": "Despite Ban, Open Grazing Persists in Nigeria’s Southern States",
    "summarized_story": "Onobus said Governor Godwin Obaseki was yet to come up with a bill to legalise open grazing.\nIn Delta State, open grazing persists in the forest, particularly in Ughelli, Abraka, Oghara in Delta South and Central Senatorial zones.\nDespite the anti-open grazing law in Oyo State, herders are still openly grazing their cattle in most areas of the state.\nThe ban on open cattle grazing was yet to be enforced in Imo State.\nEven in the Owerri, the capital city, as well as in other various villages and communities, open grazing still goes on unchecked."
  },
  {
    "headline": "No Legal Basis for Prosecuting Twitter Users, Nigeria’s Senior Lawyers Tell Attorney General Malami",
    "summarized_story": "Chief Godwin Obla (SAN) described the suspension of Twitter as senseless and not legally justiciable because there is no order proscribing Twitter in Nigeria.\nIn effect, the digital world has become the new frontier for both good and evil.\nThis means majority of Nigeria’s one hundred and ninety million citizens are fully connected to this new digital world; especially our youth.\nFrom procurement to payroll to revenue collections, we are using digital platforms to reinforce our objectives of improving efficiency, accountability and transparency in governance.\nAs earlier observed, the digital world is borderless."
  },
  {
    "headline": "Nigeria: Southwest Governors Opt for Joint Security Operations after Suspected Herdsmen Attack Igangan",
    "summarized_story": "Governors in Nigeria’s southwestern states have ordered commanders of the region’s security network, codenamed Amotekun, to convoke a joint security meeting of all commanders with a view to commencing joint operations in the region immediately.\nOndo State Governor and Chairman of the South West Governors Forum, Rotimi Akeredolu, conveyed the decision of the governors in a statement on Sunday.\nThe move by the southwest governors comes less than 24 hours after an attack by suspected herdsmen on the people of Igangan in Oyo State where many people were reportedly killed.\nIt is, therefore, incumbent on all lovers of peace and freedom to rise against this current regression into savagery.\nOn this, there will be no compromise.”He also called on citizens in the region to report any suspicious movement in their communities to the security agencies."
  },
  {
    "headline": "Earth Tremor Measuring 2.6 on Richter Scale Recorded in Southwest Nigeria",
    "summarized_story": "An earth tremor of low magnitude occurred in Southwest Nigeria around 1100 GMT on Saturday, according to a report by the Obafemi Awolowo University, Ile-Ife.\nA statement signed by Adekunle Abraham Adepelumi, a professor of geophysics at the university, said the estimated epicentral distance of the tremor was between 108 and 113 km away from the measuring station at the Obafemi Awolowo University, Ile-Ife, Nigeria.\nFurther analysis showed that the epicenter was somewhere along the NW-SE direction of Ile-Ife, Osun State, Nigeria roughly placed closed to Omu-Aran in North-Central Kwara State.\nThe statement further said: “A normal fault mechanism along the Ifewara-Zungeru Transcurrent Fault system due to intra-plate seismicity was deduced.\nThis suggests that this fault system is still active.”"
  }
]