[
  {
    "headline": "Experts differ as Osinbajo says exchange rate artificially low",
    "summarized_story": "This is as he said the country could not get new dollars into the system, where the exchange rate was artificially low.\nThe Vice President said the artificially low exchange rate was deterring investors from bringing foreign exchange into the country.\n“We can’t get new dollars into the system, where the exchange rate is artificially low.\nWhen they say the market should drive the exchange rate, why shouldn’t the market drive the economic production and infrastructure in Nigeria?\n“What we are experiencing in the forex market is largely consequences of the CBN fixed exchange rate policy regime and administrative allocation of forex."
  },
  {
    "headline": "Remove ‘structural bottlenecks’ in non-oil sectors – AfDB president",
    "summarized_story": "The President of the African Development Bank, Dr Akinwumi Adesina, has said Nigeria must resolve its debt challenges “decisively” to kindle economic growth.\nHe also called on the authorities to remove the structural bottlenecks that limited the productivity and the revenue earning potential of the huge non-oil sectors.\nThe AfDB President who warned that Nigeria’s debt service to revenue ratio is high also acknowledged that the debt-to-GDP ratio remains “moderate.”He said economic recovery is probable when Nigeria eliminates “structural bottlenecks” that limit the revenue-earning potential of non-oil sectors.\n“The debt service to revenue ratio of Nigeria is high at 73 per cent.\n“What is needed for sustained growth and economic resurgence is to remove the structural bottlenecks that limit the productivity and the revenue earning potential of the huge non-oil sectors.”Copyright PUNCH."
  },
  {
    "headline": "Nigeria must tackle debt challenges, says AfDB president",
    "summarized_story": "The President of the African Development Bank, Dr Akinwumi Adesina, has urged the country to decisively tackle debt challenges, adding that debt service costs and poor foreign exchange policies are the major setbacks to the country’s economic growth.\nHe emphasised the need to fix the country’s economic structure.\nHe said, “Nigeria must decisively tackle its debt challenges.\n“The debt service to revenue for Nigeria is at 73 per cent.\nThe PUNCH had earlier reported that debt servicing rose to N2.9tn, gulping 74 per cent of the country’s revenue from January to August 2021."
  },
  {
    "headline": "Stop stigmatisation of mental health patients, Psychiatrist charges Nigerians",
    "summarized_story": "Africa’s premier celebrity psychiatrist and leading mental health advocate and coach, Dr Maymunah Kadiri, who called for an end to stigmatisation of people with mental illnesses, explained that social stigma, if not checked, often leads to institutionalised stigma and discrimination against mental health patients.\nUnfortunately, negative attitudes and beliefs toward people who have a mental health condition are common.\n“Discrimination may be obvious and direct, such as someone making a negative remark about your mental illness or your treatment.\nExamples include lower funding for mental illness research or fewer mental health services relative to other health care.\nOthers are health insurance that doesn’t adequately cover mental illness treatment, and the belief that you’ll never succeed at certain challenges or that you can’t improve your situation."
  },
  {
    "headline": "TrustBanc closes 3rd tranche of N10bn debt issue",
    "summarized_story": "By Peter EgwuatuTrustBanc Holdings Limited (TrustBanc), has said it successfully closed its series-3 Commercial Paper (CP) issue for a total amount of N4.2 billion on September 2, 2021.\nTrustBanc is rated A- by DataPro Limited and the issue was approved by FMDQ Securities Exchange Limited (FMDQ).\n“I would like to thank all the subscribers to this commercial paper issue.\nThe proceeds from the transaction will be utilised to finance the growing portfolio of assets within the TrustBanc Group.\nIn addition, our Group is proud to contribute to the growth of the Nigerian Debt Capital Market through the FMDQ “said Chief Executive Officer of TrustBanc Holdings Limited, Mr. Abu Jimoh."
  },
  {
    "headline": "Messi floats ball into goal in win over Uruguay",
    "summarized_story": "Lionel Messi became the first South American to score 80 international goals as his Argentina side beat Uruguay in World Cup qualifying.\nCaptain Messi opened the scoring for his side with a floated cross that somehow evaded the goalkeeper.\nRodrigo de Paul doubled Argentina’s lead before half-time, with Lautaro Martinez adding a third after the break.\nEverything worked out perfectly,” said Messi.\nOnce we got the first goal we started to find space and the goals appeared.”Argentina are now 24 games unbeaten and their latest win keeps up the pressure on Brazil in South America’s World Cup qualifying group."
  },
  {
    "headline": "Uzodimma condoles families of soldiers killed at Izombe, vows to arrest culprits",
    "summarized_story": "Governor Hope Uzodimma of Imo on Monday in Owerri commiserated with families of two soldiers killed on Friday at Izombe community in Oguta Local Government Area of the state.\nThe two soldiers and a resident were killed in a squabble between youths, who were collecting tolls from illegal oil bunkerers and oil thieves in the community.\nUzodimma also said it was no longer pardonable for people or any group of people to take the laws into their hands.\n“Fortunately or otherwise, the hoodlum was killed by the soldiers in the confrontation,’’ he said.\nThe governor assured the families of the slain security operatives that the death of the soldiers would not go in vain."
  },
  {
    "headline": "World Bank advocates debt relief for countries owing over $8.7trn",
    "summarized_story": "By Emma Ujah, Abuja Bureau ChiefThe World Bank has advocated debt relief for Low and Middle-Income Countries with a debt stock of over $8.7 trillion, as at 2020.\n“We need a comprehensive approach to the debt problem, including debt reduction, swifter restructuring and improved transparency,” said World Bank Group President David Malpass.\nNet debt inflows of external public debt to low-income countries rose 25% to $71 billion, also the highest level in a decade.\nIt said, “To facilitate transparency, International Debt Statistics 2022 was expanded to provide more detailed and disaggregated data on external debt than ever before.\nThe World Bank will also publish soon a new Debt Transparency in Developing Economies report that takes stock of debt transparency challenges in low-income countries and lays out a detailed list of recommendations to address them.”"
  },
  {
    "headline": "Killing of soldiers: Devilish persons at work – Nsukka LG disowns trending video",
    "summarized_story": "Cosmas Ugwueze has described as sheer mischief and falsehood a video showing the killing of soldiers and purported to have occurred in the Local Government.\nDAILY POST reports that the incident which occurred in another State is circulated by some persons as having taking place in Nsukka Local Government Area of Enugu State.\nIn a statement by Ejike Okpe, the Media Assistant to the Nsukka LGA Chairman, he described the claims as devilish.\nThe statement read:“The attention of the Government of Nsukka LGA, under the able leadership of Hon Barr.\nThe incident is clearly not within Nsukka LGA as no single military officer has ever been killed in any part of Nsukka LGA nor has a military vehicle ever been burnt down."
  },
  {
    "headline": "Reverting to gas will solve 90 per cent of Nigeria’s fuel problem – Aminu, Director NGEP",
    "summarized_story": "“We have more of gas reserve than petroleum and this gas reserve that we have, when well utilised, it will solve almost 80 per cent of our energy problem in the country.\n“There are a lot of health effects in using firewood as a result of the byproduct of burning the wood.\n“So, the essence of this programme is to roll out and throw more light on the importance of the Micro Distribution Centre and to highlight the concept of putting up the micro distribution centres as part of the National Gas Expansion Project.\nWith a Micro Distribution Center, it will be easier for whoever wants to use gas to access it because the centres are near to you.\nHe further said that the programme will also look at the possibility of training people on how to convert their vehicles, generators and other machines from using petroleum to the use of gas."
  },
  {
    "headline": "‘Child marriage is the deadliest sexual gender-based violence against girls’ – Inger",
    "summarized_story": "The Chief Executive Officer CEO, of Save the Children International SCI, Inger Ashing, has described child marriage as one of the worst things to ever happen to the girl-child.\nInger Ashing said: “Child marriage is one of the worst and deadliest forms of sexual and gender-based violence against the girls.\n“Childbirth is the number one killer of teenage girls because their young bodies aren’t ready to bear children.\nGovernments must prioritise girls and ensure they’re protected from child marriage and premature childbirth-related deaths.\nThe report said 44% of girls in Nigeria are married before their 18th birthday, one of the highest rate of child marriage globally."
  },
  {
    "headline": "Low-income countries’ debt rose to $860bn in 2020 – World Bank",
    "summarized_story": "The World Bank on Monday said governments around the world responded to the COVID-19 pandemic with massive fiscal, monetary, and financial stimulus packages.\nThe World Bank noted that external debt stocks of low- and middle-income countries combined rose 5.3% in 2020 to $8.7trillion.\nWorld Bank Group President David Malpass called for a comprehensive approach to the debt problem, including debt reduction, swifter restructuring and improved transparency.\nIn 2020, net inflows from multilateral creditors to low- and middle-income countries rose to $117 billion, the highest level in a decade.\nNet debt inflows of external public debt to low-income countries rose 25% to $71 billion, also the highest level in a decade."
  },
  {
    "headline": "Osun governor signs violence against persons bill into law",
    "summarized_story": "The Osun State Governor, Adegboyega Oyetola, has signed the Violence Against Persons (Prohibition) Bill into law.\nWhile assuring of his administration’s commitment to the security of citizens, Oyetola pledged that Osun would ensure full implementation of the law.\nHe disclosed that provisions have been made in the law for maximum protection of persons anywhere in the state.\nIn his words, “My assent to the Bill today marks the commencement of the law in our State.\nHe commended the Osun State House of Assembly for passing the Bill in record time."
  },
  {
    "headline": "Mbaka to Buhari: Fighter jets you are buying will destroy Nigeria",
    "summarized_story": "Ejike Mbaka, has warned President Muhammadu Buhari that the fighter jets he is acquiring will be used to destroy the country.\nRecall that President Buhari, last week, confirmed receipt of new fighter jets which he said will be deployed against any form of insecurity in all parts of the country.\nMbaka however warned that: “The jets you are buying are going to be used to collapse Nigeria.\nPlease, the first person to meet President Buhari after this message, should tell him that all these jets he is buying will be used to destroy Nigeria.\n“Use the money and solve the problem otherwise, you are buying jets that aggrieved people will take up and scatter you people."
  },
  {
    "headline": "We’re working on Kanu’s release -Ekweremadu",
    "summarized_story": "He also urged them to bring their influences to bear in the search for security and stability in Igbo land.\nEkweremadu’s admonition is coming, almost two months after the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, was arrested in Kenya and clandestinely brought to Nigeria.\nWe are working quietly and surely to address these issues, including finding a political solution to the Mazi Nnamdi Kanu matter.\nWe also did it in the case of Mazi Nnamdi Kanu in 2017.\n“The Igbo diaspora must show more than a passing interest in leadership recruitment at all levels in Alaigbo."
  },
  {
    "headline": "2022 Budget: 0.43% allocation insufficient for dilapidated airport facilities, aviation experts warn",
    "summarized_story": "By Chinelo ObogoExperts have expressed concern over the allocation of N71.3 billion for capital projects for the Ministry of Aviation in the 2022 budget presented by President Muhammadu Buhari last week.\nA total of N78,992,731billion which is 0.48 per cent of the total budget was mapped out for the Ministry of Aviation out of which N71,300,182 is for capital expenditure.\nOur aviation agencies are being underfunded and the BASA funds needs to be reinvested in some of this important capital projects.\nSome airports facilities need urgent attention.\nThe budget can be spent on these and not on non-aeronautical services like terminal buildings and its allied services,” he said."
  },
  {
    "headline": "Lagos CP warns #EndSARS anniversary protesters",
    "summarized_story": "The Lagos State Command of the Nigeria Police Force said credible intelligence at its disposal has revealed clandestine plans by some youths, individuals or groups to embark on protest today in commemoration of one year anniversary of #ENDSARS.\nHe said: “The Command wishes to use this medium to warn the youths, groups, or associations planning such protest to jettison the idea forthwith.\n“To forestall breakdown of law and order, the police will use all legitimate means within their constitutional powers to suppress the planned protest.\n“Therefore, parents and guardians are advised to warn their children against participating in the planned protest.\n“Meanwhile, the Commissioner of Police, CP Hakeem Odumosu assures all law-abiding residents of the state to go about their legitimate businesses without fear of harassment or intimidation."
  },
  {
    "headline": "God can give power to anyone He wishes to – Tinubu",
    "summarized_story": "The National Leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, says God can give power to anyone he wishes to give.\nThe APC National Leader said that what God expects from anyone he gives power to is that such a person uses the power for humanity.\n”We give glory to God who brought you (Tinubu) back with sound health and stronger vigour.\nObafemi Hamzat said that Tinubu’s return deepened his associates’ belief in God, as the APC National Leader’s full recovery from the knee surgery was a sign of strength and favour from God.\nThe Speaker said that he wondered why a ‘simple knee surgery’ became a national issue, but the solidarity shown towards Tinubu across ethnic divides indicates that the APC National Leader is an enigma."
  },
  {
    "headline": "Midterm Ministerial Performance Review Retreat in Photographs",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Osinbajo: Buhari is Nigeria’s Most Popular, Only Credible Leader Ever",
    "summarized_story": "Osinbajo stressed the need for Nigeria to remain an indivisible country, assuring that its challenges would soon be overcome.\nThe vice president spoke during an interactive session with top officials of the Nigerian High Commission in London.\nHe declared, “If you look at all of us sitting here, we represent all the geopolitical zones.\n“We need that level of credibility to be able to solve problems in our country.\n“Let us not be discouraged, let us be very confident, because our country will come out of all these problems and emerge stronger."
  },
  {
    "headline": "Tinubu: Only God Can Take My Life",
    "summarized_story": "*Gbajabiamila, Sanwo-Olu, Olamilekan say work has started for task aheadSegun JamesNational leader of All Progressives Congress (APC), Senator Bola Tinubu, yesterday, said only God, the giver of life, could take his life.\nTinubu made the remarks on Sunday at the Lagos House, Marina, in his “Thank you speech” during a reception to welcome him back home, organised by Governor Bababjide Samwo-Olu of Lagos State, on behalf of the state government.\nThe reception featured prayers for Tinubu, who expressed gratitude to God for bringing him back to Nigeria safely.\nGod is the giver of life and He alone can take it.\nWe thank you for your guidance, we pray, we will continue to enjoy your mentorship.”Hamzat said, “It is only God that is constant; He cannot sick."
  },
  {
    "headline": "Falana Writes AGF, Seeks Enforcement of $62bn Supreme Court Judgment against IOCs",
    "summarized_story": "Falana in the letter dated October 8, 2021, also threatened legal action against the AGF if he refuses to enforce the said judgment.\nHe wrote on behalf of his clients Professor Omotoye Olorode and Jaye Gaskia of the People’s Alternative Political Movement (PAPM).\nThe letter titled: “Request For Compliance with Judgment of The Supreme Court of Nigeria in Suit No SC.\nLet us consider that as a lost opportunity, the money was not in a cupboard, they have taken it.\n“As we await your reply to this letter please accept the assurances of our highest esteem and professional regards”, the letter added."
  },
  {
    "headline": "2022 Budget: National Assembly Gets N234bn",
    "summarized_story": "The President had last Thursday presented the 2022 Aggregate FGN Expenditure (inclusive of GOEs and project-tied Loans) projected to be N16.39 trillion, which was 12.5 per cent higher than the 2021 budget.\nThe proposed N134 billion as National Assembly’s statutory allocation for the 2022 fiscal year was N6 billion higher than the sum of N128 billion proposed by the Presidency in the 2021 budget estimates which was approved by the legislative arm.\nOther 2022 budget lines captured in the Statutory Transfer included: “N120 billion (against N110 billion proposed in 2021 estimates) for National Judicial Council (NJC); N46.172 billion (against N29.70 billion proposed in 2021 estimates) for North East Development Commission (NEDC); N4.5 billion (against N3 billion proposed in the 2021 estimates) for National Human Right Commission (NHRC); N98.712 billion (against N63.51 billion) for Niger Delta Development Commission (NDDC).\nIn all, a total sum of N24,835,805,231 was earmarked for the Office of the President which came under State House Operations and made up of N2,861,041,921 for overhead and N21,974,763,310 for capital expenditure.\nIn addition, the State House headquarters got a budget proposal of N12,313,408,181 with the components being N1,736,064,934 for personnel, N2,860,063,433 for overhead and N7,717,279,814 for capital."
  },
  {
    "headline": "Loan-borrowing Buhari Earmarks N77million For Aso Rock Rent, N400million To Replace Villa's Telecoms Infrastructure In 2022",
    "summarized_story": "Nigeria’s President, Muhammadu Buhari has earmarked N76.67 million for the payment of “Aso Rock rent.”The amount is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe N16.39 trillion budget has a deficit of N6.26 trillion.\nThe Minister of Finance, Zainab Ahmed, had said the government would source for more loans to fund the deficit.\nAccording to the budget, the replacement of Villa telecommunications infrastructure will cost N400,000,000.\nAbout N5, 231,101,743 was also earmarked for general rehabilitation and repair of fixed assets in the Aso Rock Presidential Villa."
  },
  {
    "headline": "Loan-borrowing Buhari Earmarks N77million For Aso Rock Rent, N400million To Replace Villa's Telecoms Infrastructure In 2022",
    "summarized_story": "Nigeria’s President, Muhammadu Buhari has earmarked N76.67 million for the payment of “Aso Rock rent.”The amount is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe N16.39 trillion budget has a deficit of N6.26 trillion.\nThe Minister of Finance, Zainab Ahmed, had said the government would source for more loans to fund the deficit.\nAccording to the budget, the replacement of Villa telecommunications infrastructure will cost N400,000,000.\nAbout N5, 231,101,743 was also earmarked for general rehabilitation and repair of fixed assets in the Aso Rock Presidential Villa."
  },
  {
    "headline": "2022 Budget: Loan-Borrowing Buhari Presidency To Spend N13billion On Presidential Jets, N2.3billion On Foreign, Local Trips",
    "summarized_story": "President Muhammadu Buhari will spend a total of N2,309,066,788 on foreign and local trips in 2022.\nThe figure is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe President is also expected to spend a total of N12.5 billion on the Presidential Air Fleet in 2022.\nAbout N1.6 billion is provided for the purchase of vehicles and spares.\nAbout N180,089,000 is provided for purchase of tyres for bulletproof vehicles, plain cars, CCU vehicles, platform trucks, jeeps, ambulances and other utility and operational vehicles."
  },
  {
    "headline": "2022 Budget: Loan-Borrowing Buhari Presidency To Spend N13billion On Presidential Jets, N2.3billion On Foreign, Local Trips",
    "summarized_story": "President Muhammadu Buhari will spend a total of N2,309,066,788 on foreign and local trips in 2022.\nThe figure is contained in the details of the 2022 Appropriation Bill that Buhari presented to a joint session of the National Assembly on Thursday.\nThe President is also expected to spend a total of N12.5 billion on the Presidential Air Fleet in 2022.\nAbout N1.6 billion is provided for the purchase of vehicles and spares.\nAbout N180,089,000 is provided for purchase of tyres for bulletproof vehicles, plain cars, CCU vehicles, platform trucks, jeeps, ambulances and other utility and operational vehicles."
  },
  {
    "headline": "Burkina Faso Opens Trial On 1987 Assassination Of Revolutionary Leader, Sankara",
    "summarized_story": "After 34 years of assassination of the country’s revered revolutionary leader, Thomas Sankara, Burkina Faso has commenced the prosecution of a former President Blaise Compaore and 13 others involved, Al-Jazeera reports.\nThe killing of Sankara, an icon of pan-Africanism, has for years cast a dark shadow over the Sahel state.\nSankara and 12 others were riddled with bullets by a hit squad in October 1987 during a putsch that brought his friend and comrade-in-arms Compaore to power.\nAl-Jazeera has reported that Compaore, the chief accused, stated through his lawyers last week that he would boycott the trial.\nThe former West African nation's leader will be tried in absentia by the military court in the capital, Ouagadougou."
  },
  {
    "headline": "Femi Adesina: FG making progress on insecurity -- but people mistake it for stagnation",
    "summarized_story": "Femi Adesina, presidential spokesperson, say the federal government has recorded progress in the fight against insecurity.\nAdvertisementThere has been an increase in incidents of kidnapping, banditry and attacks by gunmen across the country in recent times.\nSpeaking on Monday during an interview with Channels Television, Adesina said anyone assessing the present administration should compare the current level of insecurity with what obtained in previous administrations.\nAdvertisement“Can you compare the security situation today, as dire as it is, with 2015?\n“So, it will be disingenuous for you to say that there hadn’t been improvement in certain areas in security."
  },
  {
    "headline": "Femi Adesina: FG making progress on insecurity -- but people mistake it for stagnation",
    "summarized_story": "Femi Adesina, presidential spokesperson, say the federal government has recorded progress in the fight against insecurity.\nAdvertisementThere has been an increase in incidents of kidnapping, banditry and attacks by gunmen across the country in recent times.\nSpeaking on Monday during an interview with Channels Television, Adesina said anyone assessing the present administration should compare the current level of insecurity with what obtained in previous administrations.\nAdvertisement“Can you compare the security situation today, as dire as it is, with 2015?\n“So, it will be disingenuous for you to say that there hadn’t been improvement in certain areas in security."
  },
  {
    "headline": "Obaseki: Why Edo is yet to enact anti-open grazing law",
    "summarized_story": "Godwin Obaseki, governor of Edo, has explained why the anti-open grazing law is yet to be enacted in his state.\nAdvertisementThe governor said there is no value in having a law that cannot be enforced and implemented.\nTo sign a law is very simple, it doesn’t make sense to put out a law you cannot enforce.\nTo sign a law is very easy, it doesn’t make sense to put out a law that you cannot enforce.\n“Let us not play politics with this issue, let us deal with this issue honestly and openly."
  },
  {
    "headline": "Obaseki: Why Edo is yet to enact anti-open grazing law",
    "summarized_story": "Godwin Obaseki, governor of Edo, has explained why the anti-open grazing law is yet to be enacted in his state.\nAdvertisementThe governor said there is no value in having a law that cannot be enforced and implemented.\nTo sign a law is very simple, it doesn’t make sense to put out a law you cannot enforce.\nTo sign a law is very easy, it doesn’t make sense to put out a law that you cannot enforce.\n“Let us not play politics with this issue, let us deal with this issue honestly and openly."
  },
  {
    "headline": "$1 at parallel market weeks after CBN",
    "summarized_story": "Nigerian naira on Monday opened the week’s trading at N570 per dollar at the market – as vice president Yemi Osinbajo called for the devaluation of the currency.\nSince the suspension of trading information by abokiFX — citizens have resorted to street traders for the current parallel market rates of the local currency.\nThe Central Bank of Nigeria (CBN) had vowed to go after abokiFX and its founder Oniwinde Adedotun over “illegal foreign exchange transactions”.\nOsinbajo called on the CBN to allow the naira reflect the realities of the market.\nAt the official market, the currency dropped to N414.40 at the official side of the market, losing 0.02 percent."
  },
  {
    "headline": "China’s growing influence is transforming African tech",
    "summarized_story": "The African market offers Chinese companies and investors a growing young population expected to reach 1.7 billion by 2030.\nThese Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\n“Until African countries manufacture their own equipment, they’ll always be susceptible to international organisations having access to their data,” Tugendhat said.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "Google launches $50m equity-based investment fund for African startups",
    "summarized_story": "At the first-ever Google for Africa event, held virtually on Wednesday, Google announced the launch of a 50 million-dollar Africa Investment Fund, through which it plans to invest in African startups.\nSelected companies will be provided with access to Google’s employees, network and technologies, to help them build products.\nTargeted at early- to growth-stage startups, the new investment fund is equity-based, marking a significant shift in Google’s approach to investing in African startups.\nMeanwhile, the Google Black Founders Fund will invest in black-led startups in Africa by providing cash awards and hands-on support.\nGet the best African tech newsletters in your inbox“In the last year, we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Sub-Saharan Africa, said in an official statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "A Journey Through The Lives Of Four Women Doing Big Things In African Tech • Techpoint Africa",
    "summarized_story": "Share this article:The underrepresentation of women in the tech space continues to be a prevalent phenomenon in most parts of the world.\nIn Yanmo Omorogbe’s — Co-Founder, Bamboo — opinion, seeing more women do things in tech might encourage more women to come in.\nAdvertisementAs male-dominated as the tech space is, however, some women are making their mark, serving as a source of encouragement for more women to dive in.\nTo celebrate this year’s International Day for the Girl Child, Techpoint Africa spoke to four tech women about their work, life and how they’re navigating a male-dominated ecosystem.\nAnd it has grown over the years, and I hope it’ll continue to grow.”Through the scholarship, she has seen females enter the tech space."
  },
  {
    "headline": "Attend the Product-Led Growth (PLG) guide, for B2C mobile apps, founders’ meet and greet hosted by Netcore, in partnership with Techpoint Africa",
    "summarized_story": "In three words — product-led growth (PLG).\nBut, what does product-led growth actually mean?\nThis playbook is your pocket guide to understanding product-led growth in depth and uncovering key strategies to embracing and implementing a product-led strategy.\nB2C mobile apps have been implementing solutions to improve in-app user experiences without realising that these strategies tie back to product-led growth.\nProduct teams own product-led growthThe success of a PLG strategy is a lot about the product itself and a little less about the product teams."
  },
  {
    "headline": "The African woman’s tech journey, Payday’s $1m pre-seed, Nigeria’s bread scarcity",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nAccording to Techpoint Africa’s West African Startup Decade Report 2020, only 10% of startups with a female co-founder have raised $1 million.\nAdvertisementDespite these statistics, some African women have defied the odds and are gradually turning the tables in the tech scene.\nBut I found a thread on Twitter by Joshua Wong, co-founder, Tokyo Coding Club, about lessons for startup founders and thought I should share.\nWatchOpportunitiesTalentQL is organising a 1-week private bootcamp for African Startups’ CTOs, Engineering Managers & Tech Leads facilitated by Engineering Managers from FAAMG."
  },
  {
    "headline": "Criticism trails Nigeria’s failure to recognise fully vaccinated citizens",
    "summarized_story": "BusinessDay’s checks show that the travel portal filled on entry into Nigeria doesn’t differentiate between unvaccinated and fully vaccinated persons.\nAll travellers are required to self-isolate upon arrival for seven to 14 days whether fully vaccinated or not.\n“If the COVID-19 PCR test at the airport is not a racket, then Nigeria should at least recognise its own vaccination process.\nGiven that ethnic minorities are reported to have below-average uptake of vaccines, it is likely it would not have as big an impact on the relaxation of rules for fully vaccinated.\nSusan Akporiaye, president of the National Association of Nigeria Travel Agencies, (NANTA), told BusinessDay that discussions are ongoing to recognise fully vaccinated citizens and there would be some reconsiderations on that because if the UK can consider fully vaccinated travellers and remove some requirements for fully vaccinated Nigerians, likewise all other countries should do same."
  },
  {
    "headline": "Remote working fails to reduce prime office rents in Nigerian cities",
    "summarized_story": "Prime office rents in Nigerian big cities recorded a marginal increase in the first quarter of 2021 (Q1 2021), showing that working from home (WFH) triggered by the COVID-19 pandemic failed to reduce the cost of renting such properties.\nThe average prime office rent on Aba Road was N15,000 per square in 2021, up from N13,000 per square metre in 2020, representing a 15 percent increase.\nIn Wuze Zone 2, it was N65,000 per square metre in 2021, up from N58,000 per square metre in 2020, representing a 12 percent increase.\nIn 2020 it was N25,000 per square metre, but increased to N28,000 per square metre in 2021.\n“Co-working operators have been one of the acquirers of vacant office space globally."
  },
  {
    "headline": "Low-Income Country debt rises to record $860bn in 2020 says World Bank",
    "summarized_story": "The debt burden of the world’s low-income countries rose 12 percent to a record $860 billion in 2020, according to a new World Bank report.\nDebt reduction, restructuring, and transparency needed to help low-income countries overcome debt challenges, the World Bank said on Monday.\nExternal debt stocks of low- and middle-income countries combined rose 5.3 percent in 2020 to $8.7 trillion.\n“We need a comprehensive approach to the debt problem, including debt reduction, swifter restructuring and improved transparency,” said World Bank Group President David Malpass.\nInternational Debt Statistics (IDS) is a longstanding annual publication of the World Bank featuring external debt statistics and analysis for the 123 low- and middle-income countries that report to the World Bank Debt Reporting System (DRS)."
  },
  {
    "headline": "Edo to immortalise late Prof. Victor Uwaifo, as family rolls out burial plans – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has disclosed plans to immortalise late music maestro, Prof. Victor Uwaifo, for his contributions to the development of Edo State and the country.\nChief of Staff to the Governor, Osaigbovo Iyoha, disclosed this on Monday while briefing journalists at the Government House in Benin City.\nThis will be followed by Requiem Mass, as well as interment on the same day between1 and 3 pm.\nDay three, which is Saturday 16th, October 2021, there will be social activities at Garrick Playground, Ekenwan Road, Benin City, by 12 noon.\nThe four-day programme will end on Sunday 17th October 2021, with a Thanksgivings Service at Holy Cross Catholic Cathedral, Mission Road Benin City, from 11 am prompt."
  },
  {
    "headline": "NSCDC boss dismisses fraud, corruption allegations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Dr Ahmed Audi, Commandant-General of the Nigeria Security and Civil Defence Corps (NSCDC), on Monday in Abuja dismissed fraud and corruption allegations levelled against him on some social media websites.\nThe NSCDC management also frowned at the allegation in a statement issued by the Corps’ Public Relations Officer, Mr Olusola Odumosu.\nOdumosu said that the attention of the Corps management was drawn to a spurious allegation of fraud and massive corruption against Dr Audi.\n“While the Corps does not wish to join issues with anyone on the matter, the commandant-general and the management team wish to assure the public of its sincerity.\n“Sincerity to rejig, reform and restructure the Corps in line with clear ministerial directive to nip current security challenges in the bud,’’ he stated."
  },
  {
    "headline": "Edo govt does not owe monthly pension – Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said it pays pension to pensioners on or before 26 of every month and does not owe any pension to date.\nAndrew Emwanta JP, said the state government will continue to show commitment towards the welfare and wellbeing of pensioners in the state.\nHe said, “Edo State Government does not owe any pensioner their monthly pension.\nPensioners in Edo State get their monthly entitlement on or before 26 of every month.\nWhile some members of the Union are in support of the statutory deduction, others are against it.”He said the state government does not owe pensioners any debt whatsoever, as far as the issue of pension is concerned."
  },
  {
    "headline": "Edo Justice Ministry organises staff retreat, as New AG, Iyamu sets to mainstream MEGA Agenda – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Ministry of Justice has concluded plans to organise a retreat for its staff, aimed at setting an agenda and developing work plans to enable the ministry meet its statutory obligation to the people and government of Edo State.\nThe Attorney General and Commissioner for Justice, Oluwole Iyamu SAN, in a chat with journalists, said the retreat will be held at the John Odigie Oyegun Training Centre on Tuesday, October 12, 2021.\nAccording to him, “The Edo State Ministry of Justice, under the new Attorney General and Commissioner for Justice has hit the ground running.\nThe retreat is being organized to that effect in pursuit of the new assignment.\nGovernor into a tangible plan of action towards producing a Ministry of Justice that serves the needs of Edo people, leverages on all available technologies and is in compliance with world-class best standards.”..."
  },
  {
    "headline": "Umahi’s ex-aide, arrested for alleged hate speech, slumps; rushed to hospital",
    "summarized_story": "The Commissioner further alleged that Chikwere by the said publications has acted in violation of the Ebonyi State Cybercrimes (Prohibition)Laws No 012 of 2021.\nHe urged the Commissioner of Police to arrest and prosecute Mr Chikwere.\nCondemnations trail arrestMeanwhile, condemnations have continued to trail the arrest of Mr Chikwere.\nShe said: “This prattle cum hogwash peddled here by Uchenna Orji doesn’t worth the arrest of Mr Godfrey Chikwere.\nThe Secretary to the State Government had in a statement announcing his sack said Mr Chikwere was sacked in order to enhance service delivery."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Low-Income Country Debt Rises to Record $860 Billion in 2020 – World Bank",
    "summarized_story": "External debt stocks of low- and middle-income countries combined rose 5.3% in 2020 to $8.7 trillion.\n“We need a comprehensive approach to the debt problem, including debt reduction, swifter restructuring and improved transparency,” said World Bank Group President David Malpass.\nNet debt inflows of external public debt to low-income countries rose 25% to $71 billion, also the highest level in a decade.\nTo facilitate transparency, International Debt Statistics 2022 was expanded to provide more detailed and disaggregated data on external debt than ever before.\nInternational Debt Statistics (IDS) is a longstanding annual publication of the World Bank featuring external debt statistics and analysis for the 123 low- and middle-income countries that report to the World Bank Debt Reporting System (DRS)."
  },
  {
    "headline": "United States Consulate Opens Window on America in Abeokuta",
    "summarized_story": "United States Consulate General in partnership with the Olusegun Obasanjo Presidential Library officially opened the Abeokuta Window on America, its newest American Space and the 13th in southern Nigeria.\nIbelli expressed the Consulate’s optimism that the Abeokuta Window on America will build bridges between Nigerians and the American people, increasing mutual understanding, collaboration, and partnership.\nYoung people will benefit immensely from the free resources available at the Abeokuta Window on America,” Aderinwale added.\nA Window on America is a type of American Space located in over 150 countries worldwide.\nA full list and address of American Spaces in Nigeria can be found here."
  },
  {
    "headline": "Yoruba youth group hails Prince Anofiu Elegushi on birthday",
    "summarized_story": "Yoruba Council Of Youths Worldwide, (YCYW), has joined other well-wishers to celebrate the Asiwaju of Ikate Land, Opomulero Oodua Agbaye and current Hon.\nCommissioner for Home Affairs, Prince Anofiu Olanrewaju Elegushi on the occasion of his birthday anniversary.\n“Asiwaju, you remain a strong piller of hope and proud cultural ambassador and a distinguished servant-leader of the masses, Eti-Osa, Lagos State and Yoruba Land is indeed proud to have you as the Opomulero Oodua,” Hassan said.\n“Lẹẹkansi ẹku oríire ọjọ ibi yin loni, ẹmi yin aṣe ọpọlọpọ rẹ l’aiye, láàyè ninu alaafia, idera, ninu ọla ati ninu aiku tin ṣe baalẹ ọrọ.\n“Igba odun, odun kan ni Opomulero Oodua.”"
  },
  {
    "headline": "More ministers may go as Buhari opens cabinet performance review",
    "summarized_story": "More ministers may be headed for the exit door as President Muhammadu Buhari, today, declared open, the Mid-term ministerial performance review in Abuja.\nRecall that the president had on September 1, removed the Ministers of Agriculture, Mohammed Sabo Nanono, and Mamman Saleh, his power counterpart and replaced with the Ministers of Environment, Mohammed Mahmoud Abubakar, and Minister of State, Works and Housing, Abubakar Aliyu.\nHe had warned that exercise would be a continuous process, and his latest review has sparked uncertainly among his cabinet and other top government officials as to what lies ahead of them.\nSpeaking at the ceremony at the State House Conference Hall, he said he would stay throughout the two-day event to listen to all cumulative assessments over the last two years and some months.\nPresident Buhari noted that the idea of the assessment is to identify weak areas with a view to strengthening the ability of the government to deliver the goods to the people"
  },
  {
    "headline": "Pro-Osinbajo Group Donates Books To Public Schools In Nasarawa, Niger",
    "summarized_story": "A group promoting the leadership virtues of Vice President Yemi Osinbajo (SAN), the Osinbajo Grassroots Organisation (OGO) on Monday, October 11, 2021, commenced the distribution of educational materials to students of public secondary schools in some states across the Federation.\nLeader of the group, Mr. Sylvanus Foluso Ojo, said the group carried out the exercise to commemorate the Independence Day celebration with students of Government Secondary School, Guruku, Mararaba and Community Secondary School, Suleja both in Nasarawa and Niger States respectively, who were on holiday during the October 1 celebration.\nThe OGO leader noted that the outreach was targeted at extending such love to the younger ones, and for them to absorb the leadership qualities which are seeds to prepare them as responsible and patriotic leaders in the future.\nAddressing the students of Government Secondary School, Mararaba, one of the group’s officials, Mr. Akin Makanjuola, admonished them to emulate the Vice President to become good citizens of th country.\n“I will use the books given for my notes and also to always remember my VP, God bless him,” she added."
  },
  {
    "headline": "Pro-Osinbajo Group Donates Books To Public Schools In Nasarawa, Niger",
    "summarized_story": "A group promoting the leadership virtues of Vice President Yemi Osinbajo (SAN), the Osinbajo Grassroots Organisation (OGO) on Monday, October 11, 2021, commenced the distribution of educational materials to students of public secondary schools in some states across the Federation.\nLeader of the group, Mr. Sylvanus Foluso Ojo, said the group carried out the exercise to commemorate the Independence Day celebration with students of Government Secondary School, Guruku, Mararaba and Community Secondary School, Suleja both in Nasarawa and Niger States respectively, who were on holiday during the October 1 celebration.\nThe OGO leader noted that the outreach was targeted at extending such love to the younger ones, and for them to absorb the leadership qualities which are seeds to prepare them as responsible and patriotic leaders in the future.\nAddressing the students of Government Secondary School, Mararaba, one of the group’s officials, Mr. Akin Makanjuola, admonished them to emulate the Vice President to become good citizens of th country.\n“I will use the books given for my notes and also to always remember my VP, God bless him,” she added."
  },
  {
    "headline": "Kaduna Gov, el-Rufai, Reshuffles Cabinet",
    "summarized_story": "Kaduna State governor, Malam Nasir el-Rufai, on Tuesday, reshuffled his cabinet and assigned new portfolios to some commissioners and senior officials of State government.\nA statement issued by the special adviser to the governor on Media and Communication, Muyiwa Adekeye, disclosed that eight of the 14 commissioners swapped portfolios.\nAccording to the statement, Muhammad Sani Abdullahi, the Chief of Staff, returns to the Planning and Budget commission, the responsibility he “held with distinction during Malam El-Rufai’s first term.\n“Governor El-Rufai has also approved the deployment of the following officials: Umma Aboki, Permanent Secretary, Planning and Budget Commission; Murtala Dabo, Executive Chairman, Fiscal Responsibility Commission; Abubakar Hassan, DG, Kaduna State Contributory Health Management Authority; Tamar Nandul, MD, Kaduna Markets Development and Management Company; Khalil Nur Khalil, ES, Kaduna Investment Promotion Agency, KADIPA; Maimunatu Abubakar, GM, Kaduna Environmental Protection Agency, KEPA.\nThe statement added: “Malam Nasir El-Rufai has conveyed the state government’s gratitude for the service of Aliyu Saidu, former DG-KADCHMA and Lawal Jibrin, former GM of KEPA, who are leaving the government.”"
  },
  {
    "headline": "Kaduna Gov, el-Rufai, Reshuffles Cabinet",
    "summarized_story": "Kaduna State governor, Malam Nasir el-Rufai, on Tuesday, reshuffled his cabinet and assigned new portfolios to some commissioners and senior officials of State government.\nA statement issued by the special adviser to the governor on Media and Communication, Muyiwa Adekeye, disclosed that eight of the 14 commissioners swapped portfolios.\nAccording to the statement, Muhammad Sani Abdullahi, the Chief of Staff, returns to the Planning and Budget commission, the responsibility he “held with distinction during Malam El-Rufai’s first term.\n“Governor El-Rufai has also approved the deployment of the following officials: Umma Aboki, Permanent Secretary, Planning and Budget Commission; Murtala Dabo, Executive Chairman, Fiscal Responsibility Commission; Abubakar Hassan, DG, Kaduna State Contributory Health Management Authority; Tamar Nandul, MD, Kaduna Markets Development and Management Company; Khalil Nur Khalil, ES, Kaduna Investment Promotion Agency, KADIPA; Maimunatu Abubakar, GM, Kaduna Environmental Protection Agency, KEPA.\nThe statement added: “Malam Nasir El-Rufai has conveyed the state government’s gratitude for the service of Aliyu Saidu, former DG-KADCHMA and Lawal Jibrin, former GM of KEPA, who are leaving the government.”"
  },
  {
    "headline": "Allow Naira To Reflect Market Realities, Osinbajo Tells CBN",
    "summarized_story": "In view of the falling exchange rate in the market, Vice President Yemi Osinbajo has called on the Central Bank of Nigeria (CBN) to allow the naira reflect the realities of the market.\nAccording to him, the exchange rate is artificially low, saying this is deterring investors from bringing foreign exchange into the country.\nHe said, “As for the exchange rate, I think we need to move our rates to [be] as reflective of the market as possible.\n“We can’t get new dollars into the system, where the exchange rate is artificially low.\nIf you look at some of the interventions, you will find that those interventions are interventions that should be managed by ministries."
  },
  {
    "headline": "Alleged forgery: ICPC re-arraigns ex-presidential aide, Obono-Obla",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC), on Monday, arraigned a former presidential aide, Okoi Obono-Obla, on charges of falsification and forgery of school results.\nMr Obono-Obla was arraigned on the remaining five counts on March 17.\nObono-Obla denies charges, granted bailMr Obono-Obla, a former Senior Special Assistant to the President on Prosecutions, pleaded not guilty to the charges on Monday.\nAside from reducing the total number of counts to five, the commission also removed Mr Efe’s name from the charges leaving Mr Obono-Obla and Mr Ibrahim as the remaining defendants.\nThe prosecution alleged that by the transaction, the two defendants conspired to confer undue advantage on the second defendant, Mr Ibrahim."
  },
  {
    "headline": "Alleged forgery: ICPC re-arraigns ex-presidential aide, Obono-Obla",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC), on Monday, arraigned a former presidential aide, Okoi Obono-Obla, on charges of falsification and forgery of school results.\nMr Obono-Obla was arraigned on the remaining five counts on March 17.\nObono-Obla denies charges, granted bailMr Obono-Obla, a former Senior Special Assistant to the President on Prosecutions, pleaded not guilty to the charges on Monday.\nAside from reducing the total number of counts to five, the commission also removed Mr Efe’s name from the charges leaving Mr Obono-Obla and Mr Ibrahim as the remaining defendants.\nThe prosecution alleged that by the transaction, the two defendants conspired to confer undue advantage on the second defendant, Mr Ibrahim."
  },
  {
    "headline": "Alleged N6.9Billion Fraud: Court fixes date to resume Fayose’s trial",
    "summarized_story": "A Federal High Court in Lagos, on Monday, further adjourned until December 1, 2, and 3, for the continuation of the trial of former Governor of Ekiti, Ayodele Fayose, over alleged N6.9 billion fraud.\nThe judge had urged parties to take new dates within the year, especially as no progress had been made in the matter since resumption.\nThe News Agency of Nigeria (NAN) recalls that Mr Fayose is being prosecuted by the Economic and Financial Crimes Commission (EFCC) over N6.9billion fraud and money laundering charges.\nHe had pleaded not guilty to the charges and was granted bail on 24 October , 2018, in the sum of N50 million with sureties in like sum.\nHe had also pleaded not guilty to the charges and was allowed to continue the earlier bail granted, while the case was adjourned for trial."
  },
  {
    "headline": "Alleged N6.9Billion Fraud: Court fixes date to resume Fayose’s trial",
    "summarized_story": "A Federal High Court in Lagos, on Monday, further adjourned until December 1, 2, and 3, for the continuation of the trial of former Governor of Ekiti, Ayodele Fayose, over alleged N6.9 billion fraud.\nThe judge had urged parties to take new dates within the year, especially as no progress had been made in the matter since resumption.\nThe News Agency of Nigeria (NAN) recalls that Mr Fayose is being prosecuted by the Economic and Financial Crimes Commission (EFCC) over N6.9billion fraud and money laundering charges.\nHe had pleaded not guilty to the charges and was granted bail on 24 October , 2018, in the sum of N50 million with sureties in like sum.\nHe had also pleaded not guilty to the charges and was allowed to continue the earlier bail granted, while the case was adjourned for trial."
  },
  {
    "headline": "Nigeria has debt challenge: AfDB boss Adesina disagrees with Buhari",
    "summarized_story": "President of the African Development Bank Group (AfDB), Dr. Akinwumi Adesina said Nigeria has a debt challenge, with debt service gulping 73 percent of government revenue.\nAdesina said Nigeria’s debt service to revenue ratio is high at 73%.\n“The debt service to revenue ratio of Nigeria is high at 73%.\nAccording to him, the African Development Bank will invest $3 billion in support of local pharmaceutical industries in Africa, including in Nigeria.\n“Nigeria must revamp its local pharmaceutical industry and launch strategic investments for local vaccine manufacturing."
  },
  {
    "headline": "How I originated Afro Trap sound",
    "summarized_story": "Kenneth ‘Klef’ Ofigho better known by his stage name “Big Klef” is a California based Nigerian artiste.\nHe burst onto the Nigerian music scene in 2013 with his hit single “IDIAGBON”.\nMy name is Kenneth Ofigho but most people know me by my stage name ‘BIG KLEF’ or simply Klef.\nBig Klef seems to be in his own lane.\n2020 was a tough year for many in the music industry because of the COVID-19 necessitated lockdown."
  },
  {
    "headline": "2023 Presidency: There Is An Attempt To Cause Conflict Between Osinbajo And Tinubu – Buhari’s Aide Says",
    "summarized_story": "), says there is an attempt to cause conflict between the National Leader of All Progressives Congress, Bola Tinubu; and Vice-President Yemi Osinbajo in the forthcoming presidential election adding that such attempt will fail.\nWith the rising clamour for a Southern President in 2023, there have been reports that Tinubu and Osinbajo might be individually interested in the presidency seat though both men have yet to declare any intention to contest the exalted office in 2023.\nThe statement was titled, ‘2023 Presidential Election: No To Divisive Politics, Attempts To Foist A Crack Between Osinbajo, Tinubu Will Fail’.\nAsiwaju Bola Ahmed Tinubu and Vice President Yemi Osinbajo are members of same party.\nThe APC remains one single, indivisible party and Osinbajo remains a loyal member of the party who respects both the party structure as well as its leadership."
  },
  {
    "headline": "El-Rufai appoints 28-year-old Khalil as head of Kaduna investment agency",
    "summarized_story": "Khalil Nur Khalil, a 28-year-old, has been appointed as executive secretary of Kaduna Investment Promotion Agency (KADIPA) by Nasir el-Rufai, the state governor.\nPrior to his appointment, Khalil was the investment intelligence director at KADIPA — the youngest person to assume the role in the history of Kaduna.\nJaafaru Sani, Thomas Gyang, Halima Lawal, Ibrahim Hussaini, Shehu Usman Muhammad, Muhammad Sani Abdullahi, Kabir Mato and Idris Nyam were assigned to the ministries of environment, works, education, agriculture, local government, business, innovation and sports respectively.\nBalaraba Aliyu-Inuwa was appointed administrator, Zaria Metropolitan Authority; Muhammad Hafiz Bayero as administrator, Kaduna Capital Territory; and Phoebe Sukai Yayi as administrator, Kafanchan Municipal Authority.\nTamar Nandul was appointed MD, Kaduna Markets Development and Management Company; and Maimunatu Abubakar, GM, Kaduna Environmental Protection Agency (KEPA)."
  },
  {
    "headline": "Imo grounded as IPOB’s sit-at-home order continues",
    "summarized_story": "Owerri, the Imo State capital, was grounded on Monday despite the cancellation of the weekly sit-at-home order by Indigenous People of Biafra.\nEven state and federal government employees were absent from workplaces even as streets stalls were locked.\nThe development was a sequel to the last Monday’s stampede in Owerri, following the speculation that some hoodlums were enforcing a sit-at-home order in the state.\nAs of 2pm, the government roundabout was deserted, even as youths were seen on major roads playing football.\nParents refused to take their children to school following the pandemonium which took place last Monday."
  },
  {
    "headline": "Abuja Court Orders EFCC To Remove AIT Founder, Raymond Dokpesi From Watchlist",
    "summarized_story": "The Court of Appeal sitting in Abuja had on April 1, this year dismissed the N2.1 billion naira money laundering charges filed against Dokpesi by the EFCC.\nThe court upheld the no-case submission filed by Dokpesi and DAAR Communications in the seven-count criminal charge.\nThe appellate court had held that the ingredients of the offences were not provided by the prosecution as required by law.\nNot satisfied with the ruling of the high court, Dokpesi approached the Court of Appeal and asked that the ruling of the lower court be set aside and his no-case submission be upheld.\nCourt orders EFCC to unfreeze Dokpesi’s N2.1B bank account, release seized documents"
  },
  {
    "headline": "Pictures: Robo queens shock Bayelsa queens in Flying Officer’s Cup defeat, Confluence queens wallop SGH Academy",
    "summarized_story": "Defending Champions, Bayelsa Queens, suffered a 1-0 defeat in the hands of rivals FC Robo Queens in what was the repeat of the 2021 AITEO Cup final.\nNeither side produced any chances of note after 15 minutes of play as Bayelsa Queens look happy to invite FC Robo Queens into their own half.\nOsun Babes had to come from behind in the second game of the day to secure a 2-1 win over Prince Kazeem Eletu Queens FC.\nMega Cynthia had given Prince Kazeem Eletu Queens the lead in the 42nd minute before Ebere Oleka equalised for the Omoluabi Queens in the 52nd minute when she found a free space upfront and rounded off Adesoji Esther in goal for Prince Kazeem Eletu Queens.\nThree more goals from Arit Usang, Godson Orjiugo and Suliat Hassan handed Confluence Queens the biggest victory thus far at the 2021 Flying Officers Cup."
  },
  {
    "headline": "Dokpesi on PDP 2023: For equity, North must have PDP presidential ticket",
    "summarized_story": "A member Board of Trustees (BoT) Peoples Democratic Party (PDP) Dr Raymond Dokpesi has said for equity, fairness and justice, the party must zone its presidential ticket for the 2023 general elections to the North.\nAlthough the report was silent on the presidential ticket, stakeholders believed it simply implied the party’s presidential ticket is coming from the south.\nDokpesi faults partyBut faulting the party’s position, Dr. Dokpesi argued that with the south having 14 of the 16-year PDP rule, it would be unjust for the south to still take another short at the party’s presidential ticket.\nWe came to 2015, the PDP had done 16 years in power, if you like, 14 years of the South, two years of the north.\nNow, in 2015, when we fielded in PDP, Jonathan, the north had started clamouring, agitating, saying it is their turn."
  },
  {
    "headline": "Breaking: Fuel scarcity averted as NUPENG calls off proposed strike",
    "summarized_story": "The Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) on Sunday evening has called off its proposed strike.\nNUPENG’s President, Comrade William Akporeha, and the General Secretary, ComradeAfolabi Olawale revealed this in a press statement.\nPart of the statement reads: “The leadership of the Nigeria Union of Petroleum and Natural Gas Workers hereby announced the suspension of the intended withdrawal of the services of Petroleum Tanker Drivers earlier scheduled to commence midnight of Sunday, 10th October 2021 following the understanding reached with the Union by the management of NNPC at a meeting held in Ibadan, Oyo State, today, 10th October 2021 and the expected outcome of the follow up meeting that is scheduled to hold on Tuesday, 12, October 2021 in Abuja as contained in the communique issued today.\n“The suspension of our planned action is predicated on our belief that the understanding reached with the government today as well as at meeting of Tuesday 12th, October 2021 will be fulfilled to the letters.\n“We wish to clearly made it known to all well meaning Nigerians that have variously appealed to us on these issues that our plan was not intended to inflict further pains on Nigerians but to ensure observance of minimum safety on our highways for the good of lives and properties.”"
  },
  {
    "headline": "Poultry farmers lament high cost of eggs’ production -NigPilot",
    "summarized_story": "Poultry Farmers Association of Nigeria, PFAN in Kwara State has raised the alarm that the high cost of eggs production, particularly the raising of chicken, has discouraged a lot of poultry farmers from being in the business.\nSpeaking at an event to mark World Egg Day and the 20th anniversary of the global event, the state chairman of PFAN, Mr. Ojo Akinwumi Richard lamented that poultry farmers are presently running at loss.\nHe, therefore, appealed to the federal government to allow the importation of poultry feeds into the country, noting that Nigerian farmers cannot produce enough grains to meet poultry feeds production.\nThe chairman, however, assured at this year’s event, tagged: “Eat your egg today and every day” that the association would continue to do its best in making eggs available for Nigerians.\nSola-Ojo said: “Egg is highly nutritious with about 13 vitamins, except Vitamin C. It has Omega 3 Fatty Acids and all the essential Amino Acids."
  },
  {
    "headline": "2023: Adamu heads APC reconciliation cmttee, vows to excel where Tinubu, Akande failed -NigPilot",
    "summarized_story": "Ahead of the 2023 general elections, leadership of the ruling All Progressives Congress, APC, has inaugurated a national reconciliation committee to mend fences among different warring gladiators in the party.\nSpeaking Monday at the national secretariat of the APC after another National Reconciliation Committee was inaugurated, Senator Adamu, who was appointed to lead the new panel promised a great deal.\nWhen asked about what his committee can achieve compare to the two previous reconciliation panels, the former governor said: “Somehow, all the members of the National Reconciliation Committee that I have seen are positive.\n“Consult with larty leaders and concerned members as the committee deems necessary with a view to achieving peace therein.\n“Your report on resolution of these discrepancies would indicate our readiness as a united and strong family for the national convention."
  },
  {
    "headline": "2021 Girl Child Day: Group advocates increased access to digital literacy for girls -NigPilot",
    "summarized_story": "The need to open more access to digital literacy for girls so that they can compete favorably with their male counterparts has been emphasized.\nThe group also organized a digital Training session for girls at Govt Junior secondary school Damagasa in Lokogoma Abuja.\nOur Generation.” emphasizes the imperativeness of digital literacy and inclusivity for the Girl Child.\nThe implication of this is that girls are also less likely than boys to use and own devices, and gain access to tech-related skills and jobs.\nEmpower Her 4 Africa, therefore, called on government and relevant authorities to increase access to digital education and devices for girls, while also demanding that all schools be equipped with functional state-of-the-art digital laboratories to boost access to digital literacy for girls."
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Buhari Approves N13.3bn For Take-Off Of Community Policing Initiative",
    "summarized_story": "﻿President Muhammadu Buhari on Monday approved N13.3 billion for the take-off of the Community Policing initiative as part of efforts to boost security nationwide.\nBuhari disclosed this in Abuja at the opening of a two-day Mid-Term Ministerial Performance Review Retreat to assess progress made towards the achievement of the nine key priorities of his administration.\n“We have also approved the sum of N13.3 billion for the take-off of the Community Policing initiative across the country, as part of measures adopted to consolidate efforts aimed at enhancing security nationwide,” he said.\nOn other efforts to strengthen national security, Buhari said it was gratifying to note that Nigeria had received six A-29 Super Tucano aircraft.\nHe said the propeller-driven aircraft are being used for training, surveillance and attack by the military."
  },
  {
    "headline": "Man Slumps As Edo Pensioners Stage Protest",
    "summarized_story": "An elderly man on Monday collapsed in Edo State as retirees protested over their unpaid pensions and gratuities by the state government.\nOne of the pensioners, Godwin Egbon, told Channels Television that whenever there is a salary increase, pensions should also be increased by the same percentage.\n“The Constitution says whenever there is salary increase, pensioners’ pension should also be increased by the same percentage but nothing is being said and nothing is being done,” he said.\nSpecial Adviser to the Governor on Media, Crusoe Osagie said the state government does not owe the pensioners a dime.\nWhatever happened today with pensioners’ protest didn’t have anything to do with protests being owed because this state government does not owe a penny.”"
  },
  {
    "headline": "Policewoman Missing As Hoodlums Attack Divisional HQ In Enugu",
    "summarized_story": "Yet-to-be identified hoodlums have attacked a police divisional headquarters in Enugu, authorities at the state command have said.\nThe whereabouts of a policewoman, attached to the facility, is unknown following the incident which occurred on Saturday evening.\nPolice Public Relations Officer in Enugu, Daniel Ndukwe, confirmed this in a statement on Monday.\nIn another statement, he confirmed the killing of a young man identified as Stephen Ajah by yet-to-be-identified armed men.\nAlthough he did not state when the killing occurred, the command’s spokesman explained that the incident took place along the Ozalla-Agbani Road in Nkanu West LGA."
  },
  {
    "headline": "Forex Rates Should Reflect Market Realities – Osinbajo Tells CBN",
    "summarized_story": "﻿Vice President Yemi Osinbajo on Monday said Nigeria’s official exchange rate is “artificially low”.\nHe made the remark during a speech at the Midterm Ministerial Performance Review Retreat which was held at the Banquet Hall, Presidential Villa, Abuja.\n“As for the exchange rate, I think we need to move our rates to be more reflective of the market as possible,” Osinbajo said.\nWe can’t get new dollars into the system when the exchange rate is artificially low.\n“So I’m convinced that the demand management strategy currently being adopted by the CBN needs a rethink."
  },
  {
    "headline": "Burkina Starts Trial Of Alleged Killers Of Sankara",
    "summarized_story": "A military court in Ouagadougou on Monday began the long-awaited trial of 14 men, including the former president, accused in the assassination of Burkina Faso’s left-wing leader Thomas Sankara 34 years ago.\nCompaore, the chief accused, announced through his lawyers last week that he would boycott the trial.\nHe tossed out the country’s name of Upper Volta, a legacy of the French colonial era, and renamed it Burkina Faso, which means “the land of honest men”.\nBurkina Faso has long been burdened by silence over the assassination and many are angry that the killers have gone unpunished.\nAn association called Justice For Thomas Sankara, Justice for Africa said it feared the trial would not shed light on suspected international involvement in the turbulence of the 1980s."
  },
  {
    "headline": "EFCC storms KASUPDA Headquarters, arrests Director General -",
    "summarized_story": "Officials of Nigeria’s Anti-graft agency, EFCC, on Monday stormed the headquarters of Kaduna State Urban Planning And Development Agency (KASUPDA) located along Bida Road in Kaduna state.\nDirector General of the agency Ismail Dikko was arrested in the process.\nIt was gathered that the EFCC officials took over KASUPDA headquarters around 10am while the D.G of the agency was still in a meeting with other staff members.\nAccording to eye witnesses there was mild drama between the EFCC operatives and Staff of KASUPDA at the gate of the agency’s headquarters before Ismail Dikko was whisked away in black Toyota Hilux van.\nKASUPDA is the state government agency responsible for the enforcement of state policies on urban planning, control of physical developments in designated urban areas amongst other roles."
  },
  {
    "headline": "We will complete 2nd Niger Bridge, Lagos-Ibadan by 2023 -President Buhari -",
    "summarized_story": "President Muhammadu Buhari says the Second Niger Bridge and the Lagos-Ibadan Expressway will be completed before the end of his administration in 2023.\nPresident Buhari also assured that other key projects under the Presidential Infrastructure Development Fund will be completed within the same period.\nThe President gave these assurance at the opening of a two-day Mid-Term Ministerial Performance Review Retreat organised to assess progress made towards the achievement of the nine key priorities of his administration.\nAt the event, President Buhari highlighted some of the achievements of the Federal Government in the past two years, mostly in the areas of infrastructure, transportation, economy, electricity supply, the petroleum industry, among others."
  },
  {
    "headline": "Lagos State government ramps up Light up Lagos 2.0",
    "summarized_story": "Lagos State Government has continued the rehabilitation of the yellow traditional Street Light to Smart white Energy-saving LED Lights.\nThe retrofitting project is part of the effort of the current administration to Light Up Lagos , making lagos a 21st century economy and a smart city under the THEMES Agenda of Mr Babajide Sanwo-Olu Administration while also making lagos safe for residents and commuters.\nThe project is set to run through the year with different Local Governments in place, When completed across the state the street lights will be effective in illumination and efficient saving energy and cost .\nLekki – Epe Expressway, Jibowu to Maryland (Ikorodu road), Airport road, Eko bridge, Surulere, Costain , Apogbon, Ketu, Mile 12 , Ojota, Ikorodu town, New Garage, Yaba, Adekunle, Alagomeji and others are already nearing completion."
  },
  {
    "headline": "Governor Makinde swears in New President of customary court of appeal -",
    "summarized_story": "Governor of Oyo state Seyi Makinde has sworn in newly appointed President of the Oyo state customary court of appeal, Justice Mashood Abbas.\nThe swearing-in took place at the Executive chamber of the Governor’s office in Ibadan, the Oyo state capital.\nHe said his administration has approved and put in place welfare packages that would that improve the standard of living of the judicial workers.\nAccording to him we have approved and started implementing welfare packages for judges both serving and retired through the revised pension and gratuity scheme.\nSpeaking with newsmen, the newly appointed President of the Oyo state court of appeal Justice Mashood Abbas said he would continue to ensure that judicial matters would be carried out judiciously and with the fear of God"
  },
  {
    "headline": "Nigeria: Kaduna Governor El-Rufai Reshuffles Cabinet, Makes New Appointments",
    "summarized_story": "Governor Nasir El-Rufai of Kaduna state, has reshuffled his cabinet with some commissioners taking and senior government officials assigned new portfolios.\nAdekeye disclosed further that the governor has nominated “cabinet rank” administrators for following the passage of the law creating metropolitan authorities to manage Kaduna, Kafanchan and Zaria as organic cities.\nAccording to the statement Balaraba Aliyu-Inuwa was nominated administrator of Zaria Metropolitan Authority, Muhammad Bayero administrator, Kaduna Capital Territory while Phoebe Yayi administrator, Kafanchan Municipal Authority.\nHe added that Amina Ladan will oversee the Kaduna State Roads Agency (KADRA) following the redeployment of Muhammad Magaji to the Ministry of Public Works & Infrastructure.\n“The governor has nominated Dr. Ishaya Sarki Habu (chairman), Aminu Yusuf Musa, Engr."
  },
  {
    "headline": "Merck Seeks First US Authorisation for Covid Pill",
    "summarized_story": "An authorization from the U.S. Food and Drug Administration could help change clinical management of COVID-19 as the pill can be taken at home.\nThe drugmaker has a U.S. government contract to supply 1.7 million courses at a price of $700 per course.\nMerck expects to produce 10 million courses of the treatment by the end of 2021.\nIt has also agreed to license the drug to several India-based generic drugmakers, which are expected to supply the treatment to more than 100 low- and middle-income countries.\nMerck’s shares opened roughly 1% higher before paring some gains to trade at $81.32."
  },
  {
    "headline": "MTN To Make Up For Network Disruption By Extending Users’ Time-Bound Subscriptions",
    "summarized_story": "As a way of paying back the network disruption experienced by users on Saturday, MTN Nigeria says it will extend time-bound subscriptions for its customers.\nLast week, MTN users suffered hours of network downtime, which prevented them from making calls or connecting to the internet.\nMTN statement reads, “MTN Nigeria Communications Plc (“MTN Nigeria”) can confirm that subscribers experienced challenges connecting to the network during the afternoon of Saturday, October 9th, 2021,” the statement reads.\n“The service outage was caused by a disruption in the core network and affected voice and data services.\nHe said MTN Nigeria is taking necessary steps to ensure non-repetition of such an event."
  },
  {
    "headline": "Nigeria Ranks 6th Among Countries Benefitting from World Bank Loans",
    "summarized_story": "Nigeria has been ranked sixth among the top 10 countries with the highest exposure to funds and support from the World Bank.\nThe IFC stated that India led the list of countries with a benefit of $6.91 billion, representing 10.77 percent of the global portfolio as at June 2021.\nIt disclosed further that China benefited with $4.75 billion, accounting for 7.40 percent while Turkey’s $4.44 fund billion accounted for 6.92 per cent.\nBrazil, on the other hand, was fourth with a benefit of $3.68 billion, accounting for 5.75 percent, while South Africa was fifth with a benefit of $2.49 billion, accounting for 3.89 per cent.\nVietnam came eighth with a benefit of $1.67 billion, accounting for 2.60 percent; Mexico was ninth with a benefit of $1.59 billion, accounting for 2.48 per cent; and Indonesia was tenth with a benefit of $1.53 billion, accounting for 2.38 per cent."
  },
  {
    "headline": "Peter Obi: I Don’t Regret But If Anything, Politics Made Me Poorer",
    "summarized_story": "Since media organisations commenced publication of the leaked Pandora Papers, former governor of Anambra State, Peter Obi, has been hard pressed to deny the revelations on his secret business dealings overseas.\nLike similar document leaks before it, the Pandora Papers have helped to expose the concealed fortunes in offshore tax havens and, in some cases, money laundering by some of the most powerful people in the world.\nBut in a statement, Obi dismissed a report by Premium Times, which disclosed that the former governor had concealed a number of offshore businesses and investments when he was at the helm of affairs in Anambra State.\nObi, a Vice Presidential candidate in the 2019 elections, joined ARISE News to give his side of the story on the allegations made against him by Premium Times.\nWatch the video for more…"
  }
]