[
  {
    "headline": "Imo communities under military siege, alleges IPOB",
    "summarized_story": "IPOB alleged that military personnel now go from house to house searching and killing innocent citizens because they are Biafrans.\nPowerful said Obowo and Orlu residents were facing hard times, and the security agencies, especially the military had already marked out those communities for total destruction.\nPowerful said soldiers were busy killing innocent citizens simply because of their suspicion of being IPOB members without confirmation.\n“The Army are now going from house to house, searching for and killing innocent citizens just because they are Biafrans.\nThere is genocide going on now in Biafra land by Nigeria security agencies."
  },
  {
    "headline": "Ganduje’s commissioner hands over, SSG withdraws from gov race",
    "summarized_story": "Kano State Commissioner for Budget and Planning, Alhaji Nura Dankadai, on Wednesday, handed over the affairs of his ministry to the next in command despite Governor Abdullahi Ganduje’s rejection of his resignation letter.\nMeanwhile, the Secretary to the State Government, Alhaji Usman Alhaji, has withdrawn from the governorship race.\nThis is contained in a statement by Chairman, Patriotic Volunteers for Good Governance, Alhaji Dan’azumi Gwarzo, which was made available to The PUNCH on Wednesday.\nAccording to the statement, the decision to withdraw from the race followed a meeting between the governor, SSG and Gwarzo.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Lagos to increase comprehensive schools to 50",
    "summarized_story": "Lagos State Commissioner for Education, Mrs. Folasade AdefisayoTHE Lagos Government has revealed plans to increase the number of comprehensive schools across the state from the initial pilot of 12 schools to 50 by September this year to demonstrate commitment and huge investment of the government in equipping Lagos State school students to be self-reliant and skilled.\nMrs. Adefisayo explained to stakeholders comprising school principals, school support and education quality assurance officers across the state on the importance of integrating comprehensive school programme to the school curriculum.\nAn MOU was recently signed by the Lagos State Government and City of Tampere in Finland.\nAdefisayo encouraged the principals for more positive results as the huge investment by the government is evident in all schools across the State.\nHe noted that the state government has equipped the pilot schools with the various infrastructure needed to actualize the newly established programme."
  },
  {
    "headline": "No more imposition of candidates in Arochukwu — Sen Ohuabunwa",
    "summarized_story": "As PDP stakeholders agree to work together.\nSupports full autonomy for LGAsBy Steve OkoSenator Mao Ohuabunwa has vowed that the imposition of candidates would not be allowed again in the Arochukwu Local Government Area of Abia State.\nOhuabunwa vowed to stop at nothing in ensuring that “PDP recaptures Arochukwu which has been the party’s enclave”.\n” We the ward Chairmen in Arochukwu LGA have decided to de-register any stakeholder that refuses to embrace peace so that Arochukwu PDP can recover its lost grounds”, Peters threatened.\nIn a remark, PDP Vice Chairman, Abia North, Elder Amah Abraham, said the greatest challenge he faced after his election was how to unite the various factions in Arochukwu PDP."
  },
  {
    "headline": "Presidency justifies Dariye, Nyame’s pardon",
    "summarized_story": "Garba ShehuSays Buhari acted in line with ConstitutionBy Johnbosco AgbakwuruABUJA—THE Presidency last night justified the presidential pardon granted to former Governors Joshua Dariye and Jolly Nyame, saying that it was in line with the Constitutional provisions.\nThe Presidency also said that the pardon will in no way affect the fight against corruption, adding that the two governors were selected based on their health conditions.\nBut the Presidency in a statement by the Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu has come in defence of President Buhari, saying his action was in good fate.\n“The Committee filed its first report in March 2020 and reconvened on Thursday, 28 September 2021 to attend to the myriad of pending applications for presidential pardon and clemency from Nigerians across the country.\nEven Governors have the right to be treated fairly under the law."
  },
  {
    "headline": "2023: Akerele meets APC delegates for House of Representatives ticket",
    "summarized_story": "Akerele in the last few days has been meeting with Akoko-Edo APC ward chairmen, stakeholders and leaders and delegates to consult with them on his possible aspiration and bid to seek the party nomination.\nA statement on Wednesday by the Director, Media and Logistics, TFA Campaign Organization, Jaspa Olowojoba said Akerele unveiled his manifesto and explained his agenda to reposition the area “on the part of growth and progress through giant and intentional legislative strides if given the mandate to serve our people.\n“Akerele reminded the delegates and party leaders of the various steps he took to attract development to their door steps when he was in appointive position sometime ago, recalling that Akoko Edo was completely forgotten until recently.\nHe reminded them of Igarra- okpe road, Ogugu road, Ugboshi road, Ekuma road in Ibillo and Lampese Ilepi road at Lampese and the long abandoned ikpeshi township roads which were all done when he served as chief of staff.\nHe met with delegates from seven wards out of the ten that make up the constituency adding that meeting with the remaining three would concluded within the week."
  },
  {
    "headline": "Who can legally afford APC’s N100m presidential forms, CISLAC queries",
    "summarized_story": "…accuses APC of endorsing, institutionalizing godfatherism…says price tags on forms exclude youth, women from internal democracyBy Gabriel EwepuABUJA-THE Civil Society Legislative Advocacy Centre, CISLAC, Wednesday, queried the ruling All Progressives Congress, APC, ‘Who can legally afford APC’s N100 million presidential forms of Nomination and Expression of Interest?\nThe Executive Director of CISLAC and Chairman Transition Monitoring Group, TMG, Auwal Ibrahim Rafsanjani, in a statement issued and made available to Vanguard, described the fees as shameful.\nAccording to Rafsanjani, “It was unbelievable for a ruling party that the President belongs to, has endorsed the expression of interest and nomination forms for its presidential ticket at N100m.\n“This will apparently exclude the youth, women and average Nigerians who have clamoured to improve opportunities to exercise their rights to declare their interests and contest in the elections.\nor have essentially handed-over the functions of their offices to their political benefactors to the detriment of their mandates and electorates."
  },
  {
    "headline": "AirForce plane crash, tragic, unfortunate – Buni condoles bereaved families",
    "summarized_story": "Yobe State Governor, Mai Mala Buni has described yesterday’s plane crash involving officers of the Nigerian Air Force as tragic, unfortunate and a huge loss to the country and the families of the departed servicemen.\n“On behalf of the government and the good people of Yobe State, I condole the Nigeria Air force and the families of the deceased officers”, Governor Buni said.\nHe expressed his heartfelt condolences to the family of Flight Lieutenant Abubakar Alkali, an indigene of Yobe State who died in the crash.\n“The unfortunate incident had consumed a young, talented and determined officer who was committed to doing the state proud in the service of his fatherland.\n“May Allah grant the souls of Abubakar and the other victim eternal rest and, to their families the fortitude to bear the irreparable loss”, Governor Buni prayed."
  },
  {
    "headline": "WikiLeaks: UK court orders extradition of Julian Assange to US",
    "summarized_story": "WikiLeaks founder Julian Assange may be close to being transported to the United States for trial under the Espionage Act.\nAssange is wanted in America to answer 18 criminal charges over WikiLeaks publications.\nOn Wednesday, a London court sent an extradition order to the British Government for approval, CNN reports.\nAssange, who can appeal the decision, joined the hearing virtually from the Belmarsh Prison in London.\nIn March, 50-year-old Assange married his long-term partner Stella Moris inside Belmarsh prison."
  },
  {
    "headline": "Speaker, Kunini condemns Taraba bomb blast",
    "summarized_story": "The Speaker of the Taraba State House of Assembly, Joseph Albasu Kunini has condemned in strong terms the bomb blast that rocked Iware community yesterday.\nA local drinking joint, it would be recalled, was on Tuesday, thrown into disarray following a bomb explosion that did not only kill several persons, but left scores with various degrees of injures.\nThe Speaker, who made the condemnation on Wednesday, in Jalingo, the State capital, described the dastardly act by the faceless people as “bestial and inhuman, considering the relative peace the State has enjoyed.”Viewing the act as “disdainful”, “the dastardly act by the miscreants”, according to him, came at the time “when the State Government has been doing everything humanly possible for peace to reign and ensure security of lives and property of the people.”He urged the security agencies to brace up and tackle the ugly trend head on.\nThe State, which he also described as the most peaceful in the North East geopolitical zone, could not afford to witness the carnage and new wave of terrorism.\nCalling on Tarabans to be vigilant and conscious of the people they relate with, as well as report suspicious persons to the appropriate authorities, especially with the commencement of the electioneering campaigns, all hands, as suggested by him, must be on deck to checkmate hoodlums’ activities."
  },
  {
    "headline": "Sterling Bank’s Easter message insensitive, provocative – Christian leadership",
    "summarized_story": "The Christian Association of Nigeria (CAN) has condemned the “provocative advertisement” of Sterling Bank during Easter.\nCAN described the comparison of the Resurrection of Jesus Christ to ‘Agege Bread’ as “ungodly, wicked and insensitive”.\nNational Secretary, Joseph Daramola told Sterling Bank that the resurrection of Jesus affirms the immense power of God and should not be a joke.\nThe Advertising Practitioners Council of Nigeria (APCON) has reportedly intervened in the matter with a view to sanctioning Sterling Bank.\nThe statement appealed to Christians not to take laws into their hands in seeking redress, but allow relevant authorities handle the matter."
  },
  {
    "headline": "Boko Haram: Nigerians know the truth – Buhari to ICC",
    "summarized_story": "President Muhammadu Buhari, on Wednesday, stated that Nigerians now know the truth about Boko Haram.\nHe spoke at a meeting with Karin Ahmad Khan, Chief Prosecutor of the International Criminal Court (ICC) at State House, Abuja.\nBuhari added that with concerted public enlightenment, it had become clear to the people that Boko Haram was a perversion of religion, rather than Islamic ideology.\nIt’s either you don’t know that God at all, or you are simply being stupid“To say Western education is unacceptable (Haram) is very fraudulent.\nThe prosecutor called what Boko Haram does in collaboration with Islamic State of West African Province (ISWAP) “perversion of religion”."
  },
  {
    "headline": "Stories of impact: Real women, real lives, real growth",
    "summarized_story": "Under her picture comes the title of the book; Stories of Impact: Real Women, Real Lives, Real Growth.\nThe visual impact of the photo-book packaging and cover deftly prepares any reader for the content it encases.\nThe picture of the various economic sectors with female beneficiaries of the Grooming Centre speaks to the economic and social impact the publishers intended to communicate.\nThe first chapter, Grooming Nigerian Women in Business seems to encapsulate the core mission of the Grooming Centre.\nThe other four chapters are all stories around the success of the Grooming Centre even beyond the women to their families/communities."
  },
  {
    "headline": "Battle for PDP ticket hots up as nomination closes Wednesday",
    "summarized_story": "Aspirants who have submitted their forms include Rivers State Governor Nyesom Wike, former Vice President Atiku Abubakar, Sokoto State Governor Aminu Tambuwal, and former Senate President Anyim Pius Anyim.\nHe was also of the opinion that the party would fail if it kept the presidential ticket in the North.\nI request you all to campaign for me to get the PDP presidential ticket.\n“I am wooing you to vote for me because I have the capacity to make PDP win the election in 2023.\nYou have done it before and we are very sure that you will do it again.”There are 17 aspirants vying for the party’s presidential ticket."
  },
  {
    "headline": "APC NEC set to ratify primary timetable",
    "summarized_story": "By Jide Orintunsin, AbujaBarring the unforeseen, the National Executive Committee (NEC) of the All Progressives Congress (APC) will today ratify the timetable for the party’s primaries.\nThe Senator Abdullahi Adamu-led National Working Committee (NWC) set the tone for today’s emergency meeting during its rescheduled meeting in Abuja yesterday.\nA source within the NWC told our reporter that the committee will present its decision to the NEC for ratification.\nOn the mode of election recommended by NWC for consideration and approval of NEC for the party’s primaries, our source said the party will adopt an indirect primary.\n“We have mandated the National Youth Leader to make this case, while some of us are reaching out to other NEC members to support this move.”"
  },
  {
    "headline": "AbdulRazaq swears in seven perm secs",
    "summarized_story": "By Adekunle Jimoh, IlorinKwara State Governor AbdulRahman AbdulRazaq yesterday swore in seven permanent secretaries.\nHe urged them to be good team players, saying they should join the rebuilding efforts of his administration.\nThe permanent secretaries are: Ibrahim Mohammed (Establishment), Yahya Mohammed (Water Resources), Sidikat Alaya (Tertiary Education), Iyabo Dupe Adekeye (Environment), Umar Yakubu Jaja (Planning), Salman Suleiman (Service Welfare) and Rebecca Bake (Social Development).\nThe appointments, however, triggered a minor tweak in postings, with Okanlawon Musa of the Water Resources moving to Special Duties and Adenike Ibrahim switching from Social Development/Women Affairs to Solid Minerals.\nThe governor advised the permanent secretaries to work closely with their political heads and junior colleagues in the bureaucracy to deliver optimal service and good governance to the people."
  },
  {
    "headline": "APC stakeholders endorse Fayemi’s ex-commissioner for Senate",
    "summarized_story": "The stakeholders, under the aegis of Ekiti South APC Mandate Group, said after expanded consultations with APC leadership in the six local governments in Ekiti South, they found Faparusi apt, fit and popular to rescue the party from imminent defeat.\nAdeleye said Faparusi could serve as a magnetic force to rally the six councils in Ekiti South for the APC governorship candidate, Mr. Biodun Oyebanji, in the June 18 election.\nThe group’s leader said picking Faparusi from Ekiti South Federal Constituency 2 would inject political balancing, since the APC deputy governorship candidate, Mrs. Monisade Afuye, had emerged from Ikere-Ekiti in Federal Constituency 1.\n“There is a common deep-seated belief that since South Federal Constituency 1 has produced the deputy governorship slot, the Senate seat occupier should emerge from Ekiti Federal Constituency II.\n“Faparusi is a household name in Ekiti South Senatorial District, with strong grassroots appeal that can help the party in the June election.”"
  },
  {
    "headline": "2023: Anambra stakeholders endorse Obi for president",
    "summarized_story": "Prominent stakeholders in Anambra, yesterday, endorsed the former governor of the state, Peter Obi, for president.\nObi’s endorsement took place in Awka, the state capital during the Anambra Central senatorial district stakeholders’ briefing/town hall meeting organised by Uche Ekwunife, to render her stewardship to the people.\nChairman on the occasion, Ben Obi, said he was pleased with the leadership qualities of Obi and Ekwunife.\nThe former lawmaker, who represented Anambra Central in the National Assembly, equally spoke highly about former governor Obi, saying he was very confident that Obi could fix Nigeria’s problems if given the opportunity to do so.\nIf I am Mr President, if we do not have 20,000 megawatts in three years, I’ll go home,” Obi said."
  },
  {
    "headline": "Osinachi; Women affairs minister visits IGP, on update of investigation, demands justice, condemns domestic violence on women",
    "summarized_story": "The IGP, gave the assurance when he received the Minister of Women Affairs, Dame Pauline Kedem Tallen, in his office at the Louis Edet House, Abuja.\nDo not miss the Vital Information, it goes off in 2 days!\nShe pointed out the recent case of the famous gospel musician, Osinachi Nwachukwu, whose untimely death at the hands of her husband on 8th April, 2022 has caused public outcry.\nThe Minister who was accompanied by some members of the late singer’s family, demanded to know what efforts the police have put in place to ensure swift justice is dispensed.\nHe said her husband would be charged to court as soon as it is established that he was responsible for her death."
  },
  {
    "headline": "2023: APC may lose presidential election to PDP if..",
    "summarized_story": "Adamu handed the warning in his keynote address during the emergency APC National Executive Committee (NEC) meeting held in Abuja on Wednesday.\n“As you see it, this party has two path to take, the first path is the full and complete unity of the party, the second path is winning 2023 general elections.\nThe battle rarely is a battle for supremacy between serving state governors and their predecessors in office.\nEgo between former and serving governors has turned them into bitter enemies.\n“The serving governors and past governors are powerful men, each of them are leaders in there own right in there states but when two elephants fight the grass suffers."
  },
  {
    "headline": "NECO postpones unity colleges entrance examination",
    "summarized_story": "From Fred Ezeh, AbujaNational Examination Council (NECO) has announced a shift in the date for the conduct of the National Common Entrance Examination (NCEE) which is conducted for admission into Federal Government Colleges (FGCs) otherwise known as Unity Schools.\nNECO spokesman, Sani Azeez, in a statement on Wednesday, disclosed that the examination which was hitherto scheduled for April 23rd, 2022, has been shifted to 7th May, 2022.\nHe encouraged States with low registration (not mentioned) to mobilize its people so they can register and take advantage of the Unity Colleges to get quality and affordable education.\nHe confirmed that registration of candidates will continue till the new date of the examination, to allow more opportunities for interested candidates.\nHe, therefore, enjoined all candidates, parents, guardians and relevant stakeholders to take note of the new date for the examination and prepare adequately for it."
  },
  {
    "headline": "BREAKING: APC fixes N100 million for presidential nomination form",
    "summarized_story": "Announcing the prices for the nomination forms, Morka said: “the last item which is the schedule of fees payable for these offices.\nThe expression of interest form has been set for N500,000 while the nomination form has been set for N1.5m.\nThe House of Representatives has a fee prescription of N1 million for the expression of interest form and N9 million for the nomination, bringing the House of Representatives to total of N10 million.\n“For governorship, we have the expression of interest form set at N10 million with the nomination from set at N40 million, bringing it to a total of N50 million and our presidential form has been set for expression of interest of N30 million and the nomination form set at N70 million bringing it to a total of N100 million.\n“But the nomination forms which obviously, from what I have said, costs more will be delivered to them for free at no cost to them."
  },
  {
    "headline": "Breaking: APC Pegs Presidential Forms at N100m",
    "summarized_story": "Adedayo AkinwaleThe All Progressives Congress (APC) has resolved to sell its presidential form at the cost of 100 million.\nWhile the Expression of Interest form is fixed at the cost of N30 million, the nomination form cost N70 million.\nThis was part of the decision ratified at the emergency National Executive Council (NEC) meeting held on Wednesday in Abuja.\nThe sale of forms of the ruling party will commence on April 22, 2022.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: With Advancement in Technology, No One Can Claim Millions of Votes Again",
    "summarized_story": "Specifically on the 2023 elections, the president affirmed that being beneficiary of free, fair and credible elections, the introduction of technology and the Permanent Voters Card (PVCs), would make it impossible for anyone to claim millions of votes again in the country.\nKaduna and other states in the North are sick security-wise and it is affecting other parts of the country.\nNigeria is very close to the Thomas Hobbes’ ‘state of nature’ where life is described as nasty, brutish and short.\nIn a related development, Diri was decorated as an ambassador against drug abuse by the state command of the National Drug Law Enforcement Agency (NDLEA).\nLagos State government had yesterday shut Chrisland School over alleged sex scandal involving a 10-year-old female pupil during a trip to Dubai."
  },
  {
    "headline": "Soyinka to Buhari: Pardoning Dariye, Nyame Means ‘It Is Finished’",
    "summarized_story": "In a similar vein, the National Association of Seadogs (Pyrates Confraternity) yesterday condemned the presidential pardon granted to the two former governors convicted for corruption.\nThe NAS Capoon, Mr. Abiola Owoaje, in a statement titled, “Presidential Pardon for Corrupt Ex-governors: Buhari’s death knell for the anti-graft war,” and made available to THISDAY in Yenagoa, said the intention of presidential pardon ought not to be for the likes of Nyame and Dariye.\nOwoaje pointed out that the presidential pardon was inconsistent with Sections 15(5), 17(a) and 42 of the 1999 Constitution, as amended.\nSadly, the presidential pardon has made mockery of the war against corruption.\nIn granting state pardon to corrupt individuals, President Buhari has conferred on himself the status of the Chief Undertaker that sounded the death knell for his administrations’ anti-graft war.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Amid Worsening Insecurity, Defence Minister Seeks God’s Intervention to Defeat Terrorists",
    "summarized_story": "The terrorists had, allegedly, fired mortar bombs at civilian targets in Gujba Local Government Area of Yobe State, recently.\nIt said the aircraft was, at the time of filling this report, still patrolling Maiduguri, the Borno State capital, to ensure that the city remained safe.\nZulum said this in his Easter message, stressing that the surrender is a miracle towards the healing of Borno State and the North-east.\nHe said, “The mass surrender of over 35,000 fighters and commanders is, certainly, one of Allah’s many miracles towards healing Borno State and rest of the North-east.\n“This mass surrender is the product of the endless prayers citizens across Borno State, the North-east region, rest of Nigeria and, indeed, the world have been offering, seeking God’s intervention to heal Borno State."
  },
  {
    "headline": "Marginal Fields: We’ll Not Accept People Trading in Our Papers, Says Komolafe",
    "summarized_story": "According to him, “In many cases the moment people get a letter of award, they write to say they want to assign.\nWe shouldn’t be encouraging people making money by trading papers.\n“It is better you have a regulator that abides by the rule of law than to have a genius as a regulator.\nOn how he intended to tackle the challenges, Komolafe said, “I came with a revolutionary mind-set.\nAuthorities claimed tribal leaders in southern Libya had shut down the county’s largest oil field — the latest closure of an oil facility amid a bitter standoff between two rival governments."
  },
  {
    "headline": "UPDATE: Identities Of Two Pilots Killed In Nigerian Air Force Aircraft Crash In Kaduna",
    "summarized_story": "The photograph of the two Nigerian Air Force pilots killed when a military aircraft crashed in Kaduna State has been released.\nSaharaReporters had reported how the training aircraft with the two pilots on board crashed on Tuesday evening.\nSee Also Breaking News BREAKING: Nigerian Air Force Training Aircraft Crashes In Kaduna, Officers Feared KilledThe latest development comes a few months after a NAF aircraft crashed in Kaduna.\nThe incident, which occurred in May 2021, involved a Beechcraft 350, and the aircraft crashed around the Kaduna international airport.\nIbrahim Attahiru, Chief of Army Staff, and 10 other military officers, who were on board when the plane crashed, were killed."
  },
  {
    "headline": "UPDATE: Identities Of Two Pilots Killed In Nigerian Air Force Aircraft Crash In Kaduna",
    "summarized_story": "The photograph of the two Nigerian Air Force pilots killed when a military aircraft crashed in Kaduna State has been released.\nSaharaReporters had reported how the training aircraft with the two pilots on board crashed on Tuesday evening.\nSee Also Breaking News BREAKING: Nigerian Air Force Training Aircraft Crashes In Kaduna, Officers Feared KilledThe latest development comes a few months after a NAF aircraft crashed in Kaduna.\nThe incident, which occurred in May 2021, involved a Beechcraft 350, and the aircraft crashed around the Kaduna international airport.\nIbrahim Attahiru, Chief of Army Staff, and 10 other military officers, who were on board when the plane crashed, were killed."
  },
  {
    "headline": "Dubai-based Aisha Buhari Quietly Returns, Says Nigeria Needs Prayer",
    "summarized_story": "Dubai, United Arab Emirates-based Aisha Buhari, has silently made her return to Nigeria.\nAisha BuhariShe called on Muslim faithful to use the Ramadan period to intensify prayers for lasting peace and security in Nigeria.\nAisha said God had provided Nigerians with another opportunity to re-dedicate themselves in fasting and prayers to ensure peace and development of the country.\nThe first lady also urged Nigerians to extend good virtues of sharing, love, support, forgiveness and sacrifice for the betterment of mankind and Nigeria.\nAccording to the News Agency of Nigeria, the women expressed their appreciation to the first lady for her commitment to the peaceful coexistence of Nigeria."
  },
  {
    "headline": "Dubai-based Aisha Buhari Quietly Returns, Says Nigeria Needs Prayer",
    "summarized_story": "Dubai, United Arab Emirates-based Aisha Buhari, has silently made her return to Nigeria.\nAisha BuhariShe called on Muslim faithful to use the Ramadan period to intensify prayers for lasting peace and security in Nigeria.\nAisha said God had provided Nigerians with another opportunity to re-dedicate themselves in fasting and prayers to ensure peace and development of the country.\nThe first lady also urged Nigerians to extend good virtues of sharing, love, support, forgiveness and sacrifice for the betterment of mankind and Nigeria.\nAccording to the News Agency of Nigeria, the women expressed their appreciation to the first lady for her commitment to the peaceful coexistence of Nigeria."
  },
  {
    "headline": "Boko Haram Terrorists Are Either Stupid Or Don’t Know God, Says Buhari",
    "summarized_story": "President Muhammadu Buhari says Boko Haram terrorists are either stupid or do not know God.\nBuhari questioned how the terrorists kill innocent people and shout ‘Allah Akbar’ (God is great), saying it might be because of their stupidity.\nThe President also noted that Boko Haram insurgency had nothing to do with religion or ethnicity.\nIt’s either you don’t know that God at all or you are simply being stupid.\nHe said what Boko Haram does in collaboration with the Islamic State of West African Province (ISWAP) is a perversion of religion."
  },
  {
    "headline": "Presidency: It'd have been cruel of Buhari not to pardon Dariye, Nyame over life-threatening illness",
    "summarized_story": "The presidency says ignoring the request to pardon Joshua Dariye, ex-governor of Plateau, and Jolly Nyame, former governor of Taraba, over “life-threatening” illness would have been seen as insensitive on the part of President Muhammadu Buhari.\nThe former governors were among 159 inmates granted pardon at a council of state meeting held on April 14.\nNyame is serving a 12-year jail sentence for diverting N1.64 billion during his tenure as governor of Taraba, while Dariye is serving 10 years’ imprisonment for N1.126 billion fraud.\nThe president has been criticised for granting clemency to the two governors.\n“The Committee filed its first report in March 2020 and reconvened on Thursday, 28 September 2021 to attend to the myriad of pending applications for presidential pardon and clemency from Nigerians across the country,” the statement by Shehu reads."
  },
  {
    "headline": "Presidency: It'd have been cruel of Buhari not to pardon Dariye, Nyame over life-threatening illness",
    "summarized_story": "The presidency says ignoring the request to pardon Joshua Dariye, ex-governor of Plateau, and Jolly Nyame, former governor of Taraba, over “life-threatening” illness would have been seen as insensitive on the part of President Muhammadu Buhari.\nThe former governors were among 159 inmates granted pardon at a council of state meeting held on April 14.\nNyame is serving a 12-year jail sentence for diverting N1.64 billion during his tenure as governor of Taraba, while Dariye is serving 10 years’ imprisonment for N1.126 billion fraud.\nThe president has been criticised for granting clemency to the two governors.\n“The Committee filed its first report in March 2020 and reconvened on Thursday, 28 September 2021 to attend to the myriad of pending applications for presidential pardon and clemency from Nigerians across the country,” the statement by Shehu reads."
  },
  {
    "headline": "CAN calls for sack of Sterling Bank CEO over controversial 'Agege Bread' Easter message",
    "summarized_story": "The Christian Association of Nigeria (CAN) has called for the “immediate removal” of Abubakar Suleiman, the chief executive officer (CEO) of Sterling Bank, over the bank’s controversial Easter message.\nIn celebration of Easter, Sterling Bank had posted an Easter message wherein the bank compared the resurrection of Jesus Christ with Agege bread.\nAdvertisementResponding to the backlash, Sterling Bank pulled down the post from its Twitter page, and replaced it with another post in which it apologised to its customers.\nReacting to the advert, the Advertising Practitioners Council of Nigeria (APCON) said it will sanction Sterling Bank over the controversial Easter message.\n“We learnt that the Advertising Practitioners Council of Nigeria (APCON) has reportedly intervened in the matter with a view to imposing some sanctions against Sterling Bank."
  },
  {
    "headline": "CAN calls for sack of Sterling Bank CEO over controversial 'Agege Bread' Easter message",
    "summarized_story": "The Christian Association of Nigeria (CAN) has called for the “immediate removal” of Abubakar Suleiman, the chief executive officer (CEO) of Sterling Bank, over the bank’s controversial Easter message.\nIn celebration of Easter, Sterling Bank had posted an Easter message wherein the bank compared the resurrection of Jesus Christ with Agege bread.\nAdvertisementResponding to the backlash, Sterling Bank pulled down the post from its Twitter page, and replaced it with another post in which it apologised to its customers.\nReacting to the advert, the Advertising Practitioners Council of Nigeria (APCON) said it will sanction Sterling Bank over the controversial Easter message.\n“We learnt that the Advertising Practitioners Council of Nigeria (APCON) has reportedly intervened in the matter with a view to imposing some sanctions against Sterling Bank."
  },
  {
    "headline": "2023: APC leans towards indirect primary as Buhari warns against imposition of candidates",
    "summarized_story": "Atiku Bagudu, chairman of the Progressive Governors’ Forum (PGF), says the All Progressives Congress (APC) may use indirect primary mode to pick its candidates for the 2023 elections.\nAdvertisement“No party can thrive with equal opportunity.\nWe believe that equal opportunity will ensure a proper result.\nMeanwhile, President Muhammadu Buhari has warned the party leaders against the imposition of candidates.\nIn the recent past, this led to some of our strong members unfortunately opting to go elsewhere because of unfairly oppressive behaviour of party leaders at state level."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "After losing 200,000 subscribers, Netflix considers ad-supported plans and cracking down on password sharing",
    "summarized_story": "For the first time in the past decade, Netflix announced that it lost subscribers in a quarter.\nNetflix previously told shareholders it’s expected to add 2.5 million net subscribers during the first quarter.\nIn the wake of its loss of subscribers, Netflix wants to maximise revenue from existing subscribers and viewers.\nThe company has already started testing ways to prevent sharing passwords.\nTo curb the loss of subscribers Netflix is now planning to introduce lower-priced, ad-supported plans."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, Isn't it strange that it's Tuesday but feels like Monday?\nThe vacation is over, and it's time to get back..."
  },
  {
    "headline": "With a fresh $100k grant, DevCareer is plugging Africa’s talent gap by providing laptops for tech newbies",
    "summarized_story": "Share this article:In 2021, African startups raised approximately $5 billion, almost three times what was raised in 2020.\nFurthermore, as the shift to remote work becomes more popular, African startups have to compete with foreign startups for an already scarce pool of developers.\nIn addition to his work at DevCareer, Akintunde is also co-founder of technical talent accelerators, TalentQL and AltSchool.\nAdvertisementOut of a desire to support new African tech talents, Akintunde gave out free software development.\n“With increased digitisation, plus a fast-growing African tech ecosystem, engineers are in high demand, which is leaving a gaping hole in supply."
  },
  {
    "headline": "Want to be $2,500 richer?",
    "summarized_story": "It’s the TABS Web3 Hackathon ’22, and prizes of up to $2,500 are up for grabs.\nHowever, it appears that there is an alternative to the traditional kitchen: cloud kitchens.\nExamples of these are Comida Cloud Kitchen, Food Nation, and The Food Lab.\nAnd now, The Food Lab, an Egyptian cloud kitchen provider, has raised $4.5 million in a pre-seed round of funding.\nIt offers a comprehensive set of end-to-end services, including cloud kitchen (kitchen as a service) and procurement."
  },
  {
    "headline": "TABS Web3 Hackathon 2022: $2,500 in cash prizes to be won",
    "summarized_story": "TABS 2022, themed Web3: Engineering tomorrow’s Internet, is an opportunity to learn, network, and navigate the complex world of blockchain and its many promises.\nWe’re adding a little cherry on top of the event with the TABS Web3 Hackathon 22.\nAdvertisementWhat are we looking for at the TABS Web3 Hackathon?\nHackathon timelineApril 19, 2022: Registration opensMay 2, 2022: Registration closesMay 9, 2022: Hackathon beginsMay 13, 2022: First project submissionMay 21, 2022: Final project presentationOn May 10, 2022, participants will pitch their ideas virtually to judges and get their feedback and recommendations.\nHow to participateFollow this link to register for the TABS Web3 Hackathon."
  },
  {
    "headline": "#NotTooYoungToRun: Youths say APC N100m form ‘sickening’",
    "summarized_story": "They described the cost of the presidential form as “sickening” and “outrageous”.\nIsrael Abdulahi, APC national youth leader, had said recently that he would lobby other members of the party’s National Working Committee (NWC) to reduce the cost of nomination forms for young people.\nAbdulahi made the promise upon his emergence as the national youth leader during the party’s consensus national convention in Abuja last month.\nEniola Akinkuotu @ENIBOY said: “8 years ago General Buhari said he could not afford the APC Presidential form which was pegged at N20 million.\nToday, while he is leader of the APC, the party has pegged its form at N100 million.”Ayobami @dondekojo said: “If true, the price for the APC form is truly insane."
  },
  {
    "headline": "IMF Chief says 20 SSA countries close to debt distress",
    "summarized_story": "Managing Director of the International Monetary Fund (IMF), Kristalina Georgieva has raised fresh concerns that up to 20 countries in sub-Saharan Africa are close to debt distress, pushed by first, COVID pandemic impact and the new spillover effects of the war in Ukraine.\nAs it was recovering, it’s now hit by the consequences of the war in Ukraine.\nOut of 54 countries in the Africa continent, 12 are exporters, the rest are all importers and are hit by high energy prices.\nSecond, is the high rising global food prices which are particularly concerning especially in poor countries where there is a growing risk of food crisis and food insecurity.\nTo address that, countries need policies that help their budget back on track, while providing targeted assistance to the most vulnerable and they can do that with more equitable tax policies."
  },
  {
    "headline": "Late Dick Kramer, tireless builder, inspired BusinessDay",
    "summarized_story": "Using a system of chronological commentary computed from some given dates as basis, Frank Aigbogun, CEO/publisher, BusinessDay Media Limited, said, “Dick was a father, teacher, friend and mentor to us at BusinessDay.\nHe inspired the setting up of BusinessDay and told me if I ever made the decision to launch BusinessDay, I should count on his support.\nIn an interview with BusinessDay to mark his 80th birthday, Dick related how his background shaped his tireless commitment to building a better Nigeria long after retiring as managing partner at Arthur Andersen, Nigeria in 1994.\nOne way to depict Dick, the leader, mentor and investor, is through his involvement in the founding of BusinessDay.\nLater on, Dick inspired Aigbogun to set up BusinessDay in 2000 and ACA invested in it."
  },
  {
    "headline": "Dr. Nosa Aigbe Leberty: A Doctor with a Difference – Nigerian Observer",
    "summarized_story": "Hearing Dr Nosa speak about his passion and dreams for the African man especially his place of birth (Edo State), one will begin to wonder.\nDr Nosa has an evidence based holistic approach and training in urgent care, primary care and specialized addiction Medicine.\nThe goal according to Dr. Nosa is to inspire the people.\nAnd the reason according to Dr. Nosa is because of maintenance to keep the place going.\nAnything that will help make Edo State shine out to the world is what brings joy to the governor and people of the state, Edo state is going to be great again."
  },
  {
    "headline": "Police officer slumps, dies on duty in Bayelsa – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Police Command in Bayelsa has been thrown into mourning, following the sudden death of an Assistant Commissioner of Police, Emmanuel Asufi.\nSources at the police headquarters in Yenagoa said that Asufi, who was in charge of administration, slumped and died at his duty post on Tuesday afternoon.\nSpokesman of the command, SP Asinim Butswat, who confirmed the demise of the senior police officer, said it was a sad day for the command.\n“Oga Asufi was an exemplary officer who did not spare any effort at putting smiles on the faces of all who came across him.\nAsufi, who, until his demise, was a student of Nigerian Law School in Yenagoa, had also served as Chief Security Officer at the Bayelsa Government House and Commander of the State Security Outfit, Operation Door Akpor."
  },
  {
    "headline": "Gunmen invade FCT community, kidnap 4 family members – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestGunmen, suspected to be kidnappers, at the early hours of Wednesday, invaded and kidnapped four family members in Shadadi community in Kuje Area Council, Federal Capital Territory (FCT).\nSome residents of the community told the News Agency of Nigeria (NAN) on Wednesday in Abuja that the incident happened at about 1a.m.\nafter the suspected kidnappers had shot sporadically into the air.\nMrs Joy Adogo, a resident of the community and a neighbour to the abductees, expressed shock over the incident.\nAdogo called for improved security patrol, adding that the recent incident was the third within six months in the community."
  },
  {
    "headline": "Edo moves to tackle neonatal mortality, offers free medical services to over 4000 residents – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government is launching a new initiative tagged ‘Help Baby Survive’ to tackle high maternal and child mortality in the state.\nThe Commissioner for Health, Prof. Obehi Akoria, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nAkoria said the state is bringing over 65 specialists and healthcare professionals from America to provide free healthcare services to over 4000 persons in the state, in partnership with over 230 local healthcare professionals in Edo.\nAlso, we would have about 3,000 reading glasses or glasses for other purposes distributed for free to Edo citizens as a result of the medical mission.\nWe will also roll out telemedicine services in the state as the services will continue after the end of the medical mission,” the commissioner added."
  },
  {
    "headline": "BREAKING: Buhari’s senator, Babba Kaita, dumps APC for PDP",
    "summarized_story": "Ahmad Babba Kaita, the senator representing Katsina North Senatorial District, the district of President Muhammadu Buhari, has ditched the All Progressives Congress (APC) for the Peoples democratic Party (PDP).\nBabba Kaita was elected to the 8th Senate in 2018 to fill the vacuum in the senatorial zone following the demise of Senator Mustapha Bukar.\nIn 2019, he was re-elected to the 9th Senate after defeating his opponent, Hon Usman Mani of the PDP.\n“A clear stock taking of where Katsina state stands today, is already enough burden on good conscience.\n“Senator Ahmad Babba Kaita is not a bandwagon politician."
  },
  {
    "headline": "Osun: Contractor chosen to rehabilitate roads through public procurement software",
    "summarized_story": "By Sunday Oguntuyi, OsogboIn what is being celebrated as yet another feat for the administration of Governor Adegboyega Oyetola, Osun State governor, in the area of public financial management, the state’s Public Procurement Agency Software was put into use in the award of contract for some selected roads.\nWithout interference, the software advertised, processed bids and eventually selected the most qualified contractor in the award of the rehabilitation of selected roads in Osogbo/Irepodun/Orolu Federal Constituency taking the State on a higher pedestal in transparency.\nThe Commissioner added that through the software, Governor Oyetola has helped the State to join the committee of states using globally accepted and time tested procurement platform to carry out procurement activities to aid ease of doing business and enhance credibility and time management.\nAll bidders seat in their office and watch as each of the bids were evaluated until the software automatically generated an award letter to the winner.\nAlso speaking, the General Manager, Osun Public Procurement Agency, Mr Bello Adegboyega said every contractor now knows that they stand a better chance of participating in procurement process as soon as they register on the data base, stressing that time wasting and paper work are now completely eliminated."
  },
  {
    "headline": "Full Details: APC cost of forms, primary election timetable",
    "summarized_story": "On the other hand, senate aspirants are to pay N20 million each for forms, house of representatives aspirants N10 million and state assembly N2 million.\nMeanwhile, the party at the meeting also released its primary election timetable for various public offices ahead of the elections.\nIt also said aspirants for the state house of assembly and governorship will be screened on May 12.\nThe primaries for governorship, state house of assembly, house of representatives, and senate will be held on May 18, 20, 22, and 24 respectively.\nAppeals arising from the conduct of the primary polls on May 20, 22, 24 and 26 for governorship, state house of assembly, house of representatives, and senate respectively."
  },
  {
    "headline": "Chief of Air Staff assures of full investigation into Kaduna aircraft crash",
    "summarized_story": "Nigeria’s Chief of Air Staff (CAS), Air Marshal Oladayo Amao, has assured that the Nigerian Air Force (NAF) will carry out a holistic investigation into the cause of the Super Mushshak trainer aircraft crash that occurred on Tuesday at NAF Base, Kaduna.\nThis was contained in a statement made available to newsmen on Wednesday in Abuja by the Director of Public Relations and Information, Nigerian Air Force, Air Commodore, Edward Gabkwet.\nIt added that Air Marshal Amao had constituted an Accident Investigation Board to determine the immediate and remote causes of the crash.\n“The unfortunate incident of yesterday’s trainer aircraft crash is yet again a tragic reminder of the perilous nature of the military flying profession as well as the risks NAF pilots continually take, daily, to secure Nigeria’s territorial integrity,” Amao said.\n“Kindly bring this information to the awareness of the general public."
  },
  {
    "headline": "Troops Kill 25 Terrorists, Rescue 6 Captives In Lake Chad",
    "summarized_story": "Troops of the Multinational Joint Task Force (MNJTF) Nigeria and Niger Republics have neutralised over 25 terrorists and rescued six kidnapped victims during clearance operations into insurgents enclaves in the North-East.\n“Sadly, one soldier paid supreme sacrifice and few others were wounded in action, currently receiving treatment at a military hospital,” he said.\nFurthermore, he said troops of MNJTF Sector 1 (Cameroon) encountered terrorists in the vicinity of Toumbuma, Kerenua, and Chikingudu where they neutralizsd two Boko Haram criminals and maintained dominance in the area.\nADVERTISEMENT“At the end of the earlier battle engagement around Tunbun Fulani and Tunbun Rago, six traumatised female BHTs hostages managed to escape and were found by own troops who then assisted them and brought them to own troop’s location,” he added.\nOthers are: Martha Malu, aged 25 years, kidnapped at Damboa road on December 1, 2020, and Malakalya Dambade, aged 37 years, kidnapped at Mainok along Maiduguri highway on February 25 2021."
  },
  {
    "headline": "2023: Buhari Warns APC Against Imposing Unpopular Candidates",
    "summarized_story": "President Muhammadu Buhari Wednesday in Abuja warned the ruling All Progressives Congress (APC) members to be more mindful of the pitfalls that led to the ouster of the Peoples Democratic Party (PDP) in 2015.\nFurthermore I am pleading with all litigants to withdraw cases against the Party and put faith in party mechanisms.’’President Buhari also advised party leaders against imposing unpopular candidates on the APC.\nI call on all party members to abide by all extant laws, rules, and regulations and to leaders of our party to avoid imposition of candidates that cannot win popular elections.\nPresident Buhari also congratulated the new National Chairman of APC, Sen. Abdullahi Adamu, and the entire NWC members.\nPresident Buhari felicitated with party leaders and members for successfully conducting the Ward, Local Government, State Congresses, and the National Convention, in compliance with the Party Constitution."
  },
  {
    "headline": "Train Attack: el-Rufai Gives Families Of Deceased Passengers N2m Each",
    "summarized_story": "Kaduna State governor, Malam Nasir el-Rufai, has given the sum of N2million each to families of nine deceased passengers of an Abuja-Kaduna Train, which was attacked by terrorists on Monday, March, 28, 2022.\nThe executive secretary (ES) of Kaduna State Emergency Management Agency (KAD-SEMA), Mohammed Muazu Mukkadas, made the disclosure while making the presentations of the cash.\n“When we got the call, we secured ambulances and buses for evacuation, we evacuated the those killed and few severely wounded victims and one who escaped and deposited them at 44 Army Reference Hospital and Saint Gerard Hospital.\n“We (SEMA) immediately set up a crisis centre which availed families of the victims to call for enquires and also provide relevant information about their kids and relatives.\n“And yesterday, Tuesday 19th April, 2022, Governor Nasir el-Rufai compassionately approved the disbursement of funds (N2m each) to next of kin of the 9 deceased persons, and 250,000 each to the 22 severely wounded victims which is a succour meant to ameliorate their sufferings,” he stated."
  },
  {
    "headline": "Train Attack: el-Rufai Gives Families Of Deceased Passengers N2m Each",
    "summarized_story": "Kaduna State governor, Malam Nasir el-Rufai, has given the sum of N2million each to families of nine deceased passengers of an Abuja-Kaduna Train, which was attacked by terrorists on Monday, March, 28, 2022.\nThe executive secretary (ES) of Kaduna State Emergency Management Agency (KAD-SEMA), Mohammed Muazu Mukkadas, made the disclosure while making the presentations of the cash.\n“When we got the call, we secured ambulances and buses for evacuation, we evacuated the those killed and few severely wounded victims and one who escaped and deposited them at 44 Army Reference Hospital and Saint Gerard Hospital.\n“We (SEMA) immediately set up a crisis centre which availed families of the victims to call for enquires and also provide relevant information about their kids and relatives.\n“And yesterday, Tuesday 19th April, 2022, Governor Nasir el-Rufai compassionately approved the disbursement of funds (N2m each) to next of kin of the 9 deceased persons, and 250,000 each to the 22 severely wounded victims which is a succour meant to ameliorate their sufferings,” he stated."
  },
  {
    "headline": "JUST-IN: 43,008 Nigerian Pilgrims To Perform 2022 Hajj",
    "summarized_story": "After two years of no-hajj exercise for the Nigerian Muslims community due to COVID-19 restrictions put in place by the authorities of Saudi Arabia, a meager 43,008 Nigerian pilgrims are expected to perform the 2022 hajj ritual in the Kingdom of Saudi Arabia.\nThe 43008 pilgrims from Nigeria would be among the one million pilgrims approved by the Saudi’s authorities for the 2022 Hajj exercise, including foreigners and residents of the Kingdom.\nThe 43,008 slots allocated to Nigeria for the 2022 Hajj is far below the 95,000 quota granted Nigeria for 2017, 2018 and 2019 Hajj exercises respectively.\nThe 43,008 quota will definitely put NAHCON, State Muslim Pilgrims Welfare Boards and private tour operators under immense pressure to select 43,008 Nigerian pilgrims on the order of merit for the 2022 Hajj.\nTherefore the approved total one million pilgrims for the 2022 Hajj is far less than 50 per cent of the number of pilgrims that performed the 2019 Hajj rites."
  },
  {
    "headline": "IGP Baba gives latest update on gospel singer Osinachi's death",
    "summarized_story": "The Inspector-General of Police, Usman Baba on Wednesday said he has ordered a post-mortem examination on late gospel singer, Osinachi Nwachuku to ascertain if her husband was responsible for her death.\nBaba noted that the untimely death of Osinachi was heart-breaking, particularly as information from sources close to the family and independent witnesses fingered her husband, Peter Nwachukwu, as being responsible for her death.\nHe said the suspect is currently in detention at the FCT Police Command even as investigations were still ongoing.\nSpeaking, Tallen lamented several domestic-based violence on women.\nShe pointed out the recent case of the famous gospel musician, Osinachi Nwachukwu, whose untimely death at the hands of her husband on 8th April, 2022 has caused public outcry."
  },
  {
    "headline": "Green Energy begins Phase 2 Development of Otakikpo Oil Field",
    "summarized_story": "Green Energy International Limited (GEIL), the Operator of the Otakikpo field announced the commencement of the Phase-2 Development of the Otakikpo Marginal Field located at the Oil Mining Lease (OML) 11 in Rivers State with the drilling of two development wells.\nGreen Energy International Limited currently operates the field via a 10,000bpd oil handling, a 20MMscf gas handling processing equipment and 20,000bpd export facilities.\nCommenting on the field development, the CEO, Green Energy International Limited, Prof. Anthony Adegbulugbe, said: “the production ramp up will make GEIL the highest producer amongst marginal field producers in Nigeria.\nHe also confirmed that drilling of this first two wells is part of a staged approach to the field phase 2 development.\nAdegbulugbe reconfirmed that Green Energy International Limited will continue to earn the trust and respect of all its stakeholders by acting with integrity and operating with the highest ethical standards."
  },
  {
    "headline": "Kebbi business mogul signs N100m cheque for Tinubu’s presidential form",
    "summarized_story": "The message reads: “Director General Tinubu Support Organisation (TSO) Hon.\nAminu Suleiman signs N100m cheque to purchase APC presidential form For Asiwaju Bola Ahmed Tinubu.\n“The only thing I can do right now is to buy the N100m APC Presidential Expression of Interest Form and Nomination Form for his father and mentor.\n“Asiwaju Bola Ahmed Tinubu is the man of every moment and he will transform Nigeria when he becomes the President.\nOladosu, who doubles as the founder and the National Coordinator Yoruba Patriots Movement (YPM) since 2015, said “Aminu Suleiman is the Next Level Forum Coordinator for the North West."
  },
  {
    "headline": "BREAKING: Osinachi: ‘Information implicates husband’ – IGP reveals police probe",
    "summarized_story": "Inspector-General of Police, Usman Baba has assured the public that the security agency was making progress in the probe of Osinachi Nwachukwu’s death.\nThe demise of the famous gospel musician caused public outcry with citizens and organizations demanding a thorough investigation.\nAt a meeting with Minister of Women Affairs, Pauline Tallen at his office in Abuja on Wednesday, the IGP said the singer’s death was heart-breaking.\nHe revealed that information from sources close to the family and independent witnesses fingered Osinachi’s husband, Peter Nwachukwu, as being responsible for her death.\nBaba said the FCT Command, in whose jurisdiction the incident occurred, arrested Peter at about 5pm on April 10 at their residence in Lugbe, Abuja."
  },
  {
    "headline": "NEC: Buhari warns against imposition as APC decides on 2023 elections",
    "summarized_story": "), has warned leaders of the All Progressives Congress at both national and state levels against factions and imposing unpopular candidates as the 2023 general election approaches.\nThe president gave the warning at the 11th meeting of the National Executive Committee of the All Progressives Congress on Wednesday in Abuja.\n“I call on all party members to abide by all extant laws, rules, and regulations and to leaders of our party to avoid the imposition of candidates that cannot win popular elections.\nAlso, Buhari urged party members to be more mindful of the pitfalls that led to the ouster of the Peoples Democratic Party in 2015.\nAPC pegs presidential nomination form at N100mAPC has pegged its presidential nomination and expression of interest forms at N100 million."
  },
  {
    "headline": "2023: Why Tinubu was absent from APC NEC meeting – Aide",
    "summarized_story": "A chieftain of the All Progressives Congress Bola Tinubu’s media aide, Tunde Rahman, has given a reason why the presidential aspirant was absent at the National Executive Council on Wednesday.\nThe President was joined by his Vice, Prof. Yemi Osinbajo, Chairman of the APC, Senator Abdullahi Adamu, other members of the National Working Committee, Board of Trustees and state governors.\nRahman said the APC constitution does not grant Tinubu permission to attend the meeting.\nMembers of NEC are the President, VP, Senate President, Speaker, State chairmen of the party and members of the national executives of the party,” he said.\nThe NEC meeting was attended by the Vice President, Prof. Yemi Osinbajo, Senate President Ahmad Lawan, Speaker of the House of Representatives, Femi Gbajabiamila, and other principal officers of the National Assembly, APC governors and state party chairmen."
  },
  {
    "headline": "IMF raises Nigeria’s 2022 growth forecast from 2.7% to 3.4%",
    "summarized_story": "By Agency ReportLatest data released by the International Monetary Fund (IMF) has projected the Nigerian economy to grow by 3.4 per cent in 2022, up from 2.7 per cent earlier projected.\nIMF disclosed this on Tuesday in its April World Economic Outlook (WEO) report released as part of activities at the ongoing IMF/World Bank spring meetings.\n“At the same time, economic damage from the conflict will contribute to a significant slowdown in global growth in 2022 and add to inflation.\nThis is 0.8 and 0.2 percentage points lower for 2022 and 2023 than projected in January.\n“Beyond 2023, global growth is forecast to decline to about 3.3 per cent over the medium term,” the report added."
  },
  {
    "headline": "WAISA establishes College of Insurance supervisors",
    "summarized_story": "…as Pius Agboola emerges ChairmanBy Kehinde Ibrahim LagosTHE West African Insurance Supervisors Association (WAISA) has established the College of Insurance Supervisors for the West African Monetary Zone (CISWAMZ).\nThis followed the concurrence of the Committee of Governors of the West African Monetary Zone at their 43rd meeting on August 26, 2021.\nThe regulators are active members of African Insurance Organization (AIO) and the IAIS thus recognize the importance of these arrangements for cooperation and information sharing amongst the six insurance regulators (Gambia, Ghana, Guinea, Liberia, Nigeria and Sierra-Leone).\nThe CISWAMZ is expected to greatly enhance multilateral cooperation and promotion of international standards in fostering favorable investment environments and orderly markets in the West African sub region and beyond.\nIn particular, insurance and insurance-linked financial activities are increasingly crossing national and sectorial boundaries."
  },
  {
    "headline": "Works Ministry’s staff regain access to offices 3 hours after lockout",
    "summarized_story": "According to him, the exercise which has just begun will cover all public and private offices owing the board.\nThe breakdown of the debts showed that the Federal Ministry of Education owed 25,838,275, Federal Ministry of Defence –17,220,775.00 and Federal character commission—10,128,906.25.\nOthers include Civil service commission–2,451,649.50, Revenue mobilisation and fiscal commission—21,683,750.00Federal ministry of Health 14,204,843.75, Fed ministry of Trade & Investment—-19,222,287.50, Federal ministry of Works — 9,998,625.00, Nigeria Security and civil Defence corps wuse–16,583,031.25.\nAttah stated that the FCT Administration is worried about the high amount being owed FCTA.\n“FCT Administration needs enough fund to build infrastructure and keep the city running."
  },
  {
    "headline": "Pension: 2,800 deceased workers’ families get N15.05bn in three months",
    "summarized_story": "RELATIVES of 2,800 deceased workers under the Contributory Pension Scheme got N15.05bn benefits between October and December 2021.\nThe National Pension Commission disclosed this in its quarterly report on approval of death benefits.\nThe pension regulator stated that, “During the quarter under review, approvals were granted for payment of death benefits amounting to N15.05bn to the legal beneficiaries/administrator of 2,800 deceased employees and retirees.\n“This comprised 2,093 public (FGN & state) and 707 private sector employees/retirees.”PenCom recently released the revised regulation on the administration of retirement and terminal benefits.\nIn the regulation, it stated that to process death benefits, the legal beneficiary(ies) of the deceased person must submit relevant documents to the Pension Fund Administrators, including a completed death notification form."
  },
  {
    "headline": "ETAP secures $1.5m pre-seed funding to drive car insurance penetration in Africa",
    "summarized_story": "By Kehinde Ibrahim, LagosETAP, an insurtech startup that makes it easier to buy and claim insurance, has secured $1.5 million in pre-seed funding to grow its team and drive the adoption of much-needed car insurance across Africa.\nDespite longstanding regulation making car insurance compulsory and more than 100,000 car accidents reported between January 2019 and December 2021, only one in five cars in Nigeria are currently insured.\nWith ETAP, the entire process of buying and claiming insurance happens exclusively on a smartphone, enabling a seamless and enjoyable insurance experience for users.\nThis is why we have created Africa’s most powerful car insurance app and we are excited to have raised these funds to bring more users on board.\nWe believe that ETAP will engage with this important role and revolutionize the automotive insurance industry with their powerful technology."
  },
  {
    "headline": "No Decision Has Been Taken Yet On Zoning, Mode Of Primaries – APC Spokesman",
    "summarized_story": "﻿The National Publicity Secretary of the All Progressives Congress (APC), Felix Morka, has said the party is yet to take a decision on zoning, as well as the mode of primaries it will adopt ahead of the 2023 Presidential Election.\nMorka said this on Channels Television’s Politics Today on Wednesday, hours after reports suggested that the party may have decided on the indirect mode of primaries.\nRead Also: APC May Settle For Indirect Primary, Says BaguduReports of the APC adopting the Indirect mode of primaries surfaced earlier in the day following the party’s 11th National Executive Committee meeting which took place at the Transcorp Hotel in Abuja.\n“There was no explicit discussion about the mode of primary but the timetable seems to suggest it is indirect primaries,” Governor Atiku Bagudu of Kebbi State had said after the meeting.\n“The party came to a decision that the value placed on these forms are justified”."
  },
  {
    "headline": "Presidential, Governorship Aspirants To Pay N100m, N50m For Nomination Forms – APC",
    "summarized_story": "Members willing to participate in the presidential primary election of the All Progressives Congress (APC) are to pay N100 million for the nomination and expression of interest forms.\nSimilarly, the nomination and expression of interest forms for those seeking the party’s ticket to contest the governorship election in their respective states cost N50 million.\nAPC National Publicity Secretary, Felix Morka, announced this on Wednesday at a briefing with reporters in Abuja.\nBefore the briefing by the party’s spokesman, President Buhari presided over an extraordinary emergency meeting of the APC National Executive Committee.\nBefore the decision was taken, APC National Chairman, Senator Abdullahi Adamu, began by informing members that the NWC has begun the process of uniting aggrieved members and discussing the coming elections."
  },
  {
    "headline": "Troops Kill Over 27 Boko Haram/ISWAP Terrorists, Rescue Six Female Hostages",
    "summarized_story": "Troops of the Multinational Joint Task Force have killed over 27 Boko Haram insurgents and Islamic State of West Africa Province members within the fringes of the Lake Chad basin in Nigeria, Niger Republic, and Cameroon.\nThe troops in continuation with the Operation Lake Sanity at Forward Operations Base Arege, also rescued six female hostages who were kidnapped by the insurgents from Adamawa, Borno, Gombe, and Yobe states from October 2020 to April 2021.\nAccording to the spokesman of the Multinational Joint Task Force, Colonel Muhammad Dole, about 20 terrorists were neutralised by the Air Task Force who identified intelligence-driven targets which they engaged using multiple sorties in the vicinity of Tumbun Fulani and Tumbun Rago.\nIn another encounter, troops of Sector one in Cameroun neutralised two Boko Haram criminals within the vicinity of Toumbuma, Kerenua, and Chikingudu.\nAt the end of the earlier battle engagement around Tunbun Fulani and Tunbun Rago, six traumatized female hostages were found by the troops who then assisted them and brought them to their location."
  },
  {
    "headline": "Chrisland Scandal: Lagos Govt Grills School Management, Teachers, Parents",
    "summarized_story": "All parties involved in the alleged Chrisland school scandal were scrutinised at the Lagos State Ministry of Education, Education Quality Assurance Conference Hall, Alausa in Ikeja on Wednesday.\nA reliable source told Channels Television that those who attended the meeting were police officers, officials of the Education Quality Assurance, and that of the Directorate of Public Prosecution, Chrisland school authorities including the affected teachers, parents of the affected students.\nRELATEDLagos Govt Shuts Chrisland Schools Over Alleged AbuseNo Child Was Raped ‘On Our Watch’: Chrisland Reacts To Abuse AllegationsAlleged Abuse: Police Invite Chrisland Authorities, Parents, OthersChrisland Scandal: Sharing Child Pornography Attracts 14 Years In Jail – Lagos GovtWednesday’s meeting is the latest development since reports that some students of Chrisland schools were involved in a case of alleged sexual violence in Dubai, United Arab Emirates.\nWhile the Lagos State Government had shut all Chrisland schools in the state following the incident, it has also vowed to ensure justice is done.\nWhile many accused Chrisland of trying to cover up the matter, others claimed the student was raped."
  },
  {
    "headline": "Macron Accuses Le Pen Of Being ‘Dependent’ On Russia",
    "summarized_story": "French President Emmanuel Macron attacked his far-right rival Marine Le Pen for her links to Russia during a televised presidential debate on Wednesday, accusing her of being “dependent” on the Kremlin.\n“You are dependent on the Russian government and you are dependent on Mr Putin,” Macron said, referring to a loan agreed by Le Pen’s party with a Czech-Russian bank which he said was “close to the Russian government”.\nLe Pen replied that she was “an absolutely and totally free woman” and said the loan was a “matter of public knowledge”.\nLe Pen stressed that she was in favour of all the sanctions against Moscow announced since Russian leader Vladimir Putin ordered an invasion of Ukraine on February 24, and she backed supplying arms to Ukraine.\nLe Pen created waves last week when she proposed closer ties between the Western military alliance NATO and Russia once the war in Ukraine was over."
  },
  {
    "headline": "Fmr Slovak PM, Róbert Fico, allies charged with organised crime",
    "summarized_story": "Former three-time Prime Minister Róbert Fico and former Interior Minister Róbert Kaliák, who have dominated Slovakian politics for the past 15 years, were on Wednesday charged with organised crime offenses.\nFico, who is still a member of parliament for the opposition Smer party, cannot be arrested without the legislature’s permission.\nFico was accused of being the leader of a “criminal organization” that includes former police director Tibor Gapár and Slovak oligarch Norbert Bodor, according to the indictment.\nHe stood for president in 2014, while serving his second term as Prime Minister of Slovakia, but was defeated by Kiska by nearly 20 percentage points.\nFico accused Kiska of “making his money from usury on impoverished people,” “misusing his charity for political goals,” and having “close ties to Scientology” during an exceptionally acrimonious campaign."
  },
  {
    "headline": "BREAKING: Lagos GAC okays Sanwo-Olu for second term",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu has secured the consent of the Governance Advisory Council (GAC) to run for a second term in office.\nThe GAC, the apex body within the state ruling political class of All Progressives Congress (APC) approved second term for Sanwo-Olu at its meeting this afternoon at State House, Marina.\nWith the APC governorship election primaries slated for May 27, the speculation on whether Sanwo-Olu will get a second term has become rife among the business and political elites in the state, especially members of the APC."
  },
  {
    "headline": "Akeredolu backs wife's senatorial ambition In Imo",
    "summarized_story": "Ondo state governor, Oluwarotimi Akeredolu has declared support for his wife’s Senatorial ambition.\nThe governor’s declaration was contained in a statement he personally signed.\nOndo First Lady, Betty Anyanwu- Akeredolu has shown interest to run for Imo East Senatorial SeatRecall that the state opposition People’s Democratic Party had on Sunday alleged that the governor was using the state fund to sponsor the wife’s Senatorial ambition in Imo state.\nBut in a subtle response, Akeredolu, in the statement, said he believed in the mission of the First Lady to emancipate women from the shackles of all forms of oppression.\nHe described her as a fiercely independent personality who is never afraid to voice her dissent on any issue."
  },
  {
    "headline": "Why brilliant people like Moghalu may never get chance to rule Nigeria -",
    "summarized_story": "Veteran Journalist and Public Affairs Analyst, Babajide Kolade-Otitoju says he longs for the day the current ruling class will fade out and the rein of leadership will be held by young, bright energetic minds like Kingsley Moghalu.\nHe however shares reasons why his wish may not come to pass."
  },
  {
    "headline": "Miki Igini: 2023 Elections Will Be Difficult to Rig",
    "summarized_story": "A viral video shows hoodlums forcing registrants to lie on the ground while destroying registration materials and vowing that elections would not hold in the South-East.\nIn the video, an Independent National Electoral Commission worker identified as Anthony Nwokorie, was shot dead by gunmen while conducting the continuous voter registration in the Ihitte Uboma Local Government Area of Imo State.\nFollowing the violent assaults on its assets and staff, the electoral body has expressed fears over the 2023 elections, stating that there would be no results at polling units where violent incidents were orchestrated.\nMenawhile, President Muhammadu Buhari, Tuesday, assured the Nigerian people that with advancement in technology by the Independent National Electoral Commission (INEC), the 2023 elections would be different and prevent individuals from claiming millions of votes at elections.\nThe Resident Electoral Commissioner in Akwa Ibom State, Mike Igini is our guest."
  },
  {
    "headline": "Wike Will Lose Says Ganduje + Ivory Coast President Picks Central Bank Chief- Trending With Ojy Okpe",
    "summarized_story": "President Of Ivory Coast Alassane Ouattara has named the governor of a regional central bank Tiemoko Kone as his deputy, making him the front-runner to become the next leader of the world’s biggest cocoa grower.\nIn a video that is now making the rounds on social media, Governor Ganduje told Governor Wike during his courtesy visit to Kano state to solicit support for his presidential bid, that he appreciates his efforts in vying for President but that he will lose the election.\nJonathan Olakunle, also known as the ‘Environment Spiderman’ has embarked on a quest to stop improper waste disposal in Osogbo, Osun State.\nOlakunle says he started the environmental clean up exercise in 2004 because he wasn’t happy with the way he saw waste littering his neighbourhood."
  },
  {
    "headline": "Wimbledon to Ban Russian and Belarusian Players Over Ukraine Invasion",
    "summarized_story": "Wimbledon organisers are to announce a full ban of all players from Russia and Belarus at this year’s championships.\nThe move will mean world No 2 Daniil Medvedev and the former world No 1 Victoria Azarenka will not be competing at the All England Club this summer because of the invasion of Ukraine.\nThe tournament will be the first to suspend players from the countries.\nThere are four Russian men in the top 30 and two in the top 10, the currently injured Medvedev (ranked 2) and Andrey Rublev (8).\nThere are two Belarusian women players in the top 20 including last year’s Wimbledon semi-finalist Aryna Sabalenka (current world No 4), and one Russian, Anastasia Pavluychenkova."
  },
  {
    "headline": "Soyinka to Buhari: Pardoning Dariye, Nyame Means ‘It Is Finished’",
    "summarized_story": "Nobel Laureate, Professor Wole Soyinka, on Tuesday joined the growing number of eminent Nigerians and groups that have condemned President Muhammadu Buhari’s decision to grant a presidential pardon to former governors, Joshua Dariye and Jolly Nyame.\nIn a similar vein, the National Association of Seadogs (Pyrates Confraternity) on Tuesday condemned the presidential pardon granted to the two former governors convicted for corruption.\nThe NAS Capoon, Mr. Abiola Owoaje, in a statement titled, “Presidential Pardon for Corrupt Ex-governors: Buhari’s death knell for the anti-graft war,” and made available to THISDAY in Yenagoa, said the intention of presidential pardon ought not to be for the likes of Nyame and Dariye.\nOwoaje pointed out that the presidential pardon was inconsistent with Sections 15(5), 17(a) and 42 of the 1999 Constitution, as amended.\nSadly, the presidential pardon has made mockery of the war against corruption."
  },
  {
    "headline": "Nigeria: With Advancement in Technology, No One Can Claim Millions of Votes Again, Buhari Says",
    "summarized_story": "President Muhammadu Buhari, on Tuesday, assured the Nigerian people that with advancement in technology by the Independent National Electoral Commission (INEC), the 2023 elections would be different and prevent individuals from claiming millions of votes at elections.\nHe however, noted that, “We have the land, we have the resources, and we have the people.\nThe federal government has to redouble its effort, otherwise, the joker card is with the people of Nigeria.\nNigeria is very close to the Thomas Hobbes’ ‘state of nature’ where life is described as nasty, brutish and short.\nIn a related development, Diri was decorated as an ambassador against drug abuse by the state command of the National Drug Law Enforcement Agency (NDLEA)."
  }
]