[
  {
    "headline": "There is no successful jailbreak recently, Aregbesola’s aide",
    "summarized_story": "The Media Adviser to the Minister of Interior, Sola Fasure, has said Nigeria has not experienced any successful jailbreak recently.\nHe explained that what the country had experienced was external attacks and not jailbreaks.\n“Let me state that we don’t have jailbreaks but external attacks.\n“What we have had recently were external attacks.\n“The ones that happened in Owerri, Benin and Kabba are external attacks and not jailbreaks."
  },
  {
    "headline": "Flood destroys N300m produce, FG must help farmers – Ondo",
    "summarized_story": "A forum organised by a non-governmental organisation, Live Abundantly, has said true independence is still lacking in Nigeria 61 years after the country got its independence.\nThis was stated on Friday at an event organised to mark Nigeria’s 61st Independence Day anniversary which at Bature Brewery, Victoria Island, Lagos.\nAfter various contributions from the audience on topics such as child labour and insecurity, the chairperson of Live Abundantly, Prince Gbenga Oguntayo, stated, “Whether you are in Nigeria or abroad, only we can change our country.\nI love my country; Nigeria is one of the greatest countries in the world.”Copyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Nigerians in South Africa urge compatriots to defend democracy",
    "summarized_story": "The Nigerian Citizens’ Association in South Africa (NICASA), on Sunday, stressed the need for Nigerians at home to defend the nation’s democracy, in spite of the challenges being faced.\nOkoli quoted the Consul-General of Nigeria to South Africa, Mr Abdukmalik Ahmed, as equally reiterating the need for Nigerians to do everything within their ambit, to defend democracy in their fatherland.\nHM Manta, Nigeria’s High Commissioner to South Africa, as commending the achievements so far recorded by the Federal Government, describing them as encouraging.\n“I urge Nigerians to be law abiding and become good ambassadors of our dear country, Nigeria,” Manta said.\nOkoli explained that the Nigerian envoy, the Consul General, alongside Nigerians living in South Africa were joined by well wishers at Illovo, Johannesburg, to celebrate Nigeria’s independence anniversary."
  },
  {
    "headline": "Kogi govt kicks against smear campaign against Gov Bello",
    "summarized_story": "…Threatens legal actionBy Dirisu Yakubu, ABUJAThe Kogi State government, Sunday, raised the alarm over an alleged smear campaign against Governor Yahaya Bello ahead of the 2023 Presidential election.\nThis came against the backdrop of mounting pressure on the youthful governor to contest the Presidential poll in 2023.\n“With all of these achievements, it is unfortunate that some disgruntled political liabilities are still bent on launching a smear campaign on the person of His Excellency, Alhaji Yahaya Bello and the Government of Kogi State.\n“Despite intense pressure and lobbying from across the country and even Nigerians in diaspora, Governor Yahaya Bello has not told anyone that he is running for President in 2023.\n“We are aware that some vested persons smarting from the failure of the EFCC adventure have decided to move to the next stage."
  },
  {
    "headline": "UNN appoints Gov Emmanuel Guest Speaker for 61st Founders Day",
    "summarized_story": "The University of Nigeria, Nsukka, UNN, has appointed Akwa Ibom State Governor, Mr Udom Emmanuel as Guest Speaker for her 2021 Founders Day of the University of Nigeria, Nsukka (UNN).\nIn his words, “…let me thank the entire University for nominating Akwa Ibom State because I am representing the people first, so I want to appreciate that recognition.\nThis lecture means a lot to us because this is an opportunity to share experiences, interact with the University community which we believe will be beneficial to the people as it will pass information, knowledge and experience to the people and the entire university community’’.\nHe said two reasons informed the choice of Governor Emmanuel as Guest Speaker for the year’s event.\nSecondly, that the University of Nigeria enjoys a historical relationship with Akwa Ibom State because the motion for its establishment was moved by Chief Ibanga Akpabio in May 1955, he added"
  },
  {
    "headline": "Defence ministry says video on its minister with AK-47 fake, mischievous",
    "summarized_story": "The Minister of Defence, retired Maj.-Gen. Bashir Magashi, says the online video trending showing a man hanging an AK-47 Riffle purported to be him is mischievous.\nThe Special Assistant on Media and Publicity to the minister, Mr Muhammad Abdulkadri, in a statement on Sunday, said there was the need to counter the narrative.\nAbdulkadri said: “To claim that the person in the video is Gen. Magashi is false and misinforming.\n“Findings have revealed the undeniable identity of the person in the video as the rector of a Nigerian army college.\n“Going by the verifiable and tenable analysis of the video, the minister is not the person in the video as being portrayed,” he said."
  },
  {
    "headline": "Zamfara police command arrests 69 bandits, collaborators in Sept, says PPRO",
    "summarized_story": "The Police Command in Zamfara, on Sunday, announced that it had successfully arrested 21 suspected notorious bandits and 48 collaborators during various raids it carried out in September.\nSP Muhammed Shehu, the Police Public Relations Officer (PPRO) in the state, made the disclosure at a press briefing in Gusau, on the achievements of the security agencies in the state.\nAccording to the PPRO, five bandits on the wanted list of the security agencies were also neutralized during the raids.\n“As a result of the security agencies’ commitments and sacrifice, tremendous achievements have been recorded, thereby reducing bandits’ attacks, killings and abductions in the last one month.\n“The measures led to blocking the recalcitrant bandits from accessing food, fuel and drug supplies, as well as other essential services."
  },
  {
    "headline": "Police rescue two more abducted victims in Kogi",
    "summarized_story": "The Kogi State Police Command has rescued two more victims from the hands of their abductors.\nDAILY POST recalls that one University don Prof. James Alabi from Kogi State University was abducted six days ago but regained his freedom on Saturday night.\nThe latest kidnapped victims who regained freedom from the hands of their abductors according to the Police Public Relations Officers, (PPRO, in Kogi State DSP William Ovye Aya on Sunday are Chief Idoko Emmanuel and one Paul Onoja.\nThe two victims were kidnapped on Friday, October 1, 2021 at about 8:30PM.\nDAILY POST gathered that some armed hoodlums forcefully abducted the two victims at Emonoja village, and shot one Miss Blessing Akoh on her leg at Enugu Ezike road of Emonoja village."
  },
  {
    "headline": "Kogi: Monarch bans night functions over upsurge of cultism in Lokoja",
    "summarized_story": "In view of the recent upsurge of cult activities in Lokoja and its environs, the Maigari of Lokoja, Alh.\n(Dr.) Muhammadu Kabiru Maikarfi III, has banned all night functions in Lokoja Town till further notice.\nIt was gathered that these notorious gangs use occasions like night weddings to perpetuate their nefarious activities within Maigari Palace, old market, Kabawa, Karaworo a suburb of Lokoja community.\nDAILY POST, however, learnt that the Maigari gave this directive to all Ward Heads and designated Chiefs in Lokoja who have anything to do with night functions.\nThe Sarkin Wasa of Lokoja, Mall."
  },
  {
    "headline": "AAUA lecturer kidnapped in Ondo, abductors demand N10m ransom",
    "summarized_story": "Mayowa Adinlewa, a lecturer of Adekunle Ajasin University, Akungba-Akoko, AAUA, Ondo State has been kidnapped.\nAdinlewa was kidnapped over the weekend along the deplorable Akure-Ikere-Ekiti highway while on his way from Akungba to visit his family at Ikere in Ekiti State.\nWith the wife asking for the location, the lecturer stated that his legs were already burnt due to the heat from the long walk and that his phone would soon be taken from him.\nIt was later that the family contacted the police that their son had been kidnapped.\nI don’t know anything about the demand for ransom.”"
  },
  {
    "headline": "NYSC: Why Buhari should speedily consider Youth Trust Fund – HURIWA",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has called on President Muhammadu Buhari to speedily consider the proposed National Youth Service Corps, NYSC, Trust Fund.\nHURIWA explained that the trust fund would curb youths involvement in crimes, adding that it would have a positive impact on the younger generation.\nHowever, the rights group, in a statement by its National Coordinator, Comrade Emmanuel Onwubiko, said the trust fund would also create a financial autonomy for NYSC.\nHURIWA said NYSC would be able to fund its administrative operations using the funds, when approved.\nIt further stressed that the fund would provide resources for the training and empowering Corps members on skill acquisition and entrepreneurship development."
  },
  {
    "headline": "Buhari mourns Sule Bello, Ibrahim Kefas",
    "summarized_story": "President Muhammadu Buhari has expressed sadness over the death of the People’s Redemption Party (PRP) Chairman, Prof. Sule Bello and former Military Administrator of Delta State, Air Commodore Ibrahim Kefas.\nPresident Buhari described late Prof. Bello as “not only a distinguished historian but also a politician with progressive ideas who took the bold plunge to step into Balarabe Musa’s shoes at a time opportunism was taking over our political culture at the expense of principles.”In a statement signed by the Senior Special Assistant to the President on Media and Publicity, Garba Shehu, and made available to DAILY POST on Sunday, Buhari said: “I’m happy with the involvement of great academics like Prof. Bello in politics because it would go a long way to enhance the quality of our democratic representation.”According to the President, “Prof.\nBello had demonstrated that it was not enough for academics to remain on the periphery as critics, but they should also take an active part in efforts to shape the course of our democracy.”President Buhari also paid tribute to the late Military Administrator of Delta State, Air Commodore Ibrahim Kefas, describing him “as one of our finest military officers who did his job with remarkable professionalism.”He said that “the sacrifices of the fine Air Force officer will never be forgotten and Nigeria will remain eternally grateful for his patriotic services.”"
  },
  {
    "headline": "Defence Ministry discloses identity of official with AK-47 in viral video",
    "summarized_story": "By Okodili Ndidi, Abuja- Advertisement -The Ministry of Defence has given the identity of the man boarding a jeep with AK 47 in a viral video as the Rector of the Nigerian Army College of Environmental Science and Technology (NACEST) Makurdi and not the Minister of Defence, Major General Salihi Magashi (rtd).\nIn the viral video, it was claimed that the person entering the black-dressed in mufti with the AK-47 slung across his shoulder was the Defence Minister.\nBut the Special Assistant to the Minister on Media, Mohammad Abdulkadri in a statement, explained that the person in the video was the Rector of the Nigerian Army College of Environmental Science and Technology (NACEST) Makurdi, who by virtue of his Command position, is statutorily allowed in the Military to sign for weapons when travelling.\nAccording to the statement: “Infact the Army green colour on the Innonson Jeep and the Unit sticker of NACEST on the official Vehicle are enough evidence to neutralise the spurious claim in the clip being referred to as the Official vehicle of the Minister of Defence who uses black Land cruiser jeep like his counterparts in other ministries.\n“Again the Internet fraud star’s desperate attempt to demean the personality of the Defence Minister proved null and void and untenable with the fake picture of the Orderly that wears blue colour of the insignia band of NA Education Corp whereas the Orderly to General Magashi (Name withheld) is of the Corp of the Military Police who uses red berret and MP red hand band on his Camouflage.”"
  },
  {
    "headline": "Fire guts two fuel-laden tankers in Osun",
    "summarized_story": "By Toba Adedeji, Osogbo- Advertisement -There was confusion in Iwo community, Osun State on Sunday when two oil- laden tanker gutted fire.\nThe Nation gathered that the fire engulfed one of the tankers parked within the premises of the company located at Rabsh Imec, Iwo.\nRead Also: Osun couple dies of suspected food poisoning on Independence DayThe cause of the fire is not yet known but it was learnt fire fighters stormed the premises to put the situation under control.\nSpokesperson of Osun State Fire Service, Mr Ibrahim Adekunle confirmed the incident.\nHe said: “Properties worth N7 million were destroyed in the fire but we are able to saved properties worth N2 billion by our quick intervention.”"
  },
  {
    "headline": "Osun couple dies of suspected food poisoning on Independence Day",
    "summarized_story": "By Toba Adedeji, Osogbo- Advertisement -There was pandemonium at Ireti Ayo community along Ijebu-Jesa road in Osun State when the corpse of a couple was found in their apartment.\nOur correspondent gathered that the incident happened on October 1st when one of the residents of the area discovered that the couple was laying on the floor.\nThe neighbours forced their way into the apartment and discovered that the couple is dead.\nShe said: “55-year-old Mr Olasunkanmi Eso and 50-year-old Mrs. Fisayo Eso were found dead on the floor of their dining room.\n“We are waiting for the autopsy report from the hospital to ascertain the actual cause of their death.”"
  },
  {
    "headline": "We must work together to salvage our country –Wike",
    "summarized_story": "From Tony John, Port HarcourtRivers State Governor, Nyesom Wike, has urged Nigerians to work together to salvage the country from its political and socio-economic woes.\nIt behoves of all Nigerians to say, ‘we must work together to salvage our country and we must work together to move this country forward.’ It doesn’t matter where you come from.\nHe noted with delight the quality of leadership demonstrated by Governor Wike in making Rivers home for all Nigerians.\nHe assured the governor that the order does not tolerate extremism, but advocates peace, brotherhood, togetherness, solidarity and progress of the country.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "IPOB woos Yoruba, other agitators on planned one month sit-at- home",
    "summarized_story": "South East self-determination group, the Indigenous Peoples Biafra (IPOB) has begun moves to enlist the support of Yoruba and other agitators for its planned one month sit-at- home if Nnamdi Kanu is not brought to court on October 21The IPOB leader is facing charges bordering on treason and terrorism.\nHe has been in detention at a DSS facility since he was arrested in Kenya and extradited to Nigeria several weeks ago.\n“We advise all oppressed people in Nigeria to be prepared for the one month sit-at-home if the Federal Government and the Department of State Services fail to produce Nnamdi Kanu in court on the next court adjourned date….\nWe must not fail to understand that the Federal Government dread Nnamdi Kanu and Sunday Ighoho two heroes for freedom, and that is why it wants to keep them out of circulation but we must resist the evil plot.\nEvery indigenous nationality in Nigeria has experienced one form of intimidation and humiliation from Fulani hegemony since 1960 till date."
  },
  {
    "headline": "Convention: Showdown looms in PDP over zoning",
    "summarized_story": "From Ndubuisi Orji, Abuja and Tony Osauzo, BeninCrisis is brewing in the Peoples Democratic Party (PDP) over zoning of offices for the October 30 national convention as stakeholders dissatisfied with the proposed zoning formula are warming up for a showdown with the party.\nThe PDP Zoning Committee headed by Enugu State Governor, Ifeanyi Ugwuanyi, had last Thursday, announced the zoning of the chairmanship of the party to the north.\nThe party National Executive Committee (NEC) is expected to ratify the zoning formula on Thursday, at a meeting in Abuja.\nThe PDP Governors Forum, in their earlier intervention in the party crisis, had mooted the idea of barring NWC members from seeking reelection in the forthcoming convention.\nHowever, the plan had not sailed through, as it was opposed in one of the NEC meeting held recently."
  },
  {
    "headline": "White Money wins BBNaija’s N90m grand prize",
    "summarized_story": "By Tosin Ajirire and Rita OkoyeThe battle for a grand prize of N90 million in the Big Brother Naija season 6 reality TV show came to an end yesterday with White Money emerging the winner.\nThe show kicked off on Saturday July 24 with 12 male contestants while 12 female joinied the following day.\nThey were Boma, Saga, Pere, Yousef, White Money, Niyi, Jay Paul, Yerins, Emmanuel, Samie, Cross, Kayvee and Michael.\nBBNaija aired from 7pm on DStv channel 198 and GOtv channel 29 with a simulcast on Africa Magic Showcase, Africa Magic Urban and Africa Magic Family.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "BREAKING: White Money wins BBNAIJA Season 6, Shine Ya Eye Edition",
    "summarized_story": "By Rita OkoyeWhite Money has emerged the winner of Big Brother Naija (BBNaija) reality TV show season six, while Liquorose came second.\nHazel Oyeze Onou who is popularly known as White money is a Nigerian businessman, comedian, musician, actor, and Reality TV Star.\nAs the winner of Big Brother Naija Reality Show Season 6, ‘Shine Ya Eye’ Edition, White Money is entitled to 30 Million Naira Cash Prize, Funded Abeg Digital Wallet, Bitcoins from Patricia, An Apartment from Revolution Plus Properties, and more.\nHe is a housemate at the 6th Season (Shine Ya Eye) of the Big Brother Naija reality show.\nThere was so much likeness and fondness for White Money."
  },
  {
    "headline": "WhiteMoney Wins Big Brother Naija Season 6",
    "summarized_story": "By Vanessa ObiohaAfter spending 70 days in the Big Brother Naija house, WhiteMoney has emerged as the winner of the sixth season of the popular reality TV show.\nBefore parting with them, Big Brother shared some inspiring words with them.\nThe male housemates entered the house on July 24 while the female joined them on July 25.\nAlso, early in the game, Big Brother introduced the wildcards, Maria and Pere.\nThe season recorded a king-size eviction which saw Boma, Michael, Tega and Peace leave on one night."
  },
  {
    "headline": "Ladi Williams Dies of COVID-19",
    "summarized_story": "By Alex EnumahChief Ladi Williams, a senior Advocate of Nigeria and first son of late judiciary giant, Chief Rotimi Williams, is dead.\n“Just received the sad news this morning of the death of Ladi Williams.\nHe was the first child of Chief Rotimi Williams.\nHowever, one of Ladi’s son, Kunle Williams, confirmed the passing of the legal icon in his Facebook page, where he stated that his father died of COVID-19 despite taking the two jabs of the COVID-19 vaccine.\nHe said, “my father passed away this morning from COVID-19 despite being double vaccinated Oxford AstraZeneca”."
  },
  {
    "headline": "Mark, Shema, Lamido Emerge Front-runners in Race for PDP Chair",
    "summarized_story": "The party has, however, summoned an emergency National Executive Committee (NEC) meeting for Thursday, October 7, to consider the report of the Ugwuanyi-led zoning committee.\nInvestigation revealed that the North-central, where Mark hails from is highly favoured by the majority of the northern elders in the party for the chairmanship position.\nThese elders, it was learnt, want the North-west where Shema and Lamido hail from to produce the vice-presidential candidate to a possible southern presidential candidate in the 2023 general election.\n“Northern elders in the party want the chairmanship zoned to the North-central to enable a vice presidential candidate to a southern presidential candidate come from the North-west, given the power bloc.\nThis does not include those who want to seek the positions of president, vice president, governors, and the like."
  },
  {
    "headline": "Terrorists, Bandits Have Formed Alliance, Niger Gov Cries out",
    "summarized_story": "“The bandits have an alliance with terrorists considering their increasing number and the way they plan and carry out their attacks,” Bello said.\nThe bandits informed the monarch that the victims kidnapped from Gatawa and Burkusuma are all in good health.\nThe kidnapped victims, whose names were all written in the letter, consist of nine males, eight females and two children.\nChannels TV reported that the bandits have resorted to sending letters to families of kidnapped victims since the shutdown of telecommunication services in the area.\nIn another development, the Zamfara State Police Command has said it has arrested one of the notorious commanders of bandits, Bello Ruga."
  },
  {
    "headline": "Again, ARISE NEWS MD, Nwogwugwu Emerges Most Powerful Woman in Journalism",
    "summarized_story": "Emma OkonjiFor the second year running, the Managing Director of ARISE NEWS Channel, the broadcast arm of THISDAY Newspapers, Ms. Ijeoma Nwogwugwu, has emerged as the most powerful woman journalist in Nigeria.\nLast year, Nwogwugwu made it to the top of the list of the 25 Most Powerful Women in Journalism Award, organised by WIJAfrica.\nThis year, she maintained the lead position among the selected 25 Most Powerful Women in Journalism.\nAccording to the citation from the organisers of the award, “Nwogwugwu is the undisputed champion of #EndSARS reportage in the year 2020.\nWIJAfrica is the annual gathering of women working in the field of journalism and the media across Africa."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Kill University Student, Burn Offices Of Nigeria's Secret Police, Road Safety Corps In Anambra",
    "summarized_story": "At least one person was killed by unknown gunmen, suspected to be members of the Indigenous People of Biafra (IPOB) in Nnewi, Anambra State on Sunday.\nAlso, it was learnt that the offices of the Department of State Services (DSS) and the Federal Road Safety Corps (FRSC) were razed by the gunmen.\nWATCH: Unknown Gunmen Burn Offices Of Nigeria's Secret Police, Road Safety Corps In Anambra pic.twitter.com/stQpVdEnUt — Sahara Reporters (@SaharaReporters) October 3, 2021One Mfomso Emem (Tailor gal), @Sonsydarling1 tweeted, \"This Nnewi currently being terrorised by IPOB, one of the busiest roundabouts for trading is now left empty.\nSee Also Breaking News BREAKING: Unknown Gunmen Attack Residence Of Lagos Governor's Aide, Joe Igbokwe, Raze Building, VehiclesIgbokwe in a Facebook post on Sunday said some parts of the building were burnt by the gunmen.\nYOU KNOW IT AND I KNOW IT ALSO THAT IPOB IS RESPONSIBLE FOR THE BLOODSHED IN THE SOUTH EAST."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Kill University Student, Burn Offices Of Nigeria's Secret Police, Road Safety Corps In Anambra",
    "summarized_story": "At least one person was killed by unknown gunmen, suspected to be members of the Indigenous People of Biafra (IPOB) in Nnewi, Anambra State on Sunday.\nAlso, it was learnt that the offices of the Department of State Services (DSS) and the Federal Road Safety Corps (FRSC) were razed by the gunmen.\nWATCH: Unknown Gunmen Burn Offices Of Nigeria's Secret Police, Road Safety Corps In Anambra pic.twitter.com/stQpVdEnUt — Sahara Reporters (@SaharaReporters) October 3, 2021One Mfomso Emem (Tailor gal), @Sonsydarling1 tweeted, \"This Nnewi currently being terrorised by IPOB, one of the busiest roundabouts for trading is now left empty.\nSee Also Breaking News BREAKING: Unknown Gunmen Attack Residence Of Lagos Governor's Aide, Joe Igbokwe, Raze Building, VehiclesIgbokwe in a Facebook post on Sunday said some parts of the building were burnt by the gunmen.\nYOU KNOW IT AND I KNOW IT ALSO THAT IPOB IS RESPONSIBLE FOR THE BLOODSHED IN THE SOUTH EAST."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "Thugs Allegedly Loyal To Ogun Governor's Aide Shoot 5 People During Cultural Festival",
    "summarized_story": "Five people were reportedly shot by thugs allegedly loyal to Biyi Adeleye, the Special Adviser on Politics to Ogun State Governor, Dapo Abiodun.\nThe incident was said to have happened at the Afotamodi Festival Day celebration at Isara Remo, held on Sunday at AUD school field, in the Remo North Local Goverment Area of Ogun State.\nIt was learnt that when Adeleye arrived at the venue, some thugs allegedly with him started shooting into the air for no reason, leaving some guests with gunshot wounds.\n\"The incident happened at the Afotamodi Festival Day celebration of Isara Remo, held at AUD school field.\nFive people were recorded to have been shot by thugs loyal to the special adviser to Ogun State Governor on Politics, Hon."
  },
  {
    "headline": "PHOTOS: Buhari arrives Ethiopia for Abiy Ahmed's inauguration",
    "summarized_story": "President Muhammadu Buhari has arrived in Addis Ababa, the Ethiopian capital, for the inauguration of Prime Minister Abiy Ahmed.\nAdvertisementThe president and his entourage were received by the Ethiopian prime minister at Bole International Airport on Sunday.\nBuhari is expected to deliver a goodwill message at the inauguration event scheduled to hold on Monday at Meskel Square.\nThe presidents of Djibouti, Kenya, South Sudan, Senegal, Somalia, Uganda, and the prime minister of the Democratic Republic of Congo are the other African leaders expected at the ceremony.\nAdvertisementBelow are pictures of Buhari’s arrival in Addis Ababa."
  },
  {
    "headline": "PHOTOS: Buhari arrives Ethiopia for Abiy Ahmed's inauguration",
    "summarized_story": "President Muhammadu Buhari has arrived in Addis Ababa, the Ethiopian capital, for the inauguration of Prime Minister Abiy Ahmed.\nAdvertisementThe president and his entourage were received by the Ethiopian prime minister at Bole International Airport on Sunday.\nBuhari is expected to deliver a goodwill message at the inauguration event scheduled to hold on Monday at Meskel Square.\nThe presidents of Djibouti, Kenya, South Sudan, Senegal, Somalia, Uganda, and the prime minister of the Democratic Republic of Congo are the other African leaders expected at the ceremony.\nAdvertisementBelow are pictures of Buhari’s arrival in Addis Ababa."
  },
  {
    "headline": "White Money wins BBNaija season 6, clinches N90m grand prize",
    "summarized_story": "White Money has won the 2021 edition of the BBNaija reality TV show themed ‘Shine Ya Eye’.\nAdvertisementThe housemate beat his rivals to the N90 million prize at the 2021 finale/last eviction show on Sunday.\nAdvertisementAfter the new season kicked off on July 24, White Money had quickly established himself as the fan favourite.\nThe 2021 BBNaija season, which ran for 10 weeks, witnessed several twists and intrigues, including a fake eviction show.\nAs the 2021 winner, the grand prize of N90 million is to be handed out to White Money."
  },
  {
    "headline": "White Money wins BBNaija season 6, clinches N90m grand prize",
    "summarized_story": "White Money has won the 2021 edition of the BBNaija reality TV show themed ‘Shine Ya Eye’.\nAdvertisementThe housemate beat his rivals to the N90 million prize at the 2021 finale/last eviction show on Sunday.\nAdvertisementAfter the new season kicked off on July 24, White Money had quickly established himself as the fan favourite.\nThe 2021 BBNaija season, which ran for 10 weeks, witnessed several twists and intrigues, including a fake eviction show.\nAs the 2021 winner, the grand prize of N90 million is to be handed out to White Money."
  },
  {
    "headline": "Falana: FG treating bandits with kid gloves by failing to label them terrorists",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), has accused the federal government of treating bandits with kid gloves.\nFalana, in a statement on Sunday, said bandits are not different from Boko Haram insurgents who are regarded as terrorists.\nHe accused the federal government of “deliberately refusing” to declare bandits as terrorists.\nThe criminal elements who attack police stations and seize weapons to attack innocent people are terrorists.\nBut the Federal Government has deliberately refused to declare the bandits terrorists and prosecute them."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "What can Nigerians do on the new eNaira website?",
    "summarized_story": "The website of Nigeria’s official digital currency, eNaira, went live on Monday, four days before its planned launch on October 1, as disclosed by Central Bank governor, Godwin Emefiele.\nA welcome note on the website describes the eNaira as a “Central Bank of Nigeria-issued digital currency that provides a unique form of money denominated in Naira.”The website is a central repository where users can find comprehensive information about the official digital currency, but it offers much more than just details of the eNaira.\nDownload the eNaira applicationThe eNaira app (termed “Speed”) can be downloaded from either the Google PlayStore, Apple App Store, or by scanning a QR code on the website.\nJoin the eNaira communityThe community is a social hub where, according to a note on the website, eNaira users across the globe can connect with one another, share their experiences using the digital currency, offer as well as request help.\nThe eNaira website is loaded with very important information and instructions as well as answers to potential questions in the FAQ section."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "Naira crosses the N412/$1 threshold, first time in 6 monthsFor most of the trading session last week the Naira appreciated the I & E FX window, which continued at the end of the week.\nHowever, the Naira is anticipated to hover around N410/$1-N415/$1 threshold in the NAFEX window in the week ahead.\nIn the coming week, oil prices are expected to grow marginally supported by global output disruptions and swelling inventories.\nMoney MarketMultiple SLF inflows supported system liquidity last week causing money market rates to trade lower, for the most part.\nSectoral performance across sectors tracked was positive last week as the NGX-IND was the highest gainer for the week with +6.65%."
  },
  {
    "headline": "Akunyili – Let’s quit the pretence, our lives don’t matter",
    "summarized_story": "Read Also: Gunmen kill Chike Akunyili, husband to late NAFDAC DGDo lives matter to Buhari?\nIf Buhari has lost his feelings about lives he should not be so gallant in telling us.\nSoldiers were reportedly within the vicinity of the incident that claimed eight other lives, including Akunyili’s police escort.\nWhen will he, the police, and the security chiefs quit the pretence to concerns about protecting Nigerians?\nAlready IPOB is being held responsible for the killing, foreclosing investigations, no need to know if groups or individuals other than IPOB killed Akunyili."
  },
  {
    "headline": "61st anniversary: This can’t be freedom, Nigerians cry out",
    "summarized_story": "Nigerians have said that what the country marked last Friday should not be said to be real freedom, as they were still in servitude in all respects.\nSpeaking with BusinessDay, a number of Nigerians said their lives were worse off now than a few years ago by every standard.\nMany Nigerians have indeed not known real freedom despite the country attaining political independence in 1960.\n“The report from Debt Management Office noted that, Nigeria’s Public Debt Stock as at March 31, 2021.\nCompared to the Total Public Debt Stock of N32.916 trillion as at December 31, 2020, the increase in the Debt Stock was marginal at 0.58percent."
  },
  {
    "headline": "JCI honours Alenkhe – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY: Junior Chambers International (JCI), Edo Bronze has bestowed the award of “Personality of the Month of September” on Ace reporter and Crime Correspondent of Edo Broadcasting Service ((EBS), Comrade Festus Alenkhe.\nIn her address at the event which held in Benin City, President of JCI, Edo Bronze, Eson Blessing said that the choice of was informed by his achievements in various endeavours, including, various positions, where he held leadership position.\nHe listed such endevours to include, Edo State Chairman of the Nigeria Red Cross Society and state Chairman of National Youth Council of Nigeria.\nAccording to her, the choice of Alenkhe was widely embraced by members of the JCI, charging the him not to rest on his oars even as he march on to greater heights.\nResponding, Comrade Alenkhe thanked the JCI for the award, which he said would spur him to more commitment in whatever he does."
  },
  {
    "headline": "Edo PDP meets, harmonises ahead of National Convention – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Chapter of the Peoples Democratic Party (PDP) at the weekend held an enlarged stakeholders meeting for harmonization ahead of the party’s National Convention slated to hold at the end of October 2021.\nThe meeting, which was held at New Festival Hall in Government House, Benin City, was attended by the Edo State Governor, Mr. Godwin Obaseki, his deputy, Rt.\nComrade Philip Shaibu, and other top party leaders in the state.\nSpeaking to journalists after the meeting, Obaseki noted, “PDP is organising its convention at the end of October and this meeting is to prepare us for the convention.\nWe want to ensure that we provide the services that we promised our people during the electioneering."
  },
  {
    "headline": "Obaseki, Shaibu, others pay tribute to late Edward Agbonifo, extol exemplary virtues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Saturday led other top government functionaries to pay last tribute to late Dr. Edward Agbonifo, husband of the Chairman, Pentecostal Fellowship of Nigeria, Edo State Chapter and vision-bearer of Family Intercessory Ministries, Pastor (Mrs.) Margaret Agbonifo.\nOsaigbovo Iyoha and Speaker, Edo State House of Assembly (EDHA), Rt.\nObaseki described the late Agbonifo as a true Edo man and unique Christian who dedicated his life to the service of God and humanity.\nHere is an African and a Nigerian man who didn’t feel threatened by the success of his wife.\nEarlier, the wife of the deceased described the late Agbonifo as her editor, English teacher and project director who was never threatened by her success but was rather proud of it."
  },
  {
    "headline": "Suspected Armed Robber Burnt To Death By Irate Mob In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – A middle aged man suspected to be an armed robber on Thursday night met his waterloo when he was burnt to death by an irate mob along Jakpa Road, Uvwie council area of Delta state.\nNIGERIAN OBSERVER learnt that the deceased suspect was part of a four-man gang that had earlier snatched a tricycle otherwise known as Keke Napep from an unidentified individual at gunpoint.\nThe suspect was said to have alighted from the tricycle around the spot, but on sighting some vigilante members, took to his heels.\nRecall that a similar incident that saw a member of a suspected armed robbery gang operating in a Keke Napep lynched, occurred within the area in June.\n“But unfortunately before the police got there a mob had already overpowered the vigilante and set him ablaze."
  },
  {
    "headline": "Pandora Papers: Global investigation exposes secrets of some of Nigeria’s rich and powerful",
    "summarized_story": "The project, known as Pandora Papers, is facilitated by the International Consortium of Investigative Journalists (ICIJ), which obtained a trove of 11.9 million confidential files.\nGlobally, the Pandora Papers investigation will reveal the secret owners of offshore companies, anonymous bank accounts, private jets, yachts, mansions, and artworks by Picasso, Banksy, and other masters.\n“The Pandora Papers investigation is larger and more global than even ICIJ’s landmark Panama Papers investigation, which rocked the world in 2016, spawning police raids and new laws in dozens of countries and the fall of prime ministers in Iceland and Pakistan.\n“The Panama Papers came from the files of a single offshore services provider: the Panamanian law firm Mossack Fonseca.\n“The Pandora Papers series will be even more revealing,” Nicholas Ibekwe, PREMIUM TIMES head of investigations, said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Why have you refused to name Boko Haram sponsors? – Kukah asks Buhari",
    "summarized_story": "Bishop of Sokoto Catholic Diocese, Matthew Hassan Kukah, has asked President Muhammadu Buhari why he has refused to release names of identified sponsors of Boko Haram terrorists, noting that the administration is not sincere in dealing with the terror group.\nBishop Kukah who spoke in a sermon at the Priestly Ordination of Five Deacons at the Holy Family Cathedral, wondered why it is difficult for the government to release names of sponsors of Boko Haram, regretting that “Nigeria is decomposing from within.”Kukah said, “Nigeria is a broken country.\nThe country and people have become so traumatised and sedated by horrible news, that have now become comfortable in ‘this swamp of evil.\n“No number of horrific deaths, murders, sexual violence and kidnapping of children or adults can make us stop our life of debauchery.\n“The federal government has told us it is not ready to publicise the names of those funding Boko Haram."
  },
  {
    "headline": "Gunmen set ablaze DSS, FRSC offices, kill two in Anambra",
    "summarized_story": "Unknown gunmen on Sunday, set ablaze the operational offices of the Department of State Services (DSS) and the Federal Road Safety Corps (FRSC) in Nnewi, Anambra State.\nThe gun-wielding men were said to have operated for hours in the industrial town.\nA source who pleaded anonymity, told the News Agency of Nigeria that the gunmen, who stormed the town, operated in four Sport Utility Vehicles.\nIt was further revealed that two persons who tried to make a video recording of the event were gunned down.\nAccording to him, at about 2pm, October 3, the Command received a distress call of a fire incident in Nnewi."
  },
  {
    "headline": "Whitemoney Wins Big Brother Naija Season Six",
    "summarized_story": "Hazel Oyeze Onou, alias Whitemoney, has won this year’s edition of Big Brother Naija ‘Shine Ya Eye.’He goes home with the N90m grand prize, while Liquorose emerged runners-up and Pere third.\nWhitemoney caught the interest of many Nigerians from his first week in the Big Brother House because of his consistent cooking for housemates."
  },
  {
    "headline": "LG unveils Nigerian Celebrity chief and entrepreneur, Fregz as ambassador",
    "summarized_story": "LG Electronics says it is partnering with a Nigerian celebrity chef, Oritsegbugemi Edward Fregene, popularly known as Chef Fregz to offer Nigerians unique culinary skills while preparing local dishes at home using LG Home Appliance Products.\nThe statement added that as part of the new line up, culinary enthusiasts can watch the Chef Fregz cook up a storm in the kitchen using LG Kitchen Appliances such as Microwave Oven, Gas cooker, and InstaView Refrigerator.\n“At LG, we are deeply committed to our customers’ desire for beautiful products and we have an opportunity to continue connecting consumers with their passions,” said Brian Kang General Manager Home Appliances Division, LG Electronics West Africa Operations.\n“Gbugbemi Fregene’s choice emerge from the way he has built his brand focusing on attracting Nigerian youths by appealing to their passion for new and creative cooking.\nHe is the CEO of the food delivery service, Fregz Á Porter that offers its services to clients across Lagos and Southwest Nigeria."
  },
  {
    "headline": "2023: Kogi Govt Raises Alarm Over Plot To Smear Gov Bello’s Image",
    "summarized_story": "The Kogi state government has raised the alarm over an alleged plot to smear Governor Yahaya Bello’s image ahead of the 2023 presidential election.\nAddressing journalists at its quarterly news briefing on Sunday, the Kogi Commissioner for Information and Communication, Mr Kingsley Fanwo, said the state government was aware of plans to paint the governor in bad light ahead of the 2023 presidential election.\n“With all of these achievements, it is unfortunate that some persons are still bent on launching a smear campaign on the governor and government of Kogi.\n“We hope the media will be vigilant and activate its investigative offices before running with such allegations.\n“Despite intense pressure and lobbying from across the country and even Nigerians in diaspora, Yahaya Bello has not told anyone that he is running for President in 2023."
  },
  {
    "headline": "2023: Kogi Govt Raises Alarm Over Plot To Smear Gov Bello’s Image",
    "summarized_story": "The Kogi state government has raised the alarm over an alleged plot to smear Governor Yahaya Bello’s image ahead of the 2023 presidential election.\nAddressing journalists at its quarterly news briefing on Sunday, the Kogi Commissioner for Information and Communication, Mr Kingsley Fanwo, said the state government was aware of plans to paint the governor in bad light ahead of the 2023 presidential election.\n“With all of these achievements, it is unfortunate that some persons are still bent on launching a smear campaign on the governor and government of Kogi.\n“We hope the media will be vigilant and activate its investigative offices before running with such allegations.\n“Despite intense pressure and lobbying from across the country and even Nigerians in diaspora, Yahaya Bello has not told anyone that he is running for President in 2023."
  },
  {
    "headline": "Man Carrying AK-47 Not Nigerian Defence Minister – Ministry",
    "summarized_story": "The Ministry of Defence has debunked insinuations that the Minister of Defence, Major General Bashir Magashi (retd), was the man purportedly carrying AK-47 rifle in a viral video.\nA statement by the media aide to the Minister, Mohammad Abdulkadri, said investigation has revealed the person in the viral video as the Rector of the Nigerian Army College of Environmental Science and Technology (NACEST), Makurdi, Benue State.\nHe added that the Rector by virtue of his Command position is statutorily allowed in the Military to sign for weapons when travelling.\n“Let it be categorically stated that the Minister of Defence has unpenetrable line of defence capabilities befitting his office that are capable of dealing with any threat and does not need to carry a gun as seen in the video,” he added.\nThe statement, therefore, called on the general public to disregard the false information."
  },
  {
    "headline": "Man Carrying AK-47 Not Nigerian Defence Minister – Ministry",
    "summarized_story": "The Ministry of Defence has debunked insinuations that the Minister of Defence, Major General Bashir Magashi (retd), was the man purportedly carrying AK-47 rifle in a viral video.\nA statement by the media aide to the Minister, Mohammad Abdulkadri, said investigation has revealed the person in the viral video as the Rector of the Nigerian Army College of Environmental Science and Technology (NACEST), Makurdi, Benue State.\nHe added that the Rector by virtue of his Command position is statutorily allowed in the Military to sign for weapons when travelling.\n“Let it be categorically stated that the Minister of Defence has unpenetrable line of defence capabilities befitting his office that are capable of dealing with any threat and does not need to carry a gun as seen in the video,” he added.\nThe statement, therefore, called on the general public to disregard the false information."
  },
  {
    "headline": "Project Zero Hunger Morale Booster To Military, IDPs – Unity Group",
    "summarized_story": "Recall that DEPOWA and NCFRMI recently inaugurated Project ‘Zero Hunger’ on September 30, at the IDP Camps in Durumi, Karu in Abuja and Keffi, Nasarawa State simultaneously.\nSince the launch of the project, DEPOWA President, Barr.\nUAG described the initiative as a morale booster especially to troops of the Armed Forces of Nigeria.\n“We at Unity Advocacy Group hail the initiative and urge well placed Nigerians to support DEPOWA in this laudable project.\n“The Unity Advocacy Group further urge those perpetrating banditry and other crimes to repent and join DEPOWA in making our country a peaceful place.”"
  },
  {
    "headline": "$1.4 Million Malabu largesse: How Aliyu Gusau’s man, Umar Bature was arrested in London",
    "summarized_story": "Mr Tesler also doubles as a friend and ally of Mr Gusau.\nMr Bature was a member of the House of Representatives, where he represented Sokoto North/South Federal Constituency.\nHe is said to have become a “protegee” of Mr Gusau during his days in the Armed Forces.\nIn one of the exhibits submitted by Eni, Mr Tesler explained the role of Mr Bature in the scandal.\nIn one of his disclosures in 2019, Mr Agaev claimed that he was introduced to Mr Etete by Mr Gusau in 2008."
  },
  {
    "headline": "$1.4 Million Malabu largesse: How Aliyu Gusau’s man, Umar Bature was arrested in London",
    "summarized_story": "Mr Tesler also doubles as a friend and ally of Mr Gusau.\nMr Bature was a member of the House of Representatives, where he represented Sokoto North/South Federal Constituency.\nHe is said to have become a “protegee” of Mr Gusau during his days in the Armed Forces.\nIn one of the exhibits submitted by Eni, Mr Tesler explained the role of Mr Bature in the scandal.\nIn one of his disclosures in 2019, Mr Agaev claimed that he was introduced to Mr Etete by Mr Gusau in 2008."
  },
  {
    "headline": "Insecurity: Southeast leaders meet in Enugu Tuesday",
    "summarized_story": "Governors and leaders of Southeast geopolitical zone will on Tuesday, October 5, 2021, converge on Enugu State for an “urgent meeting”.\nThe Nation learnt that the emergency meeting followed the renewed insecurity situation in the region in the past few weeks.\nAccording to a memo sent by Ebonyi Governor and chairman of Southeast Governors Forum, David Umahi, the leaders would in the meeting reach some decisions to “salvage our region that is presently battling with high rate of insecurity”.\nThe meeting, he added, would be attended by Governors of the five States of the zone, Ohanaeze leaders and heads of religious and traditional institutions.\nHe wrote: “Your Excellencies and our highly esteemed leaders, in consultation with our Governors and President of Ohanaeze Ndigbo Worldwide, where a decision for an urgent meeting to be called was reached, may I therefore invite you for an emergency meeting of Southeast Governors, some leaders of Ohaneze, some of our political leaders, some of our religious leaders and some of our traditional leaders."
  },
  {
    "headline": "Again, gunmen kill two in Anambra, attack DSS, NAUTH",
    "summarized_story": "Again, gunmen kill two in Anambra, attack DSS, NAUTHAgain, gunmen kill two in Anambra, attack DSS, NAUTHGunmen operating in four Sport Utility Vehicles (SUVs) on Sunday afternoon killed two persons during an attack in the industrial city of Nnewi.\nThey also set one of the vehicles belonging to the Department of State Service (DSS) ablaze.\nThe Nation gathered that the gunmen struck just as worshippers were rounding off service in their different churches.\nHowever, the source told The Nation the gunmen were friendly with the newspapers free readers at the roundabout area of the town who, he said, actually hailed them.\nThe gunmen later drove round the town, passed through Nkwo Nnewi Triangle and moved towards Nnobi Road."
  },
  {
    "headline": "Unknown Gunmen Attack DSS, FRSC Offices In Nnewi",
    "summarized_story": "Unknown gunmen assaulted the Directorate of State Services (DSS) and the Federal Road Safety Corps (FRSC) headquarters in Nnewi, Anambra State, on Sunday.\n“They later drove through Nkwo Triangle Roundabout and moved towards Nnobi Road.\n“Military armoured vehicle later surfaced and drove round town passing through Emecourt Road.\nThe State Police Command’s spokesperson, DSP Toochukwu Ikenga confirmed an incident of fire in Nnewi, but refused to state categorically the offices involved.\nHe said: “At about 2pm, of 3rd Oct 2021, the command received a distress call of fire incident in Nnewi."
  },
  {
    "headline": "Bandits’ Attacks In Niger Show They’re Terrorists — Gov. Sani-Bello",
    "summarized_story": "Governor Abubakar Sani-Bello of Niger claims that bandits are now collaborating with terrorists to sow havoc in the North-Central area.\nMr Bello addressed journalists on Saturday after visiting Ibrahim Badamosi Babangida Specialist Hospital to witness some soldiers injured in a bandit attack in Shiroro Local Government Area.\n“We have every reason to assume we are dealing with more than just bandits,” Mr Bello continued, “and the newest operations, as well as the manner they coordinate their attacks, confirm that they must have some type of training.”Niger State has recently become a new refuge for bandits and terrorists who have been planning lethal attacks and mass kidnappings.\nSuleiman Chikuba, the chairman of Shiroro Local Government in Niger, revealed on Saturday that terrorists have occupied nearly 500 communities under his control.\n“As the Chairman of Shiroro Local Government Area in Niger State, I can tell you that Shiroro is not just dealing with the issue of banditry, but Shiroro also has a lot of Boko Haram, and I have confirmation of this as the chairman,” Mr Chikuba stated."
  },
  {
    "headline": "BREAKING: Joe Igbokwe’s Country Home Set Ablaze In Anambra [VIDEO]",
    "summarized_story": "Unknown assailants have set fire to the rural home of Joe Igbokwe, a senior member of the All Progressives Congress, APC.\nOn Sunday afternoon, Igbokwe’s house in Nnewi, Anambra State, was raised down.\nThe action was allegedly taken out by the Indigenous People of Biafra, IPOB, according to APC Stewart, who is located in Lagos State.\nMy Study is my greatest regret,” Igbokwe wrote on his known Facebook page.\nJoe Igbokwe had recent accused the IPOB of killing Chike Akunyili husband of late former NAFDAC Director General, Dora Akunyili."
  },
  {
    "headline": "Police Apprehend Three Kidnap Suspects In Niger, Recover Ransom",
    "summarized_story": "The Niger Police Command has detained three people for their alleged participation in abduction.\nHe went on to say that the three individuals were apprehended during the operation.\nThe accused kidnappers’ names, according to the Commissioner of Police, are Abubakar, Aliyu Abubakar, and Mohamed Aliyu.\nHe confirmed, “The suspects confessed to have kidnapped one Alhaji Mohammed Bariki of Magaman Daji village, Nasko LGA where they collected N5 million ransom and one Usman Maiyana of Ibana village Nasko Local Government Area and they collected N3 million as ransom.”He explained that the sum of N100,000 was recovered from them, which was part of the ransom.\nThe Commissioner of Police further explained that the command had deployed an anti-kidnap squad to the area to ensure the arrest of others at large and recover their arms."
  },
  {
    "headline": "Breaking: Whitemoney beats Liquorose, others, wins BBNaija season 6 show, pockets N90m prize",
    "summarized_story": "Popular housemate Whitemoney on Sunday won the sixth edition of the BBNaija season 6 ‘Shine Ya Eye’ show.\nShow host Ebuka Obi-Uchendu who announced him winner at the finale on Sunday night also disclosed that Whitemoney pulled 47% votes to beat closest housemate Liquorose with 22% votesDetails loading…"
  },
  {
    "headline": "Breaking: Liverpool, Manchester City share spoils in Premier League thriller",
    "summarized_story": "Kevin de Bruyne’s deflected late equaliser gave Manchester City a fully deserved point after a moment of genius by Mohamed Salah looked to have earned Liverpool victory in an Anfield thriller.\nReigning champions City and Jurgen Klopp’s Liverpool were each hoping to take over from Chelsea at the top of the table, but this result means Thomas Tuchel’s side stay clear at the Premier League summit.\nCity dominated the first half but wasted a host of chances and were punished when Sadio Mane was the beneficiary of more Salah brilliance to apply a clinical finish to put Liverpool ahead after 59 minutes.\nLiverpool’s lead lasted just 10 minutes until Phil Foden, who tormented the struggling James Milner throughout, took a pass from Gabriel Jesus and fired a low, angled finish across Alisson at the Kop end.\nCity’s performance merited at least a point and they secured it when De Bruyne’s shot took a deflection off Joel Matip to beat Alisson with nine minutes left."
  },
  {
    "headline": "Tragedy! 4 Church members dead as electric cable falls on worshippers",
    "summarized_story": "Up to four persons including two teenagers and two adults were electrocuted after an electric cable fell on worshippers within church premise in Lagos state.\nThe incident occurred at El-Adonai Evangelical Church in Abule-Egba area.\nBlueprint gathered that the worshippers were electrocuted while trying to fix the Church’s flag.\nThe flag’s pole was said to have touched the electrical cable which triggered the shock, according to an eyewitness.\nHowever, the identities of the victims were yet to be verified and authorities were yet to confirm the development as at the time of filling this report."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "NCAA refutes ban on travelers without proof of vaccination -NigPilot",
    "summarized_story": "Nigerian Civil Aviation Authority , NCAA has refuted trending reports that the Federal Government through the NCAA has given a directive that from December 1 this year, travelers without proof of vaccination would not be permitted to board both local and international flights.\nThe NCAA in a statement issued on Thursday by its General Manager, Public Relations, Sam Adurogboye, Authority stated that it did not give any such directive.\n“On the other hand, we want to enjoin purveyor of such unfounded news to cross-check facts before publishing.\n“Meanwhile, the Authority will continue to support all Federal Government initiatives to curb the spread of the Delta variant.\n“However, we expect strict adherence to safety protocols in and out of the airports by wearing our facemask, washing our hands periodically, using alcohol-based hand sanitizer, maintaining social distance and avoiding crowded space,” the statement read."
  },
  {
    "headline": "Troops kill 479 terrorists, bandits in September -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ), on Thursday, said that troops in all theatres of operation killed no fewer than four hundred and seventy-nine (479) Boko Haram/Islamic State of West African Province ISWAP terrorists and bandits in the month of September.\nThis is in addition to the one hundred and five (105) terrorist fighters and bandits that were arrested in September.\n“Troops of Operation HADIN KAI sustained the operational tempo in land and air offensives against terrorists and other criminal elements in the North East theatre.\nCumulatively, a total of 85 BHT/ISWAP terrorists were neutralized and 43 terrorists including their collaborators and logistics suppliers were arrested in the course of the various operations.\nAlso, 47 armed bandits, informants and bandits’ collaborators were arrested within the period,” he also revealed."
  },
  {
    "headline": "Bandits Are Terrorists In Reality, Says Senator Bulkachuwa",
    "summarized_story": "﻿Senator Adamu Bulkachuwa says bandits are no different from terrorists, insisting that both groups operate the same way.\nAnybody that does not allow people rest, what is he?”The Senator is one of the latest high-profile Nigerians to have joined calls for bandits and their sponsors to be tagged as terrorists.\nRelated:Declare Bandits As Terrorists, Senate Tells BuhariThese Are Not Just Bandits, They Have Aligned With Terrorists – Gov Bello‘They Are All Terrorists’Earlier on Sunday, a Senior Advocate of Nigeria (SAN), Femi Falana called on the media and Nigerians to stop referring to the criminals as bandits, insisting that they are terrorists.\nAfter all, who is a terrorist and who is a bandit?”According to the lawmaker representing Bauchi North, both bandits and kidnappers should be tagged as terrorists.\n“The bandits, the kidnappers, they are all terrorists,” he maintained."
  },
  {
    "headline": "Death Toll In Kaduna Attack Rises To 14 As Military Recovers Two More Corpses",
    "summarized_story": "A week after bandits attacked Kacecere village in Zango Kataf Local Government Area of Kaduna State killing at least 12 people, troops of the Nigerian military have discovered two more dead bodies from the same attack.\nAccording to the state Commissioner for Internal Security and Home Affairs, Samuel Aruwan, the two bodies were discovered by troops during a search and rescue operation, following the September 27 attack.\nThe dead corpses were identified as Idris Mairiga and Yunusa Dangana, both residents of the village.\nThe new discovery of two corpses now brings the death toll from the Kacecere attack to 14, while that of Madamai stands at 38.\nAruwan says that search and rescue efforts are ongoing in both locations, straddling the two local government areas."
  },
  {
    "headline": "Withdraw ‘Impermissible Conditions On Twitter’, SERAP Tells Buhari",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to “urgently withdraw the impermissible conditions imposed on Twitter pending the final determination of the suit at the ECOWAS Court of Justice in Abuja challenging the legality” of suspending the microblogging platform.\nAccording to a statement on Sunday by its Deputy Director, Kolawole Oluwadare, SERAP urged the president to withdraw the clauses in a bid to allow the court render a decision on the central issues in the case, and protect the plaintiffs’ rights and interests.\nPresident Buhari had stated in his address to mark Nigeria’s 61th independence anniversary, that the Federal Government would only lift the suspension of Twitter in Nigeria if certain conditions, including concerns around national security, are met.\nThe organization said: “The conditions make a mockery of the case pending before the ECOWAS court, and create a risk that the course of justice will be seriously impeded or prejudiced in this case.\n“It is in the public interest to keep the streams of justice clear and pure, and to maintain the authority of the ECOWAS court in the case."
  },
  {
    "headline": "Ending Medical Tourism, Incessant Doctors’ Strike Is Not Rocket Science – Wike",
    "summarized_story": "﻿Rivers State Governor, Nyesom Wike has said that ending foreign medical tourism and incessant strike in Nigeria’s healthcare sector, is not rocket science.\nGovernor Wike said providing the right infrastructure, improving the welfare of medical practitioners and providing quality training opportunities for professionals, like his administration is doing in Rivers State are a simple but visionary approaches to solving the age-long challenge.\nSpeaking further on the process of ending foreign medical tourism, Governor Wike was of the opinion that Nigeria has all it takes to replicate all that is made available to those who travel out of the country to get treated.\nSpeaking at an event marking this year’s Independence Day at the Alfred Diette-Spiff Civic Centre in Port Harcourt, Rivers State, Wike called on Nigerians to make efforts to produce better leaders in coming elections.\nFor 61 years, we have existed and lived together as one independent nation with our destiny in our hands,” Governor Wike stated."
  },
  {
    "headline": "Gunmen Invade, Set Ablaze Joe Igbokwe’s House In Anambra",
    "summarized_story": "Some yet-to-be identified gunmen in Anambra have invaded and set fire on the residence of Joe Igbokwe, a Special Adviser on Drainage and Water Resources to the Lagos State Governor, Babajide Sanwo-Olu.\nBut Igbokwe’s house was not the only building that was attacked in Nnewi during the incident on Sunday.\nThe Anambra State police spokesperson, DSP Tochukwu Ikenga in a statement said the command received a distress call of arson at about 2pm, adding that security operatives have since been sent to the troubled area.\nThe latest raid in Nnewi comes a few days after armed men attacked a police station in Ajalli, Orumba North Local Government Area of Anambra State.\nHowever, the police only confirmed that two policemen sustained gunshot wounds and the station was set ablaze."
  },
  {
    "headline": "Stop issuing threats of strike, Sirika warns aviation unions",
    "summarized_story": "The Minister of Aviation, Hadi Sirika, has warned aviation unions against threatening strikes over conditions of service.\nMr. Sirika said the sector was in a recovery mode, therefore, not the time for threats of industrial actions.\nThe minister was speaking at the Air Transport Services Senior Staff Association (ATSSSAN )’s national delegates’ conference in Ijebu Ode, Ogun State.\nMr Sirika, who was represented by Akin Olateru, Commissioner of the Accident Investigation Bureau (AIB), said the unions should work with aviation agencies.\n“IATA records show that as at 2018, air transport in Nigeria supported 241,000 jobs with a gross value added to GDP of US $1.7b."
  },
  {
    "headline": "Abducted father of Zamfara Assembly Speaker dies in bandits' custody",
    "summarized_story": "The father of the Speaker, Zamfara state House of Assembly, Nasiru Muazu Magarya, have been confirmed deadAfter roughly two months in captivity, Mu’azu Abubakar died of heart failure in the hands of his captors.\nHe was abducted from his home in Zurmi local government area of Zamfara state, along with his second wife, three-month-old kid, and other members of his family.\nElder brother to deceased, Malam Dahiru Saraki Magarya confirmed the development to newsmen in GusauHe said that his brother died of heart failure while in prison, according to a bandit kingpin known as Kachalla, who told him a day before their rescue by security.\nAccording to him, other members of the family were unconditionally rescued by the police in collaboration with other security operatives in Zamfara forest."
  },
  {
    "headline": "NDLEA arrests fake soldier with drugs, intercepts walkie-talkie sets, ammunition, ATM, simcards for bandits",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA, have arrested a suspected fake soldier, Hayatu Galadima, and his accomplice, Hamisu Adamu, while transporting drugs, ammunition, and communication equipment to bandits in Kaduna.\nThe duo were arrested on Friday by an NDLEA patrol squad near the Gwagwalada expressway in Abuja.\nThey indicated that they were taking the exhibits to Kaduna and Kano, while Hayatu Galadima claimed to be a Lance Corporal serving in Ibadan.\nIn raids across Lagos state on Wednesday, 29th Sept, at least two drug dealers were arrested and over 1,213.2kg drugs seized.\nIn Lekki, one Justin Clement, from Michika, Adamawa State was arrested with 500 grams of Cannabis Sativa."
  },
  {
    "headline": "Buhari to attend Ethiopian prime minister's inauguration on Monday",
    "summarized_story": "President Muhammadu Buhari is expected to leave Abuja today Addis Ababa , where Ethiopian Prime Minister Abiy Ahmed will be inaugurated for a second term on Monday.\nThis was revealed in a statement published on Saturday in Abuja by his Special Adviser on Media and Publicity, Mr. Femi Adesina.\nPresident Buhari will be accompanied by Geoffrey Onyeama, Minister of Foreign Affairs, and Ambassador Ahmed Rufai Abubakar, Director-General of the National Intelligence Agency (NIA).\nFollowing Ethiopia’s ruling Prosperity Party’s victory in the country’s parliamentary election on June 21, Prime Minister Ahmed was re-elected for a second term.\nPresident Buhari had already told Prime Minister Abiy Ahmed that Nigeria would continue to support Ethiopia’s unity and territorial well-being, as well as those of all African countries, in a congratulatory statement."
  },
  {
    "headline": "Merck Covid Pill’s Success Slams Moderna Shares, Shakes up Healthcare Sector",
    "summarized_story": "Moderna shares tumbled 13% in midday trading, while Pfizer, which is developing a COVID-19 pill of its own, fell 1.3%.\nFor Moderna investors, the Merck news presented an opportunity to lock in gains after an already stunning run.\nShares of Moderna, which were added to the S&P 500 in mid July, remain up some 220% in 2021 despite Friday’s declines.\nMerck, whose shares were last up about 9%, leads the race in developing the first oral antiviral medication for COVID-19.\n“Merck has kind of been dead in the water to investors for the past couple of quarters,” said Kevin Gade, portfolio manager with Bahl & Gaynor, which owns Merck shares."
  },
  {
    "headline": "Texas Law Sparks Hundreds of US Protests Against Abortion Restrictions",
    "summarized_story": "Women marched by the thousands on Saturday on the Supreme Court, the Texas Capitol and cities across the United States to protest increasing state restrictions on abortion and advocate for maintaining a constitutional right to the procedure..\nThe 660 demonstrations around the United States were largely sparked by a Texas law that bans abortions after about six weeks of pregnancy.\nIn the Texas capital of Austin, hundreds gathered in sweltering heat to denounce the so-called “heartbeat” law signed by Governor Greg Abbott.\nIt bans abortion after cardiac activity is detected in the embryo, usually around six weeks.\nThat is before most women know they are pregnant and earlier than 85% to 90% of all abortions are carried out, experts say."
  },
  {
    "headline": "Globacom Signs Deal with Eutelsat of France for Satellite Deployment in Nigeria",
    "summarized_story": "Globacom, the second-largest telecoms operator in Nigeria by subscriber number and market share, has signed a deal with Eutelsat of France for satellite deployment in the Nigerian market.\nThe Chairman of Globacom, Chief Mike Adenuga, signed on behalf of Globacom, while Eutelsat CEO, Rodolphe Belmer, signed on behalf of Eutelsat of France.\nLikewise, French group, Vocalcom, which already manages the software for Glo telecom’s call centres in Nigeria, is hoping to open a new deal in the mobile-money sphere with Globacom.\nAccording to Adenuga, his franchise’s relationship with the French telecoms giant has been a long and extremely beneficial one.\nWhile inaugurating the centre during his visit to Lagos, President Macron said the centre was aimed at fostering friendship between Nigeria and France."
  },
  {
    "headline": "US May Sanction IOCs in Nigeria, Others for Hydrocarbon Production",
    "summarized_story": "In August, President Muhammadu Buhari finally signed the Petroleum Industry Act (PIA) to spur competition in the sector as well as attract foreign investments.\nBut with the position of the US, many of the expected funding for Nigeria’s fossil fuels may be stranded since oil companies would be circumspect about putting their dollars in the upcoming projects.\nWestern fossil fuel companies planning to develop new projects in Africa would then need to consider the significant risk of regulatory action vis-à-vis the returns on investment in Africa.\nSpeaking from South Africa, the US envoy urged western investors to consider whether fossil fuels were a good commercial opportunity anymore in Africa or anywhere else.\nMost of the big IOCs like Royal Dutch Shell, Mobil, Chevron which operates in the United States also have major investments in Nigeria and could withdraw funding for Nigerian hydrocarbons if threatened in that country."
  },
  {
    "headline": "Nigeria: Mark, Shema, Lamido Emerge Frontrunners in Race for PDP Chair",
    "summarized_story": "Investigation revealed that the North-central, where Mark hails from is highly favoured by the majority of the northern elders in the party for the chairmanship position.\nThese elders, it was learnt, want the North-west where Shema and Lamido hail from to produce the vice-presidential candidate to a possible southern presidential candidate in the 2023 general election.\n“Northern elders in the party want the chairmanship zoned to the North-central to enable a vice presidential candidate to a southern presidential candidate come from the North-west, given the power bloc.\n“To that extent, some are looking at David Mark and or Ibrahim Shema.\nHowever, the source added that the loyalists of former Vice President Atiku Abubakar and former Senate President, Dr. Bukola Saraki are moving to use the court to return Secondus."
  }
]