[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Sri Lanka's President flees as protesters storm home, office",
    "summarized_story": "Protesters demanding the resignation of Sri Lanka's President Gotabaya Rajapaksa gather inside the compound of Sri Lanka's Presidential Palace in Colombo.\nPhoto: AFPSri Lanka’s President Gotabaya Rajapaksa fled his official residence on Saturday shortly before protesters, angered by an unprecedented economic crisis, overran the compound and stormed his nearby office.\nThe colonial-era state mansion is one of Sri Lanka’s key symbols of state power and officials said Rajapaksa’s departure raised questions as to whether he intended to remain in office.\nSoon after the crowd stormed the presidential palace, Rajapaksa’s nearby office also fell into the hands of protesters.\nNine people were killed and hundreds wounded when clashes erupted across the country after Rajapaksa loyalists attacked peaceful protesters outside the president’s office in May."
  },
  {
    "headline": "Alleged extortion: Anambra police to punish errant officers",
    "summarized_story": "The Anambra State Police Command has reacted to an allegation of extortion and unlawful detention which occurred at the Onitsha Central Police Station by ordering an immediate investigation into the matter.\nA human rights activist and Coordinator of Behind Bars Human Rights Foundation, Harrison Gwamnishu, had narrated an incident of arrest, extortion and unlawful detention, carried out by the operatives of the Anambra State Police command, on his social media handle.\nThe human rights activists said Chidiebere was arrested at 7:45pm, thrown into the cell and was released at about 2am, after paying the said amount.\nReacting to the allegation, Ikenga said the commissioner of police, Echeng Echeng, has ordered an investigation into the matter.\n“The Commissioner of Police, CP Echeng Echeng has directed the Assistant Commissioner of Police in charge of X-Squad to investigate and unravel the circumstances surrounding the incident."
  },
  {
    "headline": "Kuje attack: Garang, APC stalwart calls for immediate release of Dariye, others pardoned by Buhari",
    "summarized_story": "By Marie-Therese Nanlong – JosA stalwart of the All Progressives Congress, APC in Plateau State, Dr. Elkanah Garang has called on all relevant authorities responsible for the release of some Nigerians recently pardoned by President Muhammadu Buhari to ensure their immediate release as pronounced by the President.\nHe spoke on the heels of the Tuesday night attack on the Kuje Correctional Centre, Abuja which led to the escape of hundreds of inmates.\nDr. Garang lamented that almost three months after a state pardon was granted to some Nigerians including a former governor of Plateau State, Chief Joshua Dariye, the former governor and others are still in jail at Kuje.\nRead Also:Kuje Prison attack: I’m disappointed at officers deployed to defend facility — AregbesolaKuje Prison attack: Terrorists had superior weapons, FG admitsKuje Prison Attack: You can only run, but can’t hide, FG tells fleeing inmatesThe APC stalwart who aspired for the Mangu/Bokkos federal constituency seat in the recently conducted APC primary election said the continuous incarceration of those pardoned amounted to thwarting the President’s directive.”He relied on the view of a Senior Advocate of Nigeria, SAN, Garba Pwul who noted that Dariye’s release from prison “shouldn’t have delayed for more than 24 hours after a pardon was pronounced by the President, the President being the highest constitutional authority in the country, no other interest or authority can surpass a Presidential order, especially one such as this pardon that is backed by a resolution of the National Council of State.”He, therefore, asked that “Dariye and others pardoned, having survived the invasion should not be subjected to further trauma but be released to recuperate from the shock they witnessed at the correctional centre”#Dr. Elkanah Garang stressed that any further delay in releasing the freed persons amounts to insubordination on the parts of those who ought to have facilitated their freedom.\nVanguard News Nigeria"
  },
  {
    "headline": "Four rescued, two missing as Lagos flood sweeps away cars",
    "summarized_story": "By Esther OnyegbulaSix people have been reportedly swept off by erosion in Fatoki area of Orile Agege, Lagos.\nThree persons were in each vehicle when flood water overflowed an uncompleted drainage and submerged their vehicles.\nAccording to residents at the scene, one of the occupants of the Lexus jeep swam out of the vehicle while residents helped the other two people out.\nThey also helped officials of the Lagos State Fire Service at the scene to rescue the fourth person.\nThe Southwest Coordinator NEMA, Ibrahim Farinloye, confirmed that four of the victims have been rescued, while two are still missing."
  },
  {
    "headline": "Eid-el-Kabir: Okowa felicitates with Muslims, calls for renewal of hope",
    "summarized_story": "Delta Governor and Vice-Presidential Candidate of the Peoples Democratic Party (PDP),Dr. Ifeanyi Okowa, has congratulated Muslims in the country as they celebrate Eid-el-Kabir.\nHe assured of a peaceful Sallah celebration in the state, adding that the state government was liaising with security agencies to ensure that all citizens celebrated in peace and harmony.\nThe governor congratulated the Muslim community in the state on the pious day and thanked them for their contributions and cooperation over the years.\n“This year’s Eid-el-Kabir celebration holding amid rising insecurity and economic challenges calls for deep introspection among citizens, especially for its cost in terms of the enormity of lives and property being lost almost daily across the country.\n“On behalf of the government and people of Delta, I congratulate our Muslim brothers all over the country on the occasion of the 2022 Eid-el-Kabir,” he added."
  },
  {
    "headline": "Another Nigerian pilgrim dies after returning from Mount Arafat",
    "summarized_story": "Ishola Balogun – Saudi ArabiaAnother Nigerian pilgrim, Hasiya Aminu from Kaduna State is dead.\nThe pilgrim died after she returned from the plains of Arafat, Friday evening.\nAminu is the second pilgrim that has died during the 2022 Hajj operations.\nHajiya Aisha Ahmed from Keffi in Nasarawa state died also last week after a brief illness and was buried in Makkah.\nNigerian pilgrims where among the over one million performing the 2022 Hajj operations in Arafat."
  },
  {
    "headline": "Sallah: Our leaders ‘ve failed, pray for them, Obidike charges Nigerians",
    "summarized_story": "Obidike Chukwuebuka, Chieftain of the All Progressives Congress (APC), has urged leaders across the country to use their positions to advocate peaceful co-existence among Nigerians regardless of ethnic, religious and political divides.\nObidike Chukwuebuka who made this statement while receiving some northern youth delegation on a sallah homage in Abuja said, Nigerians should embrace patriotism, selflessness and discipline in their pursuits for the sake of rebuilding the nation.\nIt is a special season and it calls for special prayers for the country and its leadership.\nWe should exhibit piety, selflessness, patriotism and service to humanity in our activities as enshrined in the Holy Quran.\nThe youth leader wished the Muslim Ummah a hitch free and remarkable celebration."
  },
  {
    "headline": "Nigeria currently on life support, needs prayers to survive – Imam, Oloyede",
    "summarized_story": "The Chief Imam of the University of Ibadan, Professor Abdulrahman Oloyede has said that Nigeria is currently on a life support machine.\nOloyede made these declarations on Saturday shortly after he led thousands of Muslim faithful to observe the 2-Rakah obligatory Eld-Kabir prayer at the University of Ibadan Eld prayer ground.\nThe don while addressing journalists after the prayer, insisted that the current crop of political leaders has failed the country because they lost control.\nHe explained that the Eld-Kabir festival is to showcase total submission to God who created human beings.\n“Eld-Kabir is essentially to showcase total submission to the God of creation."
  },
  {
    "headline": "Eid-el-kabir, time for obedience, selflessness, submission to God – Osun Deputy Governor, to Muslims",
    "summarized_story": "The Osun State Deputy Governor, Benedict Alabi has emphasised that Eid-el-Kabir remained significant even as it instilled the conviction of total submission to the will of Almighty Allah in all adherents.\nAlabi also stressed that Prophet Ibrahim’s lifestyle which was characterised by exemplary attributes of obedience and selflessness should be a guiding principle for every Muslim and people of other faiths.\nAlabi who rejoiced with Muslims world over held that the nation’s challenges would be overcome through selfless contribution to the development and growth of Nigeria.\nAccording to him, “I rejoice with all Muslims around the world, and the state of Osun in particular, on this occasion of high spiritual significance.\nHe also charged residents to be guided by the spirit of selflessness and patriotism."
  },
  {
    "headline": "Niger CAN urges Nigerlites to set aside religious, political differences for peaceful coexistence",
    "summarized_story": "The Christian Association of Nigeria (CAN), Niger State Chapter has called on Nigerlites to remain united irrespective of religious and political ideologies to guarantee peaceful coexistence in the state.\nIn an Eid-El Kabir Sallah message, signed by his Media Aide Daniel Atori, the State CAN Chairman, Most Rev Bulus Dauwa Yohanna said charity, fear of God, and love for one another should dominate the daily affairs of Nigerians to achieve the desired progress, peace and unity.\n” I would like to use the medium to implore all Nigerlites to see themselves as one, irrespective of religious and political ideologies, to guarantee peaceful coexistence, one united and indivisible people,” the state CAN chairman stated.\nWhile congratulating the State Governor, Abubakar Sani Bello and his cabinet, Bishop Yohanna commended the security agencies for their efforts in dealing with security challenges.\nHe emphasized the need for Muslims to continue to pray fervently for the well-being of Nigerians and for a peaceful and secure country."
  },
  {
    "headline": "Sri Lanka President flees as citizens, soldiers invade residence over poverty [Video]",
    "summarized_story": "President Gotabaya Rajapaksa of Sri Lanka has fled his official residence.\nDozens, including two police officers, are injured and receiving treatment, the National Hospital of Sri Lanka (NHSL) confirmed.\nThe citizens have been complaining about poverty, cost of living and Rajapaksa’s handling of the economic crisis.\nSome were cooking food in the kitchen as others moved about for a tour of the presidential residence.\nAt least 16 members of parliament from Rajapaksa’s party Sri Lanka Podujana Peramuna have asked him to resign."
  },
  {
    "headline": "Eid-el-Kabir: Embrace life of sacrifice- MACBAN tells Nigerians",
    "summarized_story": "The Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) has called on Nigerians to embrace the life of sacrifice and tolerance.\nThe Chairman of MACBAN, South-East Zone, Gidado Siddiki made the call in a Sallah message to the Muslim Ummah, governments and people of the zone.\nSiddiki said such sacrifice envisaged and upheld the universality of the human family which was the basis of accommodation and tolerance among diverse peoples.\n“We pray for peaceful coexistence among Nigerians and for improved peace and understanding between our herders and their host communities in the South-East.\nThe chairman urged state governments, traditional and religious leaders and opinion leaders not to relent in their advocacy for peaceful coexistence among Nigerians."
  },
  {
    "headline": "Sallah: Remain steadfast in prayers for peace – Gombe governor urges Muslims The Nation Newspaper",
    "summarized_story": "Inuwa Yahaya of Gombe State has urged Muslim faithful to remain steadfast in prayers for peace, prosperity and development of the country.\nThis is contained in a Sallah message by Ismail Misili, Director-General, Press Affairs, Government House, Gombe on Saturday.\n”And in our daily lives for the overall peace and unity of the state and nation,” he said.\nYahaya said such prayers were imperative to address security, social and economic challenges stagnating the nation’s development process.\nHe lauded traditional rulers, community and religious leaders as well as the people of the state for their support to his administration."
  },
  {
    "headline": "Eid-El-Kabir: Only peace, oneness can ensure stability of Nigeria – Sarkin The Nation Newspaper",
    "summarized_story": "Abakaliki, July 9, 2022 (NAN) Alhaji Danjuma Gambo, Sarkin, Hausa Community in Ebonyi says, only peace and oneness can ensure stability of the nation, urging citizens to desist from criminal acts.\nGambo gave the advice after the prayers in Abakaliki on Saturday in celebration of the 2022 Eid-El-Kabir.\nThe Sarkin decried the way the nation had suffered from insecurity including, banditary, kidnapping and acts of terrorism and called for love and peaceful coexistence among citizens.\n“Those causing the trouble should bring their problems to table for settlement because stability of the nation can be achieved only by peace,” he said.\n“All we are asking God is to bring peace for us."
  },
  {
    "headline": "Eid-el-Kabir: APC chieftain urges Nigerians to reflect on love, peaceful coexistence The Nation Newspaper",
    "summarized_story": "Chief Emma Eneukwu, Deputy National Chairman South of the ruling APC, has urged Nigerians to use the Eid-el-Kabir celebration to reflect on love and peaceful coexistence of the country.\nEneukwu, who made the call in a Sallah message on Saturday in Enugu, also urged Muslim faithful to reflect on the things that would unite the nation as one leading to peaceful coexistence.\nHe said that the Sallah season was one that enabled everybody to show love by making sacrifices that would foster peace and unity.\nHe said: “I celebrate with Muslims all over the world on this year’s occasion of the feast of Eid-el-Kabir.\nHe, however, called for support toward the Presidential flag bearer of the ruling party, Sen. Bola Tinubu; while also urging Nigerians to jettison the politics of calumny ahead of the forthcoming 2023 general elections."
  },
  {
    "headline": "Olunloyo in ICU, not dead, says family The Nation Newspaper",
    "summarized_story": "The family of former Oyo Governor Dr Omololu Olunloyo has denied reports of his death.\nBut a family source, who pleaded anonymity, said the renowned mathematician is receiving treatment at the Intensive Care Unit (ICU) of the University College Hospital (UCH) Ibadan.\nThe source said: “We appreciate the public for the interest shown in the well being of our father, Chief Dr. Victor Omololu Sowemimo Olunloyo (aka VOSO).\nMay God Almighty bless you all and our dear country Nigeria.”Another source, who is close to the family, hinted the ex-Governor has been receiving intensive medical attention for some days.\nThe source said as of Saturday morning, the former Governor had received the second pint of blood and was responding to treatment."
  },
  {
    "headline": "Police order investigation of alleged N.6m extortion The Nation Newspaper",
    "summarized_story": "Police in Anambra State have ordered investigation into allegation of extortion of N600,500 by some operatives of the Command at Onitsha Central Police Station.\nGwamnishu however disclosed that the victim was later paid back in full the extorted sum following his group’s intervention.\nBut Echeng, in the statement, vowed to uncover and punish operatives involved in such ignominious act.\n“The Commissioner of Police, CP Echeng Echeng has directed the Assistant Commissioner of Police in charge of X-Squad to investigate and unravel the circumstances surrounding the incident.\n“He also urged citizens to report any Police alterations/Conducts to X Squad and Public Complaints Bureau PCB of the Command.”"
  },
  {
    "headline": "Elon Musk’s $44bn Twitter acquisition deal collapses",
    "summarized_story": "From Adanna Nnamani, AbujaThe $44 billion Twitter acquisition deal by Tesla Chief Executive Officer, Elon Musk has collapsed after he sent a letter to Twitter’s board on Friday saying he is terminating the deal.\nIt is not entirely clear whether Twitter’s board will accept the $1 billion breakup fee or if there will be a court battle over the deal.\nOn Friday, shares of Twitter fell 5% to $36.81, well below the $54.20 that Musk had offered to pay.\nBut six days later, Twitter CEO Parag Agrawal tweeted that Musk will not be joining the board after all.\nIn a regulatory filing prepared by his lawyers, Mr. Musk said he wanted to terminate the Twitter deal because of a continuing disagreement over the number of spam accounts on the platform."
  },
  {
    "headline": "BREAKING: Explosion rocks Matrix tank farm in Delta",
    "summarized_story": "From Joseph Obukata, WarriAn explosion has been reported at Matrix Tank Farm in Ifiekporo, Warri South Local Government Area of Delta State.\nThe explosion occurred from the gas section of the tank farm, multiple sources said Friday night.\nChairman of Warri South Council, Dr. Michael Tidi, also confirmed the incident, calling on residents of Warri to remain calm.\nHe said that the explosion heard in parts of the town Friday night (July 8) which was caused by flame at Matrix Tank Farm at Ifiekporo Community, was being contained.\nAccording to him, the incident may have resulted from loading activities at the tank farm."
  },
  {
    "headline": "APC woos Wike: Fayose leads Fayemi, Akeredolu, Sanwo-Olu to meet Rivers gov",
    "summarized_story": "From Tony John, Port HarcourtThree South West governors of the All Progressives Congress (APC) on Friday, met Rivers State governor, Nyesom Wike, behind closed-door in Port Harcourt.\nThe governors were Kayode Fayemi (Ekiti State), Rotimi Akeredolu (Ondo State) and Babajide Sanwo-Olu (Lagos State) and former Ekiti State governor, Ayo Fayose.\nIn June, Governor Wike had similar visits by Ebonyi State governor, Dave Umahi, of APC and Mr. Peter Obi, the presidential candidate of the Labour Party (LP).\nOther groups that visited Governor Wike at his private residence in Rumuepirikom were the People’s Democratic Party (PDP) Senate Caucus and Bauchi State governor, Bala Mohammed accompanied by some chieftains of the party.\nMeetings by the visitors with Wike were held behind closed-door and there was no media coverage at the end of the different private discussions."
  },
  {
    "headline": "Kuje attack: Boko Haram has superior weapons -FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government on Friday admitted that the terrorists who attacked the Correctional Centre, Kuje in the Federal Capital Territory (FCT) succeeded because of their large number and the superior firepower.\nAccording to him, the security personnel deployed to the facility did their best to repel the attack but were subdued by the superior weaponry of the terrorists.\nI think what helped them (terrorists) was the number of people they came with and the superior weapons that they came with.\nAnd because nobody anticipated it, the few people who are there guarding the place could not withstand the number that they came with.\npresident is surprised that what happened in Kuje actually took place in spite of all the security arrangement that has been made to ensure that such an incident does not happen."
  },
  {
    "headline": "Sallah: Buhari, govs, others greet Nigerians",
    "summarized_story": "In his message, the President assured Nigerians that he won’t rest until he brings relief to Nigerians, adding that he is quite aware of the difficulties people are facing.\nGovernor Hope Uzodimma of Imo State yesterday put the Muslim community in Imo in a celebratory mood by giving them two cows and two truckloads of 50 kilogramme bags of rice to the admiration of their leaders.\nThe entire Muslim community In Imo State which includes the Hausas, the Oba of Yaruba in Imo State, the Chairman and Secretary of the Hausa Community in Imo State and other leaders were around to receive the gifts.\nSpeaker of the House of Representatives, Femi Gbajabiamila urged Nigerian Muslims, to redouble their prayers for the country.\nIn a press statement it released in Lagos, Globacom urged the Nigerian faithful to celebrate with love and to abide by the teachings of the Holy Koran."
  },
  {
    "headline": "Saraki to Nigerians: Don’t Get Tired of Praying Against Insecurity, Economic Crisis – THISDAYLIVE",
    "summarized_story": "Former Senate President, Dr. Abubakar Bukola Saraki, has congratulated Nigerian Muslims and other faithful across the world on this year’s Eid-el-Kabir festival while also urging them not to get tired of praying for peace, security, and prosperity around the globe.\n“The situation in the country is very dire and is threatening to drive happiness away from the land.\n“Nigerian Muslims should rise together and pray for the country and the citizenry.\nWe should ask Allah to forgive our sins and restore peace and prosperity in our country.\nMay the protection of Almighty Allah be on such patriotic and loyal security officials and may He give them victory against the warmongers."
  },
  {
    "headline": "Rufus Giwa Poly Students Protest Alleged Killing of Colleague by Amotekun in Ondo – THISDAYLIVE",
    "summarized_story": "Speaking on behalf of the students, the Students’ Union President, Olorunda Oluwafemi, confirmed that the boy was shot on the 27th of June by an officer of the Amotekun in front of his parents’ house.\nAdemola’s mother was denied access to him until his health worsened and he was referred to a hospital considered to be quack.\nReacting through a statement, the state Commander of Amotekun, Mr. Adetunji Adeleye, said he received with dismay and sadness the news of the death of the student.\nAccording to Adeleye, “after introducing themselves to the men, the men struggled to disarm the operative whose alarm attracted the other two outside.\nHe said that his men eventually overpowered the suspects, arrested and took them to the corps office in Owo where they were detained while investigation continued."
  },
  {
    "headline": "Taraba Pensioners Protest Non Payment of N30bn Entitlements, Threaten to Boycott 2023 Polls – THISDAYLIVE",
    "summarized_story": "Wole AyodelePensioners in Taraba State yesterday took to the streets of Jalingo to protest nonpayment of their pensions and gratuities by the state government.\nDrawn from the 16 local government areas of the state, the pensioners threatened to boycott the 2023 general elections if their over eight years’ entitlements running to over N30 billion is not fully paid.\nNumbering over a hundred, the pensioners stormed the Government House carrying placards with different inscriptions such as ‘We are tired of lies and fake promises’ and ‘Ishaku pay us our money’ from where they proceeded to the State House of Assembly.\nAt the Government House, they were denied entry by the security operatives on duty leading to pandemonium as the protesters rained invective on the government and its officials.\nChairman of the State Chapter of Nigeria Union of Pensioners (NUP), Comrade Kefas Katan who led the protest, told journalists that they staged the protest due to the government’s insensitivity to their plight."
  },
  {
    "headline": "Kwara Spends N4bn on Salaries, Pensions Monthly, Says AbdulRazaq – THISDAYLIVE",
    "summarized_story": "Hammed ShittuKwara State Governor, Alhaji AbdulRahman AbdulRazaq, has said that his administration has spent over N4 billion monthly on payment of salaries and pensions of workers and retirees.\nAbdulRazaq explained that the new Ilorin Urban Masterplan was aimed at attracting local and foreign investors into the state over the next 20 years.\nOtta-Uthman charged the honorary title holders in Ilorin Emirate to serve as agents of peace and unity.\n“We plead with you to work towards ensuring that the unity of purpose we inherited from the founding fathers of Ilorin Emirate is maintained.\nIn his lecture, the guest lecturer, Dr. AbdulSobur Alaaya, emphasised the need for unity amongst the people of Ilorin Emirate and hailed the purposeful and exemplary leadership style of Governor AbdulRazaq."
  },
  {
    "headline": "US Court Says Mobil, Shell May Proceed with Enforcement of $1.8bn Award Against NNPC – THISDAYLIVE",
    "summarized_story": "It said the judge should have determined which parts of the award had been deemed enforceable by a Nigerian appeals court, a Reuters report stated.\nThe dispute arose from a 1993 contract for Esso Exploration and Production Nigeria Ltd and Shell Nigeria Exploration and Production Co to invest billions of dollars to develop the Erha oil field on the Gulf of Guinea, and share profits with NNPC.\nFollowing the arbitration ruling, Exxon and Shell sought to enforce their award in Manhattan while NNPC sought to set it aside in Nigeria.\nThe case is marked Esso Exploration and Production Nigeria Ltd et al v Nigerian National Petroleum Corp, 2nd U.S.\nBut the affiliates, Esso Exploration and Production Nigeria Ltd and Shell Nigeria Exploration and Production Co Ltd, accused NNPC of unilaterally “lifting” more oil than was contractually allowed, at the behest of Nigeria’s government, depriving them of billions of dollars of oil."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "Ex-Army Chief, Buratai Threatens Lawsuit Against SaharaReporters For Exposing Recovery Of Billions Of Naira Meant for Arms, Ammunition In Abuja House",
    "summarized_story": "A former Chief of Army Staff, Lt Gen Tukur Buratai (retd.)\nhas threatened to sue SaharaReporters for exposing the discovery of billions in cash meant for arms and ammunition to fight Boko Haram in his Abuja home.\nBuratai made the threat in a letter signed by his counsel, R.O Atabo, a Senior Advocate of Nigeria (SAN), to the newspaper.\nBurataiSaharaReporters had exclusively reported how the ICPC recovered funds (including foreign currencies) from a house registered to someone fronting for Buratai, a military contractor and Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau.\nThe letter reads partly, “Tukur Buratai (hereafter referred to as “our Client”) on whose firm instruction and authority we write you."
  },
  {
    "headline": "Ex-Army Chief, Buratai Threatens Lawsuit Against SaharaReporters For Exposing Recovery Of Billions Of Naira Meant for Arms, Ammunition In Abuja House",
    "summarized_story": "A former Chief of Army Staff, Lt Gen Tukur Buratai (retd.)\nhas threatened to sue SaharaReporters for exposing the discovery of billions in cash meant for arms and ammunition to fight Boko Haram in his Abuja home.\nBuratai made the threat in a letter signed by his counsel, R.O Atabo, a Senior Advocate of Nigeria (SAN), to the newspaper.\nBurataiSaharaReporters had exclusively reported how the ICPC recovered funds (including foreign currencies) from a house registered to someone fronting for Buratai, a military contractor and Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau.\nThe letter reads partly, “Tukur Buratai (hereafter referred to as “our Client”) on whose firm instruction and authority we write you."
  },
  {
    "headline": "I Can’t Close Shop And Be Chasing Thieves – Peter Obi Says He Won’t Probe Past Administrations If Elected",
    "summarized_story": "According to him, “As for probing the past government, let me tell you; you see me argue that you can’t close your shop and be chasing thieves, those who only look at yesterday and today will miss tomorrow.\nGod did not give us eyes at the back, mine is to look forward.\n“If you come into the government today and decide to stop the leakage first, you will get more.\nI am not going to be part of any form of victimisation or witch-hunt, it won’t happen.\n“We are bringing all Nigerians into this big tent where everybody will be involved because we want to end the primitive politics of ethnicity and religion."
  },
  {
    "headline": "REVEALED: Inside Oyo community where butchers prepare beef with polluted water",
    "summarized_story": "The placid Ogbooro town lies between Saki and Igboho communities in Saki east LGA of Oyo state.\nWhen the abattoir was in operation, water from the stream was used in washing the beef.\nAdvertisement“As for the water used in processing the meat, we depended on water from a nearby stream.\nAdvertisementButchers were asked to relocate to the new state abattoir in the Akinyele area of the state.\nMucky water from a stream flows through the illegal abattoir, which the butchers use in washing the meat during processing."
  },
  {
    "headline": "REVEALED: Inside Oyo community where butchers prepare beef with polluted water",
    "summarized_story": "The placid Ogbooro town lies between Saki and Igboho communities in Saki east LGA of Oyo state.\nWhen the abattoir was in operation, water from the stream was used in washing the beef.\nAdvertisement“As for the water used in processing the meat, we depended on water from a nearby stream.\nAdvertisementButchers were asked to relocate to the new state abattoir in the Akinyele area of the state.\nMucky water from a stream flows through the illegal abattoir, which the butchers use in washing the meat during processing."
  },
  {
    "headline": "'They're only strong on social media' -- Uzodimma aims dig at Labour Party",
    "summarized_story": "Hope Uzodimma, governor of Imo state, has asked All Progressives Congress (APC) members to ignore opposition parties that are “only strong on social media”.\nUzodimma spoke on Friday during a meeting with party members and stakeholders in Imo.\nIn what appears to be a dig at the Labour Party (LP), the Imo governor advised APC loyalists not to be deceived by opposition parties with no political structure.\nAdvertisement“This opposition that is only strong on social media with no political structure on the ground, you are listening to them,” Uzodimma said.\nAdvertisement“But as a people, as a party, I am here as the governor of the state through a political party called APC."
  },
  {
    "headline": "'They're only strong on social media' -- Uzodimma aims dig at Labour Party",
    "summarized_story": "Hope Uzodimma, governor of Imo state, has asked All Progressives Congress (APC) members to ignore opposition parties that are “only strong on social media”.\nUzodimma spoke on Friday during a meeting with party members and stakeholders in Imo.\nIn what appears to be a dig at the Labour Party (LP), the Imo governor advised APC loyalists not to be deceived by opposition parties with no political structure.\nAdvertisement“This opposition that is only strong on social media with no political structure on the ground, you are listening to them,” Uzodimma said.\nAdvertisement“But as a people, as a party, I am here as the governor of the state through a political party called APC."
  },
  {
    "headline": "Kuje jailbreak: Police re-arrest escaped inmate in Nasarawa",
    "summarized_story": "The Nasarawa police command says it has recaptured one inmate that escaped during the recent attack on Kuje correctional centre.\nAdvertisementIn a statement by Ramhan Nansel, spokesman of the Nasarawa police command, the inmate was arrested by the police personnel of the Keffi division following intelligence.\n“On July 9, 2022, at about 1:30 am, one Hassan Hassan ‘M’ whose name and picture was amongst the escapees with Boko Haram/Terrorism Case was recaptured by the Police operatives of the Nasarawa State Police Command at Keffi,” Nansel said.\n“The CP has ordered for the transfer of the suspect to a safer location while the intensive search for other escapees continues.\nHe added that the CP appealed to members of the public to help with useful information on others still on the run."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Digital Nomads: Freelance digital marketer Baraka Mafole wants Tanzanians to thrive in the digital economy",
    "summarized_story": "After discovering that his fellow students were making money online, Mafole decided to join them; he spent hours learning digital skills.\nIn the last decade, the Tanzanian digital ecosystem has evolved as more Tanzanian citizens have access to digital services.\nThis led them to co-found an initiative called Tanzania Digital Trailblazers later that month, a series of virtual events to bring awareness of digital skills to young Tanzanians.\nThis time around, they added physical monthly digital skills training events to the mix.\nMafole said that dozens of Tanzanian youths have connected with his story and have been inspired to upgrade their lives by learning digital skills."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Rita Anwiri Chindah on her life as a lawyer and digital content creator",
    "summarized_story": "Today on Everyday People, we meet Rita Anwiri Chindah, an intellectual property and information technology lawyer and an arbitrator based in Port-Harcourt, Rivers State.\nSo sometimes when I want to record, I have to tell my family, cause I stay with my parents.\nI went there the first time and they said, “Okay, maybe come back next week.”And I went back the following week.\nGet ready to subscribe on Spotify, Apple podcast, google podcast and other platforms.\nWhen you’re trying to Google, trying to read different documents, make sure that you give a brief summary of everything."
  },
  {
    "headline": "Edo strengthening institutions to foster sustainable growth, devt, says Shaibu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Acting Governor, Rt.\nPhilip Shaibu, has said the state is deemphasizing strong individuals and strengthening institutions to foster sustainable growth and development in the state.\nWe are in a state where the human resources that we are blessed with are underutilized.\nNigeria is blessed with natural resources and also blessed with human resources.\nOn his part, Chairman, Edo CIPM, Osahon Omole, hailed the government for its people-centric projects across the state, urging increased collaboration between the state and the organization."
  },
  {
    "headline": "COVID-19 Vaccination: EDSPHCDA Executive Sec calls for mass participation – Nigerian Observer",
    "summarized_story": "She said that the first dose of the vaccine primes the immune system, alerts it of the presence of the virus in the human body and also creates an antibody response.\n“The second dose acts as a booster to ensure immunity is long lasting.\n”Dr. Eloghosa expressed the need for the second dose of COVID-19 vaccination to be passed across Local Government Areas so that everyone who received the first dose of the vaccine can receive their second dose.\nShe urged the State Health Educator, Mrs Irene Uabor to intensify campaign for adequate information on behavioral and attitudinal change towards receiving the second dose of the vaccination.\nAccording to her, Edo State has recorded an improvement in the number of persons that are fully vaccinated and the number of persons that are partially vaccinated."
  },
  {
    "headline": "Priest’s death: Buhari loses trust of Nigerians if he can’t secure the nation – clerics …as Shaibu calls for prayers – Nigerian Observer",
    "summarized_story": "Comrade Philip Shaibu, on Friday, led other top government functionaries to pay last respects to late Rev.\nChristopher Odia, who was gruesomely murdered by suspected kidnappers, with clerics at the event decrying the worsening spate of insecurity in the country.\nOdia, a catholic priest, was allegedly murdered by his kidnappers in Ikabigbo, Etsako West Local Government Area (LGA) of Edo State.\nJohnbosco Ezehi, charged President Muhammadu Buhari to take urgent steps to guarantee the safety and security of Nigerians.\nIf the President cannot keep our country safe, then he automatically loses the trust of the citizens."
  },
  {
    "headline": "Eid-El Kabir: Police Beef Up Security In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command has put in place adequate proactive security measures to ensure peaceful and crime free Eid-el-kabir festivities in the state.\nThe commissioner of police in Edo State CP Abutu Yaro directed all tactical commanders, Divisional Police Officers, DPOs, and their supervisory area commanders to emplace a watertight security in their various areas of operations before, during and after the Sallah celebration.\nShe stated further that CP Abutu Yaro also directed area commanders to increase police intensive patrol, traffic control officers, stop-and-search operations, raids on black spots and other crime-prone locations across the state.\n“He further enjoins all Muslim ummah to be security conscious while celebrating Eid-el-kabir and report any suspicious individual, movement or criminal activities to the police”.\nRecall that the Federal government of Nigeria has declared 11th and 12th July, 2022 public holidays for the celebration."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Tinubu returns to Nigeria after 11 days of ‘strategic meetings’ in France",
    "summarized_story": "Bola Ahmed Tinubu, presidential candidate of the All Progressives Congress (APC), has returned to Nigeria after spending eleven days in France.\nTinubu had left Nigeria for France on June 27 to hold important meetings, a statement by Tunde Rahman, his media aide had said.\nTinubu, who left France on Friday, announced his arrival in Nigeria on his social media handles in the early hours of Saturday.\nHe also shared photos of himself with the caption: “Grateful to Almighty Allah for journey mercies.\nGlad to be home and looking forward to what is ahead."
  },
  {
    "headline": "Danbatta, Ndukwe hail steady rise in broadband penetration",
    "summarized_story": "Nigeria’s broadband penetration recorded a quantum leap in the last seven months from November 2021 with a record of seven million new subscriptions, indicating a steady rise in nation’s quest to achieve 70 per cent national coverage by 2025.\n“Internet subscribers have grown from 90 million in 2015 to 150.36 million as at May 2022.\nAlso, within the period under review, broadband penetration increased from 8 per cent to 43.67 per cent, indicating that over 83.3 million subscribers are on broadband networks of 3G and 4G.\nIndeed, between November 2021 and May 2022, the networks have added 7 million new users,” Danbatta said.\nActive mobile voice subscription also increased from 151 million in 2015 to over 204 million as at May 2022, while teledensity is 107.17 per cent."
  },
  {
    "headline": "Sterling Bank wins best participating bank award under ACGSF for 2021",
    "summarized_story": "Sterling Bank Plc, Nigeria’s leading commercial bank, has won the Best Participating Financial Institution under the National Farmer of the Year 2021 Award of the Agricultural Credit Guarantee Scheme Fund (ACGSF) of the Central Bank of Nigeria (CBN) at the National Award ceremony held in Abuja over the weekend.\nIn a letter informing the bank of the award, Secretary to the board of the ACGSF, Mr. Edwin Nzelu said, “Sterling Bank Plc has distinguished itself under the scheme by its national support to small holder farmers in the year 2021.\n“It is therefore our pleasure to inform you that Sterling Bank Plc has emerged as the 2021 ACGSF Best Participating Financial Institution of the Year in the National Category and would bepresented with the award at the ceremony.”The ACGSF explained that Sterling Bank was recognised for its payout of more than N136.88 million to farmers across the country from January 2021 to December 2021 under the ACGSF.\nAgriculture is one of the five sectors that Sterling Bank has concentrated investments in since 2018 as part of its HEARTs of Sterling programme in a bid to make significant impact in the economy.\nThe Fund guarantees credit facilities extended to farmers by banks up to 75 percent of the amount in default net of any security realised."
  },
  {
    "headline": "Elon Musk opts out of $44bn Twitter purchase deal",
    "summarized_story": "Elon Musk, Tesla CEO has said he is no longer buying Twitter, effectively calling of the much talked about $44 billion deal that has been in the works for months.\nHowever, Elon Musk has notified Twitter of his decision to back out from the deal via a disclosure to the US Security and Exchange Commission, stating a number of reasons why he was backing out from the deal.\nTwitter has, however, denied the claims made by Musk and stating that it will do anything within its power to follow through with the deal.\nElon Musk is expected to pay Twitter $1 billion if he walks away from the deal.\nHowever, this is subject to conditions in the agreement which Elon Musk believes does not require that he pays any money to Twitter"
  },
  {
    "headline": "FG to sell Benin, Kaduna, Kano, other ailing discos’ to new investors",
    "summarized_story": "The Federal Government has disclosed its readiness to sell the majority interest in the Benin, Kaduna, Kano and other ailing electricity distribution companies to competent investors.\nAccording to the BPE boss, Benin, Kaduna and Kano electricity distribution companies were the worst-performing discos among the 11 power distributors in Nigeria.\nHowever, the government’s stance was confronted by resistance by some affected power firms, a development that made the BPE declare on Friday that it would go-ahead to sell the majority interest in Benin, Kaduna and Kano Discos.\n“It was on this basis that new boards reflecting this action were constituted as follows: Kano Disco – Hasan Tukur, Chairman; Nelson Ahaneku, member; and Rabiu Suleiman, member.\n“For Benin Disco, KC Akuma is the Chairman; Adeola Ijose, member; and Charles Onwera, member; while Kaduna Disco has Abbas Jega as Chairman; Ameenu Abubakar, member and Marlene Ngoyi, member."
  },
  {
    "headline": "PDP Leaders’ Defection To Delta APC, Proof Of Omo-Agege’s Attractive Politics – Niboro",
    "summarized_story": "The Delta State APC Gubernatorial Campaign Organisation has described the recent defection of PDP leaders to the All Progressives Congress (APC) as a testament to Senator Ovie Omo-Agege’s attractive style of politics.\nThis is even as the campaign organisation congratulated the Deputy Senate President and Delta APC governorship candidate, Omo-Agege, on the flagging off ceremony of five projects at his Alma Mater, St. George’s Grammar School Obinomba, Ukwuani LGA, Delta State.\nA statement by the director, Communications and Media Strategy, Delta APC Gubernatorial Campaign Organisation, Ima Niboro, on Friday, said during the week, Senator Omo-Agege had led other APC stalwarts to welcome Chief (Barr.)\nGabriel Eko, Alhaji Mohammed Umaru, Arinze Mboka and over 1,000 PDP faithful into APC family in Abraka, Ethiope East local government area of the State.\nHe facilitated the rehabilitation of Asaba/Ugbolu/Illah road in Delta North; renovation, rehabilitation and furnishing of the Nanna Living Museum in Koko, Delta South among others."
  },
  {
    "headline": "PDP Leaders’ Defection To Delta APC, Proof Of Omo-Agege’s Attractive Politics – Niboro",
    "summarized_story": "The Delta State APC Gubernatorial Campaign Organisation has described the recent defection of PDP leaders to the All Progressives Congress (APC) as a testament to Senator Ovie Omo-Agege’s attractive style of politics.\nThis is even as the campaign organisation congratulated the Deputy Senate President and Delta APC governorship candidate, Omo-Agege, on the flagging off ceremony of five projects at his Alma Mater, St. George’s Grammar School Obinomba, Ukwuani LGA, Delta State.\nA statement by the director, Communications and Media Strategy, Delta APC Gubernatorial Campaign Organisation, Ima Niboro, on Friday, said during the week, Senator Omo-Agege had led other APC stalwarts to welcome Chief (Barr.)\nGabriel Eko, Alhaji Mohammed Umaru, Arinze Mboka and over 1,000 PDP faithful into APC family in Abraka, Ethiope East local government area of the State.\nHe facilitated the rehabilitation of Asaba/Ugbolu/Illah road in Delta North; renovation, rehabilitation and furnishing of the Nanna Living Museum in Koko, Delta South among others."
  },
  {
    "headline": "JUST-IN: 16 Passengers Missing As Another Boat Capsizes On Lagos Water",
    "summarized_story": "Three days after a 20-passenger boat ferrying 17 persons capsized and two persons died, another passenger boat ferrying 16 persons on Friday capsized with all passenger onboard declared missing.\nIn a press statement by the General Manager, National Inland Waterways Authority (NIWA) in Lagos, Sarat Braimah, she said the passeger boat was sailing from Mile 2 to Ibeshe, Ojo in Lagos state.\nHe said, “At about 7.45 today the 8th of July 2022, The National Inland Waterways Authority and Lagos State Waterways Authority received a distress call of an incident on the waterways.\n“A W19 passenger Fibre boat carrying 16 persons capsized along the Ojo area of the state.\nIt is said that all passengers on board which include children were not all putting on their life jackets.”According to her, NIWA, Lagos State Waterways Authority (LASWA) and Lagos State Emergency Management Agency (LASEMA), mobilised to to scene of the incident."
  },
  {
    "headline": "JUST-IN: 16 Passengers Missing As Another Boat Capsizes On Lagos Water",
    "summarized_story": "Three days after a 20-passenger boat ferrying 17 persons capsized and two persons died, another passenger boat ferrying 16 persons on Friday capsized with all passenger onboard declared missing.\nIn a press statement by the General Manager, National Inland Waterways Authority (NIWA) in Lagos, Sarat Braimah, she said the passeger boat was sailing from Mile 2 to Ibeshe, Ojo in Lagos state.\nHe said, “At about 7.45 today the 8th of July 2022, The National Inland Waterways Authority and Lagos State Waterways Authority received a distress call of an incident on the waterways.\n“A W19 passenger Fibre boat carrying 16 persons capsized along the Ojo area of the state.\nIt is said that all passengers on board which include children were not all putting on their life jackets.”According to her, NIWA, Lagos State Waterways Authority (LASWA) and Lagos State Emergency Management Agency (LASEMA), mobilised to to scene of the incident."
  },
  {
    "headline": "Nigeria’s Oil Production Rise By 133,000 To 1.16mbpd",
    "summarized_story": "Nigeria’s oil production increased to an average of 1.16 million barrels per day (bpd) in June from 1.02 million recorded in May 2022.\nThe Nigerian Upstream Petroleum Regulatory Commission (NUPRC) said this in its latest crude oil and condensate production data for June 2022.\nWith the addition of condensate, oil output grew to a total of 1.40 million bpd from 1.28 million posted last month.\nIn January, February, March and April, the country’s oil production averaged 1.39 million bpd, 1.25 million bpd, 1.24 million bpd and 1.22 million bpd, respectivelySince April 2020, the country’s output figures stood between 1.02 million bpd and 1.40 million — below the production quota set by the Organisation of Petroleum Exporting Countries (OPEC).\nLack of investment, divestments, operational difficulties and oil theft have been identified as issues bedevilling Nigeria’s oil sector."
  },
  {
    "headline": "Ex-governor Victor Olunloyo in ICU; family appeals for prayers",
    "summarized_story": "Victor Omololu Olunloyo, the governor of Oyo State in 1983, has been moved to the intensive care unit at University College Hospital (UCH) in Ibadan.\nOyo Affairs had earlier reported that Olunloyo, who is the father of social media journalist Kemi Olunloyo, died Friday afternoon in Ibadan.\nHowever, the family confirmed that the 87-year-old man is not dead but in a critical condition that needs prayer.\nThe message from the family reads:“We appreciate the public for the interest shown in the well-being of our father, Chief Dr. Victor Omololu Sowemimo OLUNLOYO (aka VOSO).\n“As a public figure, we believe that his condition should not be hidden from the Nigerian public who have a right to know about their leaders."
  },
  {
    "headline": "Flood sweeps Lexus Jeep, Toyota with 6 occupants; 2 still missing (video)",
    "summarized_story": "A Lexus Jeep and a Toyota car each carrying 3 occupants were swept away by a heavy flood around the Oyatoki area of Agege, Lagos State.\nHowever, the emergency responders quickly swung into action and rescued three persons from the Lexus Jeep.\n“One of the people in the Toyota refused, and dropped down from the vehicle, the other two drove and they are the only ones missing presently.\n“Altogether, three rescued alive, one jumped out to safety, while the remaining two are missing,” he said.\nFarinloye said that emergency responders on the ground included the Lagos State Fire Service, NEMA, LASEMA, Police, and other responders from the community."
  },
  {
    "headline": "JUST IN: Itsekiri host Communities’ Shutdown Chevron’s Olero, Dibi fields",
    "summarized_story": "The Olero, Dibi, and Abiteye Fields’ Itsekiri host communities, who also demand basic facilities and the hiring of VTP 5 and VTP 6 trainees, have forced Chevron to cease operations in Delta State.\nComrade Raymond Aderojo led the protesters, who started the shutdown this morning.\nThey demanded portable drinking water, electricity, health care, a review of undergraduate scholarships, a review of community workers’ salaries, employment for graduates, the location of the vocational training center in Warri so that the VTP Program could resume, and the conversion of VTP 5 and VTP 6 trainees."
  },
  {
    "headline": "Eid-el-Kabir: Buhari in Daura for six-day Sallah festivities",
    "summarized_story": "In a statement released on Friday in Abuja, Garba Shehu, the president’s Senior Special Assistant on Media and Publicity, verified this.\nHe claimed that at 5:15 p.m., the president’s plane landed at Katsina’s Umaru Musa Yar’Adua Airport, where he was met by the governor, Aminu Masari, and other top state officials.\nOn arrival in Daura, the president was received by the Emir, Dr Faruk Umar Faruk, members of the Emirate Council and other district heads.\nHe is expected to return to Abuja July 14."
  },
  {
    "headline": "JUST IN: Tinubu on his way back from France",
    "summarized_story": "JUST IN: Tinubu on his way back from FranceThe APC Presidential candidate, Asiwaju Bola Tinubu is on his way back from France where he had gone for series of meetings.\nThe former governor of Lagos tweeted on his Twitter page that he was on his way back from France.\nTinubu had travelled out of the country to France on June 27 after meeting with President Muhammadu Buhari at the Presidential Villa.\nHe travelled to Paris, France to hold some important meetings, his spokesman, Tunde Rahman had said in a statement.\nOn June 8, Tinubu emerged the Presidential candidate of APC for the February 25, 2023 election at the party’s presidential primaries/national convention held at the Eagle Square, Abuja."
  },
  {
    "headline": "Buhari arrives Daura for Sallah celebration",
    "summarized_story": "President Muhammadu Buhari has arrived his country home in Daura, Katsina State for Eid-el- Kabir celebrations.\nThe President’s plane touched down at the Umaru Musa Yar’Adua Airport in Katsina at 5.15 pm.\nHe was received by Governor Aminu Bello Masari, and other senior State government officials.\nOn arrival in Daura, the President was received by the Emir, Dr Faruk Umar Faruk, members of the Emirate Council and other District Heads.\nAccording to a statement issued by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, after the sallah celebration, the President, who is home with members of his family, will return to Abuja on Thursday, July 14, 2022."
  },
  {
    "headline": "Picture: Police nab fleeing Boko Haram terrorist in Nasarawa",
    "summarized_story": "Nasarawa state police command has arrested one of the terror suspects, who escaped from Kuje prison on Tuesday.\nThe suspect, Hassan Hassan, was one of those whose name and pictures were released by the Nigerian Correctional Service on Friday.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Pictures: APC presidential flagbearer, Tinubu, returns from France",
    "summarized_story": "The presidential candidate of the ruling All Progressives Congress (APC) and former governor of Lagos state, Asiwaju Bola Tinubu, has returned from France.\nSharing some photos in the early hours of Saturday on his official account on Facebook, the candidate captioned them saying, “Grateful to Almighty Allah for journey mercies.\nHitting the ground running, straight back to work!\n#BAT23”The national leader of the ruling party travelled to France on June 27.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "AGF, Abubakar Malami, ‘secretly’ marries Buhari’s daughter",
    "summarized_story": "President Buhari’s daughter, Nana Hadiza, and the Attorney General of the Federation and Minister of Justice, Abubakar Malami, on Friday got married at the Aso Rock Villa.\nThe couple tied the knot in an intimate Nikkai ceremony attended by close family members and some top government officials, Blueprint gathered.\nHadiza was married to Abdulrahman Mamman Kurfi until the marriage collapsed due to irreconcilable differences.\nNo official statement has been issued in confirmation or denial of the reported nuptal bliss.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "Eid-El-Kabir: Muslims Observe Prayers At Eid Grounds",
    "summarized_story": "The annual festival of Eid al-Adha or the Festival of Sacrifice marks the end of the hajj pilgrimage to Mecca by hundreds of millions of Muslims.\nIn Katsina, President Muhammadu Buhari arrived his country home, the Daura area of the north-western state for the Eid-el- Kabir on Friday evening.\nThe two Rak’at prayers led by Imam Safiyanu Yusuf Dansanwai at Kofar Arewa Eid Prayer Ground commenced at about 10:00 am and rounded up at about 10:05 am.\nEarlier before the commencement of the prayer, security was beefed up at the Kofar Arewa Eid prayer ground in Daura.\nSecurity personnel from the Police, the Army, the DSS, the NSCDC and other sister security agencies stormed the Eid Prayer Ground to give maximum security for the President, his entourage and other worshippers attending the Eid Prayer."
  },
  {
    "headline": "Kuje Attack: Fleeing Inmate Linked To Terrorism Arrested In Nasarawa",
    "summarized_story": "One of the suspected terrorists who escaped from the Kuje Correctional Centre during the Boko Haram invasion, Hassan Hassan, has been recaptured in Nasarawa State.\nOn Friday, the Nigerian Correctional Service (NCoS) revealed the names and photos of 69 inmates who escaped from the correctional facility following an attack by terrorists three days ago.\nChannels Television observes that Hassan is number 12 on the list of terrorism suspects released.\nThe Police Public Relations Officer in Nasarawa State announced his arrest via a statement obtained by Channels Television.\nREAD ALSO: Kuje Prison Attack: FG Declares Fleeing Boko Haram Suspects Wanted, Releases PhotosHe said the Commissioner of Police in the state, Adesina Soyemi, has directed the transfer of the suspect while intensifying the search for other fleeing inmates."
  },
  {
    "headline": "Sallah: I Won’t Rest Until I Bring Relief To Nigerians – Buhari",
    "summarized_story": "President Muhammadu Buhari has felicitated Muslims on the Eid-el Kabir celebrations in the country, saying his administration will not rest until it brings relief to Nigerians.\nIn his Sallah message issued by presidential spokesman, Garba Shehu, Buhari said efforts are ongoing to find solutions to the hardship faced by the citizens.\n“I won’t rest until I bring relief to Nigerians.\nI am quite aware of the difficulties people are facing and working to resolve them,” Buhari was quoted as saying.\nIn congratulating the Muslim faithful on the celebration, he called on all Nigerians to be good representatives of their religious beliefs."
  },
  {
    "headline": "In 2023, Social Media Will Vote – Datti Baba-Ahmed",
    "summarized_story": "﻿Vice presidential candidate of the Labour party in the 2023 elections, Datti Baba-Ahmed believes social media support will translate into actual votes in the 2023 elections.\n“Go and start looking at the bookings of major European airlines into Nigeria,” Baba-Ahmed said.\nREAD ALSO: Tinubu Has Agreed To Pick A Muslim Deputy – GandujeIn 2023, social media is going to vote.\nOnly one party is on green fertile land, and that is Labour party.\nI am confident that with Dr Yusuf Datti Baba-Ahmed by my side, we shall ensure that in moving Nigeria forward, no state or community will be left behind."
  },
  {
    "headline": "Canada And Costa Rica Qualify For 2023 Women’s World Cup",
    "summarized_story": "Canada and Costa Rica qualified for the 2023 Women’s World Cup on Friday after winning group stage matches at the CONCACAF W tournament.\nTwo-time defending Women’s World Cup champion United States has already secured a chance to claim a third straight trophy by reaching the CONCACAF semi-finals.\nEither Haiti or Jamaica will take the last available Women’s World Cup berth depending on the outcome of their Monday group-stage match.\nThird-place teams from each group advance to next February’s global playoff for three Women’s World Cup spots.\nGranados scored in the 18th and 45th minutes for Costa Rica while Trinidad and Tobago’s Lauryn Hutchinson netted an own goal in the 33rd and Katherine Alvarado added a final goal for Las Ticas in the 48th."
  },
  {
    "headline": "Three APC Governors visit Nyesom Wike in Port Harcourt",
    "summarized_story": "Rivers State Governor Nyesom Wike held closed door meetin with three governors of the All Progressives Congress in Port Harcourt.\nNyesom Wike received the Governors of Lagos State, Babajide Sanwo-Olu, Ondo State, Rotimi Akeredolu and Ekiti State, Kayode Fayemi at his country home.\nThe visit of the APC governors comes amidst speculations about the political future of Governor Nyesom Wike following the outcome of the PDP Presidential Primaries and the choice of a running mate to the PDP flagbearer, Atiku Abubakar.\nAdvertisementAdvertisementThe crisis worsened after Atiku rejected the recommendation of an ad hoc committee of the party and picked Delta State Governor, Ifeanyi Okowa, as his running mate.\nThe committee was reported to have recommended Mr Wike for the position, although the party later cllaimed that Mr Wike was only one of three nominees recommended by the committee."
  },
  {
    "headline": "Akinlade joins PDP, emerges Adebutu's running mate",
    "summarized_story": "Ladi Adebutu and Hon.\nAdekunle Akinlade are long time allies, who both served at the green chamber from the state in the eighth legislative assembly.\nAkinlade is a strong loyalist of Senator Ibikunle Amosun and had earlier announced his defection from the ruling party, blaming his decision on injustice within the APC."
  },
  {
    "headline": "2023: Labour Party announces Datti Ahmed as Peter Obi's running mate -",
    "summarized_story": "The Labour Party has officially announced Datti Ahmed as Peter Obi’s running mate for the 2023 Presidential Election.\nThis follows the withdrawal of Doyin Okupe from the race in a letter he personally signed and sent to the Independent National Electoral Commission.\nAdvertisement"
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "Sri Lanka Protesters Storm President’s House, Demand Resignation",
    "summarized_story": "Sri Lankan protesters demanding that President Gotabaya Rajapaksa resign forced their way into his official residence on Saturday, a local television report said, as thousands of people took to the streets in the capital decrying the island nation’s worst economic crisis in recent memory.\nIt was not clear if Rajapaksa was inside the residence in Colombo but footage shot on mobile phones showed a large number of people inside the well-fortified house and on the grounds outside.\nPolice had earlier fired tear gas at protesters who surrounded the official residence as they moved toward the main gates.\nThe protesters eventually broke the barricades and entered the house.\nProtesters blame Rajapaksa for the economic woes and have occupied the entrance to his office for three months."
  },
  {
    "headline": "Dr Campbell: Naomi Earns Honorary Doctorate for Work in Fashion",
    "summarized_story": "Naomi Campbell is now Dr. Campbell after receiving an honorary Ph.D. for her contributions to the fashion industry.\nNaomi Campbell just added an honorary Ph.D. from the University for the Creative Arts in England to her list of groundbreaking life achievements.\nThe degree is the perfect fit for Campbell’s ongoing legacy in the fashion world.\nDuring an interview with Reuters that year, she expressed hope that “change” was, at last, coming as brands made promises to better recognize and value Black lives.\nThis included hiring more Black talent “as designers, stylists and make-up artists,” as well as in editorial and executive roles."
  },
  {
    "headline": "Canada Hit By Massive Mobile and Internet Outage",
    "summarized_story": "Canada’s largest mobile and internet provider has suffered a major outage, with bank ATMs and emergency service hotlines affected.\nInternet traffic had dropped to around 75% of its normal level by Friday morning, according to NetBlocks, an internet watchdog organisation.\nRogers is the mobile carrier of nearly 11 million Canadians, with a stake in everything from hockey to cable television.\nToronto’s police department tweeted that some mobile phone users were having trouble calling the emergency services, despite it remaining “fully operational”.\nOn Friday afternoon, the vice-president of Rogers told CBC that the company was still working to identify the “root cause” of the issue."
  },
  {
    "headline": "Kano Governor Ganduje Says APC Presidential Candidate Tinubu Has Agreed to Pick a Muslim VP",
    "summarized_story": "Governor Abdullahi Ganduje of Kano State on Friday claimed that the All Progressives Congress presidential candidate Asiwaju Bola Ahmed Tinubu has agreed to pick a Muslim vice-presidential candidate for Nigeria’s 2023 election.\nIt is not something new in Nigeria.”The Governor asked the clerics to pray for Tinubu to emerge as Nigeria’s president come 2023.\nMeanwhile, Tinubu left France yesterday, where he had travelled to for “important meetings”, for Lagos.\nThe APC presidential candidate, via his official Twitter handle, Friday evening, shared a tweet, “Heading home,” with a link to his Instagram page showing him inside an aircraft.\nA statement issued by his spokesman, Tunde Rahman, in Abuja then said: “He (Tinubu) is off to Paris, France to hold some important meetings."
  },
  {
    "headline": "APC Governors Fayemi, Akeredolu, Sanwo-Olu in Rivers to Woo PDP’s Governor Wike",
    "summarized_story": "Some governors elected on the platform of All Progressives Congress (APC) on Friday met with the Rivers State Governor, Nyesom Wike at his country home in Port Harcourt, apparently to woo him to join the APC ahead of the 2023 elections.\nThe governors who met with Wike yesterday were Kayode Fayemi, Rotimi Akeredolu and Babajide Sanwo-Olu of Ekiti, Ondo, and Lagos states, respectively.\nOthers in their entourage were the Ekiti State Governor-elect, Biodun Oyebanji; former Ekiti State governor and PDP chieftain, Ayodele Fayose, among others.\nThe former vice president is believed to have nominated Okowa, despite the recommendation of Wike for the position by a 17-man committee set up by the party.\n“Wike can be something, but when it comes to mobilisation, impact, value addition and reaching out, Wike is an instrument."
  }
]