[
  {
    "headline": "FG warns Nigerians as COVID-19 cases rise by 630% in 10 days",
    "summarized_story": "Dayo Ojerinde, Deborah Tolu-Kolawole and Bakam ArmstrongThe Federal Government on Thursday warned Nigerians to take responsibility for their health as COVID-19 cases continued to rise in the country.\nMamora said this as COVID-19 cases continued to increase, with the country recording 5,398 infections between December 6 and 15.\nAccording to the report, between November 25 and December 4, the country recorded 749 cases of COVID-19.\nThese countries have high exposure levels already.”Meanwhile, the Bauchi State government has said that it will soon get 350,000 COVID-19 booster doses from the Federal Government.\nHe said,, “Even if you are vaccinated, you can get infected with the mutant Omicron variant of COVID-19, however, the good thing is that people that were vaccinated will not get the severe form of the Omicron variant."
  },
  {
    "headline": "FG warns Nigerians as COVID-19 cases rise by 630% in 10 days",
    "summarized_story": "Dayo Ojerinde, Deborah Tolu-Kolawole and Bakam ArmstrongThe Federal Government on Thursday warned Nigerians to take responsibility for their health as COVID-19 cases continued to rise in the country.\nMamora said this as COVID-19 cases continued to increase, with the country recording 5,398 infections between December 6 and 15.\nAccording to the report, between November 25 and December 4, the country recorded 749 cases of COVID-19.\nThese countries have high exposure levels already.”Meanwhile, the Bauchi State government has said that it will soon get 350,000 COVID-19 booster doses from the Federal Government.\nHe said,, “Even if you are vaccinated, you can get infected with the mutant Omicron variant of COVID-19, however, the good thing is that people that were vaccinated will not get the severe form of the Omicron variant."
  },
  {
    "headline": "10 states, FCT report 1,051 new COVID-19 cases, no death",
    "summarized_story": "Amarachi OkehTen states and the Federal Capital Territory reported 1,051 new cases of COVID-19 on Thursday, according to figures released on Friday by the Nigeria Centre for Disease Control.\nThe agency did not report any new COVID-19 related death.\nThe health agency said the 1,051 new cases of COVID-19 infections have brought the number of confirmed COVID-19 cases in the country to 221, 071.\nHowever, 211,2345 COVID-19 patients have recovered and have been discharged in the country, the agency said.\nWith no additional COVID-19 related death reported, the death toll from the virus stands at 2,983, NCDC said."
  },
  {
    "headline": "10 states, FCT report 1,051 new COVID-19 cases, no death",
    "summarized_story": "Amarachi OkehTen states and the Federal Capital Territory reported 1,051 new cases of COVID-19 on Thursday, according to figures released on Friday by the Nigeria Centre for Disease Control.\nThe agency did not report any new COVID-19 related death.\nThe health agency said the 1,051 new cases of COVID-19 infections have brought the number of confirmed COVID-19 cases in the country to 221, 071.\nHowever, 211,2345 COVID-19 patients have recovered and have been discharged in the country, the agency said.\nWith no additional COVID-19 related death reported, the death toll from the virus stands at 2,983, NCDC said."
  },
  {
    "headline": "You’re a magnanimous president, Obidike extols Buhari @79",
    "summarized_story": "Obidike Chukwuebuka, Friday described President Muhammadu Buhari, as a magnanimous person following the construction of Zik conference center, reactivation of Onitsha seaport and rehabilitation of Enugu international airport.\nAs Buhari celebrates his birthday today, Obidke joined Nigerians and members of the All Progressives Congress in sending warm felicitations to President Buhari on his 79th birthday.\nDisclosing this in a statement Obidike said: “Obidike salutes the President for his deep rooted patriotism, commitment to infrastructural development and devotion to the service of our dear Nation.\nREAD ALSO: APC Govs renew allegiance to President BuhariHe said, “The magnanimity of President Buhari at restoring Nigeria to its glorious days has received unprecedented successes despite challenges facing the world.”“He is an exemplary leader whose life is a guiding beckon that radiates the core principles of accountability in leadership.\nA father of the Nation and the governing APC party, President Buhari has earned a place in the heart of many People both at home and international.”“We won’t forget various federal roads in southeast being constructed by his administration."
  },
  {
    "headline": "Conflicting exparte orders: Chief Judge excited no Federal High Court judge affected",
    "summarized_story": "The Chief Judge (CJ) of Federal High Court (FHC), Justice John Tsoho, on Friday, expressed happiness that none of the judges of the court was involved in the findings of the National Judicial Council (NJC) on the recent conflicting court orders by three judges.\nJustice Tsoho made this known while delivering an opening address at the 37th Annual FHC Judges’ Conference in Abuja.\nThe News Agency of Nigeria (NAN) reports that the NJC, on Thursday, came down hard on three judges from courts of concurrent jurisdiction.\nThe affected judges are Justice Okogbule Gbasam of the High Court of Rivers, Justice Nusirat I. Umar of the High Court of Kebbi and Justice Edem Ita Kooffreh of the High Court of Cross River.\nNAN reports that though the Chief Justice of Nigeria (CJN), Justice Ibrahim Tanko Muhammad, was expected to declare the 2021/2022 conference open, he was conspicuously absent with no representation."
  },
  {
    "headline": "Pay our entitlements before selling Arewa Textiles – Ex Textile workers",
    "summarized_story": "…Say El-Rufai should fulfil campaign promiseBy Ibrahim Hassan-WuyoDistressed former Textile workers in Kaduna State have appealed to the management of Arewa Textile limited to pay their entitlements before selling off the mill.\nRecall that Arewa Textile was closed in 2005 and laid off over 4000 workers who are still hoping to get their entitlements.\n“Our husbands have died without being paid their entitlements, “Arewa Textile management don’t abandon us, pay us our entitlements before you sell the factory” ,were some of the messages on their placards.\nThe Secretary of the Coalition of closed Textile workers Musa Ibrahim told the workers that, “the situation we found ourselves is sympathetic.\nHe told us during his campaign in 2015 that he would make case for the revival of the Textile and pay our entitlements."
  },
  {
    "headline": "How Police arrested suspected rape, ritual kingpin that terrorizes teenage girls in Eastern states",
    "summarized_story": "Based on this, we quickly transferred the case to Zone 13, Ukpor, Anambra State, where fresh investigations commenced.\nHowever, police sources said they are still trying unravel the faith of the girls he went out with during that period.\nWe have all the evidence to show that it is not just a case of rape, but an attempted ritual murder.\nHe also exonerated the hotel management from the escape of the suspect, who has now been arrested by police.\nAlready, the police are handling the matter and the suspects are all reporting to Zone 13, Ukpor-Dunukofia, Anambra State, to answer for their crime."
  },
  {
    "headline": "Year 2022 will be better — Gov. Okowa",
    "summarized_story": "Ifeanyi Okowa of Delta on Thursday has predicted that 2022 will be a better year for Nigerians.\nOkowa made the prediction during the Delta State Festival of Nine Lessons and Carols held at the Stephen Keshi Stadium, Asaba.\nHe said that 2021 was a challenging year for Nigerians but expressed the hope that 2022 would be a better year for the nation.\nHe urged Christians to renew their hope in God as He alone could turn around the fortunes of the people.\n“It is my hope that year 2022 will be better than year 2021 and may the Lord renew your strength and provide you all your needs,” Okowa prayed."
  },
  {
    "headline": "Nine killed, two injured in various attacks in Kaduna",
    "summarized_story": "Nine persons have been killed in various attacks in Chikun, Zangon Kataf, Igabi and Zaria local government areas of Kaduna State, according to a security report.\nIt added that in the Yola-Kadi general area also of Chikun LGA, bandits killed one Danjuma Maiungwa and left another resident injured.\nIt stated that bandits killed two people in Sako village, Zangon Kataf LGA, saying that the victims were identified as Samson Maza and David Garba.\nIn Zaria LGA, according to the statement, one Alhaji Habibu was shot to death by bandits in Saye village.\nGovernor Nasir El-Rufai expressed sadness at these reports and prayed for the repose of the souls of those killed in the attacks while wishing the injured a speedy recovery."
  },
  {
    "headline": "Turkey to help Nigeria tackle insecurity",
    "summarized_story": "President Muhammadu Buhari on Friday said Nigeria will partner with the Republic of Turkey in dealing with the current security challenges facing the nation.\nMr Garba stated that President Buhari, during the meeting, acknowledged that Turkey had garnered a lot of experience dealing with security challenges of various kinds and Nigeria will latch onto that experience.\nI assure you that I will endorse all their positive recommendations,” President Buhari assured Erdogan.\nEarlier, the Turkish leader said that he was happy to receive President Buhari shortly after he paid an official visit to Nigeria.\n“Turkey understands the challenges facing Nigeria and its needs, and we are ready to assist you to meet those needs especially in the area of defence."
  },
  {
    "headline": "El-Zakzaky denies Buhari govt’s claim of giving him N3.5m monthly for feeding",
    "summarized_story": "Sheikh Ibrahim El-Zakzaky, leader of the Islamic Movement of Nigeria, IMN, has reacted to claims of receiving N3.5 million monthly for feeding from the Federal Government.\nAddressing journalists, the Shiite leader said he and his wife fed themselves all through their incarceration.\nAccording to El-Zakzaky: “Throughout our stay in Abuja, we were feeding ourselves, but we could not say because we were feeding ourselves illegally.\nThere was a delay before the Shiite leader was released, despite court rulings.\nIn December 2016, Justice Gabriel Kolawole-led Federal High Court, Abuja, had granted El-Zakzaky and his wife, Zeenatudeen bail."
  },
  {
    "headline": "Niger: Beef up security to curtail banditry – Mashegu residents urge Gov Bello",
    "summarized_story": "The residents made the call in an interview during an on-the-spot assessment by the Niger State Governor, Alh Abubakar Sani Bello, to the communities in the council.\nMohammadu Yahaya of Maza-Kuka said, “since the attacks started, we have been living in fear.\nBut with the visit of the governor, we have hope that more security personnel would be engaged to help in tackling the situation”.\nSpeaking to people of the affected communities, Governor Abubakar Sani Bello decried the killing of worshippers in the Tunga Ba’ari community last week, insisting that the act was unacceptable and condemnable.\nAlso, the Ward Head of Tunga Ba’ari Alh."
  },
  {
    "headline": "Gov Tambuwal orders Sokoto singer’s immediate arrest for hailing bandits’ leader",
    "summarized_story": "Governor Aminu Waziri Tambuwal of Sokoto State has directed the immediate arrest of a musician who praised a bandit leader, popularly known as Bello Turji, in a song.\nDAILY POST reports that in viral music audio, the musician, Mohammed Danshawa, hailed the bandit leader, describing him as “a lion, untouchable and a great leader”.\nThis medium gathered that the governor gave the order to apprehend the singer three days after the song went viral on social media platforms.\nResponding to the song, Governor Tambuwal said, “We ordered for his arrest to serve as a deterrent to others.\nMost of the residents of Sokoto State, who were not comfortable with the song, described the action of the musician as unpatriotic and unacceptable."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Oyinlola: I’ve details of how Akande financed his reelection",
    "summarized_story": "A former Governor of Osun State, Prince Olagunsoye Oyinlola, has alleged that Chief Bisi Akande financed his 2003 re-election by collecting part payment from the contractor building the governor’s office.\nHe said: “On the Osun State Governor’s Office (Bola Ige House contract), Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“But the project consultant shocked everyone with his claim that part of the payment was taken back to finance the 2003 re-election bid of Chief Akande.\nOne of Akande’s appointees confessed collecting money from this contractor for Akande’s re-election.\n“I consulted Chief Akande on this."
  },
  {
    "headline": "‘My father rebelled against my grandfather to embrace Islam’",
    "summarized_story": "Former All Progressives Congress (APC) National Chairman Chief Bisi Akande has said his father, Lawani Bamgbose Akande, rebelled against his grandfather to embrace Islam.\nAkande, in his book, ‘My Participations’, said his grandfather was a Sango devotee.\nAccording to him, his father at some point decided to join a radical Islamic group known as Kewulere.\n“My father joined a group of radical youths known as Kewulere (Islamic prayers have rewards).\nHe was devoted to Sango while his son, my father, Lawani Bamgbose Akande, embraced the new religion of Islam."
  },
  {
    "headline": "3 judges in trouble over conflicting court orders",
    "summarized_story": "From Godwin Tsa, AbujaThe National Judicial Council (NJC) has barred three High Court judges from promotion for five years for issuing conflicting ex-parte orders in the cases involving the former National Chairman of the Peoples Democratic Party (PDP), Uche Secondus .\nThey are Justice Okogbule Gbasam of the High Court of Rivers State; Justice Nusirat I. Umar of the High Court of Kebbi State, and Justice Edem Ita Kooffreh of the High Court of Cross River State.\n“His Lordship is also issued with a warning letter to be circumspect in granting such ex-parte Orders in the future.\n“He is also issued with a warning letter to be circumspect in granting such ex-parte orders in the future.\n“He is also to receive warning letter to be circumspect in granting such ex-parte orders in the future."
  },
  {
    "headline": "Probe Tinubu, Akande’s sources of wealth, Adebanjo urges EFCC",
    "summarized_story": "“But since Bola Tinubu himself was present at the presentation, I expect him within a few days to refute such a malicious falsehood about me emanating from his man.\n“There has been a lot of pressure on me not to react to Chief Bisi Akande’s tantrums; he is a neophyte, a beneficiary of a struggle he never took part in.\n“But I owe a duty to myself and to put the record straight for posterity about the big lie that Bola Tinubu built my house in Lekki for me.\n“I hereby challenge Chief Bisi Akande to clear the air by disclosing the source of financing these properties as I have done above.\n“He should also authorise the EFCC to verify such details as I have done above.”Latest Jobs in Nigeria (Graduates/Non-graduates)."
  },
  {
    "headline": "Kalu rejoices with Buhari at 79",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has described President Muhammadu Buhari as a rare leader with strong passion for the growth and progress of Nigeria.\nExtolling the virtues of the President, Kalu acknowledged the personal attributes of the Nigerian leader, adding that the President is a role model for his contemporaries and the younger generation.\nKalu made these assertions in a goodwill message in commemoration of the 79th birthday anniversary of the President.\n“The accomplishments of the President Buhari- led federal government are remarkable, impressive and worthy of emulation.\n“As President Buhari marks his birthday, I pray for longer life for him in the service of humanity”."
  },
  {
    "headline": "Tambuwal recommends special forces to fight bandits",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State has said declaration of a state of emergency on banditry would enable security operatives access to clear bandits’ enclaves and other hideouts.\nHe said such declaration would allow operatives to work without concerns about rights violations as the bandits were enemies of humanity.\n“The recruited persons shall serve as special forces equipped with right skills and modern firearms to confront bandits since the locals know the terrains.\nAfter the special mission, the recruited persons could be re-engaged as forest guards to prevent new security challenges.\nThe governor added that legitimate vigilance groups were being trained and teamed with mainstream security operatives to support the latter’s activities."
  },
  {
    "headline": "Kalu urges APC to hold presidential primary, convention simultaneously",
    "summarized_story": "Senate Chief Whip, Dr. Orji Uzor Kalu, has urged the All Progressives Congress (APC) National Chairman Caretaker/Extraordinary Convention Planning Committee, Governor Mai Mala Buni, and members of the planning committee to postpone national convention scheduled for February.\nThe former governor also appealed to the party to consider conducting the presidential primary and election of National Working Committee (NWC) on the same day.\nKalu’s letter with the title “Urgent Appeal For Postponement of APC National Convention,” read: “It is with a sense of commitment and unflinching loyalty to our great party, APC, that I write to you, the content of this letter regarding the national convention of our party slated for February 2022.\n“It is on this note that I write to appeal to your office and members of the convention extraordinary planning committee to reconsider the slated date for the 2022 national convention.\n“The conclusion to be drawn from all the cases is that after the state congresses, the burgeoning morale of party members was badly affected."
  },
  {
    "headline": "Adebanjo Replies Akande, Asks Him, Tinubu to Explain Their Source of Wealth",
    "summarized_story": "While explaining how he financed his own building, Adebanjo urged both Akande and Tinubu to do likewise and tell Nigerians how they became stupendously rich.\n“I hereby challenge Chief Bisi Akande to clear the air by disclosing the source of financing these properties as I have done above.\nBut the project consultant shocked everyone with his claim that part of the payment was taken back to finance the 2003 re-election bid of Chief Akande.\nI consulted Chief Akande on this.\n“Chief Akande confirmed this strange payment on page 393 of his book."
  },
  {
    "headline": "World Bank Approves $700m for New Climate-resilient Projects for Nigeria",
    "summarized_story": "Obinna ChimaThe World Bank yesterday announced its approval of a $700 million credit from its International Development Association (IDA) for the Nigeria Agro-Climatic Resilience in Semi-Arid Landscapes (ACReSAL) Project.\nThe project is expected to increase the implementation of sustainable landscape management practices in northern Nigeria and strengthen the country’s long-term enabling environment for integrated climate-resilient landscape management.\nIt noted that persistent water shortages, especially in the extreme north, continue to exacerbate land degradation, desertification, and habitat loss.\n“Better environmental and water resources management and resilience against disaster and climate risks (largely water-related) are needed to sustain economic growth and protect the most vulnerable,” it added.\nThe ACReSAL Project is a 6-year strategic project prioritising actions within four components: Dryland Management, Community Climate Resilience, Institutional Strengthening and Project Management, and Contingent Emergency Response."
  },
  {
    "headline": "Marwa Visits Military Chiefs, Says Drug Abuse Fuelling Terrorism, Banditry",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Chairman of the National Drug Law Enforcement Agency (NDLEA), Brig Gen Mohammed Marwa(rtd), yesterday traced raging terrorism and armed banditry in the country to drug abuse.\nHe also solicited for more collaborative efforts between the agency and the Armed Forces of Nigeria (AFN) in ridding the country of illicit drug trafficking.\nHe assured the military chiefs of the NDLEA’s commitment to a robust collaboration with the armed forces in its operations to drastically reduce the menace of drug abuse and other criminalities.\nHe lamented that drug abuse had ruined many homes in the society.\nHe further noted that drug trafficking remained a grievous crime and advocated decisive action against drug traffickers and other related crimes in the country."
  },
  {
    "headline": "NJC Slams Promotion Ban on Three Judges for Issuing Conflicting Exparte Orders",
    "summarized_story": "Specifically, the affected judges will not get “promotion to higher Bench for a period ranging from two to five years whenever they are due”.\nThe affected judges are Justice Okogbule Gbasam of the High Court of Rivers State; Justice Nusirat I. Umar of the High Court of Kebbi State and Justice Edem Kooffreh of the High Court of Cross River State.\n“His Lordship is also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\nHe is also issued with a warning letter to be circumspect in granting such Exparte Orders in the future.\n“He is also to receive warning letter to be circumspect in granting such Exparte Orders in the future."
  },
  {
    "headline": "Adebanjo Fights Back, Debunks Akande’s Claim Tinubu Built Lekki House for Him",
    "summarized_story": "Akande had in his book titled ‘My Participation’ launched last Thursday, claimed that Adebanjo brought pressure on Tinubu to build the Lekki home for him.\n“The house was commissioned in 1972 by Chief Obafemi Awolowo.\n“It was later occupied by one of the wives Chief Pius Akinyelure, who often visit his wife there in company of Senator Bola Tinubu.\n“I then took a loan from GTBank to complete the house in Lekki where I am living now*.\n“The contractor who built my Lekki house is Engr."
  },
  {
    "headline": "DOCUMENT: How Kaduna Government Gave Islamic Clerics N27 Million To Campaign In Mosques For El-Rufai’s Re-election",
    "summarized_story": "The Kaduna State Government paid some Islamic clerics about N27 million to campaign in mosques for the re-election of Governor Nasir Ahmad El-Rufai in 2019, a document seen by SaharaReporters has shown.\n“Sheik Tukur Adam (N500,000), Sheik Murtala Shanono (N500,000), Sheik Aminu Kuwait (N250,000), Saidu Abubakr (N250,000), Khamis Almiziri (N250,000), Sheik Albani Samaru (N250,000), Sheik Bala Lau (N2,500,000), Sheik Kabiru Gombe (N2,500,000).\nThe 2019 Kaduna State governorship election was held on March 9, 2019.\nHe had 1,045,427 valid ballot votes or 55.32% of total votes, while Ashiru had 814,168 valid ballot votes or 43.08% of total votes.\nDOCUMENTS: How Kaduna Government Gave Islamic Clerics N27 Million to Campaign in Mosques for El-Rufai’s Re-... by Sahara Reporters on Scribd"
  },
  {
    "headline": "DOCUMENT: How Kaduna Government Gave Islamic Clerics N27 Million To Campaign In Mosques For El-Rufai’s Re-election",
    "summarized_story": "The Kaduna State Government paid some Islamic clerics about N27 million to campaign in mosques for the re-election of Governor Nasir Ahmad El-Rufai in 2019, a document seen by SaharaReporters has shown.\n“Sheik Tukur Adam (N500,000), Sheik Murtala Shanono (N500,000), Sheik Aminu Kuwait (N250,000), Saidu Abubakr (N250,000), Khamis Almiziri (N250,000), Sheik Albani Samaru (N250,000), Sheik Bala Lau (N2,500,000), Sheik Kabiru Gombe (N2,500,000).\nThe 2019 Kaduna State governorship election was held on March 9, 2019.\nHe had 1,045,427 valid ballot votes or 55.32% of total votes, while Ashiru had 814,168 valid ballot votes or 43.08% of total votes.\nDOCUMENTS: How Kaduna Government Gave Islamic Clerics N27 Million to Campaign in Mosques for El-Rufai’s Re-... by Sahara Reporters on Scribd"
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Ogun Visit As President Falls Sick En Route To Turkey",
    "summarized_story": "President Muhammadu Buhari has cancelled his visit to Abeokuta, Ogun State earlier scheduled for next week.\nThe Ogun State Government also confirmed the planned visit in a short statement on Thursday.\nSee Also Exclusive EXCLUSIVE: Junketing President Buhari Plans Local Trip To Ogun After Return From Turkey“His Excellency, President Muhammadu Buhari, GCFR will be visiting Ogun State for the commissioning of some of the legacy projects of our dear Governor, Prince Dapo Abiodun, MFR.\nAccording to the source, Buhari fell sick on his way to Turkey.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Planned Ogun Visit As President Falls Sick En Route To Turkey",
    "summarized_story": "President Muhammadu Buhari has cancelled his visit to Abeokuta, Ogun State earlier scheduled for next week.\nThe Ogun State Government also confirmed the planned visit in a short statement on Thursday.\nSee Also Exclusive EXCLUSIVE: Junketing President Buhari Plans Local Trip To Ogun After Return From Turkey“His Excellency, President Muhammadu Buhari, GCFR will be visiting Ogun State for the commissioning of some of the legacy projects of our dear Governor, Prince Dapo Abiodun, MFR.\nAccording to the source, Buhari fell sick on his way to Turkey.\nShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja, for the UAE."
  },
  {
    "headline": "Governor Ishaku Says Boko Haram, ISWAP Terrorists Are Planning To Have Camps In Taraba With Help Of Traditional Rulers",
    "summarized_story": "Taraba State Governor, Darius Ishaku, has said intelligence report shows that terrorist groups, Boko Haram and Islamic State’s West Africa Province (ISWAP), are planning to establish terrorist camps in his state.\nThe governor accused traditional rulers in the state of being “neck-deep” in their support for the terrorist groups, threatening to dethrone any traditional ruler found harbouring the criminals.\n“It is very sad that the traditional rulers are neck-deep in encouraging this insecurity.\nLet me warn: I will not, and I repeat, I will not tolerate it and I will not waste time to remove any traditional ruler that misbehaves.\nSecurity, we must decide to hold it firmly because it affects you, me and every other person."
  },
  {
    "headline": "EXTRA: North Korea bans citizens from laughing, drinking alcohol to mark ex-leader’s death anniversary",
    "summarized_story": "North Korea has banned its citizens from laughing and drinking alcohol for 11 days to mark the 10th death anniversary of Kim Jong II, the country’s former leader.\n“In the past, many people who were caught drinking or being intoxicated during the mourning period were arrested and treated as ideological criminals.\nAdvertisement“Even if your family member dies during the mourning period, you are not allowed to cry out loud and the body must be taken out after it’s over.\nPeople cannot even celebrate their own birthdays if they fall within the mourning period.\nKim Jong II ruled North Korea from 1994 until his death in 2011."
  },
  {
    "headline": "EXTRA: North Korea bans citizens from laughing, drinking alcohol to mark ex-leader’s death anniversary",
    "summarized_story": "North Korea has banned its citizens from laughing and drinking alcohol for 11 days to mark the 10th death anniversary of Kim Jong II, the country’s former leader.\n“In the past, many people who were caught drinking or being intoxicated during the mourning period were arrested and treated as ideological criminals.\nAdvertisement“Even if your family member dies during the mourning period, you are not allowed to cry out loud and the body must be taken out after it’s over.\nPeople cannot even celebrate their own birthdays if they fall within the mourning period.\nKim Jong II ruled North Korea from 1994 until his death in 2011."
  },
  {
    "headline": "Twitter removes Osinbajo’s post for copyright violation of Beyonce’s song",
    "summarized_story": "Twitter has withheld a tweet by Vice-President Yemi Osinbajo for copyright violation.\nBeyonce’s song ‘Run the World’ was used as the video’s audio.\nQuoting the tweet that same day, a Twitter user @olayknowless, had asked Beyonce to report Osinbajo’s account for violating the Digital Millennium Copyright Act (“DMCA”).\n“This tweet has been withheld in response to a report from the copyright holder,” Twitter said on the post.\nIn June, Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”."
  },
  {
    "headline": "Twitter removes Osinbajo’s post for copyright violation of Beyonce’s song",
    "summarized_story": "Twitter has withheld a tweet by Vice-President Yemi Osinbajo for copyright violation.\nBeyonce’s song ‘Run the World’ was used as the video’s audio.\nQuoting the tweet that same day, a Twitter user @olayknowless, had asked Beyonce to report Osinbajo’s account for violating the Digital Millennium Copyright Act (“DMCA”).\n“This tweet has been withheld in response to a report from the copyright holder,” Twitter said on the post.\nIn June, Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”."
  },
  {
    "headline": "Crypto ban, halt in FX sale to BDCs… 5 CBN policies that impacted Nigerians in 2021",
    "summarized_story": "AdvertisementWhile it received kudos for some of its policies, the apex bank also received knocks from Nigerians.\nAdvertisementBAN OF FOREX SALE TO BDCsIn July 2021, the CBN banned the sale of foreign exchange (forex) to Bureaux De Change (BDC) operators.\nSince then, the apex bank had been channelling FX to commercial banks to meet customers’ legitimate demands.\nThe apex bank claimed that cryptocurrencies were being used to facilitate scams, money laundering, terrorism financing, illicit fund flows, and other criminal activities.\nThe companies include Rise Vest Technologies Limited, Bamboo Systems Technology Limited, Bamboo Systems Technology Limited OPNS, Chaka Technologies Limited, CTL/Business Expenses, and Trove Technologies Limited."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "The Nigeria Startup Bill has been approved by the Federal Executive Council",
    "summarized_story": "The Nigeria Startup Bill (NSB) is a step closer to getting enacted into law as it has now been approved by the Federal Executive Council (FEC).\nThe approval was made on December 15, and now, the Presidency will submit the bill to the National Assembly for consideration.\nThere will also be incentives to attract local and foreign investors to the Nigerian startup community.\nThe bill is the result of a collaborative effort between the Presidency, the Federal Ministry of Communications and Digital Economy, the Nigerian Export and Promotion Council and wider government bodies.\nGoogle Nigeria and the UK overnment, through the West Africa Research and Innovation Hub and the UK-Nigeria Tech Hub, are also backing the bill."
  },
  {
    "headline": "Race for investment dollars belongs to environment-conscious firms",
    "summarized_story": "The increasing scrutiny by investors and multilateral organisations on a company’s environmental, social and governance risks before making investment decisions could reshape the global investment landscape, leaving behind companies that refuse to change, analysis shows.\nSome of the world’s biggest financiers and lenders say ESG now plays a critical role in their decision to spend investment dollars with many singling out environmentally conscious companies as deserving of their investment.\nHowever, the reality is that pressure to factor climate and environmental concerns into investment decisions is building globally and could become a norm.\nRead also: ESG: Nigeria fails on the environmental, social and governance frontsThese campaigns are having some impact.\nIn effect, this would protect European companies from goods made in countries with less stringent climate policies."
  },
  {
    "headline": "Nigeria’s COVID-19 cases hit 9-month high",
    "summarized_story": "Nigeria’s COVID-19 cases on Wednesday hit a nine-month high as 1,424 new cases were confirmed.\nAnd Tedros Adhanom Ghebreyesus, director-general, World Health Organisation (WHO), has said that the omicron variant should not be underestimated and is spreading faster than any other COVID-19 variants as it is now present in 77 nations.\nFindings show that Omicron has pushed Nigeria’s average daily cases of up by 451 percent, from 74 cases seen in the first week of December.\nA total of 2,859 cases were confirmed in the week ended December 12, compared with 520 in the preceding week.\n“Even if Omicron does cause less severe disease, the sheer number of cases could once again overwhelm unprepared health systems."
  },
  {
    "headline": "Nigeria struggles as Saudi achieves first budget surplus in 8yrs",
    "summarized_story": "Saudi Arabia, the world’s largest crude oil exporter, is hoping to post its first budget surplus in nearly a decade next year on the back of improved oil prices and restricted government spending, a reality that is everything Nigeria wished for.\nData from the Saudi Arabia budget office show the country’s economy is expected to grow by almost 7.4 percent next year, after expanding by a modest 2.9 percent in 2021.\nSaudi Arabia’s fiscal projections next year are a marked improvement from recent years that have seen the country post heavy budget deficits as the coronavirus pandemic disrupted global economies and hammered oil prices.\nThe Federal Government spent N6.17 trillion more than it earned in 2020, leaving its fiscal deficit at 4 percent of GDP, the highest in 21 years, according to Central Bank of Nigeria (CBN) data analysed.\nThe last time Nigeria’s fiscal deficit exceeded 4 percent was in 1999, when the government opened the taps on infrastructure spending to give the economy a boost after years of military rule."
  },
  {
    "headline": "Counter-Terrorism: NAF ‘wings’ 4 pilots, 12 UAV operators – Nigerian Observer",
    "summarized_story": "“In the area of pilot training, 11 student pilots are currently undergoing training in South Africa, while three are undergoing Alpha Jet conversion in Egypt.\nHe added that 12 student pilots were undergoing Basic Transport Training, 32 undergoing Ab-Initio Flying Training and eight undergoing Instructor Training at 401 Flying Training School, Kaduna.\n“Special arrangements are also currently being made to upgrade UAV training facilities to enhance the operational capacity of UAV operators in anticipation of increased tempo of air operations with the recently acquired UAVs.\n“I most sincerely express profound gratitude and appreciation to CAS, whose leadership has created the enabling environment for timely turn out of pilots and UAV operators in the NAF.\n“To the pilots and UAV operators, tomorrow brings a new journey, but today marks the end of a chapter in your career as you have become qualified pilots and UAV operators.”..."
  },
  {
    "headline": "We Are In The Business Of Driving Human Progress – Chevron – Nigerian Observer",
    "summarized_story": "Represented by the Area Manager, PGPA ,(Field Operations) ,CNL, Mr. Sam Daibo, Brikinn said, Chevron had over the years, worked and demonstrated ethical, environmentally responsible, safe, and respectful business practices.\n“Everywhere we work, we demonstrate ethical, environmentally responsibile safe and respectful business practices.As we would say, we are in the business of driving human progress.\n“Our primary contributions is by safely developing and delivering affordable and reliable energy that is necessary for social and economic progress.\n“It is important to note that community development can only be sustained in atmosphere of peace that is conducive for business activities”, Brikinn said.\nConstruction of Gbokoda community Cottage hospital, Construction of Bateren Community health Center, among others in Education, Health Care, well as Human Capital development."
  },
  {
    "headline": "Obaseki: Only PDP can save Nigeria from current socio-economic woes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has declared that only the Peoples Democratic Party (PDP) can rescue Nigeria and place it on the path of economic prosperity and sustainable development.\nAccording to him, “If Nigeria is going to be salvaged, PDP has to step into the throne to salvage this country politically.\nThe stakes are too high; we cannot allow Nigeria to continue the way it is going.\n“Our great party must come to the rescue and take over the reins of power in this country.\nAddressing members of the delegation, Obaseki stated, “The decision is of the majority of our people, which is the way we will go."
  },
  {
    "headline": "Obaseki inaugurates 12-man road safety advisory council – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has inaugurated a 12-man Edo State Road Safety Advisory Council, charged with the responsibility of coordinating the state’s road safety targets and driving the implementation of the road safety sector strategic plan.\nWhile inaugurating the council, Obaseki said, “The responsibilities of this council is to help coordinate our road safety targets and to drive implementation of the road safety sector strategy plan.\n“We believe that as an advisory council, you are going to help in building the agencies to implement programmes that are in the sector’s strategic plan.\nWe have to enforce road safety regulations.”He continued: “We are going to make sure that the mobile courts work with the designs of our roads so that we can have rest areas.\nGovernor for this opportunity and assure him of our unalloyed commitment to making sure that the purpose for which this advisory council was established is actualized.”..."
  },
  {
    "headline": "World Bank approves $700m credit for Nigeria’s agro-climatic resilience project",
    "summarized_story": "The World Bank has approved $700 million from its International Development Association (IDA) for the Nigeria Agro-Climatic Resilience in Semi-Arid Landscapes (ACReSAL) Project.\nThe Bretton Woods institution which disclosed this in a statement, noted stated that the scheme is expected to boost Nigeria’s implementation of sustainable landscape management practices in northern Nigeria and strengthen the country’s long-term enabling environment for integrated climate-resilient landscape management.\nWorld Bank Country Director for Nigeria, Shubham Chaudhuri, said, “This scenario not only threatens food security, livelihoods and productivity, but also exacerbates fragility and increases the risk of violence.\nACReSAL Task Team Leader, Joy Agene, said that the project will help reduce the vulnerability of millions of the extreme poor in northern Nigeria, strengthening their own role in the management of their natural resources.\n“It will also address land degradation, strengthen climate resilience, and lessen livelihood vulnerability in dry, semi-arid and dry sub-humid regions in the northern states,” she said."
  },
  {
    "headline": "Michael Okpara’s first son Nnawuihe, dies days to mother’s burial",
    "summarized_story": "In a development that has baffled the family of Dr. Michael Okpara, premiere of the old Eastern Region, first son of the family, Nnawuihe Okpara, has reportedly passed on about few days hours to mother’s burial.\nNnawuihe, a Houston, Texas, United States of America based Aeronautic Engineer, was said to have died following a brief illness in the country he has lived for many years.\nHis death which was reported on Wednesday comes as preparation for his mother, Adanma’s burial scheduled for Saturday, December 18, is in top gear.\nHe was a specialist in Heat Conversion and had worked with many airlines in the United States before his death.\nBefore moving to the United States in 1972, the late Nnawuihe was an air officer in the Biafran Army."
  },
  {
    "headline": "Osun 2022: What you need to know about Ademola Adeleke, By Alhaji Kazeem Akinleye",
    "summarized_story": "He is from the Adeleke family of Ede in Osun State.\nOn 23 July 2018, Adeleke emerged as the governorship candidate of PDP in Osun State after defeating Akin Ogunbiyi by seven votes.\nThe testimonial Adeleke submitted to INEC dated 20 July 1988, as its Heading Ede Muslim Grammar School, Osun State, as at that year Osun state was not in existence.\nAdeleke ran for Osun state governorship election under the PDP against top contenders Alhaji Gboyega Oyetola of APC and Iyiola Omisore of SDP on 22 September 2018.\nThe Supreme Court later affirmed Gboyega Oyetola as the authentic winner of the 2018 Osun State governorship election on Friday, July 5, 2019."
  },
  {
    "headline": "Google invests in SafeBoda through its Africa investment fund",
    "summarized_story": "Tech giant, Google, has announced its first investment from its Africa Investment Fund in the Ugandan super app, SafeBoda, which has presence in Nigeria.\nThe Africa Investment Fund is part of a broader plan by Google to support digital transformation in Africa.\nThe investment comes only two months after Alphabet CEO, Sundar Pichai revealed the company’s plans to invest $1 billion in “tech-led initiatives” over the next five years, including a $50 million Africa Investment Fund aimed at early- and growth-stage African startups.\nSafeBoda said the investment from Google’s Africa Investment Fund will help “drive its growth in Uganda and Nigeria, scaling its transportation-led app to offer new payment and financial services solutions for its expanding set of customers: passengers, drivers, and merchants.”Commenting on the investment, Ricky Rapa Thomson co-founder of SafeBoda said, “SafeBoda welcomes Google to their community and is excited to continue to drive innovation in informal transportation and payments in the boda boda (East Africa) or okada (West Africa) industry.\nSafeBoda is thrilled that leading global companies such as Google see the importance of backing startups working towards these goals.”In his remarks, Nitin Gajria, Managing Director for Google in Africa said, “I am thrilled about our first investment from the $50M Africa Investment Fund that we announced two months ago."
  },
  {
    "headline": "11 Students Get Edo Group’s Scholarship Awards",
    "summarized_story": "A non-governmental organization, The Uromi Like Minds Initiative (ULMI) has rewarded 11 students from Uromi in the two technical schools within the community with scholarships.\nThe group also fixed Decem- ber 26, 2021 for the final of the Maiden Secondary Schools Football Tournament.\nDuring the ceremony which took place on November 13, 2021, six students from the Federal Science and Technical College Onewa-Uromi and five students from the National Institute of Construction Technology and Management, also in Uromi, received the sum of N100,000 each, for winning the merit awards offered by ULMI.\nThe students, who were selected from different departments in the two institutions, won the inaugural scheme of the annual scholarship awards for being the best in their departments during the 2020/2021 academic session.\nHe said, “Students should develop the right attitude/ mindset and never allow to- day’s successes becloud their drive for the future."
  },
  {
    "headline": "11 Students Get Edo Group’s Scholarship Awards",
    "summarized_story": "A non-governmental organization, The Uromi Like Minds Initiative (ULMI) has rewarded 11 students from Uromi in the two technical schools within the community with scholarships.\nThe group also fixed Decem- ber 26, 2021 for the final of the Maiden Secondary Schools Football Tournament.\nDuring the ceremony which took place on November 13, 2021, six students from the Federal Science and Technical College Onewa-Uromi and five students from the National Institute of Construction Technology and Management, also in Uromi, received the sum of N100,000 each, for winning the merit awards offered by ULMI.\nThe students, who were selected from different departments in the two institutions, won the inaugural scheme of the annual scholarship awards for being the best in their departments during the 2020/2021 academic session.\nHe said, “Students should develop the right attitude/ mindset and never allow to- day’s successes becloud their drive for the future."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Boko Haram Dislodged From Nasarawa – Governor Sule",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has said Boko Haram terrorists who infiltrated parts of the state have been flushed out by security agents.\nGovernor Sule told State House correspondents that he met the president to express his appreciation for the support being received by his state over security.\nOn the Boko Haram insurgents that had gathered in parts of the state, he said they had now been dispersed.\nThe governor said, “First is that I came to see, Mr. President, on security issues.\n“And I have not been able to see Mr. President because of his busy schedule and his travels."
  },
  {
    "headline": "Omicron: UK Removes Nigeria, 10 Others From Travel Red List",
    "summarized_story": "LEADERSHIP had earlier reported that the red list was to be rescinded just two weeks after it was introduced, following intense pressures from Nigerian travelers and the Nigerian government, which threatened retaliation.\nADVERTISEMENTThe red list forced thousands into hotel quarantine at a cost of £2,285 per person for 10 days.\n“On Tuesday 14th December, UK Ministers made the decision – based on scientific and public health data – to remove Nigeria from the UK’s travel red list.\nNow that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron.\nMeanwhile, the United Arab Emirates (UAE) has conceded seven slots to Air Peace to end the diplomatic row with Nigeria."
  },
  {
    "headline": "Alleged N75m fraud: Court orders arrest of Imo Assembly Deputy Speaker, Amarachi Iwuanyanwu",
    "summarized_story": "A High Court of the Federal Capital Territory (FCT) in Jabi, Abuja has issued an arrest warrant against the Deputy Speaker of the Imo State House of Assembly, Amarachi Chyna Iwuanyanwu, over his alleged involvement in a N75million fraud.\nJustice Charles Agbaza, in a ruling on Thursday, directed the Commander of the Intelligence Response Team (IRT) of the Nigeria Police Force (NPF) headquarters, Abuja to execute the arrest warrant.\nHe prayed the court for a fresh arrest warrant to be directed at the Commander of the IRT, Abuja for easy execution.\nOminigbo said he was not opposed to the prosecution’s application for a fresh arrest warrant, but prayed the court to be afforded one more opportunity to produce the defendant in court on the next adjourned date, failing which the arrest warrant could be activated.\nThe judge proceeded to issue the fresh arrest warrant, as requested by the prosecution, and ordered the Commander, IRT, Abuja to arrest Iwuanyanwu and produce him in court on the next adjourned date."
  },
  {
    "headline": "Alleged N75m fraud: Court orders arrest of Imo Assembly Deputy Speaker, Amarachi Iwuanyanwu",
    "summarized_story": "A High Court of the Federal Capital Territory (FCT) in Jabi, Abuja has issued an arrest warrant against the Deputy Speaker of the Imo State House of Assembly, Amarachi Chyna Iwuanyanwu, over his alleged involvement in a N75million fraud.\nJustice Charles Agbaza, in a ruling on Thursday, directed the Commander of the Intelligence Response Team (IRT) of the Nigeria Police Force (NPF) headquarters, Abuja to execute the arrest warrant.\nHe prayed the court for a fresh arrest warrant to be directed at the Commander of the IRT, Abuja for easy execution.\nOminigbo said he was not opposed to the prosecution’s application for a fresh arrest warrant, but prayed the court to be afforded one more opportunity to produce the defendant in court on the next adjourned date, failing which the arrest warrant could be activated.\nThe judge proceeded to issue the fresh arrest warrant, as requested by the prosecution, and ordered the Commander, IRT, Abuja to arrest Iwuanyanwu and produce him in court on the next adjourned date."
  },
  {
    "headline": "Anambra: Trouble looms as Onitsha traders protest plan to build shops at motor park",
    "summarized_story": "Traders at the main market, Onitsha, Anambra State yesterday protested alleged plans by the leadership to build shops at the only remaining motor park at the market.\nThe traders, under the aegis of Progressives Traders Against Congestion, alleged that the market leadership was planning to take advantage of the Christmas and New year break to execute their agenda.\n“The space is also where people can store their salvaged goods in case of any fire disaster that threatens traders’ goods.\nBuilding shops at the only remaining park is like telling the traders to leave the market.”“How can any reasonable market leader conceive the plan of building shops at the only open space in the market, which is already over congested?\nWe appeal to Governor Obiano not to approve such construction of shops if he still loves the traders.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Anambra: Trouble looms as Onitsha traders protest plan to build shops at motor park",
    "summarized_story": "Traders at the main market, Onitsha, Anambra State yesterday protested alleged plans by the leadership to build shops at the only remaining motor park at the market.\nThe traders, under the aegis of Progressives Traders Against Congestion, alleged that the market leadership was planning to take advantage of the Christmas and New year break to execute their agenda.\n“The space is also where people can store their salvaged goods in case of any fire disaster that threatens traders’ goods.\nBuilding shops at the only remaining park is like telling the traders to leave the market.”“How can any reasonable market leader conceive the plan of building shops at the only open space in the market, which is already over congested?\nWe appeal to Governor Obiano not to approve such construction of shops if he still loves the traders.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "COVID-19 hits 23 Miss World contestants, pageant cancelled last minute",
    "summarized_story": "The Miss World 2021 beauty pageant that was set to be held December 16 in Puerto Rico was postponed at the last minute after 23 participants tested positive for COVID-19.\nOnce and only when contestants and staff are cleared by health officials and advisors, will contestants and related staff return to their home countries.\n“We are very much looking forward to the return of our contestants, (who we have grown to know and love), to compete for the Miss World crown” said Julia Morley, CEO of Miss World Ltd.Puerto Rico offers a safe environment and a spectacular backdrop for filming the Miss World Festival!”One of the contestants affected by COVID-19 is Telangana native Manasa Varanasi, who would have represented India at the international contest.\n“We can’t wait to welcome Manasa back home, nurture her back to health and send her back stronger, healthier and happier.”The Miss World Malaysia organisation also confirmed that their contestant Lavanya Sivaji had tested positive.\nLast year’s Miss World was cancelled due to the pandemic and so the reigning beauty queen is 2019 winner Toni-Ann Singh from Jamaica."
  },
  {
    "headline": "Tambuwal orders arrest of musician for praising Bello Turji",
    "summarized_story": "Aminu Tambuwal of Sokoto has ordered the arrest of a musician, Mohammad Danshanawa for praising wanted bandit kingpin, Bello Turji.\nDanshawa, in viral music audio, described Turji as “a lion, untouchable and a great leader”.\nGovernor Tambuwal, commenting on the song, said, “We ordered for his arrest to serve as a deterrent.\nAs it is, one cannot move from Sokoto here to Illeila, yet someone is praise-singing a terrorist.”Bello TurjiBello Turji is a 27-year ruthless bandit operating in Sokoto and Zamfara States.\nThe only time he said he was open to dialogue was when Kaduna-based Islamic cleric, Ahmed Gumi, visited his camp in Zurmi (Zamfara State)."
  },
  {
    "headline": "APC National chairmanship debate: Let’s end govs’ domineering influence – Yari",
    "summarized_story": "The aspirants in attendance included former Nasarawa state Governor, Senator Tanko Almakura, Senator Mohammed Sani Musa, Alhaji Yari, Senator Ali Modu Sheriff (represented), former Governor Isa Yuguda (represented), Malam Mustapha Salihu, Sunny Moniedafe, Mohammed Etsu and Senator George Akume (represented).\nBut if we agree, all of us, because no single chairman either from State or the National can do that alone.\nHe asked the APC governors to stop opposing President Buhari’s reforms, especially on local government autonomy.\n“One humbly appeals to APC governors to urgently align with Mr. President to liberate democratic institutions at the state level.\nIn a letter addressed to Governor Buni, the lawmaker urged the party’s national leadership to conduct the presidential primary and election of National Working Committee members simultaneously at the convention."
  },
  {
    "headline": "We must ensure electorate’s right of free choice – Osinbajo",
    "summarized_story": "–Democracy remains the best system of establishing governments because it guarantees respect for the fundamental rights of individuals to choose their leaders, Vice President Yemi Osinbajo has said.\nOsinbajo said this Thursday in Ibadan, Oyo state, where he chaired a roundtable in honour of former Oyo state Governor Abiola Ajimobi in commemoration of his posthumous 72nd birthday.\n“This right of choice of leaders as given by democracy is not just a fundamental civil and political right, but it also separates man from animals for whom might confers the right to leadership.\n“The major issue, therefore, is how to ensure that right of free choice is not defeated or corrupted.\nDignitaries at the event hosted by the late governor’s wife, Mrs. Florence Ajimobi included deputy governors of Oyo and Osun states, Rauf Olaniyan and Benedict Gboyega Alabi; Minister of Youth and Sports Development Sunday Dare, traditional rulers and top government officials."
  },
  {
    "headline": "Breaking: Popular Balogun Lagos market set ablaze, goods destroyed",
    "summarized_story": "A popular market located in Balogun, Lagos state has been consumed in fire between Wednesday night and Thursday morning.\nWhile the fire raged, goods worth millions of naira were burnt down few days to Christmas, traders who turned out for usual business on Thursday lamented.\nThey said the cause of the fire unknown to many was yet to be ascertained.\nOfficials of Lagos state government are yet to speak on the latest development, Blueprint reports.\nDetails loading…"
  },
  {
    "headline": "Operatives Rescue 34 Children From Traffickers, Intercept 64,000 Gun Cartridges",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) on patrol have intercepted 34 children along the Okene-Lokoja Expressway in Kogi State.\nNDLEA spokesman, Femi Babafemi, who confirmed this in a statement on Friday revealed that operatives also seized 64,000 pump action gun cartridges and a new pump action gun in Anambra.\nAccording to him, the children between the ages of eight and 14 were being trafficked from Ijebu-Ode in Ogun to the Federal Capital Territory.\nHe directed that the arm and ammunition, along with the suspect arrested in Anambra, be transferred to the police.\nMarwa also ordered the transfer of the 34 trafficked children to the National Agency for the Prohibition of Trafficking in Persons (NAPTIP) for necessary actions."
  },
  {
    "headline": "VIDEO: Ishaku Raises Alarm Over Plot To Establish Boko Haram, ISWAP Camps In Taraba",
    "summarized_story": "Taraba State Governor, Darius Ishaku, has raised an alarm over plots by Boko Haram and Islamic State’s West Africa Province (ISWAP) to establish terrorist camps in his state.\nHe threatened to dethrone any traditional ruler caught aiding or harbouring criminals and asked them not to allow non-indigenes with negative mindsets to settle in their domains.\n“It is very sad that the traditional rulers are bent on encouraging this insecurity.\nLet me warn that I will not, and I repeat, I will not tolerate it and will not waste time to remove any traditional ruler that misbehaves.\nAccording to Governor Ishaku, it is better to punish erring leaders than ignore such an action to lose the lives of thousands of people."
  },
  {
    "headline": "Inspector, Two Locals Killed During Attack On Police Station In Kogi",
    "summarized_story": "An inspector and two locals have been killed during an attack on a police station in Kogi State, authorities confirmed.\nThe Public Relations Officer of the Kogi State Police Command, William Aya, disclosed this in a statement.\nWhile efforts by the police to pacify the mob proved abortive, Aya said they became violent during which one Inspector Bamisaye Gbenga was killed and another policeman, Sunday Alechenu, was injured.\nAccording to Aya, two persons – a male and a female – were also injured in an effort to disperse the mob.\nBut they later died in a hospital while the mob set part of the station ablaze."
  },
  {
    "headline": "Again, Nigeria’s Daily COVID-19 Infections Exceed 1,000",
    "summarized_story": "Nigeria has reported fresh COVID-19 infections exceeding the 1,000 mark for the second consecutive day, data from the Nigeria Centre for Disease Control (NCDC) have shown.\nThe number of cases reported on Thursday is, however, lower than the 1,424 infections reported on the previous day.\nREAD ALSO: Nigeria’s COVID-19 Cases Rise With 1,424 New Infections, Highest In Six MonthsAlthough no new death was recorded on Thursday, the 1,051 fresh cases were reported in 10 states and the Federal Capital Territory (FCT).\nAs a result, Nigeria’s total confirmed COVID-19 cases has risen to 221,071.\nThe NCDC has collected and tested a total of 3,686,403 samples while 6,743 cases are still active in various states and the FCT."
  },
  {
    "headline": "Ghana Opens First Skate Park In Honour Of Fashion Icon Abloh",
    "summarized_story": "Ghana has opened its first skate park in the heart of the capital, Accra, in honour of the late US fashion icon Virgil Abloh, who was overseeing the project before he passed away in late November.\nUnveiling the park, organisers paid tribute to the American designer of Ghanaian origin with musical performances by local artists and skate sessions by both professionals and amateurs.\n“Abloh was here,” is conspicuously written on a fence wall at the park, among the list of personalities who contributed to fund the Freedom Skatepark.\nThe founder of Surf Ghana, Sandy Alibo, says skating is a lesser-known sport in Ghana.\n“We’re not talking only about sports, but we’re talking building self-confidence in the youth, about tourism and developing youth entrepreneurship,” she told AFP."
  },
  {
    "headline": "Gov Akeredolu visits Olowo over Elewere’s assassination",
    "summarized_story": "Governor of Ondo State, Oluwarotimi Akeredolu, has commiserated with the Olowo of Owo, Oba Ajibade Ogunoye, over the killing of one of his High Chiefs, Chief Elewere Tunde Ilori.\nChief Elewere was killed by unknown gunmen on a farmland on Wednesday evening.\nChief Elewere had a complain about another family in respect of a farmland.\nI raised a team of chiefs to go and do the inspection of the land and their report seemed to favour chief Elewere.\nChief Elewere was very dear to me, very close and very loyal."
  },
  {
    "headline": "Governor Akeredolu makes five fresh appointments",
    "summarized_story": "Ondo state governor, Rotimi Akeredolu has sent five names to the state House of assembly for confirmation as members of the Ondo State House of Assembly Service Commission.\nThey are expected on Monday, 20th December, 2021, at 10.00am, to appear before the Selection Committee of the House for screening.\nThey include Dare Emiola Francis (Chairman), Idowu Adebusuyi (Member), Adeloye Oladejo (Member), Kunle Odidi (Member) and Ola Oguntimehin (Member).\nThe House had earlier been informed of their nominations vide a letter signed by Secretary to the State Government, Princess Catherine Oladunni Odu.\nThe Speaker, David Bamidele Oleyelogun in a statement urged the nominees to forward twenty (20) copies of their curriculum vitae to the House and liaise with the members from their different constituencies ahead of the screening on Monday."
  },
  {
    "headline": "NJC bars three Judges from promotion over conflicting ex-parte orders",
    "summarized_story": "The National Judicial Council has barred the three Judges of Courts of concurrent jurisdiction who granted conflicting Exparte Orders in matters with same parties and subject matter from promotion to higher Bench for a period ranging from two to five years whenever they are due.\nEven though there was no written petition, allegations of corruption or impropriety against the Judges, the NJC initiated investigation pursuant to its inherent disciplinary powers under the Constitution to unravel the circumstances that led to the spate of Exparte Orders granted by these Courts of coordinate jurisdiction.\nHe is also to receive warning letter to be circumspect in granting such Exparte Orders in the future.\nThe Council also placed him on its Watch-List for a period of two years.\nMeanwhile, the Council approved the appointment of 63 Judges for 16 States, 9 of which are Heads of Court."
  },
  {
    "headline": "Nollywood Star, Kabiru Fubara, dies months after surviving cancer -",
    "summarized_story": "Nollywood Star, Karibi Fubura has died months after surviving cancer.\nA family member of Nollywood actor, Karibi Fubara, announced his death nineteen months after he survived surgery on his kidney.\nThe post was met with tributes from several Nollywood actors and actresses including, Rita Dominic, Funke Akindele, Kate Henshaw, Sharon Ooja, among others.\nThe “God calling” actor married popular Nollywood fashion entrepreneur, Yolanda Okereke in 2019.\nUntil his death, Fubara was a Nollywood actor who rose to prominence after starring in Before 30, God Calling, Quam’s Money, Castle and Castle, Royal Hibiscus Hotel, Smart Money Woman, and MMM."
  },
  {
    "headline": "Japan: More Than 20 Feared Dead in Osaka Building Fire",
    "summarized_story": "More than 20 people were feared dead after a fire broke out Friday in a building in Osaka in western Japan, officials said, and police were investigating arson as a possible cause.\nThe fire started on the fourth floor of an eight-story building in the major business, shopping and entertainment area of Kitashinchi, Osaka fire department official Akira Kishimoto said.\nMany of the victims are believed to be visitors at the clinic on the fourth floor, fire department officials said.\nNHK quoted a witness as saying she heard a woman’s voice coming from the fourth floor calling for help.\nAnother witness told TV Asahi he saw flames and smoke coming out of windows on the fourth floor when he stepped outside after hearing a commotion."
  },
  {
    "headline": "Nigeria to Release List of Real Owners of Oil and Gas Assets in January",
    "summarized_story": "Nigeria’s federal government will next month make public the real owners of oil, gas and mining assets in the country through a National Beneficial Ownership (NBO) register.\n“The NEITI executive secretary explained that under the joint inter-agency collaboration with the CAC, the NEITI beneficial ownership register filled with facts, information and data on who owns what in the oil, gas and mining sectors will merge with CAC beneficial ownership portal that covers all registered companies in Nigeria.\nThe statement further revealed that Nigeria had submitted a draft resolution to the United Nations Convention Against Corruption on the use of beneficial ownership information and data disclosure to identify, track, recover and return assets looted or stolen from developing countries.\n“The attorney general informed the UN Convention that Nigeria has put in place institutional structures and legislations to protect Nigeria’s resources.\n“The UN Conference is expected to ratify the global anti-corruption strategy for adoption by over 150 countries attending the conference,” NEITI stated."
  },
  {
    "headline": "Buhari, Wife, Six Ministers Attend Turkey-Africa Partnership Summit in Istanbul",
    "summarized_story": "President Muhammadu Buhari accompanied by his wife, six Ministers as well as two other top government officials would be attending the Turkey-Africa Partnership Summit in Istanbul.\nThe President and his entourage departed Abuja on Thursday for the third Turkey-Africa Partnership Summit, being hosted by President Recep Tayyip Erdogan of the Republic of Turkey.\nAccording to the organisers, the theme of the Summit is “Enhanced Partnership for Common Development and Prosperity,’’ and the agenda includes reviewing the cooperation between African countries and Turkey since the last summit in 2014.\nThe third Turkey-Africa Partnership Summit is coming on the heels of President Erdogan’s recent State Visit to Nigeria during which several agreements in the fields of energy, defence industry, mining and hydrocarbons were signed to expand existing bilateral ties.\nIt was expected that the summit would provide guidelines and direction for cooperation with African countries for the next five years."
  },
  {
    "headline": "World Bank Approves $700m for New Climate-Resilient Projects for Nigeria",
    "summarized_story": "The World Bank on Thursday announced its approval of a $700 million credit from its International Development Association (IDA) for the Nigeria Agro-Climatic Resilience in Semi-Arid Landscapes (ACReSAL) Project.\nThe project is expected to increase the implementation of sustainable landscape management practices in northern Nigeria and strengthen the country’s long-term enabling environment for integrated climate-resilient landscape management.\nIt noted that persistent water shortages, especially in the extreme north, continue to exacerbate land degradation, desertification, and habitat loss.\n“Better environmental and water resources management and resilience against disaster and climate risks (largely water-related) are needed to sustain economic growth and protect the most vulnerable,” it added.\nThe ACReSAL Project is a 6-year strategic project prioritising actions within four components: Dryland Management, Community Climate Resilience, Institutional Strengthening and Project Management, and Contingent Emergency Response."
  },
  {
    "headline": "Ex-President Jonathan, Other Eminent Nigerians Celebrate Buhari at 79 – Arise News",
    "summarized_story": "Eminent Nigerians, including former President Goodluck Jonathan, President of the Senate, Dr. Ahmad Lawan, Speaker of the House of Representatives, Hon.\nFemi Gbajabiamila and the Lagos State Governor, Mr. Babajide Sanwo-Olu, amongst others, yesterday, paid glowing tributes to President Muhammadu Buhari, on his 79th birthday on Friday, December 17.\n“I join the multitude of fellow Nigerians and your other well-wishers across the globe in thanking Allah for His great gifts of good health and long life to you.\n“Mr President, Nigeria and Nigerians are proud of you.\nI wish our President more prosperous years in good health and wisdom as he continues to serve our dear nation,” the governor said."
  }
]