[
  {
    "headline": "Anambra too sophisticated for WASSCE holder to govern –Soludo",
    "summarized_story": "The governorship candidate of the All Progressives Grand Alliance in the forthcoming Anambra State governorship poll scheduled for November 6, Prof Chukwuma Soludo, has said the state was too sophisticated for a school certificate holder to aspire to govern.\nSoludo said, “APGA has a star-studded team for this election and it is the party with the best brains.\n“Is it first school leaving certificate and WASSCE they will use to govern Anambra?\nAnambra has outgrown such and you cannot use those certificates to govern Anambra.\nMeanwhile, the state governor, Willie Obiano, was named as the chairman of the APGA national campaign council for the poll."
  },
  {
    "headline": "FG begins process for four million meters distribution",
    "summarized_story": "The Federal Government, on Friday, announced that it had commenced the process for the second phase of the National Mass Metering Programme that would lead to the distribution of four million meters.\nHe said the programme would ensure that consumers were billed appropriately for the electricity they consumed through the installation of free meters in unmetered households and business premises.\nZakari said a total of 750,000 meters had so far been delivered to Discos in eight months under the first phase of the NMMP.\nMeanwhile, the management of the Benin Electricity Distribution Company has it is offering discounts on outstanding debt ranging from five per cent to 25 per cent to customers in its franchise area.\n), Osibodu said the company had taken delivery of 54,198 out of the 75,870 meters allocated to BEDC for distribution, adding that 40,000 meters had been installed by BEDC across the four states covered by the company."
  },
  {
    "headline": "Kudos to Sanwo Olu as LASPOTECH emerges best 3rd best Poly in Nigeria",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos StateBy Olasunkanmi AkoniLagos State Governor,Mr.\nBabjide SanwoOlu has been commended for his administration’s commitment to delivering quality education across the state.\nThe commendations came as the Lagos State Polytechnic, Ikorodu, emerged, the best 3rd Polytechnic in Nigeria, as contained in the Year 2021 Webometric latest ranking for Polytechnic and Colleges of Technologies in Nigeria.\nAccording to the ranking result recently released by the body, the best polytechnic in Nigeria is Yaba College of Technology (Yabatech) followed by Federal Polytechnic Ilaro, which came second, while the Lagos State Polytechnic, Ikorodu, ratted 3rd best among the 50 ranked Institutions in the country .\nWahab recalled that, the Lagos State University LASU under Governor Sanwo- Olu administration in the Year 2020 was also rated as the second best University in Nigeria and one of the best100 Universities in the world."
  },
  {
    "headline": "Insecurity: FCT natives, NANS evacuates 279 students from Jos",
    "summarized_story": "The Abuja Original Youths Empowerment Organisation (AOIYEO), in collaboration with National Association of Nigerian Students (NANS), have evacuated over 279 students, who are natives and residents of Abuja from Jos.\nREAD ALSO;NEDC: Appraising House of Reps Accountability ReportDavid said that the evacuation of the students was necessary in order to prevent death of indigenes and residents of Abuja in Jos.\nThe youth leader revealed that all the buses sent to convey the students from their various schools safely brought them back to Abuja.\n“As FCT indigenous people, we have to carry out our civic responsibilities as indigenous organisation, with the little resources at our disposal and achieved major result.\n“Many people should understand that FCT indigenous students studying in Jos are from various local communities that make up the entire FCT."
  },
  {
    "headline": "Grazing Routes: Buhari turning Nigeria into a cow republic, prioritizing welfare of cows over human lives – Ortom",
    "summarized_story": "“President Buhari has refused to prove wrong, those who accuse him of being a Fulani President.\n“The Presidency is therefore whipping a dead horse on the issue of grazing reserves.\nWhy has the Buhari administration dumped the programme and opted for grazing reserves and cattle routes?\n“Governor Samuel Ortom has repeatedly stated that there is no land for grazing reserves or cattle routes in Benue State.\n“If President Buhari must actualize his cattle agenda in Benue State, he should be ready to kill all of us!"
  },
  {
    "headline": "Insecurity: UniJos suspends academic activities, shuts hostels",
    "summarized_story": "UNIJOS main gateFollowing the rising spate of insecurity in Jos and its environs, the Management of the University of Jos has suspended all academic activities in the institution till further notice.\nAccording to Danjem, the decision to suspend academic activities and shut hostels was arrived at the end of the meeting between management and the Committee of Deans, Directors and Provost of the institution on Friday, August 20.\nREAD ALSOBreaking: UniJos suspends ongoing examinations over insecurity“The insecurity in Jos, which led to the imposition of dusk-to-dawn curfew has affected the academic activities and forced the university to suspend its second semester examinations for the 2019/2020 academic session.\n“Consequently, the management of the university, after an emergency meeting with the Committee of Deans, Directors and Provost on Friday, ordered the suspension all academic activities in the university until further notice.\nHe called on the students to be law abiding and desist from activities that would put them in trouble."
  },
  {
    "headline": "Surrender of Boko Haram members should be accepted with cautious optimism – MBF warns",
    "summarized_story": "By Peter Duru – MakurdiThe Middle Belt Forum, MBF, has cautioned that the recent unsolicited surrender of Boko Haram members in the North East should be treated with cautious optimism.\nNational President of the MBF, Dr. Bitrus Pogu who sounded the warning weekend while speaking to Vanguard in Makurdi on the sudden decision of some members of the sect to surrender to the government said “going by what had happened in the past, we certainly must have to accept the surrender of Boko Haram members with cautious optimism.\n“Cautious because these people have in the past after coming out to proclaim repentance went back to commit even greater atrocities.\nALSO READ: Stop negative narratives on surrendered Boko Haram fighters – FG warns“This is to ensure that we do not in the next few months find out that they are the ones wearing uniforms of security agencies and then use it to unleash terror on Nigerians.\n“Did they repent because they had a deal with the military or was it they who under pressure decided to surrender?"
  },
  {
    "headline": "Joda: NCC pays tribute to late board Chairman in Yola",
    "summarized_story": "The Board of the Nigerian Communications Commission has paid an official condolence visit to the family of Ahmed Joda, former Board Chairman of the commission in his country home in Yola, Adamawa State.\nThe delegation, which was led by the Chairman of NCC Board, Prof. Adeolu Akande included the Executive Vice Chairman (EVC) of the Commission Prof. Umar Garba Danbatta, the Executive Commissioner, Technical Services, Engr.\nThe NCC delegation was received by family members of the late Chairman led by his eldest son, Alhaji Ali Joda at the deceased Yola town in the Yola South Local Government Area of the state.\nHe said the sterling status achieved by NCC was due to the commitment, hard work, diligence and exceptional leadership demonstrated by Joda when he held sway as NCC Board Chairman for 10 years.\nIn an emotion-laden voice, Prof, Danbatta noted that Baba Joda was a father to him, describing his death as a great personal loss."
  },
  {
    "headline": "Buhari, other top officials violate COVID-19 protocols as crowd storm son’s wedding [VIDEO]",
    "summarized_story": "President Muhammadu Buhari and other top political officers who stormed Bichi in Kano State for his son, Yusuf’s wedding, violated the COVID-19 protocol as advised by health experts.\nThe wedding, which seized global attention on Friday was attended by President Buhari and Vice President Yemi Osinbajo.\nOther dignitaries in attendance include former President, Goodluck Jonathan; former Vice President, Atiku Abubakar; former Niger President, Mahamadiu Isoufou.\nAlso in attendance are the Kano State Governor, Abdullahi Ganduje; Ekiti State Governor, Kayode Fayemi; Yobe State Governor, Mai Mala Buni; Minister of Communications and Digital Economy, Isa Pantami, Femi Fani-Kayode, amongst others.\nDAILY POST reports that the development is coming when the daily cases of COVID-19 Delta variant is on the increase across the country."
  },
  {
    "headline": "Army arrests Boko Haram supplier in Yobe",
    "summarized_story": "Nigerian Army troops of Sector 2 Joint Task Force under Operation HADIN KAI have arrested one Yusuf Saleh, a suspected Boko Haram fertilizer supplier.\nHe was apprehended at Bayamari village in Geidam Local Government Area of Yobe State.\nTroops went after him following credible intelligence, according to Army spokesman, Brigadier General Onyema Nwachukwu.\nThe spokesman assured Nigerians of Army’s determination to totally root out the Boko Haram/Islamic State West Africa Province criminals from their hideouts.\nThe people of North-East were encouraged to continue to provide actionable information to help the ongoing counter-terrorism operations succeed."
  },
  {
    "headline": "Shehu Sani reacts to planned coronation of Sultan of Edo",
    "summarized_story": "Shehu Sani, former Kaduna Central Senator has reacted to the planned coronation of Sultan of Shuwa Arab in Edo State.\nSani said the title Sultan of Shuwa Arab was concocted because it has no historical root anywhere.\nThe social critic stressed that the Edo state Government was right to have warned against such coronation.\nAccording to Sani: “The ‘Sultan of Shuwa Arab’ in Edo is a concocted tittle with no historical genetic root or basis anywhere.\n“Nowadays, people frame all sorts of absurd and sometimes comical traditional tittles for themselves.The Edo State Government action is right.”The Edo State Government had warned those behind the planned coronation to desist from such act."
  },
  {
    "headline": "Taliban: Osama Bin Laden, Al Qaeda are gone, U.S, allies have no interest in Afghanistan – Biden",
    "summarized_story": "U.S President, Joe Biden has declared that America and its allies no longer have any business in Afghanistan.\nThe President said that there is no question of his government credibility, insisting that the U.S and its allies have no in Afghanistan at this point, with Al Qaeda gone.\n“I have seen no question of our credibility from our allies around the world,” he said.\n“What interest do we have in Afghanistan at this point, with Al Qaeda gone?\n“We went to Afghanistan with the “express purpose of tackling Al Qaeda and getting Osama Bin Laden,” he added."
  },
  {
    "headline": "“I’m disappointed in President Biden” – Widow of first US service member killed by Taliban",
    "summarized_story": "The widow of the first American service member to be killed in combat in Afghanistan soon after the 9/11 terrorist attacks, has blasted Joe Biden’s decision to withdraw troops.\nShannon Spann says she was disappointed in his stance of blame shifting when he addressed the nation following the Taliban takeover.\nAccording to her the Taliban take over of Afghanistan is a disrespect to all who have lost their lives fighting for a free Aghanistan.\nUS President, Joe Biden said on Monday August 16, that he stood behind his decision to withdraw U.S. troops from Afghanistan, even though the Taliban swept through the nation.\nHis defiant stance in his address to the nation” Spann told Fox News."
  },
  {
    "headline": "OnlyFans to ban sexually explicit content",
    "summarized_story": "OnlyFans, the subscription platform widely popular for explicit photos and videos, is banning pornography starting October 1.\nAccording to OnlyFans, creators will continue to be allowed to post content containing nudity “as long as it is consistent with our Acceptable Use Policy.” The site’s terms currently allow nudity except in the case of content featuring public nudity recorded in or broadcast from a jurisdiction where public nudity is illegal.\n“OnlyFans remains committed to the highest levels of safety and content moderation of any social platform.\nIt is a subscription-based site that allows creators to earn a living by sharing original videos on the platform.\nFans pay creators for access to their content via a monthly subscription, which can range from $4.99 to $49.99."
  },
  {
    "headline": "Ronaldo, Messi missing as UEFA nominates players, coaches for awards (Full list)",
    "summarized_story": "Juventus’ Cristiano Ronaldo and PSG’s Lionel Messi are missing as UEFA announced the names of the final nominees shortlisted for 2020/21 UEFA Men’s and Women’s Player of the Year Awards.\nOn the same occasion, UEFA will also honour the coaches who have had the biggest impact over the previous season with the UEFA Men’s Coach of the Year and UEFA Women’s Coach of the Year Awards.\nThe coaches and journalists were requested to select a shortlist of three players by allocating respectively five points, three points and one point to each of them.\nThe coaches and journalists were requested to select a shortlist of three coaches by allocating respectively five points, three points and one point to each of them.\nThe final result was based on the total number of votes cast by the coaches and the journalists."
  },
  {
    "headline": "VIDEO: Buhari arrives in Kano for son’s wedding",
    "summarized_story": "The President, Muhammadu Buhari, has arrived in Kano for the wedding ceremony of his son, Yusuf Buhari, who is getting married to Zahra Bayero, the daughter of Nasiru Ado Bayero, the Emir of Bichi in Kano State.\nThe wedding will be taking place today at the palace of the Emir of Bichi.\nWatch the video below;"
  },
  {
    "headline": "PHOTOS: Buhari's son, Yusuf weds Zahra Bayero",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Masari’s call for self-defence: Groups tackle FG over Igboho, Kanu",
    "summarized_story": "Chief Sunday Adeyemo, also known as Igboho, is a prominent member of the Ilana Omo Oodua, championing self-determination for Yoruba nation.\nSaid he: “The comments by Gen Magashi and Governor Masari are by far more harmful to this nation than what Igboho would do.\nHe said: “This comment coming from Governor Masari is a welcome development and indicate two things.\n“Firstly, that the government of the day cannot defend Nigerians and they should admit that and allow Nigerians to defend themselves and even support and empower Nigerians across the country to defend themselves if they are not part of this problem.\n“Secondly, it shows that Igboho in the South-West and Nnamdi Kanu in the South-East have been vindicated over their agitations."
  },
  {
    "headline": "PIA: N’Delta communities may head to court",
    "summarized_story": "He accused them of being insensitive to the plight of the Niger Delta people and threatened that they would be greeted with boos and jeers anytime they come to the Niger Delta region.\nThe governors can collect the money and ensure that not one per cent gets to communities that produce oil but expended on communities without oil,” he said.\nKing Bubaraye Dakolo, Adaga IV, Ibenenaowei of Ekpetiama Kingdom wants Niger Delta lawyers to head to court over the Act.\n“Putting this around the neck of oil communities is stigmatization.\nAccusing the PIA of treating oil producing communities like the subjects of oil companies by empowering these companies to take all decisions about the Host Communities Trust and Fund on behalf of oil producing communities, he urged them to challenge the provisions of the Act in the Supreme Court."
  },
  {
    "headline": "How P-Square’s Paul Okoye’s marriage crashed",
    "summarized_story": "By Christian AgadibeThe marriage between Paul Okoye aka Rude Boy, one half of the defunct music group, P-Square and his entrepreneur wife, Anita Tonye Okoye is over as the latter has filed for divorce.\nThe couple got married in 2014 after dating for 10 years and they both have three beautiful children together.\nThe news of the couple’s impending divorce comes as a rude shock to both of their families and close friends.\nThe source further revealed that both parties will proceed amicably with the legal resolution of the marriage and be the best parents to their children.\nAll efforts to reach Paul Okoye for confirmation have been unsuccessful."
  },
  {
    "headline": "You want to get a visa? These simple steps might lead to success",
    "summarized_story": "There are various categories of visas ranging from; immigrant to non-immigrant visa, work visa, study visa, exchange visitor visa, business/conference visa, and the B1/B2 (visitor visa).\nOthers are; I visa (Journalist and Media), religious worker visa, transit/ship crew visa, domestic employee visa.\nAlso include the evidence of your visa application fee in your application package.\nThe visa official is not interested in losing a day hearing everything about you – unneeded and irrelevant information.\nNine: Avoid disagreeing with the visa officialArguing with the visa official during the interview session is another reason the entire visa interview session might go wrong."
  },
  {
    "headline": "Kano stands still, as Buhari’s son weds Emir’s daughter",
    "summarized_story": "The ceremony was conducted at the palace of the Emir of Bichi, Alhaji Nasiru Ado Bayero, with President Buhari in attendance.\nThe solemnisation, which took place soon after Friday’s Jumat prayers, was conducted by the Minister of Communications and Digital information, Sheikh Isa Pantami.\nSpeaking to reporters, Gombe State governor, Mohammed Inuwa Yahaya described the wedding as a national event.\n“I saw solidarity, I saw peace and I saw harmony in this event.\nSo I pray that God will continue to give us peace and harmony and I pray this will be celebrated by others,” the governor said."
  },
  {
    "headline": "News in Photographs: Eminent Nigerians in Kano for Yusuf Buhari’s Wedding",
    "summarized_story": "Vice President Yemi Osinbajo, former President Goodluck Jonathan, former Vice President Atiku Abubakar, state governors, ministers, business leaders, traditional rulers and top government officials were among eminent Nigerians that converged on Kano Friday for the solemnisation of the marriage between President Muhammadu Buhari’s son, Yusuf, and Zahra, daughter of Emir of Bichi, Nasiru Ado Bayero.\nAlso in Kano for the ceremony was the former Niger Republic President Mahamadou Issoufou.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NGF: 30% Frontier Exploration, Host Communities’ 3% Deplete Federation Account",
    "summarized_story": "Fayemi said those provisions in the law assented to by President Muhammadu Buhari on August 16 greatly depleted the Federation Account.\nWe are talking about depletion from the federation account, whether it is three per cent or 30 per cent.\nThat crude belongs to the federation of Nigeria and when it is sold, it has to go to the federation account.\nBut he revealed that negotiation was on with the state governors on the issues.\nToday, we watch and see how the 30 per cent set aside for the frontier exploration will be managed."
  },
  {
    "headline": "CNA: How Shagari Prevented Second Republic Lawmakers from Hijacking N’Assembly Bureaucracy",
    "summarized_story": "By Deji Elumoye and Udora OrizuClerk to the National Assembly, Ojo Olatunde Amos, Thursday disclosed that late former President Shehu Shagari prevented members of the Second Republic National Assembly from making themselves members of the National Assembly Service Commission (NASC).\nAmos made this known while playing host to a delegation of the Committee on Administration and Human Resources of Ghana Parliamentary Service Board at the National Assembly.\nThe Clerk explained how parliamentary bureaucracy was treated like an appendage of the Executive arm of government until year 2000 when the National Assembly Service Commission was created.\n“When the proposal got to President Shehu Shagari, he asked the Members of the National Assembly to choose between being members of the National Assembly and members of the National Assembly Service Commission.\n“1983 the National Assembly was again suspended until 1993 when General Ibrahim Babangida ousted Buhari."
  },
  {
    "headline": "Breaking: Buhari Okays Review of Grazing Reserves in 25 States",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari Thursday gave a go ahead for the immediate review of Grazing Reserves in 25 out of the 36 states of the federation.\nAmong others, the committee had recommended the collection of field data on 368 Grazing Reserves across 25 states to assess encroachment and encroachers, stakeholder engagements and sensitization.\nThe number of the Grazing Reserves and States were deduced from considerations of existing security concerns and other pre-existing socio-economic conditions.\nThe President directed that the assignment be undertaken with dispatch to bring more understanding on the Grazing Reserves, and implementation.\nThe Committee was also expected to make recommendations for gazetting of ungazetted Grazing Reserves and create a data base of National Cattle Herders and ensure that Grazing Reserves were well communicated to all stakeholders."
  },
  {
    "headline": "Buhari: Nigeria Will Be Well Secured Before I Leave Office",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has given an assurance that Nigeria will be well secured before he leaves office in May, 2023.\nHe emphasised that all within his power will be done to ensure that he does not leave the country in security crisis by the time his term of office ends.\nThe President gave the assurance Thursday while presiding over the National Security Council meeting at the State House, Abuja.\nThe National Security Adviser (NSA), Major-General Babagana Monguno (rtd), who disclosed the President’s position while speaking with newsmen after the meeting, said President Buhari also expressed his readiness to make more changes in the nation’s security architecture whenever the need arises.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Petroleum Bill: Shameless Nigerian Lawmakers Battle Senate President Lawan, House Speaker Gbajabiamila Over Lopsided Sharing Of Multi-million Dollar Bribe",
    "summarized_story": "\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\n\"Each senator was paid $20, 000 (N8.2 million) while members of the lower chamber (House of Representatives) were paid $5, 000 (N2 million) each,\" the source added.\n“The Senate President received $2 million and the Speaker received $2 million.\nLawmakers said the cash logistics was coordinated by state petroleum minister Timipre Sylva and Senator Albert Akpan (PDP-Akwa Ibom).\n“A lawmaker protested the sharing formula but no one responded or engaged him in the House' WhatsApp group,” the lawmaker said."
  },
  {
    "headline": "Petroleum Bill: Shameless Nigerian Lawmakers Battle Senate President Lawan, House Speaker Gbajabiamila Over Lopsided Sharing Of Multi-million Dollar Bribe",
    "summarized_story": "\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\n\"Each senator was paid $20, 000 (N8.2 million) while members of the lower chamber (House of Representatives) were paid $5, 000 (N2 million) each,\" the source added.\n“The Senate President received $2 million and the Speaker received $2 million.\nLawmakers said the cash logistics was coordinated by state petroleum minister Timipre Sylva and Senator Albert Akpan (PDP-Akwa Ibom).\n“A lawmaker protested the sharing formula but no one responded or engaged him in the House' WhatsApp group,” the lawmaker said."
  },
  {
    "headline": "EXPOSED: Dollar Bribes Received By Nigeria's Senate President, Lawan, House Speaker Gbajabiamila, Other Lawmakers To Pass Controversial Petroleum Bill",
    "summarized_story": "Nigeria's Senate President, Ahmad Lawan and the Speaker of the House of Representatives, Femi Gbajabiamila were paid in dollars (millions of naira) to ensure the passage of the controversial Petroleum Industry Bill (PIB) recently signed into law by President Muhammadu Buhari, SaharaReporters has learnt.\n\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\nThe Nigerian Senate recently passed the Petroleum Industry Bill approving 3 per cent for host communities despite calls from various quarters that the provisions made for host communities should be reviewed upward.\nTheir president, Benjamin Tamanarebi said the PIB passed by NASS was a fruitless exercise and unacceptable to the host communities.\nIn their July 5 meeting, governors of Nigeria’s southern states also rejected the proposed three per cent share to host communities in the Petroleum Industry Bill."
  },
  {
    "headline": "EXPOSED: Dollar Bribes Received By Nigeria's Senate President, Lawan, House Speaker Gbajabiamila, Other Lawmakers To Pass Controversial Petroleum Bill",
    "summarized_story": "Nigeria's Senate President, Ahmad Lawan and the Speaker of the House of Representatives, Femi Gbajabiamila were paid in dollars (millions of naira) to ensure the passage of the controversial Petroleum Industry Bill (PIB) recently signed into law by President Muhammadu Buhari, SaharaReporters has learnt.\n\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\nThe Nigerian Senate recently passed the Petroleum Industry Bill approving 3 per cent for host communities despite calls from various quarters that the provisions made for host communities should be reviewed upward.\nTheir president, Benjamin Tamanarebi said the PIB passed by NASS was a fruitless exercise and unacceptable to the host communities.\nIn their July 5 meeting, governors of Nigeria’s southern states also rejected the proposed three per cent share to host communities in the Petroleum Industry Bill."
  },
  {
    "headline": "Bandits Attack Zamfara Town, Kidnap 60 Persons In Midnight Raid",
    "summarized_story": "Bandits have attacked Rini town in the Bakura Local Government Area (LGA) of Zamfara State.\nEyewitnesses told Channels Television on Friday that the armed men stormed the town at about 2:30am and started shooting sporadically.\nThe police authorities in Zamfara State confirmed the incident, although they did not give the actual number of residents kidnapped by the bandits.\nThe attack on Rini comes barely a week after bandits invaded the College of Agriculture and Animal Science, also in Bakura LGA.\nThe bandits were said to have contacted the school management to make a demand of N350million as ransom for the victims to be released."
  },
  {
    "headline": "'Scores abducted' in fresh attack on Zamfara community",
    "summarized_story": "Scores of residents in Zamfara have been reportedly kidnapped, following an attack on Rimi village in Bakura LGA, on Friday.\nAdvertisementIbrahim Dosara, Zamfara commissioner for information, confirmed the attack on Friday.\nAccording to him, about 60 residents were said to have been kidnapped, but security agencies are yet to confirm the figure.\n“In all honesty and sincerity, government of Zamfara state, in conjunction with the security agencies are making all efforts to ensure that the abducted students and their staff are released.\n“I’ll like people to realise that over some months, there has been mass reduction in the activities of the bandits in Zamfara state in particular, and in some parts of the north."
  },
  {
    "headline": "'Scores abducted' in fresh attack on Zamfara community",
    "summarized_story": "Scores of residents in Zamfara have been reportedly kidnapped, following an attack on Rimi village in Bakura LGA, on Friday.\nAdvertisementIbrahim Dosara, Zamfara commissioner for information, confirmed the attack on Friday.\nAccording to him, about 60 residents were said to have been kidnapped, but security agencies are yet to confirm the figure.\n“In all honesty and sincerity, government of Zamfara state, in conjunction with the security agencies are making all efforts to ensure that the abducted students and their staff are released.\n“I’ll like people to realise that over some months, there has been mass reduction in the activities of the bandits in Zamfara state in particular, and in some parts of the north."
  },
  {
    "headline": "INEC: Why PDP was excluded from list of Anambra guber candidates",
    "summarized_story": "The Independent National Electoral Commission (INEC) has explained why the Peoples Democratic Party (PDP) was excluded from the revised list of candidates for the Anambra governorship election.\nAdvertisementOn Thursday, INEC released a revised list of candidates for the Anambra governorship poll, scheduled to hold on November 6, and there is currently no candidate for the PDP.\nThe commission had also excluded the PDP from the first list released on July 16.\nAdvertisementOkoye further explained that an appeal court has ruled that the commission should not publish the name of any PDP candidate until the determination of the suit.\nSpeaking further, the INEC commissioner said the PDP would be added to the candidates’ list after the determination of the suit at the court of appeal."
  },
  {
    "headline": "INEC: Why PDP was excluded from list of Anambra guber candidates",
    "summarized_story": "The Independent National Electoral Commission (INEC) has explained why the Peoples Democratic Party (PDP) was excluded from the revised list of candidates for the Anambra governorship election.\nAdvertisementOn Thursday, INEC released a revised list of candidates for the Anambra governorship poll, scheduled to hold on November 6, and there is currently no candidate for the PDP.\nThe commission had also excluded the PDP from the first list released on July 16.\nAdvertisementOkoye further explained that an appeal court has ruled that the commission should not publish the name of any PDP candidate until the determination of the suit.\nSpeaking further, the INEC commissioner said the PDP would be added to the candidates’ list after the determination of the suit at the court of appeal."
  },
  {
    "headline": "'Nine bandits' killed in Kaduna after 'face-off over sharing of ransom'",
    "summarized_story": "The Kaduna government says a confrontation between two groups of bandits in Giwa LGA of the state, has resulted in the killing of nine persons.\nAdvertisementSamuel Aruwan, commissioner for internal security and home affairs, disclosed this in a statement issued on Friday in Kaduna.\nAccording to the commissioner, credible intelligence networks informed the state government of the development, which was further confirmed by security agencies.\n“Intelligence sources had reported that a notorious bandit known as ‘Godon Mota’ stormed Garke village last Wednesday with his gang and clashed with a rival bandit group, leading to the killing of nine members,” Aruwan said.\n“Investigations and security patrols are ongoing,” Aruwan added."
  },
  {
    "headline": "Explained: Can the Nigerian government really spy on your WhatsApp messages?",
    "summarized_story": "However, some uncertainty hangs over how Nigerian authorities plan to go about intercepting WhatsApp, particularly because the platform uses end-to-end encryption for its messages.\nStorage loopholesThere are also vulnerabilities with how WhatsApp messages are stored, which could be exploited by hackers.\nWhatsApp chats are saved in four locations, from where data can be retrieved later.\nIt’s unclear how the Nigerian government intends to go about tracking WhatsApp messages after earmarking billions of naira for the said interception solution.\nWith over 90 million Nigerian users per data from Statista, WhatsApp is the most popular social media platform used in the country."
  },
  {
    "headline": "Meet Regina Honu, a Ghanaian software developer teaching thousands of girls to code",
    "summarized_story": "Failure is not finalIn her first year in senior secondary school, Honu had her first taste of failure during an Inter-school quiz competition.\nConversation between Regina Honu and students of Ashesi University during a visit.\nSame experience at another bank and turning away from a job at MicrosoftShe eventually left Zenith bank for Fidelity bank, a Ghanaian Bank.\nResigning from her JobThe morning of the day Honu resigned from her job, she didn’t know it would happen.\n10 years and countingIt’s been almost 10 years since Honu started Soronko Academy, for her there’s still so much more to do."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "World Photography Day, Leaked NITDA bill, CashBackApp’s $475k pre-seed",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:World Photography DayMore about the leaked NITDA billCashBackApp’s pre-seed roundWorld Photography DayYesterday was World Photography Day, and we explored the ancient Nigerian city of Ilé-Ifè in the south-western part of the country.\nMore about the leaked NITDA billIt seems like the conversation about the leaked NITDA bill isn’t ending anytime soon.\nCheck it out: 11 critical questions on the leaked NITDA bill; a tussle for more power?\nSneak peek: While the leaked bill suggests an expansion of the penalties in the old bill, it doesn’t require NITDA to collaborate with the Standards Organisation of Nigeria to enforce its regulations.\nCashBackApp’s pre-seed roundKenyan customer loyalty startup, CashBackApp, has raised $475,000 to help scale its service in Kenya and expand to neighbouring countries."
  },
  {
    "headline": "11 critical questions on the leaked NITDA bill; a tussle for more power?",
    "summarized_story": "It finally gained traction when a link to the leaked bill was released, and several screenshots of supposedly alarming provisions began to float all over social media.\nWhat the Agency does have is a host of functions which increase from 14 to 24 in the leaked bill.\nIn a preceding subsection, the leaked bill proposes a fine not exceeding ₦30,000,000 ($72,832.21).\nAfter a more in-depth search, the name Galaxy Information Technology and Telecommunication (GITT) cropped up.\nGalaxy Information Technology and Telecommunications Limited started as a Dutse-based ISP in 2001 and morphed into what is now Galaxy Backbone."
  },
  {
    "headline": "A walk of photographs through nature and culture in the ancient city of Ilé-Ifè",
    "summarized_story": "World Photography Day is celebrated annually on August 19 to commemorate the art, science, and technology behind photography.\nTo celebrate this special global event, we explored the ancient South-Western Nigerian city of Ilé-Ifè from a cultural and natural perspective.\nOur final stop was the Natural History Museum at the Obafemi Awolowo University, Ilé-Ifè, where we took pictures of current and historical records of animals, insects, and plants.\nMuseum of Natural History, Obafemi Awolowo University, Ile-Ife, Osun State.\nIt was a reminder of how much there is to know and understand about our natural world."
  },
  {
    "headline": "World Bank applauds Obaseki’s deployment of tech to strengthen basic education, boost skills devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The World Bank has praised Edo State Governor, Mr. Godwin Obaseki for the deployment of technological innovations to drive reforms in basic education and skills development in the state.\nWorld Bank’s Senior Education and Technology Policy Specialist and Global Lead for Technology and Innovation in Education, Mr. Robert Hawkins, at a MasterCard sponsored programme, ED Tech, commended Governor Obaseki for bringing together stakeholders in the public and private sector to deliver major reforms in basic education and skills development in Edo State.\nAccording to him, effective leadership is necessary for constructive public-private partnerships that can take advantage of the knowledge that those in the private sector have and use it to meet the needs of the public sector.\nIn April 2018, the Obaseki-led administration implemented far-reaching reforms in the basic education sector, deploying technology-based modern methods of teacher training, lessons delivery, pupils’ evaluation and classroom management through the Edo Basic Education Sector Transformation (EdoBEST) programme.\nThe governor has now expanded the EdoBEST programme to capture secondary schools and tertiary institutions in the state."
  },
  {
    "headline": "COVID-19: Edo records 171 cases, three deaths in third wave – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has recorded 22 new cases and one more COVID-19 related death, bringing the total number of deaths recorded in the third wave of the pandemic to three.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nObi said the 22 new cases, raised the total number of confirmed cases in the state to 171, noting that Edo also recorded two more recoveries from the virus and collected 174 samples for testing.\nHe stated that over 95 percent of the newly confirmed cases are those who were never vaccinated, adding, “This is a clear indication that the vaccines provide significant protection against the virus.\nObi, however, charged residents not to disregard the state’s preventive protocols against the spread of the deadly virus to avoid infection."
  },
  {
    "headline": "Shalom Jare Has No Claim To Parcel Of Land In Okhuoromi – Barr. Peter Uwadiae – Nigerian Observer",
    "summarized_story": "Let me just quickly say this, the hostility between Okhuoromi and Shalom Jare started in 2018.\nIt was the Oba’s representatives that created the boundaries between Aruogba and Okhuoromi and Okhuoromi and Egbirhe.\nI will venture to say that Shalom Jare does not have any claim to that land.\nThe court advised Shalom Jare that look, there is a case pending that is more elaborate, embracing this particular land in another court.\nI watch their protest on Television, and the persons who were even demonstrating are not Shalom Jare Ventures, but representatives of Shalom Jare."
  },
  {
    "headline": "Commmunity lauds Enogie over prevailing peace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEYAEN (UHUNMWODE) – The sons and daughters of Eyaen commmunity in Uhunmwode Local Government Area of Edo State have lauded the Enogie (Duke) of the community, His Royal Highness, Dr. Osazuwa Aiwerioghene Iduriase over the manner he has brought peace to reign in the community.\nIn a statement, they also lauded the prevailing peace and therefore prayed everyone in the community to key into the process by supporting him to bring development to the locality.\nThe statement was signed by Hon Lawrence Osarenren and Samuel Iduwe, the Chairman and Secretary respectively.\nThey described the Enogie as a man of peace who does not want anything that would bring the image and reputation of the community into disrepute.\nThey therefore pledged their continuous loyalty and support to the Enogie."
  },
  {
    "headline": "Lassa Fever: Nigeria’s death toll rises to 73",
    "summarized_story": "ADVERTISEMENTThe rage of the Lassa Fever virus is still very much around despite torrential rains, as Edo and Ondo states record more infections with attendant deaths.\nWith two deaths recorded in Week 32 (August 9-15), Nigeria’s death tally is now 73 since the beginning of the new Lassa season.\nHowever, in Week 29 (July 19-25), one death was recorded out of four confirmed cases.\nThere were no deaths in Week 30 (July 26-August 1) but there were 12 confirmed cases of the infection.\nThe number of confirmed cases then dropped from 12 in Week 30 to four in Week 31, but one death was recorded."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "U.S. Consulate supports capacity building projects for teachers in Oyo State",
    "summarized_story": "Over the next 12 months, the U.S. Consulate General in Lagos is supporting a series of professional development workshops for 100 primary and secondary school teachers drawn from across local communities in Oyo State.\nThe capacity development project tagged “Ibadandun” seeks to introduce the participating teachers to fun, creative and interactive teaching methods that enhance educational outcomes such as improved numeracy, literacy and school attendance.\n“The U.S. Mission is fully committed to supporting a more educated population by increasing and strengthening the capacity of Nigerian teachers,” Acting Consul General Ibelli said.\n“Teachers who use innovative pedagogy and interactive assessment techniques enliven the teaching-learning process for their students.\nGovernment exchange alumni are at the forefront of promoting access to qualitative education, good governance and civic engagement throughout Nigeria."
  },
  {
    "headline": "Ortom lampoons Buhari over plot to create grazing reserves for herdsmen across the country, rejects policy",
    "summarized_story": "Benue State governor, Samuel Ortom, has berated President Muhammadu Buhari over his latest move to create grazing reserves for Fulani herdsmen across the country.\nWhy has the Buhari administration dumped the programme and opted for grazing reserves and cattle routes?\n“Governor Samuel Ortom has repeatedly stated that there is no land for grazing reserves or cattle routes in Benue State.\n“If President Buhari must actualize his cattle agenda in Benue State, he should be ready to kill all of us!\nWe know that grazing reserves and cattle routes are the only project that the President has for Nigeria, but Benue is not interested in such a project.”"
  },
  {
    "headline": "Photos: ex-Niger President, Osinbajo, Jonathan, Atiku, governors join Buhari at son’s wedding in Kano",
    "summarized_story": "Dignitaries, including former president, Goodluck Jonathan; former vice president, Alhaji Atiku Abubakar; current vice president, Prof Yemi Osinbajo, several governors have joined President Muhammadu Buhari in Kano for the solemnisation of holy matrimony of his son, Yusuf and Zahra, daughter of the Emir of Bichi held at Bichi, Kano State.\nAlso at the ceremony holding today, Friday, are former Vice President Atiku Abubakar, former Niger President, Mahamadou Isoufou, former Senate President, Bukola Saraki, governors of Ekiti, Adamawa, Kano, among others.\nA fierce critic of President Buhari and former aviation minister, Chief Femi Fani-Kayode also attended the wedding and was seen posing for pictures with, Isa Pantami, the controversial minister of technology and digital economy accused of supporting terror groups such Al-Qaeda."
  },
  {
    "headline": "Alerzo raises $10.5m series A to bring Nigeria’s informal retail sector online",
    "summarized_story": "Alerzo, a B2B e-commerce retail startup based in Ibadan, has announced a $10.5 million Series A round led by London-based Nosara Capital.\nFJ Labs and several family offices from the U.S., Europe and Asia, including Michael Novogratz’s, participated in the round.\nAdewale Opaleye founded Alerzo in 2018 as a last-mile distribution platform that helps retailers stock inventory directly from manufacturers.\nSpeaking with TechCrunch, Opaleye said he started Alerzo to empower the millions of women who are the backbone of consumer commerce in Nigeria’s $100 billion informal retail sector.\n“Growing up in Ibadan, I watched my mother operate two informal retail stores to raise my three siblings and me."
  },
  {
    "headline": "EDITORS CONGRATULATE ITS EX-PRESIDENT ON HIS APPOINTMENT AS NNPC’S SPOKESMAN",
    "summarized_story": "By KEN EMORDIThe Nigerian Guild of Editors (NGE) has congratulated one of its former Presidents, Garba Deen Mohammed (FNGE), on his appointment as the Group General Manager (Public Affairs) of the Nigerian National Petroleum Corporation (NNPC).\n”We commend the Minister of State for Petroleum Resources, Chief Timipre Sylva and the Group Managing Director of NNPC, Mele Kyari, for making the right choice.\n”Garba Deen’s appointment comes at a time the NNPC is undergoing a transition following the signing into law of the Petroleum Industry Bill by President Muhammadu Buhari”, the NGE stated.\nWhile thanking the outgoing NNPC’s spokesperson, Dr Kennie Obateru, for his excellent relationship with the Guild – during his tenure, the editors said they look forward to working with Garba Deen to deliver on his onerous assignment.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "EDITORS CONGRATULATE ITS EX-PRESIDENT ON HIS APPOINTMENT AS NNPC’S SPOKESMAN",
    "summarized_story": "By KEN EMORDIThe Nigerian Guild of Editors (NGE) has congratulated one of its former Presidents, Garba Deen Mohammed (FNGE), on his appointment as the Group General Manager (Public Affairs) of the Nigerian National Petroleum Corporation (NNPC).\n”We commend the Minister of State for Petroleum Resources, Chief Timipre Sylva and the Group Managing Director of NNPC, Mele Kyari, for making the right choice.\n”Garba Deen’s appointment comes at a time the NNPC is undergoing a transition following the signing into law of the Petroleum Industry Bill by President Muhammadu Buhari”, the NGE stated.\nWhile thanking the outgoing NNPC’s spokesperson, Dr Kennie Obateru, for his excellent relationship with the Guild – during his tenure, the editors said they look forward to working with Garba Deen to deliver on his onerous assignment.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Lai Mohammed: Why FG can’t prosecute repentant insurgents",
    "summarized_story": "The Federal Government has admonished “naysayers” to stop spewing negative and false narratives around Boko Haram members who are surrendering in droves in the North-East.\nThe Minister of Information and Culture, Alhaji Lai Mohammed gave the admonition in an interview with the News Agency of Nigeria on Friday in Washington.\nThe minister berated those who were alleging that the surrendered insurgents were not actual Boko Haram fighters and if they were, they should be shot rather than granted amnesty.\n“The President, however, remained focused and confident in his belief in the Nigerian military that they have what it takes to defeat the insurgents.\n“We thank God that Mr President today has been proven right."
  },
  {
    "headline": "Lai Mohammed: Why FG can’t prosecute repentant insurgents",
    "summarized_story": "The Federal Government has admonished “naysayers” to stop spewing negative and false narratives around Boko Haram members who are surrendering in droves in the North-East.\nThe Minister of Information and Culture, Alhaji Lai Mohammed gave the admonition in an interview with the News Agency of Nigeria on Friday in Washington.\nThe minister berated those who were alleging that the surrendered insurgents were not actual Boko Haram fighters and if they were, they should be shot rather than granted amnesty.\n“The President, however, remained focused and confident in his belief in the Nigerian military that they have what it takes to defeat the insurgents.\n“We thank God that Mr President today has been proven right."
  },
  {
    "headline": "Ortom, Afenifere knock Buhari: You are wasting your time on grazing routes",
    "summarized_story": "Hard knocks came the way of President Muhammadu Buhari on Friday over his unrelenting idea to re-chart grazing routes and grazing reserves in 25 states for his Fulani herdsmen.\nThe condemnation came from both Benue Governor Samuel Ortom and the Yoruba political group, Afenifere.\n“In the first place, the Federal Government and the President do not have the right to preside over the land of Benue State.\n“The President cannot say that cattle routes and grazing areas will be designated in Benue State.\nYoruba socio-cultural group, Afenifere, also slammed the directive by President Muhammadu Buhari for review of 368 Grazing Reserves across 25 States as a plot to annex land for herders."
  },
  {
    "headline": "Idriss Adanno, aborted Sultan of Shuwa Arabs apologises",
    "summarized_story": "By Jethro Ibileke/BeninAlhaji Idriss Adanno, the man who would have been installed today as Sultan of Shuwa Arabs of Edo State, has canceled all activities planned for the event.\nHe pledged his loyalty to the Benin Monarch, Oba Ewuare II, who he described as father to all northerners in the State.\n“In our Shuwa language, Sultan is our own Sarkin and we only wanted to celebrate my appointment as the head of Shuwa Arabs in Benin because we are the second-largest local ethnic group from the north.\nWe are also loyal to our Royal father, the Oba of Benin, who is father to all of us.\nSultan in their own language means Sarkin,” Isa stressed."
  },
  {
    "headline": "Boko Haram, ISWAP: Why Buhari Government Can Never Kill Repentant Terrorists – Lai Mohammed",
    "summarized_story": "The Nigerian government has explained why Boko Haram fighters who have surrendered cannot be murdered.\nMinister of Information and Culture Lai Mohammed stated that providing amnesty was the wisest option.\nMohammed explained that prosecuting and killing repentant insurgents was against global best practices.\nHe spoke in an interview with the News Agency of Nigeria (NAN) on Friday in Washington.\nAbout 1,000 Boko Haram fighters surrendered to army units in the southern Borno towns of Konduga, Bama, and Mafa."
  },
  {
    "headline": "21-Year-Old Detained For ‘Being Girlfriend Of IPOB Member’ – IGP Orders Probe",
    "summarized_story": "Inspector-General of Police Usman Baba has ordered a probe into the alleged imprisonment of Glory Okolie, a 21-year-old woman, by Intelligence Response Team (IRT) officers in Imo state.\nOkolie was said to have been arrested on June 17 by IRT officers in order to use her as bait to arrest her boyfriend who is suspected to be a member of the Indigenous People of Biafra (IPOB).\nGwamnishu accused the police of extorting the family when they went to ask for her bail.\n“21-year-old Miss Glory Okolie who enrolled for 2021 JAMB exam has been in police detention since 17th June, 2021 till date.\n“The family immediately went to IRT office and requested to see Glory and bail her out and till date it’s been one story or the other."
  },
  {
    "headline": "See The Reception Venue For Yusuf Buhari And Zahra Wedding (Photos And Video)",
    "summarized_story": "As the Wedding Fatiah formalizing the Holy soleminization of the President’s Son Yusuf and his beautiful, Zahra is ongoing.\nGuests for the high profile wedding event and going to be welcomed in this hall.\nBeautiful and simple too.\nDoesn’t look expensive like Lagos halls settingsHere is the video of the venue belowCheckout some images below"
  },
  {
    "headline": "Femi Fani-Kayode In Kano For Yusuf Buhari’s Wedding",
    "summarized_story": "Governors and ministers are among the dignitaries expected to attend the ceremony in Kano.\nFemi Fani-Kayode, a fierce Buhari critic, announced via his Facebook page that he arrived in Kano on Thursday to attend the ceremony.\nDespite his criticism of them, Fani-Kayode referred to them as “my friends”, adding that “it is a pleasure and a joy to be here”.\n“Flew into Kano with my friends and brothers Governor Bello Matawalle of Zamfara state, Governor Babagana Umar Zulum of Borno State, Senator Sani Ahmed Yarima, Senator Ali Ndume, Ambassador Bashir Yuguda, Hon.\nMinister Isa Pantami, Mallam Nuhu Ribadu and others for the wedding ceremony of President Muhammadu Buhari’s son, Yusuf Buhari, to HRH Nasiru Ado Bayero, the Emir of Bichi’s daughter, Zahra Ado Bayero,” Fani Kayode wrote."
  },
  {
    "headline": "In Kaduna, bandit groups turn against each other, kill nine",
    "summarized_story": "Nemesis caught up with two groups of armed bandits in Giwa local government of Kaduna state who in a fratricidal gun duel killed nine of their fellow bandits on Wednesday.\nKaduna state Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan, who made this known in a statement on Friday, said the bandits’ death has been confirmed through human intelligence and by security agencies.\n“Credible human intelligence networks informed the Kaduna state government of the development, which was further corroborated by security agencies.\n“Intelligence sources had reported that a notorious bandit known as ‘Godon Mota’ stormed Garke village last Wednesday with his gang and clashed with a rival bandit group, leading to the killing of nine members.\n“The cause of the fratricidal face-off is yet unclear, but was said to revolve around a disagreement over sharing of accumulated ransoms, during which one of the groups felt cheated."
  },
  {
    "headline": "Pictures: Private jets take over Kano international airport over Buhari’s son wedding",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: President Muhammadu Buhari in Kano for son’s wedding",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria wins 4x400m mixed relay gold at World Athletics U20 -NigPilot",
    "summarized_story": "Team Nigeria lived up to pre-race billings as the 4x400m mixed relay team won the gold medal in a new Championship record time of 3:19.70.\nThe quartet of Johnson Nnamani, Imaobong Nse Uko, Opeyemi Oke, and Bamidele Ajayi also made history as the first winners of the event at the World U20 Championship , beating Poland (3:19.80) and India (3:20.60).\nNse Uko has also qualified for the individual 400 m final scheduled for Saturday and stands as the favorite to restore Nigeria as World U20 champions since Bisi Afolabi succeeded Fatimah Yusuf as queen of the quarter-mile in 1994 in Lisbon, Portugal.\nIn the men’s javelin throw, Team Nigeria’s Chinecherem Nnamdi throw a massive new personal best and Nigeria U20 record of 78.03 to qualify for the final.\nThe 19-year-old 2019 African Games bronze medal winner added almost 5 cm to his previous best of 73.24 m to jump to the queue as one of the favorites for the gold medal."
  },
  {
    "headline": "Nigeria wins 4x400m mixed relay gold at World Athletics U20 -NigPilot",
    "summarized_story": "Team Nigeria lived up to pre-race billings as the 4x400m mixed relay team won the gold medal in a new Championship record time of 3:19.70.\nThe quartet of Johnson Nnamani, Imaobong Nse Uko, Opeyemi Oke, and Bamidele Ajayi also made history as the first winners of the event at the World U20 Championship , beating Poland (3:19.80) and India (3:20.60).\nNse Uko has also qualified for the individual 400 m final scheduled for Saturday and stands as the favorite to restore Nigeria as World U20 champions since Bisi Afolabi succeeded Fatimah Yusuf as queen of the quarter-mile in 1994 in Lisbon, Portugal.\nIn the men’s javelin throw, Team Nigeria’s Chinecherem Nnamdi throw a massive new personal best and Nigeria U20 record of 78.03 to qualify for the final.\nThe 19-year-old 2019 African Games bronze medal winner added almost 5 cm to his previous best of 73.24 m to jump to the queue as one of the favorites for the gold medal."
  },
  {
    "headline": "Poor leadership limiting impact of trade unions- Sirika -NigPilot",
    "summarized_story": "Minister of Aviation, Hadi Sirika, has highlighted that like in other sectors, the challenge of poor and non-proactive leadership has reduced the impact of Trade Unions across sectors in the country.\nThis, he said has contributed to a lack of trust by members and wrong strategies by union leaders in addressing the myriads of issues that regularly call for attention.\n“On our part, we will continue to support the involvement of union leaders and workers in our policy and decision-making processes.\n“In the Nigerian aviation sector, I dare say that the various labour unions have tried to play this role effectively.\nThis role enables labour unions to ensure that cordial and good understanding between employers and employees could be established in the workplace and leads to a harmonious and conducive working environment."
  },
  {
    "headline": "Poor leadership limiting impact of trade unions- Sirika -NigPilot",
    "summarized_story": "Minister of Aviation, Hadi Sirika, has highlighted that like in other sectors, the challenge of poor and non-proactive leadership has reduced the impact of Trade Unions across sectors in the country.\nThis, he said has contributed to a lack of trust by members and wrong strategies by union leaders in addressing the myriads of issues that regularly call for attention.\n“On our part, we will continue to support the involvement of union leaders and workers in our policy and decision-making processes.\n“In the Nigerian aviation sector, I dare say that the various labour unions have tried to play this role effectively.\nThis role enables labour unions to ensure that cordial and good understanding between employers and employees could be established in the workplace and leads to a harmonious and conducive working environment."
  },
  {
    "headline": "Yobe Airport to gulp N6bn – Minister -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has informed that construction of the Wachaka Airport in Yobe State will cost up to N6, 284, 065, 056.00.\nBriefing journalists on Wednesday, Sirika said the sum was approved by the Federal Executive Council (FEC) during its meeting.\nHe added that a second approval was given for the Post-Consultancy Services for the construction of the Wachakal Airport.\nAccording to Sirika, the contract sum is N9,535,132,500 and included 7.5 percent VAT, with a delivery period of 12 months.\nHe said that the total contract sum for the procurement s N658,762,783.36, which includes 7.5 percent VAT."
  },
  {
    "headline": "Insecurity: UniJos Suspends Academic Activities, Closes Hostels",
    "summarized_story": "The University of Jos on Friday suspended academic activities and closed its hostels.\nThe suspension order was due to the intensified killing of students around the university area shortly after the relaxation of a 24-hour curfew in Jos.\nREAD ALSO: Lalong Condemns Killing Of Travellers In PlateauThe University management also approved the suspension of examinations for the second semester 2019/2020 academic session.\nLast Saturday, travellers along Rukuba road in Jos North Local Government had been attacked, heightening tensions in the state.\nTo curb further attacks, Plateau State Governor, Simon Lalong, had imposed a curfew on Jos North, Bassa and Jos South Local Government Areas."
  },
  {
    "headline": "Bandits Attack Rini Town In Zamfara, Abduct Many Locals",
    "summarized_story": "Bandits have attacked Rini town in Bakura Local Government Area (LGA) of Zamfara State.\nEyewitnesses told Channels Television on Friday that the armed men stormed the town at about 2:30am and started shooting sporadically.\nWhile residents were said to have refused to come out of their homes despite heavy gunshots renting the air, the bandits abducted many locals numbering over 60.\nPolice authorities in Zamfara State have confirmed the incident to Channels Television, although they did not give the actual number of residents kidnapped by the bandits.\nThe attack on Rini comes barely a week after bandits invaded the College of Agriculture and Animal Science, also in Bakura LGA."
  },
  {
    "headline": "Nine Bandits Killed As Rival Groups Face Off In Kaduna",
    "summarized_story": "At least nine bandits have been killed during a gunfight between rival groups in Kaduna State.\nREAD ALSO: Bandits Attacking Kaduna Because We Refused To Give Them Money – El-RufaiIn the last one year, bandits have attacked many communities in the region, with a lot of people killed and hundreds abducted.\nDuring the period, several schools have come under attack in Kaduna, Zamfara, Niger, and Kebbi where bandits abducted over 1,000 students.\nAs the bandits continue to attack communities in Kaduna, the state government says it will no longer consider the option of negotiation with the criminals.\nAccording to the security report of the state for the first quarter, a total of 323 people were killed by bandits in Kaduna between January and March."
  },
  {
    "headline": "UPDATED: Over 450 Households Affected, Seven Killed As Flood Ravages Yobe Communities",
    "summarized_story": "No fewer than 450 households were affected by a recent flood that ravaged several communities in Yobe State, authorities have said.\nAll persons killed by the flood were residents of Potiskum Local Government Area (LGA) where at least 250 households were affected.\nWhile about 249 households were also affected in Nguru LGA, authorities have yet to ascertain the number of those affected in communities in Damaturu, the state capital.\nGoje added that the team has been working hard to ensure those affected were properly taken care of while several affected households have been provided food and temporary shelter.\nHe also confirmed the number of households affected in the various communities."
  },
  {
    "headline": "Troops Arrest Suspected Boko Haram Urea Fertilizer Supplier In Yobe",
    "summarized_story": "Nigerian Army troops of Sector 2 Joint Task Force North East Operation Hadin Kai have arrested one Yusuf Saleh, a suspected Boko Haram Urea Fertilizer supplier.\nThe suspect was nabbed by the troops on Friday at Bayamari village in Geidam Local Government Area of Yobe State following a tip-off.\nAccording to a statement by the Director Army Public Relations, Brigadier General Onyema Nwachukwu, 38 50kg bags of Urea were recovered from him.\nUrea fertilizer was banned by Government because of its usage in the manufacturing of Improvised Explosive Devices (IED) by terrorists.\nMeanwhile, the troops have been commended for their vigilance and swift response in arresting the suspect."
  },
  {
    "headline": "Oyetola calls for calm, as gunmen kill five farmers in Modakeke",
    "summarized_story": "Osun State Governor, Gboyega Oyetola has called for calm over the killing of five farmers in Modakeke on Friday morning.\nHe has also ordered security operatives to arrest and prosecute any person found fomenting trouble and to also fish out those responsible for the killing of the five farmers.\nIn a Statement released by the Commissioner for Information and Civic Orientation Funke Egbemode, Governor Gboyega Oyetola also sympathized with the families of the deceased.\nAccording to him, he has spoken with the Ooni of Ife, Oba Adeyeye Ogunwusi and the Ogunsua of Modakeke, Oba Moses Oladejo over the matter and they both assured him of their commitment to peace.\nAdvertisementPresently, combined team of security operatives have been stationed in the affected areas to ensure peace."
  },
  {
    "headline": "Zamfara State Government promises to secure release of students within 48 hours",
    "summarized_story": "Zamfara state Government has assured parents and relations of the abducted students and staff of college of Agriculture and Animal Science, Bakura that the kidnapped victims will Regain their Freedom in the next two daysThe state government in collaboration with security agencies says they are in close contact with the KidnappersThe state Commissioner for information Ibrahim Dosara also confirmed the abduction of sixty persons in Rini community in Bakura local government areaIbrahim Dosara attributes the Resurgence of Banditry and kidnapping in Zamfara to the bush combing by troops to eliminate the banditsHe says, government is committed to ensuring that the state is totally rid of criminalityAdvertisementThe assurances by the government to rescue the kidnapped victims, is coming hours after the abductors reduced the ransom from three hundred and fifty million naira to one hundred and fifty million naira."
  },
  {
    "headline": "Photos: Solemnisation of marriage contract between Yusuf and Zahra",
    "summarized_story": "President Muhammadu Buhari on Friday attended the solemnisation of the marriage contract between his son, Yusuf and Zahra, daughter of Emir of Bichi, Nasiru Ado Bayero in Bichi, Kano State.\nAlso in attendance are Former President Goodluck Jonathan., former Vice President Atiku Abubakar, former Niger President Mahamadou Issoufou."
  },
  {
    "headline": "Wangi Mba is Amazon Prime’s New Head of Content for Africa",
    "summarized_story": "Amazon Studios has appointed Wangi Mba-Uzoukwu, M-Net West Africa’s former Regional Director, as its first Principal Head of Content Acquisition in Africa.\nWangi Mba will oversee content acquisition for Prime Video in Sub-Saharan Africa.\nShe will also oversee content licensing and commissioning, selection for US and local film and television as well as build the content acquisition pipeline for local and US/Hollywood content across languages.\nMeanwhile, American singer Britney Spears is under investigation over misdemeanor battery after a staff member at her home alleged the singer struck her.\nDeputies responded to Spears’ home in Southern California after the staff member reported the dispute, however no one was injured."
  },
  {
    "headline": "Nigeria: Buhari, Atiku Meet at President’s Son’s Wedding in Kano – Arise News",
    "summarized_story": "President Muhammadu Buhari has for the first time since the 2019 general elections met with a former Nigerian Vice President, Atiku Abubakar in northern Kano state.\nThey met shortly after President Buhari arrived in Kano for the wedding ceremony of Yusuf, his son, to Zahra, daughter of Nasir Ado Bayero, the Emir of Bichi.\nThe president had earlier dispatched a high-level delegation ahead of his arrival for the wedding event.\nBuhari’s delegation is expected to stay back after the wedding to represent him at the coronation of the emir at Bichi.\nThey were said to have met in the United Kingdom where the president’s son finished his undergraduate studies."
  },
  {
    "headline": "Twitter Has Agreed to 7 of 10 Demands of Nigeria Government: Information Minister Lai Mohammed",
    "summarized_story": "Suspended microblogging site Twitter has accepted seven out of the 10 demands made by the Nigerian government for its suspension to be lifted in the West African country.\nThe country’s Minister of Information and Culture, Lai Mohammed stated this in Washington DC, US.\nMr Mohammed is on an ongoing engagement with global media outlets, think tanks and influencers.\nThe News Agency of Nigeria (NAN) quoted the minister as saying “we believe that even the other three outstanding demands are not really about whether they agreed or not but about timing and scheduling."
  },
  {
    "headline": "Kenya Judges Reject President’s Appeal to Change Constitution",
    "summarized_story": "Giving Kenya’s 47 counties bigger budgets to implement development schemes.\nMaking the cabinet leaner and more representative of the nation.\nGiving corruption scam whistleblowers 5% of any funds recovered.\nToday’s judgement will be seen as a win for Deputy President William Ruto, who had opposed BBI.\nIt also comes exactly a year before the next presidential election, which is regarded as a two-horse race between Mr Odinga and Mr Ruto."
  },
  {
    "headline": "Fayemi: We Don’t Believe the Subsidy Numbers, It’s a Fiddling of Figures in NNPC",
    "summarized_story": "Chairman of the Nigerian Governors’ Forum, Kayode Fayemi, has spoken on behalf of his colleagues in reaction to the new Petroleum Industry Act signed by President Muhammadu Buhari on Monday.\nFayemi who spoke exclusively to ARISE News on Thursday expressed reservations on aspects of the bill.\nHere he reiterates the governors’ stand on subsidy.\nWatch the video…[19:03, 8/20/2021] Demola: @ojeh fred @Prince Lanre-George please upload all videos….\nText for Exclusives in mail and video in Brigjtcove…."
  }
]