[
  {
    "headline": "Gunmen raze country home of Imo commissioner",
    "summarized_story": "Gunmen on Sunday morning burnt the country home of the Imo State Commissioner for Information and Strategy, Declan Emelumba.\nThe gunmen succeeded in setting on fire the two houses in Emelumba’s compoundA village source confirmed the incident and said that panic had engulfed the once peaceful community.\nThe shooting was so much and people had to take cover in the bushes.”Our source confirmed that soldiers were already being moved into the community to restore normalcy.\nOur correspondent recalled that, a few days ago, gunmen attacked a neighbouring community, Ibiasoegbe, and killed three persons including a policeman in the attack.\nThe state Commissioner for Information and Strategy who confirmed the attack told our correspondent that his country home was burnt down."
  },
  {
    "headline": "Soldiers, police, DSS invade IPOB lawyer’s Anambra home",
    "summarized_story": "It was gathered that the operatives surrounded the secessionist group’s lawyer’s family house around 2.30am.\nA source who claimed to have reached the lawyer said distressed voices were heard complaining about manhandling by the operatives.\nThe source said, “We managed to reach Barr Ifeanyi Ejiofor on phone and he confirmed the attack, saying that soldiers, joined by Police and DSS operatives are shooting in different directions and are about breaking into his main compound.\nBarr Ejiofor is doing his job as a lawyer.\n“If Barr Ifeanyi Ejiofor is legitimately wanted for any crime, due processes must be followed to the letter."
  },
  {
    "headline": "Twitter ban: Rescind your decision or face legal actions, PDP Reps Caucus threatens FG",
    "summarized_story": "The lawmakers, in a statement by the Minority Leader of the House of Representatives, Hon.\nREAD ALSOCNG condemns FG’s suspension of TwitterThe Caucus warned the government against causing further social unrest in the country, calling for immediate reversal of the suspension.\n“The Minority Caucus is disturbed that the suspension of Twitter in the country came after the social media platform deleted President Muhammadu Buhari’s tweets.\n“The minority caucus cautions that the development is capable of leading to further restiveness among Nigerians and worsen the situation in the country.\nThe Minority caucus, therefore, called on President Muhammadu Buhari to immediately reverse the suspension placed on Twitter so as not to exacerbate the already tense situation in the country."
  },
  {
    "headline": "Prophet TB Joshua: His life, times, legacy",
    "summarized_story": "PROPHET TB Joshua, his life, times, legacy.\nPopularly known as Prophet TB Joshua, he was one of the most controversial and “enigmatic’’ Nigerian pastors of our time, especially with his preaching style and records of miracle performances.\nTB Joshua was a known philanthropist and noted for helping the needy and sponsoring persons.\nProphet TB Joshua.\nProphet TB Joshua’s last words in public were : “Watch and pray.” “One life for Christ is all we have; one life for Christ is so dear”."
  },
  {
    "headline": "Akeredolu mourns Prophet TB Joshua says Christendom has lost a giant",
    "summarized_story": "— lts a personal loss to us in OndoDayo Johnson AkureOndo State Governor, Rotimi Akeredolu has said that the Christendom has lost a giant in the death of Pastor Temitope Balogun Joshua.\nThis was contained in a statement by his Chief Press Secretary Richard Olatunde in Akure, Ondo state.\n“Pastor Joshua was committed to giving and was more often, inexorably imbued with calmness while lifting the downtrodden.\n“Of significant note too, Pastor Joshua never hesitated to assist in whatever manner the Ondo State Government desired such.\nBut for TB Joshua, he had played his own part of the endless life orchestra; he has departed."
  },
  {
    "headline": "BREAKING: Hoodlums attack Imo commissioner for information hometown, set house ablaze",
    "summarized_story": "By Chinonso Alozie, OwerriSuspected hoodlums operating as “unknown gunmen ” early hours of Sunday attacked and set ablaze houses belonging to Imo state Commissioner for Information and Strategy, Declan Emelumba, at his hometown Ubulu in Oru West local government area of Imo state.\nVanguard was told in Owerri, that the incident happened at about 2am.\nAlso Read: 5 ‘unknown gunmen’ killed, 4 AK 47 rifles recovered in Imo — PoliceIt was gathered that the hoodlums put fire in the building after shooting sporadically in and around the village causing panic and forced villagers to scamper for safety.\nHowever, When Vanguard called the Imo state commissioner for Information and Strategy, Decalan Emelumba, he confirmed it and said that no live was lost.\nDetails coming…Vanguard News Nigeria"
  },
  {
    "headline": "NATFORCE’s legal framework being put together – DG",
    "summarized_story": "The Director General of the National Taskforce on illegal Arms, Ammunitions and Light Weapons, Dr. Baba Mohammed has explained that the legal framework of the agency is undergoing processes at the parliament in order to deepen their activities.\nAccording to him, the challenge occasioned by inflow of illegal weapons into the country was obvious which calls for an agency like NATFORCE specifically saddled with the responsibility of going after carriers of illegal weapons and transnational gun runners.\n“We exist to fill the gaps that have been identified today as far as illegal arms and ammunition is concerned,” he noted.\nHe added that the role of the agency is supportive and that the agency has been collaborating with other sister agencies.\nAs they strive to mop up arms, he said, the agency would be strictly professional while asking merchants of illegal weapons to think twice henceforth."
  },
  {
    "headline": "Elites are Nigeria’s problem, constitution amendment won’t work – Al-Mustapha",
    "summarized_story": "Hamza Al-Mustapha, Chief Security Officer to late Nigerian military ruler, Sani Abacha, says the elites in Nigeria are killing the country.\nAl-Mustapha also declared that the ongoing amendment of the 1999 constitution will not work.\nAl-Mustapha insisted that the problem of Nigeria revolves around the elites, not the masses.\n“You say that the 1999 constitution was rejected because it was done in a rush and here you are doing amendment haphazardly.\nBuhari gives Oyegun, Makarfi, Uchendu, Al-Mustapha, others new appointments"
  },
  {
    "headline": "Twitter ban: We've tweeted, do your worse",
    "summarized_story": "Former Governor of Ekiti State, Ayodele Fayose; former Minister of Education, Dr. Oby Ezekwesili; and ex-Minister of Aviation, Femi Fani-Kayode, have dared the President Muhammadu Buhari government to arrest them as they continue to share information on Twitter.\nFani-Kayode tweeted, “I HAVE tweeted.\nNo shaking!”Ezekwesili had earlier tweeted, “Many fellow Nigerians presently on @Twitter are happy to be prosecuted by @NigeriaGov for exercising your constitutionally guaranteed right to speech and association?\nThis government is such a disgrace!”The Federal Government had on Friday announced the suspension of microblogging and social networking service, Twitter, in the country.\nInsecurity: ‘Tell Nigerians the truth about South East attacks’- Oby Ezekwesili confronts Buhari"
  },
  {
    "headline": "TB Joshua was a good man – Beach Soccer player mourns late SCOAN founder",
    "summarized_story": "Abu Abolaji Azeez, a Nigerian beach soccer player, has mourned the death of Synagogue Church Of All Nations (SCOAN) founder, Prophet T.B Joshua.\nHe also revealed how TB Joshua helped his coach to secure a car in 2012 after he was told he had none.\n“I couldn’t join my team mates in Dubai because my passport was seized and about to be destroyed at the Italian embassy.\nNigeria’ll not break up – Prophet TB Joshua responds to Kanu, Igboho’s secession calls“Those years, after every copalagos tournament, he prays for us, congratulates us and gives each player a bag of rice and cash reward.\nTB JOSHUA was indeed a very good man."
  },
  {
    "headline": "We trained 4,000 ESN fighters after Kanu made us juicy offer in Biafran Army – Ex-soldiers",
    "summarized_story": "Owalo enlisted into the Nigeria Army in 2013 and was attached to 102 Guard Brigade Battalion until his dismissal in 2019.\nHe trained ESN fighters on combat operations such as ambush and use of firearms.\nOrji and Steven, enlisted into the Nigeria Army in 2015 and 2017 respectively and were trained at the 133 Special Force Battalion.\nThey told me that I should forget about it; that Nnamdi Kanu would make life better for me if I trained the ESN.\n“He said Kanu would also take the soldiers abroad, and when Biafra was achieved, he would make them Generals in Biafra."
  },
  {
    "headline": "Cross River govt shut down UNICROSS indefinitely",
    "summarized_story": "The Cross River State Government has closed down her University, University of Cross River State (UNICROSS) indefinitely.\nThis was announced by the Permanent Secretary, Special Services, Governor’s Office, Dr A.A. Mboto in a public announcement sent to media houses.\n“It was discovered during interrogations that the suspects were neither indigenes of the state nor students of UNICROSS.\n“The institution has been closed for now, so no Student is expected to be in the Campus.\n“And anyone caught will face the full wrath of the law and commensurate consequences for their actions,” he stated."
  },
  {
    "headline": "Police again repel attack on command’s headquarter in Imo, kill five",
    "summarized_story": "Agency ReporterThe Police Command in Imo has repelled another attempt by hoodlums to attack the command’s headquarters in Owerri on Sunday, killing five of the attackers in a gun duel.\nThe Commissioner of Police in Imo, CP Abutu Yaro confirmed the failed attack in a statement signed by the command’s Spokesman, SP Bala Alkana.\nYaro said gallant officers killed five of the hoodlums during crossfire, while others fled with bullet injuries.\n“Hoodlums masquerading as unknown gunmen attempted an attack on the police headquarters this morning but suffered a huge defeat.\n“He was, however, rushed to hospital by the Air Force team for medical attention where the doctors on duty made frantic efforts to stabilise him, but he later died at about 1900 hours of the same date."
  },
  {
    "headline": "Why I joined politics in 2019 – Maj. Hamza Al Mustapha",
    "summarized_story": "Agency ReporterMaj. Hamza Al Mustapha, Chief Security Officer (CSO) to the late military head of state, Gen. Sani Abacha, says he decided to join politics in 2019 to create opportunities for Nigerian youths to actualise their potential.\nAl Mustapha said this when he spoke with the News Agency of Nigeria (NAN) on Sunday in Abuja.\nADVERTISEMENT“I created the Green Party for the youth, women, the poor and people living with disabilities, it is a party that has to do with the future of Nigeria.\n“The word Green Party has many connotations and so I made contacts with green institutions across the world towards creating opportunities for Nigerian youths,” Al Mustapha said.\nAl Mustapha said since the Green Party was among those affected by the Independent National Electoral Commission (INEC) delisting of parties, he would move somewhere."
  },
  {
    "headline": "Yobe police confirm killing of commercial sex worker",
    "summarized_story": "Agency ReporterThe Police Command in Yobe, on Sunday, confirmed the killing of a commercial sex worker, Stella aka Ritachi, at Dorawa Joint, in Potiskum Local Government Area of the state.\nThe command’s spokesman, ASP Dungus Abdulkarim, disclosed this in an interview with the News Agency of Nigeria (NAN) in Damaturu.\nREAD ALSO: Imo housewife kills commercial sex worker for dating husband“ The incident was believed to have occurred at about 6:40 pm on Saturday, and the splattered blood all over the room indicated that the assailants might had struggled with the victim,” Abdulkarim said.\nThe spokesman said five other commercial sex workers (names withheld) in the compound were arrested for interrogation.\nAbdulkarim said the case had been transferred to the State Criminal Investigation and Intelligence Department (SCIID) for investigation."
  },
  {
    "headline": "Tipper truck kills final year PTI student",
    "summarized_story": "By Elo Edremoda, WarriA tipper truck on Friday evening crushed a final year female student of the Petroleum Training Institute (PTI) Effurun, Uvwie council area of Delta state to death.\nThe Nation gathered the incident occurred around 8pm at the main gate of the PTI.\nIt was learnt the student, identified simply as Uwa, was trying to cross the road when the truck, without headlights and driving against traffic, knocked her down.\nAccording to reports, she was immediately rushed to a hospital by students and other sympathizers, but later died early hours of Saturday.\nFollowing news of her death, angry students blocked the PTI Road in protest of their loss for several hours on Saturday."
  },
  {
    "headline": "Blueprint for Nigerian literature formed by founding fathers in 1981",
    "summarized_story": "How have writers utilized and harmonized Nigerian cultures as their sources to grow Nigerian literature?\nThe diversity of themes and styles that is the hallmark of Nigerian literature can be attributed to the multicultural tapestry of the Nigerian nation.\nDrama and prose which has demonstrated the greatest value for Nigerian literature?\nThe theme of the Ten City Tour I understands harps on the resilience of Nigerian Literature.\nI think the writers must project the resilience of the Nigerian Federation as evidenced in the resilience of Nigerian Literature."
  },
  {
    "headline": "Kalu condoles with the Synagogue Congregation over Pastor T. B Joshua’s death",
    "summarized_story": "Lamenting the demise of the renowned preacher and evangelist, Kalu stressed that Pastor Joshua was popular beyond the shores of Nigeria, adding that the deceased will be greatly missed by his followers.\nHe said, “I mourn the demise of Pastor Temitope Balogun Joshua, Founder of The Synagogue Church of All Nations (SCOAN).\n” Pastor Joshua was simple, kind-hearted, generous and easy going.\n“However, the congregation should take solace in the fact that the late clergyman contributed immensely to the growth of the Synagogue church and the larger community by touching lives positively.\n“The late Pastor Joshua will be remembered as a notable spiritual leader with passion for empowering the poor and vulnerable in the society."
  },
  {
    "headline": "What TB Joshua told us before his death-Members",
    "summarized_story": "Some members of the Synagogue Church of All Nations (SCOAN), Lagos, have said that their late prophet, TB Joshua, might have got a premonition about his death when he told them that he was not going to celebrate his birthday this year, which would have been June 12.\nAtah Benjamin said: “When he said it, many of us thought he meant not throwing a party to mark his birthday.\nIt is now clear that the man of God saw his death coming.\nAnother member Ola Opeyemi said: “There is no way God couldn’t have revealed this to His servant.\n“I will miss him, the church and the world will surely miss him.”"
  },
  {
    "headline": "Prophet Joshua’s last moment, how he died",
    "summarized_story": "By Chika Abanobi, Gabriel Dike and Steve AgbotaMembers of the Synagogue Church of all Nation, gathered this morning in front of the church reliving the last moment of the tele-evangelist and how he died.\nHis words: “After the programme he met with some senior church members.\n“The wife discovered he had died and called senior members of the church to break the news.”At the church many members were seen crying while many did not believe he was death.\nJoshua knew he will die soon and had prepared for the journey.\nAccording to him, “Pastor Joshua knew he will die and has put his house in order and very few that had spiritual eye knew he would die.”"
  },
  {
    "headline": "US, UK, EU, others express disappointment over Nigeria’s ban on Twitter operations",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States (US), the United Kingdom (UK), the European Union (EU), the Canadian Government, the Kingdom of Norway and the Republic of Ireland have expressed disappointment over the ban on Twitter operations in Nigeria.\n‘We strongly support the fundamental human right of free expression and access to information as a pillar of democracy in Nigeria as around the world and these rights apply online as well as offline.\nBanning systems of expression is not the answer.\nThe US, UK, EU, the Canadian Government, the Kingdom of Norway and the Republic of Ireland further said the path to a more secured Nigeria lied in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n‘As Nigeria’s partners, we stand ready to assist in achieving these goals,’ the statement added."
  },
  {
    "headline": "I’m old for marriage, but my mind tells me I’m broke –Ahneeka, ex-BBNaija housemate",
    "summarized_story": "I am the host of Jollof TV show produced by Zikel Cosmetics.\nAs much as everyone is telling me how old I am (for marriage), my thought is telling me how broke I am.\nAs much as the government and other people owe you things, don’t bank on that.\nAs a young person, half of what you see on social media is fake.\nIf you are a person of faith, don’t forget that and when you get there, don’t forget that faith too."
  },
  {
    "headline": "COVID-19: Nigeria logs 26 new cases, 410 recoveries",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) reported 26 new positive samples of coronavirus on Saturday, raising the tally to 166,756 infections.\nAdvertisementThe latest COVID-19 cases were recorded in five states, according to the agency’s update for June 5, 2021.\nAkwa Ibom, Cross River, and Lagos accounted for the highest number of infections with eight cases each.\nAdvertisementThe agency also confirmed that 410 patients were discharged on Saturday after recovering from the infection, bringing the country’s recovery count to 162,994.\nAdvertisementA total of 2,177 coronavirus deaths have been recorded across Nigeria."
  },
  {
    "headline": "COVID-19: Nigeria logs 26 new cases, 410 recoveries",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) reported 26 new positive samples of coronavirus on Saturday, raising the tally to 166,756 infections.\nAdvertisementThe latest COVID-19 cases were recorded in five states, according to the agency’s update for June 5, 2021.\nAkwa Ibom, Cross River, and Lagos accounted for the highest number of infections with eight cases each.\nAdvertisementThe agency also confirmed that 410 patients were discharged on Saturday after recovering from the infection, bringing the country’s recovery count to 162,994.\nAdvertisementA total of 2,177 coronavirus deaths have been recorded across Nigeria."
  },
  {
    "headline": "REWIND: 'What matters is how well you lived' -- how TB Joshua mourned Adeboye's son weeks ago",
    "summarized_story": "AdvertisementJoshua died on Saturday, a month after the demise of the younger Adeboye.\nWhile the SCOAN founder died on June 5, Dare died in his sleep on May 5The younger Adeboye was buried on May 11.\nAdvertisementSpeaking at a service after the death of the younger Adeboye, the SCOAN founder said it is how well an individual lives that matters and not how long.\nJoshua prayed to God to comfort the Adeboye family and strengthen the RCCG ministry.\nAdvertisementFLASHBACK VIDEO: What TB Joshua said on the death of Dare Adeboye 🎥: @SCOANTBJoshua #RipTBJoshua pic.twitter.com/SPwuIW5dq5 — TheCable (@thecableng) June 6, 2021Advertisement“Let us pray for the family."
  },
  {
    "headline": "REWIND: 'What matters is how well you lived' -- how TB Joshua mourned Adeboye's son weeks ago",
    "summarized_story": "AdvertisementJoshua died on Saturday, a month after the demise of the younger Adeboye.\nWhile the SCOAN founder died on June 5, Dare died in his sleep on May 5The younger Adeboye was buried on May 11.\nAdvertisementSpeaking at a service after the death of the younger Adeboye, the SCOAN founder said it is how well an individual lives that matters and not how long.\nJoshua prayed to God to comfort the Adeboye family and strengthen the RCCG ministry.\nAdvertisementFLASHBACK VIDEO: What TB Joshua said on the death of Dare Adeboye 🎥: @SCOANTBJoshua #RipTBJoshua pic.twitter.com/SPwuIW5dq5 — TheCable (@thecableng) June 6, 2021Advertisement“Let us pray for the family."
  },
  {
    "headline": "Cry to God in this time of crisis, Obasanjo tells Nigerians",
    "summarized_story": "Former President Olusegun Obasanjo has called on Nigerians to cry to God for solution to the security crisis overwhelming the nation.\nObasanjo said the challenges confronting Nigeria were beyond what the citizens and leaders could handle, but they were not too difficult for God.\nAdvertisement“The situation in our country calls for all of us to cry out loudly to God in prayers and supplications,” he said.\n“We seem to have been overwhelmed and unsure of how to handle the crisis in our land.\nI believe that the affected must be encouraged to personally seek the face of God by crying out to him in special prayers.”"
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "WHY AGRO-CROWDFUNDING PLATFORM FARM SPONSOR IS RESCHEDULING SHORT-TERM PAYMENTS DESPITE INSURED OPERATIONS",
    "summarized_story": "The past few days has been quite a challenge as the company has been facing some difficulties which has destabilized our crowd funding operations.\nWe are taking appropriate measures to see that all funds collected from every sponsor will be paid back accordingly.\n• 128,000 birds per week state of the art hatchery.\nOur mid term strategy is through equity investment from institutional investors and we are willing to relinquish 30-50% of directors shares in the company.\nOur long term strategy would be direct revenue from the business, hence the 18-24 months."
  },
  {
    "headline": "Synagogue founder, TB Joshua, dies at 57 church says",
    "summarized_story": "The founder and head pastor of Synagogue church died on Saturday, aged 57.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it.”“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\n“The Synagogue Church Of All Nations and Emmanuel TV Family appreciate your love, prayers and concern at this time and request a time of privacy for the family.\n“Here are Prophet TB Joshua’s last words: ‘Watch and pray’.”He was said to have had stroke two months ago and was flown by air ambulance to Turkey for treatment, TheCable understands."
  },
  {
    "headline": "How security agencies’ invasion is killing businesses in South East",
    "summarized_story": "Emeka Nwanganga, a supermarket owner in Egbu, a suburb of Owerri, the Imo State capital, has not opened his supermarket since the sit-at-home order for fear of uncertainty in the air.\nBede Eke, a member of the House of Representatives representing Abor Mbaise and Ngor Okpala Federal Constituency of Imo State, Thursday raised the alarm that security agents were killing innocent people in his constituency.\nAccording to him, “The attitude of the security agency is creating tension in the South East; I mean what is happening now defies logic.\nThe leaders of the security agencies should be careful so that they do not further degenerate the tension in the South East”.\n“What is happening in Imo State is unfortunate and clearly shows the double standard of the Buhari administration."
  },
  {
    "headline": "Nigerians urge improved registration exercise as INEC moves to shore up voters’ number",
    "summarized_story": "The registration exercise is aimed at shoring up number of voters across the country and to discourage voter apathy.\nOthers such as registered voters who wish to change their voting locations, and registered voters whose Permanent Voters’ Cards (PVCs) are lost, defaced or damaged can also register to vote.\nThe new device is known as the INEC Voter Enrolment Device (IVED) and is based on an Android tablet.\nExperts say that countries which had adopted online registration have seen significant improvement in the number of registered voters over time.\nAccording to him, “The Independent National Electoral Commission is committed to deepening the use of technology in the electoral process."
  },
  {
    "headline": "No plan to retrench, sack workers in Edo, Obaseki reassures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that there are no plans to either sack or retrench workers in the state, noting that ongoing reforms in the state’s civil and public service are aimed at improving productivity and service delivery to Edo people.\n“We are not going to retrench workers or sack anyone, but you must follow the new trends and conform to the new rules and if you can’t cope, you should move out from the service yourself.\nAnyone who flaunts the rule will get an automatic query and after three queries such a person leaves the system.\nAs the governor of the state, no file stays in my office beyond 48 hours,” Obaseki noted.\nOn his part, Edo State Head of Service and Chairman, Transition Committee Chairman, Barr."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "PDP will receive Ayade if he returns to party – Ex-governor of Cross River",
    "summarized_story": "ADVERTISEMENTThe Peoples Democratic Party (PDP) will welcome back Governor Ben Ayade of Cross River State if he decides to return to the PDP, a former governor of the state, Liyel Imoke, has said.\nMr Ayade, who is doing his second term as governor, recently defected from the PDP to the All Progressives Congress (APC).\nHis defection came at a time a former governor of Cross River, Donald Duke, returned to the PDP.\n“So, certainly for anyone that wants to work to see the growth and development of Cross River State, we are willing to work with them at any time,” he said.\nSo to the people of Cross River State, I say stand firm, we are PDP."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Prophet T.B. Joshua dies, aged 57",
    "summarized_story": "OBINNA EZUGWUProphet Temitope Balogun Joshua, founder of the Synagogue Church of All Nations, is dead, aged 57.\n“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.”"
  },
  {
    "headline": "Twitter ban: US, UK, EU, Canada, Norway, Ireland others knock Buhari",
    "summarized_story": "The United States (US), the United Kingdom (UK), the European Union (EU), the Canada, Republic of Ireland and Norway have expressed disappointment over the decision of Nigerian government to ban Twitter operations in the country.\nRecall that the President Muhammadu Buhari led government, through the Ministry of Information, had on Friday, slammed an indefinite suspension on Twitter after the platform yanked off a tweet by the president making reference to the civil war.\nAmid the outrage, however, the presidency on Saturday said the ban was temporary.\n“Banning systems of expression is not the answer.\n“As Nigeria’s partners, we stand ready to assist in achieving these goals,” they said."
  },
  {
    "headline": "Presidency justifies ‘Temporary suspension’ of Twitter, says it’s to limit violent consequences of fake news",
    "summarized_story": "The presidency has justified what it called a temporary suspension of Twitter’s operations in Nigeria, noting that it is part of efforts to prevent the violent consequences usually linked to the spread of fake news and misinformation.\nLai Mohammed, minister of information, had announced the “indefinite” suspension of Twitter’s operations in Nigeria on Friday, sparking angry reactions.\nHowever, in a statement on Saturday, Garba Shehu, presidential spokesman, said the suspension of Twitter in Nigeria is not only because Buhari’s post was deleted, even as he hinted that the ban was temporary.\n“The temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThere has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences."
  },
  {
    "headline": "Ikire/Apomu robbery: Oyebamiji, visits damaged police station, donates half a million for it’s renovation",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Commissioner For Finance, Mr Bola Oyebamiji on Friday, paid a condolence/inspection visit to the Ayedaade Divisional Police Headquarters, Ikire, which was attacked by dare devil armed robbers last Wednesday.\nOyebamiji who was accompanied on the visit by his wife, Chief Dr Mrs Shekinat Oyebamiji and some chieftains of the All Progressives Congress (APC) in Ayedaade/Irewole/Isokan Federal Constituency, donated the sum N500,000 for immediate renovation of the police station.\nOyebamiji who also paid a condolence visit to the families of civilians whose lives were cut short during the attack, described the robbery attack and the gruesome murder of innocent citizens as barbaric.\n“This sight is shocking and very sad to behold, I can’t imagine why people will be so cruel to attack unsuspecting police officers at the police station.\nIt’s a sad day indeed for residents of Ikire and Apomu, the entire federal constituency is in a mourning mood,” he said."
  },
  {
    "headline": "Wamakko Calls On Igbo Leaders To Halt Killings In South-East",
    "summarized_story": "A former Sokoto State governor, Senator Aliyu Magatakarda Wamakko, has urged Igbo leaders to converge and work out ways on ending the ongoing killings in the South-Eastern part of the country.\nAlthough he admitted that killings and other forms of criminalities have became a daily vice in all parts of the country, he stated that Igbo leaders are not doing enough to end the carnage in the zone.\nHe stated that through all these, as individual leaders and collectively, “we have maintained a studied silence by avoiding anything that will further rock the boat.\nHe however regrettably, “our friends and compatriots, leaders of Igbo extraction, have remained dead silent in the face of increasing assault and effort by their own people to stock a nationwide mayhem.\nSilence is no longer acceptable in the face of this clear danger and threat against the country”."
  },
  {
    "headline": "Injuries Hit Eagles Camp As Troost-Ekong, Collins Out Of Cameroon Friendly",
    "summarized_story": "William Troost-Ekong and Jamilu Coliins have been ruled out Tuesday’s friendly against the Indomitable Lions of Cameroon.\nThe duo picked up injuries against same opponent on Friday and will play no part in the next game at the Stadion Weiner Neustadt.\nTroost-Ekong was replaced by Valentine Ozorwanfor late in the game after picking up an injury, while Collins stayed on for the entire duration of the game.\n“It’s a difficult situation to have a defence (for the second game),” admitted the Eagles coach.\nThe Indomitable Lions defeated the Super Eagles 1-0 in the first friendly on Friday night."
  },
  {
    "headline": "Nigeria’s Rising Gymnast, Obiefuna Eyes Biles Record",
    "summarized_story": "Second-ranked best Nigerian gymnast, Munachi Obiefuna has said she wants to equal American artistic gymnast, Simone Biles who is the world’s third most decorated gymnast.\nObiefuna, who won two silver and a bronze at the 2020 National Sports Festival, while speaking to LEADERSHIP sports said she has what it takes to conquer the world.\nCombining both is easy because I allocate time to my studies and time for gymnastics training.\nThe sports have not been looked into and for Young gymnast like me who will be ready for next Olympics so I need adequate support to achieve my dreams” she added.\nMeanwhile, Chinwe Obiefuna, the mother and manager of Munachi encouraged parents to allow their children to engage in gymnastics at a very tender age."
  },
  {
    "headline": "Northern Women Task Buhari On Referendum For Biafra",
    "summarized_story": "Women under the aegis of amalgamation of Northern Women of Nigeria have urged the federal government to allow for referendum on the agitation for Biafra.\nDuring the rally, some of the women were seen carrying placards with inscription: “We don’t want another war”, Buhari give us referendum on Biafra”, “stop killing notherners”, and “South East must choose United Nigeria or Biafra” decried the bloodbath in the South East geopolitical zone of the country.\nThe group also condemned the ongoing bloodletting in the South East geopolitical zone, warning agitators of Biafra against taking the rest of the country for granted.\nNigerian History has shown that women carry the heavy burden of war and acts of insurrections and terrorism”.\nIt is for this reason that we come together today and say we don’ t want another war, another insurrection.”"
  },
  {
    "headline": "Heavy Shooting In Owerri As Churches Are Shut",
    "summarized_story": "Also, unknown gunmen in the wee hours of Sunday morning took over the streets of Owerri, the Imo State capital, shooting sporadically for over one hour.\nResidents of World Bank area, Onitsha Road, Okigwe road, and Orji, said the shooting started as early as 6am.\nEyewitnesses who pleaded anonymity said the shooting spree went on unabated, sending panic waves across the capital city.\nADVERTISEMENTEarly morning Church goers, who normally attended 6am Mass were forced to stay back indoors, as the shooting appeared to be in torrents.\nRecall that Owerri has come under incessant attacks in the past three months even as roads are cordoned off to restrict traffic."
  },
  {
    "headline": "Insecurity: Cry To God For Solution – Obasanjo Tells Nigerians",
    "summarized_story": "A former President, Olusegun Obasanjo, on Saturday charged Nigerians to cry to God over the security challenges affecting Nigeria.\nObasanjo in his statement noted that Nigerians, as well as leaders across the country, are overwhelmed by the challenges.\nThe statesman stated this on Saturday in Abeokuta, Ogun State, when he spoke during the 16th edition of Prayer Breakfast held virtually and organised in his honour by the Christians Association of Nigeria, Ogun State chapter.\nThese are beyond what we can handle we have to cry to God.\nWe have been overwhelmed, those in government, executive, legislators, public servant, civil servant, private sector, we are overwhelmed."
  },
  {
    "headline": "TB Joshua's death: Femi Fani- Kayode reacts — Daily Times Nigeria",
    "summarized_story": "The Minister of Aviation under Goodluck Jonathan administration, Femi Fani-Kayode has reacted to the death of pastor T B Joshua.\nIt was gathered that the popular cleric died on Saturday after a church program.\n“The passing of my brother TB Joshua saddens me deeply.\n@GazetteNGR was right & I am in pain.”READ ALSO: Ten things you should know about Prophet TB JoshuaNaija News had earlier reported that the death of the founder of Synagogue Church of All Nations, Pastor TB Joshua has been confirmed by the church.\nThe cleric who popularly known as T B Joshua died at the age of 57."
  },
  {
    "headline": "President Muhammadu Buhari, Deeper Life Celebrates Kumuyi @ 80",
    "summarized_story": "President Muhammadu Buhari has felicitated with the General Superintendent of Deeper Christian Life Ministry, Pastor William Kumuyi, as he clocks 80.\nBuhari’s congratulatory message was contained in a statement by his Special Adviser on Media and Publicity, Femi Adesina.\nThe statement titled ‘President Buhari greets Pastor W.F.\nThe news was broken on Sunday 6th, morning by the church.\nThe Man of God was reportedly dead on Saturday evening at the age of 57."
  },
  {
    "headline": "IPOB: We will surprise ‘Fulani government Of Nigeria’",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has dismissed claims by the federal government that it was stockpiling arms and bombs to kill innocent Nigerians.\nRecall that President Muhammadu Buhari’s Media Aide, Garba Shehu, had claimed that IPOB is amassing a stockpile of weapons, bombs across the country.\nReacting through its spokesperson Emma Powerful, IPOB reveals that it produces arms locally.\n“There is no false information and state-sponsored propaganda that can stop or change our resolve to restore Biafra freedom from Nigeria.\nWhat they did to our fathers, this present generation of Biafra will surprise them heavily.”"
  },
  {
    "headline": "Prophet T.B. Joshua is dead + Full statement from church",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has issued the statement below to confirm the passage of its founder, the popular Prophet T.B.\nREAD THE FULL STATEMENT BELOW.\nPROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021“Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "Prophet T.B. Joshua is dead + Full statement from church",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has issued the statement below to confirm the passage of its founder, the popular Prophet T.B.\nREAD THE FULL STATEMENT BELOW.\nPROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021“Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "Twitter Suspension: Malami’s prosecution order is illegal – PDP",
    "summarized_story": "The People’s Democratic Party has faulted the order by the Attorney-General of the Federation/Minister of Justice, Abubakar Malami, to arrest Nigerian Twitter users.\nMalami had earlier instructed the Director of Public Prosecution of the Federation to begin immediate prosecution of those who violate the Federal Government’s order suspending Twitter operations in Nigeria.\nThe PDP, in a statement on Saturday, described the decision as null and void.\nThe statement, which was titled ‘Twitter Suspension: Malami’s prosecution order is illegal, null and void – PDP’, was signed by the party’s Publicity Secretary, Kola Ologbondiyan.\n“The PDP states that nothing in our extant laws, not even the suspension of Twitter in Nigeria, constitutionally criminalises the use of Twitter by Nigerians or empowers the Federal Government to arrest and prosecute any Nigerian for using Twitter.”The PDP also asserted that the order had no legal backing."
  },
  {
    "headline": "IPOB: Twitter deletes Nnamdi Kanu’s ‘Biafra’ post for violating rules",
    "summarized_story": "Social media giant Twitter has wielded its big stick on the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, as the microblogging platform deleted a ‘Biafra’ post by the self-acclaimed IPOB leader for violating its rules.\nTwitter had come under fire for deleting a civil war post by the Nigerian President, Major General Muhammadu Buhari (retd.).\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nThe President’s tweet rattled some persons who felt he was insensitive to have made an analogy of the civil war.\nHis critics subsequently reported the tweet to Twitter and the microblogging site later deleted the post with a comment, “This Tweet violated the Twitter Rules”."
  },
  {
    "headline": "The life and times of TB Joshua [Special Report]",
    "summarized_story": "Popularly known as Prophet TB Joshua, he was one of the most controversial and “enigmatic’’ Nigerian pastors of our time, especially with his preaching style and records of miracle performances.\nIn 1987, TB Joshua founded the Synagogue Church of All Nations under the bridge that links Ejigbo and Egbe in Lagos State with just few members.\nTB Joshua was a known philanthropist and noted for helping the needy and sponsoring persons.\nLike many influential men, TB Joshua was not without controversies.\nMr Kunle Olowoopejo, the Executive Chairman, Egbe-Idimu Local Council Development Area (LCDA) in Lagos, described TB Joshua as a complete definition of what humanity should be."
  },
  {
    "headline": "Buhari dragged to Commonwealth for sanction",
    "summarized_story": "By AbankulaA Nigerian group has asked the Commonwealth to apply its charter to hold the Buhari government to account over the suspension of Twitter.\nSocio-Economic Rights and Accountability Project (SERAP) sent the urgent appeal to Patricia Scotland, secretary-general of the Commonwealth.\nThe organization said: “The Nigerian government has repeatedly demonstrated that it is not committed to protecting human rights.\nIt read in part: “The Nigerian government has also called for the prosecution of those who violate its order suspending Twitter operations in Nigeria.\nPeople have been targeted simply for using Twitter and peacefully exercising their fundamental human rights.”"
  },
  {
    "headline": "TB Joshua: I will not be able to celebrate my birthday",
    "summarized_story": "Joshua probably knew death was near when he sent a cryptic message to his his followers on Facebook that he would not be able to celebrate his 58th birthday.\nJoshua who was born on 12 June 1963, died six days six days to his birthday.\nHe wrote: “As things stand, you may have realised it will not be easy for me to celebrate my birthday under the present circumstances”.\nAs things stand, you may have realised it will not be easy for me to celebrate my birthday under the present circumstances.\nHappy Birthday!” – TB Joshua"
  },
  {
    "headline": "BREAKING: Unknown Gunmen Killed In Imo Gun Fight",
    "summarized_story": "Unknown gunmen attempted to attack the Imo State Police Command’s headquarters in Owerri, the state capital, again on Sunday.\nAs the criminals circled the state capital, churchgoers and other citizens fled, according to NEWS DIRECT.\nBala Elkana, a police public relations officer, verified in a statement that no cops were injured in the battle.\n“They arrived in a white Hummer Bus, where five hoodlums were slain and others were injured after a firefight.\nElkana continued, “The Hummer bus was discovered with four Ak47 rifles stolen from the police during a recent attack on its station.”To apprehend the fleeing hoodlums, security personnel have been dispatched."
  },
  {
    "headline": "Synagogue Church Headquarters In Lagos Sealed Off After TB Joshua’s Death",
    "summarized_story": "The headquarters of the Synagogue, Church of All Nations in Ikotun-Egbe, Lagos state has been sealed off.\nThis followed the death of the church’s founder, Temitope Joshua, popularly known as Prophet TB Joshua.\nThe cause of his death was not immediately disclosed, but sources told Saharareporters he fell ill two days ago.\nPictures seen by SaharaReporters on Sunday morning showed that entrances into the church have been sealed off.\nThousands of sympathisers also thronged the church, in disbelief over the Prophet’s death."
  },
  {
    "headline": "BREAKING: Igangan Boils As Herdmen Kill 20, Palace, Petrol Station Burnt In Oyo",
    "summarized_story": "More than 20 people have been allegedly killed in Igangan, one of the towns in Ibarapa North local government, as gunmen opened fire last night.\nThis is coming few days after the chairman Oyo State Security Network codenamed Amotekun Corps, General Kunle Togun (rtd) alleged that foreign Fulanis have encamped the entire Southwest region and may strike if nothing is done urgently.\n“It is a problem that has been existing even before we came into government, and one of the promises I made then was to tackle security challenges.\nAnd the question to take home is – can anybody here imagine Oyo State without Amotekun?\nYes, there may still be few areas we need to improve on but we all should work together with Amotekun."
  },
  {
    "headline": "REVEALED: How Prophet T.B Joshua Died On His Way To Hospital",
    "summarized_story": "According to NEWS DIRECT, the Founder of the Synagogue Church of All Nations, Temitope Joshua, also known as Prophet TB Joshua, died on his way to the hospital.\nOn his way to the hospital, he passed away “NEWS DIRECT was told by a source.\nHis 58th birthday, which is six days away, was being planned.\nAlthough the cause of his death was not immediately revealed, insiders told NEWS DIRECT that he had been sick for two days.\nHis body is thought to have been deposited in the Lagos General Hospital in Isolo."
  },
  {
    "headline": "Pictures: Mourners gather, mourn late Prophet T.B Joshua, church cordoned off",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Watch Prophet TB Joshua’s statement on his June 12 Birthday before death",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Prophet TB Joshua’s last moments before death",
    "summarized_story": ""
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "Prophet TB Joshua Dies At 57",
    "summarized_story": "Popular Nigerian prophet and televangelist TB Joshua has died.\nThe founder of the Synagogue Church Of All Nations (SCOAN) was 57 at the time of his death.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "SERAP Asks Commonwealth To Sanction Nigeria Over #TwitterBan, Repression",
    "summarized_story": "People have been targeted simply for using Twitter and peacefully exercising their fundamental human rights.”SERAP, therefore, urged the Commonwealth to:1.\nPublicly condemn the suspension of Twitter in Nigeria, and put pressure on the government of President Muhammadu Buhari to reverse the unlawful suspension;2.\nUrge the government of President Muhammadu Buhari to respect freedom of expression, access to information, and media freedom, as well as promote transparency and accountability, and the rule of law;3.\nUrge the government of President Muhammadu Buhari to withdraw the threat to prosecute Nigerians simply for peacefully exercising their rights through Twitter4.\nSuch mechanism would be the right response from the Commonwealth to protect the integrity of the institutions and ensure compliance by members to the Commonwealth values as enshrined in the Commonwealth Charter and declarations"
  },
  {
    "headline": "FG Didn’t ‘Temporarily’ Ban Twitter Just For Deleting Buhari’s Tweets – Presidency",
    "summarized_story": "The Presidency on Saturday said its decision to “temporarily” ban Twitter wasn’t a “knee-jerk reaction” to the social media network’s deletion of President Muhammadu Buhari’s tweets.\n“There has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nThis could tear some countries apart.”The Federal Government announced an “indefinite suspension” of Twitter operations in Nigeria on Friday.\nThe decision to suspend Twitter has been criticised by many, but the Presidency in its Saturday statement insisted it was a justified move“.\n“Twitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Top Diplomatic Missions ‘Disappointed’ With FG’s Twitter Ban",
    "summarized_story": "Prominent diplomatic missions to Nigeria, including Canada, the US, the UK and the EU, on Saturday said they were let down by the decision to suspend Twitter operations in Nigeria.\nThe Federal Government suspended the social network’s operations on Friday after Twitter deleted tweets from the official account of President Muhammadu Buhari.\nThe tweets, which Twitter said ran afoul of its policies, had referenced the country’s infamous civil war.\n“The path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms."
  },
  {
    "headline": "Police Arrest Suspected Armed Robbers, Recover Exhibits",
    "summarized_story": "The FCT Police Command has arrested two suspected armed robbers.\nThe suspects are said to be notorious for snatching motorcycles along the Galadinmawa-Durumi axis.\nIn a statement on Sunday, police spokesperson ASP Yusuf Mariam said the arrest was made possible following credible intelligence.\nAccording to her, the suspects Bello Waziri (24) and Yusuf Ali (21) both male, were arrested by Police Operatives of the Galadinmawa Division.\nBoth men further stated that they use a hammer to hit their victims leaving them unconscious before taking their motorcycles."
  },
  {
    "headline": "NYSC at 48: CORP members in Zamfara celebrate in colourful carnival",
    "summarized_story": "As the National Youth Service Corps (NYSC) marks its 48th year this June, the State Coordinator of the National Youth Service Corp (NYSC ) in Zamfara state Namallam Mohammed organised a Unity Match and Cultural Carnival to foster unity among Corp members.\nHe said the event will harness the talents of corps members for greater opportunities.\nNamallam stated this at the NYSC batch A stream two Unity match and cultural carnival, which coincided with the 48th Anniversary of the National Youth Service Corps and was held at the Zamfara state NYSC Orientation camp in Tsafe.\nAdvertisementAccording to him, the event was organised to promote Nigeria’s cultural heritage, expand the frontiers of friendship and help imbibe tolerance amongst corp members.\n“The carnival is targeted at fostering national unity, integration, tolerance and patriotism” ."
  },
  {
    "headline": "SCOAN members weep, suspend service over T.B Joshua’s death",
    "summarized_story": "This morning’s Sunday service at the Lagos headquarters of the Synagogue Church of All Nations (SCOAN) was cancelled over the death of its leader, Prophet Temitope Joshua, popularly addressed as TB JoshuaMany members and members of the press were denied entry to the church, which was packed with people from all around the country.\nTVC news gathered that only religious personnel were allowed to enter.\nAdvertisementSome of the members broke into tears upon confirming the death of their leader.\n57-year-old Joshua died in Lagos Saturday evening shortly after finishing a programme in church.\nIt was gathered that he gave up the ghost on the way to a hospital."
  },
  {
    "headline": "Many locals killed as Police repel bandits’ attack on Zamfara community",
    "summarized_story": "Heavily armed Bandits have killed an unknown number of persons in Tofa community in Bungudu local government area of Zamfara stateAccording to the authorities, some robbers were killed, while many more fled to the forest with bullet wounds.\nThe police said one of its personal paid the Supreme price during gun battle with the criminals that lasted for hours.\nA press statement from the police in Zamfara says the armed bandits Invaded the communities Saturday night with sophisticated weapons shooting sporadically leading to the death of many locals.\nHe added that combine Police Team engaged the criminals on their way to Samawa village after the first attack on Tofa community which the troops were not alerted on time.\nAs a result of the encounter, unspecified number of bandits were fatally injured, while others escaped with possible gun shot wounds."
  },
  {
    "headline": "Nothing Good Can Come Out of Twitter Ban, Government Should Reverse It Now: Omojuwa",
    "summarized_story": "There has been outrage by Nigerians over the ban on twitter imposed by the Federal Government, with many condemning the decision and asking the government to rescind its decision.\nPolitical commentator Japhet Omojuwa was on ARISE NEWS’ Morning Show to weigh in on the ban and it’s effect on the polity.\nWatch the video"
  },
  {
    "headline": "My Father Forgot to Tell Me It Was a Disability to Be Born a Woman: Jumoke Adenowo",
    "summarized_story": "Multiple-award winning Nigerian architect Jumoke Adenowo was recently listed by renowned art historian Agata Toromanoff as on of world’s greatest female architects in history.\nAdenowo was a guest on ARISE NEWS’ Morning Show to about architecture, philanthropy, her journey and leadership.\nWatch the interview"
  },
  {
    "headline": "UN ‘Outraged’ as Death Toll in Burkina Faso Extremist Attack on Civilians Rises to 132",
    "summarized_story": "The overnight assault was the deadliest recorded in years in Burkina Faso.\nUN Secretary-General Antonio Guterres said he was “outraged” by the killings in Burkina Faso and offered the country the world body’s “full support”.\nBurkina Faso has now declared 72 hours of mourning in the country.\nIt’s that tri-border area of Mali, Burkina Faso and Niger, where there’s very significant displacement and violence taking place … The governments are increasingly weak and ineffective.\nThe Ghanaians are particularly worried about what’s happening along their border with Burkina Faso."
  },
  {
    "headline": "Roger Federer Could Pull Out of French Open",
    "summarized_story": "Roger Federer says he may pull out of the French Open if there is too much risk to his knee, and to his Wimbledon prospects, from playing on.\n“There are still a few people here, I don’t know who they are: sponsors, journalists, my team too,” Federer said.\n“I can’t imagine this is what Federer was expecting when he walked out on the court, to be there so late.\nRoger Federer is not supposed to play like this – even though this was just his sixth match in the past 16 months.\nThey will look and sound great in years to come – as long as they don’t start as late as 9pm."
  },
  {
    "headline": "In Boost for Africa, Senegal to Make Covid Shots Next Year",
    "summarized_story": "Under the agreement, the Institut Pasteur would use vaccine production technology developed by Univercells to supply COVID-19 vaccine shots to countries across West Africa.\nShe declined to comment on the exact date for a full vaccine production line in Senegal but of the timelines referenced she said: “I do not think they are unreasonable.”Timing depends on Univercells securing regulatory approval for a vaccine production site in Belgium.\nUnivercells also has its own COVID-19 vaccine candidate, being developed with Germany’s Leukocare and Italian firm ReiThera, which has completed Phase II trials.\nSTRATEGIC PLANAfrica’s struggles to secure vaccine supplies exposed its vulnerability to health crises and pushed governments to find ways to boost medicine and vaccine production.\nThe European Union said last month that it will invest at least 1 billion euros to build manufacturing hubs in Africa, with Senegal, South Africa, Rwanda, Morocco and Egypt among the leading candidates."
  }
]