[
  {
    "headline": "Pictorial: Eagles Square wears new look for PDP national convention",
    "summarized_story": "The main opposition party, the Peoples Democratic Party, will be holding its National Convention today at the Eagles Square in Abuja.\nThe venue, which is currently welcoming guest, has been decorated in the colours of the party while the kick-off is awaited.\nMeanwhile, the Governor of Sokoto State and chairman of the PDP Governors’ Forum, Aminu Tambuwal, has said that the party is hoping to achieve consensus in all the contested positions at the convention.\nAddressing newsmen in Abuja on Friday, Tambuwal said the party has reached consensus in 95 per cent of the contested positions.\nThe positions the party is yet to have consensus candidates for are deputy national chairman (south), national youth leader and national auditor."
  },
  {
    "headline": "Raid on Justice Odili’s home politically motivated, says Ozekhome",
    "summarized_story": "Human rights lawyer, Mike Ozekhome (SAN), has said the raid on Justice Mary Odili’s home, allegedly perpetrated by the Economic and Financial Crimes Commission, could be politically motivated.\nOzekhome, who visited Odili after the incident, also revealed that the judge did not resist the raid.\nHe said, “She didn’t resist any search.\nOzekhome inferred that the raid could have been carried to stoke fire ahead of the PDP National convention happening today in Abuja adding that the raid was an embarrassment for Nigeria.\n“Of course, the husband is a well-known PDP titan, and tomorrow is the PDP convention."
  },
  {
    "headline": "How whistleblower misled FG to besiege Justice Odili’s Abuja home",
    "summarized_story": "Justice Odili is currently the second most senior jurist of the apex court, after the Chief Justice of Nigeria, CJN, Justice Ibrahim Muhammad.\n9, Imo Street, Maitama, was on Friday, besieged by security operatives who claimed their action was based on a valid court order.\n“The CJN was very upset when he heard that the home of Justice Odili was besieged by security agencies.\nConsequently, Magistrate Iyanna, revoked the search warrant he issued against Justice Odili on Friday.\nThe whistleblower, Umar, had claimed that he observed some illegal activities going on at Justice Odili’s residence in Abuja."
  },
  {
    "headline": "Stop betraying others, says Eniola Ajao",
    "summarized_story": "Eniola AjaoBy Sylvester KwentuaWell endowed Nollywood actress, Eniola Ajao, has called on those who are in the habit of betraying their friends, to stop such, because If they don’t stop, people will stop trusting them in the long run.\n‘’When you sell your friend, even your buyer will not trust you.\nStop betraying others.’’ Eniola frankly spoke.\nREAD ALSOIn other news, Eniola Ajao, whose real name is Eniola Florence, recently went bald for a movie set.\nAccording to her, she had to scrap her hair for a movie role directed by Adebayo Tijani."
  },
  {
    "headline": "Okirika” exposes fake life – Ini Edo",
    "summarized_story": "Ini EdoFirst-rate actress, Ini Edo has said that the “Okirika” a new series set for release December 9 on ST Nollywood Plus channel on StarTimes is a must-see movie that provides both comedy and life’s lessons.\nIni Edo, a leading cast in the series shares what fans should expect from the sitcom.\n“So basically, what Okirika series does is explore the underworld of crime scenes like what people do undercover using other businesses to cover up.\nMost times, things are not really what they seem when you see other people’s lives and you feel it’s all perfect and rosy and want to be like them.\nThe comedy series was produced by Muka Ray, while Iyabo Ojo doubles as an actor and project coordinator."
  },
  {
    "headline": "Benefits of dating me – DJ Cuppy",
    "summarized_story": "By Sylvester KwentuaFor those wondering what DJ Cuppy has to offer in a relationship, they may just have gotten their answers!\nIn a recent humorous tweet, the Oxford University student cleared the air on what benefits her man would enjoy, dating her.\nAccording to her, the benefit of dating her remains that she’s herself; a lady of high calibre.\nIt’s ME, come on now LMAO” Cuppy tweeted, together with a cute picture of herself.\nAlso, I quit drinking, I’m starting a venture capital, plus all the other stuff.” Cuppy posted."
  },
  {
    "headline": "Judicial Embarrassment: How FG was misled to invade Justice Odili’s home",
    "summarized_story": "Justice Odili is currently the second most senior jurist of the apex court, after the Chief Justice of Nigeria, CJN, Justice Ibrahim Muhammad.\n“The CJN was very upset when he heard that the home of Justice Odili was besieged by security agencies.\nConsequently, Magistrate Iyanna, revoked the search warrant he issued against Justice Odili on Friday.\n“In view of the above fact, the said search warrant is hereby revoked.”The whistleblower, Umar, had claimed that he observed some illegally activities going on at Justice Odili’s residence in Abuja.\nJustice Ekwo said there was no evidence to establish that Odili’s passport was seized on the order of any court of competent jurisdiction."
  },
  {
    "headline": "Boko Haram-ISWAP: FG approves additional assets for Nigerian military",
    "summarized_story": "The federal government has approved extra assets to boost the Nigerian military campaign against Boko Haram and Islamic State’s West Africa Province (ISWAP).\nA statement on Saturday by Army Director of Public Relations, Brigadier General Onyema Nwachukwu confirmed the assent.\nDefence Minister, Bashir Magashi made the announcement on Friday when he visited troops of Joint Task Force North East Operation HADIN KAI (OPHK).\nMagashi was at the Theater Command Operation Headquarters alongside Chief of Defence Staff, Leo Irabor, Service Chiefs and Chief of Defence Intelligence (CDI).\nHe also commissioned two buildings newly constructed as transit accommodation for officers of the Joint Task Force Headquarters."
  },
  {
    "headline": "Army kills IPOB ESN fighters in raid of Ebonyi camps",
    "summarized_story": "Exercise GOLDEN DAWN troops have raided some identified locations of Indigenous People of Biafra (IPOB) militia wing, Eastern Security Network (ESN).\nThe camps were within Ochokwu village in Ikwo Local Government Area of Ebonyi State.\nSome fighters of the separatist organization were killed in a fierce firefight during the clearance operation on Friday.\nOn Saturday, the military announced the elimination of ESN members who killed Department of State Services (DSS) operatives in Anambra.\nThe officers were part of security personnel on protection duty for a campaign rally ahead of the Anambra poll."
  },
  {
    "headline": "Delay in teacher’s recruitment in Osun caused by paucity of funds – Commissioner, Oladoyin",
    "summarized_story": "The Osun State Commissioner for Education, Folorunsho Oladoyin, has said the paucity of funds was responsible for the delay and inability of the government to carry on with the recruitment of teachers for public schools in the state.\nOladoyin made this known while appearing before the Osun State House of Assembly Appropriation Committee to defend the Ministry of Education 2022 budget presented by Governor Adegboyega Oyetola.\nWhile acknowledging the concerns of the lawmaker regarding the matter, the Education Commissioner noted that the state government was committed to recruiting teachers in public schools.\nHe explained that the delay in recruitment was caused by a paucity of funds and assured that the names of successful candidates in the teacher’s recruitment exercise would be published and mobilised to classrooms by November.\nTeachers protest at venue of NBA conference in Port Harcourt over unpaid salaries"
  },
  {
    "headline": "Army eliminates IPOB ESN fighters who killed DSS officers in Anambra",
    "summarized_story": "The Nigerian Army has confirmed the annihilation of Indigenous Peoples of Biafra (IPOB) controlled Eastern Security Network (ESN) fighters in Anambra.\nTroops of 82 Division conducting Exercise GOLDEN DAWN neutralised ESN operatives in a gun battle Friday evening at Nnobi Junction in Idemili South Local Government.\nNwachukwu recalled that after the attack, troops swiftly mobilised to the scene and embarked on the pursuit of the criminals along Nnewi – Nnobi road.\nSimilarly, troops foiled another attack by IPOB ESN at Umunze checkpoint, in Orumba South Local Government Area.\nThe Nigerian Army condemned the attempt by IPOB ESN to instil fear “and sabotage forthcoming Anambra governorship election”."
  },
  {
    "headline": "Cross River: Illegal structures spring up on federal highways as residents hope for compensations",
    "summarized_story": "Findings indicate that authorities have started to mark and document existing structures that may be pulled down for possible compensations ahead.\nIt would be recalled that the federal government recently paid compensations to those whose houses, farmlands and other ancient structures were pulled down for the expansion and ongoing reconstruction of the road.\nFashola had warned communities not to erect new structures as his ministry may not pay compensations for such newly built shops or shrines.\nConstruction firms have since started work on the road from the Odukpani end which is to be turned into a dual carriageway.\nCommunity leader in Okurikang area of Odukpani LGA, Ene Okwa Ekpenyong said “We have information that more compensations are to be paid."
  },
  {
    "headline": "VIDEO: Security operatives take over Oyo APC Secretariat",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Our operatives didn’t invade Odili’s home – DSS",
    "summarized_story": "The Department of State Services (DSS) has distanced itself from the reported invasion of the Abuja residence of former Rivers Governor, Peter Odili, by security agents on Friday.\nThe residence is said to also be occupied by his wife, Justice Mary Odili, of the Supreme Court.\nIt was gathered that the security team on the ground in the house included DSS personnel and policemen.\n- Advertisement -They turned back the visiting security agents because they were not convinced what their intentions were, it was gathered.\n- Advertisement -It was also not clear who, between the wife and husband, was the target of the security agents."
  },
  {
    "headline": "Security operatives lock Oyo APC members out of Congress venue",
    "summarized_story": "Thousands of All Progressive Congress (APC) members in Oyo State were on Saturday locked out of the main bowl of the Obafemi Awolowo Stadium (Liberty Stadium), Oke-Ado, Ibadan.\nSecurity operatives took over the venue of the APC Congress to forestall the breakdown of law and order.\n- Advertisement -The Nation reports the congress has been postponed twice over allegations by some groups that lists of delegates for the exercise has been doctored.\nNot less than 15 Hilux Police patrol vans were stationed at strategic locations within the stadium.\nAnother APC member from Oluyole local government, Mrs Modinat Asimiyu, said the open field inside the stadium may be used for the Congress."
  },
  {
    "headline": "PHOTOS: Oyo APC members at Liberty Stadium for State Congress",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Military, Gunmen In A Fierce Gun Battle In Niger, Many Gunmen Kill, Others Injured",
    "summarized_story": "According to our source, the soldiers engaged the gunmen in gun battle for several hours, forcing them (soldiers) to seek for reinforcements which the Military authority quickly responded.\n“They are equally looking for a base in the state because of the Military operations in Zamfara and Katsina states.\nThe Secretary to the State Government Alhaji Ahmed Ibrahim Matane when contacted confirmed the story but simply said “What the Security men did was to repel the attack”.\nThe Government Scribe assured them that government will continue to do everything possible to ensure the welfare of the security men in the discharge of their duties.\nIt could be recalled that the gunmen in a similar invasion, sacked the Military camps in Bassa and Allawa communities, killing five soldiers and a police inspector."
  },
  {
    "headline": "I’ll leave office in May 2023, Buhari assures",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has warned those campaigning for tenure elongation on his behalf, stressing that he would leave office in May 2023.\n“I swore by the Holy Qur’an that I will serve in accordance with the constitution and leave when my time is up.\nI don’t want anybody to start talking about and campaigning for unconstitutional extension.\nMy opponents laughed at me but God answered my prayers by bringing in technology.\nAt that point, nobody can steal their votes or buy them,” the President added."
  },
  {
    "headline": "Bodejo, Miyetti Allah leader mocks Southern govs: Anti-open grazing law exists only in the media; it can’t be implemented",
    "summarized_story": "They don’t have place to graze their cattle; they don’t have hospitals, they don’t have schools.\nHowever, in the process of wiping out the bandits, the Fulani have become the victims.\nIn some states, these bandits are kidnapping Fulani, killing them, raping their wives, but this is not reported in the media.\nYou can’t just wake up and tell the Fulani to leave your state or stop grazing their cows in your state.\nIt is the Nigeria constitution we obey, and not the anti-open grazing laws by states."
  },
  {
    "headline": "Suit seeking South-East exit from Nigeria: Igbo leaders, groups knock northern elders",
    "summarized_story": "But Igbo Lawyers Association (ILA) in a swift reaction, applied to the court to join it as defendants in the suit.\n“We want to ensure that Igbo are protected in any decision on their fate in Nigeria.\nAlaigbo Development Foundation (ADF) said it was within the rights of the Northern Elders to go to court on any issue of their choice, but noted that the Northern elders might be acting a script.\nIgbo National Council (INC) has described the suit by the Northern elders as a ploy to deny the South East the Presidency in 2023.\n“No reasonable court or the National Assembly can attend to such request; it is not possible,” the legal luminary stated."
  },
  {
    "headline": "Kalu celebrates Oba Rilwan Akiolu at 78",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has described the Oba of Lagos, Oba Rilwan Akiolu as an outstanding monarch with passion for the growth and progress of Lagos state.\nExtolling the virtues of the first class monarch, Kalu stressed that Oba Akiolu’s reign has brought tremendous development to Lagos and environs.\nIn a congratulatory message in commemoration of Oba Akiolu’s 78th birthday anniversary, Kalu prayed for longer life in sound health for the renowned monarch.\nHe said, “I felicitate the Oba of Lagos, Oba Rilwan Akiolu on the occasion of his 78th birthday anniversary.\n“The traditional ruler is respected for his boldness, selflessness and humility."
  },
  {
    "headline": "Buhari Warns against Tenure Extension Campaign, Says He’ll Leave Office in 2023",
    "summarized_story": "The President was speaking at a meeting in Makkah with a select group of Nigerians resident in the Kingdom of Saudi Arabia where he just ended a visit.\nNo “Tazarce’’ (tenure extension).”Buhari adds: “I don’t want anybody to start talking about and campaigning for unconstitutional extension.\nAt that point, nobody can steal their votes or buy them,” Buhari was quoted as saying.\nHe quoted Buhari as saying, “My problem is the North-west where people are killing and stealing from one another.\nAccording to them, “Nigerian professionals are doing well and projecting a good image of our country.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Game on as A’Court Clears PDP for National Convention",
    "summarized_story": "He also sought an order of injunction restraining the PDP from holding its National Convention.\nPDP Holds National Convention at Eagle SquareMeanwhile, 3600 delegates will converge on the Eagles Square, Abuja, to elect a new National Working Committee (NWC).\nAddressing a press conference ahead of the convention, the Chairman of the National Convention Committee, Governor Ahmadu Fintiri of Adamawa State said 21 of the 24 offices were returned on consensus basis.\nAccording to Governor Fintiri, the offices that would be contested are that of the Deputy National Chairman (South), National Auditor and National Youth Leader.\nThe former national secretary of the party, Olagunsoye Oyinlola and Ambassador Taofeek Arapaja will be contesting for the office of the Deputy National Chairman (South)."
  },
  {
    "headline": "News in Photographs: Buhari Returns to Abuja from Saudi Arabia",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja from Saudi Arabia.\nBuhari departed for Riyadh, Saudi Arabia, Monday to participate in a three-day investment conference organized by the Future Investment Initiative Institute.\nIn Saudi Arabia, the President also performed the lesser Hajj and met with Nigerians before returning to Abuja on Friday evening.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Confusion as EFCC Denies Raiding Justice Odili’s Home",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Economic and Financial Crimes Commission (EFCC) has denied conducting any operation in the Maitama, Abuja, home of a judge of the Supreme Court, Justice Mary Odili.\nBut a statement issued by the EFCC denied executing any search warrant at the residence of Justice Odili.\n“The commission by this statement wishes to inform the public that the report is false as it did not carry out any operation at the home of Justice Odili.\nIf there was any such operation as claimed by the media, it was not carried out by the EFCC.\nAlso in 2020, the former governor approached a Federal High Court for another injunction to stop an impending probe."
  },
  {
    "headline": "Osinbajo, Tinubu Meet in Abuja",
    "summarized_story": "Vice President Yemi Osinbajo on Friday visited All Progressives Congress leader, Asiwaju Bola Tinubu, at his residence in Abuja.\nThough details of their meeting have not been released, photos released by the Office of the Vice President showed the two men embracing and later discussing while seated.\nRecent media reports had indicated frosty relations between Tinubu and Osinbajo over 2023 presidential race.\nBoth are aspiring to succeed President Muhammadu Buhari, whose second term ends on May 29, 2023.\nThough, the duo have not formally declared their aspirations to succeed Buhari, groups canvassing for them are emerging across the country."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Nigerian Navy Director On Wanted List For Corruption Illegally Renewed International Passport, Sneaked Into Nigeria",
    "summarized_story": "), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has sneaked back into the country using an illegally obtained international passport, SaharaReporters has gathered.\nHe went to the Nigerian Embassy in Abu Dhabi, UAE and wanted to bribe his way to getting his passport renewed.\nBut all passports renewed in Abu Dhabi carry only one passport number.\nAnd last two months, the new passport number was checked and it wasn't on the data base of the immigration.\n“In Abu Dhabi, once you show your old passport and they confirm it, they issue you with a new one and only your new passport number will be on the passport, unlike his that carries old passport number and new passport number."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Nigerian Navy Director On Wanted List For Corruption Illegally Renewed International Passport, Sneaked Into Nigeria",
    "summarized_story": "), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has sneaked back into the country using an illegally obtained international passport, SaharaReporters has gathered.\nHe went to the Nigerian Embassy in Abu Dhabi, UAE and wanted to bribe his way to getting his passport renewed.\nBut all passports renewed in Abu Dhabi carry only one passport number.\nAnd last two months, the new passport number was checked and it wasn't on the data base of the immigration.\n“In Abu Dhabi, once you show your old passport and they confirm it, they issue you with a new one and only your new passport number will be on the passport, unlike his that carries old passport number and new passport number."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "PHOTOS: Tight security as delegates arrive Eagles Square for PDP convention",
    "summarized_story": "There is a heavy security presence at Eagles Square, Abuja, the venue of the national convention of the Peoples Democratic Party (PDP).\nAdvertisementSecurity personnel have manned strategic locations and roads around Eagles Square and the federal secretariat, while armoured personnel carriers have been stationed at the adjoining junctions.\nMeanwhile, the roads along the axis of Eagles Square have been blocked, resulting in gridlock.\nCurrently, delegates from across the country have started arriving at the venue of the national convention.\nSecondus had approached the court seeking an order of injunction to restrain the opposition party from holding its national convention."
  },
  {
    "headline": "PHOTOS: Tight security as delegates arrive Eagles Square for PDP convention",
    "summarized_story": "There is a heavy security presence at Eagles Square, Abuja, the venue of the national convention of the Peoples Democratic Party (PDP).\nAdvertisementSecurity personnel have manned strategic locations and roads around Eagles Square and the federal secretariat, while armoured personnel carriers have been stationed at the adjoining junctions.\nMeanwhile, the roads along the axis of Eagles Square have been blocked, resulting in gridlock.\nCurrently, delegates from across the country have started arriving at the venue of the national convention.\nSecondus had approached the court seeking an order of injunction to restrain the opposition party from holding its national convention."
  },
  {
    "headline": "Abducted ex-senator regains freedom after 54 days in captivity",
    "summarized_story": "Nelson Effiong, a former senator representing Eket senatorial district in Akwa Ibom state, has been freed by his abductors.\nAdvertisementThe police said Effiong was kidnapped “at a popular drinking spot” in Uyo on September 5.\nNkereuwem Enyongekere, publicity secretary of the All Progressives Congress (APC) in the state, confirmed Effiong’s release in a statement issued on Saturday.\nHe said the former lawmaker was freed on Friday, and also expressed gratitude to persons who helped to facilitate his release.\n“The Senator gained his freedom just yesterday (Friday, October 30, 2021) from the enclave and grip of the men of the underworld."
  },
  {
    "headline": "Abducted ex-senator regains freedom after 54 days in captivity",
    "summarized_story": "Nelson Effiong, a former senator representing Eket senatorial district in Akwa Ibom state, has been freed by his abductors.\nAdvertisementThe police said Effiong was kidnapped “at a popular drinking spot” in Uyo on September 5.\nNkereuwem Enyongekere, publicity secretary of the All Progressives Congress (APC) in the state, confirmed Effiong’s release in a statement issued on Saturday.\nHe said the former lawmaker was freed on Friday, and also expressed gratitude to persons who helped to facilitate his release.\n“The Senator gained his freedom just yesterday (Friday, October 30, 2021) from the enclave and grip of the men of the underworld."
  },
  {
    "headline": "Court revokes warrant issued for search of Odili's home, says it was misled",
    "summarized_story": "A magistrate court in Abuja has revoked a warrant granted to search the residence of Mary Odili, a justice of the supreme court.\nDocuments seen by TheCable showed that the search warrant was obtained after one Aliyu Ibrahim, a whistleblower, deposed to an affidavit on October 13, stating that he “observed some illegal activities” within the area.\nAdvertisementThe chief magistrate revoked the search warrant on the grounds that the court was misled.\nIn view of the above fact, the said search warrant is hereby revoked,” the order reads.\nMeanwhile, the EFCC through its spokesperson, Wilson Uwujaren, has said the commission did not carry out an operation in the home of the supreme court justice."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Bolt’s EV option, aYo Holdings’ new business model, Facebook’s new name, Namibia’s crime-busting plans",
    "summarized_story": "The company plans to drive greater scale, better customer experience, and faster access to markets across the African continent in the coming years.\n50 countries in Africa have introduced mandatory SIM card registration laws.\nUa-Ndjarakana said that the SIM card registration process would be done to protect consumers’ privacy.\nDo you think SIM card registration combats crime or increases surveillance in Africa?\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "But then, it took her five years to build her first factory, and nine years in total to the Series A.Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Tuesday November 2, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Stitch’s Nigeria expansion, Africa’s military coups, RecoMed’s $1.5m funding, and Union45’s $3m seed",
    "summarized_story": "Source: Supplied,South African API fintech startup, Stitch has today announced its expansion into Nigeria and a $2M seed extension, with investment from Future Africa and Norrsken Foundation, among others.\nStitch announced an initial $4 million seed in February when it came out of stealth.\nThe startup launched officially in February 2021 with an API that provides software companies with identity verification tools and access to users’ financial data.\nWhile fintech startups still get a significant chunk of African funding, healthtech startups seem to be attracting some serious cash.\nApply hereCall for climate-focused startups: Africa ClimAccelerator Applications open."
  },
  {
    "headline": "COP26: Success for Africa is holding rich nations to their climate finance pledges",
    "summarized_story": "This represents an overall increase since committing to the US$100 billion goal in 2009, when collective climate finance, reached US$30 billion for the period 2010–2012.\nOne way to raise this funding, according to the report, is for rich countries to increasing the scale of climate finance and increase finance for adaptation.\nThe report also suggested addressing barriers in accessing climate finance, strengthening the Financial Mechanism of UNFCCC and the Paris Agreement, working with Multilateral Development Banks to increase and improve climate finance better manage private finance and report on collective progress transparently.\n“Of the many negotiation issues that concern Africa, climate finance has to be among the priorities,” said Chukwumerije Okereke, director, Center for Climate Change and Development, a think-tank out of the Alex-Ekwueme Federal University.\n“As a pillar of the Paris Agreement, much stands on climate finance."
  },
  {
    "headline": "Thomas Tuchel: From career-ending injury to world’s best coach",
    "summarized_story": "Thomas Tuchel is labelled the best manager on the planet right now, but that did not happen overnight.\nThe biggest question here is how did Tuchel become the best coach in the world?\nTuchel started his coaching career in 2000 as a youth team coach at VfB Stuttgart, where he piloted in the development of first team players.\nTuchel held the position for three years, after being offered the position as first team coach at FC Augsburg II in 2007–08 season.\n“For me, it’s more about passion and desire,” he hintedTraining has always been at the heart of Tuchel’s success, and his methods were revolutionary."
  },
  {
    "headline": "Ckay: The rise of Love Nwantinti",
    "summarized_story": "After an extended deliberation the record label, Chocolate City finally agreed to push the song Love Nwantinti.\nRead also: Spotify reveals Nigeria’s top music cities, songs they love‘Love Nwantinti’ the song which literally means small love in Igbo, talks about the singer’s intense desire for a love interest.\nFeaturing Joeboy may have been the best decision for Love Nwantinti.\n“When we released the EP, we just noticed that people were making videos,” CKay said in an interview with hiphopDX.\nOn streaming services like Youtube, Spotify, and Audiomack Love Nwantinti has racked up almost 100 million, 12 million, and 11 million streams respectively."
  },
  {
    "headline": "DSS Played Major Role In Foiling Benin Jailbreak – Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Commissioner for Communication and Orientation Andrew Emwanta has commended Edo State Command of the Department of State Security for their role in foiling attempted Jailbreak in Benin City, Edo State.\nThe commissioner gave the commendation during a courtesy visit to the office of the Director State Security Service (DSS) Edo State Command.\nNothing was said about the role your organisation played in securing the medium custodian center during an attempted jailbreak in Benin”.\nHe said EDSG has design proper mode of passing information to the public using the Edo Communication Organisation.\n” We will be organising a stakeholders engagement meeting with security agencies in December."
  },
  {
    "headline": "Obaseki urges end to multiple exchange rates to grow nation’s economy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has called for an end to multiple exchange rates to achieve sustainable economic growth and development in the country.\nThe governor reiterated the need for the government to relax capital control measures and promote exchange rate uniformity to create more incentives for investors in the domestic market.\nObaseki said while multiple exchange rates could hinder capital inflows into the country, a stable rate would boost domestic production and attract more investment.\nAccording to him, countries like the U.S., Europe and Asia have exchange rate stability, necessitating free movement of capital and developed capital markets.\nWe need a well-developed capital market so that we can attract long-term development and achieve financing development."
  },
  {
    "headline": "Delta Communities Land Dispute Leaves Four People Dead – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – No fewer than four persons have been reportedly killed during a gun duel between Okwagbe and Owahwa communities in Ughelli South Local Government Area of Delta State over an age-long land dispute.\nNigerian Observer gathered that while three persons were feared dead on the side of Okwagbe, one death was recorded in Owahwa.\nA local source said, that: “Yes, three were killed at Okwagbe, one killed at Okwakwa community over an age-long land dispute.\nPolice deployed to the area.”Okwagbe is a village in the Ughelli South Local Government Area located along the Forçados River and shares boundaries with the Oginibo, Okuemor, Otegbo, Owahwa, Egbo-Ide, and Okreka (Ofonibaya) communities, among others.\nWhen contacted, olice Public Relations Officer (PPRO), Delta Police Command, DSP Bright Edafe, confirmed the incident but did not give details of the number of casualties."
  },
  {
    "headline": "Tennis: Deputy Gov Congratulates Dr Tandoh on appointment To ATTF Post – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Deputy Governor of Edo state, Rt.\nComrade Philip Shaibu, has congratulated former chairman, Legos state Sports Commission, Dr Kweku Adedayo Tandoh on his recent appointment as Chairman, Youth Committee of the African Table Tennis Federation (ATTF).\nThe sports loving Deputy Governor said he was happy with the appointment of Dr Tandoh just as he expressed confidence in the ability of the sports consultant to deliver on his new post and take African tennis to the next level.\nThis appointment is not just a reward for Dr Tandoh but also a huge responsibility that will spur him to do more at the Continental level, ” Shaibu said.\nDr Tandoh’s appointment was recently announced following a letter signed by the ATTF president, Khaled El-Salhy, which reads in parts, this appointment is due to your remarkable achievements within the African Table Tennis Federation."
  },
  {
    "headline": "Soldier, four IPOB members killed in Anambra gun battle",
    "summarized_story": "Troops of the 82 Division of the Nigerian Army currently conducting a special operation in the South-east, Exercise Golden Dawn, have killed four members of the proscribed separatist group, IPOB and its militant wing, ESN, during an encounter in Anambra State.\nThe resumed hostilities in the region comes about a week to the governorship election of Anambra State.\nThe Nigerian Army notes that the recent attacks are part of proscribed IPOB/ESN plan to instil fear into the public and sabotage forthcoming Anambra State Governorship Election.\nThey are also encouraged to report any unusual activity observed across Anambra State to the nearest security post.\nONYEMA NWACHUKWUBrigadier GeneralDirector Army Public Relations30 October 2021"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Army says it killed four IPOB members in Anambra",
    "summarized_story": "Nigerian Army has said troops of the 82 Division currently conducting a special operation in the South-east, Exercise Golden Dawn, have killed four members of the Eastern Security Network (ESN), a militant wing of the Indigenous People of Biafra (IPOB) during an exchange of gunfire in Anambra State.\n“In a separate operation, troops have foiled another attack by IPOB/ESN gunmen at Umunze Checkpoint, in Orumba South Local Government Area.\n“The Nigerian Army notes that the recent attacks are part of proscribed IPOB/ESN plan to instil fear into the public and sabotage forthcoming Anambra State Governorship Election.\nMembers of the public are reassured that the Nigerian Army, sister services and other security agencies will not relent in resolutely confronting all criminals intents against the citizenry and national interest.\nThey are also encouraged to report any unusual activity observed across Anambra State to the nearest security post.”"
  },
  {
    "headline": "Nigerians rise up against attack on Odili’s residence",
    "summarized_story": "Subsequently, operatives mobilised to Mrs Odili’s house based on the warrant seeking to forcibly search it in the evening of October 29, the same day a warrant was approved.\nBut she rejected the move to search her residence because she had no pending issues with anti-graft agencies.\nJustice Odili also argued that the warrant was not meant for her residence since she lives at 7, Imo River Street, Maitama, and not 9, Imo Street, Maitama, as stated in the warrant.\nThe Commission enjoins the public to discountenance the report,” police and military personnel refused to vacate the residence for long periods.\n“Mrs Mary Odili’s house was invaded this night."
  },
  {
    "headline": "To avoid sack over alleged land scam, Enugu commissioner of lands, Victor Nnam resigns",
    "summarized_story": "Dr. Victor Nnam, Enugu State Commissioner for Lands and Urban Development, on Friday resigned his appointment, citing interference from the state governor.\n“I immediately proposed for an establishment of a Geographic Information Strategy (GIS) land administration system to enable the ministry stamp out land grabbers and create investors confidence in our land system.\n“I here by resign my appointment as the Commissioner for Lands and Urban Development, Enugu State with effect from today, Friday 29 October.\n“Thank you your Excellency for giving me the opportunity to serve the people of Enugu State”.\n“It is a common knowledge that most people who bought lands here in Enugu metropolis had their lands reallocated to other persons by the ministry."
  },
  {
    "headline": "100 Out-of-School Girls, Others Participate in U.S. Sponsored Entrepreneurship Programme",
    "summarized_story": "Girls Creativity Hub, U.S. government exchange alumni-led project, has completed a 12-month long entrepreneurship program for 100 out-of-school girls and young women.\nAged 18-25, the participants received training and mentorship in areas of creative design, entrepreneurship, and leadership skills, with the overall goal of establishing economic independence.\n“The United States believes that the economic empowerment of women is crucial to the development of every country.\nWithout women’s inclusive participation in society, any gains in economic growth, development, science, or technology are unsustainable,” Siddiqi said.\nYou were able to align your priorities for the benefit of your fellow citizens to improve economic growth and development, and we are proud of you for giving back to your communities,” he added."
  },
  {
    "headline": "Physically Challenged Graduate Writes Lagos Gov, Begs For Job",
    "summarized_story": "A physically challenged graduate of the Lagos State University, Agosu Fagla, has written an open letter to Governor Babajide Sanwo-Olu, seeking his help for a job.\nThe university graduate caught the attention of people when he made a billboard with the inscription: “I need a job.”Fagla then followed it up by standing at the gate of the Lagos State Secretariat, Alausa, Ikeja.\nHe wrote: “Sir, I am Agosu Fagla Albert from Badagry Local Government Area, Lagos State.\nI was then a pupil of Opebi Primary school, Allen, Ikeja, Lagos, under the leadership of the headmaster (Mr T. Adebiyi).\n“My Dear Governor sir, I have followed with passion your success stories in Lagos State and your passion for the less privileged."
  },
  {
    "headline": "Physically Challenged Graduate Writes Lagos Gov, Begs For Job",
    "summarized_story": "A physically challenged graduate of the Lagos State University, Agosu Fagla, has written an open letter to Governor Babajide Sanwo-Olu, seeking his help for a job.\nThe university graduate caught the attention of people when he made a billboard with the inscription: “I need a job.”Fagla then followed it up by standing at the gate of the Lagos State Secretariat, Alausa, Ikeja.\nHe wrote: “Sir, I am Agosu Fagla Albert from Badagry Local Government Area, Lagos State.\nI was then a pupil of Opebi Primary school, Allen, Ikeja, Lagos, under the leadership of the headmaster (Mr T. Adebiyi).\n“My Dear Governor sir, I have followed with passion your success stories in Lagos State and your passion for the less privileged."
  },
  {
    "headline": "Troops Raid IPOB Camps In Ebonyi, Kill Gang Members Who Killed Police, DSS Operatives",
    "summarized_story": "Troops conducting Exercise Golden Dawn have raided some identified camps of Indigenous Peoples of Biafra/Eastern Security Network (IPOB/ESN) in Ebonyi State.\nPRNigeria gathered that the IPOB/ESN camps, located at Ochokwu Village in Ikwo Local Government Area of Ebonyi State were raided by military troops during a clearance operation.\n“During the operation, troops exchanged fire with the gunmen occupying the camps.\nADVERTISEMENTIn another development, four IPOB militants, who attacked a team of Police and DSS personnel at Ukwulobia, in Anambra, were also killed at Nnobi area of State.\nPRNigeria could not confirm the casualty on the side of the security personnel that were attacked by IPOB gunmen."
  },
  {
    "headline": "Troops Raid IPOB Camps In Ebonyi, Kill Gang Members Who Killed Police, DSS Operatives",
    "summarized_story": "Troops conducting Exercise Golden Dawn have raided some identified camps of Indigenous Peoples of Biafra/Eastern Security Network (IPOB/ESN) in Ebonyi State.\nPRNigeria gathered that the IPOB/ESN camps, located at Ochokwu Village in Ikwo Local Government Area of Ebonyi State were raided by military troops during a clearance operation.\n“During the operation, troops exchanged fire with the gunmen occupying the camps.\nADVERTISEMENTIn another development, four IPOB militants, who attacked a team of Police and DSS personnel at Ukwulobia, in Anambra, were also killed at Nnobi area of State.\nPRNigeria could not confirm the casualty on the side of the security personnel that were attacked by IPOB gunmen."
  },
  {
    "headline": "Orijin Tigernut, Ginger Launch Excites Consumers In 5 Cities",
    "summarized_story": "Orijin, the flagbearer of African Heritage has launched the Orijin Tigernut and Ginger flavour brand in an orijinal spectacle of graffiti extravaganza.\nThe company said this is a new addition to the Orijinal family to the excitement of Orijinals in Abuja, Ibadan, Enugu, Benin City and Lagos.\nFeaturing a two-day live painting by graffiti artists dressed in afrocentric street costumes, the extraordinary creation stunned onlookers with its reveal of a gigantic mural of the Orijin Tigernut and Ginger bottle.\nWe’re very excited to be bringing the much-loved taste combination of Tigernut and Ginger to Orijin – a contemporary drink that is proudly Nigerian.”Orijin Tigernut & Ginger is lightly carbonated and bursting with flavour and a refreshing kick thanks to the taste of Tigernut and Ginger.\nAdded to the signature Orijin blend of over 50 fruit and herb extracts blended with alcohol, this is a truly refreshing drink that is low in sugar."
  },
  {
    "headline": "Actress to Tiwa Savage: Your sex without condom sends wrong message",
    "summarized_story": "Actress Sonia Ogiri is one female that has been very vocal about the sex tape of Tiwa Savage that went viral on social media platforms some weeks ago.\nShe said, “Yes, I have been vocal about Tiwa’s sex tape, it’s so unfortunate.\nI am not for once standing against her, I just aired my opinion about the sex tape, and it should not even have happened.\nSo, I expected her to be wiser than that sex tape.\n“I would never have a sex tape, except it was done without my knowledge, but I am very smart to check around."
  },
  {
    "headline": "Actress to Tiwa Savage: Your sex without condom sends wrong message",
    "summarized_story": "Actress Sonia Ogiri is one female that has been very vocal about the sex tape of Tiwa Savage that went viral on social media platforms some weeks ago.\nShe said, “Yes, I have been vocal about Tiwa’s sex tape, it’s so unfortunate.\nI am not for once standing against her, I just aired my opinion about the sex tape, and it should not even have happened.\nSo, I expected her to be wiser than that sex tape.\n“I would never have a sex tape, except it was done without my knowledge, but I am very smart to check around."
  },
  {
    "headline": "Embattled Secondus takes case to Supreme Court",
    "summarized_story": "He said, “The court has directed that the PDP can continue with the national convention.\nWe still have an appeal pending before this court (Court of Appeal) waiting to be taken.\nOn September 10, the court delivered its judgement and restrained Secondus from performing the duties of the party’s national chairman.\nImpunity must be resisted, I’ll go on appeal – SecondusReacting to the ruling, Secondus said he disagreed with it, but still respected it.\nAs a foundation member of this party who has served at various levels as state chairman, chairman of state chairmen, National Organising Secretary, Deputy National Chairman, Acting National Chairman and now National Chairman, I am very much abreast with the workings of the party."
  },
  {
    "headline": "Embattled Secondus takes case to Supreme Court",
    "summarized_story": "He said, “The court has directed that the PDP can continue with the national convention.\nWe still have an appeal pending before this court (Court of Appeal) waiting to be taken.\nOn September 10, the court delivered its judgement and restrained Secondus from performing the duties of the party’s national chairman.\nImpunity must be resisted, I’ll go on appeal – SecondusReacting to the ruling, Secondus said he disagreed with it, but still respected it.\nAs a foundation member of this party who has served at various levels as state chairman, chairman of state chairmen, National Organising Secretary, Deputy National Chairman, Acting National Chairman and now National Chairman, I am very much abreast with the workings of the party."
  },
  {
    "headline": "IPOB gunmen, soldiers in gun duel in Anambra; 5 killed",
    "summarized_story": "Troops of 82 Division of the Nigerian Army, conducting “Exercise Golden Dawn” were engaged in a gun duel by gunmen of the proscribed Indigenous Peoples of Biafra/Eastern Security Network (IPOB/ESN) at Nnobi in Anambra.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu confirmed the development on Saturday.\nNwachukwu said the gunmen were overpowered in a fierce encounter with troops at Nnobi Junction, Idemili South Local Government Area of Anambra, on Friday.\nNwachukwu also disclosed that the troops had in another operation, foiled another attack by IPOB/ESN gunmen at Umunze Checkpoint, in Orumba South Local Government Area of the state.\n“They are also encouraged to report any unusual activity observed across Anambra State to the nearest security post,” he said."
  },
  {
    "headline": "PDP will come out of national convention stronger – Tambuwal",
    "summarized_story": "By Emmanuel OloniruhaThe Governor of Sokoto state and chairman of the PDP Governors’ Forum, Aminu Tambuwal, has said that the party would emerge stronger from its national convention to receive those coming to join it.\nTambuwal stated this while briefing newsmen after the PDP stakeholders’ meeting held at Akwa-lbom Governor’s Lodge in Abuja on Friday night.\nThe positions the party is yet to have consensus candidate are deputy national chairman (south), national youth leader and national auditor.\nPDP leaders at the meeting include the immediate past Vice President, Namadi Sambo, attending any PDP function for the first time since he left office in 2015; and former Vice President Atiku Abubakar.\nOthers include former Senate Presidents David Mark, Adolphus Wabara and Pius Anyim; former PDP national chairman, Okwesilieze Nwodo; and former Deputy President of the Senate, Sen. Ike Ekweremadu."
  },
  {
    "headline": "3 PDP elected council chairmen get certificates of return",
    "summarized_story": "Three newly elected PDP Chairmen of Kachia, Soba and Zangon Kataf local government areas have been handed certificates of return.\nMrs Saratu Dikko-Audu, Chairperson of the Kaduna State Independent Electoral Commission (KADSIECOM),gave out the certificates at a ceremony in Kaduna.\nDikko-Audu also presented certificates to elected Councillors at the ceremony at KADSIECOM’s headquarters in Kaduna.\nMr Francis Sani, Chairman of Zangon Kataf local government council, who spoke on behalf of the elected officials, commended Gov.\nThe certificates of return were presented to Mr Francis Sani (PDP) in Zangon Kataf LG who polled 28,771 votes, Yahaya Suleiman (PDP), Soba LGA, who recorded a total of 20,205 votes and Aaron Bako (PDP), of Kachia LGA, who scored 30,863 votes."
  },
  {
    "headline": "BREAKING: Nigerian Army Troops Neutralize 4 IPOB/ ESN Gunmen [PHOTOS]",
    "summarized_story": "…Recover AK-47 Rifles, vehicles, ammunitionTroops of 82 Division Nigerian Army conducting Exercise GOLDEN DAWN have neutralised four gunmen of the proscribed Indigenous Peoples of Biafra/ Eastern Security Network (IPOB/ESN) in a fierce encounter at Nnobi Junction, Idemili South Local Government Area on Friday 29 October 2021.\nTroops made contact with the fleeing gunmen and engaged them in a fire fight, neutralizing four of the criminals.\nThe gallant troops also recovered two AK-47 Rifles, one GALIL Ace 5.56 x 45 Iwi Gun, one Avofeng Hand held radio and one Black Highlander jeep.\nSadly, a personnel of one of the security agencies paid the supreme price.\nIn a separate operation, troops have foiled another attack by IPOB/ ESN gunmen at Umunze Checkpoint, in Orumba South Local Government Area."
  },
  {
    "headline": "Why We’ve Not Declared Bandits As Terrorists – Defense Minister.",
    "summarized_story": "Maj. Gen. Bashir Magashi (Rtd), Minister of Defence, has stated that the delay in classifying bandits as terrorists is due to the need to follow due process.\nMagashi said this while fielding questions from reporters in Maiduguri on Friday, adding that there was a procedure that had to be followed before such a pronouncement.\n“We are not declaring them terrorists because there is a procedure for doing that.\n“When the procedure is followed, they will be classified as terrorists.\nHe said his team met with the Theatre Commander and other component commanders to deliberate on the next phase of operations, adding that the meeting also identified problems that required urgent attention to enhance the operations."
  },
  {
    "headline": "BREAKING: Bandits Kill 20 Security Operatives In Zamfara, Set Their Corpses On Fire.",
    "summarized_story": "NEWS DIRECT gathered that the security operatives were sent to a village where bandits have been ravaging for a long time without any security stoppage.\nIt was gathered that bandits ambushed the security operatives, killed scores of them and set the corpses on fire in the early hours of Friday.\nAmong the victims was Alhaji Shehu Mallami, a resident of the community.\nWhen contacted, the Public Relations Officer of the Nigeria Security and Civil Defense Corps (NSCDC), Mr. Aminu Mary confirmed the incident, saying that the state commandant of the corps had already left to the scene to ascertain what really happened."
  },
  {
    "headline": "BREAKING: Osinbajo, Tinubu Meet Amid Rumoured Feud Over 2023 Presidency",
    "summarized_story": "Vice-President Yemi Osinbajo and Asiwaju Bola Tinubu, National Leader of the All Progressives Congress (APC), met in Abuja on Friday.\nBoth men, who were locked in a warm embrace, met amid speculations that they were fighting each other over the 2023 presidential contest.\nNeither Tinubu nor Osinbajo has publicly declared interest in the race but there are indications that they are interested in succeeding Buhari.\nDetails later:"
  },
  {
    "headline": "Breaking: EFCC opens up as security operatives invade Mary Odili’s residence",
    "summarized_story": "The residence of a Supreme Court Justice, Mary Odili, on Friday suffered invasion by suspected armed Police and Soldiers.\nThis is as the Economic and Financial Crimes Commission (EFCC) has swiftly denied being involved in the reported raid.\nReports earlier suggested that the security operatives arrived at Justice Odili’s Abuja residence and made immediate attempt to break in, but the wife of former Rivers State Governor, Peter Odili, fervently resisted the attempts to raid her residence by the operatives, telling the operatives that she had no business with them.\nHer husband has been facing corruption charges raised by the Economic and Financial Crimes Commission (EFCC).\nDetails loading…"
  },
  {
    "headline": "Tension as PDP holds ‘consensus national convention’",
    "summarized_story": "Like Ogbeh, another Obasanjo’s friend, Ahmadu Ali, was made the party’s national chairman.\nConsequently, Vincent Ogbulafor was elected the new chairman at the party’s national convention of 2008.\nThis has led to mass defections of party members from state to national levels, and this has affected their performances in many elections.\nThe conventionOf all the positions, only those of the national auditor, national youth leader and deputy national chairman (South) would be contested out at the convention ground as the others have already been concluded on a consensus arrangement.\nThe Enugu state governor, Ifeanyi Ugwuanyi, introduced the Abia state governor, Okezie Victor Ikpeazu."
  },
  {
    "headline": "Breaking: 2 dead as DSS operatives suffer attack in Anambra, 1 week to governorship poll",
    "summarized_story": "Gunmen on Friday ambushed operatives of the Department of State Services (DSS) and killed two Friday in Anambra.\nThe bloody incident happened about one week to scheduled governorship election in the state which has recently turned hot bird for all sorts of criminalities.\nTalking about the attack, the officers were attacked as gunmen ambushed their convoy while on election campaign duty in Ekwulobia, Blueprint reports.\nThere is already trending video showing the aftermath of the attack on social media.\nAlready, forces comprising the police and the military have condoned the area, and the remains of those killed have been taken away."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "2023: Utomi, Jega, Agbakoba to launch ‘Third Force’ mega party in Nov – Yunusa -NigPilot",
    "summarized_story": "Top political gladiators in the country are set to launch an alternative mega party in November to challenge the ruling All Progressives Congress, APC, and the major opposition, Peoples Democratic Party, PDP, in the 2023 general elections.\noised to deliver Nigeria from her present crises of collapse foisted by failed political leadership and system.\nThese leaders of conscience who are under the auspices of the National Consultative Front, NCFront , said they are pIn a press statement released Friday by the Head , Public Affairs Bureau of NCFront, Dr Tanko Yunusa, the group said apart from the major political parties, which are set to work together to form the nucleus of the new credible alternative platform, the process should also seeks to explore electoral alliance with other political parties with similar ideological values, in building a major groundswell of formidable solidarity for the new Mega Party.\nDr. Yunusa noted that the National Secretariat of the NCFront has already mobilised relevant stakeholders to work out the modalities of ensuring equal benefits and responsibilities for partners and stakeholders fusing into the new alternative political platform.\nHe said, “However, the latest people’s centred working together is being facilitated by the leadership of the NCFront is being built on the three layers of key like minded Ideological political parties, which are to form the nucleus of the ‘Third Force’ Mega Party, other political parties, who are interested in undertaking electoral alliance with the nucleus of the New Mega Party and finally political associations, interest and stakeholders’ Groups and civil society leaders and allies who are committed to fuse into the the grand political coalition in bringing about a credible alternative mass political platform to save Nigeria from the disastrous grip of failed political leadership and the heightening constitutional crisis and agitations rocking the country, which are currently doing great damage to the economic prosperity of Nigerians."
  },
  {
    "headline": "Alleged EFCC invasion of Justice Mary Odili’s private residence barbaric, reprehensible – CUPP",
    "summarized_story": "The Coalition of United Political Parties, CUPP, has condemned in strong terms, the alleged invasion of the private residence of a renowned Justice of the Supreme Court of Nigeria, Justice Mary Odili, by officers suspected to be operatives of the Economic and Financial Crimes Commission, EFCC, working in collaboration with Officers and men of the Nigeria Police Force, describing it as unjustified and Illegal.\nThough the EFCC, through its Chairman, Abdulrasheed Bawa, has denied any involvement of the anti-graft agency in the operation, the CUPP asserted that Intimidation and harassment of Judicial Officers by the administration of President Muhammadu Buhari led APC Government is an act of terror.\n“As long as we profess to be be in a democracy, it is incumbent on all elected and appointed Officials to act within the confines of the Law.\n“With the worsening security and economic situations in Nigeria occasioned by unprecedented ineptitude on the part of Mohamadu Buhari led APC Government, it has become clear that the current administration has wilfully and consciously chosen to derail our nascent democracy and lead Nigeria to a part of no return.\n“We therefore demand an immediate withdrawal of security operatives from the private residence of Justice Mary Odili and an unreserved apology from the Nigerian government in this regards and further call on all Nigerians to stand up and defend our democracy which this administration is bent on derailing.”"
  },
  {
    "headline": "NECO releases 2021 SSCE results, links delay to actions of some Agencies -NigPilot",
    "summarized_story": "As was the practice before, results were normally released the latest ninety (90) days after the last written paper.\nIt came about as a result of some actions by agencies that have a direct bearing on our operations.\nAccording to him, the number of candidates who made Credit and above in the English Language is 945,853 representing 77.72%.\nNumber of candidates who made five (5) Credits and above including English Language and Mathematics is 878,925 representing 71.64%.\n“Number of candidates who made five (5) Credits and above irrespective of English Language and Mathematics is 1,226,796 representing 94.04%."
  },
  {
    "headline": "Abe, Golden Chioma not APC members, until registration, revalidate on – – Rivers APC -NigPilot",
    "summarized_story": "Hon Davis without mincing words barred his mind on the just concluded Rivers state APC Congress, and it’s outcomeMay I meet you?\nThe constitution on its own has empowered the National Executive Committee to take necessary actions, the National Convention statutorily holds once in four years.\nSome people in Rivers State chose not to do so, claiming that their membership had not yet expired.\nSo far as we are concerned, in Rivers APC, as much as I talk with you now and here, there is no crisis.\nWe are going to bring people they will accept, who will work for the benefit of Rivers State."
  },
  {
    "headline": "PDP Convention: Leaders, Delegates, Members Gather To Elect New Officials",
    "summarized_story": "﻿Members and delegates of the leading opposition party Peoples Democratic Party (PDP) have converged at Eagles Square, Abuja to hold their national convention and elect new officials.\nNational party officials, governors, ex-governors, and other bigwigs of the party are currently at Eagle’s Square in preparation.\nChairman of the organising committee of the convention, Governor Ahmadu Fintiri had earlier on Friday said efforts are on to reconcile most of the contestants.\nBut on Friday, the Appeal Court in Port Harcourt, Rivers State granted the party the right to hold the convention in a suit brought by Secondus.\nRivers State Governor, Nyesom Wike, backed the ruling of the Court of Appeal, describing it as a victory for the party."
  },
  {
    "headline": "UPDATED: Police Deny Killing Of 20 Security Operatives In Zamfara",
    "summarized_story": "The Zamfara State Police Command on Saturday denied that about 20 security operatives had been killed by bandits along Shinkafi road.\nEarlier reports had it that the security operatives, mostly personnel of the Nigerian Security and Civil Defence Corps (NSCDC) and local vigilantes, had been ambushed by a group led by notorious bandit leader, Turji.\n“The operatives who were always at red alert engaged the hoodlums to an extensive gun duel that lasted for hours.\nUnfortunately, a Police Operative and two (2) Civil Defence Personnel paid the supreme price and their corpses were evacuated and buried accordingly.\nSeveral individuals, including Kaduna State Governor, Nasir El-Rufai, have urged the Federal Government to designate the bandits as terrorists."
  },
  {
    "headline": "EFCC Denies Involvement In Raid On Justice Odili’s Home",
    "summarized_story": "﻿The Economic and Financial Crimes Commission (EFCC) on Friday denied it carried out an operation on the home of Justice Mary Odili.\nReports of a raid on her home were condemned by the Commission’s spokesperson, Wilson Uwujaren, who noted that none of its officers carried out any operation on the Justice’s home.\nThere had been reports earlier that the EFCC had gone to Justice Odili’s home to execute a search warrant, as part of investigations into her husband, former Governor of Rivers State, Peter Odili.\nAnd as you are aware, the work that we do, the judiciary is our biggest partner.\nThey are just trying to cause problem where there is no problem.”"
  },
  {
    "headline": "Why We Are Yet To Designate Bandits As Terrorists – FG",
    "summarized_story": "﻿The Minister of Defense, Bashir Magashi, has explained that despite calls to designate bandits as terrorists, the Federal Government is yet to do so because it is still reviewing and following all the required procedures.\nMr Magashi said this while responding to questions from journalists in Maiduguri, the Borno State capital on Friday when he led service chiefs to receive an operational brief from the headquarters of the theatre command Operation Hadin Kai.\nOn the position of the bandits in the northwest Magashi says: “there’s a procedure in doing that, once the procedure is followed, they may be classified as terrorists but we are waiting for the procedure to be completed.”Many persons, including Kaduna State Governor, Nasir El-Rufai, have called for the bandits to be designated as terrorists as attacks in the North-West and North-Central proliferate.\nIn September, the Senate had also urged President Muhammadu Buhari to declare them as terrorists.\nThe federal lawmakers also asked President Buhari to declare all the known leaders of the bandits wanted and track them wherever they are for arrest and prosecution."
  },
  {
    "headline": "Why Facebook Changed To Meta And Why It Matters?",
    "summarized_story": "Facebook has also begun building more informal spaces, such as “workrooms,” where participants appear around a round table as personalized avatars that look like cartoon characters.\nFacebook has been losing young people for years to other platforms — the rise of TikTok has been a particular threat — but it has continued to grow.\nThe metaverse Zuckerberg strolled through in Thursday’s promotional pitch was a friendly place of connection and did not evoke the angry political fights or anti-vaccine misinformation that discolors social media.\nGetting control of what Facebook sees as the future of online life would also position the company to slip past the power of Apple and Google.\n“Where it will fail or succeed is going to be about what they are tangibly going to change,” he added."
  },
  {
    "headline": "NECO releases 2021 SSCE result, blacklists 20 supervisors",
    "summarized_story": "The National Examinations Council has released the results of the 2021 Senior School Certificate Examinations conducted nation wide in July.\nReleasing the result at the NECO Headquarters in Minna, NECO Registrar, Dantana Wushishi, disclosed that 878,925 candidates representing 71.64 per cent made five credits including Mathematics and English language.\n1,226,796 candidates representing 91.04 per cent of the candidates made five credits and above irrespective of English Language and Mathematics.\nThe registrar stated that out of the 1,233,631 candidates that registered for the Examinations only 1,209,992 sat for the exams.\nHe noted that 20,003 representing 1.63 per cent of candidates were involved in various forms of malpractice ."
  },
  {
    "headline": "Lagos unveils plans for 2021 Greater Lagos Fiesta",
    "summarized_story": "Lagos state government has unveiled plans for this year’s greater Lagos fiesta.\nWith the theme, Lagos Rocks, the event will kick off from the 1st of December 2021 to the 1st of January 2022 with Variety of activities to meaningfully engage and interact with all regions, residents and visitors to the state.\nFormerly called ‘The Lagos countdown’ and ‘One Lagos fiesta’, the event is an annual new years event.\nSpeaking on the importance of the festival, the Lagos state governor, represented by the deputy governor, noted that this is part of the government’s plan to boost entertainment and tourism in the state."
  },
  {
    "headline": "TASUED shut indefinitely, students ordered to vacate premises",
    "summarized_story": "The Senate of Tai Solarin University of Education Ijagun, Ogun State has shut the Institution and directed all Students to vacate the University’s premises immediately .\nParents are also advised to contact their wards and ensure they return home forthwith.\nThe announcement was made through a press release issued by the university’s Public Relations Officer, after a day long demonstration by the students.\nThe students protested against what they called illegal arrest of some of them, including the President of the Students Union by men of the Nigerian Army from Ilese Barracks.\nDuring the demonstration, the students blocked the Sagamu-Benin Ore Expressway."
  },
  {
    "headline": "Scores of Bandits killed, hideouts destroyed in Kaduna",
    "summarized_story": "Scores of bandits have been reportedly killed and their camps destroyed by the troops of the Nigerian Military in a clearance operation carried out in Igabi and Chikun Local Government Areas of Kaduna State.\nThe troops also reported that the wife of a notorious bandit was arrested together with their spiritual leader in a Chikun Local Government Area.\nSome Items recovered from them include motorcycles, AK47 rifles, rounds of ammunition and hard drugs.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, on Friday, said the clearance operations were conducted in Faka, Katuka, Barebari and Maguzawa general areas, spanning Chikun and Igabi LGAs.\nAccording to him, an unconfirmed number of bandits were killed by a Nigerian Air Force attack helicopter after they were sighted on the high ground across the Maguzawa River."
  },
  {
    "headline": "Bawa Says EFCC Not Responsible as Security Agents Search Justice Odili’s House in Abuja",
    "summarized_story": "EFCC, had, Friday night, denied conducting any operation in the home of Justice Odili following reports that raid was an EFCC operation.\nA statement issued by the Spokesman of EFCC, Wilson Uwujaren, denied the involvement of the commission in the execution any search warrant at the residence of Justice Odili.\nHe said Justice Odili was expected to make a formal complaint to clear the air on the matter.\nThe security operatives, who came with a search warrant, said they received information on “illegal activities” going on in the house.\nThe Chief Magistrate, Emmanuel Iyanna, subsequently approved the search warrant on October 29, 2021."
  },
  {
    "headline": "Kwankwaso: Ganduje Taking Loans for Unnecessary Projects",
    "summarized_story": "Former Governor of Kano State, Rabiu Kwankwaso says his successor, Governor Abdullahi Ganduje has been borrowing to execute unnecessary projects, causing the state to owe about N185 billion.\nHe said, “On personal ground, there is just no issue but on the issue of governance, certainly, we are not satisfied with what the government is doing.\nFor the two times, 2003 and 2015, that I left government, there was no one single debt for Kano State – zero.\n“I can tell you earlier this year, our investigation shows that Kano State is indebted to about N185 billion and that is not acceptable in our own arrangement.\nSome of the projects they claim are being done were projects in our opinion that were not necessary."
  },
  {
    "headline": "Nigeria: Game on as Appeal Court Clears PDP for National Convention",
    "summarized_story": "He also sought an order of injunction restraining the PDP from holding its National Convention.\nMultiple court orders were issued against Secondus resulting in his removal from office, and the Deputy National Chairman (South), Yemi Akinwonmi, appointed in his stead.\nPDP Holds National Convention at Eagle SquareMeanwhile, 3600 delegates will converge on the Eagles Square, Abuja, to elect a new National Working Committee (NWC).\nAccording to Governor Fintiri, the offices that would be contested are that of the Deputy National Chairman (South), National Auditor and National Youth Leader.\nThe former national secretary of the party, Olagunsoye Oyinlola and Ambassador Taofeek Arapaja will be contesting for the office of the Deputy National Chairman (South)."
  },
  {
    "headline": "Buhari Warns Against Tenure Extension Campaign, Says He’ll Leave Office in 2023",
    "summarized_story": "Nigeria President Muhammadu Buhari on Friday said he would leave office when his tenure ends on May 29, 2023, and warned against campaigns for tenure extension, saying he swore to serve in accordance with the constitution.\nThe President was speaking at a meeting in Makkah with a select group of Nigerians resident in the Kingdom of Saudi Arabia where he just ended a visit.\nNo “Tazarce’’ (tenure extension).”Buhari adds: “I don’t want anybody to start talking about and campaigning for unconstitutional extension.\nHe quoted Buhari as saying, “My problem is the North-west where people are killing and stealing from one another.\nAccording to them, “Nigerian professionals are doing well and projecting a good image of our country.”Deji Elumoye in Abuja"
  },
  {
    "headline": "US Spy Agencies Say Origins of Covid-19 May Never be Known",
    "summarized_story": "The Food and Drug Administration on Friday paved the way for children ages 5 to 11 to get Pfizer’s COVID-19 vaccine.\n“The rationale here is protect your children so that they can get back towards normal life,” said FDA vaccine chief Dr. Peter Marks.\nA few countries have begun using other COVID-19 vaccines in children under 12, including China, which just began vaccinations for 3-year-olds.\nBut a recent Kaiser Family Foundation survey suggests most parents won’t rush to get the shots.\nThe similarly made Moderna vaccine also is being studied in young children, and both Pfizer and Moderna also are testing shots for babies and preschoolers."
  }
]