[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Chuka Ezeigbo, SLOT Founder’s Son graduates from a UK University",
    "summarized_story": "Celebration as Chuka Ezeigbo, the second son of Engr.\nNnamdi Ezeigbo, CEO/Founder, SLOT Systems Limited, and Chairman of the Ezeigbo SLOT Foundation graduates with a good result in Bsc Digital Marketing from the University of Portsmouth, UK.\nThanks for making us proud!\nRELATED NEWS"
  },
  {
    "headline": "2023: Guber candidate, Jandor receives new APC decampees into Lagos PDP",
    "summarized_story": "By Efe OnadjaeRead Also:Osun poll: Reassurance that will of people cannot be suppressed — Jandor2023: Why I joined ‘Jandor’ — Funke AkindeleLagos flood: Jandor sympathizes with victims, sets up disaster recovery team across 20 LGAsAccording to Jandor, “Yesterday, (Wednesday) I received into the Lagos PDP family, some members of the APC who dumped the APC for the PDP.\n“The group by name, Best Alternative Network said they left APC, despite being the party in power because they believe in our promise of a better tomorrow as against the misrule they are currently experiencing under APC”, he said.\nVanguard News Nigeria"
  },
  {
    "headline": "Ignorant Nigerians criticize Water Bill, misleading others — Adamu",
    "summarized_story": "No river bank handed over to Fulani herdersSays Bill will change narrative in water sectorBy Gabriel Ewepu – AbujaThe Minister of Water Resources, Engr Suleiman Adamu, has said it is ignorant and unpatriotic Nigerians who are criticizing the National Water Resources Bill before the National Assembly and misleading others.\nRead Also:Proposed water bill and best practices in water resources managementHow FG will control water resources if Reps’ bill passes into lawWater Resources Bill: FG has ulterior motives — Ndokwa youthsWhile some do not want to read the Bill because they do not believe in the Buhari-led administration.\nAlso speaking was a water resources expert, Engr Benson Ajesegiri, stressed that the Water Resources Bill will bring peace and development to the people while speaking via zoom during the media conference.\nA legal consultant for National Water Resources Bill 2022, Tanwa Koya, called for.closer view and understanding about the Bill, “We look at the bill from the perspective of what we tend to achieve as a nation.”Koya added that the bill provides an institutional framework for the effective governance of the Water Sector.\nThe Executive Director of Nigeria Integrated Water Resources Management Commission, Engr Bashir Magashi, said the Bill is for the best interest of Nigeria and Nigerians."
  },
  {
    "headline": "Ex-BBNaija lovers that got married after reality show",
    "summarized_story": "Ex-BBnaija loversBy Miftaudeen RajiThe Big Brother Naija Show has come to stay as a major source of entertainment, but it does not stop there.\nThe reality TV show has opened the doors to new opportunities in the entertainment world, even beyond the shores of Africa.\nHere are two ex-BBNaija housemates, who got married months after the reality TV show:Bambam and Teddy ATeddy A and Bambam’s moments inside BBnaija houseThe duo Bambam and Teddy A were the first set of lovers, who got married.\nAfter the Reality TV show, Bambam and Teddy A got married months after the show in a colourful white wedding which happened in Dubia, UAE.\nKhafi and GedoniKhafi and GedoniThe duo of Khafi Kareem and Gedoni Ekpata are one of the couples the Big Brother Naija Reality TV Show produced."
  },
  {
    "headline": "N5m ransom: I was tortured, tied to tree without food ―Akala farm supervisor",
    "summarized_story": "A family source told Vanguard that the victim was subjected to severe beatings from his abductors.\n“I was severely tortured, tied to a tree and given no food,” an informed family source, who confided in Our Correspondent, quoted Bakare to have narrated his ordeal.\nRecall that Bakare was kidnapped at TDB farm at Jabata, Surulere Local Government area of the state.\nA reliable family source further said he was released last night.\nThe ransom, according to our investigations, was taken to a forest in Otte area, the boundary between Oyo and Kwara states on Ogbomoso-Ilorin expressway."
  },
  {
    "headline": "Buhari presides over security meeting",
    "summarized_story": "President Muhammadu Buhari, on Thursday, presided over the National Security Council meeting.\nThe meeting was held at the Council Chambers, State House, Abuja.\nBashir Ahmad, a former aide to Buhari, disclosed this in a tweet via his Twitter handle.\nHe tweeted: “Security briefing currently holding at the Aso Rock Presidential Villa, Abuja.”In attendance are Chief of Defense Staff, General Lucky Irabor; Chief of Army Staff, Lt. Gen Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Amao.\nOthers include the Inspector-General of Police, Alkali Usman; the Director-General of the Department of State Service, Yusuf Bichi; and the Director-General of the National Intelligence Agency, Ahmed Abubakar."
  },
  {
    "headline": "Shettima, Tinubu tried to divert attention from Muslim-Muslim discuss with clerics – Aisha Yesufu",
    "summarized_story": "Aisha Yesufu, a rights activist, has reacted to the alleged fake Bishops present at the unveiling of Kashim Shettima as the All Progressives Congress, APC, presidential candidate, Bola Tinubu’s running mate.\nYesufu alleged that Tinubu’s campaign team used the fake Bishops to divert discussions from the Muslim-Muslim ticket.\nIn a tweet, Yesufu wrote: “Dear Nigerians on social media So Tinubu campaign team gave you all an assignment yesterday by bringing “fake” bishops and directing your conversation away from the religious exclusion the Muslim-Muslim ticket is.\nConversion on Tinubu’s decision to settle for a Muslim-Muslim ticket has continued to heat Nigeria’s political atmosphere.\nNigerians had wanted Tinubu to pick a Christian as his running mate but he opted for Shettima, who is a Northern Muslim as his running mate."
  },
  {
    "headline": "Court grants order of mandamus against IGP over refusal to prosecute Tinubu on perjury",
    "summarized_story": "A Federal High Court in Abuja today has granted permission to a Civil Group, Incorporated Trustees of Center for Reform and Public Advocacy to apply for an order of mandamus that will compel the Inspector General of Police (IGP) to prosecute the presidential candidate of the All Progressives Congress (APC), Bola Tinubu, over alleged perjury.\nJustice Inyang Eden Ekwo granted the leave while delivering a ruling in an ex-parte application argued by the group through its lawyer, Mr Ugo Nwofor.\nThe ex-parte application was filed by the group following the alleged refusal of the Inspector General of Police, Mr. Usman Alkali Baba to effect the arrest and prosecution of the former Lagos State governor on supplying false information on oath in respect of his educational qualifications.\nJustice Ekwo in a brief ruling held that the ex-parte application was meritorious and subsequently granted it.\nThe Judge fixed November 1 for the hearing of the substantive suit."
  },
  {
    "headline": "Desperation raised to power 1000 – Dino Melaye mocks APC over alleged fake Bishops",
    "summarized_story": "Former Kogi West Senator, Dino Melaye has reacted to the attendance of some bishops at the unveiling of Kashim Shettima, the presidential running mate of Bola Tinubu of the All Progressives Congress, APC,Melaye said the presence of the alleged bishops at Shettima’s unveiling had exposed APC’s desperation.\nThe Christian Association of Nigeria (CAN), had criticised the APC, saying “artisans” were hired to act like clerics.\nReacting to the development, Melaye said Reverend Fathers don’t wear cassocks outside mass service.\nIn a tweet, Melaye wrote: “Reverend fathers do not wear cassocks outside mass service.\nDesperation raised to power 1000.”"
  },
  {
    "headline": "State Assembly raises alarm over mountains of refuse, waste in Calabar",
    "summarized_story": "The leadership of the Cross River State House of Assembly has decried the very poor level of Calabar metropolis over the mountains of waste across the city.\nThe lawmakers expressed worry that waste has a direct impact on the health of citizens and that the unhygienic state of Calabar was harmful and inimical to the health of citizens.\nIn the last five months, there has been a public outcry over the non-evacuation of refuse from the city.\nThey have also invited the Chairmen of Calabar Municipality and Calabar South LGA as well as contractors in charge of refuse disposal in the state capital.\n“The signature building is in a very terrible situation, the School is in a sordid state."
  },
  {
    "headline": "Most searched by Nigerians in first half of 2022 The Nation Newspaper",
    "summarized_story": "Most searched by Nigerians in first half of 2022The first half of 2022 has been eventful for Nigerians as politics, high profile deaths, sports personalities, blockbuster movies and TV series, Nollywood actors, musicians and songs that became very catchy trended on Google.\nThe top three trending people in Nigeria in the first half of the year are Peter Obi, Putin and Bianca Ojukwu.\nAFCON 2022 topped the list of most searched moments between January and June.\nThe death of another gospel singer, Chinedu Nwadike, was the second most searched death for Nigerians.\nBlood sisters, a Nigerian series on Netflx starring Nancy Isime and Ini Dima-Okojie topped the list of top trending movies and TV Series by Nigerians from January to June 2022."
  },
  {
    "headline": "BREAKING: Buhari presides over security meeting The Nation Newspaper",
    "summarized_story": "President Muhamadu Buhari is presiding over National Security Council Meeting in State House, Abuja.\nThe meeting, holding at the Council Chambers is attended by Secretary to the Government of the Federation; Boss Mustapha; the Chief of Staff to the President, Professor Ibrahim Gambari and the National Security Adviser (NSA), Major General Babagana Monguno (retd).\nChief of Defence Staff, General Lucky Irabor, Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance.\nAlso in attendance are the Inspector-General of Police, Alkali Baba Usman; the Director-General of the Department of State Service (DSS), Yusuf Bichi; and the Director-General of the National Intelligence Agency (NIA), Ahmed Rufai Abubakar.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Ekiti indigene emerges UTME best with 362 The Nation Newspaper",
    "summarized_story": "The Joint Admissions and Matriculation Board(JAMB) has announced that an indigene of Ekiti, Adebayo Eyimofe, scored the highest mark in the 2022 Unified Tertiary Matriculation Examination(UTME) with 362.\nAdebayo wrote the examination in one of the computer based test centres in Abuja.\nAccording to a presentation by Oloyede, Adebayo was closely followed by Ugwu Chikelu, an indigene of Enugu state with a score of 359.\nLike Adebayo, Ugwu also wrote the UTME in Abuja.\nOther high scorers include Igbalaye Ebunoluwa 357; Emmanuel Oluwanifemi 357; Ozumba Samuel 357; Olumide-Attah Ayomide 355; Lawal Olaoluwa 355; Dokun Jubril 354; Amaku Anthony 354 and Aghulor Divine 353."
  },
  {
    "headline": "BREAKING: Pandemonium as terrorists attack Niger communities The Nation Newspaper",
    "summarized_story": "Terrorists on Thursday morning invaded some communities after Kamapani Waya in Kontagora local government area of Niger State.\nThe Nation’s correspondent, who was on the way to Kontagora from Minna in a public transport, had to turn back after leaving Kampani Waya.\nThe driver was informed of the bandit activities by some vehicles who were warned by the villagers.\nThey had to return to Kampani Waya to stay there for about 40 minutes.\nBut military troops have been mobilised to the roadmOur correspondent saw some of the military troops some distance after the Kamapani Waya as they directed motorists."
  },
  {
    "headline": "BREAKING: Clerics at Shettima's unveiling not hired",
    "summarized_story": "The presidential candidate of the ruling All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu has stated the clerics at the unveiling of his running mate Senator Kashim Shettima were not fake.\nBut many faulted the presence of Christian clerics at the event, alleging they were hired and fake.\n“We want to say that those clergymen were not fake, not mechanics or yam sellers as the purveyors of hatred have made Nigerians believe in the social media.\n“We are well aware that the opposition parties and the sponsors of the social media charade are jittery and threatened by the intimidating political credentials of our candidates.\nThe only way they hope to shift the attention of public scrutiny away from their uninspiring candidates and credentials is to create social media distraction."
  },
  {
    "headline": "BREAKING: JAMB announces cut-off point for 2022 admissions",
    "summarized_story": "From Fred Ezeh, AbujaThe Joint Admission and Matriculation Board (JAMB) and relevant stakeholders have agreed on the minimum cut-off point for admission into tertiary institutions in Nigeria.\nIt was unanimously agreed at the 2022 Policy meeting that 140 will be the minimum cut-off point for admission into a university.\nThe cut-off point was the collective decision of all heads of tertiary institutions, private and public, taken at the 2022 Policy meeting chaired by the Minister of Education, Mallam Adamu Adamu, in Abuja.\nJAMB Registrar Prof Ishaq Oloyede explained that the aforementioned points are the minimum, but that does not mean that institutions must comply wholely to it.\n“Institutions have the liberty to determine their cut-off point but must not be below the cut-off agreed at the policy meeting,” he explained."
  },
  {
    "headline": "Just in: Senate adopts Kalu’s bill to establish Federal University in Abia",
    "summarized_story": "Kenneth Udeh from AbujaThe Senate on Wednesday accorded first reading to a bill seeking to establish a Federal University in Abia State.\nThe bill titled ;”A bill for an Act to provide for the establishment of Federal University of Medical sciences and Biomedical Technology, Umunna, Abia State and for Matters connected Therewith, 2022 .\n985), is sponsored by the Chief Whip of the Senate, Senator Orji Uzor Kalu.\nThe passage of the bill followed its presentation by the Deputy Leader of the Senate, Senator Ajayi Boroffice during plenary after it had resumed from the Sallah break.\nShortly after a short title of the bill was read to members of the Senate, the Senators in a voice vote presided by the President of the Senate, Senator Ahmad Lawan voted in favour of its passage."
  },
  {
    "headline": "Buhari presides over security meeting",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhamadu Buhari is currently presiding over National Security Council Meeting in State House, Abuja.\nThe meeting, holding at the Council Chambers is being attended by Secretary to the Government of the Federation; Boss Mustapha; the Chief of Staff to the President, Professor Ibrahim Gambari and the National Security Adviser (NSA), Major General Babagana Monguno (retd).\nChief of Defence Staff, General Lucky Irabor, Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance.\nAlso in attendance are the Inspector-General of Police, Alkali Baba Usman; the Director-General of the Department of State Service (DSS), Yusuf Bichi; and the Director-General of the National Intelligence Agency (NIA), Ahmed Rufai Abubakar.\nDetails later…"
  },
  {
    "headline": "Breaking: Tinubu denies hiring Christian clergymen for Shettima’s unveiling",
    "summarized_story": "Responding through a statement from his Campaign Organisation (TCO), he described, as unwarranted distractions, his linking with the viral pictures and videos of some Christian clergymen and women at the unveiling.\n“We want to say that those clergymen were not fake, not mechanics or yam sellers as the purveyors of hatred have made Nigerians to believe in the social media.\n“The orchestrated social media sensation over the presence of the men is needless and all calculated to detract from the huge success recorded at the momentous event on Wednesday.\n“We believe Nigerians are too wise and discerning to see through this shenanigans.\nThe only way they hope to shift attention of public scrutiny away from their uninspiring candidates and credentials is to create social media distraction."
  },
  {
    "headline": "Tinubu Campaign Organisation clears the air on clergymen at Shettima’s unveiling",
    "summarized_story": "The Tinubu Campaign Organisation has described as unwarranted distractions the viral pictures and videos of some Christian clergy at Wednesday’s unveiling of Sen. Kashim Shettima,All Progressives Congress (APC) Vice-Presidential candidate in Abuja.\nMr Bayo Onanuga, Director, Media and Communication, Tinubu Campaign Organisation in a statement on Thursday, said the clergymen were not fake as was being speculated in the social media.\n“We therefore deplore the hysterical twisting of the presence of these men and women in cassocks and the false accusation against our candidates, Asiwaju Bola Ahmed Tinubu and Sen. Shettima,” Onanuga said.\n“We are well aware that the opposition parties and the sponsors of the social media charade are jittery and threatened by the intimidating political credentials of our candidates.\n“The only way they hope to shift attention of public scrutiny away from their uninspiring candidates and credentials is to create social media distraction."
  },
  {
    "headline": "FLASHBACK: In 2014, Buhari Knocked Then-President Jonathan, Said A Serious Government Would Negotiate With Striking University Lecturers, ASUU",
    "summarized_story": "In 2014, Muhammadu Buhari, as a member of the opposition criticised the then President, Goodluck Jonathan ‪over a strike action embarked upon by the Academic Staff Union of Universities (ASUU).\nThe ongoing strike action by the university lecturers’ union is in its fifth month.\nOn Tuesday, Adamu Adamu, Minister of Education, was granted approval by President Buhari to resolve issues of contention regarding the ASUU strike.\n“If you could recall, at the time the government said it was voting N7 billion for the conference, ASUU was on strike.\nAnd teachers of other tertiary institutions, like the polytechnics, were on strike,” Buhari had said."
  },
  {
    "headline": "FLASHBACK: In 2014, Buhari Knocked Then-President Jonathan, Said A Serious Government Would Negotiate With Striking University Lecturers, ASUU",
    "summarized_story": "In 2014, Muhammadu Buhari, as a member of the opposition criticised the then President, Goodluck Jonathan ‪over a strike action embarked upon by the Academic Staff Union of Universities (ASUU).\nThe ongoing strike action by the university lecturers’ union is in its fifth month.\nOn Tuesday, Adamu Adamu, Minister of Education, was granted approval by President Buhari to resolve issues of contention regarding the ASUU strike.\n“If you could recall, at the time the government said it was voting N7 billion for the conference, ASUU was on strike.\nAnd teachers of other tertiary institutions, like the polytechnics, were on strike,” Buhari had said."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Camp Hires ‘Unknown Bishops’ To Venue Of Unveiling of Kashim Shettima As Running Mate",
    "summarized_story": "Following the criticisms that trailed the Muslim/Muslim ticket of the Presidential Candidate of All Progressives Congress (APC), Bola Tinubu, the APC leader’s camp has gone to hire some Christians bishops to attend the formal unveiling of his Vice Presidential candidate, Senator Kashim Shettima.\nThe bishops who were in their robes were sighted at the event which is currently taking place at Shehu Musa Yar,adu Centre Abuja.\nThe incident that caused stir at the entrance of the event as crowd taunted them and shouted \"The bishops are here.\"\nRecall that many Nigerians have continued to express disappointment in the choice of a Muslim-Muslim pairing ticket by the APC flag bearer for the 2023 general elections.\nThey described the action as an attempt to trample on the religious rights of Nigerians."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Camp Hires ‘Unknown Bishops’ To Venue Of Unveiling of Kashim Shettima As Running Mate",
    "summarized_story": "Following the criticisms that trailed the Muslim/Muslim ticket of the Presidential Candidate of All Progressives Congress (APC), Bola Tinubu, the APC leader’s camp has gone to hire some Christians bishops to attend the formal unveiling of his Vice Presidential candidate, Senator Kashim Shettima.\nThe bishops who were in their robes were sighted at the event which is currently taking place at Shehu Musa Yar,adu Centre Abuja.\nThe incident that caused stir at the entrance of the event as crowd taunted them and shouted \"The bishops are here.\"\nRecall that many Nigerians have continued to express disappointment in the choice of a Muslim-Muslim pairing ticket by the APC flag bearer for the 2023 general elections.\nThey described the action as an attempt to trample on the religious rights of Nigerians."
  },
  {
    "headline": "Muslim-Muslim Ticket: Tinubu Camp Hires ‘Unknown Bishops’ To Venue Of Unveiling of Kashim Shettima As Running Mate",
    "summarized_story": "Following the criticisms that trailed the Muslim/Muslim ticket of the Presidential Candidate of All Progressives Congress (APC), Bola Tinubu, the APC leader’s camp has gone to hire some Christians bishops to attend the formal unveiling of his Vice Presidential candidate, Senator Kashim Shettima.\nThe bishops who were in their robes were sighted at the event which is currently taking place at Shehu Musa Yar,adu Centre Abuja.\nThe incident that caused stir at the entrance of the event as crowd taunted them and shouted \"The bishops are here.\"\nRecall that many Nigerians have continued to express disappointment in the choice of a Muslim-Muslim pairing ticket by the APC flag bearer for the 2023 general elections.\nThey described the action as an attempt to trample on the religious rights of Nigerians."
  },
  {
    "headline": "Ekiti indigene tops 2022 UTME with 362",
    "summarized_story": "Adebayo Eyimofe, an indigene of Ekiti, has emerged as the student with the highest mark in the 2022 Unified Tertiary Matriculation Examination (UTME).\nAdvertisementThe Joint Admissions and Matriculation Board (JAMB) broke the news during its 2022 policy meeting in Abuja on Thursday.\nAccording to Ishaq Oloyede, JAMB registrar, Eyimofe, who wrote his examination in Abuja, scored 362.\nOloyede also announced that the board would allow candidates with awaiting results to register for the 2022 UTME.\n“JAMB allowed awaiting results candidates to register and sit for the 2022 UTME."
  },
  {
    "headline": "WhatsApp launches chat migration from Android to iOS",
    "summarized_story": "WhatsApp has created a new way to transfer your entire chat history from Android to iOS and vice versa.\nAdvertisementIn a new FAQ released via its website, the instant messaging platform gave a detailed list of steps to migrate chat history across both Android and iOS devices.\nA new way to keep the chats that mean the most 📱📲 Today, you’ll have the ability to transfer your entire chat history from Android to iOS and vice versa.\n— WhatsApp (@WhatsApp) July 20, 2022 AdvertisementIf you’re moving from an Android phone to an iPhone, you can transfer your account information, profile photo, individual chats, group chats, chat history, media, and settings.\nTap START on your Android phone, and wait for WhatsApp to prepare the data for export."
  },
  {
    "headline": "PHOTOS: Sanusi’s son graduates from UK varsity",
    "summarized_story": "Mustapha Lamido, son of Muhammad Sanusi II, the former emir of Kano, has graduated from the University of Portsmouth in the United Kingdom (UK).\nAdvertisementMustapha is said to have graduated on Tuesday with a first-class honours degree in Economics from the institution.\nIn now-viral photos from the event, Sanusi, who was once the governor of the Central Bank of Nigeria (CBN), is seen with his wives and family members.\nThe development stretches the list of children of prominent Nigerians that have graduated from foreign varsities in recent times.\nThe union has been on strike since February 14 over the government’s alleged failure to meet its demands."
  },
  {
    "headline": "VIDEO: Ogun school whose students wrote exam on floor gets furniture",
    "summarized_story": "Students of the St. Kizito High School, Iwopin in Waterside, Ogun state have received furniture from the state government.\nAdvertisementEarlier, photos went viral showing students of the school writing their exams on the bare floor.\nBut in a series of footage surfacing on social media platforms on Tuesday, the school is seen receiving furniture in batches.\nAdvertisementThe furniture is courtesy of Dapo Abiodun, governor of the Ogun state.\nSpeaking on the development, an aide to the governor tweeted: “I’d like to inform everyone that students of St. Kizito High School, Iwopin, Ogun Waterside, Ogun State will no longer write their promotion exams sitting on the bare floor."
  },
  {
    "headline": "Efe: I didn’t squander my BBNaija prize money",
    "summarized_story": "Efe Ejeba has addressed rumours that he squandered the prize money of his 2017 BBNaija run.\nAdvertisementThe reality TV star won the Big Brother Naija season 2 which was held in 2017.\nAdvertisementThere were also rumours that Efe squandered his prize money on frivolities.\n“Efe didn’t squander the money,” the reality TV star said, speaking of himself in the third person.\nAdvertisementEfe addressed claims that he’s not on good terms with organisers of BBNaija, given his absence from the show’s activities."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "Hannah Subayi believes the gap between Anglophone and Francophone African startups is reducing",
    "summarized_story": "As you know anglophone Africa tends to be a bit more advanced than Arab-speaking and francophone Africa.\nHowever, we cannot deny that the operational environment remains a bit tougher to some extent in francophone Africa.\nWe see more anglophone African investors trying to invest in francophone Africa.\nHS: Historically, francophone Africa, just by virtue of the language, mainly only looked to France for funding and expansion.\nIf you look at francophone African startups, they are incorporated in Paris but that’s not any different from other startups that are incorporated in Delaware."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Inside Kenya's messy money laundering spat with Nigerian fintechs",
    "summarized_story": "A major similarity between both shows is the theme of money laundering.\nIt also stated that both companies were linked to Flutterwave and the related companies it accused of money laundering.\nWhile financial services institutions have strict regulations, money laundering still drains an average of $1.6 trillion annually from the global economy.\nKenya’s Proceeds of Crime and Anti-Money Laundering Act (POCAMLA) 2009 contains comprehensive guidelines for guarding against money laundering processes and other significant financial crimes.\nHowever, the current investigation on money laundering is not solely targeted at Nigerian companies."
  },
  {
    "headline": "Nigerian fintechs grapple with KYC amid rapid growth",
    "summarized_story": "Experts say that henceforth many startups will be compelled to focus on strengthening lax Know-Your-Customer (KYC) and anti-money laundering (AML) practices.\nOther experts say anti-money laundering issues arise when tech startups try to outsmart the regulator.\nThe country, in September 2021, gazetted the Proceeds of Crime and Anti-money Laundering Bill, which seeks to amend the current Proceeds of Crime and Anti-money Laundering Act, 2009.\n“Despite the strides achieved by Nigerian fintech firms, you can hardly get public data on their activities from the CBN or NIBSS.\nThe allegation against the affected firms is not unique to Nigerian fintech, and dare I say, not borne out of envy,” the expert said."
  },
  {
    "headline": "Nigerian fintechs grapple with KYC amid rapid growth",
    "summarized_story": "Experts say that henceforth many startups will be compelled to focus on strengthening lax Know-Your-Customer (KYC) and anti-money laundering (AML) practices.\nOther experts say anti-money laundering issues arise when tech startups try to outsmart the regulator.\nThe country, in September 2021, gazetted the Proceeds of Crime and Anti-money Laundering Bill, which seeks to amend the current Proceeds of Crime and Anti-money Laundering Act, 2009.\n“Despite the strides achieved by Nigerian fintech firms, you can hardly get public data on their activities from the CBN or NIBSS.\nThe allegation against the affected firms is not unique to Nigerian fintech, and dare I say, not borne out of envy,” the expert said."
  },
  {
    "headline": "Senate passes Nigeria Start-up Bill – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Senate has passed the Nigerian Start-up Bill, 2022.\nThe bill was sponsored by the Deputy Senate Leader, Ajayi Boroffice (APC – Ondo).\nThe bill after consideration, was referred by the Senate President, Ahmad Lawan, to the Committee on Trade and Investment for further legislative inputs.\nThe bill, sponsored by Sen. Hassan Ibrahim Hadejia (APC –Jigawa), was referred to the Committee on Health (Secondary and Tertiary) for further legislative inputs.\nThe Committee which has Sen.Yahaya Oloriegbe as Chairman was given four weeks to send its report back to senate."
  },
  {
    "headline": "FG mulls world-class military hospital – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Permanent Secretary, Ministry of Defence, Dr Abubakar Kana, says the Federal Government has mapped up strategies and modalities to build a world-class Military Hospital to cater for the military personnel, veterans and their families.\nKana, in a statement on Wednesday said that part of steps taken to achieve the plans was the move to reform the military health services in Nigeria.\nHe said the ministry had also put together a workshop for all stakeholders to discuss the roadmap toward achieving the anticipated reformation.\nAccording to him, the workshop which is billed to hold in Abuja on Thursday, will be chaired by the Minister of Defence, retired Maj.-Gen. Bashir Magashi.\n“The Chief of Defence Staff and Service Chiefs, as well as the US Ambassador to Nigeria and strategic health partners will be in attendance,” he said."
  },
  {
    "headline": "Court fixes Oct. 6 for report in suit against Anambra varsity professor, 4 others – Nigerian Observer",
    "summarized_story": "The the Federal Republic of Nigeria, through the Inspector-General of Police, was the earlier complainant before the AGF took over the suit.\nJustice Ekwo then fixed July 20, to enable the AGF chamber review the suit and report back to the court.\nHowever, the senior lawyer said he had a preliminary objection challenging the jurisdiction of the court on the matter.\nThe judge consequently adjourned the matter until Oct. 6 for report.\nObikeze, who works with the Chukwuemeka Odumegwu Ojukwu University, formerly known as Anambra State University Igbariam in Anambra, was arraigned on Feb. 22 alongside others on 11 counts."
  },
  {
    "headline": "Governor Oyetola’s defeat is a blessing to Osun – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe defeat of Governor Oyetola in Osun 2022 election is a big blessing to APC as well as a wakeup call to all those concerned.\nIt was an embarrassment to Osun electorates for Governor Oyetola to blame Aregbesola for abandoning governance and developmental projects in Osun State.\nThe defeat of Oyetola will reposition Osun APC to win future elections.\nThe result of the election showed that God has answered the prayer of most people in Osun State for power to shift to Osun West senatorial zone.\nGovernor Oyetola abandoned the Cocoa Products Industry Nigeria Limited in Ede, the first company to produce chocolate in Nigeria (SKYRUN COCOA FACTORY) has suspended its operations."
  },
  {
    "headline": "UTME 2022: Only 378,639 out of 1.76m scored above 200 –JAMB",
    "summarized_story": "The Joint Admissions and Matriculation Board has disclosed that only 378,639 of the 1,761,338 who wrote the 2022 Unified Tertiary Matriculation Examinations (UTME) scored 200 and above.\nThe JAMB boss had disclosed that an Ekiti indigene attained the highest score during the 2022 UTME examinations conducted by the board.\nWhile giving further statistics of the 2022 examination, Oloyede noted that 378,639 scored above 200; a total of 520,596 candidates scored 190 and above ; 704,991 scored 180 and above; 934,103 scored 170 and above; 1,192, 057 scored 160 and above.\nSpeaking further, Oloyede noted that the board allowed candidates with awaiting results to register for the 2022 UTME.\n“JAMB allowed awaiting results candidates to register and sit for the 2022 UTME."
  },
  {
    "headline": "Danbatta Elected into Council of Nigerian Academy of Engineering",
    "summarized_story": "The Executive Vice Chairman and Chief Executive Officer (EVC/CEO) of the Nigerian Communications Commission (NCC), Prof. Umar Danbatta, has been elected into the Governing Council of the Nigerian Academy of Engineering (NAE), a step which signposts his outstanding role in the development of engineering profession in the country.\nThe Council of NAE is the highest decision-making body of the Academy.\nThe Council oversees the country’s highest professional bodies in science, technology and engineering.\n“The Council can count on my intellectual and moral support towards the achievement of the overall objectives of the Academy,” Danbatta said.\nDanbatta has severally played similar roles in the past, including his two terms as a Member of the Council for the Regulation of Engineering in Nigeria (COREN)."
  },
  {
    "headline": "Access Bank unveils ‘AccessMore’ mega rewards",
    "summarized_story": "Adebayo ObajemuAccess Bank said it will be rewarding customers this summer with millions of naira, smart phones and other amazing prizes in the AccessMore mega rewardsThe campaign, which was unveiled last month, will run till the end of next month and is open to customers and non-customers of the bank.\nSteps to take to enjoy rewards on the app:Download the AccessMore app, register (signup) and opt into Access Rewards and Referrals on the app to get a 100points.\nOnce you onboard 20 – 30 new people onto the AccessMore app, you get 2000 – 3000 points respectively and this qualifies you for a chance to win cash prizes of up to N1 million.\nCustomers can also stand a chance to win iPhone 13 phones, and other cash prizes of N100,000 and N50,000 and other amazing rewards.\nThe highlight is that the more you transact the more points you earn."
  },
  {
    "headline": "Senate passes bill to allow states, individuals supply grid electricity",
    "summarized_story": "The senate on Wednesday passed the Electricity Bill 2022, which allows states and individuals to generate and distribute electricity.\nIf you decide to generate one megawatt of power using solar as an energy source, that is also provided for.\nThe space is now open; there is little restriction as to who can generate power and distribute.\nLawan, after the passage of the bill, assured of a quick passage by the House of Representatives followed by assent by President Muhammadu Buhari.\nHe said, “We believe that this piece of legislation can change the fortunes of the electricity industry in Nigeria for the better.”"
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "2022 Hajj: 541 Kwara Pilgrims Return From Saudi Arabia",
    "summarized_story": "A total of 541 pilgrims from Kwara State, who took part in this year’s Hajj exercise in Saudi Arabia, have returned to Nigeria on Thursday.\nThe pilgrims, who boarded a Max Airline 5N-ADM flight, arrived at the Ilorin International Airport at 7:59am.\nThey thanked God for ensuring their safe return to Nigeria.\nTwo female pilgrims, Alhaja Mariam Imam Olesin and Alhaja Titilayo Hassan Kuranga, thanked God for a successful pilgrimage in the holy land.\nHe, however, enjoined the State Pilgrims Welfare Board to improve more on the welfare of the pilgrims in the subsequent hajj operations."
  },
  {
    "headline": "2022 Hajj: 541 Kwara Pilgrims Return From Saudi Arabia",
    "summarized_story": "A total of 541 pilgrims from Kwara State, who took part in this year’s Hajj exercise in Saudi Arabia, have returned to Nigeria on Thursday.\nThe pilgrims, who boarded a Max Airline 5N-ADM flight, arrived at the Ilorin International Airport at 7:59am.\nThey thanked God for ensuring their safe return to Nigeria.\nTwo female pilgrims, Alhaja Mariam Imam Olesin and Alhaja Titilayo Hassan Kuranga, thanked God for a successful pilgrimage in the holy land.\nHe, however, enjoined the State Pilgrims Welfare Board to improve more on the welfare of the pilgrims in the subsequent hajj operations."
  },
  {
    "headline": "Akala Farm’s Supervisor Regains Freedom From Kidnappers After N5m Ransom",
    "summarized_story": "The supervisor at the late former Governor Christopher Adebayo Alao-Akala’s farm, Christopher Bakare, who was kidnapped last Saturday evening on the farm at Jabata, Surulere local government area of Oyo State, has regained his freedom.\nA family source disclosed that he was released on Wednesday after a payment of N5million ransom.\nHis kidnappers initially demanded N100million but after four days of negotiations agreed to N5million.\nBut they eventually took N5million,” the source said.\nThe ransom was reportedly taken to a forest in Otte area, at the boundary between Oyo and Kwara States along the old Ogbomoso-Ilorin Road."
  },
  {
    "headline": "Akala Farm’s Supervisor Regains Freedom From Kidnappers After N5m Ransom",
    "summarized_story": "The supervisor at the late former Governor Christopher Adebayo Alao-Akala’s farm, Christopher Bakare, who was kidnapped last Saturday evening on the farm at Jabata, Surulere local government area of Oyo State, has regained his freedom.\nA family source disclosed that he was released on Wednesday after a payment of N5million ransom.\nHis kidnappers initially demanded N100million but after four days of negotiations agreed to N5million.\nBut they eventually took N5million,” the source said.\nThe ransom was reportedly taken to a forest in Otte area, at the boundary between Oyo and Kwara States along the old Ogbomoso-Ilorin Road."
  },
  {
    "headline": "ICT, Climate-smart Agriculture Top Agenda Ahead Of Diaspora Day",
    "summarized_story": "The NiDCOM boss gave this assurance while fielding questions from journalists at a press conference in Abuja on Wednesday ahead this year’s National Diaspora Day Celebration scheduled for Monday, July 25, 2022 in the nation’s capital Abuja.\nAccording to the former lawmaker, the National Diaspora Day Celebration with the theme: “Diaspora Engagement in Global Challenging Times for National Development,” will also present opportunities for Nigerians in Diaspora who have skills in climate-smart agriculture to help Nigerian farmers mitigate the impacts of climate change to improve food production in the country.\nDabiri-Erewa pushed futher for more campaigns to get Diaspora voting through in Nigeria as several African countries have successfully engaged in Diaspora voting.\nThe 2022 National Diaspora Day will be a hybrid event that looks at celebrating Nigerians in the Diaspora, networking and facilitating engagement between the Diaspora and public office, government, private and corporate organisations, as well as, other major stakeholders.\nEach year, the National Diaspora Day is celebrated by Nigerians globally on July 25."
  },
  {
    "headline": "BREAKING: Governor Ortom, Wike, Others Take Decision On Defection",
    "summarized_story": "Governor Wike is not pleased with the decision of the PDP presidential candidate, Atiku Abubakar to pick the Governor of Delta State, Ifeanyi Okowa as his running mate.\nOrtom, who had condemned Atiku for ignoring Wike, said he and his aggrieved colleagues have agreed to remain in PDP.\nHe, however, called on Atiku to reach out to Governor Wike for reconciliation.\nThe Benue State Governor stated that it is not too late to resolve the crisis in the PDP.\nHe said during the meeting they agreed that Governor Wike needs to be pacified."
  },
  {
    "headline": "BREAKING: Buhari presides over security meeting",
    "summarized_story": "In State House, Abuja, President Muhammadu Buhari is presiding over the National Security Council meeting.\nBoss Mustapha, the Secretary to the Government of the Federation, Professor Ibrahim Gambari, the President’s Chief of Staff, and Major General Babagana Monguno, the National Security Advisor (NSA), are present at the meeting, which is taking place in the Council Chambers (retd).\nGeneral Lucky Irabor, Chief of Defence Staff, Lieutenant General Farouk Yahaya, Chief of Army Staff, Chief of Naval Staff, Vice Admiral Awwal Gambo, and Air Marshal Isiaka Oladayo Amao are also present."
  },
  {
    "headline": "I Never Supported Tinubu To Be His Running Mate — Shettima",
    "summarized_story": "I Never Supported Tinubu To Be His Running Mate — ShettimaAll Progressives Congress (APC) vice-presidential candidate Kashim Shettima has testified that he first opposed to Bola Tinubu’s choice of him as his running mate.\n“Asiwaju Bola Tinubu believes in the Nigerian project, and I swear in the name of God that I never supported Asiwaju to be his running mate,” Mr Shettima said.\n“I don’t intend to be vice-president to represent members of the Muslim community, no, the Sultan of Sokoto is capable of doing that.\n“In the coming week and months,we have to go into the trenches, go into the nooks and crannies to sing songs of unity, peace, prosperity and stability.\n“Let us unite this country and make her the pride of the black man, ” said Mr Shettima, a former two-term governor of Borno."
  },
  {
    "headline": "BREAKING: Buhari meets Shettima after unveiling",
    "summarized_story": "President Muhammadu Buhari has received All Progressives Congress (APC) presidential running mate Senator Kashim Shettima, almost immediately after he was unveiled on Wednesday.\nShettima was accompanied on the visit by Borno Governor Babagana Zulum.\nThe duo arrived the forecourt of President Buhari’s office at 3:40 pm.\nDetails of the meeting with President Buhari were unavailable as of the time of filing this report.\nDetails Shortly…"
  },
  {
    "headline": "[Breaking] 2022/23 academic session: JAMB approves cut-off marks for universities, polytechnics",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has approved cut-off marks for universities and polytechnics in the country for 2022/2023 academic session.\nThe decision was taken after a heated session on Thursday, comprising officials from JAMB, the Ministry of Education, the National Universities Commission, and the National Board for Technical Education among others.\nFor the polytechnics, 120 cut-off mark was approved while 140 was approved for universities.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Presidency: 2023 a must win election – Tinubu",
    "summarized_story": "The Christian body Tuesday issued an official statement to reject any political party that settled for a Muslim-Muslim ticket.\nSpeaking newsmen, one of the clerics who identified himself as Bishop Oguba said he was not aware CAN had taken any position on the Muslim-Muslim ticket.\nAs far as I am concerned, the body of Christ is not a political party.\n“The clergies should be concerned about the security of the country not the same faith ticket by any political party.\nThe party must not be perceived as promoting a religious agenda by fielding a Muslim-Muslim ticket."
  },
  {
    "headline": "ASUU: NLC’s planned solidarity protest illegal, invitation to anarchy – FG",
    "summarized_story": "The federal government Wednesday said the planned street protest by the Nigeria Labour Congress (NLC) in solidarity with the striking members of the Academic Staff Union of Universities (ASUU) is illegal.\nThe NLC can go on strike or protest if the rights of NLC members are involved.\nWell yes, there’s a dispute between some members of NLC, ASUU and the federal government which is being looked into.\nSo, calling out people on street protest you begin to wonder, what is the motive of NLC in this matter?\n“They are parts of the tripartite agreement that have been negotiating with federal government on this ASUU issue."
  },
  {
    "headline": "Bayelsa Govt Clears Air On State Of Its Airport",
    "summarized_story": "… Says Bayelsa Airport Is Not DowngradedBy Eunice Nnachi, YenagoaThe Bayelsa State Government has made a clarification that the state-owned international airport had not been downgraded, as being insinuated in some quarters.\nThe Deputy Governor, Senator Lawrence Ewhrudjakpo, gave the clarification on Wednesday when the Federated Correspondents Chapel of the Nigeria Union of Journalists, Bayelsa State Council, paid him a courtesy call in Government House, Yenagoa.\nAccording to the Deputy Governor, the D-Check is a major maintenance check to determine the air-worthiness of an aircraft after it had made commercial flights for a period of 10 years.\nI know that you are going to ask us what is happening to the Bayelsa International Airport.\nThe Bayelsa Airport has not been downgraded."
  },
  {
    "headline": "IYC leadership enroll 301 youths in ICT scheme",
    "summarized_story": "By Eunice Nnachi, YenagoaThe Ijaw Youths worldwide, the Ijaw Youths Council (IYC) on Tuesday marked its second year in office, with the enrollment of 301 youths from ijaw communities into Information and communications technology (ICT) scheme.\nThe First batch of benefiting 60 youths are expected to be trained in Computer programming, coding and appreciation and handed starter packs at the end of the training scheme.\nIn his speech, the initiator of the ICT Scheme and National Spokesman of the Ijaw Youths Council (IYC), Comrade Ebilade Ekerefe, said the scheme was initiated to change the narrative of the ijaw youths worldwide rather than adopting repeated combatant approach which has yielded less results.\nYou know a lot of people misunderstand the Ijaw youths Council.\nThe Ijaw youths Council itself was founded to propel economic development of the Ijaw nation, which meant that we need to educate our people”."
  },
  {
    "headline": "NDDC launches talent hunt in Niger Delta to address youth unemployment",
    "summarized_story": "By Eunice Nnachi, YenagoaThe Niger Delta Development Commission, (NDDC) has launched a novel Niger Delta Talent Hunt (NIDETH) to harness creativity among youths in the entertainment industry and address unemployment in the Niger Delta region.\nDr. Akwa commended President Muhammadu Buhari and the Minister of Niger Delta Affairs, Mr. Umana Okon Umana, for supporting activities aimed at harnessing the creative potential of youths in the Niger Delta.\nUdengs Eradiri, described the Niger Delta youths as enterprising, observing that artistes from the region had challenges of getting support and platforms to express themselves.\n“The Niger Delta youths need to be a part of these opportunities.\nHe said that 80 per cent of the entertainment industry was rooted in the Niger Delta."
  },
  {
    "headline": "FG approves N7.5bn for irrigation, airports surveillance equipment",
    "summarized_story": "By Mathew Dadiya, AbujaThe Federal Executive Council (FEC), on Wednesday, approved contracts worth N7,499,603,500 for an irrigation project augmentation in Adamawa State and surveillance equipment for two airports in the country.\nAddressing correspondents, at the post-FEC briefing Minister of Aviation, Senator Hadi Sirika, disclosed that Council approved contracts worth N1,499,603,500 for the award of contract for surveillance equipment for two airports in the country.\nThe benefiting airports, according to the minister, are those of Kaduna and Port Harcourt in Kaduna and Rivers States.\nSirika also disclosed that the council approved that Nigeria enters into a Bilateral Air Service Agreement (BASA) with Canada.\nAlso, the Minister of Water Resources, Sulieman Adamu, said that Council approved the augmentation of N6 billion for the Chochi irrigation project in Adamawa State."
  },
  {
    "headline": "Airline Operators Condemn Closure of Lagos Airport Runway",
    "summarized_story": "By Naomi Douglas…Call for solution to JetA1, forex scarcity to avoid shutdownAirline Operators of Nigeria AON, has lamented the closure of Runway by Federal Airports Authority of Nigeria FAAN, for 90 days.\nIn a statement signed on Wednesday by AON spokesperson, Professor Obiora Okonkwo said the action will further worsen the crisis facing Nigeria’s aviation industry.\nOkonkwo urged federal government to quickly provide solutions to aviation fuel, foreign exchange scarcity to avoid total shutdown, collapse of the sector.\n“The closure of the main domestic runway of MMA automatically adds an additional 10-15% more fuel costs per sector into and out of the domestic airport in Lagos, based on theadditional flight and taxi time incurred as a result.\nThe airlines have already felt these additional costs within the first week of the closure of the runway."
  },
  {
    "headline": "TCN Restores National Power Grid After System Disturbance, Blames Drop In Frequency",
    "summarized_story": "The Transmission Company of Nigeria (TCN) says the restoration of the national grid has been completed following its collapse on Wednesday.\nTCN in a statement by its General Manager, Ndidi Mbah, said the national grid experienced system disturbance at about 11.27am on Wednesday, 20th, July 2022, adding that the incident was a result of sudden drop in system frequency from 49.94Hz to 47.36Hz, which created system instability.\nREAD ALSO: National Grid: This Is One Collapse Too Many – AtikuMs Mbah said this unwholesome event, which pulled out other grid-connected Units in the plant, resulted in aggregated generation loss of 457MW.\nIn its wake, a train of events ensued – culminating in the collapse of the national grid.\nShe further noted that “as obtainable in all systems, when a component of the electric power system is defective, the entire configuration is vitiated."
  },
  {
    "headline": "Indefinite Suspension: We’ll Come Back Stronger, Says Dana Air",
    "summarized_story": "Dana Airlines has affirmed that its Air Transport Licence (ATL) and Air Operator Certificate (AOC) have been suspended indefinitely, however, the commercial airline says it will come back from the suspension stronger.\nIn a statement on Wednesday, Dana Airlines said it was suspended for an operational Audit which as advised by the Nigerian Civil Aviation Authority (NCAA), takes effect from midnight 20th July, 2022.\nREAD ALSO: NCAA Suspends Dana Air Operations IndefinitelyThe commercial airline in its communique said it “understand the impact this suspension will have on our partners, staff, passengers and the general public but we are very confident that we would come out stronger as we have done in the past”.\nDana further assured the NCAA that it is fully ready and committed to cooperating with the aviation authority in the course of the audit.\n“We crave the understanding and patience of our customers, travel and business partners and sincerely apologize for any inconvenience our short absence from the market might cause,” Dana Airlines entreated."
  },
  {
    "headline": "National Grid: This Is One Collapse Too Many – Atiku",
    "summarized_story": "Presidential candidate of the Peoples Democratic Party (PDP) in the 2023 general elections, Atiku Abubakar, said on Wednesday that the recent total National Grid Collapse is too much for the Nigerian people to bear.\nAtiku while stressing that the grid collapse on Wednesday is the 6th time it has happened in 2022, proposed an advanced strategy for funding infrastructure which will lead to creating a conducive environment for investors to come in and stabilise the power sector.\n“I’ll promote the incentivisation, with tax breaks, a consortium of private sector institutions to establish an Infrastructure Debt Fund (IDF) to primarily mobilise domestic and international private resources for the financing and delivery of large infrastructure projects across all the sectors of the economy.\n“The IDF will have an initial investment capacity of approximately US$20 billion,” Atiku promised.\nAdditionally, the PDP Presidential candidate said he will cause the creation of an Infrastructure Development Credit Guarantee Agency to complement the operation of the IDF by de-risking investments in infrastructure to build investor confidence in taking risks and investing capital."
  },
  {
    "headline": "Slain Kaduna Priest: Security Chiefs Won’t Rest Until Nigeria Is Safe – Buhari",
    "summarized_story": "President Muhammadu Buhari has condemned the murder of a Catholic priest, Reverend Father John Cheitnum of the Kafanchan Catholic Diocese, four days after he was seized by gunmen in Kaduna State.\n[READ ALSO] Abducted Kaduna Priests: One Killed, One FreedAmong several of such attacks was the abduction of Reverend Father John Cheitnum and Reverend Father Donatus Cleopas last Friday in Jere Local Government Area (LGA) of Kaduna State.\nTheir abduction came barely two weeks after another priest, Reverend Father Emmanuel Silas, was kidnapped by bandits from the parish rectory of Saint Charles Catholic Church, Zamina in Kauru LGA.\nReverend Father Cleopas, on his part, was said to have been released by the bandits after an undisclosed amount of money was paid to them as ransom.\n“I’m not allowing the security chiefs to rest unless and until we find a very effective solution to this disturbing security situation."
  },
  {
    "headline": "Clergymen At Shettima’s Unveiling Were Not Fake – Tinubu",
    "summarized_story": "The presidential flagbearer of the All Progressives Congress, Bola Ahmed Tinubu, has countered accusations by critics who claimed his campaign team hired thugs to pose as Christian clergy at Wednesday’s unveiling of the party’s vice presidential candidate, Kashim Shettima.\nThe APC had unveiled former Borno State Governor, Senator Shettima as its vice presidential candidate for the 2023 general elections.\nHowever, viral pictures and videos of the event accused Tinubu of hiring urchins to dress Christain clerics.\n“We want to say that those clergymen were not fake, not mechanics or yam sellers as the purveyors of hatred have made Nigerians believe in the social media.\nThe only way they hope to shift the attention of public scrutiny away from their uninspiring candidates and credentials is to create social media distraction."
  },
  {
    "headline": "𝗔𝗸𝗶𝗻𝗹𝗮𝗱𝗲, 𝗖𝗵𝗶𝗲𝗳 𝗗𝗮𝗱𝗮 𝗺𝗲𝗲𝘁 𝗢𝗴𝘂𝗻 𝗪𝗲𝘀𝘁 𝗣𝗗𝗣 l𝗲𝗮𝗱𝗲𝗿𝘀",
    "summarized_story": "The Deputy Governorship Candidate of the People’s Democratic Party, Adekunle Akinlade on Tuesday met with the leadership of the party in Ogun West, at the private residence of Chief Alani Akinde, in Ota.\nThis is in line with the spirited campaign for the restoration of a people-centered government and adequate security in Ogun State."
  },
  {
    "headline": "APC to unveil Shettima as Tinubu's running mate on Wednesday -",
    "summarized_story": "The All Progressives Congress (APC) will formally unveil its Vice Presidential Candidate, Senator Kashim Shettima, to the Nigerian public on Wednesday, 20th July.\nThe event which will start at 11am prompt will hold at the Shehu Musa Yar’Adua Centre, Abuja.\nAdvertisementIn a statement signed by the party’s Organising secretary, Sulaiman Muhammad Argungu, all members of the National Executive Committee (NEC), members of the Progressives Governors’ Forum, members of APC Caucus in the National Assembly, members of the Federal Executive Council (FEC) are to attend.\nOther are members of the Diplomatic Corps, Presidential Aspirants at the June 2022 Special National Convention, APC State Chairmen, APC State Secretaries and APC State Organising Secretaries.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Oyebanji seeks Ekiti stakeholders' cooperation as he begins thank you tour of LGAs -",
    "summarized_story": "Ekiti State Governor-elect, Biodun Abayomi Oyebanji, has said he would run an inclusive government and give equal opportunity to all Ekiti indigenes, regardless of political leanings and background.\nOyebanji stated this on Monday during his ‘thank you tour’ in Ikole, Oye and Ilejemeje local government areas, where he met traditional rulers, party leaders and other stakeholders and shared some of his plans and programmes for the state.\nIn particular, I appreciate our traditional rulers for their support and prayers.\nAdvertisementAdvertisement“To our party members and other people of Ekiti State, I thank you because you are truthful to yourselves, God and the generation yet unborn.\nThe Governor-elect called on party members to be magnanimous in victory by reaching out to aggrieved members and intending members and integrating them into the progressive fold."
  },
  {
    "headline": "Ekiti APC, Governor-elect begin thank you tour, road show",
    "summarized_story": "Ekiti State Governor- elect, Biodun Abayomi Oyebanji and the deputy governor- elect, Monisade Afuye on Monday (today) July 18, commenced a ‘thank you tour’ to all the 16 local government areas of the state to express their gratitude to the people of the State for their support in the June 18 governorship election.\nThe tour kicked off from Ikole local Government on Monday by 10am.\nAdvertisementAdvertisementThe second phase of the tour would involve visitation to ethnic groups, trade unions and community leaders.\nRecall that the Governor-Elect had visited prominent Ekiti leaders and stakeholders within and outside the state shortly after his election.\nAdvertisementOyebanji said the consultation would continue till his inauguration, adding that regular consultation with stakeholders and leaders will be a major feature of his administration’s Public engagement policy."
  },
  {
    "headline": "Nigeria: New Senate Bill Allows States to Generate, Distribute Electricity",
    "summarized_story": "The Nigeria Senate on Wednesday passed a bill that would allow states to generate and distribute electricity.\nHe said, “The bill, when signed into law, will open up the space in the power industry and allows states or individuals with capacities to generate their own power and distribute.\nAccording to him, there was a transitional process put in place during the take-over of the Abuja Electricity Distribution Company (AEDC) by the United Bank for Africa (UBA) to ensure efficiency in service delivery.\n“We believe that this piece of legislation can change the fortunes of the electricity industry in Nigeria for the better.”Senate passes Nigeria Start-up BillMeanwhile, the Senate has passed the Nigerian Start-up Bill, 2022.\nThe bill after consideration, was referred by the Senate President, Ahmad Lawan, to the Committee on Trade and Investment for further legislative inputs."
  },
  {
    "headline": "Nigeria in Darkness as National Power Grid Suffers Sixth Collapse in 2022",
    "summarized_story": "Nigeria’s national electricity grid on Wednesday suffered its sixth system collapse in 2022, throwing many homes and businesses across the country into total blackout.\nThe cause of the system collapse was yet to be ascertained as at the time of filing this report.\nHowever, the Transmission Company of Nigeria (TCN), which manages the national grid, has embarked on an investigation to ascertain the cause of the collapse.\nEKEDC stated, “Dear customers, we regret to inform you of a system collapse on the national grid at precisely 11:27a.m today, July 20.\n“We hereby assure our esteemed customers of restoration of normal power supply as soon as TCN restores supply to us."
  },
  {
    "headline": "NNPC Chief Kyari Targets Fortune 500 Top 50 in Three Years",
    "summarized_story": "The Group Chief Executive Officer of the Nigerian National Petroleum Company Limited (NNPC), Mallam Mele Kyari on Wednesday disclosed that – working with the Board, management and staff of the company – his target is to make the entity be among the top 50 among the Fortune 500 Companies in three years.\nFortune 500 refers to a list of 500 of the largest companies compiled by Fortune magazine, United States, every year wherein companies are ranked by their annual revenues for their respective fiscal years.\nThe list includes both public and private companies using publicly available revenue data.\nHe further explained that the immediate challenges that the new NNPC needs to tackle is to free Nigeria from fuel importation.\n“The immediate questions that an average Nigerian is asking are: What is likely to change from the NNPC we know and the new NNPC Limited?"
  },
  {
    "headline": "Christian Association of Nigeria Disowns Bishops Who Attended APC Running Mate Shettima’s Unveiling",
    "summarized_story": "The Christian Association of Nigeria (CAN), has discribed Bishops, who attended the official unveiling of the vice-presidential candidate of the All Progressives Congress, Kashim Shettima as selfish desperados.\nVice-President of CAN (19 Northern States and Abuja) and its chairman in Kaduna State, Rev.\nHe said, “The people we saw at the unveiling of Shettima paraded as Bishops are people who did not have enough time to learn how to wear Bishop garments.\nFirst, a story was out claiming to have come from the Chairman of CAN Borno State only to be refuted.\nSecondly, there was another lie that BAT (Bola Ahmed Tinubu) and his running mate were on their way to meet CAN President one night."
  },
  {
    "headline": "Buhari to Shettima: I’ll Hand Over to You and Your Boss in 2023, God Willing",
    "summarized_story": "Buhari, however, in spite of the growing concern over APC’s preference for a Muslim-Muslim presidential ticket, expressed optimism that the party would win the February 2023 presidential election regardless.\nGod willing, you are going to win,” adding that, he is very happy with the choice of the former governor of Borno State as Tinubu’s running mate.\nEarlier, Shettima thanked the president for his empathy, support and positive role, leading to his emergence as running mate to the APC presidential candidate.\nHe chose a Kanuri, Alhaji Baba Gana Kingibe from the North-East geo-political zone, as his running mate in the 1993 presidential election.\n“The 1993 presidential ticket and the current one bridged one of our fault lines in the management of our diversities."
  }
]