[
  {
    "headline": "Buhari’s visit: Police warn troublemakers, MASSOB seeks Kanu’s release",
    "summarized_story": "visits Imo State today (Thursday), the police have warned troublemakers to stay away from the state or risk the wrath of security operatives.\nEdoziem warned that severe consequences would await Igbo leaders, including traditional rulers, Ohanaeze Ndigbo leaders, women and youth groups, who dared came to welcome the President during the visit.\nS’East’ll profit from President’s visit – ImoMeanwhile, the Imo State Government said Buhari visit to Imo State would advance the socio-economic well-being of the people of the state and the South-East at large.\nMASSOB urged the Igbo political leaders to use the Buhari’s visit to revive the lost confidence and hope Ndigbo had in them by telling Buhari that Ndigbo were not being treated as citizens.\nThis was contained in a statement by his media aide, Sam Onwuemeodo, welcoming the President, Major General Muhammadu Buhari (retd."
  },
  {
    "headline": "N’Delta enemies plan truncating amnesty scheme, ex-agitators tell FG",
    "summarized_story": "SOME Niger Delta ex-agitators have called on the President, Major General Muhammadu Buhari (retd.\n), to be wary of the antics being adopted by enemies of region to stop the Presidential Amnesty Programme.\nThe ex-agitators, who spoke through the PAP’s Strategic Communication Committee, alleged that there was a campaign of calumny against the scheme’s Interim Administrator, Col. Milland Dikio (retd.).\n“Enemies of the amnesty programme want our boys to return to the creeks because many of them will not survive except there is crisis in the region.\n“We want to let the Federal Government know that there are people in this Niger Delta region, who survive only by instigating crisis and troubles."
  },
  {
    "headline": "Kaduna: KEDC bans relocation of meters",
    "summarized_story": "The Kaduna Electric on Wednesday, said it has banned the relocation of metres by customers who moved from one building to another.\nIt said the company shall take the responsibility of installing a new meter for the customer at the new property at no cost.\n“The Management of Kaduna Electric hereby informs its valued customers that transfer of energy meters from the originally installed location to another location is prohibited.\n“This measure was taken to curb the menace of meters theft and unauthorised movement of meters which often results in the customers being defrauded, extorted or ignorantly tricked into buying a faulty meter.\n“Any meter found in a location other than where it was originally installed shall be deemed to have been illegally compromised and the customer shall be penalized as prescribed by the NERC Regulations.”"
  },
  {
    "headline": "70 per cent annual budgets for debt servicing – Senate Spokesman",
    "summarized_story": "The Chairman, Senate Committee on Media and Public Affairs, Sen. Ajibola Basiru, has disclosed that 70% of the Federal Government’s annual budgets goes into debt servicing and overhead cost.\nHe said Nigeria was currently running an unsustainable economy with no hope of job creation, hence, everyone should think of creativity rather than looking for Government jobs.\nSenator Basiru spoke at the Skills and Entrepreneurial programme organized for Youth Corp members at the NYSC Orientation Camp, Ede, Sound State.\nThe Senator told corps members that the days of waiting endlessly for job opportunities in government agencies can no longer be sustainable.\nSenate Spokesman urges youths to look beyond certificatesHe said: “The situation is not as gloomy as people paint it."
  },
  {
    "headline": "Kubiat Isaac: Family demands prosecution of all officers involved in son’s death",
    "summarized_story": "The family of Kubiat Isaac Akpan, a fresh graduate of University of Uyo, who died in police detention in Akwa Ibom, has demanded the prosecution of all the officers involved in his death.\n“Secondly, we are asking that the commissioner of police, Andrew Amiengheme, visit the family and condole with them.\n“Also Odiko Macdon should be removed as the Public Relations Officer because the public has lost confidence in him.\nWhat they have in their register was Kubiat Bassey whereas the person they killed was Kubiat Isaac Akpan.\nUmoh added that deliberate steps and reforms should be taken to tackle police violence on members of the public."
  },
  {
    "headline": "PIA: CSO calls for appointment of PAP permanent head",
    "summarized_story": "A coalition of Civil Society Organisations under the umbrella of Peace for Niger Delta (PND) has called on President Muhammadu Buhari to appoint a permanent head for the Presidential Amnesty Programme (PAP) before the full implementation of the recently signed Petroleum Industry Act (PIA) by 2022.\nIt added that a permanent head would play an intermediary role between the government and ex-agitators as well as advocate for their economic wellbeing.\nThe group also called on the president to restore the mandate of the Amnesty Programme to its original intent and take service to the Niger Delta where the ex-agitators reside.\n“Mr President’s historic signing of the PIA is a welcome development for the oil sector and a gateway to transforming the region.\nA new head of the PAP on permanent appointment would help the ex-agitators break away from the fetters of dependency and crime."
  },
  {
    "headline": "Terrorism: EFCC orders Nigerian, foreign NGOs to submit lists of IDPs receiving money",
    "summarized_story": "For more than one decade, several NGOs have been making donations to Internally Displaced Persons (IDPs) in the BAY States.\nEFCC said the submission of names of persons receiving money was mandated by law to help in combating money laundering and terrorism financing in Nigeria.\nThe Director, Special Control Unit Against Money Laundering (SCUML) domiciled in the EFCC, Daniel Isei gave the charge at an interactive meeting in Maiduguri, Borno State.\n‘‘Our engagement with the NGOs is to ensure and enforce compliance with the regulations and laws against money laundering and to combat financiers of terrorism activities.\nIsei reiterated the importance of presenting ‘‘Cash Notification Forms’’ to the EFCC Maiduguri Command for vetting and approval before funds disbursement."
  },
  {
    "headline": "Comic Actor Okele recovers from illness",
    "summarized_story": "After days of battle with ill-health, popular comic actor Babatunde Usman aka Okele has made a rebound from illness.\nThe Nation reports a viral video shared by Okele’s colleague Saliu Gbolagade aka Ogbuleke, had captured Okele being hospitalised over an unknown ailmentSharing the video, Ogbuleke wrote: “thank God, olorun koni je ki aye suku nitori e @okele_2”But Okele in an appreciation message shared on his Instagram page on Sunday, thanked his numerous fans and colleagues for their support.\nHe said, “There have been so many speculations on social media over my health, I want to thank everybody, here I am, I’m stronger.\n“I thank my senior colleagues, my fans, my family and God most importantly.\nThis is me, I’m fine, I have gone, and now I’m back”The 42-year-old actor who hails from Kwara state, has over 20 years experience in the movie industry."
  },
  {
    "headline": "Kaduna LG polls: PDP wins Jaba LG",
    "summarized_story": "Kaduna State Independent Electoral Commission has declared Mr Phillip Gwada (PDP) as winner of Saturday’s chairmanship election in Jaba Local Government Area of the state.\nThe Returning Officer, Prof. Peter Omale, made the declaration on Monday at the State Independent Electoral Commission (SIEC) office in Kwoi.\nOmale said Gwada polled 9,012 votes to defeat APC’s candidate, Mr Benjamin Jock, who polled 5,640 votes.\nADVERTISEMENTHe said that the candidate of Action Democratic Party, Mr Alhamdu Gyet, placed third with 2,732 votes.\n“Mr Phillip Gwada of the PDP, having satisfied the requirements of the law and having scored the highest number of votes is hereby declared winner of the election and returned elected,’’ Omale said."
  },
  {
    "headline": "Conflicting orders: Summoned CJs to appear before CJN Monday",
    "summarized_story": "The seven Chief Judges (CJs) summoned last month by the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, for allegedly issuing conflicting court orders, are to appear before him today in Abuja.\nA source at the Supreme Court told The Nation that the affected judges are to first meet with the CJN in preparation for their eventual appearance before the National Judicial Council (NJC).\nIt was also learnt that the CJN plans to meet with the leadership of the Nigerian Bar Association (NBA) during the week.\nRead Also: Babel of exparte orders“You recall the CJN issued the summons on August 30 to halt what has become an embarrassment to the Judiciary in the past few weeks.\nThe summons reads: “My attention has been drawn to media reports to the effect that some courts of coordinate jurisdiction were granting conflicting ex parte orders on the same subject matter."
  },
  {
    "headline": "Germany’s envoy to China dies 2 weeks into job",
    "summarized_story": "Germany’s new ambassador to China, Jan Hecker, has died shortly after taking up his post, the Foreign Office confirmed Monday.\n“It is with deep sadness and consternation that we heard of the sudden death of the German ambassador to China, Prof., Dr Jan Hecker.\n“At this moment, our thoughts are with his family and the people who were close to him,’’ the Foreign Office said in a statement.\nA native of the northern port city of Kiel, Hecker trained as a lawyer and had worked as an attorney and a judge.\nHecker was a university lecturer before becoming a foreign policy advisor to Chancellor Angela Merkel ahead of his appointment as ambassador."
  },
  {
    "headline": "FEC approves deployment of 5G network",
    "summarized_story": "And in a simple language, we can say it will open many opportunities economically, academically, educationally and even in health sector.\nAnd it will also support our security institutions, particularly in areas where they need high quality services.\nBoth of them confirm that there is no adverse health effects of 5G and it has not been proven to be harmful to our health.\nAll of them are just at the last stage of the deployment of 5G and I congratulate Nigerians for getting the memo approved by the Federal Executive Council.\nRather, the request is from the security institutions, in which they asked for that as part of their strategy."
  },
  {
    "headline": "breaking-fg-appoints-ugboaja-substantive-cmd-nauth-nnewi",
    "summarized_story": "From Aloysius Attah, OnitshaIts official, erstwhile Acting Chief Medical Director, Nnamdi Azikiwe University Teaching Hospital (NAUTH), Nnewi Anambra State, Associate Professor Joseph Ugboaja has been confirmed as the substantive Chief Medical Director.\nUgboaja was appointed Acting CMD NAUTH on January 26, 2021 following the expiration of the tenure of its former CMD, Prof. Anthony Igwegbe.\nPrior to his appointment, Ugboaja was formerly the Chairman, Medical Advisory Committee (CMAC) of NAUTH and also Director of Clinical Services.\nHe came top in the selection process for a new CMD which included written exams, oral interviews, administrative and academic output held months ago in Abuja.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "BREAKING: Killers of Plateau ex-governor’s father confess",
    "summarized_story": "From Molly Kilete, AbujaThe Nigeria Police Force headquarters has paraded the killers of Pa Defwan Dariye, the father of former governor of Plateau State Joshua Dariye.\nThe 93-year-old man was killed after his abductors collected N10 million ransom from his family.\nNguyen, who is also the mastermind of the crime, said he gave one of the abductors the order to shoot and kill the old man.\nHe said he decided to abduct the old man because he was a good target to make money as his son was a one time governor of Plateau State and senator of the Federal Republic.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Doctors seek Osinbajo’s intervention to end strike",
    "summarized_story": "By Henry UcheThe National Association of Resident Doctors (NARD) has vowed not to call off its over one-month industrial action without intervention of Vice President Yemi Osibanjo.\nIts National President, Osakhuesuyi Uyilawa, said the union would only call return to duty if it got a strong commitment from Prof. Osibanjo.\n“If we get strong commitment from the vice president, I can put myself on the line, I can take it to the national executive of the association, if we get that (commit ment) from the vice president, we can do anything to call-off the strike, the vice president can be trusted.\nJOESU President, Biobelemoye Josiah, has blamed the Federal Government for the industrial action, claiming it had always reneged on agreements.\nThis came barely a week after the NMA and its affiliates also handed down a 21-day ultimatum to declare an industrial action if government failed to resolve all issues contained in the various agreements signed with the doctors."
  },
  {
    "headline": "Cholera: Anxiety mounts in Ogun community as 10 feared dead",
    "summarized_story": "Anxiety is mounting in Magboro Community of Ogun State over the death of 10 people arising a from suspected Cholera outbreak.\nSuspected Cholera outbreak was first reported on Friday, when a resident of the community living in an uncompleted building died.\nMeanwhile, Magboro community leaders have begun a house-to-house search for victims to help them get care.\nThe Secretary of Magboro Community Development Council, Mr David Ajayi, said that the deaths could have been averted if those affected reported in time.\n“We received the report of suspected cholera outbreak when the deed had already been done."
  },
  {
    "headline": "Breaking: ECOWAS Suspends Guinea",
    "summarized_story": "“At the end of that mission, ECOWAS should be able to re-examine its position,” Barry told reporters.\nHe did not announce any immediate economic sanctions against Guinea, as ECOWAS imposed against Mali following a coup there in August 2020.\nActivists say this has contributed to West Africans’ loss of faith in democracy and made military coups more likely.\nECOWAS said on Tuesday it was concerned transitional authorities there had not made sufficient progress toward organising elections next February as promised.\nAluminium hit a fresh 10-year high on Monday after news broke of unrest in Guinea, which holds the world’s largest bauxite reserves."
  },
  {
    "headline": "THISDAY Law Editor, Onikepo Braithwaite, 129 Other Lawyers Shortlisted for Award of SAN Rank",
    "summarized_story": "By Alex EnumahTHISDAY Law Editor, Onikepo Braithwaite, amd 129 other lawyers have been shortlisted by the Legal Practitioners’ Privileges Committee (LPPC) for the award of the prestigious rank of Senior Advocate of Nigeria (SAN).\nSome in the Advocate category are; Offia Ota, Nwafor-Orizu Orji, Adeniyi Ademuyiwa, Ovrawah Ogaga, Abubakar Adamu and West-Idahosa Ehiogie.\nSee full listLIST OF SHORTLISTED CANDIDATES FOR THE RANK OF SENIOR ADVOCATE OF NIGERIA (SAN) ADVOCATE CATEGORY FOR 2021.\nLIST OF SHORTLISTED CANDIDATES FOR THE RANK OF SENIOR ADVOCATE OF NIGERIA (SAN) ACADEMIC CATEGORY FOR 2021.\nMAIYAKI THEODORE BALA PROF. ISAH MOHAMMED DR. ONI BABATUNDE ADETUNJI DR. AGABA JAMES ATTA PROF. ABDULQADIR IBRAHIM ABIKAN PROF. GBADAMOSI OLAIDE ABASS PROF DAWUD KAMAL ALHAJIA/PROF."
  },
  {
    "headline": "‘One Chance’ Criminals Stole Igboho’s Associate’s Case File, DSS Tells Court",
    "summarized_story": "The Department of State Services (DSS) has told the Federal High Court, Abuja that some criminal elements, ‘one chance’, have stolen its case file.\nThe DSS said the case file contained the fundamental rights enforcement suit filed by the 12 associates of Yoruba nation agitator, Sunday Adeyemo (aka) Sunday Igboho.\nAwo said the ‘one-chance’ thieves snatched the case file from his colleague, who unknowingly boarded their vehicle.\nThe 12 associates of Igboho instituted the rights enforcement suit against the DSS for parading them in the media as common criminals.\nThe judge, Justice Obiora Egwuatu, however, ruled that the case file be returned to the registry for reassignment to a regular court."
  },
  {
    "headline": "FG: Zamfara Telecoms Shutdown at Instance of Security Agencies",
    "summarized_story": "By Deji ElumoyeThe federal government Wednesday disclosed that the recent shutdown of telecommunications activities in Zamfara State over activities of bandits was based on the request of the nation’s security agencies.\nThe Minister of Communications and Digital Economy, Dr. Isa Pantami, who made this clarification to newsmen at the end of the weekly Federal Executive Council (FEC) meeting at the State House, Abuja, explained that the action did not originate from his ministry.\nAccording to him, when the security agencies proposed it as an effective way to curtail the bandits, the federal government did not object to it.\nPantami also explained that government was willing to sacrifice economic gains in the telecoms sector for security benefits.\nHe appealed to Nigerians to show understanding to the measure and support the efforts of the security agencies."
  },
  {
    "headline": "Buhari Approves Fatima Waziri-Azi as NAPTIP DG",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has approved the appointment of Dr. Fatima Waziri-Azi as Director General of the National Agency for Prohibition of Trafficking in Persons (NAPTIP).\nHer appointment, according to a release issued Wednesday by presidential spokesman, Garba Shehu, was sequel to the recommendation of the Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, who expressed the “urgent need for the ministry to intensify on the existing capacity in the NAPTIP in order to achieve its Key Result Areas as identified”.\nShe added that the recommendation of Waziri-Azi was based on her “pedigree, vast experience and proven track record to drive the agency forward and consolidate on what has been achieved so far”.\nA former Head of Department of Public Law at the Nigerian Institute of Advanced Legal Studies, the new NAPTIP DG is a women’s right advocate, a campaigner against domestic and sexual-based violence and an expert in rule of law.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Ghana Deports Nigerian Singer, Bella Shmurda For Attacking Doctor Who Announced His COVID-19 Result",
    "summarized_story": "The Adjabeng Circuit Court sitting in Accra, Ghana, has ordered the deportation of Nigerian singer, Bella Shmurda, from Ghana after he was found guilty of attacking a doctor with a fork while in quarantine at the MPlaza Hotel in Accra.\nBella Shmurda and the two others were said to have become agitated and attacked the doctor after being put into quarantine for testing positive for COVID-19.\nIt is understood that the trio were quarantined upon arrival in Ghana as mandated during the pandemic and underwent COVID tests.\nApparently rankled and agitated that the development would disrupt their visit to Ghana, they reportedly attacked the doctor who delivered the news to them with a fork.\nThe attack, it was gathered, was part of an alleged plot by the trio to escape from quarantine."
  },
  {
    "headline": "Despite N287bn profit, NNPC's liabilities exceed assets by N4.6trn",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has published its audited financial statements (AFS) for 2020, declaring N287 billion profit — even as liabilities exceeded assets by N4.6 trillion.\nAdvertisementAccording to Investopedia, if a company’s liabilities exceed its assets, it is a sign of an asset deficiency – meaning that the company is headed for bankruptcy.\nAccording to the statement, the group’s working capital in 2020 was N4.56 trillion, down from N4.44 trillion in 2019.\nAdvertisement“Among the highlights of the 2020 AFS is the Corporation’s group profit which rose from a loss position of N1.7 billion in 2019 to a profit of N287bn in 2020, for the first time in 44 years.\n“The group’s working capital remained below the line at N4.56 trillion in 2020 as against N4.44 trillion in 2019, the AFS further revealed,” the statement added."
  },
  {
    "headline": "Despite N287bn profit, NNPC's liabilities exceed assets by N4.6trn",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has published its audited financial statements (AFS) for 2020, declaring N287 billion profit — even as liabilities exceeded assets by N4.6 trillion.\nAdvertisementAccording to Investopedia, if a company’s liabilities exceed its assets, it is a sign of an asset deficiency – meaning that the company is headed for bankruptcy.\nAccording to the statement, the group’s working capital in 2020 was N4.56 trillion, down from N4.44 trillion in 2019.\nAdvertisement“Among the highlights of the 2020 AFS is the Corporation’s group profit which rose from a loss position of N1.7 billion in 2019 to a profit of N287bn in 2020, for the first time in 44 years.\n“The group’s working capital remained below the line at N4.56 trillion in 2020 as against N4.44 trillion in 2019, the AFS further revealed,” the statement added."
  },
  {
    "headline": "'21-year jail term for firearm possession' -- inside Lagos' anti-open grazing bill",
    "summarized_story": "The anti-open grazing bill passed the second reading at the Lagos state house of assembly on Monday.\nEstablishment of task force on cattle trespassSection 7 provides that the state will establish a task force on cattle trespass for the purpose of law enforcement.\nAdvertisement“The task force shall have units located in every cattle pound established within the state,” the section reads.\n“The task force shall have the power to collaborate with the commissioner of police concerning the prohibition of open cattle grazing within the state.\n“The task force shall be comprised of officers from the ministry of agriculture and law enforcement agents within the state."
  },
  {
    "headline": "'21-year jail term for firearm possession' -- inside Lagos' anti-open grazing bill",
    "summarized_story": "The anti-open grazing bill passed the second reading at the Lagos state house of assembly on Monday.\nEstablishment of task force on cattle trespassSection 7 provides that the state will establish a task force on cattle trespass for the purpose of law enforcement.\nAdvertisement“The task force shall have units located in every cattle pound established within the state,” the section reads.\n“The task force shall have the power to collaborate with the commissioner of police concerning the prohibition of open cattle grazing within the state.\n“The task force shall be comprised of officers from the ministry of agriculture and law enforcement agents within the state."
  },
  {
    "headline": "Police officer killed, 23 abducted as bandits attack Kaduna communities",
    "summarized_story": "Bandits have killed a police inspector and abducted 23 people during attacks on Ungwan Maje and Ungwan Laka communities in Chikun LGA of Kaduna state.\nAdvertisementTheCable understands that the bandits invaded the communities in the early hours of Wednesday.\nAn eyewitness said: “The bandits first attacked Ungwan Maje, where they abducted 16 persons, majority of them women and children.\nAdvertisement“The bandits later attacked Ungwan Laka, where a mobile police inspector, Joshua Markus, who came to visit his family from Rivers state was killed.\nWhen contacted, Mohammad Jalige, the spokesman of the Kaduna state police command, said he was not aware of the incident."
  },
  {
    "headline": "How Wave became Francophone Africa’s first unicorn startup with \"radically affordable\" money transfers",
    "summarized_story": "Taking on incumbentsSenegal is one of Africa’s fastest-growing mobile money markets, according to a 2020 GSMA report.\nExpresso Telecom, a unit of the UAE’s Expresso Telecom Group Limited, holds 22% of the market share, with over 3 million subscribers.\nAll three telecom firms provide mobile money services under the Orange Money, Free Money, and E-Money brands respectively, and along with banks, dominate the digital financial services space.\nAccording to co-founder Drew Durbin, Wave is building a mobile money service that is “radically affordable”.\nThe startup’s low-cost transaction service has helped it take on incumbents, eat into their market share, and turn the entire mobile money industry on its head."
  },
  {
    "headline": "Access Bank records $73 million in e-business income",
    "summarized_story": "Nigeria’s Access Bank Group made ₦29.9 billion ($73 million) in income from its channels and E-business in the first half of 2021, a 37% increase compared to ₦21.8 billion ($53 million) in the same period in 2020.\nThe bank’s Channels and other E-business income include earnings from electronic channels, card products, and related services.\nThe E-business income contributed about 40.5% of earnings from fees and commission, which reached ₦73.7 billion in H1 2021, and about 7% of gross earnings.\nThe report, however, did not indicate any reason for the rise in earnings from electronic channels.\nThe H1 2021 financial report also shows a 31.21% rise in profit before tax to ₦97.50 billion ($238 million), from ₦74.31 billion ($181 million) in 2020."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Improving literacy with mobile phones and tech tools in Africa",
    "summarized_story": "AdvertisementPer Statista, 66.8% of Africans aged 15 and above could read, write, and understand a simple statement in 2019.\nHowever, it’s important to note that a developmental delay, such as a literacy delay, is not the same as a developmental disability.\nDistinguishing development delays from developmental disabilitiesA developmental delay simply means that a child is behind on some developmental milestones; it does not indicate a specific health problem.\nDespite Emeka’s literacy delay, he could have improved significantly in a better school environment, with supportive parents and early intervention using tech tools.\nThese and other tech tools have revealed the importance of technology on literacy as these tools are available to everyone, regardless of age."
  },
  {
    "headline": "Nigeria’s Akiddie is scaling to become a storytelling platform for minority kids worldwide",
    "summarized_story": "Until recently, most children’s literature from popular culture has mainly featured Western civilisations, and there was a distinct lack of diversity.\nA 2019 survey in the UK also reveals that just 10% of children’s literature published that year had a minority character.\nSource; SuppliedIn Donna Norton’s 2010 book, Through the Eyes of a Child: An Introduction to Children’s Literature, she argues that children’s literature helps them appreciate their and other people’s cultural heritage and helps them develop emotional intelligence and creativity.\nOn further research, we discovered that the main reason why there wasn’t a lot of minority children’s content was that it was difficult to monetise,” he says.\nBesides minority children, Onyekachi believes this new model will cater favourably to minority content creators across the globe."
  },
  {
    "headline": "African Blockchain’s Bitmama, another African Unicorn, tackling online shopping scam",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Africa’s Blockchain BitmamaWave’s $1.7b valuationVahlid combating online scamMeet Africa’s Blockchain Bitmama, Ruth IselemaRuth Iselema, Founder of BitmamaIt is often said that challenges can be opportunities in disguise.\nUS-founded, Senegal-based mobile money provider, Wave, raised $200 million in its just-concluded Series A round bringing its current valuation to $1.7 billion and making it Francophone Africa’s first Unicorn.\nA tug of mobile money war.\nFollowing Sendwave’s acquisition, the duo fully focused on the mobile money provider.\nThis Series A makes Wave Africa’s sixth Unicorn, sharing the pedestal with Jumia, Fawtry, OPay, Flutterwave, and Interswitch."
  },
  {
    "headline": "States lack mechanism to administer VAT – FIRS declares",
    "summarized_story": "The raging battle over Value Added Tax (VAT) in Africa’s biggest economy continued on Wednesday with the Federal Inland Revenue Service (FIRS) declaring that the 36 federating states lack the mechanism to administer the sales tax.\nThe FIRS insisted it will continue to administer and collect VAT centrally for redistribution to the three tiers of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Despite AfCFTA, Nigeria’s African Exports declines 25% in H1 2021",
    "summarized_story": "Nigeria’s exports to Africa fell by 25% in the first six months of 2021 compared to the same period last year, according to foreign trade data released recently by the National Bureau of Statistics (NBS).\nThis decline in African exports sufficed despite the African Continental Free Trade Agreement (AfCFTA), which started in January 2021.\nAnalysis…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "DisCos to roll out over 2m new meters by year end",
    "summarized_story": "DisCos to roll out over 2m new meters by year endNigeria’s electricity distribution companies (DisCos) are on course to roll out more than 2 million meters by the end of the year under the meter distribution programme of the Federal Government.\nThe planned roll out is to happen under the second phase of the National Mass Metering Programme funded by the Central Bank of Nigeria…"
  },
  {
    "headline": "We’re open to serve Edo people – JARA Stores – Nigerian Observer",
    "summarized_story": "JARA stores in Edo State is operated under a Memorandum of Understanding (MoU) between the Edo Development and Property Agency (EDPA) and EDLP Nigeria Limited.\nAccording to her, “JARA, as we all know, is the first discount store in South-South.\n“We have unbeatable prices you can’t get anywhere except JARA stores.\nWe thank the Edo State Government for providing an enabling environment for businesses to thrive.\nIn less than two years, we are opening a second store and we give God the glory.”..."
  },
  {
    "headline": "AAU MATRICULATES 11,538 FRESH STUDENTS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – The Ambrose Alli University (AAU), Ekpoma, Edo State has matriculated 11,538 fresh students admitted for the 2020/2021 Academic Session.\nActing vice chancellor of the university Prof. Benson Osadolor, also during the matriculation ceremony, launched the celebration of AAU 40th Anniversary.\nProf. Osadolor disclosed that only 5,226 out of the 11,538 admitted students had paid their school fees.\n” Do not fail society.\n“Do not be led astray by bad friends; use the Social Media with wisdom and shun all evil associations”, he advised."
  },
  {
    "headline": "We’re building strong institutions to restore Edo’s lost glory – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government is building stronger institutions to restore the state’s lost glory and reposition it for sustainable growth and development.\nThe governor noted that “to restore Edo to its God’s given position in the country and in the subcontinent, there are certain things we need to do.\nWe have to build institutions to build human capacity to explore and exploit our national resources.”According to him, “That is why we carefully selected the people who will now select those to run the institutions for us.\nWe need to build institutions.\nPlease, have that in mind as you consider the candidates, because that is one thing that we are passionate about,” Obaseki charged."
  },
  {
    "headline": "COVID-19 3rd wave: Four more unvaccinated persons die in Edo, as fatality hits 30, confirmed cases reach 840 – Nigerian Observer",
    "summarized_story": "The State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nHe said the state also confirmed 65 new cases, bringing the number of confirmed cases in the state to 840.\nObi, who decried the rising number of infections and deaths in the state, expressed worry that more unvaccinated persons have continued to die from the virus.\nAccording to him, “Edo State, in the last 24 hours, recorded the death of four more persons who were unvaccinated with the COVID-19 vaccines, bringing the total number of fatalities recorded in the state to 30.\n“We also confirmed 65 new cases from the 339 samples collected within the 24-hour timeframe, with a case positivity rate of 19.2 percent."
  },
  {
    "headline": "Lagos VAT Bill: Local governments seek 50:50 sharing formula with state govt",
    "summarized_story": "The Conference of 57 Local Governments and Local Council Development Areas (LCDAs) in Lagos State has requested an equal sharing formula with the state in the proposed Value Added Tax (VAT) bill now before the state House of Assembly.\n“In addition, local governments, being the closest to the grassroots, need more revenues given the enormity of the responsibilities the Constitution confers on us.\nContributing, Michael Ade, representing the Lagos Tax Justice and Governance, commended the Lagos Assembly and the state government for having the political will at a time like this.\nEarlier, the Chairman, House Committee on Finance, Rotimi Olowo, insisted that it would make no sense if all monies accruable to Lagos state was taken by the Federal Government.\nMr Olowo argued that given the pressures on the state governments in terms of infrastructure development, the proposed law on VAT in the state would bring about holistic development of the state."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun 2022: Oyetola welcomes ex-lawmaker, Olasehinde, hundreds of PDP defectors",
    "summarized_story": "Funmilayo Olasehinde Mustapha alongside hundreds of defectors from the opposition People’s Democratic Party (PDP), to APC.\nOlasehinde was also the former Special Adviser on Strategy and Planning to former governor of the state, Olagunsoye Oyinlola.\nThe defectors were her supporters from the Ila Federal Constituency, comprising Ila, Boluwaduro and Ifedayo and other seven councils in the state.\nGovernor Oyetola while receiving the defectors said they took the right decision by joining the ruling All Progressives Congress in the state, especially at this very crucial time.\nOlasehinde urged the people of the state to continued rallying support for Oyetola’s government in his bid to take the state to an enviable height."
  },
  {
    "headline": "Buhari appoints new chief executives for education ministry",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has approved the appointments of new chief executives for some agencies under the Federal Ministry of Education.\nThis was disclosed in a statement signed by Bem Goong, the Director, Press And Public Affairs in the ministry, and made available to newsmen in Abuja on Wednesday.\nThe appointments were rolled out in continuation of the sustained efforts by the federal government to further strengthen effective service delivery in the education sector, the statement said.\nHe listed the new appointees as: Prof. Akpama Ibar as Executive Secretary, National Commission For Mass Literacy, Adult And Non-Formal Education; Prof. Chinwe Anunobi, Director/CEO, National Library; and Prof. Musa Maitafsir as Director/CEO, National Teachers Institute.\nSimilarly, Prof. Bashir Usman has been reappointed as the Executive Secretary, National Commission For Nomadic Education, for a second and final tenure of five years."
  },
  {
    "headline": "FIRS proposes new bill to strip states of VAT collection powers",
    "summarized_story": "The move comes on the heels of agitations by Katsina State Governor Aminu Masari, Gombe State Governor Inuwa Yahaya and a few others from predominantly northern parts of the country against attempts by Southern states, notably Lagos and Rivers State, to deny FIRS VAT collection powers.\n2nd schedule of the 1999 Constitution of the FRN.”The letter also asks the legislators to include tax disputes, including federal tax laws, companies income tax, petroleum tax, income tax, capital gain tax, stamp duty within the federal collector’s jurisdiction.\nRecall that in August, a Port Harcourt Division of the Federal High Court ruled that states had the legal right to collect VAT and income tax within their jurisdiction and not the FIRS.\nThe Rivers State Government ordered the immediate enforcement of its Value Added Tax Law 2021 across the entire state, following the failure of the FIRS to secure a stay-of-execution order against the state.\nStill, FIRS responded by maintaining that it will continue to collect VAT until the matter is settled at the Supreme Court."
  },
  {
    "headline": "Facebook, others launch #NoFalseNewsZone to minimise spread of fake news",
    "summarized_story": "Social media giant, Facebook, Big Cabal Media and Comic Republic on Wednesday announced the launch of #NoFalseNewsZone, a campaign aimed at minimising the spread of fake news in Nigeria.\nObagbemi said Facebook was delighted to be working with Big Cabal Media and Comic Republic to launch #NoFalseNewsZone in Nigeria, NAN reported.\nTomiwa Aladekomo, Chief Executive Officer, Big Cabal Media said:” The world is increasingly relying on sourcing for information from digital news outlets and social media platforms.\nNAN reports that Big Cabal Media (BCM) is a Nigerian digital media company that engages African youths with conversations around culture, innovation, entertainment and entrepreneurship.\nComic Republic is a Nigerian online multimedia company that primarily focuses on the digital distribution of indigenously created comic books."
  },
  {
    "headline": "Anti-Banditry Ops: Troops Ordered To Observe Rules Of Engagement",
    "summarized_story": "After a recent meeting with Service Chiefs, military Commanders in charge of the ongoing anti-banditry operations in the North-West part of the country, have been ordered to ensure that troops under their supervision observe rules of engagement when dealing with bandits.\nADVERTISEMENT“Our ground troops have been very decisive and merciless towards armed gangs.\nMeanwhile, the troops have also been warned to desist from using smartphones for sharing images and videos on the operations which could jeopardise the essence of the mission.\nThe source said personal cell phones and other electronic devices could reveal operational security.\nThe anonymous officer said besides considering operational security, the troops have been urged to always maintain professionalism."
  },
  {
    "headline": "Anti-Banditry Ops: Troops Ordered To Observe Rules Of Engagement",
    "summarized_story": "After a recent meeting with Service Chiefs, military Commanders in charge of the ongoing anti-banditry operations in the North-West part of the country, have been ordered to ensure that troops under their supervision observe rules of engagement when dealing with bandits.\nADVERTISEMENT“Our ground troops have been very decisive and merciless towards armed gangs.\nMeanwhile, the troops have also been warned to desist from using smartphones for sharing images and videos on the operations which could jeopardise the essence of the mission.\nThe source said personal cell phones and other electronic devices could reveal operational security.\nThe anonymous officer said besides considering operational security, the troops have been urged to always maintain professionalism."
  },
  {
    "headline": "Federal Govt Okays N500m For Abuja Airport’s 2nd Runway",
    "summarized_story": "The federal government has approved the design and construction of the second runway at the Nnamdi Azikiwe International Airport in Abuja for N500 million.\nPresidential spokesman, Garba Shehu, disclosed this to State House correspondents after the federal executive council (FEC) meeting presided over by President Muhammadu Buhari on Wednesday.\nHe said, “This is about promoting preventive health, preventive safety and health care in workplaces in the country.\n“floods in the year 2000 had destroyed Nassarawa township, destroyed the waterworks.\nAnd, of course, the difficulty of the state government in restoring the water supply scheme, the federal government has made this major approval which upon completion would be handed over to the Nassarawa state government for maintenance and upkeep."
  },
  {
    "headline": "Federal Govt Okays N500m For Abuja Airport’s 2nd Runway",
    "summarized_story": "The federal government has approved the design and construction of the second runway at the Nnamdi Azikiwe International Airport in Abuja for N500 million.\nPresidential spokesman, Garba Shehu, disclosed this to State House correspondents after the federal executive council (FEC) meeting presided over by President Muhammadu Buhari on Wednesday.\nHe said, “This is about promoting preventive health, preventive safety and health care in workplaces in the country.\n“floods in the year 2000 had destroyed Nassarawa township, destroyed the waterworks.\nAnd, of course, the difficulty of the state government in restoring the water supply scheme, the federal government has made this major approval which upon completion would be handed over to the Nassarawa state government for maintenance and upkeep."
  },
  {
    "headline": "Security Agencies Requested Telecom Shutdown In Zamfara – Federal Govt",
    "summarized_story": "The federal government has disclosed that the shutdown of telecommunication activities in Zamfara State over banditry was done at the request of the nation’s security agencies.\nHe appealed to Nigerians to show understanding of the measure and support the efforts of the security agencies.\nRather, the request is from the security institutions, in which they asked for that as part of their strategy.\nWhat I only plead with all of us, as laymen, we shall try to give our security institutions the support they need todeliver on their mandate.\n“Security issues today are not only for the security institutions alone, but there is a role that each and every citizen can play in order to make their work more successful."
  },
  {
    "headline": "Fresh attacks: Bandits kill five vigilantes, police in Kaduna",
    "summarized_story": "Bandits in two separate attacks were said to have killed six security operatives in communities in Kaduna State between Tuesday and Wednesday.\nThose killed included five vigilantes and a mobile police officerThe bandits attacked three communities — Udawa, Ungwan Sauri and Adnayita in Juji area, all in Chikun Local Government Area of the state.\nHowever, Jalige couldn’t give details of how many residents of the communities were taken away by the bandits.\n“Ungwan Sauri and Adnayita communities in Juji area are close to each other.\nHe gave the names of the five members killed by the bandits to include: Musa Sulaiman, Ibrahim Lawal, Bashar Ibrahim, Saidu Sarki and Abdulsalam Haruna; while Idris Abdullahi sustained gunshot wounds."
  },
  {
    "headline": "Fresh attacks: Bandits kill five vigilantes, police in Kaduna",
    "summarized_story": "Bandits in two separate attacks were said to have killed six security operatives in communities in Kaduna State between Tuesday and Wednesday.\nThose killed included five vigilantes and a mobile police officerThe bandits attacked three communities — Udawa, Ungwan Sauri and Adnayita in Juji area, all in Chikun Local Government Area of the state.\nHowever, Jalige couldn’t give details of how many residents of the communities were taken away by the bandits.\n“Ungwan Sauri and Adnayita communities in Juji area are close to each other.\nHe gave the names of the five members killed by the bandits to include: Musa Sulaiman, Ibrahim Lawal, Bashar Ibrahim, Saidu Sarki and Abdulsalam Haruna; while Idris Abdullahi sustained gunshot wounds."
  },
  {
    "headline": "Ohanaeze Ndigbo: We’re not against Buhari’s visit to Igbo land",
    "summarized_story": "Ohanaeze Ndigbo has said that is not against the visit of President Muhammadu Buhari to Imo State today but rather welcomes him wholeheartedly.\nIn a statement from the spokesman of the Igbo apex body, Chief Alex Ogbonnia, Ohanaeze Ndigbo said: “The attention of the leadership of Ohanaeze Ndigbo has been drawn to a statement-making round in the media and purportedly issued by the President-General of Ohanaeze Ndigbo.\n“Ohanaeze Ndigbo, under the leadership of Prof. George Obiozor, dissociates itself from the purported statement and urges Ndigbo to disregard same.\n“May we reiterate here that Ohanaeze Ndigbo Worldwide welcomes His Excellency, Muhammadu Buhari, GCFR, President and Commander in Chief of the Armed Forces of the Federal Republic of Nigeria to Owerri in Igbo Land.\nWe are, therefore, deeply delighted that President Muhammadu Buhari has chosen to visit Ndigbo in Igbo Land at this critical juncture in Igbo history."
  },
  {
    "headline": "Ohanaeze Ndigbo: We’re not against Buhari’s visit to Igbo land",
    "summarized_story": "Ohanaeze Ndigbo has said that is not against the visit of President Muhammadu Buhari to Imo State today but rather welcomes him wholeheartedly.\nIn a statement from the spokesman of the Igbo apex body, Chief Alex Ogbonnia, Ohanaeze Ndigbo said: “The attention of the leadership of Ohanaeze Ndigbo has been drawn to a statement-making round in the media and purportedly issued by the President-General of Ohanaeze Ndigbo.\n“Ohanaeze Ndigbo, under the leadership of Prof. George Obiozor, dissociates itself from the purported statement and urges Ndigbo to disregard same.\n“May we reiterate here that Ohanaeze Ndigbo Worldwide welcomes His Excellency, Muhammadu Buhari, GCFR, President and Commander in Chief of the Armed Forces of the Federal Republic of Nigeria to Owerri in Igbo Land.\nWe are, therefore, deeply delighted that President Muhammadu Buhari has chosen to visit Ndigbo in Igbo Land at this critical juncture in Igbo history."
  },
  {
    "headline": "Ex-governors Yari, Wamakko visit Tinubu in London",
    "summarized_story": "More and more political big guns have continued to visit in London former Lagos governor, Asiwaju Bola Tinubu.\nPresident Muhammadu Buhari opened the floodgate of visits, when he visited Tinubu in August.\nThe latest callers on Wednesday were former governor of Zamfara, Abdulaziz Yari and former Sokoto governor, Aliyu Wamakko.\nWamakko is the senator representing Sokoto north.\nLast week, among Tinubu’s visitors were Senator Ibikunle Amosun, Senator Tokunbo Afikuyomi, Governors Rotimi Akeredolu and Kayode Fayemi."
  },
  {
    "headline": "Lagos identifies four major sources of Air Pollution",
    "summarized_story": "The Lagos State Government has identified four major contributors to air pollution in the state and further highlighted robust initiatives in pursuit of clean air in the state.\nIn his presentation,titled, “Air Quality and Air pollution Medical Implications,” the Commissioner for Health, Prof. Akin Abayomi reiterated the positive impact and actualization of the state health system goals in a friendly and uncontaminated environment.\n“It is important to note that social determinants of health (the environment, water and air quality) play key role in managing the resources required to maintain the health system.\nGeneral Manager, LASEPA, Dr. Dolapo Fasawe recalled that, Lagos State, in accordance with the 1996 Paris agreement on international treaty on climate change, has taken the bull by the horn by establishing six air quality monitoring stations, data gathering on air pollution to establish causes and sources of pollution and the development of Lagos State Clean Air Action Plan 2021-2025 (LA-CAAP 2021-2025).\nTo drive home our zero tolerance on air pollution, manufacturing companies, particularly, within residential areas must provide detailed environmental management policy, action and clean-up plans with bias for staff safety and consideration for host communities,” she said."
  },
  {
    "headline": "BREAKING: OAU Lecturer, Mosobolaje Breaks Silence Over Alleged Sexual Assault",
    "summarized_story": "Dr Adebayo Mosobalaje, a lecturer at Obafemi Awolowo University’s Department of English Language, claims he was “wrongly” sacked by university management for alleged sexual assault.\nMosobolaje was sacked by the OAU Governing Council after an alleged sexual misconduct against a female student, according to the PUNCH.\nMosobolaje denied the allegations when he appeared before the investigative panel.\nSo, the Centre was the complaint and members of the Centre were also invited by the University Investigative Panel as witnesses.\nHe said, “My accuser did not appear before the Investigative Panel."
  },
  {
    "headline": "‘Give Us More Time’ – Miyetti Allah Reacts As Lagos Prepares To Ban Open Grazing",
    "summarized_story": "The Miyetti Allah Cattle Breeders Association (MACBAN) says its members are not ready for the Lagos State Government ban on open grazing.\nOn Monday, the ‘Prohibition of Open Cattle Grazing Bill’ passed second reading atthe House of Assembly.\nThe bill seeks to outlaw open grazing, the trespass of cattle, illegal entering into farmlands, among others.\nOn Wednesday, Miyetti Allah’s Zonal Secretary in South-West, Maikudi Usman said the body needs more time to enlighten herders.\nUsman added that it would be more expensive to breed cattle in one location, and urged Lagos authorities to amend the proposed bill."
  },
  {
    "headline": "BREAKING: ECOWAS Suspends Guinea Over Coup",
    "summarized_story": "Following a recent coup in Guinea, the West African bloc ECOWAS has decided to suspend the country, Burkinabe Foreign Minister Alpha Barry stated on Wednesday during a virtual crisis session.\nAccording to Barry, the Economic Community of West African States would deploy a mediation mission to Guinea on Thursday.\nDetails later…(AFP)"
  },
  {
    "headline": "Imo Visit: Don’t Kill Innocent Nigerians That May Protest Against Buhari — HURIWA Cautions Gov Uzodinma",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has urged the Governor of Imo State against bleeding innocent blood over President Muhammadu Buhari’s planned visit to the state on Thursday.\nBuhari is scheduled to visit Imo State on Thursday, and the state governor, Hope Uzodinma, has stated that anybody who wish to show their displeasure with the President’s leadership style will be dealt with harshly.\nGovernor Uzodinma was also chastised by the human rights organization, which labeled him a tyrant for illegally shutting down banks in the state.\nSome portions of the Constitution, according to the rights group, grant citizens the freedom of expression and assembly.\nThe Imo State Government has urged IPOB members to remain away during President Buhari’s visit, according to the DAILY POST."
  },
  {
    "headline": "Zamafara telecom shutdown: 7 days after, tension mounts over fate of abducted 73 school kids",
    "summarized_story": "Barely one week after some 73 students and their teachers were abducted from Government Day Secondary School Kaya in Maradun local government area of Zamfara state, there is mounting fear and confusion among parents and relations over the fate of the abductees.\nSokoto state Commissioner for Security Affairs, Garba Moyi, confirmed the development but said the state government was on top of the situation.\nAddressing journalists in Gusau, the commissioner said security operatives now found it very easy to deal with the bandits in their enclaves within the forests.\n“Zamfara State Government in efforts to ensure the crashing of the bandits has requested for the closing down of all networks in the state and this has been effective.\nThe security officials are finding it very easy to deal with the bandits in their enclaves in the forests,” the commissioner said."
  },
  {
    "headline": "Breaking: ECOWAS slams suspension on Guinea over military coup",
    "summarized_story": "West Africa’s main regional bloc has suspended Guinea’s membership, days after a military coup that removed President Alpha Conde.\nThe ECOWAS leaders also agreed to send a high-level mission to Guinea as soon as Thursday.\n“At the end of that mission, ECOWAS should be able to re-examine its position,” Alpha Barry, Burkina Faso’s foreign minister, told reporters in Ouagadougou after the meeting.\nECOWAS was criticised at the time by activists for remaining silent about Conde and Ouattara’s third-term bids.\nElsewhere in the region, Mali’s military staged coups in August 2020 and then again in May this year."
  },
  {
    "headline": "Breaking: In Plateau, 3 commissioners resign, Lalong set to reshuffle cabinet",
    "summarized_story": "Plateau state Governor, Simon Lalong, is set to reshuffle his cabinet, following resignation of three of his commissioners, Wednesday.\nThis was contained in statement by Dr. Makut Macham, director of press to the governor.\nMakut said, state Commissioner of information Hon.\nDan Manjang, revealed this at a press briefing after the State Executive Council (SEC) meeting, where he said a valedictory session in honour of the three Commissioners was held.\nIt said Governor Lalong has approved that Commissioner for Environment Mr. Usman Idi will take charge of Urban Development while Commissioner for Secondary Education Mrs. Elizabeth Wapmuk handles affairs at the Higher Education Ministry."
  },
  {
    "headline": "PFN urges Christians to leverage on electronic process",
    "summarized_story": "The Pentecostal Fellowship of Nigeria (PFN) has called on Christians to take advantage of the electronic voting system introduced by Independent National Electoral Commission to elect credible members to power.\nThe PFN Chairman South-South, Apostle Zilly Aggrey of Royal House of Grace made the call at the Social Security Outreach program, at Greater Evangelism worldwide Crusade, Opolo Yenagoa.\nHe said, “the christians should take advantage of having a voters card, most especially now, they have started electronic registration of voters card, and INEC came to explain point by point how our people can access the site and the form is registration.\nI want to appreciate the INEC for this initiative."
  },
  {
    "headline": "Fulani group dares southern governors, says anti opening grazing law satanic – NigPilot",
    "summarized_story": "Fulani socio-cultural group, Miyetti Allah Kautal Hore has described the anti-opening grazing law as satanic and a unanimous decision of southern governors to destroy pastoralists means of livelihood.\nMiyetti Allah group disclosed this in Masaka community, Abuja suburb on Monday at a press briefing, jointly delivered by its national president, Alh.\nHe further called for proper funding of the National Commission for Nomadic Education and the expansion of its mandate.\n“This oppressive laws and hostile policies being enacted by state governors are fundamentally going against the Fulani Pastoralist culture, economic interest and constitutional rights.\n“To this effect any action taken by any state Assembly that is in conflict with an above section of the 1999 Constitution as amended is null and void."
  },
  {
    "headline": "NITDA graduates 200 kids in emerging technologies – NigPilot",
    "summarized_story": "National Information Technology Development Agency, NITDA has graduated 200 kids from its Science, Technology, Engineering and Mathematics (STEM) Boot Camp for Kids (SB4KIDS) 2021 edition to further ensure that Nigeria becomes a digitally proficient economy.\nKashifu said NITDA had through its National Centre for Artificial Intelligence and Robotics (NCAIR) embarked on a two weeks training for kids on STEM Education, which is a yearly initiative, normally conducted during the summer school holidays.\n‘‘We at NITDA believe that the early involvement of youngsters in technology and innovation will accelerate the development of the technology sector and create future technology leaders who will transform the Nigerian technology space and boost the Nigerian Digital Economy.\nThe first three (3) from each batch will receive a laptop, while all the twenty (20) selected winners will receive a STEM kit that will help them with their STEM education journeys.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Katsina Banditry: 19 LGA flashpoints identified as phone charging business outlets suspended – NigPilot",
    "summarized_story": "AS part of continuous measures in tackling insecurity, Governor Aminu Bello Masari of Katsina State has an Executive order No 4, announced the suspension of business outlets engaging in phone charging business in the banditry prone areas of the state.\nHe also identified Nineteen, 19, local government areas as bandit’s flashpoints.\nThe Governor made this known while inaugurating the committee on Monitoring and Enforcement of the Security Challenges (Containment) Order today, Monday.\nThe Nineteen local government areas that were identified by Governor Masari as the flashpoint areas are where the committee is expected to beam their searchlight.\nThe Katsina State Commissioner of Police, CP Sanusi Buba is the Chairman while the Secretary to the State Government, Mustapha Inuwa will serve as secretary of the committee respectively."
  },
  {
    "headline": "FG Approves National Policy On 5G Network",
    "summarized_story": "The Federal Government has approved the National Policy on the fifth-generation (5G) network in Nigeria.\nHe explained that the benefits that accrue from using the 5G network include larger capacity, higher data rates, among others.\nThat is the National Policy on Fifth Generation Networks for Nigeria’s digital economy, the national policy on 5G,” he said.\nOn May 19, the Senate asked the Federal Government to suspend plans to deploy the 5G network pending a six-month investigation into possible health risks associated with the technology.\nAway from the 5G network, the Minister also reacted to the security situation in the North-West."
  },
  {
    "headline": "Igboho’s Aides Sue DSS, Seek N100m As Compensation",
    "summarized_story": "They also sought an order of perpetual injunction restraining the DSS from interfering with their personal liberty and freedom of expression.\nHours after the incident, the DSS issued a statement in which it said it was a raid by a joint team of security operatives.\nIgboho’s associates were later paraded and detained until eight of them were released by the DSS on August 30, after about two months in detention.\nThe security agency had, however, kept four others in custody, although the court granted bail to all 12 persons.\nLast Friday, the DSS released two more aides of Igboho, bringing the total number of those that have left its custody to 10."
  },
  {
    "headline": "DSS Files Terrorism Charges Against Two Of Igboho’s Aides",
    "summarized_story": "The Department of State Services (DSS) has filed five counts of terrorism against two of the aides of Yoruba Nation agitator, Sunday Adeyemo, also known as Sunday Igboho.\nThose facing the charges filed at the Federal High Court in Abuja are two of the four aides of Igboho held back in the custody of the security agency.\nBello, filed five terrorism charges against Noah Oyetunji and Amudat Babatunde (female).\nThe DSS filed the suit days before Igboho’s aides also filed a rights enforcement suit against the security outfit.\nThey also sought an order of perpetual injunction restraining the DSS from interfering with their personal liberty and freedom of expression."
  },
  {
    "headline": "Police Nab Kidnappers Who Killed Father Of Ex-Plateau Governor",
    "summarized_story": "Men of the Police Command in Abuja have arrested and paraded the killers of Pa Defwan Dariye, the father of former governor of Plateau State, Joshua Dariye.\nThe eight members of the syndicate arrested include Jethron Ngusen (57 years), from Horop village (who is the mastermind); Sunday Ibrahim, (35 years), from Horop village; Titus Ezikiel (33 years), from Horop; Ya’u Saidu aka Ya’u Kaban (40 years), from Kaban village and Dauda Isah (38 years), from Horop village.\nOthers are Mangut Shumuwar (30 years), from Horop village; Henry Amos (35 years), from Horop village; all in Mushere district of Bokkos.\nAccording to him, Pa Dariye was abducted based on the fact that his son, Joshua had been a governor and senator but never helped his people.\nInvestigations revealed that all the suspects were from the same place as Pa Dariye, thereby, fueling talks that most crimes of this nature are often carried out by people familiar with the victims."
  },
  {
    "headline": "VAT: FIRS To Appeal Rivers Court Judgement",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) on Wednesday said it has appealed the judgement of the Federal High Court in Rivers which held that the agency does not have the right to collect Value Added Tax (VAT) in the state.\nIn a news conference in Abuja, FIRS Group Lead, Special Tax Operations, Matthew Gbonjugbola, said it is the exclusive right of the agency to collect VAT in the country.\nGbonjugbola explained that the law mandating the FIRS to collect VAT seeks to protect businesses from multiple VAT.\n“I can confirm to you that FIRS indeed approached an appellate court to review the judgement of the lower court at the Federal Court of Appeal in Rivers,” he said.\nThis is coming days after a Federal High Court in Port Harcourt delivered a judgment restraining the FIRS from collecting VAT and personal income tax in Rivers State."
  },
  {
    "headline": "Governor Makinde signs MoU With NDE on youth, women empowerment -",
    "summarized_story": "Oyo State Governor, Seyi Makinde has signed a Memorandum of Understanding with the National Directorate of Employment (NDE) towards promoting the employment of youths and women in the state.\nThe governor, who was represented by his Executive Assistant on Administration, Idowu Ogedengbe, said the Oyo State Government considered the NDE as a critical partner towards creating opportunities for self-employment and employability of the teeming unemployed persons.\nHe said the state has worked with the NDE on some projects to provide increased opportunities for youth employment and social service delivery and to harmonise the implementation of social protection interventions in the country.\nIn his remark, Director-General NDE, Abubakar Fikpo, said the signing of the MoU indicated Governor Makinde’s commitment and desire to explore good avenues for creating decent job opportunities for unemployed youths in Oyo State.\nThe NDE is honoured for this glorious moment."
  },
  {
    "headline": "NNPC Consolidates Gains, Publishes 2020 Audited Financial Statements -",
    "summarized_story": "Following up on President Muhammadu Buhari’s recent announcement of the declaration of two hundred and eighty seven billion Naira (N287bn) Profit After Tax (PAT) in year 2020 by the Nigerian National Petroleum Corporation (NNPC), the Corporation has consolidated on the remarkable achievement, by publishing the Audited Financial Statements (AFS) on its official website.\nAmong the highlights of the 2020 AFS is the Corporation’s group profit which rose from a loss position of N1.7billion in 2019 to a profit of N287bn in 2020, for the first time in 44 years.\nThe Group Managing Director of the NNPC Mal.\nThe group’s working capital remained below the line at N4.56trillion in 2020 as against N4.44trillion in 2019, the AFS further revealed.\nThis is the third consecutive year that the NNPC is publishing its AFS, having done so for 2018 and 2019."
  },
  {
    "headline": "Police arrest killers of Former Plateau Governor, Joshua Dariye's father -",
    "summarized_story": "Operatives of the Intelligence Response Unit of the Nigeria Police Force have arrested eight (8) notorious high-profile kidnapping suspects indicted in Police investigations for the abduction and eventual murder of Pa Dariye Dafwan, the late father of former Governor of Plateau State, in Horop community, Bokkos LGA of Plateau State.\nThe arrest of the suspects follows unrelenting efforts by the Police to ensure perpetrators of the dastardly act are arrested and made to face the wrath of the law.\nThe breakthrough that led to the arrest of the suspects began with the arrest of one Abubakar Mohammed a.k.a Buba ‘m’ 23yrs, native of Gada Biyu in Daffo district, Bokkos LGA, Plateau State.\nEfforts are being intensified to arrest members of the gang currently at large.\nHe advised users of the social media to remain circumspect and protect themselves from cyber crooks masquerading as online friends."
  },
  {
    "headline": "Nigerian Troops kill 58 bandits, destroy 18 camps in Zamfara",
    "summarized_story": "The ongoing fight against banditry and kidnapping by joined troops of the Nigerian armed forces in Zamfara state has continued to gain more successesThe troops have neutralised fifty eight bandits, destroyed eighteen camps, caught one notorious bandits leader alive, deadly weapons destroyed while several bandits sustained various degrees of injuriesFour AK 47 riffles, ten locally made guns and Forty motorcycles among other items belonging to the bandits were also recovered by the troopsSeventy five kidnap victims abducted at different locations were rescued by the and reunited by their familiesThe troops engaged the bandits in gun duel for several hours at the Duburun and Gandun forest in Zamfara stateThe intense ground and air strike forced the bandits to flee their hideouts and relocate to other placesSadly, two soldiers and two local vigilante paid the Supreme price during the battle while eight soldiers and six local vigilante members sustained gunshot woundsThe troops of the Nigerian armed forces are not relenting in their quest to crush bandits, other criminals and their collaborators out of Zamfara stateZamfara state is the epic center of banditry and kidnapping in the northwest zoneRecalled that telecommunication services in the state were suspended for two weeks between 3rd to 17th September to enable security operatives eliminate bandits in the state."
  },
  {
    "headline": "Nnamdi Kanu Drags, Malami, DSS To Court – Trending with Ojy Okpe",
    "summarized_story": ""
  },
  {
    "headline": "Mexico’s Top Court Decriminalises Abortion in ‘Watershed Moment’",
    "summarized_story": "Mexico’s Supreme Court unanimously ruled on Tuesday that penalizing abortion is unconstitutional, a major victory for advocates of women’s health and human rights, just as parts of the United States enact tougher laws against the practice.\nArturo Zaldivar, president of the Mexican Supreme Court, hailed the decision as “a watershed moment” for all women, especially the most vulnerable.\nHundreds of mostly poor Mexican women have been prosecuted for abortion, while at least several dozen remain jailed.\nIn July, the state of Veracruz became just the fourth of Mexico’s 32 regions to decriminalize abortion.\nWhen asked at a news conference for his opinion on abortion, he sidestepped the question, saying it was up to the court."
  },
  {
    "headline": "Mali’s Progress Towards February Polls Insufficient, ECOWAS Warns",
    "summarized_story": "West Africa’s main regional bloc says it is concerned Mali’s transitional government has not made sufficient progress towards organising elections early next year, as agreed after a military coup last year.\nThe announcement came at the end of a three-day mission to Mali led by former Nigerian President Goodluck Jonathan.\nAfter the coup, Mali’s military leaders agreed, under pressure from ECOWAS, to an 18-month transition, culminating in presidential and legislative elections in February 2022.\n“The mission recalled the importance of respecting the date of the announced elections in order to demonstrate the credibility of the transition process,” said the ECOWAS statement, which was read out to journalists in Mali’s capital, Bamako.\nMali’s government has said it is conscious of its commitment to the electoral deadline, but some officials have also suggested it might not be respected."
  },
  {
    "headline": "‘Only God Will Take Me Out of Brasilia’: Defiant Bolsonaro Talks Tough",
    "summarized_story": "In recent months, the Supreme Court has authorised investigations into Bolsonaro and his allies for alleged attacks on Brazil’s democratic institutions.\n“They release bandits [from prison] and arrest conservatives,” hospital worker Carlos Alberto Juliao, 45, who attended a pro-Bolsonaro demonstration in Sao Paulo, said of the court.\n“Only God will take me out of Brasilia,” he told a crowd of 114,000 supporters on Sao Paulo’s Paulista Avenue on Tuesday afternoon, according to local military police estimates.\nIn the end, however, unrest was mostly restricted to some Bolsonaro supporters trying to breach police barricades in the capital Brasilia before being driven back with pepper spray.\nTurnout, while not small, also was lower than had been expected in Sao Paulo and Brasilia."
  },
  {
    "headline": "Teenager Leylah Fernandez Beats Elina Svitolina to Reach US Open Semi-finals",
    "summarized_story": "Teenager Leylah Fernandez produced another fearless performance to beat Elina Svitolina and set up a US Open semi-final with Aryna Sabalenka.\nFernandez has beaten defending champion Naomi Osaka, 2016 winner Angelique Kerber and now Olympic bronze medallist Svitolina in her run to her first major semi-final.\nShe has done it by trusting in her game and her big-hitting weapons, finishing with 42 winners against Svitolina.\nAn Olympic bronze medallist in Tokyo, Svitolina was slow to adjust her game, but she mixed defence with offence better in the third to finally break the Fernandez serve.\nAgain, Fernandez hit her way out of trouble, choosing her shots carefully and outmanoeuvring Svitolina at the net."
  }
]