[
  {
    "headline": "PICTORIAL: Buhari meets APC aspirants ahead of presidential primary",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), on Saturday night met with presidential aspirants of the All Progressives Congress ahead of the party’s presidential primary in Abuja.\nAt the meeting, Buhari urged the aspirants to consult amongst themselves and choose a formidable candidate before the party’s presidential primary elections on Monday, June 6, 2022.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "JUST IN: Buhari urges APC presidential aspirants to choose consensus candidate",
    "summarized_story": "), late Saturday, asked presidential aspirants of the All Progressives Congress to consult amongst themselves and choose a formidable candidate before the party’s presidential primary elections on Monday, June 6, 2022.\nAccording to a statement signed by his Special Adviser on Media and Publicity, Femi Adesina, Buhari spoke during a meeting with all the APC presidential aspirants at State House, Abuja.\nRecalling the consultation he had held with stakeholders “that would help the electoral fortunes of our party, beginning with the State Governors.\n“Ahead of the Convention, the party machinery has screened and found all aspirants eminently qualified.\nRecognizing this fact, the Screening Committee has, amongst others, recommended that consensus building through consultation, be intensified."
  },
  {
    "headline": "2023: NYCN charges Kebbi youths on discipline, political thuggery",
    "summarized_story": "By Haruna Aliyu, Birnin KebbiAs 2023 general elections draws near in Nigeria, the Kebbi state Chairman of National youths Caucus of Nigeria (NYCN) Alhaji Sanusi Bala Dan inno has charged youths in Kebbi and the nation at large to embrace self discipline and high moral standards during and after the polls.\nBala gave the charge at the state office in Birnin Kebbi, according to him most politicians have abandoned the youth after winning elections now that polls are near they have renewed relationships with them to again use and dump them.\nHe warned youth to desist from abuse of their enegies by engaging in thuggery and political killings because they have made themselves willing tools in the hands of greedy politicians “you must be far away from thuggery and as well resist being used by them to forment trouble, ask them to bring out their children if they really need power” he said.\nIn a related development he advised the youth in Kebbi and Nationally to remain law abiding and respect good policies of government and as well appreciate physical development brought by government.\nHe further stated that, the future of Nigeria lies in the hands of youths he urged to make good use of their votes and not to vote along religious, tribal or regional lines saying the country belongs to all of us we only need good leaders from anywhere."
  },
  {
    "headline": "Uzodimma/Madumere battle: NBA condemns allege arrest of industrial court staff by govt",
    "summarized_story": "NBA chairman has vested interest in the matter – Imo govtBy Chinonso AlozieOwerri- The Nigeria Bar Association, NBA, Owerri branch on Saturday condemned the alleged arrest of staff of the Industrial Court of Owerri, by the Imo state government last Friday.\nThe NBA, made this statement to newsmen in Owerri, through the secretary, Chinedu Agu, adding that the court officials were arrested while trying to inquire the reason for a heavy police presence around the premises of a new generation bank that was sealed by an Owerri Industrial court last Thursday.\nNBA said it was in the process that the court officials were allegedly manhandled and arrested.\n“Rather than challenge the same judgment in the Court of Appeal, the Imo State Government, in a desperate hurry, obtained a Court Order from a High Court sitting in Owerri (a court of coordinate jurisdiction) restraining Zenith Bank Plc from obeying the Judgment of the National Industrial Court, Owerri.\nMore so, the NBA chairman is a lawyer for one of the parties to the suit."
  },
  {
    "headline": "IGP Alkali commiserates with Family of late DIG Israel Ajao (rtd)",
    "summarized_story": "** Says”We Will Continue to Celebrate Our Fallen Heroes..”By: Kingsley Omonobi – AbujaThe Inspector-General of Police, IGP Usman Alkali Baba has reaffirmed the commitment of the Nigeria Police Force to continually honour and celebrate its fallen Heroes who have served the country diligently.\nThe IGP made the call on Saturday while confirming and announcing the passing into glory of DIG Israel Ajao (Rtd.\nA man of great proportions, the late DIG during his period of service featured prominently in advancing the community policing agenda.\nAn alumnus of the premier university in Nigeria, University of Ibadan, and the prestigious National Institute of Policy and Strategic Studies (NIPSS), DIG Ajao will be greatly missed in the gathering of the nation’s eggheads.\nThe Inspector-General of Police, IGP Usman Alkali Baba therefore commiserates with the late DIGs beloved family, relatives, and friends, wishing them the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "Tuberculosis special recognition awards debut at NHEA 2022",
    "summarized_story": "By Chioma ObinnaTo boost treatments of Tuberculosis, TB, Anadach Group is partnering with the Nigerian Healthcare Excellence Award, NHEA, to recognise organisations in the private sector that have supported their TB LON 3 project in Nigeria.\nGiven the high out of pocket payments in the country, the probability of catastrophic health expenditure due to TB is high.\nIt becomes imperative to use a differentiated model approach that is inclusive of the Private Sector Strategy as part of the means to strengthen the resilient and sustainable systems for TB control.\nOn his part, the NHEA Director of Marketing, Communication and Strategy, Mr Moses Braimah said: “We are happy with this collaboration on Tuberculosis.\nGHPR is one of West Africa’s leading Healthcare Management and Consultancy Company, involved in the promotion of healthcare business in West Africa."
  },
  {
    "headline": "Cultists hack man to death over N3,000 debt",
    "summarized_story": "According to the mason who said he left his base in Owan, Edo state to Benin owing to pressure from his cult members, “ Sylvester approached me for a loan of N3,000 last year.\nWhen I eventually met him, he gave me his MP3 Bluetooth speaker to hold pending when he would pay back the loan.\nOne of those who accompanied Sylvester, Victor, sustained machete cut in his hand.\nWe mobilised again and went to the hospital in search for Sylvester only to meet Victor bleeding on the floor unattended to.\nWe went to the hospital to confirm that Sylvester was really wounded, only to find Victor on the floor wounded”."
  },
  {
    "headline": "NG-CARES commends Gov. Ugwuanyi on transparency, prudent management of resources",
    "summarized_story": "Nigeria COVID-19 Action Recovery and Economic Stimulus (NG-CARES) yesterday gave Governor Ifeanyi Ugwuanyi of Enugu State a pat on the back for his administration’s prudent management of public resources in the state.\nUgwuanyi’s administration for observing due process in the management of resources and other administrative engagements.\nThe World Bank is an institution that respects due diligence in management of resources and we saw that exemplified in Enugu State.\n“We are also impressed with the quality of understanding of the processes involved in NG-CARES implementation in Enugu State.\nUgwuanyi and members of the State EXCO, Dr. Nwordu said: “We are absolutely impressed because this is the first time it is happening."
  },
  {
    "headline": "Retired Police DIG, Israel Ajao is dead",
    "summarized_story": "A retired Nigeria Police Deputy Inspector-General, Israel Ajao, is dead.\nAjao, who hailed from Oluponna in Osun, was the pioneer Assistant Inspector-General in charge of the Force Intelligence Unit.\nHe served as the DIG in charge of Force Criminal Investigations and later Operations before retiring in 2010.\nAjao advanced the community policing agenda and held think-tank positions including the Board Chairman, Lagos Neighborhood Safety Corps.\nA statement on Saturday by Force spokesman Muyiwa Adejobi said Ajao “will be greatly missed in the gathering of the nation’s eggheads”."
  },
  {
    "headline": "NAHCON boss, Hassan announces fare for 2022 Hajj",
    "summarized_story": "This was announced today, 4th June 2022 by the NAHCON Chairman, Alhaji Zikrullah Kunle Hassan in an extraordinary meeting with Chief Executives of Muslim Pilgrims’ Welfare Boards in the NAHCON Hajj House headquarters.\nThe gathering appreciated the effort put in place by the NAHCON Chairman in achieving this feat on behalf of Nigerian pilgrims.\nHe informed that the Commission has requested for more Hajj seats, but NAHCON is still waiting for response.\nHowever, those state board executives that are ready will be guided on the process today after the meeting.\nIn his closing remarks, the chairman of Forum of States, Alhaji Idris Ahmed Al’ Makura praised the NAHCON board for the commendable job and called for cooperation from all quarters."
  },
  {
    "headline": "Buhari under fire over failure to arrest Gumi as cleric calls for creation of ministry for herdsmen",
    "summarized_story": "), has spared Gumi despite his inflammatory comments.\nHURIWA’s Onwubiko said, “Sheikh Gumi is the real terrorist sympathiser.\n“It is shameful that Gumi is defending the killings, maimings and kidnappings done by Islamic bandits and Fulani terrorists while the government has tied Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, in Benin Republic with spurious charges.\n“Now, because when evil is left unstopped, it grows wings, an emboldened Gumi now call for a ministry for bandits, for savage criminals and bloodthirsty marauders who raped and killed both mothers and daughters!\nArrest Gumi now!"
  },
  {
    "headline": "Cross River govt cries over influx of refugees from Cameroon",
    "summarized_story": "The Director-General of the Cross River State Primary Healthcare Development Agency, Janet Ekpenyong, has disclosed that with new arrivals of Cameroonian refugees, the state is now really overburdened with the staggering number of refugees.\n“These arrivals have increased the number of refugees in our state.\nShe also confirmed that the state Emergency Management Agency (SEMA) has since arrived with relief items, including foods for the refugees.\n“My agency is working with good support from the state ministry of Health, World Health Organisation (WHO), UNHCR and Doctors Without Borders.\n“Once their registration is completed, they would be moved from Bashu community to different refugee camps in the state.”"
  },
  {
    "headline": "Bandits attack Kaduna community, abduct 14",
    "summarized_story": "Bandits in the early hours of yesterday abducted 14 persons at Station community near Idon town, Kajuru Local Government Area, Kaduna State.\nAn official in Kajuru Local Government Council, Bala Jonathan, gave the names of the abductees as Abdullahi, Yakubu Isah, Samson Julius, Angelina Julius, Pasema Daniel and Junior.\nOthers are Bobo Julius, Saratu Mohammed, Asenath Sunday, Confidence Jerry, Barnaki Sunday, Moses Kenneth, Danladi Goma and Ummi Jibrin.\n“These are the names of the abducted persons in Iri Station which we have discovered for now.\nAccording to him, some of the earlier kidnapped victims were still with the bandits because their loved ones and communities had not been able to raise the ransom demanded by their abductors."
  },
  {
    "headline": "Court order: APC sticks to elected delegates for presidential primaries",
    "summarized_story": "Adamu told reporters in Abuja yesterday categorically that statutory delegates remain excluded from the APC presidential primary.\nAt the convention, statutory delegates are excluded,” he said.\nThe defendants were the Senate President, the National Chairman of the APC, the Speaker of the House of Representatives and the Independent National Electoral Commission.\nIn the judgment, Justice A. M. Liman said the section of the Act does not exclude statutory delegates from voting during primaries.\n“Out of the four defendants, only APC National Chairman was served the notice of the suit, the three others were not aware not talk of entering defence."
  },
  {
    "headline": "My successor will not disappoint Abians, says Ikpeazu",
    "summarized_story": "The governor of Abia State, Dr. Okezie Ikpeazu has assured Abians at home and in the Diaspora, that the governorship candidate of the Peoples Democratic Party (PDP), Professor Uche Ikonne will not disappoint them if they elect him (Ikonne) as the governor of the state come 2023.\nIkpeazu who stated this while receiving in audience Abia State Market Chairmen Forum and Executives of Abia State Market Traders Association (ASMATA) at the Governor’s Lodge in Aba, described Prof. Ikonne as a man with the right experience and administrative qualities to further consolidate on the gains recorded by his administration.\n“Ikonne will not just continue from where we stopped, he will ensure that development gets to all parts of the state.\n“The idea is that the next governor, Prof. Ikonne, will inherit some of the roads that I built and will be able to construct his own.\n“As I said, I am happy that you people have endorsed Prof. Ikonne and I am confident that he (Ikonne) is not going to disappoint you."
  },
  {
    "headline": "Why power generation dips to 2,661.81Mw",
    "summarized_story": "Abubakar Aliyu, yesterday said the lowest electricity generation was 2,661.82 Mega Watts (MW) because of the partial shutdown of the Oben Gas Plant to address the repair of critical gas processing equipment.\nAccording to the Nigerian Electricity System Operator (SO) of the Transmission Company of Nigeria (TCN) System Performance of 3rd June 2022, peak generation was 3,450.60Mw.\nConsequently, energy allocation to the Abuja Electricity Distribution Company (AEDC) was reduced from 650Mw to 228.65Mw, representing a 64.8% decrease.\nThe public notice reads in part: “We are aware that the instability of electricity supply has persisted.\n“AEDC’s allocation is currently 228.63Mw which is significantly lower than the average allocation of 650Mw during the optimal generation period.”"
  },
  {
    "headline": "2023: Who wins APC presidential ticket?",
    "summarized_story": "WEAKNESSESHe presides over a River State APC that is split down the middle because of his long-running feud with erstwhile ally, Senator Magnus Abe.\nHe does not look anywhere near the presidential ticket and his candidacy will leave the APC trailing other parties in the presidential election.\nDAVE UMAHIEbonyi State Governor, Dave Umahi, was the first aspirant from the Southeast to declare for the presidency.\nUJU KENNEDYHer courage to play where angels fear to tread, singles out Uju Kennedy, the only female aspirant in the race for the APC presidential ticket.\nHaving served as a senator and two-term governor, Ayade may be in the presidential race for negotiation and continued relevance post 2023."
  },
  {
    "headline": "Pandemonium in Abuja as Muslim cleric, mob set vigilante ablaze over alleged blasphemy",
    "summarized_story": "From Molly Kilete, AbujaThere was pandemonium in Abuja when a local vigilante member was set ablaze by an angry mob said to have been mobilised by a Muslim cleric at Tippa garage, located at the Federal Housing Estate in Lugbe Area of the Federal Capital Territory (FCT).\nTrouble was said to have started for the deceased vigilante, Ahmad Usman, 30, after he got into an argument with the cleric [name withheld], who is said to have rallied the mob numbering over 200 to lynch the victim.\nThe incident, which caused pandemonium in the area, saw residents running for their lives, with business establishments closing for fear of been attacked by the mob.\nThe heated argument degenerated into an outbreak of violence that led to the murder and setting ablaze of Ahmad Usman by the enraged mob mobilized by the clergy numbering about Two hundred (200).\n“Normalcy has since been restored to the situation, while monitoring and surveillance of the area continues."
  },
  {
    "headline": "BREAKING: Tinubu to be sanctioned over Ogun comments – APC Chairman Adamu",
    "summarized_story": "From Romanus Ugwu, AbujaNational Chairman of the All Progressives Congress (APC) Senator Abdullahi Adamu has indicated that former governor of Lagos State Asiwaju Bola Ahmed Tinubu will face sanctions over his comments in Ogun State this week.\nThe APC National Leader and presidential aspirant was involved in an outburst in Ogun when he visited the state to campaign for delegates’ votes ahead of the presidential primary scheduled for Monday.\nAlthough Mr Tinibu has since apologised and retracted his statement, the ruling pary chairman claimed that the apology was not enough, stressing that the presidential hopeful would face disciplinary action.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Consider the people in your decisions, Buhari tasks ECOWAS leaders",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has urged ECOWAS leaders to consider the victims of unconstitutional changes of government and the adverse consequences of isolation on them when taking any decision on the political situations in Burkina Faso, Mali and Guinea.\nHe noted that although the military leadership in Burkina Faso has released President Kabore in line with the request by ECOWAS leaders, further measures must be taken to ensure his safety and full freedom.\n‘‘The deterioration of the humanitarian situation in Mali and Burkina Faso should be a source of serious concern to us as leaders in the region.\nTo this end, Buhari called on the Authority to revisit the report presented by former President Goodluck Jonathan, the ECOWAS Mediator on Mali, on a transition timetable for the West African country.\nHe urged the military authorities in Burkina Faso and Guinea to renew their determination and immediately provide acceptable timeframes for the return to democracy in their respective countries."
  },
  {
    "headline": "Gov Mohammed clinches PDP governorship ticket after failed bid for presidential ticket",
    "summarized_story": "From Paul Orude, BauchiBauchi State Governor, Senator Bala Mohammed has clinched the gubernatorial ticket of the People’s Democratic Party (PDP) to contest re-election in 2023.\nThe development has excited his supporters who thought all hopes we’re lost after he lost to former Vice President Abubakar Atiku in his bid to secure the presidential ticket.\nReturning Officer Murtala Damagum declared Mohammed winner after scoring 646 votes out of the total number been of 650 registered votes of delegates while four votes were invalid.\nVacancy was created for the governor to contest again when the gubernatorial candidate of the party Barrister Mohammed Ibrahim Kashim dramatically withdrew from the race citing personal reasons.\nKashim, who had resigned to contest has been re-appointed by Governor Mohammed as SSG."
  },
  {
    "headline": "Gunmen abduct Jonathan’s cousin in Bayelsa",
    "summarized_story": "From Femi Folaranmi, YenagoaThe Bayelsa Police Command has confirmed the abduction of a cousin to former President Goodluck Jonathan, Mr Mike Ogiasa.\nOgiasa, a former cabinet member in the administration of former Bayelsa governor Senator Henry Seriake Dickson was said to have been kidnapped from his community, Otuabagi in Ogbia Local Government Area of Bayelsa State.\nHe was indoors when the gunmen arrived and abducted him,” the source said.\nThe spokesman of the Bayelsa Police Command, SP Asinim Butswat, confirmed that Mike Ogiasa was abducted on June 2 and that the police are investigating the incident in order to rescue him.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Breaking: Northern APC Govs Want Buhari’s Successor to Come from South",
    "summarized_story": "*Urge northern APC aspirants to withdraw from race•Badaru drops presidential bidAdedayo Akinwale in AbujaThe All Progressives Congress (APC) Northern Governors and party leaders from the north have recommended that President Muhammadu Buhari’s successor should come from the southern part of the country.\nThe northern governors appealed to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries.\nThe northern governors noted that this moment calls for the most sober and inclusive approach to selecting the party’s candidate, while calling on all APC leaders to fulfil their responsibility in this regard.\nThe statement read: “APC governors and political leaders from the northern states of Nigeria today met to review the political situation and to further support our party in providing progressive leadership amidst our national challenges.\n“We appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries.”."
  },
  {
    "headline": "News in Photographs: Buhari Meets APC Presidential Aspirants",
    "summarized_story": "President Muhammadu Buhari Saturday met all the presidential aspirants of the ruling All Progressives Congress (APC) and party leadership at the State House, Abuja.\nThe President, who returned from a one-day visit to Accra, Ghana where he attended an extraordinary meeting of ECOWAS leaders on the crisis in Mali, Guinea and Burkina Faso, hosted the party’s aspirants at a meeting attended by the Chairman of the APC, Senator Abdullahi Adamu and Secretary, Iyiola Omisore.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Hosts APC Presidential Aspirants, Leaders to Dinner",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari will on Saturday host all the 23 presidential aspirants of the ruling All Progressives Congress (APC) and party leadership to dinner at the State House, Abuja.\nSources told THISDAY that the issue of the presidential primaries of the party scheduled for Tuesday, June 7, 2022, will top the agenda of what the President will discuss eith the aspirants and the need to have a common front ahead of the primaries.\nThe aspirants expected at the meeting includeAsiwaju Bola Ahmed Bola Tinubu, Vice President Yemi Osinbajo, Hon Rotimi Amaechi, Senator Ahmad Lawan, Yahaya Bello, Kayode Fayemi, Emeka Nwajiuba, Dr Ogbonnaya Onu, Senator Ibikunle Amosun, David Umahi, Mohammed Badaru and Senator Godswill Akpabio.\nOthers are Mr Tein Jack-Rich, Pastor Tunde Bakare, Senator Rochas Okorocha, Ben Ayade, Senator Sani Yerima, Senator Ken Nnamani, Ikeobasi Mokelu, Hon Dimeji Bankole, Felix Nicholas, Uju Ken-Ohanenye and Senator Ajayi Borroffice.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Adamu: APC May Punish Tinubu over Outburst",
    "summarized_story": "*Says apology not enoughAdedayo AkinwaleNational Chairman of the All Progressives Congress (APC), Senator Abdulahi Adamu, has hinted that the ruling party may punish one of its presidential aspirants Asiwaju Bola Tinubu over his recent outburst.\nAdamu while addressing journalists on Saturday in Abuja said Tinubu’s apology wasn’t enough because his outburst was an insult to President Muhammadu Buhari.\nTinubu while addressing delegates in Ogun ahead of the presidential primary election scheduled to hold on Tuesday in Abuja had said Buhari wouldn’t have become president in 2015 had he not supported him.\nTinubu, who equally declared that South West was the next region to produce the president, added that he was the best and most experienced person the region could put forward to succeed President Buhari.\n“Since he became the president, I have never got ministerial slots, I didn’t collect any contract, I have never begged for anything from him, it is the turn of Yoruba, it is my turn,” Tinubu had said."
  },
  {
    "headline": "Revealed! 13 Presidential Aspirants Cleared by APC Screening Committee",
    "summarized_story": "Vice President Yemi Osinbajo, former Lagos State Governor Bola Tinubu, Ebonyi State Governor David Umahi.\nJigawa State Governor Badaru Abubakar, former Niger Delta Minister Godswill Akpabio and former Transport Minister Rotimi Amaechi are among the 13 presidential aspirants cleared by the All Progressives Party Screening Committee, THISDAY can report.\nOthers cleared by the committee are former Ogun State Governor Ibikunle Amosun, Kogi State Governor Yahaya Bello, Ekiti State Governor Kayode Fayemi, Senate President Ahmad Lawan, former Minister of State for Education, Chukwuemeka Nwajiuba, former Technology Minister Chris Onu and Tein Jack-Rich.\nThe report of the screening committee sighted by THISDAY said all the 13 aspirants, comprising 12 men and a woman, met the basic requirements of the law and cleared to participate in the primaries.\nThe names were arranged in alphabetical order in the report submitted to the National Chairman, Senator Abdullahi Adamu, by the chairman of the Screening committee, Chief John Oyegun, Friday."
  },
  {
    "headline": "BREAKING: Buhari Orders Ruling APC Presidential Aspirants To Select Consensus Candidate Among Themselves Before Primary",
    "summarized_story": "President Muhammadu Buhari has asked the ruling All Progressives Congress presidential aspirants to pick a consensus candidate among themselves ahead of the party’s primary on June 6.\nBuhari stated this on Saturday evening in the meeting he had with the aspirants at the Aso Rock Villa, Abuja.\nThe announcement comes as President Muhammadu Buhari meets 13 aspirants cleared to contest the party’s primaries on June 6-8 in Abuja.\nSaharaReporters also earlier reported that Buhari may announce his preferred candidate during a meeting with the APC presidential aspirants by 8.30pm today at the Aso Rock Villa, Abuja.\nBuhari had met with the APC governors on Tuesday ahead of the party’s convention."
  },
  {
    "headline": "BREAKING: Buhari Orders Ruling APC Presidential Aspirants To Select Consensus Candidate Among Themselves Before Primary",
    "summarized_story": "President Muhammadu Buhari has asked the ruling All Progressives Congress presidential aspirants to pick a consensus candidate among themselves ahead of the party’s primary on June 6.\nBuhari stated this on Saturday evening in the meeting he had with the aspirants at the Aso Rock Villa, Abuja.\nThe announcement comes as President Muhammadu Buhari meets 13 aspirants cleared to contest the party’s primaries on June 6-8 in Abuja.\nSaharaReporters also earlier reported that Buhari may announce his preferred candidate during a meeting with the APC presidential aspirants by 8.30pm today at the Aso Rock Villa, Abuja.\nBuhari had met with the APC governors on Tuesday ahead of the party’s convention."
  },
  {
    "headline": "BREAKING: Buhari May Meet Ruling APC Presidential Aspirants By 7pm After Return From Ghana Trip, Announce ‘Anointed' Candidate",
    "summarized_story": "President Muhammadu Buhari may announce his preferred candidate during a meeting with the All Progressives Congress' presidential aspirants by 7pm at the Aso Rock Villa, Abuja.\nSaharaReporters learnt that at the highly anticipated meeting, Buhari may announce his anointed candidate and push for a consensus among the aspirants.\nOthers include former Senate President Ken Nnamani, former House of Representatives Speaker, Dimeji Bankole, and serving senators Ibikunle Amosun, Ajayi Boroffice, and Rochas Okorocha.\nHe had also charged the governors to ensure that the forthcoming convention to pick a presidential candidate reflects all the values and virtues of the party.\nSaharaReporters had earlier today reported that ahead of Monday’s presidential primary, a section of the APC cabal is trying to convince Buhari to make Senate President, Lawan his successor."
  },
  {
    "headline": "BREAKING: Buhari May Meet Ruling APC Presidential Aspirants By 7pm After Return From Ghana Trip, Announce ‘Anointed' Candidate",
    "summarized_story": "President Muhammadu Buhari may announce his preferred candidate during a meeting with the All Progressives Congress' presidential aspirants by 7pm at the Aso Rock Villa, Abuja.\nSaharaReporters learnt that at the highly anticipated meeting, Buhari may announce his anointed candidate and push for a consensus among the aspirants.\nOthers include former Senate President Ken Nnamani, former House of Representatives Speaker, Dimeji Bankole, and serving senators Ibikunle Amosun, Ajayi Boroffice, and Rochas Okorocha.\nHe had also charged the governors to ensure that the forthcoming convention to pick a presidential candidate reflects all the values and virtues of the party.\nSaharaReporters had earlier today reported that ahead of Monday’s presidential primary, a section of the APC cabal is trying to convince Buhari to make Senate President, Lawan his successor."
  },
  {
    "headline": "Full Statement Released By 11 Ruling APC Northern Governors Asking Buhari To Pick Southern Presidential Aspirant",
    "summarized_story": "Eleven northern governors have backed a southern aspirant for the ruling All Progressives Congress.\nThis led Jigawa State Governor, Abubakar Badaru, to withdraw from the presidential race, according to a statement from the governors on Saturday night.\nHere is the Full Statement by Northern States’ APC Governors and Political LeadersAPC governors and political leaders from the northern states of Nigeria today met to review the political situation and to further support our Party in providing progressive leadership amidst our national challenges.\nDuring our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\nWe appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries."
  },
  {
    "headline": "Buhari asks APC presidential hopefuls to produce 'formidable' consensus candidate",
    "summarized_story": "President Muhammadu Buhari has asked the presidential hopefuls of the All Progressives Congress (APC) to “come up with a formidable” consensus candidate before the party holds its primary election.\nThe president said this during a meeting with the aspirants on Saturday at the presidential villa, Abuja.\nThe ruling party has fixed June 6-8 for its special convention to elect its presidential flagbearer.\nAdvertisement“Our party, the APC, has won two successive presidential elections in 2015, first when we were in the opposition and in 2019 when I sought re-election.\nRecognizing this fact, the Screening Committee has, amongst others, recommended that consensus building through consultation, be intensified."
  },
  {
    "headline": "Buhari asks APC presidential hopefuls to produce 'formidable' consensus candidate",
    "summarized_story": "President Muhammadu Buhari has asked the presidential hopefuls of the All Progressives Congress (APC) to “come up with a formidable” consensus candidate before the party holds its primary election.\nThe president said this during a meeting with the aspirants on Saturday at the presidential villa, Abuja.\nThe ruling party has fixed June 6-8 for its special convention to elect its presidential flagbearer.\nAdvertisement“Our party, the APC, has won two successive presidential elections in 2015, first when we were in the opposition and in 2019 when I sought re-election.\nRecognizing this fact, the Screening Committee has, amongst others, recommended that consensus building through consultation, be intensified."
  },
  {
    "headline": "Atiku’s candidacy and Nigeria’s delicate balance",
    "summarized_story": "Dr Iyorchia Ayu, the PDP chairman and Atiku’s long-time associate, was caught on video celebrating Tambuwal as a “hero”.\nHead or tail, presidential power would have gone to the south.\nThe first was at ward level, the second at local government, the third at state and the fourth at national.\nBy now spitting on power rotation, Atiku has somehow vindicated my perception of him: that all he wants is power.\nHis life-long ambition has the potential to upset Nigeria’s fragile balance at a time there is so much discontent with the union."
  },
  {
    "headline": "Atiku’s candidacy and Nigeria’s delicate balance",
    "summarized_story": "Dr Iyorchia Ayu, the PDP chairman and Atiku’s long-time associate, was caught on video celebrating Tambuwal as a “hero”.\nHead or tail, presidential power would have gone to the south.\nThe first was at ward level, the second at local government, the third at state and the fourth at national.\nBy now spitting on power rotation, Atiku has somehow vindicated my perception of him: that all he wants is power.\nHis life-long ambition has the potential to upset Nigeria’s fragile balance at a time there is so much discontent with the union."
  },
  {
    "headline": "Buhari 'throws weight behind' southern presidential candidate",
    "summarized_story": "President Muhammadu Buhari has reportedly backed the call for the southern region to produce the presidential flagbearer of the All Progressives Congress (APC).\nThe president made his position known at a meeting with the presidential hopefuls of the ruling party on Saturday, PUNCH reports.\nAt the meeting, Buhari asked the APC governors and the presidential hopefuls to brace up for elective primaries, ruling out the possibility of a consensus candidate.\nThe APC governors from the north had earlier asked the president to look toward the southern presidential hopefuls when considering his successor.\n“We therefore wish to strongly recommend to President Muhammadu Buhari that the search for a successor as the APC’s presidential candidate be limited to our compatriots from the southern states."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Four rising sectors in African tech",
    "summarized_story": "In 2020, when AI companies globally attracted $36 billion, AI companies on the continent could only raise $11.63 million.\nIn January, it raised $100 million—the only record funding into the African AI industry this year—solidifying hopes that Africa can play on the global AI scene.\nWhile many edtech companies around the world benefited from this, as the industry attracted an influx of funding, African edtech companies struggled to tap into this opportunity.\nIn 2021, when edtech globally raised $20 billion, African edtech companies raised less than $40 million.\nThere have been impressive efforts by African companies to solve the continent’s educational problems."
  },
  {
    "headline": "Founder of Babymigo speaks on reducing maternal deaths in Africa",
    "summarized_story": "Kemi OlawoyeThe role of tech in improving maternal healthcareHA: How big of a role do you think tech can play in improving maternal health in Nigeria?\nHA: What singular aspect of maternal healthcare in Nigeria do you think needs the most urgent intervention?\nHA: What are the things you believe will accelerate the growth of the maternal health sector in Nigeria?\nKO: The first thing will be to identify policies and interventions that affect outcomes in terms of maternal and child health.\nIn the next 3 years, we hope to provide healthcare services to 10 million mums across the African continent."
  },
  {
    "headline": "2023: Buhari sets qualification for would be APC flag bearer",
    "summarized_story": "President Muhammadu Buhari Saturday night met with all the aspirants for the presidential seat on the platform of All Progressives Congress (APC) at the State House, Abuja.\nThe President who also urged the aspirants to look beyond personal ambitions, called on them to put national and party interest first.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\n“The 2023 General Elections are fast approaching in a global, regional and national environment that is constantly changing and challenging.\nThese steps are being taken to ensure that the unity and cohesion of the party are sustained and to provide direction."
  },
  {
    "headline": "Buhari meets APC presidential aspirants",
    "summarized_story": "President Muhammadu Buhari is presently meeting with the All Progressive Congress ( APC) Presidential aspirants at the Presidential Villa, Abuja.\nThe meeting is being attended by Vice President Yemi Osinbajo, the National leader of the APC Bola Tinubu, Ken Nnamani, amongst othersThe meeting which is being attended by all the 23 aspirants, started at about 9.30pm.\nThe statement signed by eleven Governors, representing the party’s elected Governors, noted that the move will lead to the emergence of a strong Presidential candidate.\nAccording to the party leaders, “ It is a question of honour for the APC, an obligation that is not in anyway affected by the decisions taken by another political party.\nBello Matawalle of Zamfara State and Simon Lalong of Plateau StateThe former Governor of Sokoto state, Aliyu Wamakko Former Governor of Sokoto State, Governor Umar Ganduje , Kano State and Atiku Bagudu , of Kebbi State, also signed the document."
  },
  {
    "headline": "INEC may no longer keep sensitive election materials in CBN",
    "summarized_story": "The independent National Electoral commission (INEC) has indicated that beginning with the June 18 Ekiti governorship polls, it will no longer warehouse sensitive election materials in the Central Bank of Nigeria (CBN).\nMahmood Yakubu, INEC chairman gave this indication during a symposium tagged: ‘the electorate: a conversation on elections in Nigeria’, held at the Musa Yar’Adua Centre, Abuja on Saturday.\nYakubu said the commission took the decision with a view to preventing the sensitive materials from being compromised.\nHe said INEC was generally findingbetter ways which it can secure the processes and “not necessarily related to what is happening in the Central Bank.\nYakubu had at the second quarterly meeting with media organisations last month said INEC was already looking for alternative platforms for the safe-keeping of sensitive election materials."
  },
  {
    "headline": "Edo suspends taskforce on environmental issues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has announced the suspension of the Edo State Taskforce on Development Control and Environmental Issues domiciled at the Ministry of Environment and Sustainability.\nIn a statement by Secretary to the State Government, Osarodion Ogie Esq., the government said that it will, in due course, inaugurate a new taskforce for sanitation to enforce matters relating to environmental sanitation.\nAccording to him, “Members of the public are by this announcement advised to desist from engaging with the defunct taskforce on matters of development control and report anyone found parading themselves as members of the taskforce to the relevant security agencies.\n“The Ministry of Physical Planning, Urban and Regional Development is primarily empowered to regulate development control, including approvals of building plans and other such permits.\nThe government will sustain its campaign – Operation Plan Edo (OPE), in pursuit of the realization of the Edo Regional Development Plan and Benin City Master Plan.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo urges citizens’ participation for a cleaner, greener environment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… serves abatement notices to violatorsBENIN CITY – The Edo State Government has called for the support and participation of all residents and other stakeholders to achieve the government’s plan for a cleaner and greener environment in the state.\nThe state government through the Ministry of Environment and Sustainability and the Edo State Waste Management Board intensified ongoing clean-up exercise across the state to rid Edo of dirt and debris, urging residents to get involved and be a part of the project to ensure a cleaner state.\nThe Commissioner for Environment and Sustainability, Engr.\nNoting that the government will sustain compliance and enforcement of all environmental laws, the Commissioner said the state is serving abatement notices to violators of extant laws on environmental sanitation.\nLawani noted that there is the need for residents to clear their surroundings to avoid blocked drains and the menace of erosion."
  },
  {
    "headline": "UNIBEN Mgt, Ekosodin Elders Laud Obaseki on Roads Construction – Nigerian Observer",
    "summarized_story": "While expressing the University’s appreciation to Governor Godwin Obaseki and Chairman of the Commission, Pastor Kennedy Osifo, Professor Salami said the school would always remember the kind gesture of the state government.\nOn his part, the EDSOGPADEC Chairman said that the construction and asphalting of roads cuts across the three Oil Producing areas of the State.\nSome indigenes of Okabere Community were full of appreciation to the Edo State Governor, for the construction of PZ and Okabere roadsThey said that the construction of the road has made life easy for indigenes of Community.\nReceiving newsmen in his Office, the Chairman of EDSOGPADEC said that the construction of PZ – Okabere road was split into four units, Viz, PZ road 2073km; Ehioghae road 1.93km;Eriaria road, 1.95km and Okabere r, 5km.\nHe said the road which has reached 95 percent completion was first awarded in 2018 and re-awarded by the new Board in 2019."
  },
  {
    "headline": "Missing Crown: Prosecution Counsels Express Fear Over Magistrate’s Neutrality – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Prosecution counsels in the case involving Chief Ayirimi Emami and the Commissioner of Police have expressed lack of confidence on the neutrality of the Magistrate trying the matter at the Warri South Magistrate Court.\nThe aggrieved counsels consequently want the case to be tried by another Magistrate in the court alleging bias by the presiding Magistrate Ejiro Diejomaoh (Mrs).\nThis application was vehemently opposed by the defence counsel, Chief Otomewo arguing that there was no provision for the use of Statement on Oath at the Magistrate’s Court.\nIt is also on record that the Magistrate had never recorded Chief Ariyo as a Chief even though Chief Ariyo announces himself as such.\nThe Prosecution counsels, however, said that they had tried to distinguish between an objection arising from the lack of neutrality of a court and other forms of objection."
  },
  {
    "headline": "Tambuwal wins Sokoto south PDP senatorial ticket",
    "summarized_story": "Aminu Tambuwal, Sokoto State governor, has emerged PDP candidate for Sokoto South Senatorial District.\nTambuwal who initially aspired to be president, stepped down for former vice president Atiku Abubakar at the presidential primary of the party in Abuja on Saturday last week.\nGovernor Tambuwal had previously represented Tambuwal/Kebbe Federal Constituency in the House of Representatives, where he rose to become the Speaker of the House in his third term."
  },
  {
    "headline": "JUST IN: Chose consensus candidate from among you – Buhari tells APC presidential aspirants",
    "summarized_story": "Both processes were achieved through unity of purpose, strategic alignment, consultation, fairness, determination and effective leadership.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\n“The 2023 General Elections are fast approaching in a global, regional and national environment that is constantly changing and challenging.\n“Given these circumstances, I charge you to recognize the importance of the stability and unity of the party, which cannot be overemphasized.\nRecognizing this fact, the Screening Committee has, amongst others, recommended that consensus building through consultation, be intensified."
  },
  {
    "headline": "BREAKING: Buhari reportedly backs power shift to the south in 2023",
    "summarized_story": "President Muhammadu Buhari has reportedly endorsed a power shift to the South in 2023.\nThe decision is coming hours after northern APC governors also backed power shift the south in national interestBadaru Abubakar, governor of Jigawa State, has withdrawn from the presidential race.\n“During our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\n“We, therefore, wish to strongly recommend to President Muhammadu Buhari that the search for a successor as the APC’s presidential candidate be limited to our compatriots from the southern states.\n“We appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries."
  },
  {
    "headline": "Police reveal identity of Abuja security guard killed over alleged blasphemy",
    "summarized_story": "Police in Abuja has identified a security guard murdered and set ablaze in the FCT by a mob over alleged blasphemy as Ahmad Usman, a 30-year-old man.\nThe police said it has commenced investigation into the killing that occurred on Saturday in the Lugbe area of the nation’s capital.\nThe Command’s Public Relations Officer, Josephine Adeh, confirmed the development on Saturday.\nAdeh revealed that Small Hundaru, who had already suffered severe degrees of burns, was taken immediately to the hospital where he was confirmed dead by a doctor on call.\n“Normalcy has since been restored to the situation, while monitoring and surveillance of the area continues."
  },
  {
    "headline": "JUST IN: Northern APC governors back power shift to south",
    "summarized_story": "Governors of the All Progressives Congress (APC) from the north have asked President Muhammadu Buhari to look toward the southern presidential hopefuls when considering his successor.\nThe statement issued after the meeting read, “APC governors and political leaders from the northern states of Nigeria today met to review the political situation and to further support our Party in providing progressive leadership amidst our national challenges.\n“During our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\n“We, therefore, wish to strongly recommend to President Muhammadu Buhari that the search for a successor as the APC’s presidential candidate be limited to our compatriots from the southern states.\n“We appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries."
  },
  {
    "headline": "Come Up With Formidable Candidate, Buhari Tells APC Presidential Hopefuls",
    "summarized_story": "Both processes were achieved through unity of purpose, strategic alignment, consultation, fairness, determination and effective leadership.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\n“The 2023 General Elections are fast approaching in a global, regional and national environment that is constantly changing and challenging.\nThese steps are being taken to ensure that the unity and cohesion of the party are sustained and to provide direction.\n“Given these circumstances, I charge you to recognize the importance of the stability and unity of the party, which cannot be overemphasized."
  },
  {
    "headline": "Come Up With Formidable Candidate, Buhari Tells APC Presidential Hopefuls",
    "summarized_story": "Both processes were achieved through unity of purpose, strategic alignment, consultation, fairness, determination and effective leadership.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\n“The 2023 General Elections are fast approaching in a global, regional and national environment that is constantly changing and challenging.\nThese steps are being taken to ensure that the unity and cohesion of the party are sustained and to provide direction.\n“Given these circumstances, I charge you to recognize the importance of the stability and unity of the party, which cannot be overemphasized."
  },
  {
    "headline": "BREAKING: Badaru Withdraws As 10 APC Govs Tell Buhari To Look South For Presidential Candidate",
    "summarized_story": "The Jigawa State governor and presidential aspirant of the All Progressives Congress (APC), Abubakar Badaru, has withdrawn from the race for the party’s presidential ticket.\nThis is even as 10 northern governors elected on the platform of the APC advised President Muhammadu Buhari to look at the direction of the South in picking the party’s presidential candidate for the 2023 elections.\n“During our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\n“We, therefore wish to strongly recommend to President Muhammadu Buhari that the search for a successor as the APC’s presidential candidate be limited to our compatriots from the southern states.\nWe appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries."
  },
  {
    "headline": "BREAKING: Badaru Withdraws As 10 APC Govs Tell Buhari To Look South For Presidential Candidate",
    "summarized_story": "The Jigawa State governor and presidential aspirant of the All Progressives Congress (APC), Abubakar Badaru, has withdrawn from the race for the party’s presidential ticket.\nThis is even as 10 northern governors elected on the platform of the APC advised President Muhammadu Buhari to look at the direction of the South in picking the party’s presidential candidate for the 2023 elections.\n“During our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\n“We, therefore wish to strongly recommend to President Muhammadu Buhari that the search for a successor as the APC’s presidential candidate be limited to our compatriots from the southern states.\nWe appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries."
  },
  {
    "headline": "BREAKING: Kwara Politician, Philanthropist, Mike Omotosho, Is Dead",
    "summarized_story": "The founder of Sustainable Health Initiative (SHI) Dr. Mike Omotosho, is dead.\nOmotosho, who hails from Kwara State, died outside the country on Saturday evening of undisclosed illness.\nHe also contested the 2015 general elections in Kwara State where he came third in the governorship election.\nHe was also Governor of Rotary International in some parts of Nigeria covering the whole of North West, North East, North Central, South West excluding Lagos and Ogun states from 2015 to 2016.\nOmotosho set up the Mike Omotosho Foundation to alleviate poverty and empower youths through training and community development programmes."
  },
  {
    "headline": "Buhari asks APC Presidential aspirants to consult, come up with consensus candidate",
    "summarized_story": "President Muhammadu Buhari on Saturday night urged APC presidential aspirants to hold consultations, and come up with a formidable candidate before the party holds its primary election between June 6-8, 2022.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\n“The 2023 General Elections are fast approaching in a global, regional and national environment that is constantly changing and challenging.\nThese steps are being taken to ensure that the unity and cohesion of the party are sustained and to provide direction.\n“Given these circumstances, I charge you to recognize the importance of the stability and unity of the party, which cannot be overemphasized."
  },
  {
    "headline": "Police confirm death of 2 officers after shootout with gunmen",
    "summarized_story": "By Stanley NwanosikeThe Police Command in Enugu State has confirmed the death of two gallant officers from bullet wound injuries sustained after a gunfight with yet-to-be identified gunmen in an Enugu community.\nThis was contained in a statement made available by the Command’s Public Relations Officer, ASP Daniel Ndukwe, in Enugu on Saturday.\nNdukwe said that the gallant officers confronted the yet-to-be identified gunmen who attacked them while on duty at Nkpamte community of Igbo-Eze North Local Government Area (LGA) on June 2.\n“At about 12 noon of June 2, 2022, yet-to-be identified gunmen attacked and fatally wounded two policemen, at Nkpamte community of Igbo-Eze North LGA, after a gunfight.\n“The police officers were immediately moved to the hospital, but were unfortunately confirmed dead by doctors on duty,” he said."
  },
  {
    "headline": "Moment Buhari met with APC Presidential aspirants in Abuja (Photos)",
    "summarized_story": "President Muhammadu Buhari on Saturday night met with all presidential aspirants on the banner of the All Progressives Congress (APC).\nThe meeting held at the State House, Abuja had the president telling the aspirants to consult among themselves to come up with a formidable consensus candidate that would give the party victory at next year’s presidential election."
  },
  {
    "headline": "Buhari endorses Southern Presidential candidate for 2023",
    "summarized_story": "President Muhammadu Buhari on Saturday said he would support a Southern candidate to fly the banner of the All Progressives Congress (APC) in next year’s presidential election.\nBuhari, who met with APC presidential aspirants at the State House, Abuja, said there was need for power to shift to the South in 2023.\nHis endorsement of shift of power to the South came less than an hour the Northern governors endorsed the same power shift to the South.\nA source at the meeting told The Punch that Buhari did not name a consensus candidate, but asked that southern aspirants should compete at the primary.\n“During our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC."
  },
  {
    "headline": "BREAKING: Buhari backs southern candidate for president",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has endorsed a power shift to the South in 2023.\nHe made this known at a dinner with All Progressives Congress presidential aspirants in Abuja.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: Northern APC govs back power shift to South",
    "summarized_story": "All Progressives Congress Governors from the Northern part of the country have backed the transfer of power to the South.\nThe Northern governors also asked aspirants from the northern region to withdraw.\nA statement issued after the meeting read, “APC governors and political leaders from the northern states of Nigeria today met to review the political situation and to further support our Party in providing progressive leadership amidst our national challenges.\n“During our discussions, we welcomed President Muhammadu Buhari’s invitation to governors and other stakeholders to contribute to the emergence of a strong presidential candidate for the APC.\n“We appeal to all aspirants from the northern states to withdraw in the national interest and allow only the aspirants from the south to proceed to the primaries."
  },
  {
    "headline": "BREAKING: Buhari To Meet With APC Presidential Hopefuls Tonight",
    "summarized_story": "On Saturday night, President Muhammadu Buhari will meet with the All Progressives Congress (APC) presidential candidates.\nAt the meeting, the president is anticipated to announce his favored presidential candidate for 2023, according to TheCable.\nThe meeting will take place in the presidential mansion in Abuja at 8 p.m.More to come…"
  },
  {
    "headline": "How Nigerian Army Subtly Carried Out Invasion Of Nnamdi Kanu’s Family House In 2017 – Abia Governor, Ikpeazu Opens Up",
    "summarized_story": "Okezie Ikpeazu, the governor of Abia State, has described how the Nigerian Army reached out to him and then carried out the infamous invasion of Nnamdi Kanu, the leader of the Indigenous People of Biafra, in September 2017.\nIn an interview with Vanguard, the governor said that the Nigerian Army commander approached him (Ikpeazu) at the time and told him (the officer) that he (the officer) had orders to arrest Kanu, but the army did not mention an all-out invasion.\nIn Abuja, Ikpeazu gave an interview about the military invasion of the Afaraukwu Ibeku country house of arrested IPOB leader Nnamdi Kanu on September 17, 2017.\nI only saw the General Officer Commanding who was at Enugu that time; he showed up in my office and told me that he would arrest Nnamdi Kanu.\nNnamdi Kanu is saying that if we are not wanted, could we go?"
  },
  {
    "headline": "VIDEO: Buhari meets APC presidential aspirants 3 days to party’s National convention",
    "summarized_story": "President Muhammadu Buhari on Saturday met with the All Progressives Congress (APC) presidential aspirants ahead of the party’s National convention slated between June 6 and 8, 2022.\nShare this: TwitterFacebook"
  },
  {
    "headline": "[Breaking] APC presidential primary: Lawan, Umahi strike ‘accord’",
    "summarized_story": "David Nweze Umahi, have promised to support each other, should either of them win the All Progressives Congress (APC) presidential election primary scheduled between June 6 and 8, 2022.\nThey made the promise Saturday evening when Lawan visited Umahi in his Abuja residence.\nSpeaking during the visit, Senator Lawan urged Umahi to support him or whoever emerges the presidential candidate as the APC should be united to win the 2023 presidential election.\nHe said: “We have always spoken about the need for our party to continue to play the role God designed for us.\nAny of them that God chose as the candidate, both of us will work together to support the President and support such a person."
  },
  {
    "headline": "Breaking: Nigeria’s Flamingos silence Ethiopia, pick 2022 U17 women World Cup ticket",
    "summarized_story": "Nigeria’s U17 women team, Flamingos, on Saturday evening beat their Ethiopian counterparts to qualify for 2022 FIFA U17 women World Cup.\nThe coach Bankole Olowokere-led National team played a goalless draw with the Ethiopians in the return leg at the Moshood Abiola National Stadium, Abuja.\nThe first leg had ended 1-0 in favour of Nigeria.\nShare this: TwitterFacebook"
  },
  {
    "headline": "Africa must not be left behind in moving from fossil fuel to renewable energy sources — President Buhari",
    "summarized_story": "Minister of mine and steel Arc Olamilekan Adegbite on Wednesday said Africa needs to join the rest of the world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nAfrican Natural Resources and Mines Limited, ANRML, is a group company of the African Industries Group.\nThe mining sector is the backbone of industrialization of the economy."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria via high yield rice.",
    "summarized_story": "He said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tones per hectares.\nThis outstanding result has ensures that more and more people are showing interest in GAWAL R1.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company, that not only sell seed but teach farmers advance planting technique for optimum yield.\nAs one of the large-scale seed companies in Nigeria, it has supplied over 20,000 mt rice and maize seeds to Nigeria farmers in over 30 states."
  },
  {
    "headline": "Nigeria Committed to Energy Transition, Reducing Gas Emission – Silva",
    "summarized_story": "According to him, “the only viable option currently on the table is natural gas, considering vast proven gas endowments, put at 209 TCF, with 600 TCF potential reserves.\nWe cannot ignore this resource, especially when energy poverty is viciously starring at us.”“The goal of Nigeria’s gas policy is to ensure that gas development is undertaken in accordance with our socio-economic development priorities.\nAccording to him, “the implication of the above is that the issues surrounding energy poverty, climate and sustainable development are not mutually exclusive.\nBut of equal concern is the alarming level of energy poverty.\nEnergy transition is about providing clean energy, and not about discriminating between energy sources."
  },
  {
    "headline": "TRCN Registrar elected president of AFTRA",
    "summarized_story": "By Ngozi NwankwoRegistrar/CE Teachers Registration Council of Nigeria, Prof Josiah Ajiboye has been elected the President of the Africa Federation of Teaching Regulatory Authorities, AFTRA.\nAjiboye was elected the AFTRA president at the end of its 9th Annual Conference and 11th Roundtable held in Accra, Ghana, today June 1.\nNigerian Pilot Newspapers learnt that the Africa Federation of Teaching Regulatory Authorities is a continental body comprising all teaching regulatory authorities in all the 54 Africa countries.\nOther elected officers were Deputy President- Zambia, Secretary General- Ghana, Treasurer – Namibia and Assistant Secretary General- South Africa.\nHe also promised to assist countries who are yet to have teacher regulatory bodies to establish one, so that together Africa teachers will enjoy professional status and benefits."
  },
  {
    "headline": "Why we reversed $3.1bn e-customs project – FG",
    "summarized_story": "By Mathew Dadiya, AbujaFederal Government has explained the reasons why the $3.1 billion contract for ‘complete automation’ of the Nigerian Custom Service, approved by the Federal Executive Council (FEC), in 2020 was reversed.\nIt clarified that disagreements between partners that formed a consortium for the project, delayed its takeoff despite efforts by the government through the office of the Attorney General of the Federation to mediate.\nAsked to explain the rationale behind a new e-Customs concession agreement between the NCS, Africa Finance Corporation (AFC) and China’s Huawei Technologies Limited, Ahmed said: “The E-customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements between the concession partners.\nAnd at the end of the day, I think one of the partners in the concession did not agree with the arrangements”, she stated."
  },
  {
    "headline": "Buhari To APC Presidential Aspirants: Consult, Build Consensus, Produce Formidable Candidate",
    "summarized_story": "President Muhammadu Buhari has urged all presidential aspirants on the platform of the All Progressives Congress to consult among themselves, build consensus and produce a formidable candidate for the party.\nREAD ALSO: Northern Governors Ask APC To Zone Presidential Ticket To South“Ahead of the Convention, the party machinery has screened and found all aspirants eminently qualified.\nRecognizing this fact, the Screening Committee has, amongst others, recommended that consensus building through consultation, be intensified.\nIn both instances, national and party interests were overriding factors in our deliberations and decision-making.\nThese steps are being taken to ensure that the unity and cohesion of the party are sustained and to provide direction."
  },
  {
    "headline": "APC Not Happy With Tinubu’s Outburst In Abeokuta, Says Adamu",
    "summarized_story": "﻿The National Chairman of the All Progressives Congress, Abdullahi Adamu, has said the party is not happy with the outburst of one of its presidential aspirants, Bola Ahmed Tinubu in Abeokuta.\nThe APC Chairman announced that all presidential aspirants are scheduled to meet with President Muhammadu Buhari tonight.\nAdamu also said the party has appealed the judgment in favour of statutory delegates, meaning they will not participate in the upcoming presidential primary.\n‘High regard’Tinubu was campaigning in Abeokuta on Thursday when he said he deserves to lead the nation after helping President Buhari win the 2015 election.\n﻿But in a statement on Friday, Tinubu maintained that he holds President Buhari in high regard."
  },
  {
    "headline": "INEC Says Sensitive Election Materials No Longer To Be Kept With CBN",
    "summarized_story": "The Chairman of the independent National Electoral Commission (INEC), Mahmood Yakubu, says sensitive electoral materials will in the meantime no longer be routed through the Central bank of Nigeria (CBN).\nHe also specifically notes that, beginning from the Ekiti State Governorship election, INEC will not keep its sensitive materials with the CBN.\nAccording to him, this decision is to guarantee that electoral materials for the lined up Elections are not compromisedREAD ALSO: INEC Launches Regulations, Guidelines For General ElectionsThe INEC Chairman stated this while responding to questions in an ongoing dialogue in Abuja.\nSeveral individuals and groups have raised serious concern about the sanctity of Elections materials kept with the CBN, after stories about the CBN governor, Mr Godwin Emefiele, indicating interest to contest for the country’s presidential seat hit the airwaves in recent months."
  },
  {
    "headline": "More Intrigues Ahead Of APC Primary: Aspirants Disqualified, Consensus Option Not Ruled Out",
    "summarized_story": "More drama unfolded on Friday as the All Progressives Congress (APC) ramps up preparations for a special convention for its presidential primary.\nWith about three days to the exercise, the atmosphere seems tense for some party faithful over the chances of their preferred aspirants to emerge as the APC presidential candidate.\nHe also hinted that 99 percent of the presidential aspirants agreed to support a consensus candidate.\nNot InterestedA total of 28 aspirants picked the APC presidential nomination and expression of interest forms sold at N100 million.\nThereafter, 23 aspirants appeared before the APC Presidential Screening Committee which cleared 13 for the exercise, with 10 others dropped."
  },
  {
    "headline": "Ukraine Says Russia Using ‘All Its Power’ To Capture Eastern City",
    "summarized_story": "Ukraine said Saturday its forces were managing to push back against Russian troops in fierce fighting in Severodonetsk despite Russia “throwing all its power” into capturing the strategic eastern city.\nWestern powers have slapped increasingly stringent sanctions on Russia and supplied arms to Ukraine but divisions have emerged on how to react.\nUkrainian Foreign Minister Dmytro Kuleba reacted Saturday by saying such calls “only humiliate France” and any country taking a similar position.\nOn Saturday, Ukrainian officials reported a large Orthodox wooden church, a popular pilgrim site, was on fire and blamed Russia.\nThe UN has warned African countries, which normally import over half of their wheat consumption from Ukraine and Russia, face an “unprecedented” crisis."
  },
  {
    "headline": "Photos: Buhari meets APC Presidential aspirants in Abuja",
    "summarized_story": "President Muhammadu Buhari is currently meeting with the Presidential aspirants of the All Progressives Congress, at the State House, in Abuja.\nThe highly anticipated meeting is expected to address matters arising ahead of the governing party’s presidential primary election."
  },
  {
    "headline": "Buhari meets Tinubu, Osinbajo, other Presidential aspirants in Aso Rock -",
    "summarized_story": "President Muhammadu Buhari is currently meeting with the Presidential aspirants of the All Progressives Congress, at the State House, in Abuja.\nThe highly anticipated meeting is expected to address matters arising ahead of the governing party’s presidential primary election.\nIn attendance are Asiwaju Bola Tinubu, Professor Yemi Osinbajo, Yahaya Bello, Kayode Fayemi, Godswill Akpabio, Rotimi Amaechi among others.\nThe screening committee set up by the party shortlisted only 13 out of 23 aspirants that purchased the nomination and expression of interest form.\nPresident Buhari had also told APC governors before he travelled to Spain that he would like to be allowed to pick his successor."
  },
  {
    "headline": "Benue: Special Congress confirms Terkimbi Ikyange victory",
    "summarized_story": "A Special congress of the All Progressives Congress, APC, held at Adikpo area of Benue State has ratified the nomination of the former Speaker, Benue State House of Assembly, Terkimbi Ikyange, as the nominated candidate of the Party for Kwande/Ushongo Federal Constituency in next year’s general election.\nTerkimbi Ikyange emerged winner of the Direct Primaries held across two local government areas of the Constituency last Saturday where he pulled a total of 52,179 votes to beat his closet challenger, Terseer Ugbor, who got 5579 votes and two other aspirants.\nResult of the Primary election in Ushongo Local Government Area shows that the former Speaker scored a total of 24,584 votes to beat his closet challenger, Thomas Shagbaor, who got 458 votes,While in Kwande, Mister.\nIkyange defeated his closet challenger and former House of Representatives member for Kwande/Ushongo, Benjamin Wayo with 27,595 votes as against 3957 vote.\nResponding after his unanimous adoption as candidate of the APC for Kwande/Ushongo Federal Constituency, Mr. Ikyange appreciated stakeholders and members of the party in the area for finding him worthy to fly the flag of the party in next year’s general electionHe further promised to consolidate on his legislative experience when elected."
  },
  {
    "headline": "- TVC News",
    "summarized_story": "Barely 48 hours to the APC Presidential Primaries, youths under the auspices of All Progressives Congress- National Forum say the only chance of the APC to emerge victorious come 2023 presidential elections is to elect a credible and competent aspirant from the North West geo- political zone who will be a presidential flag bearer for the party.The group through their Chairman Mustapha Mala Karamma while briefing Journalists in Maiduguri disclosed that their platform of over 6.8 million members are ever ready to submit to a competent leader who will succeed President Muhammadu Buhari come 2023.\nThey raised concern over the emergence of former Vice President Atiku Abubakar as the presidential candidate of the opposition Peoples Democratic Party, which the only way to challenge him is for APC to desist from zoning formula and unanimously nominate a North West presidential aspirant as Candidate"
  },
  {
    "headline": "Nigeria: See the Frontrunners as APC Clears 13 Presidential Aspirants",
    "summarized_story": "The seven-man All Progressives Congress (APC) Presidential Screening Committee headed by the former national chairman of the party, Chief John Oyegun on Friday announced that it had cleared 13 of the 23 aspirants screened, while recommending10 for disqualification ahead of the party’s Presidential primary election scheduled for next week.\nOf the 13 aspirants cleared, five of them are regarded as the frontrunners, with Vice President Yemi Osibanjo leading.\nOyegun revealed the recommendation to disqualify 10 presidential aspirants when he led other members of the committee to submit their screening report to the Abdulahi Adamu-led National Working Committee (NWC) of the party.\nThe point I want to make is the quality of the people that want to govern this country.\nVarious court decisions have affirmed this position, it is the party that is being represented and not individuals."
  },
  {
    "headline": "Nigeria: Buhari Didn’t Tell Governors to Pick Consensus Presidential Candidate",
    "summarized_story": "Presidential spokesperson, Femi Adesina, on Friday faulted claims that President Muhammadu Buhari asked members of the PGF to pick a consensus presidential candidate for the APC.\nAccording to him, Buhari told them what he would like to see at the APC presidential primary to elect a presidential candidate early next week.\n“He said no word about zoning, consensus, or imposition of candidate.\nAnd the wailing starts.”Buhari had while addressing the governors on Tuesday ahead of the party’s presidential primary taking place on Monday, said he would be seeking reciprocity from the governors ahead of the presidential primary.\nHe asked the governors to ensure that all interests ‘converge’ as regards the outcome of the presidential primary."
  },
  {
    "headline": "Tinubu: My Comments in Ogun Lost in Translation, My Respect for President Buhari High, Unfailing",
    "summarized_story": "In a statement he pushed out Friday, Tinubu said his comments had been misinterpreted by the media and that he did not disrespect President Buhari.\nHe said: “My respect and regard for President Buhari as Commander-in- chief of this nation and as a person are high and unfailing.\nI also believe President Buhari has a continuing and important role to play even after his tenure as president is over.\nBut President Buhari, of course, stands as the main driver of this success.\nPresident Buhari who will be accompanied by some Ministers and top government officials is expected back in Abuja later today."
  },
  {
    "headline": "Super Eagles Manager Peseiro Invites Musa, Ekong, 25 others for Sierra Leone, São Tomé",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria: Group Sues Tinubu, APC, INEC, Says Former Lagos Governor Ineligible to Run for President",
    "summarized_story": "A group representing Gaskiya Youth Movement has filed a suit against the All Progressive Congress, (APC), APC Presidential Aspirant, Bola Ahmed Tinubu and The Independent National Electoral Commission, (INEC) at the Federal High Court, Abuja.\nThe group seeks a ruling that will disqualify Bola Ahmed Tinubu from the presidential race over his “questionable” age and education."
  }
]