[
  {
    "headline": "Anthony Joshua will return bigger, better, stronger- Abike Dabiri",
    "summarized_story": "The Chairperson of the Nigerians in Diaspora Commission, Abike Dabiri-Erewa, has opined that Nigerian-British boxing champion, Anthony Joshua, will return to the boxing ring ‘bigger, better and stronger,’ after suffering defeat and losing his titles to Ukraine’s Oleksandr Usyk.\nThe NIDCOM boss sent the words of encouragement to Joshua following his defeat in the hand of Ukrainian professional boxer, Oleksandr Usyk, on Saturday night.\nJoshua lost his IBF, WBA, WBO heavyweight titles to the Ukrainian in front of a 65,000 crowd at Tottenham Hotspur Stadium.\nAJ will return bigger, better and stronger.”Shortly after losing the boxing bout, Joshua took to his social media account to motivate his fans, stating, “Keep positive even if the world’s crumbling in front of you!\nHe had his first defeat as a professional boxer last year in the hands of Andy Ruiz."
  },
  {
    "headline": "Lawan inaugurates FG-owned poultry farm in Yobe",
    "summarized_story": "President of the Senate, Ahmad Lawan, on Saturday inaugurated a poultry farm established by the Federal Government in Yobe State and declared that the regime of the President, Major General Muhammadu Buhari (retd.\nHe spoke on Saturday at the inauguration of a poultry farm which the National Agricultural Land Development Authority, established at Gasamu, in the Jakusko Local Government Area of Yobe State.\nWhen you look at the indirect opportunities, when you establish poultry farms across this zone, you would have brought in many youths to manage the poultry farms.\n“That means we should be able to have poultry farms coming up across this zone particularly in Jakusko Local Government.\nMr President has directed NALDA to establish Integrated Farm Estates in all the nooks and crannies of Nigeria."
  },
  {
    "headline": "Many bandits killed as security operatives repel attack on Zamfara community",
    "summarized_story": "The Zamfara State Police Command has claimed that many bandits were killed when they attempted to attack Shinkafi town in the state.\nThe police made this known while reacting to a report claiming that the town and a police station were attacked on Sunday.\nIn a statement by the Public Relations Officer of the command, Mohammed Shehu, joint Police and Military operatives were said to have repelled the bandits.\nThe statement read, “There was no attack on any Police station in Shinkafi LGA or any part of Zamfara state as wrongly reported.\n“Similarly, the report of an attack on Shinkafi town was also inaccurate."
  },
  {
    "headline": "These Six Emmy-winning shows feature Nigerian-born stars",
    "summarized_story": "In case you missed it, the 73rd Primetime Emmy Awards held on Monday, September 20th with TV’s biggest stars heating up the red carpet.\nAs Naija no dey carry last, we were even more excited because a number of the Emmy-nominated and Emmy-winning shows, all available for streaming on Showmax, feature actors of Nigerian origin.\nHere are 6 Emmy-nominated and Emmy-winning shows featuring actors of Nigerian origin worth checking out over the weekend.\nShe starred in the TV film Damilola, Our Beloved Boy, for which she won the BAFTA TV Award for Best Supporting Actress.\nThe series holds an 8.4/10 score on IMDb and an 83% critics rating on Rotten Tomatoes."
  },
  {
    "headline": "These Six Emmy-winning shows feature Nigerian-born stars",
    "summarized_story": "In case you missed it, the 73rd Primetime Emmy Awards held on Monday, September 20th with TV’s biggest stars heating up the red carpet.\nAs Naija no dey carry last, we were even more excited because a number of the Emmy-nominated and Emmy-winning shows, all available for streaming on Showmax, feature actors of Nigerian origin.\nHere are 6 Emmy-nominated and Emmy-winning shows featuring actors of Nigerian origin worth checking out over the weekend.\nShe starred in the TV film Damilola, Our Beloved Boy, for which she won the BAFTA TV Award for Best Supporting Actress.\nThe series holds an 8.4/10 score on IMDb and an 83% critics rating on Rotten Tomatoes."
  },
  {
    "headline": "ECA Commits to Building Capacity for Women & Youths",
    "summarized_story": "The capital needs to be accessible in order to create jobs and in return, grow the economy, he said.\nHe further emphasized youth capital accessibility for empowerment by advising that “every state and African country must have free and accessible hubs.\nVanessa Phalla, Director of the International Labor Office, Abuja during a Q&A session with the audience explained some ways to create and maintain the potential of Africa’s young labor force.\nShe indicated that “while a young and growing labor force is a potential resource, decent job opportunities need to be created for new labor market entrants”.\nThe highly impactful day was wrapped up by words from the moderator on behalf of ECA and all coalition partners."
  },
  {
    "headline": "ECA Commits to Building Capacity for Women & Youths",
    "summarized_story": "The capital needs to be accessible in order to create jobs and in return, grow the economy, he said.\nHe further emphasized youth capital accessibility for empowerment by advising that “every state and African country must have free and accessible hubs.\nVanessa Phalla, Director of the International Labor Office, Abuja during a Q&A session with the audience explained some ways to create and maintain the potential of Africa’s young labor force.\nShe indicated that “while a young and growing labor force is a potential resource, decent job opportunities need to be created for new labor market entrants”.\nThe highly impactful day was wrapped up by words from the moderator on behalf of ECA and all coalition partners."
  },
  {
    "headline": "ECA West Africa Calls for Support for Women and Youth",
    "summarized_story": "By Yemisi SuleimanThe recently concluded 3-day hybrid Regional Business Forum organized by the United Nations Economic Commission for Africa (ECA), through its Subregional Office for West Africa (SRO-WA), in collaboration with Compass Global Consulting, marked a significant turning point for the global agenda for Women and Youth’s empowerments in Africa.\nAfrica, in particular, the West African region, has the population dynamics working for it.\nThe representative of ECOWAS said that his organization will always be mindful of the roles women and youths play in economic development”.\nThis is to reinstate ECOWAS’ commitment to women and youth empowerment.\nThe 3-day event was fully packed with high-level delegates and insightful sessions and speeches that are bound to create major mind shifts to aid women and youth inclusion and advancement in Africa and the world at large."
  },
  {
    "headline": "Niger youth groups give trailer, tanker drivers 24 hours to vacate roads",
    "summarized_story": "National Youth Council of Nigeria, NYCN, Niger State chapter has issued a 24-hour ultimatum to the Nigerian Association of Road Transport Owners (NARTO) and Associations of Tanker Drivers asking heavy-duty vehicles drivers to vacate the roads.\nOther youth groups include Niger State Chapter Youth Lead Nigeria, Coalition of Northern Groups (CNG)Northern Youth Assembly of Nigeria, Niger State Students in Diaspora, Concerned Shiroro Youths, North Central Youth Parliament (NCYP), National Associations of Nigerian Students, Niger East Youth Frontiers (NEYFRO) as well as Muslim Students Society of Nigeria (MSSN).\nHe stated that should the protesting drivers fail to move from the roads, the youth groups in the state would explore many options which may include “Massive Civil Action”.\nThe youth groups strongly disagreed with any decision that has to do with re-opening of the ongoing reconstruction of Minna-Bida road by Niger State Government for heavy-duty vehicles.\nand the National Assembly Members from Niger State to ensure that part of the loan sought by the Presidency be used for LambattaLapai-Bida and Jebba-Tegina-Birnin Gwari Federal roads,” they maintained."
  },
  {
    "headline": "Florida appoints Nigeria-born Joseph Ladapo as surgeon general",
    "summarized_story": "Governor Ron DeSantis has appointed Nigeria-born Dr Joseph A. Ladapo as Florida Surgeon General and Secretary of the Florida Department of Health.\nDeSantis hailed Ladapo’s “superb background” and remarkable academic and medical career with a strong emphasis in health policy research.\nIn his remarks, Ladapo stressed that health policy decisions must be rooted in data and not in fear.\nLadapo was recently granted a professorship at the University of Florida (UF) College of Medicine.\nLadapo is a physician and health policy researcher whose primary research interests include clinical trial interventions and reducing the population burden of cardiovascular disease."
  },
  {
    "headline": "Police vs Lagos okada riders: CSP Kazeem Abonde’s murder an assault on Nigeria – CSER",
    "summarized_story": "The Centre for Social and Economic Rights (CSER) has condemned in strong terms the murder of Police Chief Superintendent Kazeem Abonde.\nOn Thursday, Abonde and his men moved against okada riders flouting the Lagos government’s directive in and around Ajao Estate.\nAs scores of the motorcycle operators revolted, the police operatives took to their heels for fear of being lynched.\nEkujumi regretted how Abonde’s team abandoned their commander to be executed in the discharge of lawful duty.\nHe declared that their “unprofessional” action “smacks of incompetence, dereliction of duty and culpability for murder”."
  },
  {
    "headline": "NARD strike: IMSUTH CMD, Nwamba begs FG to resolve doctors’ concerns",
    "summarized_story": "The Chief Medical Director (CMD) of Imo State Teaching Hospital, IMSUTH, Orlu, Dr. Ifeanyi Nwamba has called on the Federal Government to resolve the issues leading to the current strike by the National Association of Resident Doctors (NARD).\nNwamba also lauded the Imo State Government, under Gov Hope Uzodinma for the rehabilitation and continued development in IMSUTH.\nHe added that IMSUTH had become a beacon of hope to the 12 LGA’s in Orlu Senatorial zone and beyond.\nIMSUTH resident doctors join nationwide strikeHe said, “We are grateful to Imo State Governor for his support, without which, the Imo State Teaching Hospital IMSUTH, Orlu would not have recorded this impressive feat.\nHe said the last dialysis case treated in the hospital was done in March 2019 but today IMSUTH has commenced dialysis services with seven dialysis machines functioning."
  },
  {
    "headline": "NAFDAC raises alarm over use of petrol/kerosene tankers to convey groundnut oil, others",
    "summarized_story": "The National Agency for Food and Drug Administration and Control, NAFDAC, has raised the alarm over the alleged use of petrol and kerosene tankers to convey groundnut and vegetable oil in some parts of the country.\n“We rely on intelligence information as NAFDAC cannot be everywhere to motor the trend, this is a very dangerous practice,” she said.\nEven the owners of the petrol tankers or their family members can be victims.\n“We are warning them to desist from that as it is a dangerous practice.\nIt is an act of wickedness to make money at the altar of public health,” Prof. Adeyeye said."
  },
  {
    "headline": "Strike: NARD gives FG 72 hours to pay withheld salaries, others",
    "summarized_story": "The President of the NARD, Dr. Dare Ishaya, made this known in a statement at the end of the Association’s 41st Annual General Meeting (AGM) and Scientific Conference in Bauchi.\n“They also observed that some House Officers are still owed 1-2 months salaries and refunds of their illegally deducted accommodation fees.\nThe AGM noted that bench fee for outside postings by Resident Doctors has been abolished, however some chief medical directors are yet to fully implement it.\n“The federal government should prevail on various state governments to urgently pay arrears of salaries and allowances owed our members in the state tertiary health institutions as stated above.\n“The AGM also urged the federal government to consider universal implementation of the MRTA in all training institutions in the country including those in the states."
  },
  {
    "headline": "Chairmanship: More cracks in South West PDP",
    "summarized_story": "They are currently not on the same page as far as the national chairmanship position is concerned.\nBut former Ekiti State governor, Segun Oni, said PDP leaders and chieftains in the southwest zone were solidly behind Oyinlola in his quest for the PDP national chairmanship position.\nIf the chairmanship is coming to the South West, it would be contested by Lagos/Ogun.”Simply put, Olafeso, an ally of former Ekiti governor, Ayo Fayose, is saying Oyinlola cannot be the candidate of the zone for the national chairmanship.\n“The zone should leave the chairmanship position to the South East, or South-South.\nIt is the right time that the PDP should provide a South West vice president."
  },
  {
    "headline": "PDP holds parallel congress in Oyo; Adeleke, Ogunbiyi divide Osun",
    "summarized_story": "In some of the wards visited by our correspondents in Oyo State, parallel elections were held at the same venue, creating an atmosphere of fear and anxiety.\nSome leaders of the factional groups admitted in different speeches that parallel congresses were held across the state.\n“All interests have been accommodated and so there is no parallel congress here.\nOyo ward congress peaceful, fair, credible — ShaibuSpeaking earlier, the Chairman, PDP Ward Congress Committee and Deputy Governor of Edo State, Philip Shaibu, said the Committee did not notice any parallel congress in the state.\nAdeleke, Ogunbiyi’s camps conduct parallel congresses in OsunThe unsettled crisis within the Peoples Democratic Party, Osun State has resulted in the party holding parallel ward congresses yesterday."
  },
  {
    "headline": "PDP: Fresh defection fears trail two Southeast, South-South governors",
    "summarized_story": "Our governor has made it clear from day one that what we want is the 2023 presidential ticket of the party.\nThat is why no chieftain of the PDP from our state has shown interest in the national chairmanship position,” he said.\n“He, however, reiterated his determination to join another party if PDP fails to zone the ticket to the South.\nMany of the lawmakers were, however, taken aback by reports of the zoning of the chairmanship to the South.\nHe said: “Going by PDP tradition, it is very clear where the presidential ticket will go if the current arrangement is allowed to stand."
  },
  {
    "headline": "IPOB, Yoruba nation agitators dare Buhari in New York",
    "summarized_story": "Some journalists were also not spared as some of the protesters accused them of writing “rubbish” in favour of the Buhari administration.\nThe protesters accused them of being aiding and abetting Fulani herdsmen, who they accused of killing members of other tribes in Nigeria.\nOne of the leaders of Yoruba nation, Foluso Aruleba, who apologized to some of the journalists hounded said: “Please forgive our people.\nWe work and pray, pray and work.\nIsaiah 26:3.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "2023: God‘ll be against Jonathan getting automatic presidential ticket in APC – Nabena, ex-party spokesman",
    "summarized_story": "Even when they labelled APC an Hausa party in Bayelsa, we took the governorship ticket, a senatorial and two House of Representatives seats.\nHow do you feel hearing the speculation that APC is lobbying former President Goodluck Jonathan for 2023 presidential ticket?\nBy the way, having attained the highest office in the land, what is he looking for again joining the APC?\nIn fact, he cannot get APC ticket by God’s grace and I am very sure that God will not even allow him get it.\nIf the state governors cannot secure the people after collecting a security vote they should not put pressure on the Federal Government."
  },
  {
    "headline": "I want to redefine African film with African stories –Sandra Bremaud, filmmaker",
    "summarized_story": "By Rita OkoyeAside being a filmmaker, Sandra Bremaud is also a lover of nature.\nApril Showers was inspired by women who are striving and conquering in their fields of work through hard work and intelligence.\nThere are so many angles one can see it from, and that is what makes April Showers a unique movie for every African.\nI want to help redefine the African film industry by telling our African story the same way an American will tell an American story.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Third Force: APC, PDP will crumble before 2023 – Jackson-Lekan Ojo, APC stalwart",
    "summarized_story": "There are lot of hurdles the APC needs to cross before the ruling party can call it Uhuru.\nThere is no united APC that has the forces of confrontation to withstand any external force coming in 2023.\nSomebody like Pat Utomi has sound relationship with some APC stalwarts, Prof Adeniran has good relationship with topnotch party members in both APC and PDP.\nYou have identified lack of internal and genuine cohesion and strength as the major threat to the ruling APC.\nThe political power we are talking about in Nigeria now is nothing else but money."
  },
  {
    "headline": "Another oil crisis looms as NUPENG begins strike on October 8",
    "summarized_story": "Bimbola OyesolaPetroleum tanker drivers’ arm of the Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) has threatened to embark on an industrial action from October 8, 2021 should the Federal Government fail to address all the contentious issues confronting the union.\nIt has also directed all the tanker drivers to commence a work-to-rule action from Monday.\nAccording to Oladiti, the union at its meeting on March 27, 2021, had drawn government’s attention to the increasing rate of fire incidences involving petroleum trucks with accompanying destruction of lives and properties of its members and the public.\nRecall that the union had threatened to embark on a nationwide strike from May 1, but later suspended it.\n“These highways have turned to death traps and dens of truck highjackers for the Petroleum Tanker Drivers."
  },
  {
    "headline": "Buhari Back in Abuja after a Week-long Official Visit to UN",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is back in Abuja, the nation’s capital, after a week-long stay in New York, United States of America (USA), to attend the 76th Session of the United Nations General Assembly (UNGA).\nThe president, whose official plane, Nigeria Air Force 1, touched down at the Nnamdi Azikiwe International Airport, Abuja at about 5:20am on Sunday, left immediately for his abode at the Presidential Villa in Asokoro.\nWhile in New York, President Buhari, apart from addressing the United Nations General Assembly last Friday, also engaged in a number of diplomatic and trade meetings with other leaders from different parts of the world.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "After 10 Years Study, INEC Says Nigeria Ready for Electronic Voting",
    "summarized_story": "The commission sought a clear legal mandate for the implementation of the electronic transmission of election results with the Electoral Act amendment.\n“It is worthy of note that none of the sides in this controversy appears to substantially question the desirability of electronic transmission of election results.\nINEC stated that the answer to the question of the desirability of electronic transmission of election results in Nigeria today may be summed up in three words – trust, efficiency, and safety.\nINEC said the conclusion it drew from the “diverse pilots conducted since 2011 is that the country is ready for electronic transmission of results.\nThis partnership has continued with the discussion on electronic transmission of results,” INEC added."
  },
  {
    "headline": "SANs Tackle Malami, Insist VAT Not on Exclusive List",
    "summarized_story": "One, generally speaking, as you rightly know, the issue of the Value-Added Tax is an issue on the Exclusive Legislative List,” Malami said.\n“And the implication of being in Exclusive Legislative List matter is that only the National Assembly can legislate on it.\nBut another senior lawyer, Mr. Ahmed Raji (SAN) expressed the belief that Malami was misquoted, not heard properly, or misrepresented in his claim that VAT is on the Exclusive Legislative List.\n“In other words, the VAT cannot be located in either the Exclusive or Concurrent Legislative List.\nHe, therefore, contended that the VAT “is not on the Exclusive Legislative List at all."
  },
  {
    "headline": "Emefiele: CBN’s COVID-19 Interventions Account for 3.5% of GDP",
    "summarized_story": "•UBA publishes names, account details of forex defaultersNume Ekeghe and Dike OnwuamaezeAThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has disclosed that the apex bank’s interventions to protect the economy from the impacts of COVID-19 represented 3.5 per cent of Nigeria’s Gross Domestic Product (GDP).\nNigeria’s GDP was estimated at $432.29 billion by the National Bureau of Statistics (NBS) in the second quarter of 2021.\nThe design of the interventions, according to him, was hinged on the need to develop enabling infrastructure in critical sectors to drive economic growth and development.\nEmefiele said access to finance remained one of the biggest threats to MSME development with serious implications for productivity, economic development, and job creation.\nThe account numbers and Bank Verification Numbers (BVN) of the defaulters were included in the publication on the bank’s website."
  },
  {
    "headline": "UK Approves COVID-19 Vaccines Administered in Nigeria",
    "summarized_story": "Chinedu Eze in Lagos and Olawale Ajimotokan in AbujaThe British High Commissioner to Nigeria, Catriona Laing, yesterday debunked statements suggesting that the COVID-19 vaccines administered in Nigeria were not approved by the UK.\nThe UK has also moved Nigeria to the “rest of the world” travel list about the travel rule billed to take effect from October 4, 2021.\nIn a statement yesterday, Laing said the UK approves of vaccines currently in use in Nigeria irrespective of the manufacturer.\nShe said the UK has so far donated 1.2 million vaccines to Nigeria through COVAX and will continue to support the country in accessing COVID-19 vaccines.\n“I would like to emphasise that any statements that COVID-19 vaccines administered in Nigeria are not approved by the UK are completely untrue."
  },
  {
    "headline": "VIDEO: 45MVA Transformer Destroyed As Fire Breaks Out At Apo Transmission Substation",
    "summarized_story": "There was a fire incident at the 132/33 kilovolts (kV) Apo transmission substation in Abuja on Sunday afternoon, resulting in the destruction of a 45MVA transformer.\nThe substation is operated by the transmission Company of Nigeria (TCN).\nConfirming the incident, the Abuja Electricity Distribution Company (AEDC), which feeds directly from the substation to supply the end users, said the fire had been brought under control.\n“Our technical team is right now working with the TCN engineers to see how to absorb the load on the 45MVA transformer that was affected by the fire,” AEDC said in a statement.\nBabatunde Fashola, Minister of Power, Works and Housing, also confirmed the tragedy, saying the fire had been extinguished, with plans underway to redistribute power to communities served by the burnt transformer."
  },
  {
    "headline": "VIDEO: 45MVA Transformer Destroyed As Fire Breaks Out At Apo Transmission Substation",
    "summarized_story": "There was a fire incident at the 132/33 kilovolts (kV) Apo transmission substation in Abuja on Sunday afternoon, resulting in the destruction of a 45MVA transformer.\nThe substation is operated by the transmission Company of Nigeria (TCN).\nConfirming the incident, the Abuja Electricity Distribution Company (AEDC), which feeds directly from the substation to supply the end users, said the fire had been brought under control.\n“Our technical team is right now working with the TCN engineers to see how to absorb the load on the 45MVA transformer that was affected by the fire,” AEDC said in a statement.\nBabatunde Fashola, Minister of Power, Works and Housing, also confirmed the tragedy, saying the fire had been extinguished, with plans underway to redistribute power to communities served by the burnt transformer."
  },
  {
    "headline": "'Private NEPA' — Subsistence Electricity Sharing Centres On The Rise In Bayelsa Due To Persistent Blackouts",
    "summarized_story": "New local power distribution centres colloquially called 'Private NPEA' are emerging in Yenagoa, the Bayelsa State capital, to solve the persistent power outage and blackout in most areas in the state.\nNEPA, in full the National Electric Power Authority (NEPA), is the defunct organisation that governed the use of electricity in Nigeria.\nOthers have even taken to town criers to urge residents not to pay any bill brought to them by the power distribution company.\nThe patronage of these local power distribution companies is rising by the day, with small business operators and private resident owners struggling to be connected.\nA man, who identified himself as James, told SaharaReporters that he patronises the local distribution company known as 'private NEPA' in his area due to the convenience."
  },
  {
    "headline": "'Private NEPA' — Subsistence Electricity Sharing Centres On The Rise In Bayelsa Due To Persistent Blackouts",
    "summarized_story": "New local power distribution centres colloquially called 'Private NPEA' are emerging in Yenagoa, the Bayelsa State capital, to solve the persistent power outage and blackout in most areas in the state.\nNEPA, in full the National Electric Power Authority (NEPA), is the defunct organisation that governed the use of electricity in Nigeria.\nOthers have even taken to town criers to urge residents not to pay any bill brought to them by the power distribution company.\nThe patronage of these local power distribution companies is rising by the day, with small business operators and private resident owners struggling to be connected.\nA man, who identified himself as James, told SaharaReporters that he patronises the local distribution company known as 'private NEPA' in his area due to the convenience."
  },
  {
    "headline": "'Private NEPA' — Subsistence Electricity Sharing Centres On The Rise In Bayelsa Due To Persistent Blackouts",
    "summarized_story": "New local power distribution centres colloquially called 'Private NPEA' are emerging in Yenagoa, the Bayelsa State capital, to solve the persistent power outage and blackout in most areas in the state.\nNEPA, in full the National Electric Power Authority (NEPA), is the defunct organisation that governed the use of electricity in Nigeria.\nOthers have even taken to town criers to urge residents not to pay any bill brought to them by the power distribution company.\nThe patronage of these local power distribution companies is rising by the day, with small business operators and private resident owners struggling to be connected.\nA man, who identified himself as James, told SaharaReporters that he patronises the local distribution company known as 'private NEPA' in his area due to the convenience."
  },
  {
    "headline": "‘Thousands’ dump APC for PDP in Gombe",
    "summarized_story": "John Yoriyo, former deputy governor of Gombe, and an unconfirmed number of card-carrying members of the All Progressives Congress (APC) in the state, have defected to the Peoples Democratic Party (PDP).\nM. A Kwaskebe, Gombe PDP chairman in the state, received the defectors on Saturday at the party secretariat on behalf of Ibrahim Dankwambo, party leader and former governor of the north-east state.\n“We are glad to receive those that left the party, thinking that the PDP had collapsed.\nAdvertisementIn his remarks, Yoriyo described the PDP as the “best political party” in the country in terms of governance.\nAdvertisement“There was nothing like democracy under APC in Gombe State."
  },
  {
    "headline": "‘Thousands’ dump APC for PDP in Gombe",
    "summarized_story": "John Yoriyo, former deputy governor of Gombe, and an unconfirmed number of card-carrying members of the All Progressives Congress (APC) in the state, have defected to the Peoples Democratic Party (PDP).\nM. A Kwaskebe, Gombe PDP chairman in the state, received the defectors on Saturday at the party secretariat on behalf of Ibrahim Dankwambo, party leader and former governor of the north-east state.\n“We are glad to receive those that left the party, thinking that the PDP had collapsed.\nAdvertisementIn his remarks, Yoriyo described the PDP as the “best political party” in the country in terms of governance.\nAdvertisement“There was nothing like democracy under APC in Gombe State."
  },
  {
    "headline": "Ganduje appoints Aliyu Ibrahim as new Emir of Gaya",
    "summarized_story": "Abdullahi Ganduje, governor of Kano state, has approved the appointment of Aliyu Ibrahim as the new Emir of Gaya emirate.\n“By the power conferred on the governor of Kano state by Kano emirates law 2020 (as amended) approved the appointment of Alhaji Aliyu Ibrahim Abdulkadir as emir of Gaya,” he said.\nAdvertisementIbrahim was the ciroman of Gaya before his appointment as emir of Gaya.\nThe Gaya emirate is one of the four emirates created by Ganduje in 2019 when he split the Kano emirate into five: Gaya, Rano, Bichi and Karaye.\nUntil the creation of the four new emirates, Kano had one emir just like Sokoto state."
  },
  {
    "headline": "Ganduje appoints Aliyu Ibrahim as new Emir of Gaya",
    "summarized_story": "Abdullahi Ganduje, governor of Kano state, has approved the appointment of Aliyu Ibrahim as the new Emir of Gaya emirate.\n“By the power conferred on the governor of Kano state by Kano emirates law 2020 (as amended) approved the appointment of Alhaji Aliyu Ibrahim Abdulkadir as emir of Gaya,” he said.\nAdvertisementIbrahim was the ciroman of Gaya before his appointment as emir of Gaya.\nThe Gaya emirate is one of the four emirates created by Ganduje in 2019 when he split the Kano emirate into five: Gaya, Rano, Bichi and Karaye.\nUntil the creation of the four new emirates, Kano had one emir just like Sokoto state."
  },
  {
    "headline": "COVID-19: Nigeria reports 210 new infections -- 56 percent drop in 24 hours",
    "summarized_story": "Nigeria’s daily count of coronavirus infections recorded a drop on Saturday with 210 new cases confirmed in 12 states and the federal capital territory (FCT).\nAdvertisementSaturday’s figure is a 56 percent decrease over the past 24 hours — 477 new cases were confirmed on Friday.\nThe Nigeria Centre for Disease Control (NCDC) published the new cases in its update for September 26, 2021.\nWith the new figure, the total number of COVID-19 recoveries in Nigeria stands at 192,421.\nA total of 204,201 coronavirus infections have now been confirmed in the country."
  },
  {
    "headline": "ChatBots Africa, Fashtracker win pitch sessions at TechCabal’s ‘Future of Commerce’",
    "summarized_story": "ChatBots Africa and Fashtracker have been announced as winners of the partnership and investment pitch sessions, respectively, organised by TechCabal as part of the ‘Future of Commerce’ conference.\nHeld on Friday, 24th of September, the partnership pitch session saw a total of three growth-stage startups pitch to corporate organizations for potential partnerships while the investment version involved four early-stage startups pitching to potential investors.\n“For my team and I, winning at the pitching session validates our vision for the future of e-commerce in Africa, that is, conversational and social commerce,” Ronald Tagoe, Founder of ChatBots Africa, told TechCabal.\nNigeria-based Fashtracker connects trusted and sustainable African fashion brands to people within and outside the continent through its online platform.\n“Especially during such tough times in Nigeria – economic prosperity is key.”A screenshot of ChatBots Africa website."
  },
  {
    "headline": "What will commerce look like in Africa over the next decade?",
    "summarized_story": "With Covid-19 restrictions forcing more people to shop online, e-commerce companies and platforms on the continent have enjoyed a surge in activity.\nThis is provided e-commerce platforms continue to solve problems consumers face and offer more suites of offerings.\nAccording to Nkebet Mesele, Senior Director for Solutions Management in sub-Saharan Africa at Visa, that entails making commerce in Africa “mobile-led”.\n“For commerce to grow across Africa, the building blocks that have to be in place are first, it has to be mobile-led.\n“But it starts with building solutions for people on the ground.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "How edtech startup, Stranerd is connecting Nigerian students to tutors",
    "summarized_story": "On the supply side, there are more students or prospective students than there are schools.\nSource: SuppliedOn the website, which currently serves mainly Nigerian students, the startup employs a coin system to charge students.\nThe goal, Godwin says, is to become a one-stop-shop for the Nigerian student’s educational needs and possibly African students also.\nThey also want to include connecting students to internships as well as providing study-abroad services to students.\nBut first, the startup plans to build trust among the students before leveraging it to add more services."
  },
  {
    "headline": "Hearing impairments and technology, ReelFruit’s $3m raise, Apple Pay on Paystack",
    "summarized_story": "Today I’m discussing:Living with hearing impairments in a tech-enabled worldRealFruit’s $3 million Series APaystack launching Apple Pay to help Nigerian businessesLiving with hearing impairments in a tech-enabled worldWeYesterday, Thursday, September 23, 2021, was the International Day of Sign Languages.\nPaystack launches Apple Pay to help Nigerian businessesPaystack, an African fintech company that powers and processes payments for businesses, announced yesterday that Pay with Apple Pay is now available on its platform.\nNigerian businesses will have access to millions of Apple Pay users across more than 60 countries where the payments service is available.\nWhen a customer with Apple Pay buys from a Paystack merchant, they will see the option to checkout using Pay with Apple Pay.\nFlutterwave, an African payments company, integrated PayPal into its platform in March 2021, allowing PayPal customers worldwide to pay African merchants via its “Pay with PayPal” feature."
  },
  {
    "headline": "What does communication in a techy world mean for Nigeria’s deaf people?",
    "summarized_story": "#WeSignForHumanRightsNigeria’s deaf communityWeAccording to Oluwaseun Sosanya, a sign language interpreter, tutor, and deaf advocate, the deaf community “is a collection of people that share the same idea, belief, and culture, and use sign language to communicate.\n“The community includes the two categories of deaf — pre-lingual and post-lingual deaf — parents of the deaf, sign language interpreters, and all users of sign language.\nSignFor the African deaf community, the prevalent sign language is the American Sign Language (ASL) which Andrew Foster — regarded as the Father of Deaf Education in Africa — brought into the continent.\nMobile apps that provide sign language tutoring for beginners, such as the ASL American Sign Language and the Ghanian Sign Language app.\nThe deaf community believed it to be more accommodating of the hearing community without regard to the deaf people — who it was purporting to help."
  },
  {
    "headline": "Projects worth N12trn abandoned across Nigeria",
    "summarized_story": "Rising security challenges in Nigeria, which have impacted all businesses, are taking a deadlier toll on the hospitality sector, especially in the northern part the country, with dwindling investment in the sector due to perceived unsafe business environment.\nBesides security concerns, most of the projects, according to Abba Tor, president, Nigerian Institute of Quantity Surveyors (NIQS), were abandoned due to poor research on the monetary estimates required for them.\nHospitality sector, as a segment of the real estate market, is a major victim.\nDespite the boom in the hospitality sector, in the last two decades, no foreign branded hotel is located in Northern Nigeria except Abuja, which investors, who shun the other states in the region, perceive to be safe.\nThe region has seen significant destruction of homes by insurgents, more so in the crisis-ridden states like Borno and Kaduna."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "In the coming week, oil prices are expected to grow steadily supported by global output disruptions and inventory draws.\nMoney marketDespite the liquidity inflow during the week, money market rates remained elevated supported by the primary market auction by DMO at the middle of the week.\nTreasury bills marketThe Nigerian Treasury Bills market was mostly tepid last week as attention was focused on the Eurobond and bond issued during the week.\nSectoral performance across sectors tracked was mixed last week as the NGX Insurance was the highest gainer for the week with +1.75%.\nMarket breadth for the week closed positive with 28 gainers led by PHARMDEKO and NAHCO as against 23 losers led by SCOA and PRESCO"
  },
  {
    "headline": "Anambra guber: The battle of moneybags and intellectuals",
    "summarized_story": "In 1999, Chinwoke Mbadinuju, a legal practitioner, became the governor of Anambra State at the behest of Emeka Offor, an oil mogul.\nHe later joined the All Progressives Grand Alliance in preparation for the November 2013 governorship race in Anambra State.\nHe also worked in the banking sector, gaining over 17 years of experience with NAL Merchant Bank, Diamond Bank, Continental Trust Bank, FSB International Bank, Standard Trust Bank, United Bank for Africa and Bank PHB.\nPreviously, Ozigbo worked in the banking sector, racking up over 17 years in experience with NAL Merchant Bank, Diamond Bank, Continental Trust Bank, FSB International Bank, Standard Trust Bank, United Bank for Africa and Bank PHB.\nHe had his early education in Onitsha, Anambra State, where he combined trading at the Main Market and managing a horde of apprentices, with schooling."
  },
  {
    "headline": "Ending Law Enforcement Officers Brutality in Nigeria – Nigerian Observer",
    "summarized_story": "I also preferred a different approach to tackling Police Brutality to Protest Marches because of precedents.\nThis poor work ethics of police officers is systemic issue and it is why it has become recurring subject.\nYes, we sometimes read the gory stories but in truth, Police Officers on a daily basis simply do not do their jobs.\nThere are many more …I took time during the #EndSARS Protest to read reports of Police victimization.\nIt is good that we have identified this monster (Police Brutality), we however now know that it is actually – Law Enforcement Officers Brutality – as it is not limited to Police alone."
  },
  {
    "headline": "Oyo ward congress peaceful, fair and credible- Shaibu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestDeputy Governor of Edo State Comrade Philip Shaibu has described the ongoing congress in Oyo State as peaceful, fair and Credible.\nAccording to him, “we are here in the State to do the bidding of the masses and we are currently fulfilling that obligation in making sure that the ward congress that is currently ongoing in the 351 wards across the State is peaceful and credible”.\nThe Edo Deputy Governor, who is the Chairman of the Committee set up by the PDP headquarters to conduct the Oyo State Ward Congress, also noted that though they were aggrieved members, the party would try and resolve all issues.\nMajority of the people are in support of the peaceful reconciliation process and the discussions that are still ongoing”.\nThe Edo Deputy Governor who spoke in Ibadan while fielding questions from journalists gave a condition that can only make it possible for the main opposition Peoples Democratic Party (PDP) to take over Nigeria’s Presidency in 2023."
  },
  {
    "headline": "Why we trained over 11,300 teachers, empowered them with digital teaching tools – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said his administration has trained over 11,365 teachers in the state since the introduction of Edo Basic Education Sector Transformation (EDOBEST) in 2018, deploying digital teaching tools to provide functional basic education to Edo children.\nObaseki said this at the 29th annual International Conference of the Association of Vocational Education of Nigeria (AVTEN), held at the University of Benin (UNIBEN).\nThe governor noted that his administration’s sustained investment in basic education is hinged on its role at boosting technical and vocational training.\n“Without that foundation, you cannot build a solid technical and vocational education.\nSo, since 2018, we commenced the revamping of the state’s basic education through our EDOBEST programme."
  },
  {
    "headline": "EdoJobs, GIZ launch cash for work scheme for 225 artisans in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Skills Development Agency (EdoJobs) in partnership with the Deutsche Gesellschaft für Internationale Zusammenarbeit GmbH (GIZ)’s Skills Development for Youth Employment (SKYE) has launched cash for work scheme for 225 artisans in the state.\nAddressing journalists after launching the programme, Managing Director, Edo State Skill Development Agency, Mrs. Ukinebo Dare, said the initiative was part of efforts to actualise Governor Godwin Obaseki’s mandate on skills development and jobs creation for the youths.\nAccording to her, “We are inaugurating the EdoJobs Cash for Work Scheme in partnership with (GIZ), and the programme is meant for people in different trades.\nWe thank Governor Godwin Obaseki and our partners for this project.”On his part, the Project Manager for Edojobs for Cash Work Scheme-GIZ Skills Development for Youth Empowerment, Engr.\nIyalekhue Osazuwa, said the programme is geared towards training youths on different subjects and skills for three months."
  },
  {
    "headline": "BREAKING: Seven abducted family members freed in Abuja",
    "summarized_story": "ADVERTISEMENTThe seven relatives of Gabriel Oladapo, who reside in Pegi resettlement community in Kuje area council of Abuja, were freed on Sunday, three weeks after their abduction.\n“They were rescued alongside other victims (farmers) between the ages of 13-17,” said Aderibigbe Isaac-Taiwo, the chairman of Pegi community in Kuje who confirmed the development to PREMIUM TIMES.\nPREMIUM TIMES reported how Pegi had turned a kidnappers’ haven despite housing a division of the Nigerian police and a naval barracks.\n“As we speak, the man and his family have relocated from the community,” Mr Taiwo said.\nDetails of the release are still sketchy but a resident said their release was facilitated by security officials and members of a local vigilante group."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "7,000 Youth Benefit From CBN’ Anchor Borrowers Programme In Ogun",
    "summarized_story": "dowu Olakunle, AbeokutaNo fewer than seven thousand youths drawn from various parts of Ogun State have benefitted from the state government’s Cassava Intervention Project.\nThe project is financed under the Central Bank’s Anchor Borrowers’ Agricultural Programme .\nThe Chief Press Secretary to Governor Dapo Abiodun, Kunle Somorin, made the disclosure at the weekend.\nIt would be recalled that the agricultural project, tagged ‘Mega Ogun State Cassava Intervention Project’ was, flagged off in May 2020, by the state governor, Prince Dapo Abiodun, was commenced with about 3,500 candidates presented to the CBN by the state government.\n“The linkage programme is continuous as there are otbher six sites to follow which include, Pagbonrinoba (Ipokia LGA) Afon Estate (Imeko LGA) Mapoly (Obafemi Owode LGA), Obafe Town (Obafemi Owode LGA), Apojola(Odeda LGA) and Omugbawojo(Ijebu North East LGA)”."
  },
  {
    "headline": "Anthony Joshua beaten by Ukrainian Oleksandr Usyk in London",
    "summarized_story": "“The fight went exactly the way I expected it to go.\n“I have been working so hard since January in preparation for this fight,” Usyk said.\nJoshua looked tired as the fight went on and he looked tired a little bit.\nI thought he had the perfect game plan and tonight he makes history as the unified heavyweight world champion.\nAnthony Joshua (c) (117-112, 116-112, 115-113)CBS"
  },
  {
    "headline": "IPOB bans Nigerian flag in Southeast, declares sit-at-home protest Oct 1",
    "summarized_story": "Separatist group, the Indigenous People of Biafra (IPOB), has banned the use Nigerian flag in the country’s Southeast zone.\n“IPOB has declared 1st of October 2021 total shutdown in Biafra land as a sign of our rejection of the evil construct called Nigeria and there shall be no movement in Biafra land on this day,” he said.\n“Also, IPOB has declared from today 25th September 2021 that all Nigerian flag mounted anywhere in Biafra land must be brought down, Banks exceptional.\n“We, therefore, urge world leaders to use the opportunity of the ongoing United Nations General Assembly meeting to discuss the sufferings of the two persecuted nations of Biafra and Ambazonia.\nOur people have suffered enough in the hands of our oppressors who are in bed with terrorists but derive pleasure in crushing peaceful agitators instead of addressing our genuine concerns.”"
  },
  {
    "headline": "Debt: Nigeria’s govt hits back at Obasanjo, others, says critics of borrowing insincere",
    "summarized_story": "The criticisms came particularly in the light of last week’s request by Buhari for another external loan to the Senate.\nThe National Assembly had earlier in July approved the President’s request to borrow $8.3 billion and €490 million loans contained in the initial 2018-2020 borrowing plan.\nThese critics are very insincere; we do not borrow for recurrent expenditure neither do we borrow to pay salaries.\nThe Minister noted that the Federal Government has over 13,000 kilometres of federal roads under repair, rehabilitation and reconstruction.\n“There’s a road project in every state today."
  },
  {
    "headline": "Conference: Can INEC Get Power To Transmit Election Result Electronically?",
    "summarized_story": "The has been contention over the mode of election and the mode of election results transmission.\nInitially, the lawmakers had argued that the Independent National Electoral Commission (INEC) don’t have the capacity to transmit election results electronically.\nBut the commission came out to debunked such a notion, stating that the have the capacity to conduct election electronically and transmit the election results electronically.\nApart from Lilian Ekwunife representing the South East, all the listed lawmakers for the conference voted against INEC having the sole power to transmit election result electronically.\nWith the composition of the conference committee, Nigerians are waiting to see what will be the faith of INEC on election conduct and transmission in the future polls."
  },
  {
    "headline": "Conference: Can INEC Get Power To Transmit Election Result Electronically?",
    "summarized_story": "The has been contention over the mode of election and the mode of election results transmission.\nInitially, the lawmakers had argued that the Independent National Electoral Commission (INEC) don’t have the capacity to transmit election results electronically.\nBut the commission came out to debunked such a notion, stating that the have the capacity to conduct election electronically and transmit the election results electronically.\nApart from Lilian Ekwunife representing the South East, all the listed lawmakers for the conference voted against INEC having the sole power to transmit election result electronically.\nWith the composition of the conference committee, Nigerians are waiting to see what will be the faith of INEC on election conduct and transmission in the future polls."
  },
  {
    "headline": "2023: Ohanaeze Insists On Igbo Presidency",
    "summarized_story": "Ohanaeze Ndigbo Worldwide, the highest Igbo decision making body, has maintained its ground on a president of Igbo extraction in 2023.\nAccording to him, a president of Igbo extraction in 2023 is not negotiable and the region cannot change its position on this.\nHe stressed that the organization had been reaching out to political parties and notable stakeholders outside the South East for the actualisation of Igbo presidency come 2023.\nHe said a president of Igbo extraction would further portray equity, justice and fair play, virtues for which the country is known.\nOn the Igbo Day celebration, Chief Ibeh stated that the Igbo language Seminar, Igbo Security Conclave and Imeobi Expandable meeting will hold in Enugu State."
  },
  {
    "headline": "2023: Ohanaeze Insists On Igbo Presidency",
    "summarized_story": "Ohanaeze Ndigbo Worldwide, the highest Igbo decision making body, has maintained its ground on a president of Igbo extraction in 2023.\nAccording to him, a president of Igbo extraction in 2023 is not negotiable and the region cannot change its position on this.\nHe stressed that the organization had been reaching out to political parties and notable stakeholders outside the South East for the actualisation of Igbo presidency come 2023.\nHe said a president of Igbo extraction would further portray equity, justice and fair play, virtues for which the country is known.\nOn the Igbo Day celebration, Chief Ibeh stated that the Igbo language Seminar, Igbo Security Conclave and Imeobi Expandable meeting will hold in Enugu State."
  },
  {
    "headline": "7,000 Ogun Youths Benefit From CBN’s Anchor Borrowers Programme",
    "summarized_story": "Over seven thousand youths in Ogun State have so far been empowered by the Central Bank’s Anchor Borrowers’ agricultural programme through the Cassava Intervention Project by the state government.\nThis was contained in a statement by the chief press secretary to Governor Dapo Abiodun, Kunle Somorin, at the weekend.\nSomorin said the agricultural project, tagged ‘Mega Ogun State Cassava Intervention Project’ was flagged off May 4, 2020, by Governor Abiodun, as part of his administration’s resolve to ensure food security and youth empowerment.\nSomorin stated further that the project, has however, been expanded to accommodate additional 3,500 candidates, while the governor approved the clearing of 2,500h of land by the State Ministry of Agriculture.\nCumulative beneficiaries are now close to 7,000."
  },
  {
    "headline": "VIDEO: 10 FASCINATING FACTS ABOUT NOLLYWOOD SUPER STAR, GENEVIEVE NNAJI",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: 10 FASCINATING FACTS ABOUT NOLLYWOOD SUPER STAR, GENEVIEVE NNAJI",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Nigerian Pensioners lament: We’re Starving To Death, Nigeria Security Printing and Minting Company Pay Us N1000 Monthly",
    "summarized_story": "Some pensioners of the Nigeria Security Printing and Minting Company Plc have appealed to the Muhammadu Buhari-led government to come to their aid and save them from dying of hunger.\nSaharaReporters gathered that the pensioners’ impediment is the erroneous computing of their gratuity and pension as recognised by the Pension Act Cap 346 of 1990.\nRather than this, the Mint resorted to use of the pension trust deed against the above Pension Act.\n“I worked with the Nigeria Security Printing and Minting Plc at Victoria Island, Lagos, for 16 years.\nWe were been paid a token of N500 monthly before but it was amended five years ago to N1000 per month."
  },
  {
    "headline": "Nigerian Pensioners lament: We’re Starving To Death, Nigeria Security Printing and Minting Company Pay Us N1000 Monthly",
    "summarized_story": "Some pensioners of the Nigeria Security Printing and Minting Company Plc have appealed to the Muhammadu Buhari-led government to come to their aid and save them from dying of hunger.\nSaharaReporters gathered that the pensioners’ impediment is the erroneous computing of their gratuity and pension as recognised by the Pension Act Cap 346 of 1990.\nRather than this, the Mint resorted to use of the pension trust deed against the above Pension Act.\n“I worked with the Nigeria Security Printing and Minting Plc at Victoria Island, Lagos, for 16 years.\nWe were been paid a token of N500 monthly before but it was amended five years ago to N1000 per month."
  },
  {
    "headline": "Buhari given 14 days to publish looters of NDDC's N6T",
    "summarized_story": "President Muhammadu Buhari has been given a 14-day ultimatum to publish the names of those indicted in the misappropriation of over N6 trillion in Niger Delta Development Commission (NDDC).\nThe looting occurred between 2000 and 2019, as documented in the recent Forensic Audit Report on NDDC.\nSocio-Economic Rights and Accountability Project (SERAP) gave the ultimatum, threatening legal action to force the disclosure of the looters.\nThe group asked Buhari to direct the Attorney General of the Federation and Minister of Justice Mr Abubakar Malami to publish the looters’ list.\nThe UN Convention against Corruption requires your government to ensure effective prosecution of allegations of corruption.”“Specifically, article 26 of the convention requires your government to ensure “effective, proportionate and dissuasive sanctions” including criminal and non-criminal sanctions, in cases of grand corruption."
  },
  {
    "headline": "Labour's Rayner to Johnson's team: You are bunch of Etonian scum",
    "summarized_story": "Labour’s deputy leader Angela Rayner launched a war of words against Britain’s Conservative Party, describing Prime Minister Boris Johnson’s cabinet as “scum” for its views.\nSpeaking to Labour members at the party’s conference in the southern English town of Brighton late on Saturday, Rayner called the Conservative government “a bunch of scum, homophobic, racist, misogynistic, absolute pile … of banana republic … Etonian … piece of scum”.\nOliver Dowden, chair of the Conservative Party, accused Labour of “stoking the language of insult and division”.\nRayner’s remarks contrasted sharply with the usually sedate language used in Britain’s parliament.\nNow that I am prime minister, I would not,” he said in May."
  },
  {
    "headline": "Anything Buhari Touches Always Disappears – Omokri Reacts As Anthony Joshua Loses Heavyweight Titles",
    "summarized_story": "Reno Omokri, a former Presidential adviser, has weighed in on Anthony Joshua’s fight with Ukrainian Oleksandr Usyk at Tottenham Hotspur.\nNEWS DIRECT had reported that the Ukrainian won the fight via a clean sweep of the judges’ scorecards, 117-112, 116-112, 115-113 in his favour.\nThe former champion, in a post via his Instagram account after his defeat, urged his fans and followers to remain positive despite his defeat.\nHowever, Omokri took to his social media account to express sadness over AJ’s defeat.\nPosting a picture where Anthony Joshua was seen taking a picture with the President Muhammadu Buhari, Omokri wrote, “Everything Buhari touches suddenly disappears.”Recall that the heavy weight Champion met President Muhammadu Buhari during his trip to London for the UK-Africa Investment Summit 2020."
  },
  {
    "headline": "2023: Aisha Buhari Manipulates All Progressives Congress Chiefs, Plots Brother’s Emergence As Adamawa Governor",
    "summarized_story": "As the 2023 elections approach, Mrs Aisha Buhari, the President’s wife, has perfected a plot to install her younger brother, Mr Mohammed Halilu Modi, as the next Governor of Adamawa State, according to NEWS DIRECT.\nA source noted that the First Lady’s brother has not held any known public office, neither has he worked as a civil servant his entire life.\nThere are concerns that the first lady’s desperation to assume full control of the party’s structure in Adamawa State is not going down well with aggrieved stakeholders.\nThe way they are going, they can only help the PDP and governor Fintiri to win re-election in 2023”, a top party official stated.\nSimilarly, the Northern Senatorial Zone had produced a governor for a record six times and the feeling is that the zone had benefitted adequately."
  },
  {
    "headline": "Again, Gunmen Attack Kaduna Community, Kill 2, Kidnap Teacher",
    "summarized_story": "Armed men suspected of being bandits invaded the Kuregu hamlet in Kaduna State’s Zaria Local Government, killing two civilians and kidnapping an Arabic and Islamic studies instructor.\nNEWS DIRECT learnt that the incident occured on Friday night when the armed men stormed the village with sophisticated weapons, gunned down two persons before whisking the teacher to unknown destination.\nWhen contacted by report, the state’s Police Public Relations Officer, ASP Jalige was unable to give details of the incident saying he would inquire and revert.\nThis is coming few days after three suspected kidnappers of the Bethel School Students in Kaduna were arrested and paraded at the force headquarters in Abuja.\nNEWS DIRECT recalls that bandits had on January 19, attacked the same community and abducted one Professor Aliyu Mohammed of Abubakar Tafawa University Department of Agriculture , Bauchi who was released after a ransom was reportedly paid."
  },
  {
    "headline": "Tinubu Returns To Nigeria After Months In The UK [VIDEO]",
    "summarized_story": "Nigerian politician and a national leader of the All Progressives Congress, APC, Asiwaju Bola Ahmed Tinubu, has returned to Nigeria months after being in the United Kingdom.\nAccording to multiple reports, Tinubu had been in the United Kingdom treating an undisclosed illness which had seen top Nigerian politicians visiting him.\nHis media team however intervened and debunked the claim of the former Lagos state governor being sick.\nIn the video that just the internet, Tinubu could be seen walking alongside his aides and it appears that he just returned to the country.\nWatch the video below:"
  },
  {
    "headline": "Breaking: New Emir of Gaya emerges",
    "summarized_story": "Kano state Governor Abdullahi Umar Ganduje early Sunday morning announced the appointment of the new emir of Gaya.\nHe is Alhaji Aliyu Ibrahim-Gaya.\nThe Secretary to the State Government, Alhaji Usman Alhaji, announced the appointment on behalf of the Governor.\nIbrahim-Gaya was until his appointment the Ciroman Gaya.\nIbrahim-Gaya succeeded his late father, Alhaji Ibrahim Abdulkadir who died at the age of 91 years after protracted illness."
  },
  {
    "headline": "Breaking: Oleksandr Usyk dethrones Anthony Joshua, becomes world heavyweight champion",
    "summarized_story": "Oleksandr Usyk is the new unified heavyweight world champion after dethroning Anthony Joshua with an incredible performance in London.\nHaving seen a fight with fellow Briton Tyson Fury collapse last summer, Joshua opted to face his WBO mandatory challenger and former undisputed cruiserweight champion Usyk instead.\nA low shot from Joshua brought a complaint from Usyk and Joshua fired off another, perhaps sensing a weakness in his opponent.\nJoshua left at a crossroadsIt is unclear where Joshua goes from here.\nThere is a rematch clause, one that the two-time world champion is likely to exercise."
  },
  {
    "headline": "VIDEO: BBNaija winner, Mercy Eke, survives auto crash",
    "summarized_story": "PreviousEx-CBN governor reveals what will happen to Nigerian economy"
  },
  {
    "headline": "NIG@60: ALGON MADE-IN-NIGERIA set to create history",
    "summarized_story": "All is now set for the commencement of the [email protected] : ALGON Made-In-Nigeria exhibition/trade fair and lecture, as organizer have disclosed that the event will create history and rebrand Nigeria as the pride of Africa.\n”The Opening Ceremony of the [email protected] : Algon Made-In-Nigeria Exhibition/Trade Fair and Lecture is scheduled to hold on Monday, September 27, at the Old Parade Ground, Abuja.\n“Expected to grace the occasion are the Vice President Prof. Yemi Osinbajo SAN, GCON, Senate President Senator Ahmed Lawn, Secretary to the Government of the Federation (SGF), Barr.\nBoss Mustapha Minister of Industries, Trade & Investment, Otunba Adeniyi Adebayo and Minister of Special Duties & Inter-Governmental Affairs, Senator.\n“The Trade Fair and Exhibition would last from Monday to Thursday” he stated."
  },
  {
    "headline": "UNIPORT Alumni President Adokeme laid to rest -NigPilot",
    "summarized_story": "With encomium from local and international dignitaries including the Bayelsa State Governor, Senator Douye Diri, the University of Port Harcourt Alumini laid to rest its National President Chief Christopher Adokeme in Bayelsa state.\nThe state Governor Senator Douye Diri, who showered encomium on Late Adokeme described the late national President as a man of many parts that impacted positively on various facets of life.\nSpeaking at the service of songs, Diri noted that Adokeme left when he was most needed.\nEwitat stated that the National Executive Council, NEC is indeed pained at the sad event of the death of its President Adokeme who will be remembered for his humble disposition.\nThe Acting National Alumni President urged the , Isampou community and the entire Ekeremor LGA as well as Bayelsa State to take heart and be comforted that he had gone to rest."
  },
  {
    "headline": "NYSC disassociates self from security tips peddles on social media -NigPilot",
    "summarized_story": "National Youth Service Corps , NYSC, has described the report of security tips making the rounds on social media as a fake releases.\nThe Scheme denied the allegation in a press statement issued to Nigerian Pilot by its D irector, Press and Public Relations, Mrs.Adenike Adeyemi.\nIt stated, “The attention of Management of the National Youth Service Corps has been drawn to a fake release making the rounds on the social media to the effect that Corps Members traveling on “high-risk roads” should alert their families, friends, and colleagues in order to have somebody to pay off the ransom that could be demanded in the event of being kidnapped.\n“Management wishes to emphatically state that the clause quoted is not embedded in NYSC Security Tips pamphlet which was put together by a highly respected retired security expert.”The Management of NYSC, therefore, appealed to the general public to always clarify issues with the Scheme, advising Nigerians to be wary of falling prey to the antics of mischief-makers out to ridicule the Scheme."
  },
  {
    "headline": "2023: NCPC boss advises politicians to connect to God for election -NigPilot",
    "summarized_story": "Politicians have been called upon to connect to God as we approach the 2023 general elections to avoid dragging the country to the mud.\nYakubu Pam noted unless politicians realise the importance of connecting to God, the country will continue to drift to the precipice.\nAccording to Rev Pam, Peace is not attained through the acquisition of material things but inner Peace.\n“Sometimes it is not easy to remember that peace can not just be earned by other things we think can give peace.\nOur politicians should link up with God as power comes from God not, from the east or the west."
  },
  {
    "headline": "Reps Minority Faults Buhari’s UNGA Speech, Says Terrorists ‘Emboldened Under His Watch’",
    "summarized_story": "The minority caucus in the House of Representatives has faulted President Muhammadu Buhari’s recent speech at the United Nations General Assembly, claiming Boko Haram terrorists were emboldened under his watch.\nElumelu said the caucus was “alarmed by President Buhari’s report to UNGA that terrorists have been so weakened in Nigeria that they are now preying on soft targets, when in reality, insurgents have become so emboldened under his watch”.\nAs representatives of the people, the Minority caucus expressed regret that President Buhari’s speech did not reflect on the kidnapping and killing of students in Nigeria.\nThe Minority caucus therefore asked President Buhari to always cross check the content given to him by his handlers so as to ensure that his position, especially on the world stage, captures the reality as well as aspiration prevalent in the country.\nThis to them, is because such addresses ought to serve as an unblemished working document for interventions and solutions at various levels of governance."
  },
  {
    "headline": "Usyk Ends Anthony Joshua’s Reign As World Heavyweight Champion",
    "summarized_story": "Oleksandr Usyk ended Anthony Joshua’s reign as world heavyweight champion in front of the Londoner’s home crowd with a stunning unanimous points decision victory on Saturday, scuppering hopes of a ‘Battle of Britain’ unification bout with fellow world title-holder Tyson Fury.\nBut Joshua had to get past Usyk, the 2012 Olympic heavyweight champion at the London Games where Joshua won the super-heavyweight gold medal.\nThere were moments when Anthony pushed me hard but it was nothing special,” said Usyk, who now follows brothers Wladimir and Vitali Klitschko in becoming a Ukrainian world heavyweight champion, via a translator.\nLondon, I love you & thank you each and every time!”And despite defeat, he was backed to bounce back by Lennox Lewis, a former three-time world heavyweight champion.\nUsyk backed Joshua onto the ropes late on and appeared poised for a knockout when the final bell sounded."
  },
  {
    "headline": "Soludo Presented APGA Flag As Party Launches Campaign For Anambra Election",
    "summarized_story": "The All Progressives Grand Alliance (APGA) has flagged off its campaign for the forthcoming governorship election in Anambra State.\nThe couple, Soludo, and APGA National Chairman, Victor Oye, among other party leaders, took turns to address the crowd of party supporters at the event.\n“APGA has performed in Anambra State,” he said.\n“Our records in Anambra State are impeccable; our records in Anambra State, nobody can erase it.\nThereafter, Soludo was presented the party’s flag – symbolising his status as the party’s candidate – by Governor Obiano and Mr Oye."
  },
  {
    "headline": "NARD Gets New Leadership As Doctors Say Strike Continues",
    "summarized_story": "The National Association of Resident Doctors (NARD) has elected a new set of members to take over the leadership of the union.\nAt the Annual General Meeting and Scientific Conference of the doctors held on Saturday at the Abubakar Tafawa Balewa University Teaching Hospital (ATBUTH) in Bauchi, Dr Dare Ishaya was inaugurated as the new NARD President.\nSimilarly, Dr Edoga Chima and Dr Buba Babangida emerged as the first and second Vice Presidents respectively, while Dr Suleiman Abiodun Isma’il was sworn in as the Secretary-General.\nAfter critical appraisal of the performances of both Federal and state governments on the issues, the doctors unanimously resolved by vote to continue the total and indefinite strike action, until their minimum demands were met.\nOther demands by the union included the withdrawal of the court case against NARD and payment of withheld August and September salaries."
  },
  {
    "headline": "Ethiopia’s Guye Adola Wins 2021 Berlin Marathon",
    "summarized_story": "Ethiopia’s Guye Adola won the men’s Berlin Marathon on Sunday with compatriot Kenenisa Bekele, a two-time former winner in Germany’s capital, finishing third as his bid to break the world record fell short.\nAdola, 30, celebrated the first major marathon win of his career having finished second to Kipchoge in Berlin four years ago on his debut over the marathon distance.\nThe lead pack, spearheaded by Bekele, set off at a lightning speed, 25 seconds under Kipchoge’s world record pace after 15kms.\nBekele dropped back from the lead pack, but still stayed on course to run a new world record through the halfway stage.\nWith seven kilometres to go, Adola, 30, opened a three seconds gap ahead of Bekele, 39, who was also passed by Yegon."
  },
  {
    "headline": "Abia Poly protest was not over Salaries arrears",
    "summarized_story": "The Governing council of Abia State Polytechnic, Aba has dismissed the reports making rounds that non-accreditation of engineering courses and backlog of salary arrears of workers were responsible for the protests held by students of the polytechnic on Thursday.\nThis is even as the council expressed its determination to investigate the alleged rape case of a female student of the institution by Men of the Nigeria Police attached to the Rapid Response Squad in Aba Division.\nAddressing Newsmen in Umuahia, Chairman of the Governing council, John Nwamgborogwu, says such unverified reports were not in tandem with the truth but planted by enemies of the institution to damage the school’s image.\nNwamgborogwu, said the school’s management received calls early hours of Thursday from leadership of the students affairs about the alleged rape of the female student living off-campus which later sparked up the protests leading to traffic congestion along the major Aba/Owerri roadHe explained that the school authority was working with the police in Aba Area Command and other relevant security agents to investigate the matter as the institution would not tolerate any form of dehumanization of her student by any Persons or groupNwamgborogwu revealed that the National Board for Technical Education (NBTE) has already scheduled end of October next month for the accreditation of the school of engineering department and thanked Governor Ikpeazu and his wife for their swift intervention on the matterHe also commended staff of the school for their patience regarding backlog of the arrears, adding that several revenue-generating ventures had been created by the institution to augment the monthly subventions received from the State Government."
  },
  {
    "headline": "Police in Abia arrest officer who raped Poly Student",
    "summarized_story": "Abia State Police Command says it has arrested the police officer Chinedu Nwachukwu who allegedly raped a Student of Abia Polytechnic.\nThe students of polytechnic on Thursday took to the streets to protest the alleged sexual assault of the female Student.\nIn a statement, the Command’s Public relations officer, Geoffrey Ogbonna regrets what he described as disgraceful act of the erring police officerAccording to the statement, after visiting the victim in the hospital and obtaining information from her, an investigation was launched which led to the arrest of the suspect.\nThe Police Command while appealing to the Polytechnic community and the public to exercise patience assures that investigation will be fast-tracked and made public, assuring that justice will be served."
  },
  {
    "headline": "ISDB approves US$86.64 million for upgrading Minna-Bida road -",
    "summarized_story": "The Islamic Development Bank (IsDB), through efforts of Governor Abubakar Sani Bello, has approved the disbursement of a US$86.64 Million loan to Niger State Government for the construction and upgrading of the 82-kilometer Minna-Bida road being handled by Dantata and Sawoe Company.\nThe Board of Executive Directors of the Bank gave the approval of the loan at its 341st meeting held on the sidelines of the IsDB Group Board of Governors’ 2021 Annual General Meeting in Tashkent, Uzbekistan.\nThe Board approved funds totalling US$110.14 Million for three new development projects in Infrastructure, Water and Sanitation as well as Education to be executed in Nigeria (Niger State), Guinea and Sierra Leone.\nGovernor Abubakar Sani Bello, in a statement by his chief press secretary Mary Noel Berje, appreciated the efforts of the IsDB for the timely approval of the funds noting that it will hasten the completion of the road project according to specifications and on schedule.\nThe Governor reiterated that the 82-kilometer Minna-Bida Road Project, on completion, will reduce travel time, vehicle operating costs, road maintenance cost, improved traffic flow as well as increased road safety."
  },
  {
    "headline": "Asiwaju Tinubu is not back in Nigeria yet",
    "summarized_story": "The Media office of The National leader of the Apc has confirmed to TVC News That reports suggesting that asiwaju bola tinubu is back to the country are false.\nWhen we contacted, Tunde Rahman, the Media Adviser to Asiwaju Tinubu, said and I quote‘‘His Excellency Asiwaju Bola Tinubu is not back.\nThe report about his return is absolute fake news.\nI know many are eagerly awaiting his return.\nWhen he does everyone will know.’The National leader of the party is still in the UK and has continued to receive numerous Visitors at his residence."
  },
  {
    "headline": "US: At Least Three Dead in Amtrak Train Derailment in Montana",
    "summarized_story": "At least three people were killed Saturday afternoon when an Amtrak train that runs between Seattle and Chicago derailed in north-central Montana, toppling several cars onto their sides, authorities said.\nThe westbound Empire Builder train derailed about 4 p.m. near Joplin, a town of about 200, Amtrak spokesman Jason Abrams said in a statement.\nOther recent Amtrak derailments include:— April 3, 2016: Two maintenance workers were struck and killed by an Amtrak train going more than 100 mph in Chester, Pennsylvania.\nThe lead engine of the train derailed.\n— May 12, 2015: Amtrak Train 188 was traveling at twice the 50 mph speed limit as it entered a sharp curve in Philadelphia and derailed."
  },
  {
    "headline": "Usyk Stuns Joshua By Unanimous Decision to Become Unified Heavyweight Champion",
    "summarized_story": "Oleksandr Usyk is the new unified heavyweight world champion after dethroning Anthony Joshua with an incredible performance in London.\nHaving seen a fight with fellow Briton Tyson Fury collapse last summer, Joshua opted to face his WBO mandatory challenger and former undisputed cruiserweight champion Usyk instead.\nIt would become the pattern of the fight as Usyk made Joshua miss and executed a perfect gameplan of his own.\nA low shot from Joshua brought a complaint from Usyk and Joshua fired off another, perhaps sensing a weakness in his opponent.\nJoshua had a cut and swelling on his eye; Usyk had a gash on his left eye."
  },
  {
    "headline": "Covid Vaccine Boosters Could Mean Billions for Drugmakers",
    "summarized_story": "Boosters will likely be offered even more broadly in the coming weeks or months, including boosters of vaccines made by Moderna and Johnson & Johnson.\nAndersen expects Moderna, which has no other products on the market, to generate a roughly $13 billion profit next year from all COVID-19 vaccine sales if boosters are broadly authorized.\nJ&J and Europe’s AstraZeneca have said they don’t intend to profit from their COVID-19 vaccines during the pandemic.\nDrugmakers are also developing COVID-19 shots that target certain variants of the virus, and say people might need annual shots like the ones they receive for the flu.\nBut the success of the COVID-19 shots could draw more drugmakers and venture capitalists into the field."
  },
  {
    "headline": "Germans Decide Who Will Take Charge after Merkel in Sunday’s Vote",
    "summarized_story": "The fight to succeed popular, long-serving chancellor Angela Merkel could barely be tighter as Germans go to the polls in parliamentary elections.\nAt stake is the leadership of Europe’s most powerful economy, and more than 60 million Germans over 18 are eligible to vote.\nClimate change is currently the biggest issue for German voters and the party has only once polled more than 10% in a federal election.\nThe liberal FDP may disagree with the Greens on plenty, but on climate change they are drawing in young voters too.\nThe victorious party still needs to form a coalition and there seems little chance of a repeat of the two-party grand coalition currently in charge."
  },
  {
    "headline": "Mali Approached Russian Military Company for Help, Says Russia’s Foreign Minister Lavrov",
    "summarized_story": "Mali has asked Russian private companies to boost security in the conflict-torn country, Moscow confirmed as the Malian leader accused France of abandoning Bamako by preparing a large troop drawdown.\nRussian Foreign Minister Sergey Lavrov said on Saturday private Russian military contractors have a “legitimate” right to be in Mali because they were invited by the country’s transitional government – but he insisted that the Russian government was not involved.\nGermany, which also has troops in Mali, also says it will reconsider its deployment should the Malian government strike a deal with Wagner.\nUnder the threat of sanctions, the military then appointed an interim civilian government tasked with steering the country back to democratic rule.\nThe UN, which has some 15,000 peacekeepers in Mali, has also expressed concern about the possible involvement of Wagner fighters."
  }
]