[
  {
    "headline": "We’ll ensure tenants pay monthly from 2022 – Gov",
    "summarized_story": "ThE Lagos State Governor, Mr Babajide Sanwo-Olu, on Tuesday, said his administration is set to enforce a monthly tenancy on property occupancy from 2022 to alleviate annual financial pressure on tenants.\nHe said, “The state government is set for the enforcement of a monthly tenancy on property occupancy from 2022.\nIt is confirmed that the percentage of residents depending on tenancy arrangement for housing in Lagos State is quite high.\n“The monthly tenancy is a pro-people plan to reduce financial pressure of yearly rent on tenants.\n“We have talked through this policy and an agreement has been reached by representatives of tenants, financiers and the state government."
  },
  {
    "headline": "EFCC raids Abuja hotel, arrests woman, others with fake $427,400",
    "summarized_story": "The Economic and Financial Crimes Commission has arrested five members of a syndicate who specialise in counterfeiting foreign currencies, especially the dollar, for sale to unsuspecting members of the public.\nActing on intelligence, the commission, in a joint operation with operatives of the National Drug Law Enforcement Agency, arrested four members of the syndicate on December 8, 2021, at Swiss Pearl Continental Hotel, Koforidua Street, in the Wuse 2 area of Abuja with fake $427,400.\nThe suspects include Fashanu Adesina, John Ogbaje, Emmanuel Bassey and Chidi Nwanchukwu.\nA statement on Tuesday by the EFCC spokesman Wilson Uwujaren, titled, ‘EFCC smashes fake currency syndicate,’ said “The suspects volunteered useful statements which eventually led to the arrest of the syndicate’s kingpin, one Chief Douglas Mbonu on Tuesday, December 14.\n“Citizens are advised to source their forex from commercial banks in line with the directives of the Central Bank of Nigeria to minimise the risk of exposure to fraud syndicates.”Copyright PUNCH."
  },
  {
    "headline": "Synergy displayed by NEGF helped in gradual return of peace — Zulum",
    "summarized_story": "Zulum said, “Your Excellencies, there is no doubt that the establishment of NEGF with its untiring and committed efforts have really impacted positively in restoring peace and hope in the entire sub region.\n“We shall also conduct regular meetings and consultations amongst ourselves in order to maintain the current momentum with our common interest.\n“With the current realities and development, the end to Boko Haram atrocities is near Insha Allah (by God grace).\nGovernor of Gombe, Inuway Yahaya was in attendance, while that of Adamawa, Bauchi and Taraba states sent their Deputies.\nThe Forum resolved to have its next meeting from 9th to 11th March 2022 at Gombe, Gombe State.”"
  },
  {
    "headline": "Lagos commences prosecution of defaulters of COVID guidelines",
    "summarized_story": "“Lagos State Government is concerned with the dramatic rise in cases seen in the evolving fourth wave.\n“In addition, unvaccinated inbound passengers and anyone testing positive for COVID-19 are mandated to self-isolate at home for seven days.\n“To protect the rest of our citizens from this irresponsible behaviour, the Lagos State Government is taking some decisive actions.\nWe have started contacting all those that have not done their Day two and Day seven tests by text messages.\nFake PCR tests certificates and vaccination cards from any part of the world can be verified and will attract severe sanctions."
  },
  {
    "headline": "Why we launched garment production in Imo — Osinbajo",
    "summarized_story": "Professor Yemi OsinbajoBy Chinonso AlozieThe Vice President of Nigeria, Yemi Osibanjo, on Tuesday said the garment production centre launched in Imo state would create 110,000 Micro Small and Medium Enterprises, every year.\nHe said this while commissioning the Imo fashion facility centre along Amakohia road in Owerri, alongside the Imo state governor, Hope Uzodimma.\nAccording to the Vice President, “We commissioned a one-stop garment production centre, one out of the ten (10) Shared Facility Scheme for MSMEs, for the end-to-end production of various types of clothing items in Orlu, Imo state.\n“The FG remains focused on providing every Nigerian with good-paying sources of livelihood.\nThis means providing a favourable business environment and safe and secure communities for all,” he said."
  },
  {
    "headline": "Death of 4-yr-old: Allegations false, we responded swiftly — FMC Management",
    "summarized_story": "Recalled that the bereaved father, a businessman alleged that his late son, Bashiru Kehinde who was in Nursery Two, died of stomach complications at the hospital.\nWahab attributed his son’s death to the incompetence of the health workers a situation which made him cry out for justice over the death of his son.\n‘’Master Kehinde Bashiru, a 4-year-old male child was presented to the emergency room of FMC Ebute-Metta at about 3:30 am on the 5th of December 2021.\n“As alluded to by Mr Bashiru, Master Kehinde Bashiru got prompt attention upon arrival.\n‘’The death of Kehinde Bashiru, while unfortunate and disheartening, could have been avoided if his parents had sought early treatment and presented to FMC Ebute-Metta much earlier."
  },
  {
    "headline": "Olowu of Owu Kingdom, Oba Dosunmu is dead",
    "summarized_story": "By James OgunnaikeThe Olowu of Owu Kingdom in Abeokuta, Ogun State, Oba Adegboyega Dosunmu is dead.\nAfuape said the State mourns the veteran TV producer who ascended the throne in 2005 as the 13th Olowu after Oba Adewale Adisa Odeleye, Lagbedu 1 who transited to glory in 2003.\nThe statement read, “Afuape said the State mourns the veteran TV producer who ascended the throne in 2005 as the 13th Olowu after Oba Adewale Adisa Odeleye, Lagbedu 1 who transited to glory in 2003″.\nMeanwhile, the State Governor, Prince Dapo Abiodun, has expressed shock at the transition of the Olowu of Owu Kingdom, Oba Olusanya Dosunmu, Amororo II.\nAbiodun described late Oba Dosunmu as a man of peace and a passionate supporters."
  },
  {
    "headline": "Couple contemplate opting out of marriage plan over unbelievable list, run to prophet",
    "summarized_story": "The founder of Christ Mercyland Deliverance Ministry, Prophet Jeremiah Fufeyin, has intervened in the life of a woman whose family has been experiencing failed marriages.\nHowever, the man had no money to fund the wedding.\nThe woman also came to the church with the lists for the traditional wedding which the Prophet read out in front of the congregation.\nThe outrageous list was said to have been written by the lady’s uncle, who understandably never wanted her to get married, knowing the financial condition of the couple.\nMarriages in Africa and by extension, Nigeria often face challenges due to funds as most of them are quite expensive."
  },
  {
    "headline": "Obasanjo’s Owu kingdom loses king",
    "summarized_story": "The Olowu of Owu kingdom, Abeokuta, Oba Adegboyega Dosunmu has passed on.\nThe Ogun State Government announced the demise of the first-class Oba on Tuesday, saying he joined his ancestors on Sunday after a brief illness.\nOwu is the homestead of former President, Olusegun Obasanjo, where he was installed as the Balogun.\nThe late Olowu was installed in 2005 following the demise of late Oba Adisa Odeleye in 2003.\nAbiodun condoled with the monarch’s family and the people of Owu, asking them to take solace in the lasting impact he had on his domain."
  },
  {
    "headline": "We are working to settle Nigeria, UAE flight row – Speaker",
    "summarized_story": "The Speaker of the House of Representatives, Hon Femi Gbajabiamila, on Tuesday, held a meeting with the Ministers of Aviation, Senator Hadi Sirika, Foreign Affairs, Chief Onyema Ugochukwu and his junior over the flight ban between the United Arab Emirates (UAE) and Nigeria.\nThe meeting which was at the instance of the Speaker lasted for three hours behind close doors at the National Assembly complex in Abuja.\nThe meeting, the Speaker later told journalists was to find solution to the impasse between Nigeria and the United Arab Emirate which noted was robustly discussed.\nHe described the diplomatic relationship between Nigeria and the United Arab Emirate as crucial that should not be allowed to collapse.\n“The United Arab Emirates has a long standing relationship between Nigeria and it should not be allowed to collapse as both countries stands to benefit much more economically."
  },
  {
    "headline": "Use your position to preach against sexual, gender-based violence – FOMWAN tells Muslim clerics",
    "summarized_story": "The Bauchi State chapter of the Federation of Muslim Women Associations of Nigeria (FOMWAN) has charged Muslim clerics in the state to use their vintage position to always preach against the menace of sexual and gender based violence, particularly against women and girls.\nAccording to Kilishi, gender based violence was more of culture, tradition and attitude rather than religion, declaring that Islam had clearly stipulated the rights of women.\nSo all of the negatives are termed to be culture,” Kilishi submitted.\nAccording to her, rather than subjugating women, Islam did not only encourage women but also empower them, adding that it was also against violence against women.\nIt will help to avoid violence against women in marriage from domestic violence,” Kilishi asserted."
  },
  {
    "headline": "FG to liquidate outstanding pension arrears – Minister",
    "summarized_story": "Ahmed disclosed this at the official finalization payment of inherited unfunded liabilities to pensioners of defunct agencies, organized by the Pension Transitional Arrangement Directorate (PTAD) on Tuesday in Abuja.\n“I’m happy to oversee the completion of the payment of the outstanding liabilities due to ex-workers of two defunct agencies, namely- Nigeria Reinsurance Corporation and New Nigeria Newspapers Limited.\n“Ex-workers of another three defunct agencies will receive a significant portion of the outstanding liabilities due to them and they’re NICO Insurance Corporation, Delta Steel Company Limited and NITEL/MTEL,” Ahmed said.\nEjikeme said, “We will also settle a significant portion of the outstanding liabilities due to ex-worker of another three defunct agencies, NICO Insurance Corporation, Delta Steel Company Limited and NITEL/MTEL.\n“PTAD has paid off the outstanding balance of the pension entitlements due to ex-workers of Savannah Sugar Company Limited, Nigeria Aviation Handling Company, Aluminum Smelter Company of Nigeria, Federal Housing Authority, Nigeria National Shipping Line and Assurance Bank.”"
  },
  {
    "headline": "'Soyinka told me to prepare for war on my autobiography'",
    "summarized_story": "Nobel Laureate Prof. Wole Soyinka foretold the controversies being generated by ‘My Participation’, the autobiography of ex-Osun State Governor Chief Bisi Akande.\nHe also said President Muhammadu Buhari reneged on his promise to make Tinubu his running mate in 2015.\nThey told us they needed to hold a meeting and take a decision.\n“Nyako of Adamawa told us at a stage that he would leave them behind and join us on his own.\n“When we got to Kano House, the New-PDP leaders had prepared a document listing conditions under which they would accept to join us."
  },
  {
    "headline": "APC miracle would have been difficult without Tinubu, says Akande",
    "summarized_story": "Ex-All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the feats achieved by the party in the 2015 polls would have been difficult or impossible without ex-Lagos State Governor Asiwaju Bola Tinubu.\n- Advertisement -He added that Buhari offered Tinubu the running mate slot in 2014 even when he had not secured the party’s ticket.\n‘How could he be talking of a running mate when he had not secured the ticket?’ I mused.\nHe said Tinubu became angry with Buhari and refused to join a discussion on the running mate initiated by Senator Ibikunle Amosun.\nSo, let him choose on his own,” Akande quoted Tinubu to have said."
  },
  {
    "headline": "APC didn’t have ‘restructuring’ in its 2015 manifesto, says Akande",
    "summarized_story": "*’Jonathan not sincere with National Conference’*’Adebanjo knows he lacks what it takes to aspire for high political positions’Ex-All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the party did not have ‘restructuring’ in its 2015 manifesto.\nHe said the Goodluck Jonathan administration was not sincere with the National Conference.\n“Therefore, as the interim National Chairman of APC, I knew that I should quickly place the invitation on the Jonathan Conference before my party’s interim National Executive Committee.\nPresident Jonathan truly and deliberately did not place the Conference’s report and resolutions before the National Assembly throughout his years in power.\nHe went on: “APC did not have ‘Restructuring’ in its manifesto for the 2015 elections but promised to support devolution of power from the centre to the states."
  },
  {
    "headline": "Akande: I never gave, took a bribe in public office",
    "summarized_story": "A former Osun State Governor and pioneer National Chairman of the All Progressives Congress (APC), Chief Bisi Akande, has said he did not give or take a bribe while serving in government.\nIn his autobiography “My Participations” unveiled on Thursday in Lagos, Akande writes: “As SSG and Deputy Governor, my take-home pay was much lower than what I was earning as an executive of BP.\n“I never took a bribe and never gave bribe to anyone.\n“I never gave or demanded bribe from anyone all my life.\nAll of us who served in my government, all my commissioners and others, came out the way we went in."
  },
  {
    "headline": "We will resist plot to kill public varsities, says ASUU",
    "summarized_story": "It insisted that if strike remained the only language the government understood, it would continue to speak it.\n- Advertisement -ASUU stated this through its Port Harcourt Zone in a position paper read by its Zonal Coordinator, Stanley Ogoun, at the Ignatius Ajuru University of Education.\nThe ASUU regretted that even the intervention of the Chief of Staff to President Muhammadu Buhari had not yielded any result.\nHe urged members of the public to disregard the claims by the government that it had paid ASUU N50 billion the Earned Academic Allowance (EAA) Revitalisation Funds.\nAlso, ASUU has renewed its threat to embark on strike should the Federal Government delay a little further to meet the union’s demands."
  },
  {
    "headline": "Auto crash claims 14 in Bayelsa",
    "summarized_story": "From Femi Folaranmi, YenagoaFourteen persons have been confirmed dead in a motor accident that occurred at the Bayelsa section of the East/ West road on Monday.\nAccording to investigations the accident happened at Sampou junction, Kolokuma/ Opokuma Local Government Area of the state.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIt was learnt that two vehicles, a while Toyota Hiace bus with registration number LND 247 XX and a black Lexus SUV with registration number KWL 726 GN were involved in the accident.\nThe bus was said to be coming from Lagos heading to Port Harcourt while the Lexus SUV was heading towards Warri when the accident occurred."
  },
  {
    "headline": "FG mulls additional taxes in 2022",
    "summarized_story": "She said a couple of reforms and amendments had been recommended in the draft 2021 Finance amendment bill saying more would be introduced in the middle of 2022.\n“This is to amend the Police Trust Fund Act and the Nigerian Trust Fund Acts, the purpose is to empower the FIRS to collect the Nigerian trust fund levies on companies on behalf of the fund itself.\nHe said the ministry had worked with relevant stakeholders and Fiscal Policy Reform Committee to draft the 2021 Finance bill.\nPresident Muhammadu Buhari, had on December 7, transmitted a letter to the Senate, urging it to consider and pass the Finance (Amendment) Bill 2021.\nBuhari said the Finance Bill would guide the implementation of the soon-to-be passed Appropriation Act, 2022."
  },
  {
    "headline": "COVID-19: We’ll no longer accept short-shelf life vaccines –FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaFollowing the expiration of one million doses of COVID-19 vaccine, the Federal Government has announced that it would no longer accept vaccines with short-shelf life as it mounts undue pressure on health workers to administer them.\nIt disclosed that over 10 million vaccines with short-shelf life received free of charge have been administered so far in the country.\nMinister of Health, Dr. Osagie Ehanire, had on December 8, confirmed the report of the expiration of doses of vaccines supplied to the country.\nMinister of Aviation, Hadi Sirika, made the clarification at the PSC briefing.\nSo, today (Saturday) there was a meeting, I participated in a zoom meeting, COVID-19 task force, just for your information also."
  },
  {
    "headline": "Stronger executive, legislative partnership’ll deepen democracy –Buhari",
    "summarized_story": "President Muhammadu Buhari, yesterday, said a stronger executive and legislative partnership would deepen democracy.\n“Our democracy has similarly been confronted by several challenges, some novel, that required hitherto unanticipated solutions, while others, though familiar, required adaptation to meet prevailing circumstances.\n“In other situations, the executive and legislative relationships have come into focus, especially as it concerns the exercise of powers enshrined in the constitution and the practice of checks and balances,” he said.\nBuhari, thereafter, urged the National Assembly and NILDS to ensure the outcome of the lecture was well documented and circulated.\nNILDS Director General, Abubakar Sulaiman, said the lecture series had been initiated by the National Assembly as a bi-annual event."
  },
  {
    "headline": "ASUU issues strike notice, demands implementation of 2009 agreement with FG",
    "summarized_story": "The lecturers’ union spoke at press conferences held at various zonal levels across the country, yesterday.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe insincerity of the Federal Government is not just beyond understanding, it is beyond tolerance,” ASUU said.\nTo accept negotiation on every issue and for the agreement to be reached, strike must be embarked upon.\nThe implementation of such agreement be it MoA or MoU would only see the light of the day after series of action,” he said."
  },
  {
    "headline": "UK Removes Nigeria, 10 Other Countries from Travel Red List",
    "summarized_story": "Chinedu EzeThe British High Commission has announced that Nigeria and 10 other countries have been removed from UK’s red list effective Wednesday December 15, as Omicron becomes the dominant strain around the world.\n“Following review of the latest risk assessment from the UK Health Security Agency (UKHSA), Nigeria and the other 10 countries and territories on the red list will be removed from 4am Wednesday 15 December.\nIt noted that as Omicron cases rise in the UK and in countries around the world, “the travel red list is less effective in slowing the incursion of the variant from abroad and these temporary measures are no longer proportionate.\nBritish High Commissioner to Nigeria, Catriona Laing CB, said: “On Tuesday 14th December, UK Ministers made the decision – based on scientific and public health data – to remove Nigeria from the UK’s travel red list.\nNow that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron."
  },
  {
    "headline": "UK to Remove Nigeria, 10 Other Countries from Travel Red List Wednesday",
    "summarized_story": "Chinedu Eze with agency reportsUnited Kingdom Tuesday said it would remove Nigeria and 10 other countries from travel red list Wednesday, according to BBC reports.\nAll the 11 countries on the list would be taken off England’s travel red list from 04:00 GMT on Wednesday, the health secretary announced.\nBBC stated that testing measures – a pre-arrival negative test and then another PCR test after arrival – remain in place for all travellers.\nBBC also reported that MPs were debating the new measures in the Commons on Tuesday, with a big Tory rebellion expected over Covid passes for some venues.\nIt stated that more than half a million people booked booster jabs on Monday and long queues were seen again at some vaccination centres on Tuesday."
  },
  {
    "headline": "Nigeria’s Public Debt Rises by N2.5tn to N38tn",
    "summarized_story": "Ndubuisi Francis in AbujaNigeria’s total public debt rose by N2.54 trillion, from N35.465 trillion in the second quarter (June 30) to N38.005 trillion ($92.626 billion) in the third quarter ending September 30.\nStatistics released by the Debt Management Office (DMO) indicate thatthe debt comprises total external and domestic debts of the Federal Government of Nigeria (FGN), 36 state governments and the Federal Capital Territory (FCT).\nThe DMO explained that the increase of N2.540 trillion, when compared to the corresponding figure of N35.465 trillion at the end of Q2 2021 was largely accounted for by the $4 billion Eurobonds issued by the FGN in September 2021.\nThe debt management agency stated that the issuance of the $4 billion Eurobonds had brought significant benefits to the economy by increasing the level of Nigeria’s external reserves, thereby supporting the exchange rate of the naira, and providing necessary capital to enable the federal government finance various projects in the budget.\nThe triple tranche of $4 billion Eurobond, issued in September 2021, was for the implementation of the new external borrowing of $6.18 billion in the 2021 Appropriation Act."
  },
  {
    "headline": "UAE Backs down, Gives Air Peace Flight Slots to Dubai",
    "summarized_story": "Chinedu EzeThe diplomatic crisis between Nigeria and the United Arab Emirates (UAE) over flight operations may be coming to end as the Dubai Civil Aviation Authorities Airport (DXB) has given Air Peace weekly flight slots to Dubai.\nThe Federal Government had last Thursday stopped Emirates 20 frequencies a week and left the airline with only one flight to Abuja in response to UAE allocating only one flight a week to Air Peace, a Nigerian carrier.\nThe letter, which was signed by DCAA Director General, Mohammed Ahli, stated, “The Dubai Civil Aviation Authority presents its compliments to the honourable management of Air Peace, Nigeria.\n“Your Excellency, relations between our two countries go a long way back and we value these relations immensely.\nAir Peace source confirmed to THISDAY that it had received the letter."
  },
  {
    "headline": "After Destroying LG System, Leading to Insecurity, Govs Working to Scuttle Electoral Reform",
    "summarized_story": "According to THISDAY findings, “The 36 governors want to ensure that they continue to collect local government allocations, which they mismanage.\n“Now, these governors are moving to scuttle the electoral process for their own selfish gains.\nAlso, Nwankwo said Buhari would be doing colossal damage to whatever legacy he might leave behind if he failed to heed the yearnings of Nigerians and sign the Electoral Bill into law.\nCDD believes that the next critical step that must be taken is for the assenting into law, the Electoral Bill 2021.\nFor Persons Living With Disability (Completed Registration) was 21,910 and for the Youth (18- 34 years) it stood at 1,586,018."
  },
  {
    "headline": "Northeast Governors Say Mass Surrender Of “Boko Haram Fighters Is Evidence Of Significant Improvement In Security Situation” Despite Rising Kidnappings, Killings In Region",
    "summarized_story": "The North-East Governors’ Forum has concluded its closed-door meeting in Damaturu, Yobe State capital and come out with a five-point communique.\nThe meeting, which is the Forum’s sixth, was led by the Chairman of the North-East Governors’ Forum and Governor of Borno State, Babagana Zulum.\nGombe State Governor, Inuwa Yahaya was present while the deputy governors of Adamawa, Bauchi, and Taraba represented by their governors.\nAt the end of the meeting on Tuesday night, the Forum issued a five-point communique, mostly bordering on security and power supply.\nThe Forum noted that kidnapping and farmer-herder clashes amongst others are worrisome in the sub-region and resolved to undertake the necessary measures to curtail the menace.\""
  },
  {
    "headline": "Northeast Governors Say Mass Surrender Of “Boko Haram Fighters Is Evidence Of Significant Improvement In Security Situation” Despite Rising Kidnappings, Killings In Region",
    "summarized_story": "The North-East Governors’ Forum has concluded its closed-door meeting in Damaturu, Yobe State capital and come out with a five-point communique.\nThe meeting, which is the Forum’s sixth, was led by the Chairman of the North-East Governors’ Forum and Governor of Borno State, Babagana Zulum.\nGombe State Governor, Inuwa Yahaya was present while the deputy governors of Adamawa, Bauchi, and Taraba represented by their governors.\nAt the end of the meeting on Tuesday night, the Forum issued a five-point communique, mostly bordering on security and power supply.\nThe Forum noted that kidnapping and farmer-herder clashes amongst others are worrisome in the sub-region and resolved to undertake the necessary measures to curtail the menace.\""
  },
  {
    "headline": "Northeast Governors Say Mass Surrender Of “Boko Haram Fighters Is Evidence Of Significant Improvement In Security Situation” Despite Rising Kidnappings, Killings In Region",
    "summarized_story": "The North-East Governors’ Forum has concluded its closed-door meeting in Damaturu, Yobe State capital and come out with a five-point communique.\nThe meeting, which is the Forum’s sixth, was led by the Chairman of the North-East Governors’ Forum and Governor of Borno State, Babagana Zulum.\nGombe State Governor, Inuwa Yahaya was present while the deputy governors of Adamawa, Bauchi, and Taraba represented by their governors.\nAt the end of the meeting on Tuesday night, the Forum issued a five-point communique, mostly bordering on security and power supply.\nThe Forum noted that kidnapping and farmer-herder clashes amongst others are worrisome in the sub-region and resolved to undertake the necessary measures to curtail the menace.\""
  },
  {
    "headline": "BREAKING: UK To Remove Nigeria, Others From Omicron Red List On Wednesday",
    "summarized_story": "The United Kingdom will on Wednesday remove Nigeria and 10 other countries including South Africa from a red list over the outbreak and spread of Coronavirus' new variant - Omicron.\nThe UK had on December 5 announced Nigeria among a red list of countries where travellers except Britons were not allowed to fly in from.\nSee Also Breaking News BREAKING: Omicron: UK Adds Nigeria To Red List, Travellers To Take Pre-departure COVID-19 TestThe decision to remove Nigeria and others from the red list was reached after the government agreed that Omicron was now a global issue.\nA British journalist, Sebastian Payne also tweeted on Tuesday, “UK empties the red list.\nð\u009f\u009a¨ NEW: U.K. empties the red listWhitehall officials confirm the 11 countries (including South Africa) will be removed from 4am tomorrow."
  },
  {
    "headline": "BREAKING: UK To Remove Nigeria, Others From Omicron Red List On Wednesday",
    "summarized_story": "The United Kingdom will on Wednesday remove Nigeria and 10 other countries including South Africa from a red list over the outbreak and spread of Coronavirus' new variant - Omicron.\nThe UK had on December 5 announced Nigeria among a red list of countries where travellers except Britons were not allowed to fly in from.\nSee Also Breaking News BREAKING: Omicron: UK Adds Nigeria To Red List, Travellers To Take Pre-departure COVID-19 TestThe decision to remove Nigeria and others from the red list was reached after the government agreed that Omicron was now a global issue.\nA British journalist, Sebastian Payne also tweeted on Tuesday, “UK empties the red list.\nð\u009f\u009a¨ NEW: U.K. empties the red listWhitehall officials confirm the 11 countries (including South Africa) will be removed from 4am tomorrow."
  },
  {
    "headline": "Meet the 18-year-old bus conductor who became chess champion in Lagos slum",
    "summarized_story": "Adeoye Fawaz, the 18-year-old boy who works as a bus conductor, has emerged as the overall champion in a chest contest organised by Chess in slums Africa.\nThe group recently organised chess training for “51 homeless children” living under the bridge in Oshodi, a hustling and bustling area of Lagos state.\nDuring the training, the team took the children on the rudiments of chess as well as mental maths where they were given several puzzles to solve.\nIn a Twitter thread, Tunde Onakayo, founder of the organisation, said Fawaz emerged as the overall champion in both chess and mental maths.\n“Adeoye Fawaz, an 18 year old boy who works as a bus conductor and has lived years of his life under Oshodi bridge emerged as our overall champion in both chess and mental maths."
  },
  {
    "headline": "Meet the 18-year-old bus conductor who became chess champion in Lagos slum",
    "summarized_story": "Adeoye Fawaz, the 18-year-old boy who works as a bus conductor, has emerged as the overall champion in a chest contest organised by Chess in slums Africa.\nThe group recently organised chess training for “51 homeless children” living under the bridge in Oshodi, a hustling and bustling area of Lagos state.\nDuring the training, the team took the children on the rudiments of chess as well as mental maths where they were given several puzzles to solve.\nIn a Twitter thread, Tunde Onakayo, founder of the organisation, said Fawaz emerged as the overall champion in both chess and mental maths.\n“Adeoye Fawaz, an 18 year old boy who works as a bus conductor and has lived years of his life under Oshodi bridge emerged as our overall champion in both chess and mental maths."
  },
  {
    "headline": "WHO: Omicron spreading unlike other COVID variants — now in 77 countries",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron COVID variant has now been detected in 77 countries.\nAdvertisementSpeaking in Wednesday during a virtual media briefing, Tedros Ghebreyesus, WHO director-general, said Omicron is probably in most countries, even if it hasn’t been detected yet.\nIt’s not vaccines instead of masks.\nIt’s not vaccines instead of distancing.\nIt’s not vaccines instead of ventilation or hand hygiene."
  },
  {
    "headline": "WHO: Omicron spreading unlike other COVID variants — now in 77 countries",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron COVID variant has now been detected in 77 countries.\nAdvertisementSpeaking in Wednesday during a virtual media briefing, Tedros Ghebreyesus, WHO director-general, said Omicron is probably in most countries, even if it hasn’t been detected yet.\nIt’s not vaccines instead of masks.\nIt’s not vaccines instead of distancing.\nIt’s not vaccines instead of ventilation or hand hygiene."
  },
  {
    "headline": "DMO: Nigeria's public debt increased by N2.5trn in three months",
    "summarized_story": "The Debt Management Office (DMO) says Nigeria’s total public debt hit N38.005 trillion at the end of the third quarter (Q3) of 2021.\nAdvertisementIt includes the total external and domestic debts of the federal government, 36 state governments, and the federal capital territory (FCT).\nThe debt figure represents an increase of N2.54 trillion within three months compared to the N35.46 trillion recorded at the end of June 2021.\nIn a statement on Tuesday, DMO attributed the increase to the $4 billion eurobonds issued by the federal government in September.\n“In line with its practice, the Debt Management Office has published Nigeria’s Total Public Debt as at September 30, 2021."
  },
  {
    "headline": "1da Banton’s “No Wahala” blew up on Tik Tok. Now he knows its power",
    "summarized_story": "“When I recorded ‘No Wahala’, that was how I was feeling, so I put it into music.\nSo, I’m glad we achieved that.”Born and raised in Port-Harcourt, 1da Banton, dropped his debut single in 2015.\n“My TikTok video on the ‘No Wahala’ challenge gave me my highest views and engagement on TikTok.\nI didn’t expect it,” said Yewande Daranijo, an aspiring actress whose first viral TikTok video has over 300,000 views through this challenge.\n1da Banton recalled that at the time his song was blowing up in France, he wasn’t a regular user of Tik Tok and was still finding his way around the app."
  },
  {
    "headline": "Can Kenya get out of the supply chain crisis?",
    "summarized_story": "A global meltdownOn a global level, the supply chain meltdown began with a container shortage that cropped up at the end of 2020, with freight rates rising higher than 264%, compared to previous years.\nAt this point, global supply chains were already out of balance, and demand for exports exceeded the supply of shipping containers.\nWhile the flower industry is rebounding and trucks are moving more freely, the temporary dismemberment of the supply chain industry may continue to have knock-on effects on businesses in the East African economy.\nReliability is keyKenya’s potential supply chain crisis and its impact can be mitigated.\nWithout it, it may be years before we see supply chain issues corrected and an environment for freer trade realised."
  },
  {
    "headline": "How African startups can build multi-million dollar deals",
    "summarized_story": "One of the biggest acquisition deals of 2021 is MFS Africa’s deal with Capricorn.\nWhile the amount is undisclosed, both parties confirmed that the deal is Nigeria’s “second-largest” fintech acquisition deal, second only to Paystack’s $200 million acquisition deal with Stripe.\nBig deals start out smallFor Dare Okoudjou—who has led MFS Africa’s growth in 35 African countries—big deals and acquisitions don’t always start out as big deals.\nPrior to Capricorn, MFS Africa had acquired two other companies.\nIn 2016, MFS Africa acquired Sochitel—a company that specialised in international airtime transfers into Africa—and the acquisition, according to MFS Africa, helped create the largest transfer payment network which focuses on Africa."
  },
  {
    "headline": "Kwara raises a $4m seed to build Africa’s first credit union-powered neobank",
    "summarized_story": "The company is reportedly growing its credit union customer base by 40% month-on-month, and the listed credit unions are growing their membership by 19% and their loan base by 46%, annually.\nThough it’s reported to be courting some credit union clients in South Africa and the Philippines, which, according to the CEO, validates their solution across multiple markets.\nDue to that, it’s launching a new bank that will be powered by its existing credit unions.\nAlso, any unbanked individual can easily join a credit union and then enjoy the whole banking benefits.\n“Kwara’s unique approach is a catalyst for a new way of retail banking through digital-first credit unions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Using cloud-based technology, DrugStoc is powering a pharmaceutical supply chain for the African market",
    "summarized_story": "And Nigeria-based healthtech, DrugStoc, is looking to solve the nation’s poor drug supply chain problem.\nA DrugStoc for health care providersL-R DrugStoc co-founders: Chibuzo Opara (CEO) and Adham Yehia (President) Source: SuppliedFounded in 2015 by Chibuzor Opara and Adham Yehia, DrugStoc is a “cloud-based health pharmaceutical distribution platform.\nWe are solving a fundamental problem in the market which is fragmentation in the pharmaceutical supply chain,” Opara told Techpoint Africa.\nBy providing a cloud-based platform that prevents infiltration of counterfeit or substandard drugs, DrugStoc appears to solve all three problems.\nTo scale and make this beneficial to more people, it became what it is now, a cloud-based warehouse/marketplace for quality drugs."
  },
  {
    "headline": "Toilets and sanitation tech, Africa and Internet censorship, Facebook/Nigeria 7.5% VAT",
    "summarized_story": "Share this article:Good day,Today, look out for:World Toilet DayLatest Internet censorship stats for AfricaFacebook and Nigeria’s 7.5% VAT incrementSanitation tech is a THING!\nAfrica and Internet censorshipRecent happenings show that Africa could overtake Asia as the most Internet censored continent in the world.\nBased on another cybersecurity company, Top10VPN’s record, a whopping $237.4 million was lost in 2020 in sub-Saharan Africa due to numerous Internet censorship cases.\nSocial media shutdown in Uganda: The thin line between moderation and outright censorshipI’d like to know your thoughts (in the comments section).\nFacebook to remit 7.5% VAT to NigeriaIn Nigeria, global tech giants are finally complying with the increase in value-added tax (VAT) from 5% to 7.5% on all VATable items for online transactions."
  },
  {
    "headline": "3.6 billion people don’t have toilets worldwide; who’s changing that in Africa?",
    "summarized_story": "Fast forward to the present day, and we now have inventions like waterless toilets, toilets with FM Radio and LED lights, and toilets made entirely out of gold.\nThis number has increased from 2.3 billion in 2018 when one in three people did not have access to toilets.\nA global problemWith 3.6 billion people without access to toilets worldwide, sanitation is not just an African problem.\nOn November 19, 2021, the annual World Toilet Day was celebrated.\nBecause they don’t have one that works properly.”We all should care more about toilets, especially persons who don’t have any."
  },
  {
    "headline": "Obaseki tasks on production, urges efforts to reduce wastes on importation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for concerted efforts among stakeholders to address critical issues in the manufacturing sector, ensuring that the country is able to produce what it consumes so as to reduce excess wastes on importation.\nObaseki gave the charge while declaring open a workshop organised by Manufacturing Africa and Edo State Investment Promotion Office, at the Government House in Benin City.\nAccording to him, “The situation that we are in Nigeria today is so critical; critical not only because we are a poor country, but because the bulk of what we consume is imported.\nReiterating the need to strengthen the manufacturing sector, Obaseki noted: “Why are we not manufacturing today?\nWe have not had an investment culture for a long time.”The governor continued: “We are not welcoming investors, particularly in the manufacturing investment area."
  },
  {
    "headline": "UK Removes Nigeria, Others from Travel Ban List, Shelves Hotel Quarantine – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The UK government has today announced that all countries, including Nigeria, will be removed from its international travel red list from 4am tomorrow because Omicron is already running rampant in the UK.\nThe red list was reintroduced last month following the emergence of Omicron in order to prevent importing cases into the UK.\nDespite the change on the red list, tougher travel testing rules introduced in response to the variant will remain in place.\nPeople arriving in the UK from red list countries must currently spend 11 nights in a quarantine hotel at a cost of £2,285 for solo travellers.\nRemoving all 11 countries from the list will mean that ministers will once again mothball the hotel quarantine system."
  },
  {
    "headline": "Edo sensitises motorists, others, insists on compliance with traffic signs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, through the state’s Public Works Volunteers (PUWOV) on Tuesday, embarked on massive sensitization across the Benin metropolis, to enlighten motorists and other road users on the need to ensure compliance with traffic signs.\nThe PUWOV team also intensified the placement of caution signs in strategic locations in the Benin metropolis, in line with the directive of the Edo State Governor, Mr. Godwin Obaseki, to ensure sanity across the state.\nThe caution signs had various inscriptions including ‘No Packing’, ‘No Picking of Passengers’, ‘No U-Turn’ and ‘No Dropping of Passengers’, among others.\nThe caution signs were placed in strategic locations in Benin City, including New Benin, 3rd East Circular, Aduwawa, Ramat, Agip, Oliha, Uselu, Egor, and Oluku, among others.\nHowever, after placing these signs in these areas, we discover that touts and hoodlums remove these signs from the roads."
  },
  {
    "headline": "Controversial Femi Fani-Kayode Finally Docked By EFCC For Forgery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Economic and Financial Crimes Commission, EFCC, has finally dragged a former Minister of Aviation, Femi Fani-Kayode to court for alleged forgery.\nSpecifically, the EFCC claims that the former Minister procured one Dr. Ogiewu Ozeigbe to procure the fake medical report.\nMr. Rotimi Oyedepo at the proceeding urged the court to take the plea of the defendant over the allegation.\nFani-Kayode counsel told the court that the various authorities cited by the prosecution counsel to back up his claims are wrongly interpreted.\nFani-Kayode counsel urged the court to entertain the application and rule on it before the plea can be taken."
  },
  {
    "headline": "Marriages conducted at Ikoyi marriage registry, others are legal – FG insists",
    "summarized_story": "The federal government has said marriages conducted at Ikoyi marriage registry and other federal courts are legal, debunking reports to the effect that the Federal High Court sitting in Lagos has declared all marriages conducted by the Ikoyi marriage registry illegal and invalid.\nIt also stated that contrary to their (local government’s) pleading, the trial judge held that nothing in the role of local governments, as defined in the Constitution, suggests that they can conduct or contract marriages.\n“It is noteworthy that, the same Federal High Court situated in Ikoyi, Lagos in Suit No.\nThe Court affirmed that powers of the local governments to contract statutory marriages is derived from the Legal Notices issued by the President.\n“The Court also confirmed that the role of local governments, as enshrined in the Constitution is limited to registration of all forms of marriages (including Islamic and customary marriages)."
  },
  {
    "headline": "NGX RegCo Restates Commitment to Promoting Fair, Transparent Market",
    "summarized_story": "NGX Regulation (NGX RegCo) Limited today restated its commitment to promoting a fair, transparent, and orderly Nigerian capital market at the the 2021 Issuers’ Engagement Forum with the theme: ‘Corporate Disclosures – Beyond Numbers’.\nSpeaking at the conference, the Chief Executive Officer, NGX RegCo, Ms. Tinuade Awe stated, “The impact of the COVID-19 pandemic is still very much visible across the global economy.\nThe Securities and Exchange Commission also recently introduced its Guidelines for Sustainable Financial Principles for the Nigerian Capital Market in April 2021.\nEngagement such as this are particularly important because the capital market is information driven.\nNGX RegCo, therefore, continues to encourage Issuers to show transparency in their business activities through timely disclosure of price sensitive information to the market to prevent information asymmetry."
  },
  {
    "headline": "COVID-19: Sterling Bank Reaffirms Support for Sustainable Healthcare",
    "summarized_story": "Managing Director/Chief Executive Officer (MD/CEO), Sterling Bank Plc, Mr. Abubakar Suleiman, has said the bank is deeply committed to deploying resources in support of Nigeria’s healthcare system.\nSpeaking at the National COVID-19 Summit in Abuja recently, Suleiman disclosed that Sterling Bank provided technical support for the Presidential Steering Committee and other stakeholders in the planning of the summit.\nHe said the bank also helped to build testing platforms for COVID-19 during the initial phase of the pandemic.\nHe asserted, “Now, we are going into a phase where we need to plan for the future beyond COVID-19.\nWe tell anyone that if you are doing anything in healthcare where you need support, not just financials, you should be speaking to Sterling Bank because we are here not to make money but to make impact."
  },
  {
    "headline": "Female secondary school student arrested for allegedly poisoning her guardian",
    "summarized_story": "Idowu Olakunle, AbeokutaAn eighteen-year-old senior secondary school student has been arrested by Police in Ogun state for allegedly attempting to kill her guardian.\nThe suspect, Tope Fasanya was said to have allegedly added rat poison to the food she served her guardian, Mrs Esther Bada.\nShe told the Police that immediately after eating the food served her by the girl, she felt sharp stomach pain and became very uncomfortable.\nAccording to her, the situation and Tope’s refusal to eat the food made her suspect foul play.\nThe State Police Commissioner, Lanre Bankole has directed that the suspect be arraigned in court as soon as investigation was concluded."
  },
  {
    "headline": "Savannah Energy Signs Share Purchase Agreement With Exxon Mobil",
    "summarized_story": "Savannah Energy Plc, the British independent energy company focused around the delivery of Projects that Matter in Africa, has announced that it has signed a Share Purchase Agreement (“SPA”) with Exxon Mobil Corporation, ExxonMobil International Holdings, Inc. and Esso Exploration Holdings, Inc. (“Exxon”) .\n(“PETRONAS (E&P) Overseas Ventures”) relating to the purchase of each of their entire upstream and midstream assetportfolios in Chad and Cameroon (respectively, the “Exxon Acquisition” and the “PETRONAS Acquisition”).\nThis follows Savannah’s initial announcement on 2 June 2021 regarding the proposed transaction with Exxon, and Savannah’s earlier announcements today regarding the Exxon Acquisition and the PETRONAS Acquisition.\nThe remaining 25 per cent interest in the Doba Oil Project is held by the national oilcompany of Chad,SHT Petroleum Chad Company Limited (“SHT”).\nLastly, I would thankthe ExxonMobil, PETRONAS and Savannah dealand advisory teams for the hard work that has been undertaken to get to this point.”"
  },
  {
    "headline": "Savannah Energy Signs Share Purchase Agreement With Exxon Mobil",
    "summarized_story": "Savannah Energy Plc, the British independent energy company focused around the delivery of Projects that Matter in Africa, has announced that it has signed a Share Purchase Agreement (“SPA”) with Exxon Mobil Corporation, ExxonMobil International Holdings, Inc. and Esso Exploration Holdings, Inc. (“Exxon”) .\n(“PETRONAS (E&P) Overseas Ventures”) relating to the purchase of each of their entire upstream and midstream assetportfolios in Chad and Cameroon (respectively, the “Exxon Acquisition” and the “PETRONAS Acquisition”).\nThis follows Savannah’s initial announcement on 2 June 2021 regarding the proposed transaction with Exxon, and Savannah’s earlier announcements today regarding the Exxon Acquisition and the PETRONAS Acquisition.\nThe remaining 25 per cent interest in the Doba Oil Project is held by the national oilcompany of Chad,SHT Petroleum Chad Company Limited (“SHT”).\nLastly, I would thankthe ExxonMobil, PETRONAS and Savannah dealand advisory teams for the hard work that has been undertaken to get to this point.”"
  },
  {
    "headline": "Access Bank Rewards Customers With Gifts",
    "summarized_story": "Access Bank Plc, said it will be rewarding its customers with cash prizes, mobile phones, gift hampers, bags of rice, Groundnut Oil and other various gift items in the XtraWin 12 days of Christmas offer.\nThe bank, which is renowned for regularly rewarding its customers, disclosed this in a statement, noting that,the reward campaign is open for all new and existing customers of the bank.\nThe campaign tagged ‘12 Days of Christmas’ will run from December 13 to December 24, 2021.\nThe group head, Products and Segments, Access Bank, Adaeze Ume, said, the aim of the campaign is to deliver on the promise of the bank to continually reward customers for their loyalty and savings culture.\nCustomers who qualify for the 12 days draw will automatically qualify for the jingle bell day draw on Christmas day."
  },
  {
    "headline": "Access Bank Rewards Customers With Gifts",
    "summarized_story": "Access Bank Plc, said it will be rewarding its customers with cash prizes, mobile phones, gift hampers, bags of rice, Groundnut Oil and other various gift items in the XtraWin 12 days of Christmas offer.\nThe bank, which is renowned for regularly rewarding its customers, disclosed this in a statement, noting that,the reward campaign is open for all new and existing customers of the bank.\nThe campaign tagged ‘12 Days of Christmas’ will run from December 13 to December 24, 2021.\nThe group head, Products and Segments, Access Bank, Adaeze Ume, said, the aim of the campaign is to deliver on the promise of the bank to continually reward customers for their loyalty and savings culture.\nCustomers who qualify for the 12 days draw will automatically qualify for the jingle bell day draw on Christmas day."
  },
  {
    "headline": "SMEDAN Begins Training Of Youths On Business Skills Devt Initiative",
    "summarized_story": "The Small and Medium Enterprises Development Agency of Nigeria (SMEDAN), has begun training for the first batch of youths under the entrepreneurship and vocational components of the National Business Skills Development Initiative (NBSDI).\nThe beneficiaries will be trained in Personal and Business Vision, Business Plan, Identification of Business Opportunities, Selling and Marketing Strategies, Accessing Business Finance, Customer Care and Legal Regulatory Issues.\nThe statement further added that the vocational training, which stated on Monday, December 6, 2021, will inculcate Fashion Design and Tailoring, Leather Works, Photography, Hair Dressing, Block/Brick making, GSM Repairs, Make Up and Tilling in the trainees.\nHe said the agency was determined and committed to train Nigerian youths for them to be self-reliant, adding that the vocational skills and empowerment was an added advantage as SMEDAN will do all in its power to train and empower Nigerian youths.\nHe commended the Director General of SMEDAN, Dr. Dikko Umaru Radda, for throwing his weight behind the initiative, which has gone a long way in impacting positively on Nigeria youths."
  },
  {
    "headline": "ANAMBRA APC Tussle: Stop attacking individuals, face reality, APC stakeholders to Ngige",
    "summarized_story": "Said one of the stakeholders:”Last week, the APC in Anambra state scheduled a State Caucus meeting at the office of Senator Andy Uba.\nStakeholders rather attended the meeting called by Uba, whereupon about 90 percent of constitutionally recognized state caucus members affirmed Uba as the Anambra state leader of the APC.\n“In the year 2000, I was one of the commissioners, under the Anambra State Education Commission under the administration of then Governor Chinwoke Mbadinuju.\nWhen Ngige came to campaign at Onitsha South in 2003, it was in my office at Zik’s Road, Fegge that he was hosted.\n“The APC in Anambra state is the only one that hasn’t won any elections in Nigeria since formation."
  },
  {
    "headline": "ANAMBRA APC Tussle: Stop attacking individuals, face reality, APC stakeholders to Ngige",
    "summarized_story": "Said one of the stakeholders:”Last week, the APC in Anambra state scheduled a State Caucus meeting at the office of Senator Andy Uba.\nStakeholders rather attended the meeting called by Uba, whereupon about 90 percent of constitutionally recognized state caucus members affirmed Uba as the Anambra state leader of the APC.\n“In the year 2000, I was one of the commissioners, under the Anambra State Education Commission under the administration of then Governor Chinwoke Mbadinuju.\nWhen Ngige came to campaign at Onitsha South in 2003, it was in my office at Zik’s Road, Fegge that he was hosted.\n“The APC in Anambra state is the only one that hasn’t won any elections in Nigeria since formation."
  },
  {
    "headline": "DSS: Nnamdi Kanu not maltreated, enjoying full luxury at our facility",
    "summarized_story": "The Department of State Services has denied speculations that the leader of the Indigenous People of Biafra, Nnamdi Kanu was being maltreated in its facilities.\nThe public relations officer of the Department of State Services, Dr Peter Afunanya disclosed this at a press briefing on Tuesday in Abuja.\nHe said, “The service denies all inciting allegations by IPOB and State that , Nnamdi Kanu is not in anyway maltreated in custody.\nAccusation of maltreatment negate the service’s Standard Operation Procedure on the implementation of rights of a suspect.\n“Kanu enjoys full luxury in the holding facility incomparable to any of its type anywhere in the country."
  },
  {
    "headline": "DSS: Nnamdi Kanu not maltreated, enjoying full luxury at our facility",
    "summarized_story": "The Department of State Services has denied speculations that the leader of the Indigenous People of Biafra, Nnamdi Kanu was being maltreated in its facilities.\nThe public relations officer of the Department of State Services, Dr Peter Afunanya disclosed this at a press briefing on Tuesday in Abuja.\nHe said, “The service denies all inciting allegations by IPOB and State that , Nnamdi Kanu is not in anyway maltreated in custody.\nAccusation of maltreatment negate the service’s Standard Operation Procedure on the implementation of rights of a suspect.\n“Kanu enjoys full luxury in the holding facility incomparable to any of its type anywhere in the country."
  },
  {
    "headline": "House of Reps give Buhari nod to borrow $5.8bn",
    "summarized_story": "By Femi OgunsholaThe House of Representatives has approved President Muhammadu Buhari’s loan request of 5.8 billion dollars.\nThe approval followed the adoption of the report of the House Committee on Aids, Loans and Debt Management on Tuesday in Abuja.\nPresenting the report, Rep. Ahmed Safana, the Chairman of the Committee said that the loan was part of the Federal Government’s 2018-2020 external borrowing plan.\n“I hereby move that the house do consider final report of the Committee on Aids, Loans and Debt Management on the 2018–2020 External Borrowing (Rolling) Plan,” he said.\nThe House, while approving the request, asked that the terms and conditions of the loan from the funding agencies be forwarded to the National Assembly for proper scrutiny."
  },
  {
    "headline": "7-star Manchester City maul Leeds",
    "summarized_story": "Agency ReportManchester City crushed Leeds United 7-0 at the Etihad Stadium on Tuesday to make it seven Premier League wins a row and move four points clear at the top of the table.\nAston Villa beat bottom club, Norwich 2-0 in the second Premier league match of the day.\nCity simply routed Marcelo Bielsa’s Leeds, taking the lead in the eighth-minute through Phil Foden.\nThe Spaniard’s counterpart, Leeds’ Argentine manager Marcelo Bielsa, could do nothing to halt a rampant City and his team’s wide-open approach certainly did little to help.\nCity have 41 points with Liverpool and Chelsea, who both play on Thursday, on 37 and 36 points respectively."
  },
  {
    "headline": "Breaking: Armed robbers raid banks in Kogi community",
    "summarized_story": "Armed robbers armed with sophisticated weapons on Tuesday afternoon raided banks in Odo Ere, headquarters of Yagba West local government area of Kogi state.\nThe robbers, said to be about 13 in number, stormed the community and killed several passerby while the banks were painted with bullets.\nBlueprint learnt that the criminals operated for about two hours, going from bank to bank, before they eventually escaped.\nPolice are yet to confirm the incident as at the time of filling this report."
  },
  {
    "headline": "[Breaking] Omicron: UK bows, removes Nigeria from red list",
    "summarized_story": "The government has said that all 11 countries will be removed from the UK’s travel red list from 4am on Wednesday.\nThe red list was reintroduced in late November as a precaution after the emergence of the Omicron variant.\n“Now that there is community transmission of Omicron in the UK and Omicron has spread so widely across the world, the travel red list is now less effective in slowing the incursion of Omicron from abroad,” he told parliament.\n“Whilst we will maintain our temporary testing measures for international travel we will be removing all 11 countries from the travel red list effective from 4am tomorrow morning.”Currently, all UK arrivals from red list countries must pay for and self-isolate in a pre-booked, government-approved hotel for 10 days.\nTim Alderslade, head of trade group Airlines UK, said emptying the red list made “complete sense”, but that the government should also scrap pre-departure and day two tests for all arrivals."
  },
  {
    "headline": "Buhari nominates new minister, reappoints INEC National Commissioners",
    "summarized_story": "President Muhammadu Buhari has forwarded to the Senate for confirmation, Muazu Jaji Sambo, as ministerial nominee from Taraba state.\nJaji Sambo is to replace Saleh Mamman who before the last cabinet reshuffle by President Buhari, served as Minister of Power.\nPresident Buhari, in the letter explained that the request was made in accordance with Section 147(2) of the Constitution of the Federal Republic of Nigeria (as amended).\n(Adamawa), North East; Prof. Rada H. Gumus (Bayelsa), South South; Mr. Sam Olumeku (Ondo) South West as National Commissioners of INEC and Olaniyi Olaleye Ijalaye (Ondo) South West, as Resident Electoral Commissioner.\nBuhari in another letter dated December 10, 2021, President Muhammadu Buhari sought the confirmation of the appointment of five nominees as Commissioners for the National Population Commission (NPC)."
  },
  {
    "headline": "Omicron: UK Govt Removes Nigeria, 10 Others From Red List",
    "summarized_story": "The UK government has removed Nigeria and 10 other countries from its red list.\nAccording to him, the red list is “now less effective in slowing the incursion of Omicron from abroad”.\nRead Also: Nigeria’s Plan To Red List UK, Others Not Tit-For-Tat, Says MinisterThe red list was reintroduced in late November as a precaution after the emergence of the new Omicron variant of the COVID-19.\nThe reversal comes just days after Nigeria said it had plans to also place the UK on a red list.\n“Whichever way we act, it is in consonance with what we take to be in our own best interest."
  },
  {
    "headline": "Ishaku Meets Buhari, Seeks Permanent Military Bases On Taraba’s Border With Cameroon",
    "summarized_story": "﻿Taraba State Governor Darius Ishaku on Tuesday met with President Muhammadu Buhari and said setting up permanent military bases along Taraba’s border with Cameroon is the only solution to incessant Ambazonia attacks on Nigerian civilians.\nREAD ALSO: Nigeria Will Fulfill Its Promises, Buhari Tells ECOWAS Parliament“The military is stationed there for now,” Ishaku said on Channels Television’s Politics Today.\n“Therefore we need to station a naval base, an air force base to police the borders and also a military base on a permanent basis,” he said.\n“This is the only way we can prevent the re-occurrence of these Ambazonians, which is one too many.”Mr. Ishaku noted that the President’s response was very positive.\nI think we are on the way to a permanent solution.”"
  },
  {
    "headline": "2023 Presidency: Tinubu Pledges To ‘Consult Widely’ Before Making A Decision",
    "summarized_story": "National leader of the All Progressives Congress (APC), Ahmed Bola Tinubu on Tuesday said he will consult widely before making a decision on whether to run for the Presidency in 2023.\n“I am not going to turn them down,” he said of voices that have clamoured for his candidacy.\n“But I will still effectively and widely consult, particularly brainstorm with my friends and find a date to come out openly and tell Nigerians.\nSo you can keep guessing.”Tuesday’s meeting is seen as part of his consultations towards his 2023 presidential ambitions.\nSome South-West politicians, including Lagos State Governor Babajide Sanwo-Olu, have openly endorsed Tinubu for President."
  },
  {
    "headline": "Marriages Conducted In Ikoyi Registry Are Not Illegal, Says FG",
    "summarized_story": "The Ministry of Interior has debunked reports making the rounds that the Federal High Court sitting in Lagos has declared all marriages conducted by the Ikoyi marriage registry illegal and invalid.\nThe attention of the Ministry of Interior has been drawn to news making the rounds on social media claiming that the Federal High Court sitting in Lagos has declared all Marriages conducted by Ikoyi marriage registry to be illegal and invalid.\nIt is noteworthy that, the same Federal High Court situated in Ikoyi, Lagos in Suit No.\nThe Court affirmed that powers of the local governments to contract statutory marriages is derived from the Legal Notices issued by the President.\nThe Court also confirmed that the role of local governments, as enshrined in the Constitution is limited to registration of all forms of marriages (including Islamic and customary marriages)."
  },
  {
    "headline": "Barcelona’s Aguero Poised To Retire With Heart Condition",
    "summarized_story": "Barcelona forward Sergio Aguero will make an announcement on his future on Wednesday following cardiac and respiratory difficulties suffered while playing in La Liga in October.\nAguero will be accompanied at a press conference Wednesday by club president Joan Laporta, where local media say he will announce his retirement.\nThe club said after he underwent heart tests in November that Aguero would be unavailable for the next three months while the effectiveness of treatment was evaluated.\n“There are rumours going around but I’m following the club doctor’s opinion and we’ll see how I am in 90 days,” he wrote on Twitter.\nAguero left Man City as their all-time record goalscorer with 260 goals, and with the most goals scored for a single club in Premier League history — 184 goals in 275 appearances."
  },
  {
    "headline": "Gov. Dapo Abiodun mourns Olowu of Owu, Olusanya Dosunmu -",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has expressed shock at the transition of the Olowu of Owu Kingdom, Oba Olusanya Dosunmu, Amororo II.\nIn a condolence message issued on by his behalf on Tuesday by his Chief Press Secretary, Kunle Somorin in Abeokuta, Gov.\nAbiodun described the Oba Dosunmu as “a quintessential monarch, a man of peace and a passionate supporter of development.”While condoling with the monarch’s immediate family and the people of Owu, the governor said they should take solace in the lasting impact he had on his domain.\nHe prayed that “God Almighty grants Kabiyesi’s soul eternal repose and the people he left behind the fortitude to bear this loss”, the statement surmised."
  },
  {
    "headline": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest",
    "summarized_story": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest"
  },
  {
    "headline": "2022 Budget: Assembly passes N188.4bn for Sokoto State",
    "summarized_story": "The Sokoto State House of Assembly has passed the the state 2022 budget of N188.4 billion following the adoption of the report of the House Committee on Finance and Appropriation at the plenary sitting of the Assembly.\nThe budget, tagged, “Budget of accomplishments and sustainable development”, is lower than the 2021 budget of N205,016,512,295.41 by N16,587,016,447.78, consisting both the Recurrent and Capital Expenditures approved by the Assembly.\nPresenting the report, Chairman of the Committee Malami Basakkwace (PDP- Sokoto South II) explained that the committee did not add or subtract from the figures presented by the governor.\nHe said, based on genuine request by sub-committees, the committee moved resources inwards to accommodate some important demands and interest of our the people of the state.\nMr. Basakkwace said the committee recommended that all sources of funding identified in the budget should be maintained and their conditions adhere to."
  },
  {
    "headline": "Electoral Amendment: A look at the Journey to credible elections in Nigeria",
    "summarized_story": "Electoral Amendment: A look at the Journey to credible elections in Nigeria"
  },
  {
    "headline": "The Return Of Stolen Benin Bronze Artefacts",
    "summarized_story": ""
  },
  {
    "headline": "Falana Petitions Police + UAE Lifts Entry Ban – Trending With Ojy Okpe",
    "summarized_story": "A Nigerian medical student who is also an illustrator, 25-year-old Chidiebere Ibe on November 24th posted an image he drew of a pregnant Black woman’s womb on Instagram, a diagram that is rarely seen in the medical industry.\nMeanwhile, the Federal High Court Lagos last Wednesday declared as illegal any marriage conducted by Federal Registries saying only the local government marriage registries are empowered by the provisions of the Nigerian 1999 Constitution to conduct marriage.\nIn another development, hundreds of passengers were stranded at Nigerian international airports when they were told by airlines billed to airlift them that they would not travel to Dubai due to a directive from the UAE.\nMeanwhile, in the aftermath of the United Kingdom placing countries on a ‘red list’ over the Omicron coronavirus variant, a video of two passengers who appeared to be travelling to England on an empty plane has made the rounds.\nFinally, human rights lawyer and Senior Advocate of Nigeria, Femi Falana, has called for an investigation into what he describes as reckless and false comments made by blogger Kemi Olunloyo regarding the death of 12 year old Sylvester Oromoni."
  },
  {
    "headline": "UAE Backs Down, Concedes Seven Flights Per Week to Air Peace",
    "summarized_story": "The United Arab Emirates (UAE) has increased the number of flight slots given to Nigerian flag carrier Air Peace to seven per week from an initial one per week.\nDubai Civil Aviation Authority announced the slot extension in a letter to the Air Peace chairman amid an ongoing diplomatic row between Nigeria and the UAE.\nIt said the letter was “with regard to slot availability at DXBTerminal 1 and as a gesture of goodwill and in support of UAE and Nigeria relations, in case Air Peace wish to start their flights, slots have been blocked by Dubai Airports.\nWe surely wish to facilitate easy and safe travel for the people, between our two brotherly countries.”The aviation authority listed seven slots for Air Peace flights in the Arab country.\nBut the Nigerian government on Saturday ordered that UAE-operated airlines come into the country only once a week to reciprocate the one slot given to Nigerian airline, Air Peace, saying the UAE violated bilateral air agreement."
  },
  {
    "headline": "Aubameyang Stripped of Arsenal Captaincy as Arteta Punishes Disciplinary Breach",
    "summarized_story": "Pierre-Emerick Aubameyang has been stripped of the Arsenal captaincy and will not be selected for Wednesday’s match against West Ham, throwing the striker’s future at the club into doubt.\nMikel Arteta dropped Aubameyang from the squad that beat Southampton on Saturday over returning late from a trip abroad and the manager afterwards refused to take questions on the player’s status as club captain.\n“Following his latest disciplinary breach last week, Pierre-Emerick Aubameyang will no longer be our club captain, and will not be considered for selection for Wednesday’s match against West Ham United,” the club said.\nAlexandre Lacazette captained Arsenal against Southampton but his long-term future is unclear and Arteta is short of senior players capable of stepping up.\nHis prospects of seeing out that deal will be under question now that Arteta has taken such firm action."
  },
  {
    "headline": "Air Force Discharges 27 for Refusal to Get Covid Vaccine",
    "summarized_story": "The Air Force gave its forces until Nov. 2 to get the vaccine, and thousands have either refused or sought an exemption.\nAir Force spokeswoman Ann Stefanek said Monday that these are the first airmen to be administratively discharged for reasons involving the vaccine.\nEach of the services set its own deadlines and procedures for the mandate, and the Air Force set the earliest deadline.\nAccording to the latest Air Force data, more than 1,000 airmen have refused the shot and more than 4,700 are seeking a religious exemption.\nAs of last week, a bit more than 97% of the active duty Air Force had gotten at least one shot."
  }
]