[
  {
    "headline": "Urinating in swimming pools puts swimmers at risk of lung damage, eye problems, expert warns",
    "summarized_story": "Urinating in the swimming pool, he said, may not only be a bad habit but could be an act that put the health of others at risk.\nAccording to Dr. Bonire, urinating in the swimming pool could cause harmful effects on the lungs and eyes of those using the pool.\nHe, however, noted that the rate at which the inhaled chlorine and uric acid compounds cause lung disease could be very low.\nDr. Bonire stated further that how a swimming pool is managed by the owners, could also determine the level of the risk of lung diseases from those urinating in the pool.\nHe explained, “Another issue is the chlorine fluid in the pool water getting into the bladder of an individual."
  },
  {
    "headline": "Urinating in swimming pools puts swimmers at risk of lung damage, eye problems, expert warns",
    "summarized_story": "Urinating in the swimming pool, he said, may not only be a bad habit but could be an act that put the health of others at risk.\nAccording to Dr. Bonire, urinating in the swimming pool could cause harmful effects on the lungs and eyes of those using the pool.\nHe, however, noted that the rate at which the inhaled chlorine and uric acid compounds cause lung disease could be very low.\nDr. Bonire stated further that how a swimming pool is managed by the owners, could also determine the level of the risk of lung diseases from those urinating in the pool.\nHe explained, “Another issue is the chlorine fluid in the pool water getting into the bladder of an individual."
  },
  {
    "headline": "Managing water retention by the body",
    "summarized_story": "This week, we shall be discussing the malady of having water retained around the body.\nWater retention is a part of the whole complex of fluid retention.\nAnd if a problem arises from any of these systems mentioned above, fluid begins to accumulate around the body leading to body swelling and discomfort arising from them.\nAnother common cause of such an incident is when certain blood pressure medicines are used.\nThe other aspect is due to the effect of hormones causing the body to retain water."
  },
  {
    "headline": "Managing water retention by the body",
    "summarized_story": "This week, we shall be discussing the malady of having water retained around the body.\nWater retention is a part of the whole complex of fluid retention.\nAnd if a problem arises from any of these systems mentioned above, fluid begins to accumulate around the body leading to body swelling and discomfort arising from them.\nAnother common cause of such an incident is when certain blood pressure medicines are used.\nThe other aspect is due to the effect of hormones causing the body to retain water."
  },
  {
    "headline": "How govt officials sabotaged power project over bribe – Adebayo, SDP presidential candidate",
    "summarized_story": "Adebayo said for the past 15 years, he has not experienced power outage from his Abuja office because.\nHe added that he secured the agreement to provide jobs with 2,000 American companies who are willing and ready to come over to Nigeria to establish and provide employment.\nSo if you contact the governor…“I said I must contact Fayemi(Governor of Ekiti state) before I enter Ekiti, God forbid.\nLuckily enough, I had the contact of the Chief of Defence Staff, called his office, somebody in his office answered.\nI am going to Ekiti for a rally and I have been held here for more than an hour."
  },
  {
    "headline": "APC, Ayade will sweep Cross River in 2023 – Omagu",
    "summarized_story": "By Emma UnaAN All Progressives Congress, APC, chieftain in Northern Senatorial District, Odi Omagu, has expressed joy over the victory of Senator Ben Ayade in the wedge Senatorial primary for the Cross River North post held last week.\nAddressing newsmen in Calabar on Sunday, Omagu said Governor Ayade is a man of the people and winning the Senatorial election for the Cross River North post in the 2023 election is a reality.\n“There is hardly any household in Cross River that has not been touched by the people-oriented policies of Governor Ayade, particularly his Food on the Table programe which had over twenty thousand people monthly receiving alert from the state payroll.\nHe called on those in opposition to identify with the Ayade project early to avoid being retired politically.\nLet everyone including those in opposition join forces with the Ayade for Senate project to avoid being rendered politically irrelevant,” he noted."
  },
  {
    "headline": "2023: Peter Obi’s ambition not ordinary, says Prophet",
    "summarized_story": "By Vincent UjumaduPROPHET Godfrey Gbujie of the Ministerial Leader of World Zionist Union has said that the presidential bid of the candidate of the Labour Party ( LP), Mr. Peter Obi was not ordinary, stating that there were strong spiritual forces backing him in the race.\nSpeaking in Awka yesterday, Gbujie said Nigerians might witness surprises in the polls and called for prayers for a peaceful exercise.\n“What is happening around Peter Obi ahead of 2023 presidential election is not ordinary and everybody especially those in authorities should be very careful.\n“I am saying this because nothing happens accidentally in the religious, economic and socio-political realm.\n“The hand of God is behind what is happening around Peter Obi, especially the mass support from the youths across the country."
  },
  {
    "headline": "APC, Tinubu shouldn’t create tension with choices, says SDP presidential candidate, Adebayo",
    "summarized_story": "Adebayo said the choice of Tinubu’s vice presidential candidate portrayed him as insensitive.\nThat third force, Adebayo said he doesn’t see Peter Obi, the Labour Party presidential candidate, in it.\nWould you say if Tinubu didn’t get the APC ticket and he crossed over to SDP as was being speculated, he automatically becomes third force?\nIf Wike decides to leave PDP and join SDP, he is a third force?\n“If my mother is holding a meeting women Catholic meeting, I cannot join because I am not a woman,” Prince Adebayo said."
  },
  {
    "headline": "Osun election: I’ve not formally heard form INEC that Oyetola lost – APC chair, Adamu",
    "summarized_story": "Adamu claimed he is unaware Osun State Governor, Gboyega Oyetola lost his reelection bid to his closest rival, the candidate of Peoples Democratic Party, Ademola Adeleke.\nAdamu made the remarks while speaking on Arise TV programme on Sunday, denied having knowledge of the winner of the Osun governorship election.\nI have not formally heard the announcement from INEC, which is the independent commission responsible for election in Nigeria.\n“Between me and you, I have not formally heard from INEC and I have not read the papers you are talking about.\n“Until I hear from INEC formally or my people in the control room confirm that it is the result, of course, I will abide by it."
  },
  {
    "headline": "Buni asks FG for help as flood displaces scores, washes away farms in Yobe",
    "summarized_story": "Yobe State Governor, Mai Mala Buni is seeking the Federal Government’s intervention through the National Emergency Management Agency (NEMA) to support over a dozen communities devastated by the recent flood in some parts of the state.\nBuni, in a statement by Director General, Press and Media Affairs, Mamman Mohammed, said the need for collaborative efforts with the Federal Government and NEMA became imperative in view of the huge devastation suffered by the communities, particularly in Gujba and Gulani local government areas.\nHe also disclosed that about half a kilometer of the road linking Gulani and Gujba local government areas has been washed away by the flood, hence cutting off Gulani Local Government Area from other parts of the state.\nGovernor Buni, who expressed deep sympathy to the victims who lost their houses, farms, and livestock, assuring them of government assistance.\nMeanwhile, Buni has directed the State Ministry of Humanitarian Affairs and State Emergency Management Agency (SEMA) to provide emergency relief materials to the affected communities."
  },
  {
    "headline": "Nigerian-born tech execs convicted in US for laundering $167m",
    "summarized_story": "Three businessmen of Nigerian descent – Anslem Oshionebo, Opeyemi Odeyale and Aleoghena Okhumale – have been convicted for money laundering in the United States.\nTheir fate was sealed after Ping Express U.S. LLC pleaded guilty to failure to maintain an effective anti-money laundering program.\nThe Texas company, which transferred millions of dollars from America to Africa, admitted that it failed to play by the rules.\nPing Express charged U.S. customers a fee to remit money to beneficiaries in Nigeria and other countries in the continent.\nPing Express transmitted more than $167million outside America, including $160million to Nigeria, in less than three years."
  },
  {
    "headline": "Gbajabiamila mourns APC chieftain, Kemi Nelson",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has expressed sadness over the death of Chief Mrs. Kemi Nelson, a one-time All Progressives Congress, APC, Women Leader for the South West.\nGbajabiamila, who described Mrs Nelson as one of the pillars of the APC in Lagos and Nigeria as a whole, said her death was a huge loss.\nMrs Nelson, a former executive director of the Nigeria Social Insurance Trust Fund (NSITF), died on Sunday at the age of 66.\nShe was a former Commissioner in Lagos State and until her demise, a member of the Lagos State Governor’s Advisory Council (GAC).\nHe sent heartfelt condolences to her family, Nigerian women politics, the Lagos State Government, and the entire APC family."
  },
  {
    "headline": "Osun decides: Counting process was transparent – Election Observer",
    "summarized_story": "An election monitoring group, Yiaga Africa, said the counting process at polling units during the Osun State governorship election was transparent.\nThe group’s Board Chairman, Dr Hussain Abdu, speaking at a news conference on Sunday in Osogbo, said that the Independent National Electoral Commission’s (INEC) official announcement on the votes cast during the election was consistent with the group’s Watching the Votes (WTV) estimated range.\nHe said, ”The official results fall within the estimated ranges, candidates, parties, and voters should have confidence that the official results for the Osun 2022 gubernatorial election reflect the ballots cast at polling units on Saturday, July 16, 2022.”Abdu stated that the group used the Parallel Vote Tabulation (PVT) methodology and deployed 500 observers in pairs to a representative random sample of 250 polling units, 32 mobile observers in all 30 local government areas, and 30 results collation observers.\nYiaga Africa applauded the people of Osun for their resilience and commitment to a non-violent election.\nSenator Ademola Adeleke defeated his closest rival Gboyega Oyetola at the Saturday governorship election with 404,371 votes."
  },
  {
    "headline": "Buhari consoles Lagos, Tinubu over death of APC chieftain, Kemi Nelson",
    "summarized_story": "President Muhammadu Buhari has commiserated with the family of frontline politician and advocate of the womenfolk, Kemi Nelson.\nThe President, on behalf of his wife, also sent condolences to the government and people of Lagos, APC presidential candidate, Bola Tinubu, and the party.\nBuhari described Nelson as a “faithful party member who devoted so much to the evolution, development, sustenance and relevance of the party in Lagos and around the country”.\nHe noted her contributions as Commissioner for Women Affairs and Poverty Alleviation in Lagos, Woman Leader, APC National Deputy Women Leader, and ex-Executive Director of the Nigerian Social Insurance Trust Fund (NSITF).\n“As the only female member of the Lagos State Governor’s Advisory Council (GAC), Kemi Nelson continued to be part of the governance structure that led to the transformation of Lagos State into the Centre of Excellence it has become,” he said."
  },
  {
    "headline": "Why Osinbajo opted for surgery in Nigeria -- Presidential sources The Nation Newspaper",
    "summarized_story": "Vice President Yemi Osinbajo opted to have his thigh surgical procedure in Nigeria because of nationalistic considerations, presidential sources explained on Sunday evening.\nSenior Special Assistant to the President on Media and Publicity, Office of the Vice President, Laolu Akande, on Saturday, announced that Osinbajo had been scheduled for a surgical procedure.\nHe later informed the operation was successfully carried out, adding the Vice President would be on admission at the hospital for a couple of days.\nHowever, sources close to the Vice President revealed that Osinbajo opted to have the procedure performed in Nigeria to reinforce confidence in the nation’s medical and reverse medical tourism.\nConfirming the story, a senior Presidential official, who pleaded anonymity, said it was true the VP was given the option to go abroad but opted to do it here."
  },
  {
    "headline": "Jubilant PDP supporter shoots self in Osun The Nation Newspaper",
    "summarized_story": "A jubilant middle-aged man named Sunday has mistakenly shot himself while celebrating the emergence of candidate of Peoples Democratic Party(PDP) Senator Ademola Adeleke as Osun Governor-elect.\nThe Nation gathered Sunday, who lived at Iraye junction of Ile-Ife, was over joyous while he was with friends around his compound to celebrate emergence of Adeleke.\nA source said: “Sunday went into his house to pick his gun which was loaded.\nHe was attempting to fire a shot to the sky when he shot himself.\nHe is a member of vigilante group but he was claiming that he belonged to Amotekun."
  },
  {
    "headline": "Kogi leads in inflation with 2.69% The Nation Newspaper",
    "summarized_story": "With 2.69% inflation rate in June 2022, Kogi has led as the State with the highest inflation rate in the nation.\nIt had for over a year sustained the lead of the State with the highest food inflation.\nIt noted that Adamawa (-0.26%), Abuja (-.0.03%) and Sokoto (0.79%) recorded the slowest rise on month-on-month inflation.\nThe document added “In June 2022, all items inflation on a year-on-year basis was highest in Bauchi (21.99%), Kogi (21.37%), Ebonyi (20.73%) while Adamawa (16.14%), Sokoto (16.31%) and Jigawa (16.37%) recorded the slowest rise in headline Year-on-Year inflation.\nAccording to the report, on a month-on-month basis, the core sub-index increased to 1.56 percent in June 2022."
  },
  {
    "headline": "Bandits kidnap pregnant woman, seven others in Kaduna The Nation Newspaper",
    "summarized_story": "Bandits have abducted a pregnant woman at Lema community, Mando opposite Nigerian Defence Academy (NDA) in Kaduna State.\nSeven other persons were kidnapped when the bandits entered three houses around 1:00 am on Sunday.\nA resident of the area, Mr Abubakar Umar, said they were all inside their houses when the bandits came and started shooting sporadically.\nAccording to him: “They (bandits) came around 1:00am we were inside our houses, but we were all afraid to step out because of sporadic gunshots.\n“They took away eight residents including a pregnant woman that came to visit her sick mother in the community."
  },
  {
    "headline": "Buhari mourns former APC Women Leader Kemi Nelson The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has commiserated with the Nelson family over the death of former Southwest Zonal Women Leader of the All Progressives (Congress APC), Chief Kemi Nelson.\nIn a statement by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, Buhari, who conveyed First Lady Aisha Buhari’s condolences along with his, described Nelson as “a frontline politician and advocate of the womenfolk”.\nThe President also sent condolences to the Government and people of Lagos State, Presidential candidate of the APC, Asiwaju Bola Ahmed Tinubu, and the Lagos APC family, on the loss of “a consistent and faithful party member who devoted so much to the evolution, development, sustenance and relevance of the party in Lagos and around the country.”Buhari noted the contributions of Nelson as a former Commissioner for Women Affairs and Poverty Alleviation in Lagos State, the State Women Leader, National Deputy Women Leader of APC, and former Executive Director of the Nigerian Social Insurance Trust Fund, remarking that she was such a grassroots mobiliser and an achiever who left her footprints wherever she served.\n“As the only female member of the Lagos State Governor’s Advisory Council (GAC), Kemi Nelson continued to be part of the governance structure that led to the transformation of Lagos State into the Centre of Excellence it has become,” he said.\nThe President prayed that almighty God will grant the husband, Adeyemi Nelson and the family, friends and associates of the deceased, the fortitude to bear the loss and repose her soul."
  },
  {
    "headline": "PDP, Atiku brag over Adeleke’s victory in Osun",
    "summarized_story": "The Peoples Democratic Party ( PDP), in its reaction, said the victory of its candidate in the Osun governorship poll, was a referendum on the APC.\nThe PDP leader said with the Osun victory, the party’s next move is to regain the presidency in the 2023 general elections.\nAnd, indeed, PDP is coming!”Ayu alleged that the Osun State government did everything it could to frustrate the opposition party, prior to last weekend’s election.\nDelta State Governor and vice presidential candidate of the PDP, Ifeanyi Okowa, said the victory of Senator Ademola Adeleke in Saturday’s governorship election in Osun State was a signpost of the determination of the People’s Democratic Party (PDP) to rescue Nigeria in next year’s general elections.\nOkowa said Adeleke’s victory was the beginning of the rescue mission of Nigeria by his party."
  },
  {
    "headline": "Terrorism: You can’t win war by rhetoric, Afenifere tells Buhari – The Sun Nigeria",
    "summarized_story": "By Chukwudi NwejePan Yoruba socio-political organisation, Afenifere, yesterday, tackled President Muhammadu Buhari over his directive to the army to confront and neutralise all terrorists and insurgents.\n“Section 14(2)(b) of the 1999 Constitution as amended, states unambiguously that ‘The security and welfare of the people shall be the primary purpose of government.\nSubsection (c) of the same section 14(2)(c) goes on to make it mandatory for the government to ensure the participation of the people in the governance of the country.\nAs is known, this aspect is observed more in the breach than in the observance.”It charged the government to legalise state police to enable state and local governments secure people at the grassroots.\n“Insurgency ought not to have occurred at all in the first place were the government up to its responsibility."
  },
  {
    "headline": "Unofficial deregulation: Fuel marketers dare FG, raise price above N165/litre",
    "summarized_story": "By Adewale SanyaoluStrong indications that fuel markets may have settled for an unofficial deregulation with majority of filling stations selling Premium Motor Spirit (PMS), popularly called petrol above the officially approved pump price of N165 per litre.\nFindings by Daily Sun across some filling stations in Lagos showed that majority of the filling stations have now adopted different price models.\nAs at yesterday morning (Sunday), the Mobil filling station before Otedola bridge sold at N170 per litre.\nAlso, the Petrocam filling station in Ejigbo, Lagos sold at N177 per litre last Thursday.\nThe unofficial deregulation stand of fuel retailers confirms the posture of the Major Oil Marketers Association of Nigeria(MOMAN) which last week, said the regulated N165 pump price for petrol, was no longer realistic."
  },
  {
    "headline": "NDLEA arrests drug queen over narcotics in fetish bowls at Lagos airport",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has arrested a 27-year-old drug queen, Mrs. Opoola Mujidat, for planting drugs concealed in fetish bowls, containing scary native black soap and sponge on two Oman-bound male passengers, at the departure hall of the Murtala Muhammed International Airport (MMIA), Ikeja, Lagos.\nThe passengers: Raji Babatunde Kazeem and Akinbobola Omoniyi, were travelling together to Oman, Middle East, on Ethiopian Airlines flight, on Monday, July 11, when they were intercepted by NDLEA operatives at the airport.\nElsewhere, NDLEA operatives have intercepted over 91 jumbo bags of cannabis, in Nasarawa State, weighing 1,029.5kg concealed in a truck mounted natural gas tank by Doma road, around 500 Housing Estate, Lafia.\nRecovered from the store where a suspect, Nasiru Abubakar, 27, was arrested include tramadol 250mg (aka Boko Haram); Royal tramadol 225mg (aka Vectra); Tramaking tramadol 225mg (aka Jan Dara); tramadol 200mg (aka Dogari); and tramadol 100mg (aka Green), among others.\nWhile commending the officers and men of the MMIA, Nasarawa, Kaduna and Adamawa commands for the arrests, seizures and their dexterity, Chairman/Chief Executive Officer of NDLEA, Brig."
  },
  {
    "headline": "APC plans legal action against defecting lawmakers",
    "summarized_story": "From Fred Itua, AbujaBarring any last minute change, the leadership of the All Progressives Congress (APC) may institute court cases against defecting National Assembly members, and those threatening to ditch the party.\nThe National Assembly is resuming on Tuesday with lawmakers, predominantly from the APC, likely to announce their defection to opposition platforms.\nFollowing the meeting with Buhari, APC NWC, however, threatened that the defecting lawmakers would forfeit their seats.\nSpeaking on a television programme, APC National Chairman, Abdullahi Adamu, claimed that he was unaware of plans by National Assembly members to defect.\nIn April, few days after his election, National Chairman of APC, Abdullahi Adamu, had suspended top bureaucrats in APC."
  },
  {
    "headline": "Live Updates: Osun Governorship Election 2022 – THISDAYLIVE",
    "summarized_story": "7:20 AMBreaking: PDP’s Adeleke Wins Osun Guber ElectionPeoples Democratic Party Governorship candidate, Senator Ademola Adeleke, has won the Osun Governorship Election.\nMiss Asogwa Ngozika, the Presiding Officer of the polling unit, said they arrived at the polling unit at 6:30 am.\nBut Olatunji said there was a mixed up in the materials brought to the polling unit as a sticker of another polling unit close to the primary school was pasted on the materials.\n“Your colleagues did it successfully in Ekiti and l believe you will also do us proud here in Osun State.\nFor most of yesterday, tension remained very high across Osun State, with voters bitterly divided among the two leading candidates."
  },
  {
    "headline": "Rising Inflation Thrust Money Supply to N48.87trn in June, Highest Since 2010 – THISDAYLIVE",
    "summarized_story": "Further analysis of money supply also showed that major components M2 and M1 recorded sharp increases in June 2022.\nCommenting, Vice President, Highcap securities Limited, Mr. David Adnori said, “In general, an increase in the money supply drives inflation rather than the other way around.\nIn our typical case, money supply growth far outstrips economic growth, which is a typical condition for stoking inflation.\nAs a result, I would ascribe a higher percentage (about 65-70per cent) of the money supply growth to inflation.\nIn our view, we think that the high money supply partly drove Nigeria’s Inflation."
  },
  {
    "headline": "Firms Partner to Expand Strategic Communications in Africa – THISDAYLIVE",
    "summarized_story": "The Gatefield-Muyi strategic partnership is expected to positively change Africa through strategic communications.\nThe two contemporary, impact-driven firms said the deal will increase the footprint of their work across Africa.\nThe are bound by their commitment to contribute to social impact on the continent as strategic partners.\nBeyond the bottom line, social impact is at the heart of Gatefield and Muyi’s values and purpose.\nThey are utilizing their expertise to support the work of Africans, thereby engineering positive change on the continent."
  },
  {
    "headline": "Edo Speaker Congratulates Adeleke – THISDAYLIVE",
    "summarized_story": "Speaker of Edo House of Assembly, Mr Marcus Onobun has congratulated PDP governor-elect of Osun, Sen. Ademola Adeleke.\n“The victory at the poll shows that when PDP comes together in unity, victory is easy as a house divided against itself cannot stand.\nThe speaker thanked the people of Osun for their wise choice, adding that the state was on the threshold to greatness.\nHe also congratulated the PDP family and all stakeholders who worked together to make the victory possible.\nThe News Agency of Nigeria (NAN) reports that Adeleke won the July 16, governorship election after defeating incubent Gov."
  },
  {
    "headline": "Jubilation as Adeleke Emerges Osun Governor-elect – THISDAYLIVE",
    "summarized_story": "Yinka Kolawole in OsogboThere was jubilation in Osogbo, Osun State Capital, moments after the Independent National Electoral Commission (INEC) declared Senator Ademola Adeleke, Sunday morning, as governor-elect after Saturday’s governorship election.\nAccidentally, after the re-run election, he lost to governor Oyetola after Senator Iyiola Omisore’s influence tilted the scale in Oyetola’s favour.\nThe Independent National Electoral Commission (INEC) Sunday morning, declared Senator Ademola Adeleke the candidate of the Peoples Democratic Party, in the State’s governorship election, winner of the exercise.\nAdeleke of the PDP won 17 of the 30 Local Government Areas (LGAs) in the governorship election held in the State Saturday.\nDespite having 15 candidates contesting for the governorship seat, the election was a two-way contest between APC’s Oyetola and PDP’s Adeleke."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "Obi congratulates Adeleke -- but asks LP supporters to strengthen resolve to rescue Nigeria",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), has congratulated Ademola Adeleke on winning the Osun governorship election.\nAdeleke, candidate of the Peoples Democratic Party (PDP), secured over 400,000 votes, and defeated Gboyega Oyetola, incumbent governor of Osun, who contested on the platform of the All Progressives Congress (APC).\nIn a statement on his Twitter page, Obi also congratulated the candidates of the LP in Osun for their efforts, but urged his supporters to remain committed to the vision of seeing a better Nigeria.\nAdvertisement“I extend my warmest personal congratulations to Sen. Ademola Adeleke on winning the Osun State Gubernatorial elections,” the statement reads.\n“We must strengthen our collective resolve not to relent in our noble march to take back our country."
  },
  {
    "headline": "Obi congratulates Adeleke -- but asks LP supporters to strengthen resolve to rescue Nigeria",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), has congratulated Ademola Adeleke on winning the Osun governorship election.\nAdeleke, candidate of the Peoples Democratic Party (PDP), secured over 400,000 votes, and defeated Gboyega Oyetola, incumbent governor of Osun, who contested on the platform of the All Progressives Congress (APC).\nIn a statement on his Twitter page, Obi also congratulated the candidates of the LP in Osun for their efforts, but urged his supporters to remain committed to the vision of seeing a better Nigeria.\nAdvertisement“I extend my warmest personal congratulations to Sen. Ademola Adeleke on winning the Osun State Gubernatorial elections,” the statement reads.\n“We must strengthen our collective resolve not to relent in our noble march to take back our country."
  },
  {
    "headline": "Osun guber: APC will respond appropriately after studying results, says Oyetola",
    "summarized_story": "Gboyega Oyetola, governor of Osun, says the All Progressives Congress (APC) will take a position on the outcome of the recently-concluded governorship election after studying the results.\nEarlier on Sunday, Ademola Adeleke, candidate of the Peoples Democratic Party (PDP), was declared winner of the Osun governorship election.\nAdvertisementThe PDP candidate won 17 LGAs, while the incumbent governor secured victory in 13 LGAs.\nHe, however, added that the party would respond appropriately after studying the results and consulting with critical stakeholders of the party.\nMeanwhile, President Muhammmadu Buhari has congratulated Adeleke on his victory, adding that the outcome of the Osun governorship election shows respect for the will of the electorate."
  },
  {
    "headline": "Osun guber: APC will respond appropriately after studying results, says Oyetola",
    "summarized_story": "Gboyega Oyetola, governor of Osun, says the All Progressives Congress (APC) will take a position on the outcome of the recently-concluded governorship election after studying the results.\nEarlier on Sunday, Ademola Adeleke, candidate of the Peoples Democratic Party (PDP), was declared winner of the Osun governorship election.\nAdvertisementThe PDP candidate won 17 LGAs, while the incumbent governor secured victory in 13 LGAs.\nHe, however, added that the party would respond appropriately after studying the results and consulting with critical stakeholders of the party.\nMeanwhile, President Muhammmadu Buhari has congratulated Adeleke on his victory, adding that the outcome of the Osun governorship election shows respect for the will of the electorate."
  },
  {
    "headline": "Aregbesola's return match, 'change the change' -- and other reasons Adeleke defeated Oyetola",
    "summarized_story": "Ademola Adeleke was elected governor of Osun state on Saturday, but it was by no means an easy ride for the candidate of the Peoples Democratic Party (PDP).\nHis 403, 371 votes trumped those of Gboyega Oyetola, the incumbent governor and member of the All Progressives Congress (APC), who polled 375,027.\nAdvertisementTHE AREGBESOLA FACTORRauf Aregbesola and Oyetola, his successor as governor of Osun state, have not been on good terms since 2018 and rather than the relationship being repaired, it was getting further damaged with time.\nThe Osun Progressives (TOP), of which he is a member, did not work for Oyetola and this further harmed his re-election chances.\nMany of the voters who chose Adeleke above Oyetola told TheCable that they just wanted a change and that they could not imagine another four years of APC."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Flutterwave, Eversend and other fintech African startups shut down virtual card service",
    "summarized_story": "Earlier on Friday, many African fintech startups offering virtual dollar card services sent emails to their customers stating that their virtual card service will be unavailable indefinitely starting Saturday, July 16, 2022.\nThis announcement by Flutterwave is bound to affect many other startups who use the company’s white-labeled virtual card service to issue virtual cards to their customers.\nOther fintech startups including crypto exchange Busha, Rwanda-headquartered Payday, and Ugandan Eversend also issued similar notices.\nIt’s not clear which “card partner” Flutterwave and the other fintech startups are referring to, but these platforms have issued virtual cards powered by MasterCard and Visa—two leading global card issuers.\n“It affects us in a big way because all our Facebook ads are connected to our Barter virtual card,” Douglas Kenydson CEO Selar said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Burna Boy's monitor engineer, Precious Tawo as he takes us on his journey into sound engineering",
    "summarized_story": "Without further ado, let’s meet Precious Tawo, freelance sound engineer and production manager.\nOn the 20th day [of the Calabar festival], we were doing a sound check in the stadium for the band, and my boss was not on the stage.\nPrecious Tawo’s journey into sound engineeringPrecious TawoI didn’t choose the path; the path chose me.\nAnd in 2013, the Calabar Festival was very popular.\nWe tried everything and eventually had to plug my monitors into my boss’ equipment."
  },
  {
    "headline": "PSC hails Police performance in Osun election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Police Service Commission (PSC) says the performance of policemen deployed for Osun governorship election is a pointer to better security in future elections in Nigeria.\nThe Chairman of PSC, Alhaji Musiliu Smith said the progress recorded in election policing in Osun was a good signal that the 2023 general elections would be better.\nHe said the policing of the Osun governorship election was a huge improvement over the recent governorship election in Ekiti State.\nSmith said the commission monitored policemen on election duties in the 30 local government areas of the state and rated their performance above average.\n“PSC monitors across the state reported that there was no major violence recorded in most of the polling units visited,” he added."
  },
  {
    "headline": "Shaibu commends Edo residents on collaboration with security agencies – Nigerian Observer",
    "summarized_story": "Comrade Philip Shaibu, has commended Edo residents for collaborating with security agencies in improving the security situation in the state, adding that the security of lives and property is a collective effort.\nShaibu gave the commendation after a joint security meeting with representatives of various security agencies in the state, at the Government House in Benin City.\n“Our vigilante and hunters are working hand in hand with all the security agencies and we are happy that the village heads, clan heads and Odionweres are cooperating with our team,” he said.\nAccording to him, “We are happy with the positive feedback from this collaboration and our people should know that the security of lives and property is a collective responsibility.\nWe should go about our business without fear.”On his part, the state Commissioner of Police, Abutu Yaro, urged the residents to report any suspicious incident around them to the security agencies as this act would help security agencies combat crimes in the state."
  },
  {
    "headline": "Edo, Centre strengthen advocacy on treatment, prevention of NTD – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government in partnership with the Carter Centre has intensified sensitization and advocacy on the treatment and prevention of Neglected Tropical Disease (NTD) among children aged 5 to 14 years in the state.\nRepresentative of the Executive Secretary, Edo State Primary Health Care Development Agency (EDSPHCDA) and the Director, Planning, Research and Statistics Dr. Aimua Ehijele, said this during an advocacy visit to the Head of Local Government Administration (HOLGA) Oredo Local Government Area, Mr Kessington Osifo.\nHe said the state government through the Ministry of Health will continue to intensify efforts to ensure a smooth distribution of deworming medicines, Mebendazole and Albendazole for the treatment and prevention of NTD among children aged 5 to 14 years in Edo State.\nThe Edo State NTD Coordinator, Mrs. Poko Happy said the four NTD diseases targeted for elimination and control in the State are Lymphatic Filiariasis, Onchocerciasis, Schistosomiasis and Soil Transmitted Helminth, adding that the Carter Centre has been supporting the four NTD programmes across the 18 Local Government Areas (LGAs) in the state.\nThe Programme Officer, Carter Centre, Dr. Hope Ogiko, reiterated that the centre remains committed to providing drugs and technical support for the treatment and prevention of NTD."
  },
  {
    "headline": "Military committed to securing Nigeria – CDS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Chief of Defence Staff (CDS), Gen. Lucky Irabor, has reiterated the commitment of the Armed Forces of Nigeria in tackling the prevailing security challenges bedeviling the country.\nThe CDS said that the armed forces still need their advice and suggestions to redress the security situation in the ccountry.\n“They should know what contributions they need to give to members of the armed forces, the police and security agencies across the country.\nThe CDS said the retired officers should not relent in the good work they were doing to the country, particularly the military.\nHe assured them that the armed forces would also continue to support the families of all fallen heroes."
  },
  {
    "headline": "Experts seek implementation of economic devt plans",
    "summarized_story": "Financial experts have stressed the need for the Federal Government to implement the National Development Plan 2021-2025 (NDP) to spur the country’s economic growth.\nThe experts said this at a webinar on Saturday with the theme: “Resetting Nigeria’s Economic Growth Trajectory.”They said that practical measures should be adopted to implement the plans to enhance revenue generation.\n“The Federal Government already has several laudable economic plans and the focus should be on increasing the level of implementation of these plans.\n“The NDP is one of such plans that the government can focus which is aimed at fostering economic growth and enhancing productivity.\n“One of the biggest things that drove Singapore’s success is visionary leadership because they deliberately tied political stability to economic growth."
  },
  {
    "headline": "APC women leader, Kemi Nelson, is dead",
    "summarized_story": "A former Deputy National Woman Leader of the All Progressives Congress (APC), Ms Kemi Nelson, is dead.\nThe Chief Press Secretary to the Lagos State Governor, Babajide Sanwo-Olu, Gboyega Akosile, announced in a tweet that the APC chieftain died on Sunday.\nMay the soul of the late Chief Mrs. Kemi Nelson, former Southwest Women Leader of the @OfficialAPCNg,” Akosule tweeted on Sunday.\nGoodnight Ma.”Nelson was the only female member of the APC ‘s Governance Advisory Council in Lagos state.\nBefore her death, Nelson was the Yeye Oge of Lagos state and one of the right-hand loyalists of the APC presidential candidate, Senator Bola Tinubu."
  },
  {
    "headline": "Oct. 16 handover date: Fayemi sacks political appointees",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi, has sacked his political appointees ahead of his exit from office on October 16.\nAccording to the memo dated July 15, 2022, the political appointees were the Senior Special Assistants, the Technical Assistants, the Special Assistants and Executive Assistants.\n“A Transition Committee was constituted to among others, evolve strategies for a smooth transition from the incumbent to the incoming government.\n“One of the duties of the Committee, in line with Ekiti State Transition Law, is to ensure the payment of entitlements of political office holders including their terminal benefits.\n“His Excellency Dr John Kayode Fayemi has approved that the services of all Senior Special Assistants, Special Assistants, Technical Assistants and Executives Assistants would end on 31st July 2022 to enable the state government process all outstanding allowances of the affected officials more so that the government is winding up”, the memo stated."
  },
  {
    "headline": "Zenith Bank holds 7th annual trade seminar on non-oil export",
    "summarized_story": "The 7th Annual Edition of the Zenith Bank International Trade Seminar will be held on Wednesday, July 20, 2022, at the Civic Centre, Victoria Island, Lagos, and virtually by 9.00 am.\nThe seminar, themed “Unlocking Opportunities in Nigeria’s Non-Oil Export Business”, is part of Zenith Bank’s efforts to support the Central Bank of Nigeria (CBN) initiatives to grow the country’s non-oil export sector.\nThis forum would provide an opportunity for all participants, including relevant government agencies, to explore ways to unlock the immense opportunities in Nigeria’s Non-Oil Export Sector.\nThe second panel, titled “Funding/Logistics/Government Support for the Non-Oil Export Sector”, will explore the availability of long-term funds, insurance & reinsurance, and risk-sharing mechanism for the non-oil export sector.\nThe third panel discussion, titled “The ABC of Non-Oil Export”, will focus on the pitfalls in the non-oil export business, standardisation and grading of primary export products, as well as the export of services, especially the burgeoning Nigerian creative industry."
  },
  {
    "headline": "Abducted NDDC official, Kingsley Okorafor released",
    "summarized_story": "By Ori MartinsThe kidnapped senior worker of the Niger Delta Development Commission, NDDC, Kingsley Okorafor, of Umuadara Umulogho autonomous community in Obowo Local Government Area of Imo State, has been released.\nA community source very close to the victim confirmed to Business Hallmark that Okorafor had been released.\nThe traditional ruler of the community, Patrick Uwalaka, who earlier said that the development was unfortunate also celebrated the eventual release.\nIt was gathered that Okorafor attended a vigil of the Traditional Ruler of Ndihu autonomous community in Obowo LGA, Innocent Anyawu, last Friday whose burial was scheduled for Saturday (yesterday).\nThe Imo State Police Command spokesman, Micheal Abattam, never responded to an inquiry about the abduction and release of the NDDC personnel."
  },
  {
    "headline": "Hajjin 2022: Alhazan Bangladesh 88 Ne Suka Rasu A Saudiyya",
    "summarized_story": ""
  },
  {
    "headline": "Majalisar Zartaswa Ta Yi Wa Osinbajo Fatan Samun Sauki",
    "summarized_story": ""
  },
  {
    "headline": "NDLEA Ta Damke Wata Mata Za Ta Yi Safarar Miyagun Kwayoyi Zuwa Oman",
    "summarized_story": ""
  },
  {
    "headline": "Kumbon Dakon Kaya Na Tianzhou-3 Na Kasar Sin Ya Rabu Da Tashar Sararin Samaniya Ta Kasar",
    "summarized_story": ""
  },
  {
    "headline": "Sabon Gwamnan Osun: Abubuwan Da Ya Kamata Ku Sani Game Da Ademola Adeleke",
    "summarized_story": ""
  },
  {
    "headline": "What transpired when Peter Obi, Baba-Ahmed visited Obasanjo (Photos)",
    "summarized_story": "The Labour Party’s Presidential candidate, Dr. Peter Obi and his running mate, Yusuf Baba-Ahmed on Sunday visited former President, Olusegun Obasanjo in Ogun State.\nObi and Baba-Ahmed are seeking the support of Obasanjo to support their presidential and vice presidential ambition in 2023.\nThe popularity of the Labour Party presidential candidate has continued to soar, with his aspiration dominating the social media.\nBut many have written him off as he has no structure, but he has consistently said his structure are suffering Nigerians, ASUU, students, the youths, among others.\nFollowing dismal performance of Labour Party in Ekiti and Osun governorship election, many have said Obi stood no chance against formidable opponents next year."
  },
  {
    "headline": "ASUU strike: NUBIFIE threatens to shutdown banks, others",
    "summarized_story": "By Esenvosa IzahThe National Union of Banks, Insurance and Financial Institutions Employees (NUBIFIE) has said it will join the Nigeria Labour Congress (NLC) in its solidarity strike over the lingering Academic Staff Union of Universities (ASUU) strike.\nNUBIFIE said this in a statement signed by Its National President, Mr Anthony Abakpa, and General Secretary, Mr Mohammed Sheikh, on Sunday.\nThe NLC President, Mr Ayubaa Wabba said this in a circular jointly signed by Mr Emmanuel Ugboaja, General Secretary of the Congress in Abuja.\nNUBIFIE called on President Muhammadu Buhari to intervene concretely and end the ongoing strikes.\nThe union had accused the government of failing to implement the Memorandum of Understanding and Memorandum of Action signed between both parties."
  },
  {
    "headline": "BREAKING: Ademola Adeleke Wins Osun Governorship Election",
    "summarized_story": "The Peoples Democratic Party (PDP) candidate Ademola Adeleke has been announced the winner of the Osun governorship race.\nOn Sunday morning, Toyin Ogundipe, the state’s returning officer, declared the election’s outcome.\nIn order to defeat his closest rival, Gboyega Oyetola of the All Progressives Congress (APC), who received 375,027 votes, Adeleke received 403, 371 votes.\nWhile the incumbent governor prevailed in 13 LGAs, the PDP candidate won 17 LGAs.\nWith 10,104 votes, Kehinde Atanda of the Action Democratic Party (ADP) finished far behind Yusuf Lasun of the Labour Party (LP), who received 2729 votes."
  },
  {
    "headline": "JUST IN: Adeleke Clears Osogbo, Takes Early Lead In #OsunDecides2022",
    "summarized_story": "Out of the 54,997 votes cast in the Osogbo LGA, Mr. Adeleke received 30,401 votes, while Mr. Oyetola received 22,952 votes for the governing All Progressives Congress.\nIn Osogbo LGA, 55,942 votes were cast in total during the election on Saturday.\nMr Oyetola also cleared his polling unit in Iragbiji, Boripe LGA, shellacking Mr Adeleke there.\nWhile in PU 003, opposite Olomu Mosque in Osogbo, PDP agents were seen handing out between N2,000 and N5,000 to induce voters.\nEarly results from Ede, Osogbo and other parts of the state show Mr Adeleke leading, although most results are still being expected."
  },
  {
    "headline": "#OsunPoll: Tinubu Departs Osun State As INEC Begins Uploading Election Results",
    "summarized_story": "The presidential candidate of the ruling All Progressives Congress, Bola Tinubu, has left Osun State where a governorship election is holding.\nMeanwhile, the Independent National Electoral Commission, INEC, has commenced uploading of results for the Saturday governorship election into the commission’s results viewing portal.\nThe News Agency of Nigeria reports that the uploading of election results started shortly after the close of voting and sorting of votes in some polling units across the state.\nFor Olorunda LG, 74 out of 193 polling units results have been uploaded on the portal as well 72 out of 121 for Odo-Otin Local Government Area.\nFor Iwo LGA, 48 out of 170 polling units results have been uploaded, for Irepodun 52 out of 133, while 18 out of 62 polling units results for Ola-Oluwa LGA have also been uploaded."
  },
  {
    "headline": "JUST IN: Tinubu Leaves Osun, Meets APC Speakers In Abuja",
    "summarized_story": "According to information obtained by NEWS DIRECT, the APC National Leader met with the party’s House of Assembly Speakers on Saturday in Abuja.\nTinubu offered the speakers active positions in his campaigns leading up to the next election in 2023 during the conference.\nTinubu commended the Speakers for the earlier roles they played ahead of his emergence as the presidential candidate of the party.\nThe APC Speakers had visited Tinubu to congratulate him on his victory at the party’s recent special convention where he was elected candidate.\nWhile appreciating the Speakers, Tinubu, who noted the tasks ahead of 2023, assured them of roles to play in the campaign."
  },
  {
    "headline": "Pictures: Peter Obi, Baba-Ahmed meet ex-President Obasanjo",
    "summarized_story": "Pictures: Peter Obi, Baba-Ahmed meet ex-President ObasanjoAs 2023 presidential race gets tougher, the presidential candidate of the Labour Party, Peter Obi and his running mate, Yusuf Datti Baba-Ahmed, on Sunday met Nigeria’s former president, Olusegun Obasanjo.\nBaba-Ahmed shared the photos on his Twitter handle on Sunday.\nHe captioned them, “Earlier today, myself and H. E. #PeterObi in company of other #NgLabour chieftains consulted with the former President, Olusegun Obasanjo.”It was not revealed why the duo who are frontline contenders met the Nigerian statesman as at the time of filling this story.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Singer, Portable, congratulates Adeleke on Osun poll victory",
    "summarized_story": "Zaazu singer, Portable, has congratulated Ademola Adeleke, on his emergence as the winner of the Osun State governorship election.\nPortable had campaigned for the All Progressives Congress candidate, Governor Gboyega Oyetola, in the days leading up to the election and had even berated Davido for unfollowing him on Instagram.\nSharing a video on his page on Sunday with a sound track singing the praises of Adeleke, Portable said, “Congratulations Kinimah Akoi ADEMOLA ADELEKE IMOLE TIDE 💯”He also added, “Na performance dem pay me for.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "#OsunDecides2022: ‘God Bless You Sir’, Davido Tells Buhari",
    "summarized_story": "Singer, Davido, has said a prayer for the President, Major General Muhammadu Buhari (retd.)\nafter he congratulated his uncle and winner of the Osun governorship election, Ademola Adeleke.\nBuhari had said that the results of the election reflected the will of Osun people.\nThe successful conduct of #OsunDecides2022 is a demonstration of the maturity and the commitment of all stakeholders, towards strengthening the integrity of the electoral process in Nigeria.\nGod bless you for this act alone sir!”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Rivers: Nirvana, Access Bank Donate Cartons of Food Items to Sickle Cell Disease Persons",
    "summarized_story": "A non governmental organisation, Nirvana Initiative and Hacey Health Initiative in partnership with Access Bank has lifted the lives of people living with sickle cell disease by donating cartons of food items to them and their relatives in Rivers State.\nNirvana Initiative through Sickle Cell Awareness and Health Foundation, held the sensitisation and food donation event at the University of Port Harcourt Teaching Hospital (UPTH) where many with sickle cell trait and their parents disclosed their challenges.\nA facilitator at the programme, Dabata Omubo-Pepple, Executive Director of Sickle Cell Awareness and Health Foundation, explained that the gesture by the NGO to reach out to people living with the disease was in commemoration the world sickle cell day, earlier celebrated in June.\nA way of reaching out with people living with sickle cell disease with a welfare package which has to do with food, reminding them that food is important in their day to day and also to support them”.\nMy parent realized that I am a sickler when I was about a year old and my mum was already pregnant with my little sister who also had sickle cell”."
  },
  {
    "headline": "X-raying reforms in SEC and uncanny zeal for investment space",
    "summarized_story": "Also, the Yuguda-led executive management team has been implementing capital market development goals set out in the Capital Market Master Plan (CMMP) (2015-2025) and successfully completed the review of CMMP to realign the initiatives/deliverables to prevailing market conditions and keep the document relevant in the dynamic capital market due to issues related to Fintech, sustainability and regional integration.\nThis is even as it processed six Schemes of Merger, seven Acquisitions, 21 Corporate Restructurings, and three Takeovers during the period.\nUnder his leadership, rules for the integrated West African Capital Market were developed and reviewed.\nOn human capital development, the Commission had in 2019 conducted an internal capacity assessment that outlined staffing deficits and needs.\nThe Commission has also secured counterpart funding of $450,000 from AfDB on its Nigeria Securities Market Surveillance System Project to support the deployment of a real-time market surveillance system for the Nigerian capital market."
  },
  {
    "headline": "TAJBank opens new branch to deepen financial inclusion",
    "summarized_story": "…as excited traders jostle to open accountBY Kehinde IbrahimTAJBank Ltd, a leading non-interest hank, has continued its service and financial inclusion drive with the opening of a new, technology-powered branch in Wuse 2, Abuja.\nThe opening of the new branch brings the lender’s growing branch network to 22 within its first two years of operation.\nJoda explained: “The opening of the new branch is to continue with our strategy of ensuring that we take the TAJBank brand to all the nooks and crannies of the Country with the aim of addressing the service needs of our teeming customers.\n“We understand that Customers want to do business and sometimes someone to give them that advisory service they yearn for which in turn will help to address their financial challenges”, he added.\nThe non-interest bank is also set to launch Nigeria’s first private sector Sukuk offering under a N100 billion programme."
  },
  {
    "headline": "NES28 to rally stakeholders for sustainable economic growth",
    "summarized_story": "While welcoming participants to the event, the chairman of the NESG, Mr Asue Ighodalo, said that the annual Nigerian Economic Summits had been sustained as a public-private dialogue platform by the NESG (representing the private sector) and the Federal Ministry of Finance, Budget and National Planning (representing the Federal Government of Nigeria).\nHe noted that the Summit is a foremost platform through which the federal and state governments engage with corporate leaders and discuss Nigeria’s national and sub-national economic realities to co-create reform strategies that are critical for the advancement and reform of the Nigerian economy.\nMr Ighodalo stated that the vision of a secure, developed, prosperous and macro-economically stable country where the rule of law prevails and no one is left oppressed appears dimmed with today’s considerable headwinds, but the current electoral cycle offers a unique opportunity to reflect and reset.\nHe noted that the challenge of non-inclusive economic growth reflects low productivity across employment-elastic sectors, which continues to weaken their capacity to create more job opportunities and decent employment.\n“Government has a pivotal role in jump-starting and addressing with utmost urgency six critical challenges including non-inclusive economic growth, macroeconomic instability, infrastructure deficit, human capital deficit and skills gap, national insecurity and weak economic competitiveness,” he stated."
  },
  {
    "headline": "Danger as Naira hits N620/$ at parallel market",
    "summarized_story": "Naira yesterday fell to N620 per dollar at the parallel market amid the lingering scarcity of the greenback.\nCurrency traders known as Bureaux De Change operators (BDCs) said there was increased demand for the dollar by importers at the street market.\nThe traders put the buying price of the dollar at N614 and the selling price at N620, leaving a profit margin of N6.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate.\nOn Tuesday, the euro fell to parity against the dollar for the first time in almost 20 years."
  },
  {
    "headline": "Adeleke Defeats Incumbent Oyetola To Win Osun Governorship Election",
    "summarized_story": "On Saturday, he achieved a hard-fought victory over the state’s incumbent Governor, Gboyega Oyetola, of the All Progressives Congress (APC) in the state’s governorship election.\n﻿Saturday’s election featured 15 contestants with the rematch of Oyetola and Adeleke drawing the most attention.\nFollowing the initial poll held that year, Oyetola trailed Adeleke who had led by 353 votes going into the supplementary election which held in seven polling units.\nAccording to the final votes announced by the electoral umpire that year, Oyetola polled 255,505 votes while Adeleke scored 255,023 votes – a difference of 482 votes.\nCompared to his loss in the last election, Adeleke bounced back to defeat incumbent Governor Oyetola with a vote margin of 28,344."
  },
  {
    "headline": "Buhari Congratulates Adeleke, Reassures Nigerians Of Credible 2023 Elections",
    "summarized_story": "President Muhammadu Buhari on Sunday congratulated the governor-elect of Osun State, Senator Ademola Adeleke, following the victory of the candidate of the Peoples Democratic Party (PDP) in the just-concluded election.\nAdeleke had stunned the incumbent governor, Gboyega Oyetola, to win the election, reversing the outcome of a matchup between both men in 2018.\nHe secured 403,371 votes, 28,344 more than Oyetola of the All Progressives Congress (APC) who polled 375,027 votes, to emerge victorious.\nFollowing the initial poll held that year, Oyetola trailed Adeleke who had led by 353 votes going into the supplementary election which held in seven polling units.\nAccording to the final votes announced by the electoral umpire that year, Oyetola polled 255,505 votes while Adeleke scored 255,023 votes – a difference of 482 votes."
  },
  {
    "headline": "Atiku, PDP Governors Congratulate Adeleke On Osun Election Victory",
    "summarized_story": "The candidate of the Peoples Democratic Party (PDP), Ademola Adeleke, was on Sunday declared the winner of the Osun State governorship election to cheers from allies and supporters.\nIn a tweet to celebrate his victory, the governor-elect said, “I have brought light to Osun State.”I have brought light to Osun State.\nAmong them was the PDP presidential candidate and former vice president, Atiku Abubakar, who said Adeleke’s triumph was a well-fought victory.\nRead the tweets below:Well-Fought VictoryMost importantly, congratulations to the great people of Osun State for proving that power indeed belongs to the people.\n-AA #OsunDecides #ImoleOsun — Atiku Abubakar (@atiku) July 17, 2022Politics Is LocalThe good people of Osun State have spoken loud & clear that politics is local."
  },
  {
    "headline": "Yakubu Maikyau Elected New NBA President",
    "summarized_story": "A Senior Advocate of Nigeria (SAN), Yakubu Maikyau, has emerged as the 31st President of the Nigerian Bar Association (NBA).\nMaikyau was named the new NBA president following an election of the legal body which was held virtually.\nFollowing the declaration, Maikyau is expected to take over the leadership of the legal body from the outgoing NBA President, Olumide Akpata.\nOther national officers elected are Mrs Linda Bala – 1st Vice President, Mr Clement Ugo – 2nd Vice President, and Mrs Amanda Demechi-Asagba – 3rd Vice President.\nAlso elected are Mr Adesina Adegbite – General Secretary, Mr Daniel Kip Ka-Ayli – Assistant General Secretary, Ms Chinyere Obasi – National Welfare Secretary, Mr Habeeb Lawal – National Publicity Secretary, Mr Olawole Ajiboye – Assistant Publicity Secretary, and Anze-Bishop Ladidi – Treasurer."
  },
  {
    "headline": "Zamfara Govt Suspends Emir For Giving ’Notorious Bandit Leader’ Chieftaincy Title",
    "summarized_story": "The Zamfara State Government has suspended the Emir of Birnin ‘Yandoto of Tsafe Local Government Area, Aliyu Marafa, for conferring a chieftaincy title to a “notorious bandit leader”.\nAleru was turbaned as Sarkin Fulani (Chief of Fulani) of Yandoto Emirate by the emir.\nREAD ALSO: Notorious Bandit Leader Bags Chieftaincy Title In ZamfaraNews of the turbaning ceremony along with photos went viral, generating outcry and outrage.\n“It was aimed at providing lasting peace in the emirate, the emir told us that there is a peace accord between the emirate and the bandit group,” the source said.\n“The chieftaincy title was given to him in appreciation of the peace reconciliation,” he said."
  },
  {
    "headline": "Gov Makinde congratulates Adeleke, says power of the people triumphed",
    "summarized_story": "Governor of Oyo State, ‘Seyi Makinde, has congratulated Senator Ademola Adeleke, on his victory at the just-concluded Osun State governorship election, saying that the power of the people has again triumphed.\nAdvertisementIn a statement issued on Sunday, Governor Makinde said Adeleke’s victory was similar to what occurred in Oyo State during the 2019 governorship election.\nHe said: “On behalf of the government and the good people of Oyo State, I congratulate the Osun State Governor-Elect, Senator Ademola Adeleke and the people of Osun State on this victory.\nAdvertisement“It is great to have a second PDP flag flying in the South-West and this victory teaches all politicians an important lesson- that truly, power resides with the people.\n“The power of the people will continue to triumph, the earlier politicians realise this fact, the better for our democracy.”Advertisement"
  },
  {
    "headline": "Ortom, Atiku, Okowa, others congratulate Adeleke as Osun governor-elect",
    "summarized_story": "AdvertisementGovernor Ortom praised Senator Adeleke for his steadfastness, hard work and commitment to the welfare of the people that earned him the victory, saying “ the people have spoken”.\nAdvertisementAdvertisementThe Benue leader urged Adeleke to sustain and improve his family reputation of excellence, dignity and leadership so that Osun state can regain her glory under his administration.\nAdvertisementPresidential flag bearer of the Peoples Democratic party Atiku Abubakar has also joined in congratulating Senator Adeleke on his victory at the polls.\nAdvertisementAdvertisementHe thanked all stakeholders who contributed to the success, and felicitated the people of Osun State ‘for proving that power indeed belongs to the people’.\nDelta state governor Ifeanyi Okowa who is also the party’s vice-presidential candidate, congratulated the governor-elect and the people of Osun."
  },
  {
    "headline": "Osun: Buhari congratulates Adeleke, pledges credible elections in 2023",
    "summarized_story": "President Muhammadu Buhari has congratulated the governor-elect of Osun State, Senator Ademola Adeleke, following his victory at the just-concluded election.\nAdvertisementAdeleke had stunned the incumbent governor, Gboyega Oyetola, to win the election, reversing the outcome of a matchup between both men in 2018.\nAdvertisementAdvertisementSenator Ademola Adeleke of the Peoples Democratic Party secured 403,371 votes, 28,344 more than Oyetola of the All Progressives Congress (APC) who polled 375,027 votes.\nBuhari reassured the nation of the commitment of his administration, towards credible elections in 2023.\nAdvertisementAdvertisement"
  },
  {
    "headline": "BREAKING: PDP candidate, Adeleke wins Osun governorship election -",
    "summarized_story": "The candidate of the People’s Democratic Party, Ademola Adeleke has been declared winner of the July 16th governorship election in Osun state.\nSenator Adeleke obtained the highest number of votes from 17 of the 30 local governments in Osun State.\nAdvertisementThe results were officially declared by the Independent National Electoral Commission in the Saturday governorship election in Osun State.\nHis closest rival, Governor Gboyega Oyetola of All Progressives Congress won in 13 Local Government Areas.\nAdvertisementAdvertisementThe results showed that Adeleke obtained 403, 371 votes from 30 LGAs while Oyetola got 375, 027 votes."
  },
  {
    "headline": "Abdullahi Adamu: The Last Thing I Will Say in Politics is That Christian Votes Don’t Matter",
    "summarized_story": "APC National Chairman, Abdullahi Adamu reacts to the party’s loss in the Osun gubernatorial election and in impact on the general outlook of the party heading into the 2023 elections."
  },
  {
    "headline": "Nigeria: Military Allays Fears of Impending Terror Attacks on Abuja",
    "summarized_story": "Following the attack on Kuje Correctional Centre by terrorists, Nigeria’s Defence Headquarters (DHQ) on Saturday allayed fears of alleged impending attacks on Abuja.\nThe Federal Capital Territory (FCT) Command of the Nigerian Security and Civil Defence Corps (NSCDC) had issued a security alert on planned terror attacks on churches, schools and public infrastructure in Abuja.\n“The board was set up because it happened within our area of responsibility,” he said.\nHe gave the assurance that with the measures in place presently, such an attack would be difficult to come by.\nThere is the tendency that no such further attack will be possible with the arrangements in place,” he explained."
  },
  {
    "headline": "Hold Buhari Responsible for Violence in Nigeria, Ortom Tells US",
    "summarized_story": "Benue State Governor, Dr. Samuel Ortom, has called on the United States and the rest of the international community to hold the administration of President Muhammadu Buhari accountable for the spate of violence in Nigeria.\nHe made the call Saturday at the State Department, Washington DC while interacting with its officials, according to a statement by his aide, Mr. Peter Ichull.\nGovernor Ortom also said President Buhari and his government should be held responsible if anything happens to him.\nThe Benue State governor stated that the federal government’s punitive neglect has led to an increasing number of internally displaced persons (IDPs) in Benue State, which now stands at 1.5 million.\nHe promised to make a case for the Benue IDPs and investigate other issues raised by Ortom."
  },
  {
    "headline": "With New Status, NNPC GMD’s Nomenclature Now Group CEO",
    "summarized_story": "The Corporate Affairs Commission on September 21, 2021, completed the incorporation of the NNPC Limited following the provisions of the PIA 2021.\nPresident Muhammadu Buhari would unveil the new NNPC Limited on July 19.\nGroup Managing Director of the NNPC Ltd, Mr Mele Kyari, recently explained: “On 1st of July, we crossed over to the NNPC Limited both technically and financially on every aspect.\nMr President will unveil the NNPC Limited to all of us on the 19th of July, and I’m inviting you.\nWith the drop from the 302.4 million barrels in the first half of 2020 to 220.016 million barrels in the first half of 2022, Nigeria lost 82 million barrels of production between 2020 and 2022."
  },
  {
    "headline": "Buhari: I was Given List of 30 Presidential Aspirants to Choose Successor But I Declined",
    "summarized_story": "For the first time, President Muhammadu Buhari on Saturday opened up on the intrigues preceding the presidential primary of the All Progressives Congress (APC), revealing that he was given a list of 30 aspirants to choose a successor but he declined.\nPresident Buhari admitted that APC stalwarts gave him a list of 30 presidential aspirants to choose a preferred successor but he declined and allowed the delegates to elect the candidate of their choice, hence the emergence of the former Lagos State governor.\n“I was given a list of 30 aspirants to pick from; most of them were my ministers and governors.\nSo, they elected Tinubu as APC presidential candidate.\n“As leaders, we are doing our best and will keep doing our best to improve the situation."
  }
]