[
  {
    "headline": "32 killed in fresh Cameroon ethnic clashes –UNHCR",
    "summarized_story": "Clashes between herders and fishermen in northern Cameroon have killed at least 32 people this month, with 19 villages torched, the UN High Commissioner for Refugee said on Thursday.\nSome 11,000 people fled to Chad and a further 7,300 were displaced in Cameroon’s Far North after fighting broke out on Aug. 10 between Choa Arab herders and Mousgoum fishermen and farmers, the UNHCR said.\nOfficials described the fighting as Cameroon’s worst ethnic violence in years.\nThe refugees in Chad were in urgent need of shelter, UNHCR said, with many sleeping under trees.\nThe ethnic violence further complicates security in a region where Cameroon’s army has been battling Boko Haram for years and, more recently, militants linked to Islamic State."
  },
  {
    "headline": "Pictorial: Buhari receives leader of Tijaniyya sect in Aso Villa",
    "summarized_story": "The President, Major General Muhammdu Buhari (retd.\n), has received the leader of the Tijaniyya sect, Sheikh Dahiru Usman Bauchi at the State House in Abuja on Thursday.\nPhotos from their meeting were shared on Facebook by the Special Adviser to the President on Media and Publicity, Femi Adesina.\n“President Buhari receives Renowned Islamic Scholar and Leader of Tijaniyya Sect Sheikh Dahiru Usman Bauchi in State House on 19th Aug 2021,” Adesina captioned the photo.\nThe Sheikh was accompanied by the Minister of Communications and Digital Economy, Isa Pantami."
  },
  {
    "headline": "Buhari meets with Security Chiefs",
    "summarized_story": "By Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari and heads of security chiefs are currently meeting at the Presidential Villa, Abuja, over the security situation in the country.\nAt the meeting, the Chief of Defence Staff, CDS, General Lucky Irabor, and other security chiefs are expected to brief the President on recent developments associated with the security challenges facing the nation.\nIt is expected that President Buhari will be updated on security developments while plans to bring a decisive end to the challenges will be formulated.\nThe security forces have in the past few weeks taken the battle more robustly to insurgents, bandits, and all other criminals troubling the country, and they are now surrendering in droves.\nOthers attending the security meeting include Vice President Yemi Osinbajo, National Security Adviser (NSA), Major-General Babagana Monguno (rtd), the three Service chiefs and the Inspector General of Police, Usman Alkali Baba, among other top security personnel."
  },
  {
    "headline": "Outrage over plan to crown Sultan of Shuwa Arab in Edo",
    "summarized_story": "By Ozioruva Aliu – BeninCONDEMNATION and outright rejection have continued to trail a plan by some Shuwa Arabs which is said to be an ethnic group from Borno, to crown one Idris Adanno as the Sultan of Shuwa Arab of Edo State across the state.\nThe hotel is owned by a Duke in Benin Kingdom, Osazuwa Iduriase.\nBut several individuals and groups have raised concern over the plan which they said would undermine existing traditional institutions in the state.\n“This will never happen in the Benin Kingdom, we are Benin.\nWe should now have Oba and Sultan in Edo state ?"
  },
  {
    "headline": "JUST IN: Rivers University in panic as gunmen kill 400 level student",
    "summarized_story": "Police nab suspect, launch manhunt othersBy Davies IheamnachorThere is pandemonium in Rivers State University, RSU, as gunmen kill a 400-level student of the institution.\nThe victim whose name could not be ascertained at press time was a student in the Engineering Faculty of the university.\nA source, who gave his name simply as Emmanuel, disclosed alleged that a 2nd-year student from Management Department was among the suspects that killed the engineering student.\nHe said that the killer students were on the move to pull out of the crime seven before the security operative arrested the 2nd year management student believed to be involved in the killing.\nOmoni said: “I can confirm the incident this morning at Rivers State University."
  },
  {
    "headline": "Surrender of repentant insurgents: The law must take its course — Lawyers",
    "summarized_story": "By Innocent Anaba & Onozure DaniaGovernor Babagana Zulum of Borno State, weekend, expressed concern that his state was in a very difficult situation over the ongoing surrender by repentant insurgents.\n“If no, will the government do the needful in ensuring that the insurgents face the wrath of the law?\nWith due respect, our criminal justice system should be reviewed to accommodate compensation for victims of crimes particularly relating to the development of insurgents surrendering willingly.\nIn summary, surrendering terrorists should be received, processed, and punished.”Motive behind surrender is the real question — AdelekeDebo Adeleke is suspicious of the whole thing.\nAre they ready to atone for the sins they’ve committed against humanity or circumstances forced them to pretend as if they’re surrendering?"
  },
  {
    "headline": "Afrikanwatch holds lecture on August 21, as Fagbemi, SAN, Abati, Abayomi, others to share ideas on Leadership",
    "summarized_story": "The 2021 Afrikanwatch Network Communications lecture and award will hold on August 21 at the Yaba College of Technology, Yaba, Lagos, under the Chairmanship of Prof. Oluwatoyin Ogundipe, Vice Chancellor of the University of Lagos, as Prof. Solomon Akinboye would deliver the theme of the lecture titled, The Kind of leaders Nigeria needs…our Collective responsibility.\nAt the occasion, prominent Nigerians will be honoured for their immense contributions to nation building and human capacity, they include, Governor Rotimi Akeredolu, SAN of Ondo State, Governor Mahammadu Yahaya Inuwa of Gombe State, Sen. Anthony Adefuye, Dr. Lilian Chibor, Dr, Reuben Abati, Dr. Henry Adimula, Mrs. Olubukola Adebiyi, HRM, Oba Owolabi Adeniyi, Comrade Anderson Ezeibe, Comrade Kazeem Aduwa, Comrade Emeka Enwelu, Okegbue Emmanuel Okegbue, Dr. Kabir AdamuMeanwhile, Prince Lateef Fagbemi, SAN, Dr. Reuben Abati, Dr. Tunji Abayomi, Comrade Anderson Ezeibe and Miss Franscisca Nwobodo will digest and share ideas on how Nigerians can best select their leaders come 2023.\nFagbemi, Prof. Akinboye, Engr.\nFemi Omokungbe will be honoured with Afrikanwatch Mentorship award.\nAccording to the Editor-in-Chief, Mark Columbus Orgu, the event is to share ideas towards building an ideological/economic leadership, capable of transforming the country’s challenges"
  },
  {
    "headline": "Gunmen kidnap former NMA secretary’s son, demand N20m ransom",
    "summarized_story": "Some yet to be identified gunmen have abducted Ademola, son of a former National Secretary of the Nigeria Medical Association, Dr Adewunmi Alayaki in Ogun State.\nDAILY POST gathered that the incident happened on Thursday morning in Abeokuta, the state capital.\nAdemola was reportedly kidnapped while working on his father’s farm at Isaga-Orile community, Abeokuta North Local Government Area of the state.\nIt was also learned that the kidnappers have contacted the family members of the victim, demanding N20 million ransom.\nAccording to the PPRO, officers of the police command have been mobilized to the area to ensure that the victim is rescued unhurt."
  },
  {
    "headline": "Ugwuanyi only governor in S/East, S/South to sponsor pilgrims to Jordan – NCPC Executive Secretary",
    "summarized_story": "The Executive Secretary of Nigeria Christian Pilgrims Commission (NCPC), Rev.\nDr. Yakubu Pam, has commended Governor Ifeanyi Ugwuanyi of Enugu State for his commitment to God and exemplary leadership in spite of the nation’s economic, security and public health challenges.\nSpeaking when he addressed pilgrims from Enugu and Benue states who were departing for Jordan from the Akanu Ibiam International Airport, Enugu, Rev.\nAlso speaking, the Executive Secretary, Christian Pilgrims Welfare Board, Enugu State, Barr.\nOn her part, the Benue State’s Executive Secretary, Christian Pilgrims Welfare Board, Dr. Mrs. Dorcas Otalo, thanked the Governors of Enugu and Benue states, Rt."
  },
  {
    "headline": "Unknown Gunmen: We’ll expose those blackmailing Enugu Govt – Ohanaeze vows",
    "summarized_story": "The Enugu State Government has since debunked the existence of such portfolio in the Gov.\nWe were more concerned when his name was mentioned as a Special Assistant on Security to the Enugu State Governor, Rt.\n“It then beats our imagination the intention of the purveyors of that news, especially as Enugu State has remained the most peaceful State in Nigeria.\nIfeanyi Ugwuanyi.\nLet us allow peace to continue to reign in Enugu State."
  },
  {
    "headline": "Insecurity: Buhari presides over crucial National Security Council meeting",
    "summarized_story": "President Muhammadu Buhari is currently presiding over a crucial security meeting with all the nation’s security chiefs and relevant cabinet ministers in attendance.\nThe News Agency of Nigeria (NAN) gathered that the meeting was summoned to critically analyze the prevailing challenges of security bedevilling the country with a view to charting the best way forward.\nThe nation’s security forces had in recent times taken the battle more robustly to insurgents, bandits and all other criminals troubling the country.\nThe meeting is expected to discuss successes being achieved in the renewed onslaught against terrorism, insurgency as well as the deadly activities of bandits across the country.\nOthers were the service chiefs led by the Chief of Defence Staff, Inspector General of Police, Directors General, Department of State Services and The National Intelligence Agency, Chief of Defence Intelligence and other relevant stakeholders."
  },
  {
    "headline": "Ondo: Shops, markets shut as Akure celebrates age-long festival",
    "summarized_story": "Business activities in Akure, the Ondo State capital, have been shut down following the celebration of an age-long festival.\nDAILY POST observed that shops and markets across the metropolis were on Thursday shut to commemorate the ‘Aheregbe’ and ‘Amole’ festival in the town.\nThe Deji of Akure kingdom, Oba Ogunlade Aladetoyinbo, stated that the move was in line with the requirement that must be observed for the festival.\nMeanwhile, anyone who defies the order and opens shop for business will have his or her goods confiscated alongside other sanctions in line with tradition.\nOsun Osogbo festival: Worshippers throng sacred grove, disregard COVID-19 protocols (PHOTOS)"
  },
  {
    "headline": "UPDATED: Fawehinmi’s son, Mohammed died from COVID-19 related complications – Family",
    "summarized_story": "Mohammed Fawehinmi, the first son of the late human rights lawyer Chief Gani Fawehinmi, died from COVID-19 related complications, the family clarified on Thursday.\nThe family gave the clarification in a briefing on Thursday.\nIn attendance at the briefing were some family members and friends, including Mrs. Basirat Fawehinmi Biobaku, Mr. Lanre Arogundade, Richard Akinola, Dr. Okon Ariba, Idiat Aliyu, Com.\nHe stated that Mohammed’s death could have been avoided if he had taken the COVID-19 vaccine.\n“In the morning of Friday August 27, 2021, the remains of our brother would be interred at the Gani Fawehinmi family compound in Ondo Town after a brief funeral service."
  },
  {
    "headline": "JUST IN: Buhari, Security Chiefs meet over terror war",
    "summarized_story": "President Muhammadu Buhari is meeting with security chiefs at the Presidential Villa, Abuja.\nIt was gathered the President scheduled the meeting to receive updates on security efforts and give direction on the next line of actions on the various operations.\nThe security forces have in the past few weeks taken the battle more robustly to insurgents and bandits.\nThe meeting also gas Minister of Defense, Bashir Magashi; Minister of Foreign Affairs, Geoffrey Onyema, and Minister of Interior, Rauf Aregbesola in attendance.\nDetails shortly…"
  },
  {
    "headline": "Court dissolves 10-year-old marriage over wife’s stealing habit",
    "summarized_story": "An Igando Customary Court in Lagos on Thursday dissolved a 10-year-old marriage over wife’s penchant for stealing.\nA 45-year-old businessman, Mr Mutiu Bamgbose, in his petition also accused his wife, Aliyah of Infidelity.\n“Therefore, the court has no other choice than to dissolve the marriage.\n“The court hereby pronounces the marriage between Mr Mutiu and Mrs Aliyah Bamgbose, dissolved today.\nBamgbose said:”my wife is a thief, she is not always satisfied with what I give her, she keeps stealing my money at will."
  },
  {
    "headline": "BREAKING: Fawehinmi’s late son, Mohammed died from COVID-19 related complications — Family",
    "summarized_story": "Mohammed Fawehinmi, the first son of the late human rights lawyer Chief Gani Fawehinmi, died from COVID-19 related complications, the family has clarified.\nThe Nation reports the 52-year-old passed on in Lagos.\nThe family gave the clarification at a briefing in Lagos on Thursday.\nSaheed Fawehinmi, the second son of Chief Gani Fawehinmi, who spoke on behalf of the family said: “The family could not immediately disclose the cause of our brother’s death because we wanted the information to be based on factual medical details especially as maybe contained in the death certificate.\nADVERTISEMENT“Today however, we are in a position to inform you that our dear brother died from COVID-19 related complications.”Details shortly…"
  },
  {
    "headline": "Why I withdrew from BBNaija S6-KayVee",
    "summarized_story": "By Rita OkoyeBig Brother Naija ”Shine Ya Eye” ex housemate, KayVee, has broken his silence days after he voluntarily withdrew from the ongoing reality TV show.\nKayVee whose real name is Gbolahan Ololade, withdrew from the show on August 16 following advice from doctors who visited him on the show.\nHis fellow housemates drew the attention of big brother after they noticed he was exhibiting some ”weird behaviours”.\nKayVee in a statement released on his Instagram page this evening, said that he wanted to stay on the show till the end but certain events escalated the anxiety he felt in the house and this impacted his disposition.\nHe said he is currently in a medical facility where he is working through the debilitating anxiety."
  },
  {
    "headline": "Arewa, Yoruba, Igbo, M’Belt elders support Masari’s self-defence call",
    "summarized_story": "They agree that the security situation has reached a point where Nigerians must take their destiny in their own hands.\nBut for the spokesman, Arewa Consultative Forum (ACF), Emmanuel Yawe, governor as chief security officer has the constitutional powers to put in place security measures that would safeguard his state.\n“Governor of Katsina, as provided in the 1999 Constitution, is the chief security officer of his state.\nHe is, therefore, permitted by the constitution to introduce security measures within the boundaries of his state and his state alone.\n“That also confirms what people have always said, that the security situation in the country is terrible and there doesn’t seem to be any capacity from the government to defeat it."
  },
  {
    "headline": "Death of 7 family members: Osun orders full investigation",
    "summarized_story": "From Lateef Dada, OsogboOsun State Government has ordered immediate investigation into the circumstances surrounding the death of seven members of a family found dead in their rooms at Apomu, Isokan Local Government Area of state.\nThe Osun State Police Command had confirmed the report of the death of the family members.\nOpalola said poison of carbon monoxide (generator fume) is suspected to be the cause, but the result of autopsy would confirm the cause of death.\n“The remains of the other dead members of the family had also been taken to Obafemi Awolowo University (OAU) Teaching Hospital, in Ile-Ife, where autopsy will be carried out on them to ascertain the cause of their death.\nTheir bodies were reportedly taken to a private hospital in the community by sympathisers, but were rejected, before they were taken to OAU Teaching Hospital morgue."
  },
  {
    "headline": "Lagos gets special team to stop street begging, hawking",
    "summarized_story": "By Lukman OlabiyiLagos government has set up a special team to stop street begging and hawking in the state.\nDawodu said curbing street begging was necessary to sanitise the society and restore dignity for those sent on the streets for alms begging and hawking.\n“The special team will tackle the menace frontally and would commence operation in the next few days,” he said.\nThe commissioner said the task of the team was not only to sanitise the society, but also restore the dignity of hawkers and beggars.\nHe said street begging was a social vice that government cannot afford to watch attain uncontrollable level in order not to affect the good plans and programmes to transform the state."
  },
  {
    "headline": "Igboho: Court extends restraining order on AGF, DSS",
    "summarized_story": "The court had on Wednesday August 4, this year, granted a restraining order against the DSS and AGF, from arresting, intimidating, harassing and freezing the bank accounts of Igboho.\nThe case with number M/435/2021, instituted by Igboho, against the trio of AGF as first respondent, DSS as second respondent, and Director of DSS in Oyo State as third respondent.\nBut counsel to the first respondent, Abubakar prayed the court for an extension of time for AGF to file his response to the processes filed by Igboho.\nBut Abubakar and Nurudeen filed an application on their preliminary objections to the case, asking the court to vacate the restraining order, and strike out or dismiss the suit.\nThe court, however, adjourned the case to Monday August 30, this year, for decision on the application."
  },
  {
    "headline": "Insecurity: Buhari Receives Briefing from CDS, Service Chiefs",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari is being briefed by the Chief of Defence Staff (CDS), General Lucky Irabor and other security chiefs about recent developments associated with the security challenges facing the nation.\nThe President, who returned to Abuja last Friday after 18 days in London, during which he attended an education summit and did health checks, is receiving the first formal security briefing since he left the country last month.\nPresident Buhari, at the meeting holding at the Conference Hall of the First Lady’s Office at the State House, is to be updated on security developments while plans to bring a decisive end to the challenges will be formulated.\nThe security forces have in the past few weeks taken the battle more robustly to insurgents, bandits, and all other criminals troubling the country, and they are now surrendering in droves.\nOthers attending the security meeting include Vice President Yemi Osinbajo, National Security Adviser (NSA), Major-General Babagana Monguno (rtd), the three Service chiefs and the Inspector General of Police, Usman Alkali Baba, among other top security personnel."
  },
  {
    "headline": "News in Photographs: Buhari Meets CDS, Service Chiefs",
    "summarized_story": "By Olusegun Adeniyi There are different accounts of how 'Afghanistanism' became an English word.\nBut the most popular is the one that traces its origin..."
  },
  {
    "headline": "PIA: Buhari Blames Past Leaders for Lacking Political Will to Transform Sector",
    "summarized_story": "The host communities have suffered enough, even when NDDC was established, I’m sure it was established because of the host communities’ issues and yet the host communities did not get much attention.\n“We expect that with the new Petroleum Industry Act, there are some reconciliations that will be carried out that might affect the projections for 2022.\nCommenting on the three per cent set aside for oil host communities, Tietie said it would help in developing the host communities.\nHe, however, said the make-up of the steering committee, does not translate into a true representation of the oil communities.\nBefore now oil companies disburse money to host communities in the manner that please them, which has generated crisis among host communities in the past."
  },
  {
    "headline": "Auditor General: FG’s 2019 Audit Report Contains N4.973trn Unsubstantiated Balances",
    "summarized_story": "Speaking yesterday while submitting the 2019 Audit report to the Clerk of the National Assembly (CNA), Ojo Amos Olatunde, the Auditor General revealed that, “from the audit carried out on the 2019 Federal Government Consolidated Financial Statement, unsubstantiated balances amounting to N4.973 trillion were observed“The N4.973 trillion unsubstantiated balances are above the materiality level of N89.34 billion set for the Audit,” he explained.\nIn auditing, materiality means not just a quantified amount, but the effect that amount would have in various contexts.\nAccording to the AGF, auditing of consolidated financial statement of the federal government on yearly basis would be expeditiously carried out once made available by the office of the Accountant General of the Federation.\nJust five months after, we are here again to make submission of the 2019 Audit Report”.\nHe explained that, “One of such problems is the absence of Federal Audit Service Law, which is a big challenge as far as effective and efficient public sector auditing are concerned."
  },
  {
    "headline": "APC to Hold LG Congress Sept. 4",
    "summarized_story": "By Adedayo AkinwaleThe All Progressives Congress (APC) has fixed Saturday, September 4, 2021 for the conduct of the Local Government Area Congresses.\nThe National Secretary of Caretaker/Extraordinary Convention Planning Committee of the party, Sen. John Akpanudoedehe, in a statement issued Wednesday said the sale of forms for various party positions had commenced.\nHe said: “APC Schedules Local Government Area Congresses for Saturday, 4th September, 2021; begins sale of forms.”However, the party has not fixed any date for the State Congresses.\nRecall that the Ward Congresses conducted by the party which held on July 31 was rancorous in some states, while it was hitch free in others.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Oil price falls for sixth consecutive day amid spike in fresh COVID-19 cases",
    "summarized_story": "Crude oil prices have dropped for the sixth consecutive day — longest losing streak since February 2020 — amid spike in fresh COVID-19 cases globally.\nPrior to the fall, Brent crude traded at $71.44 before dropping by a week low amid a decline in refining output in China and fresh outbreaks in COVID-19.\nAdvertisementU.S. West Intermediate crude (WTI) also fell by 2.9 percent to $63.02 per barrel.\nIn Nigeria, a decline in the price of Brent will affect government revenue as crude oil remains the major source of foreign exchange.\nAdvertisementMeanwhile, in June, Brent crude crossed the $75 mark — its highest level since April 2019 — granting a potential boost to Nigeria’s oil export revenue."
  },
  {
    "headline": "Oil price falls for sixth consecutive day amid spike in fresh COVID-19 cases",
    "summarized_story": "Crude oil prices have dropped for the sixth consecutive day — longest losing streak since February 2020 — amid spike in fresh COVID-19 cases globally.\nPrior to the fall, Brent crude traded at $71.44 before dropping by a week low amid a decline in refining output in China and fresh outbreaks in COVID-19.\nAdvertisementU.S. West Intermediate crude (WTI) also fell by 2.9 percent to $63.02 per barrel.\nIn Nigeria, a decline in the price of Brent will affect government revenue as crude oil remains the major source of foreign exchange.\nAdvertisementMeanwhile, in June, Brent crude crossed the $75 mark — its highest level since April 2019 — granting a potential boost to Nigeria’s oil export revenue."
  },
  {
    "headline": "'Grandmother' headline: Okonjo-Iweala commends Swiss press council for calling out newspaper's sexism",
    "summarized_story": "Ngozi Okonjo- Iweala, director-general of the World Trade Organisation (WTO), has commended the Swiss press council for calling out Aargauer Zeitung, a Swiss newspaper, over its headline describing her as “grandmother” after her election.\nAdvertisementFollowing the election of Okonjo- Iweala as WTO DG, at least, three Swiss newspapers — Luzerner Zeitung, Aargauer Zeitung and St. Galler Tagblatt — had described Okonjo-Iweala as a 66-year-old Nigerian grandmother.\nThe Swiss media description led to condemnation and a heavy backlash, with many describing the reportage as an expression of racism and gender discrimination.\nOn Tuesday, the Swiss Press Council, a self-regulatory media ethics organisation, faulted Aargauer Zeitung’s reportage.\nAdvertisement“I welcome the ruling of the Swiss Press Council calling out the gender bias & sexism of Swiss newspaper Aargauer Zeitung for its headline ‘Grandmother becomes boss of WTO’ upon my appointment."
  },
  {
    "headline": "'Grandmother' headline: Okonjo-Iweala commends Swiss press council for calling out newspaper's sexism",
    "summarized_story": "Ngozi Okonjo- Iweala, director-general of the World Trade Organisation (WTO), has commended the Swiss press council for calling out Aargauer Zeitung, a Swiss newspaper, over its headline describing her as “grandmother” after her election.\nAdvertisementFollowing the election of Okonjo- Iweala as WTO DG, at least, three Swiss newspapers — Luzerner Zeitung, Aargauer Zeitung and St. Galler Tagblatt — had described Okonjo-Iweala as a 66-year-old Nigerian grandmother.\nThe Swiss media description led to condemnation and a heavy backlash, with many describing the reportage as an expression of racism and gender discrimination.\nOn Tuesday, the Swiss Press Council, a self-regulatory media ethics organisation, faulted Aargauer Zeitung’s reportage.\nAdvertisement“I welcome the ruling of the Swiss Press Council calling out the gender bias & sexism of Swiss newspaper Aargauer Zeitung for its headline ‘Grandmother becomes boss of WTO’ upon my appointment."
  },
  {
    "headline": "Lai: Those criticising Buhari for seeking medical treatment abroad out to de-market him",
    "summarized_story": "Lai Mohammed, minister of information and culture, says those criticising President Muhammadu Buhari for seeking medical care abroad are out to de-market him.\n“Irrespective of the nationality of that doctor, it is my personal decision to choose the doctor to use.\nAdvertisement“Like I explained to them, he is not the only head of state that have gone abroad for treatment.\n“If Mr president has a personal physician for over 30 years, who understands his case and has been managing him, why will it be an issue of contention to seek medical attention from him.\n“It will not be right to say that because of what people are going to say, he has to stay in Nigeria to seek treatment.”AdvertisementThe minister berated those criticising the president’s action of seeking medical attention abroad, saying it is an inconsequential attempt to de-market him."
  },
  {
    "headline": "Meet Regina Honu, a Ghanaian software developer teaching thousands of girls to code",
    "summarized_story": "Failure is not finalIn her first year in senior secondary school, Honu had her first taste of failure during an Inter-school quiz competition.\nConversation between Regina Honu and students of Ashesi University during a visit.\nSame experience at another bank and turning away from a job at MicrosoftShe eventually left Zenith bank for Fidelity bank, a Ghanaian Bank.\nResigning from her JobThe morning of the day Honu resigned from her job, she didn’t know it would happen.\n10 years and countingIt’s been almost 10 years since Honu started Soronko Academy, for her there’s still so much more to do."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "Nigerian startup checks out of Afghanistan post Taliban takeover",
    "summarized_story": "The central government was disbanded; Ashraf Ghani, the president of Afghanistan fled the scene unannounced, leaving what remained of his administration in the mercy of the Taliban.\nMore recently, Chekkit, a Nigerian authentication and product tracking startup, expanded to Afghanistan after landing a partnership with the Afghanistan Ministry of Health to help in combating the endemic counterfeit medicine products in the country.\nTheir exit wasn’t much of a decision as all their partners have been forced to exit the country.\nObservers predict that with the Taliban in control, international trade will come to a standstill, leading to a surge in smuggling.\nThough after the capital takeover, the Taliban announced that the war is now over, can the dust settle that easily?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "11 critical questions on the leaked NITDA bill; a tussle for more power?",
    "summarized_story": "It finally gained traction when a link to the leaked bill was released, and several screenshots of supposedly alarming provisions began to float all over social media.\nWhat the Agency does have is a host of functions which increase from 14 to 24 in the leaked bill.\nIn a preceding subsection, the leaked bill proposes a fine not exceeding ₦30,000,000 ($72,832.21).\nAfter a more in-depth search, the name Galaxy Information Technology and Telecommunication (GITT) cropped up.\nGalaxy Information Technology and Telecommunications Limited started as a Dutse-based ISP in 2001 and morphed into what is now Galaxy Backbone."
  },
  {
    "headline": "A walk of photographs through nature and culture in the ancient city of Ilé-Ifè",
    "summarized_story": "World Photography Day is celebrated annually on August 19 to commemorate the art, science, and technology behind photography.\nTo celebrate this special global event, we explored the ancient South-Western Nigerian city of Ilé-Ifè from a cultural and natural perspective.\nOur final stop was the Natural History Museum at the Obafemi Awolowo University, Ilé-Ifè, where we took pictures of current and historical records of animals, insects, and plants.\nMuseum of Natural History, Obafemi Awolowo University, Ile-Ife, Osun State.\nIt was a reminder of how much there is to know and understand about our natural world."
  },
  {
    "headline": "Hardware is hard, more company levies and data privacy in Nigeria",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:How hard hardware isLevies for companiesHow much Nigerians care about data privacyImproving hardware production in NigeriaTochukwu Clinton Chukwueke, Founder of Clintonel Innovation CentreCreating hardware is hard.\nTo improve hardware production in Nigeria, Tochukwu Clinton Chukwueke, Founder of Clintonel Innovation Centre (CIC), an engineering hub located in Aba, Abia State, Nigeria is hosting the Hardware Convention 2021 for hardware startups and entrepreneurs in Nigeria.\nSoftware applications in Nigeria have recorded a significant level of success, but they still need hardware to run.\nPer the leaked bill, the companies include, banks and financial institutions, mobile and fixed telecommunications companies, information technology companies, e-commerce companies, and insurance companies.\nAccording to NITDA, it received several complaints accusing the company of divulging important customer data and defamation of character."
  },
  {
    "headline": "Higher Volume, pricing and baseline effect help leading firms record massive growth",
    "summarized_story": "Published second quarter results of Nigeria’s leading companies show strong growth as they put behind them the devastating effect of the COVID pandemic according to a report by FBNQuest.\nIt based its report on emerging evidence from the Q2 ’21 earnings season which is well underway and with over 65% of companies within its coverage…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lack of funding limits youths who want to farm",
    "summarized_story": "Lack of funding limits youths who want to farmFive in 10 Nigerian youths who are interested in tapping the opportunities in the agriculture sector are unable to do so due to lack of access to funding.\nDespite presenting a unique opportunity for Nigeria’s youth following its significant growth potential, the agriculture sector in Africa’s largest economy remains unattractive to many of the country’s…"
  },
  {
    "headline": "Nigeria’s fiscal deficit hits highest in 21yrs as revenues flop",
    "summarized_story": "The Federal Government of Nigeria spent N6.17 trillion more than it earned in 2020, leaving its fiscal deficit at 4 percent of Gross Domestic Product (GDP), the highest in 21 years, according to Central Bank of Nigeria (CBN) data analysed by BusinessDay.\nThe fiscal deficit, which is the difference between expenditure and revenue, widened to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Herdsmen’s Renewed Attacks on Plateau State: Lalong a weak leader – HURIWA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHUMAN RIGHTS WRITERS ASSOCIATION OF NIGERIA (HURIWA) has condemned the Plateau State governor for standing by and watching in an unbelievable way as Plateau State Christians are killed, stating that, this shows weakness on the part of the state governor, Simon Lalong.\n“The Plateau State governor Mr. Simon Lalong has indeed proven time without number to be a very weak leader of his people who have consistently come under persistent and vicious attacks against Plateau Christian native communities by armed Fulani herdsmen.\nAccording to HURIWA, despite the dusk-to-dawn curfew imposed on Bassa and other two Local Government Areas, suspected herdsmen on Tuesday night killed five persons in Chando-Zrrechi (Tafi-Gana) of Miango District in Bassa Plateau State.\nHURIWA therefore, is charging the Plateau State governor to stand up, speak out and take concrete action to stop the attacks on Christians by armed Fulani herdsmen and indeed stop all attacks on citizens irrespective of their Ethno-Religious affiliation.\n“Plateau State governor by his lacklustre approach to the genocides in Plateau State since 2015 is showing that he is a failed Chief executive of Plateau State and history and posterity will judge him harshly”."
  },
  {
    "headline": "No plan to increase taxes in Edo, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured that his administration has no plan to increase taxes in the state, noting that the state seeks inclusiveness and participation from citizens in revenue generation and administration.\nThe governor gave the assurance after a closed-door meeting with stakeholders in tax administration at the Edo State Internal Revenue Service (EIRS) head office in Benin City.\nObaseki’s visit to EIRS office follows the expiration of the tenure of the board, led by Igbinidu Inneh.\nHe said the state’s revenue service needs to be re-energized before the appointment of a new board.\nThe governor said the ratio of people who pay taxes compared to the taxable population in the state is very small, noting, “There is no need to increase taxes."
  },
  {
    "headline": "Erosion control project: Edo diverts traffic, closes sections of Murtala Mohammed Way for four weeks – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Nigerian Erosion and Watershed Management Project (NEWMAP) has announced the temporary closure of sections of the Murtala Mohammed Way, Benin City, to facilitate ongoing construction of the flood erosion alleviation work in the Ogiso/Osunde catchment areas of the city.\nIn a statement, Communications Officer, Edo NEWMAP, Ivy Adodo, said the roads will be closed for four weeks commencing from Thursday, August 19, 2021.\nAdodo, while assuring the timely execution of the project, appealed for the patience and understanding of the general public, particularly those in the affected areas.\nThe statement reads: “This is to inform the general public that the Edo Nigerian Erosion and Watershed Management Project (NEWMAP) is currently executing the flood erosion alleviation work in the Ogiso/Osunde catchment areas in Benin City.\n“To enable the construction of two culverts along Murtala Mohammed Way in Benin City to effectively drain and transport runoff within the catchment, the section between Osemwende Street and Agbonmwoba streets on Murtala Mohammed Way will be closed to Traffic for Four weeks commencing from Thursday 19th August, 2021.”Adodo further stated: “During this period, traffic moving toward Ikpoba Slope will detour using either of Osemwende street, a Nekpenepken and Ozolua Streets, through 2nd East Circular and continue down to Akpakpava road or can rejoin Murtala Mohammed Way again using either of Agbonmwoba Street, Igun Street, St. Stephen Street and Imuetinyan Street."
  },
  {
    "headline": "COVID-19: Religious bodies to set up COVID-19 vaccination centres in Edo, as govt intensifies vaccine rollout – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestReligious leaders in Edo State have urged residents to get vaccinated against the deadly coronavirus (COVID-19), to complement the government’s efforts at containing the pandemic.\nThis is so that people in various churches can be vaccinated.\nThe vaccine will not kill you; it will rather save and protect you.\n“We are in full support that the vaccination should be done in our various churches.\nChairman, Organization of African Instituted Churches (OAIC), Edo State, Apostle-General Dr."
  },
  {
    "headline": "Taliban leader orders release of political detainees",
    "summarized_story": "ADVERTISEMENTTaliban leader, Hibatullah Akhundzada, has ordered the unconditional release of political detainees from all Afghan prisons.\nQari Yousuf Ahmadi, spokesman of the Islamic Emirate of Afghanistan said on Thursday that the political prisoners will reunite with their families on Friday.\n“The Supreme Leader of the Islamic Emirate Hibatullah Akhundzada ordered the release of political prisoners from all jails.\n“The provincial governors will unconditionally release all political prisoners of low and high ranks from the country’s prisons and will hand them over to their families tomorrow,’’ Ahmadi tweeted.\nThe Taliban entered the Afghan capital on Aug. 15, ending weeks-long offensive and resulting in the collapse of the U.S.-backed government."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Insurgents kill 3,186 Nigerians in six months – Report",
    "summarized_story": "A report from the International Foundation for Peace Building and Social Justice has said 3,186 Nigerians were killed between January and June 2021 by insurgents and bandits.\nAccording to report, 2,963 persons were abducted while 161 were injured during various violent attacks across the country within the period.\nThe report said, “In the past six months, data reports by PSJ Data Team revealed at least 3,186 persons have been killed, 2,963 abducted and 161 injured across Nigeria.\nBorno state in Northeast came second while North Central states of Benue, Niger and Plateau came third on the report.\nThe report blamed Boko Haram Fulani militias as being responsible for most of the killings in the period under review."
  },
  {
    "headline": "FIRS plans to collect N10trn as tax from Nigerians in 2022",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has said it plans to collect N10.1 trillion as tax from Nigerians and others in 2022.\nThis is a national tax revenue projection the FIRS chairman Muhammad Nami shared with federal lawmakers in Abuja, NAN reported.\nIn 2020, the FIRS generated a tax revenue of N4,952,243,711,728.37.\nIts tax revenue target for 2021 is N7.61 trillion amid Nigeria’s security and economic crises.\nJames Faleke, the committee chairman, urged the FIRS management to put in the required determination to ensure that the target was met."
  },
  {
    "headline": "Report says women hold only 23% of board positions in Nigeria",
    "summarized_story": "Women hold less than 25 percent of board positions in companies quoted on the Nigerian Exchange Limited’s (NGX) top 20 quoted companies, a report on board gender diversity trends in Nigeria’s corporate organisations has shown.\n“In 2021, 23.4 per cent of board directorships of the NGX’s top 20 companies by market capitalisation are held by women.\n“The 25 per cent of the top 20 companies have at least 30 per cent female representation on their boards.\nThe report added: “Twenty per cent of the banks in the NGX Top 20 have at least 30 per cent female board representation.\n“The Central Bank of Nigeria stipulates 30 per cent female representation on the boards of Nigerian commercial banks."
  },
  {
    "headline": "Suspects narrate how they lure Uber drivers, POS operators, murder them",
    "summarized_story": "The Ogun State Police Command says it has arrested four members of a syndicate who specialise in robbing and killing Point of Sale (POS) operators and Uber drivers in the state.\nThe police further launched an investigation which led to the arrest of one of the kidnap kingpins who said their chief victims are POS operators and Uber drivers.\nThe other three suspects were arrested in connection with the crime.\n“He confessed further that their targeted victims are always Uber and POS operators.\nThe police boss has also directed that the suspects be charged to court as soon as the investigation is concluded."
  },
  {
    "headline": "PIA: APC Govs Applaud President Buhari",
    "summarized_story": "The newly assented Petroleum Industry Act (PIA) is a commitment of the ruling All Progressives Congress (APC) to the restructuring of the Nigerian economy through the democratic process.\nADVERTISEMENTAccording to the statement, “the new PIA present a convincing credential of the commitment of our party, APC, to restructure the Nigerian economy through the democratic process in line with provisions of the 1999 Nigerian Constitution as amended.\n“Even critics of our party, APC, and our governments cannot ignore the fact that the coming into law of the Petroleum Industry Act is an important democratic milestone.\n“We remain committed to a democratic process of negotiating the reform of our Republic to make it more responsive to the needs of Nigerians.\nThrough our engagements with the leadership of the National Assembly, we would also continue to provide all the needed support to enhance the already existing synergy between both the executive and legislative arms of government."
  },
  {
    "headline": "Kida Highlights NBBF Support For Foundations",
    "summarized_story": "The Chairman of the Nigeria Basketball Federation, Engr Ahmadu Musa Kida, has commended the efforts of the various basketball foundations for organizing different basketball programmes in the country.\nKida, who was the Guest of the FCT Football Updates virtual Personality Interview Segment applauded the Adamu Yola and Jordan Nworah Foundation for organizing clinics in various parts of the country.\nKida said the Federation under his leadership supported such foundations by giving them enabling environment, technical and administrative support in ensuring the programs succeed.\nKida boasted that his efforts as the Chairman of Rivers State Basketball Association has seen the consistently winning the gold in three National Sports Festivals, “this didn’t come by accident for winning gold in the both male and female events, but by having a youth programme that we encouraged.\nWe have a few academies and foundations that we were operating especially the AMK Foundation which is my Foundation and reputed for been the very first in development of the game in West Africa.”"
  },
  {
    "headline": "NVBF Unveils 12-man Squad For U19 World Cup",
    "summarized_story": "The head coach of Nigeria U19 Volleyball Boys team, Sani Mohammed, has announced his final 12-man list for the 2021 FIVB U19 Boys World Championship.\nThe 2021 FIVB U19 Boys World Championship will take place in Iran from August 24 to September 4.\nADVERTISEMENTMohammed revealed that the team aims to surpass their previous 14th position at the 2019 World Championship in Tunisia.\nAt the last World Championship, Nigeria finished 14th position which is encouraging.\nThe Nigeria U19 players played against Kaduna and Abuja selected in their final friendlies before the World Championship."
  },
  {
    "headline": "Minister Salutes Team Nigeria’s U-20 For Historic 4x400m Mixed Relay Gold",
    "summarized_story": "The minister of youth and sports development, Sunday Dare, has hailed Nigeria’s U-20 4x400m mixed relay team for making history at the ongoing World Athletics Championship (WAC) in Nairobi, Kenya.\nTeam Nigeria made history on Wednesday by clinching gold in the 4x400m mixed relay event.\n“I want to specially congratulate our U20 team for making history in Nairobi.\nHe challenged the Okowa-led AFN to build on the successes it will record in Nairobi.\nIn the men’s javelin throw, Chinecherem Nnamdi threw a massive new personal best and Nigeria’s U-20 record of 78.03 to qualify for the final."
  },
  {
    "headline": "AFCON 2021: Egypt, Others Will Be Wary Of My ‘Young Team’ – Rohr",
    "summarized_story": "Super Eagles head coach, Gernot Rohr, has boasted that his ‘youthful’ Super Eagles squad will be ready to face any team at the next Africa Cup of Nations (AFCON) in Cameroon.\nThe three-time African champions were drawn against Egypt, Sudan and Guinea- Bissau in Group D on Tuesday in Yaoundé for the competition which will start on January 9 and end on February 6, 2022.\n“We have a young team, but they are doing very well last season and this season also, like Victor Osimhen, who was top scorer in qualification,” Rohr told ESPN.\nADVERTISEMENT“Kelechi Iheanacho, Wilfred Ndidi and so many playing very well in the clubs in Europe.\nThe Super Eagles will open their campaign against Egypt at the Roumdé Adjia Stadium, Garoua on January 11."
  },
  {
    "headline": "Maria to Angel: You broke the ‘girl code’ by snatching Michael from Jackie B",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Maria, said that Angel broke the ‘girl code’ by flirting with Michael who is Jackie B’s love interest in the house.\n“Michael and Jackie B liked each other.\nNow Angel has used her ‘powers’ and is acting silly about it,” Maria said, noting that Jackie B and Angel were 5&6 prior to the occurence.\nRecall that Jackie B cleared the air that she is not into a relationship with Michael in her own Diary Session on Tuesday.\nLater the same day, Angel advised Michael not to restrict himself to Jackie B as another female housemate may be interested in him."
  },
  {
    "headline": "Maria to Angel: You broke the ‘girl code’ by snatching Michael from Jackie B",
    "summarized_story": "Big Brother Naija Shine Ya Eye housemate, Maria, said that Angel broke the ‘girl code’ by flirting with Michael who is Jackie B’s love interest in the house.\n“Michael and Jackie B liked each other.\nNow Angel has used her ‘powers’ and is acting silly about it,” Maria said, noting that Jackie B and Angel were 5&6 prior to the occurence.\nRecall that Jackie B cleared the air that she is not into a relationship with Michael in her own Diary Session on Tuesday.\nLater the same day, Angel advised Michael not to restrict himself to Jackie B as another female housemate may be interested in him."
  },
  {
    "headline": "Help! Kidnapped Zamfara students beg govt to pay ransom within 24 hours",
    "summarized_story": "The abducted students of the College of Agriculture and Animal Sciences, Bakura in Zamfara State have appealed to Governor Bello Matawalle and the government to pay the ransom demanded by their abductors within 24 hours.\n“We are the students of the College of Agriculture and Animal Science, Bakura that were abducted by the bandits,” said one of the students who spoke in Hausa.\nThey are threatening to kill us if the government does not produce the ransom in 24 hours.\nA total of 20 people comprising 15 students, four staff, and a driver were abducted on Sunday night when bandits stormed the school.\nTwo days after the incident, the abductors demanded a ransom of N350 million before they would release their victims."
  },
  {
    "headline": "Help! Kidnapped Zamfara students beg govt to pay ransom within 24 hours",
    "summarized_story": "The abducted students of the College of Agriculture and Animal Sciences, Bakura in Zamfara State have appealed to Governor Bello Matawalle and the government to pay the ransom demanded by their abductors within 24 hours.\n“We are the students of the College of Agriculture and Animal Science, Bakura that were abducted by the bandits,” said one of the students who spoke in Hausa.\nThey are threatening to kill us if the government does not produce the ransom in 24 hours.\nA total of 20 people comprising 15 students, four staff, and a driver were abducted on Sunday night when bandits stormed the school.\nTwo days after the incident, the abductors demanded a ransom of N350 million before they would release their victims."
  },
  {
    "headline": "JUST IN: Mohammed Fawehinmi dies of COVID-19",
    "summarized_story": "The family of Mohammed Fawehinmi, Chief Gani Fawehinmi’s first son, has finally released the cause of his death.\nSaheed Fawehinmi, his younger brother said Mohammed succumbed to COVID-19 related complications.\nThe family had insisted on autopsy before his burial now scheduled for 27 August.\n“Today however, we are in a position to inform you that our dear brother died from COVID-19 related complications,” Saheed, who is based in the U.S. said today.\nMohammed had complained of breathing problems on 11 August, the day he died."
  },
  {
    "headline": "MURIC to FG: Treat repentant terrorists like 'lost and found brothers'",
    "summarized_story": "The Muslim Rights Concern (MURIC) has called on the Federal Government and Nigerian Army to resettle repentant Boko Haram and ISWAP terrorists.\nMURIC in a statement on Thursday said the terrorists should be treated like lost brothers that are newly found.\n“Nigeria’s North-East war zone has witnessed a dramatic change with Boko Haram insurgents and ISWAP fighters laying down their arms in their thousands.\nConsequently, the zone has been inundated with an unusually large number of ex-insurgents and former ISWAP fighters.\nOnly a swift, effective and meaningful resettlement of remorseful Boko Haram insurgents and ISWAP fighters can win the real war, the statement read."
  },
  {
    "headline": "Ondo: Shops, Markets Shut As Akure Celebrates Age-long Festival",
    "summarized_story": "Following the celebration of an age-old event, business activity in Akure, the capital of Ondo State, have been halted.\nNewsDirect said that businesses and markets across the city were closed on Thursday to commemorate the town’s ‘Aheregbe’ and ‘Amole’ festivals.\nOba Ogunlade Aladetoyinbo, the Deji of Akure kingdom, declared that the change was in accordance with the festival’s requirements.\n“It is crucial to clarify that there shall be no trading or opening of shops under any pretense on these days,” the Deji official added.\nMeanwhile, anyone who disobeys the order and establishes a shop would have their goods confiscated, along with other traditional punishments."
  },
  {
    "headline": "BREAKING: Soludo, Oye Lose As Court Declares Umeoji APGA Candidate",
    "summarized_story": "The fight for the All Progressives Grand Alliance (APGA) governorship ticket and chairmanship has swung back in favor of Hon.\nChukwuma Umeoji and Chief Jude Okeke, who were both recognized by the Independent National Electoral Commission.\nChukwuma Umeoji, who emerged as APGA Governors.\nINEC is directly barred by today’s judgement from seeking to delete Umeoji’s name as an APGA candidate off its list, as it was rumored that it was under pressure to do so.\nThe Kano Appeal Court did not go into detail about who should be the party’s candidate, between Prof. Charles Soludo and Hon."
  },
  {
    "headline": "BREAKING: Buhari Receives Security Briefing From Service Chiefs [PHOTOS]",
    "summarized_story": "In Abuja, the nation’s capital, President Muhammadu Buhari received briefings from service chiefs on Thursday.\nThe meeting took place in the State House, in the President’s office.\nAlthough the meeting’s agenda is unknown, it is likely to be related to the country’s current security crisis.\nThe photos also captured the vice president, Yemi Osinbajo, check them out below:"
  },
  {
    "headline": "Taliban Takeover: America Freezes Afghanistan’s Billions In US Banks",
    "summarized_story": "Following the Taliban takeover, the US government has blocked Afghanistan’s government funds in American banks.\nAfter Kabul was seized, Afghanistan’s Central Bank chief, Ajmal Ahmady, escaped, according to the Washington Post.\nOn Wednesday, Ahmady revealed that the US Central Bank has roughly $7 billion in reserves.\nAccording to the Wall Street Journal, federal officials are preventing Taliban access to government accounts controlled by the Federal Reserve and other US banks.\nAmerica is also preventing the International Monetary Fund (IMF) from accessing roughly $500 million in reserves."
  },
  {
    "headline": "Taliban takeover: At last, Afghan President, Ghani, opens up",
    "summarized_story": "Afghan President Ashraf Ghani, speaking from exile in the United Arab Emirates, said on Wednesday that he had left Kabul to prevent bloodshed and denied reports he took large sums of money with him as he departed the presidential palace.\nAnti-Taliban protests in the eastern city of Jalalabad over the removal of the Afghan flag have now spread elsewhere in Afghanistan.\nIn Jalalabad, at least three people have been reportedly killed and a dozen others wounded after shots fired at protest against removal of Afghan flag by Taliban.\nMeanwhile, planes carrying hundreds of evacuees from Kabul have arrived in the United Kingdom and Germany as Western nations stepped up evacuation efforts.\n(Aljazeera)"
  },
  {
    "headline": "N4.973trn balances in 2019 Audit Report unsubstantiated – AGF",
    "summarized_story": "Auditor General of the Federation Adolphus Aghughu has said unsubstantiated balances amounting to N4.973 trillion was observed by his office in the audit carried out on consolidated financial statement of the federal government of Nigeria in 2019.\nHe spoke Wednesday in Abuja while submitting the 2019 Audit Report to Clerk of the National Assembly (CNA) Ojo Amos Olatunde.\nThe auditor general said: “From the audit carried out on the 2019 Federal Government Consolidated Financial Statement, unsubstantiated balances amounting to N4.973 trillion were observed.\n“Just five months after, we are here again to make submission of the 2019 Audit Report,” Aghughu also said.\n“One of such problems is the absence of Federal Audit Service Law which is a big challenge as far as effective and efficient public sector auditing is concerned."
  },
  {
    "headline": "Nigeria lost $50bn investments to delayed PIB passage – Buhari",
    "summarized_story": "Following the uncertainty that for long surrounded the Petroleum Industry Bill (PIB) and the consequent lack of progress and stagnation in the industry, Nigeria lost an estimated $50 billion worth of investments in 10 years, President Muhammadu Buhari has said.\nWith the Act, Buhari said, the decades of uncertainty and under-investment in the petroleum industry were gone.\nIn the past ten years, Nigeria has lost an estimated US$50 billion worth of investments due to uncertainty created by the non-passage of the PIB.\n“This administration believes that the timely passage of the Petroleum Industry Bill will help our country attract investments across the oil and gas value chain.\n“The 3 percent will be paid directly to the host communities to manage."
  },
  {
    "headline": "Poor leadership limiting impact of trade unions- Sirika -NigPilot",
    "summarized_story": "Minister of Aviation, Hadi Sirika, has highlighted that like in other sectors, the challenge of poor and non-proactive leadership has reduced the impact of Trade Unions across sectors in the country.\nThis, he said has contributed to a lack of trust by members and wrong strategies by union leaders in addressing the myriads of issues that regularly call for attention.\n“On our part, we will continue to support the involvement of union leaders and workers in our policy and decision-making processes.\n“In the Nigerian aviation sector, I dare say that the various labour unions have tried to play this role effectively.\nThis role enables labour unions to ensure that cordial and good understanding between employers and employees could be established in the workplace and leads to a harmonious and conducive working environment."
  },
  {
    "headline": "Yobe Airport to gulp N6bn – Minister -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has informed that construction of the Wachaka Airport in Yobe State will cost up to N6, 284, 065, 056.00.\nBriefing journalists on Wednesday, Sirika said the sum was approved by the Federal Executive Council (FEC) during its meeting.\nHe added that a second approval was given for the Post-Consultancy Services for the construction of the Wachakal Airport.\nAccording to Sirika, the contract sum is N9,535,132,500 and included 7.5 percent VAT, with a delivery period of 12 months.\nHe said that the total contract sum for the procurement s N658,762,783.36, which includes 7.5 percent VAT."
  },
  {
    "headline": "Nuhu Yahaya: Adamu sets up Committee to probe cause of death -NigPilot",
    "summarized_story": "Following the recent news of the death of a JSS II student of Federal Government College, Kwali, Abuja, Nuhu Yahaya, the Minister of Education, Malam Adamu Adamu has set up a Committee to investigate the circumstances of his death.\nAdamu who confirmed the death of the student in the press statement issued to journalists by the Ministry’s Director, Press and Public relations, Mr. Ben Bem Goong, said the Ministry has dispatched a condolence letter to the family of the boy and has equally paid a visit to the family.\nThe rumor of the death of the 13 years Yahaha has been making the rounds on social media since two weeks ago, alleging that his female teacher was responsible for his death.\nIt was alleged that Nuhu Yahaya who died on the 9th of August was beaten to death by his female teacher.\nMeanwhile, the Education Minister has dismissed this speculation, advising the members of the public, even the media, to shun such rumors on the death of Nuhu until the committee comes up with its findings."
  },
  {
    "headline": "Nigeria mulls synergy with S/Leone to secure West Africa -NigPilot",
    "summarized_story": "Dingyadi who spoke during a courtesy call by the Sierra Leone delegate led by the Minister of Interior, David Maurice Panda-Noah, and the Inspector General of Police, IGP Ambrose Sovula at the ministry’s headquarters in Abuja, noted that such synergy between Nigeria and Sierra Leone would enhance the efficiency of rank and files of Police to secure West African region.\nHe said, “in addition to the National Institute of Police Studies, we have other police colleges around the country that can train intermediate officers.\nPanda-Noah stressed the urgent need for African countries to unite, synergize and collaborate in order to combat transnational challenges.\nHe said: “Africa has their own unique problems which only Africans can solve.\nSupporting one another is key to tackling the challenges which have bedeviled Africa and the world at large."
  },
  {
    "headline": "Nigeria Records Highest Daily COVID-19 Cases In Seven Months",
    "summarized_story": "Nigeria witnessed a spike in COVID-19 cases on Wednesday, recording its highest daily cases in seven months.\nThe Nigeria Centre for Disease Control confirmed 1,149 fresh infections for the day, three times higher than the 357 cases confirmed on Tuesday.\nWednesday’s figures also marks the first time the country is reporting more than 1,000 cases in a day since February 19 when 1,492 cases were reported.\nAccording to the NCDC, the cases reported on Wednesday were spread across 15 states and the Federal Capital Territory Abuja.\nAs of Thursday morning, 184,593 people have been infected with COVID-19 in Nigeria."
  },
  {
    "headline": "Nigeria Lost $50bn In 10 Years Due To Uncertainty Over Petroleum Industry – Buhari",
    "summarized_story": "President Muhammadu Buhari on Wednesday in Abuja said Nigeria lost an estimated $50billion worth of investments in 10 years.\nThis, according to him, was a result of the uncertainty of the non-passage of the Petroleum Industry Bill (PIB), lack of progress and stagnation in the petroleum industry.\nPresident Buhari said assent of the Petroleum Industry Bill on August 16, 2021, marked the end of decades of uncertainty and under-investment in the petroleum industry.\n“This administration believes that the timely passage of the Petroleum Industry Bill will help our country attract investments across the oil and gas value chain.\nPresident Buhari said the administration believes that the timely passage of the Petroleum Industry Bill will help the country attract investments across the oil and gas value chain."
  },
  {
    "headline": "PIA: We Discussed With Labour Extensively, No Job Will Be Lost – Sylva",
    "summarized_story": "The Minister of State for Petroleum Resources, Mr Timipre Sylva has assured that no job will be lost in the nation’s petroleum sector following the signing of the Petroleum Industry Bill into law.\n“So, no job will be lost as a result of the Petroleum Industry Act.\nAll jobs in the petroleum industry will be intact.\nWhile noting that the commercialisation of the Nigerian National Petroleum Corporation (NNPC) will be beneficial to the workers, Sylva explained that the move would not create any problem at all.\nTwo days after the bill was signed, the President approved a committee to immediately commence the implementation of the Petroleum Industry Act (PIA)."
  },
  {
    "headline": "Forty-Seven Killed In Burkina Faso Jihadist Attack",
    "summarized_story": "Burkina Faso’s president declared three days of national mourning from Thursday after suspected jihadists killed 47 people, including 30 civilians, in an attack in the north of the country.\nIn an ensuing gunbattle, security forces killed 58 “terrorists” and put the rest to flight, according to the government.\nThe area is in the notorious “three-border” zone where Burkina Faso meets Mali and Niger, a focus of the jihadist violence that plagues the wider Sahel region of west Africa.\nBurkina Faso, a poor country in the arid sub-Saharan Sahel region, has since 2015 been battling increasingly frequent and deadly attacks by jihadist groups affiliated with the Islamic State group and Al-Qaeda.\nAlong with central Mali, the vast, arid “three-border” region straddling Niger, Mali and Burkina Faso has become the worst-hit area in the jihadists’ Sahel campaign."
  },
  {
    "headline": "Taliban Vow To Ban Heroin, But Can They Survive Without It?",
    "summarized_story": "Despite their promise to wean themselves off the profitable trade, experts say they will struggle in keeping the economy afloat.\nThe vast majority of the world’s opium and heroin comes from Afghanistan, with production and exports centred in areas controlled by the Taliban, which has taxed the drugs heavily during their 20-year insurgency.\nIt has become a key resource for the group and they could struggle to ban it, said Jonathan Goodhand, an expert in the international drugs trade at SOAS University of London.\nBut on the other, any repression would hit farmers in the Taliban political heartlands of Helmand and Kandahar provinces in particular.\nGretchen Peters, the American author of the book “Seeds of Terror: How Heroin Is Bankrolling the Taliban and Al-Qaeda”, said the Taliban’s previous ban on poppy cultivation was tactical."
  },
  {
    "headline": "APC Governors commend Buhari for signing PIB into law",
    "summarized_story": "The Progressives Governors Forum has commended president Muhammadu Buhari, for signing the Petroleum Industry Bill into law.\nThe PGF as it is fondly called is a forum of governors elected on the platform of the All Progressives Congress.\n“The new Petroleum Industry Act presents a convincing credential of the commitment of our party, All Progressives Congress (APC), to restructure Nigerian economy through the democratic process in line with provisions of the 1999 Nigerian Constitution as amended.\nAdvertisement“On Monday, August 16, 2021, Mr. President, His Excellency, Muhammadu Buhari, GCFR assented to the Petroleum Industry Bill (PIB) and by so doing restructure the operations and management of the Nigerian oil and gas industry.\n“With the coming into law of the new Petroleum Industry Act, once more our party under the leadership of President Buhari has demonstrated unwavering commitment to change Nigeria democratically.”"
  },
  {
    "headline": "Toyota to cut Sept output by 40% amid chip shortage, covid resurgence",
    "summarized_story": "Toyota Motor Corp has said it will lower global production by 40% from its prior forecast for September, becoming the final major carmaker to do so as a result of a global chip shortage, but it will meet its yearly sales and production targets.\n“The 9.3 million global production plan takes into account certain risks,” executive Kazunari Kumakura told reporters.\nOf these, 140,000 will be at Japanese plants, with the rest in the United States, China, Europe and other Asian countries.\nAdvertisementDue to the months-long chip shortage, carmakers around the world have been reducing production, but a resurgence in Covid-19 cases in Japan, the Philippines, Thailand, Vietnam, and Malaysia – all of which have auto factories and chip plants – has prompted stricter restrictions, exacerbating the crisis.\nToyota also halted operations at three factories in Thailand last month owing to a pandemic-related component shortage."
  },
  {
    "headline": "Taliban urge people to leave Kabul airport following death of twelve persons",
    "summarized_story": "The Taliban have encouraged travelers to evacuate the Hamid Karzai International Airport in Kabul following the killing of twelve individuals since Sunday.\nAfter Taliban fighters seized over Afghanistan’s presidential palace, causing pandemonium in the building and on the runways, thousands of Afghans fled their homes and traveled to the airport in an attempt to flee life under Taliban control.\nAccording to Taliban and NATO sources, some people died as a result of the efforts, while others died as a result of gunshots or stampedes.\nAdvertisementEvacuation attempts are still underway in Afghanistan, with countries from all around the world banding together to help individuals seeking to flee.\nThe militants control all roads leading to the airport, and soldiers use their authority to verify the documents of individuals attempting to enter."
  },
  {
    "headline": "Anybody Can Be President but Not Everybody Can Be an Effective President: Sonny Iroche",
    "summarized_story": ""
  },
  {
    "headline": "Distressed Afghan Women Gather at Kabul Airport Now Controlled By Taliban, Throw Children to British Soldiers",
    "summarized_story": "On either side of a narrow road, inside the walls of the compound at Kabul airport, exhausted British soldiers lie in the shade waiting for their turn to head back outside into the burning sun and the chaos once again.\nThe Taliban are just one metre away from the British soldiers – it’s a picture I never thought I would see.\nUp the road they are controlling the crowds of people trying to reach the British position.\n“Afghanistan is Taliban.\nI’ve been on countless embeds with British and American soldiers, I’ve met with the Taliban, and I’ve seen pain and grief in Afghanistan for two decades."
  },
  {
    "headline": "I Was Mobbed in Trinidad & Tobago, Nigerian Actor RMD Says",
    "summarized_story": "Prominent Nigerian actor Richard Mofe-Damijo says he was mobbed on one of his visits to Trinidad & Tobago.\nPopularly known as RMD, he told ARISE News on Wednesday that the act was surreal for him as he never believed people in the Caribbean country saw Nigerian movies.\nFor the former Delta State Commissioner, the fact that he was recognised in the country was an eye-opener during his visit for their carnival.\nWatch the interview for more."
  },
  {
    "headline": "Sonny Iroche Canvasses ‘Pay As You Serve’ for Nigerian Lawmakers",
    "summarized_story": "The Nigerian Communications Commission (NCC) is arrogating to itself the power of the Independent National Electoral Commission, Sonny Iroche, the Convener and National Coordinator, Abia League of Professional Initiative has said.\nMr Iroche is accusing the NCC of falsely claiming that INEC does not have the capacity to electronically transmit election results in the 2023 general elections in spite of the election body stating it has the ability to do so.\nThe professional group is also demanding responses from their representatives in the Nigerian Senate over their role in rejecting a provision for electronic transmission of election results in the proposed amendments to the Electoral Act passed by the Senate.\nIroche suggested that lawmakers should be payed only when they sir, which he believes will encourage more responsibility.\nWatch the interview for more…"
  },
  {
    "headline": "US Plans Booster Shots for All Americans as Studies Suggest Vaccine Losing Ground",
    "summarized_story": "US health officials Wednesday announced plans to dispense Covid-19 booster shots to all Americans to shore up their protection amid the surging delta variant and signs that the vaccines’ effectiveness is slipping.\nPeople who received the single-dose Johnson & Johnson vaccine will also probably need extra shots, health officials said.\nHealth officials are likely to recommend that the booster be the same brand of vaccine that people received initially.\nLast week, US health officials recommended a third shot for some people with weakened immune systems, such as cancer patients and organ transplant recipients.\nBut vaccine effectiveness against new laboratory-confirmed infections declined from about 92% in early May to about 80% in late July."
  }
]