[
  {
    "headline": "Nigeria’s challenges are signs of greatness – Rep",
    "summarized_story": "A member of the House of Representatives, Ibrahim Almustapha, has said that Nigeria’s current challenges are signs of greatness, saying the country has the capacity to surmount them.\nHe said, “To me, I see most of these challenges, especially the security challenge facing the country, as a sign of greatness, many great nations passed through lots of challenges on their way to greatness.\n)-led Federal Government, would succeed in its bid to tackle the security challenges bedeviling the country.\nAlmustapha said that the new leadership of the APC would reposition the party ahead of the 2023 general election.\n“I can comfortably tell you that the APC will win the 2023 general election with a landslide victory.”He expressed optimism that the party would remain united ahead of the general election."
  },
  {
    "headline": "JUST IN: Robbers attack Ayefele’s radio station during live broadcast",
    "summarized_story": "One of the private radio stations in Ibadan, Fresh FM, came under attack from armed robbers in the early hours of Sunday.\nOur correspondent gathered that the radio station was on a live broadcast when the hoodlums struck and carted laptop computers, phones, and personal belongings of members of staff around.\nA member of staff of the radio station told our correspondent that the robbers invaded the station located in the Challenge area of Ibadan at around 6:30 am.\nNo one was injured, they just took away valuables,” he said.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Nigerians must keep labouring for God – CAC President",
    "summarized_story": "Pastor Samuel Oladele, President, Christ Apostolic Church (CAC) Nigeria and overseas, has enjoined Christians in Plateau and Nigeria to continue to labour for God.\n“Do not relent in labouring for God.\nOladele gave the counsel while addressing members during an inauguration service of the new Orekoya Region of the Church.\nIn a remark, Ayuba Maju, Superintendent of CAC in Kwatas District, said that security had been a major challenge and a major drawback to the Church’s growth.\nMaju appealed to the Church to assist survivors of various attacks to ameliorate their suffering and encourage their faith."
  },
  {
    "headline": "Cartoon: Sarge wants no idiomatic expression",
    "summarized_story": ""
  },
  {
    "headline": "TRAIN ATTACK: ‘The owner of this phone has just been killed’",
    "summarized_story": "According to her, she spoke to him on phone before the train attack only to call his phone later and a mortuary attendant picked the call and told her, her husband was dead.\nRead Also:Akinwunmi was not the only TUC official killed in the attack.\nHe said he had left Abuja that he was inside the train on his way to Kaduna”, the widow told Sunday Vanguard.\n“Moments later when I heard about the train attack, I immediately called him again, and his phone started ringing.\nIn another condolence message, a pro-democracy group, Kwara Must Change, sympathized with the state chapter of nTUC over loss of Akinwunmi."
  },
  {
    "headline": "My mission is to make Oyo great again —Kolapo Kola Daisi",
    "summarized_story": "Kolapo Kola-Daisi, a Fellow of the Financial Markets Dealers Association, FFMDA, is an Oyo South Senatorial District aspirant under the All Progressive Congress.\nThe scion of elder statesman, lawyer, businessman and Bashorun of Ibadan, Chief Kola Daisi believes he is coming to politics to make a difference.\nMy people in Oyo South Senatorial District have been crying out for change.\nMy mission is to make Oyo State great again, and on a larger scale make Nigeria great.\nI have a four-point agenda for the people of Oyo South Senatorial District."
  },
  {
    "headline": "New Owerri now fastest paying destination in South-East Nigeria — Experts",
    "summarized_story": "By Tony NwankwoReal estate practitioners and investors have said New Owerri has surpassed every other city in South East in terms of quick Return On Investment (ROI) in the real estate sector.\nThis was confirmed by experts during an event organized for professionals in the real estate community.\nThe forum was the inaugural stakeholders briefing and presentation by the promoters of Denka Business City, New Owerri for members of the Nigeria Institute of Estate Surveyors and Valuers (NIESV), Owerri branch.\nThe event, which took place at the Banquet Hall of RENTO Hotel, New Owerri also had in attendance representatives of Owerri Chamber of Commerce and Industry as well as some key investors.\nWhile making his presentation, the Chief Operating Officer of Denka Business City, Arc Uche Uche disclosed that the business city which is currently under construction is designed to be a business hub comprising of a mix of shops, offices and apartments for sale to the public."
  },
  {
    "headline": "Electoral Act: Court stops AGF, others from frustrating appeal against judgment",
    "summarized_story": "The Court of Appeal has ordered the Attorney General of the Federation (AGF) and others to desist from taking steps capable of frustrating hearing in an appeal filed against judgment of a Federal High Court which ordered removal of section 84 (12) from the new Electoral Act.\nA Federal High Court, Umuahia division had on March 18 declared as invalid and unconstitutional section 84 (12) of the amended Electoral Act.\nJustice Evelyn Anyadike in a judgment ordered the Attorney General of the Federation to delete the said section from the amended Electoral Act.\nHowever, the National Assembly, which enacted the contentious section 84 (12) had lodged an appeal at the Court of Appeal in Owerri against the Umuahia court judgment ordering the AGF to delete Section 84(12) of the amended Electoral Act.\nNASS claimed that the high court passed judgment on a matter which was not included in the Electoral Act and concluded that its decision was liable to be set aside by the Court of Appeal."
  },
  {
    "headline": "Osinachi’s death: Churches must take domestic violence seriously – Ezekwesili",
    "summarized_story": "Oby Ezekwesili, a former minister of education has called out churches over the death of ‘Ekwueme’ singer Osinachi Nwachukwu.\nHowever, minutes later it was learnt that the singer died in the hospital after suffering domestic violence from her husband.\nThere are reports that Osinachi’s refused to leave the marriage despite domestic violence because of her commitment to the church.\nReacting to her death, Ezekwesili in a thread via her Twitter page said the allegation of spousal abuse leading to Osinachi’s death hit hard.\nI hope the truth is unearthed and justice given.”The activist urged everyone including churches to take seriously the issues of domestic violence against women."
  },
  {
    "headline": "Group seeks improved welfare for Police",
    "summarized_story": "“If we wish to see an end to the rampant practice of extortion, we must be emphatic in calling for improved welfare for the police personnel in Nigeria.\n“Infringing on the rights of others, especially honest and hardworking youths just because they wear a unique hairstyle is not something we would like to see further.\nAccording to them, until the Nigeria Police Force (NPF) is reformed and adequately funded, efforts to instill discipline and professionalism in the institution will continue to remain a mirage.\nAlso speaking, a Human rights activist, Jaja Martins, pointed out that a poorly remunerated police personnel, who is constantly faced with family’s financial challenges, would certainly cut corners on his job.\nThe human rights activist said, ” Brutality, which is consequent upon extortion, occurs as a result of the government’s inability to properly take care of the welfare of police officers.”"
  },
  {
    "headline": "War: President Putin appoints General Dvornikov to lead war in Ukraine",
    "summarized_story": "President Vladimir Putin of Russia has named Army General Alexander Dvornikov as the new general in charge of the ongoing war in Ukraine, according to CNN.\nGeneral Dvornikov, who is said to have extensive combat experience, is expected to provide a level of coordination to the assault on Ukraine now focusing on the Donbas region.\nThe Army General, 60, according to CNN, was the first commander of Russia’s military operations in Syria.\nHe is said to have laid siege to rebel-held eastern Aleppo, Syria, bombarded densely populated neighbourhoods and caused major civilian casualties during his command in Syria.\nHe returned the city to Syrian government forces in December 2016."
  },
  {
    "headline": "NIN: Buhari given 72 hours ultimatum to unblock lines of 72 million Nigerians",
    "summarized_story": "Socio-Economic Rights and Accountability Project, SERAP, has given President Muhammadu Buhari a 72-hours ultimatum to reverse the decision to block the mobile lines of 72 million Nigerians.\nFollowing the directive, over 72 million subscribers have now been barred from making calls.\nHowever, SERAP said the decision to bar people from making calls was an infringement on the rights of expression of Nigerians.\n“Immediately reversing the decision would be in conformity with the Nigerian Constitution of 1999 [as amended], and Nigeria’s international human rights obligations.\nReversing the decision would also improve the confidence of the international community in human rights and the rule of law in Nigeria.”"
  },
  {
    "headline": "2023: Amaechi joins race as Osinbajo ends consultations",
    "summarized_story": "The number of All Progressives Congress (APC) presidential aspirants shot up by one yesterday after Transportation Minister Rotimi Amaechi formally declared his interest in the race.\nHe is expected to be followed any moment from now by Vice President Yemi Osinbajo who, sources said yesterday, has concluded consultations on his own aspiration.\nAmaechi had late last month said on Arise Television that he had no interest in the presidential race.\nIt is for this reason that some state governors have asked political appointees and other public servants aspiring for political offices in the 2023 general elections to quit immediately.\nRotimi Amaechi, who declared today (yesterday) in Port Harcourt, and all other appointees to do the needful by obeying the law."
  },
  {
    "headline": "JUST IN: Yinka Ayefele’s radio station robbed during live broadcast",
    "summarized_story": "JUST IN: Yinka Ayefele’s radio station robbed during live broadcastA three-man gang on Sunday morning robbed Fresh FM owned by popular musician Yinka Ayefele in Ibadan, capital of Oyo State.\nThe Nation learnt the robbers stormed the station during a live broadcast and dispossessed staff on duty of laptops, phones and other personal effects.\nRead Also: Gunmen rob six POS shops in RiversA staff, Kenny Ogunmiloro, confirmed the incident in a post on Twitter.\nHe tweeted: “Nowhere is safe again, not even radio stations are spared again in d porous level of insecurity in the country“My radio station was robbed by 3 armed men this morning around 6.15 am.\nPhones, laptops, ATM cards, and gadgets were taken away but no one was hurt."
  },
  {
    "headline": "I’m coming home soon, says Sunday Igboho",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo aka Sunday Igboho has assured supporters of his commitment to the Yoruba Nation struggle.\nHe noted that he enjoyed maximum freedom courtesy of Benin Republic President, Patrice Athanase Talon.\nRead Also: Sunday Igboho meets legal team in Benin Republic“I want to thank everyone, I want everyone to be calm.\nAsides from the judgement in Benin Republic, I’m coming to follow up with my judgement in Nigeria.\n“The people of Benin Republic ought to appreciate God for the kind of leader He has given them."
  },
  {
    "headline": "Nnamdi Kanu’ll be released in May, says Anglican Bishop",
    "summarized_story": "The Archbishop, Ecclesiastical Province of the Niger and Bishop, Diocese of Awka, Anambra State, Most Revd.\nAlexander Ibezim, on Saturday predicted that the detained leader of the Indigenous People of Biafra (IPOB), Mazi Nnamdi Kanu, will be released next month.\nIbezim spoke at the 2022 Awka Diocesan annual prayer convention themed: “This Mountain Shall Be Removed” held at the premises of Paul University, Awka, the Anambra State capital.\nWe shall witness fantastic testimony and we are making a declaration that wherever Nnamdi Kanu is, he will be released by this time next month.\nBy this time next month or anytime in the month of May, he will be released and there will be peace in eastern Nigeria and Anambra State."
  },
  {
    "headline": "Tunde Bakare joins 2023 presidential race",
    "summarized_story": "Serving Overseer of the Citadel Global Community Church (CGCC) formerly Latter Rain Assembly, Pastor Tunde Bakare, has joined the list of aspirants vying for the presidency in 2023.\nBakare declared this at a virtual meeting on Saturday.\nThe declaration is coming about six months after President Muhammadu Buhari received Bakare at the villa where his former running mate confided in him on his next political move.\nRead Also: Buhari knows my next political moves, says Tunde BakareBakare was Buhari’s running mate in the 2011 presidential elections under the Congress for Progressive Change (CPC).\nIn 2019 after casting his ballot, he had expressed his willingness to contest for the presidency after expiration of Buhari’s second term in 2023."
  },
  {
    "headline": "2023 presidency: Crack in PDP widens",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party (PDP) governors from the South have rejected proposal by the party to throw open the 2023 presidential contest to all qualified aspirants.\nThe governors after a meeting in Abuja on Friday night insisted that the PDP 2023 presidential ticket must be zoned to the South in the spirit of equity and fair play.\nThis followed the recommendation of the PDP committee on zoning headed by Benue State governor, Samuel Ortom, that the presidential ticket should be thrown open to all the qualified aspirants.\nAnyim, who spoke on behalf of the other aspirants, after a meeting, in Abuja said that their resolve to have a South Easterner as the PDP 2023 presidential candidate is based on equity, fair play and national unity.\nWe will work together to ensure that a South Easterner emerges as PDP flag bearer for 2023 presidential election."
  },
  {
    "headline": "2023: Amaechi declares to run for president",
    "summarized_story": "Chibuike Amaechi, has officially declared his intention to vie for the 2023 presidency, saying that his aspiration was not for personal interest.\nLalong stated that APC and Amaechi have a formidable structure to win any election in the state.\nMeanwhile, the Chairman of APC in Rivers State, Emeka Beke, in his address, stated that the mandate of the party had returned.\n“We want to thank God for the success of the congresses in the state.\nPeterside, in a statement issued by his media office, said the APC in Rivers State looked unstoppable in its goal of winning the presidential, governorship and all other elective positions in the state in 2023."
  },
  {
    "headline": "… Igbo in 19 northern states endorse Ngige",
    "summarized_story": "A meeting of Ndieze Igbo in the Diaspora and Igbo Delegate Assembly (IDA) comprising Igbo living in the 19 states of Northern Nigeria rose yesterday in Abuja, with a unanimous resolution to support the Minister of Labour and Employment, Senator Chris Nwabueze Ngige for the 2023 presidential race.\n“We know your antecedents the periods you served as governor of Anambra State and Senator of the Federal Republic of Nigeria.\nHe is one of the Igbo leaders that will call us whenever there is a problem in the North.\nThe party conscripted me to become governor in Anambra State.\nI didn’t do for Anambra alone, but for the entire Southeast.”Ngige recalled that his administration in Anambra State executed 105 road projects traversing the entire 21 local government areas of Anambra State and linking neighbouring states of Imo, Abia and Enugu."
  },
  {
    "headline": "APC primaries: I’m not afraid of Tinubu, Osinbajo, others –Yahaya Bello",
    "summarized_story": "Governor Yahaya Bello of Kogi State yesterday said that he was not afraid of other people jostling for the presidential ticket of the All Progressives Congress (APC), saying that he was confident of being the standard bearer of the ruling party.\nAmong the frontliners in the discuss around the 2023 presidency are former Governor of Lagos State and national leader of the APC, Asiwaju Bola Tinubu, Vice President Yemi Osinbajo, among others.\nBello full of optimism said that he was the most favoured to clinch the APC presidential ticket.\nI will say no; I am not scared of anybody in the contest for the APC presidential ticket.\nThe National Coordinator of the Yahaya Bello Presidential Campaign Council, Senator Jonathan Zwingina, said that the huge success of Governor Bello’s declaration ceremony had already sent shivers down the spines of others."
  },
  {
    "headline": "Kanu ‘ll be released next month – Archbishop Ibezim",
    "summarized_story": "From Obinna Odogwu, AwkaThe Archbishop, Ecclesiastical Province of the Niger, and Bishop of Awka Diocese, Most Revd.\nAlexander Ibezim, yesterday prophesied that the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, would be released next month.\nWe shall witness fantastic testimony and we are making a declaration that wherever Nnamdi Kanu is, he will be released by this time next month.\n“God will touch the leadership of Nigeria so that this calamity that is taking place in the South East will end.\nBy this time next month or anytime in the month of May, he will be released and there will be peace in Eastern Nigeria and Anambra State, especially."
  },
  {
    "headline": "Breaking: Amaechi Declares Intention to Run for Presidency",
    "summarized_story": "Blessing Ibunge in Port HarcourtThe Minister of Transportation, Rotimi Chibuike Amaechi, has officially declared his intention to run for the presidency of Nigeria on the platform of the All Progressives Congress (APC) in 2023.\nThe former Rivers State governor made the declaration Saturday (today) in Port Harcourt at a special thanksgiving service for the unity of the APC in the state and success of the party’s national convention.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Abducted Catholic Priest Regains Freedom in Niger",
    "summarized_story": "* Church pays N10m ramsomLaleye Dipo in MinnaA Catholic priest, Rev.\nLeo Raphael Ozigi, who was abducted by terrorists almost three weeks ago, has been set free.\nIt was gathered that the clergyman was released after the payment of N10 million by the Catholic Church in Minna.\nTHISDAY learnt that a high powered delegation was in Birningwari forest in Kaduna State to pay the ransom to the bandits Friday.\nEfforts to get the Catholic Archbishop of Minna Diocese, Martins Uzougwu, was abortive as his cell phone was switched off."
  },
  {
    "headline": "Search for Consensus Presidential Candidate in PDP Falters, Atiku Insists on Primary Election",
    "summarized_story": "The pro-consensus presidential aspirants had earlier met with Governor Seyi Makinde of Oyo State and Governor Ifeanyi Okowa of Delta State on the issue.\nA source close to the former vice president told THISDAY last night that Atiku would never be part of any consensus arrangement for the presidential ticket of the PDP.\nThe aspirants should be meeting and selling their ideas to delegates; not meeting over consensus candidate.\nWe need to save hapless Nigerians from this unnecessary distraction.”Another PDP Presidential aspirant, Mazi Sam Ohuabunwa questioned the principles that would govern the choice of a consensus presidential candidate being promoted.\nPeriod.”Meeting with Makinde, OkowaAt the PDP pro-consensus presidential aspirants meeting with Makinde, the governor said the party would work to ensure the success of a consensus presidential candidate arrangement for the PDP."
  },
  {
    "headline": "Court: Nnamdi Kanu Must Stand Trial on 7 Terrorism Charges",
    "summarized_story": "*Refuses to acquit, discharge him, strikes out 8 other counts, to rule on bail application May 18Alex Enumah in AbujaJustice Binta Nyako of a Federal High Court, Abuja yesterday ordered the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu to stand trial on only seven of the 15-count alleged terrorism charges against him.\n“Counts 1, 2, 3, 4, 5, 8 and 15 show some allegations, which the defendant has to answer.“The court shall proceed to try the defendant on those counts.”By the ruling, Kanu would now stand trial on counts 1, 2, 3, 4, 5, 8 and 15, which the court believes he needs to respond to.\nMeanwhile, the court has fixed May 18 to deliver ruling in Kanu’s application for bail.The court fixed the date after listening to arguments for and against granting the application.\nKanu’s lead counsel, Chief Mike Ozekhome, SAN, in moving the bail application said: “Until a person is tried and convicted, he should be allowed to walk free.”He reminded the court that a defendant ought to enjoy the presumption of innocence until proven guilty.\nAfter he was repatriated and arraigned, he pleaded not guilty to the 15-count amended charges bordering on alleged treasonable felony and asked the court to quash the charges for being defective and baseless, adding that the court lacked the jurisdiction to try him based on those charges."
  },
  {
    "headline": "Emefiele: InfraCo to Unlock N8 trillion Pension Funds’ Assets for Deployment to Bankable Infrastructure Projects Across Nigeria",
    "summarized_story": "*Signs terms sheet with four asset managersNume EkegheThe Governor of the Central Bank of Nigeria, Mr. Godwin Emefiele yesterday announced that the Infrastructure Corporation of Nigeria (InfraCo) would unlock N8 trillion of pension funds’ assets to be deployed into bankable infrastructure projects across Nigeria.\nInfracorp is being promoted by the Africa Finance Corporation (AFC) and the Nigerian Sovereign Investment Authority, with KPMG as transaction advisers.\nI understand from the last count that the size of Nigeria pension fund is over N13 trillion.\nI am told that in another three to five years, Nigerian pension assets would rise to almost N20 trillion to N25 trillion.\nHe added: “Upon signing the terms sheet today, we will go straight into execution mode because Nigeria very badly needs to develop its infrastructure."
  },
  {
    "headline": "VIDEO: 45MVA Transformer Destroyed As Fire Breaks Out At Apo Transmission Substation",
    "summarized_story": "There was a fire incident at the 132/33 kilovolts (kV) Apo transmission substation in Abuja on Sunday afternoon, resulting in the destruction of a 45MVA transformer.\nThe substation is operated by the transmission Company of Nigeria (TCN).\nConfirming the incident, the Abuja Electricity Distribution Company (AEDC), which feeds directly from the substation to supply the end users, said the fire had been brought under control.\n“Our technical team is right now working with the TCN engineers to see how to absorb the load on the 45MVA transformer that was affected by the fire,” AEDC said in a statement.\nBabatunde Fashola, Minister of Power, Works and Housing, also confirmed the tragedy, saying the fire had been extinguished, with plans underway to redistribute power to communities served by the burnt transformer."
  },
  {
    "headline": "VIDEO: 45MVA Transformer Destroyed As Fire Breaks Out At Apo Transmission Substation",
    "summarized_story": "There was a fire incident at the 132/33 kilovolts (kV) Apo transmission substation in Abuja on Sunday afternoon, resulting in the destruction of a 45MVA transformer.\nThe substation is operated by the transmission Company of Nigeria (TCN).\nConfirming the incident, the Abuja Electricity Distribution Company (AEDC), which feeds directly from the substation to supply the end users, said the fire had been brought under control.\n“Our technical team is right now working with the TCN engineers to see how to absorb the load on the 45MVA transformer that was affected by the fire,” AEDC said in a statement.\nBabatunde Fashola, Minister of Power, Works and Housing, also confirmed the tragedy, saying the fire had been extinguished, with plans underway to redistribute power to communities served by the burnt transformer."
  },
  {
    "headline": "'Private NEPA' — Subsistence Electricity Sharing Centres On The Rise In Bayelsa Due To Persistent Blackouts",
    "summarized_story": "New local power distribution centres colloquially called 'Private NPEA' are emerging in Yenagoa, the Bayelsa State capital, to solve the persistent power outage and blackout in most areas in the state.\nNEPA, in full the National Electric Power Authority (NEPA), is the defunct organisation that governed the use of electricity in Nigeria.\nOthers have even taken to town criers to urge residents not to pay any bill brought to them by the power distribution company.\nThe patronage of these local power distribution companies is rising by the day, with small business operators and private resident owners struggling to be connected.\nA man, who identified himself as James, told SaharaReporters that he patronises the local distribution company known as 'private NEPA' in his area due to the convenience."
  },
  {
    "headline": "'Private NEPA' — Subsistence Electricity Sharing Centres On The Rise In Bayelsa Due To Persistent Blackouts",
    "summarized_story": "New local power distribution centres colloquially called 'Private NPEA' are emerging in Yenagoa, the Bayelsa State capital, to solve the persistent power outage and blackout in most areas in the state.\nNEPA, in full the National Electric Power Authority (NEPA), is the defunct organisation that governed the use of electricity in Nigeria.\nOthers have even taken to town criers to urge residents not to pay any bill brought to them by the power distribution company.\nThe patronage of these local power distribution companies is rising by the day, with small business operators and private resident owners struggling to be connected.\nA man, who identified himself as James, told SaharaReporters that he patronises the local distribution company known as 'private NEPA' in his area due to the convenience."
  },
  {
    "headline": "'Private NEPA' — Subsistence Electricity Sharing Centres On The Rise In Bayelsa Due To Persistent Blackouts",
    "summarized_story": "New local power distribution centres colloquially called 'Private NPEA' are emerging in Yenagoa, the Bayelsa State capital, to solve the persistent power outage and blackout in most areas in the state.\nNEPA, in full the National Electric Power Authority (NEPA), is the defunct organisation that governed the use of electricity in Nigeria.\nOthers have even taken to town criers to urge residents not to pay any bill brought to them by the power distribution company.\nThe patronage of these local power distribution companies is rising by the day, with small business operators and private resident owners struggling to be connected.\nA man, who identified himself as James, told SaharaReporters that he patronises the local distribution company known as 'private NEPA' in his area due to the convenience."
  },
  {
    "headline": "Joint task force kills 18 'ISWAP fighters' around Lake Chad",
    "summarized_story": "Troops of the multinational joint task force have killed 18 suspected members of Islamic State in West Africa Province (ISWAP) around the Lake Chad.\nThe task force is made up of soldiers from Nigeria, Niger and Cameroon.\nThe killing of the suspected terrorists in the early hours of April 3 followed a week-long clearance operations.\nAdvertisementApart from killing the suspected ISWAP members, the troops destroyed gun trucks and recovered weapons.\n“Both the Force Commander MNJTF and the Theatre Commander Operation Hadin Kai have commended the troops and urge them to remain steadfast and dogged.”"
  },
  {
    "headline": "Joint task force kills 18 'ISWAP fighters' around Lake Chad",
    "summarized_story": "Troops of the multinational joint task force have killed 18 suspected members of Islamic State in West Africa Province (ISWAP) around the Lake Chad.\nThe task force is made up of soldiers from Nigeria, Niger and Cameroon.\nThe killing of the suspected terrorists in the early hours of April 3 followed a week-long clearance operations.\nAdvertisementApart from killing the suspected ISWAP members, the troops destroyed gun trucks and recovered weapons.\n“Both the Force Commander MNJTF and the Theatre Commander Operation Hadin Kai have commended the troops and urge them to remain steadfast and dogged.”"
  },
  {
    "headline": "Robbers attack Yinka Ayefele's radio station during live broadcast in Ibadan",
    "summarized_story": "The Ibadan office of Yinka Ayefele’s Fresh FM radio station was attacked on Sunday by three armed robbers, causing the station to go off air for a while.\nTheCable learnt that the robbers broke in while a gospel programme was on.\n“Three armed robbers came just after 6am while the gospel tune programme hosted by Agboola Babatunmise was on,” a witness said.\nThey took all our mobile telephones and laptops computers.\nThank God no life was lost in the attack.”A staff member of the radio station said one of the computers stolen contains files for a planned television station which also belongs to Ayefele."
  },
  {
    "headline": "Robbers attack Yinka Ayefele's radio station during live broadcast in Ibadan",
    "summarized_story": "The Ibadan office of Yinka Ayefele’s Fresh FM radio station was attacked on Sunday by three armed robbers, causing the station to go off air for a while.\nTheCable learnt that the robbers broke in while a gospel programme was on.\n“Three armed robbers came just after 6am while the gospel tune programme hosted by Agboola Babatunmise was on,” a witness said.\nThey took all our mobile telephones and laptops computers.\nThank God no life was lost in the attack.”A staff member of the radio station said one of the computers stolen contains files for a planned television station which also belongs to Ayefele."
  },
  {
    "headline": "Ohanaeze to Buhari: Have mercy on Nnamdi Kanu",
    "summarized_story": "George Obiozor, president-general of Ohanaeze Ndigbo, has asked President Muhammadu Buhari to use his prerogative of mercy on Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), and other Igbo youths in detention across the country.\nAdvertisement“We highly recommend that the federal as well as state governments engage the restive Igbo youths in some form of dialogue towards the peaceful resolution of the present crisis,” the president-general said.\n“In this context, we equally appeal to President Muhammadu Buhari to exercise his prerogative of mercy for Mazi Nnamdi Kanu and other Igbo youths in detention in various places.”Obiozor asked IPOB to embrace peace and end its sit-at-home order, adding that the people in the south-east region are suffering as a result of it.\nAdvertisement“We equally urge them to lift the sit-at-home order to restore normalcy in the south-east,” he said.\nSit-at-home is not a favour to Ndigbo but condemnation of these countless millions of daily income earners to untold hardship.”"
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Can Hytch succeed where GoMyWay failed?",
    "summarized_story": "At the end of October 2018, the Nigerian ride-sharing platform GoMyWay ceased to exist after operating for about 4 years.\nGet the best African tech newsletters in your inboxLike GoMyWay, Hytch has also begun to ramp up users.\nGoMyWay, before it went into oblivion, had said it had over 12,000 users and had completed 106,630 rides across 16 states in Nigeria.\nFor Hytch, the opposite is the case as they want to make money as they go, and are already doing so.\nGoMyWay and others like Ridebliss, another local carpooling service that’ve since failed, are great learning references for Hytch."
  },
  {
    "headline": "Visa opens its first African innovation Studio in Kenya",
    "summarized_story": "Global payments company Visa has opened a new Innovation Studio in Nairobi, Kenya.\nThis facility will serve the sub-Saharan Africa region and joins a network of innovation centers operated by Visa since 2016, in cities including London, Dubai and Singapore.\nAida Diarra, Senior vice president and head of Visa in Sub-Saharan Africa, said the studio will assist in increasing the Visa market in the region by issuing digital and physical Visa to its clients.\nA photo of the corner fabrics section at the Visa Innovation studio in Nairobi“As a brand built on technology, Visa has driven the major technology advancements that make electronic payments what they are today.\nThe launch of Visa’s first African innovation studio and others serves as a boost to the African tech ecosystem as it’ll encourage the creation, development, and implementation of novel ideas."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Is the NIN-SIM linkage deadline extension really over?",
    "summarized_story": "While you’re thinking about it, here’s what I’ll be discussing today:NIN-SIM linkage deadline extensionImaliPay’s $3 million seedFolklore Group’s shift to B2BUnrelated, but an update is needed.\nIs the NIN-SIM linkage deadline extension really over?\nWhat appeared to be an order that would never be carried out due to its deadline extension is now in effect.\nAdvertisementPer the minister, the March 31, 2022 extension was granted in response to requests from stakeholders, including citizens, legal residents, and Nigerians in the diaspora.\nAs the famous phrase goes, “everything that has a beginning has an ending.” I think we might have come to the end of the SIM-NIN-linkage deadline extension."
  },
  {
    "headline": "How to validate your NIN and avoid crowds",
    "summarized_story": "Share this article:Today’s edition of Techpoint Africa Podcast features the Nigerian government following through with two of its threats.\nWe discussed what Nigerians are currently facing as millions of lines have been barred for not linking to NIN.\nFrom our Senior Reporter, Olwanifemi Kolawole getting flogged to NIMC officials abandoning crowds to people looking to gain full control of their SIMs.\nThree banks have flouted that directive and have been slammed with an ₦800 million ($1.9 million) fine.\nYou can catch up on everything we discussed on Apple Podcasts, Google Podcasts, Spotify, or wherever you get your podcasts."
  },
  {
    "headline": "NIN-SIM linkage: Worrying scenes at NIMC office, as Nigerian telcos block defaulting subscribers",
    "summarized_story": "In December 2020, the Nigerian Communications Commission (NCC) ordered all mobile subscribers to link their NINs to their SIM cards.\nHowever, going by the unhappy crowd at NIMC’s office, the prospect of a NIN-SIM linkage could still be a long way off for some people.\nMembers of the Nigeria Security and Civil Defence Corps (NSCDC) were on the ground to disperse the crowd.\nUsing forceful methods for crowd control, the Civil Defence Corps flogged Nigerians in the crowd.\nAn NSCDC member using a whip on Techpoint journalistUnnecessary NIN-SIM linkage crowdsA lady at the scene confirmed that her SIM had been banned from making calls."
  },
  {
    "headline": "2023: Tunde Bakare declares for president",
    "summarized_story": "Tunde Bakare, Serving Overseer of the Citadel Global Community Church formerly known as Latter Rain Assembly, on Saturday, declared his ambition to run for president in 2023, saying he remains the best suitable candidate to address Nigeria’s problems.\nBakare said this at the virtual meeting:Unveiling Project 16 to Nigerians in diaspora, with the theme: “The portrait of a new Nigeria,” organized by the PTB4Nigeria diaspora group.\nThe cleric warned that ahead of the 2023 general elections, the South is being set against the North, while Christians are set against Muslims.\nRead also: 2023: Amaechi declares for presidency (VIDEO)He, however, said he remains the rallying point to restore order in the country.\nAccording to him, “The PTB brand is a rallying point for all Nigerians."
  },
  {
    "headline": "Edo Para-Powerlifters arrives Abuja as Maiden National Para Games Begins …Team Edo Promises Better Outing – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo state para-powerlifting contingent yesterday arrived Abuja ahead of the commencement of the maiden edition of National Para Games tagged “Abuja 2022”The state contingent which is made up of fourteen (14) para-powerlifters, coaches departed the Samuel Ogbemudia Stadium,.\nBenin City yesterday with with the readiness to doing Edo proud in the national championship.\nIn a telephone chat, the State Para-Powerlifting Coach and leader of the Edo State contingent, Mrs. Patience Igbiti, expressed optimism that her para-powerlifters are going for the number one spot in para-powerlifting event at the championship.\nShe disclosed that the athletes who have been engaging in intense training for the past two weeks are charged and ready to bring more laurels to the Edo state government.\nThe first female para-powerlifting Coach in Nigeria and Africa commended the Edo state government for the support towards the athletes and further appeal for more supports from the government and other stakeholders in the state."
  },
  {
    "headline": "Edo Shippers Association condemns Collections of Money from Importers on the Lagos-Benin Highways – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Shippers Association has frowned at the indiscriminate multi-taxes paid by importers on the Lagos-Benin highway to custom officials and they have called on the Ministry of Interior and Presidency to address the challenges being faced by their members.\nThe Association made the appeal during their first general meeting held at the Nigeria Shippers Council Area Office in Benin City recently.\nThe President of the Edo Shippers Association, Pastor Ade Balogun who disclosed the decision of the Association said after the clearance by the Customs in Lagos, it is not ideal for those on the highway to demand for money from the importers.\nThe first general meeting of the Edo Shippers Association discussed amongst others, the review and adoption of the constitution, Cooperative Society registration and proposed workshop on freight forwarding to be held soon.\nThe meeting was attended by various professionals, key players in the maritime industry and the Area officer of the Nigeria Shippers Council, Bafor Okitipi and the Vice President of the Edo Shippers Association, Dr. B.J BraieShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo begins process of forest allocation to timber concessionaires – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the process of forest allocation to prospective timber concessionaires in the state as part of efforts to reopen the state’s forest.\nChairman Forestry Commission, Edward Obiaw, in a statement, urged interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors to pick forest allocation application forms at the Edo State Ministry of Environment and Sustainability.\nThe statement reads: “It is hereby announced for the information of the general public that as part of the process to lift the ban on forest exploitation in the state, the Edo State Government is hereby requesting all interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors that application forms for forest allocation are available at the Ministry of Environment and Sustainability, Room 17, Ist Floor, Palm House, Sapele Road, Benin City with a treasury receipt of payment of a non-refundable application fee of N200,000 (Two Hundred Thousand Naira).\n“All completed application forms are to be addressed and submitted to the Chairman, Forestry Commission within two weeks of this announcement.”Recall that the government had announced the prohibition of all forms of timber exploitation from Tuesday 31st August, 2021, following the expiration of the three-year circle of 2018/2021 Forest Allocation in the state.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo community head, motorists calls for speedy completion of road rehabilitation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOza – Motorists and other road users plying the Evbuobanosa-Iru-Oza-Igbanke road in Orhionmwon local government area of Edo state have called on the contracting firm handling ongoing rehabilitation work on the road to speedily complete the project.\nAccording to the traditional head (Odionza) of Oza community, Chief Amadin Idehen, the rehabilitation has been going on smoothly before the construction firm stopped work recently.\n“They started well initially; suddenly they just abandoned the job”, the Odionza told The Nigerian Observer.\nBut, a source who understands the contractual agreements between the federal government and the firm handling the rehabilitation project attributed the stoppage of work to lack of funds.\n“When you award a contract, you first release 25 percent especially on road projects to start work."
  },
  {
    "headline": "2023: Southeast PDP presidential aspirants resolve to work together",
    "summarized_story": "People’s Democratic Party (PDP) presidential aspirants from the southeast geopolitical zone, today, met in Abuja and agreed to work together to ensure that the zone secures the party’s presidential ticket ahead of 2023 election.\nWe had a very fruitful meeting in an atmosphere of friendliness and respect for one another.\n“At the end of our meeting, we addressed the media on our resolutions as follows:1) That we have agreed to work together as a Team.\nWe ask Nigerians to give us the chance to fix this country.\nTogether we will get Nigeria to work again.”"
  },
  {
    "headline": "Soludo swears in 20 commissioners in Anambra",
    "summarized_story": "Anambra State governor, Prof. Charles Soludo, has sworn in 20 commissioner nominees cleared by the state house of assembly.\nThe state house of assembly had on Friday, confirmed the nominees.\nHe also announced that the 21st nominee would be sworn-in next week after being cleared by the state assembly.\n“This is the third week since I was sworn in as the Governor of Anambra State.\n“This is happening on a Saturday, unusually so because the business of Anambra under my watch can be carried out 24/7."
  },
  {
    "headline": "BREAKING: Rotimi Amaechi declares for president",
    "summarized_story": "Rotimi Amaechi, minister of transportation, on Saturday, declared his intention to run for president in the 2023 general election.\nAmaechi, a former governor of Rivers State, made his intention known at the Adokiye Amiesimaka Stadium, Rivers, during the All Progressives Congress (APC) thanksgiving.\nHe said, “I stand before you today to declare my intention and submit my application to serve as your next President.”"
  },
  {
    "headline": "Shareholders applause Custodian Investment for improved performances",
    "summarized_story": "The Chairman of Custodian Investment Plc, Dr. Omobola Johnson, has said that despite economic conditions that characterised the 2021 financial year, the company successfully grew its revenue by 14 percent for the year ended December 31, 2021.\nThe chairman stated this while addressing shareholders at the 27th yearly general meeting of the company in Lagos over the weekend.\nMr. Adebayo Adeleke, who also commended the company’s financial performance, remarked that since 2008, Custodian Investment Plc has never failed to pay interim dividend.\nCustodian Investment was incorporated on August 22, 1991, as a private limited liability company under the name, Accident and General Insurance Company Limited.\nFollowing a special resolution, the company’s name was changed to Custodian Investment Plc by the Corporate Affairs Commission on May 24, 2018."
  },
  {
    "headline": "Institute Advocates Quality Assurance In Implementation For MDIs",
    "summarized_story": "The West African Management Development Institutes Network (WAMDEVIN), has called for the entrenchment of quality assurance programme design and implementation in Management Development Institutes (MDls) in West Africa by their chief executive officers.\nSpeaking during a webinar series with the theme: Enhancing Quality Assurance in programme design and implementation for chief executives and top management staff of MDIs, WAMDEVIN President, Prof. Alexander Yonly said by doing this, it would help the executive officers to put in place strategies for continuous quality in programmes and also establish guidelines for quality related information system in all programmes.\nRepresented by the Executive Secretary, Dr. Kolawole Olowe, Yonly said without any iota of doubt, the 21st Century demands that the MDls need to constantly engage the best practices in total quality management so as to adequately position themselves to become useful and relevant think-tanks to their various governments expecting the MDIs to deliver maximally.\nMrs. Patricia Ivbijaro-Erinfolami; a United Kingdom based consultant, noted that when establishing a viable quality system, the CEOs and senior management staff should define roles to be played by groups, and that a strategic quality system requires open communication and genuine commitment to the attainment of the goals of the organisation.\nShe stated further that in addition to establishing priorities and providing resources to accomplish required activities, management must lead by example in all aspects of Learning, Training and Development (LTD)."
  },
  {
    "headline": "Court Jails Baron 6 Years For Drug Trafficking",
    "summarized_story": "Justice Ayokunle Faji of the Federal High Court has convicted and sentenced a drug baron, Chimezie Aniede to six years imprisonment for attempting to export 7.1 Kilograms of a banned substance, Methamphetamine, to Madrid, Spain’s capital.\nJustice Faji jailed Aniede after he pleaded guilty to a one-count charge of unlawful exportation of the said banned substance.\nIbrahim had maintained that the offence was contrary to and punishable under Section 11(b) of the National Drug Law Enforcement Agency Act, Cap.\nN30, Laws of the Federation Of Nigeria, 2004,The convict had initially pleaded not guilty to the charge when he was first arraigned before the court sometime in 2021.\nBased on the development, Justice Faji adjourned the case to Friday to enable the prosecutor to review the facts of the case."
  },
  {
    "headline": "Nigerian Navy, EU Synergy Enhancing Maritime Affairs – Gambo – Leadership News",
    "summarized_story": "The Chief of Naval Staff, Vice Admiral Awwal Zubairu Gambo has said the collaborative efforts between the Nigerian Navy and the European Union is enhancing international maritime affairs.\n“The Gulf of Guinea itself is a vast and diverse region stretching from Senegal to Angola covering approximately 2,874nm of coastline.\n“Regrettably, piracy, armed robbery at sea, kidnapping of seafarers, illegal unreported and unregulated fishing, smuggling, trafficking and transnational organized crimes pose a major threat to maritime security in the Gulf of Guinea,” Gambo said.\nAccording to him, “Maritime insecurity has long been one of the most persistent and intractable threats to maritime communities and economic prosperity in West Africa.\nImportantly, concerted efforts in the form of synergy should be maintained to curb these maritime crimes."
  },
  {
    "headline": "Nigerian Navy, EU Synergy Enhancing Maritime Affairs – Gambo – Leadership News",
    "summarized_story": "The Chief of Naval Staff, Vice Admiral Awwal Zubairu Gambo has said the collaborative efforts between the Nigerian Navy and the European Union is enhancing international maritime affairs.\n“The Gulf of Guinea itself is a vast and diverse region stretching from Senegal to Angola covering approximately 2,874nm of coastline.\n“Regrettably, piracy, armed robbery at sea, kidnapping of seafarers, illegal unreported and unregulated fishing, smuggling, trafficking and transnational organized crimes pose a major threat to maritime security in the Gulf of Guinea,” Gambo said.\nAccording to him, “Maritime insecurity has long been one of the most persistent and intractable threats to maritime communities and economic prosperity in West Africa.\nImportantly, concerted efforts in the form of synergy should be maintained to curb these maritime crimes."
  },
  {
    "headline": "Oyo Threatens To Demote Principals, Teachers Over Examination Malpractices",
    "summarized_story": "Oyo State government has threatened to henceforth demote and penalise principals and teachers fingered in any form of examination malpractices and falsification of documents by the West African Examination Council (WAEC).\nHe vowed that if found culpable of such offences, the headship of such schools would be made to face the full wrath of the law.\nAccording to him, the state government under the leadership of Engineer Seyi Makinde, would not compromise hard-work for dishonesty.\nHe emphasized that the present government is putting everything alright in the education sector of the state, through provision of funds, regular payment of salaries, arrears and promotions.\nRepresented by the Commission’s Permanent Secretary, Mrs Bisi Oderinde, the chairman stated that any principal or teacher found culpable would be demoted coupled with other serial sanctions."
  },
  {
    "headline": "Uchenna from Sao Paulo busted with 101 parcels of cocaine hidden in duvets [Video]",
    "summarized_story": "At least 101 parcels of cocaine concealed in eight children duvets have been intercepted by operatives of the National Drug Law Enforcement Agency, NDLEA, at the Murtala Muhammed International Airport, Ikeja, Lagos.\nThe illicit drug was brought into the country by a 52-year-old Brazilian returnee, Akudirinwa Hilary Uchenna.\nUchenna hails from Oru East Local Government area of Imo state, according to Femi Babafemi, NDLEA spokesman.\nThe 101 parcels of the class A drug with a gross weight of 13.2 kilogram were recovered from his only check-in bag.\nDuring preliminary interview, Uchenna who claimed to be a carpenter confessed that he was to be paid N5million for trafficking the drug after successfully delivering the consignment in Lagos."
  },
  {
    "headline": "NDLEA arrests Ezekwesili, others with drugs in detergent, Milo sachets",
    "summarized_story": "A 37-year-old Ezekwesili brought in big pellets of skunk concealed in detergent containers.\nThey arrived aboard Ethiopian Airline flight from Johannesburg, South Africa via Addis Ababa, Ethiopia, said NDLEA spokesman Femi Babafemi.\nEzekwesili is from Awka south local government area of Anambra state.\nIn Zamfara state, one Chibuzor Uba, 30, was arrested on Friday 8th April with 1,955 ampules of pentazocine at Kaura Namoda area of Zamfara state.\nSkuchies are usually a mixture of Tramadol, Cannabis sativa, Codeine, Black Currant (popularly called Zobo) and water."
  },
  {
    "headline": "NIN-SIM: Blocking 72 Million Telephone Lines Unlawful, SERAP Tells Buhari",
    "summarized_story": "to instruct Isa Pantami, Minister of Communication and Digital Economy, and the Nigerian Communications Commission to “immediately reverse the apparently unlawful decision” to prevent over 72 million active telecommunication subscribers from making calls on their SIM cards.\nOver 72 million users were prevented from making calls as a result of the directive.\nThe letter read in part, “Access to telecommunications services is a condition sine qua non for the effective exercise of human rights.\nTherefore, the decision to block people from making calls is discriminatory, and a travesty.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions in the public interest to ensure full compliance with human rights standards."
  },
  {
    "headline": "Court Will Grant Nnamdi Kanu Bail By May 18 –IPOB Leader’s Lawyer, Ejimakor",
    "summarized_story": "Court Will Grant Nnamdi Kanu Bail By May 18 –IPOB Leader’s Lawyer, EjimakorNnamdi Kanu, the leader of the Indigenous People of Biafra, will be granted bail on May 18, 2022, according to Aloy Ejimakor, his Special Counsel.\nEjimakor was responding to a judgement by an Abuja Federal High Court yesterday that dismissed eight of Kanu’s 15-count accusations.\nThe eight-count case was dismissed by Justice Binta Nyako because the proof of evidence did not link Kanu to the charges.\nThe judge ruled on a preliminary objection submitted by the Biafran leader to all of the allegations.\nThe judge ruled, “The court shall proceed to try the defendant on those counts.”The judge set a hearing for Kanu’s bail application for May 18, 2022, as a result of the ruling."
  },
  {
    "headline": "Invasion of Ukraine: Some Nigerians Would Rather Be in Prison in Poland Than Return Home Says NiDCOM Chairman, Abike-Dabiri",
    "summarized_story": "Invasion of Ukraine: Some Nigerians Would Rather Be in Prison in Poland Than Return Home Says NiDCOM Chairman, Abike-DabiriWhile denouncing Poland for holding Nigerians and other African students fleeing Ukraine, Abike Dabiri-Erewa, Chairman and Chief Executive Officer of the Nigerians in Diaspora Commission, said Nigerians imprisoned in Poland were warned of the consequences.\nWhile the evacuation process was underway, Dabiri-Erewa stated that the students had been warned that they could be detained.\n“They’ve been warned,” Dabiri-Erewa wrote on Twitter.\nThe Federal Government began evacuating Nigerians, particularly students, who had fled Ukraine to neighboring countries such as Poland as a result of the conflict in March.\nThe Polish government stated that food were delivered at border crossings, transportation was provided, and local government agencies offered assistance."
  },
  {
    "headline": "BREAKING: Amaechi, the Transport Minister, has declared his candidacy for the presidency of Nigeria in 2023.",
    "summarized_story": "BREAKING: Amaechi, the Transport Minister, has declared his candidacy for the presidency of Nigeria in 2023.\nRotimi Amaechi, Nigeria’s Minister of Transportation and former governor of Rivers State, has confirmed his candidacy for president in 2023.\nOn Saturday, he made this statement during the All Progressives Congress Rivers State Thanksgiving Service in Port Harcourt.\n“I stand before you now to declare my intention and submit my application to be your future President,” he declared to applause.\nAt the ceremony, former National Chairman Adams Oshiomhole, Victor Giadom, Senator Ali Ndume, and other key party figures were present."
  },
  {
    "headline": "Official: Pastor Tunde Bakare joins 2023 presidential race",
    "summarized_story": "Popular Pastor and politician Tunde Bakare has officially declared interest to be President come 2023.\n“This brings me to the brand, PTB.\nPTB is currently an acronym for Pastor ‘Tunde Bakare.\nThe PTB brand is the rallying point for ‘Project 16.’“Nevertheless, Project 16 is not just about me.\nWhat I do have is a vision of a New Nigeria that was birthed in me from childhood and an honest aspiration to serve as the sixteenth president of my beloved nation, Nigeria.”"
  },
  {
    "headline": "#Live: Macron faces stem test as France votes in presidential election",
    "summarized_story": "French voters go to the polls on Sunday in the opening round of a presidential race that could become a cliffhanger.\nEmmanuel Macron has a fight on his hands from far-right challenger Marine Le Pen, who has been galvanised by a slick election campaign.\nThe president spent little time on the race, focusing instead on Europe’s reaction to Russia’s war in Ukraine.\nOne issue more than any other has predominated this election: the spiralling cost of living in energy bills and shopping baskets.\nNow, the main challenge to Mr Macron, 44, is coming from Ms Le Pen, 53, on the far right and Jean-Luc Mélenchon, 70, on the far left."
  },
  {
    "headline": "Breaking: Pakistan’s Prime Minister, Imran Khan, removed",
    "summarized_story": "Pakistan’s Prime Minister Imran Khan has been ousted from power after losing a no-confidence vote in his leadership.\nMr Khan becomes the first Pakistani prime minister to be ousted by a no-confidence vote.\nThe former captain of Pakistan’s national cricket team was elected prime minister in 2018, and promised to fight corruption and fix the economy.\nMr Khan has repeatedly said that Pakistan’s opposition parties are working with foreign powers.\nThe US has said there was “no truth” in these allegations, and Mr Khan has never provided any evidence."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Soludo declares Monday, a prayer session to counter IPOB sit-at-home order – NigPilot",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has urged the people of the state to observe a one-day prayer session on Monday, to curb the activities of the gunmen terrorising the state and the South East region in general.\nThe governor said the prayer session slated to hold on Monday, April 4, 2022, at churches and other religious worshipping centres across the state was necessary to counter the evil attached to the Indigenous People of Biafra, IPOB sit-at-home order.\nHe explained that the prayer session would be against those hiding under the IPOB name to cause havoc in the state.\n“I enjoin you to pause and join in fellowship as we seek the face of God.It is expected that the conclusion of the prayer session shall mark the end of Sit At Home in Anambra State” Soludo declared.\n” We shall empower them to become useful to their families, communities, state, region and the society at large."
  },
  {
    "headline": "Christians Mark Palm Sunday Across The World",
    "summarized_story": "Christians across Nigeria and the world are marking Palm Sunday, signalling the beginning of the Holy Week.\nThe event is recounted in each of the four canonical gospels of Matthew, Mark, Luke, and John.\nThe palm branches, for most Christians, signify goodness and victory.\nIn his message, Pope Francis called for an Easter truce in Ukraine to pave the way for peace through “real negotiations”.\n“Let the Easter truce begin."
  },
  {
    "headline": "SERAP Gives FG 48-Hour Ultimatum To Unblock Millions Of Unregistered SIMs",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has issued a 48-hour ultimatum to the Federal Government to unblock millions of unregistered lines.\nJust last week, the Federal Government directed telecommunication companies in the country to bar all outgoing calls on unlinked lines from Monday, April 4, 2022.\nUnlinked lines are Subscriber Identity Modules (SIMS) not yet registered and linked with the National Identification Number (NIN) by users.\nIt infringes their rights to freedom of expression and family life, as well as socio-economic rights,” SERAP deputy director Kolawole Oluwadare said.\n“Immediately reversing the decision would be in conformity with the Nigerian Constitution of 1999 [as amended], and Nigeria’s international human rights obligations."
  },
  {
    "headline": "UPDATED: Rotimi Amaechi Declares To Contest For President In 2023",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi, has announced his interest to contest the presidential election in 2023.\nAmaechi was giving a speech titled, ‘Forward With Courage’ at a thanksgiving service held at the Adokiye Amiesimaka Stadium in the Rivers State capital.\n“Eight years before that, I served as governor of Rivers State; in the preceding eight years before that, I was Speaker of the Rivers State House of Assembly.\nWith his declaration, Amaechi is expected to vie for the APC presidential ticket alongside former Lagos State Governor, Bola Tinubu; Governor David Umahi of Ebonyi State, and Governor Yahaya Bello of Kogi State, among others at the party’s primary.\nIn the preceding eight years before that, I was Speaker of the Rivers State House of Assembly."
  },
  {
    "headline": "Bandits Kill Two, Burn Several Houses, Church In Fresh Kaduna Village Attack",
    "summarized_story": "Bandits have attacked Adei village of Kutura station , in Tantatu ward of Kajuru local government area of Kaduna state, killing two indigenes of the community and burning down houses.\nOne of the male victims had his head and hands chopped off after he was killed by the bandits during the attack.\nHe said that the bandits later returned in Adei community also under Kutura station on Friday afternoon, and carried similar attack, and in the process , shot two persons to death.\nREAD ALSO: New Kaduna Police Commissioner Resumes, Tours Abuja-Kaduna HighwayOver 30 houses and a church of the Evangelical Church Winning All (ECWA) were also set ablaze during the attack, with residents fleeing the community.\nKajuru local government, located in the Central Senatorial Zone of Kaduna State has been facing security issues ranging from banditry to communal clashes between the Fulanis and the Adara natives."
  },
  {
    "headline": "Palm Sunday: Pope Calls For ‘Easter Ceasefire’ In Ukraine",
    "summarized_story": "Pope Francis on Sunday called for an Easter ceasefire in Ukraine to pave the way for peace through “real negotiation”.\n“Let the Easter truce begin.\n— a truce that will lead to peace, through real negotiation,” he told a public mass at Saint Peter’s Square.\nREAD ALSO: Ukraine War Pushes World Food Prices To Record HighHe has also expressed his willingness to contribute to halting the fighting in Ukraine and said he would be ready to travel to Kyiv.\nRussia has denied responsibility for the apparent killings of civilians in Bucha, accusing Ukraine of staging them."
  },
  {
    "headline": "Nigeria's challenges can only be solved by group of genuine minded persons",
    "summarized_story": "A Presidential aspirant, Christopher Imumolen has declared that Nigeria’s challenges cannot be solved alone by an individual; but by a group of genuine minded persons.\nHe made this known in a chat with newsmen shortly after a closed door meeting with Nigeria’s former president, Olusegun Obasanjo in Abeokuta the Ogun state capital.\nHe noted that the visit became imperative to tap from the former president’s wealth of experience; with a pledge to help solve Nigeria’s challenges.\nThe Presidential aspirant said he will be bringing his private sector expertise to bear."
  },
  {
    "headline": "2023 Presidency: Group advocates for zoning to South East",
    "summarized_story": "A coalition of South East Renaissance Assembly is requesting that other geopolitical zones should concede the next presidential slot to the South East region.\nThe group made up of former political officers, pressure Groups from the five South East states, made the request at a news conference in Enugu.\nAmong some sections of the polity, the demand that south east geopolitical zone should be preferred for the 2023 presidential ticket, is greatly important.\nThis coalition of Igbo elders group is not different in the quest.\nThey believed that Nigeria’s president of south east extraction, will automatically douse the rising secessionist agitation in the zone."
  },
  {
    "headline": "Edo LG Poll: EDSIEC suspends conduct of elections",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has suspended the conduct of the local government elections scheduled for April 19, 2022.\nAccording to a statement signed by Emmanuel Abebe on behalf of the Chairman of EDSIEC, the suspension of the local council elections was due to the restraining order by the Federal High Court, Abuja on the Edo State Independent Electoral Commission.\nThe commission said all processes leading to the conduct of the elections have been suspended, pending the hearing and determination of the Motion on Notice.\nHe said the announcement is for the information of the general public that due to the content of the publication in the Vanguard Newspaper of 7th April, 2022 by which the Federal High Court Abuja restrained the Edo State Independent Electoral Commission from conducting the Local Government Elections in the State scheduled for 19th April 2022, all processes leading to the conduct of the said elections are hereby suspended, pending the hearing and determination of the Motion on Notice.”"
  },
  {
    "headline": "NLC pickets venue of Govs' meeting in Abuja over LG autonomy -",
    "summarized_story": "The Nigeria Labour Congress on Friday picketed the venue of governors’ meeting in Abuja over local government autonomy.\nArmed with placards bearing various inscriptions, the labour leaders say there is no going back on their demand for financial and administrative autonomy for local government.\nSee pictures below:"
  },
  {
    "headline": "Nigeria: Ahead of His Declaration for 2023 Presidency, Vice President Osinbajo Meets APC Governors",
    "summarized_story": "Ahead of his declaration for presidency in 2023, which is likely expected this week, Vice President Yemi Osinbajo will meet with the 22 governors of the ruling All Progressives Congress (APC) under the aegis of Progressive Governors’ Forum (PGF) in Abuja on Sunday.\nThe meeting, THISDAY learnt, is part of his consultations with critical stakeholders ahead of his declaration to contest for the 2023 presidential election on the platform of the ruling APC, which he is expected to announce this week.\nThis is coming as the Minister of Transportation, Mr. Chibuike Amaechi, on Saturday declared his ambition to contest the 2023 presidential election on the platform of the APC.\nPresidency sources told THISDAY that Osinbajo’s meeting with the APC governors would hold at the Akinola Aguda official residence of the Vice President located within the precincts of the Presidential Villa in Abuja.\nThe presidency sources also told THISDAY that all is set for the vice president to publicly declare his intention to contest for the APC ticket this week."
  },
  {
    "headline": "Nigeria: EFCC Kicks Against Court Order Permitting Ex-Anambra Governor Obiano to Travel Abroad",
    "summarized_story": "Obiano is being investigated by the EFCC for alleged corruption and money laundering during his tenure as Anambra State governor from 2014 to 2022.\n“On March 31, the commission was served an originating motion on notice for the enforcement of the applicant’s fundamental rights.\nCuriously, the motion was filed on March 11, 2022, the same date as the motion for ex parte order.\n“But when the case was called, Justice Nnamdi Dimgba held the brief of his brother judge, who is bereaved.\nThe case was subsequently adjourned, with instruction that counsel will be notified of the adjourned date,’’ the commission explained."
  },
  {
    "headline": "Nigeria Can’t Conduct Full-Scale Bombing of Terrorists to Avert Collateral Damage, Information Minister Says",
    "summarized_story": "Nigeria’s Minister of Information and Culture, Alhaji Lai Mohammed, has revealed that the terrain where bandits operate contributes to making security operations difficult.\nThis is because these criminals called bandits are living among us; they interact with the people as well,” he said.\nAll that is missing is appropriate weapons to fight the terrorists who are well-equipped.\n“I am speaking from my personal knowledge because I defend top-ranking soldiers – generals who are charged illegally for demanding weapons to fight terrorists.\nHe rhetorically said: “Why did the Minister not recommend another security agency to fix the problem and save precious lives?"
  },
  {
    "headline": "Nigeria: How Trinity Spirit’s Owners Accumulated Over $200m Debts Before Vehicle Exploded",
    "summarized_story": "Although the headship of the company, Shebah Exploration and Production Company, had admitted that the business was “in receivership,” the new investigation has now unravelled how the firm accumulated the humongous debts that led to its eventual collapse.\nThese include two bank loans for a combined $220 million and a contract for the management of the vessel itself, according to court documents and corporate statements.\nHe referred questions regarding the vessel to Shebah Chief Executive Officer, Mr. Ikemefuna Okafor, who didn’t respond to emails or calls.\nA UK judge dismissed an appeal by Shebah and Orjiako against the decision in mid-2017.\nShebah in 2004 acquired a 40 per cent interest in a permit known as Oil Mining Lease (OML) 108 from ConocoPhillips as Allenne purchased the Trinity Spirit from the Houston-based producer."
  },
  {
    "headline": "IMF: Increased Diversity of Creditors Raises Coordination Challenges for Nigeria, Others",
    "summarized_story": "The International Monetary Fund (IMF) has declared that increased diversity of creditors raises coordination challenges for Nigeria and other indebted poor countries.\nIt also owes the African Development Bank (AfDB); Arab Bank for Economic Development in Africa, European Development Bank, Islamic Development Bank and the International Fund for Agricultural Development (IFAD).\nThe IMF believes that the increasing diversity of creditors poses complex restructuring and more complex challenges for Nigeria and other heavily indebted countries.\nAverages conceal a diversity of debt composition, from the shares of bilateral, multilateral and private creditors, to the composition of official bilateral creditors themselves.\nChina would therefore play a key role in most DSSI countries’ debt restructurings that would involve official bilateral creditors."
  }
]