[
  {
    "headline": "Lagos CSOs rally against Shell operations in Nigeria",
    "summarized_story": "The CSOs were asking that Shell should stop oil and gas extraction in Nigeria, and urged investors to stop funding Shell’s operations, owing to the environmental damage that the company’s operations were allegedly causing to the water, land, and human resources in Nigeria.\nThe coalition which was led by the Africa Network for Environmental and Economic Justice had on Sunday, issued a resolution at a people’s Annual General Meeting, a shadow CSOs AGM to Shell’s AGM scheduled for May 24, 2022.\n“The Church of England and other investors should stop lending moral and financial support to shell and should vote against Shell’s energy transition strategy at the May 24, 2022, AGM.\n“Shell should go back to the drawing board and revise the 2021 energy transition strategy to align with the Paris Agreement of limiting the increase in the average global temperature to 1.5 degrees Celsius above pre-industrial levels.\n“We call on Shell’s AGM to commit to a comprehensive cleanup of the entire Niger Delta.”Copyright PUNCH."
  },
  {
    "headline": "US will defend Taiwan militarily if attacked – Biden",
    "summarized_story": "The United States would defend Taiwan militarily if it was attacked, President Joe Biden said at a news conference in Japan.\nAsked by a journalist whether the US would defend Taiwan militarily in the case of an attack, Biden replied: “Yes’’.\nHe stated that a forcible takeover of Taiwan would dislocate the entire region, and was comparable to Russia’s invasion of Ukraine.\n“We remain committed to supporting the peace and stability across the Taiwan Strait and ensuring that there is no unilateral change to that status quo,’’ Biden added.\nChina is flirting with danger with its current manoeuvres around Taiwan, Biden warned, while adding that he did not expect China to attempt an attack on Taiwan."
  },
  {
    "headline": "Russian soldier found guilty of war crimes bags life sentence",
    "summarized_story": "A Kyiv court Monday ruled that a 21-year-old Russian soldier who killed a civilian was guilty of war crimes and handed him a life sentence, in the first verdict against Moscow’s forces since their invasion.\n“The court has found that (Vadim) Shishimarin is guilty and sentences him to life imprisonment,” judge Sergiy Agafonov said.\nShishimarin, a Russian sergeant, admitted earlier in court to killing 62-year-old Oleksandr Shelipov in the first days of the Kremlin’s offensive in northeast Ukraine.\nThe fate of every Russian citizen is of paramount importance to us,” Kremlin spokesman Dmitry Peskov told reporters.\nThe landmark ruling is expected to be followed by others, with Ukraine opening thousands of war crimes cases since Moscow’s invasion."
  },
  {
    "headline": "Buhari visits Kano, commiserates with families of victims of explosion",
    "summarized_story": "By Abdulmumin MurtalaPresident Muhammadu Buhari has commiserated with the families of the victims of the the Kano explosion that claimed nine last week.\nThe president who is in Kano for the Annual Airforce Day Celebration paid a courtesy call at the Emir of Kano Aminu Ado Bayero at his palace.\nHe also praised the Kano state government for being proactive.\n“I pray for affected families and also praise the state government for being proactive” he stated.\nOn his side, the Emir of Kano thanked the president for finding time to visit and prayed for peace in the country."
  },
  {
    "headline": "Bart Nnaji: Mbaka sets agenda for next Enugu Governor",
    "summarized_story": "Ejike Mbaka has set the agenda of competence, industrialisation, humility, sanity, religiosity and vision drive for whoever would become the next governor of Enugu state in 2023.\nMbaka described Nnaji as an industrialist and a power generator who has the annoting of God in his endeavor, asking God to grant Nnaji’s will in his aspiration to become the next governor of Enugu state.\nMbaka said: “He (Bart Nnaji) is one of the governorship aspirants in Enugu and he has come to be with us.\n“One of my children will become the Governor after Gburugburu ( Governor Ugwuanyi).\nMy prayer is that he selects a man of peace, a good man."
  },
  {
    "headline": "2023 PRESIDENCY: 7 parties join forces with LP against APC, PDP",
    "summarized_story": "This adoption of the Labour Party was made possible by the new rapprochement between the leadership of the Labour Movement and the hierarchy of the Labour Party- an emergent solidarity jointly spearheaded by President of the Nigeria Labour Congress, NLC, Ayuba Wabba; and the Trade Union Congress, TUC President, Quadri Olaleye, who have revalidated their membership of the Labour Party by formally registering with the party, last week.\nThe other parties in the coalition are African Democratic Congress, ADC: New Nigeria Peoples Party, NNPP; Social Democratic Party, SDP; and Allied Peoples Movement, APM.\nFurthermore, the ‘3rd Force’ Mega Electoral Pact for the 2023 elections is proposed around agreement on Labour Charter of Demand, EndSar Youths Demands and Constitutional Referendum for Nigeria, among others to be agreed as terms of the Alliance for the 2023 elections,” she added.\nUtomi, who said he had opened discussions with APGA before recent Supreme Court judgments regarding the party, said there is hope for progress.\nThis he continued has been feedstock for the current bazaar of violence and insecurity in the country."
  },
  {
    "headline": "Ritual killing: Police arrest landlord, gateman in Niger",
    "summarized_story": "A trader and his gateman have been arrested by police operatives in Lapai Local Government Area of the state for allegedly killing a 4-year-old boy for rituals.\nAn eyewitness said that one of the suspects, identified as Emmanuel, a building materials trader, had allegedly connived with his gateman to kidnap the child and kill him.\n“The gateman entered a motorcycle to a stream where he was to dispose of the remains, but on dropping the gateman the motorcyclist noticed blood dripping from the sack.\nWe will get justice for the child he killed.\n“Just four days ago, we heard information about the missing child and no one could give an account of his whereabouts."
  },
  {
    "headline": "Spain approves draft bill for menstrual pain leave",
    "summarized_story": "By Sola OgundipeThe Spanish government has approved a draft bill which grants paid ‘menstrual leave’ for women who suffer from severe period pain.\nHowever, as with paid leave for other health reasons, a medical doctor must approve the medical incapacity before the leave is granted.\nALSO READ:The proposed legislation is awaiting approval by parliament, and if passed, Spain will become the first Western country to give women ‘menstrual leave’.\nMenstrual leave is offered in a few countries including South Korea, Japan, Zambia and Indonesia.\nThe draft bill has provoked a debate in Spain about whether the paid menstrual leave rule will help or hamper women in the workplace."
  },
  {
    "headline": "Robbers attack NPC office, steal birth certificates",
    "summarized_story": "The National Population Commission (NPC) Badagry office located at Town Hall near Topo Garage, in Lagos State has been attacked by robbers.\nA staff member of the commission, Mrs Funmilayo Bojrenu told the News Agency of Nigeria (NAN) in Badagry that vital documents belonging to NPC were stolen.\nMrs Anthonia Kalu, the Deputy Director, NPC, Badagry office who was on official assignment in Oyo State, told NAN on the phone that it was the third time the office would be burgled in 2022.\n“The Town Hall is no longer secure again since they pulled down the fence for the reconstruction of the road to Topo.\nThe major role of the NPC is to give out birth and death certificates to Nigerians."
  },
  {
    "headline": "War: Russian soldier bags life imprisonment for killing civilian in Ukraine",
    "summarized_story": "A 21-year-old Russian soldier was on Monday sentenced to life imprisonment for shooting a civilian to death in Ukraine’s first war crimes trial.\nThe soldier confessed to court in Kiev on Monday that he shot a 62-year-old civilian amid the Russian invasion of Ukraine.\nThe development was the first case heard in court after the worldwide horror over Russian atrocities in Ukraine which have claimed the lives of several persons.\nThe soldier, who is from Siberia, told the court that he acted on orders from his superiors.\nHe apologised during the trial but the prosecution asked for life imprisonment."
  },
  {
    "headline": "Buhari told to apologise to Shagari, Awolowo, others",
    "summarized_story": "The Oodua People’s Congress (OPC) has told President Muhammadu Buhari to tender a posthumous apology to the late former President Shehu Shagari, late Chief Obafemi Awolowo, and all Second Republic political actors charged and jailed for corruption after the December 1983 coup.\nIn a statement on Monday, OPC President, Otunba Wasiu Afolabi, said that the exorbitant fees currently imposed on political aspirants’ nomination forms rubbished the corruption claims that Buhari had made in 1983 when he overthrew Shagari.\n“Like he did in the military coup of 1983, Buhari came into office in 2015 on the mantra of fighting corruption.\n“He owes the likes of Shagari, Awolowo, Bakin Zuwo, Alex Ekwueme an unreserved apology for overthrowing them.\nIn the All Progressives Congress (APC), the fees range from N100 million for presidential aspirants, N50 million for governorship aspirants, N20 million for senatorial aspirants, N10 million for House of Representatives aspirants and N2 million for state House of Assembly aspirants."
  },
  {
    "headline": "Police AIG Don Awunah passes on months after DIG Egbunike’s death",
    "summarized_story": "Don Awunah, an Assistant Inspector-General of Police is dead.\nThe deceased was in charge of Zone 16, Yenogoa in Bayelsa State.\nThe Benue-born cop died on Monday at a private hospital in Abuja, the nation’s capital.\nAwunah was formerly a Force Public Relations Officer (FPRO).\nHe passed away barely three months after Deputy Inspector-General of Police, Joseph Egbunike died."
  },
  {
    "headline": "War: Putin wants to eliminate Ukraine’s identity – US President, Biden",
    "summarized_story": "United States President Joe Biden on Monday accused President Vladimir Putin of Russia of trying to destroy Ukraine’s identity.\nAccording to Biden, this is as witnessed by Russian bombardments of civilian targets such as schools, hospitals, daycare centres and museums.\n“I believe what Putin is attempting to do is to eliminate the identity of Ukraine.\n“He can’t occupy it, but he can try to destroy its identity,’’ Biden said in Tokyo.\nMeanwhile, Russia and Ukraine have been fighting for close to three months, and several casualties have since been recorded."
  },
  {
    "headline": "Seven Nigerian musicians who rose to fame from slums",
    "summarized_story": "Seven Nigerian musicians who rose to fame from slumsSo many Nigerian music artistes have risen from low upbringing into becoming super stars and employers of labour.\nHere are seven Nigerian musicians who rose to fame from slums:*Daddy ShowkeyDaddy Showkey was born on August 4, 1970 to Isoko parents in Delta state and grew up in Ajegunle, Lagos State.\nHe got his nickname through his grandmother’s elder sister’s son who was popularly known as Showboy way back.\nOn September 28 Patoranking released a song titled Abule one he released ahead of his album scheduled to be released later soon in 2020.\n*TimayaInetimi Timaya Odon popularly known as Timaya was born on August 15, 1980 in Port Harcourt, Rivers State."
  },
  {
    "headline": "Wike, Bello, Fayemi, six other six Govs eyeing 2023 presidency",
    "summarized_story": "The Independent National Electoral Commission (INEC) has tolzdirected all the parties to submit the lists of their candidates by June 3.\nHere is a list of Governors eyeing the 2023 presidency under the two major political parties:North:1.\nRivers Governor Nyesom Wike2.\nCross Rivers Governor Benedict Ayade5.\nGoodluck Jonathan was a serving Governor in Bayelsa before he became a vice-president and President upon the demise of Yar’Adua."
  },
  {
    "headline": "Stop portraying IPOB and Nnamdi Kanu as heroes",
    "summarized_story": "But it is a common fact that The Nation has over time given banner headlines to the activities of IPOB, whether positively or negatively.\nThe most recent is the banner photograph in the front page of The Nation newspaper of Thursday May 19, showing the leader of the IPOB, Nnamdi Kanu with his lawyers in the court chamber.\nThe living in self-denial by both the traditional and political leaders in the east over Nnamdi Kanu and his IPOB activities can be clearly seen with the recent visit of the governor of Anambra State, Charles Soludo to Nnamdi Kanu in the Department of State Security Services (DSS) cell in Abuja, probably to plead with him to call his boys to order.\nEveryone knows it is the IPOB dissidents, except the traditional and political leaders in the eastern part of Nigeria who apparently have been pretending not to know.\nAffording them a space in a reputable newspaper amounts to emboldening them in their dastardly and heinous crimes."
  },
  {
    "headline": "Fayose’s son, aide, others win Ekiti tickets",
    "summarized_story": "FORMER Governor Ayodele Fayose’s son, Joju, and his longstanding media aide Lere Olayinka are among those declared winners of yesterday’s Peoples Democratic Party (PDP) House of Representatives primary in Ekiti State.\nJoju, who won the party’s ticket for the Ekiti Central Federal Constituency I comprising Ado and Irepodun/Ifelodun, polled 69 votes to defeat Deji Adeosun.\nOlayinka emerged the flagbearer for the Ekiti Central Federal Constituency II, comprising Ijero, Ekiti West and Efon local government areas.\nFormer governorship aspirant under, Otunba Yinka Akerele won the party’s ticket for the Ekiti North Federal Constituency II.\nIn Ekiti North Federal Constituency II, Babatunde Ajayi polled 63 votes to defeat Fayose backed aspirant, Funmi Ogun, who had 33 votes."
  },
  {
    "headline": "Mbaka: one of my sons will be Enugu governor in 2023",
    "summarized_story": "Ejike Mbaka, has said one of his ‘children’ will be the governor of Enugu State in 2023.\nHe said he is praying for ‘God to give Governor Ifeanyi Ugwuanyi the wisdom, grace, and favour to select a man after God’s own heart’.\nMbaka vowed to lead a revolution to chase out anyone who would become governor and work against the people.\n“One of my children will become the Governor after Gburugburu (Governor Ugwuanyi).\nThat is my prayer for him in Jesus name.”The cleric, who described Governor Ugwuanyi as a complete man of peace, hailed the people for assisting him in making Enugu more habitable."
  },
  {
    "headline": "Road to 2023: Governors’ last fight to impose successors",
    "summarized_story": "Cross River: Consensus collapsesIn Cross River, the consensus option initially envisaged has collapsed as the APC, PDP governorship aspirants head for primaries.\nThe Chairman, National Communication Commission (NCC), Prof Adeolu Akande, is also among the governorship aspirants on the APC platform.\nFurther investigation has also shown that Adelabu may be the favoured aspirant that will eventually emerge as the APC governorship candidate.\nMeanwhile, the way things are now, Governor Seyi Makinde and Adebayo Adelabu, will emerge as PDP and APC governorship candidates respectively.\nAt present, the governorship aspirants across the political parties are scrambling for the soul of delegates, and favour of political leadership to emerge as candidates."
  },
  {
    "headline": "Presidency: I’m in race to win, says Lawan",
    "summarized_story": "In a statement, yesterday, by the spokesperson of Ahmad Lawan Presidential Campaign Organisation, Iyke Ekeoma, Lawan clearly dismissed the possibility of running for another term in Yobe East senatorial districtAre you a Man 40 yrs and above?\n“Contrary to their unnecessary fabrications against the nationally accepted presidential ambition of Lawan, we restate for the pleasure of progressive Nigerians that the falsehood trending currently on social media that Lawan has dropped his ambition to run for another term in Yobe East senatorial zone is false.\n“It is understandable that Lawan’s entrance into the presidential race to compete against 25 other aspirants has become the major discussion as his entrance has changed the political dynamics of the nation.\n“The ambition to become the president of Nigeria after President Buhari is alive and Nigerians should be rest assured he is in the race to win and not just to answer aspirant.\nAll supporters of Lawan should not entertain fear as he is working tirelessly to emerge as APC candidate,” he said."
  },
  {
    "headline": "Anambra lawmakers mourn murdered colleague as gunmen kidnap another",
    "summarized_story": "From Obinna Odogwu, AwkaMembers of the Anambra State House of Assembly have expressed deep sadness over the gruesome murder of their colleague, Okechukwu Okoye, who represented Aguata II Constituency.\nSpeaker of the state Assembly, Uche Okafor, in a statement, described Okoye’s death as heartbreaking.\nHe asked the state governor, Prof. Chukwuma Soludo, to do everything within his powers to ensure that the perpetrators of the dastardly act were brought to book.\nOkafor, while commiserating with the late lawmaker’s immediate family, his kinsman, Governor Soludo, and the entire Isuofia community, on behalf of the members of the state Assembly, prayed God to grant him eternal rest.\nMeanwhile, Governor Soludo, while condemning the gruesome murder, has pledged N10 million reward for any valuable information to track the killers."
  },
  {
    "headline": "Electoral Bill: Aspirants, lawmakers fume over Buhari’s stance",
    "summarized_story": "This is even as some aspirants, especially members of the ruling APC, are unhappy over his stance on the hurriedly-packaged bill by the National Assembly about a fortnight ago.\n“With the number of statutory delegates, it will go to about 10,000 to 12,000.\nIf the law is left as it is, only about or at best, 2,200 delegates will elect the presidential candidates of the two political parties.\n“For the PDP, there are only 810 delegates, but with statutory delegates, the number would shoot up to 3,900.\nStatutory delegates would increase the number of delegates in APC from about 2, 200 to about 12,000."
  },
  {
    "headline": "North East only alternative to South East presidency, Kalu insists",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Uzor Kalu, has said North East remains the only alternative to South East presidency.\nAccording to him, the South East supported the South West in 1999 and also supported the South South in 2011 and 2015.\n“Former President Olusegun Obasanjo became President in 1999 because the South East and the South South supported the South West.\n“Former President Goodluck Jonathan became president in 2011 because the South East and the South West supported the South South.\n“So, what stops South West and South South aspirants from withdrawing from the race to support only the South East aspirants?"
  },
  {
    "headline": "With You as President, Everything Will Work, Gombe Gov Tells Amaechi",
    "summarized_story": "“You have shown capacity, you’ve shown energy and passion and you have shown the capacity to deliver on any assignment or political mandate that is given to you.\nYou stood to fight and bring in Mr. President, and by so doing you’ve shown commitment, you’ve shown capacity.\n“Gombe State is ready for you.\nThe delegates of Gombe will speak with one voice, and we know you have the capacity and experience to be the President of Nigeria.\nIf they don’t complete that project, when I become President, be rest assured that I will complete it,” Amaechi stated."
  },
  {
    "headline": "Nwajiuba: Tinubu, Osinbajo, Amosun Not Suitable for Nigeria’s Current Work Plan",
    "summarized_story": "Nwajiuba, however, described the three contenders to the office of president as nice people.\nYou could have great leaders like Asiwaju Tinubu or men like Ibikunle Amosun, even the vice president, Yemi Osinbajo, who by their nature are very nice persons, they might not be suitable for the work plan now.\n“There are those, who mean well but being challenged by the age factor, like the former senate president, Ken Nnamani.\n“Olusegun Obasanjo had been president for eight years; Osinbajo has been vice president since 2015.\nWhy should the South-west say the north should cede power to the south and that they must be the beneficiary?"
  },
  {
    "headline": "Hayatu-deen: I Want to Change the Character, Complexion of Our Politics",
    "summarized_story": "Former banker and presidential aspirant on the platform of Peoples Democratic Party (PDP), Mohammed Hayatu-deen, says he is in the race to change the character and complexion of Nigerian politics.\nHayatu-deen said as an economist he knew what was needed to kick-start the economy and ensure Nigerians smiled again.\nBut the problem here is that we do not have any provision for these young Nigerians.\nHayatu-deen stated, “The media has a lot of role to play in sensitising delegates in both parties to ensure they pick the right candidates.\nI really love this nation,” Hayatu-deen declared."
  },
  {
    "headline": "FG Appoints Nwabuoku to Oversee Accountant-General’s Office",
    "summarized_story": "Ndubuisi Francis in AbujaFollowing the current investigation of the Accountant-General of the Federation (AGF), Alhaji Ahmed Idris (AGF) by the Economic and Financial Crimes Commission (EFCC) (AGF) over alleged financial impropriety, the federal government has appointed Mr. Anamekwe Chukwunyere Nwabuoku to oversee the Office of the Accountant-General of the Federation (OAGF).\nHe started his civil service career with the Centre for Democratic Studies (CDS) and rose to the position of Principal Accountant between 1992 and 1995.\nHe was deployed to the Office of the AGF, Abuja from 1996 to 2001 as Assistant Chief Accountant.\nHe became a Deputy Director (Accounts) in 2012 and was deployed to the Office of the Secretary to the Government of the Federation (SGF) as Supervisory Officer of Ecological Funds Accounts and other related matters.\nNwabuoku was promoted to Director (Accounts) in 2017 and was posted to the Office of the Head of the Civil Service of the Federation."
  },
  {
    "headline": "APC to Reconcile Aggrieved Presidential Aspirants, Others after Primaries",
    "summarized_story": "Chuks Okocha in AbujaThe All Progressives Congress (APC) yesterday said there are plans to reconcile aggrieved aspirants after the presidential, governorship, senatorial and House of Representatives’ primaries scheduled to take place from May 26 to 30.\nNational Chairman of the party, Senator Abdullahi Adamu, who stated this at a virtual town hall meeting, added that no grieving aspirant will leave the party after the party’s primaries.\nYou can see unlike the other parties extending weight, in our party all our aspirants are calm.\nIn this way, we can carry along everybody to the party,” he said.\nOthers are Pastor Tunde Bakare, Cross River State governor, Prof. Ben Ayade; his Ebonyi State counterpart, Governor Dave Umahi; Ekiti State governor, Dr. Kayode Fayemi; former Minister of State for Education, Mr. Emeka Nwajiuba; former Senate President, Senator Ken Nnamani; Kogi State governor, Yahaya Bello; Jigawa Governor, Mohammed Badaru Abubakar, and former Zamfara State governor, Senator Ahmed Yerima."
  },
  {
    "headline": "Killers Of Anambra Lawmaker Reportedly Vow To Kill More House Of Assembly Members",
    "summarized_story": "Suspected killers of Anambra State lawmaker, Hon.\nMeanwhile, some Anambra communities have alleged that “unknown gunmen” have set up camps in their areas.\nAccording to a message circulating on social media, the criminal elements have created a new camp in Unubi, Nnewi South Local Government Area, from where they launch attacks on indigenes.\nIt said, “The armed gang have created a new Operational Camp in the Unubi bush, a town located in Nnewi South Local government Council of Anambra State.\n“The Lexus vehicle owner quickly alighted from the car after driving it into the gutter at Ugwumba Bus stop and ran into Ezechibuike’s home, that situates around the bus stop, through which he fled."
  },
  {
    "headline": "Killers Of Anambra Lawmaker Reportedly Vow To Kill More House Of Assembly Members",
    "summarized_story": "Suspected killers of Anambra State lawmaker, Hon.\nMeanwhile, some Anambra communities have alleged that “unknown gunmen” have set up camps in their areas.\nAccording to a message circulating on social media, the criminal elements have created a new camp in Unubi, Nnewi South Local Government Area, from where they launch attacks on indigenes.\nIt said, “The armed gang have created a new Operational Camp in the Unubi bush, a town located in Nnewi South Local government Council of Anambra State.\n“The Lexus vehicle owner quickly alighted from the car after driving it into the gutter at Ugwumba Bus stop and ran into Ezechibuike’s home, that situates around the bus stop, through which he fled."
  },
  {
    "headline": "EXCLUSIVE: How Political Intrigues Between Two Corrupt Nigerian Public Figures Led To Detention, Grilling Of Former NDDC MD Over N47billion Fraud",
    "summarized_story": "The Vice President is said to have settled for Mr. Ekere because of his political reach and outlook.\nHistory Of Frosty Relationship Between Akpabio And EkereMany insist that Mr. Akpabio has had a long frosty relationship with Mr. Ekere.\nHowever, the primary did not produce a clear winner and Mr. Akpabio negotiated victory which meant he had to name Mr. Ekere as his running mate.\nMr. Ekere escaped that fate by resigning a day before the house of assembly was to start impeachment proceedings against him.\nMr. Ekere moved to the APC in 2015 after he was frustrated out of the governorship race."
  },
  {
    "headline": "EXCLUSIVE: How Political Intrigues Between Two Corrupt Nigerian Public Figures Led To Detention, Grilling Of Former NDDC MD Over N47billion Fraud",
    "summarized_story": "The Vice President is said to have settled for Mr. Ekere because of his political reach and outlook.\nHistory Of Frosty Relationship Between Akpabio And EkereMany insist that Mr. Akpabio has had a long frosty relationship with Mr. Ekere.\nHowever, the primary did not produce a clear winner and Mr. Akpabio negotiated victory which meant he had to name Mr. Ekere as his running mate.\nMr. Ekere escaped that fate by resigning a day before the house of assembly was to start impeachment proceedings against him.\nMr. Ekere moved to the APC in 2015 after he was frustrated out of the governorship race."
  },
  {
    "headline": "BREAKING: Nigeria Police Make U-turn, Say Kano Explosion Caused By Bomb Materials, Not Gas",
    "summarized_story": "The police command in Kano has confirmed that the explosion that killed nine persons last Tuesday was caused by chemicals used for making bombs.\nThis follows an investigation carried out by the Explosive Ordnance Disposal-Chemical, Biological, Radiological and Nuclear Defense, EOD-CBRN, and Operation Puff Adder of the Nigerian Police.\nA statement signed by the Police Public Relations Officer of the state command, Haruna Kiyawa, said the explosion was not caused by a gas cylinder as earlier claimed.\nScene of explosionKiyawa said the investigation showed that one of the victims, identified as Michael Adejo, “dealt in illicit storage of toxic chemicals and other hazardous materials”.\n“Meanwhile arrests have been made linking one of the collapsed shops with dealings in sales of illicit, toxic chemical substances and combustible materials suspected to be used for making Improvised Explosive Devices, IEDs."
  },
  {
    "headline": "Don’t lower your guard... COVID-19 pandemic NOT over, WHO warns",
    "summarized_story": "The World Health Organisation (WHO) has warned that COVID-19 is not over in spite of reports that cases and deaths have declined significantly.\nTedros Ghebreyesus, WHO director-general, said this on Sunday at the opening of the world health assembly in Geneva, Switzerland.\nThe world health assembly is the decision-making body of WHO comprised of representatives of 194 countries.\nAdvertisementHe added that reported cases have declined significantly from the peak of the Omicron wave in January and reported deaths are at their lowest since March 2020.\nAnd reported deaths are rising in my continent – the continent with the lowest vaccination coverage."
  },
  {
    "headline": "Don’t lower your guard... COVID-19 pandemic NOT over, WHO warns",
    "summarized_story": "The World Health Organisation (WHO) has warned that COVID-19 is not over in spite of reports that cases and deaths have declined significantly.\nTedros Ghebreyesus, WHO director-general, said this on Sunday at the opening of the world health assembly in Geneva, Switzerland.\nThe world health assembly is the decision-making body of WHO comprised of representatives of 194 countries.\nAdvertisementHe added that reported cases have declined significantly from the peak of the Omicron wave in January and reported deaths are at their lowest since March 2020.\nAnd reported deaths are rising in my continent – the continent with the lowest vaccination coverage."
  },
  {
    "headline": "Nwajiuba: North would back south-east APC presidential candidate if Tinubu, Osinbajo quit race",
    "summarized_story": "Chukwuemeka Nwajiuba, former minister of state for education, says the north would support the bid for a south-east presidential candidate of the All Progressives Congress — if the south-west hopefuls quit the race.\nNwajiuba said in the interest of national justice and fairness, the south-east should produce the next president of the country.\nAdvertisementBola Tinubu, former Lagos governor, Vice-President Yemi Osinbajo, and Kayode Fayemi, governor of Ekiti state, are among the south-west politicians in the race for the ticket of the ruling party.\n“There are three people from the north who purchased the APC presidential forms.\n“Why should the south-west say the north should cede power to the south and that they must be the beneficiary?"
  },
  {
    "headline": "Nwajiuba: North would back south-east APC presidential candidate if Tinubu, Osinbajo quit race",
    "summarized_story": "Chukwuemeka Nwajiuba, former minister of state for education, says the north would support the bid for a south-east presidential candidate of the All Progressives Congress — if the south-west hopefuls quit the race.\nNwajiuba said in the interest of national justice and fairness, the south-east should produce the next president of the country.\nAdvertisementBola Tinubu, former Lagos governor, Vice-President Yemi Osinbajo, and Kayode Fayemi, governor of Ekiti state, are among the south-west politicians in the race for the ticket of the ruling party.\n“There are three people from the north who purchased the APC presidential forms.\n“Why should the south-west say the north should cede power to the south and that they must be the beneficiary?"
  },
  {
    "headline": "Hayatu-Deen: Nigeria needs a president who can fix the economy -- this is not time for politics",
    "summarized_story": "Mohammed Hayatu-Deen, a former managing director of the now-defunct FSB International Bank, says Nigeria needs a president who understands how to run a thriving economy.\nHayatu-Deen, a presidential hopeful on the Peoples Democratic Party (PDP) platform, spoke on Sunday at a media parley in Lagos.\nHe said Nigeria has been governed by politicians who do not understand the economy which is why “people do not have basic access to the basic needs of life”.\n“Nigeria needs people who understand what the microeconomic conditions of the country are,” he said.\nWhile calling on the media to enhance its social responsibility, Hayatu-Deen said the country must be well structured to work optimally."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Nigeria to generate over ₦90 billion annually from new phone call tax",
    "summarized_story": "The Nigerian government has created a new tax on phone calls in the bid to fund free healthcare for Nigerian citizens who cannot afford healthcare—the vulnerable group.\nThe law defines the “vulnerable group” in society as “Children under five, pregnant women, aged, physically and mentally challenged persons, and indigent people as may be defined from time to time”.\nThe law also requires that all persons resident in Nigeria are expected to obtain health insurance.\nNigerians made 150.83 billion minutes of calls in 2020 according to a report by the Nigerian Communications Commission.\nThis translates to 9.05 trillion seconds of calls, meaning the new tax will generate at least 9.05 trillion Kobo, which converts to ₦90.49 billion ($18.09 million), annually."
  },
  {
    "headline": "Team Chemotronix, 2 others win $2,500 cash prize at TABS Web3 Hackathon",
    "summarized_story": "Share this article:On Saturday, May 21, 2022, the Techpoint Africa Blockchain Summit (TABS 2022) ended with a bang as Team Chemotronix, Team Block Baddies, and Team JPS won the TABS Web3 Hackathon.\nThe TABS Web3 Hackathon, sponsored by @NairaEx, began virtually on May 9, 2022, with six teams.\nTABS Web3 Hackathon showdownTeam lead for Team Give.\nAdvertisementTABS Web3 Hackathon Judges.\nThe TABS Web3 Hackathon is a way to simulate and encourage blockchain/Web3-based solutions in Africa."
  },
  {
    "headline": "Your bank wants to share your information",
    "summarized_story": "CBN wants to share your dataImage credit: Businesstimes.ngThe Central Bank of Nigeria (CBN) has proposed the regulatory framework for open banking in the country.\nAn open bank?\nOpen banking, also known as “open bank data,” is a system that allows third-party applications — startups and online financial service vendors — to access and control consumer banking and financial accounts.\nBecause open banking relies on networks rather than centralisation, customers are typically required to provide consent to allow the bank to grant such access.\nThen, APIs from third-party providers can access the customer’s shared data (and data about the customer’s financial counterparties)."
  },
  {
    "headline": "TABS is tomorrow! 💃 💃",
    "summarized_story": "💃😉😊 Tomorrow is the Techpoint Africa Blockchain Africa Summit (TABS)!\n😁AdvertisementIf you’ve registered, you’ll see all the fantastic things we’ve packaged just for you tomorrow.\nTikTok to credit creatorsI’ve never used TikTok, but I’m considering signing up.\nJust this month, the company introduced two new features — Pulse and Branded Mission — for content creators to earn money on the app.\nThis feature, a button, allows creators to credit all types of inspiration for their content, like dances, jokes, and viral sounds."
  },
  {
    "headline": "Binance To Host “Block and Brunch” Networking Event For Professionals In Lagos",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nThe event targets professionals who are crypto newbies and enthusiasts for an afternoon of learning and networking.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Traction Appoints Babatope Oni as Chief Technology Officer",
    "summarized_story": "This article is a Brand Press post.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Leading financial services platform, Traction has appointed Babatope Oni as Chief Technology Officer (CTO).\nI am excited to join the Traction team,” said the new Traction CTO, Babatope Oni.\nTo learn more about Traction, please visit https://tractionapps.co/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Edo PDP holds primary election for House of Assembly, Reps – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State chapter of the Peoples Democratic Party (PDP), on Sunday, conducted primaries to elect candidates for the Edo State House of Assembly and the House of Representatives elections.\nThe five-man committee for the House of Representatives and Edo State House of Assembly (EDHA) primaries arrived at the PDP Secretariat in Benin City, Edo State, in the early hours of Sunday to conduct the primary election.\nThe House of Representatives Primaries Committee is headed by Hon.\nKolawole Shittu, while the EDHA Primaries Committee is chaired by Comr.\nWeyinmi Isaac noted, “We are here in the state to carry out the responsibility given to the Committee by the National Secretariat."
  },
  {
    "headline": "Enhancing Anti-corruption and Social Inclusive Reform Initiatives in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLast week, our organisation organized a 2-day seminar for CSOs and journalists on enhancing advocacy skills on anti-corruption and social inclusive reform issues in Nigeria.\nIt was tagged Enhancing Anti-corruption and Social Inclusive Reform Initiatives in Nigeria.\nThe Enhancing Anti-corruption and Social Inclusive Reform Initiatives in Nigeria project is designed following the anchor cluster model adopted by Palladium to promote and engage in anti-corruption policy reforms.\nOur cluster currently advocates for the mainstreaming of anti-corruption issues into the country upcoming 2023 general elections discourse.\nThen, they can also influence the development of policies, passage of laws on anti-corruption and social inclusive reforms issues."
  },
  {
    "headline": "Obaseki pledges sustained investment in education, teachers’ welfare – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his administration will sustain the investment in the education sector, ensuring that teachers in the state are adequately equipped to deliver quality education to Edo children.\nThe governor said the state, through the Edo Basic Education Sector Transformation (EdoBEST) programme, has been able to equip teachers with the tools and skills to execute a unique type of learning experience for children in the state.\nHe said, “For us as a government, our priority is our people because it is the people that create everything else.\n“That is why we have prioritized education in Edo and we are spending as much as we can afford on education and health sectors as they affect the people.\nThe Edo Basic Education Sector Transformation (EdoBEST) is acclaimed as one of the transparent educational projects on the continent and we want to extend it to impact on more children in Edo."
  },
  {
    "headline": "Edo govt has no record of alleged Appeal Court attack – SSG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has said it has no record of an attack at the Court of Appeal in Benin City and the alleged kidnap of an unnamed lawyer, noting that the allegations are fabrications by detractors to serve their selfish ends.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the state government or its agencies or officials have no record of the phantom ‘invasion’ of the Court of Appeal in the state.\nAccording to him, “At the weekend, a section of the media reported an alleged invasion of the Court of Appeal in Benin City, stating that court processes were carted away and that an unnamed lawyer was kidnapped.\n“Since then, certain parties have sought to suggest that the Edo State Government or its agents played a part in this alleged ‘invasion’.\n“Consequently, there is no basis whatsoever for the allegations that agents of the state were involved in any altercations at the courts that it so seriously reveres and protects.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "JUST IN: Nigeria’s GDP grows by 3.11% in Q1 2022",
    "summarized_story": "Nigeria’s Gross Domestic Product (GDP) grew by 3.11% year-on-year in the first quarter of 2022, according to the Gross Domestic Report, released by the National Bureau of Statistics (NBS).\nThe Q1 2022 growth rate was higher than the 0.51% growth rate recorded in the corresponding period of 2021 by 2.60% points and lower than 3.98% recorded in Q4 2021 by 0.88% points.\nOn a quarter-on-quarter basis, however, real GDP contracted by 14.66% in Q1 2022 compared to Q4 2021, reflecting a lower economic activity than the preceding quarter.\nOn the other hand, the non-oil sector grew by 6.08% in real terms during the reference quarter (Q1 2022).\nIn real terms, the non-oil sector contributed 93.37% to the nation’s GDP while the oil sector accounted for 6.63% of the GDP in the review period"
  },
  {
    "headline": "Vita Abba, ex-Enugu PDP chair, emerges party’s reps candidate for Nsukka/Igboeze",
    "summarized_story": "Engr Vita Abba, former chairman of the People’s Democratic Party (PDP) in Enugu State, has won the party primary election to contest for Nsukka/Igboeze federal constituency in the 2023 general election.\nAbba won with 91 votes, while Clinton Isiwu came second with 11 votes.\nAccording to the chairman of the election committee, 111 delegates participated in the exercise, but four of the votes were voided.\nSpeaking after he was declared winner, Abba said his constituency stands to benefit if he eventually gets elected in 2013.\n“This victory is a victory for PDP; victory for justice and victory for democracy in our constituency."
  },
  {
    "headline": "Union Systems partners Fidelity Bank to optimize trade finance operations",
    "summarized_story": "A leading Trade Finance Software Company, Union Systems Limited, has announced that Fidelity bank, a leading financial institution in Nigeria has chosen its KachasiTM Trade Finance Software and OptimusTM Corporate Portal, to automate its trade finance operations.\nThe bank’s decision to partner with Union Systems Limited is part of its wider digital transformation strategy, which has in recent times, led to the launch of several innovative products such as PayGate Plus and Virtual Card Account.\nFollowing a thorough evaluation process that included Finastra Trade Innovation System and China Systems’ Eximbills, the bank chose Union Systems’ Kachasi Trade Finance Software and Optimus Corporate Portal to automate its trade finance operation.\nKachasi is the first indigenous trade finance software application that automates the entire lifecycle of international and domestic trade finance operations.\nThe launch of the automated trade platform is in line with the Bank’s strategy of becoming a foremost financial institution in trade financing in Nigeria and across Africa”."
  },
  {
    "headline": "Enugu 2023: Mbaka blesses Barth Nnaji’s aspiration",
    "summarized_story": "Ejike Mbaka, has showered blessings on Barth Nnaji, former minister of power and one of the aspirants for the governorship of Enugu State.\n“One of my children will become the Governor after Gburugburu ( Governor Ugwuanyi).\nSomeone with a good heart and a good person.\nMy prayer is that he selects a man of peace, a good man.\nI am not recommending anyone to him but I am praying that God puts a good man into his heart.”"
  },
  {
    "headline": "Monkeypox: Children at risk of severe cases – NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC), has warned that severe cases of monkeypox are common in children.\nAccording to the NCDC, while there are only 46 suspected cases with 15 confirmed so far, countries such as the United Kingdom, the United States of America, Portugal, Spain and Canada, among others reported cases of the disease.\nThe centre assured Nigerians of its capacity to effectively diagnose and respond to cases, while it also warned that severe cases commonly occur in children.\nThe NCDC, in a message posted on its Facebook page, stated, “Monkeypox is usually self-limiting, with the symptoms lasting between two and three weeks.\nSevere cases are common among children."
  },
  {
    "headline": "Dissecting FG’s Withdrawal Of Nigeria From Int’l Basketball Competitions",
    "summarized_story": "Nigeria’s government fortnight announced the withdrawal of the country from all international basketball competitions for a period of two years due to unabated leadership tussle in the Nigeria Basketball Federation (NBBF).\nThe main function of a national sport federation is to provide more opportunities for people to get involved, increase participation levels and help people progress their level of sport along a ‘sport development continuum’.\nIt was the highest prize money paid for any professional sports league in Nigeria and the entire West Africa region.\nHe said the inactive domestic basketball league dragged the clubs backward and made it difficult catering for members of his family without the usual stipends and match-winning bonuses from competitions.\n“Most of the home based basketball players depend on the allowance they get from competitions to feed their family and pay their children school fees and so on."
  },
  {
    "headline": "JUST-IN: Nigeria’s GDP Grows By 3.11% In Q1 2022 – NBS",
    "summarized_story": "Gross Domestic Product (GDP) grew by 3.11% (year-on-year) in real terms in the first quarter of 2022, National Bureau of Statistics (NBS) claimed in a report that was released on Monday.\nThe first quarter 2022 growth rate further represents an improvement in economic performance.\nThe Q1 2022 growth rate was higher than the 0.51% growth rate recorded in Q1 2021 by 2.60% points and lower than 3.98% recorded in Q4 2021 by 0.88% points.\nNevertheless, quarter-on-quarter, real GDP grew at -14.66% in Q1 2022 compared to Q4 2021, reflecting a lower economic activity than the preceding quarter.\nThe nominal GDP growth rate in Q1 2022 was higher relative to the 12.25% growth recorded in the first quarter of 2021 and higher compared to the 13.11% growth recorded in the preceding quarter."
  },
  {
    "headline": "LG Autonomy: Federal Govt, NFIU Win In Court",
    "summarized_story": "Justice Inyang Ekwo of a Federal High Court sitting in Abuja, has okayed the position of the federal government and Nigerian Financial Intelligence Unit (NFIU), on local government joint accounts nationwide.\nThe NFIU had in June 2019 issued guidelines aimed at curbing crime vulnerabilities created by cash withdrawals from local government accounts by various state governments.\nThe Nigerian Governors Forum (NGF), however, dragged federal government and NFIU to court for interfering with state government powers to initiate transactions on local government joint accounts, citing provisions of the 1999 constitution.\nThe NFIU issued a guideline on money laundering risk and vulnerabilities, advising all banks not to honour transactions from joint accounts.\nIt directed that the States/Local Governments Joint Accounts should be used only for receiving funds and subsequently transferring them to local government accounts only."
  },
  {
    "headline": "Nigeria, Japan Sign Pact To Develop Baseball, Softball",
    "summarized_story": "Nigeria has strengthened its robust bilateral ties with Japan in the area of sports diplomacy as both countries have signed a Memorandum of Understanding (MoU) to develop baseball and softball in Nigeria.\nThe Nigeria Baseball and Softball Association (NBSA), the Embassy of Japan in Nigeria and Japan-Africa Baseball and Softball (J-ABS) Foundation signed the MoU during a ceremony at the MKO Abiola National Stadium, Abuja at the weekend.\nJapanese Ambassador to Nigeria, Kazuyoshi Matsunaga, while making his remarks at the occasion, said the baseball sport would help kids learn democratic ideas, respect for rules, and build peace.\n“The MoU is aimed at creating a bright future for Africa and Japan by promoting the values of baseball and softball between both countries”.\n“This is the hallmark of traditional baseball in Japan, which is the number one-ranked country in the sport."
  },
  {
    "headline": "Why PDP Should Postpone Its Presidential Primary Election – Omokri",
    "summarized_story": "A former aide to ex-President Goodluck Jonathan, Reno Omokri, on Monday, advised the Peoples Democratic Party (PDP) to postpone its presidential primary election.\nOmokri said Nigeria’s main opposition party should hold their primary election after the ruling All Progressives Congress’s presidential primary election.\n“If I will counsel the PDP, I would urge them to postpone their presidential primaries until the APC hold theirs.\nThirty-eight aspirants are in the race for the presidential tickets of the two leading parties.\nWhile the APC has 23, the PDP has cleared 15 aspirants to compete for its 2023 presidential ticket."
  },
  {
    "headline": "How General Useni lost £2m stashed abroad using pseudonym",
    "summarized_story": "The Royal Court in Jersey has seized nearly £2m of dirty money transferred into local bank accounts by General Jerry Useni, a right-hand man of late dictator Sani Abacha.\nGen Useni first opened an account in Jersey in 1986 in the name of ‘Mr Tim Shani’, who the general later admitted did not exist and he was the true account holder.\nOver the next 15 years, money totalling £1.9m was transferred into four accounts held by ‘Mr Shani’ with Standard Chartered Bank.\nThere followed several attempts by Gen Useni’s lawyer to unfreeze the accounts and, in 2007, Gen Useni finally identified himself as the true owner of the Shani accounts.\nJersey, officially called the Bailiwick of Jersey is an island country and self-governing Crown Dependency near the coast of north-west France."
  },
  {
    "headline": "TuBaba Idibia, 3 others visit Sound Sultan's grave",
    "summarized_story": "Veteran Nigerian singer, Innocent Idibia aka TuBaba and three others visited the grave of Sound Sultan who died of cancer last year.\n“Went to pay my respect to my brother SOUND SULTAN.\nThe deceased, Olanrewaju AbdulGaniu Fasasi aka Sound Sultan died aged 44 on July 11, 2021, after battling throat cancer.\nSultan released four albums under his former record label, Kennis Music.\nIn 2007, he partnered with his brother, Baba Dee to start a record label “Naija Ninjas”."
  },
  {
    "headline": "BREAKING: Nigeria Police Make U-turn, Say Kano Explosion Caused By Bomb Materials, Not Gas",
    "summarized_story": "The police command in Kano has confirmed that the explosion that killed nine persons last Tuesday was caused by chemicals used for making bombs.\nThis follows an investigation carried out by the Explosive Ordnance Disposal-Chemical, Biological, Radiological and Nuclear Defense, EOD-CBRN, and Operation Puff Adder of the Nigerian Police.\nA statement signed by the Police Public Relations Officer of the state command, Haruna Kiyawa, said the explosion was not caused by a gas cylinder as earlier claimed.\nScene of explosionKiyawa said the investigation showed that one of the victims, identified as Michael Adejo, “dealt in illicit storage of toxic chemicals and other hazardous materials”.\n“Meanwhile arrests have been made linking one of the collapsed shops with dealings in sales of illicit, toxic chemical substances and combustible materials suspected to be used for making Improvised Explosive Devices, IEDs."
  },
  {
    "headline": "Deborah Samuel: 13 Muslim Groups Demand Justice Against Killers",
    "summarized_story": "13 Muslim organisations, united under the banner of Muslims United for Peace and Justice, have demanded justice for Deborah Samuel, a student at Sokoto’s Shehu Shagari College of Education, who was gruesomely murdered for supposed blasphemy.\nThe organizations urged state and federal governments to enact and faithfully implement laws criminalizing blasphemy and murdering for blasphemy outside the law.\nProfessor Lakin Akintola, Executive Director of Muslim Rights Concern (MURIC), spoke at a news conference in Lagos alongside other Muslim leaders, appealing for justice against the killers, regardless of their purpose or explanation.\nAccording to him, the terrible occurrence may serve as a watershed moment in Muslim-Christian relations, ushering in a new era of peaceful coexistence, adding that these objectives were attainable if each religion follower embraced and honestly practiced their faith’s magnificent messages.\nHe urged Christians to use all means at their disposal to combat intolerance and urged Christian leaders to reflect deeply."
  },
  {
    "headline": "Updated: Soludo offers N10M reward for information on killers of Okoye",
    "summarized_story": "Governor Chukwuma Soludo has offered a N10 million reward for information to track the killers of the abducted lawmaker Okechukwu Okoye.\nSoludo expressed shock and deep sadness over the gruesome murder of Okoye, a lawmaker representing his home constituency.\n“But they can never cow down Isuofia and Anambra state”, he said..\nHe vowed that the perpetrators as well as all criminals operating in Anambra must be decisively brought to book.\n“Anambra will soon be a hell for these criminals”, Soludo assured."
  },
  {
    "headline": "BREAKING: One Dead As Building Collapses In Lagos Again",
    "summarized_story": "BREAKING: One Dead As Building Collapses In Lagos AgainOn the Lagos Island district of Lagos State, one person has been confirmed dead when a two-storey building collapsed.\nNEWS DIRECT learned of the incident on Saturday afternoon.\nPrior to its collapse, it was discovered that the building was under construction.\nThe structure on Freeman Road, Lagos Island, collapsed after heavy rain, according to an eyewitness.\nOne person was rescued alive, according to NEWS DIRECT."
  },
  {
    "headline": "Police reverse self, reveal real cause of Kano explosion, name victims",
    "summarized_story": "After five days, Kano state Police Command has confirmed that last Tuesday’s explosion that hit Aba road in Sabon Gari area was from Improvised Explosive Device (IED).\nThe statement said this development followed an outcome of investigation by the Explosive Ordnance Disposal-Chemical, Biological, Radiological and Nuclear Defense, EOD-CBRN, and Operation Puff Ader.\nAlso, names of the victims who died in the explosion and whose bodies were recovered and names released by the Police were Ejike Vincent (welder), Michael Adejo (chemical seller), Musa Kalla (tea seller), Christiana Abosede and Mary.\nOthers were Austin Dada, Madam Owoleke, Omo Ben and Bose Oladapo.\nShare this: TwitterFacebook"
  },
  {
    "headline": "6 days to presidential primaries… APC postpones screening, Southeast aspirants, Bankole echo consensus",
    "summarized_story": "But Borno state Governor Professor Babagana Zulum is of the view that President Muhammadu Buhari has the final say on who picks the party’s presidential ticket.\nAll the permutations and intrigues are coming just 6 days to the party’s presidential primaries scheduled to hold May 29/30.\nIn a terse statement, the party said: “The Screening Exercise for Presidential Aspirants of the All Progressives Congress (APC) earlier scheduled to be held on Monday, May 23rd, 2022, is hereby postponed.\nAny inconvenience caused is deeply regretted.”S/east, Bankole mull consensusAnd rising from its meeting Sunday in Abuja, presidential aspirants of the South-east extraction, expressed their readiness to back any of them chosen as a consensus aspirant.\nIn a communiqué issued after the meeting held at Senator Rochas Okorocha’s residence in Abuja, the APC presidential aspirants expressed their commitments to align with any of the South-east aspirants accepted by and chosen by other Nigerians to fly the APC flag."
  },
  {
    "headline": "With insecurity, northern children no longer ambitious – IBM Haruna",
    "summarized_story": "A former chairman, Arewa Consultative Forum and ex- federal commissioner for information and culture, Major-General Ibrahim Bata Malagwi Haruna (retd), has bemoaned the prevailing security challenges in the northern part of the country.\nHe also said failed leadership systems in the country discouraged youths in the region from assuming leadership responsibility.\n“Nigeria has not had true military rule neither has it had true democracy.\nA combination of both military and civilian misrule has brought the country to where we are currently are.\n“Our children in the north don’t seem to be ambitious."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "Ansaru Terrorists Protecting, Indoctrinating Some Kaduna Communities – Community Leader",
    "summarized_story": "He made the assertions on Channels Television’s breakfast programme Sunrise Daily while speaking on the security situation in the North West state.\nAbdurra’uf said: “If you look at Giwa and Birnin Gwari, the Ansaru presence is still there; nobody knows their motive.\nThat road is more secured than the Kaduna to Birnin Gwari Road because the Ansaru is in charge,” he said.\nHis comments are coming barely a week after Governor Nasiru El-Rufai of Kaduna State, during a security briefing, raised the alarm that Boko Haram and Ansaru terrorists are now in forests across the state.\nAruwan explained that 1,389 people were kidnapped by bandits in different attacks across Kaduna State during the period under review, including the 62 victims of the March 28 attack on an Abuja-Kaduna train."
  },
  {
    "headline": "Biden Vows To Defend Taiwan Militarily If China Invades",
    "summarized_story": "President Joe Biden vowed Monday that US forces would defend Taiwan militarily if China attempted to take control of the self-ruled island by force, warning Beijing was already “flirting with danger”.\nAsked if Washington was willing to get involved militarily to defend Taiwan, Biden replied simply: “Yes.”“That’s the commitment we made,” he added.\n“What signal does that send to China about the cost of attempting to take Taiwan by force?” he said.\nThe policy was designed both to keep Beijing from declaring war and also to stop Taiwan formally declaring independence.\n‘Policy Has Not Changed’A White House official said after Biden’s remarks that they did not constitute a divergence from Washington’s “One China” policy and its commitment to “provide Taiwan with the military means to defend itself”."
  },
  {
    "headline": "Insecurity In South East Politically-Motivated But Not Imported, Says Umahi",
    "summarized_story": "Governor Dave Umahi of Ebonyi State believes insecurity in the South East is politically-motivated but ruled out foreigners as the masterminds.\n“In my state, there was a time that the insecurity was highly politically-motivated and the targets were Imo State, APC, and Ebonyi State the moment I defected,” he told Channels Television’s Sunday Politics.\n“We did not have this large scale of insecurity until I defected.”But for how President Muhammadu Buhari handled the challenge, he said the spate of insecurity could have been worse in Nigeria and the South East specifically.\n“When people tend to say the insecurity in the southeast is imported, I don’t buy that because I am a governor and get security reports.\n“There are certain statements that we make as leaders that tend to elevate this insecurity,” Umahi maintained."
  },
  {
    "headline": "APC Postpones Presidential Screening Exercise",
    "summarized_story": "The ruling All Progressives Congress (APC) has postponed the screening of the 25 presidential aspirants slated for Monday, May 23rd.\nMorka added that a new date for the screening exercise will be communicated to the public shortly, without mentioning any specific time.\n“The Screening Exercise for Presidential Aspirants of the All Progressives Congress (APC) earlier scheduled to be held on Monday, May 23rd, 2022, is hereby postponed,” the terse statement read.\nSimilarly, Kogi State Governor, Yahaya Bello; his Jigawa State counterpart, Mohammed Badaru Abubakar; ex-Zamfara State governor, Sen. Ahmed Yerima; former Minister of Science, Technology and Innovation, Dr Ogbonnaya Onu; former Imo State governor, Sen. Rochas Okorocha and former Ogun state governor, Sen. Ibikunle Amosu are also not left out.\nThis is the second time that the APC National Working Committee will shift the date of the presidential screening after it failed to hold last weekend."
  },
  {
    "headline": "US Recession Not Inevitable – Biden",
    "summarized_story": "A recession in the United States is not inevitable, President Joe Biden said Monday, while acknowledging the economic pain experienced by Americans as inflation soars.\nSpeaking in Tokyo, Biden replied “no” when asked if a US recession is inevitable.\n“This is going to be a haul, this is going to take some time,” Biden said.\nWhile acknowledging the high fuel prices and food supply crunches caused by the war in wheat-producing Ukraine, Biden said his administration would continue to “grow our economy, create jobs”.\nLast week Treasury Secretary Janet Yellen said “I really don’t expect the United States to fall into a recession”."
  },
  {
    "headline": "I can vouch for Oyebanji's pedigree, competence- Sen Bamidele -",
    "summarized_story": "Speaking in Ado Ekiti on Friday as a Guest of Honour at an event organised by BAO’s Anchor Organization to drum support for the APC gubernatorial candidate.\nI’m here not only as Senatorial candidate but as a loyal party man who also believe in the competence and capacity of Biodun Abayomi Oyebanji to provide good governance in Ekiti State.\nGbenga Agbeyo said the Anchor groups were committed to ensuring that total victory was record for the APC governorship candidate come June 18.\nAwe called on APC leaders and members not to relent in their efforts at recording a landslide victory in the coming election.\nThe governorship candidate, who restated his commitment to issue- based campaign, called on party members to refrain from any act of violence during the electioneering period."
  },
  {
    "headline": "Nigeria needs a leader with revolutionary ideas",
    "summarized_story": "Ekiti State governor and APC Presidential aspirant Kayode Fayemi said Nigeria needs a young and vibrant leader that can employ revolutionary ideas in addressing the problems that befalls the country.\nHe stated this while visiting party delegates in Niger state.\nHe said he is determined to solve the problems of insecurity by revamping the entire security architecture of the country.\nHe is also expected to insatll a successor which will be the first time a sitting Governor in Ekiti State will return or install his successor since the creation of the State.\nNo sitting Governor has ever served consecutive terms or install a successor since 1999."
  },
  {
    "headline": "SERAP Urges INEC to publish accounts, balance sheets of all Parties -",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has urged Professor Mahmood Yakubu, the Chairman of the Independent National Electoral Commission (INEC) to “widely publish the reports on the accounts and balance sheet of every political party submitted by the Independent National Electoral Commission (INEC) to the National Assembly since 2015.”SERAP urged him to “urgently examine the books and records of financial transactions of political parties, and to make public the outcome of any such examination.”SERAP also urged him to “provide details of the guidelines, and steps that INEC is taking to prevent vote buying in the forthcoming elections in Ekiti and Osun states and 2023 general elections, and to prosecute vote buyers and other electoral offenders.”Recently, the All Progressives Congress (APC) collected N100 million for its presidential form while the opposition Peoples Democratic Party (PDP) collected N40 million for its presidential form for the 2023 election.\nSome leading political parties and politicians also spend between N250 to N14,000 to buy votes.https://www.tvcnews.tv/purplegold/post.php?post=197678&action=edit#In the letter dated 21 May, 2022 and signed by SERAP https://www.tvcnews.tv/purplegold/post.php?post=197678&action=edit#deputy director Kolawole Oluwadare, the organisation said: “Nigerians have the right to know about the accounts and financial transactions of their political parties, especially the major parties with a strong possibility to assume government in the future.”According to SERAP, “transparency and accountability of political parties is important to achieve greater transparency in public life, curb the influence of money in politics, promote a level playing field, and remove the risks to the independence of political actors and would-be public office holders.”SERAP also said, “It is both immoral and illegal to pay citizens to vote for a particular political party or candidate.\nIf we have not heard from you by then, SERAP shall consider appropriate legal actions to compel INEC to comply with our request in the public interest.”“The lack of transparency and accountability in political finance is seriously undermining the legitimacy and credibility of the democratic and electoral processes, and invariably contributing to denying the citizens the right to effective participation in their own government.”“The failure of political parties to comply with transparency and accountability frameworks would undermine citizens’ trust in their political parties and lack of trust will inevitably destroy confidence in the system and decrease citizens’ interest and participation in the democratic process.”“Elections are only one part of the democratic process, and a fair and effective electoral system must be founded in an adequate democratic infrastructure and responsibility of political leaders.”“According to our information, several political parties have for many years failed to submit their annual financial statements to INEC.\nMany political parties have failed to submit election expenses reports, and to disclose material contributions received from individuals and corporate bodies to the Commission.”“The Commission has also been apparently unable or unwilling to monitor, examine and publish these financial statements.”“Also, some leading political parties, politicians and other political actors reportedly paid between N250 to N14,000 to buy votes.\nFailure to comply is an offence under Section 86(2), which is punishable by imprisonment for a term of six months or a fine of N1,000,000 or both.”“Under Section 86(3)(4) INEC has the power to examine the records and audited accounts kept by any political party, and to publish the report on such examinations and audit in two national newspapers and Commission’s website within 30 days of receipt of the results.”“Section 226 (1) of the Electoral Act 2022 also requires INEC to prepare and submit a report every year to the National Assembly on the accounts and balance sheet of every political party."
  },
  {
    "headline": "Gunmen abduct Keffi Council Chairman, kill Orderly in Nasarawa -",
    "summarized_story": "Gunmen have abducted the chairman of Keffi Local Government of Nasarawa State, Muhammed Shehu and his aide Tanimu Mohammed.\nThe police orderly attached to the chairman, Alhassan Habeeb was also killed by the gunmen.\nTVC News gathered that the incident happened along the Akwanga-Keffi-Abuja highway on Friday night.\nMeanwhile, the state Commissioner of Police, Adesina Soyemi has confirmed the incident and assured that his men are on top of the situation."
  },
  {
    "headline": "Russian Soldier Jailed for Life after Admitting to Killing Civilian in First Ukraine War Crime Case",
    "summarized_story": "A court in Ukraine has jailed a Russian tank commander for life for killing a civilian at the first war crimes trial since the invasion.\nCaptured soldier Sgt Vadim Shishimarin was convicted of killing Oleksandr Shelipov, 62, in the north-eastern village of Chupakhivka on 28 February.\nThis trial in the Ukrainian capital Kyiv is being seen as Ukraine’s chance to prove, beyond doubt, that a Russian soldier killed a civilian with no regard for the rules of war.\nAt the time of the killing Shishimarin, 21, and other soldiers were travelling in a car they had seized after their convoy came under attack and they became separated from their unit.\nWhen they spotted Mr Shelipov he was speaking on his phone, Shishimarin told the court."
  },
  {
    "headline": "AfDB to Lend $500m to Women in 2022, Says Adesina",
    "summarized_story": "The President of the African Development Bank (AfDB), Dr. Akinwumi Adesina, Sunday said the bank would lend $500 million to women this year.\nHe added that the bank also paid out $483 million to financial institutions to lend to women businesses in 2021.\nAdesina in a statement he posted on his verified Twitter handle, @akin_adesina, added that with the support of French President, Mr. Emmanuel Macron and the G-7, the AfDB’s Affirmative Action for Women in Africa (AFAWA) was raising $5 billion for women businesses.\nAdesina’s remarks came as the bank commences its Annual Meetings for 2022.\nAdesina said, “The African Development Bank was ranked by Global Finance as the Best multilateral financial institution in the world in 2021."
  },
  {
    "headline": "Hayatu-deen Wants to Change the Character and Complexion of Nigeria’s Politics",
    "summarized_story": "Former banker and presidential aspirant on the platform of Peoples Democratic Party (PDP), Mohammed Hayatu-deen, says he is in the race to change the character and complexion of Nigerian politics.\nHayatu-deen said as an economist he knew what was needed to kick-start the economy and ensure Nigerians smiled again.\nBut the problem here is that we do not have any provision for these young Nigerians.\nHayatu-deen stated, “The media has a lot of role to play in sensitising delegates in both parties to ensure they pick the right candidates.\nI really love this nation,” Hayatu-deen declared."
  },
  {
    "headline": "Presidential Race: Tinubu, Osinbajo, Amosun Not Suitable for Nigeria’s Current Work Plan, Nwajiuba Says",
    "summarized_story": "With just a few days to the presidential primary of the All Progressives Congress (APC), presidential hopeful and former Minister of State for Education, Chukwuemeka Nwajiuba, has described the trio of Vice President Yemi Osinbajo, Bola Ahmed Tinubu, and Senator Ibikunle Amosun – all contenders for the APC ticket – as unsuitable for Nigeria’s current work plan.\nYou could have great leaders like Asiwaju Tinubu or men like Ibikunle Amosun, even the vice president, Yemi Osinbajo, who by their nature are very nice persons, they might not be suitable for the work plan now.\n“There are those, who mean well but being challenged by the age factor, like the former senate president, Ken Nnamani.\n“Olusegun Obasanjo had been president for eight years; Osinbajo has been vice president since 2015.\nWhy should the South-west say the north should cede power to the south and that they must be the beneficiary?"
  },
  {
    "headline": "US Will Intervene Militarily If China Invades Taiwan, Biden Says",
    "summarized_story": "President Biden said the U.S. would get involved militarily to defend Taiwan if China tries to take it by force, issuing a stark warning to Beijing during his first trip to Asia as commander in chief.\nThat’s the commitment we made,” Mr. Biden said on Monday in response to a question from a reporter about whether he was willing to get involved militarily if Taiwan came under threat.\nMr. Biden stressed that the U.S. remains committed to the bedrock “One China policy,” which recognizes the People’s Republic of China as the only legitimate government of China and acknowledges, but doesn’t endorse, Beijing’s claim that Taiwan is a part of China.\n“We agree with the One China policy and all the attendant agreements we made.\nBut the idea that it can be taken by force, just taken by force, would just not be appropriate,” Mr. Biden said."
  }
]