[
  {
    "headline": "COVID-19 here to stay, everyone could be infected –Expert",
    "summarized_story": "Lara AdejoroAn infectious disease expert at the Lagos University Teaching Hospital, Idi-Araba, Lagos, Dr. Iorhen Akase has urged Nigerians to get vaccinated against COVID-19, warning that almost everyone would eventually get infected with the viral infection.\nAccording to him, vaccines are the most critical tool and a game-changing tool in the fight against COVID-19.\n“The truth of the matter is that even with the fabric mask there is guidance on the use of masks generally.\n“In a single day, you are exposed to more than six people that have had COVID-19 knowingly or unknowingly.\nThe expert, however, stressed that fabric masks offer better protection against COVID-19 if they are double-layered or multilayered compared to single layers of cloth“COVID-19 is here to stay and whether we like it or not, everybody is going to have it."
  },
  {
    "headline": "COVID-19 here to stay, everyone could be infected –Expert",
    "summarized_story": "Lara AdejoroAn infectious disease expert at the Lagos University Teaching Hospital, Idi-Araba, Lagos, Dr. Iorhen Akase has urged Nigerians to get vaccinated against COVID-19, warning that almost everyone would eventually get infected with the viral infection.\nAccording to him, vaccines are the most critical tool and a game-changing tool in the fight against COVID-19.\n“The truth of the matter is that even with the fabric mask there is guidance on the use of masks generally.\n“In a single day, you are exposed to more than six people that have had COVID-19 knowingly or unknowingly.\nThe expert, however, stressed that fabric masks offer better protection against COVID-19 if they are double-layered or multilayered compared to single layers of cloth“COVID-19 is here to stay and whether we like it or not, everybody is going to have it."
  },
  {
    "headline": "Omicron variant ‘dangerous’, especially for unvaccinated, WHO warns",
    "summarized_story": "The Omicron variant of COVID-19 is dangerous – and especially so for those who have not been vaccinated against the disease, the World Health Organisation said Wednesday.\nThe WHO said the huge global spike in cases was being driven by Omicron but insisted there should be no surrender to the variant of concern.\n“While Omicron causes less severe disease than Delta, it remains a dangerous virus, particularly for those who are unvaccinated,” WHO chief Tedros Adhanom Ghebreyesus told a press conference.\n“We mustn’t allow this virus a free ride or wave the white flag, especially when so many people around the remain unvaccinated.\nThe “overwhelming majority” of people admitted to hospitals around the world were unvaccinated, he added."
  },
  {
    "headline": "Omicron variant ‘dangerous’, especially for unvaccinated, WHO warns",
    "summarized_story": "The Omicron variant of COVID-19 is dangerous – and especially so for those who have not been vaccinated against the disease, the World Health Organisation said Wednesday.\nThe WHO said the huge global spike in cases was being driven by Omicron but insisted there should be no surrender to the variant of concern.\n“While Omicron causes less severe disease than Delta, it remains a dangerous virus, particularly for those who are unvaccinated,” WHO chief Tedros Adhanom Ghebreyesus told a press conference.\n“We mustn’t allow this virus a free ride or wave the white flag, especially when so many people around the remain unvaccinated.\nThe “overwhelming majority” of people admitted to hospitals around the world were unvaccinated, he added."
  },
  {
    "headline": "Ignore calls for sack of DG NIA, group tells Buhari",
    "summarized_story": "According to the statement, “We wonder if the Arewa Youth Groups thinks the job of the DG of NIA is a political appointment where they expect the DG to come to the press and reel out his achievements.\n“We are tempted to believe that the Arewa Youth Groups is sponsored by enemies of the country and war against insurgency.\n“Arewa Youth Groups must understand that security issues are not discussed in the press.\nThe Convener concluded that the latest attack on the DG, Ahmed Rufa’i is an unnecessary distraction that Mr. President must reject.\nThe focus and determination amongst the security agencies and formation must be sustained to win the war against insurgency."
  },
  {
    "headline": "APC group distances Yari from El-Zakzaky",
    "summarized_story": "By Ibrahim Hassan-WuyoThe All Progressives Congress (APC) under Former Zamfara State Governor, Hon.\nAbdulaziz Yari Abubakar (Shattiman Zamfara) has frowned at a recent photoshop publication currently trending in the social media depicting the pictures of Shi’ite leaders in Nigeria, Malam Ibrahim El-Zakzaky and Abdulaziz Yari Abubakar.\nThe APC faction alleged that it was an attempt to paint Yari as a Shi’a sect adherent, ahead of the National Convention of the ruling party.\nIbrahim Muhammad(Danmadamin Birnin Magaji), Chairman Publicity Committee of the faction, said in a statement that the move, allegedly initiated by former Governor Abdulaziz Yari Abubakar’s adversaries was aimed at tarnishing his bright political future especially at this point in time when he is seen as the ‘only alternative’ for the position of National Chairman in the build-up to APC National Convention.\n“The project being implemented by some amateurs in the ‘art of religious deception’ also linked its emergence to two prominent figures of former Governor Abdulaziz Yari faction with a view to giving it credence, though they left traces of their appearance in the photoshop episode because beneath it is a political poster sponsored by a politician belonging to a particular faction battling with former Governor Abdulaziz Yari Abubakar’s faction.”“We want to say without fear of contradiction that Honorable Alhaji Abdulaziz Yari Abubakar (Shattiman Zamfara) is a Sunni Muslim who doesn’t hide his religious belief no matter the situation and he has never at any time belonged to Shi’ite sect for any reason, unlike his adversaries who use Religious Politics to cover their weaknesses.”“Instead of resorting to this old fashioned way of demeaning the popularity of a political figure of former Governor Abdulaziz Yari Abubakar (Shattiman Zamfara) standing, we admonish you to work hard and match your words with action so that the electorates will feel the better part of your leadership skills.”“Members of the public are now wiser than you thought and religious politics has no place in our polity because it had experimented before without success,” the group said."
  },
  {
    "headline": "2023: Osinbajo group vows to defeat moneybags at APC Convention",
    "summarized_story": "Vice President Yemi Osinbajo SAN presides over the Federal Executive Council Meeting at the State House, Abuja.\nPHOTO: Tolani AlliOmeiza Ajayi, AbujaThe Progressive Project TPP, a group working for the actualization of a Prof. Yemi Osinbajo presidency in 2023 has vowed to put in place strategies that will enable its candidate defeat established political moneybags at the presidential primaries of the All Progressives Congress APC and in the general election.\nHead of TPP’s Situation Room, Mr. Jeffrey Omoh who addressed representatives of the support group drawn from the nation’s six geo-political zones emphasized that their strategy shall emphasize “mobilization of delegates’ patriotism, not mobilization of Naira”.\n“We thank all members of the approximately 500 support groups who are already identifying with us, with firm commitment towards mobilizing Nigerians towards achieving an Osinbajo Presidency in 2023,” he said.\nAmong recommendations proffered by representatives of various pro-Osinbajo support groups were implementation of mobilization efforts across various wards in 774 local government councils, focus on reaching prospective delegates to the APC national convention and creation of state coordination teams across the federation."
  },
  {
    "headline": "3-year-old girl abandoned in church in Imo",
    "summarized_story": "By Chinonso Alozie – OwerriThe Imo State Police Command has found a 3-year-old girl abandoned in St Mulumba Catholic Church along Wethedral road in Owerri, Imo state.\nThe State Police Public Relations Officer, PPRO, Micheal Abattam, made this known to newsmen in Owerri on Wednesday.\nAccording to Police, the little girl was found deaf and dumb and it was difficult to get her details.\nThe police said: “The Imo State Police Command wishes to inform the general public of an abandoned female child named unknown about 3 years old fair in complexion.\n“The baby girl who is deaf and dumb was found abandoned in the premises of St Mulumba Catholic Church Wethedral road at about 17:30 hours of 1st January 2022 and all efforts made to trace the parents proved abortive.”However, the police called on “Members of the public who may know the child or the parents to come to the office of the Police Public Relations Officer, for identification and collection.”Vanguard News Nigeria"
  },
  {
    "headline": "Suspected killer of UniJos students, others arrested",
    "summarized_story": "By Marie-Therese NanlongThe Police in Plateau State have arrested and paraded one Moses Oko, a 20-year-old suspected Yahoo boy who allegedly killed one Jennifer Anthony, a 300L UNIJOS Student whose dead body was found on January, 1st, 2022.\nThe suspect was paraded alongside suspected personal effects of the deceased as well as blood-soaked bedsheet and blood-stained fork allegedly used to pluck the deceased’s eyes.\nAddressing journalists at the Police headquarters in Jos, the CP said, “The Command through my leadership has put together a lot of strategies to prevent crimes in Plateau State.\n“Upon receipt of the report, Police detectives attached to ‘A’ Division immediately swung into action and the following persons; Esther Sunday ‘f’ aged 26years; Jemila Thomas ‘F’ aged 36years; Victoria Danladi ‘f’ aged 36years and Joy Nnamani ‘f’ aged 18years all of Kabong Gada Biu Jos were arrested.\n“The Suspects have confessed to the crime and case has been transferred to the National Agency for the Prohibition of Trafficking in Persons (NAPTIP).”Others who were equally paraded were suspected cultists, robbery suspects and suspected kidnappers."
  },
  {
    "headline": "WHO appoints Toyin Saraki as ambassador for global health",
    "summarized_story": "The World Health Organization (WHO) Foundation has appointed Toyin Saraki as the inaugural WHO Foundation Ambassador for Global Health.\nThe wife of ex-Senate President, Bukola Saraki, is a global health advocate and Founder-President of Wellbeing Foundation Africa.\n“Her energy and deep commitment to educating, advocating and fundraising on behalf of WHO Foundation’s mission, will make a critical difference to global health initiatives.\nShe called the WHO body a force for good in the global health ecosystem, driving change to overcome pressing global health challenges.\n“I look forward to working with the foundation to propel one of the world’s most influential global health initiatives forward,” Saraki noted."
  },
  {
    "headline": "COVID-19 vaccines may need to be updated – WHO",
    "summarized_story": "The World Health Organization (WHO) Technical Advisory Group, has announced that current COVID-19 vaccines may need to be updated.\nA statement from the team on COVID-19 Vaccine Composition says it is important to ensure they are effective against Omicron and future variants.\nMembers recommend “urgent and broad access” to current vaccines for protection and to mitigate the emergence of new variants of concern (VOC).\nThey are analysing emerging VOCs “in the context of criteria that would trigger a recommendation to change COVID-19 vaccine strain composition and will advise WHO on updated vaccine compositions, as required”.\n“Until such vaccines are available, and as the SARS-CoV-2 virus evolves, the composition of current COVID-19 vaccines may need to be updated."
  },
  {
    "headline": "2023: Buhari trying to bribe us, playing smart – Nigerians react as FG lifts Twitter ban",
    "summarized_story": "Nigerians have accused President Muhammadu Buhari of trying to play smart ahead of the 2023 general elections.\nReacting to the lifting of the ban on Twitter, some Nigerians said the Buhari government was trying to bribe them ahead of the polls.\nSome tweets gathered by DAILY POST read below…@rapizo: “Buhari is trying to play smart, we are in a pre-election year.\nHe is trying to get Nigerians to vote for APC.”@teribamos: “Our president is trying to bribe Nigerians, why wait till now to lift the Twitter ban in Nigeria?\nThe ban became necessary because of those miscreants using the platform to inflame terrorism.”@chibu_zor: “Lifting ban at this time is good, and God bless this govt."
  },
  {
    "headline": "Nigerian govt lifts ban on Twitter",
    "summarized_story": "The Federal Government of Nigeria has lifted the suspension of Twitter operations in the country, following President Muhammadu Buhari’s approval.\nThe decision was revealed by the Chairman Technical Committee Nigeria-Twitter Engagement and Director-General National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi, CCIE.\n“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\nIn November last year, Information Minister Alhaji Lai Mohammed, said correspondence between us and Twitter had reached an advanced stage.\n“Very soon, all issues will be resolved in a way that will be good for both our country and Twitter.”"
  },
  {
    "headline": "Policeman-turned-governor – Obasanjo praises Alao-Akala",
    "summarized_story": "Former President Olusegun Obasanjo has declared his admiration of the life of the late Adebayo Alao-Akala.\nObasanjo praised the deceased for not limiting himself, becoming a governor from being in the police.\nIn a condolence letter to the Head of Akala Family in Ibadan, Obasanjo, said the death was a grievous loss to them, friends, associates and supporters.\nHe noted that Alao-Akala contributed immensely to the development and stability of Oyo State and Nigeria.\n“Indeed, the vacuum created by his death would undoubtedly be difficult to fill."
  },
  {
    "headline": "UPDATED: FG lifts suspension on Twitter, warns users",
    "summarized_story": "The Federal Government has lifted the suspension of Twitter operation in Nigeria with five conditions following approval by President Muhammadu Buhari.\nBut the government warned all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous and distasteful information on the platform.\nHe said: “Therefore, the FGN lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January 2022.\nWe encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform.\n; andf) Working with Twitter and other global companies to build an acceptable code of conduct following the global best practice.”"
  },
  {
    "headline": "Full text: FG lifts suspension on twitter",
    "summarized_story": "FG LIFTS SUSPENSION OF TWITTER OPERATIONSThe Federal Government of Nigeria (FGN) directs me to inform the public that President Muhammadu Buhari, GCFR, has approved the lifting of the suspension of Twitter operation in Nigeria effective from 12am tonight, 13th January 2022.\nSubsequently, in its wisdom, the Presidential Committee set a 20-member Technical Committee comprising all relevant government agencies.\nTherefore, the FGN lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January 2022.\nWe encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform.\nSimilarly, the Presidential Committee commends the Technical Committee for a professional, robust and productive engagement with Twitter Inc."
  },
  {
    "headline": "BREAKING: FG lifts suspension on Twitter",
    "summarized_story": "The Federal Government has lifted the suspension of Twitter operations in Nigeria after approval by President Muhammadu BuhariThe decision was announced by the Chairman Technical Committee Nigeria-Twitter Engagement and Director-General National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi, CCIE.\nKashifu, in a statement in Abuja, said the approval was given following a memo written to the President by Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\nRead Also: Ban: Twitter meets conditionsHe said: “The Federal Government of Nigeria (FGN) directs me to inform the public that President Muhammadu Buhari, GCFR, has approved the lifting of the suspension of Twitter operation in Nigeria effective from 12am tonight, 13th January 2022.\n- Advertisement -“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\n“In the Memo, the Minister updated and requested the President’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation.”Details shortly…"
  },
  {
    "headline": "BREAKING: Ebonyi PDP Publicity Secretary slumps in court",
    "summarized_story": "The People’s Democratic Party (PDP) Publicity Secretary in Ebonyi State Nwoba Chika Nwoba has slumped in court.\nNwoba slumped around 3 pm when he was brought to the Magistrate Court 3 inside the Ebonyi Judiciary Headquarters Abakaliki by the Police on Wednesday.\nWhen he was brought to court on Wednesday, he slumped as he was about entering the court.\nEfforts to resuscitate him failed, forcing the Police to rush him out of the court premises possibly to a hospital.\nAt the time of this report, he was still in the car in a slumped state under the sun."
  },
  {
    "headline": "Alao-Akala: When not to die",
    "summarized_story": "SIR: The people of Oyo State woke up yesterday, Wednesday, January 12 to the bad news of the death of Otunba Christopher Adebayo Alao-Akala, their former governor.\nHe ruled the political terrains of Ogbomoso, nay Oyo State from 1996 until he died.\nOtunba Alao-Akala was an Ogbomoso man through and through.\nSo also is former Oyo State Commissioner of Women Affairs, Professor Taibat Bolanle Danmole, nee Oyewumi and now, former governor of the state, Otunba Christopher Adebayo Alao-Akala.\nOne commiserates with the governor of Oyo State, Oluwaseyi Abiodun Makinde, the good people of Oyo State and the immediate families of the departed."
  },
  {
    "headline": "Massacre In Niger As Gunmen Kill 37, Burn Houses, Food Stuff In Reprisal Attack",
    "summarized_story": "From John Adams, MinnaGunmen went haywire in Niger communities on Tuesday killing 37 people in what could be regarded as a reprisal attack after special hunters and local vigilantes killed scores of the gunmen on Friday last week.\nThe latest massacre took place on Tuesday at about 11:00am in Nakuna and wurukuchi communities when the villagers were in the farm to harvest their farm produce.\nWhile 10 people, belonging to one family were killed right in their farm, 20 bodies were discovered in the bush, all in Nakuna.\nThe entire houses in Nakuna community with about 200 population was burnt down by the gunmen who invaded the community in search of local vigilantes according to source close to the community.\nAlso the gunmen who came in their numbers, burnt down all the food barns in the community before leaving."
  },
  {
    "headline": "Gunmen kill 23 persons in Plateau",
    "summarized_story": "From Gyang Bere, JosNo fewer than 18 persons were killed on Tuesday night by gunmen suspected to be Fulani herdsmen at Ancha village in Miango District of Bassa Local Government Area of Plateau State.\nAlso, five persons were reportedly killed in different attacks at Tyana village in Riyom Local Government Area of the state.\nIt was gathered that the attacked which lasted for close to two hours without security intervention, left 18 persons death, six injured and 24 households with 100 residential homes razed down.\nWhile the killings at Nzhwerenvi and Ncha villages of Bassa Local Government Area left two persons death and three others sustained gunshots injuries.\nHe explained further that one Monday Stephen was ambushed and killed on Monday 10 January 2022 on his way to the farm at Ncha village."
  },
  {
    "headline": "Kalu mourns demise of ex-Gov Akala",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has expressed sadness over the passing of former Governor of Oyo state, Otunba Adebayo Alao- Akala.\nWhile commiserating with the government and people of Oyo state, Kalu urged the Akala family to uphold the good deeds of their late patriarch.\nHe said, “I received with a heavy heart the news of the passing of former Governor of Oyo State, Otunba Adebayo Alao- Akala.\n” The deceased was a consummate politician and philanthropist, who was committed to the growth and progress of Oyo State and Nigeria.\nThe former Governor urged the Akala family to take solace in the fact that the late politician lived a fulfilled life."
  },
  {
    "headline": "Ex-Oyo Governor Adebayo Alao-Akala is dead",
    "summarized_story": "From Oluseye Ojo, IbadanA former governor of Oyo State, Otunba Adebayo Alao-Akala, is dead.\nDaily Sun has learnt that the governor of the state between 2007 and 2011 died in the early hours of today.\nAlthough there has not been an official confirmation of his death, close aides to him said he died in the early hours of today in his Ogbomoso residence.\nAlao-Akala, who also served as deputy governor in the state between 2003 and 2007, was 71-years-old.\nOne of the security details of the governor said: ‘Oga went to bed yesterday night and with instruction that we would travel from Ogbomoso to Ibadan today."
  },
  {
    "headline": "Kalu rejoices with Senate President Ahmad Lawan at 63",
    "summarized_story": "By Iheanacho Nwosu, LagosFormer Governor of Abia State and Chief Whip of the Senate Dr Orji Kalu has described the Senate President, Senator Ahmad Lawan, as a patriotic statesman and compassionate politician.\nKalu, acknowledging the contributions of the Senate President to the growth and development of Nigeria, stressed that the celebrant is a strong advocate of democracy.\nIn a goodwill message, Kalu prayed for a longer life for the celebrant, noting that the Senate President deserves commendation for complementing the efforts of President Muhammadu Buhari in repositioning the country.\n‘On behalf of the people of Abia North Senatorial District, I congratulate the President of the Senate, Senator Ahmad Lawan on the occasion of his 63rd birthday anniversary,’ Kalu stated.\n‘In his current capacity, the Senate President has been a rallying point for his colleagues and contemporaries."
  },
  {
    "headline": "Nigeria Lifts Ban on Twitter",
    "summarized_story": "Olawale AjimotokanThe federal government of Nigeria has lifted the ban on Twitter effective from 12 midnight of January 13, 2022.\nSubsequently, in its wisdom, the Presidential Committee set a 20-member Technical Committee comprising all relevant government agencies.\nThe statement stressed that Twitter has agreed to enroll Nigeria in its Partner Support and Law Enforcement Portals, which provides a direct channel for government officials and Twitter staff to manage prohibited content that violates Twitter community rules.\n“Therefore, the FGN lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January 2022.\n“We encourage all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Breaking: Ex-Oyo Gov, Alao-Akala, Dies at 71",
    "summarized_story": "Kemi Olaitan in IbadanFormer Governor of Oyo State, Otunba Adebayo Alao-Akala, is dead.\nIt was gathered that the chieftain of the All Progressives Congress (APC) died on Wednesday.\nHowever, the cause of his death is still unknown at the time of filing this report.\nBorn on June 3, 1950, at Ogbomoso in the Ogbomoso North local government area of Oyo State, he had his elementary school at Osupa Baptist Day School, Ogbomoso before proceeding to Kamina Barracks Middle School, 5th Battalion of Infantry in Tamale, Ghana.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ernest Adegunle Oladeinde Shonekan, GCFR, CBE, 1936-2022",
    "summarized_story": "At each budget year, Chief Shonekan would be invited to critique our budget proposals, and gave us further input to enrich the final budget.\n“As a leader, Chief Shonekan was well-respected, because of the enormous goodwill he brought into governance.\nThe statement said, “Chief Shonekan was a first-class administrator, boardroom guru and astute leader, whose imprint in the business and political firmaments cannot be erased.\nIn his brief time as Head of State, Chief Shonekan tried his best to advance peace, stability and development in Nigeria.\n“Even outside office, Chief Shonekan remained committed to the unity, stability and development of our nation."
  },
  {
    "headline": "INTELS Responds to FG, Says Process of Awarding Pilotage Contract Not Closed",
    "summarized_story": "Eromosele AbiodunThe battle to retain its service boat contract in the pilotage district of Lagos, Warri, Bonny, Port-Harcourt and Calabar, which expired on August 8, 2020, may not be over yet as INTELS Nigeria Limited yesterday said it does not consider the process of awarding the Pilotage contract closed.\nINLTELS argued the service boat contract was being carried out by it for over a decade with excellent results both in terms of the service rendered and the revenue generated in favour of the NPA and by extension, Nigeria.\nIt is also the subject of a pending arbitration.\nThis has resulted in a significant and constant financial benefit for the NPA.”The second point, the statement added, was about the debt ratio between IINTELS/affiliate and the NPA.\nThat is, approximately $20 million per year for the 15 years set out in the settlement proposal."
  },
  {
    "headline": "Umahi in State House, Informs Buhari of His Presidential Ambition",
    "summarized_story": "Says Ohaneze should not dabble into politicsDeji Elumoye in AbujaGovernor Dave Umahi of Ebonyi State was on Tuesday at the State House, Abuja to inform President Muhammadu Buhari of his intention to run for President under the platform of the ruling All Progressives Congress (APC) in 2023.\nUmahi’s visit is coming barely 24 hours after the APC National Leader, Senator Bola Ahmed Tinubu, also visited the Villa to inform the President of his presidential ambition.\nThe governor, who spoke with newsmen after a closed-door meeting with President Buhari, said he stands a better chance to emerge as APC presidential candidate going by his pedigree as a governor in one of the South East states.\nUmahi said he was now ready to consult widely about his presidential ambition having informed the President who is the leader of “our great party”.\nAsked if he had informed the Igbo Socio-cultural group, Ohaneze, about his ambition, the governor said that was not necessary adding that the group should not involve itself in politics."
  },
  {
    "headline": "88,000 AK-47 Rifles, Other Firearms Missing From Nigerian Police Custody – Audit Report",
    "summarized_story": "A report by the Office of the Auditor-General of the Federation (AuGF) has revealed that over 88,000 AK-47 rifles and other firearms and ammunition in the custody of the Nigerian Police Force are missing or unaccounted for.\nThe audit reviewed arms movement register, monthly returns of arms and ammunition and ammunition register at the armoury section.\nA breakdown of the missing firearms showed that 601 firearms are missing from 15 training institutions; 42 in 23 formations; 1514 missing in 37 police commands; 29 missing in zone 1-12 were not also reported as required by law, with 1,721 firearms are missing in Police Mobile Force (PMF) 1-68.\nAccording to the report, 10 contracts totalling N1.136billion were awarded to a single proprietor in the name of different companies.\nConsequently, the auditor-general’s office asked the police force to explain why contracts were awarded to companies owned by same persons."
  },
  {
    "headline": "88,000 AK-47 Rifles, Other Firearms Missing From Nigerian Police Custody – Audit Report",
    "summarized_story": "A report by the Office of the Auditor-General of the Federation (AuGF) has revealed that over 88,000 AK-47 rifles and other firearms and ammunition in the custody of the Nigerian Police Force are missing or unaccounted for.\nThe audit reviewed arms movement register, monthly returns of arms and ammunition and ammunition register at the armoury section.\nA breakdown of the missing firearms showed that 601 firearms are missing from 15 training institutions; 42 in 23 formations; 1514 missing in 37 police commands; 29 missing in zone 1-12 were not also reported as required by law, with 1,721 firearms are missing in Police Mobile Force (PMF) 1-68.\nAccording to the report, 10 contracts totalling N1.136billion were awarded to a single proprietor in the name of different companies.\nConsequently, the auditor-general’s office asked the police force to explain why contracts were awarded to companies owned by same persons."
  },
  {
    "headline": "88,000 AK-47 Rifles, Other Firearms Missing From Nigerian Police Custody – Audit Report",
    "summarized_story": "A report by the Office of the Auditor-General of the Federation (AuGF) has revealed that over 88,000 AK-47 rifles and other firearms and ammunition in the custody of the Nigerian Police Force are missing or unaccounted for.\nThe audit reviewed arms movement register, monthly returns of arms and ammunition and ammunition register at the armoury section.\nA breakdown of the missing firearms showed that 601 firearms are missing from 15 training institutions; 42 in 23 formations; 1514 missing in 37 police commands; 29 missing in zone 1-12 were not also reported as required by law, with 1,721 firearms are missing in Police Mobile Force (PMF) 1-68.\nAccording to the report, 10 contracts totalling N1.136billion were awarded to a single proprietor in the name of different companies.\nConsequently, the auditor-general’s office asked the police force to explain why contracts were awarded to companies owned by same persons."
  },
  {
    "headline": "Widow Of Policeman Killed By Officers Chasing ‘Yahoo Boys’ Exposes Lies Police Shamelessly Told Against SaharaReporters",
    "summarized_story": "SaharaReporters had on Tuesday exclusively reported that Ayeni, who was riding on a bike, was crushed by the RRS van chasing suspected internet fraudsters from opposite direction.\n“The RRS operatives were in two Hilux vehicles chasing a Benz.\nHe stated that some RRS operatives were pursuing some internet fraudsters (Yahoo boys) and in the process hit a policeman riding on a black bike.\nHe said the accident was terrible and that the RRS operatives had put the policeman in their vehicle.\nSee Also Police Identity Of Policeman Crushed To Death By Police Van Chasing ‘Yahoo Boys’ In Ekiti, Revealed“When I got there, I saw the bike mangled."
  },
  {
    "headline": "Widow Of Policeman Killed By Officers Chasing ‘Yahoo Boys’ Exposes Lies Police Shamelessly Told Against SaharaReporters",
    "summarized_story": "SaharaReporters had on Tuesday exclusively reported that Ayeni, who was riding on a bike, was crushed by the RRS van chasing suspected internet fraudsters from opposite direction.\n“The RRS operatives were in two Hilux vehicles chasing a Benz.\nHe stated that some RRS operatives were pursuing some internet fraudsters (Yahoo boys) and in the process hit a policeman riding on a black bike.\nHe said the accident was terrible and that the RRS operatives had put the policeman in their vehicle.\nSee Also Police Identity Of Policeman Crushed To Death By Police Van Chasing ‘Yahoo Boys’ In Ekiti, Revealed“When I got there, I saw the bike mangled."
  },
  {
    "headline": "Pay tax, support government to manage prohibited content... FG lists agreements reached with Twitter",
    "summarized_story": "President Muhammadu Buhari has approved the lifting of the suspension on the Twitter operations in Nigeria.\nSome of the conditions include legal registration of operations, taxation, and managing prohibited publications in line with Nigerian laws.\nWhile announcing the lifting of the ban, the government noted that Twitter has agreed to meet the set out conditions.\nAdvertisementAdvertisementENROL NIGERIAN OFFICIALS TO MANAGE PROHIBITED CONTENTThe federal government said the company also agreed to enrol Nigeria in its Partner Support and Law Enforcement Portals.\nAccording to the statement, the portal will provide a direct channel for government officials and Twitter staff to manage prohibited content that violates Twitter community rules."
  },
  {
    "headline": "Pay tax, support government to manage prohibited content... FG lists agreements reached with Twitter",
    "summarized_story": "President Muhammadu Buhari has approved the lifting of the suspension on the Twitter operations in Nigeria.\nSome of the conditions include legal registration of operations, taxation, and managing prohibited publications in line with Nigerian laws.\nWhile announcing the lifting of the ban, the government noted that Twitter has agreed to meet the set out conditions.\nAdvertisementAdvertisementENROL NIGERIAN OFFICIALS TO MANAGE PROHIBITED CONTENTThe federal government said the company also agreed to enrol Nigeria in its Partner Support and Law Enforcement Portals.\nAccording to the statement, the portal will provide a direct channel for government officials and Twitter staff to manage prohibited content that violates Twitter community rules."
  },
  {
    "headline": "Okagbare identified as 'accomplice' in US first-ever Olympic anti-doping trial",
    "summarized_story": "Okagbare’s alleged inclusion among the evidence built against Lira was announced in a statement released on Wednesday by the US department of justice and titled “first Olympic anti-doping charges”.\nAlthough the two-time African Championships gold medallist is not directly named in the criminal complaint, details suggest Okagbare is the “athlete 1” identified among Lira’s clients.\nThe details included a series of texts between Okagbare and Lira dated June 22, 2021.\nThe Nigerian was also the only athlete sanctioned for doping before the semi-finals of the women’s 100-meter race in Tokyo.\nOkagbare, who was not listed amongst the defendants, was slammed with another two anti-doping charges by the AIU last October."
  },
  {
    "headline": "Okagbare identified as 'accomplice' in US first-ever Olympic anti-doping trial",
    "summarized_story": "Okagbare’s alleged inclusion among the evidence built against Lira was announced in a statement released on Wednesday by the US department of justice and titled “first Olympic anti-doping charges”.\nAlthough the two-time African Championships gold medallist is not directly named in the criminal complaint, details suggest Okagbare is the “athlete 1” identified among Lira’s clients.\nThe details included a series of texts between Okagbare and Lira dated June 22, 2021.\nThe Nigerian was also the only athlete sanctioned for doping before the semi-finals of the women’s 100-meter race in Tokyo.\nOkagbare, who was not listed amongst the defendants, was slammed with another two anti-doping charges by the AIU last October."
  },
  {
    "headline": "Oil price hits $85 a barrel -- first time in three months",
    "summarized_story": "Oil price surpassed $85 a barrel for the first time in three months.\nOn Wednesday, Brent crude futures, the global benchmark, rose 1.66% to $85.11 a barrel by 19.06 GMT+1, while West Texas Intermediate (WTI) crude futures increased 2.25 percent to $83.05 a barrel.\nThe price of Brent crude had crossed the $85 mark on October 15, 2021.\nThe bank added that it expects oil prices to “overshoot” to $125 a barrel this year and $150 in 2023.\nIn the 2022 budget, President Muhammadu Buhari earmarked $62 per barrel as the oil benchmark, up from the $57 per barrel in 2021."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "TLcom Capital backs Nigeria’s SeamlessHR in $10m Series A round",
    "summarized_story": "Nigerian startup SeamlessHR, which provides payroll and HR software-as-a-service (SaaS) solutions for medium to large-sized companies in several African countries, has closed a new $10 million Series A round.\nAfrica-focused VC firm, TLcom Capital led the round while some of SeamlessHR’s existing investors participated once again, such as Lateral Capital and Enza Capital.\nSeamlessHR started in 2013 as Insidify.com, a jobs aggregator with a recruitment management system that matched employers to job seekers.\nAfter several iterations, the founders made a strategic pivot, relaunching in 2018 as an enterprise-grade, cloud-based HR and payroll management SaaS.\n“Thanks to our customers, we have become the leading cloud HR and Payroll SaaS in Africa in such a short time,” CEO Okeleji said."
  },
  {
    "headline": "Unchecked ambition, lax regulations: The genesis of predatory digital lenders in Nigeria",
    "summarized_story": "But, as the years went by, new digital lenders popped up at different corners.\nSome digital lenders even started giving out loans to people with bad ratings on credit bureau—an obvious red flag.\nWhen debtors defaulted, the banks, however, unlike digital lenders, responded differently to the defaults.\nFortunately, a number of governing bodies are beginning to do something about these digital lenders.\nIf victims like Anyaeji and his friends would ever be free from the disturbance and intimidation from these predatory digital lenders, Nigeria’s regulators would have to increase the pace of their response."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Here are the confirmed speakers for Techpoint Build 2021",
    "summarized_story": "Share this article:On January 22, 2022, we’ll be hosting the largest gathering of startup investors, entrepreneurs, and tech enthusiasts in Africa.\nSo, in no particular order, here are your speakers for Techpoint Build 2021.\nHe will be your host at Techpoint Build 2021.\nShe is CEO and founder of Edukoya, an education technology company building the largest online learning platform in Africa.\nThis is not a comprehensive list of all our speakers and will be updated as we receive confirmation."
  },
  {
    "headline": "ANKA’s Series A, Cyberattacks in Africa",
    "summarized_story": "Share this article:Hi there,Here’s what we’re discussing today:ANKA’s Series ACyberattacks in AfricaANKA raises $6.2 million Series AThe ANKA teamIvorian eCommerce startup, ANKA, has announced its $6.2 million pre-Series A round.\nWith the fresh injection of capital, it will be focusing on building the mobile infrastructure of ANKA’s eCommerce SaaS, hiring more talent, and product development.\nCyberattacks in AfricaPhoto by Dan Nelson on UnsplashIf you’re anything like me, you don’t lose any sleep over potential cyberattacks.\nAccording to the cybersecurity firm, Check Point Research, the fourth quarter of 2021 witnessed an astonishing rate of cyberattacks, with organisations seeing about 925 cyberattacks weekly.\nOf all regions surveyed, Africa had the highest volume of attacks, with organisations on the continent facing 1353 attacks weekly."
  },
  {
    "headline": "Crypto made it to AFCON! Aren’t African governments wary?",
    "summarized_story": "Anyways, the entire situation was surprising since AFCON is one of the world’s major continental tournaments, like Euros and Copa America.\nGetting the global crypto-trading platform on AFCON basically translates to legitimately allowing millions of Africans to see crypto ads on every matchday.\nThe terms of the partnership involve having Binance adverts placed on the perimeter boards on all the stadiums hosting AFCON matches.\nNigeria continues to lead crypto peer-to-peer transactionsIt might not be convenient to argue that the football governing body for Africa, the Confederation of Africa Football (CAF), isn’t aware of this apathy.\nClubs like Tottenham Hotspur FC, Brighton & Hove Albion FC, Cardiff City FC, Crystal Palace FC, Leicester City FC, Newcastle United FC, and Southampton FC make the list."
  },
  {
    "headline": "Nigeria government lifts ban on Twitter after securing agreements",
    "summarized_story": "The Nigerian government has lifted the ban it placed on microblogging platform, Twitter, after about 8 months of freezing its operations in the country.\nTwitter has agreed to enrol Nigeria in its Partner Support and Law Enforcement Portals.\n“Therefore, the FGN lifts the suspension of the Twitter operations in Nigeria from midnight of 13th January 2022.\nConsidering Twitter’s influence on our democracy, our economy, and the very fabric of our corporate existence as a Nation, our priority is to adapt, not ban, Twitter.\n”The Nigerian government cautioned all users of the Twitter platform to maintain ethical behaviour and refrain from promoting divisive, dangerous, and distasteful information on the platform."
  },
  {
    "headline": "Tighter US monetary policy worsens outlook for Nigeria’s economy – World Bank",
    "summarized_story": "The World Bank has predicted that any decision by the United States to tighten its monetary policy will have an adverse effect on the economic outlook of countries such as Nigeria.\nMany informed observers now expect a four-quarter point interest rate rise this year along with the Fed selling some government bonds it owns.\nHowever, tighter monetary policy should not be confused with a highly restrictive monetary policy stance.\nThe World Bank estimates that recovery in developing economies will fall by almost 6 percent short of the initial pre-pandemic expectations.\nThe President of the World Bank, David Malpass indicated that the prospects in 2022 are unlikely to be favorable for Developing economies."
  },
  {
    "headline": "Global oil, gas investment projected to grow by $26bn in 2022",
    "summarized_story": "Oil and gas investments have been projected to expand by $26 billion this year on the back of new upstream gas and Liquefied Natural Gas (LNG) investments, energy research firm Rystad Energy has said.\nIn addition, it is also projected that these segments will be the fastest-growing in the current year, with a jump in investments from $131 billion in 2021 to around $149 billion in 2022.\nWhile sanctioning activity in North America is expected to pick up, with over $40 billion in projects scheduled for approval in 2022.\nIn the same vein, the report also noted that Africa in 2022 is expected to be another quiet year, with projects worth a comparatively small $5 billion expected to be sanctioned.\nAccording to the report, when it comes to offshore field sanctioning, the global approvals pipeline for 2022 contains approximately 80 projects worth a total of $85 billion."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Nigerian govt lifts Twitter ban after 222 days",
    "summarized_story": "The government of President Muhammadu Buhari has announced lifting of a ban it imposed on Twitter in Nigeria since June 2021.\nThe regime initially insisted that the social media giant must register as a business and open an office in Nigeria, a demand that was rejected by Twitter.\nHowever, Mr Abdullahi who announced the decision said the president only acted on a recommendation to lift the suspension.\n“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\n“In the Memo, the Minister updated and requested the President’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation.”Facebook Notice for EU!"
  },
  {
    "headline": "Sterling Bank Powers Art with Imperium",
    "summarized_story": "Sterling Bank Plc has partnered with the Nike Art Gallery to install solar panels at the gallery via the bank’s Imperium outlet as part of its commitment to a renewable energy powered Nigeria as well as the development of the nation’s tourism sector.\nThis follows recent partnerships with the gallery to drive an appreciation as well as the investment opportunities available in the arts and tourism sectors in Nigeria.\nThe renewable energy sector is one of the five sectors of the economy that the bank is presently concentrating investments in.\nShina Atilola, Divisional Head for Retail and Consumer Banking at Sterling Bank added that the bank attempts to enrich lives and unlock new opportunities in Nigeria’s tourism sector through partnerships with key tourism industry players as well as other sectors where investments are being focused under its HEART’s of Sterling programme.\nHe further urged interested prospects to equally approach officers of the bank for discussions on other products of the bank or visit www.imperiumng.com."
  },
  {
    "headline": "JABU debunks rumours on Ogunbiyi’s PhD title",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Board of Trustees, Governing Council, Senate, and Management of Joseph Ayo Babalola University (JABU), Ikeji Ararkeji, Osun State has countered the speculations on Dr Akin Ogunbiyi’s PhD title, confirming that the award is authentic and genuine.\nIn a letter signed by the University registrar, Pastor Dapo Adeniyi, the institution cleared the air on the insinuation that the chairman of Mutual Benefits Assurance Plc has been “lying to the public and deceiving Osun People” on his PhD title.\nTo set the record straight, the letter was forwarded to pressmen by the campaign office of the gubernatorial aspirant of the People’s Democratic Party in Osun State.\n“As a member of the Joseph Ayo Babalola University Alumni Association, you have consistently exemplified yourself with a deep sense of duty and tenacity toward the growth of the University.\nIt argued that Dr Ogunbiyi parades one of the best credentials amongst the PDP aspirants having studied at Yale and Oxford Universities among other top institutions in the world."
  },
  {
    "headline": "Ex-Oyo Governor, Alao-Akala dies at 71",
    "summarized_story": "Former Oyo State governor, Otunba Christopher Alao-Akala has died, aged 71.\nAlao-Akala was enlisted as Cadet Inspector of Police in June 1974, at the Nigeria Police College, Ikeja.\nKwara State Command, Ilorin; Assistant Commissioner of Police, Agodi Area Command, Ibadan, Oyo State Police Command, Ibadan.\nDr. Alao-Akala was a businessman who founded and chaired TDB Global Ventures and Parrot FM radio station, both in Ogbomoso, Oyo State.\nFollowing the impeachment of then incumbent Governor, Rashidi Ladoja, Alao-Akala was sworn into office in January 2006 and served for 11 months."
  },
  {
    "headline": "BREAKING: Federal Govt Lifts Twitter Ban",
    "summarized_story": "The Federal Government of Nigeria has lifted the suspension of Twitter operations in the country, following President Muhammadu Buhari’s approval.\nIn a statement in Abuja, Kashifu noted the approval was given following a memo written to President Buhari by the Minister of Communications and Digital Economy, Prof. Isa Ali Ibrahim.\nADVERTISEMENT“The approval was given following a memo written to the President by the Honourable Minister of Communications and Digital Economy, Prof Isa Ali Ibrahim.\n“In the Memo, the Minister updated and requested the President’s approval for the lifting based on the Technical Committee Nigeria-Twitter Engagement’s recommendation,” he said.\nRecall that Twitter was suspended in June, 2021, days after Buhari’s tweet was deleted by the microblogging platform."
  },
  {
    "headline": "Oyo Senatorial Hopeful, Ajani, Mourns Ex-Gov Alao-Akala",
    "summarized_story": "Alao-Akala, a chieftain of the All Progressives Congress (APC) died on Wednesday morning at the age of 71 in his country home of Ogbomoso, Oyo State.\n“His death is a big blow to Oyo State as a whole.\nOur amiable Governor Seyi Makinde had to end the State activities (interfaith prayer) to honour the late former governor.\nLate Alao-Akala was a thorough-breed politician with many people-friendly initiatives to his credit.\nHe, therefore, called for the immortalisation of the late Alao-Akala in order to preserve his memories."
  },
  {
    "headline": "Kwara Restates Commitment To Peaceful Co-existence By Muslims, Christians",
    "summarized_story": "Kwara State government has pledged to continue to do everything within its power to sustain the existing harmonious co-existence by Muslims and Christians in the state.\nSa’adu Salahu, the SSG expressed delight that “Kwara is a state of harmony where Muslims and Christians live peacefully together.\nThe guest lecturer, Justice Mas’ud Oniye, urged Muslims to learn the Holy Qur’an even as adults.\nHe reminded the Muslims that the Holy Qur’an contains solutions to all problems.\nShe said Ilorin and Kwara as a whole are known for their peaceful nature, adding that all hands must be on deck to sustain the peaceful environment."
  },
  {
    "headline": "Kwara Restates Commitment To Peaceful Co-existence By Muslims, Christians",
    "summarized_story": "Kwara State government has pledged to continue to do everything within its power to sustain the existing harmonious co-existence by Muslims and Christians in the state.\nSa’adu Salahu, the SSG expressed delight that “Kwara is a state of harmony where Muslims and Christians live peacefully together.\nThe guest lecturer, Justice Mas’ud Oniye, urged Muslims to learn the Holy Qur’an even as adults.\nHe reminded the Muslims that the Holy Qur’an contains solutions to all problems.\nShe said Ilorin and Kwara as a whole are known for their peaceful nature, adding that all hands must be on deck to sustain the peaceful environment."
  },
  {
    "headline": "Report On Suspension Of Convention Till June Fake News – APC",
    "summarized_story": "The All Progressives Congress (APC) has described as fake news in some quarters, report that it has suspended process of its national convention till June this year.\nADVERTISEMENT“The general public is advised to completely disregard fake news on the reported suspension of the planned National Convention of the All Progressives Congress (APC) till June, as reported by some media outlets.\n“The faceless authors and sponsors of fake news on APC activities, in this case the planned National Convention are simply bent on causing confusion and formenting crisis through misinformation.\n“As a focus-driven, process-oriented political party, the APC Caretaker Committee under the leadership of Governor Mai Mala Buni will not be distracted by self-serving antics of these sponsors of fake news.\n“The APC Caretaker Committee is already embarking on nationwide consultations with Party stakeholders to prepare the ground for a rancour-free National Convention."
  },
  {
    "headline": "Twitter: After 222 days, Buhari lifts ban",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has lifted the suspension on Twitter operations in the country, effective from 12 am, January 13, 2022.\nThis was disclosed in a press statement on Wednesday signed by the Director-General of the National Information Technology Development Agency and Chairman Technical Committee Nigeria-Twitter Engagement, Kashifu Abdullahi.\nThe statement read in part, “The Federal Government of Nigeria directs me to inform the public that President Muhammadu Buhari, has approved the lifting of the suspension of Twitter operation in Nigeria effective from 12 am tonight, January 13, 2022.\n“The approval was given following a memo written to the President by the Minister of Communications and Digital Economy, Prof Isa Pantami.”Details later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Twitter: After 222 days, Buhari lifts ban",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has lifted the suspension on Twitter operations in the country, effective from 12 am, January 13, 2022.\nThis was disclosed in a press statement on Wednesday signed by the Director-General of the National Information Technology Development Agency and Chairman Technical Committee Nigeria-Twitter Engagement, Kashifu Abdullahi.\nThe statement read in part, “The Federal Government of Nigeria directs me to inform the public that President Muhammadu Buhari, has approved the lifting of the suspension of Twitter operation in Nigeria effective from 12 am tonight, January 13, 2022.\n“The approval was given following a memo written to the President by the Minister of Communications and Digital Economy, Prof Isa Pantami.”Details later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "NLNG discredits online Train 7 vacancies",
    "summarized_story": "By KEN EMORDIThe attention of Nigeria LNG Limited (‘NLNG’) has been drawn to an online advertisement announcing vacancies for its Train 7 Project positions.\nThe advertisement goes further to request that interested persons join WhatsApp groups created for the purpose of progressing such employment.\nNLNG expressly disassociates itself from the advertisement and hereby informs the general public that the said advertisement or any others along the same lines are false, fraudulent and calculated to mislead unsuspecting members of the public.\nNeither NLNG nor its contractors have commenced recruiting for the Train 7 Project, for which construction activities are yet to commence.\nNLNG expressly disclaims any liability for any losses incurred by any person(s) as a result of reliance on such fraudulent advertisements, communications, e-mails or publications."
  },
  {
    "headline": "NLNG discredits online Train 7 vacancies",
    "summarized_story": "By KEN EMORDIThe attention of Nigeria LNG Limited (‘NLNG’) has been drawn to an online advertisement announcing vacancies for its Train 7 Project positions.\nThe advertisement goes further to request that interested persons join WhatsApp groups created for the purpose of progressing such employment.\nNLNG expressly disassociates itself from the advertisement and hereby informs the general public that the said advertisement or any others along the same lines are false, fraudulent and calculated to mislead unsuspecting members of the public.\nNeither NLNG nor its contractors have commenced recruiting for the Train 7 Project, for which construction activities are yet to commence.\nNLNG expressly disclaims any liability for any losses incurred by any person(s) as a result of reliance on such fraudulent advertisements, communications, e-mails or publications."
  },
  {
    "headline": "Lagos shuts Epe-Ijebu Ode Highway as Buhari visits Ogun",
    "summarized_story": "The Lagos State Government has announced traffic diversion from Epe/Ijebu-Ode Highway and Abeokuta Interchange as President Muhammadu Buhari visits Ogun today.\nThe closure of the road will be from 7.00am till 4.00pm in preparation for Buhari’s visit to Ogun.\nHe advised motorists from Lagos inbound Abeokuta to use the Lagos-Sango/Abeokuta Road and the Mowe-Ofada-Papalanto-Abeokuta or alternately utilise the Ijebu-Ode, Omu –Ketu, Epe Road to access their destinations.\nThe Commissioner reaffirmed that traffic management personnel had been drawn from both States to manage the flow of traffic along the aforementioned routes.\nOladeinde appealed for the cooperation of road users to minimise inconvenience, reduce travel time and foster safety."
  },
  {
    "headline": "Foodies Lekki to open branches in Ikoyi, Ikeja, other locations",
    "summarized_story": "Foodies Lekki has said it plans to expand operations by opening more branches in prime locations on the Island and beyond.\n“We are also planning to go to Ikoyi in Awolowo Road, and of course, to the Mainland by opening a branch in G.R.A, Ikeja.\nHe explains, “People call from Ikorodu, some even call to ask for the address and we are on Admiralty Way, Lekki.\nSpeaking about the uniqueness of the Food Brand, the manager said Foodies is founded on the concept of healthy living rather than just food.\n“ Foodies is one of the most recent fast food places that is taking care of people in terms of meals they eat."
  },
  {
    "headline": "Cameroon Senator Shot Dead In Restive Anglophone Region",
    "summarized_story": "An opposition senator, Henry Kemende has been shot dead in western Cameroon where a bloody insurgency waged by anglophone separatists against the state and his party, an official said.\nHe had been a lawyer and lawmaker for the Social Democratic Front (SDF), one of Cameroon’s main opposition parties.\n“We recovered his body, his chest riddled with bullets”, said Joshua Osih, the vice president of the SDF.\nArmed groups are regularly accused of abducting, killing or injuring civilians whom they accuse of “collaborating” with Cameroonian authorities.\nOsih said separatist elements opposed the SDF because it is a predominantly English-speaking party that participates in the political process and is opposed to the partition of Cameroon."
  },
  {
    "headline": "BREAKING: After 7 Months, Buhari Lifts Twitter Ban",
    "summarized_story": "The suspension of Twitter operations in Nigeria has been lifted by the President, Major General Muhammadu Buhari (retd.\n), with effect from 12 a.m. on January 13, 2022.\nKashifu Abdullahi, Director-General of the National Information Technology Development Agency and Chairman Technical Committee Nigeria-Twitter Engagement, made the announcement in a press statement on Wednesday.\nThe statement read in part, “The Federal Government of Nigeria directs me to inform the public that President Muhammadu Buhari, has approved the lifting of the suspension of Twitter operation in Nigeria effective from 12 am tonight, January 13, 2022.\n“The approval was given following a memo written to the President by the Minister of Communications and Digital Economy, Prof Isa Pantami.”Details later…"
  },
  {
    "headline": "How Ex-Oyo Governor Was Found Dead In His Room After Trip To Abuja",
    "summarized_story": "How Ex-Oyo Governor Was Found Dead In His Room After Trip To AbujaChief Akin Oke, Chairman, All Progressives Congress Caretaker Committee in Oyo State, has confirmed the death of Chief Adebayo Alao-Akala, a former Governor of the state.\nNewsmen report that the former Governor was confirmed dead in the early hours of Wednesday at the age of 71.\n“Please, let’s talk later.”Also confirming his death, a former Military Governor of Oyo State, retired Major General Oladayo Popoola, described the demise of Alao-Akala as shocking.\nThe source said: “He returned from Abuja yesterday (Tuesday) and still held meeting with some people in the evening.\nHe was Deputy Governor from 2003 to 2007, and later governor from 2007 to 2011 on the platform of the Peoples Democratic Party."
  },
  {
    "headline": "17 Things You Need To Know About Late Ex-Oyo Governor Alao-Akala",
    "summarized_story": "17 Things You Need To Know About Late Ex-Oyo Governor Alao-AkalaA former Oyo Governor Otunba Christopher Alao-Akala, is dead, He was 71.\nHe was a former Governor of Oyo State and a candidate of the ADP in the 2019 Governorship election in Oyo State.\nHe also attended the Administrative Staff College, Topo, Badagry; the Nigeria Institute of International Affairs (NIIA), Victoria Island, Lagos; Police Staff College, Jos; Command and Staff College, Jaji.\nHe served as the Deputy Governor of Oyo State from May 2003 to January 2006.\nFollowing the impeachment of then-incumbent Governor (Rashidi Ladoja), Alao-Akala was sworn into office as Governor in January 2006 and served for 11 months."
  },
  {
    "headline": "Breaking: At last, FG lifts ban on Twitter",
    "summarized_story": "The Federal Government has lifted the suspension of Twitter operations in Nigeria after approval by President Muhammadu BuhariThe decision was announced by the Chairman Technical Committee Nigeria-Twitter Engagement and Director-General National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi.\nDetails loading…"
  },
  {
    "headline": "Nigerians tired of Killings – Senate President",
    "summarized_story": "Worried by unending killings in the country by different groups of criminals, the President of the Senate, Ahmad Lawan, said Wednesday that Nigerians are tired of stories on such carnages.\n“I however believed that things can be turned around for better within the remaining one and half years left for this present administration , inclusive of the 9th National Assembly,” he said.\n“The security situation in the country is begging for more attention and it shall be given because that is the primary purpose of governance “, he added.\n“The first thing done by the 9th National Assembly in this regards , was the restoration of the January – December budget implementation timeline , which has helped in stabilising the economy.\n“The 9th National Assembly based on legislative agenda set at both Chambers in June 2019, has also helped in stabilising the polity through results – driven harmonious working relationship with the executive arm of government."
  },
  {
    "headline": "Breaking: Top PDP official collapses in Court",
    "summarized_story": "The Publicity Secretary of the People’s Democratic Party (PDP) Ebonyi state chapter, Nwoba Chika Nwoba, Wednesday collapsed in Court.\nNwoba was supposed to be arraigned on Tuesday at the Magistrate Court two, Abakaliki, but police failed after bringing him to court premises same day.\nBut on Wednesday when police finally brought Nwoba who looked very ill after being in their custody for about four days to the court, he collapsed while working to the court room.\nNwoba was brought to the court in police Hilux van, and was dropped about half a pole to the court room, on coming down from the van, he staggered to the court room which he could not enter before he felt flat on the ground.\nThe arraignment of Nwoba was supposed to hold by 9am but he was brought to the court at 3:10pm."
  },
  {
    "headline": "FG Lifts Twitter Suspension After Seven Months",
    "summarized_story": "The Federal Government has lifted the suspension on microblogging site, Twitter, seven months after it suspended the social media platform in Nigeria.\nThis was contained in a statement issued by the Chairman Technical Committee Nigeria-Twitter Engagement and Director-General National Information Technology Development Agency (NITDA), Kashifu Inuwa Abdullahi.\n“Therefore, our engagement will help Twitter improve and develop more business models to cover a broader area in Nigeria.\nNigeria halted Twitter operations in June after the company deleted a comment by Buhari, provoking an international outcry over freedom of expression.\nBut the presidency said the move had nothing to do with the social media platform’s action."
  },
  {
    "headline": "Ikoyi Building Collapse: Provisional Approval Not Given Before Construction Started – LASBCA",
    "summarized_story": "The Lagos State Building Control Agency (LASBCA) has told a coroner inquest inquiring into the Nov.1 collapse of the 21-storey building at Gerard Road, Ikoyi, Lagos that construction of the three high-rise blocks began months before provisional approval was granted.\nDisputing Olawale’s claims, Odugbemi said that LASBCA never granted Osibona a provisional planning permit when the team moved to the site to commence construction in January 2019.\nHe stated that LASBCA granted provisional approval in April 2019.\n“Will you be surprised if evidence is provided to you right now that work had started before the provisional planning approval was granted in April 2019?” Odugbemi said.\nOne of the deceased was Mr Femi Osibona, the Managing Director of Fourscore Heights Ltd, the contractor of the project."
  },
  {
    "headline": "Former Oyo Governor Christopher Alao-Akala Dies At 71",
    "summarized_story": "A former governor of Oyo State, Christopher Alao-Akala, is dead.\nAlao-Akala was a former governor of Oyo State and sought re-election under the Action Democratic Party (ADP) in the 2019 governorship election in the state.\nHe was elected the vice-chairman of ALGON, Oyo State Chapter between 1999 and 2002.\nHe served as the Deputy Governor of Oyo State from May 2003 to January 2006.\nAlao-Akala later contested and won the governorship election in 2007 under the platform of the PDP and became the Executive Governor of Oyo State, serving a full term till May 2011."
  },
  {
    "headline": "Three Children, Woman Confirmed Dead In Delta Building Collapse",
    "summarized_story": "﻿One more person has been confirmed dead in the church building collapse in Delta State, raising the death toll to four.\nThe Police Public Relations Officer in Delta, Bright Edafe, had also confirmed that 18 other people trapped in the rubble were rescued.\nAlthough it is unclear if those rescued are all children, Edafe said the search and rescue operations were over.\nWhen the building collapsed on Tuesday, several persons were feared to be trapped in the rubble.\nSearch and rescue operations began thereafter, leading to the recovery of the survivors from the rubble, but not without four lives lost."
  },
  {
    "headline": "Real Madrid Down Barcelona To Reach Spanish Super Cup Final",
    "summarized_story": "Real Madrid struck a fifth Clasico victory in a row on Wednesday to advance to the Spanish Super Cup final but Barcelona’s young guns showed why there is belief the club’s recovery has begun.\nREAD ALSO: Chelsea Beat Tottenham To Reach League Cup FinalAt the end of a pulsating contest in Saudi Arabia, Madrid scraped through 3-2 after extra-time and will now face either Atletico Madrid or Athletic Bilbao, who play on Thursday, in Sunday’s final."
  },
  {
    "headline": "Shonekan was a unifying force for Nigeria",
    "summarized_story": "Former President, Olusegun Obasanjo has described former Head of the Interim National Government (ING), Ernest Shonekan as a unifying force for the nation.\nHe said his contribution to the growth and development of democracy in Nigeria cannot be forgotten in a hurry.\nFormer President Obasanjo said “He would be remembered as a man of sustained strongwill to succeed.\nHe further discribed the former Head of Interim National Government as “a unifying force for the nation and his contribution to the growth and development of democracy in Nigeria cannot be forgotten in a hurry.\nIndeed, Chief Shonekan died at a time the country is in dire need of his leadership, wealth of experience and wisdom to tackle the multifaceted challenges facing the nation.”"
  },
  {
    "headline": "President Buhari pays tribute to life, legacy of ex-interim President, Shonekan -",
    "summarized_story": "President Muhammadu Buhari has received with profound sadness the news of the death of a great statesman and former Head of the Interim National Government, Chief Ernest Shonekan.\nIn a statement by his media aide, Femi Adesina, the President extends deepest condolences to Chief Shonekan’s wife, Margaret, loved ones, as well as the government and people of Ogun State.\nThe President notes that Chief Shonekan demonstrated to all that the love for country and commitment to her development, peace and unity transcend the trappings of office and the transient nature of political power.\nAccording to him, Nigeria owes a great debt to Chief Shonekan, the peacemaker, who even at the twilight of his life time never stopped believing and working for a prosperous and democratic country.\nThe President prays that the memory of the departed Head of Government will remain a blessing to Nigeria even as he finds perfect peace with Almighty God."
  },
  {
    "headline": "Photos: Super Eagles players having walk out ahead Egypt clash -",
    "summarized_story": "Nigeria’s senior national team, Super Eagles, on Tuesday morning had a walkout exercise ahead of the AFCON match against the Pharaoh’s of Egypt.\nBoth Egypt and Nigeria will this evening open the group D matches in the ongoing AFCON 2021 competition in Cameroon."
  },
  {
    "headline": "More than 200 people killed in recent attacks on Zamfara communities",
    "summarized_story": "The People’s Democratic Party in Zamfara said the casualty figure in the recent bandits attack on seven Communities in two Local Government Areas of the state is over two hundred and not fifty eight as the Government state claimed.\nThe PDP said, the casualty in Bukuyyum Local Government Area alone is over one hundred and fiftyZamfara state Chairman of the party Bala Condemn the killings described it as barbaricThe opposition party has also raised the alarm over an alleged sinister plot by the ruling All Progressives Congress to frame up, arrest and detain critical stakeholders of the partyThe party adds that the Move is unpolitical and an attempt to Intimidate and Silence Opposition Parties in zamfaraBala Mande insist that the PDP in Zamfara will not stop speaking the mind of the MassesThe Ruling All Progressive Congress and the Main opposition party PDP in Zamfara have been at logger head in recent timesThe clash has now taken a different dimension as both parties are accusing each other for being responsible for the worsening Insecurity in the state“Plenty of our members are the list of arrest by Security Operatives following directives of the state government authorities”“As we speak, Security agencies are on the trail of Prof. Kabiru Jabaka the Vice Chairman of the PDP Simply because he spoke the the truth and expose the weakness of the Zamfara State Government” Bala MandeThey Called on International Community to deny travel Visa to undemocratic political leaders in Nigeria."
  },
  {
    "headline": "Orji Uzor Kalu Challenges Tinubu – Trending with Ojy Okpe",
    "summarized_story": "Reactions continue to trail the declaration made by Asiwaju Bola Tinubu, a former Governor of Lagos State, who has made his intention known to run for the Presidency in 2023.\nThe Chief Whip of the Senate, Senator Orji Uzor Kalu, who is the latest to join the race generated reactions on social media after he boasted on Tuesday that he has all it takes to match Tinubu grit for grit for the ticket of the All Progressives Congress.\nMeanwhile on Tuesday evening, the salvation ministry, a church in Delta State, collapsed during the church service, leaving members of the congregation including children trapped in the rubble.\nThe building which was being used for the first time, reportedly collapsed at about 5:55pm.\nEighteen persons were reported to have been rescued after officials of the Red Cross, the fire service, and security agencies arrived at the scene."
  },
  {
    "headline": "Segun Osoba Remembers Ernest Shonekan’s Legacy",
    "summarized_story": "Former Governor of Ogun State, Olusegun Osoba and personal friend of the late elder statesman, Ernest Shonekan speaks on the life and times of the leader of the interim government of 1993 who passed away on Tuesday."
  },
  {
    "headline": "Bode George: PDP is Ready for Whatever the APC Will Throw at It, Including Tinubu",
    "summarized_story": "Former National Vice-Chairman and former military Governor of Ondo State, Chief Bode George bares his mind on ARISE TV about the chances of former Lagos State Governor and APC National Leader, Bola Ahmed Tinubu in emerging as President in the 2023 General Elections"
  },
  {
    "headline": "In Yorubaland, A Kingmaker Cannot Be King, Bode George Tells Tinubu",
    "summarized_story": ""
  },
  {
    "headline": "Burkinabe Soldiers Held Over Plot to ‘Destabilise’ Institutions",
    "summarized_story": "Authorities in Burkina Faso say eight soldiers, including a high-ranking commander, have been detained in connection with an alleged plot to “destabilise” the country’s institutions.\nThe military prosecutor’s office said in a statement it had learned of the alleged plot on Saturday after “a member of the gang” denounced the plan.\nAn investigation has been launched and eight soldiers have been detained for questioning, it added.\nSecurity sources told the AFP news agency that Lieutenant Colonel Emmanuel Zoungrana, commander of western forces fighting armed groups in the country, was among those arrested.\nOne of the security sources said “suspicions of a plot to destabilise [the government] with ramifications abroad” had hung over Zoungrana and several soldiers since protests erupted in November calling for Kabore to go over the rising violence."
  }
]