[
  {
    "headline": "Buhari felicitates UN Chief over re-appointment",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), on Saturday congratulated the Secretary-General of the United Nations, António Guterres, on his re-appointment for a second term in office.\nHe also congratulated Nigeria-born Deputy Secretary-General, Amina Mohammed, on her reappointment.\nThe Senior Special Assistant to the President on Media and Publicity, Garba Shehu, disclosed this in a statement titled ‘President Buhari congratulates UN Secretary-General, António Guterres, Deputy, Amina Mohammed on second tenure.’The statement read in part “President Buhari congratulates the Secretary-General and Deputy Secretary-General, who was a former Minister of Environment in Nigeria, for the global recognition and opportunity to serve humanity with their experience, trusting that their passion to promote peace, alleviate poverty, improve health and empower more people will gain more speed and results.”Buhari expressed confidence that Mohammed’s extended stay in office will embolden more women and girls, especially in Africa and Nigeria, to aspire to new heights of leadership, dream beyond the borders of their country and learn from her dedication to seeing lives transformed for the better.\nHe also praised the former minister for her contributions to development, at home and abroad, praying that the Almighty God will grant her good health, strength and more wisdom for the journey ahead."
  },
  {
    "headline": "NEDC to advert food insecurity, malnutrition in North-East",
    "summarized_story": "The North East Development Commission has moved to avert food insecurity and malnutrition in the troubled North-East region.\nThis was disclosed by the Managing Director of the Commission, Mohammed Alkali, at a stakeholders’ meeting in Maiduguri on Saturday.\nAlkali lamented that “over 2.6 million people risk facing food crisis in Borno state alone,” adding that the commission has already taken action to respond to threats of food insecurity and malnutrition.\nHe revealed that the commission is mobilizing resources to stockpile food items and avert looming famine and malnutrition among children in the region.\nIn their contributions, representatives of State Emergency Management Agencies from Adamawa, Bauchi, Borno, Gombe, Taraba and Yobe states and other partners stressed the need for a coordinated meeting to avert food insecurity and malnutrition."
  },
  {
    "headline": "South-East governors, Igbo leaders urge Northern counterpart to protect Ndigbo",
    "summarized_story": "… endorse South East Security Outfit – Ebubeagu…condemn activities of violent secessionist groups in South EastBy Chinedu Adonu, Peter Okutu, EnuguSouth East governors have called on Northern governors and others to protect their people leaving in the zone.\nThe meeting also had in attendance other South East leaders including Ministers, National Assembly members, Traditional Rulers and Clergymen.\nIn a communique signed by the Chairman, South East Governors Forum and Governor of Ebonyi State, Engr.\n“The impression that South East leaders are silent over some of our youths agitators for secession is not correct.\nSouth East Governors, Ohaneze President, National Assembly members, notable leader had come out publicly many timesin the past to speak against such agitations."
  },
  {
    "headline": "Stop destroying our banners Lagos PDP warns APC; You’re attention seekers APC responds",
    "summarized_story": "Lagos State chapter of the PDP on Saturday decried the destruction of its campaign banners and posters allegedly by supporters of the ruling APC.\nPDP raised similar concerns in a statement issued in May, cautioning APC supporters to stop the destruction of the party’s campaign materials.\n“They should teach their followers to be more tolerant,’’ Lagos PDP Chairman, Adedeji Doherty, told the News Agency of Nigeria (NAN) on Saturday, in Lagos.\nBabajide Sanwo-Olu, the Lagos APC State Chairman, Alhaji Babatunde Balogun, the Lagos State Commissioner of Police, CP Hakeem Odumosu, the Department of State Security and other security agencies to urgently look into the trend.\n“This is not my personal opinion though; our political history in Lagos State since the advent of this democratic dispensation is explicitly clear about that."
  },
  {
    "headline": "Buhari congratulates UN Secretary-General, António Guterres, Deputy, Amina Mohammed on second tenure",
    "summarized_story": "By Johnbosco AgbakwuruPresident Muhammadu Buhari has felicitated with Secretary-General of the United Nations, UN, António Guterres on his re-appointment for a second term in office, and extension of Deputy Secretary-General, Amina Mohammed’s tenure for another five years.\nThis was contained in a statement issued by the Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu in Abuja on Saturday.\nAccording to the statement, President Buhari congratulated the Secretary-General and Deputy Secretary-General, who was a former Minister of Environment in Nigeria, for the global recognition and opportunity to serve humanity with their experience, trusting that their passion to promote peace, alleviate poverty, improve health and empower more people will gain more speed and results.\nThe President said he believes Mohammed’s extension in office will further encourage more women and the girl-child, particularly in Africa and Nigeria, to aspire to new heights of leadership, dream beyond the borders of their country and learn from her dedication to seeing lives transformed for the better.\nHe extolled the former minister for her contributions to development, at home and abroad, praying that the Almighty God will grant her good health, strength and more wisdom for the journey ahead."
  },
  {
    "headline": "Buhari urges ECOWAS leaders to mount pressure on Mali to return to civil rule",
    "summarized_story": "By Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari on Saturday called on West African leaders to mount pressure on the military leadership in Mali to ensure that the transition process in the country was not aborted.\n”Pressures are needed to ensure that the transition process in Mali, which is half-way to its conclusion, is not aborted.\nOn Libya, President Buhari faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they are disarmed and non-collaboration with regional stakeholders.\n”This positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens.\n”The region has experienced two waves of the Covid-19 pandemic, with the second wave being more prevalent with higher death rates."
  },
  {
    "headline": "Eulogy as Mbanefo family holds thanksgiving service to mark 100-year-old title in Onitsha",
    "summarized_story": "By Vincent UjumaduThe renowned Mbanefo Odu family of Onitsha yesterday held a special thanksgiving service to mark the centenary of the Odu –Osodi title in the ancient town.\nThe thanksgiving service, which was held at the Immanuel Anglican Church, Inland Town, Onitsha, attracted many friends of the family.. Head of Mbanefo family, Chief Arthur Mbanefo , a former Nigeria permanent representative at the United Nations, who was installed the Odu 111by the late Obi Ofala Okabue in 1995 led the family members to the special church service.\nPreaching a sermon during the service, the Vicar of Immanuel Anglican Church, Venerable Joseph Nweke said it is always good to appreciate God’s favours and commended Mbanefo family for remaining steadfast in the service of God.\nAccording to the cleric, gratitude is a culture that is supposed to be sustained in people’s lives adding “today, we join Mbanefo family in saying thank you God for the grace you have shown to us”.\nHe also observed that the fact that Mbanefo family had produced many firsts in Igbo land was by the grace of God and it was therefore not surprising that the family decided to identify with the church."
  },
  {
    "headline": "Boko Haram: Nigerians proud of your sacrifices – Army chief, Yahaya tells injured soldiers",
    "summarized_story": "The Chief of Army Staff, COAS, Maj- Gen. Farouk Yahaya, has told injured troops involved in the ongoing counter-insurgency operations amid the fight against Boko Haram that Nigerians are proud of their sacrifices towards bringing back peace to the North-East region.\nYahaya, in a statement by Ado Isa, the Deputy Director Public Relations, 7 Division Nigerian Army/Joint Task Force, North East, Operation Hadin Kai, on Saturday, also prayed for their speedy recovery.\nThe COAS also assured the wounded troops of good welfare and medical care.\nFirst thing new Army chief, Yahaya did after assuming office“The COAS gave the assurances on Friday when he visited the 7 Division Hospital and University of Maiduguri Teaching Hospital to commiserate with the sick and wounded in action troops recuperating at the medical facilities.\n“He averred that the nation [Nigeria] is indeed proud of their selfless service and sacrifices towards restoring peace to the North-East region."
  },
  {
    "headline": "Southeast leaders to other regions",
    "summarized_story": "Southeast leaders, on Saturday, expressed concern over threats against Ndigbo living in other parts of the country.\nHe, however, said the zone was saddened by threats against Ndigbo, calling on leaders of other regions in the country to rise to the occasion.\n“We have noted threats by some groups in some other regions against our people of South East.\nThe South-East leaders also condemned in totality, the activities of violent secessionist groups in the zone and elsewhere, proclaiming firmly that “we do not support them, they do not speak for South-East”.\nThe communiqué revealed that South East leaders, in order not to mismanage the unfortunate situation, “have set up a committee to engage such youths to stop and allow elders speak to address such fears”."
  },
  {
    "headline": "Rivers College of Health shuts down college, orders students to go home",
    "summarized_story": "The Management of Rivers State College of Health Science and Management Technology Port Harcourt has directed all the students of the institution to vacate the college premises until further notice.\nAccording to the management, the students have until 4pm on Saturday to comply with the directive.\nRivers College of Health lecturer allegedly rapes female student, family raises alarmDAILYPOST gathered that the students have also threatened to continue their protest on Monday.\nAccording to him” the students have refused any appeal by the management of the college to get back to their class rooms”.\n“They made initial request that they do not have water and light but management has restored light and water to the campus”."
  },
  {
    "headline": "JAMB: Candidates say power outage delays exams",
    "summarized_story": "Some of the candidates said that they were made to sit for the examination after having been thoroughly checked by security agents and JAMB officials.\nAt the Royal Midland CBT centre in Maraba, a candidate, Ayuba Perez, disclosed that the centre experienced a power outage which delayed the examination.\nPower outages: 7 power plants shut down – Minister revealsHe said, “The examination was calm as the environment was conducive.\nThe examination was good as expected as there were no technical issues.\nHe said, “Some are having technical issues like the Junior Secondary School in Jikwoyi ."
  },
  {
    "headline": "Herdsmen attack Kwara APC spokesman’s farm, several injured",
    "summarized_story": "Suspected herdsmen, on Friday, attacked a farm belonging to the spokesman of the Kwara State chapter of the All Progressives Congress, APC, at Offa in Offa Local Government Area of the State.\nOne person was seriously injured in the attack which occurred at 1800hours on the farm located behind Offa University.\nDAILY POST learnt that the farmers resisted the attack and in the attempt to overpower the suspected herdsmen, one farmer, Yakub Salasi (27) sustained serious injuries.\nOthers victims injured in the attack were later transferred to Abdulsalam Hospital, Offa for further treatment.\nOur correspondent further learnt that while efforts are ongoing to arrest the suspected herdsmen, most of their cows were injured and seized by the aggrieved farmers."
  },
  {
    "headline": "We must deal with social media monster - Oyedepo",
    "summarized_story": "President, Living Faith Church (Winners Chapel), Bishop David Oyedepo has urged the government and well-meaning Nigerians to deal with the monster of social media.\nBishop Oyedepo called for an urgent step to device means of checking free and unhindered access to social media.\nOyedepo said putting measures to check free access to social media should particularly target those aspects that are not adding values.\n“This social media saga has eroded the substance of destiny of most youth today.\n“We must devise means to put a check on free access to social media particularly those that are not adding values,” Oyedepo, Founder Living Faith Church worldwide said."
  },
  {
    "headline": "VIDEO: Why I can’t be with one woman - Tekno",
    "summarized_story": "Popular singer, Augustine Miles Kelechi, better known as Tekno, has revealed that it is impossible for him to be with one woman for the rest of his life.\nTekno argued that the concept makes sense in fictional works of art but in reality, it is weird and impossible.\nAlthough he didn’t state a particular reason why he thinks it is generally impossible, Tekno, however, noted he personally finds it impossible because there are many beautiful women across the world.\nBut in reality, it is just weird because I want to love one person and be with them but it is impossible because the women are so beautiful.\nThere are so many beautiful women everywhere around the world,” he said."
  },
  {
    "headline": "Ronaldo becomes first person ever to reach 300 million Instagram followers",
    "summarized_story": "Juventus striker, Cristiano Ronaldo, has become the first person ever to reach 300 million followers on Instagram.\nThe 36-year-old football superstar has continued to shatter records as he is the most followed person on the planet and a long way clear of Dwayne 'The Rock' Johnson in second on 246 million.\nOnly one account on the social media platform has more followers than Ronaldo's - and that's Instagram itself with 397 million.\nThis came few days after he became the all-time EURO scorer after scoring his tenth and 11th finals goals, to go clear of Michel Platini."
  },
  {
    "headline": "VIDEO: Protesters invade Court, chase Judge over Olu of Warri case",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "VIDEO: Moment Prince snubs Dorathy at #BBNaija Reunion show",
    "summarized_story": "Big Brother Naija reality star, Prince Enwerem, left viewers puzzled yesterday after he ignored his supposed bestie, Dorathy Bachor when he was called in by the show’s host, Ebuka Obi-Uchendu.\nPrince, who came in with fellow housemates Tolanibaj and Tochi, was seen greeting other housemates but cunningly ignored Dorathy.\nRecall that after Prince was evicted from the Big Brother Naija Lockdown show, Dorathy penned down a lengthy message to show how much she appreciated his friendship while he was still in the house.\nFast forward to when the show ended, the duo were captured together in videos and photos.\nBut the palpable tense atmosphere between the two at the reunion made Ebuka had to ask Dorathy if she was happy to see Prince at the show."
  },
  {
    "headline": "Charly Boy @ 71 Injustice in Nigeria stinks",
    "summarized_story": "By Oscar NwoguCharles Chukwuemeka Oputa popularly known as Charly Boy is an enigma of some sort.\nOne year after, the general feeling is that Charly Boy would mark his 71st birthday today, Saturday June 19.\nHowever, Charly Boy will today celebrate his aging backward birthday with the launch of his EP titled, Odudubariba, which simply means a spiritual warrior.\nWhat we are going through in Nigeria today is decades of inaction, docility and my thief better pass your thief mentality.\nAre we expecting fireworks, protests and all sort of razzmatazz from Charly Boy as he counts his age backward?"
  },
  {
    "headline": "We’re finished: 5 dead, scores injured, 25 vehicles razed in Lagos gas explosion",
    "summarized_story": "But by the time it was over, it left five people dead, scores injured, some of them critically, 25 cars burnt and one building structure in complete ruins.\nThe affected victims are being attended to at the Lagos State University Teaching Hospital (LASUTH), he added.\nThe Lagos State Emergency Management Agency (LASEMA), in a short message, said all emergency workers were at the scene working to contain the situation.\nLagos State Government has commiserated with Ogun State Government and the families of those who died in the aftermath of the gas explosion which affected OPIC Plaza in Ikeja.\nThe LASEMA DG disclosed that the carcass of the gas tanker and truck had been evacuated and forensic evidence would be gathered to ascertain whether the recommended safety measures were violated."
  },
  {
    "headline": "Ibadan gang war: Death toll rises to 11",
    "summarized_story": "From Oluseye Ojo, IbadanThe death toll in the gang war that started on Wednesday night in Ibadan, Oyo State capital has risen to 11 on Friday as two rival gangs clashed heavily in some communities in Ibadan metropolis.\nThe affected communities include Inalende, Abebi and Oopoyeosa in the Oyo State capital.\nA reprisal was reportedly staged on Thursday night by aggrieved OPC members at Oopoyeosa, which was said to have led to the death of another seven members of one of the gangs.\nseven Oopo youths and four OPC.\nAs I speak with you, the OPC has begun to mobilise their members to attack the Oopo youths again."
  },
  {
    "headline": "Ekiti APC suspends two over affiliations with pro-Tinubu group",
    "summarized_story": "The two victims, Messrs Kayode Adetifa and Jide Oso, were APC members in Ward 9, Owaye Quarters in Ayede Ekiti, Oye Local Government Area of the state.\nThe Chairman of Ward 08, Ado-Ekiti Local Government, Mr. Clement Afolabi, was in April suspended over a similar offence.\n“In view of the above reasons the general executive of the ward met 27th May, 2021 and decided to suspend you for running against the party (APC) Constitution till further notice.”Responding, the APC Publicity Secretary, Hon.\nAde Ajayi, said the two were disciplined by party leaders for factionalising the party, saying the suspension has nothing to do with SWAGA.\nBut they have been dividing the party and all efforts to rein them in failed,” he said."
  },
  {
    "headline": "Dividend of democracy is right of every Lagosian –Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Mr. Babajide Sanwo-Olu has declared that one of the primary objective of his administration, is to ensure that every Lagosian enjoys the dividends of democracy.\nSanwo-Olu stated this at the formal inauguration of the upgraded/rehabilitated Ikoyi network of roads, which includes Thompson Avenue, Milverton Road, Mac Donald Road/Lateef Jakande RoadPledging the commitment of his administration to good governance, the governor said the regeneration of Ikoyi network of roads and others across the state is a testimonial of its commitment to ensure every part of the city feels the dividends of democracy.\nSanwo-Olu urged residents of the area to support the state government in its bid to develop the city by paying their land use charge as at when due.\nSpecial Adviser to the Governor on Works and Infrastructure, Aramide Adeyoye, said the benefits of the three thousand, three hundred and forty Seven metres Ikoyi Network of roads with a completion duration of eleven months included improved socio economic activities, connectivity, increased property value, boost trade and investment opportunities, enhanced security within the axis.\nHe thanked residents of the area for their cooperation as well as the contractor for the prompt completion of the roads."
  },
  {
    "headline": "Student Dies in Crossfire as Troops Free Five Kebbi School Abductees",
    "summarized_story": "Governor Abubakar Atiku Bagudu of Kebbi State visited the affected school yesterday, where he met with the parents, and promised that all abducted students would be freed.\nBagudu Promises Freedom for Abducted StudentsMeanwhile, Governor Bagudu yesterday met with parents of abducted Yauri students at the school premises, assuring them that they would be rescued soon.\nYauri Lawmaker LamentsThe lawmaker representing the Igaski/Shanga/Yauri in Kebbi State at the House of Representatives, Yusuf Sununu, has lamented attacks by bandits in Kebbi State.\nSununu warned that the growing insecurity in Kebbi State was a major threat to food security in the country.\nThis tends to deter the progress so far achieved by the Kebbi State Government in terms of agriculture and in terms of promoting access to education.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Tells MTN to Reduce Tarrifs, Provide Quality Service to Nigerians",
    "summarized_story": "•Osinbajo: Corporate bodies must ensure accountability in service provisionDeji Elumoye in AbujaPresident Muhammadu Buhari yesterday charged the MTN Group to make its services affordable and in high quality to its Nigerian subscribers.\nAs such, we urge you to offer top-of-the-range and affordable service to Nigerians.\n“I recently unveiled and launched the National Policy for the Promotion of Indigenous Content in the Nigerian telecommunications sector.\nI call on MTN to support the implementation of this policy and train and engage more Nigerians in your company.\nHe added that MTN as a corporate citizen is responsible in all the countries where it is represented."
  },
  {
    "headline": "Amina Mohammed Gets 2nd Term as UN Deputy Secretary-General",
    "summarized_story": "Mohammed is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations.\nPreviously, she was Nigeria’s Minister of Environment from 2015 to 2016 and was a key player in the Post-2015 Development Agenda process.\nFrom 2012, Mohammed was a key player in the Post-2015 Development Agenda process, serving as the Special Adviser to UN Secretary-General Ban Ki-moon on Post-2015 development planning.\nMohammed served as Federal Minister of Environment in the cabinet of President Muhammadu Buhari from November 2015 to February 2017.\nIn January 2017, United Nations Secretary-General António Guterres announced his intention to appoint Mohammed Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "President Has Power to Extend Tenure of Retiring IG, Court Rules",
    "summarized_story": "In his defence, the IGP told the federal high court that the new Nigeria Police Act gave him a four-year tenure, which would only lapse in either 2023 or 2024.\nThe judge also observed that the constitution and the police act were silent on the issue of whether or not the president could extend the tenure of a retired IGP.\nSome senior advocates of Nigeria (SANs) and the Peoples Democratic Party (PDP), had assailed Buhari for extending Adamu’s tenure.\nPresident has decided that the present IG, Mohammed Adamu, will continue to serve as the IG for the next three months to allow for a robust and efficient process of appointing a new IG.\n“This is not unconnected to the desire of Mr. President to not only have a smooth handover but to also ensure that the right officer is appointed into that position."
  },
  {
    "headline": "Buhari in Maiduguri, Vows Not to Rest Until Peace is Restored",
    "summarized_story": "He also commended the state Governor, Prof. Babagana Zulum, for his resilience and relentless efforts in rebuilding the state.\nAccording to him, “It was part of these measures that I gave approval for the federal government to build 10,000 resettlement homes in Borno State.\n“I will never forget in my life that during my career as a politician, Borno State is where I got the highest percentage of votes, more than 90 per cent!\nBuhari also interacted with some of the wounded soldiers assuring them that the government was committed to their recovery and welfare.\n“We have witnessed the gradual return of peace to Borno State and it is our sincere hope that insurgency will soon be brought to an end,” he said."
  },
  {
    "headline": "EXCLUSIVE: EFCC Recovers N1 Billion From Permanent Secretary Working Directly With Works And Housing Minister, Fashola",
    "summarized_story": "The civil servant the Economic and Financial Crimes Commission (EFCC) recovered N1 billion from has been identified as a Permanent Secretary in the Federal Ministry of Works and Housing.\nBabatunde FasholaEFCC Chairman, Abdulrasheed Bawa had in May while appearing before the Senate Committee on Finance said the agency recovered over N1 billion from the bank account of a civil servant.\nSee Also Corruption How We Recovered Over N1billion From A Civil Servant In One Week—EFCC Chairman“We have recovered over N1 billion sitting in the account of a civil servant last week.”Bawa however refused to mention the name of the individual civil servant.\nSpeaking to SaharaReporters on Thursday, a source at the anti-graft agency identified the civil servant as a Permanent Secretary working with Fashola.\n“The civil servant the chairman was talking about is the Permanent Secretary working directly with Fashola,” the source said."
  },
  {
    "headline": "EXCLUSIVE: EFCC Recovers N1 Billion From Permanent Secretary Working Directly With Works And Housing Minister, Fashola",
    "summarized_story": "The civil servant the Economic and Financial Crimes Commission (EFCC) recovered N1 billion from has been identified as a Permanent Secretary in the Federal Ministry of Works and Housing.\nBabatunde FasholaEFCC Chairman, Abdulrasheed Bawa had in May while appearing before the Senate Committee on Finance said the agency recovered over N1 billion from the bank account of a civil servant.\nSee Also Corruption How We Recovered Over N1billion From A Civil Servant In One Week—EFCC Chairman“We have recovered over N1 billion sitting in the account of a civil servant last week.”Bawa however refused to mention the name of the individual civil servant.\nSpeaking to SaharaReporters on Thursday, a source at the anti-graft agency identified the civil servant as a Permanent Secretary working with Fashola.\n“The civil servant the chairman was talking about is the Permanent Secretary working directly with Fashola,” the source said."
  },
  {
    "headline": "EXCLUSIVE: Why National Security Adviser, Monguno Is Threatening The Life Of EFCC Boss, Bawa",
    "summarized_story": "The National Security Adviser, Babagana Mungono has been fingered as one of the high profile Nigerians threatening the Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa, a source told SaharaReporters.\nWhat the caller said to him on the phone is that; he is going to kill the EFCC chairman,” he said.\nCorruption can fight back.” See Also Exclusive Some People Want Me Dead Because I'm EFCC Boss—Anti-Corruption Agency Boss, Bawa SaysIn February 2021, the 40-year-old law enforcer was named as the new EFCC chairman to replace Ibrahim Magu, the former acting chairman of the anti-graft commission.\nOthers are No 15, 21 Crescent, 2nd Avenue, Gwarinpa Estate, Abuja; No 3 Liverpool Close, Sun City Estate, Abuja; No 52 Mainstreet, Sun City Estate, Abuja; and No 25 Osaka Street, Sun City Estate, Abuja.\n“Those properties were acquired by the former Director of Finance and Administration in the ONSA acting on instruction from Monguno."
  },
  {
    "headline": "EXCLUSIVE: Why National Security Adviser, Monguno Is Threatening The Life Of EFCC Boss, Bawa",
    "summarized_story": "The National Security Adviser, Babagana Mungono has been fingered as one of the high profile Nigerians threatening the Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa, a source told SaharaReporters.\nWhat the caller said to him on the phone is that; he is going to kill the EFCC chairman,” he said.\nCorruption can fight back.” See Also Exclusive Some People Want Me Dead Because I'm EFCC Boss—Anti-Corruption Agency Boss, Bawa SaysIn February 2021, the 40-year-old law enforcer was named as the new EFCC chairman to replace Ibrahim Magu, the former acting chairman of the anti-graft commission.\nOthers are No 15, 21 Crescent, 2nd Avenue, Gwarinpa Estate, Abuja; No 3 Liverpool Close, Sun City Estate, Abuja; No 52 Mainstreet, Sun City Estate, Abuja; and No 25 Osaka Street, Sun City Estate, Abuja.\n“Those properties were acquired by the former Director of Finance and Administration in the ONSA acting on instruction from Monguno."
  },
  {
    "headline": "EXCLUSIVE: Three Secondary School Students Killed As Bandits, Vigilantes Exchange Gunfire In Kebbi",
    "summarized_story": "Three students of Federal Government College, Birnin-Yauri in Kebbi state have been killed during a gun duel between bandits and vigilantes.\nSaharaReporters had reported how bandits on motorcycles from Rijau forest stormed the school on Thursday after overpowering the mobile police unit guarding the school, killing one officer.\n“Three of the students were killed during a gun duel between vigilante group and the gunmen in Makuku village.\nMeanwhile, some students, who were forcibly taken by armed bandits at the school have managed to escape on Friday.\nOur Abductors Were Not Nigerians, Escaped Kebbi School Student Says | Sahara ReportersDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of an officer."
  },
  {
    "headline": "Umahi meets JAMB over listing for Ebonyi medical varsity ahead of NUC nod",
    "summarized_story": "Dave Umahi, governor of Ebonyi state, has met with the Joint Admission and Matriculation Board (JAMB) to seek the listing of Ebonyi Medical University, Uburu, ahead of the National Universities Commission’s approval.\nThe governor said the varsity is “one of the best in West African” with accommodation for students and lecturers.\nIt is understood that the JAMB registrar assured Umahi of the board’s support for the successful take-off of the varsity.\nEbonyi Medical University to approach NUC for approval, says spokesmanThe Ebonyi Medical University had yet to be listed on the NUC’s website as of the time of this report.\nAdvertisement“We’re getting these things ready so when the NUC comes to inspect the varsity, it (accreditation) will be easy."
  },
  {
    "headline": "days after Google removed his Crowwe app",
    "summarized_story": "Instagram has taken down the account of Adamu Garba, a former presidential aspirant.\nAdvertisementThe chief executive officer of (CEO) of IPI Group broke the news on his Facebook page on Wednesday.\nChecks by TheCable Lifestyle showed his account has indeed been removed from the platform.\nAdvertisementSearch for his handle, @adamugarbaii, only displayed a blank page with a terse post which read “user not found.”It was not immediately clear why the Facebook-owned platform removed his account.\nAdvertisementIt also comes days after Google deleted Crowwe, his instant messaging and financial transaction app, from its Playstore."
  },
  {
    "headline": "JAMB: UTME candidates with incomplete registration should visit our special centres",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) says candidates for the 2021 Unified Tertiary Matriculation Examination (UTME) yet to complete their registration process should visit its special centres to finish it by June 15.\nBenjamin said only those who could not complete their registration during the stipulated period should visit the said centres.\nAdvertisement“At the end of the period originally scheduled for the 2021/2022 Unified Tertiary Matriculations Examination (UTME) and Direct Entry (DE) registration on May 15, the registration period was extended,” the statement read.\nAdvertisement“The candidates who have not registered but have secured the profile codes and initiated the registration process are expected to visit the specially designated registration centres to complete the registration on Tuesday, June 15.\n“The identification number on each form given to the candidates has been used to assign the candidates to their registration centres."
  },
  {
    "headline": "ALBUM REVIEW: ‘UY Scuti’ is another proof of Olamide’s versatility",
    "summarized_story": "As expected, ‘UY Scuti’ is another mind-blowing body of work.\nAdvertisementThe “Lord of versatility” has more love songs in the UY SCUTI album which can stand the test of time.\nUY Scuti – (2021)The ‘YBNL Mafia Family’ album was a special collaborative album of all the YBNL artists in 2018.\nThe 10-track in the ‘UY Scuti’ album had unknown artists in it.\nWhen it comes to rap, Olamide knows his onions, and that does not exclude that with the songs he birthed on ‘UY Scuti’ album."
  },
  {
    "headline": "Timi Dakolo: Why I told my kids about their mum’s rape saga",
    "summarized_story": "Timi Dakolo, Nigerian musician, says he and Busola, his wife, informed their children about how she was allegedly raped by a pastor when she was 16 years.\nAdvertisementThe music star spoke about the rape saga when he appeared on the latest episode of ‘Toke Moments‘, a YouTube series by Toke Makinwa, media personality.\nAlthough the clergyman dismissed the rape allegations made against him, the case has refused to die down.\nAdvertisementSpeaking on the show, Dakolo said his concept of raising kids is one that allows them to freely express themselves.\nAdvertisement“When one tells one’s partner, ‘for better, for worse’, most people think it is just ‘for the better’ because one cannot quantify the worse."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "Airlines, passengers hurting over Lagos airport’s non-functional runway lights",
    "summarized_story": "This situation forced local airlines to land at the international wing at night, then taxi to local airport.\nWith 18R and 18L (domestic and international) runway lights at Lagos airport now non-functional, it means no airline can land or take off at night at both runways.\nLagos airport currently processes over 65 percent passenger traffic in Nigeria and travellers bound for Lagos have had to land at Abuja airport because the runway lights at Lagos airport are bad.\nOlumide Ohunayo, an aviation analyst, told BusinessDay that Nigeria has had the issue of non-functional runway lights for over 10 years.\nHe said government needs to expedite action on providing runway lights not just for Lagos but for all the major airports in the country."
  },
  {
    "headline": "Dearth of investment dollars may be the end of oil",
    "summarized_story": "Dearth of investment dollars may be the end of oilIt is often said that the stone age did not come to an end due a lack of stones, in the case of crude oil, neither peak demand nor depleted reserves looks to herald its end, but a dearth of investment dollars.\nAccording to a Rystad Energy analysis, the proven oil and gas reserves of…"
  },
  {
    "headline": "CBN to issue N722.17bn treasury bills in third quarter",
    "summarized_story": "Nigeria’s central bank plans to issue a total of N722.17 billion treasury bills in the third quarter of 2021, as the same amount will be maturing between June 2021 and August this year.\nThe Central Bank of Nigeria (CBN) stated this in the Nigerian Treasury Bills issuance programme calendar released on its website on Friday.\nThe CBN issues Treasury Bills twice in a month to help the Federal Government fund its budget deficit, support banks in managing liquidity in the system and curb inflation.\nAt the fixed income securities segment yield on FGN increased, reflecting rising inflationary pressures, while the Nigerian Treasury Bills (NTB) yield declined.\nSimilarly, yields on the CBN securities slightly moderated from the preceding month’s level."
  },
  {
    "headline": "Former MD, Bank PHB, Atuche Received Six Years Imprisonment For N25.7Billion Fraud, Wife Acquitted – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The former Managing Director of the defunct Bank PHB, Francis Atuche has been sent to six years imprisonment for defrauding the financial institution of N25.7billion.\nWith the pronouncement, the ex MD after been on trial for 10 years, is to be in prison for six years.\nIn the judgement, Justice Okunnu held that the Economic and Financial Crimes Commission (EFCC) had proved the case beyond reasonable doubt that Atuche actually committed the crime.\nOkunnu however discharged Atuche’s wife Elizabeth who was facing trial alongside the duo.\nThe trial judge also held that in case of conspiracy and stealing against the 2nd defendant, the prosecution failed to prove any case against her."
  },
  {
    "headline": "NDDC has failed, not living up to its responsibilities, Obaseki insists – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has restated that the Niger Delta Development Commission (NDDC) is not living up to its responsibility of ensuring infrastructural development in the Niger Delta and raising the standard of living of the people.\nObaseki said this on Thursday when he received the Odiowere and elders of Ugha Quarters of Urhonigbe Town in Orhionmwon Local Government Area, who were on a courtesy visit at the Government House, Benin City.\nHe said: “We are aware and know that the road has been awarded by NDDC.\nObaseki continued: “As soon as possible, we would send government agencies to check the immediate state of the road and report back.\nWe will deliver the dividends of democracy to the people of the State, including Ugha Quarters in Urhonigbe."
  },
  {
    "headline": "Edo Poly matriculates 2,200 new students, as Rector lauds Obaseki on support, partnership – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Polytechnic, Usen, has matriculated 2,200 new students into its National Diploma (ND) and Higher National Diploma (HND) programmes, with the intakes charged to be of good character and pursue excellence in their studies.\nRector of the Polytechnic, Professor Abiodun Falodun, made the submission during the school’s 19th matriculation ceremony, held in Usen, Ovia South West Local Government Area (LGA) of Edo State.\nThe Rector noted that the Edo State Governor, Mr. Godwin Obaseki, has provided immense support to drive change and community impact in the school, especially in securing accreditation for new programmes.\nHe added that the governor recently entered into partnership with the school for training of government’s secretarial staff in computer science/data processing.\nOur sincere gratitude to His Excellency, Governor Godwin Obaseki, for the invaluable assistance in the accreditation exercise."
  },
  {
    "headline": "Osinbajo presides over virtual NEC meeting – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Vice President Yemi Osinbajo presided over a virtual meeting of the National Economic Council (NEC) on Thursday at the Presidential Villa, Abuja.\nUnder the Nigerian Constitution, the vice president is the chairman of NEC.\nThe council’s meeting is held monthly to deliberate on the coordination of the economic planning efforts and economic programmes of the various levels of government.\nNEC comprises the 36 state governors, the governor of Central Bank of Nigeria, minister of finance, Secretary to the Government of the Federation and other government officials whose duties hinge on the economy.\nAt the last meeting on May 20, NEC declared its support for Nigeria’s effort at digital switch over."
  },
  {
    "headline": "SSS takes over investigation into rape, killing of Akwa Ibom job-seeker – Officials",
    "summarized_story": "A former attorney general of Akwa Ibom State, Uwemedimo Nwoko, told PREMIUM TIMES last week that the SSS has taken over the investigation from the police.\nThey have taken custody of the suspect,” Mr Nwoko said.\nApart from Mr Akpan who has confessed to the rape and killing of Miss Umoren, another suspect in the case is his father.\nIf a suspect in a criminal investigation is taken into custody by the SSS, the SSS would eventually have to return them to the police, the lawyer said.\nIt is a murder case, it is the office of the attorney general that is handling the matter directly,” Mr Nwoko said."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "South-East Govs, Stakeholders Disown IPOB",
    "summarized_story": "AdvertisementsThe stakeholders, therefore, reaffirmed the commitment of Ndigbo to one united Nigeria.\nAddressing journalists after a South-East Governors Forum meeting, Ebonyi State governor, Dave Umahi, pleaded with leaders of other regions of the country to note the threats to Igbo people and protect them.\nAccording to Umahi, the meeting requested the National Assembly members from the South-East to support the creation of state police in the ongoing constitution amendment exercise.\nADVERTISEMENT“We plead with the leaders of other regions to please note the threats to our people and protect them.\nThe impressions that South-East leaders are silent over some of our youths agitation for successional are not correct,” he said."
  },
  {
    "headline": "South-East Govs, Stakeholders Disown IPOB",
    "summarized_story": "AdvertisementsThe stakeholders, therefore, reaffirmed the commitment of Ndigbo to one united Nigeria.\nAddressing journalists after a South-East Governors Forum meeting, Ebonyi State governor, Dave Umahi, pleaded with leaders of other regions of the country to note the threats to Igbo people and protect them.\nAccording to Umahi, the meeting requested the National Assembly members from the South-East to support the creation of state police in the ongoing constitution amendment exercise.\nADVERTISEMENT“We plead with the leaders of other regions to please note the threats to our people and protect them.\nThe impressions that South-East leaders are silent over some of our youths agitation for successional are not correct,” he said."
  },
  {
    "headline": "OPIC Plaza Fire Avoidable, Says Gov Abiodun",
    "summarized_story": "The Ogun State governor, Dapo Abiodun, has said the gas explosion at the OPIC Plaza, Ikeja, Lagos was avoidable if necessary checks had been made.\nAbiodun equally urged regulators in the gas and petroleum downstream sector, to ensure trucks by conveying petroleum products and gas are in perfect working condition.\nThe governor made the call while speaking with newsmen shortly after his on-the-spot assessment of the premises of the Ogun state-owned OPIC Plaza in Ikeja, Lagos, Friday evening.\nAbiodun, who expressed sadness over the loss of lives and destruction of property caused by the inferno, said that promotion of Liquefied Petroleum Gas for domestic use in the country shouldn’t be at the expense of the people’s lives.\nSo, my counterpart, Governor Jide Sanwoolu (of Lagos State) and I will be having this discussion very soon, he said."
  },
  {
    "headline": "OPIC Plaza Fire Avoidable, Says Gov Abiodun",
    "summarized_story": "The Ogun State governor, Dapo Abiodun, has said the gas explosion at the OPIC Plaza, Ikeja, Lagos was avoidable if necessary checks had been made.\nAbiodun equally urged regulators in the gas and petroleum downstream sector, to ensure trucks by conveying petroleum products and gas are in perfect working condition.\nThe governor made the call while speaking with newsmen shortly after his on-the-spot assessment of the premises of the Ogun state-owned OPIC Plaza in Ikeja, Lagos, Friday evening.\nAbiodun, who expressed sadness over the loss of lives and destruction of property caused by the inferno, said that promotion of Liquefied Petroleum Gas for domestic use in the country shouldn’t be at the expense of the people’s lives.\nSo, my counterpart, Governor Jide Sanwoolu (of Lagos State) and I will be having this discussion very soon, he said."
  },
  {
    "headline": "Police Arrest Bandit, Recover AK47 Rifle In Kaduna",
    "summarized_story": "The Kaduna State Police Command said its operatives arrested a suspected bandit and recovered an AK-47 rifle in the Kudaru forest of Saminaka, Lere local government area of the state.\nAdvertisementsThe Command’s Public Relations Officer, ASP Mohammed Jalige, made this known in a statement on Saturday in Kaduna.\nJalige said the operatives on June 18 at about 0745 hrs, while on routine patrol along Kudaru forest in Saminaka, Lere LGA, intercepted a Volkswagen Golf vehicle, green in color with Reg.No.KAG 142 AA, heading towards Kaduna.\nHe explained that the operatives noticed the suspicious disposition of the occupants of the said vehicle and tried to flag them down but they immediately parked some distance away and took to their heels into the forest.\n“The policemen, however, engaged them in a shootout and succeeded in apprehending one suspect and when the vehicle was searched, an AK47 rifle was found concealed in a bid to escape the eagle eyes of the security forces along the route,” he said."
  },
  {
    "headline": "1.3million candidates write UTME across Nigeria — Daily Times Nigeria",
    "summarized_story": "*As parents, observers commend JAMB over hitch free conductDoosuur Iwambe, AbujaAt least 1.3million candidates that successfully registered for the 2021 Unified Tertiary Matriculation Examination, UTME, wrote the examination across the country on Saturday.\nSpeaking with the Daily Times, Mrs Judith Bello who accompanied her daughter to the venue of the exams at Digital Bridge Institute, DBI Utako expressed satisfaction with the process.\nOn her part, a candidate who simply identified herself as Precious told this reporter that she had no problem with the exams.\nAnother candidate, Agbo Bethel Chioma however told this reporter that the questions were different from the syllabus they were asked to study.\nWhile 1.3 million candidates successfully registered for this years UTME, over 75,000 registered for Direct Entry exams."
  },
  {
    "headline": "ECOWAS leaders vow to sustain democratic culture in sub-region —",
    "summarized_story": "The Economic Community of West African States (ECOWAS) has pledged to continue to sustain democracy and democratic tenets among member-countries via the conduct of free, fair and acceptable elections.\nHe also appreciated the support he had received so far from his colleagues, Presidents of countries within the West African region, and called for more collaboration, in order to move the sub-region forward.\n“The total volume of the spending portfolio of the bank in West Africa currently stands at $16 billion, the second largest for the bank anywhere in the continent.\nSo, together, let us assure economic growth and prosperity for the West African region.\nNigeria’s President, Muhammadu Buhari, who is also participating in the summit, is expected back to Abuja after the meeting of the ECOWAS leaders later today."
  },
  {
    "headline": "UTME: Students, parents complain of poor network, malfunctioning of",
    "summarized_story": "Some parents and candidates writing the Unified Tertiary Matriculation Examination (UTME) have complained of poor network and malfunctioning of computers at the designated CBT Centre in Nasarawa, Nasarawa State.\nSome of the parents told the News Agency of Nigeria (NAN) in separate interviews in Nasarawa, Nasarawa Local Government Area of the state, that this would affect their children performance negatively.\nMr Ayuba Joshua, a parent whose son is writing UTME, expressed disappointment over the challenge of poor network and malfunctioning of computers.\n“We are here since morning, some of the students that are writing 9 a.m examinations have complained of poor network and malfunctioning of systems.\nSome of the affected students, who spoke on condition of anonymity, decried poor network and malfunctioning of computers."
  },
  {
    "headline": "Buhari committed to economic diversification – Lai Mohammed —",
    "summarized_story": "Minister of Information and Culture, Alhaji Lai Mohammed, says the President Muhammadu Buhari’s government is committed to diversifying the economy and boosting of the Micro, Small and Medium Enterprises (MSME) activities.\nThe minister stated this in Abuja on Saturday at the closing ceremony of a five-day exhibition on Made-in-Nigeria products and live performance of cultural troupes.\nThe minister said “The products exhibited here in the past five days are 100 per cent Made-in-Nigeria and by our Micro, Small and Medium Enterprises.\n“The event has also featured various paper presentations on key issues that affect Made-in-Nigeria products in the areas of production, branding and financing.\n“Other areas looked at in the presentations include agriculture, small and medium scale enterprises development and challenges, infrastructural development for regional integration."
  },
  {
    "headline": "Lagos explosion: How Chinese restaurant’s manager, four other workers died, Filipino injured – Daylight",
    "summarized_story": "Anxious family members stormed the Lagos State University Teaching Hospital on Friday in search of their loved ones, following a gas explosion in Ikeja that claimed five lives, while nine, including a Filipino, sustained injuries.\nAccording to eyewitnesses, most of the casualties were workers at the Chinese restaurant.\nOur correspondents observed that the restaurant occupies the rear of the four-storey building, downhill from the gate.\n“Vehicles were moving and with the vehicular movement, people ought to have parked away when they saw the gas explosion, but they continued moving,” Farinloye said.\nAccording to him, the manager died while trying to escape the gas explosion with a Filipino worker and a driver."
  },
  {
    "headline": "Lagos explosion: How Chinese restaurant’s manager, four other workers died, Filipino injured – Daylight",
    "summarized_story": "Anxious family members stormed the Lagos State University Teaching Hospital on Friday in search of their loved ones, following a gas explosion in Ikeja that claimed five lives, while nine, including a Filipino, sustained injuries.\nAccording to eyewitnesses, most of the casualties were workers at the Chinese restaurant.\nOur correspondents observed that the restaurant occupies the rear of the four-storey building, downhill from the gate.\n“Vehicles were moving and with the vehicular movement, people ought to have parked away when they saw the gas explosion, but they continued moving,” Farinloye said.\nAccording to him, the manager died while trying to escape the gas explosion with a Filipino worker and a driver."
  },
  {
    "headline": "Kebbi abduction: Bandits contact teachers, pupils’ families, silent on ransom",
    "summarized_story": "Families of the pupils and teachers kidnapped by bandits at the Federal Government College in Birnin Kebbi, the Kebbi State capital, have been contacted by the abductors, Saturday PUNCH learnt on Friday.\nIt was, however, learnt that the bandits have yet to state any condition for the release of the victims as of press time on Friday.\nThe state chapter of the Nigerian Union of Teachers confirmed that five of its members were taken away by the abductors.\nBandits had on Thursday morning stormed the school and kidnapped scores of students and some members of staff.\n“They (bandits) only informed their family members that they (abducted teachers) are with them."
  },
  {
    "headline": "Kebbi abduction: Bandits contact teachers, pupils’ families, silent on ransom",
    "summarized_story": "Families of the pupils and teachers kidnapped by bandits at the Federal Government College in Birnin Kebbi, the Kebbi State capital, have been contacted by the abductors, Saturday PUNCH learnt on Friday.\nIt was, however, learnt that the bandits have yet to state any condition for the release of the victims as of press time on Friday.\nThe state chapter of the Nigerian Union of Teachers confirmed that five of its members were taken away by the abductors.\nBandits had on Thursday morning stormed the school and kidnapped scores of students and some members of staff.\n“They (bandits) only informed their family members that they (abducted teachers) are with them."
  },
  {
    "headline": "Ekiti teenager Suluka Abimbola stages own kidnap",
    "summarized_story": "Agency ReportsThe Police in Ekiti State have arrested a 16-year-old girl, Suluka Abimbola, alongside three accomplices for faking her own kidnap.\nPolice spokesman, ASP Sunday Abutu, said on Saturday at Ado-Ekiti that the suspects were arrested on Thursday at their hotel hideout.\n“Adisa Damilola led the Operatives of the Anti-kidnapping Unit to Alex Grace Hotel, along Housing, Ado-Ekiti, where Suluka Abimbola and her boyfriend, Oluwaseun Daniel Olajide, alongside one other accomplice, Adefolaju Caleb were lodging and were arrested”.\nThe police spokesman said during interrogation, Suluka Abimbola confessed to the commission of the crime.\nOluwaseun Daniel Olajide and Adefolaju Caleb also made confessions about their role."
  },
  {
    "headline": "Breaking: Buhari congratulates Guterres, Amina Mohammed",
    "summarized_story": "By AbankulaPresident Muhammadu Buhari has congratulated UN Secretary General António Guterres and his deputy, Amina Mohammed on their re-appointment.\nPresident Buhari congratulated the duo for the global recognition and opportunity to serve humanity with their experience, trusting that their passion to promote peace, alleviate poverty, improve health and empower more people will gain more speed and results.\nThe President believed that the extension of Amina’s tenure will further encourage more women and the girl-child, particularly in Africa and Nigeria, to aspire to new heights of leadership, dream beyond the borders of their country and learn from her dedication to seeing lives transformed for the better.\nAmina Mohammed was the minister of environment in Buhari’s first term before her appointment to the UN post.\nPresident Buhari extolled the former minister for her contributions to development, at home and abroad, praying that the Almighty God will grant her good health, strength and more wisdom for the journey ahead."
  },
  {
    "headline": "Boko Haram reveals Shekau’s 24-year-old successor",
    "summarized_story": "Agency ReportsTwenty-four year-old, Bakura Sahaba Modu, has emerged as the new leader of Boko Haram, following the death of its leader Abubakar Shekau.\nShekau committed suicide by by blowing up himself, after he was arrested by rival terror gang, Islamic State of West Africa, headed by Abu Musab al Barnawi, son of Mohammed Yusuf, founder of the terror group.\nModu who appeared in a new video spoke of the readiness of the group to work with the Islamic state of Iraq and Syria.\nHis statement in Arabic was said to have confirmed the death of Shekau, as he prayed for Allah to forgive the shortcomings of the former spiritual leader.\nVincent Foucher, a Boko Haram researcher at the French National Centre for Scientific Research, said Modu’s comment that his group believes in Islamic State is a sign that Boko Haram may be seeking a form of reconcliation with ISWAP."
  },
  {
    "headline": "In Ogun, Dangote Truck Crushes Two To Death",
    "summarized_story": "On Friday evening, two people were killed by a truck on the Dangote-Ibeshe route in the Yewa North Local Government Area of Ogun.\nThe incident was reported to NAN in Abeokuta on Saturday by Babatunde Akinbiyi, the spokesman for the Traffic Compliance and Enforcement Corps (TRACE).\nAccording to witnesses, the truck driver drove dangerously, leaving his lane and colliding with the motorcycle, killing both the rider and his passenger.\n“An enraged mob eventually set fire to the Dangote truck, while the driver fled,” he stated.\nHe expresses his condolences to the victims’ families while urging truck drivers to reject the temptation of reckless and risky driving and to consider other road users."
  },
  {
    "headline": "In Kwara, Over 20,000 APC Members Renounce Party",
    "summarized_story": "On Saturday, over 20,000 All Progressives Congress (APC) card-carrying members in Kwara State condemned the party.\n“The new party would be unveiled in due course as soon as possible,” Abdulfatai Abdulrahman, APC Kwara Central Senatorial Chairman, told reporters at the unveiling of a new political platform dubbed “The Third Force” in Ilorin.\n“The intra party crisis has been going on for long and unabated.\nThe struggle for the soul of the party which cannot be divorced from the 2023 political ambitions has been the root cause of the lingering internal squabbles.”The hopes and expectations of party members to realize the benefits of their collective labor have been crushed, according to Abdulfatai, due to the party’s self-inflicted and unnecessary crisis.\nThe situation reached a head with the recently ended APC membership revalidation and registration in the state, which was marred by purposeful policies and grand orchestration to deregister and disenfranchise selected members of the party, according to the spokesman."
  },
  {
    "headline": "Go To ‘Unidentified Gunmen’ For Their Bodies — Police Tells Relatives Of Victims Killed In Abia",
    "summarized_story": "He alleged that the victims were later killed by the security agents and labelled unknown gunmen.\n“ On his way home the security agents arrested him at Ugwunchara and took him away with other boys they arrested.\n“ They said they were killed by unknown gunmen and that we should go to unknown gunmen.\n“ We don’t know where to locate the unknown gunmen for their permission to collect the body of my brother.\nOn the claims by the family that the victims were arrested alive and later killed by the police, the PPRO said “it sounds very strange to allege that police arrested the victims and later killed them”."
  },
  {
    "headline": "ASUU Set To Embark On Fresh Strike",
    "summarized_story": "In a press statement made accessible to journalists in Jos, Plateau State’s capital, Dr Lazarus Maigoro, the ASUU chairman at the University of Jos, issued the warning.\nMaigoro further accused the AGF of stoking tensions between the Federal Government and the Union.\n“Many of our members in the University of Jos and across the country have not been paid salaries from February 2020 to date.\n“The AGF has completely violated the terms of the agreement signed between our union and the Federal Government.\nSo it’s very clear that this is a deliberate act on the part of the AGF and his staff.”"
  },
  {
    "headline": "Amina Mohammed reappointed UN Deputy Secretary-General",
    "summarized_story": "Nigeria’s Amina Mohammed has been re-appointed as Deputy Secretary-General of the United Nations.\nAntónio Guterres on Friday asked Mohammed to serve as Deputy Secretary-General for a second term, shortly after the UN General Assembly re-appointed him for a second term.\nGuterres’ second term starts on January 1, 2022, and will run for a period of five years.\n“After being elected, I have the pleasure to invite the deputy secretary-general to remain in my second mandate and I hope she will accept,” he said.\nMohammed is a diplomat and politician who is serving as the fifth Deputy Secretary-General of the United Nations."
  },
  {
    "headline": "Breaking: Anxiety as residents block Abuja-Kaduna highway, protest bandits’ attack, stranded travellers groan",
    "summarized_story": "Many travellers are currently stranded on the Abuja-Kaduna Highway as angry residents have blocked the road over attacks, especially the killing of a 13-year-old girl by bandits.\nThe tragic incident occurred at Anguwar Magaji in Chikun Local Government Area of the state, according to Daily Trust.\nA resident of the area told Daily Trust that they were not safe at home and their farms.\n﻿He explained that the residents only want security or to be allowed to protect themselves against the bandits.\nA witness told Daily Trust that the protesters refused to listen to the plea of security personnel who approached them."
  },
  {
    "headline": "Global economic crisis: Is Nigeria ready for renewable energy transition?",
    "summarized_story": "This year, Total plans to devote more than 20 per cent of its investment budget to renewable energy sources as well as electricity.\nHe, however, does believe that for Nigeria, gas is a bridge to achieving its own renewable energy.\nThe minister was rather confident that with the county’s abundant gas resources Nigeria would gradually transit to renewable.\nOn his part, the maintenance/project manager, Servon Nigeria Limited, Anderson Aleru, told this reporter that Nigeria was ready for the energy transition.\nAccording to him, with its abundant gas resources, Nigeria can use gas as a transition to clean energy."
  },
  {
    "headline": "Troops rescue abducted students, teachers in Kebbi State -NigPilot",
    "summarized_story": "The fierce gun duel between troops of Operations Hadarin Daji and armed bandits that abducted school students and teachers in Kebbi State has led to their rescue from the bandits, the Nigerian Army has said.\nThe Service, however, regretted that one of the female students lost her life in the process.\n“The troops also recovered 800 cattle rustled by the bandits.\nThe gallant troops are still on the heels of the kidnappers in order to rescue the remaining abductees still in captivity.\n“The rescued teachers and students will be handed over to the Kebbi State Government.The Nigerian Army appreciates the cooperation so far from good spirited citizens and wish to solicit for more”."
  },
  {
    "headline": "Banditry does not represent any ideology, doctrine, religion – Gov Masari -NigPilot",
    "summarized_story": "The Governor of Katsina State, Rt.\nAminu Bello Masari, has said that banditry in Katsina State and environs was peculiar as it does not represent any ideology, doctrine, religion, or political party.\nGovernor Masari gave this commendation when he paid a courtesy call on the CAS at NAF Headquarters, Abuja.\nDirector of Public Relations and Information Nigerian Air Force, Air Commodore Edward Gabkwet in a statement noted that Governor Masari said that banditry in Katsina is pure criminality.\nThe Chief of Air Staff, Air Marshal Oladayo Amao thanked Governor Masari for his support to the NAF and other security agencies in Katsina State."
  },
  {
    "headline": "NGOs train displaced persons on tactics out of poverty, hunger -NigPilot",
    "summarized_story": "We are here to let them know that they can enhance their livelihoods through specific digital training while leveraging their God-given talents and skills.\nOur people have suffered but we thank NHI for always coming to our aid with food and other essential items.\nThank you, thank you, thank you,” he said.\nYathuma disclosed that no fewer than 30 internally displaced persons attended the ‘Dignified IDP’ training, comprising 20 young women and 10 young men.\n“We are excited that 67 per cent of the trainees are young women."
  },
  {
    "headline": "All forms of criminality will soon be history – COAS -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS) Maj Gen Faruk Yahaya has assured Nigerians that all forms of criminality will soon be history in the country.\nHe also said that the Nigerian Army under his leadership is committed to its constitutional duties, despite the enormous challenges caused by insecurity.\nThe COAS added that the Nigerian Army is up and doing in ensuring that law-abiding citizens are adequately protected, adding that the service will soon bring the security challenges under control.\nThe COAS said this while playing host to “ Secure Nigeria First Initiative (SNFI),” a Non-Governmental Organization (NGO) advocating for peaceful Nigeria, at Army Headquarters, Abuja.\nEarlier in his remarks, the President of Secure Nigeria First Initiative (SNFI), Mr Usman Paul pledged to support the Nigerian Army (NA) in ensuring a safe and secure Nigeria for economic development."
  },
  {
    "headline": "South East Governors Condemn Violent Secessionist Groups, Back United Nigeria",
    "summarized_story": "Members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nHe added, “The impression that South East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\nThe forum also condemned the killing of security agencies, burning of strategic infrastructure, and killing of civilians in the South East and other regions.\n“The meeting endorsed our South East joint security outfit – Ebubeagu and asked them to work with security agencies and to respect the rights and privileges of all those living in South East and our visitors,” Governor Umahi said while reading the communique issued at the end of the meeting."
  },
  {
    "headline": "Pressure Mali To Return To Civilian Rule, Buhari Tells ECOWAS Leaders",
    "summarized_story": "President Muhammadu Buhari on Saturday called on West African leaders to exert pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nThe Nigerian leader spoke on the situation in Mali which was recently suspended from the regional bloc due to a military coup.\n“Pressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, President Buhari faulted the recent United Nations Resolution to expel all foreign fighters in Libya, without first ensuring that they were disarmed.\nIn his capacity as the ECOWAS champion on the fight against COVID-19, President Buhari also drew attention to the need for more citizens in the region to be vaccinated, stressing the need for adherence to other non-pharmaceutical interventions."
  },
  {
    "headline": "Mob Sets Truck Ablaze For Killing Motorcycle Rider, Passenger",
    "summarized_story": "An angry crowd has set a truck ablaze following an accident that led to the death of two persons in Ogun State.\nSources said the truck had veered off its lane and faced an oncoming motorcycle before it crushed both the rider and the passenger to death.\nThe spokesman for the Ogun State Traffic Compliance and Enforcement Corps (TRACE), Babatunde Akinbiyi, also confirmed the incident to Channels Television on Saturday in Abeokuta, the state capital.\nHe noted that an angry mob descended on the truck and set it ablaze while the driver of the vehicle took to his heels.\nThe TRACE spokesman condoled with the families of the victims over the loss and warned motorists, especially truck drivers against reckless and dangerous driving."
  },
  {
    "headline": "Lagos Gas Explosion: Death Toll Increases To Five, 11 Others Injured",
    "summarized_story": "﻿The death toll from the explosion that occurred on Thursday in Ikeja, Lagos has risen to five with 11 others injured and 25 vehicles burnt.\nThe inferno also resulted in several damages to the OPIC plaza building structure.\nThe tanker, conveying Liquefied Petroleum Gas on the Mobolaji Bank Anthony Way around 10 pm on Thursday, spilled its flammable content into nearby OPIC Shopping Plaza, beside Sheraton Lagos Hotel.\nTwo businesses situated in the plaza, New China Restaurant, and Oasis Supermarket, suffered extensive property damage from the explosion.\nUnfortunately, three adult males died at the site of the incident while two others died early hour of Friday morning."
  },
  {
    "headline": "Euro 2020: Germany Outclass Defending Champions Portugal In Lively Contest",
    "summarized_story": "Germany defeated Portugal 4-2 in Group F at Euro 2020 on Saturday to revive their hopes of reaching the last 16 and leave the reigning champions in danger of crashing out.\nCristiano Ronaldo put Portugal ahead in Munich but own goals from Ruben Dias and Raphael Guerreiro gave Germany the advantage before Kai Havertz and Robin Gosens struck in the second half to make it 4-1.\nDiogo Jota pulled a goal back for Portugal, who are level on three points with Germany and a point behind leaders France.\nPortugal face France in their final game while Germany take on bottom side Hungary."
  },
  {
    "headline": "Mali absent as Buhari, others attend 59th ordinary session of ECOWAS in Ghana",
    "summarized_story": "The 59th ordinary session of ECOWAS Authority of Heads of State and Government has opened in Accra, GhanaPresident Muhammadu Buhari, and other Presidents from other countries in the region, except Mali is in AttendanceMali was suspended at the extraordinary session held in Accra in May over the military take over of government in the countryThe situation in Mali will be part of issues to be discussedThe Authority will be considering ways to ensure the country returns to democracy and the Ecowas Special Envoy, Former President Goodluck Jonathan will be making a presentation on mediation efforts in MaliAdvertisementReports of the 46th ordinary session of the ECOWAS mediation and security Council will also be consideredAlso attending from Nigeria are, the Minister of foreign Affairs Geoffrey Onyeama, Minister of State for foreign Affairs, Zubairu Dada, Minister of Finance, Budget and National planning, Zainab Ahmed, Minister of Defence, Major General Bashir Magashi, Minister of Health, Osagie Ehanire, the National security Adviser, Major General Babagana Monguno, the Director General of the National Intelligence Agency, Ambassador Ahmed Rufai Abubakar and the Governor of Central Bank, Godwin EmefieleThe delegates will have inputs in the decisions as the Authority of ECOWAS Heads of State and Government will be considering issues of single currency that has been stalled by the effects of covid-19The Authority in this one day summit will also deliberate on the reports of the 86th ordinary session of the ECOWAS Council of ministers who considered memorandum on the post COVID-19 industry recovery plans, 2021 mid term report of the President of ECOWAS Commission and the ongoing institutional reforms."
  },
  {
    "headline": "Angry residents protest attacks by bandits, block Kaduna-Abuja highway",
    "summarized_story": "Road users were left stranded Saturday morning after angry residents of Kakau community in Chikun Local Government Area of Kaduna blocked the Abuja-Kaduna highway.\nThey were protesting incessant attacks and abduction of residents of their communities by gunmen.\nAdvertisementKakau Community is located along the Kaduna-Abuja highway, on the outskirts of Kaduna metropolis.\nResidents lament that they have lost sleep due to activities of kidnappers who have continued to terrorize them.\nAs at the time of filing this report, efforts to reach the police in the state for comments were yet to yield results."
  },
  {
    "headline": "IMF raises alarm over re-emerging fuel subsidies in Nigeria",
    "summarized_story": "The International Monetary Fund has raised alarm over the re-emerging fuel subsidies in the Nigeria’s oil and gas sector.\nAccording to a press statement, the IMF mission led by Mr. Jesmin Rahman expressed its concerns about rising fuel subsidies to the Nigerian authorities during a virtual meeting.\nThe IMF mission led by Jesmin Rahman, according to a press release, expressed its concerns about rising fuel subsidies to the Nigerian authorities during a virtual meeting.\nThe IMF also stressed the significance of introducing market-based fuel pricing systems and the need to establish well targeted social support to curtail any impact on the poor."
  },
  {
    "headline": "Euro 2020: Hungary Hold World Champions France to Surprise Draw",
    "summarized_story": "Tournament favourites France were held to a surprise 1-1 draw against Hungary in their second Euro 2020 Group F game in Budapest.\nFrance missed two big chances to take the lead through Kylian Mbappe’s header and Karim Benzema’s sliced effort wide, but Hungary stunned the world champions through Attila Fiola’s finish having been put through on goal, sending the home crowd into raptures.\nIn a cauldron atmosphere in Budapest, France levelled on 66 minutes through Antoine Griezmann, finishing up at close range after Mbappe had held up Hugo Lloris’ long kick upfield.\nThey could not grab a winner, and the result means France have four points after two games, which should be enough to make the last 16 as they finish their group stage against Portugal on Wednesday, while Hungary, on one point, must beat Germany in their final game in Munich."
  },
  {
    "headline": "Again, Angry Youth Block Highway in Protest as Terrorists Kill Four, Abduct 49 in Nigeria’s Northwest Kaduna – Arise News",
    "summarized_story": "The community which is located on the outskirts of Kaduna metropolis was said to have come under persistent attacks by bandits throughout the week.\nSpeaking in a telephone interview on Saturday, the source said a total of four people were killed, while 49 people were abducted within three days.\nHe said, “on Tuesday the bandits invaded the community killed two people and abducted 15 others.\n“There is also another soldiers’ camp close to the main road, yet the attacks have persisted.\n“Our people have been living in perpetual fear and this is a community that is close to Kaduna metropolis."
  },
  {
    "headline": "Assets In Nigeria That Stood Up To Inflation. Savings Accounts Aren’t One Of Them",
    "summarized_story": "Oyekunle Benson, CFA with Context Analysis, spoke to the Global Business Report about Nigeria’s high inflationary environment.\nHe also looked at the 10, 20, and 30 year annualized performance of asset classes vs inflation.\nThis gives a clue to how to face Inflation in the coming years.\nBe sure to watch this informative session."
  },
  {
    "headline": "If You Engage in Any Commercial Activity in Nigeria, You’re Subject to the FCCPC: Consumer Protection CEO Irukera",
    "summarized_story": "Following the inquiry into the death of Lagos chef Peju Ugboma – whose family accused the medical centre that treated her of negligence – the Executive Vice Chairman and Chief Executive of Nigeria’sFederal Competition and Consumer Protection Commission, Babatunde Irukerat, was on ARISE NEWS on Friday to clarify the role and scope of the government agency.\nThis is against the backdrop of comments made bythe Chairman, Medical Jurisprudence Committee of the Nigerian Medical Association, Dr OIayinka Atilola, who on Thursday suggested – also on ARISE NEWS – that the FCCPC was overreaching by investigating Ugboma’s death.\nWatch this insightful video for Irukera’s explanation of the FCCPC’s role."
  },
  {
    "headline": "Lagos Is The Second Most Stressful City In The World. Mumbai Is First!",
    "summarized_story": "Arise Correspondent Seyitan Atigarin spoke to the Global Business Report about the “Stressful Cities Report 2021” from Vaay.com which ranked Mumbai and Lagos as the first and second most stressful cities on planet earth.\nSeyitan went through the different scoring metrics and also looked at the least stressful cities in the world in Iceland and Switzerland.\nWatch the video…"
  }
]