[
  {
    "headline": "Insurgency: Borno builds 200 houses for over 1,000 returnees in Baga",
    "summarized_story": "“We have constructed over two hundred permanent houses in Baga and distributed it to the owners.\nWe will construct hospitals in all these communities and equip them with modern-day facilities to meet up the health needs of the returnees.\nOur visit to the Local Government Areas is to ensure that the returnees villagers are good,” the Commissioner of Justice said.\nThey have started fishing activities on a small scale.\nWe have met those concerned about security to map out the waterways so that our people will embark on large scale fishing and farming activities."
  },
  {
    "headline": "UPDATED: Former South African president FW de Klerk dies at 85",
    "summarized_story": "Johannesburg, South Africa | AFP | | 275 wordsFW de Klerk, South Africa’s last white president, died on Thursday aged 85, his foundation announced.\nDe Klerk and South Africa’s first black president Nelson Mandela shared the Nobel Peace Prize in 1993 for leading the “miracle” transition from white rule in the country.\n“It is with the deepest sadness that the FW de Klerk Foundation must announce that former president FW de Klerk died peacefully at his home in Fresnaye earlier this morning following his struggle against mesothelioma cancer,” it said.\nIn the same speech he ordered the release from prison of anti-apartheid icon Mandela after 27 years in jail.\nHe studied law, before being elected to parliament as a member of the National Party that instituted apartheid."
  },
  {
    "headline": "2023: I won’t hesitate to fix Nigeria’s security architecture — Yahaya Bello",
    "summarized_story": "Says Kogi is the safest state in NigeriaBy Arogbonlo IsraelKogi State Governor, Yahaya Bello has reiterated his stance on fixing the security architecture of Nigeria ahead of the 2023 presidential election.\nSpeaking during an interview on Channels Television’s Politics Today Wednesday, governor Bello emphatically said he would replicate his performance in Kogi at the national level if he eventually becomes president come 2023.\nThe governor also claimed his state (Kogi) is the safest in Nigeria.\n“If what we have done in Kogi; by uniting the people, fighting insecurity and making Kogi the safest state in Nigeria today, ensuring there is equity, fairness and justice in Kogi.\nThe president has really been very pleased and he encourages me to continue to do my best,” he said."
  },
  {
    "headline": "Buhari’s Visit: Why we are building diverse cooperations with Nigeria – Macron",
    "summarized_story": "France President, Emmanuel Macron, says Nigeria is a powerhouse in Africa and that informs why his country is building tight and diverse cooperation with Africa’s most populous nation.\nMacron stated this on Wednesday in Paris at the Nigeria international Partnership Forum (NIPF), a high-level event on the sidelines of the Paris Peace Forum.\nReports have it that the one-day event was attended by President Muhammadu Buhari, ministers and business moguls from Nigeria and France.\n“More than 100 French companies are present in Nigeria whereas almost 20 per cent of French Foreign direct investment in sub-Saharan Africa are directed to Nigeria,” he said.\nAnd I encourage all French companies to present today to follow in their footsteps and get inspired by their example,” he said."
  },
  {
    "headline": "Ghana parliament begins public hearings on anti-LGBT+ law",
    "summarized_story": "Ghana’s parliament on Thursday hold the first public hearing on a new law that would make it illegal to be gay or to advocate for gay rights, its press office said.\nGay sex is already punishable by prison time in Ghana, but no one has been prosecuted in years.\nThe new bill would go much further, criminalising the promotion and funding of LGBT+ activities as well as public displays of affection, cross-dressing and more.\nGhana’s speaker of parliament, Alban Bagbin, pledged in his opening address last month that parliament would pass the bill into law “at the earliest possible time’’.\nLGBT+ rights groups in Ghana said they have seen a spike in homophobic attacks since the draft law was introduced in August."
  },
  {
    "headline": "Ikono people laud Gov Udom over road projects",
    "summarized_story": "Governor Udom EmmanuelIkono leaders and stakeholders have poured encomiums on Governor Udom Emmanuel for his concerted efforts in embarking on several turnkey projects in their communities.\nGovernor Emmanuel: Exhibiting Evidences of a people-centered administrationIt is no doubt that when the righteous are in power, the people rejoice.\nAnother indigene of Nkwot, Ikono, David Akpan took to social media to express his thoughts, saying.\nGod bless Governor Udom Emmanuel”, he added.\nGovernor Emmanuel had earlier reconstructed and remodeled the General Hospital at Ikono and commissioned a College of Health Technology road that preludes the newly awarded road."
  },
  {
    "headline": "Ogun ranked 4th in revenue generation in Nigeria",
    "summarized_story": "James Ogunnaike – AbeokutaOgun State has been ranked 4th in revenue generation among the 36 states in the country.\nThe ranking according to the Statisense showed that Ogun generated N74b between January and September, 2021.\nThe state which came behind Lagos, FCT and Rivers in the ranking, recorded a plus of 131.5% revenue increase in the months under review.\nOkubadejo added that various economic initiatives capable of enhancing Ease of Doing Business being implemented by the administration, has begun to yield positive results.\nVanguard News Nigeria"
  },
  {
    "headline": "More domestic, foreign resources needed to end TB in Nigeria – Health Minister, Ehanire",
    "summarized_story": "The Federal Government has said it is working to accelerate and scale its current efforts to mobilize the needed domestic and international resources to implement the National TB Strategic Plan 2021-2025.\nThe Minister of Health, Dr. Osagie Ehanire disclosed this at the 2021 National TB Conference held in Abuja, where he also tasked the private sector to intensify work on the newly developed data-driven, community TB case-finding strategies.\n“We must therefore work with our partners to accelerate and scale up our current efforts significantly, mobilize needed domestic and international resources for implementing the National TB Strategic Plan 2021-2025, to end the TB epidemic in Nigeria.\nDespite claims of success in TB case identification, health experts say it appears that TB has been normalized in Nigeria, stressing that the trend must change.\nThis new index is despite assertions by health experts that TB is curable using the 6 to 12 months treatment plan and is also vaccine-preventable."
  },
  {
    "headline": "Fuel scarcity worsens in Zamfara",
    "summarized_story": "The lingering fuel scarcity in Zamfara State has taken another dimension as motorists and commercial motorcycle riders have resorted to parking over the non-availability of the commodity.\nDAILY POST reports that the worsening fuel scarcity has caused an increase in transport fares of both vehicles and commercial motorcycles across the state.\nDAILY POST can authoritatively state that most of the filling stations in Gusau have shut down, selling to only black marketers.\nHowever, a member of the union, who spoke to this medium on anonymity because he was not authorized to speak, said the fuel scarcity was not caused by the association but artificial scarcity.\nMotorists blame marketers as fuel scarcity hits Taraba"
  },
  {
    "headline": "Wike faults NASS moves to establish more law school campuses",
    "summarized_story": "Governor Nyesom Wike of Rivers State has faulted moves by the Nigerian Senate to pass a bill seeking to create two campuses of the Nigerian Law School in each geo-political zone in the country.\nAct by establishing the campuses for the Nigerian Law School, and for other related matters’.\nHe made the claim during an unscheduled inspection of ongoing construction work at the Dr. Nabo Graham Douglas Campus of the Nigerian Law School, Port Harcourt on Wednesday.\nWike accused the lawmakers sponsoring the bill of politicising the establishment of Nigerian Law School campuses, despite evidence that the Federal Government cannot adequately fund the existing ones.\nAnd this Law School will have its own investment to take care of the Law School whether the government is here or not."
  },
  {
    "headline": "Why Buhari has refused to open Nigeria-Benin Republic border – Reno Omokri",
    "summarized_story": "Reno Omokri, a former aide to ex-President Goodluck Jonathan, has suggested why President Muhammadu Buhari has refused to reopen the Nigeria-Benin Republic border.\nOmokri claimed that Buhari was trying to pressure the Benin Republic government to hand over Yoruba nation agitator, Sunday Igboho to his administration.\nHe said the claim by the Nigerian government that the border was closed to tackle smuggling of goods and weapons and to tackle the menace of banditry is a lie.\nIn a tweet on Thursday, Omokri wrote: “Buhari claims he closed the Benin Republic-Nigeria border because of banditry.\nDSS had declared him wanted after weapons were found in his house in the Soka area of Ibadan, Oyo State."
  },
  {
    "headline": "Police bust outlawed Nigerian Merchant Navy operatives in Lagos, arrest 108",
    "summarized_story": "The police in Lagos busted a location used by leaders and members of the outlawed Nigerian Merchant Navy.\nThe Commanding Officer, Sunday Dakare, 47 years old, and 107 operatives in training were arrested.\nOn Wednesday, Commissioner of Police, Hakeem Odumosu told the media that officers raided their camp at the Ogudu Sand Field area.\nOther were recruitment letters, promotion letters, a portrait of the commanding officer, two motorcycles, one plasma TV, three cutlasses, and charms.\n“In the course of interrogation, it was discovered that the Nigerian Merchant Navy, also called the COASTAL DEFENCE FORCE, has been operating illegally since 2005″, Odumosu added."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Usyk’s promoter says talks for rematch with Joshua to begin soon",
    "summarized_story": "Usyk’s promoter says talks for rematch with Joshua to begin soonOleksandr Usyk and Anthony Joshua will initiate plans for a rematch by discussing the probable venue for the fight, Usyk’s promoter, Alexander Krassyuk said on Thursday.\nJoshua lost his WBA, WBO, IBF and IBO belts to Ukraine’s Usyk on a unanimous points decision in front of a sell-out crowd at London’s Tottenham Hotspur Stadium in September.\nJoshua’s promoter, Eddie Hearn, said in October that the British boxer triggered his clause for a rematch against heavyweight rival, Usyk and that the fight could take place in March.\n“We plan to meet with Eddie Hearn within the next couple of weeks to initiate the rematch activities,” Usyk’s promoter Krassyuk told Sky Sports.\n“We have had approaches to stage that fight around the world, but last time out was a massive spectacle and, obviously, this time is a much bigger fight,” Hearn added."
  },
  {
    "headline": "JUST IN: 3,906 escaped prisoners still on the run – Aregbesola",
    "summarized_story": "JUST IN: 3,906 escaped prisoners still on the run – AregbesolaA total of 3,906 prisoners, who fled some of the nation’s custodial centres during various incidences of prison breaks, are still at large.\nThe Minister of Interior, Ogbeni Rauf Aregbesola, disclosed this on Thursday during the weekly ministerial briefing, hosted by the Presidential Media Team at the Presidential Villa in Abuja.\nAccording to Aregbesola, a total of 4,369 inmates escaped from the centres from 2020 till date, adding that 984 of the number had so far been recaptured.\nHe however noted that the biometrics of all custodial inmates in the country had been taken, which he said would enable the escapees to be rearrested.\n- Advertisement -He said: “How long can they continue to run from the state?"
  },
  {
    "headline": "Former South African president FW de Klerk dies at 85",
    "summarized_story": "FW de Klerk, an apartheid-era leader who helped to bring about the end of white-minority rule in South Africa, has died of cancer at the age of 85, his foundation said on Thursday.\nDe Klerk helped orchestrate the release of Nelson Mandela, with whom he later shared the Nobel Peace Prize in 1993.\nDe Klerk, born in Johannesburg on March 18, 1936, was the son of a prominent politician.\nHe went on to hold several top ministerial posts before being elected president in 1989, a position he held until 1994.\nDe Klerk left behind his wife Elita, his children Jan and Susan, as well as his grandchildren, the foundation said."
  },
  {
    "headline": "Yoruba group, ACF, Ohanaeze, Middle Belt Forum fault Gumi over monetary, land demands for bandits",
    "summarized_story": "However, the Ohaneze Ndigbo, the Middle Belt Forum, Yoruba self-determination group, Ilano Omo Oodua (IOO), and other eminent Nigerians said his comment is akin to ceding part of Nigerian lands to foreigners.\n“He is a security threat to Nigeria because from all indications, he knows and relates with the bandits.\nThe one he sees as religious life, that is his public life is completely at variance with his life as an associate of bandits.\nHe wondered how Gumi expects government to reward criminals who derive pleasure in killing innocent people.\nProf. Banji Akintoye’s Yoruba self-determination group, Ilano Omo Oodua (IOO) also lashed out at Gumi for his suggestion."
  },
  {
    "headline": "Senate approves Buhari’s $16bn, €1bn loan requests",
    "summarized_story": "The Senate has approved President Muhammadu Buhari’s loan request for the sum of $16,230,077,718 (USD) billion, €1,020,000,000 billion (Euros), under the 2018-2020 External Borrowing plan.\nThe president had requested the facilities in an addendum to the 2018-2020 borrowing plan in September.\nThe World Bank, African Development Bank (ADB) and French Development Agency (AFD) are among the funding agencies.\nIn July, the National Assembly approved the sums of $8.3 billion and €490 million loans as initial requests in the 2018-2020 borrowing plan.\nWhile presenting a report yesterday, Clifford Ordia, chairman of the senate committee on local and foreign debts, said the projects to be funded from the loans were ongoing."
  },
  {
    "headline": "Buhari woos French govt, private sector",
    "summarized_story": "Buhari in an address to participants at the “Nigerian International Partnership Forum, Beyond the Pandemic”, said the Nigerian economy was recovering from the shocks of the global pandemic with government committed to addressing the root causes of crime and insecurity.\nHe said the government has already incorporated public-private economic modeling to help mitigate capital flight while focusing extensively on infrastructure development.\nBuhari noted that the robust bilateral engagement fits into the French plan to reset and re-balance its foreign policy framework in Africa for sustainable and mutually beneficial partnership.\nAccording to him , the administration had earmarked an estimated $1.5 trillion cumulatively to be spent within a period of 10 years from 2015.\nHe explained that these actions are yielding self-employment, expanding human resource pool and strengthening our national productivity for sustainable development."
  },
  {
    "headline": "Buhari, Ortom, others congratulate Soludo, laud INEC, security agencies",
    "summarized_story": "A gale of congratulatory messages have greeted Prof. Charles Chukwuma Soludo, candidate of the All Progressives Grand Alliance (APGA), governor-elect of Anambra State.\nPresident Muhammadu Buhari, in a congratulatory message by his media aide, Mr. Femi Adesina, said he looked forward to working with Soludo for the peace, security and development of not only Anambra State, but the entire country.\n“Let me also use this opportunity to congratulate all the men and women who contested our dear state’s governorship this year.\n“I have just called the newly elected governor of our dear state, Prof. Chukwuma Charles Soludo to congratulate him on his victory at the just-concluded November 6, 2021 Anambra Governorship poll.\n•Obi, Secondus, Metuh reactMr. Peter Obi, former governor of Anambra State, thanke Anambrarians who braved all odds and came out to perform their civic duties."
  },
  {
    "headline": "I’ll soon roll out activities for my 2023 presidential ambition –Anyim",
    "summarized_story": "By Wilfred Eya and Chijioke Agwu, AbakalikiFormer senate president, Anyim Pius Anyim has said he would soon roll out activities to actualise his 2023 presidential ambition.\nHe said Nigeria needed a president with experience, capacity and humane disposition to provide leadership and unite the country as one indivisible united entity.\nIn their remarks, the forum urged Ndigbo from the South East extraction aspiring for the presidential position in 2023 to come out and throw their hats into the ring.\nMeanwhile, the youth wing of the apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, has lauded Anyim over his declaration for the race.\nPresident-General of the Ohanaeze Ndigbo Youth Council Worldwide (OYC) Mazi Okwu Nnabuike, in a statement, yesterday, said Anyim had demonstrated courage and clear political vision in his quest for the position."
  },
  {
    "headline": "Breaking: Suspected Bandits Raid Shops Opposite FUT Minna",
    "summarized_story": "By Laleye Dipo in MinnaTwo people have been kidnapped in a bandit attack on a shop opposite the Permanent site of the Federal University of Technology, Minna, Niger state.\nThose abducted were suspected to be the sales representatives for a flourishing shop opposite the university main gate.\nTHISDAY gathered that the incident occurred at about 8pm on Wednesday night when the armed gun men stormed the area riding on motorcycles and started shooting sporadically.\nThe incident created panic among students who were staying off campus, forcing them to run helter skelter.\nKuyars said two of the gunmen were neutralized, adding that reinforcement of security operatives had been despatched to the area."
  },
  {
    "headline": "Breaking: FW de Klerk, Last President of Segregated South Africa, Dies at 85",
    "summarized_story": "Former South African president and Nobel Peace Prize winner, FW de Klerk, who oversaw the end of South Africa’s minority rule and freed Nelson Mandela from jail, is dead.\nHe was aged 85.de Klerk was diagnosed with mesothelioma, a cancer that affects the tissue that lines the lungs, in March.\nDe Klerk headed South Africa’s white minority government until 1994, when Nelson Mandela’s African National Congress party swept to power.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: Nigeria’s Economic Outlook Bright, Viable to Attract FDIs",
    "summarized_story": "He stressed that Nigeria’s business environment favours global businesses and has a friendly regulatory environment that supports Foreign Direct Investments (FDIs).\nContinuing, President Buhari said the nation’s economy was being re-engineered and re-positioned to be globally more competitive, favouring business and entrepreneurship to drive growth and development.\nWe have revitalised the economy by increasing investments in capacity building, health, infrastructure, women’s empowerment, climate change, and food security.\n“The Nigerian economy rebounded after two quarters of contraction.\nUnfolding developments continue to indicate that the Nigerian economy will achieve strong growth while current inflation trends remain on track towards their desired levels,” he added."
  },
  {
    "headline": "Soludo: I’ll Hit the Ground Running with My Agenda",
    "summarized_story": "Ekiti State Governor and Chairman of Nigeria Governors’ Forum (NGF), Dr. Kayode Fayemi; former Senate President, Dr. Bukola Saraki; Speaker of the House of Representatives, Hon.\nDemocracy is the real winner – FayemiFayemi said the Anambra election attested to Buhari’s sincerity and commitment to delivery of a free, fair, and credible electoral system.\nThe Ekiti State governor said democracy was the real winner at the Anambra election, with the successful and peaceful conduct of the poll.\nSaraki: Anambra poll outcome has crucial lessonsSaraki congratulated Nigerians, particularly, the people of Anambra State, for the success of the governorship election.\nOzigbo stated, “I have just called Professor Chukwuma Soludo and congratulated him on being declared the winner of the Anambra State governorship election, 2021."
  },
  {
    "headline": "FEC Approves 5-year National Development Plan, Targets N348.7trn Investments",
    "summarized_story": "•N298.3trn to be contributed by private sectorDeji Elumoye in Paris, FranceThe Federal Executive Council (FEC) at its weekly meeting yesterday approved N348.7 trillion investment portfolio under the federal government’s 2021-2025 National Development Plan (NDP).\nShe disclosed that for the investment size, the public sector would contribute N49.7 trillion; while N298.3 trillion would come from the private sector.\nShe said: “Today, the Ministry of Finance, Budget and National Planning presented a memorandum to council, requesting for approval of national development plan for 2021-2025 which is a plan that is succeeding the ERGP which will expire in December 2021.\n“This NDP is structured around six concepts and this concepts include economic growth and development, infrastructure, public administration, human capital development, social development and regional development.\n“So, deliberately, for this National Development Plan 2021-2025, the issue of no one being left behind was key."
  },
  {
    "headline": "Nigeria's Universities Commission, NUC Budgets N6million For Books, N49million For Meals, Welfare",
    "summarized_story": "The National Universities Commission (NUC), the regulatory agency for Nigerian universities, has set aside N5,769,000 to purchase books in 2022, and a whopping N22,908,950 for meals and N25,570,000 for welfare packages.\nIn 2020 also, the NUC set aside over N53,000,000 to take care of meals and its welfare packages while the purchase of books took N16,769,000.\nThe commission also penned down N22,908,950 on refreshments and meals and N30,570,000 on welfare packages.\nThe NUC headed by an Executive Secretary oversees the regulation and accreditation of a total of 174 Nigerian universities – 43 federal universities, 52 state universities and 79 private universities.\n“Refreshments and meals – N22,908,950, honorarium and sitting allowance – N17,540,000, welfare packages – N30,570,000,” the breakdown of the NUC budget for 2020 had read."
  },
  {
    "headline": "Nigeria's Universities Commission, NUC Budgets N6million For Books, N49million For Meals, Welfare",
    "summarized_story": "The National Universities Commission (NUC), the regulatory agency for Nigerian universities, has set aside N5,769,000 to purchase books in 2022, and a whopping N22,908,950 for meals and N25,570,000 for welfare packages.\nIn 2020 also, the NUC set aside over N53,000,000 to take care of meals and its welfare packages while the purchase of books took N16,769,000.\nThe commission also penned down N22,908,950 on refreshments and meals and N30,570,000 on welfare packages.\nThe NUC headed by an Executive Secretary oversees the regulation and accreditation of a total of 174 Nigerian universities – 43 federal universities, 52 state universities and 79 private universities.\n“Refreshments and meals – N22,908,950, honorarium and sitting allowance – N17,540,000, welfare packages – N30,570,000,” the breakdown of the NUC budget for 2020 had read."
  },
  {
    "headline": "How UK Firm Paid For Igboho's N1.5million Ticket For Botched Cotonou-Hamburg Flight— Report",
    "summarized_story": "An unnamed United Kingdom-based travel company reportedly helped Yoruba Nation activist, Sunday Adeyemo, aka Sunday Igboho to pay for his botched Cotonou-Paris-Hamburg flight.\nThe ticket was paid for in British pound sterling using a cheque as means of payment, The PUNCH reports.\nAlso, the Beninese court system is different from the system of law in Nigeria.\nHe was to travel on flight AF700, which would depart the Republic of Benin for France before a connecting flight to Germany.\nThe UK travel firm which bought the ticket using a cheque as means of payment, had since claimed the ticket refund."
  },
  {
    "headline": "How UK Firm Paid For Igboho's N1.5million Ticket For Botched Cotonou-Hamburg Flight— Report",
    "summarized_story": "An unnamed United Kingdom-based travel company reportedly helped Yoruba Nation activist, Sunday Adeyemo, aka Sunday Igboho to pay for his botched Cotonou-Paris-Hamburg flight.\nThe ticket was paid for in British pound sterling using a cheque as means of payment, The PUNCH reports.\nAlso, the Beninese court system is different from the system of law in Nigeria.\nHe was to travel on flight AF700, which would depart the Republic of Benin for France before a connecting flight to Germany.\nThe UK travel firm which bought the ticket using a cheque as means of payment, had since claimed the ticket refund."
  },
  {
    "headline": "How UK Firm Paid For Igboho's N1.5million Ticket For Botched Cotonou-Hamburg Flight— Report",
    "summarized_story": "An unnamed United Kingdom-based travel company reportedly helped Yoruba Nation activist, Sunday Adeyemo, aka Sunday Igboho to pay for his botched Cotonou-Paris-Hamburg flight.\nThe ticket was paid for in British pound sterling using a cheque as means of payment, The PUNCH reports.\nAlso, the Beninese court system is different from the system of law in Nigeria.\nHe was to travel on flight AF700, which would depart the Republic of Benin for France before a connecting flight to Germany.\nThe UK travel firm which bought the ticket using a cheque as means of payment, had since claimed the ticket refund."
  },
  {
    "headline": "BREAKING: Frederick de Klerk, South Africa's ex-president who released Mandela from prison, is dead",
    "summarized_story": "Frederick William de Klerk, South Africa’s last apartheid president, who released Nelson Mandela from prison, has died at the age of 85.\nde Klerk Foundation on Thursday, the former president died after a battle against cancer at his home in Cape Town.\n“It is with the deepest sadness that the FW de Klerk Foundation must announce that former President FW de Klerk died peacefully at his home in Fresnaye earlier this morning following his struggle against mesothelioma cancer.\nOn 2 February 1990, de Klerk delivered a speech at the opening session of the parliament of South Africa, where he announced the release of political prisoners, including Nelson Mandela.\nAdvertisementDe-Klerk headed South Africa’s white minority government until 1994, when Nelson Mandela’s became the first black president, as black people voted for the first time."
  },
  {
    "headline": "BREAKING: Frederick de Klerk, South Africa's ex-president who released Mandela from prison, is dead",
    "summarized_story": "Frederick William de Klerk, South Africa’s last apartheid president, who released Nelson Mandela from prison, has died at the age of 85.\nde Klerk Foundation on Thursday, the former president died after a battle against cancer at his home in Cape Town.\n“It is with the deepest sadness that the FW de Klerk Foundation must announce that former President FW de Klerk died peacefully at his home in Fresnaye earlier this morning following his struggle against mesothelioma cancer.\nOn 2 February 1990, de Klerk delivered a speech at the opening session of the parliament of South Africa, where he announced the release of political prisoners, including Nelson Mandela.\nAdvertisementDe-Klerk headed South Africa’s white minority government until 1994, when Nelson Mandela’s became the first black president, as black people voted for the first time."
  },
  {
    "headline": "One killed, two abducted as gunmen attack university community in Niger",
    "summarized_story": "One person has been reportedly killed in an attack on Gidan-Kwano, the host community of the Federal University of Technology (FUT), Minna, Niger state.\nAdvertisementTwo persons were also kidnapped in the attack that occurred opposite the main gate of the university’s campus on Wednesday night.\nWhen contacted, Wasiu Abiodun, police public relations officer in Niger state, said two persons were abducted.\n“On 10/11/2021 at about 2330hrs, some suspected hoodlums attacked a shop at Gidan-Kwano opposite FUT Gate and abducted two children of the shop owner,” he said.\nAdvertisementIn October, some worshippers were killed when gunmen invaded a mosque at Mazukaka village in Mashegu LGA of the state."
  },
  {
    "headline": "One killed, two abducted as gunmen attack university community in Niger",
    "summarized_story": "One person has been reportedly killed in an attack on Gidan-Kwano, the host community of the Federal University of Technology (FUT), Minna, Niger state.\nAdvertisementTwo persons were also kidnapped in the attack that occurred opposite the main gate of the university’s campus on Wednesday night.\nWhen contacted, Wasiu Abiodun, police public relations officer in Niger state, said two persons were abducted.\n“On 10/11/2021 at about 2330hrs, some suspected hoodlums attacked a shop at Gidan-Kwano opposite FUT Gate and abducted two children of the shop owner,” he said.\nAdvertisementIn October, some worshippers were killed when gunmen invaded a mosque at Mazukaka village in Mashegu LGA of the state."
  },
  {
    "headline": "Malami: Political solution not ruled out on Igboho, Kanu cases",
    "summarized_story": "Abubakar Malami, attorney-general of the federation (AGF), says the federal government has not ruled out all possibilities in resolving cases concerning leaders of secessionist groups in some parts of the country.\nIn a similar development, authorities are actively working on extraditing Sunday Igboho, ‘Yoruba Nation’ agitator, from Benin Republic to face criminal charges.\nHowever, in a chat with Arise TV on Wednesday, Malami said though these individuals’ actions have “criminal undertones”, the federal government will not strike out other means of resolving the cases.\nBut crime is a crime, and there are criminal undertones.\nAnd when you’re associated with certain conducts, you cannot rule out the government’s right to take steps,” the AGF said."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "How to secure funding for your early-stage startup in Africa",
    "summarized_story": "Ayobami and Ayobamigbe work with Ingressive Capital, a venture capital firm that writes up to $400K cheques to early-stage startups.\nDisrupt Africa reported a 68.4% jump in the number of investors in 2020 (370 investors) from 2019’s reported number of 261 investors.\nStartup accelerators like Y Combinator and TechStars have become incredible partners to the growth of the African startup ecosystem.\nwith FirstCheck Africa, Let’s Talk with Microtraction), Invest in the Future with Future Africa), and How I Got Funded (Ingressive Capital).\nYour investment pitch deck should address the pivotal questions of the problem, why the problem matters, your solution, and the market opportunity (total addressable market)."
  },
  {
    "headline": "Nestcoin wants to create wealth with crypto beyond trading",
    "summarized_story": "The brainchild of Taiwo Orilogbon and Yele Bademosi, Nestcoin is a parent company that wants to create crypto-native products beyond trading and investments, with a focus on driving the adoption of crypto in Africa.\nIt wants to do this through its media publication, Breach, and other products that use crypto technology—spanning across DeFi, media, digital art and gaming.\nBefore Nestcoin, Bademosi was a former director at Binance’s venture capital programme.\nIncentivising the crypto communityNestcoin wants to create a community of users that understands crypto, as a way to make their lives easier.\nNestcoin will then harness the power of this community to create new products and embark on projects that can generate revenue."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Helium Health acquires Qatar’s Meddy in expansion play",
    "summarized_story": "Share this article:Nigerian healthtech startup, Helium Health has announced its acquisition of Meddy, a doctor booking platform in Qatar.\nAs part of the deal, Meddy’s CEO Haris Aghadi and COO Abed Alkarim Khattab would join Helium Health’s leadership team.\nHowever, Adegoke Olubusi, Helium Health’s CEO revealed that the cultural similarity of the two teams was key in the deal.\nFounded by Olubusi, Dimeji Sofowora, and Tito Ovia, Helium Health provides a suite of services for its healthcare clients.\nThis year, Helium Health has already expanded to Kenya."
  },
  {
    "headline": "Nigerian drones and smart glasses, Rabbit’s $11m pre-seed, MFS Africa’s $100m Series C, and Flutterwave’s Disha acquisition",
    "summarized_story": "AdvertisementLendable, a UK-based debt financing company, typically gives startups between $5 million and $10 million in debt financing.\nYou can read all about it here: How UK-based debt financing company, Lendable, is providing equity-free financing for African startups.\nMFS Africa raises $100m Series CDare Okoudjou (Founder and CEO, MFS Africa).\nSource: Reloadly blogPan-African cross-border payments gateway, MFS Africa, has closed a $100 million Series C round, comprising $70 million equity and $30 million debt.\nFounded in 2009, MFS Africa connects mobile money systems to banks and other financial institutions."
  },
  {
    "headline": "Join Techpoint Africa as we virtually host Patrick Brown, Mayor of Brampton, Canada • Techpoint Africa",
    "summarized_story": "Share this article:Join Techpoint as we virtually host the Mayor of Brampton, Canada, Patrick Brown and his team for the Brampton Means Business Now: An Introduction to Brampton’s Innovation District Forum on Monday, November 15th, 2021.\nYou will also hear from four Nigerian tech companies active in the City of Brampton, talking candidly about their experiences and the role of the City in their expansion.\nThe City’s Economic Development Office is looking to engage with the Nigerian Tech community, businesses, start-ups and technology incubators on this mission.\nThis is an opportunity to showcase the best of Nigerian tech start-ups, exposing them to investment opportunities in Canada and possible collaboration and partnership with the Canadian tech start-up ecosystem.\nDate: Monday, November 15th, 2021Time: 4:00PM – 5:15PM WAT (10:00AM – 11:15AM EST)Techpoint Africa Website Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Cheap Nigerian stocks get insiders’ attention",
    "summarized_story": "Nestle SA, Stanbic Africa Holdings and a non-executive director at Access Bank are some of the insiders who have bought substantial shares in their companies this year.\n“The insiders buying the shares of these companies are doing so because they feel the stocks are undervalued,” says Johnson Chukwu, CEO of Lagos-based asset management firm, Cowry Assets.\nThe Switzerland-based Nestlé S.A, majority shareholder in fast moving consumer goods (FMCG) company, Nestlé Nigeria plc, has bought nearly N20 billion worth of the Nigerian unit’s shares this year alone.\nThe financial holding company has bought N1.48 billion worth of Stanbic IBTC shares in the last two months alone.\nOkey Nwuke, one of the bank’s non-executive directors, bought N13.9 million worth of Access Bank shares on November 3, according to data obtained from the Nigerian Exchange Group."
  },
  {
    "headline": "Soludo: Beyond the victory dance",
    "summarized_story": "For Charles Chukwuma Soludo of the All Progressive Grand Alliance (APGA), it is time for victory dance as victory songs rent the air.\nHe had, for several weeks, traversed the length and breadth of Anambra State, soliciting the people’s votes and enunciating value propositions for the state.\nSoludo, by his victory, has become the second CBN governor to be elected governor of a state.\nApart from making revenue collection more efficient and ICT-driven, Soludo proposes other sources of funds for projects – i.e.\nHe promised to change, develop, boost and transform Anambra State from a dominantly informal commercial state to a formal, productive, and competitive economy."
  },
  {
    "headline": "Investors see impact opportunities in Nigeria’s agribusiness, power sectors",
    "summarized_story": "“Power and agribusiness are the top sectors we’ll want to invest in.\nImpact investors have diverse criteria for selecting projects.\nAnother hurdle firms in Nigeria must overcome to get the needed impact investment is to be able to state clearly the problems they are addressing.\nAccording to the industry players, the ability to pitch the project in clear terms will go a long way to attract impact investors in the appropriate areas.\nImpact investors in Nigeria have also been faced with the challenges of finding easy ways to exit their investments across a broad spectrum of sectors."
  },
  {
    "headline": "Alaghodaro 2021: N69bn oil palm plantation investment in focus at summit, as more investors, businesses declare interests – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Big-ticket players in the oil palm industry, as well as smallholders and large-scale oil palm plantation investors, will on Friday, November 12, 2021, converge on Benin City, during the Alaghodaro Summit, to explore opportunities in the state’s rich oil palm sector with the aim of tapping into the N69bn facility provided by the state government in partnership with the Central Bank of Nigeria.\nOsagie continued, “The Alaghodaro Summit has proven to be one of the most strategic, high-impact discourses on investment in the country, as it has helped to crystalize a number of investment decisions.\n“This year’s edition promises to be even better as it will be providing a forum for investors in the oil palm sector to tap into the N69bn fund facility, knowing the economic impact on their businesses.\n“Already, the state is collaborating with PRESCO Plc on the development of high yielding oil palm seeds, through a technology called in-vitro culture that it intends to establish in Nigeria.\nThis and many more will be the focal point of this year’s Alaghodaro Summit.”..."
  },
  {
    "headline": "Obaseki celebrates Benin Archbishop Emeritus, Ekpu at 90, hails contribution to state’s devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has celebrated the Emeritus Catholic Archbishop of Benin, Most.\nPatrick Ebosele Ekpu on his 50th Episcopal anniversary and 90th birthday celebration, saluting his contributions to the development of Edo State and Nigeria.\nComrade Philip Shaibu and his wife, Maryann; Secretary to the Edo State Government, Osarodion Ogie Esq.\n; Chief of Staff to Edo State Governor, Hon.\nOsaigbovo Iyoha; the Esama of Benin Kingdom, Chief Dr. Gabriel Igbinedion; Former Deputy Governor of Edo State, Mike Ogiadomeh; Edo State Head of Service, Anthony Okungbowa Esq."
  },
  {
    "headline": "Obaseki appoints Ihenyen as Political Adviser, Edo Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… okays appointment of 21 SSAs, 51 SAsBENIN CITY – Following the harmonization of the Peoples Democratic Party (PDP) by leaders in Edo Central Senatorial District of Edo State, Governor Godwin Obaseki has approved the appointments of Princess Mrs. Philomena Ihenyen as Political Adviser (Edo Central) as well as Senior Special Assistants (SSAs) and Special Assistants (SAs) in the senatorial district.\nSecretary to the Edo State Government, Osarodion Ogie Esq., in a statement on Wednesday, announced the appointments.\nIn Esan West LGA, the SSAs include Charles Azekhuoria Ojo, Okoduwa Jennifer, Emmanuel Ekienabor and Osin Christopher Ikekekuamen, while the SAs in the LGA are Godstime Omozokpa Anenih, Orirewo Moses, Edoamen Lucky and Momoh Jesuzele.\nOther SAs in the LGA include Victor, Ogumenlen Mercy Itohan, Lucky Ebako Akhilomen, Aigberadion Stanley Irabor, Omoigberale Lucky Ehimen, Agunu Solomon and Irabor Austine Akhabue.\nThe newly appointed SSAs in Edo Central LGA are Clement Okoh, Sandra Igene, Ehizogie Shaka Momodu and Judith Uwoye, while the SAs include Gideon Ijieh, Veronica Ibharaghotu, Sandra Obeto, Michael Akhere, Mathias Aikore, Ogbole Eromosele, Ezomon Jeremiah, Ebesemegbe O. Elijah, Kenneth Osemenkhian and Iria Unity Oriabure."
  },
  {
    "headline": "Impeachment: Senate urges Plateau House of Assembly to abide by Rule of Law – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Senate has called on the Plateau House of Assembly to be guided by the Rule of Law and the Constitution in all legislative business.\nThe Senate said it was necessary particularly where and when it affects appointment and impeachment of a Presiding officer.\n“Majority of the members are opposed to the alleged impeachment and have pledged loyalty and solidarity with the speaker against those loyal to Sanda.\n“The Conference of Speakers of the 36 States have denounced the alleged impeachment and withheld recognition for Sanda.”The lawmaker said that an impasse and stalemate had arisen which if left unattended to, may degenerate.\nIf they were not, certainly that is something that the Senate, particularly, and the National Assembly in general, will not tolerate.”..."
  },
  {
    "headline": "Electoral Act: CSOs task Buhari on quick assent, support direct primary system",
    "summarized_story": "We will meet all of INEC’s demands,’ also entails a quick assent to the Electoral Act Bill that will be transmitted to the executive.\n“On the exclusive retention of the Direct Primary in the electoral bill, it is our considered opinion that this mode is also an aggregate of ward elections that produce delegates for the expensive, corruption-fraught and cumbersome indirect primaries.\n“In essence, our preoccupation at this point should be how to engage and strengthen the political parties to adopt open and transparent guidelines in the conduct of direct primary, which is capable of throwing up popular candidates.\n“We also acknowledge the opportunities the direct mode of primary could provide young people and women to contest on their own popularity and merit,” the statement added.\n-Adopt A Goal for Development Initiative-Center For Liberty-Raising New Voices-Youth and Students Advocates for Development Initiative (YSAD)– Ready To Lead Africa– Speak Out Africa"
  },
  {
    "headline": "Aston Villa appoint Steven Gerrard as new manager",
    "summarized_story": "OBINNA EZUGWUEnglish Premier League side, Aston Villa has appointed former Liverpool Captain, Steven Gerrard as their new manager on a three-and-a-half-year deal.\nGerrard who currently coaches Scottish top side, Rangers, leaves the club after three-and-a-half years at IbroxCommenting on his appointment, Gerrard said: “Aston Villa is a club with a rich history and tradition in English football and I am immensely proud to become its new head coach.\n“I would like to express my sincere gratitude to everybody associated with Glasgow Rangers for giving me the opportunity to manage such an iconic football club.\n“Helping them secure a record-breaking 55th league title will always hold a special place in my heart.\nI would like to wish the players, staff and supporters the very best for the future.”Villa are currently 16th in the Premier League table, two points above the relegation zone after 11 games of their campaign."
  },
  {
    "headline": "Southwest: Fanning the embers of religious bigotry",
    "summarized_story": "How can Northern Muslims claim to love Yoruba Muslims when even the illiterates and cretins among them detest Yoruba Muslims leading them in prayers?\nYet, Northern Muslims love Yoruba Muslims and will now defend them against their Christian brothers and sisters!\nCan we ever have another Yoruba Muslim closer to the Northern Muslim Establishment – in fact, ingrained into it – like MKO?\nIf Northern Muslims truly love Yoruba Muslims why, then, is the disgusting treatment being meted out to Bola Tinubu?\nThe Northern Muslims and their southern hirelings beating the drums of war for Yoruba Muslims do not mean well."
  },
  {
    "headline": "FEC approves N348.7tn investment for National Development Plan",
    "summarized_story": "Adebayo ObajemuMinister of Finance, Budget and National Planning, Zainab Ahmed, has disclosed that the Federal Executive Council has approved a 2021-2025 National Development Plan with an investment size of N348.7 trillion.\nMrs Ahmed noted that the five-year plan which succeeds the Economic Recovery and Growth Plan (ERGP) that expires in December 2021, is structured around six concepts including economic growth and development, infrastructure, public administration, human capital development, social development and regional development.\nAccording to her, the Federal Government will broaden the tax base and expand the capacity of the private sector through creating investment opportunities as part of a funding strategy for the plan.\nThe annual national budget will also be derived from the plan.\nThis development comes a few hours after the Senate approved President Muhammadu Buhari’s External Borrowing request in the sum of $16.23 billion and €1.020 billion."
  },
  {
    "headline": "Police uncover illegal military training camp in Lagos, arrest commander, 107 trainees",
    "summarized_story": "The Lagos State Police Command says it has uncovered a camp used by an illegal Military outfit known as Nigerian Merchant Navy, as training camp in the the Ogudu Stanfield area of the state.\n“In the course of interrogation, it was discovered that the Nigerian Merchant Navy also called the COASTAL DEFENCE FORCE has been operating illegally since 2005”.\nHe recalled that the Nigerian Merchant Navy has since been outlawed by the Federal Government and therefore, said it was illegal for anyone to operate such a military outfit and give military training to unsuspecting young Nigerians.\nIt, therefore, behoves us as a law enforcement agency to enforce such law banning activities of the illegal military outfit.\nEfforts are on to legalise the Nigeria Merchant Navy as obtained elsewhere in the world."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Invade Federal Varsity, Kill 1, Kidnap 2 In Niger",
    "summarized_story": "Some yet-to-be-identified gunmen on Wednesday evening invaded the Federal University of Technology, Minna, Niger State, killed one person and abducted two persons.\nHe, however, said security operatives comprising the police, local vigilantes and operatives of the Department of State Services (DSS) were already assessing the situation.\nHe said, “Unknown gunmen have attacked Futminna Off-Campus area (Gidan Kwano).\nThe gunmen came and started shooting.\nADVERTISEMENT“The gunmen kidnapped the son and daughter of a shop owner, a very big trading store in front of the school."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Invade Federal Varsity, Kill 1, Kidnap 2 In Niger",
    "summarized_story": "Some yet-to-be-identified gunmen on Wednesday evening invaded the Federal University of Technology, Minna, Niger State, killed one person and abducted two persons.\nHe, however, said security operatives comprising the police, local vigilantes and operatives of the Department of State Services (DSS) were already assessing the situation.\nHe said, “Unknown gunmen have attacked Futminna Off-Campus area (Gidan Kwano).\nThe gunmen came and started shooting.\nADVERTISEMENT“The gunmen kidnapped the son and daughter of a shop owner, a very big trading store in front of the school."
  },
  {
    "headline": "Kwara Poly Expels 29 Students Over Examination Malpractices",
    "summarized_story": "The management of Kwara State Polytechnic, Ilorin, has expelled 29 students of the institution for alleged examination malpractices.\nThe institution announced the expulsion of the affected students in a statement signed by Mrs Oluwakemi Opadiran on behalf of the Registrar, Mr. Kolawole Akande.\nThe statement added that the students who were found guilty of allegations of examination malpractices levelled against themwere expelled after the approval of the report of the Academic Board by the institution’s Governing Council.\n“Consequently, the Kwara State Polytechnic Governing Council considered the report of the Academic Board in respect of the case and approved your immediate expulsion from the polytechnic.\nADVERTISEMENT“Your expulsion is in line with the provision in the reviewed student’s information and regulations handbook 2019."
  },
  {
    "headline": "Kwara Poly Expels 29 Students Over Examination Malpractices",
    "summarized_story": "The management of Kwara State Polytechnic, Ilorin, has expelled 29 students of the institution for alleged examination malpractices.\nThe institution announced the expulsion of the affected students in a statement signed by Mrs Oluwakemi Opadiran on behalf of the Registrar, Mr. Kolawole Akande.\nThe statement added that the students who were found guilty of allegations of examination malpractices levelled against themwere expelled after the approval of the report of the Academic Board by the institution’s Governing Council.\n“Consequently, the Kwara State Polytechnic Governing Council considered the report of the Academic Board in respect of the case and approved your immediate expulsion from the polytechnic.\nADVERTISEMENT“Your expulsion is in line with the provision in the reviewed student’s information and regulations handbook 2019."
  },
  {
    "headline": "COREN Sets Up Fact-finding Panel On Collapsed Lagos Building",
    "summarized_story": "A panel to conduct inquiry into the unfortunate collapse of a 21-storey building in Ikoyi, Lagos, penultimate Monday, has been set up by the Council for the Regulation of Engineering in Nigeria (COREN).\nThe COREN inquisition panel comes on the heels of another panel set up last Wednesday by the Governor of Lagos State, Babajide Sanwo-Olu, shortly after he visited the site of the collapsed edifice.\n“I wish to applaud all those involved in the ongoing rescue mission at the site,” COREN President said.\nSubsequently, on behalf of the Council, I have constituted a COREN-Inquisition Panel on the collapsed 21 Storey Building at Ikoyi, Lagos State.\nADVERTISEMENT“(Amendment) Act, 2018, that empowers COREN to investigate Engineering Failures.”The panel consist of the following members: Engr."
  },
  {
    "headline": "Buhari felicitates with Mamman Daura at 82",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari congratulates Malam Mamman Daura as he marks his 82nd birthday November 9.\nIn a message to his nephew and close associate, President Buhari says no one deserves a happier birthday than Malam Daura, describing him “as a complete gentleman widely respected for his scholarly pursuits and rich intellect, famous for his master strokes.\n“May you be blessed with good health and happiness and continue to serve the nation.\nStay well and do the maximum for the country.\nGod bless you with long and healthy life.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari felicitates with Mamman Daura at 82",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari congratulates Malam Mamman Daura as he marks his 82nd birthday November 9.\nIn a message to his nephew and close associate, President Buhari says no one deserves a happier birthday than Malam Daura, describing him “as a complete gentleman widely respected for his scholarly pursuits and rich intellect, famous for his master strokes.\n“May you be blessed with good health and happiness and continue to serve the nation.\nStay well and do the maximum for the country.\nGod bless you with long and healthy life.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ikoyi building: Death toll reaches 46",
    "summarized_story": "Ten days after a 21-storey building collapsed on Gerrard Road, in the Ikoyi area of Lagos State, two more bodies have been recovered.\nThe recovery brought the death toll to 46.\nThe statement read in part, “Contrary to speculations, no directive has been given for the demolition of the two high-rise buildings standing at the site of the 21-storey collapsed building in Ikoyi, Lagos.\n“The operation at the site of the collapsed building continues.\nTwo more bodies were recovered from the site today (Thursday).” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ikoyi building: Death toll reaches 46",
    "summarized_story": "Ten days after a 21-storey building collapsed on Gerrard Road, in the Ikoyi area of Lagos State, two more bodies have been recovered.\nThe recovery brought the death toll to 46.\nThe statement read in part, “Contrary to speculations, no directive has been given for the demolition of the two high-rise buildings standing at the site of the 21-storey collapsed building in Ikoyi, Lagos.\n“The operation at the site of the collapsed building continues.\nTwo more bodies were recovered from the site today (Thursday).” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "I Became A Professor In My 30s, Achieved Everything I Wanted, Soludo Speaks About His Life Experience(VIDEO)",
    "summarized_story": "According to NEWS DIRECT, Anambra state Governor-Elect Charles Chukwuma Soludo stated that he accomplished everything he desired in life in his 30s.\nDespite being without a mother at such a young age, he thanked God for his accomplishments thus far.\nHe said;“I became a Professor in my 30s.\nI achieved everything I wanted to achieve in my 30s.\nI have travelled to 46 countries as a consultant or as a visiting Professor."
  },
  {
    "headline": "How Femi Osibona, Engineers Caused The Collapse Of 21-Storey Ikoyi Building — Survivor",
    "summarized_story": "One of the survivors of the collapsed 21-storey building in Ikoyi, Lagos has disclosed that they were working on a cracked pillar of the high rise building when it collapsed.\nThe survivor revealed to Premium Times from a hospital where he is still recuperating that the pillar they were working on was on the first floor.\nHe noted that the late Managing Director of Fourscore Heights Limited and owner of the building, Femi Osibona knew about the faulty pillar and their attempt to remove it and put a new one.\n“Suddenly we heard a noise, the thing (pillar) started to shake, I and Monday (another labourer) ran when we saw that the pillar was starting to shake.\nThe owner of the house (Femi Osibona) knows (knew) about the pillar, that it was cracked."
  },
  {
    "headline": "Doctors in Nigeria are being trained for free and will serve for nine years before leaving – Ngige",
    "summarized_story": "The Federal Government has expressed displeasure with some medical practitioners who leave the country after graduating from medical school without returning to serve the country (Nigeria) in which they were ‘for free’ at taxpayers’ money.\n“Medical education in Nigeria is almost free.\nIf you go to USA you pay $45,000 but if you go to the Ivy leagues, you pay $90,000 for only tuition, excluding lodging.\nIf government will train you for free, we should bond you.\nNgige explained that the waiver was granted by the government despite an embargo on recruitment into public service."
  },
  {
    "headline": "[JUST IN] Ikoyi Building Collapse: Death Toll Hits 45",
    "summarized_story": "As search and recovery operations near the collapsed 21-storey building on Gerrard Road in Ikoyi, two more dead were discovered on Wednesday, bringing the total number of casualties to 45, according to the Lagos State Government.\nThe recovery of the two bodies has brought to 45 the number of bodies retrieved from the site.\n“The identification of bodies of the victims of the incident has continued at Infectiious Diseases Hospital, IDH, Yaba, Lagos Mainland.\nIt comprises senior officials of the Ministry of Health and the Ministry of Justice.”However, the operation at the site of the collapsed building continued yesterday.\nVehicular movement around the site which had been chaotic for awhile has been smooth, following the reopening of the road."
  },
  {
    "headline": "Breaking: South Africa’s last white President is dead",
    "summarized_story": "South Africa’s last white president Frederik Willem (FW) de Klerk died on Thursday morning at his home in Cape Town, the FW de Klerk Foundation said in a statement.\n“Former President FW de Klerk died peacefully at his home in Fresnaye earlier this morning following his struggle against mesothelioma cancer,” the statement said.\nHe was 85 years old.\nDetails loading…"
  },
  {
    "headline": "Breaking: Aston Villa bring Steven Gerrard back to Premier League",
    "summarized_story": "Aston Villa have appointed Steven Gerrard as their new head coach.\nGerrard has departed Rangers, with who he won the Scottish Premiership last season, and signed a deal at Villa Park.\nOn Wednesday, It was reported that Gerrard was on the verge of becoming Villa head coach, following the departure of Dean Smith at the weekend.\nHelping them secure a record-breaking 55th league title will always hold a special place in my heart.\nHe guided the Glasgow side to two second-place finishes before delivering a first league title in 10 years in 2020-21."
  },
  {
    "headline": "Nigeria’s external loans: China tops with $11.8bn as Senate approves $16bn, €1bn",
    "summarized_story": "The Senate Wednesday approved President Muhammadu Buhari’s loan requests for the sum of $16,230,077,718 (USD) billion and €1,020,000,000 billion (Euros) under the 2018-2020 External Borrowing plan.\nGiving the breakdown, Ordia said the sum of $3,529,300,000 billion would be sourced from the World Bank; $5,078,441,252 billion from China EximBank; $3,902,267,260 billion from Industrial & Commercial Bank of China; $2,893,693,930 billion from China Development Bank; and $698,500,000 million from the Africa Development Bank (AfDB).\nHe expressed concern that the development constitutes a drain on the nation’s economy and limits resources available for national development.\nThe lawmaker stressed that the projects, which required additional financing, would have great multiplier effect on stimulating economic growth through infrastructure development, job creation, poverty alleviation, healthcare and improve the nation’s security architecture.\nWe have revitalised the economy by increasing investments in capacity building, health, infrastructure, women’s empowerment, climate change, and food security."
  },
  {
    "headline": "Senate Approves Buhari’s $16bn, €1bn External Borrowing Request",
    "summarized_story": "The Senate on Wednesday approved President Muhammadu Buhari’s External Borrowing (Rolling Plan) request in the sum of $16,230,077,718, and €1,020,000,000.\nWednesday’s approval was sequel to the consideration of the report of the Senate Committee on Local and Foreign Debts, as presented by the Chairman of the Committee, Senator Clifford Ordia.\nWhile many agreed with Senator Olamilekan, there were some who did not support the amendment of the NDDC Act.\nDeputy Senate President Ovie Omo Agege, who also was strongly against the bill, accused Senator Olamilekan of being a meddlesome interloper.\nAccording to Omo-Agege, Senator Olamilekan should pursue the development of the southwest development commission and not an amendment of the NDDC act."
  },
  {
    "headline": "FEC Approves National Development Plan 2021-2025 With N348trn Investment",
    "summarized_story": "The Federal Executive Council on Wednesday approved a 2021-2025 National Development Plan with an investment size of N348.7 trillion.\nMrs Ahmed noted that the five-year plan which succeeds the Economic Recovery and Growth Plan (ERGP) that expires in December 2021, is structured around six concepts including economic growth and development, infrastructure, public administration, human capital development, social development and regional development.\nThis development comes a few hours after the Senate approved President Muhammadu Buhari’s External Borrowing (Rolling Plan) request in the sum of $16,230,077,718, and €1,020,000,000.\nOrdia, while presenting the report, said the projects which funds are requested for in the 2018-2020 borrowing plan are ongoing.\nThe National Assembly had in July approved the sums of $8.3 billion and €490 million loans as initial requests."
  },
  {
    "headline": "Governors Not Afraid Of Direct Primaries – Yahaya Bello",
    "summarized_story": "Kogi State Governor, Yahaya Bello has said that governors are not afraid of direct primaries, amid speculations that some governors have determined the political fate of federal lawmakers from their states.\nSpeaking during an interview on Channels Television’s Politics Today on Wednesday, Bello dismissed claims that some governors dole our tickets to members of the National Assembly.\n“We as governors, I don’t think anybody is afraid of direct primaries.\nNo governor, not APC, PDP, or APGA – At least these are the parties that we have today,” Governor Bello said.\nOf the 21 states controlled by the APC, the governor explained that about six governors have problems with their senators."
  },
  {
    "headline": "Court Adjourns Kanu’s Trial",
    "summarized_story": "READ ALSO: Court Sentences Maina To Eight Years ImprisonmentThe IPOB leader told the court that Mr. Fein, who he said was handling a case for him in the US, was around to witness his trial.\nMeanwhile, counsel to FG, Mister Mohamed Abubakar, who is the Director of Public Prosecution, urged the court to proceed with the trial in the absence of Kanu’s lawyers.\nAbubakar told the court that ordinarily, the matter was fixed for a hearing of an application that was filed by the defendant.\nIn a short ruling, though Justice Nyako expressed her displeasure over the conduct of Kanu’s lawyers.\nShe also declined to dismiss the pending application and rather adjourned the case till January 19 and 20, 2022, for trial."
  },
  {
    "headline": "Anambra Election: Ikpeazu Congratulates Soludo, Commends Ozigbo",
    "summarized_story": "The Governor of Abia State, Dr. Okezie Ikpeazu has sent a message of congratulations to the governor-elect of Anambra State, Professor Chukwuma Soludo on his victory at the just concluded governorship election in the State.\nThe governor was particularly impressed with the magnanimous approach by the governor-elect, especially to his opponents at the last election, and urged them to work together for the good of the people of Anambra State.\nIkpeazu assured Ozigbo that in the nearest future, the seeds he has planted in the hearts of the people of Anambra State will “bear big fruits”.\nThe governor was of the firm belief that the place of Mr Ozigbo in the future leadership of Anambra State is assured and is only a matter of time.\nGovernor Ikpeazu said that he is proud to have led the campaign of the PDP in the last election and is even more proud of the performance of the party and their candidate in the election."
  },
  {
    "headline": "We have not given any order for demolition of Ikoyi buildings -LASG -",
    "summarized_story": "The Lagos State Government said it has not given any directive for the demolition of the two other high rise buildings at the site of the collapsed 21 Storey Ikoyi building.\nLagos State commissioner for Information, Mr Gbenga Omotosho, disclosed this in a statement signed by him in reaction to what he described as fake news and insinuations that the State government had issued such a directive.\nHe added that It is, therefore, wrong to assert or speculate that the buildings will be demolished.\nTwo more bodies according to Mr Omotosho were recovered from the site on Wednesday bringing the total recovery of bodies to 45.\nThe identification of bodies of the victims of the incident according to the State government has continued at IDH, Yaba, Lagos Mainland."
  },
  {
    "headline": "FEC approves National Development Plan to replace ERGP",
    "summarized_story": "The federal executive council has approved a national development plan worth 348.7 trillion naira, this plan from 2021 to 2025 and is a successor programme to the Economic Recovery and Growth Plan.\nThe estimated cost of the development plan will be contributed by the federal, state government and private sector.\nThe plan is structured around six concepts which include economic growth and development, infrastructure, public administration, human capital development, social development and regional development.\nThe minister of Finance, budget and national planning Zainab Ahmed told state house correspondents that this week’s federal executive council chaired by Vice President Yemi Osinbajo that the long term plan which is agenda 2050 will begin immediately after the launch of the medium term plan.\nShe says the public sector will contribute N49.7 trillion while the private sector will contribute N298.3 trillion."
  },
  {
    "headline": "Labour Minister, Ngige, congratulates Anambra Governor elect, Soludo -",
    "summarized_story": "The Minister of Labour and Employment, Senator Chris Ngige has congratulated the winner of the November 6, 2021 Anambra State Governorship Election, Professor Chukwuma Soludo of the All Progressive Grand Alliance (APGA).\nSenator Ngige, in a goodwill message by his Media Office congratulated the former Governor of the Central Bank of Nigeria (CBN) for a resounding victory in the poll, saying it is a victory well deserved.\nHe said, “Ndi-Anambra have spoken with this resounding victory.\n“It is a case in patience and endurance, an aspiration nurtured to serve the people with all his strength, I seriously believe.\nKnowing Soludo as I do however , I have no doubt that our people have made an excellent choice by voting him."
  },
  {
    "headline": "Peter Obi congratulates Soludo, calls for support from residents -",
    "summarized_story": "Former Anambra State Governor, Mr Peter Obi, has congratulated Professor Charles Chukwuma Soludo on his victory in the just concluded Anambra State Governorship election.\nIn a statement personally signed by him, he urged all residents of Anambra State to support the incoming governor, Professor Soludo.\nHe thanked Anambrarians who braved all odds and came out to perform their civic duties in the election.\nHe urged them to support the in-coming Governor through prayers and other legitimate means to see that Anambra returns to her former glory as the “Light of the Nation.”He also said he continue to commit the state into God’s hands for His will to be done at all times."
  },
  {
    "headline": "Poland Reports Violent Clashes Overnight as Migrants Attempt New Border Breach",
    "summarized_story": "Poland has reported at least seven migrant deaths in the months-long crisis and other migrants have expressed fear they would die.\nNeighbouring EU state Lithuania, which like Poland has imposed a state of emergency on the border, also reported new attempts to breach the frontier.\nread moreThe Belarusian authorities said more than 2,000 migrants were at the border.\nThey then travel to the border with EU members Poland, Lithuania or Latvia by taxi, bus or cars provided by human smugglers and try to cross.\nMost migrants use travel agencies across the Middle East which partner with Belarusian companies to book tourism packages that usually include visa, flight and accommodation."
  },
  {
    "headline": "Former South Africa President De Klerk Dies at 85",
    "summarized_story": "FW de Klerk, the last president of apartheid South Africa and a key actor in the country’s transition to democracy, has died.\nHe succeeded PW Botha as the leader of the National Party in February 1989 after Botha suffered a stroke and resigned from the party leadership.\nHe became president seven months later after Botha quit the post in anger and the National Party won a whites-only election with a reduced margin.\nThe 1993 Nobel Peace Prize was jointly awarded to De Klerk and Mandela, who became the country’s first democratically elected president the following year.\nHe testified at the Truth and Reconciliation Commission on behalf of the National Party in August 1996 and May 1997, where his apology for apartheid was criticised as insufficient."
  },
  {
    "headline": "Nigeria: In Fresh Attacks, Bandits Kill 16, Injure 13 in Katsina",
    "summarized_story": "About 16 people were reportedly killed in Katoge and Yanturaku communities in Batsari Local Government Area of Katsina State, following invasion of the area by marauding bandits.\nThe bandits, who launched the fresh onslaught on the communities at about 7:15pm Wednesday night, also left 13 other villagers with varying degrees of injuries as survivors scampered to safety.\n“The bandits came in large numbers with their motorcycles and started shooting sporadically, where they killed 16 people in Yanturaku and Katoge.\nState Police Public Relations Officer, Gambo Isah, said the bandits, armed with sophisticated weapons such as AK-47, killed only 11 villagers in both Katoge and Yanturaku communities.\nHe expressed worries that many farmers in the local government might not harvest their crops due to the activities of the fleeing bandits."
  },
  {
    "headline": "Nigeria Not Ruling Out Political Solution on Separatists Kanu and Igboho, Says AGF Malami – Arise News",
    "summarized_story": "While the federal government had been involved in legal battle with Nnamdi Kanu in Nigeria, it’s been battling to extradite Igboho from Benin Republic to face criminal charges.\nBoth Kanu and Igboho have been in the forefront of agitations for breakaway from Nigeria.\nBut some leaders from the two geopolitical zones have been seeking a political solution to the situation.\n“They have probated at a point in 2013 by way of submitting to judgment and then effecting payment over time.\n“So, as far as the payment is concerned, the office of the attorney general is not in any way involved."
  },
  {
    "headline": "Nigeria Ready to Cooperate with France to End International Criminal Networks",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Wednesday, expressed the readiness of Nigeria to collaborate with France to degrade international criminal networks.\nHe also appreciated efforts of the French President, Emmanuel Macron, in expanding opportunities for business between Nigerians and their French counterparts.\nNigeria and France have a wide scope to expand and deepen their relations.\n“On the business front, we welcome the personal efforts of President Macron to strengthen ties between Nigerian and French corporations.\nIt was during your visit to Lagos in 2018 that the French Nigeria Investment Club was established."
  }
]